{
    "Adoption of Resolutions Appointing Warren DeSouza and Gia Schneider as Members of the Mayors Economic Development Advisory Panel.": [
        "'speaker_0': 'Thanks, man. Thank you. Okay. Okay. So now I'm going to lay down some ground rules. We and we had some proclamations and we applauded and it was all well and fitting. That was the last applause that will be heard in this room if we want to get out of here before midnight.'",
        "'speaker_0': 'And trust me, we do. So what we're going into now is probably a lengthy item that will have a full and robust discussion. The critical IT in and I'm sure we have some public speakers for this night. So when we have that many, we rather than 3 minutes of speaking time you'll have to and things will move'",
        "'speaker_0': 'along faster if the clerk will call the names and everyone can get to the aisle and ready to speak. So with that, Madam Quick, will you introduce the item? Yes.'"
    ],
    "Introduction of Ordinance Approving a 33-Year Lease, with One 33-Year Option to Renew, and Authorizing the City Manager to Negotiate and Execute Documents Necessary to Implement the Terms of a Lease with the Carnegie Innovation Hall, a California 501(c)3 Non-profit Organization, for 2264 Santa Clara Avenue (the Carnegie Building) and 1429 Oak Street (Foster House). [Requires Four Affirmative Votes] (Community Development 001)": [
        "'speaker_3': 'Introduction of ordinance approving a 33 year lease with 133 year option to renew and authorizing the city manager to negotiate and execute documents necessary to implement the terms of a lease with the Carnegie Innovation Hall, a California 501c3 nonprofit organization for 2264 Santa Clara Avenue, the Carnegie Building, and 1429 Oak Street, the foster house.'",
        "'speaker_3': 'This item requires four affirmative votes.'",
        "'speaker_0': 'All right. And okay. City manager. Mr. Levitt.'",
        "'speaker_4': 'I was going to say, I think the person who's representing the Carnegie group was trying to get your attention.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Okay, wait. If you'd like to. Um, well, come up to the microphone. This is coming up to the microphone because we're being recorded and no one can hear you unless you speak to the microphone.'",
        "'speaker_8': 'I just wanted.'",
        "'speaker_2': 'To say that nearly everybody who.'",
        "'speaker_8': 'Put in a slip did not want to speak. They just wanted to.'",
        "'speaker_2': 'Just check off in favor of. But well.'",
        "'speaker_0': 'Here's the way it works. When we have that many speakers slips, it does limit people's times. Madam Clerk, do you suppose you could call the names and see if people really do want to speak? And that's what you want to let us know?'",
        "'speaker_0': 'Thank you. Yeah, it could be confusing, and I appreciate that. But we also have a rule about time of speakers. But let's see if we can figure out who wants to speak and who just wants to be counted as a supporter.'",
        "'speaker_3': 'Kim Hayes.'",
        "'speaker_0': 'You speak. So there's the speaker.'",
        "'speaker_3': 'Jay Marlowe.'",
        "'speaker_0': 'Motor City, and you want to speak.'",
        "'speaker_3': 'Okay. That's Jay Kravitz. Okay. Susan's very. You want to speak?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Uh, Lelia Gibson, little.'",
        "'speaker_0': 'She here? I can't even have her speak.'",
        "'speaker_2': 'Okay.'",
        "'speaker_3': 'Pat Lambourne. Okay. Ariel. Very Fox Village. You need to speak.'",
        "'speaker_2': 'Bob Dibble.'",
        "'speaker_3': 'I'd like to speak. Okay. Andreas Kluger.'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'You'd like to speak. Okay, so that gets us down to.'",
        "'speaker_2': 'One, two.'",
        "'speaker_3': 'Three, five wanting to speak, which is.'",
        "'speaker_0': 'Your time. This one up to 3 minutes, people.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Okay. That's how it works. Okay. Thank you for that. Thank you for that clarification. We still will start out with the staff report.'",
        "'speaker_2': 'Good evening, mayor and city council members. I'm Ninette Mercado in the Community Development Department. I am assistant community development director and Asset Management and I manage all of the city's real estate assets. And I had the great pleasure of working with Amanda Durkee in our department who led the, um, the process for the Carnegie.'",
        "'speaker_2': 'And I'm going to turn over the presentation to her.'",
        "'speaker_0': 'Thank you. Great picture of you on the cover of the Army, the Journal.'",
        "'speaker_2': 'Thank you. Good evening. So I'm here.'",
        "'speaker_9': 'Tonight to present the draft lease agreement for the Carnegie Building in the foster house. As most of you probably know, the Carnegie Building used to be the city of Alameda Main Library. It was funded by a grant from Andrew Carnegie and built in 1902 for a cost of just over $30,000.'",
        "'speaker_9': 'Together with the foster house, the Carnegie Building operated.'",
        "'speaker_2': 'As a public library until 1998, and it's been vacant since.'",
        "'speaker_0': 'Then.'",
        "'speaker_2': 'It's also important.'",
        "'speaker_9': 'To note that this is a historically important building for the city of Alameda, and it's listed on the National Register of Historic Places.'",
        "'speaker_2': 'So in 2018, City Council.'",
        "'speaker_9': 'Approved an RFQ to find a new tenant for the Carnegie Building in the foster house. The goal was to find an end user who would provide cultural, economic and or educational benefits to the Alameda community, who would restore and maintain the historic character of the building, who could provide for public use as frequently as possible, and who'",
        "'speaker_9': 'could demonstrate the financial resources necessary and the experience required to complete the restoration and operate the facility. The building does need a great deal of work to be.'",
        "'speaker_2': 'Reopened to the public. It needs new electrical heating, lighting.'",
        "'speaker_9': 'Sprinkler systems, additional restrooms, more complete disabled access, among other improvements. In 27, the city commissioned a report on the restoration and preservation of the Carnegie Building that estimated these costs at $4.7 million.'",
        "'speaker_2': 'A 2018 update of of those numbers.'",
        "'speaker_9': 'Put it at around $6.6 million. So through the RFQ process, the Carnegie.'",
        "'speaker_2': 'Innovation Hall team was selected.'",
        "'speaker_9': 'As the successful proposal based on a number of factors. One was the strength of their team. Their team leader, Michael Sturtz, founded and spent 13 years as the executive director of The Crucible in Oakland, which is a nonprofit industrial arts center.'",
        "'speaker_9': 'He's also an Alameda resident. Christopher Bentley is also on the team and he has a tremendous amount of experience in the restoration and preservation of historic buildings. You may be familiar with his work.'",
        "'speaker_2': 'At the former.'",
        "'speaker_9': 'Federal Reserve Bank in San Francisco. Their proposal included the restoration and renovation of the Carnegie Building, with all work to be done, according to the Secretary of the Secretary of the Interior standards with oversight and approval from our historic advisory board.'",
        "'speaker_9': 'Once the building is restored, they propose to open the Carnegie Innovation Hall, a nonprofit organization dedicated to the arts, education and innovation. They would hold workshops and classes on a wide range of.'",
        "'speaker_2': 'Topics and have been holding.'",
        "'speaker_9': 'A series of community meetings to try to identify the areas of most interested Alameda community. The exact programing is still in development, but one idea they're working on is the creation of a state of the art video production facility that could be used for anything from public broadcasting to YouTube content generation.'",
        "'speaker_9': 'In order to help subsidize the nonprofit, the Carnegie.'",
        "'speaker_2': 'Innovation Hall.'",
        "'speaker_9': 'Team also plans to rent out different portions of the space for private.'",
        "'speaker_2': 'Events things like.'",
        "'speaker_9': 'School proms, birthday parties and weddings.'",
        "'speaker_2': 'So with that, I'd like to provide an overview.'",
        "'speaker_9': 'Of the major lease terms. The length of the term is 33 years, with 133 year option to extend rent would be abated for the first three years to cover the cost of the restoration. Starting in year nine, there would be a four part what we're calling a for profit special event for.'",
        "'speaker_9': 'So this would be mean that 2% of gross revenue from the for profit special events would come back to the city after the first three $300,000 earned in year 34, the rent would be 2% of gross revenue, less any income taxes paid by the tenant.'",
        "'speaker_9': 'The workforce requirements include payment of prevailing wage and the commitment to negotiate a labor peace agreement. So I should note here that yesterday we received.'",
        "'speaker_2': 'Alternative language regarding.'",
        "'speaker_9': 'Labor peace from the Carnegie Innovation.'",
        "'speaker_2': 'Hall team. I have copies of that here and I'll read it.'",
        "'speaker_9': 'Right now as well.'",
        "'speaker_0': 'I think that was in the letter the city manager provided. Is that correct?'",
        "'speaker_9': 'That's that's correct. Okay. So the language is the project sponsor, their contractor. The city and the union shall collaborate on a prevailing wage job. This is the alternative language provided by the Carnegie Innovation Hall team. They shall, in good faith, identify and competitively bid to union, nonunion and local prevailing wage trades to the greatest extent possible.'",
        "'speaker_9': 'So we also put in a number of community benefits requirements in order to make sure that this building remains community serving over the life of the lease. I won't read this entire block of text now, but they include the number of people served by the organization, the number of courses offered, hours of operation, discounted classes for Alameda'",
        "'speaker_9': 'residents, and discounted rentals for Alameda community based organizations. And finally, we included a set of reporting requirements that would include monthly reports on applications for discounted community use, annual check ins accompanied by a report on program activities and finances, as well as a course catalog.'",
        "'speaker_9': 'And every five years, the tenant would have to provide a plan summarizing its program goals for the next five years. This would also be an opportunity for the tenant and the city to work together to adjust the community benchmarks if needed, based on any changes to their organization's goals and mission.'",
        "'speaker_9': 'So the staff recommendation is that the Council introduce an ordinance to approve the lease. This would bring significant benefits to the Alameda community, including a major financial investment in the historic Carnegie Building, resulting in the restoration of the building.'",
        "'speaker_2': 'It would provide public access to a building that has.'",
        "'speaker_9': 'Been vacant for 20 years. It would provide Alameda residents with discounted access to educational and arts programing, and it would provide a new arts and event rental space to serve as an anchor to our as another anchor to our downtown.'",
        "'speaker_9': 'So with that, my presentation is concluded and I'm happy to take clarifying questions now or wait until public comment.'",
        "'speaker_0': 'Thank you, Mr. Ricky. Does anyone, any councilmembers have any clarifying questions about the staff report? Is Shall we launch into public comment hearing? And then let's kind of have a go. Thanks, Mr. Ricky. Okay. Madam Clerk.'",
        "'speaker_3': 'First is Kim Hayes, then Jay Marlowe, smarter than Susan Sperry?'",
        "'speaker_2': 'Is it two or 3 minutes?'",
        "'speaker_0': '3 minutes. And I'm just be sure to raise the microphone up to your height and be sure to kick into it. Okay.'",
        "'speaker_2': 'Okay. There we go. So I just wanted to.'",
        "'speaker_8': 'Convey my sense of excitement about the renovation of this building.'",
        "'speaker_2': 'And I hope.'",
        "'speaker_8': 'We all know we're talking about the building right across the street from city.'",
        "'speaker_2': 'Hall. It's just centrally located.'",
        "'speaker_8': 'Really does have an opportunity to become a jewel of this city.'",
        "'speaker_2': 'I've worked up until about 6.'",
        "'speaker_8': 'To 8 months ago. I've worked with Michael off and on on some writing projects.'",
        "'speaker_2': 'So I've had a chance to get a real close look at a similar.'",
        "'speaker_8': 'Historic renovation that he has done. And that's why I wanted to convey my excitement mostly as a community member rather than someone that's been working with him a.'",
        "'speaker_2': 'Little bit off and on the building that I've had.'",
        "'speaker_8': 'A chance to see that he's renovated.'",
        "'speaker_2': 'Is, I believe, Edwardian. And it's just it's absolutely spectacular.'",
        "'speaker_8': 'And so it's not just a renovation that you'll get, but it's something that will.'",
        "'speaker_2': 'Be true to historic, historically accurate, to incredible detail. But on top of it.'",
        "'speaker_8': 'He and I'm sure this is imbued in his shows and the.'",
        "'speaker_2': 'Work he does, the the crucible.'",
        "'speaker_8': 'Just a sense of magic.'",
        "'speaker_2': 'And it's you have to see it really. I wish there was a way for you to see just the rooms that he's done. It's it's the the incredible historical detail.'",
        "'speaker_8': 'But beyond.'",
        "'speaker_2': 'That.'",
        "'speaker_8': 'A flair and a.'",
        "'speaker_2': 'Creativity that really captures hearts.'",
        "'speaker_8': 'And so.'",
        "'speaker_2': 'I just feel like it would be a loss.'",
        "'speaker_8': 'To not, you know, have.'",
        "'speaker_2': 'It really be here.'",
        "'speaker_8': 'In the city. And I think that it would be just a beautiful, fabulous thing for everyone to enjoy and take advantage of.'",
        "'speaker_2': 'I have a minute left. I know I don't need to use it, but yeah, I just I just really wanted.'",
        "'speaker_8': 'To come here tonight and convey my own personal excitement as someone who's been out and about in Alameda for over ten years now.'",
        "'speaker_2': 'And love this city. And I just love to.'",
        "'speaker_8': 'See it become a part of the.'",
        "'speaker_2': 'City.'",
        "'speaker_0': 'Thank you. And you brought your baby, right? Yeah. Thank you. Thank you very much. Our next speaker.'",
        "'speaker_3': 'At Jay Malo. Smarter than Susan. Very than Bob Devoe.'",
        "'speaker_2': 'Met a mayor, city council members and staff.'",
        "'speaker_8': 'I am Marlo Schmitter, representing Carnegie Innovation.'",
        "'speaker_2': 'Hall as deputy.'",
        "'speaker_8': 'Director and speaking on behalf of Michael Sturtz and the team. While Michael is out of the country.'",
        "'speaker_2': 'We are here to ask you to approve the lease in the spirit of what we negotiated over the past.'",
        "'speaker_8': 'Six months with.'",
        "'speaker_9': 'No further.'",
        "'speaker_8': 'Changes. This has been a difficult.'",
        "'speaker_9': 'Road our team bid on.'",
        "'speaker_2': 'And won the RFQ.'",
        "'speaker_8': 'Based on a specific set of requirements and our unique ability to fulfill those requirements.'",
        "'speaker_9': 'To create a state of the Art Center for Innovation.'",
        "'speaker_8': 'That pairs educational programing and entrepreneurship with.'",
        "'speaker_9': 'The arts.'",
        "'speaker_8': 'Performance, music and technology. We've reimagined Alameda Historic Carnegie.'",
        "'speaker_9': 'Library as a place where all.'",
        "'speaker_8': 'Are welcome to dream, learn and grow by design. Our community events and dialog.'",
        "'speaker_2': 'Revealed deep community support for this vision.'",
        "'speaker_8': 'We believe in this project.'",
        "'speaker_9': 'However, the process undertaken.'",
        "'speaker_8': 'By the City Staff and City Council has made this challenging.'",
        "'speaker_2': 'The goalposts.'",
        "'speaker_8': 'Keep changing. As recently.'",
        "'speaker_2': 'As today, just before.'",
        "'speaker_8': 'This meeting on issues regarding prevailing wages in union, labor, insurance and more, we are a group of volunteers working for no pay. We have done everything the city.'",
        "'speaker_2': 'Has asked, including.'",
        "'speaker_8': 'Meeting at the last minute with a union representative. We do not understand why the city feels it necessary.'",
        "'speaker_2': 'To add a play to.'",
        "'speaker_8': 'The lease agreement, despite the fact.'",
        "'speaker_9': 'That we.'",
        "'speaker_8': 'Already committed to writing in writing.'",
        "'speaker_9': 'To a.'",
        "'speaker_2': 'Prevailing wage job.'",
        "'speaker_8': 'And that any general contractor we hire will, by necessity and in good faith.'",
        "'speaker_2': 'Competitively bid.'",
        "'speaker_8': 'To union, nonunion and local prevailing wage.'",
        "'speaker_2': 'Trades. We ask that.'",
        "'speaker_8': 'The City Council.'",
        "'speaker_9': 'Approve a.'",
        "'speaker_2': 'Lease today.'",
        "'speaker_8': 'And swiftly move to sign that lease and thus allow us to promptly.'",
        "'speaker_9': 'Get to work.'",
        "'speaker_8': 'Fundraising and enacting this worthwhile project for the community.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_3': 'Susan's very involved about and Andrea's.'",
        "'speaker_2': 'Clearer. Good evening. Nice to see all of you. I want to express my joy in that we're having a renovation and creative project with the Carnegie and I have always respected Mr.. Carnegie and his. And I'm grateful and I'm sure other cities are grateful that he provided us with a lovely building.'",
        "'speaker_2': 'And I have been upset for years and have expressed this to you about it sitting there, empty, this beautiful building. Now, I have a personal experience with that library. I was I am a retired teacher, and I used that library to check out books to help my students, etc..'",
        "'speaker_2': 'I was making a trip to Kenya to view, of course, the animals, and I thought I would take a songbook along. I always had as taught English as a second language through the song. So anyway, I went to the Carnegie and the Children's Library and I found a paperback songbook.'",
        "'speaker_2': 'So I took it to Africa, to Kenya, and we were in a big, weird little bus, open air bus, and a storm came and the bus flipped over. So that night we were we only had a few loaves of bread and no chance.'",
        "'speaker_2': 'One tent, one tent. There were 15 people. So we had to make do around the fire. So I got out my book and we started singing these songs, simple American folk songs. Anyway, then the Maasai came by. They heard our singing, the Maasai, the Native people, and they came and they were fascinated by our singing.'",
        "'speaker_2': 'And then they started to jump in. I said, la la, la, la. And they, you know, started to jump. That's their, you know, thing anyway. So I, I, there were people from all over the world on this trip, Dutch, English, Hong Kong, whatever.'",
        "'speaker_2': 'And one of the parents said to me they appreciated me singing because that relieves the tension of this possible fado.'",
        "'speaker_0': 'Thank you so much. Ms. Very. And our next speaker is.'",
        "'speaker_2': 'Wife.'",
        "'speaker_3': 'Found and Andrea's Kluger.'",
        "'speaker_4': 'Hello. My name is Bob Tebow.'",
        "'speaker_0': 'When I raised the microphone.'",
        "'speaker_4': 'Thank you for allowing me to speak here. I first wanted to say I really believe deeply in this project. As I mentioned in the last meeting, my daughter, I can remember taking her to the Carnegie Library and would love to see that that building come to life.'",
        "'speaker_4': 'As much as I believe in this project, I really believe in the people behind it. I think we really have a unique opportunity with this group of people, not only Michael Sturtz, as other speakers have talked about, but the group that he brings together.'",
        "'speaker_4': 'I worked with him on the founding of The Crucible many, many years ago, and to see the group that he brought together there that brings a passion, that brings creativity, that in with volunteer efforts can pull together such an incredible organization.'",
        "'speaker_4': 'I really, honestly believe that there is no other group of people who could make this happen. But what I really want to emphasize tonight is how challenging this is nonetheless. This is a group that has to raise $6 million.'",
        "'speaker_4': 'That is a tremendous amount of money. Once they've raised that money and can rehabilitate the building, they need to run an organization that needs that is able to support itself. And we all know how difficult it is to run an arts organization.'",
        "'speaker_4': 'So we really have an incredible group that I think is capable of doing that. But what's been troubling is the process and how we seem to have lost the cooperative spirit a bit in getting this this project done with some last minute costs added to the program that just are hard to bear.'",
        "'speaker_4': 'In particular, the play stood out. We did meet with Andreas Kluger, who we applaud for for bringing good jobs to the city of Alameda. We share many of the goals that he has. So we want to work with Mr. Kluger.'",
        "'speaker_4': 'But what we really need to be able to do is move forward with the project we have and to the volunteers and the funders behind us. Not so that there is an open door for added cost. So we're hoping that the city will approve the lease, but along with it, the amendment that eliminates the play that was'",
        "'speaker_4': 'added at the at the last minute to the lease. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker we identified. Next we here is Mr. Clifford One Oak. Thank you.'",
        "'speaker_4': 'Good evening. Council members and city staff names Andreas Cleaver, secretary treasurer of the Alameda County Building Construction Trades Council. I was first made aware of this project over two weeks ago and actually immediately told city staff, We are open to sitting down with the organization to work out the issues regarding the use of union labor for this'",
        "'speaker_4': 'project. I in fact was contacted by Michael Sturtz about 11 days ago on the fourth. We had a brief conversation where I indicated to him, Let's sit down any time. Let's work out the issues. And finally, with the assistance of the city manager, we were able to sit down only on Friday, over a week later and watch'",
        "'speaker_4': 'with. I sat down with the board in a very constructive conversation around the project, and I indicated that we would be. Typically, when we have a private project like this, we do what we negotiate a separate agreement, which is an all union job.'",
        "'speaker_4': 'And I indicated that we would be more than willing to simply to allow the application of the city's existing project labor agreement, which allows for nonunion contractors to bid with their labor force on this project. They indicated a couple of years the areas they felt were challenging.'",
        "'speaker_4': 'We said we can accommodate specialty work. We can accommodate we can work out a good coordination with volunteer work. There was nothing there that seemed to be a challenge in working under the plate. It's a prevailing wage job.'",
        "'speaker_4': 'The cost is exactly the same. Prevailing wage and union rate is the same rate. They can use nonunion contractors. There's an issue with regards to use of local hire. I think that's something positive working with the Alameda Point Collaborative as part of the agreement.'",
        "'speaker_4': 'That's something that can be worked out. So I feel very positive coming out of there. I thought we had made a significant concession. You know, my concern and then we heard nothing back until late on Monday because I said, look, let's talk if there's issues, get a copy of the agreement.'",
        "'speaker_4': 'You can look over it. I never really got. There was some texting I did with one of the board members, but they never indicated there were any concerns and or problems. Again, spoke even today with the board member going over what some of the issues are.'",
        "'speaker_4': 'There is nothing in my and I've been doing this a long time, folks, dealing with lots of different owners, developers, contractors. There's nothing in my experience that we cannot work out in terms of the application of the citywide project labor agreement.'",
        "'speaker_4': 'Again, it is a prevailing wage job and my concern is and the language they presented is nothing. It's just simply it's a prevailing wage job. Sitting in good faith is what we're doing. If there is prevailing wage with no oversight, I have a real concern that there may not be actual preventing wages being paid on the job'",
        "'speaker_4': '. And that, I think, is a real issue of concern. So, again, my recommendation is include the requirement. There are still there's a few issues that we can sit down and work out. By the time the city manager executes the agreement will have those worked out.'",
        "'speaker_4': 'Again, there's nothing there that I feel would be a problem that we couldn't accommodate.'",
        "'speaker_0': 'Thank you. Thank you. Again, that was the last of our public speakers on this item.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Okay. Then we were going to close public comment and move to council discussion. Who would like to start? Well, then I'll speak at once.'",
        "'speaker_1': 'I'm just asking a.'",
        "'speaker_0': 'Question of the.'",
        "'speaker_1': 'Carnegie Project. Uh.'",
        "'speaker_0': 'Yeah. Yeah. And we have the ability.'",
        "'speaker_4': 'To be.'",
        "'speaker_0': 'You representative.'",
        "'speaker_1': 'Sure. Yeah. Hi. I. I'm just wondering if you can address the comments you just heard from Mr. Coover. That was. Is that your takeaway? Not the comments.'",
        "'speaker_8': 'About the comments about.'",
        "'speaker_9': 'The conversations that.'",
        "'speaker_2': 'We had? Yeah, absolutely.'",
        "'speaker_9': 'We thought they.'",
        "'speaker_8': 'Were.'",
        "'speaker_2': 'We think that we share a lot of values in common.'",
        "'speaker_8': 'As we wrote in the message to the city council, um. Sent on.'",
        "'speaker_2': 'Was that yesterday? Yes.'",
        "'speaker_1': 'Yeah. But he reflected that he felt that that the issues that were raised, that the answer was we can we can we can accommodate that as well. Were there additional issues that that that your project raised that you felt weren't addressed that required a difference in language?'",
        "'speaker_8': 'Our biggest challenge.'",
        "'speaker_9': 'Is that we are an all volunteer.'",
        "'speaker_2': 'Staff, and our.'",
        "'speaker_9': 'Ability.'",
        "'speaker_8': 'To fundraise for this project depends on.'",
        "'speaker_9': 'Our prospective.'",
        "'speaker_8': 'Philanthropic funders having confidence that this project will move forward. And there have been so many.'",
        "'speaker_2': 'Delays that we need to see action. We believe they need to see action.'",
        "'speaker_8': 'Promptly.'",
        "'speaker_2': 'For this to happen.'",
        "'speaker_8': 'Um, working out the details of a play.'",
        "'speaker_2': 'Um, I won't speak for Andrea's, but we.'",
        "'speaker_8': 'We are not.'",
        "'speaker_2': 'Familiar with the play.'",
        "'speaker_8': 'Other than just having received it and having.'",
        "'speaker_2': 'Scrambled to get the pro-bono.'",
        "'speaker_9': 'Legal.'",
        "'speaker_8': 'Counsel and.'",
        "'speaker_9': 'Other volunteer.'",
        "'speaker_8': 'Time that we needed to review it at the last minute.'",
        "'speaker_9': 'We feel like we don't know how.'",
        "'speaker_8': 'Long that.'",
        "'speaker_2': 'Will take to work out and that's where our concern lies. So that's why we'd like to.'",
        "'speaker_8': 'See the lease move ahead as amended. And, and.'",
        "'speaker_2': 'We're happy.'",
        "'speaker_9': 'To keep working together.'",
        "'speaker_8': 'But and.'",
        "'speaker_2': 'We think that our.'",
        "'speaker_8': 'Actions would be the same regardless of whether or not there.'",
        "'speaker_9': 'Is.'",
        "'speaker_8': 'A long, drawn out contract.'",
        "'speaker_2': 'We'd like to see everything move forward rapidly.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay. So I think that gives us some good information to tell somebody.'",
        "'speaker_5': 'I just have a couple of questions and maybe staff could answer. So there seems to be I think this is more for our staff.'",
        "'speaker_0': 'There's it's it's actually unusual that we have a back and forth like that. So we'll see if staff can handle it.'",
        "'speaker_5': 'So there seems to be some narrative out in the community about this process. I mean, could one of you or both of you kind of enlighten folks on, you know, how we actually go about property negotiations and, you know, who sets the terms and you know who has to sign off and that type of thing?'",
        "'speaker_4': 'Um, sure.'",
        "'speaker_0': 'And everyone, be sure to be close to your microphone so everyone can hear.'",
        "'speaker_4': 'I'll start and then you can tune in or Nat can tune in. So first of all, I just want to preface that this process started prior to not only my arrival, but also prior to this current council being on as a city council's.'",
        "'speaker_4': 'Two of the councilmembers sitting up here weren't city council members at the time that this process started. So I will go to sort of the end part of it and then go the way our ordinances and our charter work is that the city council is the final approval.'",
        "'speaker_4': 'City Council sets parameters, staff negotiates within those parameters, and that in this case it's a lease. So it actually takes a supermajority of the council, which is for council members. Um, I would say a nuance here different than some leases that the city does is that there was a RFQ or RFP process, which is a little unique'",
        "'speaker_4': '. Sometimes we don't always do that with leases. In fact, this may be one of the only times it was done with a lease. I think it's because of this unique project to try to see what interest there was.'",
        "'speaker_4': 'We we I guess we have done some other RFQ since I've been here. There's been a couple other projects where we've done RFQ, but that's not always the norm. So that that's sort of the the straight process. There's a lot of unique things that we went through on this.'",
        "'speaker_4': 'But, um, in the end that that's the process and then that may want to add a little bit to it.'",
        "'speaker_2': 'So in the case of this release, we spent a good portion of time negotiating an alloy. And for that, for the community, it's a letter of intent. And it's really where you spell out the terms, the term of the turn in terms of the least, if there's read, what's going to be required in the least document.'",
        "'speaker_2': 'And the the applicant was focused on taking the alloy. I assigned the live from the city to start fundraising. And one of our meetings I said, you're going to fundraise on a non-binding letter of intent, don't you need a lease?'",
        "'speaker_2': 'And so they said, Yes, we need a lease. So then immediately we were working, we changed. We shift our focus to try to get to a lease document. So in that period of time, we were focused on 1 to 1 product and then we changed to go to another product and lease negotiations do take time because we'",
        "'speaker_2': 'can conceptualize in a line, but when the lawyers put the language in the document, then people really it's real and they really get an understanding of what's being required. So when we talk about length of time, it was mostly in trying to get the negotiations the right way.'",
        "'speaker_2': 'And then the other piece of the lease was we had proposed different sorts of sort of rent structures. We tried a traditional rent structure and because of the fundraising goals that didn't work, we tried a percentage rent structure.'",
        "'speaker_2': 'And because because of fundraising goals, it didn't work. So we, we were doing different iterations of what this deal would look like until we could get to the final product or the product that's in front of you tonight.'",
        "'speaker_0': 'Thank you. That's helpful. And I can't get it. Please.'",
        "'speaker_4': 'I had one other thing that I forgot too, which is important in the RF queue. It did talk about that. So for instance, one component that they probably create, some of the length of the negotiation was that it ever requested that the applicants or proposers.'",
        "'speaker_4': 'That they could agree that the city was open to a short term lease or a long term lease and then defined by parentheses under long term was, I believe, 50 to 66 years. I believe in this case it's a 66 year which is on the long end of that RFQ.'",
        "'speaker_4': 'And based on that, that's a lengthy commitment by the city. And so I think that does bring out other issues and other other issues, as well as probably the length and the time of the negotiation.'",
        "'speaker_0': 'Thank you. Mr. Levitt. Did you want to continue, Mr. Rudy?'",
        "'speaker_5': 'What did the city attorney want.'",
        "'speaker_0': 'To the attorney Mr. Chang, please.'",
        "'speaker_1': 'I'll be very brief. I just want to summarize that the council has the ultimate authority to enter into a lease, any lease, including this one. And the council gives direction to staff and will ultimately make the final call on important terms in the lease.'",
        "'speaker_1': 'And the ultimate outcome of the lease. And the RFQ, while it's an important selection process, does not bind the Council and any particular term or applicant, and the council retains ultimate discretion here.'",
        "'speaker_0': 'Thank you. And I just want to interject quickly that similar to the Carnegie Board and this council member is a group of volunteers working very hard for no pay and we take our work very seriously. So did you and continue, Mr. Rudy?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_5': 'Thank you, Madam Mayor. I think the point I was trying to make sure came out here is there was no agreement at X days ago or whatever. I mean, the agreement, if there is one, will take place when the five of us vote and if four of us agreed to do that.'",
        "'speaker_5': 'So I don't know where this misconception got out there, but it's out there. So I hope that's that's that changes. I want to ask a question about there was a item brought up in public comment about insurance. I mean, can you talk about the risk to the city?'",
        "'speaker_5': 'Because this is going to be city owned property, I mean, regardless of how long the lease is. Right. So I know there's a lot of talk about volunteers and, you know, volunteers don't have insurance. You know, if if I go in and volunteer and, you know, build something and blow something up, then, you know.'",
        "'speaker_0': 'May I come in here to the insurance?'",
        "'speaker_5': 'So you kind of understand. Well well, I can defer to you if you want to if you want to ask about it.'",
        "'speaker_0': 'Well, and I will just maybe streamline a little bit. I, I think this is a very exciting project, but we also have a fiduciary duty to our city. This is a significant asset, notwithstanding the fact that it's been sitting vacant.'",
        "'speaker_0': 'So we need to make sure that this is a solid business deal and we understand, you know, volunteer labor and all the creativity. My two issues are the labor issue because the next item we're going to hear, three items combined have to do with a housing crisis and people having a hard time affording to even live in'",
        "'speaker_0': 'the Bay Area, including our teachers, artists, creative types. And so we we do need to make sure that people are properly compensated with the appropriate agreements and the insurance when is paid for me and I do understand from staff communication that insurance and increasing insurance limits is something that staff has discussed from the beginning and was told'",
        "'speaker_0': 'that we just can't afford higher limits. But this is very concerning to me because a building and the work that's about to be undertaken, if, you know, hopefully we can come to agreement, does have certain risks involved. This is a beautiful, iconic building.'",
        "'speaker_0': 'It needs to be protected. So with that, if I stayed on the street, we can see the city attorney to to give his input.'",
        "'speaker_5': 'Sharon, I think you framed it quite well.'",
        "'speaker_0': 'Thank you. Well, thank you, Mr. Sharon.'",
        "'speaker_1': 'And so.'",
        "'speaker_5': 'Mr. Levitt, either one. I mean.'",
        "'speaker_0': 'Anyone can jump out, although I will disclose it. The city attorney and I discussed the insurance issues just this afternoon and not for the first time.'",
        "'speaker_1': 'Yeah, well, I'll start and my colleagues can can chime in. So like many provisions of this lease, insurance is one provision that I think the city and the applicant has probably had many conversations about and perhaps we'll continue to have conversations about in some ways.'",
        "'speaker_1': 'The current proposed lease provides for an insurance that provides both property insurance. It also provides general liability insurance. I understand that there's been conversations about the coverage limits. The coverage limits in conversation had a wide range. I believe the current lease provides for 2 million in general liability.'",
        "'speaker_1': 'I believe the. Further provides a property insurance provision that does not that does not yet contain a particular limitation. And it also provides for a builders insurance, which contains a $1 million limitation. And and finally, I believe the current lease provision provides for the lessee paying the city and added insurance premiums on property insurance.'",
        "'speaker_1': 'And so these are the existing terms that.'",
        "'speaker_0': 'Were in and the change from year to year. The.'",
        "'speaker_1': 'That's right. And so certain provisions have a five year C five year market rate adjustment. It does not it is not insurance rates are not adjusted from year to year. And I don't believe every single provision has a a CPI adjustment, only one.'",
        "'speaker_1': 'And so I understand that staff and the applicant has had conversations about whether or not, for example, some of the coverages should be increase up to the improvement limit which the applicant is putting in 6 million. And whether or not 6 million is a more appropriate number for some of the provisions.'",
        "'speaker_1': 'And I further understand that there are some concerns with respect to costs associated with that. It's, of course, ultimately the council's decision to decide tonight how much insurance is appropriate for this building.'",
        "'speaker_0': 'Well, I think we would work with the city attorney's office, which includes the risk manager, and take direction from that. I don't I don't pretend to be an insurance expert, but I do think that we need to have adequate insurance.'",
        "'speaker_0': 'And I think the numbers I'm seeing are too low currently.'",
        "'speaker_5': 'I guess the fellow can't go.'",
        "'speaker_0': 'No council wrote. I'm sorry. Councilmember Desai I think.'",
        "'speaker_5': 'The follow up question to that would be, I mean, hypothetically, something happens. I mean, who pays out?'",
        "'speaker_1': 'And so that depends on what happens.'",
        "'speaker_5': 'So let's say there were I'm sorry. Let's say let's say there was a $6 million damage.'",
        "'speaker_1': 'Right. Let's say there is a fire during the construction phase. Worst case scenario, $6 million of improvements have been put in on a very last day. There is a fire and all of those improvements were lost under the current proposed lease.'",
        "'speaker_1': 'What would happen is that the applicants insurance would essentially cover the city's deductible. The city's insurance deductible is somewhere between 250000 to 1000000, depending upon the type of damage. And then after the million, the city's insurance carrier would kick in for the rest, which would obviously have some impact on the city's future insurance premiums.'",
        "'speaker_1': 'So it will be a it will be joint coverage at that point.'",
        "'speaker_5': 'But ultimately, our taxpayers would pay for our increased premiums.'",
        "'speaker_1': 'Yes.'",
        "'speaker_5': 'Okay.'",
        "'speaker_4': 'Councilmember Fine.'",
        "'speaker_0': 'So public comment is over. If there's an insurance expert who or.'",
        "'speaker_5': 'I trust our city attorney, I have one more clarifying question. Okay.'",
        "'speaker_0': 'Okay. I'm going to break press in a little, sir. Are you are you handling the I? No, no, no. I'm asking you a question. I'm asking you a question. Are you handling the insurance policies for this building? I didn't ask that question.'",
        "'speaker_0': 'I didn't ask you that. I asked you. May I ask the question and then I'll see if you can come up. Thanks. My turn. Are you handling the insurance policies? Securing insurance policies or discussing with the broker for this building?'",
        "'speaker_0': 'Come on up.'",
        "'speaker_1': 'Yeah. He's on the negotiations.'",
        "'speaker_0': 'And I'm sorry. Remind me your name again.'",
        "'speaker_4': 'My name is Bob Double. I'm sorry if I was rude there. I just wanted to make sure it was understood.'",
        "'speaker_0': 'It works best if you one person speaks at a time. And since I'm conducting the meeting, please listen to my question and then I'll call on you. You've got the floor now.'",
        "'speaker_4': 'Okay, I just I just wanted to say that in the RFQ, it had specific insurance requirements and we went out to procure exactly those requirements. When we looked at getting property insurance, we could not achieve a quote because no insurer wants to take a single historic building and provide a quote on that.'",
        "'speaker_4': 'What they will do is do a quote on a group of buildings. So we went back to the city and said, we're happy to reimburse the city for the property insurance, but that really needs to be secured by the city because it's just not possible on a single building versus a group of buildings.'",
        "'speaker_4': 'So if there is an.'",
        "'speaker_0': 'I mean, I just inject a question here. So you're happy to reimburse the city for the cost of the premium and the deductible.'",
        "'speaker_4': 'So that the deductible is covered by our liability insurance, which we have $2 million as required in the RFQ. And then the city's insurance would cover the greater loss. However, the cost of that insurance will be borne by the organization, not by the city taxpayers, as that is the key point I wanted to make.'",
        "'speaker_0': 'So so if a claim is made and the deductible first has to be met, your organization will cover that.'",
        "'speaker_4': 'Our insurers cover the deductible. The insurers for the city cover the larger claim, but we cover the premiums for that city insurance.'",
        "'speaker_5': 'And that really wasn't my question. My question was, if there's something if there's a casualty or a claim and our premiums go up, who pays for that increased premium? So that was the question.'",
        "'speaker_4': 'That is us. We are responsible to reimburse the city for the premiums for the property insurance, which we're unable to secure ourselves.'",
        "'speaker_0': 'For the increased premiums in the event that there is.'",
        "'speaker_4': 'And we pay that.'",
        "'speaker_5': 'I wouldn't say that in the least.'",
        "'speaker_0': 'But is that in the least?'",
        "'speaker_5': 'I think you're saying you're paying if if you're part of our pool and it costs us an extra, you know, let's just say $1,000 a month, you'll pay that. But in the event of a casualty or a claim, the thing burns down has to be rebuilt and our rates go up.'",
        "'speaker_5': 'You're not telling us you're going to pay for that increase.'",
        "'speaker_4': 'If that affects the whole city's rates? You are correct. We are simply covering our our share of that specific building as covered by the city's property insurance.'",
        "'speaker_5': 'So you are right. Mr. Shen.'",
        "'speaker_0': 'Okay, let's give us a minute to hear from the city attorney. Why don't you stay up here for just a minute? We might we might have another question. Mr. Chen.'",
        "'speaker_1': 'I think I think we are generally in agreement. The the place where we differ is that when there is a claim, our overall property portfolio's insurance rate goes up across the board. And that is where this lessee would not be obviously covering us for our over across the board increases that would that would happen if there was'",
        "'speaker_1': 'a fire that caused $6 million of damage.'",
        "'speaker_0': 'And that's the part that the taxpayers bear.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Thank you. Do you have any suggestions for how to address that?'",
        "'speaker_4': 'I do not. There's no way.'",
        "'speaker_0': 'And you need to speak into the microphone so we can capture what you say. And the answer is no, you don't.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Okay. Thank you. I think I have one more question. One more question.'",
        "'speaker_5': 'Okay. So on this this thing that we just got, this proposed language, I mean, it seems a little wishy washy to me. I mean, what what does that actually commit? Commit the project sponsors.'",
        "'speaker_0': 'May I ask a question of you? How would you make that language less wishy washy?'",
        "'speaker_5': 'Well, I think what we have in there now would be pretty good or using the city's language, which does provide a little more flexibility. But I guess my question is, what are they committing to by signing this? Anything?'",
        "'speaker_0': 'And who would like to take it? Turn it? They're drawing straws to see who has right to this.'",
        "'speaker_5': 'They work well together.'",
        "'speaker_0': 'One of you or both of you? Mr. Shay.'",
        "'speaker_1': 'It is my understanding that the commitment is for a prevailing wage. Only.'",
        "'speaker_5': 'Only a good faith identify and competitively bid. That's kind of that's not an ironclad. Commitment. Right. I mean, all you got to do is say, well, what we tried in good faith.'",
        "'speaker_0': 'The councilmember, they said, did you want to say something?'",
        "'speaker_2': 'Okay. Well.'",
        "'speaker_5': 'I'll just leave it at that.'",
        "'speaker_0': 'Okay. We heard you, Mr. Eddie. Who else would like to say something? Mr. Desai? Councilmember Desai.'",
        "'speaker_6': 'Oh, great. Well, thank you very much. I think we can all agree as a community, whether you're here tonight or watching on television or perhaps subsequently reading about this in the local newspapers, that we want to bring the Carnegie back.'",
        "'speaker_6': 'And I think we set up a process starting in 2018 to that end. And it seems as though the process was quite clear from the outset with regard to the RFQ that and that there has been some changes, unfortunately, or maybe some miscommunications that unfortunately hadn't been clarified until here we are in the fall of 2019.'",
        "'speaker_6': 'But when I look at the RFQ, you know, I look at a process that is clear in terms of what we expected of people who or entities that were going to bid on this project. We set out a we asked for seven elements within.'",
        "'speaker_6': 'With regard to the statement of qualifications that each proposal was supposed to speak to, they were supposed to, for example, speak to the project team, the concept of their proposed use and previous experience in doing a project like this.'",
        "'speaker_6': 'Item number four was What's their restoration plan? And number five was financial qualifications. Number six was operations plan, and number seven was community benefits. In addition to bringing this building to life, how would this benefit the community? So the request for qualifications or RFQ was pretty clear in terms of what we expected of people who were going'",
        "'speaker_6': 'to submit responses to the RFQ. More interestingly, the RFQ also identified a selection process, and through that process there were going to be two selection criteria, two rounds of selection criteria. So we weren't just going to look at one and we weren't just going to look at entities in one swoop.'",
        "'speaker_6': 'But we were going to take our time and to make sure that we do two levels of analysis. And when we in each of those rounds, we looked at, among other things, issues of financing, design and construction operations.'",
        "'speaker_6': 'So each of the rounds we were looking at, for example, financing. So it seems to me that we're suddenly dealing with these issues with regard to what's called the play in a substantive manner now that perhaps we could have dealt with, you know, from the outset in early 2018.'",
        "'speaker_6': 'Or perhaps we're dealing with issues with regard to insurance requirements that, as Mr. Devoe had indicated, was detailed discussed leading up to today. But. But there seems to be some new issues with regard.'",
        "'speaker_0': 'May I just I want to just correct a misstatement. There is no insurance requirement in the RFQ.'",
        "'speaker_6': 'Oh, I know, but but they had indicated that they would talk about.'",
        "'speaker_0': 'The statement and I typed was the RFQ had specific insurance requirements. I think there might be some confusion but I'm I'm just re read the RFQ. Yeah. But just just didn't want the public to be misled. They're not saying that.'",
        "'speaker_6': 'They they had testified as to discussing insurance issues. So. So it is what it is. So the the concerns.'",
        "'speaker_0': 'That I have I'm sorry. The city manager has his hand up. I'm going to defer to him, Mr. Leavitt.'",
        "'speaker_4': 'To add either clarity or confusion, I'm not sure yet.'",
        "'speaker_0': 'I we call them you guys.'",
        "'speaker_4': 'It was discussed in June and July. Insurance requirements. I have not found the provision in the RFQ that was referred to. So I'm like the mayor. I'm not sure where that's being referred to.'",
        "'speaker_0': 'If I'm missing something, you.'",
        "'speaker_4': 'Can in July.'",
        "'speaker_0': 'Pointed out.'",
        "'speaker_4': 'The staff level.'",
        "'speaker_0': 'At a staff level. Okay.'",
        "'speaker_6': 'And the play wasn't in the RFQ either, is that correct?'",
        "'speaker_0': 'Miss McIntyre, did you want to add something? I, I did this thing where I read in expressions and you get mildly horrified. So I just.'",
        "'speaker_2': 'Thought, sorry about that. The insurance provisions came up as part of the yellow I. That's the standard provision that we discussed. So that's where that came from.'",
        "'speaker_6': 'It was the play part of the RFQ itself, and.'",
        "'speaker_2': 'There was a play question during the RFQ process. And at the time the response was that there was not a play required for the project. But throughout the throughout the the RFQ, there is language that says that the council has the last say on what happens.'",
        "'speaker_2': 'And so, I mean, with every lease the council has the last say. I mean, you've edited leases from the dyas before. So this is not okay. I know.'",
        "'speaker_6': 'But but it was but it was expressed that a play was not.'",
        "'speaker_2': 'There was a question about that. Yes. And at the time the response was prevailing wage would be required.'",
        "'speaker_6': 'Because I believe that seems to be the the bugaboo here is that, you know, the the costs associated with play. And I don't think it's really the cost because it sounds as though that they're updating the prevailing wage.'",
        "'speaker_6': 'And so to the extent that they're opting the prevailing wage, whether it's union or nonunion workers, the cost more or less will be the same. It might be administrative.'",
        "'speaker_2': 'Issues that that people are concerned about with regard to.'",
        "'speaker_6': 'The play. I mean, is it is it true that it's like a 20 page document? Do we know how many pages that deal with?'",
        "'speaker_2': 'I'm not familiar with the PSA. Most of my projects have not yet have not had to be subject to them, which is changing. So, no, I don't know. And the city manager should feel free to add to that.'",
        "'speaker_4': 'Well, I'll. I'll wait.'",
        "'speaker_2': 'A while.'",
        "'speaker_6': 'I guess I'll just.'",
        "'speaker_0': 'Tell them.'",
        "'speaker_6': 'That. I'll just finish by saying. To me, it seems as though we had a process that was clear in what we as a city were looking for on behalf of the residents of Alameda who want to see the Carnegie restored.'",
        "'speaker_6': 'And we found a certain number of respondents from which one or two came to the top. And out of that, we selected this entity who appears to have a professional background in regards to putting together performing arts centers and as part of their team members professional backgrounds in terms of restoring buildings, perhaps of historic architectural character.'",
        "'speaker_6': 'To me, it just seems as though it's not just honoring the process, but honoring what the community and the residents expect of bringing back a jewel like the Carnegie in the best of all worlds. Let me just end up by saying, in the best of all worlds, we would have Andrew Carnegie coming back and writing a check'",
        "'speaker_6': 'for $10 million. But, you know, we all know that's not going to happen. And we all know that, you know, this is, you know, our best stab at bringing back the Carnegie. And if this nonprofit doesn't survive through the process or isn't given a chance, a fair chance to survive.'",
        "'speaker_6': 'The process. And what are the chances of anybody else surviving through the process? Because anybody else is going to have the same insurance questions and the same play questions. So, you know, I'm satisfied that the process has been served and the public has been served and that we have had adequate vetting and that we should start moving'",
        "'speaker_6': 'about and finally finalizing the contract and dotting our I's and crossing our t's.'",
        "'speaker_0': 'Thank you. Councilmember de so did Mr. 11 Administration want to add anything or should I go into the next house?'",
        "'speaker_4': 'Mr. Leavitt I guess I'll just add one thing, and I understand what Councilmember De Saag is saying, but I will say, and I totally respect where the applicant or the proposer is, I understand that they felt the process was in a certain way.'",
        "'speaker_4': 'I'm not sure. I again, I came in halfway through through the process. But I will say, when you look at the RFQ and you look at what happened again, I go to the years and term and said short term, which is in my mind usually five years or less or under our ordinances, three years or less to'",
        "'speaker_4': 'long term, which it defined in parentheses as 50 to 66, and they want the long term. So when you start talking about different conditions, a lot of things come in and out of those discussions. Now, maybe communication could have been better.'",
        "'speaker_4': 'I'm not going to disagree with that, but. But there's a variety of things. And again, we come back to it's ultimately the council's decision. And I will say on the labor peace part of this agreement, what the condition is, is that they would come back.'",
        "'speaker_4': 'With whatever their agreement is so they can come to an agreement before tonight. You gave latitude that they could come back with something that would satisfy the council a later date, as long as it's before construction. I understand that if I were on the U.S. side, I'd probably want certainty, a certain level of certainty.'",
        "'speaker_4': 'But that is a provision that was to try to create some flexibility in the provision.'",
        "'speaker_0': 'Councilmember Vela.'",
        "'speaker_9': 'Since we're and.'",
        "'speaker_0': 'Everyone's be close to your microphone.'",
        "'speaker_9': 'And I apologize, I was listening in. I have a four month old at home who is cutting his second tooth. So. But I was listening to the the comments and conversation. I do want to address this issue of labor peace.'",
        "'speaker_9': 'I think it's kind of ironic considering that Andrew Carnegie is also known for the homestead strike in which it was there was a bloody unrest that we're now having this conversation, that irony is not lost on me. So I don't necessarily wish that the man would come back.'",
        "'speaker_9': 'I think that that money was earned on the backs of workers who literally died. That said, I do think that there is an issue where, you know, saying that there's this issue of labor peace. It's not a 20 page document.'",
        "'speaker_9': 'It is literally Section 4.18 in the proposed lease. It is one paragraph long. And I would like to know, I guess, what is so objectionable to the statement that the parties agree that it is in the best interests of the project, that the construction work proceed in a safe, orderly and expeditious manner through the use of skilled'",
        "'speaker_9': 'workers to ensure that the work is done in a high quality manner. And specifically, Councilmember de SAG. We've had conversations. You know, I think generally as a council about how important some of these historic buildings are and how important it is to maintain them, and that the work be done in a manner that is is not going'",
        "'speaker_9': 'to risk the building. And I think some of the things that some of my colleagues up here have expressed have reflected around making sure that this jewel of the building is, in fact, preserved, and that we want to make sure that the work and the construction on it is done in a way to preserve the historical attributes'",
        "'speaker_9': 'of the building. And, you know, for the applicant, you know, this is going to go before our historic advisory board. This is going to go before our planning board. It's not just that, you know, here we're going to agree to this lease and then there's no more oversight.'",
        "'speaker_9': 'There's actually the secretary of the interior standards are going to apply. There's going to be a lot of things. And to that end, I think at least what I'm looking for in this language in section 4.1.8, is that we make sure that, again, that the work is done in a safe, orderly and expeditious manner.'",
        "'speaker_9': 'I think essentially the proposed language, I think what rubs me wrong is that it essentially accepts the section 4.1.4 prevailing wages, which is actually the longer section, and then rejects this other section and specifically rejects language that I think is very important and I thought was something that the entire council had cared about.'",
        "'speaker_9': 'I also think that what we're looking for is that there are conversations around making sure that workers, again, Councilmember Desai said, well, if they're paying prevailing wage, I think the concern is worker misclassification, which can often happen where contractors are saying somebody is an apprentice when they're actually a journeyman.'",
        "'speaker_9': 'We want the most skilled workers working on this project. We want to make sure that the building does in fact remain intact. And I think on buildings such as the Carnegie that are this old, a lot of the improvements are going to be things that people don't necessarily see.'",
        "'speaker_9': 'Those are going to be the most costly improvements. Right. The retrofitting, things that don't necessarily have to do with the beautification of the building, but the functionality of it, making sure that the electrical is up to code and and done well, the foundation, things like that.'",
        "'speaker_9': 'So I think there is a lot of work being done here. I think that the term as drafted by the city would allow for pro-bono skilled labor to be to be, you know, something that could be negotiated over.'",
        "'speaker_9': 'But it's still you know, this is a seven city building. And so ultimately, it's our discretion whether or not to approve the lease. And I think that that was made clear in the RFQ.'",
        "'speaker_0': 'Okay. Thank you. Vice Mayor. Next wait.'",
        "'speaker_2': 'Minutes.'",
        "'speaker_1': 'So thank you very much, everybody, for coming out. I appreciate this. This, I think, has been a frustrating process for all of us. And I think it's unfortunate because I think this is a very exciting project and one that I've been excited to see move forward and whatnot.'",
        "'speaker_1': 'I you know, I'm going to say I think some mistakes were made on all sides. I think what we're seeing tonight is the result of what happens when you bring negotiations on the public and allow Facebook cop Facebook comments to start driving conversations.'",
        "'speaker_1': 'It puts people in different camps and I make my hope would be in the future that we can learn from this mistake and, you know, kind of have good faith negotiations together behind closed doors. And, you know, as as they're meant to be, so that we can come to agreement and and celebrate when we're when we're coming'",
        "'speaker_1': 'together on leases. That said, I'm not here to chastise one side or the other. It's clear that the Q&A said something about plays without ever checking in with the city council. And then when it finally did, I mean, what I will say in defense of my council colleagues, regardless of what side they are, we talked about this'",
        "'speaker_1': 'contract for the first time four weeks ago. We had no say so at the end of the day. Unfortunately, there were a lot of discussions and I can imagine that it felt very frustrating to feel like you were coming to the end for a you know, everybody will say hooray and we'll be there in two weeks in'",
        "'speaker_1': 'this thing will get signed. But unfortunately there were comments and whatnot. And, you know, we need to be better as a city in identifying the process and the timelines the RFQ said will be signed in June. It was reasonable to expect that you'd be signed in June.'",
        "'speaker_1': 'That may not have been a reasonable timeline, but it was a reasonable expectation. So I'm sorry on my behalf for that. I am heartened, regardless of the comments that are being set up here, that what I heard as one of the big sticking points around the project laborer projects, PSA play, I heard both sides stand up and'",
        "'speaker_1': 'basically agree that they've met, they've talked and they actually don't have any disagreements. They're concerned about the time it will take to sign that agreement. What that gives me hope is regardless of how we move forward tonight, whether we change language or whether we keep it, and I, I think that we probably don't have the votes to'",
        "'speaker_1': 'change it if there were people who wanted to. I think we can probably find both sides committed to making sure that we get a signed agreement that works for everybody really, really quickly. It doesn't have to be a really long process.'",
        "'speaker_1': 'And that's what I heard is the sticking point. So I just want to put that out there. I think if we all if this moves forward, I think if we all if we all commit to that and and I will ask or offer to help in any way I can we can get there again.'",
        "'speaker_1': 'I think, unfortunately, getting lost in this, we're in the weeds of of a contract. Thank you, sir. We're in the weeds of a contract, which is not always very fun. And yet here we are talking about a very exciting project that I think everybody up here will be excited to see happen.'",
        "'speaker_1': 'And my interest is figuring out a way to get us there as quickly as possible, because I would like to see this project open. But yeah, there may be some conversations that still need to happen.'",
        "'speaker_0': 'Okay, so I'm going to haven't had a chance.'",
        "'speaker_5': 'To comment so I can do those after.'",
        "'speaker_0': 'Yours. Yes, you can. Thank you. Okay. We're here now. We've spent a lot of time listening to this. Let's see if we can come to an agreement. This is what I'm hearing and I think what might be possible.'",
        "'speaker_5': 'But I haven't said anything, so don't assume what you're hearing.'",
        "'speaker_0': 'So. So if I could just finish my comments and I will see the floor to you. Okay. Okay. Thank you. So I think it is important to pay prevailing wage. And I could not agree to a contract that doesn't that doesn't agree to that.'",
        "'speaker_0': 'I'm glad to hear you had a good conversation with Mr. Clever, and it doesn't surprise me. He's a very reasonable person to work with, and I know he's also met with our city manager. My question would be how to verify that prevailing wage is being paid.'",
        "'speaker_0': 'And for that I would defer to folks who are more experienced in that field. And the other thing is the insurance part is is important. And it wasn't in the RFQ, it was part of the negotiations. I wasn't in any of the negotiations.'",
        "'speaker_0': 'But the report back I heard was that it was something that was pushed back against and pushed back against. And that's certainly the prerogative of of the applicants. But as a councilmember, I want to know that we feel that we are adequately insured.'",
        "'speaker_0': 'So I would want those assurances there. I, I don't disagree that this whole process could have been done better, but I don't really see any a lot of benefit in sitting here and and, you know, regretting how things happened.'",
        "'speaker_0': 'I think this council is already in the process of changing some processes going forward. So we we avoid some of these situations because we do want to be fair to both sides. I mean, a lot of people have come together and put their time into this project, and we respect that.'",
        "'speaker_0': 'At the same time, as the city manager has said the least, that is being asked for and that we might agree to is 66 years altogether in the first 33 involve no payment of rent. I mean, admittedly, there's this $6 million that will be put into it, but there's there's still a lot of moving parts to be'",
        "'speaker_0': 'established. But so with that, I think that I would would like each side to recognize that we all have our valid concerns and those are mine. I want to see that prevailing wage is paid and I want to see that the insurance amounts are adequate.'",
        "'speaker_0': 'And beyond that, I think the council has spent a lot of time in close session with some of the conditions that will come up later at these various approvals for the use of the project. And as I think my council colleague, Councilmember Vela noted, there are still more approvals.'",
        "'speaker_0': 'I mean, the planning board, the historic advisory board probably in the reverse order, but and the Secretary of the Interior, whatever it is. But I would like to see if we could roll up our sleeves and figure out a way to move this forward instead of taking this can down the road.'",
        "'speaker_0': 'But let's see what we've got killed somebody. You want to tell me how you disagree with everything I just said?'",
        "'speaker_5': 'No, I just thought before you. Summarize what we say. It would be great to hear from all of us. But moving on.'",
        "'speaker_0': 'To something I said. Moving. Thinking for myself.'",
        "'speaker_5': 'Moving on.'",
        "'speaker_0': 'Your turn.'",
        "'speaker_5': 'So I too want this project. But I also want this project. So that means I want it to be successful. And I want it to be successful in the renovation. And I want it to be successful in the operation.'",
        "'speaker_5': 'And the operation is as an arts and cultural center, not as a wedding venue. And there was I think there was an article posted on the Internet on one of the blogs yesterday stating there are some concerns about that.'",
        "'speaker_5': 'And I just got a chance to look at the performance today. So really haven't had a chance to, like, dove into them. So, I mean, there are some concerns. So I'm going to take a little a little risk on that.'",
        "'speaker_5': 'But. I think people need to understand that, you know, one, as was clear, clearly pointed out, this is the body that makes the final decision. So it was a little bit disconcerting that there was a lot of noise on social media.'",
        "'speaker_5': 'So moving moving forward from that, there's this language about good faith that gives me a little heartburn. And one of it one of the things I have heartburn over is we're supposed to have a good faith negotiating process on this lease.'",
        "'speaker_5': 'And yet a couple of weeks ago, we started getting bombarded by people coming here and we couldn't speak about it. And there was falsehoods and and things put on the Internet and on Facebook and people getting riled up.'",
        "'speaker_5': 'And there was demonstrations. Everyone has a right to speak. But, you know, we're trying to enter in a relationship with someone that we trust with one of our jewels and jewels of our community. And we want to make sure as a council that we trust that person to fulfill the vision that we all have and that the'",
        "'speaker_5': 'community all has. And that was all shared. And when we're supposed to be bargaining in good faith and negotiating in good faith, and then one side decides to negotiate via Facebook, then to me that's not good faith. So and then I see this again.'",
        "'speaker_5': 'I look at good faith, and I got a chance to share and it's public information if anyone wants it. The cost estimate on the renovation where the $6.4 million came from and it came from a contractor, I think the name is Body Construction and they have labor claims against them.'",
        "'speaker_5': 'So when I see a language that says all we're going to do is good faith, yet their estimate and maybe they never go with that person, that's fine. But you know, the person that's giving them that number that we're supposed to rely on, you know, it was already being accused.'",
        "'speaker_5': 'And I understand if you're accused, you're not guilty of anything. But they've already been accused of violating labor laws. So I will say to that point, though, the best way to ensure compliance with prevailing wage standards is to have a play.'",
        "'speaker_5': 'So I think it's kind of a win win for everybody. You know, two quick final points. I mean, I'm not going to get into like what was said and what meeting and what was in the RFQ and so on.'",
        "'speaker_5': 'But we do have a citywide play. So I think going forward, staff should put that in RFQ and should understand that when there's Q&A sessions, that it's not that whether it applies or not applies that we have one as a city for our public projects.'",
        "'speaker_5': 'And it could or could not be subject based on the discretion of the council. So that's my suggestion there. I mean, the deadline for coming to an agreement is when construction begins. And that's quite a long time, if I understand correctly.'",
        "'speaker_5': 'Right. So it's we're not saying that you have to do this in a week or two weeks or even a month. So I think there's enough flexibility in that paragraph as it's written for 18 or even adopting the city, the city place tender, which is even more, I guess I would say liberal or loose that the parties'",
        "'speaker_5': 'should be able to do this. But I'd like to see this done. We just opened the high school, which by the way, was also done under a play. And it is beautiful and it's amazing. And I think we deserve to give our community another amazing project right next to it.'",
        "'speaker_5': 'And I hope this group can do it. I would be willing to vote for this lease as it is, make no changes as a gesture of trust to them. But I got to say, you know, so far I have a little pause, but I'm going to take a little risk.'",
        "'speaker_0': 'Thank you, Councilmember J. So I wanted to say something.'",
        "'speaker_6': 'Well, I just wanted to quickly.'",
        "'speaker_0': 'Post your mike, please.'",
        "'speaker_6': 'Yeah, I just wanted to quickly say that, you know, whatever the outcome of tonight, I really hope that the proponents of the Carnegie Innovation Hall continue to stay the course and try to to work things out with with all the different stakeholders that have been mentioned tonight.'",
        "'speaker_6': 'So I know it's kind of difficult right now, but I hope you really stay the course, whatever the outcome of tonight's decision.'",
        "'speaker_0': 'Okay, Councilmember Vella.'",
        "'speaker_9': 'So I think that I'm I'm in support of the vision of this project. I'm in support of what I think our hopes, all of our hopes collectively are for it. I do think that I did initially have a lot of concerns.'",
        "'speaker_9': 'I still do have concerns of how financially it's going to work out in the long term, especially relative to it essentially becoming a glorified event center. I think that that is a concern. I think that there's going to be but I think it's addressed in the lease.'",
        "'speaker_9': 'That's that as proposed. I think staff did a really good job around kind of. Shoring that up. And it's not to say that I don't I don't think that the project proponents were intending on that. I just. Who knows how things are going to be in ten or 20 years?'",
        "'speaker_9': 'As the city manager mentioned, this is a back and forth. And one of the things that I personally was concerned about was the duration of the lease. I also just don't I normally don't like long options. I think if we're going to give a big option to me, at least for for, you know, that's giving a lot'",
        "'speaker_9': 'of value to the tenant and we're the landlord. And so giving a lease option that's three years, in my opinion, is, is a big give. And I understand why the applicant wants that. I'd be amenable to it, but there's something that I want in return and that has to do with the language in section 414 and 418'",
        "'speaker_9': '. And so, you know, to me, that's the trade off. I also think that, you know, I don't want a a project where, you know, somebody gets injured on the job or that we have people that are working on this historic building that aren't, you know, qualified to do it and something happens.'",
        "'speaker_9': 'And I think that that goes to to the insurance question. So I'd like to go ahead and make a motion to do that. We approve the lease as written and that. Madam Mary, thank you. Your concerns about the insurance are are valid.'",
        "'speaker_9': 'I think that that comes at a substantial cost to taxpayers. And so I'd be amenable to that additional direction if you would like.'",
        "'speaker_0': 'What I would what I would, I guess, add as a friendly amendment is that I would ask the staff to work with the Carnegie folks to just make sure that the concerns that I think almost all of us expressed.'",
        "'speaker_0': 'For insurance protection and protection of the city are met. Um, I don't think we need to micromanage that and. Okay. So do you. Do we have, um.'",
        "'speaker_5': 'Madam second.'",
        "'speaker_0': 'Let's see. I okay. So, yeah, that's your position. Even Mr. Zinn.'",
        "'speaker_1': 'Yes. On the insurance provision, given that the council's direction appears to be relatively broad, what the Council be amenable to, to approving with modifications to the insurance provision as to its adequacy as ultimately approved by the city manager.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'Yes. Second report. I would second.'",
        "'speaker_0': 'That. Good. Yeah. Okay. So you would second the motion.'",
        "'speaker_5': 'With your.'",
        "'speaker_0': 'Amendment as as restated by the city attorney. Okay, so we have a motion second and discussion. Councilmember Desai.'",
        "'speaker_6': 'Yeah. Madumere I would like to honor the request made by the proponents by replacing the language that's in there right now with regard to the play with the language that was provided with us tonight through this handout. That's a that's the residents had requested that.'",
        "'speaker_6': 'And I believe that the professional team is substantial and I'm confident that they can do the job.'",
        "'speaker_0': 'Are you offering a motion?'",
        "'speaker_6': 'I am.'",
        "'speaker_0': 'Is there a second? Hearing, then the motion fails for lack of a second. So we have a motion on the table discussion. Vice Mayor Knox.'",
        "'speaker_1': 'Thank you. I'll be really brief. I'll be voting for this motion. I think it's an exciting motion. Again, I just want to go back to what I heard was the two parties that need to have a discussion saying that they're not that far apart.'",
        "'speaker_1': 'Anything we can do, I'm going to just you know, and I know you have concerns and you're driven. So I'm looking over the building trades, whatever we can do to sit down and, you know, I know you'll work in good faith.'",
        "'speaker_1': 'I bumped into Mr. Cleaver at a at a after one of our meetings when it became when it came out into the open that this was one of the issues. And so we discussed it briefly. And my takeaway, I came back and called the city manager and I said, I don't think this is going to be a'",
        "'speaker_1': 'problem. I think they really do want. He lives in town. I think he understands the project. I think they are going to sit down and work and work really hard. And so whatever you can do to commit to helping them get to, you know, I know we're giving them to ten construction hours.'",
        "'speaker_1': 'I hear your concerns about the fact of wanting and wanting certainty for your for your funders. So whatever we can do to knock something out really, really quickly so that if you have problems, you can come back and talk to the city manager quickly as well anyway.'",
        "'speaker_1': 'And I'm sure you have partners up here on the dais who would be willing to help in that way as well.'",
        "'speaker_0': 'I think probably we are giving that one to staff to work on, but I know they've been working hard on it already. Okay. We have a motion. We have a second. All in favor. I opposed. I abstained. Okay.'",
        "'speaker_0': 'So the motion passes for two one. So. Well, then. Thank you, everyone. Okay with that, I'm going to take a five minute break before we move on to our next three combined items. Thank you. Manager. What do we do with the city manager?'",
        "'speaker_2': 'I'm to make him.'",
        "'speaker_1': 'Make the motion to separate them.'",
        "'speaker_0': 'In a minute. Let's get back to.'",
        "'speaker_1': 'Where my head.'",
        "'speaker_4': 'Is. Cake.'",
        "'speaker_0': 'Okay. For the third time, would everyone please take their seats? That means everyone, please take your seats. Thank you. Okay. We are going to resume. I've had a couple of requests for further agenda changes, counsel. So when I have counsel's attention, I'll resume.'",
        "'speaker_0': 'Okay. My requests were we have an item that is currently last on the agenda. It's six G and authorization of a five year agreement with Ranger Pipeline for the cyclic cyclic sewer replacement project. And that was just a concerned calendar item that got moved to regular agenda because of the price.'",
        "'speaker_0': 'But we have a request to just let it be heard now quickly, because we don't think it's very long. That's one request. Hold that in mind. And then the other was Miss Potter. Debbie Potter says that she believes it would.'",
        "'speaker_2': 'Be.'",
        "'speaker_0': 'A little smoother if we combined to the two housing authority related items, which is six D and nine A. But to hear the the of 60. No, no we know this is Debbie is saying rather than have all three of them heard together the one that has to do with the rent ordinance just changing the temporary and'"
    ],
    "Consider Directing Staff to Present Options to the Council on Increasing Accountability of, and Addressing Potential Conflict of Interest Issues at, the Alameda Housing Authority.  (Councilmembers Vella and Oddie)": [
        "'speaker_3': 'This item was placed on the agenda at the request of councilmembers A.D. okay.'",
        "'speaker_0': 'And so I'm six. Is being presented by the then skipper.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'And I'm thinking there's maybe a different slideshow.'",
        "'speaker_2': 'Yes, I'm forgetting it. I'm sorry. There goes now.'",
        "'speaker_8': 'So Mayor and city council members. I'm Vanessa Cooper. I'm the executive director of the Housing Authority of the city of Alameda. We're very happy to be here tonight to give you an opportunity to tell you. Many of you already know the many things that we're doing.'",
        "'speaker_8': 'And to talk a little bit about the activities of the housing authority and some of our processes. The first thing I want to do is to tell you a little bit about the housing authority. So, um, so as many of you know, we have a housing authority that's been around for a very long time, over 75 years'",
        "'speaker_8': '. It's governed by a board of commissioners, a number of whom are here tonight. They are seven Alameda residents, two of whom are tenants. They're appointed by the mayor and approved by the city council. And I report to the Board of Commissioners.'",
        "'speaker_0': 'So I am going to ask for quiet in the audience, please. Thank you. Yeah.'",
        "'speaker_8': 'So one of the things I want to do at this point is really to acknowledge the board of Commissioners and the staff. I'm going to talk about lots of things that we have done, particularly in the last seven years, but also over more time than that.'",
        "'speaker_8': 'And what I want to tell you is that the board of Commissioners and the staff are committed to this mission statement. So we provide quality, affordable housing, we encourage self-sufficiency. And we're really looking at community inclusiveness and diversity in housing.'",
        "'speaker_8': 'What I'd like at this stage of the city staff and the housing authority staff and commissioners could just raise their hands.'",
        "'speaker_0': 'Actually do stand up so we can see you. And I want to thank the especially the board, because you, again, are these stalwart volunteers. So thank you all for being here and staff who I know are very hardworking.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_8': 'Well, thank you to them, really, to for us to be able to put this presentation together tonight. We have four main business areas. You'll hear a little bit more about this as I go along the section eight program, otherwise known as the Housing Choice Voucher Program.'",
        "'speaker_8': 'Property management, housing. Developments of building new housing and the city housing programs. What I want to do is to tell you how they're funded, first of all, because sometimes this is a little bit misunderstood. 80% of our funding comes from federal funding, as you can probably imagine.'",
        "'speaker_8': 'A similar proportion of our oversight and regulation and reporting also comes from the federal government, primarily from HUD. We get about 10% of our funding from the city. That includes the rent stabilization program and a subsidy that runs out in 2026 for Independence Plaza.'",
        "'speaker_8': 'That's the 4% to the bottom. So these are our key achievements since 2012. And that's not to say we didn't have hundreds of key achievements in the 60 something years before that. But I really did want to focus on this period since independence.'",
        "'speaker_8': 'We are categorized as a HUD high performer. We've been there for five years. It's not a small feat. And with that, we've received a number of multiple oh, so our number of national housing awards. And one of the things we're really proud of, and I know the rent staff are going to talk about this later on, but'",
        "'speaker_8': 'is the rent stabilization program or the rent program? You've had many meetings on this. It's a good program that we work with the city on. Last year alone, we resolved about 300 landlord tenant disputes. We also have developed 51 new units of affordable housing.'",
        "'speaker_8': 'That's Everett Commons and Littlejohn Commons. And this has a cost of 38 million. But I want to tell you, that's really an investment of 38 million into Alameda, into jobs that we brought to Alameda. That's money that we raised from other sources.'",
        "'speaker_8': 'We have worked with the city, particularly with Debbie Porter and the other staff, to secure the land at North Housing. I think this is about the most exciting, affordable housing project in the whole Bay Area. Really, when we're looking at 500 or so units, we're creating a neighborhood, and I think that's something that we are really excited'",
        "'speaker_8': 'to work with the city on. We have expanded the Section eight funding by 40% and that's in seven years. That's an increase of an annual $12 million investment in Alameda. And then one of the things I'm most proud of or proud is perhaps not the word, but grateful for the staff for doing is to serving is serving'",
        "'speaker_8': 'homeless veterans in Alameda. I want to make a special mention now. I can't give you their name, but there is one landlord who will take all our homeless veterans and she works with them every time, whatever situation they're in.'",
        "'speaker_8': 'And it really is a huge benefit to us and to them. We don't just build housing for ourselves. One of the things I see as the mission of the housing authority is not just for us to make new buildings or to rehab our current buildings, but it's to help other affordable housing developers in Alameda.'",
        "'speaker_8': 'So we've been really pleased to issue project based vouchers to City. A couple of years ago. We did the first project and a couple of weeks ago we did the second project, which is really exciting. The next thing and really what I see is an accomplishment for the staff and really a benefit for the tenants is that'",
        "'speaker_8': 'we've established free voluntary social services and I'm. To come onto this a little bit longer, a little bit later. Our social services provider, Life Steps is here. They work with all our households. And as you can see from the numbers, they're working with them often on a daily basis.'",
        "'speaker_8': 'Similarly, in terms of self-sufficiency, we've from our self-sufficiency program, we've had 17 graduates earn over $200,000. They can use that for school or work. One day I got a check request for a car and I'm like, Who's buying a car?'",
        "'speaker_8': 'And actually what it was is it's someone who's graduating from the program and needed a car to go to work. And so those are the types of things we're trying to do to help with self-sufficiency. And then again, with the assistance of the city and the school district, we have a unique partnership which takes funds that the'",
        "'speaker_8': 'school district are supposed to develop or is supposed to is the wrong word, but dedicated for the school district to use for housing. And we have partnered with them to house school district employees at Rose Field and Everett Commons.'",
        "'speaker_8': 'And I think this is so important. We really want our school district employees to live and their families to live where they work so that they can really be focused on the work they do. The last point, and I really do think this is a credit to the staff and it's frankly, this number has not actually changed'",
        "'speaker_8': 'even before seven years ago is our customer satisfaction survey. So we survey tenants, we survey Section eight participants and Section eight landlords. And for the last seven years we've had an 89% satisfaction rate which, you know, we're in the business of providing services.'",
        "'speaker_8': 'We can't meet everyone's satisfaction. But I would say being close to 90% year after year is pretty good. So I talked a little bit about resident services. As you know, we're not just about housing. We are in the business of housing.'",
        "'speaker_8': 'We're in the business of people keeping their housing, maintaining their housing and growing in their housing. And these services are there to help people thrive. They help to help people when they hit non housing challenges, a loss of a job, perhaps a health crisis, a family crisis.'",
        "'speaker_8': 'And so not only do these provide essential services, they actually bring great things to our properties. So the food bank come to us and run. What we have is a farmer's market. It's not a food bank delivery. There are tents up.'",
        "'speaker_8': 'People choose their own food. We also have residents who participate as volunteers, and that's been really beneficial. We're very happy with our partnership with the Boys and Girls Club, which is a very long time partnership. We know that after school program is essential for all our families of all incomes, and we have a number of other services'",
        "'speaker_8': 'here, including legal services. We work with the City Police Service. We do transit. My personal favorite is the International Children's Reading Room. For those of you who haven't visited, we converted a laundry room. It's beautifully colored. We had books donated by the community.'",
        "'speaker_8': 'The officers will come and read there. It's really a great opportunity to see what's happening at Esperanza. Yes. Yes, at Esperanza.'",
        "'speaker_0': 'I've been there.'",
        "'speaker_2': 'Yes.'",
        "'speaker_8': 'So I think perhaps I should say that the Alamo does actually relatively unusual in having a housing authority for a city this size. There are some cities that have that, but we actually serve proportionately more than many cities of our size.'",
        "'speaker_8': 'So in the Section eight program, we have about 1500 households. I want you to bear in mind as we go through the presentation, about 64% of them are headed by a senior or somebody who is living with disabilities.'",
        "'speaker_8': 'And we certainly have a more diverse population than the city of Alameda and the county at large. Similarly, in our units, we have over a thousand families living. So I mentioned you saw where the money comes from and the money comes through grants and contracts and other arrangements.'",
        "'speaker_8': 'But with every type of money or service requirement, there are obligations and regulations. And so what you see here is a number of areas where we are accountable or where we partner with individuals. So clearly HUD at the top three or four different state departments.'",
        "'speaker_8': 'And we have contracts with the county of Alameda. We work regularly with Congresswoman Barbara Lee's office and then certainly with the city of Alameda, citizens, staff and elected officials. And then our board. So our board meets every every month there's public session.'",
        "'speaker_8': 'The board members can be contacted directly as well. And we have something and if you don't mind me doing a small pitch that I think it's important for people to know we have a resident advisory board. Now you have to be a Section eight participant to be in this.'",
        "'speaker_8': 'But we are always looking for members on what the Resident Advisory Board does is help us set our five year plan and our one year plan. And I really would encourage people who want to have more involvement in the housing authority to volunteer.'",
        "'speaker_8': 'You'll see our public notices going out next month. You can talk to any of the staff here, but we would love to have your feedback and your input. So one of the things I also like to say is the housing authority is different, perhaps from some other organizations.'",
        "'speaker_8': 'We are working with low income families. We're working with people who may well have disabilities or may be seniors. And we have a number of obligations, and that includes fair housing laws. Sometimes we have to say no to people and they don't really understand.'",
        "'speaker_8': 'It's because we have to be fair with everyone. We have to have equal access. We have that means that we have to apply those laws fairly. We can't make a side agreement with one person or another. We also have privacy laws.'",
        "'speaker_8': 'And I heard Mr. O'Reilly talk about perhaps when the council has been in a bind and not been able to comment on things, we have exactly the same problem. So what we have is that tenants clearly and their advocates can talk in public.'",
        "'speaker_8': 'The housing authority is not able to respond. In fact, it's our duty to protect those people's privacy. They can sign a release of information form. And we have those here. We you know, we're happy to release information if we get that release, but otherwise, we're not going to be able to comment on specific cases tonight.'",
        "'speaker_8': 'A number of other areas, we provide free translation. So if you have someone coming in saying that they're not able to access our services, the languages, please let us know because we we can we can fix that. And then we provide a reasonable accommodation, modifications and accommodations for people who are domestic violence victims.'",
        "'speaker_8': 'And you can see a little bit about the appeal process later on. Like the city and like other government agencies, we produce a lot of reports and we have a lot of opportunities for coming back to us with information.'",
        "'speaker_8': 'There's just a list here. I really would encourage anyone who's interested to come at least a one of our monthly board meetings. It's tomorrow night at 7:00 in case in case you don't need another night at home. And it's very easy, for example, to sign up for our newsletter on the website.'",
        "'speaker_8': 'There are multiple ways you can get involved. So looking now at the Section eight housing choice voucher program, often known as Section eight, this is our largest program. We are reliant on the private market landlords. And I really do want to use this as an opportunity to thank the about 400 landlords who house our tenants, and many'",
        "'speaker_8': 'of whom have housed the tenants for over 15, 20 years. They generally are the same landlords doing this and they really have been committed. We do have 75 voucher holders who are looking for housing. So if there's anyone who wants to sign up, the staff will will take that information.'",
        "'speaker_8': 'But this is something that's in high demand. You can see we opened the waitlist in 2015. There were 32,000 applications. We took 750. Just a reminder, this is our federally funded program and it is subject to annual appropriations.'",
        "'speaker_8': 'So it is somewhat of a stomach churning.'",
        "'speaker_2': 'Right. Every year.'",
        "'speaker_8': 'We don't always know how much we're going to get. We have massively increased the amount that we get per unit, primarily because of the rents going up. But we had to fight for that. We had to do rent studies at excessive cost, but we are pleased.'",
        "'speaker_8': 'That's partly why we have so much more money coming in and has allowed us to keep a significant proportion of people housed. But we do have funding challenges. The program is underfunded administratively. It's subsidized by the rest of the housing authority.'",
        "'speaker_8': 'And we have been through budget shortfall one year and then the following year government shutdown. But as you know, we were lucky enough to manage that with no impact to our clients or the landlords. So one of the things I like to think about is if we're not careful, we talk about money and rules and eligibility and'",
        "'speaker_8': 'it's important for us to think about what housing does and the stability that housing can bring. And we did the survey with Section eight participants. The one I'm particularly moved by is the Affordable, the one at the bottom.'",
        "'speaker_8': 'Affordable housing has improved our standard of living. And then this is the part I like best. It has even improved the relationship between the people and our family, and those are the kind of benefits we're looking for. Those are the kind of things that our staff come to work every day for some of the reasons those resident'",
        "'speaker_8': 'services that we listed, which are all voluntary, we don't have to do those as a housing authority, but we do those because we know that's what keeps people housed and that's where we get this type of growth, the same kind of growth we're looking for in our own families.'",
        "'speaker_8': 'So on to affordable housing development. And I know housing developments in general has been a topic that the council seems to have been talking about forever. We are really pleased to be able to expand this. The affordable housing in Alameda.'",
        "'speaker_8': 'We have this map where you can see we have 29 parcels, most of which have housing on right now. And our goal is to make quality neighborhoods and real communities. We're not just looking at housing. I'm going to go through these fairly quickly because many of you have seen this.'",
        "'speaker_8': 'But this is Littlejohn Commons, opened in 20. 18, and it serves low income seniors. Another investment into Alameda, $20 million of total investment and lots of prevailing wage jobs in the process. Everett Commons serves low income families and formerly homeless veterans, again up on $19 million of investment.'",
        "'speaker_8': 'Really is a beautiful project and one that we are very grateful for. The work of some of the councilmembers, some of the neighborhood members to really fit into the style of the neighborhood. At Independence Plaza, we recently completed a $2.5 million rehab.'",
        "'speaker_8': 'This rehab was entirely focused on ADA upgrades. We've got a few more to finish, but we were able to convert 20 of the units to full ADA, which is really important because what we're actually seeing is our residents needing more and more assistance.'",
        "'speaker_8': 'Roosevelt Village. This is the point at which I'd like to thank the vice mayor. I think I'm the only person in town, not just in Alameda, but in the Bay Area, who says, I went to the planning board and actually I asked for 80 units and they asked for 92 where really the vision of Alameda and the'",
        "'speaker_8': 'commitment of Alameda both at the city council level and the planning board level two, affordable housing is remarkable. It's what's got our work done. It's what's Got City done is what will get the next set of projects that North housing and reshape and other places done.'",
        "'speaker_8': 'And this is one of our partnerships with the MSD, so we're really excited about. It's going to be primarily administrative work as a U.S. who will be eligible and maybe some first year teachers or single teachers. And then when we look at North Housing, as I said, really, I think Alameda should be very excited.'",
        "'speaker_8': 'This is about building a neighborhood. It's going to be an opportunity that will only have once we want to get it right. And we're very pleased with our partnership with Alameda Point Collaborative and Building Futures. We are trying to work really on what the project feels like, how the flow is, as well as working with the neighbors'",
        "'speaker_8': 'nearby. So another area and I'll say one of the reasons I came to this housing authority is because it works so well with the city. That's not always the case in other places. Sometimes the housing authority in the city are fighting for resources, and I felt that it was remarkable that that was what is now, I mean'",
        "'speaker_8': ', and it was then daily contact between city staff and the housing authority. And much of that relies on these city services agreements. As many of you know, both the home program and the CDBG, the Community Development BLOCK Grant program, are federal funds.'",
        "'speaker_8': 'We administer them. You make the decisions, we make those proposals to you. The inclusionary housing ordinance is funds paid by private developers, and that really has taken off in the last five years, as you've seen, increasing development in Alameda.'",
        "'speaker_8': 'And then the thing I think we've really worked most closely on because it was new are the rent ordinances and you'll see later on, I think we're very proud of the data we have, the program that we have, the response time we have.'",
        "'speaker_8': 'But that has really been done in close collaboration with CIO and with the community development team. So moving on to our fourth area, that's property management. So that those are the services that help people preserve their housing, onsite property management, in-house maintenance services.'",
        "'speaker_8': 'And then this one, I do like to tell people because it's often a question, which is what happens if I call in the middle of the night because my refrigerator is broken? So we do have a 24 hour live answer call line.'",
        "'speaker_8': 'They will triage those calls. If it's if you have if it's something that you can't wait for, they will call the maintenance worker out. You know, actually, if they do maintenance, what maintenance worker usually answers. But if they don't, they keep getting the maintenance answer.'",
        "'speaker_8': 'The supervisor, supervisor, supervisor, until someone comes out and we will dispatch someone in about 40 minutes or we'll get a vendor. And in terms of numbers, the current portfolio, we have 628 units that we own ourselves. Some are managed by us and some by a third party management company, and then 210 units that we own in some'",
        "'speaker_8': 'form in partnership. So I wanted to put this slide up. One of the things that I think people sometimes don't know or don't know until it til they need to know is that the housing authority provides independent living.'",
        "'speaker_8': 'We are licensed for the independent living error arena. We are not licensed for assisted living or skilled nursing facilities in the independent living area. We do several things to allow people or to permit people to stay longer. We help them connect with in-home supportive services, will modify the unit.'",
        "'speaker_8': 'They can have a live in aide. We will approve service animals. We have case management and you can use the Section eight program with us. When you look at the other two content parts of the continuum and I just want to say this has nothing to do with being affordable, being low income.'",
        "'speaker_8': 'This applies actually to all income level. Also the skilled nursing facilities, you know, at the far end is really a full medical environment. And frankly, if you've ever experienced it, not that pleasant an environment, you know, there are beeps going on and nurses coming round.'",
        "'speaker_8': 'And that's something that the state will kick in and pay if it's medically necessary. And you can't use your voucher there. The middle part, the assisted living part is where the challenges are. We're seeing more and more of frank.'",
        "'speaker_8': 'I'm going to say I'm seeing more and more of my family members need something like this, but we also see it among our tenants. I know even in the rent program, we see it about in among landlords and tenants in the rent program needing more assistance.'",
        "'speaker_8': 'And we often get those calls. You know, our inspector is this isn't our inspector's job. But we do say to the inspector, if you go in and see a situation that is not maybe not on your checklist but needs reporting, we ask you to come back and report it so we can get the social worker out there'",
        "'speaker_8': '. But the problem with assisted living, as many of you know, is it runs to from 5 to $6000 a month. It goes upward of that depending on how many activities you want and other benefits. But the state doesn't provide any funding.'",
        "'speaker_8': 'We're not licensed to do this and it really does need a different level of care. And so one of the issues that we're having, I'm going to see if I can make the point to work. Let's see. Maybe not.'",
        "'speaker_8': 'So I'll I'll just say this visually. So what we're trying to do with our services is inch out the independent living into the assisted living without violating the state laws on assisted living, trying to preserve the dignity of the people who live with us whilst maintaining that their their safety and their ability to live independently.'",
        "'speaker_8': 'But I will tell you that assisted living gap, I believe, is going to come up as a problem for the city, for the county and for the state as a whole. And we would love to work with you to address those issues.'",
        "'speaker_8': 'Again, I don't think this is unique to affordable housing. The other questions that I often get at what are the least requirements to live with us? Obviously there are income eligibility requirements and there are occupancy limits that perhaps you don't see in the private market.'",
        "'speaker_8': 'So you have to have if you are one person, you're going to get a one bedroom. The one bedroom can only have up to three people in. If it's a two bedroom, you can have up to five. There are some limits there, but otherwise I would say the vast majority of the lease requirements are exactly the same'",
        "'speaker_8': 'as you would get with a private landlord. In fact, actually, there might be a little more generous than the private landlord, but there's nothing more stringent with us than you would see elsewhere. And there are some examples here.'",
        "'speaker_8': 'The same goes to be the same as can be said about lease violations if you don't pay the rent. And we have some mechanisms to help you pay the rent, but if you keep not paying the rent, there's you know, we can't keep doing that.'",
        "'speaker_8': 'We do see damage to units and smoking. Thankfully, with the city ordinance over the years has gotten much better, but it does still occur. And that's something that often impacts the neighbors. It's the neighbors who complain, not the not the smoker.'",
        "'speaker_8': 'And then linked somewhat to the issue I showed you earlier on. The independent living and the assisted living is repeated habitability issues. So we can have a tenant who perhaps has lived with us for 20 years or is going well, they're passing their inspections and then they start to take longer to pass those inspections.'",
        "'speaker_8': 'And one of the issues we are seeing, and it's not unique to us. I encourage you to look at some of our other cities that are no different, but they may have done research on this is around hoarding.'",
        "'speaker_8': 'We do see people deny access to units. I do want to say that we really do encourage people to tell us about what's happening in the units. Now, obviously, if there's deliberate damage, we are going to look at see whether we can resolve that with the tenant.'",
        "'speaker_8': 'But things like pest control, honestly, we'd rather get in there and fix it right away. But not allowing access can be a problem. And then there are occasions when we have, as with all property management companies, threatening behavior towards staff, residents, guests or vendors.'",
        "'speaker_8': 'And then the next one actually is a little bit different. I think the private market is probably a little more lenient on this. We do sometimes have unauthorized guests or unauthorized and control pets, and those could be pets or uncontrolled service animals.'",
        "'speaker_8': 'And then again, with all leases, illegal activity, illegal activity. But that's something that your police officers who are assigned to the housing authority will assist us with. So I just want to sort of reiterate that we have we have two major programs that tenants or participants are involved in.'",
        "'speaker_8': 'There are lots of other things, the leases, which are part of the physical housing that we rent and the Section eight program. And sometimes people have both. So what I wanted to put up here is that there are also Section eight program violations.'",
        "'speaker_8': 'So on the lease, you know, if you don't pay your rent or you have ten people in a one bedroom, we're going to start with measures, you know, initial warning measures for you to try and pay up and move your people on.'",
        "'speaker_8': 'The same is true with the Section eight program, misreporting of income and assets. And I will tell you that particularly when we go into budget shortfall, HUD is very strict on this. It's something that they really and I think somewhat understandably, are being less and less lenient about people either forgetting deliberately not reporting their income or their'",
        "'speaker_8': 'assets. And we are charged with implementing that. They're providing us with more tools to check that failure to complete the annual income recertification at all, additional people living in the unit again. And I want to say I totally understand this.'",
        "'speaker_8': 'There's a housing crisis. If you have a family member that is unhoused and you have this unit which we give you, which is in, you know, pretty good shape for the and, you know, where you've probably got a little extra space because we allow one bedroom for the head of household and two bedrooms after that.'",
        "'speaker_8': 'I understand why people end up with additional guests, perhaps people living there, but it's actually not how the program works, and particularly if that income is not reported and then occasionally have people not living in the unit. I mean, they may have someone else living in the unit, but that is something that comes up not infrequently.'",
        "'speaker_8': 'The next thing I want to talk about, because it sort of goes with the sort of pattern of HUD language, is housing quality standards. These are the basic standards that HUD sets. And I want to stress they are basic.'",
        "'speaker_8': 'They're not the same as a property management inspection where we're asking for a little more and they're only valid for as long as we're in there. So, you know, if we've tested the smoke detector at 10 a.m. and the tenant has tampered with it at 1020, they no longer meet it.'",
        "'speaker_8': 'And similarly, if the landlord has patched something and it fails, you know, it passes at 10:00 and 1020, then the standards, they're not monitored, ongoing. Monitored in our private units every other year and in our own units every year.'",
        "'speaker_8': 'And then the Section eight program you can have, if you have repeatedly violations, it can lead to program violations on the Section eight side. The reason I say this is because I want to be clear for people who may be clear or may not be clear on the appeal process, we actually take very few adverse actions, less'",
        "'speaker_8': 'than half of 1% of our tenants or our voucher holders in any one year. But I do think it's important to make sure that is clear on what the processes are. So on the Section eight subsidy side, you would be issued a program violation.'",
        "'speaker_8': 'The mandatory tenant conference or the notice of termination sometimes goes this way, sometimes is flipped depending on the nature of the the notice of termination, and then you're eligible for an informal hearing process. If the tenant does not like the informal hearing outcome, then you they can request judicial review.'",
        "'speaker_8': 'That's a request they must make within 90 days. We notice them. We send them a registered letter making sure that they got that letter so that we know if it came back. And then the decision beyond that can be appealed to the Court of Appeal either party can request.'",
        "'speaker_8': 'So there are outside actions relating to the Section eight voucher in terms of your tenancy with us at the Housing Authority, a lease violation, you can get one or two lease, low level lease violations and you're not going to termination.'",
        "'speaker_8': 'Termination usually happens when there's a single severe lease violation or multiple ongoing lease violations. We will then decide to file an unlawful detainer action with the court in Alameda County or, you know, your you have a very strong court system.'",
        "'speaker_8': 'And when we arrive in court, before we get to see a judge or a jury, we are mandated to go through mediation. And that's actually been a very successful process for us. We can often reach stipulated agreement with the tenant, so we preserve their housing, they change their behavior in some way.'",
        "'speaker_8': 'It's not ongoing. It's usually time limited to six or 12 months, and the vast majority of people retain their housing. If the mediation doesn't work, we will go to a judge or jury trial. The tenant selects which and again either party can request the Court of Appeal.'",
        "'speaker_8': 'During that time, a participant can submit a complaint to the bodies at the bottom or at any time. One of the things that I think staff work really hard at and we have worked really hard at, is to provide some extra reinforcements to that system.'",
        "'speaker_8': 'We understand that getting any kind of notice of termination of a housing decision, whether it's your subsidy or your housing or or one may lead to the other, can be a traumatic event. And so we have all these additional resources, which is why we end up with less than half of 1% ending up losing their housing.'",
        "'speaker_8': 'The first thing we do with lease violations and terminations, even if you don't pay, if you're a few days late on the rent, you're still going to get a social worker referral. You can meet with a supervisor if you like, to review the violations.'",
        "'speaker_8': 'Actually, many, not many of you, but a number of you have contacted me about noise issues at our properties. And I will tell you that generally we start with mediation. Those are the kind of things that are difficult to win in court and somewhat subjective.'",
        "'speaker_8': 'But if we can work with mediation, sometimes we can get one neighbor to understand that the other person has a child who tends to wake up early or they have a sleeping habit. That means they go to the bathroom in the night.'",
        "'speaker_8': 'Sometimes that understanding can can at least ratchet down the anxiety about the noise. When we think that there's a real problem, we will work with your city police officers to work on welfare checks. And I will tell you, I myself have called Adult Protective Services a number of times when we think that perhaps the tenant is not'",
        "'speaker_8': 'needs additional assistance, that perhaps they they don't understand the process, perhaps they need additional support. And we do provide referrals to legal services. In fact, our case managers are required to provide people referrals to legal services if they get a notice of termination.'",
        "'speaker_8': 'And then we work with the legal aid representatives. Once they're appointed, there's a whole host of other things. We have some internal review of termination and hearing outcomes. And then the last point here I really want to say is we generally offer people offers of alternative housing.'",
        "'speaker_8': 'So what we usually find is that there may be a physical issue with that unit and then some other issue that we're dealing with. And if we can move people, even if it's temporarily into a hotel or into another unit, to make sure that they are stabilized, to make sure they can kind of get on with the'",
        "'speaker_8': 'daily, daily activities. That's our first, first goal. So it might even be somebody who calls on. Friday night. They only have one toilet where, you know, I maintenance person has done the best they can, but it needs something more than what we can do.'",
        "'speaker_8': 'We will offer them a hotel. And we've been lucky to have relationships with hotels in town that we can do that pretty quickly so that it can be an immediate action. The other thing is about file requests. So we have had we actually have again, have very few of these.'",
        "'speaker_8': 'We have about less than ten people a year who come in and ask for their full file. That's usually people who are represented. And what I will tell you here is that we're subject to the same regulations as as the city files our public records act.'",
        "'speaker_8': 'We do have some additional privacy restrictions that we can enact that can be viewed on site for free. We have those electronically there in three different systems. So tenants should be prepared to spend some time with us. And with that, I would say an appointment is always better if we can, because we have limited space and limited'",
        "'speaker_8': 'staffing and we can provide paper copies for $0.10 a page. I will tell you that when I asked When did we last charge someone for a small amount of copying, no one could remember. And we have some staff who've been there a very long time.'",
        "'speaker_8': 'And I can tell you that I don't see deposits of, you know, on a dollar 80 for a copy of the lease. My sense and what staff tell me is that if you come in and you need a copy of your lease, you'll get it.'",
        "'speaker_8': 'They actually tell me the most common request they get is for birth certificates. And I said, What do you mean birth certificates? They said, Well, what happens at the beginning of the school year is people come in and say, Can you give me my birth certificate for got to run down to the school district and register my'",
        "'speaker_8': 'child. And so I will tell you that again, if you come in and you do a small amount of paperwork, we're going to give it to you. We'll do it as quickly as the receptionist can do it. If you need the full file in paper, we are going to charge because that can run to hundreds, if not'",
        "'speaker_8': 'thousands of pages if you've been with us for a long time. But we do have some other electronic options. We have some can sometimes size does not work. We can email things and they don't arrive with people on this awesome privacy limitation.'",
        "'speaker_8': 'So if people are asking for their medical records, we're not really comfortable emailing those, but they could come in and do a transfer in the office. I I've mentioned the release form. I do want to also mention that one of the we have these privacy restrictions that we can use, but they're not transferable to the next party'",
        "'speaker_8': '. So if a tenant chooses to, to release their information and we provide it to someone else that might be their attorney, that might be a friend, a family member, we cannot control that after that. So that's the one issue that we do make sure people understand.'",
        "'speaker_8': 'So I wanted to put this slide in because I think that when we're looking at housing authorities, just as when we're looking at cities, there are ongoing challenges. We've been in this housing crisis, which I keep thinking, you know, I keep saying there's going to be a bubble.'",
        "'speaker_8': 'The bubble is going to pop. Last night, it was an earthquake. I thought that might, you know, shake the housing market. But I don't see any any anything happening there. We're in this for the long haul. We've been here for 75 years.'",
        "'speaker_8': 'We're going to keep doing it. I want to say we are definitely open to feedback. We want to make sure that we amend our processes where we need to. But these are the big picture challenges that we face.'",
        "'speaker_8': 'First of all, the overwhelming unmet need for housing. I want to tell you that the people in our house, in.'",
        "'speaker_2': 'Our.'",
        "'speaker_8': 'Office that face this most are our receptionists. Every day they have people saying coming in and they have to say, here's a packet. No, we don't have housing. No, we haven't opened the waitlist since 2015. It's really hard.'",
        "'speaker_8': 'And I know for you as council members, it's hard to see the number of people who are on the streets. It's hard to get some of those messages that people send you. So we're happy to be working with the city on homeless services.'",
        "'speaker_8': 'We're really happy to be building more housing. We're happy that we put an Alameda preference in our properties. We think that's important. Even if the money comes predominantly from outside of Alameda, often the land has come from you or through you, and we really need to be looking at tackling those challenges.'",
        "'speaker_8': 'We are facing increasing regulation from HUD and from the state of California, whether those labor regulations or new regulations by hard on some of the most recent initiatives and they don't pay us any more to do that. In fact, sometimes they pay us less.'",
        "'speaker_8': 'And that's where we're underfunded for administrative costs. As I said, the the the other programs, not your programs, but other parts of the housing authority subsidize the Section eight program. And the board takes a decision on this every year.'",
        "'speaker_8': 'And they do it because it is really important. We're putting 1500 families in housing as they. Said We have an increasing need for social services, that is to allow tenants to live independently and to live longer to retain their autonomy.'",
        "'speaker_8': 'We put a lot of effort into trying to transition people who cannot remain with us. But I will also say, like like the city owned property and like some of the housing in Alameda, we have an aging housing stock.'",
        "'speaker_8': 'We did a capital needs assessment that was over $20 million in need. We are working diligently on it. We're looking at it from a risk basis and sometimes from a can we use other people's money basis. But we, for example, just put a new roof on at Sherman Street.'",
        "'speaker_8': 'Those they're relatively small projects, but they're projects that keep people housed. We look forward to funding north housing. That's our next goal. But we are in competition with the other projects in Alameda and we are in the competition with the other projects in the East Bay and sometimes in the North Bay.'",
        "'speaker_8': 'So we will continue to look for that federal funding and push for that federal funding. And then, like most local government agencies, we have a growing CalPERS liability and we have staff turnover due to retirements. So with that, I think sometimes people don't realize how much input they can give us, and we really want to hear that'",
        "'speaker_8': 'input. We want to get that response. So I do encourage people to sign up for the newsletter, particularly if you're interested in getting on a waitlist. It's not a commitment to get you on the waitlist, but we do advertise that way and in many other ways.'",
        "'speaker_8': 'I know that our Board of Commissioners would love to hear from more people at the monthly meeting. We frankly have one regular speaker and occasionally a second one. The annual plan public hearing is actually what the Resident Advisory Board will create.'",
        "'speaker_8': 'They will create the plan with the staff, and then we'll do a public hearing. We survey our customers every year. We really encourage feedback. It can be anonymous. If people really want us to call us back, call them back.'",
        "'speaker_8': 'We will. They can put their contact information, but we do follow up. In fact, I see every single one of those comments. If people want to file complaints, they can do that through the website at the office, via email, in any language they like.'",
        "'speaker_8': 'And we will follow up with that. And then we have a number of workshops. We obviously have the rent program workshops, we have a landlord workshop and we did one this week. We had a great turnout and we have another one coming up next week.'",
        "'speaker_8': 'As I said, the resident advisory board is a third out. I think for people to join that board. We really want to hear from residents. HUD designs this process so that there is a resident input. And then, you know, I do want to say a big thank you to our partners, the Boys and Girls Club Food, the'",
        "'speaker_8': 'food bank, Alameda Family Services, Meals on Wheels and Life Steps, our social services provider. I know many of you and many of the people watching do volunteer. In fact, many of our tenants volunteer, which is really exciting with those entities.'",
        "'speaker_8': 'And when you volunteer with them or you write a check to them, you are also helping our residents. So with that, I think that's more of an informational overview. I just want to say it's an absolute pleasure to work in Alameda, the collaboration between the city staff, particularly Debbie Porter, Andrew Thomas and many other people to help'",
        "'speaker_8': 'us get our buildings done, to help us put in roads out at north housing and to work on the city programs every single day is invaluable. Again, I want to say it couldn't be done without the staff. And our goal really here is that the future of the housing authorities to deliver and expand affordable housing solutions for'",
        "'speaker_8': 'low income, disabled, senior and homeless households in Alameda. So thank you for the opportunity.'",
        "'speaker_0': 'Thank you for the presentation. Are there any questions of the Council for Ms.. Cooper? Councilmember Odie.'",
        "'speaker_5': 'Have a couple of. Thank you. You mentioned that you have a lot of I mean, there's one of your favorite landlords. Do we have incentives for landlords who might be interested or who you think might be able to help the house, these 75 voucher holders?'",
        "'speaker_8': 'We do we actually have a program currently, which we've had around since about about 2015. There have been some other programs before that as well. So we offer $500 for each new use unit leased. And I want to explain the philosophy around that.'",
        "'speaker_8': 'So when our Section eight tenants go in, there is a perception that they might be a little behind the game, right? So they go in and there's someone who's got this great high tech job in San Francisco. So we do a number of things.'",
        "'speaker_8': 'We do workshops with them. We show them how to fill out the standard associate apartment association forms. So they walk in with the form done. We practice with them going in. We talk to them about clothing. We talk to them about showing up on time.'",
        "'speaker_8': 'How to find that housing. We run these workshops every month for our voucher holders who are seeking housing. And then what we realize is that $500 has been helpful in kind of. Making the landlord think again and honestly sometime will pay that to anyone who works for them.'",
        "'speaker_8': 'So if their property manager is the person who secures the lease, that $500 will go to them. If, if, if it's an owner, it'll go to the owner as well. And that has been successful so far. But I do think it's something that we could continue to look at.'",
        "'speaker_8': 'We also offer a security deposit program and then this sort of renter education that we try to help with. And then we have a listing at the housing authority of vacant units. So if there are any landlords listening or watching who'd like to list with us, that would be great.'",
        "'speaker_5': 'And then just to follow up on that, last year, I think Libby Schaaf and the mayor of Oakland, I think she's committed some city money to help expand their incentives. I mean, is that something that we could consider here in Alameda just to help clear this backlog?'",
        "'speaker_8': 'You know, I think it is. So there is an area that other housing authorities and the Oakland Housing Authority is a different type of housing authority has more flexibility, but they do things like they pay landlords to keep the unit vacant while the inspection goes through.'",
        "'speaker_8': 'Now, we really try to get an inspection out in two days so we don't have that problem as much. But there is that hesitancy. So they pay the landlord to hold the unit, or if a section eight tenant moves out again, they'll pay another month of rent while we find another Section eight tenant.'",
        "'speaker_8': 'And then and I'm a little hesitant to say this because it's not to cast any aspersion on people, but they do also or other housing authorities often have what's called a damages fund. So sometimes our Section new Section eight landlords are reluctant to take on a voucher holder because they think the unit might be damaged.'",
        "'speaker_8': 'And so that damage fund can be pulled on at the end of the day if the security deposit doesn't cover it. My view is it's more of a kind of reassurance and I would hope that actually our tenants would would would have no lesser care of the units than anyone else.'",
        "'speaker_8': 'But it does what we're trying to do is push the needle so the landlord will consider our tenants in an equal way to any other tenant. And I do want to say that the Nondiscrimination Act is something that we really appreciate.'",
        "'speaker_8': 'We've actually been talking to the city about that since 2015 because we believe that if if people don't advertise no section eight, then over time things will become more open and people will be people will look at this in a different way.'",
        "'speaker_8': 'It doesn't mean people don't find other ways around it, but it's we're very grateful for the action you took and that the state has taken as well.'",
        "'speaker_5': 'Okay, I have others, but I'll save them for later. Thank you for the recap on the incentives.'",
        "'speaker_0': 'Okay. Did I see any hands over here? Okay. Thank you. That was a great presentation. I believe I heard you say near the beginning of the presentation that the subsidy runs out for Independence Plaza in a certain amount of time.'",
        "'speaker_0': 'At which subsidy and and when.'",
        "'speaker_8': 'So this is the subsidy that came through the redevelopment agency. It runs out in 2026. You subsidize the operations there. It's somewhere between a million and 1,000,005 each year. It's one of those sort of situations where, honestly, it's been an opportunity for us that the housing a very real to plan ahead.'",
        "'speaker_8': 'Quite often you arrive at a housing authority and it's already 2025. So we do have a plan to fill that gap in the long term and try to minimize the impact to the tenants.'",
        "'speaker_0': 'Okay. That was my question. What happens then? So you you want to review.'",
        "'speaker_2': 'Right. So so we we.'",
        "'speaker_8': 'And and I have staff here who perhaps can speak more about this. But so one of the things we did two years ago is we went through an extensive process with the board, with the tenants. We presented at the resident meetings on exactly how this works.'",
        "'speaker_8': 'We talked about how some tenants really hadn't had significant increases for for many, many years. And in fact, rents were very close to the rents that were pro forma when the building was built. We're also cognizant, cognizant that about 110 of the 186 were very low income.'",
        "'speaker_8': 'And so we put together a plan to gradually increase the rents that was reviewed by the board three times we went to the tenant meetings each time we put in place a fund with life steps to assist those those families that can't make that.'",
        "'speaker_8': 'We've given early notice. And unfortunately, sometimes our early notice makes it more confusing, but it is to help people adapt to that. And what we've really done is frankly put the higher rents on the new people coming in, the most majority of them have a voucher.'",
        "'speaker_8': 'So we are working on sort of switching the ship somewhat so that there are more voucher holders there who can cross-subsidize the lower income tenants. But we do want to say that we know for some tenants any rent increases difficult and it's that's the reason we gave life stepped some.'",
        "'speaker_8': 'Direct cash assistance that they could help people with. We don't ask who that that's going to. We do ask them whether they've used it or not. But we prefer for people to have that kind of privacy with a case manager.'",
        "'speaker_8': 'Them with us.'",
        "'speaker_0': 'Okay. Thank you. And then let's see the. I think you also mentioned that it's possible to contact if people have a concern about housing authority housing, they could contact housing authority board members directly. How do you how would you do that?'",
        "'speaker_8': 'Right. So on. Well, so, first of all, our board members are at the meetings. We really you know, we would really encourage more active participation. I think it's great for the board members, frankly. It's great for the staff to hear that the somebody who has a concern can put that in writing.'",
        "'speaker_8': 'They can put it through our website. We have complaint forms. They can also contact the board chair directly. There's an email address on that system. If they send me a letter that's addressed to the board chair, the board chair is going to see it.'",
        "'speaker_8': 'The response may come from me, but he will have seen that response. And also, actually, our board members are at a lot of other things. So we hold town hall meetings at every property every year. We provide pizza and education and information, and our board members come there because we want to meet tenants at the property is'",
        "'speaker_8': 'not for some people coming to the board meeting is not is a little it's actually very informal, but it feels daunting the first time.'",
        "'speaker_0': 'Okay. Thank you. And Vice Mayor.'",
        "'speaker_1': 'Sure. Thank you very much for the presentation. And I don't know if we can go back to the Slide 29, which is the appeals process I just had done. So maybe my question makes more sense. Thank you for documenting the appeals process.'",
        "'speaker_1': 'And I'm just going to reflect I'm hoping we can hear from the about the referral before public comments and I'll try not to jump too far into that.'",
        "'speaker_0': 'I think we can. Okay.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'Because we're going to combine the public comments, as I understand. Yeah. Yeah. So. So are there I can use slide 29. Yeah.'",
        "'speaker_1': 'Can you walk me through? We've heard a number of concerns about process. I'm sure we've all heard them. But. But I'll address some of the ones that I have. Can you help me? It seems that program violation, the the first of these is just the housing authority.'",
        "'speaker_1': 'Noticing somebody that there is an issue, something happens. The mandatory tenant conference is staff and the. Yes. Section eight voucher holder meeting.'",
        "'speaker_8': 'Correct. It, depending on the severity, might be with a supervisor. Mm hmm.'",
        "'speaker_1': 'Okay. And then the notice of termination goes out. Then they can request an informal hearing process. I did look that up and see it. I believe I heard from our staff today that the informal hearing process is also staff.'",
        "'speaker_8': 'It depends. Sometimes it's contractors. So we are lucky to have retirees from other housing authorities. And sometimes it's staff, but it's never staff in the in the same department is staff who do not know the tenant. And actually, that's what HUD has recommended from a cost perspective that that's why it's an informal hearing.'",
        "'speaker_8': 'Okay.'",
        "'speaker_1': 'And then the judicial review, is that something that the lawyers are hired and whatnot, or is that something? It's this tenant request. But I'm assuming that if you're on Section eight, the idea of hiring a lawyer to take something to court is right.'",
        "'speaker_8': 'I mean, I.'",
        "'speaker_1': 'Cost to the tenants for this this that this side of the. Right.'",
        "'speaker_8': 'So I actually could defer to our attorney on that one. What I would say is that we know that we're not tenants and our participants go to court. There is free legal aid right there. When they get to the stage, they're already being offered free assistance.'",
        "'speaker_8': 'You pay for some of that assistance. So I'm not sure if there's a filing fee.'",
        "'speaker_0': 'Why don't we have the attorneys, the attorney present?'",
        "'speaker_2': 'Good evening. I'm Jennifer Bellon, a partner at Goldfarb and Lipman. And our firm is the firm that serves as the general counsel for the Housing Authority. And we represent a lot of housing authorities throughout the state and also serve as general counsel for Oakland and Berkeley housing authorities in the Bay Area.'",
        "'speaker_2': 'I think once I saw a private attorney and I've been doing this for a hundred years, a private attorney, represent somebody in a writ of mandate action. That's what it is after the informal hearing. But there's Bay Area Legal Aid.'",
        "'speaker_2': 'There's the Eviction Defense Center, there's the East Bay Community Law Center. There's a central legal de la Raza. Most of the tenants who are represented, both at the hearings and at in the judicial review, are represented by the free legal services providers.'",
        "'speaker_2': 'And we don't appear at that at the hearings. We the housing authority is represented by Housing Authority staff.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_2': 'Even if someone brings their attorney. Yes.'",
        "'speaker_1': 'Okay. Thank you very much. And thank you for being here.'",
        "'speaker_2': 'You're welcome.'",
        "'speaker_1': 'And then I guess my my other question that I was trying to understand a little bit, it sounds like there is nobody when you want to go in person to file a complaint, talk to somebody that is there, somebody at the front desk.'",
        "'speaker_1': 'I've been a little unclear about this that yes, you can speak.'",
        "'speaker_8': 'To this desk coverage from 830 to 5. We cover lunch times and all those other times and there's someone answering the phone at that time. Two people have their own assigned workers. They can look on the website and work out their work as a done by Alpha Order, or they can just look at the piece of paper'",
        "'speaker_8': '. Generally, we do need an appointment for something that's not urgent. Basically, we're running on very tight staff when you think that there are 4000 people who could drop in on any one day. So what I will say is, honestly, that's not how it works.'",
        "'speaker_8': 'If you want a copy of the lease, the receptionist will get you a copy of the lease. If you want an hour's sit down with your worker, then we really do encourage an appointment.'",
        "'speaker_1': 'Okay. And then my last question. It's keeping me. I don't know.'",
        "'speaker_0': 'You can come back too, if it returns. Councilmember Vella.'",
        "'speaker_9': 'Thanks, Vanessa. My question has to do with the appeal process. You mentioned that it could be a retiree from another housing authority. About about how long does that informal hearing take?'",
        "'speaker_8': 'Do you mean the duration of the hearing or how long the process takes?'",
        "'speaker_9': 'How how much time would an individual member of that panel spend?'",
        "'speaker_8': 'So we give a guideline of an hour and a half. One of the.'",
        "'speaker_2': 'It's really up.'",
        "'speaker_8': 'To the hearing officer. The hearing officer. And we train them again and again that the hearing officers are in charge of the room. Just as we've heard, you're in charge of the room. And so there are times they.'",
        "'speaker_0': 'Make that clear.'",
        "'speaker_8': 'That we go to three or 4 hours, particularly if there's translation or perhaps there's a disability need that we have to accommodate. Sometimes we end up coming back for a second appeal. The one thing I will say is that people need to understand that the informal hearing process is only for certain items.'",
        "'speaker_8': 'It's going to be the items that they have been noticed of a termination, a reasonable accommodation that's been rejected. And so the hearing officer will cut the conversation down if it's about other things and say, you know, actually that's not an appealable activity.'",
        "'speaker_8': 'That needs to go through a different, different process.'",
        "'speaker_2': 'Okay.'",
        "'speaker_9': 'And do these you also mentioned that it could be housing authority staff. When do these hearings take place? Serving the work day, is it?'",
        "'speaker_2': 'So it's.'",
        "'speaker_9': 'Work hours. Sorry.'",
        "'speaker_8': 'So we generally schedule it for the work, the work day. We have been known to do some evening hearings as well. We do generally ask the people ask for that on request. We frankly, we tend to schedule them on a Thursday.'",
        "'speaker_8': 'And that's just because then we can have our hearing officers. They know that it's Thursday because most of them only do this part time. There are some staff that do it. So we say Thursdays, people ask for a hearing and we scheduled the hearing as quickly as we possibly can.'",
        "'speaker_8': 'Once the hearing has been held, then we respond to the to the participant within 14 days. Occasionally, there may be some documentation that has to go to and fro. Perhaps there's some clarifications and it may extend a little later, but they get a letter saying, well, you know, we're way we're going to extend by a few days'",
        "'speaker_8': '. If people need an evening appointment, then they should talk to us about an evening appointment. We'd be happy to to see if we can work with people. And certainly if it's a disability related accommodation, we absolutely are going to do that.'",
        "'speaker_9': 'And for the retirees who volunteer to sit on their voluntary, are they paid?'",
        "'speaker_8': 'Oh, we pay them. Thanks. They may be retirees or people who've worked on the housing. What is part of the problem is that the regs are so thick. This isn't something where you can just come in and say, Do I think it's a good idea?'",
        "'speaker_8': 'The hearing is really saying and I want to say I think the other thing that whenever I'm training, hearing officers or Jennifer's training hearing officers, we remind them this isn't the housing authority versus the tenant. This is the tenants due process rights to understand why we've issued the notice and to challenge whether it's right.'",
        "'speaker_8': 'And those two parts are actually very important. Sometimes what comes out of the hearing is more about understanding than than their rights. And sometimes it's about their rights. And so it's not, as did the housing authority, when in fact, we held 55 hearings last year.'",
        "'speaker_8': 'And I can say that there was just a handful of people who lost their housing or their subsidy in that process. In fact, we encourage people to go to a hearing because if they don't understand the decision we're making and we want them to understand and if it's possible, we've made an error, we want to reveal that'",
        "'speaker_8': 'at that time. So I would say, for example, people might have a hearing for the income calculation and we might be right in recommending termination. But then they walk in and say, Oh, I forgot this piece of paper and then were able to recalculate their income and perhaps they can stay on the program.'",
        "'speaker_0': 'Did you think every other day he raised me right.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'It's a two parter. So this is this is the appeals process for for these two specific places. If somebody has a complaint about their, let's say, a maintenance complaint or something like that. So they you know, you sent me some information about how they can how they can file those.'",
        "'speaker_1': 'Do they get a tracking number with that? And then the other question is, if they don't like the result of the if they feel that that something is broken needs to be fixed and it hasn't been and they file another complaint, it's still not addressed.'",
        "'speaker_1': 'What is the process for kind of working that through the system to to get to a result?'",
        "'speaker_8': 'Sure. And, you know, I actually prefer to call them interactions because one person's complaint is not someone else's complaint. So I always give the example. Someone complains that the the dumpster is overfilling, but we know the dumpster is coming tomorrow or we're sent we send maintenance out to clean it up before the dumpster comes.'",
        "'speaker_8': 'What I'm hoping is the property manager on site can give a quick answer and we don't get into tracking and everything else. But I will tell you that I have recently been working with all the housing authorities to see whether anyone has a tracking system, some of that.'",
        "'speaker_8': 'So again, we're struggling with these privacy issues. So like in your department, the health records have to be kept separate from the employee records. But so I think the the question really is probably how do we keep track of key complaints we have had and we continue to work on a centralized tracking system.'",
        "'speaker_8': 'A lot of those were coming through me at the beginning, and now we're really working on the department directors to address those. But what we do find is that what we know is if we hear the same thing again and again, even if we think we're right, there may be some other issue, there may be some misunderstanding'",
        "'speaker_8': '. So we do try to respond. Our goal is to respond. We say within ten days. That sounds like a long time. We really try to get back much more quickly. I will tell you, there's a small number of complainants and they find themselves in your offices and my office for whom we can do nothing.'",
        "'speaker_8': 'We have called out code enforcement. We have had your officers review the situation. We have worked with social services and they are going to probably get a standard letter back from us. But those are things like why can't we have more parking and b diamond?'",
        "'speaker_8': 'You know, that, that generally things we can't fix or things that the the participant or tenant thinks is genuinely wrong with the housing situation and our message, you know, our main message in those situations is to go get a third party opinion.'",
        "'speaker_8': 'That might be your code enforcement department, that might be your police officers, that might be a social worker, or frankly, it might be a mold test, it might be a noise test. But at some stage, there are some things where we have to say we've done what we need to do on the other ones.'",
        "'speaker_8': 'We have to work strongly and closely together to make sure that the efforts that are being made so things like offering other units, going in and doing more tests, we keep to those timelines and that we perhaps I would say do a better job at informing the tenant of what we're doing.'",
        "'speaker_8': 'I will say that sometimes our staff is guilty of tackling the problem and perhaps not the communication, and I'm guilty of it too. That's not to blame them.'",
        "'speaker_1': 'And then the second part was, if somebody doesn't like the results, they're right. What is that? I'll call it. So it's process. But but yes.'",
        "'speaker_8': 'So we do encourage people to go through the supervisory process. Many people just like to come straight to me and I and I do try to to encourage them to go back to the subject area experts, because sometimes I'm not the detailed knowledge person about their income calculation.'",
        "'speaker_8': 'So we have something called a supervisor form. So you can come in, we have a complaints form which will go to me and that gets gets then distributed. But we found that some tenants didn't want to fill out the complaints form they wanted.'",
        "'speaker_8': 'You know, it was equivalent to wanting to talk to a supervisor. And certainly if the receptionist cannot handle the question, the supervisor will come out. But that supervisory form is available on the tenant side. We encourage people to go to the property manager on site first.'",
        "'speaker_8': 'They're there. They're open every day for the most while there's one property that's a little shorter hours, but they're open every day for at least 6 hours. You can just walk in. Then you can see the property supervisor.'",
        "'speaker_8': 'Her information is published in our newsletter. Then you can see the director of property operations. I will tell you that, you know, I don't generally ask to see if people have met with those other people first, but I have been known to meet with tenants.'",
        "'speaker_8': 'I often meet tenants deliberately walk through the lobby because, you know, that's the one time you really get to get to see what's happening. And then people can come to the board meeting, they can talk to the board chair, they could call HUD, they could call the DFI h many of them call you.'",
        "'speaker_8': 'We're very happy to hear from you when you have those complaints because we do want to try and fix them as quickly as possible.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_0': 'I'm. So.'",
        "'speaker_6': 'Yes, I just want to make two comments. One is, you know, I grew up three short blocks away from the Esperanza in the seventies and the eighties. The Esperanza was were quite drab, quite frankly. But, you know, as I drive up and down Third Street, when I'm leaving my mom's place over on Santa Clara and Lincoln, and'",
        "'speaker_6': 'I'll go up Santa Clara, Third Street, you know, I'm really I'm really glad to see how Esperanza does look. Incredibly spruced up, no pun intended, since Spruce Street.'",
        "'speaker_4': 'Right.'",
        "'speaker_6': 'And for all West Enders. So I just wanted to say that, you know, that there's a design flowers there now. And, you know, for the past several years that that indicates that the housing authority definitely is is is making such great strides with regard to Esperanza.'",
        "'speaker_6': 'So I'm really happy about that. The other comment I'd like to make is in one of your slides, you mentioned project based Section eight Subsidies for Foresight Site. So off the top of your head, do you know how many subsidies went into site?'",
        "'speaker_8': 'A Yes, as long as you don't quote me, but I think I believe that we put a let me do the math on this. I think you in public.'",
        "'speaker_0': 'You know.'",
        "'speaker_8': 'I do know that. I do know. But I think Eden will correct me if I've got it wrong. We put either 20 or 25 in the senior building and those actually. I'm sorry.'",
        "'speaker_0': 'Well, we're doing this. We have 28 of the units in the senior building set aside for formerly homeless veterans. Does this correspondence.'",
        "'speaker_8': 'Actually doesn't they have they have a few more. But also those vouchers are all for homeless veterans, those with special allocation vouchers that we got. Some of them went into Everett Commons. And I want to say another I want to say 25 went into a map.'",
        "'speaker_8': 'I'd be happy to send you the exact numbers. And then more recently, actually just a couple of weeks ago, we accorded them 16 more for the family side. The difference with that is actually they're not veteran vouchers, so they're available.'",
        "'speaker_8': 'It's a family property. So we wanted to have family vouchers available.'",
        "'speaker_6': 'While I was going with this question, though, is because they're project based vouchers. They, while granted, is 25, they they can assist in the cash flow of the city project, whereas the housing choice vouchers families can take it wherever, you know, they they they they so choose within.'",
        "'speaker_6': 'Absolutely so so while it's 25 those project based vouchers that site a especially since it's been constrained somewhat with regard to financing they've been very helpful in terms of, you know, making cash flow penciling basically.'",
        "'speaker_8': 'Yeah, we were very excited. It's a 20 year contract. So it's, you know, it's that number of vouchers times 20 years, which is something we were able to push out with some new legislation in hard. And they can come back to us in 20 years and talk to us about whether we could possibly do another 20.'",
        "'speaker_8': 'And I agree with you, I appreciate you pointing that out, that these project based vouchers are valuable because you can borrow against them, you can borrow back against the future cash flow. So you can then actually reduce your your financing costs.'",
        "'speaker_0': 'Thank you, counsel. Brody, did I see you?'",
        "'speaker_5': 'Well, I.'",
        "'speaker_0': 'Know.'",
        "'speaker_5': 'I'm going to talk about like, well, the referral.'",
        "'speaker_0': 'We so I think if we've completed questions, council questions about the staff report, then we will move on to the counsel referral and then we will take public speakers all at once for that. So so then you can probably have a seat.'",
        "'speaker_0': 'Thank you very much. Los Angeles up then. Thank you. Okay. So then this is where we segue way over to item nine a madam Kirk, do you want to remind us what that is?'",
        "'speaker_3': 'Consider directing staff to present options to the Council on increasing accountability of and addressing potential conflicts of interest issues at the Housing Authority.'",
        "'speaker_0': 'Okay. And this was brought by Councilmembers Vela and Otis. So how how do you all want to present this?'",
        "'speaker_5': 'We don't get counted on our time, right?'",
        "'speaker_3': 'I mean, it's for the press. I mean.'",
        "'speaker_0': 'You're the present, okay?'",
        "'speaker_5': 'I won't. We won't. I mean, I won't speak for my colleague, but I'm sure we will take an hour and 25 minutes.'",
        "'speaker_0': 'I can step.'",
        "'speaker_5': 'Behind you if you want to start. You can. Otherwise I can. And you could fill in whatever I miss. Okay. So the reason for this referral, as you know, we've put a lot of what some landlords consider burdens on them in the city.'",
        "'speaker_5': 'Private landlords, yet we haven't, in my opinion, put the same accountability on our housing authority, which is actually run and operated by the city. So the first issue to me is an issue of fairness, that if we're asking our private landlords to do something, it should be the same thing that we're willing to do as the city'",
        "'speaker_5': ', being the landlord and our residents being tenants. The other area and the main area of concern I have is when people come to me and I've had a number of people come to me and in the five years we basically can't do anything.'",
        "'speaker_5': 'We're not allowed to get any information, we're not allowed to ask questions. We're not even there's even no way for us to request that there's something that comes out here in public. So, I mean, there was a comment, you know, I just want to bring up there was a comment.'",
        "'speaker_5': 'I think it was directed to me because I did have a someone call in complain about parking at and B demand and she had a parking space next to the diamond, next to the door. And then she was moved and she has trouble walking.'",
        "'speaker_5': 'So in the private sector, that tenant would be allowed to file for reduction of services in the HRA is we were just told, too bad, so sad. You got to deal with it. There's nothing you can do about it.'",
        "'speaker_5': 'And then if we can go, there's that slight still up there appeal process.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_5': 'So if you look at that blue area and I think this is what my colleagues were getting at, that entire blue area is within the purview of the Alameda Housing Authority. There is no outside recourse for the city council.'",
        "'speaker_5': 'There is no appeal to the city manager to try to get information. There's nothing. It's all inside. Now, granted, it may be department A versus department B, but it all reports up to the same person. And this process of judicial review, you actually have to file a writ.'",
        "'speaker_5': 'And what you file a writ to do is to undo a government action. And the government action you are seeking to do is the removal or the revocation of the voucher. So let's be clear here that at that line, that tenant no longer has a voucher.'",
        "'speaker_5': 'So what that means practically for that tenant is they don't have housing because a person with a Section eight voucher, if they're not if they don't have their voucher, they're on the street. And I just had an experience with this in my last job.'",
        "'speaker_5': 'She was kicked out. She filed a writ. It took forever for the writ to be heard. She won 22 page decision. The housing authority, granted it was not here. It was in Oakland, appealed, and then it went up on appeal and it got reversed.'",
        "'speaker_5': 'So it was like a three year process for this appeal appeal process. And in the end, she's still homeless. So to say there's an appeal process, yes, there is. But you have to become homeless basically before you can take advantage of it.'",
        "'speaker_5': 'And the same thing down at the bottom. Well, you know, if we as a council wanted to evict one of our tenants, whether it's a resident or a commercial tenant, we have to sign off on initiating that litigation.'",
        "'speaker_5': 'There's no accountability here for any of us. So and let's just talk about this court mediated mediation and stip and pay. So a lot of times they'll have a stipulation and they'll say, well, you can stay if you do X, Y and Z.'",
        "'speaker_5': 'Well, the judge in the jury of who violates X, Y and Z is the housing authority. So again, it's all under one umbrella. And if a tenant feels grieved, there's no accountability. So I have others and I'm sure some people are going to talk about others.'",
        "'speaker_5': 'But when I have a resident of Alameda, the city where I'm elected to serve and help solve problems for and she says to me in a letter that someone at the Housing Authority told her when she wanted her front door lock fixed.'",
        "'speaker_5': 'You don't you can't expect vanity. You have to understand you're a Section eight voucher holder. Now, to me, there's nothing I can do about that, nothing at all. And for me to sit here and tell one of my constituents that there's nothing I can do, it just it's just it's just not right.'",
        "'speaker_5': 'So I realized we had this discussion a few years back, and I think. There was a binary choice back then. It was either bring it back into the city or leave it alone, and the binary choice was made to leave it alone.'",
        "'speaker_5': 'But I do believe that there is a continuum of of things that we could do in this referral. And I think at the very minimum, you know, I don't really want to disrupt the way the housing authority operates, but I would like to see some minimal oversight, at least through when people are having trouble losing their vouchers'",
        "'speaker_5': 'and have us, as the council, have the ability to speak to the housing authority and have our attorney get information and maybe even look at rents, because we have told our private tenants or private landlords, you can only raise your rent 70% of CPI, but yet our housing authority can do whatever they want.'",
        "'speaker_5': 'And there's no oversight on the city for this by the city council on that. So I would I would like to see some type of oversight in some of these areas. Elimination of tenancies, elimination of subsidies, maybe budget, maybe rents, but then keep the rest of, of the, uh, the functions the same.'",
        "'speaker_5': 'And one thing I did see on the Internet today that someone said, well, you could just get rid of the board members. I mean, I don't want to get rid of the board members. I'm not saying that. But no, we can't.'",
        "'speaker_5': 'The Housing Authority board is there's a special I think it's health and safety code section that protects them so only the mayor can get rid of them and only with cause and there's due process. So in my opinion, the Housing Authority Board, I, I'm not going to criticize them, but they have no accountability to anybody, any elected'",
        "'speaker_5': 'official. And we're the only people that have accountability to the citizens. So I would like to have all of our residents, whether they live in a private landlord home or a regular owned home or a housing authority home that we, the city technically operate, can have somebody that can act on their behalf and that there's accountability for'",
        "'speaker_5': 'them to the city council and elected officials. And I'll let my colleague take over and see if I missed any.'",
        "'speaker_0': 'Thank you. I'm actually still conducting the meeting. I will call on Councilmember Vella and then I'm going to have a few things to say.'",
        "'speaker_9': 'Councilmember Vella So a couple of things I did want to clarify that the housing authority is not under the city control. They're separate, which was what we considered in 2017, was bringing them back in in 2012, I think was when we separated.'",
        "'speaker_9': 'So that as an aside, I think the general purpose of this referral and I want to get back to it is to direct staff to present options to the Council on increasing accountability of and addressing potential conflict of interest issues at the housing authority that have been raised.'",
        "'speaker_9': 'We've had a number of residents come to our meetings and express a concern. I think that, you know, the first, at least in my mind, the first place to start is kind of hearing from everybody about what the process is finding a way to perhaps.'",
        "'speaker_9': 'You know, I think that the slide with the appeal processes is helpful. I think would be helpful if we could have it, you know, posted even on the city website and try to get people on the same page.'",
        "'speaker_9': 'I also think that this allows at least what I'm looking for is kind of a the different options for for the council in terms of addressing the underlying issues. And I there are a couple that I think are a little more nuanced, at least that I would like to hear about that I think thematically seem to be'",
        "'speaker_9': 'issues. One is. This issue of transitioning from independent living. And I think that that's a substantial one, that perhaps, you know, one of the options that staff could present to us is forming some sort of stakeholder group or task force that's broader to help address that.'",
        "'speaker_9': 'And I think we've heard from Vanessa that and I think this is just a general concern is we have an aging population in general. There is that gray area of assisted living. And what are the options? Because I think some of these issues are going to continuously come up and it is about preserving dignity.'",
        "'speaker_9': 'And I would hope that we can work either through Shrub or Disability Committee and with the Housing Authority, APC, some of these groups to actually address what that might look at and what would be involved in that. I think the other thing is just that there's an overall issue of code enforcement.'",
        "'speaker_9': 'And I think when we talk about when we talk about options for increasing accountability, potential conflict of interest, if we, the city are not providing a very standardized and clear process and actually following through with code enforcement issues, we're failing everybody because it's it's not just building code.'",
        "'speaker_9': 'It's health and safety issues. And it creates a record and it's an independent third party resource that we could offer that I think evens the playing field out for everybody. And then there's a record and it's not about, okay, I complained to the Housing Authority and if you're a resident of Alameda, you should be able to file'",
        "'speaker_9': 'a code enforcement. So maybe that's one of the options that gets looked at. The other thing is, again, so so I think to Councilmember Otis point, it's not about, you know, an either or there might be a continuum of different options.'",
        "'speaker_9': 'Those are the types of things that I would like looked at. I think also with the appeals process clarifying who if there are retirees that are the hearing officers, if I don't know what the cost is for that to have those individuals come in, I think that sometimes it's it's not it's the perception of bias or the'",
        "'speaker_9': 'lack of understanding of who is actually filling that role. I think sometimes people might get a little heartburn if somebody that reports to the same person is on that panel, I think clarifying who sits on that panel or who serves as a hearing officer and what training they've had, that could be something that's of assistance.'",
        "'speaker_9': 'So I think that there are things that are of no cost to also think that there are potential solutions out there that kind of are across the board, things that I think thematically everyone deals with and it that I will that that that's my introduction to at least where I'm coming from.'",
        "'speaker_0': 'Thank you, Councilmember Vella. I'm going to say a few things here. I have sat in this position at this dais on more than one occasion and defended my colleagues on this dias from ad hominem attacks by members of the public.'",
        "'speaker_0': 'So it pains me greatly to see that process in reverse. From this dias, there is absolutely no reason to attack a volunteer board, a very qualified individuals who serve as the housing authority board of directors. And to say that they have no accountability were the only ones accountable to them, to the citizens.'",
        "'speaker_0': 'I'm also going to give Vanessa Cooper and whether misspells the attorney or anyone else who would like to address some of the fairly strong accusations that were made. And I also want to say this, and I've said this before housing issues are something I take very seriously.'",
        "'speaker_0': 'And I think most of you in this room know this. And I mean, I'm sure we all do. I know we all do on this. DIAS What I don't want to see and what I find counterproductive is to make this a an a process where someone has all the virtue and someone is all evil.'",
        "'speaker_0': 'It does not have to be an adversarial process. And for goodness sakes, we just sat through a presentation of all of the things that the housing authority is doing. And I we we are fortunate in this city to have this housing authority working for our residents in some of our most vulnerable residents.'",
        "'speaker_0': 'Are they perfect or are there things that could be done better? No, they're not perfect. Neither are we. Could we all do things better? Absolutely. Is the way to get to that point by hurling insults at people and making them just feel defensive or do we want to engage in a dialog?'",
        "'speaker_0': 'So at the end of the day. We're protecting the most people and keeping them in their homes because we all take homelessness seriously. And the best way to keep people from becoming homeless is just keep them in their residences to begin with.'",
        "'speaker_0': 'When it comes to losing vouchers, I would like some numbers. So we have some specifics to see just how widespread an issue this is. But I will also say this for the last couple of council meetings, we have had representatives of a particular advocacy group cannot be at the dais and make all kinds of accusations about the'",
        "'speaker_0': 'housing authority speaking on behalf of residents. I am someone who works as an arbitrator, who is an attorney who takes very seriously making informed decisions. You never want to be in a position of only considering one side of an issue and then making your decision.'",
        "'speaker_0': 'This serves no useful purpose. But as Ms.. Cooper stated, she is also limited by what information she can share without the permission of a tenant. So I took it upon myself, met with the city, the city manager, and we we take these issues very seriously.'",
        "'speaker_0': 'And he's very solution oriented. And I said, I want to arrange a meeting with Vanessa Cooper, Greg Katz, yourself, myself, and this member of this advocacy group. And we scheduled it. And I just wanted everybody to sit around the same table and talk to each other as opposed to about each other from a one sided forum at'",
        "'speaker_0': 'the last minute. The advocacy group representative canceled. We didn't cancel the meeting. We you know, the four of us met and we heard a lot of things and, you know, looking for solutions. Late this morning, the city council got a list, a long list of complaints about the housing authority.'",
        "'speaker_0': 'This the housing authority that again, hours before the city council meeting. This is an opportunity that I see to address some of these concerns. But I want to hear it from all sides because there is often more than meets the eye.'",
        "'speaker_0': 'These are complicated situations and I just don't feel that anything is gained by attacking people who, just like us, are volunteering, who are sharing their expertize and their time to deal with some pretty tough issues. So I do want to give Miss Cooper the opportunity to address some of those allegations or whoever is most appropriate to address'",
        "'speaker_0': 'them, please.'",
        "'speaker_8': 'So I'm not going to address the allegations specifically, but I do want to come to the situation that we had where we were not able to speak with the advocacy group. You know, the housing authority has been around for 75 years.'",
        "'speaker_8': 'We're not going anywhere and we don't think the advocates are going anywhere. And we think the advocates have an important role. I keep hopefully I've conveyed this. We believe in housing people. We come to work every day to house people.'",
        "'speaker_8': 'We make extra efforts so people are not unhoused. I do want to say that just because a very small number of people lose their tenancy and that doesn't mean the housing authority is necessarily doing something wrong. The city does evict people, too.'",
        "'speaker_8': 'And it happens. I think you can talk to private landlords as well. But what I do want to suggest and with the advocates groups, we've actually this isn't new for us as we went through the rent stabilization process and there were very long weekends when Debbie and Michael and I were emailing on the phone trying to put'",
        "'speaker_8': 'those regulations together. The Housing Authority consistently tried to meet with the advocates. We met the first time and then were not able to do that. And so what I'd actually like to suggest, because we're really are all in this together, we really do want to house people who are the most vulnerable, who have the least resources, is'",
        "'speaker_8': 'that perhaps we could look at something like a facilitated conversation through seeds. I do think that there's information on both sides that needs to pass. I'm not going to be able to breach the privacy of a tenant unless that tenant elects to do so.'",
        "'speaker_8': 'But I think there are systems that can be discussed. There's information that can be passed on. I think that sometimes when communication lines are crossed, both sides get frustrated. You know, I'm not going to tell you that my staff don't get frustrated, that I don't get frustrated.'",
        "'speaker_8': 'And I think that it's really it's the time to come to the table with a facilitator, a mediator. We certainly had great success with seeds. I feel like there are very good, neutral third party, but certainly if there was someone else that was proposed, we'd be happy to do that.'",
        "'speaker_0': 'Thank you. Okay. Council members who brought this council referral. Is there more you want to say or do we go to public comment? Or any council comments.'",
        "'speaker_9': 'Councilmember Vela So I do want to say that I've I've heard from the activist group and I have heard from individual tenants. I've also met with Ms.. Cooper. I do think that there is something to a, you know, getting together and talking through some of the specific issues that are here.'",
        "'speaker_9': 'And I also just want to say that I think that there could be a wide range of of solutions that get to the underlying problems, some of which are communication issues, some of which are kind of making very clear what the processes and who's involved.'",
        "'speaker_9': 'I think other things are, and I guess my concern is I don't know how like taking over authority of the housing authority solve some of these issues unless we're going to be doing things like the code enforcement or unless we have a plan for how to transition people as they, you know, have have more and more needs'",
        "'speaker_9': 'that they that they have. And I would like us all to be working collectively on this and collaboratively. But I also think that, you know, there are clearly people who are feeling very frustrated and who feel as though that, you know, this process is not working for them.'",
        "'speaker_9': 'And so I'm hoping that we can find some way to address that issue.'",
        "'speaker_0': 'Thank you. Mr. Murphy And then Mr. De Soto, real briefly.'",
        "'speaker_5': 'I don't think I attacked anyone. Somebody sent me an email or a paper letter, and I conveyed the complaint that she gave to me. So there's no way I can find out the other side of the story. So that's something that I think is missing here.'",
        "'speaker_5': 'And to Ms.. Vela's point, the referral was not to do one thing or the other. It was to bring back options. So I'd appreciate options no matter what they are. And lastly, the fact that there has that there's no accountability to an elected official is a fact.'",
        "'speaker_5': 'It's not an attack. It's not an indictment of anybody doing anything wrong. It's just a fact. So if there's ways we can go about improving that accountability and without violating confidence, you know, if there is two sides to every story, we're only allowed to hear one.'",
        "'speaker_5': 'So maybe there's a way that we can hear the second one. And if you hide behind a wall and say, that's just the way it is, then you know. That's kind of where we're at.'",
        "'speaker_0': 'Um, yeah, I'm not sure I heard anyone say that, but I would also ask that when staff considers our direction, they also consider the implications of politicizing the housing authority by bringing in elected officials for oversight. But I agree that we need to look at a lot of different options.'",
        "'speaker_0': 'Councilmember Desai, you had your hand up.'",
        "'speaker_6': 'Oh, yes. Well, thank you very much. I think I'd like to make two points. The first point is, in my initial tenure as a city council member, the city council member was ultimately the governing board to which the Housing Authority commissioner is reported to.'",
        "'speaker_6': 'At that time I don't recall the governing board serving in, uh, in a, like a capacity that's similar to the way that the RAB serves. For example, when a tenant has concerns about issues with their respective landlords, particularly with regard to rent increases through the process, which has now changed obviously through the Rabb process, they could they'",
        "'speaker_6': 'could go through they could appeal those kind of landlord decisions. And if they weren't satisfied with the decisions through that process, then they could take it to the city council. Now, when I was on the council from 19 December 96 to December 26, I don't recall the city council serving in as a last resort for the most'",
        "'speaker_6': 'part. We were there to work with the Board of Commissioners in setting policies and giving them guidance as to where we thought their level of effort should be placed. Second point is, so I'm satisfied with the decision by then city manager John Russo to delink the housing authority from the City Council, largely because I believe that the'",
        "'speaker_6': 'housing authority and the Board of Governors is basically serving the same ends and utilizing, for the most part, the same means that they had utilized when they were when the housing authority through the governing board was directly linked to the city council.'",
        "'speaker_6': 'So I think independence from the city council has worked for the most part, and so I don't see anything fundamentally broken, which leads me to the third point, and it does have to do with this appeal process. My understanding of this appeal process is that it is, frankly speaking, quite an articulated, transparent process as you can get'",
        "'speaker_6': '. Largely, it has to do with the fact that, you know, when the federal government makes available dollars through the Section eight program or project based vouchers or through any other, in addition to making available dollars for purposes of housing are qualified families, the federal government is also going to impose certain rules and certain expectations.'",
        "'speaker_6': 'And so part of those expectations and rules comes from the Code of Federal Regulations, which then our respective housing authority through the administrative what's called the administrative plan, then operationalize the different rules with regard to the program operations.'",
        "'speaker_6': 'And so the first line that you're seeing, Section eight Subsidy Arrow is going to program violations, going to. That's all about the following the administrative rules that the heard that Congress first has set up, that HUD then interpreted that HUD then asks local government the housing authorities to then implement.'",
        "'speaker_6': 'So they're implementing federal rules laws into bureaucratic, bureaucratic language. That's that's HUD's job. And then those bureaucratic language then is sent down locally to housing authorities to be implemented through the what's called the administrative plan. And so when what you're seeing here is an appeals process that goes step by step, at least the first level that deals'",
        "'speaker_6': 'with administrative issues. And it's meant to be so that families and individuals are treated fairly with respect to a standard set of rules and processes that people can easily see. And this is important because it's completely possible that places like in the East Coast in the 1950s and the 1960s, you had a housing authority that maybe didn't'",
        "'speaker_6': 'follow standard rules.'",
        "'speaker_0': 'So, Mr. Desai, if I could just stop you for a minute. So we we aren't quite at the point where the councils exactly as we have, I'm sure a lot of public speakers who want to speak and then come back.'",
        "'speaker_0': 'I think our discussion will be even more informed when we have when we have the hear from the public speakers. But right now it is, oh my goodness, approaching 11 p.m.. So we need a motion to consider to be able to consider the remaining items.'",
        "'speaker_0': 'And they are 60, which is the rent ordinance. We have a one speaker on that six F, which is the safer grants, one speaker on that and nine be the de pave parkway for three speakers on that. Do I have a motion to continue and if you want to continue to a time certain to keep us on'",
        "'speaker_0': 'track or do we have a motion at all?'",
        "'speaker_9': 'Madam Mayor, two speakers on this item.'",
        "'speaker_0': 'Bill, I bet we do. 11. 11. But you thought none?'",
        "'speaker_2': 'No, no. I wanted I wanted to know because I was going to we're.'",
        "'speaker_9': 'Going to make a motion to continue to a time certain.'",
        "'speaker_2': 'But I'm a little concerned.'",
        "'speaker_0': 'So failing that this well what I would suggest when you mention time certain but it's your call I know we're on the same flight tomorrow, but we could say we will continue until X time.'",
        "'speaker_2': 'Baby.'",
        "'speaker_0': 'I know.'",
        "'speaker_9': 'I'm fine. Continuing until midnight or 1230, but I. I may need to.'",
        "'speaker_0': 'I just did right now. So shall we. 11. What other people? Your thoughts? Councilor.'",
        "'speaker_5': 'I'd like to hear the at least the safer ground if.'",
        "'speaker_0': 'You which your time.'",
        "'speaker_5': 'I'm fine with whatever time people agree with. I just like to hear the say for.'",
        "'speaker_0': 'Grant and I just wanted to say something.'",
        "'speaker_9': 'So I'd like to make a motion to continue until 1230.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': '1230, maximum second, reluctant. Okay. Okay. We have a motion, a second to continue to 1230. But that doesn't mean we have to hold out till 1230. All in favor I in the opposed abstained and then it passes. Thank you.'",
        "'speaker_0': 'Okay. So we are going to go to public speakers and I heard the clerk say we have 11, which means you each get 2 minutes and we'll keep this moving. If you, Miss Basinger will read several names in advance, just be ready to scoot out and screwed up.'",
        "'speaker_0': 'And when it's your turn. Okay.'",
        "'speaker_3': 'Dallas Chroma Dell's chroma death said turn our Minda Grayson.'",
        "'speaker_7': 'Definition is some speakers on. She said.'",
        "'speaker_0': 'I may be the clerk. I'm sorry. The clerk will convey the message. Thank you. Yeah. Okay. So do I have the first speaker? Is that you? Come. Hi. Hi. Good. And you are?'",
        "'speaker_2': 'I'm Reverend Ilse Cormack.'",
        "'speaker_0': 'Hello.'",
        "'speaker_2': 'I'm waiting for. Can I see the times? No, I'm not going over. Okay. Oh.'",
        "'speaker_0': 'She should be able to see that time. Can you see? Is it up there?'",
        "'speaker_2': 'Can't see it yet. There it is.'",
        "'speaker_0': 'There it is. Okay, wait. Because I see it on the little screen. Now start her over at the very top. And you're Mark.'",
        "'speaker_2': 'I am Reverend Douglas Cromer. I live with my mother at Independence Plaza. I've lived there a year and I had to come live there to be her caretaker. And, um, so my mother's very concerned about the rent increases, and several of the tenants have come to me just a very concern.'",
        "'speaker_2': 'It seems excessive to me. I'm 56 years old. I've been renting most of my life and I've never seen such a dramatic rent increase. Like we're going to go absolutely to the letter of the law, 5%, you know, every year until you reach a frozen amount and you can't go up any more.'",
        "'speaker_2': 'So we know we have a ceiling, which is great, but it seems excessive from going from, you know, as much as 20 years with no increase. Now, some increase is reasonable. I understand that it seemed excessive over a short period of time.'",
        "'speaker_2': 'So we're going from 0 to 5% a year. So that's now $600 a year. The next year, another 600 saying if you get 1200 dollars a year, extra, $800 a year, the third year. That's gone down this year.'",
        "'speaker_2': 'And but I found out that was because of the law. And I asked to speak to two of the people from the Housing Authority. They very kindly got to me right away and and gave me some very good information.'",
        "'speaker_2': 'But they they left out some important thing. I only have 21 seconds left. Okay. What was the important thing? Because I want to be fair to them, and that's the important thing. I really appreciate you saying we're all on the same side.'",
        "'speaker_2': 'The people I talked to were very kind. They care about homeless people. They care about low income people. But it's too high. It's not low income enough. Okay.'",
        "'speaker_0': 'Thank you all then.'",
        "'speaker_3': 'That's Southern. A man are Minda Cross and Cynthia Alvarez.'",
        "'speaker_2': 'Good evening. My name is Beth Southbourne. I'm the executive director of Life Steps. It's a nonprofit social service agency that oversees 34,000 homes throughout California. We work with numerous housing authorities, as well as private and for profit and nonprofit developers.'",
        "'speaker_2': 'The concept of life service started in 1996, so not just build affordable housing in bricks and mortars, but actually really help the needs of the communities that we serve. I personally used to run a homeless shelter. I've been a homeless advocate for over 30 years, both singles as well as families.'",
        "'speaker_2': 'And we do a lot of clinical work here at Life Steps and taking people off of Skid Row into housing. We developed our model at preventing destabilization because I was too tired of watching people being evicted. So that is the premise of why we developed our intervention social service pieces.'",
        "'speaker_2': 'We educate our developers, our management companies, our residents on using us before it gets ugly. And the more we get involved in the beginning, the easier it is oftentimes for us to have an outcome that's positive. Since 2000, when over 80% of our referrals have prevented housing destabilization, we can't fix everything, but we certainly do.'",
        "'speaker_2': 'Relocate people is as much as we possibly can. If we're not able to prevent the destabilization. So with that said, I'm here tonight for any questions that you guys may have of our social services. We also are stringent on our client confidentiality.'",
        "'speaker_2': 'We will not be discussing individual cases because we believe that dignity and the respect of the residents are utmost in our own integrity as well as their own value to be able to live independently.'",
        "'speaker_0': 'Thank you and thank you for the good work that life steps provides in a sphere.'",
        "'speaker_3': 'Are integral, says Cynthia Alvarez and Lynell Jordan.'",
        "'speaker_2': 'Getting in council. Mayor Phil and I'm here today to ask for over. Can I hear me? I'm here tonight. I did have two speakers. One got the flu a couple of days ago, so is bedridden and the other one is scared of retaliation but is willing to talk to you, writing you a letter with their concerns.'",
        "'speaker_2': 'So I'm again speaking. So I today I got my file. I went through my file before we came here. I noticed there was four copies of everything, just like the packets this big, but it's really this big because I got like quadruple copies of stuff.'",
        "'speaker_2': 'The things that we requested, me and my lawyer, they were not in there. The complaints that I've been complaining about my mold and my sewage flooding, not there. No call logs of that at all. Tampered with, maybe. Why did it take so long for me.'",
        "'speaker_9': 'To get my view? And why did.'",
        "'speaker_2': 'I show up to my appointment.'",
        "'speaker_9': 'And yet denied?'",
        "'speaker_2': 'Why was the reasonable accommodation letter there and.'",
        "'speaker_9': 'Sat and held.'",
        "'speaker_2': 'And not given to me? Discrimination. Harassed, bullied? Yes. They got my face told me my mind might be slipping a little bit. Nope. I'm just tired. What are our protections like? They can bully us, but we can't bully them.'",
        "'speaker_2': 'We get, you know, written up, get kicked out of the program. But why can they do it to us? We need you guys. That's it.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_3': 'Cynthia Alvarez, then Lynell Jordan and Kenji Tamaki.'",
        "'speaker_2': 'Good. Good evening or almost good morning. My name is Cynthia Alvarez. I'm the deputy executive director at the Housing Authority of the city of Alameda. I started there about three or four months ago, and I just actually wanted to come forth and say a little bit about how I came to be here.'",
        "'speaker_2': 'I've actually been following, you know, I'm a house. I've worked in nonprofits for a number of years. Most recently, I was in I live in San Francisco and I was working in San Francisco, a short BART ride, 15 minutes.'",
        "'speaker_2': 'And I actually I was working for DC Tenderloin Neighborhood Development Corporation. I thought my job there, this is where I want to retire from. They do such great work. They really go deep into the community and provide enriched services and strong housing.'",
        "'speaker_2': 'They really are a leader. But at the same time, I've been following the city of Alameda, this housing authority here, they you know, being a high performer is not an easy achievement. And I, I had actually been reading the monthly reports that are posted on the website.'",
        "'speaker_2': 'I follow different folks for different reasons. It's just my thing because I feel like I can learn something and implement wherever I may be. When the opportunity became available for this position, the one that I now hold. I jumped at it, even though it meant a longer commute.'",
        "'speaker_2': 'I have three very young kids at home, and so it meant.'",
        "'speaker_8': 'Some give.'",
        "'speaker_2': 'And take some sacrifices, if you will. Not really sacrifices because of the work that this agency does. I am extremely proud and I was so grateful to be given the opportunity to join a team of such committed individuals.'",
        "'speaker_2': 'And again, I was at a place where I thought I was good for but this agency and now being in it, the depth of services, life steps, the involvement of everyone within the agency and really trying to preserve housing and having people thrive where they are is really exceptional.'",
        "'speaker_2': 'And it is not something that is discussed enough. You know, the agency continues to look to see how we can do better and more. And thanks for your time.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'LA Now, Jordan, can you tell me hockey and Jeanette? Janet Boston.'",
        "'speaker_10': 'Hey, good evening. My name is Lynnette toward in kind of doubled up those L's. But anyway, I'm the director of housing programs with the City of Alameda Housing Authority. And I was raised here in Alameda. And my dad worked at the Naval Air Station all my life until he retired.'",
        "'speaker_10': 'And I came here from the Housing Authority in Sacramento, where I worked there for 12 years, and they have over 18,000. Vouchers is a very large housing authority. But when I had the opportunity to come back to Alameda and work here, though, it's a smaller agency, you might have thought the work would be smaller, but it's not'",
        "'speaker_10': '. It's larger. It's a lot more work because you're hands on on a day to day basis. And I was so impressed with the way that we do have so much supportive services for the clients here and all the steps that we take before any ever trying to take anybody's voucher away.'",
        "'speaker_10': 'That's just not something they do here. In 2016, we created the Bay Area Directors Roundtable and we still chair that group now. And that's all that housing authorities here in the Bay Area and as far away as Monterey, they come and meet every quarter and we get together and talk about back best practices.'",
        "'speaker_10': 'And some of the other housing authorities are just really shocked when we talk about the things that we do do here at Alameda housing to support our tenants. And then they've actually asked me for different things and I've passed on information to them and showing them some of the ways.'",
        "'speaker_10': 'So we're kind of leading in the industry and I'm really proud of that. I enjoyed my time in Sacramento. I loved working there. I come to hours every day. I still live in Elk Grove, California, but I wouldn't commute this far if I wasn't committed to this, and I didn't believe in the stuff that we were doing'",
        "'speaker_10': 'here in Alameda. I just wanted to let you know that.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Kenji, Tammy, Okie, Janet, faster than Katherine Polley.'",
        "'speaker_11': 'Thank you. My name is Kenji Tamaki. I'm the vice chair of the Housing Authority Board of Commissioners and the Alameda resident for 20 years, an active volunteer with the Scouts for ten years and on the board of Commissioners for four years.'",
        "'speaker_11': 'And I also want you to know that my entire career is focused on affordable housing. What I'm about to say reflects almost 30 years of experience. And throughout my career, I've worked with many affordable housing owners, and the staff of the housing authority are among the very best.'",
        "'speaker_11': 'That doesn't mean they do everything perfect and they can't do everything a tenant may ask for. But if anyone accused the staff of being unresponsive or not caring, that doesn't match my experience at all. And having said that, I'm aware that some tenants have alleged that they've been mistreated by the housing authority.'",
        "'speaker_11': 'And in situations like this, it's I think it's important that a tenant be able to file a complaint with an outside agency who, without any conflicts of interest, can review the housing authorities actions. And this complaint should be able to filed at any time.'",
        "'speaker_11': 'It shouldn't just be in response to a housing authority action. And fortunately, I think there are multiple agencies that are responsible for doing that. You've heard them described in the presentation, but more in the context of an action against the tenant.'",
        "'speaker_11': 'But in fact, HUD and the California Department of Fair Housing and Employment will review any tenant complaint at any time about property, condition or discrimination. This tenant this complaint can be submitted by phone or by fax or mail if the issues an eviction you've heard about how cases can be heard before a judge and these agents are'",
        "'speaker_11': 'really qualified to handle these issues because they have experienced staff, legal power to gather evidence from both sides and authority to enforce the decisions. And that's a real weakness in trying to resolve these tenant issues through city council.'",
        "'speaker_11': 'City Council obviously needs information from both sides and people. Other speakers have spoken about the problems of tenants revealing their private information. So that raises the question what can council members really do for a tenant? And I think that the first thing you should do is ask the tenant, have they filed a complaint with these agencies and'",
        "'speaker_11': 'how did that review go? You can review the situation and see how it goes from there.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Janet. Pastor Catherine Pauling, then Kathleen Mertz.'",
        "'speaker_2': 'Good evening. My name is Janet Basta.'",
        "'speaker_9': 'And I'm the director of Human Resources and operations at the Housing Authority. I'm also a resident of Alameda for over 30 years now. I've raised my family here and my children have attended Alameda schools. I've spent my entire career in public service.'",
        "'speaker_2': 'And I want to say that rarely have I worked with a group more talented and dedicated to addressing the needs of the population that we.'",
        "'speaker_9': 'Serve than the colleagues I have at age. The work is challenging.'",
        "'speaker_2': 'Vanessa spoke earlier about the challenges the receptionist has on a daily basis of.'",
        "'speaker_9': 'Telling people no, but it's extraordinarily.'",
        "'speaker_2': 'Gratifying to help families in need. We have a very, very committed staff, and as an agency we spend a lot of resources training them to do, you know, help our clients, make sure.'",
        "'speaker_9': 'That we administer the programs that we run the way that they should be run.'",
        "'speaker_2': 'We do.'",
        "'speaker_9': 'Certification programs in running the Section eight.'",
        "'speaker_2': 'Program, for example, or conducting housing inspections. We do a lot of.'",
        "'speaker_9': 'Customer service support trainings. So we are really committed to building our staff skills and helping them to address, address and serve our clients.'",
        "'speaker_2': 'I joined the Housing Authority four years ago as I wanted an opportunity to have an impact in the community where I live. And it's been.'",
        "'speaker_9': 'An honor and a privilege.'",
        "'speaker_2': 'To help the Housing Authority address the housing crisis. I obviously support the agency on the administrative side, and I'm proud.'",
        "'speaker_9': 'To do so.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_3': 'Katherine Pauline, Kathleen Mertz, Mike Poochie.'",
        "'speaker_0': 'By the way, you are all doing perfectly staying right in your 2 minutes.'",
        "'speaker_2': 'And I almost feel like I should have a chance to respond, since you did use the ad hominem attack against me. Um, you. I got a call at Thursday at 559 for the meeting on Tuesday. I contacted you first thing Monday to say we would not be prepared for that Tuesday.'",
        "'speaker_2': 'So don't tell me that I turned down the offer, too. And I very clearly stated we wanted to prepare in order to have a meaningful meeting and find meaningful, lasting solutions. So we have always expressed the willingness to be able to discuss and do it.'",
        "'speaker_2': 'What's been happening is there's very clearly winners and losers. So you're going to have we had an hour and a half presentation. We've had half a dozen speakers basically saying how wonderful they are themselves. And we have people and photos and files that take three months to get and then aren't even complete.'",
        "'speaker_2': 'So there is a gap in information here. There is a serious problem. People who used to love where they lived are now so rule bound that they describe their living situation as oppressive and run more like a prison.'",
        "'speaker_2': 'So there is a big gap and the wonderful colorful slides and the presentation. I don't doubt that this group has been very effective in managing money and developing real estate. I know Vanessa has an incredible background in real estate and development that that's why she's hired and she's done a lot for the city.'",
        "'speaker_2': 'I'm not villainizing anyone, but there is a serious problem here and people are being treated very badly. And now we're at 1115 at night. And the elderly, the disabled, the parents with children were not able to stay. And they were too afraid to speak personally because there have been some very rude and bullying comments made and people'",
        "'speaker_2': 'are afraid.'",
        "'speaker_0': 'Thank you. Our next speaker is Kathleen Mertz.'",
        "'speaker_3': 'Mike Poochie, then Svetlana Regina.'",
        "'speaker_2': 'Are limping. Hi, everyone. I'm Kathleen Mertz. I'm the director of housing and Community Development at the Housing Authority, which means that I oversee the real estate development aspects of the work that we do, as well as I implement the city's programs working with that, be partner shop for like the CDBG home program, also oversee asset management of'",
        "'speaker_2': 'our properties. I started in well, one, I'm going to allow me to read her and a resident. Also, I want to say that too, which is part of why I started in March 2017. I used to be working for a national nonprofit that actually works specifically in low income senior housing and when working in real estate and'",
        "'speaker_2': 'in the field of community development. But on a national scale, I had a little bit of this kind of moment of my life of saying, I'm working in a room, improving these buildings by building, but what am I doing in my community myself?'",
        "'speaker_2': 'So I had this opportunity to come work for the housing authority because if there's if you want to work in affordable housing in this town, there's one place to go. And I've never regretted that decision. I worked very hard with a bunch of really talented people, and I like to say that we're small and we're mighty.'",
        "'speaker_2': 'Everybody that I work with is incredibly dedicated in trying to solve issues of housing in this town and in this region, as well as working our best to keep people housed. And I really want to a shout out to a board of commissioners.'",
        "'speaker_2': 'They're great leaders and they actually have technical expertize in housing, which is super valuable for us as staff when we're working through policy and strategic decisions with them. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next, we hear.'",
        "'speaker_3': 'Mike Pucci, then Svetlana Machina is the last speaker.'",
        "'speaker_4': 'Evening, Madam Mayor, and fellow council members. Her council members and city.'",
        "'speaker_1': 'Manager and.'",
        "'speaker_5': 'City attorney. I'm Michael Poochie. I'm Alameda resident and also the former.'",
        "'speaker_4': 'Executive director of the housing authority.'",
        "'speaker_5': 'Of the city of Alameda for 19.'",
        "'speaker_4': 'Years. I came here tonight really to listen about.'",
        "'speaker_5': 'The concerns of Councilmember Odie and.'",
        "'speaker_4': 'Councilmember Vella.'",
        "'speaker_10': 'About the potential conflict.'",
        "'speaker_5': 'Of interest issues with the housing authority.'",
        "'speaker_4': 'I've heard those. I heard your concerns.'",
        "'speaker_5': 'I'm not in agreement with some of those concerns. And I was going to.'",
        "'speaker_4': 'Try to address several other matters tonight. But in order well.'",
        "'speaker_5': 'If I knew I was going to be up this late, I would have taken a nap this afternoon. But I just want to make.'",
        "'speaker_4': 'Myself available to you all.'",
        "'speaker_5': 'And also to.'",
        "'speaker_4': 'Staff, city manager and city attorney as well as the tenants.'",
        "'speaker_5': 'Because I have a lot of history here, I could go back and give you secondhand information about what happened 40 years ago and why we're here. At this point today, I can give you firsthand information about what happened 25 years ago.'",
        "'speaker_5': 'Up until 2014. I'm retired, but I don't do any hearings, administrative hearings.'",
        "'speaker_4': 'Um, I haven't done one in probably over 30 years, but I would like.'",
        "'speaker_5': 'To be available for anybody to, to talk to you about anything related to the housing.'",
        "'speaker_1': 'Authority. But I will.'",
        "'speaker_4': 'Draw a line. I'll put a caveat on that. I will not impose upon.'",
        "'speaker_5': 'The duties and responsibilities of any of the staff members. And because that's not my role anymore. That's their role.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Schiller.'",
        "'speaker_2': 'That evening. Mary and Alma Mater City Council. My name is Long Irish Cinnamon Alameda resident and I have appeared here before and I would like to first thank you more to you for bringing this very important matter for the discussion and Muli Vella of course, and I think this is great that we are together here and we'",
        "'speaker_2': 'are talking about it and we are trying to find the right solutions because apparently Alameda Housing Authority is doing tremendous, very important work to house underprivileged people and this work should not be negated. At the same time, I think what people are talking about is that disconnect and the grievance procedure.'",
        "'speaker_2': 'And I think that as a city and as people, we need to find solutions to those conflict resolution issues. And I know that this city is big on bringing people together in find finding the right solution to this.'",
        "'speaker_2': 'And I think the city should be able to participate in that process because the city was the one who found that Alameda Housing Authority in the first place and the city should have a say in how this problems are resolved.'",
        "'speaker_2': 'So I can tell you, like a few things from my personal experience is one, the whole thing with my father started the first thing I did. I wrote a long letter to Alameda Housing Authority with a grievance about discrimination.'",
        "'speaker_2': 'And to this date, I never received a response. I mean, the matter has been resolved, but the letter has been there for a year. And when I came to speak to somebody at a meeting months, months, months later, you know, it just was very clear to me that that letter was never looked at.'",
        "'speaker_2': 'So and that's just one example. But there are several other people who are saying that this some kind of procedures need to be established for people in order to be able to hear the problem. Thank you.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_3': 'That's it.'",
        "'speaker_0': 'That's it. That's our speakers. Okay, so we, um, we've had some suggestions for direction to staff. Do we want to go down the line and people add whatever more they want to add or because I'm also mindful that it is now 1120 and we still have a few more items.'",
        "'speaker_0': 'So I'll start with you. Sure.'",
        "'speaker_9': 'So I mentioned this before, but some sort of stakeholder group or some sort of direction to one of our already established boards to help lead a discussion about transitioning. And I do think that that's really important and we need to work together on this.'",
        "'speaker_9': 'I think the housing authority has an interest in this. I know that they do. I spoke with Vanessa about this as well as our tenants groups, APC. I think we have a lot of different projects that are coming about and Eden Housing, I think there's a number of different groups that that really need to get together and'",
        "'speaker_9': 'talk about this, this need and in terms of the gray area of transitioning from full independent living and the stage before you get to skilled nursing. And I think that that's something that we could get some really creative solutions out of and some of the cases that have been brought forward, really there are some issues related back'",
        "'speaker_9': 'to this. So that's why that was one of the things that is, is one bit of direction we could give. Another is, you know, I do think that we are unique in that the housing authority is not under the cities, but people come to the city.'",
        "'speaker_9': 'I think we all need to be on the same page. Having this appeal process posted on our website as well is where the grievances can be filed. Age, HUD, you know, if there's, you know, the release forms, those sorts of things where the city could link up and have that information I'm all for, let's get the information'",
        "'speaker_9': 'out to people so that they know and also so that we can, you know, kind of understand where things are at in the process. I also think, like I said before, there's just an overall code enforcement issue when we're talking about habitability issues, whether you're in the housing authority or a tenant, just, you know, or anybody really'",
        "'speaker_9': ', we've had a number of code enforcement issues come up. I think this goes back to what are we doing about code enforcement generally? But I think that also the city needs to have something on our website that says this is where you can report these things.'",
        "'speaker_9': 'I think calling the police is not in a. This eerily the correct use of our police resources. But we need to fill that gap of making sure that we have some sort of code enforcement availability out there. And then there's a city record of habitability issues, whether your door locks, things like that.'",
        "'speaker_9': 'And the other thing is, I think, you know, for this appeal process, for the Section eight, you know, who identifying who are the hearing officers, who's sitting on on these panels? I think the more we can get retirees, I just you do a lot with your limited staff and I give you credit for that.'",
        "'speaker_9': 'But I also think, you know, making, you know, identifying what the positions are. And I think to the extent that we can have it be retirees, and I don't know what the cost of that is or if there's a way for some of our rent funds to pay for that to make sure that it's as unbiased a'",
        "'speaker_9': 'process. I think it insulates everybody and it provides you know, I get that you need to have specific knowledge. I don't want to serve on those ports, but I think having that sort of process, I think also, you know, and I'm open to hearing other other suggestions, but I think leaving this direction open ended to say what'",
        "'speaker_9': 'are the other options that even staff might be able to recommend of of things that we can do to kind of get to the underlying issues. I don't want to be focused on solving a specific issue for a specific tenant, so much as I want to be focused about how do we improve all of these things and'",
        "'speaker_9': 'the root of it, not just the kind of the superficial what's been presented to us. So those were some of the things that I talked with staff and housing authority and activists about, and it seemed like there was some consensus on those items.'",
        "'speaker_0': 'I'm just go down the row. Councilmember Knox Right.'",
        "'speaker_1': 'So I guess my first question is who is who will be doing if we give direction to do a lot of this work? Who in the city will be? What staff will be doing this work?'",
        "'speaker_4': 'I can give you that answer better at the end of this at the end of your discussion, because I'm actually hearing a few things and I had some thoughts too, so I can give you a.'",
        "'speaker_0': 'Better I will call you and we're all making our comments. Okay.'",
        "'speaker_1': 'So I think he left. I wanted to thank Commissioner Cam Aoki. Tom Aoki.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Oh, sorry. I was looking pretty disappointed. There you are. Thank you. I wanted to I wanted to thank you very much.'",
        "'speaker_0': 'For coming this hour.'",
        "'speaker_1': 'I thank you for coming. I really appreciate appreciate that. I very much appreciated your comments. I've learned a lot just through this discussion over the last couple of weeks about, you know, I am a big fan of communication and it's clear the communication is not happening.'",
        "'speaker_1': 'Well, not not from you. But when I found out that a lot of the comments we're hearing and the kind of the stories we've heard haven't really been were even relayed back to board members, etc., and that folks who are coming to us for comfort, for conversation and discussion, have never talked to board members in the past'",
        "'speaker_1': 'at all, let alone about the specific issues. It suggests to me that there's a lack of clarity and some conversation that needs to happen about, you know, who does have. Who does currently have that accountability role. I agree completely with the comment you made about the idea of a third party outside.'",
        "'speaker_1': 'I call it an adjudicator, but somebody who can facilitate meetings and help. I think that would go a long way. So I was very heartened to hear that. And I wanted to thank you for for your work as well.'",
        "'speaker_1': 'You know, I will actually second just about everything that Councilmember Vella said as as ideas. I have spoken with Ms.. Cooper as well about some sort of task force or something, because I think that that is a big systemic issue, that that is going to just increase as our population is growing and as the housing crisis continues'",
        "'speaker_1': 'to deepen further. And again, within this appeals process and whatever else I do, I do really want to push for the kind of this the importance of having this be outside and not in. I understand that HUD wants you to save money and use internal people, but I just think it sets everybody up for as the you'",
        "'speaker_1': 'know, I'm sure 90% of these go well and they work out and whatnot. But whether it's after that, informal, if it's an internal person, there's somebody before you go to court that they can work with. It's a third party.'",
        "'speaker_1': 'I think that that would be a very useful thing. I you know, I have been asked and I'm not overly on board with the idea of bringing the housing authority back underneath us and significantly changing the structure before we look to see how we can kind of.'",
        "'speaker_1': 'You know, bring into the sunlight some of the some of the transparency. You know, again, it's but I will also it's frustrating because we do hear one side of the story and we don't get to hear the other side very often.'",
        "'speaker_1': 'And the stories are heartbreaking. And, you know, and I believe them. These are people who are sharing their experiences and whatever else, you know. But but I think I think we have not. I think we need to figure out how we how the housing authority can possibly listen to some of the feedback that is is being given'",
        "'speaker_1': 'and identify ways to work through those things. You know, I also reflect on the the example that Councilmember Odie used from his past job of somebody who had had an unsuccessful informal hearing, went and got a positive response from the judge, and then a negative response from the appeals court.'",
        "'speaker_1': 'And what I heard at the end of the day was that the process had actually worked and it had it had ended. And no amount of city council or anybody else had been involved in that would have been able to get it to a different result.'",
        "'speaker_1': 'You know, I I'm obviously a fan of our elective system and whatever else, but I don't think that elected officials necessarily need to be the end result of every single decision. And I'm not sure. I'm not sure we are the right body.'",
        "'speaker_1': 'But I would like to see, you know, as this, because I'm sure this conversation will continue. I would like to see some kind of engagement around some of the issues we're hearing and and clarity brought and maybe systems looked at and changed so that hopefully we aren't going to be back here having this conversation again.'",
        "'speaker_0': 'Thank you. Thank you. Councilor Brody.'",
        "'speaker_5': 'Oh, you want to go down the line? Okay, that's fine. I want to thank my colleagues for their comments. Rather than giving specific solutions, I want to focus on outcomes. And the outcomes of the referral were to increase accountability and to reduce conflicts of interest.'",
        "'speaker_5': 'And I think the vice mayor added transparency. So whatever our staff come up with, given the conversation that we heard today and the concerns from the residents, that's what I like to see. Again, I think I said this earlier, I don't think wholesale transfer of the housing authority under the city council and disruption is the answer.'",
        "'speaker_5': 'So I wouldn't even spend any time on that. And I appreciate Councilmember de Suggs discussion earlier and there may be legal issues. So I expect you guys to come back and say, well, you can do this, you can do that, or you can't do this because of some legal issues.'",
        "'speaker_5': 'So I appreciate that. Just a couple closing comments. So I think whatever outcomes can can accomplish what we're what we're seeking to do here, because I hear I hear Catherine and the folks that talk to her and the folks that talk to me and this is me, I'm not speaking about anyone else or indicting anyone else.'",
        "'speaker_5': 'I will never stop fighting for the most vulnerable people in our city. That's my promise to you. So when you come to me and you want someone to be your advocate, I will be that advocate. Sometimes it shakes up the system.'",
        "'speaker_5': 'Sometimes it makes people unhappy. But I'm going to continue to do that. So be prepared. If you're on the opposite side, I that's where my values lie. I think as a society, we are judged by how we treat our most vulnerable, which is the our seniors disabled, our young people.'",
        "'speaker_5': 'And as a council, I think that's how we should be judged, because those with money are going to be able to take care of themselves no matter what. So I will never stop doing that. And so I will continue to advocate for you.'",
        "'speaker_5': 'And as you ask. I do want to appreciate. Kenji, you took time to talk to me on Friday with Vanessa. And I would like to have you had a couple more minutes because I think you were starting to get going there.'",
        "'speaker_5': 'So maybe we can continue that conversation. And Mike, which I think he left, but I'm happy to sit and talk to you, you know, without staff. So it's just you and me having coffee to learn more. But I'm focused more on the outcomes and I appreciate everyone's work and I appreciate all the hard work that people do'",
        "'speaker_5': 'do at the Housing Authority and that you all came out tonight, you know, until 1130. That shows a lot of loyalty and there's a lot of good work. And I don't think we needed an hour and a half to hear about it, but I do appreciate it.'",
        "'speaker_5': 'But there are some issues that need to be addressed, and I hope that we can we can take the time to address them. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Desiree.'",
        "'speaker_6': 'In 2012. Former city manager John Russo put the Alameda Housing Authority on a path of complete independence by separating the Housing Authority and its governing commission from the city council. And I think we should continue with that separation, with that independence, because the housing authority has proven itself to be successful since 2012.'",
        "'speaker_6': 'We heard tonight about their involvement, the role that they play in, for example, site A in providing project based vouchers that assist in the cash flow of that very financially constrained project. So I want to continue with that independence and I want to close by saying, you know, the attempt to to incorporate city council in the appeal'",
        "'speaker_6': 'process that we thought what that we saw or some other entity is not as easy as you would think. Just to repeat from the outset that I indicated, it's Congress who establishes the laws. Then HUD then kind of helps interpret that into kind of the federal register language, bureaucratic language.'",
        "'speaker_6': 'And then the local housing authority then incorporates HUD's direction in terms of policies that are implemented in the what's called that administrative plan. And the first, when it comes to evictions, the first set of policies that we saw had to do with program violations, because this is at the end of the day, involves taxpayer money.'",
        "'speaker_6': 'And so families who are participating in this program have obligations, family obligations with regard to maintaining their involvement. Now, the second level of evictions that you saw in that schematic had to do with lease violations. So there's a whole different set of procedures with regard to lease violations.'",
        "'speaker_6': 'That's when, you know, housing units aren't meeting on how to build any codes. Now, here's a difficult. And I'm going to end on this. At the last part, you heard about informal hearings. It's not easy to involve outside entities because if you involve, for example, Oakland housing authorities in our informal process, they have completely different policies.'",
        "'speaker_6': 'So we might be they might be interpreting what's right for Oakland in the context of Alameda. So it's not that simple. There's a reason why we have internal staff involved in the informal hearing process. But there are guidelines and checks to make sure that through that final stage in formal process, that the tenants are treated fairly.'",
        "'speaker_6': 'Because at the end of the day, what matters with regard to the housing choice voucher program and the project based program that we have, what matters with regard to the housing authority is not simply the money that allows for families to live in affordable housing situations, but also having rules that are equally applied and that are transparent'",
        "'speaker_6': 'to all.'",
        "'speaker_0': 'Thank you. Thank you. And I believe the vice mayor wanted to add to his comments.'",
        "'speaker_1': 'I just wanted to add one comment, I think, Commissioner Aoki, but I also want to thank Miss Alvarez, Miss Jordan, Miss Boston and Ms.. Mertz and Vanessa, for all the work you do, do I know that these are not difficult or these are difficult conversations?'",
        "'speaker_1': 'I think everybody knows that you're working very hard and bringing a lot of value and whatever else. And while we're here talking about how things could be better, I can tell you every job I've ever been at, some some things can be better.'",
        "'speaker_1': 'But you're also I just want to make sure that it was also clear that your work is appreciated. And thank you very much for being here tonight.'",
        "'speaker_0': 'Thank you. And we have heard a lot of good input from my colleagues, so I don't need to say too much more except to thank everyone who spoke from all sides of this issue. I do think that the idea of a mediated conversation between tenants we've heard from and housing authority staff is a good thing.'",
        "'speaker_0': 'I very much support that. I think that probably would be unanimous if we took a vote on this council. Other items have been raised. The code enforcement piece, I would just say to council, this may come up in a priority setting workshop how to how to address this.'",
        "'speaker_0': 'And then again, we have a very valuable resource in the Housing Authority Board, and it saddens me to know that they are not a very frequently used resource. And so I would encourage all those involved that rather than circumvent the system and go straight to your favorite elected official, we all want to be that favorite elected official'",
        "'speaker_0': ', but there are people who actually are there with the training and the expertize and they are set up to to perform those functions. And then, as Mr. Tamaki reminded us, there is a process for an independent review, the ability to file a complaint any time to an independent agency.'",
        "'speaker_0': 'You do not have to go through any housing authority personnel. And so not only are there experienced staff, there's also the ability to enforce. So in law they talk about exhausting your administrative remedies first. So avail yourselves of this opportunity.'",
        "'speaker_0': 'But at the end of the day, I think everyone in this room shares the desire to provide more housing, to make housing more secure, to to provide good habitable roofs over people's heads. This housing crisis isn't going away anytime soon, which just behooves us all, all the more to work collaboratively with each other rather than to attack'",
        "'speaker_0': '. And I want to give our city manager, Eric Leavitt, the last word on this. Did you want to say anything? Okay. So, Mr. Levitt, you had some thought through. Now that you heard from all of us, you've come up with the magic solution.'",
        "'speaker_4': 'Sure. I have a I have a few thoughts. Well, each of you has said, and then I and I apologize if I mispronounce her name. Ms.. Kramaric reiterated, everyone here is for the same thing. And as I listened to the Housing Authority, as I listened to that was an advocacy group, as I listened to the council.'",
        "'speaker_4': 'Everyone has the same goals, just coming out a lot of different ways, some from a legalistic perspective, some from a passionate perspective. It's, it's, it's, it's a variety of things, as some of you may know or not know.'",
        "'speaker_4': 'Way back in my career, I used housing is where I came up through, and I've overseen housing authority as a city manager in another city. So. So what I would like to do or recommend. As I think some of you are, there's been some good ideas.'",
        "'speaker_4': 'I think the root of the issue came up from one of you, and I think rude of the issue is the thing that we need to really focus on. And so my recommendation would be that probably we'd have to have three departments involved from the city, I think someone from the same manager's office, because we're directly accountable'",
        "'speaker_4': ', responsible to the council. And this has obviously risen to your level. I think community development officer will be involved because they are the they're the department the interacts the most with the housing authority. And then legal because of the legal issues with the with the housing with the housing issues.'",
        "'speaker_4': 'I think those three and what I would like to do is probably start with an informal or recommend that you take action to have an informal state called a group that could then decide whether or not it becomes a more formalized stakeholder group.'",
        "'speaker_4': 'And that that group focus on three things the accountability, conflict of interest, or four things actually transparency. And within all those three things that hearing officers be addressed and how that's going to work within it that can can address it.'",
        "'speaker_4': 'And I think we ought to look at a fifth element, and that would be is there some type of informal mediation methodology that could come out of this process? And that would be my recommendation and bring that back to the council and probably back to the commission to hopefully have some type of solution.'",
        "'speaker_4': 'My goal would be that it would have a deadline of February 18th.'",
        "'speaker_0': 'Thank you. Could you just repeat what those areas were? I heard I heard you say five, but I. I wrote down.'",
        "'speaker_4': 'So focus on the three core areas of accountability, conflict of interest, transparency. But within that, look at two areas of hearing officers within that look. And I don't look at hearing officers within that also look or hearing officers hearing process and potentially look at an informal mediation process before you get into the formal process.'",
        "'speaker_4': 'Yeah, the one thing I didn't hear was probably the habitat habitability, habitability, habitability or code enforcement. That's the one because the rules within HUD, the rules within life safety and the rules within what people feels a decent place to live.'",
        "'speaker_4': 'Those are three different three different definitions at times. And so that one's a little bit more vague to be able to deal with sometimes. But that group could possibly talk about it. In February 18th. I recommend we'd bring that back to the council by February 18th.'",
        "'speaker_0': 'Okay. It was.'",
        "'speaker_2': 'Pretty.'",
        "'speaker_4': 'Well it took four months, four months from. Yeah.'",
        "'speaker_0': 'Yeah, I'm ready. Yes. Council vice mayor.'",
        "'speaker_1': 'So per earlier conversations, I want to confirm if we're going to give this direction that we have the capacity and we're not bumping other things. And I'm not sure you're going be able to answer that question tonight, but maybe at the next meeting you could come back and talk about you.'",
        "'speaker_1': 'You know, let us let us know how this is going to impact. And the other thing I'm just going to throw out there before I put it in a motion, I think I would love what I would like to say.'",
        "'speaker_1': 'See it, since this is kind of a first step. And we are we are. We are. I'm assuming that the accountability is actually still held with the the the housing commission. That that before you bring it back on the 18th, that that, you know, we get that feedback and kind of know that they're, you know, if they'",
        "'speaker_1': 'might have other steps they're doing. And then when we come back, we can kind of, you know.'",
        "'speaker_4': 'Do that. Yes. Okay. I just would be agreeable to that and might move it back to the first meeting. And that's fine for me.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'And so do we need a motion is a staff direction I think was the.'",
        "'speaker_4': 'If you like, that concept. If you could do a motion saying to go for that better.'",
        "'speaker_5': 'Okay, I can.'",
        "'speaker_0': 'Maybe.'",
        "'speaker_5': 'I can make that motion.'",
        "'speaker_0': 'Well, I think. Did you have a comment? Councilmember Vela. Yeah, make your comment, please.'",
        "'speaker_9': 'So just really quickly, I know that there's the differences in terms of what somebody likes versus and finds comfortable versus basic habitability. I do think, though, that there are a number of issues that have been raised across the board, and I get that it might be a wholly separate item, but I think that it is applicable here'",
        "'speaker_9': 'that at the base level I think we do need to have some sort of city accountability in terms of basic habitability that is documented and everything else, because otherwise we're going after he said, she said, and looking for a record.'",
        "'speaker_9': 'And if we don't if we aren't able to provide that, I think it is a big problem. So and it's not to say that I don't think that we're not looking at that, but.'",
        "'speaker_0': 'Maybe that could be part of the Getting Housing Authority feedback.'",
        "'speaker_2': 'To consider habitability.'",
        "'speaker_0': 'Issues, too, when you're talking about the housing authority. Okay. So I believe a motion was about to be made.'",
        "'speaker_5': 'Yeah, I'll make that motion. But I'd also like to see us consider an incentive program to help with that 75 vouchers. I think the one in Oakland over six months, only $70,000. So given the transfer test. But maybe that's not for today.'",
        "'speaker_5': 'Yeah, I'm but what I.'",
        "'speaker_4': 'Would recommend as part of that motion is we could just bring back research of how Oakland pays for it. And then okay, with that.'",
        "'speaker_5': 'I will move approval of what our city manager who was able to encapsulate everything that we said and distill it amazingly and effectively, I'll move approval of that direction.'",
        "'speaker_0': 'I have a motion to have a second.'",
        "'speaker_9': 'I'll second.'",
        "'speaker_0': 'It's been moved and seconded all in favor.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'I didn't hear any abstentions or I know. So that motion carries. Okay we are now just for the your exercise in time management we now have three more items that means to get it right. 12, 15, 1230. We get they each get 15 minutes.'",
        "'speaker_0': 'So we're going to speed talk this through and we're moving on to item six E and Ms.. Potter and you know, feel free to do a truncated staff report.'",
        "'speaker_2': 'Well, I'm going to yes, I'm going to suggest one better. Okay. And we are prepared to dispense with microphone.'",
        "'speaker_0': 'Microphone. Okay. Audience If I could ask you. Hello? AUDIENCE We have to get through three items in 45 minutes. If you could take your conversations to the hall, that would be lovely. Thank you all for coming. Yes, Miss Potter.'",
        "'speaker_2': 'All right. Good evening. I'm Debbie Potter, the city's community development director. And the item before you this evening is acceptance of the fiscal year 1819 annual report for the rent program. That's a requirement to do an annual report per the ordinance.'",
        "'speaker_2': 'We are happy to have you move acceptance of the report without a presentation. If any council members have any questions, program staff is prepared to do that. And then on the the other item was we got direction from the council in September to come back and talk about some issues around the permanent and temporary relocation schedules.'",
        "'speaker_2': 'And we have a recommendation which is to keep the permanent relocation schedule as is, and to revise the temporary relocation schedule to reduce the per diem expenses that are included. And we can recommend moving that resolution to without a presentation and answer any questions council may have.'",
        "'speaker_0': 'Yeah, because as you know, I. Communicated earlier. I have some issues with one of the calculations.'",
        "'speaker_9': 'Do we have any speakers, Madam Mayor?'",
        "'speaker_3': 'We have one speaker.'",
        "'speaker_0': 'One. I understand.'",
        "'speaker_2': 'Well, if you would like to take the public speaker and then we can come back and address any questions or issues.'",
        "'speaker_0': 'Sure. Let's take the public speaker. Who is that?'",
        "'speaker_3': 'Madeline Howard.'",
        "'speaker_0': 'Madeline Howard. I know. And my apologies.'",
        "'speaker_3': 'Hi. Thank you.'",
        "'speaker_9': 'For staying.'",
        "'speaker_2': 'Up late.'",
        "'speaker_9': 'So, Madeline Howard, I live in Alameda. I'm also a housing advocate with Western Center on Land Poverty. I fight for low income tenants for a living. So I just wanted to encourage the council not to reduce the temporary relocation payment.'",
        "'speaker_9': 'I would also love it if you gave more money for permanent, but I don't think you're going to do that. So I'll just speak to the temporary.'",
        "'speaker_2': 'The costs that are in the chart don't actually address the tremendous.'",
        "'speaker_9': 'Disruption that occurs when someone is removed from their home for up to 30 days. Including like some cities, there is a special payment for storage.'",
        "'speaker_2': 'Of furniture and other goods.'",
        "'speaker_9': 'That a family can't keep in a hotel.'",
        "'speaker_2': 'Room.'",
        "'speaker_9': 'I have two young children and I can't imagine living in one hotel room with my young children for a month. And so I think the calculations that were made were based on the idea that someone the cost of a single hotel room, and that's not really a realistic replacement for a family.'",
        "'speaker_9': 'So I just encourage the family, not the council, not to reduce the relocation payments.'",
        "'speaker_2': 'Thank you very.'",
        "'speaker_0': 'Much. Thank you. Okay. So now we have council discussion. Yeah, I am. I did. Well, does anyone have any comments on the on this report? Okay. The. Concerns I shared with Ms.. Potter.'",
        "'speaker_2': 'So might the council want to accept the annual report? And then we can move to the discussion of the permanent and temporary relocation schedules that might.'",
        "'speaker_9': 'I'm going to.'",
        "'speaker_2': 'Turn to her.'",
        "'speaker_0': 'No, it's. The report is fine, but I'm the. It's the permanent relocation. Okay. Calculation that I.'",
        "'speaker_9': 'That's not a may or may I move approval of the annual report second.'",
        "'speaker_0': 'All in.'",
        "'speaker_9': 'Favor I.'",
        "'speaker_0': 'Any opposed abstain. Is that an opposition or abstain? Okay. So we have four approve and one oppose. And so. Okay. So then we go on to the the resolution involving the revised. Well, the recommendation is the revised is to keep the permanent relocation the same and reduce the temporary.'",
        "'speaker_0': 'And where I have trouble with. It's actually an exhibit it's exhibit two, which is the comparison of various cities that do relocation, permanent relocation payments. And it shows the the average percentage enhancement for qualified tenants, because the council voted that for tenants in certain vulnerable categories, they would get more.'",
        "'speaker_0': 'I I'm troubled that the the suggested amount for Alameda is 33%. The average is 29%. But is the average also includes jurisdictions that set limits on the amount of income that tenants can raise before they even get get relocation payments.'",
        "'speaker_0': 'And these are, you know, admittedly, some of.'",
        "'speaker_2': 'The higher.'",
        "'speaker_0': 'Probably higher income or higher rent cost jurisdictions. Mountain View, Menlo Park, Redwood City would be a little more mixed, although they don't they have a formula that doesn't have percentage enhancement. But I would actually favor and then so then if you remove those jurisdictions that have the restriction on who can even get these enhanced payments, the the'",
        "'speaker_0': 'average is 27%. And I think that it's probably more reasonable for Alameda to stay close to places like Oakland. San Leandro, San Leandro is a little low. But anyway, 33%. I just this was my worry before that. And I know staff said in the report they could find no evidence of landlords being less willing to rent to'",
        "'speaker_0': 'people in these specified categories where there were enhanced permanent relocation payment amounts. And it's sometimes hard to prove a negative. I'm not even sure how you would go about doing that because no one is going to admit that they didn't rent to someone who is a senior.'",
        "'speaker_0': 'But I just it's something we'll have to keep an eye on if we do create this extra imposition on landlords. And it's up. It is 33%. We may just have to deal with what happens when our seniors and families and folks with disabilities are having a harder time finding places to rent.'",
        "'speaker_0': 'So I would I would argue that at the very least, we could make our percentage increase 29%, which is the average, even when you include Mountain View in Menlo Park.'",
        "'speaker_2': 'And.'",
        "'speaker_0': 'Councilor. Oh, so I'm sorry. Even I'm Mr. Chen. Sorry, sir.'",
        "'speaker_1': 'My apologies. I had a moment to look at the agenda title and it occurred to me that the agenda title provides that it's adopted mechanism resolution, establishing a revised temporary relocation payment schedule.'",
        "'speaker_0': 'It's not even time.'",
        "'speaker_1': 'And so it's not agenda for a full discussion on permanent relocation. So my recommendations that we can if we can keep permanent relocation conversations brief and not take any actions on the permanent relocation.'",
        "'speaker_0': 'Sorry, that's a good point. Council wishes so ever I. I'm just going to say that this is an area where I.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Really believe that the council should not. I mean, I will very much respect that it's not and not noticed. We're not going to discuss that. That council should not be prevented by a lack.'",
        "'speaker_2': 'Of.'",
        "'speaker_0': 'Reference in the title. So just going forward.'",
        "'speaker_1': 'And so my recommendation is that if the Council is interested in a permanent relocation discussion, you just simply give a brief direction to staff to bring permanent relocation back to you. Okay.'",
        "'speaker_2': 'Right. And I apologize from staff's perspective, because that was council's direction to us was to come back with an analysis of whether or not there were impacts by surveying other cities to having the the enhanced benefits. You adopted the resolution establishing the permanent benefits in September, but then you asked us to come back and report out the'",
        "'speaker_2': 'results of our survey of the cities. And so I apologize if we didn't properly allow the discussion on our findings to to be presented to the Council because that we were trying to implement your direction from September. So I do apologize for that.'",
        "'speaker_0': 'And I would just ask, without discussing this matter in particular, why one would bother to have a table and even an average. And then I mean, I just think.'",
        "'speaker_2': 'That.'",
        "'speaker_0': 'That's a decision. And my colleagues may not. May not concur. Maybe it doesn't come back. But I. But I am troubled by this.'",
        "'speaker_4': 'I think.'",
        "'speaker_1': 'Madam Chair, the compromise is that because this is also an annual report from your staff to you about the program, you can discuss it. It's generally as part of the annual report, but not to take action amending permanent relocation amounts in changing that resolution.'",
        "'speaker_1': 'That's brought before you as a sort of item.'",
        "'speaker_0': 'BE We've already approved the annual report, so we're done discussing. We never discussed. But anyway, okay.'",
        "'speaker_2': 'And I was like, there was one comment I would like to provide to the council which may assist in kind of just the information around this discussion. And if the city's enhanced benefit was reduced to be 29% of of the basic, that is a reduction of $72 for the relocation for the studio and a reduction of $421'",
        "'speaker_2': 'for a two bedroom apartment. So it may be that.'",
        "'speaker_0': 'If we're not discussing this, we're not discussing this. Right. I the discussion should be over until unless and until it comes back. And I appreciate that you want to reply, but we just heard the city attorney's say we can.'",
        "'speaker_2': 'I heard it, don't take action. Not that you could, but I'm prepared to.'",
        "'speaker_0': 'No, he no he said you could generally discuss it under the annual report and I said we've already approved that template.'",
        "'speaker_4': 'You can still talk about.'",
        "'speaker_0': 'Yes. The temporary. Yeah. Councilmember value your question.'",
        "'speaker_9': 'So on that note, since we can't discuss this week, do we, we have a public speaker we've already heard from. We heard her. So okay. So I did have a question about the temporary relocation because one of the one of the things that we discussed when we were discussing the temporary relocation was, you know, weekly rates.'",
        "'speaker_9': 'And also, how long does, you know, basically how long is the temporary relocation going to be? Because when we if you do the 335 at 30 days, I mean, you're talking about $10,000 potentially. I mean, that was one of the issues that was raised was that it would be more than the permanent relocation and to 20 if'",
        "'speaker_9': 'if you do it at 220, you're talking about 60 $600. And I think one of the things at least that we had come up in our discussion is how do you address this issue of a number of people being rehoused or what the options might be and and the overall cost, you know, looking at weekly options and'",
        "'speaker_9': 'that. So how do we come up with the can you talk about the 220?'",
        "'speaker_2': 'So the $220, the recommendation for the revised schedule is a reflection of looking at more hotels within Alameda to get a better sense of the pricing and to look at weekly rates. So as a result of that additional survey work, it was determined that it's probably more appropriate to go with the number that's $220 a day.'",
        "'speaker_9': 'But that only addresses the fact that as one assumes, one hotel room. So how many people are accommodated within one hotel room and then the other? Because it seems to me like if. It's a shorter period of time.'",
        "'speaker_9': 'You might need more per day. But if it's, you know, like if it's less than a week, you might need more per day because you're staying in a hotel versus staying finding like a month rent to another unit to be in or something like that for month.'",
        "'speaker_9': 'So that was part of the issue that we had discussed. And then also like how much stuff is having to get moved for that temporary relocation and what what who covers that cost? And is that built into this to 20 a day?'",
        "'speaker_9': 'Because I think there's a difference between like, I have to be out of the unit while they're doing work versus I have to be out of the unit and all of my stuff has to be out of the unit.'",
        "'speaker_2': 'So the $220 a day covers the whole essentially your housing cost and not any kind of storage. The permanent relocation calculation includes storage and that kind of thing, but not the the temporary housing really looks at the annual the average daily rate.'",
        "'speaker_2': 'And it so it doesn't it also doesn't distinguish with between being out for two days versus being out for a month. This is this is the the look at the weekly rates because the initial temporary relocation schedule looked at daily rates.'",
        "'speaker_2': 'And so there was a concern that the daily rates were perhaps pushing the per diem to be higher. And the request was to go back and look at weekly rates and more hotels in the in the city.'",
        "'speaker_9': 'Is it, Mr. Potter, is it possible to I guess this is more of a question for the city attorney, but is it possible to word it in such a way that it would? Some of the stuff seems like it's a case by case basis.'",
        "'speaker_9': 'And so saying to 20 a day or 335 a day doesn't necessarily address certain situations where, you know, it might be a higher dollar amount might be more appropriate or a lower dollar. Like, is it possible to say this is a range it could be between 2 to 330, depending on what's involved.'",
        "'speaker_1': 'So, yes, but it does create an incredible amount of additional administrative burden to create a range, because what if the council sets a flat dollar amount, staff simply implements it. If you're if the council sets a range, then what likely would have to happen is that we'd have to set up a hearings process whereby folks will have'",
        "'speaker_1': 'to come and present evidence. And that's probably and then create an intensive process for folks experiencing temporary relocation. I think what the staff attempted to do here is to provide sort of a base range and a few important add ons like meals, laundries and pets.'",
        "'speaker_1': 'Um, if the council wanted to add a couple more categories or it's still work, but.'",
        "'speaker_2': 'Or you could continue to maintain the higher daily relocation benefit that you previously approved for temporary relocations and not move forward with this reduced schedule. I mean, that's the other option to maybe take into account the higher range of scenarios that you might be confronted with.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_1': 'I apologize if I missed this part of the presentation.'",
        "'speaker_2': 'It was quick.'",
        "'speaker_1': 'Yeah, no, I know. And I was out of the room, so I apologize. Is there a reason you didn't proceed with. We we talked about the idea of using reimburse actual reimburse costs because often this cost is going to be significantly higher.'",
        "'speaker_2': 'Yes, we we looked at that and we thought for some of the reasons that the city attorney just outlined it from an administrative perspective, it becomes it's quite the exercise. If people lose their receipts, if people you know, if there are questions, if the kind of information that needs to be provided, it just felt like it was'",
        "'speaker_2': 'going to be kind of administratively burdensome.'",
        "'speaker_1': 'Yeah. Okay. I mean, these costs just seem very high. Especially when you get into a week or two weeks of of of. Relocating.'",
        "'speaker_4': 'Which one? The revised or the both?'",
        "'speaker_1': 'I mean, obviously the revised ones are lower, so they're not as high. The $220 a day still seems significantly high for probably a lot of the people who are going to be moved out of their homes. It's probably not high for a family of five, but it's very high for a family of one or two.'",
        "'speaker_2': 'But it does reflect surveying local hotels and understanding their weekly rates as well as their monthly. It's not just the daily rates.'",
        "'speaker_0': 'Okay. If we can just remind you, we've got two more items after this. So. Okay, quickly, Mr. Snappy.'",
        "'speaker_5': 'Quick. I mean, also these folks, if you're paying 3000 a month, you're still paying your rent of $100.'",
        "'speaker_2': 'So you still pay your rent. You just temperature.'",
        "'speaker_5': 'That's clear. I mean, that's correct. My personal thought is I would just keep this the same. I mean, if if we could have contracts with certain hotels that maybe they can direct, build a landlord, you know, maybe those numbers could be lower as negotiated.'",
        "'speaker_5': 'But that may be too complicated. And I will say, Debbie, I think you're probably one of the most overworked and overburdened person here in the city. So if you forget a title, I'm not going to beat you up on it.'",
        "'speaker_5': 'So with that said, I mean, I'm prefer I'm fine leaving everything status quo.'",
        "'speaker_0': 'Councilmember are.'",
        "'speaker_6': 'So why even provide temporary location payment? Why not just simply require people tenants to pay renters insurance because renters insurance would cover temporary relocation payments. I don't know why we would do this.'",
        "'speaker_2': 'So the city currently the city does not have a policy requiring tenants in the city of Alameda to secure renters insurance. I know a lot of property management companies require it. And if you're renters insurance covered temporary relocation, that there may be an opportunity to kind of sync this up.'",
        "'speaker_2': 'But it seems appropriate to have relocation, temporary relocation benefits when a tenant needs to be relocated through no fault of their own, while work is being done on their unit.'",
        "'speaker_6': 'And that's what renters insurance covers.'",
        "'speaker_2': 'But I don't believe every. I mean, we don't require. It's not a mandatory requirement within the city that it's not been an issue that's come to staff from the council.'",
        "'speaker_6': 'I guess what I'm getting at, it just seems odd that we were acquiring small mom and pop landlords to pay $220 a day when we could figure out a way to have small mom and pop landlords work with tenants to pay, what, $15 a month.'",
        "'speaker_5': 'For.'",
        "'speaker_2': 'Renters insurance and not pay 90?'",
        "'speaker_0': 'Um. Okay. Um, actually, I want to say something. Thank you, Mr. DE. So. So when this item came to us before we. We all said, wow, these seem kind of high, and do we consider weekly rates and that sort of thing?'",
        "'speaker_0': 'We asked staff to go and do the survey and bring the information back. They did. It may still seem high, but it's not as high as it was. And I think it's it's actually quite reasonable the way it's laid out.'",
        "'speaker_0': 'I would recommend that we accept this and move on.'",
        "'speaker_9': 'Councilmember Vela Well, I was just going to say that there's nothing precluding Mom and Pop or any other landlord from requiring renters insurance. But, you know, my question for Miss Potter is if somebody did have renters insurance and they were collecting on that, is that then reimbursable under this or they're they're able to collect that.'",
        "'speaker_9': 'So if if there was an issue of them needing more money to cover the temporary costs, they could use their renters insurance as well as this amount. Correct.'",
        "'speaker_2': 'So that then may be an argument for going with the reduced rate and knowing that could be supplemented if you had renters insurance. Right.'",
        "'speaker_0': 'Is that a hand up? Council Both member? No. Okay. All right. Well, it is ten after 12. We've got two more items. Does anyone want to make a motion on this? I do favor going with staff's recommendation. Okay.'",
        "'speaker_2': 'Well, I.'",
        "'speaker_0': 'Councilmember Vela.'",
        "'speaker_9': 'How does this compare how does the temporary relocation compare with other cities? Do we know?'",
        "'speaker_0': 'Well, the thing I will just throw in the. We probably wouldn't we would try not to be sending renters to other cities and limited renters to the cities because people have children in school and things. So if we're looking at other cities, presumably their rates could be a little different.'",
        "'speaker_2': 'We did really focus internal to Alameda, looking at Alameda Hotels for the very reason of schools and commutes. We use the the meal allowance. That's the cities. And we we did the pet accommodations but looked locally on the accommodations.'",
        "'speaker_9': 'And those were all in addition to what we had had before.'",
        "'speaker_0': 'I know the pet accommodations we.'",
        "'speaker_2': 'Got.'",
        "'speaker_0': 'To we just we just recalculate it a little differently.'",
        "'speaker_2': 'Got it? Yeah.'",
        "'speaker_1': 'So I'd like to move this, but I would like to move with the idea with leaving open. I still think if somebody can find a place that's cheaper, that they can move somebody into that they should be allowed to pay.'",
        "'speaker_1': 'But, you know, if a landlord wants to put somebody in the Hampton Inn in Alameda, I you know, and it's cheaper than this and they want to pay for it straight up instead of paying to 20. That makes more sense to me.'",
        "'speaker_1': 'I'm not going to make that as a part of the the the action tonight. But I would like to leave open the idea that we can figure out we can kind of continue a conversation and bring that back when it's ready.'",
        "'speaker_0': 'That's how would we do that? Anybody I mean.'",
        "'speaker_1': 'I don't know. I would like to drop this tonight so that we don't have the higher rate. That makes sense.'",
        "'speaker_2': 'We can we can track the temporary relocation activity we have over the course of the next 12 months. And when we come back in 12 months with the annual report, we can report out on temporary relocation activity and we can.'",
        "'speaker_0': 'Do.'",
        "'speaker_2': 'It with the data. And then if there is a desire to do something different, it may be appropriate to do it at that time.'",
        "'speaker_1': 'Or we may find language that works for us that we can just bring back to council. And I'm not asking staff to do that research, but that would be my motion. I just I just still feel that this is high, but I feel like it's better than what we got.'",
        "'speaker_1': 'And I would like to move it forward and not have the I.'",
        "'speaker_9': 'I think my concern would just be that so I'm willing to move forward with this tonight and do exactly as Miss Potter suggested by one concern. Be if the landlord is like trying to put somebody in a motel or something that's a substandard, you know, condition and they've got medical issues or something else.'",
        "'speaker_9': 'I agree. So that would be my concern with so.'",
        "'speaker_0': 'So Councilmember, believe your motion is to approve staff's recommendation with the caveat that in a year's time the council reviews it. Okay, we have a motion to move a second. I'll second all in favor.'",
        "'speaker_2': 'I. I.'",
        "'speaker_0': 'Okay. Well, that didn't pass. Does anyone else want to make a motion? And I'll just remind you, we've got Schumer items in about 18 minutes to hear him.'",
        "'speaker_5': 'Point of information if we do change status quo, right? Mm hmm. Okay.'",
        "'speaker_0': 'Okay. Does anyone want to make a motion?'",
        "'speaker_2': 'And maybe. And maybe this will help the annual report for this current year. We'll probably come back in less than 12 months because it's already October, so it could be less than 12 months. I don't know if that helps.'",
        "'speaker_0': 'Okay. All right. So you don't even want to make a motion to continue with a higher amount or two? We need to. We don't need to, but.'",
        "'speaker_9': 'It's going to be done.'",
        "'speaker_1': 'I know. I look, I would I'll make a motion, bring back the housing report, but I. I would like some option when that housing or I would like a direction that that that when that housing is some sort of actual cost.'",
        "'speaker_1': 'I, you know, come back with that housing report.'",
        "'speaker_2': 'An analysis of a system where you could reimburse on our actual cost.'",
        "'speaker_4': 'Thank you. What was the most.'",
        "'speaker_1': 'Move forward with the the staff proposal? But when the housing annual report comes back, that there actually be some sort of reimbursement option for for consideration in adoption. They just need a second then.'",
        "'speaker_4': 'So I guess in is second then.'",
        "'speaker_0': 'You do have a second.'",
        "'speaker_2': 'I'll second.'",
        "'speaker_0': 'Okay. We have a motion and a second. All in favor. I, i the motion passes and I'm sorry to abstain in a per so it passes with three in favor, one opposed, one abstention. And now we are going to quickly.'",
        "'speaker_0': 'Thank you, Miss Potter. And I second what the vice mayor said. Okay, everyone, now we've got to run on to the safer for six F's.'"
    ],
    "Recommendation to Accept $1,600,786.50 Grant EMW-2018-FH-00229 from the Staffing for Adequate Fire and Emergency Response (SAFER) Program; and \n\nAdoption of Resolution Amending the Fiscal Year 2019-20 Fire Grants Fund Revenue and Expenditures Budget by $2,595,870, Each, and the General Fund Expenditures Budget by $995,084 to Allocate the Required Matching Funds mandated by the SAFER Grant Program. (Fire 220)": [
        "'speaker_3': 'Recommendation to accept a $1.6 million grant from the Staffing for Adequate Fire and Emergency Response, SAFER Program and adoption related resolution.'",
        "'speaker_4': 'Mayor Mary Craft and City Council. This is an action that you supported in the budget back in, I guess it was May or June of 2019. If you want a presentation, you can have one. But this is just following through on the grant that we applied for.'",
        "'speaker_0': 'Does anyone want a presentation move approval? Does anyone have a motion? Okay. And you have a motion? I have a second. All in favor. By any opposed, any abstain.'",
        "'speaker_3': 'The motion did have a speaker. And I'm.'",
        "'speaker_0': 'So sorry. Sorry, Speaker.'",
        "'speaker_3': 'I was asleep, but the.'",
        "'speaker_0': 'Story.'",
        "'speaker_3': 'Was just one motion.'",
        "'speaker_0': 'Yes. Who is the speaker? Oh, come on up. I'm sorry. Can I. So sorry. Yeah. So we're going to just suspend that motion for the moment. I'm so sorry. It's getting late, and I'm not getting sharper as the hour goes by.'",
        "'speaker_4': 'Good morning. Mayor Ashcroft and council members speaking on behalf.'",
        "'speaker_5': 'Of a group of.'",
        "'speaker_4': 'Concerned citizens. We respectfully request the council reject the grant. The grant involves hiring more firefighters.'",
        "'speaker_5': 'And we don't need more firefighters in the city of.'",
        "'speaker_4': 'Alameda. Presently, the city of Alameda, firefighters are scrounging around for.'",
        "'speaker_1': 'Things to do.'",
        "'speaker_4': 'They're not making themselves completely useful. And the worst thing about this.'",
        "'speaker_5': 'Grant is the people of Alameda have to match it with $1,000,000,000. And we don't need any more firefighters. We need fewer firefighters. Again, respectfully request the council reject the grant.'",
        "'speaker_0': 'Thank you. Thank you. All right. And that was our only speaker, correct. Okay. So now we will vote again to.'",
        "'speaker_5': 'Renew my.'",
        "'speaker_0': 'Motion. Yeah. So we have had a motion. We have a second.'",
        "'speaker_1': 'I'd like to make it.'",
        "'speaker_0': 'Just ask a discussion, clarifying question.'",
        "'speaker_1': 'Can you just confirm this? Just listen. You might want to hear this or not. First off, it's Mayor Ashcraft, not Ashcroft. Secondly, city manager, can you explain have we are we we have already hired these fire fighters in rejecting this will just put an additional burden on the city's general fund if we do not accept this grant'",
        "'speaker_1': '. Correct. The final positions are budgeted.'",
        "'speaker_4': 'The positions are budgeted. I don't believe the firefighters have been officially hired yet. They've been going through the recruiting process.'",
        "'speaker_9': 'We don't accept the money, though.'",
        "'speaker_4': 'You bet. Well, I'll just I'll put a different way. You budgeted for. It's for a fourth ambulance. If you don't do the grant, then we either don't have a fourth ambulance or we would have to budget more. We'd have to budget the entire amount from city.'",
        "'speaker_1': 'John Fine, thank you. And we've purchased the vehicle.'",
        "'speaker_4': 'Or we did purchase the vehicle. Right. Yeah.'",
        "'speaker_0': 'And I would say the need for the additional ambulance was established. Okay. Did we vote? Okay.'",
        "'speaker_9': 'So I seconded.'",
        "'speaker_0': 'Again. Okay. All right. All in favor. I oppose. Abstain. Okay. Was it four? So four in favor. In one. Abstained. Okay. We have one more item and 14 minutes to do it. I know you can do this council.'",
        "'speaker_0': 'Okay. That is nine. Be Madam City.'"
    ],
    "Consider Establishing an Implementation Plan for Creating the Shoreline Ecological Park on the West Side of Seaplane Lagoon at Alameda Point, Commonly Known as De-Pave Park. (Councilmembers Oddie and Daysog)": [
        "'speaker_3': 'Clerk. Consider establishing implementation plan for creating the Shoreline Ecological Park on the west side of Seaplane Lagoon and allow me to come clean on a city paved park because that it was placed on the agenda at the request of councilmembers Odie and Isaac.'",
        "'speaker_3': 'Three speakers.'",
        "'speaker_0': 'Okay. And we have speakers, right? Yes. Um, could I possibly suggest that we hear a speakers first? Because we've kept for so long?'",
        "'speaker_5': 'I think the referral explains itself. So let's hear.'",
        "'speaker_0': 'It.'",
        "'speaker_3': 'Richard Banger, Linda Carr Loney and Marjorie Powell.'",
        "'speaker_0': 'Yeah, sorry about that, folks.'",
        "'speaker_4': 'Thank you, Mayor, members of the Council City staff for staying alert this late and continuing on to finish the agenda. Thank you, Councilmember Odie and Councilmember De Saag for referring this. We've had a lot of progress and success with the redevelopment of Alameda Point so far site, a very terminal groundbreaking and I think now is a good'",
        "'speaker_4': 'time that we break ground to repurpose some of our shoreline. And the scale of this project, as you can probably see without any estimates, is going to be a big project. And it's it's big enough that it's probably not going to be tied to any mega project, mega redevelopment project that's going to absorb the cost of this'",
        "'speaker_4': 'deep park project. So that's why we shouldn't be waiting for some some big, big project to come along that's going to pay for this. We need a separate track where we seek grant funding and we need to start now.'",
        "'speaker_4': 'There's no no need to wait anymore. It's it's called out in our Climate Action Plan. There's all the reasons have been spelled out in the in the referral. And so the only $0.02 I would add is if you decide to go forward and create an implementation plan, including a with a proposed request for qualifications that the qualifications'",
        "'speaker_4': 'need to include some experience with floating wetlands, which is mentioned in the description of the EPA park in the town center plan. This isn't an untested idea. It's it's it's a tested idea. And it would be something we could implement here.'",
        "'speaker_4': 'And I would hope we would find somebody with expertize in that. And also, of course re purchasing that shoreline to meet the goals spelled out in the Deep Park plan. Thank you.'",
        "'speaker_0': 'Thank your next speaker.'",
        "'speaker_3': 'Linda Cardone, and then Marjorie Powell.'",
        "'speaker_2': 'Hi. Thank you again for staying to listen to to listen to us. I live in Alameda. I am also the president of the board of Golden. Get out of my society. We go and get out of Bonn and it's Alameda Conservation Committee I strongly support starting to plan for D pave park it's it would offer great recreation'",
        "'speaker_2': 'benefits great wildlife benefits and it would absorb carbon which and provide a living shoreline buffer. It has all kinds of incredible benefits and it's been five years since it was first planned. So I don't know, we just feel like it would be really a good time to at least get the planning started because it's going to take'",
        "'speaker_2': 'a long time to raise the money and build it out. So thank you. We urge you to make the referral.'",
        "'speaker_0': 'Thank you. Next, Speaker Marjorie Powell.'",
        "'speaker_2': 'Hello.'",
        "'speaker_0': 'Good morning, you hearty souls.'",
        "'speaker_2': 'Thank you. It's actually been interesting to sit and listen. And I appreciate the time and energy that you all put into this week. But my name is Marjorie Powell. I am in Alameda resident, a member of the friends of the Alameda Wildlife Reserve and it's in part because of the Reserve.'",
        "'speaker_2': 'But I am urging the Council to move quickly with finding a team to put plans together and do some grant writing to get some funding to actually implement this part. There are a couple of additional reasons. One, Linda mentioned the sea level rise and the need for wetlands.'",
        "'speaker_2': 'If you look at any of the reports of projected sea level rise, that end of Alameda will be clearly impacted. It's also given the number of recent reports about declines in birds, it's really important that we make sure we have plenty of green space, appropriate green space for birds.'",
        "'speaker_2': 'And as Alameda urbanized and that land that was once naval air station becomes more urban that we include parkland and wildlife areas. For the not just the birds, but the other animals in sea life there. And I also urge you to consider very seriously removing both of the buildings that are currently in that area.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'And thank you very much. Thank you to all our public speakers and for your stamina. Okay. So Mr. Desai, Councilmember Desai, Councilmember Odie, this is your council referral. Yeah. Yes. I'm sure that you're.'",
        "'speaker_4': 'Aware, Mayor, that Amy Wooldridge is here to answer any questions you have on this.'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'Of our park.'",
        "'speaker_0': 'I assumed it wasn't just an exercise in stamina, but thank you. Yes. A recreation parks director is out here. People, we have 7 minutes. Who wants to say what?'",
        "'speaker_5': 'Quickly. Quick. I'm not going to repeat the referral because I think it's pretty obvious. Thank my colleague for for joining me on it and Richard, for working together with me on it. I've been very passionate tonight, so I'll try to rein it in.'",
        "'speaker_5': 'But if I do, I'm still passionate about this. It's in our in our waterfront plan. This is in our climate action plan. We restructure our leases around doing this park. So I will just read from one of the public letters that came in and our former colleague, Mr. Matarese.'",
        "'speaker_5': 'It's all well and good to talk about the idea of these parks again. But the time the time for this kind of talk is done. Council needs direction and include deadlines. So I think we need to have our staff bring back a plan and give us a commitment on when they would bring us back this plan.'",
        "'speaker_5': 'And we can discuss this plan so we can get moving on this because like one of the speakers, that is going to take a long time for this, but we can't wait. Sea level rise is happening. We need carbon sequestration.'",
        "'speaker_5': 'So I hope we can we can find a place on our priority list for this.'",
        "'speaker_0': 'Thank you, Councilmember Desai.'",
        "'speaker_6': 'Well, thank you very much. Weekly Councilmember Odie asked me to join him in supporting this. I was very surprised because he had indicated to me that, you know, you are on your last go around on city council. This was adopted and nothing had been done since then.'",
        "'speaker_6': 'And in the last go around I supported this largely because there's a lot of great at that time, you know, you could see that there's was a 2015. You can see that there was a lot of great things that were proposed for the sea in and around the seaplane lagoon, starting with the at the time site A'",
        "'speaker_6': ', which was in its infancy as well as the ferry terminal. And at the time I supported the Depay's part because I thought, wouldn't that be wonderful that we're doing all this great development and planning and building, but that at the same time we're doing kind of a building through the D paved park.'",
        "'speaker_6': 'So so I supported it back then and I was surprised when Councilmember Ody approached me and it was about two weeks ago or so and said, you know, nothing had been done since then. And that's why I said, okay, yeah, for sure.'",
        "'speaker_6': 'I'll definitely sign on. So I look forward to moving forward with this because I think it is part of the whole development of the Seaplane Lagoon area, even though it is a building.'",
        "'speaker_0': 'Council, comments.'",
        "'speaker_9': 'Councilmember Vella So I'm happy to support this with one caveat. We've talked about kind of looking at everything together and where it falls with that and I think we have a number of parks planned and different things. So I do want to get this plan kind of underway, but I would also like it to come back or'",
        "'speaker_9': 'at least I don't know, Amy, if you want to.'",
        "'speaker_0': 'Yeah, maybe this will do it as long as we have you here. Could you perhaps come in? I don't want you to feel that this was time wasted. Do you want to just share your thoughts on this, since you are the recreation parks director?'",
        "'speaker_2': 'Sure. I absolutely support do pave park. It's it's an important amenity. I do want to take into perspective and I have an updated project list of what's currently happening with LAPD, PD, and I can go through super quickly, but it just gives the scope of work of what staff is working on.'",
        "'speaker_2': 'And so I would be interested in looking at prioritization from this council and maybe I bring that back as a separate item, not at, you know, 1230 at night, but but as an item. So you can see the scope of what's being worked on.'",
        "'speaker_2': 'And it's not a lack.'",
        "'speaker_9': 'Of desire, it's a.'",
        "'speaker_2': 'Lack of staff time. Everything from the City Aquatic Center to Jean Sweeney Park, Estuary Park, Enterprise Park, the pathways is short for inside. So just to name a few.'",
        "'speaker_9': 'In the in for the sake of time, perhaps part of the direction is that it comes back along with a full report from.'",
        "'speaker_0': 'The president and vice mayor.'",
        "'speaker_1': 'So I have two, two questions. First point number five is about the VA. Is the intent to actually for us to have a planning process for VA land.'",
        "'speaker_0': 'You wouldn't recommend that.'",
        "'speaker_1': 'Working with the Department of Veterans Affairs?'",
        "'speaker_5': 'I think the intent was to find ways to collaborate, considering the ideas, to dig up cement, to reuse and recycle instead of like discard. So it's not limited to the VA. I think you know that inside AA they took a lot of cement and reused it and you know, and stop waste.'",
        "'speaker_5': 'That's one of our main goals is to kind of look at the entire lifecycle.'",
        "'speaker_1': 'And it doesn't include the wetlands that are planned for that kind of area on the VA land as well.'",
        "'speaker_5': 'We're not you know, I think number five is just the recycling payment thing, if that's an option. Right. There's a whole different issue about wetlands. Okay.'",
        "'speaker_1': 'So I'm passionate about happy happy to see this moving forward. I was very involved with it, with the planning of it when I was at the planning board. I, I am concerned, given just the list of and not completed parks that we are already looking for funding on that we're going to start planning and fundraising for one'",
        "'speaker_1': '. But I think it's a good opportunity. I like the idea of a prioritization discussion, but I actually would suggest that maybe that starts with, I reckon, Park Commission. I think that's the reason they exist in that we have asked them to add this to that conversation.'",
        "'speaker_1': 'I'm also just going to flag there are actually the there were never plans for taking down Building 29. In fact, that was a specific part of the discussion at planning at the planning board and the city council and both parties decided to leave it there.'",
        "'speaker_1': 'It's a huge chunk of cement that is very expensive and problematic. And I would be very uncomfortable, including that we're going to start moving, look for plans for moving people and ripping it down. I think that there's a lot more discussion before we could start there, but if we have a motion to.'",
        "'speaker_0': 'You would separate that?'",
        "'speaker_1': 'I would separate I would separate that out. I think it's something that can always be discussed, but I wouldn't want it to be specific.'",
        "'speaker_0': 'Okay. In the one minute we have remaining. So the recommendation I'm hearing is to actually have this item start at the Recreation and Parks Commission and then come back to us updated.'",
        "'speaker_5': 'I mean, as long as there's a date and I mean, I'm fine with that. I'm not sure I would like six taken out, but maybe you can see potential demolition instead of, you know, committing. But at some point, when would we think we would have this part priority type session?'",
        "'speaker_5': 'Would that.'",
        "'speaker_2': 'Uh. Um, I think I'm thinking of what we have on the Recreation Parks Commission. I can probably bring it to them in December. And then that means to, based on how that conversation goes to council in January, February, where they have a very full November agenda for the commission.'",
        "'speaker_0': 'I think that's a date.'",
        "'speaker_5': 'That's a date certain, I guess. I think a date certain.'",
        "'speaker_0': 'Great. So is that sufficient direction to start? Because it is 1230 and we only voted to go to 1230.'",
        "'speaker_9': 'Yeah. Yes, I'm fine with that. But I also would just like to say, if there's a community group out there that wants to work on this, there's that parallel track exists.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_9': 'And we're.'",
        "'speaker_0': 'Into it. And they should probably reach out to the Recreation and Parks Commission and director. Okay, everyone, this meeting is adjourned. Thank you all for your time.'",
        "'speaker_2': 'And effort to. Good one.'",
        "'speaker_6': 'Oh, yeah.'",
        "'speaker_2': 'Okay.'"
    ]
}