{
    "Recommendation to Award a Contract in the Amount of $456,800, and Authorize the City Manager to Approve Contract Changes, if Necessary, Up to a Ten Percent Contingency in the Amount of $45,680, for a Total Amount of $502,480, to Simpson Gumpertz & Heger, Inc. for the Interim Inspection, Testing, Preliminary Analyses and Reporting Services for Rehabilitation of Piers 1, 2 and 3 at Alameda Point. (Base Reuse 819099)": [
        "'speaker_1': 'Recommendation to award contract in the amount of 456,800 and authorize the city manager to approve contract changes if necessary, up to 10% contingency contingency in the amount of 45,000 680 for a total amount of 502 486 companies and under INC for interim inspection testing, preliminary analysis and reporting services.'",
        "'speaker_1': 'Rehabilitation appears one, two and three at Alameda Point. Do you. And then we have.'",
        "'speaker_0': 'So member de sog understand you pulled up pulled this. I pulled it. I remember already. Did you want to start then.'",
        "'speaker_5': 'I just wanted to hear the presentation and then I'll make a brief comment after the presentation.'",
        "'speaker_7': 'I'm. Good evening. Good evening, mayor and City Council members. I'm Nanette Mchunu and the Community Development Department. Also in Bay three is. So this study, let me tell you a little bit about peers one, two and three. In 2008, the city that our governing body initiated a study, a condition assessment report of peers one, two and three'",
        "'speaker_7': 'at Alameda Point. And at that time, the peer well, let me just say the peers were constructed in the 1940s. Peer one peers two and three are large, reinforced concrete structures originally designed for aircraft carriers. Pier One is a smaller steel and concrete cellular structure.'",
        "'speaker_7': 'And at that time, the majority of Pier One was in general good condition. It was built in 19, rebuilt in 1980. Pier two, which is what I call the workhorse of our piers, because it's used on both sides for most for the myriad ships.'",
        "'speaker_7': 'And it is heavily used.'",
        "'speaker_0': 'And this kind of. Can you show us with your pointer location?'",
        "'speaker_7': 'Sure. Let's see if this pointer works.'",
        "'speaker_0': 'We would dim the lights, but then a councilmember couldn't see. Yeah.'",
        "'speaker_7': 'Oh. So I think this is a clicker, not a pointer. There's. All right. I might need some technical assistance from the city clerk. Yes. This one? Yeah, I. We're not working now.'",
        "'speaker_0': 'Oh, sorry.'",
        "'speaker_7': 'We need to turn it on that now. How many city employees? Okay. All right, so I'm here, it appears. This is Pier One, the shorter one. This is Pier two with all the ships on it. So it's the workhorse.'",
        "'speaker_7': 'And this is pure three where Hornet also is located. Just for your reference.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_7': 'You're welcome. So Pier three is actually in the best condition of all the piers. And it's sort of unfortunate because it's there and it doesn't necessarily take advantage of all of the services there. It could be since it's just a museum and it's not a working vessel.'",
        "'speaker_7': 'It it could you know, it's unfortunate that the ships these other ships are not being able to take advantage of it. So I'm the 2008 study gave us this assessment that the peers were in fair to poor or fairly good condition, depending on which peer we were talking about.'",
        "'speaker_7': 'And during that whole time we had been since then, we'd been really wanting to go deeper and figure out what we need to do to breathe new life in these pillars. We have a tenant and I'm here, the mirrored chips, which has about 15 more years left on these piers.'",
        "'speaker_7': 'And they are not doing so well because remember, this study said they were in good to fair condition in 2008, which was eight years ago. So the study that we're proposing to do tonight or we're asking your permission to find tonight is a let me back up a little bit that the 2008 report was a study that'",
        "'speaker_7': 'asked for more studies. And I'm I'm quite frankly, I'm kind of over those kinds of studies. And we really need a study that tells us what we need to do next. And as a city, we can't afford to wait to have 10,000 more studies to do.'",
        "'speaker_7': 'So the study that we're proposing tonight is the first in three phases. And so the first phase is to get in, get under the water, look at the piles, do some sampling. Tell us what the heck is going on down there, because we know that the piles underneath the piers are are damaged and there's some organic materials'",
        "'speaker_7': 'that are destroying them, which is not unusual for peat piles that age. And also, we want to know the next step. What do we do to repair them short of tearing them all out and rebuilding, which we don't have the money to do?'",
        "'speaker_7': 'What can we do to breathe new life into these piers for the next 15 years for myriad or longer? So the report that. But a group that we selected as BGH has a. Yes. Thank you. The city clerk is going to show you some pictures of our lovely piers from underneath the wharf.'",
        "'speaker_0': 'And Miss McNaught, she's pulling us up. Could you just remind us what Murat is and the importance of.'",
        "'speaker_7': 'Sure. Sure. The mirrored ships are the ready reserve fleet. They are in the Department of Transportation. They are not Navy ships. They are ships that were decommissioned and they inherited from the Navy. And they are deployed when there are natural disasters or a need for our country to respond.'",
        "'speaker_7': 'They were in Haiti during the earthquake. If there were if there were a huge earthquake and when there will be a huge earthquake in this region, the mirrored ships will play an important role. I attended a meeting with FEMA representatives talking about what's going to happen in the region.'",
        "'speaker_7': 'And the myriad ships were were.'",
        "'speaker_0': 'Key.'",
        "'speaker_7': 'To what's what will happen. And the fact that those ships are in Alameda really guarantees that goods and services will come to Alameda. So they're very critical to our city.'",
        "'speaker_8': 'Also locally, they ships alone represent roughly 6%, I think is the number of 6% of the energy consumed of all of Alameda, those ships alone.'",
        "'speaker_7': 'And also and I think and you can correct me if I'm wrong, but I think you may know this, I think when California was having a lot of rolling blackouts, the ships were able to convert to their own power source to save the draw within our city.'",
        "'speaker_7': 'So they were able to they're able to be a large consumer that helps our city. And they also are able to support themselves, which also helps the city.'",
        "'speaker_8': 'Exactly. That's the punch line is they're a major revenue source for our Alameda Municipal.'",
        "'speaker_7': 'They're one of our largest tenants. Allow me to point the other important thing, which is kind of an intangible, is that they support a lot of the maritime industry in the Bay Area. A lot of the small welders or people who can can make things that you can't make find for these ships anymore are employed by Myriad'",
        "'speaker_7': 'to help keep those ships running. So they they are a feeder of other other businesses.'",
        "'speaker_0': 'Thank you. And could they also be used if there were a time when we needed to evacuate a large number of citizens?'",
        "'speaker_7': 'I would imagine that that would be a significant that would be a role they could play. I don't know if they would play it because they really are about staging. They're able to put together a hospital in a matter of two days.'",
        "'speaker_7': 'And so I think that if we were needing to deploy people, I think between them and the wider facility, that would be a way of getting people on and off that island.'",
        "'speaker_0': 'Thank you. I think the pictures are up.'",
        "'speaker_7': 'Okay. So I think we're just going to go. I mean, I don't there's nothing to really tell. It's just a visual about the pork.'",
        "'speaker_0': 'Maybe tell us what we're looking at.'",
        "'speaker_7': 'Okay. So these are some of the piles that are underneath there, underneath our our piers. You can see the concrete is not in the best condition and you can keep going. And then some of them, you can see that the corrosive material on the outside, you'll see below the water.'",
        "'speaker_7': 'A lot of them are just eaten away. And so they're not even connected to the ground anymore because of the the corrosive material. This is the concrete on the work. This is the material that kind of gets on there and the concrete on the wharf and the vaults they're cracking.'",
        "'speaker_7': 'And, you know, I think I remember council member matter. I see if I see your mattress, you won't say anything over the water just gets beaten. And and that's kind of what we're seeing here is that this concrete is completely compromised.'",
        "'speaker_7': 'You see a diver down there looking at like the this the deterioration of the concrete on the piles. Am so sorry stage is proposing to work 250 days on I on I study the first 100 there were going to be in the water testing getting samples you see the little have a corrosion has below the water really'",
        "'speaker_7': 'compromise the the piles. We'll be testing. And then they take the the test results and they compile an engineering analysis. And remember, we're not going to have a report that asks for other reports. And from that analysis, they are going to identify the deficiencies in our facility.'",
        "'speaker_7': 'At the end of the day, the city is going to get a product with recommendations for repair, a variety of repair schemes. So they're not going to just force us into one kind of solution. They're going to say, if you want five more years, this is what we do.'",
        "'speaker_7': 'If you if you need 20 more years out of this, this is what you should do. And so we can work together. It will be a process of developing a plan for those, Piers. And in addition, there will be cost estimates.'",
        "'speaker_7': 'We will have they will provide us with what they think it'll cost to do some of these repairs. Of course, we will bid it out and see what the market says, but we'll have some idea of what we're getting into.'",
        "'speaker_7': 'And we'd have to we'll have to find the money. But most importantly, as we put together this plan, they're going we're going to put together a priority list of what we really need to take care of and and move move forward to try to, number one, keep the mirrored ships here and support them and to provide them'",
        "'speaker_7': 'with a facility that meets their needs through the life of their contract and even beyond. If if we can negotiate that. Or and also to breathe new life into our peers that have not really had a lot of TLC since the eighties.'",
        "'speaker_7': 'So that's the that's the goal of this.'",
        "'speaker_0': 'You have any questions?'",
        "'speaker_5': 'Just one question. Can you kind of describe because I'm not sure if everyone understands how the sewage is processed on a pier currently.'",
        "'speaker_7': 'So Pier two had a major sewer line break. And the problem, as you can see, this picture kind of tells you the problem with a lot of the infrastructure on the piers is it's under the piers. And so there are not a lot of contractors who want to work under the piers.'",
        "'speaker_7': 'And so either we end up getting gouged because we can only find one person who can do the work or we have to piece it together and figure out what we're going to do long term. And so we actually bid this right now, the the the ships are they're equipped to be on sea.'",
        "'speaker_7': 'So they their sewage is in their tanks. And we are paying to have those tanks pumped out and the waste trucked out. I'm happy to report that the council approved a sewer replacement project which will bring the sewer sewer line above the pier, but it costs $1.4 million and the project will be completed next month.'",
        "'speaker_7': 'So we'll stop doing that. But that's the that's what's going on here, too, right now.'",
        "'speaker_5': 'Then just quick comments. Thank you, Madam Mayor. I pulled this because, I mean, to me, this is kind of like my little pet issue is everyone. When they take me around town, they want to show me their deteriorating Piers.'",
        "'speaker_5': 'So I I'm all in favor of this. I'm not going to vote against that. I didn't pull it for that. But I think it's important for people to see these pictures because they don't get an opportunity to see them like we do either in like a consent calendar or when we're going on tour.'",
        "'speaker_5': 'So if you go around town, it's not only Pier two, you go to Alameda Marina. You know, some of the wooden ones are like stalactites and stalagmites where, you know, they're not even touching each other anymore. They're so rotted out.'",
        "'speaker_5': 'The Grand Marina, you know, the owners there showed me their peers and wharfs are deteriorating. Alameda landing. So it's just to kind of draw attention to this issue and keep it on our radar that, you know, this is kind of a priority of mine to make sure we find a way to replace this crumbling infrastructure.'",
        "'speaker_5': 'So I appreciate your presentation and the pictures. Thank you.'",
        "'speaker_0': 'And that being said, could you explain the funding source?'",
        "'speaker_7': 'I'm sure this this project is being funded out of the Tidelands Fund. So it is these these piers are on the Tidelands. And so all the revenue that's collected from the Tidelands property has to be reinvested in Tidelands property.'",
        "'speaker_7': 'So this is a perfect use for those funds.'",
        "'speaker_0': 'Thank you very much. Any other questions or comments? Council members? We have a motion. You pull that, you make it.'",
        "'speaker_5': 'I'll move approval of the item.'",
        "'speaker_0': 'I'll second all those in favor. A motion carried unanimously. Thank you.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Okay. Now we move to six a.'",
        "'speaker_1': 'Adoption of resolution appointing a member of the Civil Service Board. And Ron Taylor is a member of the Gulf Commission.'",
        "'speaker_0': 'I know what you mean.'",
        "'speaker_3': 'I move that we approve the appointment as listed.'",
        "'speaker_5': 'Second.'",
        "'speaker_0': 'All those in favor. I motion carried unanimously. Thank you. And I want to thank Troy Ozma and Ron Taylor for stepping up. I congratulate them.'"
    ],
    "Written Communication from the League of California Cities Requesting Designation of a Voting Delegate and Alternates for the Annual Conference.": [
        "'speaker_0': 'No. No motion fails. Okay. Okay. So then if we don't. Right. So we already had ten and ten by itself that failed. We had. So then. Okay, so then you can do a motion to reconsider, right. By someone that voted they would change their vote.'",
        "'speaker_0': 'So I will be that person for ten a only. I'll move that we hear ten a only a.'",
        "'speaker_3': 'Second so we don't keep going around in circles.'",
        "'speaker_0': 'I was in favor. I opposed that. That motion carried unanimously. So we will hear ten a only and on ten a the staff going to present. So first. But I need to note there's a conference coming up right for our cities and we need our delegates appointed.'",
        "'speaker_0': 'I wanted to know who from council is attending the conference. Member de SAG. Is there anyone else attending? It's in Monterey. It's in my right. It's the on matter. Which October one is this year, right? This is the one in long the October five event in Long Beach.'",
        "'speaker_5': 'How many can go.'",
        "'speaker_0': 'To the seven? Oh, you're right. In Long Beach. I think anyone can go. That's interesting. From council. Yes. Yeah. So do you want it? But are the dates it?'",
        "'speaker_1': 'I was reading the history seventh in Long Beach, Berlin.'",
        "'speaker_0': 'Okay. So remember to remember De SAG is planning to attend. I'm planning to attend. Are there other council members that want to attend? So why don't the two of you? I think it would be primarily because she is our delegate.'",
        "'speaker_0': 'You be the you are usually. I am I am the alternate. But I can't go on those dates.'",
        "'speaker_5': 'So I'll I'll move that. We nominate Councilmember de Sung as our primary and Mayor Spencer as our alternate.'",
        "'speaker_0': 'A second.'",
        "'speaker_3': 'Discussion.'",
        "'speaker_0': 'Yes, Vice Mayor.'",
        "'speaker_3': 'I'd like to ask if we can give direction to our delegates to carry to that. I'm asking the.'",
        "'speaker_0': 'Question what the questions will be asked.'",
        "'speaker_3': 'Well, all the all the let me can I finish by my rationale for this all of the league California cities emails that come to me. I can count on half of my hand the number that address the item that we just agonized over for the last 18 months.'",
        "'speaker_3': 'And we do have we have a crisis that is in all the big cities. And I don't see anything in the League of California Cities about that. And I'd like it to be brought up. I also I have a council referral on homelessness.'",
        "'speaker_3': 'I don't know if people notice we've done our accounts, but we have to start doing something about it because we have a real homeless problem here and it can't be just solved in Alameda and that doesn't show up on any of the lead California cities.'",
        "'speaker_3': 'And emails and notifications and newsletters. And one of the things I heard that one city is looking to ask the governor to declare a state of emergency so that funding can come. But we I think we really need to do something about this.'",
        "'speaker_3': 'And I'd like that kind of a message to be carried by our delegates. If it's agreeable to the council, do the league and say, let's let's start something on this so that we can we can get some help here.'",
        "'speaker_0': 'In number in a comment. I mean, I agree with all that vice mayor matter. I would also say it would be nice if we were to see the agenda and the items that are to be voted on and certainly before October 5th to the seventh, we should have an opportunity to do that.'",
        "'speaker_0': 'And so then we can all discuss and give direction because that's only appropriate, right? I think we would have to know specifically what the issues are as well.'",
        "'speaker_5': 'So it.'",
        "'speaker_3': 'Looks.'",
        "'speaker_0': 'Like a motion.'",
        "'speaker_3': 'But I just want to make sure that if it's not if that the issues are homelessness and rent escalation.'",
        "'speaker_0': 'Well, there's multiple issues, I know, that will be raised.'",
        "'speaker_3': 'And my point is my point is that they don't show up on any of the information that's being sent to me from California cities. And it's a big crisis. And it's just amazing that the league hasn't used its muscle to to get some help for us.'",
        "'speaker_8': 'Well, let me intervene. Let me just say that as the representative to the California League of Cities, where the city of Alameda, including the East Bay Division, what I can do is certainly ahead of time as soon as possible.'",
        "'speaker_8': 'Get in touch with our East Bay League of Cities. Contact the staff person, particularly, particularly to find out if there are a range of issues regarding rent crisis, a range of issues regarding homelessness, particularly just see if they will be as part of the agenda for the October annual meeting so that we can ahead of time understand'",
        "'speaker_8': 'what and then perhaps in late September or early October.'",
        "'speaker_0': 'Yeah. I might go a step further and tell you. Talking about Samantha Cahill, I think that you would contact her. And she's great to actually say we would like to see this come before the delegates in Long Beach in October rather than just an inquiry.'",
        "'speaker_9': 'In the city could put a. A request on the agenda on the.'",
        "'speaker_3': 'Air we got.'",
        "'speaker_9': 'And so that's one option. The other option is that they will present, like, probably. Four weeks, three weeks before the conference, what all the city submittals are, and then we can bring it and have the council.'",
        "'speaker_0': 'Vote on it. So then can we also direct staff to then see what's our time frame? We're going to have one August meeting, but then we won't meet again till the first Tuesday in September. Do we do we need to give staff direction now, maybe to prepare a request to the league?'",
        "'speaker_0': 'Do you want to bring up something? Just.'",
        "'speaker_5': 'So can you amend the motion then? I'll accept that.'",
        "'speaker_0': 'Okay. I would. Did you want to amend? You want to create a motion?'",
        "'speaker_3': 'I think if. If it's your pleasure to have to have two different motions. I'm happy with our our delegates. That's, you know, I think that's fine.'",
        "'speaker_0': 'But but the only way to change that motion at this point would be if someone had voted. And we have voted. Yes, Madam Chair. We have voted yes. Okay. We're just in the discussion period. So we could still do a friendly amendment.'",
        "'speaker_3': 'So I'd like to amend it so that it's all tied up in a package under this agenda item that we provide, that we direct staff to provide the delegates. With. With a direction to raise the issue. Of homelessness and rent crisis in our city is the delegate to the delegates at the meeting in Long Beach.'",
        "'speaker_0': 'Okay. So you said rent crisis. Yes. Okay. So are you asking the league to come up with something that would modify the work that we just did?'",
        "'speaker_3': 'So I'm looking for things that the state could do to help us out because there's a lot of things that funding for affordable housing that the state is not loath to do. Tax credits for affordable housing construction.'",
        "'speaker_0': 'That would be housing as opposed to rent support?'",
        "'speaker_3': 'Well, yes, housing. And in general, yes.'",
        "'speaker_0': 'Keep it broad, huh? I think so.'",
        "'speaker_3': 'Yeah, I.'",
        "'speaker_0': 'Agree. You should be on rent stabilization or rent control that I think if they just have rent, that that would be what people are.'",
        "'speaker_3': 'Yeah. Housing. Crisis.'",
        "'speaker_0': 'Housing.'",
        "'speaker_5': 'I accept that friendly amendment. My pleasure.'",
        "'speaker_8': 'I just want to make clear, make sure that so the amendment is that we will have those delegates and the alternate pursue in conjunction with the League of California Cities issues regarding housing, particularly with regard to the rent crisis and to homelessness.'",
        "'speaker_8': 'Yes. So that and within that, there are a range of approaches.'",
        "'speaker_3': 'Yes. To be determined by the collective body there.'",
        "'speaker_0': 'And are those the only issues that we are seeking? Well, I think we'll know more.'",
        "'speaker_3': 'Those are the ones that those are the ones that I wanted.'",
        "'speaker_8': 'To put the time to.'",
        "'speaker_3': 'And I have a council referral on one of them. And we've just spent hours and hours and hours going back across all of our terms here on on housing crisis issue with regard to the rent.'",
        "'speaker_0': 'And any other issues. And the council members know, I'm always impressed with the city. It was a League of California Cities that they do cover a way. I mean, given how diverse our state is, they cover a wide range of issues.'",
        "'speaker_0': 'I think the one that the vice mayor raised certainly resonates across the state, but I would be content to see the agenda, yes, when it comes in September. So could that be a friendly amendment to review the agenda at that time so we could and weigh in on those issues that we'll be perfectly.'",
        "'speaker_3': 'Happy.'",
        "'speaker_5': 'With that, too.'",
        "'speaker_0': 'Okay. All right. So there's a motion. There's not a second motion.'",
        "'speaker_2': 'Are you.'",
        "'speaker_3': 'Asking it?'",
        "'speaker_0': 'You second it. All right. All those in favor. I that motion carried unanimously. Thank you.'",
        "'speaker_3': 'I do think it's important that the entire council. At this meeting and then at the future meeting, we'll see the agenda, give direction to our delegates.'",
        "'speaker_0': 'So that's what should be out there. That's that's.'",
        "'speaker_3': 'Why. Yeah, right.'",
        "'speaker_0': 'I absolutely agree with that.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'And that it helps the delegates. I really do. All right. So now we are back to City Manager Communications. Okay. So patient.'"
    ]
}