{
    "Final Passage of Ordinance Amending the Alameda Municipal Code by Adding Article XVII (Tobacco Retailers) to Chapter VI (Businesses, Occupations and Industries) to Require Licensure of Tobacco Retailers and Prohibit the Sale of Flavored Tobacco Products.  (City Attorney 2310)": [
        "'speaker_0': 'And so based upon this, we have 37 speakers. I have had concerns expressed that people that oppose it are not very many and that they received only one minute last time. And so I don't know if there's a that would consider at this time how I would like to proceed.'",
        "'speaker_0': 'Remember, Audie. I say.'",
        "'speaker_8': 'Oh, I said 38, but.'",
        "'speaker_0': 'Okay.'",
        "'speaker_8': 'So it may be a lot a little bit too little, but, you know, maybe 90 seconds would be better.'",
        "'speaker_2': 'I don't know.'",
        "'speaker_0': 'Are you? Are you all at all. So. Are you all agreeable? If I ask how many are here opposing and how many are here? And they were. You don't want to know that.'",
        "'speaker_5': 'Madam Mayor.'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'There are regulations and rules don't specify between supporter oppose. It's really about limiting the number of speakers. This is the second time we've heard this specific item. It's on consent. So we're, we're just, um, I'm inclined to just follow what our rules are, which is to shorten the time.'",
        "'speaker_0': 'So I can share with you. When we tried to do the rent issue, we did have like 20 minutes each side or something where we did something like that. Instead of having everyone speak.'",
        "'speaker_7': 'We looked at it just.'",
        "'speaker_0': 'So that you're aware. Um. So, um. Would people be interested in having? The Council be interested. And so if I have 37, 38 speakers, if they get one minute, then that's half an hour and it's just over half an hour.'",
        "'speaker_0': 'Is that what you all want to do? One minute.'",
        "'speaker_7': 'I'm not feeling that.'",
        "'speaker_5': 'I'm fine with that.'",
        "'speaker_9': 'Is a second reading.'",
        "'speaker_5': 'Second reading. And we have a robust agenda.'",
        "'speaker_0': 'And so I'm hearing one minute per speaker.'",
        "'speaker_1': 'And a vote is required to suspend your rules.'",
        "'speaker_0': 'The rules are actually 2 minutes for the first 2 minutes, so.'",
        "'speaker_1': 'It drops to 2 minutes of their sentence.'",
        "'speaker_0': 'Right. So after seven or so, the rules are 2 minutes per speaker. Currently, if council wants to suspend the 2 minutes, then we need you to have a motion with at least four in favor to reduce it from 2 minutes to one minute.'",
        "'speaker_0': 'All right. So a member Ashcraft, did you want to sit? No, I was going to clarify that you need a 4 to 1 vote. The only thing, if you wanted to organize it, if it's even possible, and let the tobacco.'",
        "'speaker_7': 'Store.'",
        "'speaker_0': 'Proponents speak first. But I don't know how you do that. And the one thing I would say is that, well, I'm not going to tell people what to do, but, you know, you've got one minute. So so I'm hearing you.'",
        "'speaker_0': 'I mean, is there a motion I.'",
        "'speaker_9': 'Make a motion that we limit to because this is the second reading and there have been no changes. We limit it to one minute. Well, you.'",
        "'speaker_0': 'Don't even need to make the motion. That's what are. No, we have to have a vote of at least four. Yes, we have to have that. I'm happy to repeat it. So what normally happens is if you have at least seven or more speakers, that we normally get 3 minutes per speaker.'",
        "'speaker_0': 'However, if we have seven or more people turn in slips on an items and the rules reduce the 3 minutes per speaker to 2 minutes per speaker. However, what I'm hearing from council is they'd like to reduce it from the 2 minutes to one, in which case it does require a motion with an affirmative vote of at'",
        "'speaker_0': 'least four council members supporting the reduction from 2 minutes to one minute. So there is a motion made to reduce it from the 2 minutes to one minute. The second there is a second. Any discussion? All those in favor of the motion carries 4 to 1.'",
        "'speaker_0': 'All right. And so each speaker gets one minute. You will see the clock on here, please. No applause so that we can get through this and and help make everyone feel comfortable while they're speaking. And so I will call out five names and then I'll ask you to line up on the right side of this wall.'",
        "'speaker_0': 'Everyone on the I'm sorry. We can't have anyone on the right side of the wall here and go to the left other than the speakers. Then you can come up to go to the right side. And we actually need to make sure that the people in the hallway and in the overflow do they know that this item'",
        "'speaker_0': 'is being called so that they are here? We can make sure that the people that are here for the tobacco issue are here. And then we may have to do some rotation. Give me just a minute to make sure that everyone that's turning this up is here as opposed to out there somewhere.'",
        "'speaker_0': 'Because they have they get to hear the the speakers, the other speakers on this item. So right now we're going to we're going to be hearing the item on tobacco, 5G. And I'm going to call the first five and then you all can line up to my right.'",
        "'speaker_0': 'I'm a Amy. Linda. Astbury. Samir's sailor. Alec Cora. Karate Foster. Paul second.'",
        "'speaker_7': 'Five.'",
        "'speaker_0': 'And my apologies if I don't pronounce your name correctly. All right. So. Do you think we're ready? Yes. All right. All right. So Hymie versus.'",
        "'speaker_4': 'Good evening, Mayor. City Council. We're here today again to fully support the city tobacco retail license program, but not as the ordinance is proposed. Naito and its retail members have submitted many letters opposing the ordinance as written but not has not been included in the agenda packet.'",
        "'speaker_4': 'Where is the transparency of this policy process? As retailer workshop staff has promised to create a map and listing showing the retail stores impacted by the ordinance, which included the use sensitive areas and distance between retailers. This was not provided as of yet and not knowing the number of retailers.'",
        "'speaker_4': 'But yet the city has provided a cap. We ask the following to save the unintended consequences of Alameda of losing Alameda businesses. One Increase the number of retailers capped to about 45 from 1 to 100 per person. Retail motion changed the measurement between current retailers to be measured from door to door, and lastly, to keep the original'",
        "'speaker_4': 'ordinance language, which allows retail owners to sell their businesses within three years. Thank you for consideration.'",
        "'speaker_0': 'Thank you. Linda Astbury. They know this because.'",
        "'speaker_7': 'And Asbury, executive director of the West Alameda Business Association. I'm here tonight speaking differently than I did a couple of weeks ago because we hadn't really gotten into the comments. So our retailers have accepted the fact that the jewels, the menthol that's gone, they've accepted that.'",
        "'speaker_7': 'And I suspect there's some people wanting to talk and still on that. We need to go deeper into it. And it's about the ratio of number of residents per tobacco. We're suggesting instead of 2500, we're suggesting it's 12 1250, and we're suggesting that there's a cap of 55 tobacco licenses total.'",
        "'speaker_7': 'We're also suggesting that the buffer zone, instead of being 500 feet parcel to parcel, it's 300 feet door to door. This is absolutely devastating to these people that instead of a401k, they've invested their lives. And if this passes the way it's presented, 18 will lose their life savings and that we just have to prevent that.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, Samir Sala. S.M., I are.'",
        "'speaker_2': 'Hello. Thank you for allowing me to speak. I am here to talk about we, except for the ban of menthols, the jewels, all of that, but the zoning and having to take away licenses from a like a basically like robbing Peter to give Paul.'",
        "'speaker_3': 'If I'm not able to transfer a license, it's a problem because after 20 years of running the business, I have it taken away because I can't sell it. So, you know, he wanted to look into the zoning and as far as the 300 feet and as far as the cap.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Alec Crotty Foster Alec C really?'",
        "'speaker_4': 'It's great, great. Thank you. Honorable Mayor and members of the City Council. It's a pleasure to speak with you tonight. I am speaking to you as a Alameda resident, lifelong. I was born here and I also went to the schools here.'",
        "'speaker_4': 'And when I left Alameda for four years, I was I joined an organization called Students for Sensible Drug Policy because I am very much against youth and teen drug use and tobacco use. However, the resolution that has been proposed will not actually make a difference.'",
        "'speaker_4': 'Because how I am. I know because I talk to 18 year olds and like my cousins over it, over Thanksgiving, they can all buy it online without an I.D.. Anything that you do to regulate the businesses here will do nothing to keep tobacco out of the hands of youth.'",
        "'speaker_4': 'What is keeping tobacco out of the hands of youth is the raise of the minimum age, which still doesn't affect interstate commerce. So you should be taking your time and investing it into encouraging the state to better regulate interstate commerce and protecting the youth.'",
        "'speaker_4': 'And also these Alameda businesses that have been here for ages that also like any other things beyond tobacco. So thank you.'",
        "'speaker_0': 'Thank you. I'll second.'",
        "'speaker_2': 'Sorry. I just have homework.'",
        "'speaker_0': 'Mr. Scone, or.'",
        "'speaker_2': 'Put them up.'",
        "'speaker_0': 'Oh, okay. I see, I see. He has an exhibit and I.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'But and if you could screwed up, so then we can hear you.'",
        "'speaker_2': 'Because I don't want to use my time waiting. Okay.'",
        "'speaker_0': 'We're waiting for the exhibit.'",
        "'speaker_2': 'But I did it for you, Mayor. I was the one who drove around and everybody had a Thanksgiving. That was amazing. And mine was really sickening. It's really sickening.'",
        "'speaker_7': 'Okay.'",
        "'speaker_2': 'So if you look, I dotted every yellow mark and they're all mostly in the downtown area. These are all tobacco retailers. I was able to find that's about 50, 49 to 50. If you notice, they're all really in the residential area.'",
        "'speaker_2': 'Most of them are closed down because they won't be able to sell because in the downtown area, we're we're too close to each other. So if we tried to sell, there's that there's basically this ordinance has unintended consequences.'",
        "'speaker_2': 'I've talked to staff, the assistant attorney, multiple people, and everyone agrees that there is a lot of harm that wasn't intended for us to be able to sell our business. I don't care about this flavored tobacco. I'm asking for three changes.'",
        "'speaker_2': 'These three changes are about small businesses. I'm hoping that you guys are leaders, Jim. I hope you're a leader. Frank, I believe in compromise. Marilyn, please. While I wasn't able to talk to you, I tried my best. But I'm asking for three changes in six.'",
        "'speaker_2': 'There are 63 currently. There's over. It's over. I put it in the packet. There's over 24 businesses. It's actually now 30. When I did Google Maps that will not be able to sell their business, they put in three 500 free parcel parts of the parcel.'",
        "'speaker_2': 'Please change it door to door.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Go anywhere. Thank you. It started in January. At least give us a chance to sell our business. That's all I'm asking.'",
        "'speaker_0': 'Seven. Thank you very much. The next five people, Kimberly McGowan, if you could line up along the windows. Kimberly and Brandi Long and Denise Zachariah. Then Malia Zakaria and Seamus McGuinness sit. Karen. When? Charlie Kleinman. Sydney Williams is ten.'",
        "'speaker_0': 'Matt Hussein. All right, Kimberly. Hi. Thank you for having me again.'",
        "'speaker_5': 'I'm here on.'",
        "'speaker_1': 'Behalf of the Lincoln Middle School, PTA, our community of parents.'",
        "'speaker_0': 'Educators and the kids.'",
        "'speaker_1': 'Thank you for your recent.'",
        "'speaker_5': 'And strong support. When we last met.'",
        "'speaker_0': 'On the subject.'",
        "'speaker_1': 'I just wanted to say that we as parents and educators are absolutely teaching our.'",
        "'speaker_0': 'Kids.'",
        "'speaker_5': 'At home and in the classroom all.'",
        "'speaker_1': 'About the dangers of.'",
        "'speaker_0': 'Tobacco.'",
        "'speaker_5': 'And tobacco related.'",
        "'speaker_7': 'Products.'",
        "'speaker_5': 'Guess what? Some of the kids aren't going to get it. Some people aren't going to get it or they're.'",
        "'speaker_1': 'Just going to ignore it.'",
        "'speaker_0': 'And will.'",
        "'speaker_7': 'I?'",
        "'speaker_5': 'You got to take your.'",
        "'speaker_1': 'Responsibility for those sort of things. Let's not make it any easier.'",
        "'speaker_0': 'So as as.'",
        "'speaker_1': 'The community of Lincoln Middle School, we're just imploring you as our city leaders to.'",
        "'speaker_5': 'Support the teachings that we're doing at home and in the classroom with government action.'",
        "'speaker_7': 'Let's put help before profits.'",
        "'speaker_0': 'Randy and then Dennis.'",
        "'speaker_2': 'Good evening. I'm Randy Wang and I'm with with California Golden Gate Public Health Partnership.'",
        "'speaker_4': 'And we breathe California do a lot of work helping in schools to provide tobacco related education.'",
        "'speaker_2': 'And for that reason, one of the things that really stands out in my mind is the large number of youth using tobacco products because of these flavors. We know that in 2017, the percentage of. 11th graders.'",
        "'speaker_4': 'In Alameda Unified Schools.'",
        "'speaker_2': 'Who had already used a vaping product was about 22%.'",
        "'speaker_4': 'So we think that legislation that you're considering.'",
        "'speaker_2': 'Today would do a lot of good to protect youth health. Thank you.'",
        "'speaker_0': 'Thank you, Denise. ZAKARIA And then Malia.'",
        "'speaker_5': 'It evening, Madame Mayor.'",
        "'speaker_7': 'And City Council members. As a parent of two middle school students and resident of Alameda, I just want to thank you for being very proactive in putting forth this policy of banning flavored tobacco that you're putting through tonight.'",
        "'speaker_5': 'I'm heartened to see so many young people who have rallied and worked so hard over the last month to educate the community about the epidemic of vaping by our youth. I notice the voice of tobacco retailers may be more vocal than the last meeting, but I urge.'",
        "'speaker_7': 'You.'",
        "'speaker_5': 'Stay strong in keeping this ordinance worded exactly as it is. Your leadership on this issue is the best way to protect Alameda youth.'",
        "'speaker_0': 'Thank you, Malia.'",
        "'speaker_1': 'Hello. City council members, my fellow Girl Scout, Alexis and I would like to thank you for the common sense tobacco retailer policy you voted for in the last meeting, which creates a strong ordinance intended to intended to protect all Alameda residents from harmful tobacco products by prohibiting the sale of candy flavored tobacco and menthol products.'",
        "'speaker_1': 'You are confirming how important it is to breathe clean air. We believe this. We believe this ordinance will reduce the chances of any of our friends. We'll try vaping and kids my age. Avoid the temptation of flavored tobacco.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Seamus.'",
        "'speaker_4': 'Good evening, Mayor and city council members. My name is Seamus McGinnis. I'm a senior and small high school. I just want to say thank you so much for going ahead and banning or banning the sale of flavored tobacco products in Alameda.'",
        "'speaker_4': 'It really is an epidemic. I'll meet a high school has told now lock their bathroom doors open so that staff members can see inside the bathrooms so that they can see any kids that are using these vaping products.'",
        "'speaker_4': 'And I'd say while I have friends, Alameda High and they say about 2 to 3 kids are taken every day to the office because of this problem. My friend here, Mason Legg, his grandfather died from smoking CIGARETS. And smoking isn't just Cigarets anymore.'",
        "'speaker_4': 'It's now these vaping products. It's getting to kids and it's hooking them in their youth. And so these tobacco companies can sell them their entire lives and profit off them. These kids their entire lives. Thank you. And we appreciate this very much.'",
        "'speaker_0': 'Thank you, Karen. And then Charlie.'",
        "'speaker_7': 'Hello. My name is Karen Nguyen and I am a senior at Arsenal High School. And I just want to state that I have a lot of family and friends that are a bit older than mine, that have experienced the negative effects of long term tobacco use.'",
        "'speaker_7': 'And I don't want the friends I have right now in high school to start using them because companies like the ones we're talking about are targeting my friends. I don't want to see them in pain or any type of negative effects that I've seen in the past.'",
        "'speaker_7': 'And I know that these companies are using, as we said, candy and special flavors to make it seem like they're safe or to make it seem like it's safer than smoking. CIGARETS But it's actually not. And it's giving students false hope.'",
        "'speaker_7': 'So I wanted to thank you for all the work you put towards this ordinance.'",
        "'speaker_0': 'Thank you, Charlie.'",
        "'speaker_5': 'My name is Charlie Clement. I'm a senior and still high school. I want to start off by thanking all of you city council members for taking this action to help prevent.'",
        "'speaker_7': 'Specifically teen.'",
        "'speaker_5': 'And youth nicotine addiction. I've seen the effects of this in my peers and also in family members.'",
        "'speaker_7': 'Who or older.'",
        "'speaker_5': 'Family members who have had nicotine addictions with cigarets and now with my friends.'",
        "'speaker_7': 'Seeing the signs of that in them as well, using the vape.'",
        "'speaker_5': 'Products and the flavored products as well. So I want to thank you for.'",
        "'speaker_7': 'Helping to take this step to prevent that. I would hope that everyone.'",
        "'speaker_5': 'Supports this as well because we would like to make sure that our friends and our family don't suffer these.'",
        "'speaker_7': 'Consequences that can end up being deadly in the end. Thank you.'",
        "'speaker_0': 'Thank you, Sidney. Hello. My name is.'",
        "'speaker_7': 'Sydney Williams and I am a senior. And in our high school the tobacco industry.'",
        "'speaker_1': 'Targets children like myself.'",
        "'speaker_7': 'And my peers. Why else would there be such a problem with the youth buying these products if they were not marketed towards us? Candy flavored products catch the eye of toad and it make it seem like they're less dangerous.'",
        "'speaker_7': 'Nearly one in four high schoolers in Alameda have vaped and use these candy flavored products, and I truly believe that this number is probably higher. But kids do not want to admit it. Many of my friends have been afflicted by this dangerous gateway drug.'",
        "'speaker_7': 'I have seen members, family members suffer from lung cancer, and I do not want my friends to fall victim to the tobacco industry. The tobacco industry is trying to make lifelong customers out of us. And in the sale of candy flavored tobacco in Alameda is a crucial step to saving kids and preventing the youth from a lifelong'",
        "'speaker_7': 'addiction to tobacco. So thank you very much.'",
        "'speaker_0': 'Thank you. All right. Our next ten speakers again. And I want to thank all of you for being respectful of all the speakers. Matt Hussein. Debbie George. Antonio Newman. Sir. Sir, in surrender. Sing Cinder Doll. CARR I'm sorry, maybe.'",
        "'speaker_0': 'KLR I'm not positive in Inderjit Singh Sidhu. Timothy Langford. Narinder Massoud. Ha. The Shins are. Ali Shah's. Bob Secon. Lee That's approximately ten and. Matt.'",
        "'speaker_3': 'Good evening, Mayor and Council Member. I've been a local merchant for the last 30 years and I'm not opposed to this ordinance because I want to sell the product to the youth. The reason I'm opposed to this ordinance is because.'",
        "'speaker_3': 'It doesn't make sense. We are already working ethically and working hard to keep the tobacco product out of the children and tobacco product away from the youth. And we we are already know the the our responsibility. But your new ordinance is not just going to shut down all the businesses, but also is going to take away our'",
        "'speaker_3': 'retirement. So we have worked for the last 30 years to build our businesses, worked ethically, and now we are getting this results that because of the other reasons that the youth can find their tobacco from their way and you are punishing the store owners.'",
        "'speaker_3': 'So this is absolutely not right. I hope everybody reconsider that. Thank you.'",
        "'speaker_0': 'Thank you, Debbie George.'",
        "'speaker_7': 'I am Debbie. George and I hold a state tobacco license here in Alameda. Run a business here for almost 45 years. And what I see is some some deep flaws in this. It's not that we're these people out here that have the stores are in not in favor of of getting rid of the tobacco for children marketed'",
        "'speaker_7': 'to children. It's the fact of how there's this ordinance here in there was a flaw in it where if you want to sell your business, the next buyer cannot get a retail tobacco license because you've limited from 50 retailers down to 32.'",
        "'speaker_7': 'How, how, who who's going to go? Who are you going to get rid of? How are these people going to sell the business when they can't get a tobacco license if that's part of their business? It makes no sense to us.'",
        "'speaker_7': 'And it's it's not fair to the public as well, because the convenience store is just that. A convenience store. Eventually they'll all be gone. So please hold off on this tonight.'",
        "'speaker_0': 'Antonio.'",
        "'speaker_2': 'You name it, Madam Mayor and Consul. I own the Valero, the Alameda Valero gas station, and I can assure you we do not sell Cigarets or tobacco for youth. We have strict rules. We have been very careful in our India and I have a feeling that in a way we're being naive because.'",
        "'speaker_2': 'Now all these cigarets menthols and jewels and all that will be sold in High Street by the dealers that used to sell marijuana, but now are out of a business because they can sell it in shops. So you take it from the shops and you put it on the street and it's a knife of two cuts both'",
        "'speaker_2': 'ways. And at least we don't sell to use, but over there by dealers and people who will go to Vallejo to buy them and bring here to sell. There won't be any control.'",
        "'speaker_0': 'Thank you. Surrender.'",
        "'speaker_2': 'Good evening, everybody. And my name, surrender. And I am in the business class. 21 year old graduated from school. And if we lose a license and we lose all kind of a business because cigaret and beer is the best of all and we have in the store.'",
        "'speaker_2': 'So if the people.'",
        "'speaker_0': 'I'm sorry. I'm going to interrupt. We cannot have any talking in the audience. If you're not able to sit quietly, I'm going to ask you to leave. We he has the right to be heard, just like all the other students that have been speaking.'",
        "'speaker_0': 'Thank you. He gets additional time. Thank you.'",
        "'speaker_2': 'We are the five people working in the store and we if we lose their license, we lose all business because all of them depend on cigarets and beer. And this is convenience store. We lose everything. If we lose the cigaret license.'",
        "'speaker_2': 'You're going to have to think about that. From last year, we didn't have even one thing that we never sell to any minor anything other than any problem. Even you check our record. Thank you.'",
        "'speaker_0': 'Thank you. Cinder. S I ndr and then it looks like a new word DHL. A new word k. A u. R. In in inderjit i. N d e. R. J i. T.'",
        "'speaker_3': 'Hello, everyone. I've been in this business last 20 years and having like four or five employees working for me, generating all tax revenue from the city and then 20 years in one business, that's all my. 401k and that's all I have it after 58 years old, I don't know what to do when I'm selling to that business'",
        "'speaker_3': '. So we'd not sell to any minors. And we want to be having less crime in the city. We don't want to be anyone sell on the streets. Also these kind of products. And if we pass this bill today, make sure we pass the online so no one can buy online.'",
        "'speaker_3': 'Also, people are buying online here and there are they are cousins for their sisters, brothers. So we make sure we will do that one also. So I will say no to that one. Thank you.'",
        "'speaker_0': 'Thank you, Timothy.'",
        "'speaker_3': 'And I thank you for hearing me out. I'm a business consultant. I work with several small businesses here in the East Bay, including several here in your community. I've worked with these people for over the last 15 years that own small businesses.'",
        "'speaker_3': 'And what they really have is a lot of sweat equity in their business. Many came with not much came from other countries that immigrants inside of them really have built up a life this way. We saw a nice rendition in Nice tonight of Janet having an opportunity to retire and go on to a new life.'",
        "'speaker_3': 'Their retirement and their ability to go off and enjoy that type of thing is wrapped up in their business, and this ordinance really threatens their ability to do that. So while we sit here and celebrate some people, even though it's well earned and deserved, we are threatening others for that same opportunity.'",
        "'speaker_2': 'Of taking that away. And what we're not asking is for it to be repealed. I think the best thing would be working with the business community to find a user, a way to extend it, or give a larger.'",
        "'speaker_3': 'Window of time to allow them either to change their business and what they sell and their mix of products and get out of tobacco or sell their business and move on. And so an opportunity to just.'",
        "'speaker_2': 'Change that and give them the opportunity that we give ourselves. Thank you.'",
        "'speaker_0': 'Thank you. Narinder and Air India are.'",
        "'speaker_4': 'Good evening. So I'm not in favor of. To this kind of readiness because the problem is. The people they can get from here and there. Everybody's seeing that. But the as a business community, when you are losing your business, you are going to think about that, your business.'",
        "'speaker_4': 'So you are going to try to sell and get away from this city so they can open there somewhere. It's a it's a both way. If we lose, you guys are going to lose. So the things that.'",
        "'speaker_0': 'Thank you. 0vhino S.A.. Thank you.'",
        "'speaker_2': 'Hello. My name is Paul Denson, and I've been I've been in the convenience store business for over 13 years. And this ordinance law, a lot of the business owners have invested thousands of dollars, millions of dollars into this business and taking away tobacco license.'",
        "'speaker_2': 'They actually lose their goodwill. This product will always be available one way or the other. I have three kids, 11, eight and four. I'm also concerned about my kids, but taking it out of the stores doesn't keep it out of their hands.'",
        "'speaker_2': 'It starts at home. We got to educate our kids. We got to spend more time with them. Bye bye. Banning tobacco license for some businesses that will lose their goodwill or lose their retirement. It does not make sense.'",
        "'speaker_2': 'If you want to keep it out of the hands of the children, it starts at home. It does not start by banning anything. It's available everywhere. 91. I've been available everywhere too, for a long time. Thank you.'",
        "'speaker_0': 'Thank you, Ali. Al, I.'",
        "'speaker_4': 'Hello, everyone. I think if Alameda banned the menthol and all the flavor and we're going to lose the business and the second think alameda city. I think they said the cigarets the regular cigaret. They sell more and menthol and flavor in a city in alameda and the menthol we be listen, we pay taxes.'",
        "'speaker_4': 'We buy everything for we sell them. We have the license later on. If they if we get bent is going to be in the street with no license and it's going to be more crime, more problem, more fighting like the other city.'",
        "'speaker_4': 'They sort of like back in cigaret $20 now in the street, $2 $3 for one cigaret cigar. They sell more like the other city and the second think when they you can solve your business transfer if you had if any have been to you, you have to sell something.'",
        "'speaker_4': 'How are you going to do? Because you have to lose your business and you lose your life with it, if anything going on. And right now we see in Alameda more businesses come in, big businesses and they do more really good.'",
        "'speaker_4': 'We lose a lot of businesses, small businesses and the big businesses.'",
        "'speaker_0': 'Thank you, Bob.'",
        "'speaker_3': 'My name is Bob Seger. I have a 7-Eleven across the street from here. We go street to street, the whole town. We find 49 stores out of 49. Six pharmacy degree. Six pharmacy. We have 43 left. Then six are school near to school.'",
        "'speaker_3': 'So we left 37. But this time through distance, we are losing 24 stores. They cannot sell it. So only 30 stores they can they can get they can sell their store. All the others, all our goodwill and everything goes said goodbye.'",
        "'speaker_3': 'It's not right. What did you should do? Make that I ratio 15 under and distance store to store should be instead of 500 to 300. And it should be door to door like a school to store. So please do that.'",
        "'speaker_3': 'Otherwise we are losing 24 or 30 short will go right on the.'",
        "'speaker_0': 'Thank you. All right. I'm going to call another ten speakers, approximately. Line up on long the right side, my right to windows here. And in fact, if there's any of you that would like to leave at this time, this is a good time.'",
        "'speaker_0': 'A pause. Thank you. Thank you for coming out and make sure you pick up all your trash before you leave. Unfortunately. Last meeting, there was a lot of trash left here, so I really appreciate you taking it with you this time.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'That I'm going to call for a short recess. We're going to take a five minute break so that we can let other people come in and fill those seats. So thank you. That's. Without recording. No recording right now.'",
        "'speaker_0': 'I just need to be able to speak to the audience. If there's an empty seat near you, please raise your hand so we can. All right. Let people know. And you are that are looking for a seat. Anyone that has an empty seat near them, there's a hand up.'",
        "'speaker_0': 'Please take a seat. Thank you. And I do want to remind everyone, as you leave, please take any of your trash. And for our last council meeting, we had a lot of trash left here. That usually does not happen, including opened bottles and cans with had liquid in them.'",
        "'speaker_7': 'Very sad.'",
        "'speaker_0': 'Let's see how many more.'",
        "'speaker_7': 'Be. I'm just in the back channel.'",
        "'speaker_2': 'When they get rolling.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_7': 'Some. Well.'",
        "'speaker_1': 'He's looking for David.'",
        "'speaker_7': 'Oh. But in. Now. Well. That's. Mm hmm. Mm hmm. Mm hmm. Yeah. You know, so some of this. Oh.'",
        "'speaker_0': 'Yes. No.'",
        "'speaker_5': 'I'm already I'm already.'",
        "'speaker_7': 'Sure I'm.'",
        "'speaker_2': 'Not going to call another.'",
        "'speaker_8': 'Band.'",
        "'speaker_7': 'There.'",
        "'speaker_5': 'And no, I'm not feeling well.'",
        "'speaker_7': 'Okay.'",
        "'speaker_5': 'Now I'm dizzy.'",
        "'speaker_7': 'Oh. The air finally going. Here.'",
        "'speaker_2': 'Already. We are ready. All right.'",
        "'speaker_0': 'Thank you. We're going to continue the meeting at this time. I'm going to go ahead and call another ten names. And if you could line up to my right and everyone needs to find a seat. Thank you, sir.'",
        "'speaker_0': 'And if you if you don't see a seat, then you may stand to the left. Otherwise, we greatly prefer if you take an empty seat on the armed. Ahmed. I believe that's the name. Dada Boulevard did air the h u LHR.'",
        "'speaker_0': 'The first one I called was Ahmed H. Medhi, and the last name is Ahmed. The next one is Shay Overstreet. If I call your name, please line up here to my right. I want to make sure that if we have Ahmed, please come to my right over here.'",
        "'speaker_0': 'We have a d r d d idr. Please go to my right. Shay Overstreet. We have Shea Turner. Sure. For bronze. The first name is Turner Michael McDonagh. John Sykes. A Neal Pandey and I l Lizzy Veltman. Philip Gardner.'",
        "'speaker_0': 'All right, first Speaker Ahmed, if we find three. No.'",
        "'speaker_7': 'I we don't. Okay.'",
        "'speaker_0': 'So I'm going to ask I'm going to keep the names of the people that aren't responding will call again at the end the da de idr.'",
        "'speaker_4': 'Good evening, Gregory. I'm also a student, like many of the students before spoke before me, but I'm a student in college. And what I want you guys all to know is that when you take away a tobacco license, you're basically killing a business.'",
        "'speaker_4': 'And if you look around many of the people that went before me, you'll see that they're all first generation parents working for their children. And these same parents are the ones that put their kids in college. My dad my dad was able to afford for me to go to college to become an engineer.'",
        "'speaker_4': 'My brother, he's going to college to become a doctor. So what I want you guys all to know is that. That you're hurting the families themselves, too. When you when you remove the tobacco licenses. So it's affecting the future, the students.'",
        "'speaker_4': 'So how are how are we supposed to be able to afford to go to college when the business that my family is running goes away?'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Shay Overstreet.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_5': 'I'm here to urge you to support.'",
        "'speaker_1': 'Health over profit and support this initiative. The people that I know that.'",
        "'speaker_5': 'Use these products currently, they newly use them. My brother's in college.'",
        "'speaker_1': 'Am and him and his friends that use them.'",
        "'speaker_5': 'They're addicted. They treat their e-cigarette products as being as.'",
        "'speaker_1': 'Important to them as their cell phones. They lose them. They're going to find them. And they're newly using these in.'",
        "'speaker_5': 'The last couple of years. Your support will protect not only the health of our community, but the buffer zones will protect.'",
        "'speaker_1': 'Youth from getting them into their hands, like the people I know that have them right now. Thank you.'",
        "'speaker_0': 'Thank you. Turner Blaze. Turner. Michael McDonough.'",
        "'speaker_9': 'Good evening, mayor council. I'm Michael McDonough, president of the Alameda Chamber of Commerce. We in no way condone the use of tobacco by children. So the ban on the flavored tobacco is fine. But what we do support is small business.'",
        "'speaker_9': 'And I think you've heard tonight the effect of this on small business. And of course, we're concerned about the children. But what about the lives of these business people who have put 30 years in to their retirement? And just this was great for the child to go to college.'",
        "'speaker_9': 'This is real life and it affects these businesses. A lot of times legislation has unintended consequences, and I think this is one of those cases. So the ban on flavored tobacco isn't the issue with the chamber in many of these businesses.'",
        "'speaker_9': 'It's the time frame in which you do it. So we would request that you start this January one, 2020 to give them time to sell out of their inventory. We would suggest that you do not limit the amount of licenses so that these people do not go out of business and lose their own retirement.'",
        "'speaker_9': 'Thank you very much.'",
        "'speaker_0': 'Thank you. John Sykes.'",
        "'speaker_2': 'Evening. The name is John Sex and I'm a smoker and I've recently gone from smoking a lot of cigarets to vaping saying that that's my choice. And just like it's any other choice to grab a drink or to grab a smoke or whatever it is, you know, we all have vices and I don't.'",
        "'speaker_2': 'Also, it comes down to money and that's what this world is. This is money, money, money, money. And I just. It's not right. So anyway, I am. I'm for it. So thank you.'",
        "'speaker_0': 'Thank you, Aneel. And I'll.'",
        "'speaker_3': 'Well. Good evening, honorable mayor and experienced.'",
        "'speaker_4': 'City council member. My name is Anil Pandey. I am also M.I.T. student and I do work for a small nonprofit and I'm here to support that. Taking away the license of tobacco are not going to solve the problem because you start from the home and school and school job, a school teacher, all everyone's supposed to teach that'",
        "'speaker_4': 'what is right and what is wrong, what is good and what is not good. So by taking away all those license, I believe that a lot of people are going to be losing their job and they cannot afford it.'",
        "'speaker_4': 'And I will humbly request you to give time. If you decided already they should sell the business and until them you should keep them continue the business because they all have to sell the business. It takes time. So whatever time it takes, you should give it give it the time to sell the business.'",
        "'speaker_4': 'So that's why I would like to request keep the license until they sell the business, not because of the one year or two year. Whatever time they can sell it, they will. We all have to help you. We help them to sell it.'",
        "'speaker_4': 'That's fine. Thank you.'",
        "'speaker_0': 'Thank you. This is Elton.'",
        "'speaker_1': 'Good evening. I just want to I'm with the American Heart Association, Roosevelt. And I just wanted to say thank you so much for your leadership on this topic. Let's remember, this is about social justice and protecting our youth.'",
        "'speaker_1': 'Two quick points. One is that nobody's going to lose their current license to sell these tobacco products. And what we're talking about is whether the next person who buys that store should continue to sell tobacco products. And I think that whoever buys the store will buy it with the knowledge that they are not allowed to sell tobacco'",
        "'speaker_1': 'products. And so I'm sorry. The second piece that I want to say is that sorry, just a little thrown off by the comments behind me. You know, kids are vaping at a higher rate. They're getting addicted to nicotine.'",
        "'speaker_1': 'They're getting it closer to schools. There's good evidence that that reducing the access around schools and child sensitive areas reduces the amount of smoking there's. And on the federal level, we are working very hard with the federal government to push them to remove online sales.'",
        "'speaker_1': 'These are products that are dangerous and deadly. We're working on many levels to try to reduce access, and I encourage you to vote yes.'",
        "'speaker_0': 'Thank you, Dr. Philip Gardner. Maybe I speak on the side and please submit your slip.'",
        "'speaker_2': 'Thank you for having me back. Alameda County is on the right.'",
        "'speaker_3': 'Side of history. San Francisco passed citywide restrictions in June. Richmond in.'",
        "'speaker_2': 'July. Beverly Hills in August. Marin County in October. Today. Today, Santa Cruz passed a citywide ordinance. Berkeley is taking it up for city move their buffer zone to citywide on the 11. Last week, Los Angeles city council.'",
        "'speaker_3': 'Introduced the same measure that you have here. Let me just say we have too much data that shows the greater concentration of tobacco outlets leads to greater use by youth. The FDA finally figured it out that it needed to ban menthol, but let me say it'll take them years, if not longer, to get this done.'",
        "'speaker_2': 'It still resides here at the local level.'",
        "'speaker_3': 'We need to take flavors out of poison. I want to applaud the.'",
        "'speaker_2': 'City council for what they've done. And thank you for your time. Thank you very much.'",
        "'speaker_0': 'Thank you. I'm going to go back a couple of steps here to make sure if you're here are not Cinder S.T.A.R.. Amid a dramedy Turner plays. All right. I'm going to call new speakers now Serena Chen. Louis Schneider.'",
        "'speaker_0': 'Alexis K You see, h i, I believe. Bride Abdullah, Robert Todd, Irene Nika, Mike Choe and Sasha Shaw for XYZ Eye. Theresa Dames. Paul Cummings. And if you want to see if you wanted to speak on this item, please submit your slip.'",
        "'speaker_7': 'Good evening, Mr. Spencer. Members of the Council. I just wanted to again thank you for having the courage to take a stand here and follow the lead of San Francisco and Oakland, San Leandro and all the other cities that Dr. Gardner mentioned.'",
        "'speaker_7': 'Because basically everyone is realizing that this is. It takes a village to help people turn away addictive substances. And part of the village is city government and city government. So the reason why the smoking bans have taken effect and have actually worked here in this state and working all over the country to reduce tobacco use.'",
        "'speaker_7': 'I'd also like to say that I really feel for the merchants here in my generation. Many of my friend's parents had convenience stores. That's how they started out. That's how they sent their kids to college. But now we know that some of the products that are being sold are killing the same children and their children's friends.'",
        "'speaker_7': 'So please, let's look at different profit centers for people and help the businesses thrive and be a healthy for a healthy city. Thank you.'",
        "'speaker_0': 'Thank you. This might actually be Holly Schneider. Sorry.'",
        "'speaker_7': 'That's okay. It's my handwriting. Good evening. My name is Holly Snider, and I work for the Alameda County Public Health Department for the Tobacco Program. And thank you for tonight for giving me the opportunity to share some information to help inform this discussion.'",
        "'speaker_7': 'There has been a lot of discussion about density, and I wanted to share with you that the State Department of Public Health, a tobacco program, has pulled together research which shows that children are more likely to both experiment with and then become addicted and use tobacco products when tobacco retailers are located near homes as well as schools'",
        "'speaker_7': '. And the same goes with density. You may know that tobacco retailers, tobacco companies are not allowed to advertise their products. That's a nationwide trend. I mean, law. But there still is a lot of marketing that happens in stores.'",
        "'speaker_7': 'That's the one place that marketing is still happening, and that's part of why density is a concern.'",
        "'speaker_0': 'So thank you. Thank you, Alexis. Alexis. And it looks like the last name Casey. I am the first name. Alexis. Alexis. Right, Abdullah? Already, I believe.'",
        "'speaker_2': 'Good evening, Madam Mayor and City Council.'",
        "'speaker_9': 'I just want to point out several points. We'd like to request that you guys change the guidelines as far as pertaining to the door to door. People brought up the what other cities have done and taken into account.'",
        "'speaker_9': 'Oakland, San Francisco. Why not take into account that we have offer an exemption for.'",
        "'speaker_2': 'Stores that are similar like mine, Amazon, where we have.'",
        "'speaker_9': 'A dedicated smoke shop that has a dedicated 21 and over only room that only.'",
        "'speaker_2': '21 and over are allowed to access. We ask that you.'",
        "'speaker_9': 'Meet with us retailers, you city council meet with us retailers. We tried time and time again to meet with you guys, visit with us so we can sit down and maybe come to some type of resolution. Include us in the process to try and.'",
        "'speaker_2': 'Figure out an and a resolution that's beneficial to both the city council, our students, the youth, as well as the business owners. It will devalue the business. It will cost people jobs and lives at work. It can cause it's a detriment to a lot of people's lives.'",
        "'speaker_2': 'Please take these into account.'",
        "'speaker_0': 'Thank you, Robert Todd. Then Irene.'",
        "'speaker_3': 'Longtime resident of Alameda and most recently co resident of the reservation in Lake County is Pomo Indian people of mixed origin. I have to thank you, Mayor, for your resolution encouraging the Native Americans and the American representatives very well.'",
        "'speaker_3': 'When she spoke of the broken treaties and broken contracts that they had with the government. Over the years. I see these regulations as just more permits and licenses and more more of the same. Regulating our use as a sacrament.'",
        "'speaker_3': 'Our use of our land. Our use of our time and our talents. To benefit other people who have no no feeling whatsoever for us. Salesman here. Our tremendous people. They have invested all their money in it. Can I have another minute?'",
        "'speaker_3': 'And I won't speak on the cannabis thing.'",
        "'speaker_0': 'I'm sorry. That'll be later. The cannabis will be another item. Sorry.'",
        "'speaker_3': 'I have to stick around for another one.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'The feeling would be.'",
        "'speaker_0': 'I'm sorry. We need to continue this time, Irene. Thank you.'",
        "'speaker_7': 'Hi. Good evening.'",
        "'speaker_5': 'I'm with the American Cancer Society Cancer Action Network.'",
        "'speaker_7': 'And while cigaret smoking among youth has declined, the use.'",
        "'speaker_0': 'Of e-cigarettes.'",
        "'speaker_5': 'And.'",
        "'speaker_0': 'Hookah has increased.'",
        "'speaker_7': 'Most most youth who report using tobacco say they begin with a flavored product like.'",
        "'speaker_0': 'Names like Jolly Rancher, Cotton Candy. Even the packaging is designed to look like popular candy.'",
        "'speaker_7': 'Whose names of products they have sold, and they're clearly marketed towards kids. Menthol Cigarets is another product targeted towards youth. It has a minty flavor that masks the harshness of tobacco, and it's popular among youth. 12 to 17.'",
        "'speaker_7': 'While cigaret smoking has declined, menthol, cigarets and sales have increased, especially among youth and people in youth, smokers, communities of color. The LGB population have been targeted by predatory marketing for menthol Cigarets youth become addicted. 95% of tobacco users who become addicted to before the age of 21.'",
        "'speaker_7': 'Please protect our youth. Thank you.'",
        "'speaker_0': 'Okay. Mike Cho. Mike Cho. And circle and. And then shop her. And then Theresa James. And. Yes.'",
        "'speaker_7': 'I just want to say to the city council that.'",
        "'speaker_4': 'There is a big flaw in your ordinance that you.'",
        "'speaker_7': 'Need to look at the distance and things that are in.'",
        "'speaker_4': 'There. It's going to impact.'",
        "'speaker_7': 'People who want to sell their stores safe ways.'",
        "'speaker_4': 'They don't have to worry about it. They're not going anywhere. The gas.'",
        "'speaker_7': 'Stations, the corporate owned gas stations, the chevrons and the shells that.'",
        "'speaker_4': 'Are not privately owned, they're not going anywhere.'",
        "'speaker_7': 'But people like us who spent.'",
        "'speaker_4': '24 years of our blood.'",
        "'speaker_7': 'Sweat to build up this business and our retirement, can't afford to lose it. And if anybody in this room thinks that I can sell my business without a tobacco license. We submitted addresses in a letter from a person in San Francisco to the city council, and people walked away.'",
        "'speaker_4': 'Whenever an owner lost over.'",
        "'speaker_7': '$500,000 of his investment. He just couldn't sell his store. So there is a big impact.'",
        "'speaker_0': 'Thank you. TAPPER As.'",
        "'speaker_4': 'Hi. Good evening to every console. Sorry, my English is weak and I'm new. The new new owner of a retailer and I'm close by a Walgreen and liquor store. And also. And also if if if if these things bend it or tobacco flavors or tobacco or close by bend it, then how how I pay my rent, my'",
        "'speaker_4': 'expenses. And I have four children's to and I'm new, new in this country too. And, uh, and I don't know how to, how to pay my expenses and, and, and I cannot sell my business and I don't know what to do.'",
        "'speaker_4': 'If, as other users business. Please, please think. Think about this other you are business. Thank you.'",
        "'speaker_0': 'Thank you, Teresa.'",
        "'speaker_7': 'Hello. I just want.'",
        "'speaker_5': 'To say I get what you guys are trying to do with this ordinance.'",
        "'speaker_0': 'But I fear that it's not going to be successful.'",
        "'speaker_5': 'The education starts.'",
        "'speaker_0': 'At home and in schools with preventing the.'",
        "'speaker_7': 'Children.'",
        "'speaker_0': 'From getting the.'",
        "'speaker_5': 'Cigarets.'",
        "'speaker_0': 'Not the stores because the stores are not selling them.'",
        "'speaker_7': 'To the children.'",
        "'speaker_0': 'And we're affecting as a community of small businesses, not big corporations, says Alameda. There's not a whole bunch of big stores that you're going to be affected.'",
        "'speaker_5': 'It's going to be families that are going to be.'",
        "'speaker_0': 'Out of business. I mean.'",
        "'speaker_5': 'The price of cigarets has already gone up tremendously and the age is already up to 21. And I know the main goal here is.'",
        "'speaker_0': 'Now that keeping it out of the hands of kids, this is not the answer. Please reconsider. And also.'",
        "'speaker_5': 'Please reconsider the start.'",
        "'speaker_0': 'Date. If this goes through, please reconsider it to January 2020.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, Paul Cummings. And if you want to speak on this item, please submit your slip at this time.'",
        "'speaker_4': 'Good evening. My name is Paul Cummings. I work for Alameda County Public Health Department and I'm the tobacco control program director there. And I came to remind people that tobacco continues to be the leading cause of preventable death in the United States.'",
        "'speaker_4': 'Despite everything we have done trying to protect young people, trying to keep them from starting smoking and tobacco continues to kill more people than anything else. And that's why this is being discussed. And I hope that you will do what you can to protect people so that we don't have to continue saying that tobacco continues to kill'",
        "'speaker_4': 'more people than anybody else. Thank you.'",
        "'speaker_0': 'Thank you. If you were here to speak on this item, this is your last chance. All right. That completes the public comment on this item, council members. Who wants to go first? Member Ashcroft. I will go first. Thank you to all the speakers, some of whom have already left.'",
        "'speaker_0': 'I appreciate you coming out. I have met with some of the retailers. I've met with members of our business associations. And I will tell you that the most compelling argument I have heard from the merchants is that these small businesses.'",
        "'speaker_7': 'Do.'",
        "'speaker_0': 'Tend to be owned by immigrants. There's there's a large percentage of our businesses in Alameda that sell tobacco that are owned by immigrants. And and I'm sensitive. I'm both a child and grandchild of immigrants. And one of my grandfathers was a merchant with a horse and cart.'",
        "'speaker_0': 'But but at the same time, we're balancing a very important interest. And that's the public health. And I was I was struck by the young man who said his dad, his parents have been able to send him and his brother to college on what they've made from their their small business, their convenience store.'",
        "'speaker_0': 'He's an engineer and his brother's studying to become a doctor. Well, cancer there's a tobacco, there's a known link to cancer, and there's a public health cost to that. And this is something we want our residents to be healthy.'",
        "'speaker_0': 'And, of course, as an adult, you can make a lot of choices. But the reason that tobacco sales and I'm not talking about flavored but cigaret sales were going down was because such effective education was done that people stopped smoking in the kinds of numbers they once did.'",
        "'speaker_0': 'And so tobacco manufacturers had to find another audience. And that was the young people. And and we're seeing this there's a lot of pressure on kids these days. I talked to high school students a lot. And and, you know, they turn to things like vaping to to unwind and relax.'",
        "'speaker_0': 'And yet for some of them and and I will say that even one of the business owners I met with told me I wish I'd never started smoking when I was 16 years old, because today as an adult, I'm unable to quit.'",
        "'speaker_0': 'But I what I told the business owners when I met with you is that, first of all, we don't have anything like a cigarets cheaper where 100% of your inventory is tobacco. So it's a percentage. I get 30%.'",
        "'speaker_0': 'Mr. Second provided us with receipts. I get that. What I've said before is that what you need to do? What any small business owner needs to do, even large business owners. You can talk about GM. You need to be nimble.'",
        "'speaker_0': 'You need to be flexible. Surely you saw over the years that your CIGARET sales were going down, so you were seeing less of your revenue coming in from that source. And so what I'm asking is, of course, we want small businesses, we want the corner convenience store put in other inventory, the 7-Eleven, to send you your inventory'",
        "'speaker_0': '. If I'm understanding correctly, they need to do a better job for you and not saddle you with flavored tobacco in a city that bans it. And Alameda is not the first to do that. So they should have some experience.'",
        "'speaker_0': 'I know the one compromise position that was put to me when I met with the Business Association representatives last week was to extend the start date, passed July 2019. But we're here we are at the end of November of 2018.'",
        "'speaker_0': 'I mean, that's a good seven, eight months to start selling down that inventory, not ordering more. I, I mean, I will, of course, listen to what my colleagues have to say. But I think that I think it's time to do this.'",
        "'speaker_0': 'You know, it's never going to be something that is just clear cut and easy. But on balance, when I look at protecting the health of our residents and especially our young people, I just think that that is going to take take precedence every time.'",
        "'speaker_0': 'Thank you. Thank you. I have a question of staff. Do we have the data in regards to how many sales to use our city retailers make? Do we have any data in regards to retailers here in town? Making sales to youth.'",
        "'speaker_9': 'Madam Mayor. Members of the council, Michael Walsh from the city attorney's office. We do not have a a totally accurate number of tobacco retailers in town. The the state who does issue those license will not provide that because it's considered confidential information, apparently.'",
        "'speaker_9': 'And so we don't have the information. Anecdotally, from the information that's been gathered both by the retailers as well as by the tobacco folks from the county. We feel that there's somewhere between 50 and 55 retailers in the community.'",
        "'speaker_9': 'We feel that number is. Is fairly accurate within, you know, three or four either way.'",
        "'speaker_0': 'That was the my question. My question was, how many of these retailers are selling to youth that we know of? We have any sales?'",
        "'speaker_9': 'Yes. We requested the police department to provide that information. And what we have is data from 2013, 2012, in which case there was 47 stores visited in 2013, of which two stores had had violations selling to minors. In 2012, there was 45 stores visited and there were nine stores that sold to minors.'",
        "'speaker_9': 'The police chief advises that the Special Investigations Unit, which has responsibility for this that took place in 2012 and 2013, was temporarily shut down due to staffing shortages. But the department is hoping to get that operation up toward the end of March of 2019.'",
        "'speaker_0': 'So in the lot. So this is 2018. Did you have the most recent data you have as from what year?'",
        "'speaker_9': '2013 is the last time that there was an organized what I'll call sting or decoy operation by the Alameda Police Department.'",
        "'speaker_0': 'What about the homemade account? The county the county doesn't do any inspections.'",
        "'speaker_9': 'The county relied on the same information, provided me the same information as the police department did.'",
        "'speaker_0': 'So we don't have any data for over five years of whether or not our retailers are selling to use.'",
        "'speaker_9': 'That is correct.'",
        "'speaker_0': 'I see people smiling in the audience. Honestly, I'm not sure that that's a good response because we're being asked to actually have a financial impact on our businesses. So, okay, so I've already asked if I do have someone in the audience that may be able to provide additional information.'",
        "'speaker_0': 'I'm sorry, we in an order from the county point of order, so okay. So I did ask staff in advance and I did ask in regards to the county, not just our city. So this is a problem for my opinion.'",
        "'speaker_0': 'We should have data that is more recent then especially if the peers of the county has data. So it would be nice to have that information provided. So I want to confirm with our city manager that, correct. We don't have any data that our staff is able to provide.'",
        "'speaker_0': 'That's not more than five years old.'",
        "'speaker_2': 'Hmm. Mayor, members of council. I don't have any updated information. I would defer to this former dam because I've been absent from the city for a couple of weeks now.'",
        "'speaker_7': 'We don't.'",
        "'speaker_0': 'Have anything. Okay. Thank you very much. Okay. Okay. And maybe staff can help me with this one. Online sales are sales permitted online to the city of Alameda residents?'",
        "'speaker_9': 'The answer is yes.'",
        "'speaker_0': 'Thank you. All right. Any other council members who wants to go next? Oh, member matter, S.E..'",
        "'speaker_7': 'Well.'",
        "'speaker_9': 'I'd like to move the second reading as written, because what we do know is that the leading cause of preventable death in the United States is tobacco. What we do know is FDA has stepped up its warning letters on tobacco related industries, particularly those targeting children.'",
        "'speaker_9': 'What we do know is we don't have any control over online sales, but we do have control over sales in the city of Alameda.'",
        "'speaker_0': 'A vice mayor.'",
        "'speaker_5': 'I'm going to second Councilmember Morales's motion, but with a couple of comments. You know, we heard from a lot of the retailers that they should be able to sell their license to the next person. And then we also heard from one retailer who's a new retailer who said, I have a new business.'",
        "'speaker_5': 'What am I supposed to do? And in many ways, the solution of allowing the licenses to continue and to turn over like that defeats the purpose of the ordinance itself. And frankly, in many ways, my concern is, is that you're just kicking the can down the road.'",
        "'speaker_5': 'You're saying, okay, it's going to be somebody else's problem, it's going to be the new business owners problem, and then they're not going to be able to sell it. You know, in terms of the the ratios and everything else, by comparison, we're looking at four cannabis dispensaries throughout Alameda.'",
        "'speaker_5': 'Compare that with the 50 plus tobacco licenses that are going to be issued. I mean, that's a substantial difference. I also think, you know, if we want to talk about real life, real life is when I was in high school driving my grandfather to chemo.'",
        "'speaker_5': 'That was how I got my hours, my permit hours to qualify for my license. My grandfather was a smoker. He got free cigarets when he was in the U.S. Navy. He got addicted. He ended up quitting when I was five years old because I asked him to, because it was causing me to cough when I was little'",
        "'speaker_5': 'and he gave it up cold turkey, but he still died of lung cancer. And it was a very painful death to watch. And that's something I wouldn't wish on anybody. And the reality is, is that we know tobacco is extremely addictive.'",
        "'speaker_5': 'We know that it kills and we know a lot of things about it now that we didn't know back then. And while I'm sympathetic to the plight of small businesses, I really don't think that the solution is to pass the the pass it on to the next small business owner.'",
        "'speaker_5': 'I also think that, you know, there is something to adapting and finding new products and things to sell. Part of having the convenience store, the local convenience stores to get items like groceries, to be able to run to the corner store, to get milk, to get eggs, to get things like that, instead of having to get in'",
        "'speaker_5': 'to get into a car or go across town to get different items, it's for those types of convenience items, and I think that there's still a market for that. But when we start looking at the map and we see how many convenience stores and liquor stores are located right next to each other.'",
        "'speaker_5': 'My question is, you know, if you can adapt and find a way to to continue your business to sell to the, you know, the local community, that that's just a bigger problem of of what your business and marketing plan.'",
        "'speaker_5': 'And I do have a concern about having these located near schools. I think, again, what we're trying to do is we're trying to prevent these these sorts of sales happening so close to our schools. So I'm ready to support this as written tonight.'",
        "'speaker_0': 'And wordy.'",
        "'speaker_8': 'Thank you, Madam Chair. I'll be brief because I think my colleagues stated a lot of the things I wanted to say, you know, just to kind of look at some of the the numbers. I mean, a study was shared with us by this group called The Truth Initiative, and they asked teenagers or youth where they got their'",
        "'speaker_8': 'jewels in the last 30 days. And 74% of them said from a physical retail location, 52 from a social source and 6% on the Internet. So, I mean, that to me is empirical data. I'm sure that there are, you know, merchants on the up and up that aren't selling, but, you know, those numbers are quite high.'",
        "'speaker_8': 'So these youth are getting these products basically by going out and buying them. So no matter what people say that they're doing, you know, I remember we went through this discussion with with the landlords and tenants. We always had good landlords come up, but, you know, we also had bad landlords.'",
        "'speaker_8': 'So we probably have good store owners and they're probably all here today. But that doesn't mean we don't have bad ones. So we still have to be able to prevent our youth from from getting these products so easily.'",
        "'speaker_8': 'I mean, I'll just tack onto Melia Story. I mean, there's a lot of talk about retirement. My both both my grandparents or grandfather smoked and my my mother's father. I never got to meet because he died of cancer and a stroke before I was born and he never got to have a retirement.'",
        "'speaker_8': 'So for all the people that are worried about their retirement, I mean, there's people that are probably sitting in the audience today that have smoked, that aren't going to be able to enjoy retirement because they they've been purchasing a product.'",
        "'speaker_8': 'And I think it's the only product except maybe guns, that the sole outcome of that product is to kill somebody. You know, it's to poison somebody. And, you know, my other grandfather also smoked most of his adult life and died of a heart disease.'",
        "'speaker_8': 'You know, four months after he retired, 64 years old, he didn't get a chance to enjoy his retirement either. I'm sure that some of these young women that that talk today whose brothers, you know, are now hooked, addicted, because a product has five times more nicotine in it in a jewel than than a cigaret.'",
        "'speaker_8': 'You know, they they may have children, but they might not even be alive to be able to pay for their children's education, because in 20 years, they may end up having having cancer. So they will not get to enjoy a lot of the things that people came up here and told me that they want to have the'",
        "'speaker_8': 'right to enjoy and the only reason they won't be. Able to enjoy that is because they use these products that were sold to them when they were youth. So I'm ready to move forward this as well. And I thank everyone for their time and for listening.'",
        "'speaker_0': 'And I appreciate everyone else, everyone that's come out and focused on this item. I appreciate my colleagues comments. I, too, am a cancer survivor. I too grew up with a smoker at home who did stop at some point.'",
        "'speaker_0': 'I also recognize that the data I saw showed that 75% of the youth are reporting a purchasing from other social places, not from retailers. And the data I heard in regards to our city was that it was like 95% of our stores have not sold to youth.'",
        "'speaker_0': 'That is actually a very low percentage in the last five years. And as a state, we have in fact increased the age recently from 18 to 21. And so that many of the surveys are actually based on a when 18 was the limit, not the age limit, not the 21.'",
        "'speaker_0': 'And I do support the efforts by our state. I support the efforts by our federal government, I think as well-intended as this issue is. I also support banning the flavors other than menthol. I actually don't have a problem with cigarets that have menthol in them for an adult that someone is over 21, 21 or over that wants'",
        "'speaker_0': 'to go to their local store and purchase a menthol cigaret. I'm not going to hold that against them. And but I grew up in a world where we had the draft when I was a kid, 18 years old, and you get drafted.'",
        "'speaker_0': 'We do have an army currently, a military that's, you know, 18 years old and over and 18 years old. Actually, in our society, you can make a lot of decisions, I think, by the time you're 21. We I can respect their decision.'",
        "'speaker_0': 'I also want to make sure people know that I strongly oppose smoking. But at the same time, I do support adults being able to make decisions. And I am concerned in regards to what are we going to ban next?'",
        "'speaker_0': 'And I so I expect anyone that's under 21. Now we as a state have said, no, we don't want you smoking you over 21. I hope you make good decisions. And I and I do empathize with our businesses, many of whom that we've seen this evening are, in fact, recent immigrants to our country.'",
        "'speaker_0': 'And if people are going to turn around and then purchase. And we do have a lot of youth here. You should not be. If you're from high school, there's no way that you should be allowed to smoke in other states and in fact, take an actions to not to not allow you to possess tobacco.'",
        "'speaker_0': 'And that's, I think, actually something that our state could consider rather than making it. Making it up. Making it so that adults can't go to their local store and purchase a legal product. That being said, all those we have a motion and a second.'",
        "'speaker_0': 'I believe all this in favor. I am opposed and I oppose. Motion carries 4 to 1. All of you that are in the audience, we will now take a short recess. And if you brought any thing that is now trash, please take it with you.'",
        "'speaker_0': 'Thank you. Yeah. And that we just completed five day and now we're going to do our regular agenda items six a go ahead.'"
    ]
}