{
    "Adoption of Resolutions Appointing Donna Hom and John Nolan as Members of the Civil Service Board, Reappointing Kathleen Kearney and Joyce McConeghey as Members of the Library Board, and Appointing Moustafa Aly, Sarah Lewis and Johanna Paillet-Growl as Members of the Social Service Human Relations Board.": [
        "'speaker_0': 'Yeah. Okay. All right, then. Okay. If I'm going to call the City Council meeting of Tuesday, June 18, 2019 to order. We have just come out of closed session, and I will ask our city clerk, Laura Weisinger, to please report out.'",
        "'speaker_1': 'Okay. Regarding conference with property negotiators, the council received information from staff and gave direction. No vote was taken regarding existing litigations on the boat work cases. The council received information and gave direction to staff with no vote taken.'",
        "'speaker_1': 'Regarding the amicus brief and the city has been asked to sign on to an amicus brief to be filed in three cases, as previously mentioned, in which the US Supreme Court will consider how Title Seven's ban on workplace sex discrimination protects LGBTQ people from discrimination on the basis of sexual orientation or gender identity.'",
        "'speaker_1': 'The EEOC and many federal courts have recognized that anti LGBTQ discrimination is a form of sex discrimination. The Supreme Court will now decide whether to revoke or affirm these nondiscrimination protections. The Council has voted to authorize the city attorney to sign in favor of recognizing and affirming that anti LGBTQ discrimination is a form of sex discrimination.'",
        "'speaker_1': 'The Council voted and by a roll call vote by five eyes to approve proceeding with that. Regarding existing litigation in the Guzman case, the Council received information and gave direction to staff. No vote was taken and regarding the liability claim, council received information and gave direction with no vote taken.'"
    ],
    "Proclamation Declaring June 2019 as Elder Abuse Awareness Month and June 15, 2019 as World Elder Abuse Awareness Day. (City Manager 2110)": [
        "'speaker_0': 'So we do have an a proclamation because this is Elder Abuse Awareness Month. And hello, I think I have some folks here from District Attorney's Office and.'",
        "'speaker_4': 'Protective Services.'",
        "'speaker_0': 'And Adult Protective Services. So if you would like to come up to the podium, I'm going to read the proclamation and then you can make some brief remarks if you would like. But once you come out of it, go ahead and tell us your names.'",
        "'speaker_4': 'My name is Dina, and I'm an elder abuse specialist with the district attorney's office.'",
        "'speaker_8': 'My name is Vincent Gordon, and I'm a supervisor with Alameda County Adult Protective Services.'",
        "'speaker_0': 'Thank you. Thank you for being here and for the work that you do. So this is our proclamation. Whereas the U.S. Census Bureau estimates that the largest growing age group in the country are people 65 and over, and that as of July 2018, more than 11,000 Alameda residents are 65 or over.'",
        "'speaker_0': 'And. Whereas, elder abuse occurs among men and women of diverse educational, ethnic and socioeconomic backgrounds who have been victimized by strangers and or by persons they know who may occupy a position of trust, including family members, friends, neighbors, and others with whom the elder interacts, and that elder abuse can be physical, emotional and or financial.'",
        "'speaker_0': 'And. WHEREAS, the Alameda County District Attorney's Office, through its elder protection unit and Victim Witness Division, provides a network of services to elders in danger of becoming or who have become victims of abuse. These services include community workshops to promote crime prevention awareness, helping elders access services, working with the Alameda Police Department and other professionals, and prosecuting'",
        "'speaker_0': 'cases of elder abuse and neglect. And. WHEREAS, The Mastic Senior Center provides a comprehensive array of services as well as recreational and social programs to meet the needs of our elder population, enhance their quality of life, and help them remain active, healthy, independent and safe.'",
        "'speaker_0': 'And. Whereas, The City of Alameda recognizes that the awareness of elder abuse and neglect, including reporting instances of suspected elder abuse and neglect, helps keep our elders and our community safe. Now, therefore, be it resolved that I, Marilyn, as the Ashcraft mayor of the City of Alameda, hereby proclaim June 2019 as Elder Abuse Awareness Month and June'",
        "'speaker_0': '15, 2019 as World Elder Abuse Awareness Day in the City of Alameda, and encourage all residents to recognize elders as valuable members of our community who have the right to live safely and securely in. Our city. And with that, we thank you for all that you do.'",
        "'speaker_0': 'And why don't you tell us a few words about that?'",
        "'speaker_4': 'Thank you very much. Your Honor, council members, I've received humbly and happily received the proclamation from Alameda City Council. I think about four years now, and I always vie to be the one to come here because I am from Alameda and I'm very proud of our city.'",
        "'speaker_4': 'I read on our Facebook, your Facebook, that there are now changing tables in the men's bathrooms and.'",
        "'speaker_0': 'I smell yours.'",
        "'speaker_4': 'I almost bust in there. I wanted to see one. So thank you for that. And my husband, who is a grandfather and who takes kids to the movies and out and about, thanks you as well. So I would like to say that The New York Times has designated financial elder abuse as the crime of the 21st century'",
        "'speaker_4': ', and it is the majority of the cases we work on. They aren't as splashy and exciting as the unfortunately the murders and rapes and assaults that we also have worked with elder victims with. But the financial fraud is devastating and it is really impacts elders and the future and they're their last years to go out with this'",
        "'speaker_4': 'pain is really a traumatic and horrible thing. And I'd like to thank our partners who will speak at a moment. Adult Protective Services, Alameda Police Department, who I couldn't be I couldn't be prouder of, and our fire department as well, who also are at our beck and call when we have an elder who has fallen or needs'",
        "'speaker_4': 'help. So thank you very much.'",
        "'speaker_0': 'Thank you for your kind words. And may we hear from you. And you might want to raise that microphone up.'",
        "'speaker_8': 'Hello? Yeah. So my name is Vincent Gordon from Alameda County Adult Protective Services. It's my first time here. Thank you for having me. And I want to thank you, Mayor Ashcroft, city council members and residents of Alameda for this proclamation in honor of June, which, as you point out, is Elder Abuse Awareness Month and June 15th, which'",
        "'speaker_8': 'was the World Elder Abuse Awareness Day. Adult Protective Services. And the district attorney's office are honored to be here to bring attention to elder and dependent adult abuse prevention and to be recognized today by your council. Throughout the year, APS actively combats elder and dependent adult abuse by providing services to our at risk clients and through our'",
        "'speaker_8': 'efforts at the county and state level to identify additional resources to aid in this fight. The month of June is particularly important because we highlight our efforts and bring attention to this fight by organizing events to bring awareness on a daily basis.'",
        "'speaker_8': 'This evening, I'd like to share just a few of those events with you. We've launched an AC transit campaign and shopping center ad campaign, so keep your eye out. When you're riding AC Transit and when shopping in the community, you'll see the big billboards that say trust but verify is the slogan that we're using.'",
        "'speaker_8': 'We've also expanded our Baat advertising campaign this year throughout our with our partnership with AC Transit and Contra Costa, San Francisco and San Mateo Counties. We are airing our APS commercials throughout the month and we'll have a social media presence working with partner agencies to tweet and post about elder abuse awareness.'",
        "'speaker_8': 'We have swag bags to giveaway throughout the county with the goal of working with our partners to become ambassadors and raising awareness. And lastly, we will continue to receive proclamations from many of the individual city councils across the county and from the Board of Supervisors in recognition of this important month.'",
        "'speaker_8': 'As you well know, support of our city governments is paramount to elder and dependent adult abuse. And we greatly appreciate your support not only in June, but throughout the year. So thank you very much for having us.'",
        "'speaker_0': 'Thank you. And then we can present the proclamation.'",
        "'speaker_5': 'Well. See you, house.'",
        "'speaker_0': 'Oh, yeah. There is a.'",
        "'speaker_4': 'Protection.'",
        "'speaker_0': 'Oh, thank you, Your Honor. Between the two of you. And then you're going to have to get a second certificate, actually.'",
        "'speaker_4': 'Yeah. Are you done? Thank you.'",
        "'speaker_0': 'It's hard work.'",
        "'speaker_3': 'Okay. Yeah.'",
        "'speaker_4': 'Thank you. Council members. You.'",
        "'speaker_5': 'But. Okay.'",
        "'speaker_4': 'We drop a leaf, which means.'",
        "'speaker_0': 'You know, the issue of adult financial abuse hit home, not literally home, but a close friend of mine. And, oh, this is we're getting Julia back on the line. Her father is 90 years old, but very, you know, lives on his own.'",
        "'speaker_0': 'And he's very alert, except that he heard from someone, I think, either by phone or email, telling him that his grandson was in danger and in trouble and he needed $40,000. And this gentleman sent $40,000 in cash to envelopes.'",
        "'speaker_0': 'And then he was told not to say anything because that could further endanger his grandson. And, of course, eventually the family found out the grandson feels terrible and guilty, not that he had anything to do with it, but it's just there's so many different vulnerabilities that go into being a seniors.'",
        "'speaker_0': 'So for all of us listening, you know, if you see or perceive something suspicious or or look out for those vulnerable, lonely seniors, it can make a difference. Anyway, thank you so much for all that you do. And now we're going to oral communications.'",
        "'speaker_0': 'This is a time when a limited number of speakers can address the Council on Items, not on the agenda. We take 15 minutes for oral communications now and then any that weren't heard from will be heard at the end of our meeting.'",
        "'speaker_0': 'Do we have speaker slips?'",
        "'speaker_1': 'We have no.'",
        "'speaker_4': 'Speak.'",
        "'speaker_0': 'We have no speakers that. So before we go on to the consent calendar, I'm going to call on the voice vice mayor to make a comment or two.'"
    ],
    "Adoption of Resolution Authorizing the City Manager to Apply for and Accept up to Three Hundred Ten Thousand Dollars ($310,000) in Senate Bill (SB) 2 Planning Grants Program Funds for Work on General Plan Updates, Zoning Ordinance Amendments, and Environmental Review Consistent with State Laws to Streamline Housing Production. (Planning, Building & Transportation 481005)": [
        "'speaker_1': 'I adopted a resolution authorizing the city manager to apply for and accept up to $310,000 in Senate Bill two Planning Grants Program Funds for work on general plan updates, zoning ordinance amendments and environmental review consistent with state law to streamline housing production.'",
        "'speaker_0': 'Councilmember Desai, you pull this up. Go right ahead.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_0': 'Did you want a report from staff?'",
        "'speaker_6': 'Oh, I'll just kind of introduce the subject and then get to my questions. This item we are seeking state funds to help pay for, among other things, updating what's called the general plan, which is a document in terms of how we plan our neighborhoods, in terms of zoning, allowable uses, and also how we incorporate new state laws'",
        "'speaker_6': 'with regard to development, etc.. So we're seeking to get state funding through the SB two program to help pay for the general plan update process, among other things, in looking at it. So the question that I have is in looking at the planning document behind SB two, it says that in order to meet it all applicants, in'",
        "'speaker_6': 'order to get the money, the $310,000, so all applicants must meet the following threshold requirements. And of of the threshold requirements, there was an item called number three, which is quote unquote, nexus to accelerating housing production. So I'm a little concerned about that.'",
        "'speaker_6': 'I want to know if staff can respond. In what ways do we anticipate following through on that requirement?'",
        "'speaker_3': 'Good evening, Madam Mayor and members of the City Council. My name is Allen Tai, Planning Services Manager. I wrote the staff report for this item. I'd like to actually call your attention to the paragraph right below it and the SP2 application.'",
        "'speaker_3': 'Literally the state is handing out money to cities on to to make to to make things easier for housing, things being applications for approval processes, timing costs and so forth. Specifically, the application process provides priority policy areas. It calls out five, sort of six, six areas.'",
        "'speaker_3': 'And the application requirements say if the city is applying under those priority policy areas, you do not have to make this nexus argument because you're automatically considered to be accelerating housing production. And so the work program that we've laid out in the South Report is just what the what the council direction was provided back in April are'",
        "'speaker_3': 'consistent with those priority policy areas, working on edu's, developing objective design review standards, all of the above. We do not have to justify the the city will accept as eligible activities under the grant.'",
        "'speaker_6': 'So we already have kind of an accelerated production process. Yes. In place? Yes. So we could still go after this money without having to re justify that. So if one if one is concerned, for example, about accessory dwelling units in neighborhoods or in Alameda, then we have to deal with that issue as it arises.'",
        "'speaker_6': 'It's kind of it would be independent of this going after the $310,000.'",
        "'speaker_3': 'Correct. Correct. The grant is just really to pay for the city time to perform the work, the actual work and the decisions to that that will affect the regulations will go through a public process before the planning board, before the city council.'",
        "'speaker_6': 'Okay. Well, in that case, then I'll move approval of the staff report.'",
        "'speaker_0': 'And I'm happy to have a second, but I also like to discuss just a little bit. So Councilmember Vela, who's on the line and I sit on the statewide League of California Cities Policy Committee on Housing, Community and Economic Development, and we have been steeped in the statewide and Bay Area housing crisis for well, I've been on'",
        "'speaker_0': 'the committee is my second year and she's been all on all this year. And so this is money appropriated through Senate Bill two, which was passed actually in 2017 to allow.'",
        "'speaker_4': 'For.'",
        "'speaker_0': 'More housing production in California. And I was just in Sacramento last week for the Policy Committee meeting, and we were all elated that the governor has put more money in the budget to address homelessness, to address more affordable housing.'",
        "'speaker_0': 'So I see this as Alameda doing its part along with all the other cities in the Bay Area, most of them to to address the housing crisis. And I think this is a very good use of of the funds in as far as adus accessory dwelling units are concerned.'",
        "'speaker_0': 'You can look for some legislation to come out of Sacramento streamlining production of accessory dwelling units, but that's not before us tonight. So we've had a motion to approve this, to approve adopting this resolution, to have a second, second vice mayor seconds and then any further discussion, discussion.'",
        "'speaker_2': 'So just since there were some comments that might be construed as council direction, I just want to say, as I as a father, my my family is in town because my my oldest son graduated from college today. And we are starting to really think about the cost of housing as it affects the ability for our next generation'",
        "'speaker_2': 'to remain close to us and whatnot. So not just for my family, but for all the other families. I just want to suggest that we know the one thing we can do to help long term, keep families together, keep communities together in the Bay Area and whatever else is to actually start producing the housing that our region'",
        "'speaker_2': 'needs. And so I would like to just register that I'm strongly supportive of this and strongly support this moving forward with both looking to meet those those goals as well as our climate goals and others. Thank you.'",
        "'speaker_0': 'Thank you. Is there any further discussion before your vote, our roll call vote hearing, then roll call vote, please.'",
        "'speaker_1': 'Councilmember Daza?'",
        "'speaker_6': 'Yes.'",
        "'speaker_1': 'Next flight. I hope.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Vela.'",
        "'speaker_5': 'By.'",
        "'speaker_1': 'Mayor as the Ashcraft.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'So that passes by.'",
        "'speaker_0': 'Passes unanimously. Thank you. All right. So then we are moving on to item six, a.'",
        "'speaker_1': 'Adoption of resolutions appointing Donovan and John John Nolan as members of the Civil Service Board, reappointing Kathleen Kearney and Joyce McConaughey as members of the Library Board, appointing Mustafa Ali, Sarah Lewis and Johanna Peligro as members of the Social Service, Human Relations Board of Approval.'",
        "'speaker_0': 'Second look, we've had a motion in a second. May I have a roll call vote?'",
        "'speaker_1': 'Council members?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Odie.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Bella.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Mayor, as the. Ashcroft Yes. Okay. So that carries my fine.'",
        "'speaker_0': 'Thank you. And I'm going to come down and hand you your certificates. And the city clerk has something for you to to sign. I'm not sure how many of my nominees are in the audience, but I just want our both most.'",
        "'speaker_0': 'Great. Come on up, nominees. If you heard your name called. I see, I see. I miss home and I see. Yeah. Mustafa Ali. And while they're coming up, I just want to say that I have as of today, interviewed 34 very qualified candidates for various positions.'",
        "'speaker_0': 'And it's not that this is required of them, but I just want you to know that among these nominees, we have people who are trilingual. They speak three languages. They've lived in other countries. Some of them have come from other countries.'",
        "'speaker_0': 'But they all what they have in common is that they're willing to volunteer their time and their talents and their considerable talents to our city. And I'm I'm just so pleased to meet you all, because one of my goals in appointing to boards and commissions is to have our boards and commissions be as diverse as our city'",
        "'speaker_0': 'is, and that's ethnic and gender and sexual orientation and age and where you live. And we're getting all of that in our boards and commissions. So it was a pleasure to interview all of you and thank you for your service or continued service.'",
        "'speaker_0': 'In the case of those I'm reappointing. So with that, I'll turn it over the court.'",
        "'speaker_1': 'I'll have you all take the oath in one fell swoop. So if you'll.'",
        "'speaker_5': 'All right.'",
        "'speaker_1': 'Do you solemnly swear to uphold the Constitution of the United States and the Constitution of the State of California, and that you'll well and faithfully discharge the duties upon which you're about to enter?'",
        "'speaker_4': 'Let's do all right. You're all officially.'",
        "'speaker_9': 'I want to. Okay.'",
        "'speaker_0': 'We have no guarantees and. No. Kathleen's out of town.'",
        "'speaker_4': 'She knew she was coming, but. She was arrested for perjury. You. You. So. So. All right, everyone, welcome our new board.'",
        "'speaker_0': 'All right. The next item.'"
    ],
    "Recommendation to Authorize the City Manager to Execute a Memorandum of Understanding with the Alameda Unified School District Concerning a New City of Alameda Aquatic Facility. (Recreation 280)": [
        "'speaker_1': 'Is the recommendation to authorize the city manager to execute a memorandum of understanding with the Army Unified School District concerning a new city of Alameda Aquatic Facility.'",
        "'speaker_4': 'Good evening, Mayor Council Amy Wooldridge, Interim Assistant City Manager and Recreation and Parks Director. So in February, a quick background. In February 2019, the County Health Department, an environmental account sorry, Alameda County Department of Environmental Health informed the school district and then the city subsequently that Amador Swim Center would be closed for a public health and safety'",
        "'speaker_4': 'reasons. As of May 31st, 2019, we've been working well within with an ad hoc committee. There's been a lot of collaborative work up to this point. We have received written confirmation from the county that they will allow the district and city to keep the pool open after short term repairs are made.'",
        "'speaker_4': 'Those repairs will be made by the school district this summer with the hope to reopen it for the school year. And the county also requires certain time, timelines and milestones be provided to them by June 30th. And this is all in the form of this memo.'",
        "'speaker_4': 'You before you tonight, regardless of what happens, the county is also informed us that L.A. Swim Center will close by May 2022. So we have a few years to work through and toward the goal of a city aquatics center to try and identify funding and work through construction design and things like that.'",
        "'speaker_4': 'But regardless of how that process goes and which swim center would be closed by May 2022. What you have in front of you in terms of the memorandum of understanding. And the main point to that memo, you I want to point out that really this m02 is serving to provide deal points for that have been that for'",
        "'speaker_4': 'an agreed upon new city aquatic facility. It doesn't include specific points on property agreement that that will come to you in a future meeting. And there's current negotiations happening, but both with the Board of Education and the City Council, and the intent is to have a final property agreement no later than December 2019.'",
        "'speaker_4': 'Some of the primary issues in the MRU, one is the schedule and so it outlines. I'm not going to go into it in detail now, but it does outline specific milestones and deadlines for those milestones and all of those really we don't have to check in with the county on each of those milestones.'",
        "'speaker_4': 'It's really intended to keep us being the city and the school district on track to get a new aquatic facility started by May 2022. In terms of funding and management, the goal of this, the responsibility would be for the city to manage all aspects of design and construction of a new aquatic center with a host serving as'",
        "'speaker_4': 'a core stakeholder, mainly to make sure that the facility complies with the regulations they need for it to be a competitive school facility. The city will be responsible to fund the design and construction, with AOC really providing political or letters of support or any other type of support that they could provide toward that funding effort.'",
        "'speaker_4': 'And funding could include an infrastructure bond. It could be a capital campaign or a combination of all of the above. The city's also, per this, MRU, responsible to demolish the existing facility as part of the construction and rebuild.'",
        "'speaker_4': 'If if we in the long run determine that moving some tennis of the adjacent tennis courts is required, then we would be required to pay for demolition of those and move those facilities. So there's no loss of us of athletic facilities at the Alameda High School.'",
        "'speaker_4': 'Lastly, not quite. Lastly, but a city will manage all operations and maintenance as well for the new aquatic facility. And then if it's on a U.S. property such as at the existing site at Almeda High School, the Alameda High School Aquatic Teams and any future P.E. classes would have priority scheduling and would have guaranteed use hours equivalent'",
        "'speaker_4': 'to 2019 use. So we would basically work to make sure they don't get at least less than what they're currently receiving. In addition, the city would waive fees for all Alameda High School aquatic teams for their practices, games and one weekend tournament per team per season.'",
        "'speaker_4': 'That's standard of what they're hosting now. They host most of them. Those teams host a second tournament per season that is generally paid for the fee. The fees are paid for by the league, so we don't want to lose funds and recoup as much as we can.'",
        "'speaker_4': 'So any. It's written that any things sponsored by the league or by or tournaments that are intended as fundraising that would still pay the city fees per our annual fee schedule. In addition, the city would retain rights to all concessions.'",
        "'speaker_4': 'So this is before you tonight. It's going to the same M.O. you was going before the Board of Education next Tuesday on June 25th, again with the goal to then turn it around quickly to Alameda County by the end of the month on June 30th.'",
        "'speaker_4': 'So with that, I'm open to any questions.'",
        "'speaker_0': 'Council Are there any questions about the staff? Court And do we have any speakers on this item? No speakers. Any questions? Comments. Councilmember Vela.'",
        "'speaker_4': 'Trump.'",
        "'speaker_0': 'Are we do. Do we know if we have? She didn't.'",
        "'speaker_1': 'Say she was.'",
        "'speaker_4': 'Dropped again.'",
        "'speaker_0': 'Okay, um.'",
        "'speaker_3': 'I just have a quick. Yeah. Okay. So on page six, that should be 8 to 10, right? 14 city.'",
        "'speaker_0': 'And you're looking at page six of the menu, correct?'",
        "'speaker_3': 'Uh, actually, there might be a small table on I.'",
        "'speaker_5': 'Right. Thank you.'",
        "'speaker_4': 'Sorry. You know, it's a it's 8.9. And then to the bottom of page five is 8.8 and then the top of page six is 8.9.'",
        "'speaker_3': 'And then it says like 8.7 or and city council approval. Is that a separate. Separate paragraph.'",
        "'speaker_4': 'I was kind of. Oh, I see.'",
        "'speaker_0': 'So it doesn't match the paragraph.'",
        "'speaker_4': 'Right. I see. Yeah, you're right. That should be a next point. Ten. Okay. So that was a track change. Yeah. Okay, we'll make the adjustment.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'I think that's minor, right?'",
        "'speaker_0': 'Yeah. Yeah. Yeah, I know. That's. There's still qualifiers is. Yeah. That was not a major modification. Councilmember Val, I was asking if you had any questions or comments on this proposed MRU.'",
        "'speaker_5': 'I do not.'",
        "'speaker_0': 'Okay with that. Do I have a motion to authorize city manager to execute a memorandum of understanding with the Armory Unified School District concerning a new city of Alameda Aquatic Facility? Council Member DE So.'",
        "'speaker_6': 'I'd like to make that motion, but with a quick acknowledgment and thanks to Vice Mayor John Knox, white mayor as he Ashcraft and board school board members. Daley and I believe Gray Harris in working with our staff and their staff in getting rapidly to this to this where we are today.'",
        "'speaker_6': 'A lot of things had happened over the past four weeks, and there's a lot more work to do. But I think kudos ought to be made at the number of hurdles and discussions that are taking place. I just want to say thank you very much for you guys.'",
        "'speaker_0': 'Thank you. And I would also like to really acknowledge and thank let's see, recreation parks director, acting assistant city manager Amy Wooldridge for her very skillful leadership throughout this. And Vice Mayor Knox White did a nice job of bringing the kind of cool user community from outside the schools together behind this.'",
        "'speaker_0': 'So. And did you make the motion? Okay, so we have a motion. Do we have a second? Second? I have a motion by Councilman Addison, second by the vice mayor and then a roll call vote.'",
        "'speaker_1': 'Council member state said yes. Not quite. Yes, yes. Bella. Yes. Mayor, as he Ashcraft.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'So that carries by unanimous.'",
        "'speaker_0': 'Okay. Yes. Thanks, Mayor.'",
        "'speaker_2': 'Give my thanks to the swim community. I think they really rallied together to work as a part of the process and help this move helped move this forward. And, you know, I'm not going to try to no poor plans tonight, but also school district staff I think can stay out of the everybody is really worked hard and'",
        "'speaker_2': 'fast on this issue. So thank you.'",
        "'speaker_0': 'Thank you, everyone. Thanks so much. Okay. This is the part where we do the fancy footwork and we move from item six be to, let's see, I don't need to adjourn anything right now.'",
        "'speaker_1': 'Just recess. Okay.'",
        "'speaker_0': 'Oh, recess. That's right. Just like it says. So at this time, I'm calling a recess. Don't go anywhere. And we will now hear the joint city council successor agency to the Community Improvement Commission meeting, which is over on page, bottom of page five of your agenda and top of page six.'",
        "'speaker_0': 'So we need to do a roll call, correct? Oh, please, you ask.'",
        "'speaker_2': 'I just want to let our new board members and committee members know that there's no rudeness. So you don't have to sit through this whole meeting if you choose to leave. I saw quite a few of them turn back and I just want to make sure they know that.'",
        "'speaker_0': 'You can stay as long. Well, to all of the public, this is not mandatory. But yes, you can stay as long as you like. Okay. Thank you for noting that. So then in a moment, we'll we'll take a roll call, I believe.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Council member commission members decide.'"
    ],
    "Adoption of Resolutions Approving and Adopting the City of Alameda Operating and Capital Budget for Fiscal Years  2019-20 and 2020-21 and Approving and Adopting the Successor Agency to the Community Improvement Commission Budget for FY 2019-20 and 2020-21; [City Council AND SACIC]\n\nAdoption of Resolution Amending the Salary Schedule and Approving Workforce Changes for Fiscal Years 2019-20 and 2020-21; [City Council] and\n\nAdoption of Resolution Amending the International Association of Firefighters (IAFF) Salary Schedule. [City Council] (Finance 2410)": [
        "'speaker_1': 'Amending the salary schedule and approving workforce changes for the fiscal year and adoption of resolution. Amending the International Association of Firefighters Salary Schedule.'",
        "'speaker_0': 'Thank you. And who's present is that, Miss Adair? Yes. Come on up and introduce yourself, please.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_10': 'All right. Good evening, Madam Mere, members of the council. I'm Melina Dyer. I'm finance director for the city. And today, where you actually get to see me several times. So hopefully.'",
        "'speaker_0': 'You never get enough of.'",
        "'speaker_10': 'That for. Thank you. I appreciate that. To start with, this is our biannual cycle, which means we have undertaken a bigger load than normally when we do it as a mid-cycle budget. And I would like to with that thank all of the department finance department staff as well as all the department heads and their staff in assisting'",
        "'speaker_10': 'to complete this budget, in assisting with the budget process. With that, as you remember, we have had two budget sessions in May. And with that, to kind of reiterate, the budget was put together in keeping in mind the city council key priorities that are listed on this slide.'",
        "'speaker_10': 'So first of all, preparing the city of Alameda for the future, protecting our core services. And as you remember, when we did go over each individual department, that's what we did keep in mind, supporting enhanced livability and quality of life.'",
        "'speaker_10': 'As we know, all of our citizens are very happy and proud to be in Alameda for exactly those reasons encouraging economic development across the island and of course, ensuring effective and efficient operations. We will go over some budget overview items and quick just a summary.'",
        "'speaker_10': 'As I mentioned earlier, we did have two budget workshops in May, May 15th and May 16th. It was open to the public city manager incorporated all of the suggestions that were made of most of the suggestions that were made by council and members of the public into the budget.'",
        "'speaker_10': 'And with that, we had to make some revisions. If you remember, we had to we'll let you know upfront that we had some doubling up on some of the expenses related to capital. We didn't fix that. With that, the grand total citywide expenditures are $332.5 million in year one and $267.3 million in year two.'",
        "'speaker_10': 'Again, primarily the decrease between year one and year two attributed to capital projects. And just as an example, we had about $20 million that we appropriated the 20 plus for base reuse operations from the sales proceeds. The biggest fund, the most discretionary money that comes to the city is from the general fund.'",
        "'speaker_10': 'The expenditures in year one in general fund are a little over $100 million, and it grows to about $103 million in year two. One of the things to mention is that by the end of the two year budget cycle, our available fund balance within the general fund stays at 25%, which is currently the policy that council has'",
        "'speaker_10': 'in place just as a heads up. But I'm going to repeat that and remind you later the individual slides that we present with the additional dollar amounts are on top of what the baseline budget is already. And once we get to those slides, I will point out what that actually means.'",
        "'speaker_4': 'Okay.'",
        "'speaker_10': 'Thank you. In looking at to start with citywide, obviously we always look at the general fund budget. However, we are approving the budget for the entire city. And as we do that, I wanted to make sure that the council members as well as members of the public, could see what exactly it's going to look like for us'",
        "'speaker_10': 'in terms of a trend on the revenues by department citywide as well as the expenditures by departments citywide. It will kind of give you an idea as to where we have been, where we're going. Again, a lot of the times, large fluctuations in expenditures are related to capital.'",
        "'speaker_10': 'And you will see that even though within the general fund, the largest departments, as everyone usually points out, is fire and police. But other departments actually do have funding sources outside of general fund. And when you look at them, public works in this case has the biggest component.'",
        "'speaker_10': 'To zero out now into the general fund budget. This provides you with a tabular presentation of what our two year budget will look like, but it also gives you a comparative with what we have projected for 1819 at and this was presented to you at midyear as well as actual expenditures and revenues for the General Fund for'",
        "'speaker_10': 'fiscal year 1718. Now those numbers are audited. So that's usually is our start. And to remind 1819 is not over yet and therefore those numbers are still a projection. They will change as we go through close the books.'",
        "'speaker_10': 'And once usually once we close the books, we do a presentation for you and you will be able to see the audited numbers. As you can see is ending from balance. We expect it to be a $26.2 million, 25% by the year or two of the budget.'",
        "'speaker_10': 'Just as a reminder, we do calculate the fund balance based on ongoing expenditures as well as transfers out. In many cases, when we do one time expenditures such as contributions to our OPEB and pension reserves, we do exclude those just because otherwise it's going to be a spike on what we need.'",
        "'speaker_10': 'And those are onetime costs that we exclude intentionally. General fund revenues. This actually provides you with a little bit longer trend. We go back to 1617, but it kind of gives you an idea as to where our general fund revenues are going in.'",
        "'speaker_10': 'Generally, we expect them to stay somewhat flat, to continue to grow, but not at a high pace as we did in 0809 or right after the recession. Our general fund expenditure again graphical presentation here again trend over a seven year period.'",
        "'speaker_10': 'This gives you a quick summary in graphical way to see where we've been and where we going in terms of our five year forecast for the general fund. As you can see, we project that 1920 and 2021. These are the years under budget, a currently a breaking even.'",
        "'speaker_10': 'And as a matter of fact, we do add very small amount to the fund balance. However, we do project a deficit going forward after that. And as we have always said, we do not allow to adopt a budget with a deficit.'",
        "'speaker_10': 'And every year at mid-cycle and again when we do put together biannual budget, we make sure we balance the budget and we'll look at revenues, we'll look at expenditures, all the available resources for us to make sure that the budget is balanced by the time it's presented to you.'",
        "'speaker_4': 'Okay.'",
        "'speaker_10': 'So this is going to be a little bit more detail and hopefully a little more familiar than what you have seen during the budget presentation. Again, as a reminder, the numbers you will see are in addition to the baseline budget.'",
        "'speaker_10': 'So just remember if we increasing by a certain amount, the department may already have certain dollars allocated and this would be on top. We'll start with the police department. And just to let you know, I will be able to present it to you, answer some of the questions.'",
        "'speaker_10': 'But if you have anything in greater detail and more information that you'd like, we do have the department heads present here and their staff, so they'll be able to answer them. There are three items that were allocated for the police department.'",
        "'speaker_10': 'One of them is their catering service program. This is their dispatch program and they're currently using one. However, it's not providing sufficient resources for them to retrieve information and provide information to a report out there for general fund is contributing half a million dollars to what?'",
        "'speaker_10': 'Towards the replacement of the system. We also assume, as you know, some salary savings within the police department, and that does not necessarily mean that we are eliminating the positions. This is strictly that in talking to the department, their expectation, how quickly can they fill the positions and what they are able to do?'",
        "'speaker_10': 'So the projection in this case is that they will probably with attrition, people retiring, trying to hire new people, they will probably have about five positions open and about $1.2 million in year one equates to. We also are renewing our friends of Alameda animal shelter contract that increases in year one and then it drops a little bit'",
        "'speaker_10': 'in year two because we have some onetime costs that we're adding in year one. That's with police department. Do you have any questions? Okay. Moving on to fire with the fire department, the allocation and request was for six additional firefighters as a means to assist with general fund paying for this additional personnel department applied for a grant'",
        "'speaker_10': ', a safer grant to assist with paying for them. Now, this would also be for an additional ambulance unit. With that, in actually a next slide, you will see in addition to our fleet, a new ambulance unit to be purchased because this particular save for grant is going to require a match.'",
        "'speaker_10': 'We are including in our two year budget, an estimated match amount. Even though the grant is over a three year period. But we're doing a contribution over to two years and it's approximately $1.3 million in total, which equates about half and half in each year, 650,000 additional personnel cost to assist with administrative duties of the training division'",
        "'speaker_10': '. As I mentioned, the addition of a new ambulance to the fleet expected to cost about $400,000. There's also conversations were about recruiting new personnel, including women, into the fire department. And for that, there's additional costs proposed for fire station.'",
        "'speaker_5': 'Improvements.'",
        "'speaker_10': 'And a feasibility study for a new fire station. A sorry, looking at fire station number five. Previously, we expected General Fund would be paying for it. However, there was a question and it was addressed. We did look into it and base.'",
        "'speaker_10': 'We use fund because it's really close to that area is covering the cost of the feasibility study.'",
        "'speaker_0': 'Question. So I was recently in Sacramento actually with Councilmember O.D. we attended the Governor's Summit on Emergency Preparedness Management. And one of the pieces of information we came away with is that some cities, notably San Francisco, are using their emergency operations center for what they consider a crisis of their time.'",
        "'speaker_0': 'And they actually do. They provide homeless services out of the EOC. But the point was made to all 400, some of us from who were there from all over the state that you really want to look at using your facilities for more than just one use.'",
        "'speaker_0': 'So my question would be if this feasibility study could also look at not just a new fire station, but how we know what other services a fire station, especially out at Alameda Point, might provide.'",
        "'speaker_10': 'I believe this feasibility study is actually for an existing fire station five that's out there and ability to, I'm assuming, bring it back to life because it was closed at one point. But I could probably defer to the fire team to see what exactly they were going to look into.'",
        "'speaker_0': 'When I think that it was, I think that it was to look at that, but also the possibility of other locations and moving a station. And it's not that I need approval from the fire chief. What I'm asking for and actually it would be staff direction, is that I think we just want to maximize our dollars.'",
        "'speaker_0': 'For instance, our current EOC cost a lot of money. And I just want to make sure that the city has lots of needs, just like every city does. And so the more that our facilities can do, you know, multi-tasking, the better.'",
        "'speaker_0': 'So I'm just asking if that's something that can be explored.'",
        "'speaker_10': 'And I'm sure it can be. And of course, the power to us here to speak to that, but also is a reminder original dollar amount that was put in for a feasibility study was 78,000. So because there were some additional requests to look into other items such as relocation of what it could be used for, additional 20,000'",
        "'speaker_10': 'was added and it was increased to 98.'",
        "'speaker_0': 'But I understand that. And if we had to juggle dollars around, my suggestion would be under the $60,000 a year for the next two fiscal years for recruitment of fire personnel. I might go with 60,000 for the first year and see what sort of results that yields if we needed to find more money.'",
        "'speaker_0': 'I think there's always ways to find some flexibility in a budget, but I'm just just asking for a little more flexibility looking at this. So, Chief.'",
        "'speaker_3': 'Mayor, if I could answer your first question. So as our finance director stated, the amount for the feasibility study was increased after further conversations with the manager to not only look at what would it take to reopen Fire Station five to make it a.'",
        "'speaker_3': 'Resize building, but also if we relocated it what would those Cosby to somewhere else and I mean a point we are working.'",
        "'speaker_8': 'With our community volunteer partner right now. We had a former building that was an adjunct training center out there.'",
        "'speaker_3': 'And we're looking to bring homeless services out there in that building. So I think what you're requesting will probably come to fruition way outside the parameters of this study here. So that's not to say that the facility that we currently have could have sections of it used for those purposes.'",
        "'speaker_3': 'But we're working hand-in-hand with community development on another option, another.'",
        "'speaker_8': 'Site out there for those services for the homeless.'",
        "'speaker_0': 'It's great. I hadn't heard about that yet, but nonetheless, I think there's a lot of different ways to look at facilities and I think I see my colleague Councilmember A Yes.'",
        "'speaker_3': 'Thank you, Madam Chair. Yeah, I just wanted to just put another finer point on that. I think the call of action that that we received there was that we should use our EOC, which is the mayor pointed out, was a very expensive building for collective action and not treated just as a bunker that's used during emergencies and'",
        "'speaker_3': 'that we can use it for smaller, long term crises. And homeless was one of the ones that came up in San Francisco. So, you know, we have a city assets I think we should use to serve the city and not sure if it's something in this budget discussion.'",
        "'speaker_3': 'But I do think it's something that I know I'm interested in seeing us do and hopefully I know there'll be a consensus at some point with my colleagues.'",
        "'speaker_0': 'Yeah, I just think a budget is a good budget. Time is a good time to look at these things. And the point that was being made in Sacramento and don't worry, San Francisco was in the minority when they asked for a show of hands of how many people are doing other things with their EOC is very few'",
        "'speaker_0': 'hands went up. But the point they were making is we need to look at these emergencies. I don't need to tell the fire chief, but fire season is now year round storms, floods, what have you. And so cities have to be prepared and yet we have a finite amount of resources.'",
        "'speaker_0': 'So we've got to make what we have do double and sometimes triple duty. But will. Well, let's stay in communication about that. Great. Thanks, any of you. Sorry, but to your.'",
        "'speaker_3': 'Point, you know, last week we had somewhat of an emergency. And I know we we had the library open. I mean, the EOC would have.'",
        "'speaker_0': 'Yeah, yeah. So yeah.'",
        "'speaker_3': 'That would have been a perfect opportunity to use the EOC as.'",
        "'speaker_0': 'We and we had a discussion about in November, there was there were the campfires and the air quality down here was so bad that we were distributing breathing masks. With 2020 hindsight, that would have been a great time to activate the EOC.'",
        "'speaker_0': 'We certainly had Deputy Chief Assistant Chief Zon back in the basement of City Hall helping organize, but we weren't at the umpteen million dollar EOC. But going forward, that's the sort of thing I'd like to look at. Thank you for that.'",
        "'speaker_0': 'No. Okay. Anyone else? Any comments? Councilmember Vela okay, good. Thank you chief. And mrsdurff please continue.'",
        "'speaker_10': 'I just wanted to also give a shout out to our city clerk because I can hear myself very well.'",
        "'speaker_4': 'So. So thank you.'",
        "'speaker_10': 'Okay. Moving on to the library. We're adding to personnel over two year period, one per one position in year one for the school reserve services and also library technician for computer lab in year two. It's important, I think, for our library to be open and also work with schools.'",
        "'speaker_10': 'So a handsome position was very important and had a priority for our library director. In addition, there are some capital expenditures installing led energy efficient lighting in the library. Those costs were approved and added in year one. I do understand.'",
        "'speaker_10': 'I apologize. I wasn't actually here for the rest of the budget hearings in May for personal reasons, but I do understand there was a request to increase the library collection and add some dollars to that. And so with that comment, we are adding some dollars to the budget that is presented to you tonight.'",
        "'speaker_10': 'Are there any questions on the library?'",
        "'speaker_0': 'Just a quick comment. I just think this is money so well spent. I know I'm not an objective observer because I co-chair the campaign to build the library, but it just does my heart good to see all the uses of the library, including last night I stopped in at a clinic for renters.'",
        "'speaker_0': 'That center like aisle came over and did in the library conference room. So keep up the good work. Anyone else? Questions? That wasn't really a question. I could frame it as a question, but go ahead.'",
        "'speaker_3': 'Don't you agree?'",
        "'speaker_4': 'Okay.'",
        "'speaker_10': 'All right. Next, we will talk about information technology department. A couple of big items over a two period, two year period. The largest one is enterprise resource planning system. Again, just as a reminder, the city council did approve in the prior two year budget funding.'",
        "'speaker_10': 'However, what was requested two years ago was actually a greater amount and at the time their approval only happened for a portion of it. So this particular cycle includes the additional amount. And as we know, more information costs did go up and warehouse.'",
        "'speaker_10': 'Asked for an additional amount here. With that, also, our I.T. Department is asking for an analyst, a programmer, analyst. This person is definitely going to be a big help with implementation of the new ERP. However, it's going to share its time with other projects within the city and one of them is a gas contract.'",
        "'speaker_10': 'That's all for information technology. Do you have any questions on that?'",
        "'speaker_0': 'Any questions? Anyone. Okay. Hearing that. Please proceed.'",
        "'speaker_4': 'Okay.'",
        "'speaker_10': 'The next department is human resources and there is a small change. All we're doing is an upgrade. Upgrading an existing position to a little higher position to really recognize the complexity of work. The deputy position is doing and the need within the city for a complexity of work required.'",
        "'speaker_10': 'So all it is is an upgrade from in the Lisbon position to a senior creature that is and I'm not sure if you have questions, but I will move forward.'",
        "'speaker_0': 'So yeah, they're not sure if they had questions. But Councilmember Vela, do let us know if there's anything you'd like to ask, Mr. Leiter. Yeah. Yeah. Okay.'",
        "'speaker_10': 'Go ahead. All right. Moving on to finance department. We are asking you specifically speaking for myself here for an additional position of management analyst. If you remember back in April, we presented to you our financial statements and other reports from the auditors.'",
        "'speaker_10': 'One of the bigger issues was issues with our procurement policy as well as how we do procurement in the city. So this position, even though it may not be 100% focus on that, but it would be probably a primary focus to make sure that our procurement policies up to date process is up to date and making sure'",
        "'speaker_10': 'we're actually following the policies either that are currently in place or the ones we're going to put in place. Okay. Moving on to Non-Departmental. There was a request for funding 4th of July parade and our police department has contributed previously certain time of the year to support the 4th of July parade.'",
        "'speaker_10': 'This year, we actually adding dollars in that support for you in the security staffing. And it's for the next two years, $50,000 each. In addition, hearing what the public was saying, as well as council's sentiment about climate action plan, we've increased the year one contingency was, I believe, $145,000 originally, and it was increased to 305.'",
        "'speaker_10': 'In addition, we've added a contingency related to the same item in year two. Previously there was none, so that was in response to the public and the council. Okay. Are there any questions on finance and on department?'",
        "'speaker_4': 'Sorry. I will go back if need be.'",
        "'speaker_10': 'Here? None. I'm going to move on to recreation and parks. There are several items that are being added in the recreation department. In first case, it's the personnel. We adding a gardener position in year two and our position would be 100% general fund funded.'",
        "'speaker_10': 'As you know, we've added a number of acres of parkland and we do need staff to actually maintain it. In year one, we do add a position, but that position will be funded half and half with the general fund money as well as Marina Village.'",
        "'speaker_10': 'So there's parklands that are outside of our regular general fund park areas that need maintenance as well because we increasing minimum minimum wage within the city and the department requested to provide additional funding. As you know, we do support recreation fund and in this case they do have a lot of part time personnel.'",
        "'speaker_10': 'And since minimum wage is going up, that's going to affect them. Some contractual services increases as well as small tools. Again, with the Climate Action Plan, we are trying to go green and with that we are changing the gas powered tools into being more electric.'",
        "'speaker_10': 'So again, in support. Some capital improvements that are being done with the department by the department would do in park maintenance and improvements. We have reduced the park maintenance improvement in year one in actually allocated funding, that same funding to the playground replacements and then added on the playground replacement $250,000 in year two.'",
        "'speaker_10': 'Previously there was no allocation for that.'",
        "'speaker_0': 'So I have a question here about the that first item, the reduction of the year one, park maintenance and improvements to 175,000 in that would result in deferred maintenance, greening, drainage, irrigation, field lighting and improvements, fencing, building. Those all seem like important things.'",
        "'speaker_0': 'I thought to ask was when we heard the budget presented at the workshops that we wanted to make sure that right. This is the second item that the the playgrounds were complied with current ADA and all safety standards.'",
        "'speaker_0': 'And then there is a possibility of a playground at Jackson Park that was being studied. But I certainly didn't mean that we would take away from maintaining and improving our parks. So does someone want to help me understand?'",
        "'speaker_0': 'Yes. City Manager. Mr. Lovett, I can.'",
        "'speaker_7': 'So and this is something that you can consider further tonight. So the initial recommendation in the budget back in May was 250 in park maintenance improvements. That's to 50 above what we've done in the past. So the 250 and both year one and year two were requests by by the rec and parks and that were in my'",
        "'speaker_7': 'recommended budget because of the Jackson Park. Well, for them, no playground equipment was in year. No. So based on the the discussion at the May meeting, we did. So what I had recommended was 75,000 come from the park and maintenance to the playground equipment for year one, but that an additional 250,000 go in year two.'",
        "'speaker_7': 'So the two there was 250,000 in year two, but there was just a transfer, meaning year one. You can reconsider that for a year one.'",
        "'speaker_0': 'Well, and I would probably ask Ms. Wooldridge, the Recreation Parks Director, because I don't want a multi I mean micromanage your work, but I always worry when I hear the term deferred maintenance because sometimes the maintenance we defer ends up costing us more.'",
        "'speaker_0': 'So was there any thought to taking the 175 and the 250 and splitting that amount equally? Or tell us if you you know, how you feel about these numbers.'",
        "'speaker_4': 'Right? So in terms of splitting them equally, it actually goes into a capital improvement fund. And so we expend as much as we can within the first year and our strategic about how we do that. So we can certainly equalize it out into what the I can't do the math that for graphs on of my head but'",
        "'speaker_4': 'equalize them. But it would essentially ultimately result in relatively the same level of of amount of projects that are completed.'",
        "'speaker_0': 'Okay. So you're not concerned that you would be deferring? I mean, when I say grading drainage, irrigation, I mean.'",
        "'speaker_4': 'I would say I'm I'm happy that we're going above and beyond where we're at now. As the city manager mentioned, both the 175 and the 250 is above what we're currently doing and so will bring us to a better level than we're currently at.'",
        "'speaker_4': 'Yes.'",
        "'speaker_7': 'I just want to clarify the details are as I remember, it's to talk about things that we're trying to correct that were deferred maintenance. Yes. So this is to improve on past deferred maintenance. Okay. So I want to make sure less deferred.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_7': 'Yeah. Right. So I just want to make sure that it's.'",
        "'speaker_4': 'Not creating deferred maintenance. Yes.'",
        "'speaker_7': 'Addressing deferred maintenance is to try to create improvements to pass deferred. Okay. And I wanted to make sure everyone was clear.'",
        "'speaker_0': 'All right. And you feel that you've got sufficient? Well, you.'",
        "'speaker_4': 'Know, there's always more projects to do. So it's it's the council's prerogative if you choose to bring that back to 250 in the first year, it really was an effort to address the community interest that came for Jackson Park.'",
        "'speaker_0': 'Understood. Anybody else want to weigh in on this councilmember decided.'",
        "'speaker_6': 'Previously recently I went on our website is check for the minutes from the meeting and at this point the I believe the minutes for the budget workshops are not available. So in looking at the tapes which are available, I do.'",
        "'speaker_6': 'You believe that what is written here when it comes to park maintenance and the playground is exactly what if we all remember? Our city manager gave an incredible summary of the way in which funds would be allocated based upon the input from the community and council members.'",
        "'speaker_6': 'So so I recognize the fact that, you know, when you originally the park maintenance for year one was $250,000. That was the original request. But by the same token, the background that they gave was that compared to what was done before, it was completely whole new, completely new money.'",
        "'speaker_6': 'So. So in an effort to address the need for Jackson Park, then I recognize that. Okay, well, you know, the money has to come from somewhere. So that was a compromise that the city manager made in reacting to the concerns.'",
        "'speaker_6': 'What I really was excited about, though, was the year to $250,000 for the playground replacement, because that was to me, that was, you know, what we were really. Well, what was interesting was what interested me the most. On a final note, yes, indeed.'",
        "'speaker_6': 'In the last budget workshops, there was one exhibit that that identified all the deferred maintenance at every park. So that was a valuable insight as to why we are making headway in terms of allocating money that was not allocated before.'",
        "'speaker_6': 'We have a lot more work to be done. But I think in order to address that systematically, there's there's other kind of budget related issues that we're at some point in time we'll have to tackle.'",
        "'speaker_0': 'So if I could just ask for your consideration, would it make sense to flip the two allocations and spend the most money in year one rather than let the deferred maintenance get another year older? But again, you I mean, it's the same amounts, but rather than sort of ease into it.'",
        "'speaker_7': 'You so you're requesting that your one park minutes be to 15 year to 175.'",
        "'speaker_0': 'Flip it just that you know we're addressing deferred maintenance and sometimes you save money by catching it earlier rather than later. But counsel, what is what do you all think?'",
        "'speaker_10': 'And I just kind of also wanted to let you know.'",
        "'speaker_0': 'Is that you.'",
        "'speaker_10': 'Can well know you can make a decision now if you want to change it up. But just remember, you always have an opportunity to look at it at midyear and again at mid-cycle if you want to either give directions to make sure, maybe include potentially additional items that relate to either park maintenance or playground replacement.'",
        "'speaker_10': 'But you can do it now. But just remember, you do have other opportunities as well. So I just want to make sure you remember that.'",
        "'speaker_0': 'Yeah, I appreciate that. But then I would also argue that deferred maintenance is going to be that much older or older, more deferred by by mid-year. Councilmember Odie.'",
        "'speaker_3': 'Yeah, real quick. Yeah, I think my colleagues recap of, of the last meeting was correct because I pulled up the old slide and of these four items I think the city manager proposed 965 and that's what this one has in year one.'",
        "'speaker_3': 'And then he proposed to 50 in year two and then we bumped that up to 500. But I thought I read maybe it was this morning that we had a big sale in Alameda, a big real estate sale, marina village.'",
        "'speaker_3': 'Right. So I wonder, I mean, that'll come in a kind of a miniature true upright.'",
        "'speaker_10': 'So if I have heard about that, we do not have the money yet.'",
        "'speaker_3': 'For that in this year, or is it going to be in next year?'",
        "'speaker_10': 'So the cash will not come in now, but we will recognize the revenue in this year, 18, 19.'",
        "'speaker_3': 'I mean, that might be an option where we we can take a look at that since it's one time money that we didn't budget for. It might be something this could be a priority when we when we review that or we could do today.'",
        "'speaker_3': 'I mean, it doesn't really matter to me, but. I'd like to at least prioritize.'",
        "'speaker_7': 'I don't see any concern if the council wants to flip the 215 to 175. I think that would be the I don't see any financial concerns for the city in doing that in a.'",
        "'speaker_3': 'Two year budget. Right. So over the course of two years, it's the same same amount.'",
        "'speaker_0': 'It's just that we would be spending more sooner to address deferred maintenance. Correct. That. So reasonable. Okay. I think. Malia, any thoughts? I'm Estella. Sorry.'",
        "'speaker_5': 'I think that that sounds reasonable.'",
        "'speaker_0': 'Flipping the numbers. Flipping the numbers. Okay, so if we could do that. Okay. So where were we? Mastic Senior Center.'",
        "'speaker_1': 'Yes. Yes.'",
        "'speaker_10': 'Another large improvement we're doing to a master senior center, h HVAC system, variety of sources that are being allocated to do that work and total, it's going to cost a little over half a million dollars. And we have domestic senior center itself making contribution as well as general fund and as well as within CAP funds, we had'",
        "'speaker_10': 'some dollars that haven't been spent within other projects that closed. And so we're using some funding sources from that. And original money came from the general fund for those particular projects. Another one that you've heard more information earlier about is Aquatic Facility, where allocating $150,000 to do a concept, design and more for staff to start funding a'",
        "'speaker_10': 'fundraising campaign. Any items or notes otherwise? And we'll move on to the next department.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_10': 'K public works a similar situation. The department is requiring some more complex work that needs to be done. As a matter of fact. Just to point out on some of them is to we did have a single audit finding in terms of how quickly we ask for reimbursement requests.'",
        "'speaker_10': 'And in this particular case, there are some positions here that will assist with that to make sure that we file reimbursements on time and get the money timely into the city. So with that, there are some upgrades that are requested by the department, a little more complex work and therefore need a different position to make it appropriate'",
        "'speaker_10': 'for classification. In addition, in the Fleet Fund, we're asking for some equipment. This is a lift column lift to service vehicles within the city, and that's $75,000 moving on additional capital projects that are being funded. Again, as a reminder, this is in addition to what will already have a baseline budget.'",
        "'speaker_10': 'We're allocating funds to urban forest lagoon maintenance that comes from general fund alone. So urban forest is actually been increased to 250,000 out of general fund and some other funds are contributing some additional funding to for that purpose.'",
        "'speaker_10': 'Streetlights we at the baseline contribute 300,000. This is an additional 300,000 in year one and 560,000 additional in year two. Add some additional money into this traffic calming project as well as in a second year addressing the sea level rise and claiming it was part of the Climate Action Plan.'",
        "'speaker_10': 'If you wish for the Veterans Court Project and Central Avenue Large Project General Fund is making a $748,000 contribution for that. Any question to.'",
        "'speaker_0': 'Just quickly.'",
        "'speaker_6': 'Say during the budget workshop, we had incredible discussion about the urban forest. And I and I appreciate that, you know, the amount the incremental amount that we're looking at is above what we originally looking at in the May workshop.'",
        "'speaker_6': 'Again, reflecting the fact that, you know, this was a concern of residents as well as council members. And after all, we are Alameda which is I believe Spanish for grove a popular trees. So so it's nice to see, you know, more new incremental dollars directed towards that urban forest.'",
        "'speaker_6': 'And as the city manager had indicated last time that, you know, for the first time this is coming out also from the general fund budget, kind of as an indication of, you know, how serious this we are taking the trees.'",
        "'speaker_0': 'Thank you. Thank you. And you know.'",
        "'speaker_3': 'That was a question.'",
        "'speaker_0': 'That was a question. Yeah. You're learning. Would that be a yes?'",
        "'speaker_4': 'Yeah. Yes.'",
        "'speaker_10': 'Moving on to community development. We adding a position in year two that's been approved. Again, this is to assist departments with more accounting and analysis type of items. We're upgrading a position to a development manager from management analyst.'",
        "'speaker_10': 'And I do understand this was a discussion point for the Alameda Point or Base Reuse Fund where we're setting aside about $2 million for the big whites. I do understand that there was a request once the contract is done in specific work, that will come back to council to make sure that you agree with what the staff'",
        "'speaker_10': 'is proposing to do with those buildings.'",
        "'speaker_4': 'Okay.'",
        "'speaker_10': 'Are there any questions on community development before I move on? Okay. Planning, building and transportation. This is our newly created department. A couple of personnel changes, upgrades to the positions. I do want to make sure that a public and city council is aware that these particular positions are funded with permit fees.'",
        "'speaker_10': 'So they are outside of general fund completely and the funding is provided from the fees that they generate. In this case, counseling technician to Administrative Services Coordinator. We are creating, since this is a new department, the re titled department head title, which is director of planning, building and transportation as well as we reallocated i.t system as analyst'",
        "'speaker_10': 'a position previously resided in i.t. It has been 100% moved over into the planning, building and transportation. With the new department. In talking to our new department head, the building official position is being eliminated and actually combined potentially with an assistant director position.'",
        "'speaker_10': 'We're also doing some upgrades to planning manager to a city planner. And we are we've added a position at MIT Psych midyear. And so with that and changes in the positions as we have here. The department also requested a new vehicle.'",
        "'speaker_0': 'So a question here. You know, my mantra about replacing vehicles is this new vehicle and electric vehicle.'",
        "'speaker_10': 'I would expect for the type of work that it's done in talking between fleet manager and also the department, it should be okay to have it as an electric vehicle. I don't want to speak for the department head in this particular case, but it would be evaluated for themselves.'",
        "'speaker_0': 'Since we're going to be looking at the climate action from.'",
        "'speaker_3': 'Our department's point of view. Electric Works is really about whether the fleet manager and the city's vehicle.'",
        "'speaker_7': 'Purchasing policy maintenance.'",
        "'speaker_3': 'Fuel, you know, being able to keep it running. One of the issues from a planning a building perspective, it absolutely works for the daily inspections, no question. Our issue is just something that we've been talking to the fleet managers about is in the event of a major emergency, our inspectors are going to be out as part of'",
        "'speaker_3': 'the recovery response. We want to make sure.'",
        "'speaker_6': 'That vehicle.'",
        "'speaker_3': 'Is usable.'",
        "'speaker_0': 'So as a driver of an EVA, I just say keep him charge to the maximum at all.'",
        "'speaker_3': 'And thank you for that advice. Mayor.'",
        "'speaker_0': 'Thank you, Mr. Thomas. That was Andrew Thomas.'",
        "'speaker_10': 'On that note, I just wanted to also say that during the budget presentation, during the study sessions, fleet was addressed as well in the list of vehicles for replacement was provided. One of the things that came out of that is that I believe it was city managers request to public works and fleets specifically to evaluate the fleet'",
        "'speaker_10': 'for the entire city, for all the replacements that we need to do and determine what are the appropriate vehicle use as well as a right size the vehicles for the city. So I'm pretty certain that that would be included as part of that discussion.'",
        "'speaker_0': 'The question from Vice Mayor Knox, we.'",
        "'speaker_2': 'I'm going to save this for the end. But might my recommendation or my recollection of that conversation is that there would actually be a fleet policy that would be coming back to the council based on that. Is that right?'",
        "'speaker_2': 'A part of that. Okay.'",
        "'speaker_4': 'Thank you. Anyone else?'",
        "'speaker_0': 'Go ahead, Ms..'",
        "'speaker_10': 'Mr. Duke. And so moving on to our last department in this case is Housing Department. We have some what I would call a projects there, not necessarily capital projects for the city. We do utilize contract contractual services in this case because we do work with the Alameda Housing Authority and outside parties as well.'",
        "'speaker_10': 'So but in terms of type of project, it is it is a capital project. And so in this case, we are requesting a department requested to set aside a money, 900,000 in year one in 700,000 year to related to housing, affordable housing units, projects.'",
        "'speaker_10': 'Okay with that. That's the end of specific department presentations, unless you have questions. And if not, the next steps for us either provide hear from you. We do have one change. I do understand that. But there are several resolutions for you to approve in order to for us to move on with the budget and have it available'",
        "'speaker_10': 'on July 1st.'",
        "'speaker_0': 'Thank you. All right. So council and we do have well, we have some public speakers. So does anyone have any further clarifying questions before we go to public speakers? Vice Mayor and Oxley.'",
        "'speaker_2': 'I'm not. I may have missed something, but the fleet replacement, which was a big part of and $7 million in the first year, wasn't a part of this presentation that I saw, the $7 million.'",
        "'speaker_7': 'So what we did on the fleet is we have given discretion to the fleet management to look at the two years of the fleet and to try to manage those as best as possible. We also reduce for future fleet by 10% and ask them to come back in the fleet policy and address that and then we could'",
        "'speaker_7': 'address that at mid-cycle.'",
        "'speaker_2': 'Okay. So currently we're not. Moving forward with an additional cost. Okay. Got it. Thank you.'",
        "'speaker_0': 'Is that?'",
        "'speaker_10': 'I just wanted to make sure I understood what you meant by not moving with additional costs. So the Council is being asked to appropriate the funding for it. However, for the new vehicles, for the replacement of the vehicles.'",
        "'speaker_10': 'However, as you mentioned before, that replacement happens unless it's an emergency and we need something as soon as possible. The policy will be looked at first and then the evaluation of the fleet will happen, but at least it will have sufficient time when it does happen that it goes back to our fleet manager in order to purchase'",
        "'speaker_10': 'those vehicles. He will already have the appropriations for the budget in terms of budget.'",
        "'speaker_0': 'So my question for the city manager is when do you anticipate bringing the fleet policy back to us?'",
        "'speaker_7': 'And we haven't fully discussed it out, but I'm hoping to have it this fall.'",
        "'speaker_0': 'So not before this summer, but not before later. We don't have much. And the council goes on. We go dark in the month of August.'",
        "'speaker_7': 'So we were planning on having some of the vehicles probably start to be purchased, but they would only be the critical vehicles which have already have funding in the vehicle fund because if you I don't know if you remember or not, but there is a little over 5 million already in the vehicle fund.'",
        "'speaker_7': 'And we added, I want to say 1.6, which has been reduced by that 10%, if I remember.'",
        "'speaker_10': 'The charges out of general fund have been. So what we've done is we've created rates for the full fleet. We determined here's the listing of the vehicles when they were purchased, when they were supposed to be due for replacement based on the current policy, of course.'",
        "'speaker_10': 'But with that, the charges were allocated for all of those vehicles to all the programs in the city, specifically for General Fund. We reduced the contributions by 10% to further evaluate the fleet and come back if need be.'",
        "'speaker_0': 'And I understand that. I appreciate the explanation, but my point is simply that I do not want the city moving forward purchasing vehicles unless it is a, you know, a critical situation until we've had a chance to look at this policy, because I just want us to be consistent across all avenues.'",
        "'speaker_0': 'We're about to look at the Climate Action Resiliency Plan. So we shouldn't, because when we buy a vehicle, it's not just for a year or two, it has a life. So does that sound doable?'",
        "'speaker_7': 'Mr. City Manager I believe that's doable. The only other exception is as long as it's compliant with the climate action like electric vehicles, that would be compliant, I would think would also fit into that.'",
        "'speaker_0': 'I would think so. Any council members want to weigh in.'",
        "'speaker_3': 'I have a question.'",
        "'speaker_0': 'Okay. Okay. So then we have a question from a vice mayor. Not quite.'",
        "'speaker_2': 'So the during the workshop we did, we spent a good chunk of time talking about the internal service funds, but it's not in the. It was not in your budget presentation tonight is things we were. But to prove.'",
        "'speaker_4': 'It. That's true.'",
        "'speaker_2': 'Asking us to prove it?'",
        "'speaker_10': 'Yes. You will be approving as part of our overall budget.'",
        "'speaker_2': 'So I guess I'm having a hard time finding that in the budget. Can you direct me to where those funds are since they weren't called out in the presentation as additional?'",
        "'speaker_10': 'Well, if you want to look at them specifically, then.'",
        "'speaker_5': 'They?'",
        "'speaker_10': 'On the attachment, the exhibit that was provided, which I believe titled Budget Summary. It's budget summary. There's an attachment called citywide budget, all fund summary. So that provides a full summary of the funds. And if you want to look at internal service funds specifically, it's on the second page and it's fund numbers that start with seven or'",
        "'speaker_10': 'seven hundreds webpage numbers.'",
        "'speaker_0': 'Ambassador, do they have pages? Hmm.'",
        "'speaker_4': 'Well, maybe not.'",
        "'speaker_10': 'Including the first cover.'",
        "'speaker_7': 'But it would be page. It'd be page 11 of 70, I.'",
        "'speaker_0': 'Believe it says exhibit two Budget Summary. And you see page 11.'",
        "'speaker_7': 'I think it's on page 11 of seven.'",
        "'speaker_4': '1111.'",
        "'speaker_0': 'Is 70.'",
        "'speaker_3': 'Online.'",
        "'speaker_0': 'But yes, that's a revenue sense. So 11 of 70 if you're scrolling through 20. I look on page 12, Councilmember Brody says in your hard copy.'",
        "'speaker_10': 'Maybe on the hard copy, I believe it's number 12 if you actually do count on pages.'",
        "'speaker_0': 'Okay. So.'",
        "'speaker_3': 'I'll look I'll look forward to it.'",
        "'speaker_0': 'Okay. I have a question. Question from Councilmember De Soto.'",
        "'speaker_6': 'In your budget presentation, which is this item right here.'",
        "'speaker_9': 'Okay. Thank you.'",
        "'speaker_0': 'I'm sure she can multitask, but we will let her get back to the microphone.'",
        "'speaker_6': 'In your budget presentation, this item right here, what kind of struck me was on the slide that general fund budget 20 1920 2020 dash 2021. If we just look at the expenditures on the operations and forget about the pension OPEB reserve line, is this the first.'",
        "'speaker_4': 'Time.'",
        "'speaker_6': 'That that we will be adopting a general fund expenditure budget that crosses the $100 million threshold?'",
        "'speaker_10': 'I yes, I believe you're right. Well, yes and no. Original budget. Yes. However, in 1718, with some additional appropriations that happened during the year, including the large contribution to pension and OPEB, it did surpass the $100 million.'",
        "'speaker_6': 'But in terms of operations, though, where we.'",
        "'speaker_10': 'Correct.'",
        "'speaker_6': 'So I mean that's that's a pretty significant threshold that that that that we're crossing. So I just want to quickly say also to the finance department and all the department heads who put together in the residence ought to take the time to take a look at it, because there are there's really very handsome charts and discussions regarding'",
        "'speaker_6': 'the assets that are the city of Alameda manages and owns. And it's all in in here. And it's fun to read colorful graphics, nice snappy summaries of how many roads we manage, how many trees we have, the different zones that where trees are going to be trimmed.'",
        "'speaker_6': 'And when you look at the capital improvement summary, there's also a capital improvement fund by capital improvement fund, discrete disc discussions, but also fortunately kind of a who the responsible staff member is. I really like that that that was really nice.'",
        "'speaker_6': 'So residents I hope if you're watching this, if you get a chance to go online and check out both the CIP budget summary and the general fund or the operation fund, it's really nice. Thank you.'",
        "'speaker_0': 'Thank you. Yes, thank you very much, Mr. Finance Chairman, and our new city manager, Eric Levitt, who really hit the ground running. He's been here not quite three months, two months.'",
        "'speaker_4': 'And.'",
        "'speaker_0': 'And he and finance produced this amazing budget. So good work, team Alameda. Okay. If there's no further clarifying questions we have. How many? Just two. Okay. Let's hear our public speakers. Thank you.'",
        "'speaker_1': 'The first one is Misha Tom, and the second is JJ Navarro.'",
        "'speaker_0': 'And you each have 3 minutes to speak.'",
        "'speaker_3': 'Perfect. I will not use. Well, maybe I will. Maybe I'm just like the echo of my voice. I thank you for having me. And thank you for all doing the civic and public work you do. And I have just come to advocate for the Jackson Park playground.'",
        "'speaker_2': 'It sounds like it's made.'",
        "'speaker_3': 'Smooth sailing through the waters. But as a parent of a three year old, an eight month old who lives in the Jackson Park neighborhood, it's very exciting the prospect of having another playground and using that space more with a broader civic purpose.'",
        "'speaker_3': 'And I think that that's really all I wanted to say. So thank you so much.'",
        "'speaker_0': 'Thank you. And our next speaker is J.J. Navarro.'",
        "'speaker_3': 'Hello. Great to be here. And thank you for your service to the city of Alameda. I'm here with my neighbor, Misha, and we were very excited to see Jackson Park up on the slides today. I was here with you a month ago to voice my support, and I listened online to the discussion that followed and was really'",
        "'speaker_3': 'encouraged to hear that you echoed a lot of the same sentiments of why we're trying to get this done. So thank you. Thank you. Thank you. And I really look forward to continue to be a part of this process.'",
        "'speaker_0': 'Thank you for your remarks. Thank you both. Okay. So that's all of our public speakers. So I'm going to close public comment. So council our task tonight is to, um. We've got some resolutions to approve. There is. Not a good time for the iPad to freeze.'",
        "'speaker_0': 'You should put something in the budget. No, just kidding. Okay, so we have resolutions, too. Well, we need to adopt the operating and capital budget for fiscal year 2019 and 2020 19 to 2020 and 2022, 2021. And we also have the board.'",
        "'speaker_0': 'To approve an adopt the successor agency to the Community Improvement Commission budget for fiscal year 20 1920 and 20 2021. Adopt a resolution approving workforce changes and adopt a resolution amending the International Association of Firefighters Salary Schedule, all of which was encompassed in the the report.'",
        "'speaker_0': 'The presentation that we had. But I believe we need to take our resolution separately. Correct.'",
        "'speaker_1': 'Really? Together.'",
        "'speaker_0': 'Together?'",
        "'speaker_1': 'No. Yes. Separately.'",
        "'speaker_0': 'Separately. Yeah. We the the when there's a tie, the city attorney prevails. Okay. So for the resolution approving in adopting the operating and capital budget for fiscal years 2019 to 2020 and 2022 2021, do I have a motion, a question?'",
        "'speaker_3': 'We make sure comments are.'",
        "'speaker_0': 'Well, can we get a motion in motion? Okay, I have a motion. I have a second from Councilmember Vela. They will have discussion.'",
        "'speaker_3': 'Councilmember O.D. I'll be brief because I know we had three, two or three days worth of this back in May. So I also want to echo my colleague's comments. Appreciate the hard work of the city manager. It was like the first couple of weeks.'",
        "'speaker_3': 'That was one of the first things he did and it really was an amazing budget. It reflects our priorities and I think. ILLEANA You went over them, so I'm not going to repeat them. And I appreciate the work of you and your team as well as all of the department heads and putting this together.'",
        "'speaker_3': 'It's a budget I think we can be proud of. I'll be proud to support it. And I just want to appreciate everything you guys did to to get us to this point.'",
        "'speaker_0': 'Any other decision based on the next wave.'",
        "'speaker_2': 'So I plan to support this, and I just want to make that clarifying comment that this includes the flipping of the since. I believe this is the the when that that our motion includes the flip of to 50 and 175 for the parks.'",
        "'speaker_2': 'So I want to I just want to thank the city staff. I know that a lot of work went into this, especially since we had an interim city manager for a lot of this. And our staff, finance staff is short staffed, so there's no way to undersell or oversell the huge lift that was done in creating this'",
        "'speaker_2': '. And I very much appreciate the document. I think it's something that we can all be proud of. Thank you.'",
        "'speaker_0': 'And I'll just slip in an extra thank to our finance director, Lena Adair. Some Mrs. Dear actually grew up in Siberia. And during this process, when she was just immersed in all this, her grandparent died in Siberia and she had to leave and go.'",
        "'speaker_0': 'She chose to leave and go back for the services. And that was a lot of personal stress on her. And somehow and she's a mother of two young children, but a beautiful job, Ms.. Adair, your usual stellar work product.'",
        "'speaker_0': 'So anything further or shall we take a vote? That's what.'",
        "'speaker_4': 'Rock Hall.'",
        "'speaker_1': 'Council members decide. Yes. Not quite. Yes. Yes. Yes, mayor. Yes. That carries my life.'",
        "'speaker_0': 'All right. Thank you. So that resolution passes unanimously, and then we move on to.'",
        "'speaker_2': 'A move approving the in adopting a budget for the fiscal year 1920 and 2021 for the Community Improvement Commission of the City of Alameda.'",
        "'speaker_0': 'Perfect. Do I have a second?'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Okay. It's been moved and seconded. Any discussion? Hearing, then roll call. Vote.'",
        "'speaker_1': 'Councilman or commissioner stateside? Yes. Not quite. Yes. Yes.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'As the Ashcraft?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'That also carries by five votes unanimously.'",
        "'speaker_0': 'Thank you. Okay. Next, we have a resolution amending the salary schedule and approving workforce changes in fiscal year 2019 to 2020 and 2022 2021. To have a motion.'",
        "'speaker_2': 'So moved.'",
        "'speaker_0': 'By the vice mayor, seconded by.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'By Councilmember Odie. A voice vote. Roll call vote, please.'",
        "'speaker_1': 'Councilmember say. Says yes. Next fight.'",
        "'speaker_4': 'Yes. Odie.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Yeah. Mayor as he Ashcraft.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'That carries unanimously by far. Right.'",
        "'speaker_0': 'All right, let's see if we can make it for for our last resolution is amending the International Association of Firefighters Salaries Schedule. I do have a motion.'",
        "'speaker_2': 'So moved.'",
        "'speaker_0': 'It's been moved by the vice mayor, who's been seconded by Councilmember Vela, all of our rockhopper councilors.'",
        "'speaker_1': 'They said yes. Not quite. Yes. Yes.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'There is the Ashcroft.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'That carries unanimously by five eyes.'",
        "'speaker_0': 'Perfect. Good work, everybody. Okay, so then we.'",
        "'speaker_1': 'Are during this.'",
        "'speaker_0': 'James, we adjourn this meeting and I am going to give us a ten minute break and then we will come back. And here I am, six C.'",
        "'speaker_1': 'That's exactly right.'",
        "'speaker_0': 'Okay, everyone, 10 minutes. We will be back at eight. Okay. 855. Don't be late.'",
        "'speaker_4': 'Right.'",
        "'speaker_0': 'If you seats, please, we are going to drive you. Oh, okay. Our recess is over and we are going to move on to item six.'"
    ],
    "Public Hearing to Establish the Proposition 4 (Appropriations) Limit for Fiscal Year 2019-20 and to Consider Adoption of Resolution Establishing the Appropriations Limit for Fiscal Year 2019-20.  (Finance 2410)": [
        "'speaker_1': 'See this public hearing to establish the proposition for appropriations limit for fiscal year 20 1920 and to consider adoption of resolution establishing the appropriations limit for fiscal year 1920.'",
        "'speaker_10': 'Good evening, Madam Mayor. Members of Council. Eleanor, dear finance director. I've mentioned earlier you get to see me quite a lot today. So we just adopted a previous item. We've adopted the budget for the next fiscal year. I do not have a presentation for this particular item.'",
        "'speaker_10': 'I'll just talk about that real quick. There's a California law that requires there's a constitution to adopt an appropriation limit. And what that really means is that we do not levy taxes within the city above what our allowable amount is.'",
        "'speaker_10': 'And at this point, we've provided a calculation as an attachment to our staff report. We are at 68% of what we are allowed to levy in terms of taxes. We're not close to it yet, which is good. However, one of the things that we do for potential future growth and things like that, we use the most advantageous'",
        "'speaker_10': 'factors that the city can use in order to calculate the growth. In order to calculate the appropriations limit. With that, I am open to any questions you may have, and we can talk specific numbers if you want to know more about it.'",
        "'speaker_10': 'But other than that, that concludes my presentation.'",
        "'speaker_0': 'Does anyone have any clarifying questions? Comments? Do you have any public comments.'",
        "'speaker_1': 'Of speakers on this topic?'",
        "'speaker_0': 'No speakers on this item.'",
        "'speaker_2': 'Great staff report. I'll move approval.'",
        "'speaker_0': 'We have a motion from the vice mayor. Do I have a second.'",
        "'speaker_3': 'Second?'",
        "'speaker_0': 'Second by Councilmember Odie. May we have a voice vote, please?'",
        "'speaker_1': 'Councilmember Daza? Yes. Naxalites Yes. Yes.'",
        "'speaker_5': 'Vela Yes.'",
        "'speaker_1': 'Mayor is the Ashcraft?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'That carries unanimously backed by Vice.'",
        "'speaker_0': 'All right, perfect. Thank you. Then we move on to item six D Public Hearing.'"
    ],
    "Public Hearing to Consider Adoption of Resolution Amending Master Fee Resolution No. 12191 to Add and Revise Fees. (Finance 2410)": [
        "'speaker_1': 'Consider adoption of resolution amending master fee resolution number 121912 add and revise fees. And we do have a speaker on this item. Okay.'",
        "'speaker_10': 'Thank you, Madam Mayor, again, and council member Selina Decker, Finance Director, as we approve our budget, at the same time, we assume certain fees that are included in the budget for every department that does charge the fees. And with that, there's always a public hearing and we adopt a resolution form our master fee schedule annually at the'",
        "'speaker_10': 'same time generally. And so this year we're presenting a masterpiece schedule for your review. Again, there are a number of changes that have happened and we've incorporated new fees into our new schedule. If you recall in in the spring of this year, the large changes that happened was fire department fees and public works department fees in planning'",
        "'speaker_10': ', building and transportation department fees have been. We've performed a study. Those fees have been updated and they are now incorporated into our master fee schedule. All the other fees, where necessary and where allowable, were updated for CPI increases or construction index increase.'",
        "'speaker_10': 'One of the things is we have taken out the development impact piece from the schedule was revised and presented to you. So the one you will be approving is the one without it. A number of fees that may have been updated or removed.'",
        "'speaker_10': 'In a staff report, we actually try to identify every single one of them. So, for example, library fees, late fees have been eliminated and it provides a little bit of a description as to why we do that. If you have any questions related to any of those, you're more welcome to ask.'",
        "'speaker_10': 'Otherwise, I'm going to ask you to move forward with approving the master schedule.'",
        "'speaker_0': 'I would love it if, for the sake of the public that might know to read the staff report, you would just explain the rationale for no longer charging library late fees.'",
        "'speaker_4': 'Which I.'",
        "'speaker_0': 'Concur 100% with.'",
        "'speaker_10': 'Well, my understanding is a number of cities around the area in general do not charge the fees, partially because really we try to encourage people to come to the libraries and take out books, CDs, whatever people choose to utilize.'",
        "'speaker_10': 'Or their reading pleasure or listening pleasure in this case. And so to encourage people actually come back. Use the library services, the late fees, even surrounding organizations are actually eliminating completely. And that, you know, helps the customers or patrons to come back to the library.'",
        "'speaker_0': 'Yeah, I think I thought it was very well stated in your report that because the library's mission is of free and equal access to information, eliminating late fees supports. This objective is, as you noted, that for people, especially low income residents who need the libraries the most, this could be a roadblock.'",
        "'speaker_0': 'And I think did we hear that there might be another food drive associated with returning books, Bill, that the library director announced that in her own time. Okay. Any questions? We do have a public speaker. That's right. Okay.'",
        "'speaker_0': 'So if there are no no clarifying questions from council, then let's hear a public speaker, please.'",
        "'speaker_8': 'Tom Roth at American City Council members. My name is Tom Roth. I'm the attorney representing Beau Networks, LLC, in the impact fee litigation that's been going on for some time now. I'll be brief. It's actually past my bedtime, so I got to get home.'",
        "'speaker_0': 'So this is kind of early for us to see, you know? Yeah.'",
        "'speaker_8': 'I'm amazed that you can stay up this late and. And all these manners this late. I think that's really something to be commented on. I applaud you for that. Thank you. I was going to comment on something that no longer exists, which is the impact fees being in the master fees schedule.'",
        "'speaker_8': 'Obviously, in light of the Court of Appeal decision on May 15th, that 3 to 0 determine that those fees are unenforceable. It would be not it would be inappropriate to include those in the master fees schedule. I understand from staff that they've removed those and I appreciate that.'",
        "'speaker_8': 'I think that avoids that conflict. And I want to thank staff for that. I think going forward, if the city council is considering additional impact fees, that there's an opportunity for the city council here. We have a brand new city attorney, we have a brand new city manager, and there's fresh ideas from staff to look at this'",
        "'speaker_8': 'question. I would encourage the City Council to perhaps consider a new impact fee consultant and start with a blank sheet of paper and attack this this question and these issues from that standpoint, rather than putting a Band-Aid on the old 2014 study with a 2017 study that was never adopted, those studies are seriously flawed.'",
        "'speaker_8': 'And I'm I'm concerned that if the city just puts a Band-Aid on those studies and tries to tweak them, we're going to be right back in the same place. So I think there's an opportunity here with this staff to really start over in this process and encourage the city to do that.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Good night. All right. We in Alameda are kind of night owls, I guess. Okay. That was all the public speakers. So in a closed public comment. Any council discussion? Are we ready for a motion? Come on, people.'",
        "'speaker_0': 'It's getting close to a bit.'",
        "'speaker_2': 'With acknowledgment that I have $4.60 that it's still standing as a library. Fine, that I plan to pay. Regardless of how this goes, I will move approval.'",
        "'speaker_0': 'I think his conscience bothered him.'",
        "'speaker_4': 'What do you think?'",
        "'speaker_0': 'We have a motion from.'",
        "'speaker_4': 'The.'",
        "'speaker_0': 'Motion from the vice mayor as second from the from Councilmember Vela.'",
        "'speaker_4': 'It's not.'",
        "'speaker_3': 'Effective until July 1st.'",
        "'speaker_2': 'Right? I'll pay it before then. I promise.'",
        "'speaker_0': 'We'll try to stop him before he leaves the building. All right. It's been moved and seconded. All in favor by voice vote. Sorry.'",
        "'speaker_1': 'I hear council members decide. Yes, Knox, right? Yes. Yes, Bella. Yes, Mayor. As the. Yes, that carries unanimously by five votes.'",
        "'speaker_0': 'Thank you. All right. Item six. Madam Clerk.'"
    ],
    "Public Hearing to Consider Collection of Delinquent Integrated Waste Management Accounts Via Property Tax Bills. (Finance 2450)": [
        "'speaker_1': 'Public hearing to consider collection of delinquent integrated waste management accounts via property tax bills.'",
        "'speaker_4': 'Good evening, Mr. Mayor, and members of the City Council. I was accord public works coordinator the evening before you asked the Council to move forward with the collection of delinquent integrated waste accounts via property tax bills. This is the last step in a process conducted annually to resolve these delinquent accounts.'",
        "'speaker_4': 'Staff begins the process in January following our franchise hauler ECI, Alameda County Industry's efforts to collect on the delinquencies. The city sends a series of letters to property owners who then have until June 30th to resolve the delinquency with our finance department.'",
        "'speaker_4': 'Otherwise, the outstanding amount is collected via the property tax bill. Staff is recommending you move forward with this process. That completes my report and I'm available for any questions you may have.'",
        "'speaker_0': 'Do we have any questions of from this? From counsel and questions of staff? Councilmember.'",
        "'speaker_3': 'Is there anyone that's contesting or coming today to.'",
        "'speaker_4': 'I'm not aware of anybody here contesting. We've had several communications with folks to work out payment plans and otherwise resolve the accounts. Thank you.'",
        "'speaker_0': 'Good. Any further questions? And do we have any speakers on the speakers? We have no speakers. Okay. Excuse me. So we are being asked to consider. Approving collection of delinquent integrated waste management accounts via property tax bills. Do I have a motion to that effect?'",
        "'speaker_0': 'So I was moved by councilmember desire to have a second. Second seconded by Vice Mayor Knox White Voice Vote Please.'",
        "'speaker_1': 'Council Member Stations Knox White Yes. Vote yes. Vella Yes. Mayor, as the Ashcroft yes carries unanimously by five votes.'",
        "'speaker_0': 'Thank you. All right, then we are moving on to item six F.'"
    ],
    "Introduction of Ordinance Authorizing the City Manager to Execute a Fifteen-Year Lease with One Five-Year Option to Extend, Substantially in the Form of the Attached Lease, with Nautilus Data Technologies, Inc. for Building 530, an 82,251-Square Foot Building Located at 120 West Oriskany Avenue, Building 529, a 3,200-Square Foot Building, and Building 600, a 343-Square Foot Building, at Alameda Point.  [Requires Four Affirmative Votes] (Base Reuse 819099)": [
        "'speaker_1': 'Introduction of ordinance authorizing the city manager to execute a 15 year lease with one five year option to extend substantially in the form of the attached lease with Non-Listed Technologies for building 530 an eight 82,251 square foot building located at 120 West ORANSKY Avenue Building 529 a 3200 square foot building and Building 608 330 343 square foot'",
        "'speaker_1': 'building at Alameda Point. This requires four affirmative votes and we have 12 speakers.'",
        "'speaker_0': 'So just for clarification, we have that many speakers. Each one will have 2 minutes. And Kelly. Evening, Miss Mercado.'",
        "'speaker_11': 'Hi. Good evening. I'm Ninette Mercado from the Community Development Department. This is not our first time with Natalie's, but I'll walk us through it again. Natalie's is a data center that uses innovative water cooling technology that reduces the cost of computing, cuts power usage, eliminates water consumption, decreases air pollution and lowers greenhouse gas emissions.'",
        "'speaker_11': 'NOVELIS has been interested in developing a data storage facility at Alameda Point for approximately two years. Initially, they were interested in the barge water cooling system they're implementing in the Delta. But after touring Alameda Point and seeing Building 530 with its proximity to the water, lack of windows and privacy, they thought the building would be perfect for'",
        "'speaker_11': 'a land based facility. A proposed lease was presented to the Council on April 2nd and May 7th. The Council continued its consideration of the lease on May 7th until after a special meeting and tour of Site B Enterprise District.'",
        "'speaker_11': 'At this special meeting, council toured Building 530 and reviewed the footprint which was reduced to accommodate the future development of Site B. At the May 7th meeting, the Council requested that Naa and Nautilus agreed to eliminate a five year option from the lease required third party environmental monitoring weekly established standards for monitoring at a public meeting with'",
        "'speaker_11': 'regulators and city biologist allowing public comment. Then the standards for measuring the monitoring will be developed by scientists and regulators. They agreed to report monitoring results to the city and the city would have the ability to terminate the lease should the shared materially adverse environmental impacts be identified.'",
        "'speaker_11': 'Not a Nautilus estimate said its investment of $6 million and improvements to the building, which includes a new roof facade improvement, environmental asbestos, mold remediation, landscaping, security and parking upgrades. Nautilus will have a significant impact on the Alameda Municipal Power's rate.'",
        "'speaker_11': 'The Cartwright Station at Island Alameda Point has space capacity to accommodate much of the project demand from Nautilus, but ample require Nautilus to make a contribution to the expansion and future replacement of the facility if Nautilus exceeds a certain capacity.'",
        "'speaker_11': 'At the May 7th meeting, council expressed concern about AMP staff and capacity to service a large new power user. AMP has confirmed that current staffing levels are adequate to accommodate the project through construction initial ramp up and to which is 2 to 3 years and then full operation at full buildout.'",
        "'speaker_11': 'AMP estimates there will be 20 to 25 million annual revenue generated from the Northwest project. The increased revenue puts downward pressure on future rates and rate increases for all AMP customers. Nautilus has worked an agreement with Building and Construction Trades Council to hire union workers during construction, which is estimated to be five years at buildout.'",
        "'speaker_11': 'Nautilus will have 30 full time data center jobs. Staff has followed up on many of the council inquiries, including reaching out to East Bay Regional Park District Environmental Services Manager. Regarding the opinion, getting an opinion on the technology, we were told by the the services manager that the Regional Water Quality Board will be equally, if not better'",
        "'speaker_11': 'qualified to evaluate the projects and that whatever they would tell us would be just as good as what East Bay Regional Park District would say. Council has asked that there are other tenants who have to go through such rigorous lease conditions.'",
        "'speaker_11': 'Other green tech companies like Makani, Google or Mattel Energy. Neither of those companies had had to go through a regulatory review. Nortel is a research and manufacturing company. Their operations are fully contained within their building. Mcconney Google did their tests outside, but they have only interfered with the California.'",
        "'speaker_11': 'They would have only interfered with the California leased turn. So we did not allow them to test within the leased turn season. Subsequently, they moved their testing outside of the lease term buffer zone, so there was no impact to the environment.'",
        "'speaker_11': 'We have had tenants who were required to secure separate stormwater permits because of the nature of their work and they were required to provide monitoring reports to regional agencies. One tenant was sued by beekeepers for their for their dirty runoff.'",
        "'speaker_11': 'The tenant paid fines and was under a multiyear consent decree. We have a tenant who wants to test their technology in the Northwest Territories. They've performed all kinds of sound monitoring, reporting, which the city's biologists will bring to consultation with the U.S. Fish and Wildlife to see if that's the location, if the location works.'",
        "'speaker_11': 'Those are the only similar situations that we have to Nautilus. If not all this is approved and receives all its permits. They have agreed to come back to the City Council with a report out on on the conditions of approvals and requirements from regulatory agencies.'",
        "'speaker_11': 'So the city and the residents will know what would be required of their tenancy if the city council approves this lease tonight. It does not comment to the tenants occupancy approval tonight, approves the lease, but more importantly commences the 15 month due diligence period for the tenant.'",
        "'speaker_11': 'Nautilus must immediately begin its secure process through the city as well as secure permits through regional water quality Control Board Bccdc. U.S. Fish and Wildlife Services, California State Lands and a variety of other regulatory agencies. If the tenant is unable to secure a permit, the lease term terminates and the city retains the security deposit and collects an'",
        "'speaker_11': 'early termination fee of approximately $50,000. Tonight, we hope the Council will make a decision on the lease, approve the lease to start the environmental evaluation process so the city and the tenant can understand what will be required to implement and monitor this new technology or reject the lease, allowing the tenant to quickly identify another land location that'",
        "'speaker_11': 'could work for them after their focus on Alameda Point for several years. Thank you.'",
        "'speaker_0': 'Thank you. Ms.. Mercado, are there any questions of staff before we go to public comment?'",
        "'speaker_6': 'Councilmember Desai Yeah, just one clarifying question. I couldn't quite recall. You said AMP expects revenues from this project. Was that 2.5 million or 25 million.'",
        "'speaker_11': 'As 20 to 25 million at full buildout?'",
        "'speaker_6': 'And that's over X number of years.'",
        "'speaker_11': 'Yes, about six years. They expect to be at full buildout.'",
        "'speaker_6': 'So that's 20 to $25 million that would go to AMP's bottom line. Okay. All right. Thank you.'",
        "'speaker_0': 'QUESTION Councilmember Odie.'",
        "'speaker_3': 'Thank you, Madam Chair. So on that issue, I mean, have we evaluated if AMP will need additional headcount to manage that extra load? Because I believe that's pretty, isn't it, 40% of our current load. That's a number I heard batted around.'",
        "'speaker_11': 'I don't know how much it is of the current load.'",
        "'speaker_3': 'Okay.'",
        "'speaker_11': 'Sorry.'",
        "'speaker_3': 'Well, if it is 40%, I mean, is that your contention then that we would be able to manage that workload with our existing employees?'",
        "'speaker_11': 'So we check with AMP to see because it came up at the last meeting and they said that they would be able to ramp up over the 3 to 5 year period to handle the operations and maintenance.'",
        "'speaker_7': 'And I believe you're correct. I think I believe it is about 40%.'",
        "'speaker_3': 'Okay. So by ramp up, does that mean no headcount or additional headcount?'",
        "'speaker_11': 'I believe it's additional headcount. Okay.'",
        "'speaker_3': 'So then the reality is it's not 22, 25, because you'd have to deduct the cost of of of the employees. And we don't have an idea of what that number is.'",
        "'speaker_7': 'Yeah, it'd be 20, 25 million in revenue. But you're right, there would be increased expenses also.'",
        "'speaker_3': 'But we don't know what those are.'",
        "'speaker_7': 'I don't have that right. The top. Yes, there there would be increased expenses.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Any further clarifying questions? Councilmember Villa. I'm going to take that. I hear that. So no no questions. Okay. So with that, let's go to public speakers, please. And the council, the clerk will call three names in just a word.'",
        "'speaker_0': 'We'll get out of here earlier if you all hear your name and move toward the aisle. Thank you. Okay. Who's up.'",
        "'speaker_1': 'First? Jim Cornette and Mark Klein and Lisa Baker.'",
        "'speaker_3': 'Not American Council members. Good to see you again. We're really pleased to be here and really pleased to have so many now interested people from the environmental community. When I was in earlier my career, I had the great privilege of working with thousands of people to get the first federal mandate, phasing out incandescent light bulbs, cutting energy'",
        "'speaker_3': 'efficiency out of light bulbs by more than 70%. Our project is that big. I mean, the success of our project just from energy efficiency, will drive more than 70% improvement in data center performance. And if adopted widely, it can have as big an impact as incandescent bulbs.'",
        "'speaker_3': 'But I was also fortunate in my career to work on marine conservation issues. I was part of a large group of people to get unanimous legislation at the federal level to end overfishing in America. I had the privilege of working on the earliest programs to tackle marine debris in the marine environment.'",
        "'speaker_3': 'And I worked hard with many, many people and many from the environmental community to establish four of the largest marine protected areas in the world, inspiring 14 other nations to do the same heroic effort by thousands of people.'",
        "'speaker_3': 'And I just want to underline the environmental conservation benefits of what we are seeking to do here, not only to showcase now the media are that big and our commitment to protecting the environment to be sure that we'd have negative consequences of that strike.'",
        "'speaker_3': 'So the only thing we're asking today is the approval of a lease that's conditioned on us going through the gantlet of regulatory processes, including the biggest one led by the city itself on Sequa. We just want the fair chance to teach people about our technology and show that we will 100% comply with the law.'",
        "'speaker_3': 'There's only two outcomes of this process. Either we pass muster and we have no environmental impact or we don't pass muster and we have no environmental impact because our project will not proceed. And so all we're asking is just to get to the next step.'",
        "'speaker_3': 'We welcome the conversation with the environmental community. We welcome their engagement. We're going to be 100% transparent. We want to share the hearing.'",
        "'speaker_0': 'And the speaker is. Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Mark Klein, then Lisa Baker, then Lynne O'Connor.'",
        "'speaker_0': 'Okay, remember everyone, you've got 2 minutes.'",
        "'speaker_8': 'Okay. I'm with the Harvard SEAL Group.'",
        "'speaker_3': 'Originally, I was neutral on this lease.'",
        "'speaker_0': 'You get a little close to the microphone. We can all.'",
        "'speaker_3': 'Hear. We always neutral, but now I'm against it. The company has brushed off too many key questions by just by just saying wait to the permit process. Specifically, for instance, of course, I'm concerned about the Harvard SEAL flute.'",
        "'speaker_3': 'And we figured out that there's no room under the float for a five foot wide pipe. So I sent an email to Mr. Kirwan. How are you going to deal with this? The flute will crash against the pipe, and it'll be destroyed in rough weather.'",
        "'speaker_3': 'And he answered, Don't worry. We'll look into that later. Well, that's not good enough. What's going to happen on the. What? I'm trying to get my thoughts together. When I asked when I asked for that and that that question and I got a brave, vague answer.'",
        "'speaker_3': 'We'll look into it later. Well, that that worried me. I suspect that he didn't give me a specific answer of how to do with that, because the only way I can imagine they'll deal with it is is to dredge the whole area all the way to the rock wall, and that would destroy the entire habitat.'",
        "'speaker_3': 'And he didn't want to see that because it would be politically unpopular. So he just pushed me off with a well, look into it. Well, there's no way to fit a five foot wide pipe under that float without dredging, as far as I can see.'",
        "'speaker_3': 'And dredging would wreck the habitat. So that's why I'm against this.'",
        "'speaker_0': 'Thank you, Mr. Klein. Our next speaker.'",
        "'speaker_1': 'Lisa Baker, then Lynne O'Connor, then Jeffrey Byrne offered.'",
        "'speaker_0': 'Hello. Hello.'",
        "'speaker_4': 'So I'm Lisa Baker. I'm an Alameda resident, and I've been one of the harbor seal monitors for almost the past three years. And it's been a labor of love. A huge number of people involved with it was amazing to get it together, to have the float made for the SEALs and then to learn that this five foot'",
        "'speaker_4': 'wide pipe with warm water is that's coming out of a highly estimable environmental conscious group. It just I just don't see how that could be allowed to happen. I mean, if the Sierra Club, the Audubon Society and San Francisco Baykeeper all have serious concerns about this, and apparently the technology of this five foot wide pipe that will'",
        "'speaker_4': 'drain warm water out into the bay is actually mandated by the state of California to be phased out. So why is that technology being used for this project particularly? Is it supposed to be cutting edge and wonderfully environmentally sensitive?'",
        "'speaker_4': 'Obviously, I'm very concerned about the harbor seals, but my dad was an eminent marine biologist and he told me years ago about the effect of heat on marine organisms and how small differences of temperature in marine water can cause devastating effects to habitats.'",
        "'speaker_4': 'And so I don't want that to happen. I think I think building the facility might be fine, but find another way to get rid of your warm water.'",
        "'speaker_0': 'That's it. Thank you.'",
        "'speaker_1': 'Next speaker Lynne O'Connor, then Jeffrey Brentford, then Linda Kurland.'",
        "'speaker_4': 'Hello, Mayor and City Council. As a lifelong Bay Area resident and a 30 year old Alameda resident, I am extremely aware of how essential a healthy bay is to the livability and quality of life. To quote something that was said earlier that we enjoy in Alameda and throughout the Bay Area, I have memories of living next to'",
        "'speaker_4': 'a bay that was less healthy than it is now. And I'm aware of how very small changes can create large environmental consequences for the better or the worse. As a registered nurse, I am a bit of a science geek, so I was extremely concerned when I read the article in the paper about the notably static technologies use'",
        "'speaker_4': 'proposed use of cool bay water to cool their towers and then pushing out warmer water into the bay. I did a bit of research on this technology and discovered that it's already been banned by the state of California for use in cooling power plants, and the technology would cause warmer water than it's a norm for the bay'",
        "'speaker_4': 'to be discharged into a fairly placid section of the bay. Even water that is slightly warmer than the norm has potential to cause algae bloom, which decreases oxygen in her bay and can sometimes cause toxic algae blooms, which are toxic to aquatic life.'",
        "'speaker_4': 'Water that's been discharged at such a high rate, 10,000 gallons per minute will also cause a great deal of sediment. There's evidently a herring spawning ground near that area. I did some research on that. This was all in the last day or two.'",
        "'speaker_4': 'Herring spawning grounds do not move and they are very adversely affected by sediment. They don't live. Herring is essential to the ecology of our bay, sierra club baykeeper, etc. are against it. So am I.'",
        "'speaker_0': 'Good job the next speaker and we don't applaud because it'll just get us out of here later.'",
        "'speaker_1': 'So yeah. Jeffrey Bernard Ford, then Linda Colony and then Burkett Evans.'",
        "'speaker_3': 'Good evening, everyone. $25 million gross charges of electricity. That's a really big toaster that they're running over there. Heat. Heat is amazing. And people these people have to dissipate enormous amounts of heat. So they're using they're using the electricity to create data.'",
        "'speaker_3': 'And who are they, by the way? What is Nautilus data? Titan Technologies? What organizations are they affiliated with? Who? What and how will it benefit the Bay Area? Rent will be collected by the city, so there is some money in the coffers for the city.'",
        "'speaker_3': 'And aluminum usable power will also get a fairly large chunk of money out of these guys if they're allowed to do this. The companies that were developing the hotel projects on Bay Farm Island and Park Street in particular were really scrutinized and they were put through a number of ringers in their process for acceptance.'",
        "'speaker_3': 'I'm hoping that this project will get similar scrutiny, or much more so because of the just the very much unknown. You know, this project is it's unknown. And Lynn was just talking about them not being this technology being, you know, phased out.'",
        "'speaker_3': 'I think they should build a 5 million square foot barge, take it out in the middle of the ocean and let the ocean dissipate the heat. I think the Bay Area, the bay itself is much too sensitive an environment to allow these people to heat up.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Linda Colony, Denberg Evans and Jill Sexy.'",
        "'speaker_4': 'Hi. I'm speaking tonight as a concerned Alameda resident, but also as the president of the board of Golden Gate, Audubon Society, and co-chair of its local conservation committee, which is the Friends of the Alameda Wildlife Reserve. We urge the Council to vote against the proposals to Nautilus.'",
        "'speaker_4': 'The proposed cooling system will cause water turbulence at the point of discharge will tend to trap aquatic life at the intake point and will discharge water into the bay. The temperature warmer than when it is drawn in this part of the bay and which will occur is critical environment for the SEALs, as you've heard for our least'",
        "'speaker_4': 'terns, who fish in that part of the bay for brown pelicans, which there's a huge roost on Breakwater Island just past where this discharge would be. They also need to fish and water. Warmer water temperature is known to adversely impact fish at certain stages, certain species, particularly vulnerable parts of their lifecycle.'",
        "'speaker_4': 'In addition, warm water cause holds less dissolved oxygen than cooler water, and dissolved oxygen is a critical component of a healthy bay. So if we reduce fish, we're going to reduce the food available for the pelicans, the terns and lots of other birds that eat our fish.'",
        "'speaker_4': 'So the bay is an important part of what makes Alameda special. We've worked very hard to protect the environment as the council has, and the city as a whole has worked really hard to protect the environment. We can't afford the risks that are posed by this project.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Speakers. You're all doing extremely well.'",
        "'speaker_1': 'Evans then Jill Sachs and Marjorie Powell.'",
        "'speaker_4': 'Mayor and city council. I want to speak in opposition to the 15 year lease with Nautilus Data Technologies. Our bay is a delicate ecosystem already badly impacted by human activities. The proposed project would pull 14.4 million gallons of water per day from the bay.'",
        "'speaker_4': 'That 5,256,000,000 gallons per year from the bay hit it and discharge it into another part of the bay. Even with the best possible fish screens, Nautilus will be pulling in countless aquatic organisms every day, hitting and probably killing them.'",
        "'speaker_4': 'It will then dump the heated water into the bay, changing the overall temperature of the bay and without doubt affecting the natural processes in a complex ecosystem. In the past, communities across America have allowed corporations to come in, exploit natural resources and extract profit.'",
        "'speaker_4': 'Those companies often closed down after doing incalculable environmental harm, leaving taxpayers to pick up the tab. You have only to look at countless mining towns that have been left with toxic tailing ponds. And when one of those ponds fails, destroying life and rivers for miles around, we ask ourselves, How did this happen?'",
        "'speaker_4': 'This is how that happened. Please deny this lease.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Next speaker Jill suggested that Marjorie Powell, then Richard Baker.'",
        "'speaker_4': 'Hi, Madam Mayor. And council members. First of all, I want to thank you, Mayor, for supporting electric vehicles. Keep on doing that. And also, I hope all of you will support the Climate Action Resiliency Plan when it comes before you.'",
        "'speaker_4': 'On that note, I'm baffled as to why we didn't hear much about the Nautilus Data Technologies project before it became publicized in the paper. I think it's not appropriate for Alameda unless it completely revamped its cooling systems and its energy usage.'",
        "'speaker_4': 'They proposed dumping 10,000 gallons of warm water per minute. Unbelievable in sensitive wildlife areas, raising the water temperature in those areas for up to four degrees. This is where, as other speakers have said, spill seals, hollow out fish spawn and lease terns who are endangers feed.'",
        "'speaker_4': 'Even even switching the discharge to the estuary side would still impact wildlife. This is in addition to the vast amount of energy needed to run this facility and its impacts on. Where is AMP going to get this extra energy?'",
        "'speaker_4': 'Not to mention the higher costs related to that. So I just urge you not to approve this lease. Thank you.'",
        "'speaker_0': 'Thank you. Next, speaker.'",
        "'speaker_1': 'Marjorie Powell, then Richard Bangert, then Pat Lamborn.'",
        "'speaker_4': 'Thank you. Members of the city council. I'm an Alameda resident and I'm also a member of Golden Gate Audubon and the committee that is working on conservation and protection of the least tern reserve. As you've heard, there are concerns about both water intake and expulsion of heated water into areas.'",
        "'speaker_0': 'That have.'",
        "'speaker_4': 'Fish that are needed not only by the list terns and the harbor seals, but by the great blue heron and the osprey, that nest around Seaplane Lagoon by the black oystercatchers that nest and raise their young on both sides of Alameda and the estuary and in Ballina Bay by the Caspian Terns that are now nesting at the'",
        "'speaker_4': 'Alameda Reserve by any number of other birds that nest in.'",
        "'speaker_0': 'The area, in particular.'",
        "'speaker_4': 'The least terns because they are so small and their chicks are so small, they need the very small fish that are most sensitive to the temperature concerns with the water. And while we heard from the first speaker that this is innovative technology, we at this point have no information about the technology except that according to some documents'",
        "'speaker_4': 'I've seen, it's an old once true calling system, and that is going to raise the temperature in the bay that will have harmful impacts on the fish that all of our birds need. There have been examples around the world, in particular this year, of bird colonies having abandoning their young because there are no fish because of increases'",
        "'speaker_4': 'in the water temperature. And this has happened in South Africa with the flamingos. It's been happening with the pelicans. I'm sorry, the Galapagos. Penguins in the Galapagos and.'",
        "'speaker_0': 'We urge you not to approve. Thank you, Mr. Bangert. And Express.'",
        "'speaker_1': 'And then Pat Lamborn. And then Mary Spicer.'",
        "'speaker_8': 'Thank you, Mayor. Members of the council, I'd like to speak just briefly about the permitting process and your role in in this approving or not approving this project. Yes, there's a there's a rigorous permitting process that would take place if you were to move forward tonight.'",
        "'speaker_8': 'But the fact that there's a rigorous permitting process does not mean that there will be no impacts. The threshold for getting a permit is not zero impact. Quite frequently, there are mitigation measures that are required as as a condition of a permit.'",
        "'speaker_8': 'Sometimes it's simply paying money into a fund that will later be used for some other worthy project, restoration project around the bay. And given the size of the bay, what are what are the chances that that money will end up back here in Alameda?'",
        "'speaker_8': 'So you could say that one scenario here is that that you go forward with this project and you're trading away part of our environment for short term economic gain here. I'd say that besides besides the regulatory process, there's your role.'",
        "'speaker_8': 'Regulators are the ones who work in the permitting section of various agencies are there to issue permits. But you were elected to manage our public property here on Alameda, and it's your decision as to how we use that property and whether it's proper to have this system with its impacts be authorized here in Alameda.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Ms.. Lambert.'",
        "'speaker_4': 'Good evening. So many speakers have mentioned my points. I'll get to to the asks in reading through the beekeeper and everything that people have said. I have three asks of you tonight. One ask is that you did not sign the lease with Nautilus.'",
        "'speaker_4': 'It means that you're giving your stamp of approval to the once through cooling system using the bay. That that is what that signifies to all the regulatory agencies that were mentioned, too. If you wanted to delay a vote and consider Nautilus or any other data center there, there are other cooling systems.'",
        "'speaker_4': 'I shared with all of you an article. It's how do we use waste heat from data centers intelligently, the closed systems and people around the world are figuring out ways to take the waste heat and then use it as renewable energy for homes and businesses.'",
        "'speaker_4': 'Notley's come back and give you a truly green alternative. Dumping warm water into the bay isn't one of those. Number three, you can convene a study session with scientists, and I want to just share my concern with you.'",
        "'speaker_4': 'Mr. Cunnington is the CEO of Nautilus. He's not a marine biologist. He's not an and he's not a engineer or a marine engineer. He's a CEO. He's a masterful lobbyist. You say yes tonight. He has access to all of those bureaucracies.'",
        "'speaker_4': 'He has a long reputation, folks. He was a corporate lawyer for all the major polluters in the nineties who had Superfund sites that earned him a seat as the chair on the Council on Environmental Quality for George Bush and Dick Cheney.'",
        "'speaker_4': 'We don't have time to talk about their impact on climate change in 24 minutes, but they manipulate science. So I'm going to leave with you in the last 19 seconds, an article that I got. It's from a true scientist.'",
        "'speaker_4': 'It describes all the current science about the concern for algae blooms in the bay. It is the opposite of the memo that was submitted to you by the kind of experts who hire, which said there was no danger at all.'",
        "'speaker_0': 'Thank you, Ms.. Lambert. And if you present that material to the clerk, they will give it to us and our next speaker. Hi.'",
        "'speaker_1': 'Yes, I love speakers.'",
        "'speaker_4': 'Mary Spicer. Hi, I'm Mary Spicer. Nice to see you all in person. I sent you a letter today. I'm a recreational athlete and I spend probably 10 to 12 hours a week on the water. I'm on an outrigger team and we leave from in a small beach.'",
        "'speaker_4': 'Go out, paddle out the bushes out in the center of the bay, come back through the hole. Exactly. The area where we're talking about building that technology. I spend so much time out there with the harbor seals recently, with the whale, with the two dolphins, two to 1 to 5 dolphins that live on the other side of'",
        "'speaker_4': 'the wall. There's art in me and the Golden Gate Cetacean Institute has been researching them for years, using the outrigger team to give them data points on what's happening with the pod that's living out there. If you need more information on that, I'm happy to send that to you.'",
        "'speaker_4': 'But it's directly in the area that will be impacted by this this technology. I think that is our media citizen. And as comedians, we have a real responsibility to the nature and to the water and to the shoreline and to the wildlife that inhabit our area.'",
        "'speaker_4': 'And I think that there's so much amazing, true, innovative technology in the Bay Area. And I would love to see Alameda really targeting new technology that really is innovative and really does actually help with what's happening with climate change and with the global issue issues that we're having.'",
        "'speaker_4': 'I think if we came up with the type of plan that we can actually find those right type of companies and invite them here and create a hub for true innovation, that would be amazing. My father owned a company in Oakland that was a that helped retrofit energy savings for industrial light fixtures that PGE ended up giving'",
        "'speaker_4': 'a discount for because it was such a great invention. I would love to see people like that coming in here and taking over the base. And I. I also do cleanups with the city of Oakland.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Okay. Nevertheless, speaker. Okay. At this time I am closing public speaking and the public comment period and I am going to take the unusual step of going first in my comments. So please indulge me. Counsel, I can't support this project and I'll tell you why.'",
        "'speaker_0': 'We have met with Mr. Connaughton and his team for quite a few months now, even going back to last year. And we have met in closed session because when an item involves a lease or sale of property in price in terms of the transit.'",
        "'speaker_0': 'Action that is rightfully held in an closed session. We don't do our negotiating in public. But without disclosing specifics, this council has certainly and the council before this, too, had heard this has certainly had a lot of questions that they asked of the Nautilus team.'",
        "'speaker_0': 'And I am largely persuaded by the letter we got from Baykeeper a couple of weeks ago. And I also think all of the members of the public who wrote me letters, but I was what I paid attention to most in the Baykeeper letter was that the this went through cooling, which is a system, is an antiquated technological'",
        "'speaker_0': 'approach. And the system proposed here could harm San Francisco Bay in a number in a variety of ways. And in fact, these negative environmental impacts have led the state of California to phase out the use of this ecologically detrimental cooling process by 2024.'",
        "'speaker_0': 'And the Baykeeper report goes on to talk about the large volume of water that will be processed in in a minute. And they and they they cited some studies, some recent studies from 2019, from 2018 about how waste, heat innovators, things like energy hogs, can the world's huge datacenters be made more efficient?'",
        "'speaker_0': 'But this is not the way to do it. And then there is that information, science based information from Bay Keepers. And on the other hand, just this week, maybe yesterday, we received from Nautilus a report from Anchor QCA, which is their environmental engineering group that is based in San Francisco.'",
        "'speaker_0': 'And they, you know, pointed out that, you know, not us would need to get all these environmental approvals and permits. But what I haven't seen from Nautilus in all the months that I've been dealing with this, this outfit is any change in the approach.'",
        "'speaker_0': 'And so even the Anchor QCA report that seeks to assure us about what Nautilus wants to do says that, you know, San Francisco Bay is still relatively turbid and historically considered a light limited estuary where growth of algae is hindered because of high turbidity in the water.'",
        "'speaker_0': 'And the U.S. Geological Survey researchers studying first harmful algae bloom in the bay stated that the bloom occurred in the South Bay quotes during a coincidence of unusually weak neap tides. But if you look at the footnote, the studies were both dated 2005.'",
        "'speaker_0': 'It's 2019 now. And I would submit that climate science has changed a great deal in the intervening years. And but the fact that that was the most relevant data report that could be submitted, I think speaks volumes in itself.'",
        "'speaker_0': 'I also listened carefully to Mr. Norton in his report remarks, because I'm always willing to give a person the benefit of the doubt. But when you spoke to us this evening, you talked about past projects working on phasing out incandescent light bulbs, previously working on marine environmental issues, inspiring 14 other nations to do the same.'",
        "'speaker_0': 'And that's certainly laudable. But what I care about and what I'm responsible for is what happens in my city. Money isn't everything. I mean, as much as I hate to say no to millions and millions of dollars. I also very much agree with the last speaker, Miss Spicer, who said there's so much true innovative technology in the'",
        "'speaker_0': 'Bay Area. Find it, bring it here. And I think that's also been a desire of this council with the loss of the Navy and those 18,000 jobs. We've looked to backfill those lost jobs, but not just any jobs.'",
        "'speaker_0': 'And Nautilus in particular wasn't going to create a lot of jobs and certainly not a lot of high quality jobs on its own. Certainly it had benefits. I'm not saying this is all one sided, but I am saying that on balance, I cannot find sufficient reason to support moving forward.'",
        "'speaker_0': 'And I think that at the end of the day, that's actually more considerate of both the Nautilus and the city. So and again, I'm one vote but if the majority of the council. Feels that way as well. It leaves Nautilus to go on and look for other areas to locate.'",
        "'speaker_0': 'And I will just add that there is talk in the staff report about the project that is being done by Nautilus in Stockton out of a barge in the river. There's a little difference there, a barge in the river.'",
        "'speaker_0': 'It's also a five year lease. The one we're considering is much longer. And finally, I'm just going to close and say that I was really taken by the saga of Ali, you know, the the whale who found her way into Seaplane Lagoon.'",
        "'speaker_0': 'And I think she was a it was a she bet. But it was noted that her her color, her sheen wasn't what it should be. She was malnourished. There's a number of reasons that could be, but a large factor has to do with the quality of the waters and what's happening to is and much of it manmade'",
        "'speaker_0': '. And so I cannot in good conscience support moving forward with something and taking time and effort to go through the environmental process. When nothing I've seen to this point makes me think that Nautilus is aligned with my values for what I want to see around me to point.'",
        "'speaker_0': 'So with that, I will call on the next speaker. Councilmember Odie.'",
        "'speaker_4': 'Can I speak?'",
        "'speaker_0': 'Should we let Councilmember Vella go? Yeah, she's she doesn't get to wave her hand at me. So, yes. Councilmember Vella, you're next.'",
        "'speaker_5': 'So I think that we we've spent a lot of time and all of that, spent a lot of time looking at this project and looking at the cultural uses in this building and also this area. Um, you know, I had reservations before regarding the total number of jobs created by whether an office of the refuge for this'",
        "'speaker_5': 'building and also environmental concerns relative to the marine wildlife and to the nearby sanctuary. And I do think members of the public that have come up to speak on this, as well as the various groups that have come and said that, I think that for many of the reasons that the mayor stated and the other ones that'",
        "'speaker_5': 'I just stated regarding the earlier to the area, I urge you to count on support of the project. And I think that at this point, you know, especially in light of the fact that we have gone over to this area, that I want out that equal opportunity and to me to see the harbor seals, I think that'",
        "'speaker_5': ', you know, in many ways we look at projects, even if we were to take the applicant at their word, that this is environmentally better than, you know, air cooling, these impacts to our marine, local marine life and to the overall bay, I don't think make it worth it.'",
        "'speaker_5': 'And so I won't be voting in support of this project.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Avella Councilmember Odie.'",
        "'speaker_3': 'Okay, well, thank you, Madam Mayor. I also want to thank everyone for coming out. This has been on the agenda a few times and you know, we haven't had a lot of people come out. So I think it's true testament to our council that we listen to the public when they come out and they present arguments to'",
        "'speaker_3': 'us. So I'll try to get through this with not too much emotion, even though I think to me this is an emotional issue. I mean, it's rare that we see all of these groups together aligned. And I think the mayor alluded to a lot of what I'm going to say, and I think a lot of the speakers'",
        "'speaker_3': 'did. But it bears repeating, you know, the Sierra Club, the San Francisco Baykeeper, the Golden Gate, Audubon Society and the Harbor SEAL Group who originally was neutral. And another person who sent in an email, a person who's actually their main focus when they sat on this dais, was the creation of jobs at Alameda Point.'",
        "'speaker_3': 'And that's my former colleague, Frank Madras. He opposed it and said it's not going to bring the jobs to Alameda Point that he thought it should. So, I mean, those are five very respective names in in my book.'",
        "'speaker_3': 'So I respect a lot of what they have to say. I look at the I think one of the speakers might have been Pat or Marjorie said, you know, the bay is a fragile ecosystem. Right? So that's something we have to we have to be cognizant of.'",
        "'speaker_3': 'I mean, that is one of our city council key priorities supporting enhanced living. Stability, livability and quality of life. So if we're going to stay true to that priority, then I think we have to protect our wildlife. And I, I think protecting it means that we don't open up that fragile ecosystem to a laboratory experiment on whether'",
        "'speaker_3': 'this this technology is going to work and or whether it's going to harm the environment. So, I mean, to me, the best way to avoid adverse environmental impacts is to reject this lease altogether. So I had that opinion last time we had this discussion.'",
        "'speaker_3': 'My opinion has solidified hearing the public comments and reading the experts. And I think, you know, just real brief, some of you all have touched on it, but, you know, the lease turns. We spent a lot of energy and a lot of time and it's our value to protect them.'",
        "'speaker_3': 'You know, the spawning grounds, if they're gone, they're gone. And every other ecosystem and species that relies on them will be gone. The SEALs and I was in San Diego last week and we went to lunch one afternoon in La Hoya, and we walked down to the beach because we had an hour to kill.'",
        "'speaker_3': 'And I saw the I don't know if you've been there, but there's a bunch of seals there on the rocks on the beach. And I thought to myself, isn't it great that these seals don't have to worry about a five foot pipe being stuck underneath their habitat?'",
        "'speaker_3': 'Like like we're having to deal with here in Alameda. But it sounds like there's not the votes to go forward. So I'm grateful for that. The toxic algae, again, you know, once it's there, it's too late. You know, I don't think we can afford to be an experiment and I'd prefer to avoid that adverse impact.'",
        "'speaker_3': 'And lastly, no one's really touched on it, but, you know, the impact of a five foot hole on on the sea wall, I think I mean, you mentioned that to me on the phone either yesterday or today, and no one's really talked about that.'",
        "'speaker_3': 'So this is just too risky for me. I'm also not convinced that it's best in our economic interest. That's our fourth priority, encouraging economic development. I think by tying up an old building in the middle of site B I think actually diminishes the value.'",
        "'speaker_3': 'And I think our citizens and our residents will suffer long term by not maximizing the value of site B. And I also I'm not sure of the total impact on EMP because while we have a revenue number, we don't have a corresponding expense number.'",
        "'speaker_3': 'And to me, if you're going to increase load 40%, that's 40% more than we're doing today. I don't know how you do it with without increasing your headcount tremendously and no one's accounted for that. So I appreciate everybody's time and effort and letters and on this and I thank you all for speaking and protecting people that can't'",
        "'speaker_3': 'do things that can't speak for themselves in seals and fish and and so on. Thank you.'",
        "'speaker_0': 'Thank you. Who's Councilmember de SAC?'",
        "'speaker_6': 'Well, great. Well, thank you very much. I am of the opinion that the regional and state regulations that are in place are strong enough to make make sure that this project does right by the environment. But it's not to the to the regional state organizations that I am accountable.'",
        "'speaker_6': 'I am accountable to the residents of Alameda. And in this case, I mean, it was overwhelmingly a lot of people were opposed to it. I didn't get one email, frankly, from an Alameda residents indicating that they are supportive of this.'",
        "'speaker_6': 'I don't think that the project proponent did their own cause any good either, because, frankly, the message really hasn't changed over the over them. Over the past several months. I was hoping to see better examples of why this is good for Alameda or maybe even YouTube videos or something indicating how it is indeed could be safe for'",
        "'speaker_6': 'the environment. But you know, all we we we didn't really get that kind of information. So, you know, absent a case made by the proponent myself, I think I think the the. Words of caution that the residents are encouraging of us is something that we need to listen to.'",
        "'speaker_6': 'And in terms of the benefits to AMP, $25 million is a lot of money. But I think one way to think about it is that the load that is the the Marriott the Marriott ships may already constitutes roughly 10 to 11% of our electric load.'",
        "'speaker_6': 'And in order to get that to accommodate that 10 to 11% electric load, I believe it was back in 1988 that the city of Alameda had expanded our infrastructure in order to accommodate 10 to 11%. I kind of wonder I don't think the issue really is manpower.'",
        "'speaker_6': 'I think that the issue would be accommodate having the infrastructure to accommodate an additional 40%. But the story about the accommodating the Navy was that in 1988, 1987, the Navy asked Alameda to accommodate them by improving the load capabilities to to handle what were at the time, you know, naval warships.'",
        "'speaker_6': 'But we all know what had happened was that the at the Navy left and we we still had to pay off the bonds for those for the infrastructure to accommodate. Fortunately married came in in that and married is helping pay for that.'",
        "'speaker_6': 'But imagine if we had gone into debt in order to to accommodate the 40% increased load and then suddenly, for whatever reason, they weren't here, we'd be up creek. So so that was you know, that's certainly an issue, too, to think about.'",
        "'speaker_6': 'I still am confident, frankly speaking, that that the regional state entities would have provided us guidance as to whether or not this this project would have been environmentally sound. And so I'm not going to change on that. But I do believe that the residents have clearly spoken that this is not a project that they that they want'",
        "'speaker_6': 'to see happen here.'",
        "'speaker_0': 'Thank you. And vice mayor. Next, what.'",
        "'speaker_2': 'I will just more or less echo what would I've heard earlier today or earlier in the in the meeting? I think I've told almost everybody who emailed me and including the project manager or project applicant today that I did not expect to vote to approve the project, the lease this this evening.'",
        "'speaker_2': 'And I'm going to just. Call for the vote. At this point, I don't think I need to add on to anything anybody out of June thinks.'",
        "'speaker_0': 'I appreciate that. And so what we have is an ordinance, uh, authorizing city manager to execute this lease. So let's have a.'",
        "'speaker_2': 'A move approved, a move rejection of the staff recommendation to approve this.'",
        "'speaker_3': 'Lease. Okay.'",
        "'speaker_0': 'Second. Okay. It's a move by the vice mayor, seconded by Councilmember Odie. May we have a voice vote, please?'",
        "'speaker_1': 'Councilmember decide.'",
        "'speaker_6': 'Yes on the motion.'",
        "'speaker_1': 'Not slate.'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Vote yes on the motion, Vela.'",
        "'speaker_5': 'Some emotion.'",
        "'speaker_1': 'May be.'",
        "'speaker_0': 'Ashraf also. Yes, on the motion.'",
        "'speaker_1': 'That carries five, five eyes as well, you know.'",
        "'speaker_0': 'All right. Thank you very much. This project will not go forward. Okay, we are. Thank you, everyone, for coming out. We now move to item seven City Manager Communications.'"
    ],
    "Consideration of Mayors Nominations for Appointment to the Planning Board, Public Art Commission, Public Utilities Board, Recreation and Parks Commission, and Social Service Human Relations Board.": [
        "'speaker_0': 'Avenue Complete Streets. And I'm really excited about the Seaplane Lagoon Ferry Terminal that was the probably the largest Alameda recipient with $8.2 million coming from these various funds, which tend to be county and state funds. So that's going to help that third ferry terminal in Alameda.'",
        "'speaker_0': 'So with that, then I'm going to go right into item ten a, I have been busy. My assistant Michelle Cook tells me that since I last saw you two weeks ago, I have interviewed 34 candidates for various boards and commissions and I'm really excited.'",
        "'speaker_0': 'We've had such interest this year and we've just got great, smart and our residents. It's been tough to make choices, but here are my nominations, which then council will vote on in two weeks or at the next council member meeting on July 2nd.'",
        "'speaker_0': 'So for the planning board there are two seats available and I am nominating Hansen Hamm. Mr. Hamm is a former planning director, himself a former community development director. Deep experience in policy planning, land use plans, affordable housing programs, urban design, environmental review and a longtime Alameda resident.'",
        "'speaker_0': 'Teresa Ruiz is my second nominee. Missouri's is an architect with a San Francisco firm, and she's also active in the Urban Land Institute. And in fact, she works with high school students in a number of Bay Area high schools in their government classes, having them actually set up a mock planning board.'",
        "'speaker_0': 'And they have a project that they undertake to, you know, deliberate on and vote on. And she puts in a lot of real life issues and she's very impressive in her own right. She's a native of Taiwan who came to this country to start high school when she was in high school, started high school at Fremont High'",
        "'speaker_0': ', and she said she didn't know English. When she started high school at Fremont, she knew Spanish because her family on route from Taiwan spent a couple of years in Costa Rica. But that said, she graduated in four years and went to UC Berkeley and then got her architectural degree.'",
        "'speaker_0': 'And and she's a mother with young kids, but she wants to give back. And so I I'm very happy to appoint both of them for the planning board, the Public Art Commission. We are still doing interviews for applicants.'",
        "'speaker_0': 'I just can't get through all of them at once. Public Utilities Board. I am reappointing the incumbent, Laura Jean Tierney. She has great and deep financial expertize background, which is very useful for that board. The Recreation and Parks Commission has two openings right now.'",
        "'speaker_0': 'I have one. I'm nominating Tara Navarro. Ms.. Navarro is a tennis player. She's a mother of two young children. She makes a point to visit all the parks. And she's been involved in the Jackson Park proposals and has, you know, attends recreation parks commission meetings.'",
        "'speaker_0': 'We think she brings a lot to that commission. And I'm still interviewing nominees. So we'll we'll get that second seat filled probably by the next or nominating. By the next council meeting on the Social Service Human Relations Board, we have one opening.'",
        "'speaker_0': 'I am nominating Christian Fruit Fong. She is a long time reading specialist at Ruby Bridges School. She's also a third generation Alameda. And although she was born in Topaz, Utah, because her parents were interned there during World War Two.'",
        "'speaker_0': 'And in fact, just last week, Christian and 45 others, her family members and some others, were taking a trip to Topaz. And her parents were going. And she said her mother had actually designed for everyone. She did research and she designed they all would have the tags because, you know, all the families were numbered and they were'",
        "'speaker_0': 'these tags. But I said, would you please take pictures and write an article for the local newspapers? So I hope she did that. Anyway, those are my nominees. You all can look up there. You have the applications and their resume or their.'",
        "'speaker_0': 'Yeah. Resume is if they attach them. And so with that, I am going to adjourn this city council meeting. Thanks, everyone. Really good work tonight. Goodnight. See you July 2nd.'"
    ]
}