{
    "Recommendation to Adopt Plans and Specifications and Authorize a Call for Bids for the City of Alameda Park Street Pedestrian Safety Improvements, No. P.W. 06-13-18. (Public Works 310)": [
        "'speaker_0': 'You have one speaker on this. Audre Lorde Housman. Item five F. I'm sorry. He's coming. All right. Okay. Wonderful.'",
        "'speaker_4': 'Is there just the once?'",
        "'speaker_2': 'Mm hmm. Okay.'",
        "'speaker_0': 'Hi. Good evening, Mayor and Council Staff. I am delighted you didn't pull it. And this is a redesign for safety measures at Park and Lincoln and Tilden. And I just want to support that type of safe redesign. That's a huge intersection as a pedestrian.'",
        "'speaker_0': 'It's very scary and unsafe on many, many levels. And I thank you on behalf of anyone who tries to cross that intersection and certainly others in the city that are that big. I like.'",
        "'speaker_7': 'To proceed and look at improving those as well.'",
        "'speaker_0': 'So thank you very much. You. Rob Trudeau.'",
        "'speaker_6': 'I smile, would you please? Rob Browder Executive Director, Park Street Business Association. Actually, I wasn't going to speak, but seeing that it got pulled, I think I should because it does significantly impact a very important intersection of our district, and we are completely in favor of this.'",
        "'speaker_6': 'We have been working with public works staff for.'",
        "'speaker_2': 'Months and months to come up with this plan that is.'",
        "'speaker_6': 'Going to improve pedestrian safety at that intersection where pedestrian safety needs to be improved. So we certainly hope that you will all vote in favor of it. And thank you very much.'",
        "'speaker_4': 'Madame Mayor, I would move approval. Oh, I'm sorry. Was it discussions? It's just going to move approval.'",
        "'speaker_5': 'In a second. Okay.'",
        "'speaker_0': 'Others in favor.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'I mean, if the motion passes unanimously. Thank you. So now we go to. Six M.'"
    ],
    "Introduction of Ordinance Approving and Authorizing the City Manager to Execute Documents Necessary to Implement the Terms of the Lease with Wrightspeed, Inc., a Delaware Corporation for a Lease for Seven Years with Two Five-Year Options and an Opportunity to Purchase Building 41 Located at 650 West Tower Avenue at Alameda Point. (Base Reuse 819099)": [
        "'speaker_1': '6 p.m. introduction of ordinance approving and authorizing the city manager to execute documents necessary to implement the terms of the lease with right speed. A Delaware corporation for the lease of or a lease for seven years for two five year options and an opportunity to purchase building 41 located at 650 West Tower Avenue, Alameda Point.'",
        "'speaker_0': 'Good evening, Mayor and Councilmembers. I'm Nanette Mchunu and the Community Development Department. Tonight, you'll be considering a lease for seven years with two five year options and an opportunity to purchase for Building 41, located at 650 West Tower.'",
        "'speaker_0': 'Before we get into the details of the lease, I'd like to tell you a bit about the leasing program at Alameda Point. Just a little brief overview. We've been doing leasing in Alameda Point since 1997 under the large parcel lease, and now we own a significant portion of the property.'",
        "'speaker_0': 'And there are still some pieces that are under what we call the life arc, which is the lease in furtherance of convenient. In the early years of the of our leasing program, we generated about one and a half million dollars.'",
        "'speaker_0': 'That revenue fund has grown to approximately $12 million today. That's the projected revenue. We have approximately 66 commercial tenants. I'm going to show you a little bit just for your visual of the leased spaces, the negotiations, the things that are under negotiation right now and the available spaces.'",
        "'speaker_0': 'This is this gives you kind of a taste of who what's out there and how much of the property is occupied. And then finally, I just wanted to tell you that we have a 66 commercial tenants with approximately.'",
        "'speaker_1': '002.'",
        "'speaker_0': 'Goodby with approximately 1000 employee employees. And I wanted to just show you some of the logos from the tenants that are out there, and they run from small one office one day games to Google Waterfront users from Ocala, Connie out outrigger canoe to the Department of Transportation and Maritime Administration Ready Reserve Fleet.'",
        "'speaker_0': 'We've created a significant and diverse tenant mix and hope to add right speed to to that list. Tonight, I want to tell you that we're I'm really excited to bring right speak to you tonight. They found Alameda point by way of conversations with an existing tenant mechanic mechanic power who is now Google developing cluster industry and is'",
        "'speaker_0': 'a key component of the city's asset management strategy, which was developed in 2010, developed and approved in 2010, and that seeks to build on the foundation of existing businesses and create complementary industry and synergy. Job creation is one of the overarching goals of the asset management plan.'",
        "'speaker_0': 'Right. Speed will be taking over a building that's been vacant since the base was closed back in the late 1990s. Building 41 was originally part of the Alameda Naval Air Museum's portfolio, but the then art governing body decided that it was a very desirable building, very leasable building, and we took it out of that portfolio and it'",
        "'speaker_0': 'has sat vacant until hopefully to it tonight when you make a decision to put right speed in there. Because of the significant investment needed to be put in that building, it's pretty much that vacant. But tonight, Ian Wright, who is a principal who will be making a brief presentation for you tonight, will talk to you about the'",
        "'speaker_0': 'investment that they plan on putting in the building, which is more than $2 million. They say they expect to bring at least 150 new jobs to Alameda Point. And I'm going to turn this over to Ian so he can tell you more specifically about himself, his product and what he hopes.'",
        "'speaker_0': 'Right. Speaking out for the city of Alameda.'",
        "'speaker_2': 'Good evening and welcome to the New City Council. I'm Ian Wright, founder and CEO of Wright Speed. I'm actually a New Zealander and I was out on the bay watching the America's Cup, sadly. But I made my home in Woodside, California, 21 years ago.'",
        "'speaker_2': 'I'm an engineer and a serial entrepreneur. The last company that I co-founded was Tesla motors, which has turned out pretty well for investors and employees and customers. And they've made their home in Fremont. Right. Speed is located in San Jose in the heart of Silicon Valley.'",
        "'speaker_2': 'It's a location that some of my employees describe as soul sucking. I actually own two houses in Alameda and I want to move the company here. I signed a lease to that effect and then they'd asked me to explain a little bit about why we want to move to Alameda.'",
        "'speaker_2': 'And I guess the first reason is that that I love Alameda. I think it's a fantastic city. And I think my people will as well, the employees I have and the employees that I'm going to hire. It's just a wonderful city.'",
        "'speaker_2': 'We are 23 people today and we're planning to grow to 300, roughly 300 people, 2018, 303 50 people. Right now, we're recruiting as fast as we can, and we're finding that it's difficult to attract people from this area to San Jose.'",
        "'speaker_2': 'They don't want to drive down at 80. I'd rather come here. I already have three employees that live in this area. This UC Berkeley. Locally, there's a lot of people around here, even people in the city. You go out to 880.'",
        "'speaker_2': 'The science is 11 minutes to downtown S.F.. Yeah. So that's one reason recruiting people, I think, will be the people that we want will be easier here. Then there's Building 41. It's an iconic building. It's we think it's lovely.'",
        "'speaker_2': 'We'd love to preserve it the way it is. Use it the way it was designed to be used. We have an unusual requirement. We have a lot of engineers. We have a lot of office staff that work in nice offices with workstations and of the way you can close and a whiteboard.'",
        "'speaker_2': 'Lovely stuff. Then we have a workshop where we bring in big trucks and we pull them apart and we design electric powertrains for them and we work on those. We need 25 foot ceiling height. We need space. It's very hard to find a building that will do both of these things.'",
        "'speaker_2': 'Building 41 is perfect for that. And then the last reason that we'd like to move here is that I've actually been working on the steel for a year now, and I've found everyone I've met at the city of Alameda has just been wonderful to deal with, and I'd like to continue doing that.'",
        "'speaker_2': 'Okay. So the slide show, I'll tell you a little bit about what we do. We're a clean tech company. We make the most advanced fuel saving vehicle technology in the world. So what we actually make is electric powertrains for trucks.'",
        "'speaker_2': 'We sell them as a repair kit. Alex is the lead customer. We also are selling these our train kits into garbage trucks. And our first customer for that is actually in the North Bay. They do Sonoma and Marin Counties where of course, love to do this for Alameda County as well, besides making them very quiet.'",
        "'speaker_2': 'And I think that's going to be a big deal. If you ask people at random, what time does your garbage get collected, they can tell you because it wakes them up. You make those trucks electric, that can be very much quieter.'",
        "'speaker_2': 'But besides that, it reduces the emissions by fantastic amounts to stick particulates by 93%. And of course, they save enough fuel to pay for themselves in less than four years. The average Class eight garbage truck in the US earns $55,000 a year in fuel and $30,000 a year in maintenance.'",
        "'speaker_2': 'And we can save most of that. Clean tech I think is a good match for Alameda. Social currency for customers, employees. Suppliers. Community. I spend half of the afternoon with the Chamber of Commerce. There's a surprising amount of local industry that matches with what we need, and we need to hire a lot of people.'",
        "'speaker_2': 'Bringing jobs, restoring the building, which is and then it points out, has been vacant since 97. The roof is leaking. It requires. We're planning to put about $4 million into getting that building to the point where it works for us.'",
        "'speaker_2': 'That's we want wanted to. Okay. Yep. So these are actually real people in my company doing real work. This is the kind of thing they do. It's what it looks like. These are the kind of jobs we need to add.'",
        "'speaker_2': 'A lot of engineering work, assembly testing, supply chain, logistics. You know, we are a manufacturer, but we outsource the actual, you know, forging and casting and machining. And we outsource electronics manufacture to contract manufacturers like San Mina. We get all the stuff in, we assemble powertrain kits, we ship them out to where they're going to be installed'",
        "'speaker_2': 'in a truck. So we don't do that installation process here. We do development work here. We do some testing work here. We do supply chain work. We support customers. But to calibrate it for you, when we're at about 100 million a year revenue, that's about one and a half tractor trailers worth of shipping crates leaving the island'",
        "'speaker_2': '. That's $100 million a year. That's how much stuff we're talking about that arrives, gets assembled, software loaded, tested, shipped out. So it's high value, low volume stuff. And those are actual employees arriving at work. Yeah. So that's 109,000 square foot building.'",
        "'speaker_2': 'We don't need all of that immediately. So in the lease with the city, we can sublease some of that. We can use this as an incubator. We're actually quite well known in the in the community of people who do this kind of thing.'",
        "'speaker_2': 'And we've already had people approaching us to sublease some of the space for incubators to start other companies. And you've had some success with this in Alameda already. I mean, this company, Ann Arbor Bay, that was 20 people five years ago.'",
        "'speaker_2': 'And there's now 500 people or something. You've had Makani Power, which has become Google. So I know about it. It's a business. The business thing is not retail, so it generates local sales tax revenue. And of course, people.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Hmm. Actually, do we have speakers on the side besides yourself? All right.'",
        "'speaker_2': 'Members of.'",
        "'speaker_0': 'Yes.'",
        "'speaker_8': 'Thank you, sir, for your concise presentation. I was taking furious notes as to why you wanted to locate here. Okay. And I really appreciate you outlining them for us, because my particular desire is that we repopulate the jobs that left when the Navy lowered the flag at the base.'",
        "'speaker_8': 'And this provides a new function to the building community out there. And I think the more we can build on that, the better. So I think we should move on this before yesterday. Yes, I because this is very important to us in Alameda.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'Thank you, Spencer. And I just want to disclose that back in September, I was invited to a meeting with Mr. Wright, and I was so excited for this project to come before the city council. Back then, you described your workers as a gang of.'",
        "'speaker_0': 'Geeks.'",
        "'speaker_4': 'And I think Alameda could use more geeks and especially in the number in growth that you're talking about. This company is doing a lot of great, innovative work. They have received a grant from the California California Energy Commission, I think recently, around $5.8 million.'",
        "'speaker_4': 'They're doing some work that we want to see more of done throughout our state and great for it to be happening here. And I'm so happy that you've chosen to leave the as you describe stories, your employees describe the soul sucking environment of San Jose down near the San Jose Airport.'",
        "'speaker_4': 'I think because what we can offer you at Alameda Point in what's in the works now is a very vibrant, exciting environment with not only other employment uses, but also restaurants and businesses that are coming that your employees will will want to frequent in.'",
        "'speaker_4': 'And we hope that many of them will also choose to live in Alameda and just eliminate their commute altogether.'",
        "'speaker_2': 'For most, most of them right now are renters. So.'",
        "'speaker_0': 'All right.'",
        "'speaker_4': 'Come on up. Anyway, I am I am also fully in support of this measure.'",
        "'speaker_0': 'MEMBER Doug.'",
        "'speaker_3': 'Thank you. I just want to briefly say Mr. Right, thank you very much for bringing jobs to Alameda and creating jobs here. Thank you very much for investing here. Appreciate it.'",
        "'speaker_2': 'You're very welcome. Thank you.'",
        "'speaker_0': 'Mayor Brody.'",
        "'speaker_5': 'I'm going to echo a lot of what my colleagues have said, but also thank you, Mr. Right, for choosing to do business here in Alameda. It's it's an exciting opportunity to have this at the base was 150 you said 350 new jobs I mean your adaptive reuse of that building investing almost $4 million in that building, I'",
        "'speaker_5': 'mean, that's exciting. And I also think, you know, the reduction in greenhouse gas emissions that that you were at business is going to actually achieve. For California, we have aggressive goals statewide. The governor wants to even be more aggressive about it and the opportunity for you to do that and the opportunity for you to incubate other businesses'",
        "'speaker_5': 'that can come around you. I think it's exciting for me to point and I'm glad you're here. Thank you.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'And I concur with my fellow council members. Thank you. We have a motion.'",
        "'speaker_4': 'Yes. I would love to move approval of the ordinance authorizing the city manager to execute documents necessary to implement the terms of the lease with Right Speed Inc, a Delaware corporation for a lease of seven years with two five year options and an opportunity to purchase Building 41, located at 650 West Tower Avenue at Alameda Point.'",
        "'speaker_0': 'Second and Vice Mayor Seconding and all those in favor. Hi. Hi. Hi. Hi. Thank you very much. Passes. Thank you very much. All right. Next item is item six C.'",
        "'speaker_1': 'Adoption of resolution. If accepting a grant from the State of California, Department of Parks and Recreation, division of Boating and Waterways in the amount not to exceed 80,000 for the purchase of a patrol boat and patrol trailer. Appropriate up to 80,000 from the general fund for purchase of the boat and authorize the city manager, her or his'",
        "'speaker_1': 'designee to execute grant funding purchase agreement.'"
    ],
    "Adoption of Resolution Accepting a Grant from the State of California, Department of Parks and Recreation, Division of Boating and Waterways in an Amount Not to Exceed $80,000 for the Purchase of a Patrol Boat and Boat Trailer; Appropriate up to $80,000 from the General Fund to Purchase Said Patrol Boat and Boat Trailer; and Authorize the City Manager, or His Designee to Execute Grant Funding and Purchase Agreements Necessary to Obtain Reimbursement for Both Expenditures. (Police)": [
        "'speaker_0': 'Okay. Real quickly, let me interrupt. We move these items above so that we could dispose of them quickly. So I'd appreciate your indulgence. Thank you.'",
        "'speaker_2': 'No problem. Thank you, Madam Mayor. Members of the council, Paul Larry, chief of police. The staff report is pretty self-explanatory. The state is wordiness or wants to award us the $80,000 up to $80,000 to assist us in purchasing a boat to replace the current vessel that we have.'",
        "'speaker_2': 'You might be wondering, you know, what did we do to that boat that it needs to be replaced? The answer is really nothing. It's we've had it for almost 15, 14 years and it's just been normal wear and tear.'",
        "'speaker_2': 'And there's a there's a critical point in the world of the boat that's continuing to open up and seep water into the vessel. And it's just frankly, you know, we keep patching it up and it keeps leaking. So it's time to move on and get it get a different boat.'",
        "'speaker_0': 'Thank you. We have questions from council.'",
        "'speaker_4': 'So why does the police department need a patrol boat?'",
        "'speaker_2': 'Well, there are several reasons why. Aside from, you know, the enforcing the speed zones in the estuary, we have it there for water rescues if we need them. We also are patrolling the marinas and the harbors and trying to do what we can to help abate the derelict vessels that occasionally get the anchor outs, as they call'",
        "'speaker_2': 'them, that are out in the estuary. There was a lot of work done. As most of you know, in the last year and a half. Cal Recycle spent almost $2 million in cleaning up the estuary. That was a one shot deal.'",
        "'speaker_2': 'They're not coming back. And so it's really up to us now to do this. And we know that the county lacks the jurisdiction to enforce some of that stuff in the estuary. So it's it's really going to be on the police department.'",
        "'speaker_8': 'I swear I did see the comment in a local business letter supporting this, but I also see that the county has a semi-rigid boat that's parked right behind the county cutter. Yes. At Grand Marina. Is there did someone doing an analysis to see if the 80,000 from the general fund.'",
        "'speaker_8': 'Spent on basically leasing them from the county if they're not patrolling anymore and maintaining that for a certain period of time makes more economic sense then because it's already outfitted then purchasing a new boat for $160,000.'",
        "'speaker_2': 'The short answer is no. We didn't do a study and I have not spoken with the sheriff directly about it. However, I am aware of some conversation that was had between Mr. Gallop and Sheriff Ahern, and the initial response was that he wasn't inclined to make that boat available for lease.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Clarification. Well, that team member decided. Roadie.'",
        "'speaker_5': 'I said one question. I wasn't clear the total cost of the boat. Do we have that estimate?'",
        "'speaker_2': 'No, we don't. There's a there's a variety. I mean, we could go in a few different directions here. There there is a boat out there that could cost upwards of a half a million dollars. And honestly, I'm not I'm not looking to do that.'",
        "'speaker_2': 'There's there's another boat that might serve our needs that's closer to $90,000 somewhere. You know, I'm going to shoot for the lower end, to be honest with you. But I need a I need a boat that's safe for the people.'",
        "'speaker_2': 'I would like to have a boat that allows us to go out in inclement weather because right now we only put our boat out in the summer in the boating season, months between men and when Fleet Week, Fleet Week wraps up.'",
        "'speaker_2': 'So I'd like to be out there a little more frequently than that, if we can hope that answers your question. I think so, yes. Okay.'",
        "'speaker_0': 'Member Ashcraft, thank you.'",
        "'speaker_4': 'So my clarification was, are we talking about a $160,000 boat or we're talking about an $82,000 grant and then the city would be reimbursed for the purchase price?'",
        "'speaker_2': 'Correct. So we don't have the final purchase price because we don't know what we're going to buy yet. So, yes, we would we would appropriate up to $80,000 out of the general fund. And once we submitted all the documents and signed the paperwork, then we would be entirely reimbursed for that up to $80,000.'",
        "'speaker_0': 'Right.'",
        "'speaker_4': 'So but as I understand, I mean, the the kind of boat the price range is more in the $80,000 slightly upward than twice that.'",
        "'speaker_2': 'Right. I right. I don't know that I'm going to spend twice that much money. I mean, the remainder would be out of the general fund. And I've got to be clearly I've got to be fiscally responsible. And I don't want to over purchase a boat that is, you know, beyond what we need or what would allow us'",
        "'speaker_2': 'to to work, you know, efficiently in the estuary. So if I can if I can get a boat for closer to $90,000, then I'll do that. But we're still I didn't want to put the cart before the horse and start shopping before I received approval to accept the grant money.'",
        "'speaker_0': 'So does the accepting the grant money require the city then at some point to pay a difference? If there is a difference?'",
        "'speaker_2': 'Yeah. If there is a difference, then we would have to find that either out of the general fund or or I could seek additional grant funds.'",
        "'speaker_0': 'So. And you don't have a range. You're not asking us to approve a dollar range? No, you're just asking us to approve this grant at this point. And then an open ended dollar range may come back to us at some point.'",
        "'speaker_0': 'Is that correct? Correct. But you would have to you would have to come back, right?'",
        "'speaker_2': 'I would have to come back anyway for.'",
        "'speaker_0': 'That approval.'",
        "'speaker_8': 'Motions as appropriate, $8,000.'",
        "'speaker_2': 'So so so let me let me try to explain it again. So the way this works is he goes out and gets a boat. He then submits his he submits his receipt to the state. State looks at and says, oh, you spent $90,000.'",
        "'speaker_2': 'Here's $80,000.'",
        "'speaker_0': 'So my question is then, are we required as a city to pay that extra 10,000? Yes. So then my next question would be, why does not this not come to us with the total amount, with some information, if we're speaking about 160,000 or if we're talking about a $90,000 boat, at least an estimate of what a ballpark'",
        "'speaker_0': 'figure.'",
        "'speaker_2': 'Okay. Well, I guess the short answer to that is that because I don't I couldn't really go shopping for the boat unless I knew that we were going to be able to even accept the grant money. Because, frankly, without it, I'm sort of I'm stuck in the mud here for a little while.'",
        "'speaker_0': 'I don't understand that.'",
        "'speaker_2': 'I'm sorry. Let me try again. So the way this works is he doesn't go shopping till he has. The acceptance from the state that he can go shopping. He gets acceptance from the state. He presents them with the receipt.'",
        "'speaker_2': 'Then he doesn't complete the transaction. The state says, okay, that's cool, we're going to send you 18,000. For argument's sake, he's already said that he doesn't want to spend more than $90,000. The $10,000 difference comes back to the council for the council's approval, at which point if the council says we don't want to spend $10,000 to access'",
        "'speaker_2': 'the other 80, then we walk away from the grant.'",
        "'speaker_0': 'Right? So that because that's okay. We're not committing to the difference then. No, you're not. Thank you. That's what I was trying to confirm. Thank you.'",
        "'speaker_3': 'Bellamy Yes, Madam Chair. I'm satisfied with the presentation by the Chief of police, Mr. Larry, as well as the city manager. We'd like to see us move forward.'",
        "'speaker_0': 'We do have speakers.'",
        "'speaker_3': 'Okay, let's hear the speakers.'",
        "'speaker_0': 'So we have speakers of Rockdale Lobby. Thank you.'",
        "'speaker_6': 'I hope you don't mind.'",
        "'speaker_1': 'But I can do it.'",
        "'speaker_4': 'Go in the microphone before you accuse me.'",
        "'speaker_6': 'My name is Proctor Lap. I'm the harbormaster at the Alameda Marina. Mayor Council. In early 2012, the estuary was plagued with a number of anchor out vessels, derelicts, abandoned vessels. It was a group put together called the Oakland Estuary Coalition.'",
        "'speaker_6': 'And through this group of harbor masters, police departments, state and federal agencies. A large cleanup program came to be, which ultimately spent close to $8 million to clean up the estuary. At the time that that was done, all of the principals said, without a doubt, we are not going to repeat this again.'",
        "'speaker_6': 'Cal the State Lands Commission. Cal recycle EPA, Coast Guard, all of whom put in a substantial amount of time and money, said, if you want to keep the estuary clean, it's up to you to maintain it. At that same time, the Oakland Estuary Coalition approached Supervisor Wilma Chan to try to get her to sponsor a new countywide'",
        "'speaker_6': 'anchor out ordinance. That did not happen. What she ended up doing was going to her legal staff who had the opinion that the Alameda County sheriff does not have jurisdiction on the estuary. The responsibility for law enforcement on the estuary also directly to the Oakland and Alameda Police Department.'",
        "'speaker_6': 'And so I am here to express my strong support and those of other marine industries on the estuary marina operators that we definitely need a patrol capability on the water and it needs to be a boat that is capable of handling all conditions.'",
        "'speaker_6': 'We can't outfit our police department with a a minimal capability that won't survive the needs of any kind of weather condition that they may be faced with. You all saw that windstorm we had a couple of days ago.'",
        "'speaker_6': 'Imagine sending somebody out on the water in that kind of a condition in a marginal boat. So you are trying to develop the island. You have this whole issue with Alameda Point, which includes Seaplane Lagoon. There are law enforcement responsibilities that totally surround our island.'",
        "'speaker_6': 'And what we know from this past year is that if there is not regular law enforcement on the water activity, these illegal anchor outs will filter back into the estuary. I have to commend the police, Alameda police, they've done a great job in dealing with this over the last year.'",
        "'speaker_6': 'But it's essential that they maintain regular, vigilant patrols on the Oakland estuary. And I think it's short sighted to be sitting here talking about an extra $10,000. My God. I mean, this is an important piece of equipment. You're asking people to go out and risk their lives.'",
        "'speaker_6': 'They should have the right equipment to do their job. Thank you.'",
        "'speaker_0': 'Thank you. Mark, AML, AML.'",
        "'speaker_2': 'Good evening. My name is Mark O'Malley. I'm the harbormaster at Ballantyne Marina, and I'm just in support of the grant as well. People's safety, you know, around the island, water and everything is important. So I'm just supporting it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Chris McKay.'",
        "'speaker_2': 'Evening. I'm Chris McKay. I grew up here in Alameda. Water skiing and sailing on the estuary. And I'm the harbor master of all the marinas. And I just want to reiterate what Brock said and put a little urgency to it, because what we got cleaned up is starting to creep back and we have two or three boats'",
        "'speaker_2': 'that have been in our marinas that have been evicted, that are floating around, and there are some criminal elements. So I would say give them a good boat and as soon as possible it would be great. Thank you.'",
        "'speaker_0': 'Thank you, Tom. Chair I'm sorry. I don't have that, SHARON. Thank you.'",
        "'speaker_2': 'Mayor and council and members of staff and the attorneys and all the members of the Marine community are in the audience this evening. A pleasure to be here. I am a resident of Alameda for about 16 years.'",
        "'speaker_6': 'I've had two boats on the water.'",
        "'speaker_2': 'I do have a boat on the estuary at the present time. I'm the former port captain of the Alien Yacht Club.'",
        "'speaker_6': 'And I'm still a member.'",
        "'speaker_2': 'There and I am a member of the Oakland Yacht Club. I will tell you, I don't need to reiterate what Rock Club Locker said or Brock has said. I want to personally thank him and all the members of his committee.'",
        "'speaker_2': 'We're cleaning up the estuary. If you know what was in that estuary over the last two years or ten years, you'll be surprised what was taken out. I do want you to know that police functions in the estuary are highly important.'",
        "'speaker_2': 'I live right on the water at at Marina Village Harbor, and I look out from my my home on the water and I hear all the boats that go by. I have a nice crow's nest up there. I'm very fortunate to be there.'",
        "'speaker_2': 'And I've had I've been on occasion called the police department of Alameda because of speeding boats at night, going probably 35, 45 knots up and down the estuary without any navigation lights. And of course, I call the police department this was a couple of years ago.'",
        "'speaker_2': 'And they said, well, we don't have the capability to get out there, call Oakland. So I call the Oakland Police Department. And they said we don't have capability to get out there and call the county. So I called the county.'",
        "'speaker_2': 'County said, well, our boats are down right now and we can't get out there. Call the Coast Guard. So I called the Coast Guard and the Coast Guard said, call the city of Alameda. So so I do want you to know that the issue of who controls the estuary right now.'",
        "'speaker_8': 'Is very important. And it does.'",
        "'speaker_2': 'Appear that the weight of responsibility has focused on the city and our chief and our police force, as well as the city of Alameda. And I do encourage you to vote yes on this $80,000 grant. Thank you very much.'",
        "'speaker_0': 'If. John Spencer. That's our last speaker on this item.'",
        "'speaker_9': 'Good evening. I'm Shaun Svenson, owner of Swenson's boat, works on the Alameda Marina. Thank you very much for attending to this issue tonight. I think it's very important that you accept this grant. It would be foolish not to.'",
        "'speaker_9': 'It's very difficult to get these state grants. And I think the city should actually attempt to get more such grants for different items. The State Department of Boating and Waterways has a fairly robust grant program that has been relatively untapped by this city for a long time.'",
        "'speaker_9': 'Included in that in the in those grants are spill cleanup kits that can be located along the waterfront as long as they're for communal use and such other items. So I would encourage more grant requests in the future.'",
        "'speaker_9': 'I've spoken to people at the Department of Boating and Waterways and they often don't receive enough grant requests, believe it or not, to give away the money that they have. And in this day and age, that's very important.'",
        "'speaker_9': 'The police have a boat. It's falling apart. They need a new boat. You have a substantial source of relatively. Great if you're in a very small residual that you'll have to pay to get a new boat. So I strongly encourage you to pass this.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. You have emotion.'",
        "'speaker_3': 'Oh.'",
        "'speaker_0': 'I'm sorry, counselor.'",
        "'speaker_3': 'I'll make a motion earlier. I'd like to move adoption of the staff recommendation. I think the key phrase here is that we're. We're accepting a grant in the amount of $80,000 and. And I think that's it's it's great that R.J. was able to get that.'",
        "'speaker_3': 'So I certainly move adoption of staff's recommendation.'",
        "'speaker_8': 'I'll second that with a comment that because this is a piece of equipment, just like a patrol car, I'd like to see the appropriation come from a capital fund rather than the general fund so we can begin to manage.'",
        "'speaker_8': 'Maintaining this service and to maintain that you maintain it just like you maintain patrols with a police vehicle that comes from another fund. General fund. So if if that, if staff can look at that as part of this so that we can maintain the service and not go for years without it.'",
        "'speaker_8': 'I'm fine with the motion as is to get the process going, but for future we need to plan for the the demise of the boat that's being purchased because it's going to be used just like any other vehicle.'",
        "'speaker_2': 'That's the.'",
        "'speaker_0': 'Second. Yeah.'",
        "'speaker_2': 'Sorry.'",
        "'speaker_0': 'Well, all right. All those in favor. All right. That passed unanimously. Now we're going to go on to item 60.'"
    ],
    "Recommendation to Authorize the City Manager, or His Designee to Negotiate and Execute a Ten Year Agreement for Temporary Assignment of Vehicular Equipment with the State of California Office of Emergency Services for a Type 1 Fire Engine to be Utilized for Statewide Mutual Aid Response. (Fire 3200)": [
        "'speaker_1': 'Recommendation to authorize the city manager or his designee negotiate and execute a ten year agreement for temporary assignment of vehicle or equipment with State of California Office of Emergency Services for the type one fire engine to be utilized for statewide mutual aid response.'",
        "'speaker_0': 'Do we have any speakers on that item?'",
        "'speaker_1': 'We have no speakers.'",
        "'speaker_4': 'Yeah. Well, he's a staffer.'",
        "'speaker_0': 'You may proceed. Good evening.'",
        "'speaker_6': 'Excuse me.'",
        "'speaker_0': 'You may proceed.'",
        "'speaker_6': 'Good evening, Madam Mayor. Council members. City staff. I'm Doug Lang, interim fire chief. I have some good news for you tonight. All right. The fire department requests. Approval to apply for a free fire engine in the state of California.'",
        "'speaker_6': 'Office of Emergency Services. And to authorize the city manager to enter into an agreement. For the temporary assignment of that vehicle. California Office of Emergency Services are responsible for coordinating the response and recovery to all hazards in the state of California.'",
        "'speaker_6': 'Oh yes. Assist local governments in that plan and recovery and response to mitigation. Efforts through a master mutual aid plan. As part of that plan. Since 1950, OAS has provided local fire departments with fire engines. The type? One type.'",
        "'speaker_6': 'To be added to their fleets. Fully equipped with equipment. Those those fire engines can be used as reserve equipment or in local disasters or emergencies. So as far as reserve equipment, we do have some reserve fire engines. However, a lot of the time they're already in service because other vehicles are in the shop.'",
        "'speaker_6': 'Whether there's simply a siren that's broken or a pump that needs to be repacked. So adding an additional engine to our fleet would greatly help us be prepared to protect the city. These fire engines are multipurpose. They're for structural firefighting.'",
        "'speaker_6': 'They're also outfitted as wildland fire engines and as a light rescue type three rescue vehicle, as urban search and rescue. The urban search and rescue portion of this makes us trained and available and equipped in the event of incidents such as earthquakes that we'll be able to get in there and rescue people in collapses, shore up buildings'",
        "'speaker_6': 'with showering, use simple tools to move heavy objects so that we can get to people. In return. It makes us available as a mutual aid resource. We have to staff that vehicle and respond as needed and called upon by the state, within the state and even out of the state.'",
        "'speaker_6': 'The cost for personnel is then reimbursed to the city, so there's still no cost to the city for this. The Fire Department is required to maintain the vehicle in the same standard that we maintain our own vehicles. So we'll be doing our daily, weekly, monthly checks, getting them serviced as needed.'",
        "'speaker_6': 'However, the cost of that maintenance will not exceed $100 if it exceeds $100. The state of California. Oh, yes, except that Bill. Big benefit to the city is that we receive a resource with $367,000 for free to add to our fleet to help us build our ability to respond to emergencies.'",
        "'speaker_6': 'As we look to the future and make the city more resilient. Having those additional resources, especially at no cost to us hit it. It's a good deal in the event of a emergency such as the arson fires that we had recently.'",
        "'speaker_6': 'We can recall our staff. They come they come in to help. But sometimes when they get to the fire houses, we don't actually have a fire engine to put them on. We can send them to the scene so they can assist at these major events.'",
        "'speaker_6': 'However, if we had an additional fire engine in our fleet, we could put them on that rig and they could respond to additional calls as they came in. Also the fire department responds as a mutual aid company. We did this last year two times in August and September to wildland fires.'",
        "'speaker_6': 'We were reimbursed for staff cost and the cost of the equipment. However, when we respond on our own fire apparatus, that decreases. What we have in the city to protect what we have here. Also, its wear and tear on our vehicles when they're out in these forest trees are falling.'",
        "'speaker_6': 'The the possibility of them getting damaged is great. So having the ability to send an OS engine, which the state owns to these events will be very beneficial. In closing, I recommend that you allow us to apply for this free fire engine and allow the city manager to execute an agreement for the temporary assignment of the vehicle'",
        "'speaker_0': '. Thank you. Council questions. Comments. Oh.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'So moved I.'",
        "'speaker_4': 'I would be happy to move approval of item 60.'",
        "'speaker_0': 'I think we just. You didn't know you.'",
        "'speaker_4': 'Had a second and.'",
        "'speaker_0': 'A second. Any comments? You. Any comments before you call for your vote?'",
        "'speaker_4': 'I would just say I did speak to Interim Chief Long today who answered my questions. This vote will decide and would require no extra personnel or equipment, saves the wear and tear on the FDA vehicles and can be used in our city as well for a variety of uses.'",
        "'speaker_4': 'And we did assist in mutual aid this summer with some of the wildfires around the Sacramento area and with the Sacramento. But that was wear and tear on our own equipment. And this is enables us to provide mutual aid when we're requested.'",
        "'speaker_4': 'And there may be times when we need to be the ones doing the asking. So I'm all in favor.'",
        "'speaker_0': 'Thank you. All those in favor. I oppose motion carries unanimously. Thank you very much. Right now. We're going to move on back to 6 a.m..'",
        "'speaker_1': 'Introduction of ordinance repealing ordinance number 3116, which approved development agreement signed between the City of Alameda and Teal Partners, ILP governing the Del Monte Warehouse Project for Real Property located at the northwest corner of the intersection of Sherman Street and one of Vista Avenue in the introduction of ordinance repealing ordinance number 3115, which adopted the Del Monte'"
    ],
    "Introduction of Ordinance Repealing Ordinance No. 3116 which Approved Development Agreement by and Between the City of Alameda and TL Partners, I, LP Governing the Del Monte Warehouse Project for Real Property Located at the Northeast Corner of the Intersection of Sherman Street and Buena Vista Avenue; AND  Introduction of Ordinance Repealing Ordinance No. 3115 which Adopted the Del Monte Warehouse Master Plan and Density Bonus Application for Redevelopment and Adaptive Reuse of the Property Located at the Northeast Corner of the Intersection of Sherman Street and Buena Vista Avenue.": [
        "'speaker_1': 'Warehouse Master Plan and Density Bonus Application for redevelopment and adaptive reuse of the property located at the northwest corner of the intersection of Sherman Street and one of us two Avenue.'",
        "'speaker_0': 'Thank you. For those of you that don't know, I requested that this item be added to the agenda this evening. We, as we all know, we have a new mayor. We have two new council members sitting up here as and it's my understanding that this is the vehicle to give all new council members and existing members an'",
        "'speaker_0': 'opportunity to speak on this issue before it continues to future votes. And so that's why I have requested it be placed on the agenda. This would, as my understanding, be appropriate this time of council members have any questions of staff?'",
        "'speaker_0': 'We don't we do not have a staff representation. There's questions. Before. And we do have.'",
        "'speaker_4': 'We have a lot of speakers.'",
        "'speaker_0': 'Multiple speakers. And I don't know if we have more speakers lips on this. I have 42 here. Hold on just a moment. A couple of.'",
        "'speaker_2': 'I didn't.'",
        "'speaker_0': 'So. Yeah. So at this point, we now have 45 and you can see them coming up here. And so honestly, this goes to why I thought it was important to bring this issue to the newly seated council. So we have a few more speakers slips at this point.'",
        "'speaker_0': 'I'm going to go ahead and call the speakers and I believe this is the audio they turned in. And is that correct? This is. Okay. So then we're just going to go down the order that we have so that everyone understands that and everyone will have their 3 minutes.'",
        "'speaker_0': 'If if if you believe that you someone else has already said what you've said, you know, and that's something you can always, you know, say, is that there was an earlier speaker that spoke to your points and be more brief if possible, but you haven't.'",
        "'speaker_0': 'G or 3 minutes to speak. Eric Strimling. And I'm sorry if I mispronounced names.'",
        "'speaker_2': 'She? Good evening, Madam Mayor. The Council.'",
        "'speaker_6': 'Congratulations on your elections and the elections.'",
        "'speaker_2': 'I believe that it is entirely.'",
        "'speaker_6': 'Appropriate for a new city council.'",
        "'speaker_2': 'In a democratic process to reexamine the actions of the previous city council.'",
        "'speaker_6': 'To see if there was something inappropriate done. We have a very large development.'",
        "'speaker_2': 'Was there any problem in the process of approving it? Was there corruption? Was there anything undue? A study not done and if so, is crucial and.'",
        "'speaker_6': 'Open to the government that they reexamine that. Bring it to light and.'",
        "'speaker_2': 'Repeal it if needed. However, if that did not occur. Then I have to say that it appears to be reneging on a deal and it feels like it's difficult to do business with someone who says yes and then says maybe.'",
        "'speaker_2': 'So I ask you to take this very, very seriously. I ask that we not repeal this on issues that have been dealt with before?'",
        "'speaker_6': 'There has been a year long process. There have been many citizen committees.'",
        "'speaker_2': 'Everybody sitting on the dais, every one sitting behind me, an opportunity to go to those committee meetings and to bring up issues such as massing, size, street size, parking, etc. And those issues were hashed and rehashed, discussed here, discussed at planning board meetings, discussed with staff, discussed with the transportation managers, etc., etc. And this very hard fought'",
        "'speaker_2': 'and hard won compromise was reached. And I don't like every piece of it. No one likes every piece of it. That's why it's a compromise. So before we go back on our compromise before the city of alameda retract its good word.'",
        "'speaker_2': 'Ask that you truly find substantial grievous problems with it and say that. And if there aren't any, then let's please move forward and move to the next the next development program, the next opportunity to make an even better compromise and an even better deal.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. And I'm going to give the next three names, Don. Share it. And then David Maxey and then Richard Houseman.'",
        "'speaker_6': 'Thank you. It's a long way from way back there. Mayor, members of City Council. It's my displeasure of being here again this evening to see an agenda item come back that should not have come back. And I want to talk a little bit about my reasons why.'",
        "'speaker_6': 'There was a statement made in the paper today. Progress is slow in Alameda. It has been slow and I hope it doesn't stop. I hate to see the Del Monte project in jeopardy. I can say that a few passes harebrained proposal out of Alameda will be known as a town of no progress.'",
        "'speaker_6': 'I hope that you read or did read John Pizzi his article in the paper. There is an experienced person talking about a subject that you all should be well aware of, and also listen to Nick Cabral and all the community people around that project.'",
        "'speaker_6': 'Majority of citizens are in favor of this project, and I hope we make an intelligence decision tonight. If you vote again against the staff, if you vote again against the public, who's had a chance to have hearings, that doesn't really sound like democracy for me, that this mayor step forward said and we're going to be doing era'",
        "'speaker_6': 'in this in the city it should be easy. Again. Council member de SOG. You're a community person. You get out there, you talk to people, you know, the pulse of people. I've always appreciated the fact that that's how you operate.'",
        "'speaker_6': 'I hope you've done that on this issue. Councilman Odie, you're a new person to this. But, you know, processes and you should be well aware of this process that was followed and was brought to merit and was voted on.'",
        "'speaker_6': 'Again, Council member Ashcroft. You know what? Through the planning, you know what the process went on. And again, appreciate your understanding of that. That process. Vice Mayor Matarese, you've been there, too. You've sat on the council. You've seen the processes.'",
        "'speaker_6': 'You've supported the staff. Let's not not support them again. It doesn't look good if you become a puppet or somebody who can't think for themselves.'",
        "'speaker_2': 'They are. Spencer, again. Democracy was your push. This is democracy in action.'",
        "'speaker_6': 'People have been listened to. Reports were made, process were made. And it's something I think that you should be well aware of. So. Do not slam a democratic process. Do not slam public and public comment. Do not throw out a lot of work that your staff went through to produce all these documents, go through all the hearings'",
        "'speaker_6': 'and take some confidence in this process and the staff. Nick, you owe me another dinner. Thank you.'",
        "'speaker_0': 'Next speaker, David Maxey.'",
        "'speaker_6': 'Good evening, Madam Mayor. Council members. In all of.'",
        "'speaker_2': 'The.'",
        "'speaker_6': 'Information that I have read about this. Project. And there's been many, many articles in the newspapers. I don't remember ever seeing anything about any environmental report on traffic. Now, I know for a fact that in talking to some of the people that live in that area, they are very, very disappointed with the amount of traffic that this'",
        "'speaker_6': 'unit is going to. Increase their ability to get around the city. I do not believe that this should go forward at this time in its present condition. From what I've read, I see that that the Planning Commission has pretty much given the developer everything that he asked for and got very little in return.'",
        "'speaker_6': 'I don't appreciate that. There's nothing been said to the developer about providing anything for schools. There's a lot more development coming down the pike and in the near future, as I understand it. 4311 new units, including Alameda Point and this red brick building and some others.'",
        "'speaker_6': 'And where are these kids going to go to school? Because most of the schools are full now. So in my estimation, when you deal with a developer, you deal with all aspects of the city, including the schools and most particularly the schools.'",
        "'speaker_6': 'We just floated a bond issue for schools. Half that money is not even earmarked for a specific job. So I think that we we need to really take a look at what the whole city needs and what direction we're going in.'",
        "'speaker_6': 'Anybody that's out there on the streets in the morning and the evening commute hours will find very congested traffic. And you don't want to dump another 4000 some cars on the street during those hours and expect to get to a place.'",
        "'speaker_6': 'So my recommendation is that you go back to the drawing board on this and renegotiate this with me, with the developer. Thank you very much.'",
        "'speaker_0': 'Yeah. Richard Houseman.'",
        "'speaker_6': 'Me sometime.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_6': 'Madam Mayor. Members of the council and staff.'",
        "'speaker_2': 'My concern about this potential rescission.'",
        "'speaker_6': 'Is that it raises the question as to whether the city of Alameda can be trusted to honor its commitments. Rescission shouts a message that our city government can't be taken at its word, which clearly will discourage future investments in our community, however much they might be needed.'",
        "'speaker_6': 'After a dozen public hearings, meetings and negotiations between the developer and community neighborhood groups.'",
        "'speaker_2': 'Along with hundreds of hours of staff time. The Del Monte Project.'",
        "'speaker_6': 'Was approved by the City Council. While there are some valid concerns about the TDM plan and the actual location of the affordable units, rescission does not provide solutions to them.'",
        "'speaker_2': 'Everyone on both sides of this project professed.'",
        "'speaker_6': 'A desire to save this building. For those of you who might remember the struggle to save the Bethlehem red brick building.'",
        "'speaker_2': 'Similar disagreements led to that building's destruction. By voting to rescind this project, you similarly threaten to jeopardize the Del Monte building.'",
        "'speaker_6': 'And then where are we? Thank you.'",
        "'speaker_0': 'Thank you. Next speakers, Paul Foreman, Bruce Canola, and then Kathy Morey.'",
        "'speaker_6': 'Give me a minute here. At the last meeting and at and in subsequent emails, I informed Council that the Del Monte Master Plan was legally insufficient because it contains no preliminary site plan showing structure, locations, floorplans and elevations with regard to the low income housing structure to be constructed adjacent to the warehouse.'",
        "'speaker_6': 'Section four of the Alameda. The Density Bonus Ordinance requires the development application submitted to the Planning Department. Provide every one of those design items. Andrew Thomas has admitted to me that none of this preliminary design was required by him from the developer, but states that there is no harm done because prior to the issuance of a building'",
        "'speaker_6': 'permit for the warehouse, the law requires the developer and council to enter into an affordable housing agreement that will provide all of the design detail. My response to that is this First, we are a government of laws, not people, and we can't choose to ignore any law.'",
        "'speaker_6': 'Second, the density bonus origins is not some ancient, outmoded law. It was adopted in 2009 by the unanimous vote of the Planning Board, including Marilyn Ashcraft. And Council, including Frank Materazzi. Third, there are at least two good reasons for the requirement.'",
        "'speaker_6': 'One being that the planning board and council cannot and did not make an informed judgment on the merits of the plan without preliminary design information on this very important building. And two being the risk that after years of planning and meetings, council and the developer.'",
        "'speaker_2': 'Will not reach.'",
        "'speaker_6': 'An affordable housing agreement. Because Council's concept of this ghost building may differ from the developers leaving the entire project under threat of litigation, much more so than if we repeal now before the development agreement is signed. Therefore, the Del Monte ordinance must be repealed as urgency ordinances effective immediately and remand into the planning staff to obtain all'",
        "'speaker_6': 'the documentation required by law. When this meeting is over, I still may not know any more about this ghost building than I do now, but I will.'",
        "'speaker_2': 'Know which council members.'",
        "'speaker_6': 'Are truly committed to the rule of law. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'Thank you, mayor and council members. My name is Bruce Chernoff. I live at 1808 Nason Street, about three doors away from Buena Vista. At the beginning of the meeting, it was suggested by the mayor that there are future votes by this council to be taken and that there should be an opportunity for the council to be able'",
        "'speaker_6': 'to talk about those just those decisions that are upcoming. To my knowledge, the master plan has been approved, the development agreement has been approved. And so I wonder what decisions will be coming before the board. The Council. I urge you to reject this proposal to rescind the approvals for the DOMANI Building.'",
        "'speaker_6': 'The City Charter requires that the city exercise its police and legislative powers and afford all property owners and residents due process. The Del Monte Master Plan, the Northern Waterfront Plan that was approved almost seven years ago and the Dole Money Agreement were reviewed and approved after completion of many such processes and many such opportunities for people to'",
        "'speaker_6': 'participate. Perhaps one of the commenters is didn't participate in all of those hearings, but I know that there was a 253 page mitigated negative declaration that was published in April of this year that summarized the impacts and the potential and the measures being taken to mitigate those potential impacts.'",
        "'speaker_6': 'The sudden proposal to rescind the dole money approvals with no publication for the of the rationale for such a drastic action violates the principle of due process. And I think the principle that the Sunshine Ordinance is founded upon, if not some of its provisions.'",
        "'speaker_6': 'As a resident that lives near the Del Monte building, I'm excited about the approved project and I'm tired of it's being used as a trucking warehouse. And with your indulgence, I'd like to show you a brief 22nd video.'",
        "'speaker_6': 'I thought that the city was on a successful path.'",
        "'speaker_2': 'Which is absolutely re-used as well as been engaged in a process of relocating.'",
        "'speaker_6': 'Existing cookware. You can hear the piece talking about the city's efforts over many, many years to relocate the truck route along Buena Vista. Avoiding also the trucking uses that generate trucks and neighbors. There's a picture of a tire that fell off a truck and ran into a neighbor's house right at the corner of right on Buena Vista'",
        "'speaker_6': '. But if you want a continuation of the current trucking use, by all means rescind the property owners approved project. But you'd better buy a stock of traffic light poles because the one at Sherman and Bueno Vista gets knocked down by either a car or a truck.'",
        "'speaker_6': 'And I think it's most likely a truck several times a year. Thank you.'",
        "'speaker_0': 'Thank you. Good evening, Mayor. City Council Staff. My name is Cathy Moring, and I too, live not far from. This project down Bueno Vista Avenue. But first, I would like to congratulate you on your unanimous vote to approve.'",
        "'speaker_0': 'Right. Speed. And there are 300 proposed new employees here in Alameda. My question to you is, where will they be housed? The project that is before you tonight has been through due process. The public has shown its approval for this.'",
        "'speaker_0': 'I daresay that most of us, in fact, all of us lived in a development that at some point was not wanted by someone else in this community. Every housing development, no matter how old, is a development. This is a re-use of a fabulous old building.'",
        "'speaker_0': 'And I also might remind everyone that this is not being built for you specifically. This is being built for those new employees of Right Speed. These people who want to get to the city, who don't want two cars, who want to use public transportation.'",
        "'speaker_0': 'As somebody who lives in that community, I would much rather see people who are invested in our community living down the street from me than to continue to see the knock down street light and deal with semi-trucks up and down the streets.'",
        "'speaker_0': 'I don't want that's what I don't want. I want people who invest in our community, who participate, who don't want to drive their cars, who want to bike, who want to walk, who want to car share. Who want to use.'",
        "'speaker_0': 'The city car share who want electric cars. They think differently than we do. We can't make this decision as if we are the ones moving into that structure. Look at the greater area. Look at the neighbors there. Who?'",
        "'speaker_0': 'Don't want semis and giant tires flying off of trucks riding up on their front lawns. That's dangerous. That's not good for the community. People are good for this community. Thank you so much. Yeah. Our next speaker is Michael McDonald.'",
        "'speaker_0': 'Donna, Helen Soares and then Diane Lichtenstein. Lichtenstein.'",
        "'speaker_2': 'Good evening, Madam Mayor, and congratulations to the rest of you and council members and staff. I'm Michael McDonagh, president of the Alameda Chamber of Commerce. I'm here representing over 400 business owners and probably thousands, literally thousands of their employees that live and work right here in Alameda.'",
        "'speaker_2': 'I've also been a resident here and a homeowner for over 20 years. I live here, I work here, I shop here. And I, too, have the same concerns as all the other residents. I don't want more traffic any more than anyone else wants.'",
        "'speaker_2': 'But I think there's more here at stake than just traffic. If you resend the Del Monte project, there are a lot of other moving parts that must be considered. When taking such a drastic step. So. I have concerns like keeping and creating jobs in Alameda, providing employees with local businesses with affordable housing so they don't have to'",
        "'speaker_2': 'spend a large part of their wages on gas as they commute from off island residences, which, by the way, cost more will cause more traffic on our bridges and tunnel. I have concerns of restoration of a blighted property that has been an eyesore in our community for over 40 years.'",
        "'speaker_2': 'A fragile city budget that currently has a deficit I'm sorry of surplus, but is projected to have a deficit. And that budget must maintain infrastructure and safety services of fire and police. And the fees that we would lose from the businesses and the taxes that we would lose that our residents will have to bear, and more likely'",
        "'speaker_2': ', higher taxes. More importantly, I think the bigger issue at this point is a message is the message that rescission. We'll send to the greater business community. The chamber has already heard from the financier of a future project. We're very concerned.'",
        "'speaker_2': 'With a process that's proceeding. There's also the issue of opening up the city and its budget to future lawsuits that will surely come if this is. Rescinded. And I do believe there may be violation of the sunshine or ordinance.'",
        "'speaker_2': 'There's no such thing as a plan that's going to satisfy every person. But this is a great plan. The Del Monte plan deals with the community concerns in many ways. But you also have to realize you will have an opportunity to influence the outcome of this project without having to sacrifice your values and objectives.'",
        "'speaker_2': 'Will you disregard the countless hours of staff's work and waste the resources of the city? Will you brush aside the dozen community meetings and all the input that we've heard in the last three council sessions? Finally, I'll just say that a decision to truly put Alameda first and trust that your staff has developed an effective plan to'",
        "'speaker_2': 'deal with the city's challenges sends the message that Alameda remains a great place to live and do business.'",
        "'speaker_0': 'Thank you, Helen. Source. Council members. It's rather puzzling to be here tonight, really, considering the approved El Monte building development, which provides so many benefits for the community, particularly when its approval was in keeping with the law and after repeated public meetings and the officially required hearings since there were so many opportunities for public comment during the'",
        "'speaker_0': 'lengthy approval process. The chief problem seems to be stemming from the outgoing council taking action after the new council was elected. I believe our council on most organizations required to continue fulfilling their responsibilities until replaced by newly sworn in members.'",
        "'speaker_0': 'So this seems like a non-issue. The Mello del Monte property provides Alameda with a huge number of benefits. It preserves a unique, historic building. It provides badly needed housing for only incomes. It will have a major boost for all will meet its budget.'",
        "'speaker_0': 'It will pioneer new transit measures to reduce the impact of the additional units. And in addition, it contributes millions in actual benefits to the city that will jumpstart the Sweeny Park, open up a major portion of Clement Street and assist public schools and more.'",
        "'speaker_0': 'One could go on about the benefits that will result from this excellent development. But for months, many of us have been here repeatedly enumerating these contributions to Alameda in our advocacy for this project to move forward. So the question tonight is really, what is the problem?'",
        "'speaker_0': 'Why is this thoroughly examined, evaluated and appropriately approved project being challenged? I haven't heard a reason to question the development or how its recession would benefit the city. Please reaffirm this opportunity offered to Alameda to have a development that addresses so many of our needs.'",
        "'speaker_0': 'Please move this development forward. In accordance with the appropriate approved agreement, leaving this historic building to rot or who knows how many more years will not accomplish anything but put a new black mark on the city's ability to work constructively to achieve good development.'",
        "'speaker_0': 'And it will be a blemish as one of your first actions snatching defeat from the jaws of victory. Please be bold enough to benefit the city I the action taken by your predecessors. Thank you for your consideration. You.'",
        "'speaker_0': 'Good evening. I'm Dianne Lichtenstein, speaking on behalf of the Alameda Home Team. And I wonder to what purpose is the delay for this proposal? I really believe that moving forward now outweighs any perceived advantage of a delay. What perception must others outside Alameda have of this attempt to undo an agreement made in good faith with the developer'",
        "'speaker_0': 'and with the community? I find it embarrassing, actually. There have been months to analyze, confer and negotiate with a developer as well as many, many, many Tim Lewis presentations to every club and organization that they could find. Everyone has had ample opportunity to speak with them, to negotiate with them, to ask their questions.'",
        "'speaker_0': 'On this point, for the past many, many, many months, certainly the developer has been open, transparent and willing to work with the community or with any individual who has any questions or which wish to ask. So why is this repeal coming up now?'",
        "'speaker_0': 'Think of how this looks to those who may have an interest in future development in this city. Will we be a laughing stock? Thank you. Next speakers. Nick the Asia. And I'm sorry. Then Harry Hartman. And then Art Lenhart.'",
        "'speaker_2': 'Good evening, Mayor Spencer and council members. My name is Nikita Hager, the proud resident. Of Alameda. I moved my family here three years ago. But tonight, I'm a disgusted resident. I'm disgusted by the fact that this decision is before us.'",
        "'speaker_2': 'It was thoroughly reviewed and approved. And now many are watching, not just in this room, across the blogs, across all the newspapers. In San Francisco is Alameda, the place that we want to invest? What does an approval mean when three weeks later, Mayor Spencer, with all due respect, that this is coming before us again and council members'",
        "'speaker_2': 'Odean matter. S.E., you are on the hot seat here tonight. The project was reviewed. The project was vetted by the community. It was supported by the community. And those who don't support it probably don't support anything. The project met every damn hurdle.'",
        "'speaker_2': 'It. The procedures were followed. And it was approved twice by this council. But apparently that's not enough. And here we are three weeks later. With this decision odd to try to overturn a project that was approved. This is the wrong action that is being taken tonight.'",
        "'speaker_2': 'And if it is taken, you are all making a mistake. You're sending the wrong message to everybody that a deal in Alameda is not a deal. What does that say? Let's move forward and not be fearful of change.'",
        "'speaker_2': 'Your focus should be on new projects, not creating fear, which what this is doing and your action potentially is doing, not creating fear of investment in Alameda for that will have long term damage beyond any decision that happens here and over the next several years.'",
        "'speaker_2': 'We can have our paradise. I moved here because of this wonderful community. But we have to move forward and we have to have progress as well. Thank you. Even in council. Congratulations on those that were elected, those who were here before, and those that experienced all the stuff that happened last year.'",
        "'speaker_2': 'My name is Harry Hartman. I am a business owner and a homeowner. I've lived in Alameda on a consistent basis since 1970. That's a long time ago. I've seen a lot of things that happened. But one of the things that that that I've been at this Mike for for other projects is we.'",
        "'speaker_2': 'We acknowledge truly that that something happened were for real. Meaning that ice was busy over the weekend because of all the holidays. And, well, I sent all of you a message about how you felt about, you know, this project, meaning that a a planning board meeting had happened.'",
        "'speaker_2': 'It was agenda ized. There was all the speakers came up. There was a vote. I mean, a motion first. I'm sorry. You follow the procedure. And unanimously it was voted out. And we do that once in a while when we think a developer.'",
        "'speaker_2': 'Like these guys came to Alameda in many ways. As as a hero because no one had been around in a long, long time. And I don't mean to, you know, kind of go here. I lost my dog this morning.'",
        "'speaker_2': 'So I'm you know, I wanted to just say this and borrow it from an old movie. I'm mad as hell, and I don't want to take it anymore. Well, hold on. But what does that get you? What does that get you?'",
        "'speaker_2': 'I love this city. I love Alameda. I love all the quality of life benefits. I like the theater and what it meant. And you, the knockdown drag out that went for the theater mayor and council was really something.'",
        "'speaker_2': 'Probably one of the biggest one was you ever had. You know, I'm a big fan of what I call perspectives when you have a legal and business process that people can respect. Then we move forward. We have a good community rhythm and momentum in this city.'",
        "'speaker_2': 'And if you don't acknowledge that, then you haven't been awake. I know there's traffic challenges here in Alameda. We can pull our sleeves up, work together, collaborate with the developer. I just have to ask this question. I mean, is this back to the future?'",
        "'speaker_2': 'Weren't there times during all the discussion since last April for people to sit down with Mr. Meeks, with any of the staff persons and say, I have concerns? So I don't buy it. I don't I don't buy it.'",
        "'speaker_2': 'The idea that the current council members did not have a chance to weigh in on the The Del Monte project before the actual vote. It's specious. So my comment is this acknowledge the vote. It happened. It was real and do the right thing.'",
        "'speaker_2': 'Good evening. My name's Arlen Hart and Mayor Spencer, members of the council staff and members of the council. Welcome back or welcome aboard, whichever it happens to be for you. Everything pretty much has been said. Except about affordable housing being provided by this project.'",
        "'speaker_2': 'But John Spangler said. But Don Sherrod said with the gentleman from right power train said that's all been reiterated. I want to hash over it again. I just think it's a shame that I'm celebrating an anniversary here. Now.'",
        "'speaker_2': 'It's 47 years I've been waiting for the Del Monte building to be rehabilitated. I don't want and as I said last year, I can't wait 46 years more. I don't want to wait another 47 years before the building goes beyond dereliction and into trash like the red brick building did.'",
        "'speaker_2': 'So you've have an opportunity to vote against this rescission. All the work has been done. Anything that goes ahead forward would be something like spending a lot more of taxpayer dollars to, in my mind, do the same things all over again.'",
        "'speaker_2': 'I'm not an expert on any of this, just a citizen. I live here. Raise my family here. I'm a substitute teacher. That's why I'll have to leave after this, because I've got a class in the morning. But one thing that has been pointed out several times, and I'll paraphrase Mark Anthony speech.'",
        "'speaker_2': 'At the funeral of Caesar. We don't want to see domestic fury and fierce civil strife covering all the parts of Alameda, do we? So thank you for your time. Please consider voting against the rescission. That's my heartfelt belief.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next, speakers Carey Thompson, Robert Byrne and then Kurt Peterson. Good evening, everyone. City Council Mayor Staff My name is Kerry Thompson. I am the current Chairperson of the Government Relations and Economic Development Committee for the Alameda Chamber of Commerce.'",
        "'speaker_0': 'I also have a business here in Alameda. I have grown up here. My mother grew up here. I raised my children here. My husband is from here. We are alameda. It's first and foremost. One of the things i want to mention is that businesses as well as individuals need to have integrity.'",
        "'speaker_0': 'Integrity is regarded by many as the honesty and truthfulness of one's actions. One of the things that I love about Alameda is its integrity. It has always had integrity. Until this moment. Why are we even revisiting this decision?'",
        "'speaker_0': 'Integrity builds trust, it builds businesses, it fosters relationships. And technical integrity should not be undermined by fear of change. Fear of change is not a reason to go back on our word or compromise our integrity. Fear of change is not a reason to stop a project that will ultimately bring jobs, affordable housing.'",
        "'speaker_0': 'Improve a blighted neighborhood. Fear accomplishes nothing. Our options are to accept that fear and do nothing. Or we can face it in acknowledgment and decide to move forward and work with the changes for a positive outcome. I request that you honor the commitment that has been made and work proactively to create the desired outcome that is desired'",
        "'speaker_0': 'by the majority. I also agree with several of the other speakers that have spoken before Dianne Lichtenstein, Helen South, Michael McDonough, Don Sharrett. They all have said what I have felt. Thank you.'",
        "'speaker_6': 'Hello yet again. My name's Robert Byrne. I live at 1423 Lincoln, right at the corner of Benton. And first thing I would ask is. Well, first thing I would say is that, you know, I am for slow growth.'",
        "'speaker_6': 'But you got to understand, it's a very different situation. While Alameda was building things over the last couple of years, like a target on land that was pretty empty. It wasn't in the middle of a neighborhood. This was being ignored.'",
        "'speaker_6': 'This has been going on with me for 15 years and a lot of the stuff that also is being dismissed here is a lot of conclusions in pathways of thought that happened over that 15 years, not just within the last year.'",
        "'speaker_6': 'A lot of that having to do with blight. And I have a lot of pictures here. I'll quickly hand around.'",
        "'speaker_4': 'You can go back to the microphone so we can hear you.'",
        "'speaker_6': 'I would also like to say that many of the neighbors, including myself, are responsible for cleaning that up every year at the cost of hundreds of dollars. I also have stated in the past that that Benton is way too narrow of a street, have semi trucks coming down.'",
        "'speaker_6': 'Now, you know that it's not Lincoln is not a truck route. The truck ers do not know that they Google it. They try to turn down it at 2:00 in the morning. They've broken my stop sign. They've been painted a couple of times.'",
        "'speaker_6': 'They've broken an eight inch branch off a tree. They've hit multiple.'",
        "'speaker_2': 'Cars.'",
        "'speaker_6': 'Ah, my other neighbor who I just found, that was my neighbors describing the truck. Also in the in the tire, in the road. That's not unusual. It's very common. And the other thing I would say is, if you're really, really concerned about the traffic and you knew this was a botched truck route to begin with, why were'",
        "'speaker_6': 'you allowing multiple truck routes and truck companies to come in there year after year? It got so much worse from 27 on. And if you were really concerned about the traffic flow there, you wouldn't have let the trucks go in there.'",
        "'speaker_6': 'And there's so much worse. I bet triple the cars wouldn't be that bad. You know, we breathe those fumes inside our house. There's dust everywhere. We can't even keep our houses clean. And when we went to.'",
        "'speaker_2': 'Complain, usually the next day, it got a lot worse.'",
        "'speaker_6': 'They would shine us on and be very friendly. So I started getting the police to come in there and hand out something to them and say, Hey, you know, here's the truck route. But regardless, that same week, it would get worse.'",
        "'speaker_6': 'And this time it happened time and time again. There was nothing we could do. And and so I would say, you know, here here's here's the city developing other areas, talking about low growth. Here's an area.'",
        "'speaker_2': 'That's stagnant because it's got.'",
        "'speaker_6': 'This old great building in it that was actually built after much of the neighborhood in 1927. My house is 1915, I think, and it also blocks our path to the beautiful Water and Sweeney Development Park. There's a lot it's just a it's it's it's just a roadblock to the whole community.'",
        "'speaker_6': 'And it really needs to be fixed. I'm ashamed that you're even considering going back on this. Thank you for your time.'",
        "'speaker_0': 'Thank you, Kurt Petersen.'",
        "'speaker_2': 'Yes, Madam Mayor. City Council. It's good to see a group that I hope will be more open and working with the public more than what we're working with right here. And first of all, I want to say the city council right here has every right whatsoever to bring this issue up.'",
        "'speaker_2': 'Okay. Contrary to what a lot of people are emotionally saying and everything I hear about this is all emotional. Oh, gosh. Could make gosh alameda look bad. I'd rather Alameda do what's right then look bad. You know, that's horrible.'",
        "'speaker_2': 'Looking bad. No. Do what's right. That's the key thing. Only one individual that's gotten up here to speak as said about how the legal. Problems there is with this, and it comes down to affordable housing and you know about it.'",
        "'speaker_2': 'Ms.. ASHCROFT Because you were involved with it, as you stated, as far as all seven points, as far as that need to be fulfilled to change the density clause. And one is an extreme, detailed, accurate floor plan and layout of the low cost housing.'",
        "'speaker_2': 'This does not have it. And to say you're going to have it in the future doesn't answer that requirement. We have measure A that was voted in as far as low density for a reason for the people of this fine city.'",
        "'speaker_2': 'I want to see that upheld. I want even if you don't want to repeal this, as far as with this ordinance, I want you to be wise staff to look at it more carefully. I want the planning department to look at it more carefully to make sure that they meet every layout and every demanded it before it's'",
        "'speaker_2': 'brought up at the last second. Bolted in within minutes before we have a new city council. I mean. You know, if it's such a great plan. This board, which I think is intelligent, would go with it, but obviously it's not that good.'",
        "'speaker_2': 'Or they would have said, let's let the new people come in. No. It was rushed through. Might have had a a year as far as preliminary working. But the planning, the planning board and our planner needed to look more carefully as far as traffic as Mr. De Saag brought up before.'",
        "'speaker_2': 'We need a detailed master plan when it comes to traffic in this city, which he wants to say there is. There isn't. We continue to build more and more homes with no plan. And it's it's only 250 here.'",
        "'speaker_2': 'It's only 350 here. It's only 414 here. It all adds up. It all presents congestion. And I would hope that you would repeal it and look at it. At a better light in the future. Thank you.'",
        "'speaker_0': 'Thank you. Next speakers. Next features Mike O'Hara, Allison Green and then Heather Little. Mike O'Hara. I'm sorry. Mike O'Hara. And he. He could hear me. I think he's coming.'",
        "'speaker_6': 'There's Spencer, a member of the city council. I'm Mike O'Hara here from Tim Lewis communities. And I think you've heard from a number of people talking about 12 public hearings, ten months of countless meetings and a wide cross-section of community, both supporting, questioning, working with us, coming up with solutions.'",
        "'speaker_6': 'All of that led to the approvals that happened last month. This housing development project will, as it's been stated, replace blight with the beginning of a restored waterfront by saving an historic monument. They'll create over 900 jobs during build out.'",
        "'speaker_6': 'It'll create sorely needed housing, including 55 affordable housing units that we are committed to build. It completes a vital segment of Clement Avenue and in so doing removes trucking users from an otherwise residential neighborhood. It creates neighborhoods serving shops and restaurants and implements a transportation plan that allows residents affordable and convenient commute options.'",
        "'speaker_6': 'On day one of occupancy and will attract other new transit. Not only that, but it can be expanded. It's designed to be expanded to the entirety of the northern waterfront and to other areas, including Alameda Landing. It lastly generates about $20 million in fees, contributions, subsidies and public benefits, including about $1.1 million directly to the school district'",
        "'speaker_6': '. We're disappointed you've chosen to take this unusual step of of considering rescission of the city's approval of the master plan, of the development agreement. And we delivered a letter to you this afternoon that outlines our objection to the to the action.'",
        "'speaker_6': 'At this time, I feel like I need to to correct some statements that have been made, both in prior council meetings and again here tonight with respect to the density bonus ordinance and our compliance there with the Density Bonus Ordinance, which is Section 30.17, Dash eight, the Alameda Municipal Code provides that affordable housing units may be constructed'",
        "'speaker_6': 'in phases pursuant to a plan approved by the city, which in this case would be the master plan. The master plan outlines in great detail all of the future submittals and the timing thereof, because the affordable housing project has not yet been designed for the later phases of the master plan.'",
        "'speaker_6': 'The DE Money Density Bonus application included for plans for the Domani Building, which were included in the development plan for the Del Monte building and illustrative conceptual elevations included in the Master Plan, which are on page 25, if you care to look, which were to be representative of the product type contemplated for the later phases because of'",
        "'speaker_6': 'the phasing. It was our understanding the city would rely on these four plans and illustrative renderings as part of its review of the application. This approach is consistent with the master plan and the density bonus ordinance because the subsequent phases will be required to comply with the applicable development standards.'",
        "'speaker_6': 'We ask you to to. This plan was extensively and carefully studied and vetted and approved by the Historical Advisory Board, the planning board, and thus by the City Council. The approval should stand. This project creates so many benefits to the city of Alameda.'",
        "'speaker_6': 'And we look forward to we look forward to keeping our promise to the community to revitalize the waterfront and revitalize this first important piece of L.A., this northern waterfront and its history. We hope you plan to keep this promise as well.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Alison Green. And then Heather a little.'",
        "'speaker_1': 'Good evening. I'm Alison Green with Plan Alameda and I'm also a Del Monte neighbor. And I have to tell you that when I covered myself and Del Monte logos for Halloween, my friends and family teased me that I wasn't going to be able to do these things much longer.'",
        "'speaker_1': 'And you can just imagine our joy when on December 23rd, we opened the mail and found the notice of repeal because we'd been wondering how we were going to spend that holiday vacation time. My first thought.'",
        "'speaker_0': 'My second thought.'",
        "'speaker_1': 'Was that what does this mean? Are all of our hard won actions here at risk? Now, the timing wasn't great for speaking with all of you so that I could get some insight into this repeal action. You know, answer your questions about, you know, what plan had done and to review our accomplishments.'",
        "'speaker_1': 'So as a quick reminder, some of them, but not all of the key wins are the 1 to 1 bundled parking for each unit that comes with Tim Lewis's responsibility to build Clement all the way out to Atlantic, the robust multiyear parking study plan that starts with the baseline and 2015.'",
        "'speaker_1': 'And a neighborhood representative on the Northern Waterfront Transportation Management Authority to act as a watchdog. Now. I did not get a chance to meet with Mayor Herrera Spencer. I also didn't talk to Councilman De Saag. We'd already discussed El Monte a couple of times prior to the City Council approval, but I'm comfortable that I know its concerns'",
        "'speaker_1': '. The irony being that I think Councilman de SAC and I agree that the transportation plan needs strengthening. Where we differ is in how we can leverage the robust traffic study plans and neighborhood representative. And, you know, in the neighborhood representative to make our money, our demonstration project, we can use these data to refine future traffic plans before'",
        "'speaker_1': 'we do more building on the northern waterfront. And, Councilman, I'm hoping that you'll reconsider this opportunity. Councilman woman as he Ashcraft made sure that the approved ordinances included the neighborhood representative on the transit on the Transportation Authority when it went to council in December.'",
        "'speaker_1': 'And I thank you for that because staff and planning board didn't do it. Vice Mayor R.C. Matter, S.E., I'm sorry, was very patient as I walked him through plans, organizational structure and all the work we've done to influence the development agreement.'",
        "'speaker_1': 'The developer and the city councilman, Odie and I didn't get a chance to speak very long, but I asked him if he was unclear on anything. That plan had been doing our work and he'd heard our comments from attending prior planning board meetings and council meetings and expressed confidence that we've been thorough in our research and actions'",
        "'speaker_1': '. This is where I'm supposed to conclude with either support for the repeal or urge you to vote against it. And I'll be honest, the problem is that I'm not sure what this council's issues are or what it is.'",
        "'speaker_1': 'The development agreement about it that's so egregious that it means it should be repealed. There's no documents to review laying out the problems. There's no specific actions when when these ordinances were discussed and ultimately approved in the prior, almost every community speaker to a person supported the project, even though some wanted to work on it a little'",
        "'speaker_1': 'bit. But everybody wants to see that building, you know, rehabilitated. So if you do repeal, what's the process now? What's Andrew supposed to do when it comes to work tomorrow morning? All in all, we plan ourselves on not making judgments without thorough research and knowledge.'",
        "'speaker_1': 'So without any specific information, I have to urge you not to repeal these ordinances and keep going with the continued neighborhood involvement that's been working.'",
        "'speaker_0': 'Thank you. Red weather rather l Peter Wang. And then. And. Rocky. Rocky, I'm sorry. Yes. Continue. Okay. Good evening and happy New Year. I can't believe that we're back here again, but we are. I'm speaking tonight to express my concerns about the consequences of repealing the Del Monte Plan as they have already been pre-approved.'",
        "'speaker_0': 'Plan Alameda started in June 2014 as a small group of neighbors who were concerned about having a successful Del Monte project in our backyard. As we grew, we pulled in Alameda with a diversity of development experience. We became a new kind of grassroots movement seeking advice from experts in our community and continuously walking the neighborhood and Little'",
        "'speaker_0': 'John Park meeting people and getting direct feedback about our work and new and innovative ideas for how we could approach this development. This combination of having a working group and boots on the ground approach has enabled plan to work directly with the city staff, the developer, TLC and the Littlejohn del Monte community to ensure that this development'",
        "'speaker_0': 'takes into account concerns that were not addressed in the original proposals placed before the Planning Board. It hasn't always been easy to resolve the seemingly incompatible goals to see this project move forward while mitigating the potential for negative impact that a development of such size and scope could have on our neighborhood.'",
        "'speaker_0': 'Because our goal was to find a solution, we were able to successfully embed ourselves in the formal process and paused the movement forward while we sought out professional advice. Educated ourselves, gather community input and established lines of open communication that would ensure a more successful project through a partnership of stakeholders.'",
        "'speaker_0': 'As part of this, we have worked very hard to help find a balance between the neighborhood, citywide wishes and the developers. I am very proud of those accomplishments, particularly the ones that my partner has listed here previous to me and what this will mean for our community.'",
        "'speaker_0': 'As I mentioned in the December meeting, we have an opportunity here to use this project as a study upon which we can formulate a more comprehensive policy and procedure that the city can then use as its criteria for all future developments, particularly along the waterfront.'",
        "'speaker_0': 'Since we approached them, TLC has demonstrated a willingness to not only to listen to our community's concerns, but to be responsive to them as well. Further supporting the unusual opportunity that we have here with the developer, not just to sign off on a project, but to really be collaborative in our efforts to see a success that's in'",
        "'speaker_0': 'our neighborhood. That's it. Thank you. Thank you.'",
        "'speaker_2': 'But America's council members. I'm not sure whether I should congratulate or commiserate with you on censorship that evening. For quotations, I should like to quote a little line from Oscar Wilde. When people agree with me, I think I must be mistaken.'",
        "'speaker_2': '60 years ago, I became an architect and I'm still working in architectural projects. It's a key issue that one often gets a design project and one looks at the whole thing, not bits and pieces of the whole thing, because it goes out as a contract, as a rule, and you have, after all, all the pieces together and'",
        "'speaker_2': 'you get a price for that whole building. And that's what I'm used to working with, and that's what I'm looking for here. I are at the council meetings three weeks ago. I asked the then council not to pass this measure because I thought it was incomplete.'",
        "'speaker_2': 'And I still believe that there's a great disparity between the housing issues around this town, not just this one, but a whole bunch of them, and the infrastructure that is trying to support it and is not doing a very good job.'",
        "'speaker_2': 'They need to be brought into step. And I would strongly recommend that you defer this decision of going ahead until there's some decent match between infrastructure and the buildings you're going to put in. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Peter Ryan.'",
        "'speaker_0': 'Well.'",
        "'speaker_4': 'You wouldn't know that.'",
        "'speaker_0': 'I'm sorry. Peter Wong.'",
        "'speaker_2': 'Good evening, New Year and older. A Queensland and new council. Frank and Tony and other members of. Console. It's very emotional. I heard all the speakers said many things. One thing I can assure you is that I trust this developer.'",
        "'speaker_2': 'And especially Jim Lewis, Jim Mink and Tin Voice. They all kept their promises to me. And. And officially, I have sold my project to them. But I agree. If they agreed, I definitely would continue working with them. Every investment, you know, Arthur Miller, I would not take money away.'",
        "'speaker_2': 'I found some projects. I can work with them if they would. Allow me to work together. But then I think the would. And I think. All I can say is all the years I spent on friends and just harmless knows I spent $20 million on the monkey warehouse.'",
        "'speaker_2': 'I only built two roofs and some glass in the building. This project is very difficult and I'm 72 years old. I cannot spend another 40 years like I did when I first came to Alameda to do this to Monte Warehouse.'",
        "'speaker_2': 'I don't have time. Took about 40 years of my life to be involved. But I strongly urge you. To another is sent. There all are this and please approve this project because so so many things depends on this project.'",
        "'speaker_2': 'Sweeney's Open Space Park commensurate. And Northern waterfront development entranceway. Entranceway is a part of this owned by the Munch Warehouse, owned by me at this moment. So it's very important for you to approve this project to enable other project to.'",
        "'speaker_2': 'For Phil to proceed. And thank you very much. Thanks very much for your time. Thanks, John.'",
        "'speaker_0': 'Thank you. And Prachi. Mayor Spencer, members of the City Council. Thank you for your service. I'm an Iraqi. I'm a resident of the West End. I live only a few blocks from the Del Monte development also. I speak in opposition to repealing the Del Murray approval.'",
        "'speaker_0': 'Over the past year or so, most of the neighbors and many people in town have attended a meeting after meeting hearings, working sessions, working groups where we had spent a lot of time giving our opinions, our ideas, our theories.'",
        "'speaker_0': 'Some of them weren't very good, but we had lots of ideas which were all considered on what we would like to see happen to the site. We don't always agree 100%. I know we never do. But at some point, decisions need to be made so we can start finally to see some progress and move forward.'",
        "'speaker_0': 'The project has been studied to death. We have lots of reports that go on shelves. And it's time to move forward. I walk beside in front of around behind the project almost every day. It is an eyesore, but the building is cool.'",
        "'speaker_0': 'Please defeat this item and move forward with the project as it was approved. I'd love to see the project completed in my lifetime. Thank you for moving this project forward in my neighborhood. Police then, says Aaron Paul and then Patricia Young.'",
        "'speaker_0': 'Nobody gets censorious correctly. Thank you, Mayor. That was terrific. One out of 100 try. Yeah. No, that was a good one. My name is Fully Sanchez, and I come to you today as co-president of the Alameda League of Women Voters.'",
        "'speaker_0': 'So I am speaking for the league. Last time I saw most of you was at one of our forums, and that's what we do. We're not here to be emotional. We are here to be educational. So therefore, we are not taking a position for or against the Del Monte Project.'",
        "'speaker_0': 'We haven't studied it and we don't have a position on it. What we do stand for, and you all know this, is we stand for open government and transparency, and that's what you all stand for. I've heard it many, many times, and it's more than just a phrase.'",
        "'speaker_0': 'It needs to be implemented and implemented properly at certain times. I think this is one of those times and so does the league. We found that the specifically that the Sunshine Ordinance with this particular ordinance to repeal the original one we are not in compliance with.'",
        "'speaker_0': 'We are strictly not in compliance with our own ordinance. I'm going to quote you from section two, dash 91.5 of the Alameda Sunshine Ordinance. It requires that all documents material to an agenda item must accompany the agenda. What we have had before the public in the last week and a half or so since this has come out'",
        "'speaker_0': 'is basically your agenda. And the ordinance has been no staff work. There has been no purposeful disagreement. There is no specific staff reports. So our question from the league is. Who made this referral on what factual information? Is the rescission even based on?'",
        "'speaker_0': 'What are the impacts of the rescission? This is all staff work that would have to come through so that people could make intelligent decisions about whether they want to support where you're headed or they don't want to support it.'",
        "'speaker_0': 'But we have nothing to go on. Somebody else mentioned how would we replace or what would replace the loss of funds to improve the Jean Sweeney open space so it could be used by the public? Will this action likely result in a lawsuit from TLC?'",
        "'speaker_0': 'We know you met with them in closed session. We don't know. Of course, know what's happened. That's up to you. But we anticipate that won't be such good news. But all of this should be revealed so the public can appropriately comment on it.'",
        "'speaker_0': 'This is seriously lacking. We have been in touch with your city council and we had a little back and forth, you know, through email. We had another concern that she corrected us on.'",
        "'speaker_4': 'You might have meant to say, with the city attorney rather than the city council.'",
        "'speaker_0': 'I'm sorry, city attorney. Sorry, Janet. So once again, at this point, we are not taking any position on the Del Monte project itself. You all campaigned on transparency and open government, and the above issues are all serious concerns to a very involved public.'",
        "'speaker_0': 'You can see how involved everybody is out here, one side or the other. I'm glad nobody's meeting each other in alleys in the on behind the city council here. But everyone here has been working on both sides of this issue, not for ten meetings or a year, five years this has been going on that I remember seeing'",
        "'speaker_0': 'it in the paper. So once again, we're asking you to look forward. We're looking forward to working with you. We'd like you to vote against the proposed ordinances which repeal the violation of your own sunshine law. It would to repeal this ordinance.'",
        "'speaker_0': 'And we will be happy and excited to work with you on different parts of this as we go down this road. Thank you very much. Thank you.'",
        "'speaker_9': 'Hi. My name's Aaron Paul. I haven't spoken to counsel for a while, but I did come to one of the planning meetings this fall and. I want to welcome the new council. I don't look at the possible repeal tonight as a stop of the project or anything.'",
        "'speaker_9': 'I look at it more as like putting things where they should be. I felt very unhappy with that last minute vote at 5:00 when I couldn't come here from work right before the new council took their seats. I also feel that the election spoke so loudly and it it's talking about development.'",
        "'speaker_9': 'The whole development of the island needs to be looked at cohesively. There's there's been a lot of progress with the Del Monte, with the citizens groups input. And I know the staff has worked hard and I really appreciate that Mr. Wang is here because having been in Alameda, I've been a tenant at Portman Marina next to the'",
        "'speaker_9': 'Del Monte building since 1995. I've lived a block and a half away for ten years now and I know he went through a lot chain development, but where we are now, we're making progress, but we're not there yet.'",
        "'speaker_9': 'I don't think it's a good marriage with the current plan as it is. I think there needs to be a little bit more work. We need to look at the long term impact on alameda. We are an island and issues of safety have come up.'",
        "'speaker_9': 'I like what i heard with the new council members as far as a focus on jobs and and I'd like all that to be encompassed in any changes to the plan. And I'd also like to see a little bit more commercial business at that site so that more people are able to use that beautiful building, not just'",
        "'speaker_9': 'tenants in the building. And I've got a lot more opinions on this, but I'll save them for future meetings where I hope we can express our opinions again in the future. But I encourage you if if it's legal and I don't even know if that last minute vote was legal, but I would like to see this repeal'",
        "'speaker_9': 'go forward so that the current council can put the proper input, because we're all going to live with this for a long time. Thank you.'",
        "'speaker_0': 'Thank you. Patricia Young. Good evening, Madam Mayor. A city council, city staff and community members. My name is Patricia. I'm with the Alameda Home Team, and I've appeared before regarding this issue. And I'm not even going to address the issues about the Del Monte plan or the project or whether whatever this is.'",
        "'speaker_0': 'My concern is how this item was posted on the agenda. There is a lot of emotion on the island. Obviously, there's a lot of community input that has happened for two years before this. But this item has been put on the agenda with four pages that all it said was two ordinances that are repealing another ordinance.'",
        "'speaker_0': 'That is it. This the whole community citizens are left guessing whether what the problem is, is the master plan is the transportation. Is that the number of units? What is happening and for you you know the bottom line that this is to ordinances you're passing on no information at all and this is a major issue where you'",
        "'speaker_0': 'have the eyes of the community on you. What is. I mean, this is just a bad precedent for this new city council. I mean, the expectation for me as a concerned citizen is that you have an open government, that you do things, you know, with due process and with transparency.'",
        "'speaker_0': 'So if you don't do this now with this open process where there is there should be an exhibit, a rationale given. I didn't find out until tonight that it was Madam Mayor who put this on the agenda. And I'm not arguing that you cannot.'",
        "'speaker_0': 'I'm saying there's only four pages and you're going to vote yes or no on this item. And this is with the eyes of the community on you. I am very concerned that this is the trend that the new city council is going to take, because I expected more.'",
        "'speaker_0': 'And I believe that concerned citizens expected more. And so did a previous city council that voted items such as the Sunshine Ordinance. And I believe that you should ask, you know, you should expect more from yourselves and from each other that you're going to do this with transparency.'",
        "'speaker_0': 'So I believe that you can reach under this item and come up with a rationale for it. And if there is no timing for that, because I have no idea. And certainly there's you know, we have an excellent city attorney and she can give you legal advice.'",
        "'speaker_0': 'Then you vote no. But I see that that those are the only two choices, because otherwise then you're sending a very clear message to the rest of us that we need to watch you if you're willing to to vote on an ordinance on two ordinances with no exhibits, no rationale, no staff report, what else is going to'",
        "'speaker_0': 'happen? And honestly, you know, we're all busy working people, but if, you know, we need to watch you closely, then please send us that clear message and vote yes. Otherwise, if you are open, you know, if you're all for open government and transparency, then vote no or vote to gender one or the other.'",
        "'speaker_0': 'Thank you for your time. Thank you. Our next speakers, Ken Peterson and Cook and then Ron Lamar.'",
        "'speaker_2': 'At American Council. Again. Good evening. I'm going to seem to pick on the city attorney a little bit that I don't intend to regard this current. But I recall a circumstance of the council meeting a few years ago in which a zoning issue came up and come through from the planning board and on appeal.'",
        "'speaker_2': 'And the Council must have talked about this for 45 minutes. All kinds of different issues came up, opinions and so forth, and they kind of wound down and and Lena Tamm hadn't said anything. And so. It was kind of quiet.'",
        "'speaker_2': 'And she leaned forward. She said. What is the law? The council backed up her call and the mayor looked to the city attorney. What is the law? And the city attorney said it is illegal. And so they approved the appeal and rejected the planning board's illegal action.'",
        "'speaker_2': 'It's really nice to understand about the law. The other thing I understand is that the city attorney gave an opinion about this process earlier. And her opinion was, this is characteristic of the way the city operates. I agree this particular situation with its associated matters appears to be incomplete.'",
        "'speaker_2': 'Irregular. Incorrect. Improper and illegal on the face of it, for no other reason. You have to look at the state statute requiring that ordinances be taken up in regular sessions. This was not taken up in a regular session.'",
        "'speaker_2': 'It appears on its face that the measure that was voted on December 16th is void and the contract would be invalid and that the city manager would be improperly would be improper if he signed it. Thank you.'",
        "'speaker_0': 'And cook. Good evening, Madam Mayor and members of the City Council. My name is Anne Cook, and it's a pleasure to be here this evening. Well, actually, perhaps not a pleasure. I'm probably shouldn't be counted in the 40 some people who think we still need to talk about this.'",
        "'speaker_0': 'But I did want to have a chance to to just share my views about this project with you. I agree with a lot of the other speakers about all the reasons why this project should go forward. I think it's a fantastic project, but I'd like to focus on three perhaps somewhat different aspects of the project because I'",
        "'speaker_0': 'think they haven't really been touched on. One is waterfront planning what is good waterfront planning. The second is regional planning and the responsibilities that we have to look at regional planning issues. And the third is what many people have touched on, just the long range planning and development process and why it's important that a decision be final'",
        "'speaker_0': 'at a certain point with respect to waterfront planning. It's my background. It's my passion. I was on the planning board and I think I probably voted down as many waterfront projects as I voted yes for, which was really hard for me.'",
        "'speaker_0': 'But I just felt like many of them weren't good enough, that we deserved better, and that the waterfront is a really poor, important asset and a resource that we have and that we don't really value enough in the city.'",
        "'speaker_0': 'I feel like this project is an amazing waterfront project. It it has the ability to bring both residents to the waterfront and to activate the waterfront, have retail uses in the waterfront. And that's really hard to do in the world of waterfront planning.'",
        "'speaker_0': 'There's so many restrictions on how you use the shoreline, whether it's from the state lands or bccdc. And it's really just trust me when I say it is such a great thing to be able to go. And we have a historic building on the waterfront with residential uses.'",
        "'speaker_0': 'It's just really hard to do and it's a wonderful opportunity and it's a great use for this building. And I think that I just really wanted you to know that I felt strongly about that. Residential uses on the waterfront make it a safe place for people of all ages to be day and night.'",
        "'speaker_0': 'And it's really hard if you don't have residential use on the waterfront to make waterfront truly accessible to everybody. The second issue that I really want to focus on is regional planning. I think in some ways it's great that the last five days have been spared the air days, because as you're sitting here and wondering why your'",
        "'speaker_0': 'lungs hurt, why your children's lungs hurt. I think it is because we don't do a good job of balancing jobs and housing, and we don't, as individual cities, meet our regional, affordable housing goals. And we don't provide new types of housing to the people that want to use them.'",
        "'speaker_0': 'In my work, where I work with other planners, I'm the Neanderthal that drives a minivan around with two kids in it. Everybody else that has kids that's younger than me, which is just about everybody in my office, they're all on their bike with their kids.'",
        "'speaker_0': 'They're walking. They don't care whether they can park in front of their building because they know that if they walk a couple of blocks, it's actually better for them from a health perspective. And I now am working in a very poor community.'",
        "'speaker_0': 'I'm usually at their city council on Tuesday evenings, and what we're trying to do is get people out of their cars and to get them to walk their kids to school. And I think this is the sort of project that allows people to do that.'",
        "'speaker_0': 'I had a lot of other things I want to talk about. There were so many, but I know I'm out of town, out of time. I think it's really important to respect the end of a process, and it's important that developers know with some certainty at some point whether they have a yes or a no so that'",
        "'speaker_0': 'they can get their financing and move forward. Thank you. Thank you.'",
        "'speaker_6': 'Good evening. I'm Ron Lemos. I was here a couple of months ago to speak to most of you about Mastic Senior Center. I'm the president of the Master Senior Center Advisory Board, and I'm here tonight in a couple of other roles.'",
        "'speaker_6': 'One is, as a founding member of Alameda Backyard Growers, we harvest and glean fruit and produce from yards all over Alameda Island and make it available to the recipient at the food bank. Last year we donated just over two and a half tons of food to the food bank from unused trees and produce in the community.'",
        "'speaker_6': 'That has led to a role as the coordinator of the steering committee or the community garden in Jean Sweeney Open Space Park. That committee of about a dozen scientists, teachers, recreation people and master gardeners has been for the last seven months meeting monthly to try to develop the best possible community garden that we can in having credible'",
        "'speaker_6': 'space that we have. And we've talked about policies and procedures. We've talked about implementation. We've talked about how much of the produce can be sent directly to the food bank to alleviate the food shortages on the island. And recently we've begun talking about fundraising.'",
        "'speaker_6': 'Fundraising not only for the community garden, but that is a part of the entire Jean Sweeny open space fundraising. Before retiring, I spent 40 years raising money. I will tell you one simple truth about fundraising. You need a big gift to kick it off.'",
        "'speaker_6': 'If we looking at $10 million. For the gene 20 open space park and Community Garden. We very much need the accelerator the Tim Lewis communities has provided as a part of this project. So without any emotion whatsoever, contrary to the previous speaker, I'm simply telling you a fact there will be a very serious unintended consequence should you'",
        "'speaker_6': 'move forward with this rescission. And that consequence will have enormous impact on that 22 acres sitting over there waiting for development. Please keep that in mind. Thank you.'",
        "'speaker_0': 'Next speakers, Lois. Lois Pryor, William Smith and then Jay Ingram. Yes. Hello. I'm Lois Pryor and I have been working on fair housing and affordable housing issues since 1965, and I have never seen a time when there was enough affordable housing in Alameda for the people that need it.'",
        "'speaker_0': 'And I think this this proposal will go a long ways toward beginning to ease that problem. If if we go if if you decide to go ahead with the project, the people that will benefit the most will be the the people who need affordable housing, places to live.'",
        "'speaker_0': 'If you don't go ahead with it. If you if you repeal it, the losers the biggest losers will be the people that would have had a dwelling or an apartment in one of the units there. And it's a variety of of housing units, which is what Alameda needs, too.'",
        "'speaker_0': 'It's not all the same kind of housing, but all the way from studios, two, three bedrooms. I think it's an excellent project and I hope you decide to go through with it. It's not only the housing, but it's as the last speaker mentioned for for the the park.'",
        "'speaker_0': 'And if if you don't go ahead with this, there will really be repercussions by the. Not no money for the park and and also the extension of Clement Avenue. And I really think to to repeal this would be, you might say, the height of insanity.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'And even in council members and staff. I'm William Smith, speaking on behalf of hip hope as vice president. And we're, of course, a poet. We are opposed to the ascension of this ordinance. On their hand, we also recognize that there are many problems that accompany large developments like traffic and so on.'",
        "'speaker_6': 'So we are we do think that we do want to address those separately. But before I get to that, I want to cover some of the issues that we are concerned about with this rescission notice. First of all, it would appear that generally the decision of this ordinance would likely violate the city and the state housing element'",
        "'speaker_6': 'and also the potentially bonus ordinances that we have here. And give you one example of that. Basically, the housing element appears to require and the housing law period require 30 units per acre and there's 11 acres out there that's about 330 units.'",
        "'speaker_6': 'And then you apply a density bonus of about 15%. You come up with about 300 units. That's the minimum number of units that could be required to stay. And that's possibly that's that's the first reading of it, this complicated law.'",
        "'speaker_6': 'And as the League of Women Voters pointed out, we really need to see these types of issues outlined in writing before they go up. And so that's one issue. Then there are some less direct ways that this has negative implications for the housing element.'",
        "'speaker_6': 'Lot one we need density to promote transportation, unbundled parking spaces and alternatives to automobiles make housing cheaper or affordable housing people, they make it less expensive. They give them options to drive, to get to work, to get to play, to get to school.'",
        "'speaker_6': 'All of these things and reducing the density of that goes against that and also makes it harder to fund that housing as well. And I think that it's not stated in any written report, but from gathering from the comments here in the audience, a big object, a big objective of those who want to rescind this is to'",
        "'speaker_6': 'bring the proposal back with fewer housing units, and I'm not sure that that's possible and to still remain within state law. But yeah, the real. And then the other issue is. Is the fashion of the dusty bazaar that's given to allow the developer to finance the housing and produce a number of market rate housing that gives them'",
        "'speaker_6': 'less ability to finance the housing. We haven't heard from the developer whether or not reducing the number of units would still enable them to finance the affordable housing portion of this as well. And we worked very hard to write Reno housing advocates and these housing organizations and our attorneys worked very hard to make sure that language was'",
        "'speaker_6': 'in that development agreement. And that master plan commits the developer to fund the final fund of affordable housing, not the housing authority, but the developer. If the Housing Authority contributes in other people, Caribbean, great, but it's the developer in the land who's responsible for that.'",
        "'speaker_6': 'Now what light seen, I think, is the big problem really is trans is transportation and the cars that come in. And for that, I think Tony De Stark has a great idea to do a separate city wide transportation plan.'",
        "'speaker_6': 'And I'd be glad to talk about that later.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Oh. Good evening, Mayor. Vice Mayor.'",
        "'speaker_6': 'Members of the council. Excuse me. I'm going to read because I think I have a lot of stuff here and don't know if I can fit it in in 3 minutes. I've been cut off before.'",
        "'speaker_2': 'Jay Ingram. I live in 1300 block of Pacific Avenue. I'm probably one.'",
        "'speaker_6': 'Of the closest, if not the closest neighbors to the Del Monte property. I can throw a rock from my backyard over to the Del Monte property.'",
        "'speaker_2': 'Not that I've tried, but in that close I'm a neighbor of the project and I don't mind the truck traffic. I personally think the pessimism me says that around Thanksgiving time, the city kind of organized.'",
        "'speaker_6': 'That to get the trucks to be rolling in through there.'",
        "'speaker_2': 'And but that's that's another story. Let's talk about due process for a second. As one of an.'",
        "'speaker_6': 'Engaged neighbor vendor planning board meetings.'",
        "'speaker_2': 'Their initial meeting at Mastic Senior Center looked at a lot of glossed over ties with the planning board members and the council members as well. So I appreciate this opportunity.'",
        "'speaker_6': 'I do support the repeal.'",
        "'speaker_2': 'I repeat, I support the repeal. And I am one of those neighbors that's not really concerned about the truck traffic at this point. Allow me to point or status quo is okay with me for now. Allen told me the point is on his third master developer right now.'",
        "'speaker_2': 'And so why rush this process? The first developer, for the point, didn't sue. From what I remember, the second developer, Sun Cao, did sue. But I think the city settled.'",
        "'speaker_6': 'So don't be scared.'",
        "'speaker_2': 'By the legal advice that you may have received in closed session. And I play it through a little bit, talk it out a little bit more and discuss more of the issues. A lot of issues are coming up tonight.'",
        "'speaker_2': 'Alameda point is prime property. The fact that if tim lewis community partners leaves and the scare tactic that nobody else is going to come back.'",
        "'speaker_6': 'I just I don't, I don't believe it for a minute. Mm. Prime property, the 300 foot notice message.'",
        "'speaker_2': 'I wonder how many houses that is. I'd be interested to find out. And we're talking about 15 houses. I got some notices. I didn't get other notices. Some didn't have dates on it, didn't have times on it. So the news messages were kind of sketchy.'",
        "'speaker_2': 'Again. There's no need to rush this project. Project started in.'",
        "'speaker_6': 'February or March. It was approved in December.'",
        "'speaker_2': 'That's City of Fremont Speed Development. I don't think Alameda is similar to Fremont in developing that things that quickly. The July Mastec Center meeting was an eye opening experience.'",
        "'speaker_6': 'Felt like it wasn't. Listen to the community as.'",
        "'speaker_2': 'Some of you may have been there. The community wasn't listening. Tim Lewis Community Partners has changed, in my opinion, very few things. There's a looks like what a metal appendage coming out of the.'",
        "'speaker_6': 'Historic beautiful building.'",
        "'speaker_2': 'Now hasn't changed from the Mastic Senior Center building. There's a lot of nice design concepts, but I think the basic metal structure with the four or five stories going up is just ugly.'",
        "'speaker_6': 'It could be improved.'",
        "'speaker_2': 'Ten worst many partners hasn't done anything density in that particular area versus the density. Alameda point 1500 homes in that particular area. I believe in 1400 homes in 700 acres at alameda point doesn't pencil out to me. There's been a lot of public meetings, 12 one city council meeting for 5 hours and the public comment started at'",
        "'speaker_2': '1030 in the evening and went to 1:00 in the morning, repeal this hastily formulated ordinance and discuss it more. There's a lot of unanswered questions on the development that I don't know if the.'",
        "'speaker_6': 'Planning board can handle at this point. And I think it's going to go back.'",
        "'speaker_2': 'To the planning board and I don't know if they're set up to handle it. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next speaker Ray Graber, then Jim Smallman and then Melinda Hays. Ray Graber. Good evening. I'm asking the City Council to seriously consider repealing the Del Monte Ordinance or make a declaration that this ordinance is invalid and must be corrected before moving forward.'",
        "'speaker_0': 'Why? Because we need to preserve the city's integrity and to observe the rule of law. This ordinance was rushed through by the prior city council, whose members were largely termed out or voted out by a dissatisfied city's citizenry.'",
        "'speaker_0': 'I find this entire process sort of an embarrassment to us as a city. And this ordinance has some serious defects. Although the public has been told there are penalties for the developer, for the developer, if the TDS or traffic demand managements do not work.'",
        "'speaker_0': 'There are in reality no penalties under this ordinance. If the teams fail, the city and the residents will be left in with the negative repercussions of failed TDs. This is what happens. Again as a result of rushing through the Del Monte ordinance.'",
        "'speaker_0': 'After the fact, we learned that information was left out of this ordinance regarding the density bonus units, their size, their placement, their design. This is in direct violation of our Alameda Municipal Codes regarding density bonus. Therefore, this ordinance, as passed, appears defective.'",
        "'speaker_0': 'I ask the City Council tonight to vote for a repeal of this defective ordinance. I also asked the Council that the in lieu of a repeal, that the Council make a declaration that this ordinance is invalid and must be corrected before moving forward.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'That's good.'",
        "'speaker_6': 'Yeah, that's fine. Thank you. I'm Jim Smallman, and I'm here representing the Alameda Preservation Society, and we have generally supported this project. It's tempting, of course, to find flaws in any proposal. And and there are flaws in this one.'",
        "'speaker_6': 'We feel it's too big, too dense. The traffic measures, which have been talked about considerably tonight are are trailing the development of the design. But most of our input has been in design suggestions. And I've distributed or we've distributed a letter that we wrote in June of last year.'",
        "'speaker_6': 'And there's been distributed to all of you. I have extra copies of you if you need them of making some suggestions for mitigating the design. One of the concerns that we have is that the central portion, the new construction, is taller than we feel it really needs to be.'",
        "'speaker_6': 'The ceiling height inside the dwelling units is nine feet three inches as the design sits today. And I would guess that most of the people in this audience are living with eight foot ceilings. So nine foot three is unnecessary.'",
        "'speaker_6': 'And with the number of stories that are in this building, we could lower that that what the picture shows is the storyboard and it's been enhanced. So you can see it. It's hard to hard to see the actual storyboard, but that shows how high the center portion will be.'",
        "'speaker_6': 'And we feel that it's higher than it has to be as a preservation item. The new construction should be subordinate to the basic building, and we feel it's not as subordinate as it should be. But we need to compare in, in our own minds this with the alternatives.'",
        "'speaker_6': 'We one of the things that preservationists know is that if a building is unused or underused, it tends to go away. And there was an example with the brought up earlier of we're not comparing this against perfection here, that the trucking and the traffic and the things that are going on with this building now and the appearance'",
        "'speaker_6': 'of it is certainly far from perfection. So we have to have some balance. We'd like to see this building saved. We'd like to see this project. Go ahead. But we'd like to see still and it's not too late to see some design changes made that would mitigate some of the visual aspects.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Linda Hayes. Then Joe Corcoran and then Virginia Bergstrm. Happy New Year. My name is Melinda Hayes. I have been a resident of Alameda for almost 50 years. I've lived in four different locations. I've taught school at and Snell.'",
        "'speaker_2': 'At the.'",
        "'speaker_0': 'Alameda High School and High School. I've been very involved in this community. I. I was stunned to read that this ordinance was up for a repeal. Didn't know the reason because it was not given. Madam Mayor, you introduced this as saying you were the one who put it on here because you wanted to have a say.'",
        "'speaker_0': 'You wanted the new council to have a say. There have been so many meetings on this. I believe you have had your say. You have spoken to it. Everyone had a chance. All of the council members had an opportunity to talk about this and to bring forth your concerns.'",
        "'speaker_0': 'Why now? Are you now saying, you know, I want to be I want to repeal it. I want to look at it again. It has been studied and studied and studied. It is time to to go forward with this project.'",
        "'speaker_0': 'I remember this Del Monte building when you could tell what season it was because of the smell of the tomatoes being processed. I've driven past this very many, many times. It is an eyesore. It needs to be restored.'",
        "'speaker_0': 'We need the 30,000 feet of commercial space that's available. We need the housing. We need the affordable housing. By delay by if you vote council members to look at it again, you are putting it off further and further and further.'",
        "'speaker_0': 'We Armenians need to know we can trust our our city council members and to trust them to do the right thing and. What it sounds like is that it is two petulant decision. I didn't get my way. I'm going to do it my way and bring it up again.'",
        "'speaker_0': 'That is that is not what we want from our counsel. We want to be able to know that when a council makes a decision, that decision is, in fact, held. Please do the right thing.'",
        "'speaker_2': 'Hi. My name is Joe Lauren. I'd like to thank Trish for running for mayor. Congratulations on winning. The people in this town elected you because we were tired of being.'",
        "'speaker_6': 'Railroaded by the past.'",
        "'speaker_2': 'Administration.'",
        "'speaker_6': 'Having meetings shoved down our throat, like in December. Short notice, insufficient notice. The list goes on. Thank you for running. Thank you for being our mayor. Congratulations. I would like to say everybody in this room has a great.'",
        "'speaker_6': 'Reason to thank the theater opposition group. The theater opposition group gave us a better theater. If we didn't have the theater opposition group, we would have settled for second best. The same is true here with Del Monte. The Del Monte project has plenty of flaws.'",
        "'speaker_6': 'We all know that, and even the city planners are willing to admit it. It's been rushed.'",
        "'speaker_2': 'In a way that it's questionable whether it's even legal.'",
        "'speaker_6': 'And so I say before we move ahead, we need to stop and pause and think about this a little bit.'",
        "'speaker_2': 'And there's nothing wrong with that.'",
        "'speaker_6': 'All we're going to get is a better project, not second best. And so I don't have a problem with slowing this process down. We were railroaded in December. Everybody knows that you were elected by a majority and.'",
        "'speaker_2': 'So you have to consider the community.'",
        "'speaker_6': 'I have one last comment I'd like to share. This is my opinion. I think the Del Monte project is nothing more than a four storey trailer park. Alameda deserves better. It's not really the asset.'",
        "'speaker_2': 'Everybody believes, and the only thing it guarantees are traffic problems. So slow this process down. There's no hurry. And congratulations on becoming the new mayor. Thank you.'",
        "'speaker_0': 'Thank you. Virginia Bergstrom. Hello. I'm Virginia Bergstrom. Thank you for letting me speak. Congratulations, Mayor and City Council. I'm hearing all these things. I'm not a political person, but I'm a voting resident of Alameda. And I know that you were voted in to slow down a lot of building and process that was going on in Alameda because'",
        "'speaker_0': 'we have to maintain the quality of life here. We're an island. I'm hearing people say I'm right next door to Del Monte. I'm right here. We're well, it's only two miles by four miles. Every one of us is impacted by improper growth.'",
        "'speaker_0': 'I'm hearing a lot about this project. It doesn't sound like it's complete. It doesn't sound like it's been 100% thought through. And I'm really welcome that you re looking at this again and making sure that you have a building with quality.'",
        "'speaker_0': 'Thank you. Next speakers Nancy Gordon and John Spangler and then Mike Hanna Barry. John Spangler.'",
        "'speaker_6': 'Thank you, Mayor Spencer, members of the council and staff. I've been keeping track so far. I have nine speakers in favor of the motion. The audience before you tonight. I have I have 24 opposed just four grins and I have no idea what the results will be with people behind me who are against this ordinance.'",
        "'speaker_6': 'Please raise your hands.'",
        "'speaker_2': 'Against the ordinance before us tonight in favor of the Devil Del Monte. Okay.'",
        "'speaker_0': 'Hey, right.'",
        "'speaker_2': 'Here again for the Del Monte.'",
        "'speaker_0': 'Addresses your race. I'm sorry. Let's. Okay.'",
        "'speaker_6': 'Okay. Never mind.'",
        "'speaker_0': 'I'm sorry.'",
        "'speaker_6': 'I knew it would be confusing because the ordinance itself that is before you tonight, which is to rescind the Del Monte development, is confusing. There is no staff report as well-documented by the league women voters and anybody who looks at the agenda for tonight.'",
        "'speaker_6': 'There are no links to a staff report. There are no reasons that have been presented by the mayor or by staff. On the merits of the proposal other than the one mentioned for the first time in public tonight by the mayor herself.'",
        "'speaker_6': 'No advantages to rescinding the project as rescinding the project. There is there's something really wrong with that. When there's a big project underway like this that has been fully vetted as.'",
        "'speaker_2': 'Legally been processed, reviewed by hundreds of us. Over a dozen meetings.'",
        "'speaker_6': 'Last.'",
        "'speaker_2': 'Year. In the almost.'",
        "'speaker_6': '20 years I've been in Alameda, Peter Wong came up with several proposals. Nothing made it to the city council even even a couple of times to the planning board for a preliminary review. But nothing as far as the Tim Lewis community project got.'",
        "'speaker_6': 'Stimulus Communities wants to put $128 million of economic investment into this community and worse by this ordinance that is before you to stop the development. Telling him to go away. That is crazy making. I'm sorry I sent you all an email earlier.'",
        "'speaker_2': 'Like I believe this last night. About this project. You all know.'",
        "'speaker_6': 'I'm in favor of the Del Monte. I'm glad to see something finally getting done with that derelict property. And I don't mean acting as a warehouse for a big box retailer. I support the previous comments and legal and voters and the comments that you may hear yet from the only two renters coalition representatives from Individual Haven whose'",
        "'speaker_6': 'remarks they supported last month also, and from Hill and Sasse and other supporters of this project. It's time to go ahead with it. It will get taken care of. All the concerns. We're all not going away. We're going to be here to help solve those problems.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_0': 'I Canterbury.'",
        "'speaker_6': 'Good evening, Madam Mayor. Members of the City Council staff. My name is Mike Canterbury. I'm a lifelong Alameda resident and president of the Planning Board. I come before you tonight to whom I feel, and I better put these on.'",
        "'speaker_6': 'I come before you tonight to urge you not to rescind the decision of the City Council to proceed on the development of the Del Monte property. Let me tell you why. The decision process, which led to the vote to approve Del Monte by the previous council was lengthy, sound and fully transparent.'",
        "'speaker_6': '11 public meetings were held by the Historic Advisory Board, the Planning Board and the City Council. Many of the meetings stretched late into the night, and I know that because I was there, the length of the meetings show the amount of interest, participation and at times angst in the process.'",
        "'speaker_6': 'Matters of scale, parking, low income, housing, transportation were looked at and dealt with. It's my opinion that this process resulted in real dialog among the state, hold all the stakeholders and resulted in a fully vetted project exactly where you want to be at the end of a planning process on such an important matter.'",
        "'speaker_6': 'That is how the process went that resulted in the approval of the Del Monte project. To reiterate, it was exhaustive, transparent, and just the way it should go to achieve consensus on such a thorny issue. That brings us to tonight's discussion.'",
        "'speaker_6': 'To rescind the approval of the project after approval by the historic advisory board, the planning board and the previous council. If a vote is taken tonight to reverse the previous council's approval of Del Monte, it cannot be done by blaming the process.'",
        "'speaker_6': 'The process was not flawed, was done by the books.'",
        "'speaker_2': 'Such a decision to rescind this can only be laid at the foot of politics.'",
        "'speaker_6': 'Elections have consequences. I get that. I'm a union official. I run for election every three years. But let's face it, this is about politics. There's a small minority of Alabamians.'",
        "'speaker_2': 'Who will always believe.'",
        "'speaker_6': 'There is a hidden agenda behind every bush, a shady developer around every corner. And just because the facts are the facts, it doesn't mean they're true. They oppose all residential development. If you reject Del Monte, it will satisfy them.'",
        "'speaker_6': 'But it will throw all of Alameda renters under the bus because we're putting a cap on our housing stock.'",
        "'speaker_2': 'And that is going to lead to higher rents.'",
        "'speaker_6': 'The city council is free to take whatever position you want on this. I urge you to uphold the approval should you choose not to allow the project. You should be honest as to why you're making that decision.'",
        "'speaker_2': 'It's about politics, not about the process. Thank you.'",
        "'speaker_10': 'Yes. Laura Thomas.'",
        "'speaker_0': 'Jamie Harrell and Andy Balaban. Let's try again. Laura, Thomas, Jeanne, Meryl, and then Andy of our leaving. Yes. Thank you. Oh. They didn't.'",
        "'speaker_7': 'Oh, my goodness. Good evening, Madam Mayor, members of the council. And congratulations on your election. And let's see here. I'm Laura Thomas. I represent Renewed Hope housing advocates, which has been working to get affordable housing built since 1999, when the last tech boom forced a lot of people out of Alameda.'",
        "'speaker_7': 'And over the years, many aluminums have learned, I think, a lot through our work and our advocacy that a healthy community. We're all kinds of people can. It's it's good to have a healthy community where all kinds of people can live and have stable lives.'",
        "'speaker_7': 'That's why it's kind of disheartening to hear people question the affordable housing portion of the Del Monte project and call it inadequate. We have the developer's guarantee that the housing will be financed and built. The phasing for the affordable housing is clearly spelled out.'",
        "'speaker_7': 'The the developer can't even get a building permit for any of the market rate units until they've signed an affordable housing agreement. The city with an approved development plan and design review. For the affordable housing, and they can't occupy any of the market rate unions until the affordable housing has a building permit, which means it's got the'",
        "'speaker_7': 'construction plans and the financing in place. Now, if people are worried about what the design of the standalone affordable housing is going to look like, they could look at the four standalone projects we've already built in Alameda for low income people, and they're all fine projects.'",
        "'speaker_7': 'They're called Jacques Upon Vila, the Islander, Shinsei Gardens and the Breakers. Okay. And if if we didn't think a beautiful, safe, habitable, habitable project would come out of this development agreement, we wouldn't have supported it. To be second guessed by critics who haven't been involved at all is pretty disconcerting.'",
        "'speaker_7': 'Anyone concerned with how affordable housing gets built, whom it gets built for, how it's financed, and who the people are that deserve to be in it can always come and work with us. We're a totally open group and we've been around for ten years.'",
        "'speaker_7': 'As I said at a previous hearing, these 55 affordable units, as well as the market rate units, will provide needed housing in the city. Suggestions to lower the number of market rate units while insisting the affordable can be preserved may seem like some sort of a noble stance.'",
        "'speaker_7': 'But it will make it very difficult to finance the whole project and in the end it'll doom it and we'll get nothing. We're hoping you don't vote for this appeal. If you reject this project, it will be inconsistent with the city's housing element density bonus.'",
        "'speaker_7': 'And it'll impact. The impact will fall disproportionately on people who need affordable housing in this town. There seems to be a divide in this town between the haves and the have nots, the haves own homes, or are part of a techno meritocracy who can afford the high rents and the have nots or renters of normal decent means'",
        "'speaker_7': 'who happen to number over half the population? And I think appealing this project will just make the divide worse. Hope you don't do it. Thank you.'",
        "'speaker_0': 'Yeah. Jean Mayor. Hello. My name is Judy Merrill and I live with my family on Sherman Street, a directly across from the Demko trucking facility in the Del Monte Warehouse. The project before you is both neighborhood friendly and environmentally smart.'",
        "'speaker_0': 'It'll bring, as we've already discussed, affordable housing, alternative transportation, including a water shuttle, increased AC transit bus passes for new residents, along with millions of dollars for Jean Sweeny Park and the much needed Clement Street extension. And the project is consistent with a green, urban vision for the city of Alameda.'",
        "'speaker_0': 'Mayor Spencer, I wanted to remind you that the Green Party platform supports the kind of development considered today. The platform calls for, quote, promoting urban infill with affordable housing, mass transit and more. The platform also calls for restoring damaged urban ecosystems and supporting policies that give communities a voice in planning future development with the goal of preventing'",
        "'speaker_0': 'concentration of polluting industries. For too long, our Northside neighborhood has been promised a vibrant new vision for our community that would end our exposure to toxic trucking and bring us housing, parks and alternative transportation. And that's exactly what their proposed and approved Del Monte project puts in place.'",
        "'speaker_0': 'I urge you to support this neighborhood friendly and environmentally smart project. We hope that you act today as the Green Council. We elected and turned down the ordinance to put a stop to the demand to project and let our neighborhood breathe.'",
        "'speaker_0': 'A clean air sign of relief. Thanks. Good evening, Mayor. Council Staff. My name is Andy Balaban and I'm a resident of Alameda and unfortunately I wasn't surprised, but I was disappointed when I found out that straight out of the gate, the first ordinance we'd be hearing was on a rescission, on a decision that had been made through'",
        "'speaker_0': 'a very distinct and long vetting of this project. It became a level of frustration to see that there was really nothing there to understand why.'",
        "'speaker_7': 'This decision has been brought forward. I've heard ideas.'",
        "'speaker_0': 'From people from the public side. Well, it could be this or we think it's that or what, but there's no information here whatsoever. And I'm left to draw the conclusion that the reason there is no information is because perhaps staff either was not given guidance or could not provide a report.'",
        "'speaker_2': 'To.'",
        "'speaker_0': 'Support.'",
        "'speaker_7': 'The ordinates that's being brought forward.'",
        "'speaker_0': 'The only thing that we have heard this evening is that this is the tool for the for the new council to speak. And I completely disagree with that.'",
        "'speaker_7': 'Everyone here was an alum, even when this is going through the process.'",
        "'speaker_0': 'Everyone here had the opportunity to attend those meetings to hear what the community was saying. And I believe almost everyone here attended both public meetings where a vast majority of this community spoke in favor of the Del Monte plant.'",
        "'speaker_0': 'So I don't find it necessary to add anything new to those in support. And I understand that there are many that are disappointed that it did. But from what I can gather, there is nothing that has been provided.'",
        "'speaker_2': 'To.'",
        "'speaker_7': 'Support this decision. So I strongly hope that you will oppose.'",
        "'speaker_0': 'And vote no on this ordinance and you will still have the opportunity to speak as this project moves forward. And of course, in that process, things can be improved and these decisions and concerns can be addressed. So please, a no vote.'",
        "'speaker_7': 'On the rescission of the Domani project. Thank you.'",
        "'speaker_0': 'Thank you. Doug Looney, Kevin Gorham, and then Lynnette Lee.'",
        "'speaker_2': 'Evening. My name is Doug. Lenny and. Today is June six, 2015. That day is important because 30 years ago this day, coincidentally, I moved to Alameda. It was six days after I got married. My parents were living here and we decided to move to.'",
        "'speaker_2': 'Alameda is a great place to raise our kids that we saw somewhere in the future there. And in the 30 years I've lived here, much has changed. Much has changed in Alameda. I did have two kids. They were now grown and out of the house.'",
        "'speaker_2': 'But one thing has not changed in those 30 years. And that's the Del Monte warehouse. It's an awfully long time to wait for something to happen and to to turn an eyesore into something that's really useful and contributes to this community.'",
        "'speaker_2': 'I'm here again tonight to support this project, as I did in December. And I want to reiterate the reasons that I'm here, spending the time that everyone else is on this. And that is because I think that the project represents exactly the kind of housing and the kind of people that we want to attract to Alameda.'",
        "'speaker_2': 'It's a transit oriented development. It emphasizes public transit. It is a place for people who don't like to take a car everywhere. Like me and many others. And it caters to those people. And I think that's the kind of people that we want to attract here and that we want to to keep here.'",
        "'speaker_2': 'I do not support every housing development in Alameda. In fact, I adamantly opposed the Crown Point project at Crab Cove. I didn't think it was an appropriate development for that location. And while it was far, far from being fully planned and vetted, the development did not look like something Alameda needs more of.'",
        "'speaker_2': 'The Del Monte project, on the other hand, is completely different. Sited at the right place, reusing a building that's currently obviously underutilized and an eyesore and provides an appropriate mix of commercial and residential, large and small housing. Very, very affordable and some not so affordable.'",
        "'speaker_2': 'This is a project that has many benefits to all of Alameda. We heard those tonight. I won't repeat them. And I don't have a problem with the city council bringing this back. The new city council bringing this back for a discussion, as the mayor suggested at the beginning of this.'",
        "'speaker_2': 'But I do have a problem with trying to change this project or delay this project. I think it would be a waste of time. I think it would be inappropriate appropriation of resources. And frankly, I don't want to wait another 30 years to get the benefits that we can get from this project.'",
        "'speaker_2': 'Thank you very much. Good evening, City Council. My name is Kevin Gorham, and I'm a 20 plus year resident on the 1500 block of Pacific Avenue. One block away from the Del Monte building. I, too, can throw a stone at the building.'",
        "'speaker_2': 'I care not to. I'm also the assistant principal at Internal High School. I also work in the city as well. I must admit that I'm dismayed and embarrassed that we are here once again tonight to rehash the already approved El Monte project.'",
        "'speaker_2': 'While other newly elected city councils and mayors in surrounding areas are today working with city agencies, building relationships and reports with city constituents. We have a new council wasting our time and taxpayer money. To try to derail a already approved project to enhance a blighted area of Alameda.'",
        "'speaker_2': 'To the naysayers who continuously point to traffic and parking as attempts to derail innovative projects. I point to the library and the theater as projects that were attacked by the same old Alameda arguments. And I ask those naysayers to think of our downtown area without a theater and without our incredible library.'",
        "'speaker_2': 'So I asked the city council tonight to not rescind the Del Monte project. Let's move forward with this innovative project that is going to benefit all aspects of our city. Thank you.'",
        "'speaker_0': 'At the meeting. Mayor spencer and members of the city council. I'm lynette lee and a member of renewed hope and also the alameda home team. I continue to support the del monte project and its progress forward. I speak against tonight's proposal or ordinance proposed ordinance to repeal that, the previous approvals.'",
        "'speaker_0': 'I agree with Patricia Young of the League of Women Voters and others who spoke that there was no background information or reasons specifically for the repeal. I at both December meetings, the previous mayor gave Mayor Spencer. Councilman Miller SC Councilman elect Morrissey and also Councilman Jim Odie the first opportunity to speak on the project both times and'",
        "'speaker_0': 'to express your concerns. And what I heard primarily from tonight from the mayor, Mayor Spencer, was, wait, don't vote.'",
        "'speaker_7': 'Let us.'",
        "'speaker_0': 'Vote. But we didn't hear your specific concerns about what your concerns about the project. And I still don't know what those are. I did hear from councilman literacy that you were concerned about jobs. What I heard the developers say tonight is that there would be 900 jobs.'",
        "'speaker_0': 'But also, other speakers said people who have jobs here in Alameda also need housing opportunity. And there are so many renters here in Alameda are desperately trying to stay in Alameda. They've lived in Alameda for many years. They want their children to finish school here.'",
        "'speaker_0': 'And there are hanging by a thread because they cannot they are getting priced out of the housing here. Please give an opportunity to have more affordable housing. Even market rate housing is sorely needed here, along with all the other benefits.'",
        "'speaker_0': 'And Councilman Odie, thank you for your respect of the process, as you stated earlier. Thank. Lester, Carol, Gail, Jason, and then Doug, Don.'",
        "'speaker_2': 'Good evening, Madam Mayor. City Council. Lester Cabral, resident of Alameda. I do own property down on Pacific. Born and raised on a north side. We do need to look at this. I'm in favor of opening this up. There's no doubt.'",
        "'speaker_2': 'And I've heard from a lot of speakers here about some real gray areas that we don't have answers to. And of course, the number one is transportation. We need some guarantees that AC transit or whoever is going to provide some service down there because there is none.'",
        "'speaker_2': 'And we need to address that. And I believe with the new council here that we could get some definite good answers there so we can make this thing right. The other issues, of course, is parking down there. We you know, the parking is going to be tough.'",
        "'speaker_2': 'We need to address that. We need more parking. There's also going to be some commercial businesses down there. That part needs to be addressed a little better to really know exactly if we're going to put a 7-Eleven in there or what you're going to have and what type of operations are going to be going on.'",
        "'speaker_2': 'This stuff all needs to be addressed, and I think those issues should go before city council here and get some direct answers. I've heard a lot of people here tonight complaining about, you know, different aspects of what the developer's going to do in this and that.'",
        "'speaker_2': 'Well, I noticed on quite a few pictures, there's still some for sale signs on that building. My understanding is the developer does not own this property. I know he's been after it. And I'm sure I'm sure you'll probably follow through with what he's going to do.'",
        "'speaker_2': 'But in the meantime, he hasn't put any money on the table and the place has not gotten any better. And I think those things are something that we need to get with the developer on and say, hey, let's let's show a little faith here and let's start doing something instead of just talking about it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Good evening, Madam Mayor. And Council with or without. I'm kind of shocked to find out. I lived in a blighted area, and I think my family's going to be kind of shocked. They live in a blighted area. I don't think we're here to count on our fingers.'",
        "'speaker_0': 'Who in this room is nay or yay against? For or against the Del Monte Project? There's 70,000 people in this city, and that's. Who? Who you're working for. And the Del Monte development doesn't just affect the neighborhood. It affects everybody in this city.'",
        "'speaker_0': 'And I want to thank you for doing this tonight, for your openness, your transparency, transparency and your integrity. Otherwise, if you didn't have that, we wouldn't be here tonight. Domain is the first development of many to come. And I've I've not heard from really anyone that says don't do it.'",
        "'speaker_0': 'But what we're asking is to do it right. Let's do it right. Because we only have one time to do it. Let's also keep in mind that we'll have almost. A thousand units within three blocks when this is done.'",
        "'speaker_0': 'We've got. It's now terminals behind this to come and down the street. We've got another one happening. Traffic and transportation for all the upcoming developments must be addressed now. I'm concerned why the inclusive, low income housing, why there has not been a replacement for this and why it hasn't been determined.'",
        "'speaker_0': 'If anyone thinks that people are going to give their cars up and they're going to take water, taxis and things. Take a ride down to Alameda Point. Where the where you catch the ferry, you will be astounded at the amount of cars they are parked anywhere and everywhere they can to take the water taxi.'",
        "'speaker_7': 'It's.'",
        "'speaker_0': 'It's not going to happen. It's. And as I stated before, the developer. Is working for us. All of us. Ask or demand. And you will receive. Ask for the best. And I'm not a betting person, but I would say if we had an earthquake.'",
        "'speaker_0': 'Bomani would be standing, and that, too, would be floating down the estuary. Before. He continues. My understanding as we approached 1030 and that's like 1026 right now that we need for votes if we're planning to continue to consider any other items after this.'",
        "'speaker_0': 'And there are we still have, I think, probably about ten speaker sets here. And the.'",
        "'speaker_4': 'So at.'",
        "'speaker_0': 'Least seven speaker slips.'",
        "'speaker_4': 'That a mayor?'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'Are the other items still to come? Ones that could be continued to another meeting.'",
        "'speaker_0': 'So that we can discuss that. I think the majority of the items are the referrals list and I think we moved other things up. The other public items up already. So then we have city manager communications or communications on non agenda items and then council referrals and there's one, two, three, four or five council referrals.'",
        "'speaker_0': 'Of pleasure of council.'",
        "'speaker_2': 'Adama, if I. If I may. Yes. The, the oral communication and the city manager communications are not action items, so they don't count. The council referrals are.'",
        "'speaker_0': 'Thank you. So it's my understanding then the other items remaining would be all the referrals.'",
        "'speaker_3': 'And I would like to move to. Be able to take new items after 1030.'",
        "'speaker_0': 'Second that all those other comments. We have a second.'",
        "'speaker_4': 'We have a discussion. Yes. So I actually haven't spoken directly to the mayor, but I've heard it said that you prefer not to have meetings, go to 11 or past 11. So I was trying to be deferential to you.'",
        "'speaker_0': 'And if so, I would have a question. So and I also want to respect the people here. That is a concern of mine. When we have meetings go on. Honestly, from for me, when we have meetings that go to 230, you know, 1230, I don't know how many of you have jobs, but I really prefer unless we'",
        "'speaker_0': 'have items that we really that we feel like it makes it time matters if you look at it and also than how much time these will take to address.'",
        "'speaker_3': 'Thank you, Madam Chair, and thank you. Council member Izzy Ashcraft. I think the points that you're raising are are certainly worthy of being considered. But the thing to think about, though, is one can't really speculate what's going to happen at the next meeting.'",
        "'speaker_3': 'So it's altogether possible that we might find ourselves in the same situation. So I think maybe we should play it by ear as the thing and then as at when when the item does come. Can we at that point in time, request for it to be postponed till later?'",
        "'speaker_0': 'Yes, we can do that. And also at 11:00, Q will take another vote to go beyond 11:00.'",
        "'speaker_2': 'Okay.'",
        "'speaker_8': 'Let's move on and see what happens.'",
        "'speaker_0': 'So we have a motion in a second. All those in favor. I oppose, but motion passes.'",
        "'speaker_4': '41. I guess. I'm sorry I didn't vote. Okay. I will vote yes because we'll reconsidered 11 whether to go past 11. But I appreciate paying attention to what you've said.'",
        "'speaker_0': 'Thank you. You're welcome. All right. So at this point, we can continue with our speakers. Dr. Hahn, thank you.'",
        "'speaker_2': 'Dr. Hahn. I've heard a lot of real. Overtures that are people are extremely upset and things are going to change. I believe and I haven't heard your discussion yet. If you take this off the table, I'm sure you you are not canning the whole program.'",
        "'speaker_2': 'You're looking for information and I'm looking for that discussion. Some of the things that we're going out here with, we're only fair tactics. We talk about the trucks over there. We've been past that. The council has moved past that point.'",
        "'speaker_2': 'This has been zoned and it has multiple family overlay. When we talk about affordable housing, we put that to rest. Back in 2006 or so. There will be a 15% redevelopment area. There'll be 25% in alameda point. We made that known.'",
        "'speaker_2': 'For people to keep on going forward and saying that these things are going to be taken away or not. And I think that one of the things I see is the same concerns that were expressed to the old council about the transparency and how this moved in a quick fashion within a council area of council, particularly when'",
        "'speaker_2': 'it was during the Thanksgiving period of time and then during a special meeting. And actually that meeting was delayed by a half hour and actually was two of the speakers were only allowed 2 minutes to talk to. And I trust that because the newly elected officials had 2 minutes or 3 minutes to express their.'",
        "'speaker_2': 'That is not how we run this. Transparency is. It means that we do exactly that. I hear this other says you have no staff report. I had the unfortunate. Oh. Obligation to sort through a couple of your council meeting recently and there was absence of council of staff reports on a couple of agenda items are incomplete ones'",
        "'speaker_2': '. So these arguments are, yes, they're valid to a certain extent, but is something that you will have to work on and make sure that that occurs addressed to you. You are the council that we will be working with for the next four years and most likely for the next eight years.'",
        "'speaker_2': 'You deserve all the background information understanding. I'm sure you're not going to cancel the Del Monte project. It's something we've been looking forward to for an awful long time. So I encourage you to take that effort to research it further.'",
        "'speaker_2': 'Understand the impact of all redevelopment in an.'",
        "'speaker_0': 'Thank you, John. Physically. Nicholas Cabral and the care of God. Sting.'",
        "'speaker_6': 'They are Spencer Council members. And I have to read this. Well, I had hoped for a better start to the new year. Call my bifocals don't work here. Only I hope for a better start to the New Year than the way this meeting is beginning.'",
        "'speaker_6': 'First agenda item rescind. Prior Council vote. This Council. Hasn't even discussed. Whether there was some way to sit and sit down and talk to the developer at this point just to see if anything could have been worked out.'",
        "'speaker_6': 'At least that way you could have come tonight and said that you you tried before you go into litigation this past election. Voters seem to be divided on the issue of development. So instead of. So instead of trying to see if you could bring the two sides together, it seems you've decided to drive them further apart.'",
        "'speaker_6': 'I understand that some of you want to go in a different direction. That's fine. You have four years to put your stamp on the direction you'd like to see the city move toward. There will be many issues coming down that you can have an effect on.'",
        "'speaker_6': 'This is such a negative way to start your tenure, you're going to lose a lot of support that you'll need down the road. Is Del Monte really the tipping point? And is this really the last chance we have to get the thing right?'",
        "'speaker_6': 'I can understand that some of you are not pleased with the development. But go back over all of the past year. But I'm sorry to go back over all the past year and re here and have the same battle all over again or worse, go to court.'",
        "'speaker_6': 'Are you really going to win in the long run? I don't think you will. Thank you.'",
        "'speaker_2': 'Good evening, Mayor Spencer and the council. My name is Nick Cabral, and I want to tell you, it's you know, I try to be a moderate guy, but this is really appalling. I'm really upset that you are insulting Andrew and the staff, our city staff.'",
        "'speaker_2': 'You're insulting the planning board. And I think it's terrible. You guys have talked about everything tonight, but you never talked about the people that lived on University Avenue. And they're live. You're going to vote on their lives and put them on hold by.'",
        "'speaker_2': 'You go home to your little neighborhoods and sleep in your nice little streets and then look like you did The Brady Bunch. Why? We have to listen to trucks and every day. I think it's appalling and I think it's appalling that you're going to do this.'",
        "'speaker_2': 'And I you know. I hope you all your luck with your new councilman and the mayor. And I want to be supportive of my city. This is wrong. The developer have done everything and these people talking about your rushing.'",
        "'speaker_2': 'I had the privilege of working with the Wang family 40 years ago at the Del Monte Project, and we're still here, and that's not long enough. And you know, Mr. de South Councilman de SA, I've always been proud because you're a west ender.'",
        "'speaker_2': 'They don't understand. We've been the stepchild of Alameda all my life, and I see the West End growing and moving forward into the future, given us a residential area that we could be proud of. And I really hope you got our back, because this is going to be the most important vote you'll ever make in your tenure'",
        "'speaker_2': '. Tonight, it's going to be important. And I think it's terrible that you're doing this to us. We have gone I've never seen any one of you at those meetings we had over the year. And and and Andrew, with his staff going to those meetings and putting in hours, an hour, and you're going to tell them it's no'",
        "'speaker_2': 'good. Where do you come with that stuff? I think you started your administration on your left foot. We want to help. We want to make our town grow. I voted for almost everybody on this board. I never thought it'd backfire on me.'",
        "'speaker_2': 'It's heartbreaking. We've been waiting 40 years for a neighborhood. Give us a neighborhood, please. Thank you.'",
        "'speaker_0': 'Hello.'",
        "'speaker_7': 'Carol Gladstone. I live on Grand Street. More or less. I've lived here almost 60 years now. I'm for the Del Monte project. I just wish I knew what it was. I, I couldn't find a rendering of the Del Monte online with the middle part that rises up.'",
        "'speaker_7': 'If you Google the word Del Monte and Alameda, you get the 2010 design, and that doesn't look much like what's planned for it now. So although there's been a lot of people speak with a lot of emotions against repealing the ordinance.'",
        "'speaker_7': 'They're short on their facts. Yes, there's been a lot of meetings, but the devil's in the details because the number of housing units in the building itself keeps changing from meeting to meeting and it keeps going up. It even changed with in the December 16th meeting itself.'",
        "'speaker_7': 'So if you went to meetings last year, you're looking at a different project in this on December 16th. It's my understanding that repealing the ordinance isn't stopping the development. I mean, I believe Mr. Meek, when he says he loves the building, I want to see a development there.'",
        "'speaker_7': 'But. What I think what bothers me the most is I live on Grand Street and the way out of town is Grand Buena Vista. Make a left go down, boy, to Vista, to Sherman, make a right and you exit to the two.'",
        "'speaker_7': 'Nobody seems very bothered by the utter lack of a plan for the Sherman sub area area B Eagle Sub Area Area C, if you approve the fact that the audiences were approved without any plan for those two areas which border the length of Sherman and are key determinants of the traffic at the Sherman Buena Vista Comment Composite'",
        "'speaker_7': 'intersection. I think that needs to be in the actual plan. Before it is submitted for final approval by the city council and it isn't in there. And that's why I think you're doing the right thing by considering repealing the ordinance.'",
        "'speaker_7': 'It's not that anybody wants to kick the developer out of town. We're not thinking of Tim Lewis as Suncor. We're not trying to get rid of the developer. We would just like the whole thing planned to the edges, to the borders.'",
        "'speaker_7': 'And that needs to be done before you hand the developer the right to just start building. Anyway. That's my opinion. Thank you very much.'",
        "'speaker_0': 'At this point. We have two more speakers. If you have a speaker slip on this issue, please turn it in. Our next speaker, Irma Garcia. And then Linda WINESTOCK.'",
        "'speaker_1': 'First of all, I want to say congratulations.'",
        "'speaker_0': 'Madame Mayor and.'",
        "'speaker_1': 'Jim Oti and Frank literacy and thank you. City council members as they and Tony de saag and staff for being here so late and patient with us.'",
        "'speaker_0': 'I've been living.'",
        "'speaker_1': 'Here in Alameda since 1988, and I'm also a part of a congresswoman, Barbara Lee. So affordable.'",
        "'speaker_0': 'Housing movement.'",
        "'speaker_1': 'And with her for a long, long time. Though I do question on how affordable these housing is going to be.'",
        "'speaker_0': 'And I'm I'm I'm really happy with the.'",
        "'speaker_1': 'Support that's been given to.'",
        "'speaker_0': 'Jean Sweeney part. She was a.'",
        "'speaker_1': 'Very close friend of mine and I.'",
        "'speaker_0': 'Supported her throughout the years, and I really love.'",
        "'speaker_1': 'That promised funding.'",
        "'speaker_0': 'I'm also a big supporter of.'",
        "'speaker_1': 'Todd, which is transit oriented development, and it would.'",
        "'speaker_0': 'Be.'",
        "'speaker_1': 'Wonderful if we could use an ultra light rail system like Cyber Tram International. Which was part of a. Proposal back in 2007. A lot of people know about that airport and made a point of.'",
        "'speaker_0': 'And I'm I'm I'm kind of like, you know, support.'",
        "'speaker_1': 'I support a lot of sentiments.'",
        "'speaker_0': 'Uh, of speakers on both sides. So, um.'",
        "'speaker_7': 'You know, I.'",
        "'speaker_1': 'I trust that you will do the right thing, and thank you so much.'",
        "'speaker_0': 'Linda WINESTOCK. All right. Do we have any other speakers? All right then let's proceed with council comments.'",
        "'speaker_4': 'S.M. Thank you, Madam Mayor, and thank you again to an overflow crowd at times for coming out and helping inform us. I know the question before us tonight is whether or not we vote to repeal these two ordinances concerning the DOMINY project.'",
        "'speaker_4': 'But I want to just start out by well, there's one thing I want to just say right off the bat. I want to defend planning staff, our city attorneys, the planning board. We have heard lots of criticism tonight, and I've had emails and phone calls from people criticizing the city attorneys, the planning director, Andrew Thomas, saying they'",
        "'speaker_4': 'don't know what they're talking about. They do know what they're talking about. We've actually patiently sat down and explained with some of the folks even who spoke here tonight what they were missing about the density bonus ordinance. And yes, I was vice president of the planning board when we passed it.'",
        "'speaker_4': 'I know it well, and I know why it's properly applied here. It could be that the speaker we met with just yesterday has perhaps forgotten since yesterday what it was we explained to him, but he agreed with it at the time.'",
        "'speaker_4': 'Other I'm not going to speculate on motivation, but what I do think is important for this this council and for all of you our citizens, is to ask three questions. And the three questions are, what would we gain from moving forward with the Del Monte development?'",
        "'speaker_4': 'What would we lose if we rescind or repeal the ordinance and don't move forward? And are there less draconian measures that would address the concerns, legitimate concerns that some of the speakers have raised, some of the council members have raised besides torpedoing this proposal.'",
        "'speaker_4': 'And I want to just amplify a little on it, on all of those quickly. What we would gain from going forward with the DOMINY project is removing the blight in this neighborhood. And again, I give great weight and credence to the neighbors who live there.'",
        "'speaker_4': 'The they breathe this day in, day out. They have young families. The removing the diesel truck traffic from the northern waterfront would be huge to the suggestion that we engineered the Thanksgiving truck traffic. Those of you who follow the news would know that there was a labor stoppage up and down the West Coast.'",
        "'speaker_4': 'In the West Coast ports, Oakland was still functioning. And so all that ship traffic that was trying to get here for Black Friday, which is that Friday shopping day after Thanksgiving, was offloading at the Port of Oakland and the trucks were coming and going from D'Amico.'",
        "'speaker_4': 'And yes, we feel that some complaints from neighborhood residents but now we are powers don't extend quite that far. We would also gain housing opportunities. And we had a very interesting a related topic tonight and that was the right speed lease an option to purchase at Alameda Point.'",
        "'speaker_4': 'They're starting out with 150 employees. They plan to grow that to 350 by the year 2018. And these are young techie types. They call themselves the Geek Squad. I spoke to real estate group before the holidays and I said, these folks are going to be looking for housing to rent and eventually buy.'",
        "'speaker_4': 'You are all going to be busy with that. We need to provide that kind of workforce housing. Those are the kind of workers in the kind of businesses we say we want to we want to attract. And so let's also remember traffic.'",
        "'speaker_4': 'Traffic is big. Traffic is always an issue with a development. Not every resident of the Del Monte development is going to drive to the tube to go to work in the morning. Some of them might stay and work in Alameda and not leave the island at all, and they will have a free shuttle to get them to'",
        "'speaker_4': 'BART if they want to go to BART. I am working with the developer. Just had a conversation today. I want that free shuttle to go to the ferry terminal. By the way, I'm really familiar with ferry commuters. I'm married to one.'",
        "'speaker_4': 'Yes, that ferry parking lot fills up. He my husband rides his bike every morning that he can so he doesn't have to park. But if we had even more ferries or free shuttle or AC transit stopping there again, even more people would take advantage of the ferries.'",
        "'speaker_4': 'This is a good thing. Someone mentioned the five spare the air days. This is the winter and we've had five solid spare the air days. Think about that. It affects us all. The Clement Avenue extension would take Clement Avenue all the way through providing a.'",
        "'speaker_4': 'Other east west thoroughfare for our city, which we could very well need. And then back when I was on the planning board, we determined that Clementine, not Buena Vista, should be the designated truck road in that area because there are far more residential areas on Buena Vista than there aren't Clement, which is much more industrial commercial.'",
        "'speaker_4': 'And let's talk about the money for the Jean Sweeney Open Space Park and the money for other city parks. It's just 2 million for Jean Sweeney, but I believe another 5 million to parks all over the city, which benefits us all.'",
        "'speaker_4': 'And just tonight, I learned from our city manager that we are actually in line to receive a state matching grant. That means matching that $2 million that would go towards Jean Sweeney. Our fabulous Rec and Parks Director Amy Wooldridge has a sick child.'",
        "'speaker_4': 'She cannot stay late tonight, but she would have addressed that to you. So stop and think about what we would be leaving on the table there and what would we lose if we rescind this deal and don't go forward.'",
        "'speaker_4': 'And it's not that we would look bad. Yeah, I'm not concerned with appearances as much as I am concerned with doing the right thing, which is why I think going forward is doing the right thing. We would send a message to future businesses thinking of coming here to do business in the city with the city, investors, developers'",
        "'speaker_4': '. At a time when we say we want to attract more business, we want to create a jobs housing balance. Some people want more of a jobs job balance, but those people could live somewhere. And if they lived in the same city where they work, they're not going to be clogging the tube at commute hour.'",
        "'speaker_4': 'And no less important is what is the message we're sending to the neighbors in this area. And I do mean the plan. Folks who have organized themselves, who have worked with the developers, who have brought in actual professional experts on these different topics that we talked about, who have gained concessions regarding the parking, regarding furthering the traffic'",
        "'speaker_4': 'study, and regarding getting a seat on the advisory board that is going to inform the northern waterfront. And going forward, this group in many ways reminds me of a group called Library 2000 that the council member, the vice mayor I'm sitting next to and I met when we co-chaired it for four years and the results are across'",
        "'speaker_4': 'the street. I'm in our new library and what message would we be sending to these people who have taken their own time and resources, who have come before us, who have organized meetings, who have gained concessions with the developer that the city hadn't gained.'",
        "'speaker_4': 'If we just tell him, never mind, we're a new council, we're going to just, you know, start over and look at this. What would we be saying to other neighborhood groups? And trust me, it is to the advantage of this city to have active, involved neighborhood groups.'",
        "'speaker_4': 'And so then I come to and I just want to do a little shout out than it always does my heart good when someone who I think opposes me on things actually agrees. Because Joe Corcoran made the reference to the theater opposition group, made the Army the theater a better project and plan has made the domain project'",
        "'speaker_4': 'a better project. And then I come to are there less draconian measures that would address the concerns that were raised, especially about traffic? And if we hear it tonight or we hear it soon? Councilmember de SAC has put on a very detailed council referral about how to look at citywide traffic planning.'",
        "'speaker_4': 'But does that mean we throw this project that is so close to fruition and bring so many benefits aside? Are we are we can we move forward on two fronts? And so finally, I would just implore my fellow council members to think carefully about all the implications, I mean, the least of which and we heard it in'",
        "'speaker_4': 'closed session. And so I can't really go into it, but people have raised it. The possibility of litigation, we could make something very positive out of all this or we could go down a deep hole that we've been down before.'",
        "'speaker_4': 'And this is an opportunity to take a step back, look at the big picture and move us forward, not backward.'",
        "'speaker_0': 'Thank you. Thank you. At 11:00, which is enough. I believe that we need to make a motion to of the three votes to continue past the meeting. As to the past 11. Our second. All those in favor i.'",
        "'speaker_0': 'I. I. This vote unanimously passed. Thank you. You make it to the next member that would like to speak on the issue.'",
        "'speaker_5': 'You know, I'd like to speak on this, but I know that there's a history of deference to the mayor going last. But, I mean, it's difficult for me to speak in public on your rationale for putting this on the agenda and your rationale for rescinding without hearing from you.'",
        "'speaker_5': 'And I'd really like to hear that first, before now. Or will we have an opportunity to speak again after after you speak, or are we done once we speak?'",
        "'speaker_0': 'I think it normally we go there is an opportunity to speak after the mayors. But I've always seen. I mean. Yes. Yes. We're having discussion right now so we can go back. I'm.'",
        "'speaker_2': 'Oh. Madam Mayor. Yes?'",
        "'speaker_8': 'I'd like to jump in here. And just for the record, I think we're all getting to know each other quite well, because it's been three times since this group has gathered. My biggest concern that I mentioned at both meetings is to look at this project in the context of the inventory of available land that's on the northern'",
        "'speaker_8': 'waterfront and how it's zoned and what has multiple multifamily overlays. And then what would happen if density bonuses that have been granted to this project are granted across those? And when you have 2245 units, which is our realistic capacity as documented in our housing element.'",
        "'speaker_8': 'A certified housing element. That number, just for those with mixed use multifamily overlay goes up to 3736 units, 3736 units immediately across the new Clement Avenue extension is the Arsenal terminal, which goes from a realistic capacity of 234 units to 400 I'm sorry, two or 398 units.'",
        "'speaker_8': 'So when you. When you. Make make that granting. Of a density bonus. The numbers get bigger and this doesn't count. Alameda point. So pursuant to. Making sure that we don't gridlock the whole west end of the island because most of these projects.'",
        "'speaker_8': 'Beat into the West End and the island. I think we have to look forward. And looking forward to me means I'd like to ask my colleagues to have staff look at putting a moratorium in place to not accept any new density bonuses until such time as we all understand these numbers, that we give the public a chance'",
        "'speaker_8': 'to understand these numbers and to adjust them so that we're not gridlock in the west end of the island. And with sight a at Alameda point, i think it's critical that we do this. The second point that I had concern over.'",
        "'speaker_8': 'And I've spent it from the 16th which was swearing in to today, which is swearing at. I've spent a lot of time studying every document that's been produced. And every requirement that we have. And I know I've heard I've heard explanations from planning.'",
        "'speaker_8': 'Who has done a yeoman's job at this. I've heard explanations from our city attorney, which has been concise and and forthright. But I still when I read the density bonus ordinance, it still says that these things have to be in place.'",
        "'speaker_8': 'And there's a list of things, list of evidence, and the word is there. It says that these things have to be in place before the bonus is granted. And. I understand how these things work. But I was there when this bonus density bonus ordinance was approved.'",
        "'speaker_8': 'And part of the reason was it was to protect the city to make sure that. The affordable housing that the project promises is delivered in a configuration that meets the best and highest need of the most needy in Alameda.'",
        "'speaker_8': 'So that was I was looking at that as there's something wrong here and I've heard it from people in the audience. It was brought up a couple of times during this meeting as well as in both of the previous meetings.'",
        "'speaker_8': 'That being said. It was also explained to me, which is not following the ordinance, but it it's essentially the same outcome is that no permits are going to be issued until the affordable housing agreement. Is signed. I think it puts the city of a disadvantage.'",
        "'speaker_8': 'So the second request I have with this council is to direct staff. To come back to us with analysis of these the two ordinances that are referenced. One is the density bonus ordinance and the other one is the the planned development ordinance and get the language to a point that it's understandable and that it's workable and that'",
        "'speaker_8': 'the council can discuss it to see if we truly want that information up front. Which, again, in my opinion, where I'm sitting right now is, yes, it gives us a good advantage of having up front because it guarantees we know what things are going to look like.'",
        "'speaker_8': 'Now. I've spent a lot of time thinking about the tools that are needed to accomplish what I want and. Not necessarily what I want, but what I think is best for Alameda. And the notion of a repeal. From a technical side does place a hold.'",
        "'speaker_8': 'Doesn't stop everything however. And understanding the the legal constraints of noticing. Of the type of meetings that it takes to have a repeal and a second reading of these ordinances. It puts. In a position of doing the same legal gymnastics as I thought, a 5:00 meeting the day of swearing in a week before Christmas.'",
        "'speaker_8': 'And I'm not going to play that game, so I'm not going to support a repeal. But I am asking my counsel, my colleagues on the council to. Look at the gate. Of the next projects coming down. Not the ones that are in the pipeline now that have applications in now, but those future ones, because this one is'",
        "'speaker_8': '380 units out of a potential 2245. But that number grows. And if we don't do something now, we have no control over that growth because the next development will come, will be looked at separately. And I think Councilmember de SOG has a council referral, which I'd like to hear first.'",
        "'speaker_2': 'That.'",
        "'speaker_8': 'I think takes the one big advantage of letting this thing go forward. But I'd also like to have it apply to what's happening over there at Alameda Planning, because those are going to come out of the ground and be occupied first so that we can actually get real Alameda data.'",
        "'speaker_8': 'On what works for managing demand. Because, you know, I talked to I talked to everybody on this from all sides. I talked to the developer and I made a comment that this is an experiment and I was quickly corrected.'",
        "'speaker_8': 'This has been done elsewhere. And I didn't have the presence of mind saying that it wasn't done on an island and it wasn't an island, a place populated by aluminum. So we need to generate real time data here.'",
        "'speaker_8': 'And I think there are provisions that can be adjusted. There are people who are willing to do the work. And I think we can we can resolve that issue there. And because we've done this backwards, in my opinion, as far as getting the affordable housing locked down, we are going to have to go through this again and'",
        "'speaker_8': 'again. There are going to be many votes on this project because it's going to it's phased. And I understand that part. The last thing I say is I have big concern over grand plans or the assessment dollars that are going to be used to hire the shuttle and pay for the shuttle and be run by essentially a'",
        "'speaker_8': 'homeowners association. Because I think we need a transition plan because anybody who lives in a condominium knows the pleasure of trying to get dues raised to meet the increasing costs. And what happens when. The employees who drive the shuttles need health care.'",
        "'speaker_8': 'It is increasing at a rate faster than what's being assessed. The equipment and the fuel. Go beyond what's cheap today at $50 a barrel of oil, which when it goes back up to $100 a barrel, we're going to have a problem.'",
        "'speaker_8': 'Maintaining this. These are all big unanswered questions that. We don't have permits issued, so we do have a chance to work on those. But I truly hate to to lose $2 million over all the impact fees. Jane Sweeney Park.'",
        "'speaker_8': 'Clementi Avenue extension. You know, this is a piece of it. I think the most important part of the piece is getting the shore shored up on this section and combined extension because not going to get the trucks off until we get the entire climate extended.'",
        "'speaker_8': 'And Pennzoil stands in the way of that and that's outside the scope of this. So I think I think we need to move on those issues that take care of this. And it's after studying this and you know, I've had people e-mail say, you know, I hope I hope you're carefully considering this.'",
        "'speaker_8': 'Well, one thing I learned with eight years on the council, two years on the planning board before this is I didn't consider things well enough and I sure put my time into this. Because it's not as simple as is.'",
        "'speaker_8': 'Has made out to be. And I do think we need to to use this project as as as data. And we need to have it go forward. But. I do think we need to get all of the others before we get some answers, particularly on what is our direction with granting density bonuses, because that's what inflates the'",
        "'speaker_8': 'numbers and that's what strains our infrastructure. Thank you.'",
        "'speaker_0': 'Thank you. Days. I remember already.'",
        "'speaker_5': 'Okay. I'll go then. I do want to thank everyone for coming out today and expressing an opinion. I'm going to kind of share my tentative thoughts. I really want to hear what the mayor has to say and what her you know, what her rationale was behind this before finalizing it.'",
        "'speaker_5': 'But, you know, tentatively, I have a lot of concerns with with the proposal one. And I want to echo what Patricia Young mentioned, is that, you know, we really didn't we really don't know why we're doing this. The public doesn't know why we're doing this.'",
        "'speaker_5': 'I had people ask me, why are we having this vote? What's the basis? What's the grounds, what's the rationale? So I'm left to at least tentatively rely on the public. And today I know Mr. Spangler may be off, he may be different, but I kind of th4 people that said don't repeal a 14 that said due to'",
        "'speaker_5': 'that I weren't quite sure of and in the comments that I received from the public in my email, I had 21 people tell me, well, 21 emails, some of them representing multiple people, including folks that, you know, whose opinions I respect.'",
        "'speaker_5': 'Bill Delaney at Kauffman. Mr. McDonough, you know, they said no repeal 21 and two said repeal. And one I was not quite sure of either. So, I mean, that's an overwhelming number of people. I think if if I've heard 14 people today and two people in email, that's only 16 people.'",
        "'speaker_5': 'And I think this is a really if we do this, this is a big deal. I mean, this subjects the city to a lot of risk. It subjects us to. Damage to our reputation. And I would think if we were going to take this step, I'd feel more comfortable doing it.'",
        "'speaker_5': 'If I had more than 14 people here or 14 people telling me that we should do it. I'm concerned that, you know, investors want certainty. Corporations want certainty. If there is a corporation that wants to cover, let's not even talk about development.'",
        "'speaker_5': 'Let's not even talk about houses. If you want to come here and move your business here, build a campus retrofit or reuse a building at Alameda Point. What does this say to you? It says Alameda can't be depended on to be counted on to keep its word.'",
        "'speaker_5': 'It says we can't be trusted, that we're fickle and that will change our mind. I a second in Maryland, Councilmember Ashcroft's motion earlier to hear the lease first, because I didn't want Mr. Right to sit here and listen to this debate and listen to this discussion and say, wait a minute, I don't want to come here to'",
        "'speaker_5': 'Alameda. This is how they're going to be. And I can't be I can't depend on them to keep their word. And I don't want to come here. So, I mean, that's probably the most important issue to me as far as weighing in on the public process.'",
        "'speaker_5': 'You know, I think I did have an opportunity to weigh in on the public process. I was at one of the planning board meetings. I was at one of the the council meetings here. And it was a process that that's gone through, I think, 11, 11 different meetings.'",
        "'speaker_5': 'And the public has been involved with it all along. I mean, we've heard that it's been effective as one of the the neighbors said today. And I think this resonated with me. The neighborhood is not willing to brush aside all of the hard work that they've done.'",
        "'speaker_5': 'So this is my first meeting to really delve into some things. So maybe I need to get a better, bigger ego, but I don't really think I need to have a special second bite at the apple that we haven't already had.'",
        "'speaker_5': 'So I'm not convinced that that the case has been made that we need to open this up and go back and look at it again. I also think that, you know, there's a lot of concerns that people have, and I share a lot of those concerns, especially with traffic.'",
        "'speaker_5': 'I think we do have some reasonable alternatives. One of the reasons why I voted to keep the meeting going after 11, because I'm really interested in discussing Councilmember de SAC referral. I think that is a very positive step towards the Council taking responsibility for the issue of traffic, and I'm really interested in hearing the discussion on that'",
        "'speaker_5': '. And lastly, I want to talk too much about this, but I think the risks of a repeal or rescission do not outweigh the possible benefits. And I really can't talk much about that without revealing classified or confidential information.'",
        "'speaker_5': 'So know I will give the mayor an opportunity to convince me otherwise. But at this point I am leaning towards voting no on these two ordinances.'",
        "'speaker_3': 'Thank you, Madam Mayor. Thank you, everybody, for coming out tonight. Also thank you to the many people who sent emails and also who took the time to discuss matters with me in coffee shops and in offices and over the phone.'",
        "'speaker_3': 'I truly appreciate all of your involvement. I think that's what makes our city really special. And I do think that many of you who are here tonight. Many of you who are here tonight are rightfully upset about how the Dalmeny decision of December 16th was reached.'",
        "'speaker_3': 'Many here tonight are right to be upset with making a controversial decision as important as Del Monte is. On a special meeting basis right before one council and mayor were leaving and another was coming in. I know for sure that the how of the December 16th decision would not have met the test that the late Mayor, Ralph'",
        "'speaker_3': 'Pizarro, used to say to me over and over again.'",
        "'speaker_2': 'Only, whatever you do, just make sure you do the right thing.'",
        "'speaker_3': 'Do the right thing. Many are also right to raise the fine point they've raised tonight, particularly with respect to whether the environmental effects of the affordable housing portion was fully evaluated, fully vetted. We're also right to hear more about a better city wide traffic and transit plan.'",
        "'speaker_3': 'There's a lot of details around which community questions, community concerns persist. Mayor Spencer has rightfully raised the repeal in an effort to get at those questions. Let me repeat, I believe Mayor Spencer has rightfully raised the matter for discussion because it brings to the forefront what's really on the minds of a good number of residents.'",
        "'speaker_3': 'Going into tonight's meeting. In which we discussed the rescind whether to rescind the Council del money decision of December 16th. There's really a bigger concern that for me. My real concern about this issue is that I do think that there we need to fully discuss and understand the possibilities of litigation.'",
        "'speaker_3': 'Particularly in the context of having reached an agreed upon development agreement on developed on December 16th. This isn't the first time that I've raised the need to be clear when it comes to reaching development agreements and dealing with potential risks are raised.'",
        "'speaker_3': 'When we selected SRM in our DNA process. When I referenced the Mammoth Lakes. I know for sure. By the way, let me make sure to say that I know our game is going to be a great developer. So I'm not saying what I was just saying at that time was just to make sure that the city staff'",
        "'speaker_3': 'does everything that it can to protect us from a Mammoth Lakes situation. Is when you enter into a contract, and that's what a development agreement is when you enter a new contract with a developer. This is incredibly high stakes stuff.'",
        "'speaker_3': 'We're not just talking about any kinds of litigation, the likes of which that he Attorney Kern, deals with or the likes of which city manager Russo dealt with previously as city attorney in Oakland. I mean, this is really high stakes stuff.'",
        "'speaker_3': 'So when I indicated to the reporter from the Internet news, the Almeida that I need to evaluate any upside benefits. To the motion in front of us versus downside risks. What I was really getting at was saying, look.'",
        "'speaker_3': 'At best, if you stymie this project, what do you get out of that? I mean, what what are the benefits of rescinding? Involvement of new council members. Maybe even a reduction in the number of housing. But you have to contrast those upside benefits from rescission versus what are the possible downside risks.'",
        "'speaker_3': 'And the downside risks that concerns me the most is a lawsuit, the outcome of which is similar to what happened in Mammoth Lakes. And what happened in Mammoth Lakes is a town had reached the development agreement and for one reason or another it didn't follow through on it.'",
        "'speaker_3': 'And the court's going all the way up to the Supreme Court, which the California Supreme Court was declined to listen in on. It, agreed with the developer at the town of Mammoth Lakes, where owed the developer a lot of money such that it went bankrupt.'",
        "'speaker_3': 'These are high stakes risks. That's not to say that, you know, TLC has us in a bind right now. I mean, whether, you know, what happens in a lawsuit is speculative at best. What are the dollar values of any potential lawsuit would be speculative at best, but it's not speculative to say that these are high stakes contracts'",
        "'speaker_3': 'that we're dealing with. It is not speculative to say that certain cities in not following through on its agreements and incredibly high risks. So as I look at this, the matter in front of me, the way that I'm framing it is I'm seeing that for now a situation where the downside risks of rescinding the December six decision'",
        "'speaker_3': 'far are far out of proportion in an unfavorable manner to the city relative to the possible benefits coming out of rescinding. I do think that Mayor Chris Spencer Herrera is correct in raising this to the public. I do think that we need to take stock of how we're doing, our transit planning, how we're doing our housing along'",
        "'speaker_3': 'the northern waterfront. But we're going to have to do that outside of the context of this project because. While many of us have raised good questions and concerns about details of the project, whether on the affordable housing side, whether on the the way that things were noticed.'",
        "'speaker_3': 'I do think, though, that the process was served at the process worked. It worked for many for for the many months. The outcome, unfortunately, didn't come out the way that we had hoped, where the December 16th, this decision would not have been made on December 16th, but would have been made perhaps sometime in January.'",
        "'speaker_3': 'But we can't. I in my opinion, we can't argue that the process was not served. And for that reason, I do have to be concerned about risks, and I can't take that lightly. And those are my comments.'",
        "'speaker_0': 'Thank you. Council members, community members that came out here and spoke this evening. And those of you that are watching at home and I really appreciate the participation and the comments of all of you procedurally. And I, I want to take this opportunity to explain procedurally, there is only a short window for the new council to hear'",
        "'speaker_0': 'the total project that we have just had that opportunity to do in regards to where are we going to go in the future moving forward. One thing that the other council members have spoken to, I think that they've raised many points, including bringing the referral items to how are we going to do this and moving forward.'",
        "'speaker_0': 'And I think all of us would agree. That we as alameda can do it better. Having the 230 or 1:30 a.m.. Decisions, changing of motions, having special meetings, notices in the meeting so that people know that we're having meetings.'",
        "'speaker_0': 'There are raised issues raised like that. I personally, but i in regards to what is the expectation of what what is the application supposed to look like in order to obtain the density bonus ordinance? I think there have been good questions raised.'",
        "'speaker_0': 'Was that satisfied? It specifically says a set of preliminary project plans that include a site plan showing all building and structure, footprints or locations, drive aisles and parking lot, a layout floor plans of all structures and buildings and architectural elevations of all buildings and structures all drawn to scale.'",
        "'speaker_0': 'I would agree with the speakers that have said we did not do all of that. I think that's why we do have a referral in regards to looking at this and making it make sense. I also think it's very important.'",
        "'speaker_0': 'That that we as a council move forward as as as much as possible. Together, we will be asked to. We have multiple projects, actually. We have multiple projects that have already been built that are not yet occupied. We will have more projects coming to us in regards to this density bonus, and I think it's very important that'",
        "'speaker_0': 'we clarify. Going into it. What will that look like? I am going to. And I truly thought that it was important to give member de Saag an opportunity to explain his concerns and have this opportunity to work with this council.'",
        "'speaker_0': 'Because I think he did raise legitimate concerns. I think he has raised legitimate concerns. I think our community members have raised concerns in regards to the transportation plan. Is it sufficient? We I think as a community recognize we we are being told by the state to build X number of units.'",
        "'speaker_0': 'We have these layers of what that actually looks like. And how are we going to move forward so that we feel comfortable with what it's going to look like after it's built out? I'm very happy to have heard this evening in regards to the matching or additional grant moneys for Jean Jean Sweeney's park.'",
        "'speaker_0': 'I know that's something all of us value that hard work. And so I, I will respect all of all of these concerns of working together and support this project without going backwards. And I and I look forward to working on these issues so that we can do it better.'",
        "'speaker_0': 'And I recognize that we have people that say, well, we don't we haven't done it that way in the past. I think it is very important that we then do it that way in the future. And I think that's what we're hearing.'",
        "'speaker_0': 'And. When it says an ordinance will require X, Y, Z. Or to get a I'm sorry to get the density bonus that it needs to clearly say X, Y or Z. Well, then I think that this counsel through this through this and these discussions is going to ensure that when you look at a project in totality.'",
        "'speaker_0': 'And and that's what I think I'm hearing here this evening. And also in regards to so and and we have heard you have heard there will be votes coming back to us. So I think it is critical that we understand how we plan to do that and also to protect and to continue to protect us from further'",
        "'speaker_0': 'litigation. That when when that agreement when that vote took place on December 16th. There was there are legal ramifications. And then how do we proceed with that to best protect us in regards to when a future vote comes to us attached to this project?'",
        "'speaker_0': 'Are we going to support in good faith or do we have unanswered questions that we haven't had the opportunity to to to determine among ourselves how we plan to address this? And what I have heard tonight is how we will plan to address it is by looking at these referral items and then working with staff.'",
        "'speaker_0': 'To our I's and cross our cheese more completely to support our community members so that we can all move forward better and doing it better. And I and I appreciate member Izzy Ashcraft speaking to my concern of having very late night meetings.'",
        "'speaker_0': 'I would really like to have this discussion in regards to I am much more willing to have a meeting on another night to continue it, to have meetings on the weekend, to have workshops. Everyone knows I'm coming from the school board.'",
        "'speaker_0': 'We do workshops on a Saturday morning. We do them at different venues. And rather than going until 230, I personally I don't think I've ever been at a school board meeting where we've got until 230 or three in the morning.'",
        "'speaker_0': 'And I think it's that's there is ways that I want to work better and and I agree with the members from the League of Women Voters. I think that's another thing where we'll all continue to try to be more transparent.'",
        "'speaker_0': 'And I'm confident that all of us do want to do that. And part of transparency to me is not having decisions at 230 and three and 330 in the morning. To me, that that is not transparent. I think it is so that there are areas where we can improve our sunshine ordinance.'",
        "'speaker_0': 'And I do want to respect the time of all of us here. And I. Yes. So. You're more than happy. I don't know if anyone else want to speak at this point, Mr. Brody.'",
        "'speaker_4': 'I think the Vice Mayor's ready to make a motion.'",
        "'speaker_2': 'And.'",
        "'speaker_8': 'Yes, I'd like to make a motion to not repeal the decision of December 16th. And also asked staff to within. 45 days to return a an evaluation of the density bonus ordinance relative to the. A planned development. And associated ordinances.'",
        "'speaker_8': 'And present that to the Council so that we can debate and provide direction on what those ordinance should read. And I'd also ask within the same timeframe that staff bring us back a. The mechanism for a moratorium on.'",
        "'speaker_8': 'Any new density bonus applications until the rules of the ordinances are clear and the implications related to the available land inventory is listed in our housing element are discussed in context of. Additional developments across the city.'",
        "'speaker_4': 'Are second on the Tunis.'",
        "'speaker_0': 'Mayors number data data.'",
        "'speaker_3': 'Several issues. One is the. Practice. If it's okay, practice. You have motions and the negative. Because the motion is framed in the negative, we move to not.'",
        "'speaker_2': 'But it can be done.'",
        "'speaker_3': 'Okay. The second issue is and this is more a matter of comment. I need to have clarity that we are not, per say, directing us into doing a moratorium, but that we are rather having a discussion much in the way that whether we should have we should do that.'",
        "'speaker_3': 'And what are the issues regarding that? And as the sponsor of that, you bring for those issues much in the way that in the Council communications portion of the things we bring forward issues for council to discuss.'",
        "'speaker_2': 'So if I may, Madam Mayor, two items regarding the motion. One is we understand that the city attorney and I understand the motion to be to bring the council those options and perform the research. It's impossible to vote on a motion on a moratorium tonight because it's not noticed.'",
        "'speaker_2': 'And so just to be clear, I addressing through the chair to Councilmember De Saag, I did not interpret Vice Mayor Madras, whose motion to be other than to tee it up, if you will, for the council's.'",
        "'speaker_8': 'Consideration because it's not agenda. Right.'",
        "'speaker_2': 'And then second is we can have that work prepared in 45 days, but we can't have it on a council agenda in 45 days. We can have it on a council agenda in 60 days. We have to publish 12 days in advance.'",
        "'speaker_2': 'We cannot do that level of integration of those different ordinances and get the help we need to work that while running the rest of this machine in 30 days. And that's that's just for my brief consultation with my colleague to my left here.'",
        "'speaker_2': 'So if you change the vote, if you say, have the materials ready for publication in 45 days, that we can do, if you ask us to have it at a council meeting within 45 days, that we can be.'",
        "'speaker_8': 'Ready for publication in 45 days. Yeah, we can do that. Yeah, we can do it. Give us time. Give the community time also to absorb. What the options are. And we have a real discussion about this.'",
        "'speaker_2': 'Mm hmm. Okay. Just one.'",
        "'speaker_8': 'Why we're doomed to repeat.'",
        "'speaker_2': 'Well, regardless of the characterization. 45 days we can do, and we can have it ready for the public to review in 45 days.'",
        "'speaker_0': 'So we have a motion.'",
        "'speaker_4': 'Our second with the. Instruction to staff from Vice Mayor Matter SC and Council member de.'",
        "'speaker_0': 'SAC staff clear on the motion or as members?'",
        "'speaker_3': 'And just just for further clarification, I just want to reiterate that what we're entering into is a discussion that have a further discussion because why we have to do that, we have to lay out the pros and cons issues.'",
        "'speaker_3': 'There are conceivably cons issues that then once discussed will further frame how we want staff to further proceed. For example, would there be impacts to whatever agreements that we made with regard to the housing element we need? So it's a discussion to have further discussion.'",
        "'speaker_0': 'Is that your motion?'",
        "'speaker_8': 'I appreciate Councilmember De Suggs framing a framing of it. That is my motion. And I think, oh, I'd like to do this in in a timely fashion because I don't want to shut off things, but I do want to have reasonable limits on what we do.'",
        "'speaker_8': 'And I think that's the place where we'll have the discussion will be able to figure out what reasonable limits can be applied to this land inventory so we don't gridlock and.'",
        "'speaker_3': 'And just.'",
        "'speaker_2': 'I think that's.'",
        "'speaker_8': 'Been the same thing that I want to time certain gun.'",
        "'speaker_0': 'Any other discussion? I want to call the question. All those in favor.'",
        "'speaker_4': 'I it is this is in favor of rejecting.'",
        "'speaker_2': 'That was the first.'",
        "'speaker_0': 'Okay. Yes. Do you want us to repeat the motion? I'm right. So. My understanding it was unanimously passed. Is that correct. All those in favor. I, I yes. Those passed unanimously. We. We have? Yes.'",
        "'speaker_4': 'So if I could make a suggestion and by the way, Madam Mayor, really nice job running your first meeting with really complicated issues, I might say.'",
        "'speaker_0': 'And I really do want to thank all of.'",
        "'speaker_4': 'But I if I could make if I could make this suggestion that could we perhaps continue these council referrals to the next meeting? And I think we could agenda them at the top of the agenda because I think these are such important topics we really don't want to be.'",
        "'speaker_0': 'So do we have a motion base to hold them over? Yes. Mayoral committee member, just as the Ashcroft's motion because of the noise. I do want to continue. I mean, I'm sorry if everyone could be really quiet, because I think I'm going to be able to wind up our meeting really quickly.'",
        "'speaker_0': 'So thank you very much. I really appreciate it. And so are we can the member as the Ashcroft.'",
        "'speaker_4': 'So I was making a motion to continue the. The balance. Well, no, actually, just the city council.'",
        "'speaker_0': 'Refers, which is the balance.'",
        "'speaker_4': 'Of appointment.'",
        "'speaker_0': 'Assuming we don't have 20th.'",
        "'speaker_4': 'The next meeting is January, the correct.'",
        "'speaker_5': 'As council referrals or as agenda items that have some staff.'",
        "'speaker_0': 'As council?'",
        "'speaker_2': 'No, I would presume it's still a council referral. Yes, because we have.'",
        "'speaker_0': 'Still.'",
        "'speaker_4': 'Council referrals. But I was just asking them if I mean, the city clerk maybe would weigh when can.'",
        "'speaker_0': 'We see.'",
        "'speaker_1': 'The order of business as set by resolution that you can at the meeting, choose to take it out of order just as you changed the order tonight.'",
        "'speaker_2': 'Okay, so we take them out of order now, but they can do that at the meeting.'",
        "'speaker_0': 'All right. So then is that so? Then the motion is to continue these referrals, to.'"
    ]
}