{
    "Recommendation to Accept the Investment Report for the Quarter Ending June 30, 2017. [City Council and SACIC] (Finance 2410)": [
        "'speaker_0': 'So all those in favor. I think that motion carries that was three a an hour here in regards to three B, which is the recommendation to accept the investment report for the quarter ending June 30th, 2017.'",
        "'speaker_1': 'And Kevin Kennedy is here. Can talk about it. And Elena Adair. Okay.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_2': 'You're better than at the moment.'",
        "'speaker_0': 'So thank you for being here this evening.'",
        "'speaker_2': 'Of course. Thank, Alina. My name's Kevin Kennedy. I'm the city treasurer. Madame Mayor. Happy belated birthday. Thank you. City Council. Just to give you a quick update on Wells Fargo, as the report indicates, we did sell the positions that we had in Wells Fargo as of June 30th.'",
        "'speaker_2': 'So the portfolio does not hold. Any Wells Fargo securities in it, which was the the direction we got from counsel. Last spring.'",
        "'speaker_0': 'And can you clarify, was there any loss to the city for doing that?'",
        "'speaker_2': 'Yeah, you'll see. On page two of the report, uh, it lists out three bonds that we sold to them. We sold it at a small gain. One, we sold at a loss. Net net, it was about a $2,000 loss, which sounds like a lot of money, but it was a million and a half dollars worth of bonds'",
        "'speaker_2': '. So if you take it as a percentage, I think it's about a 10th of a percent. So it wasn't it wasn't a big financial event for the portfolio at all. But it does divest us from from the Wells Fargo investments.'",
        "'speaker_0': 'And then, has that money been reinvested?'",
        "'speaker_2': 'Yes. Yes. And Wells Fargo is on the you should call it the no buy list and until further indication. So our managers are aware of that.'",
        "'speaker_0': 'And do you believe that you're able to find comparable investments so that the long term will not be a financial loss to the city to have done that?'",
        "'speaker_2': 'Yeah. You know, the value that they sold at is a factor of interest rates. So, you know, in theory, the interest rates were a little bit higher than when they bought the bonds. So they probably turned around and bought another bond with the interest rates high.'",
        "'speaker_2': 'I don't think that's a big issue and it's just one issue. Granted, as we've talked about, the the universe of bonds that we can invest in because of our strict credit rating requirements and stuff is fairly limited. But taking one issue or out of that mix probably doesn't affect the portfolio in the long run.'",
        "'speaker_0': 'Thank you. Any other questions from vice mayor?'",
        "'speaker_4': 'It's not really a question. I just wanted to say thank you to both you and Elena for your work on this. And, you know, I think that it's tremendous that not only did we say we were going to do something, but we've actually taken action and we did it in a way that was fiscally savvy for our'",
        "'speaker_4': 'city. So thank you.'",
        "'speaker_0': 'Absolutely. And I want to also echo that it was commending our council for moving forward on this item. I think it was important. Yes, I believe it was a referral, yes. From vice mayor and member already. Yes. So thank you.'",
        "'speaker_0': 'All right. So thank you very much. And now do we have a motion to accept three?'",
        "'speaker_4': 'I'll make the motion to accept a3p second.'",
        "'speaker_0': 'All those in favor I motion carries unanimously. Thank you. I will now adjourn this special FCIC meeting and we will now open the regular city council meeting.'",
        "'speaker_1': 'Raqqa has been noted. Five Present.'",
        "'speaker_0': 'Agenda changes and item.'",
        "'speaker_1': 'Three be, which is the certificates will not be heard tonight. They'll come back on October 3rd.'"
    ],
    "Consider Directing Staff to Explore Offering Free Public WiFi Throughout the City.  (Mayor Spencer)  [Not heard on September 5, 2017]": [
        "'speaker_4': 'So that brings us to the counsel referrals item nine, a consider directing staff to explore offering free public Wi-Fi throughout the city, and that was brought by Mayor Spencer. Is there anyone who wants to lead the conversation?'",
        "'speaker_5': 'I mean I'll speak to it because I.'",
        "'speaker_0': 'Council member.'",
        "'speaker_5': 'Odie. Thank you, Madam Vice Mayor, because I. Told the mayor that if she was not here at the time it came up, that I would be happy to advocate for it. I mean, I suppose if it only gets two votes, then maybe we can, you know, deferred until she gets back.'",
        "'speaker_5': 'But no. I remember when Suleiman Roberto was running for council. He said, You know, I will. Listen to any idea. And just because I don't think of the idea, if it's a good idea, then I'd like to advocate for it.'",
        "'speaker_5': 'So this is one of those. I mean, I think it's a good idea that the mayor came up with to consider exploring a free public Wi-Fi. I think it's pretty explanatory. I mean, other cities are doing this and we're trying to do I think we're doing a little test side of it over at Alameda point for like'",
        "'speaker_5': 'vendors so they can, you know, actually sell things there. So I think I think it's an idea worth exploring.'",
        "'speaker_1': 'And staff has been working on this and we're coming to council in October. Um, it's the I.T. strategic plan. It's part of that whole process of let's look at all our IT needs citywide.'",
        "'speaker_2': 'Madam Vice Mayor.'",
        "'speaker_4': 'Council member Mutter. I see.'",
        "'speaker_2': 'I think for the reasons that Councilmember Brody mentioned, I, I would support giving this direction as long as it is understood that it is not urgent. It is important, but not urgent. So. But if everyone's agreed to that rating, I have no problem with it.'",
        "'speaker_4': 'So.'",
        "'speaker_0': 'Councilmember Ashcroft.'",
        "'speaker_4': 'Do you have any.'",
        "'speaker_0': 'Comments?'",
        "'speaker_3': 'So what I'm trying to do is pull up the. Uh. Yeah, I, um. It sounds like staff is working on it, and as long as we are not saying push something else out of the queue because I think, um, you know, I, I would let staff decide when they're able to logically bring it back to us because'",
        "'speaker_3': 'I think we have thrown a number of more substantive issues. That's I mean, we'd like to say yes to everything, but we can't do it all at the same time. So with those caveats, I would be supportive.'",
        "'speaker_4': 'Understood. And, you know, my concern is there's a lot of infrastructure needs that we have. In particular, we just saw a drinking water issue at Alameda Point. I do hope that our priorities relative to infrastructure are focused on that as being both urgent and important, as opposed to providing free wi fi, which is an added plus, but'",
        "'speaker_4': 'to me not a necessity. My concern with this is that I don't think that it's urgent or important if staff is already working on something relative to Alameda Point, I'm happy to hear that. But in just in terms of our overall staff capacity and looking at the list of remaining referral items as well as the infrastructure issues'",
        "'speaker_4': 'that have come forward, you know, again, I really hope that we place a premium on access to clean drinking water for our residents and spending our resources on that before we start engaging in something like wi fi, which I've traveled to a lot of cities, we all have you know, I see a lot of businesses providing free'",
        "'speaker_4': 'wi fi. If our business community is interested in that, I'm happy to, you know, look into exploring ways to work with them on doing that. If, you know, if. And I've also seen it on public transportation. But in terms of just citywide Wi-Fi, I also am concerned about hacking issues, our own liability relative to being the provider'",
        "'speaker_4': 'of of wi fi. If something were to transpire over that, what would that mean for the city? And so, you know, and then again, the cost and staff time and resources.'",
        "'speaker_1': 'And another item that's on the strategic plan discussion is Sinek, which is correct. Ultra Right. And and maybe the conversation when we come back, which it will cover. A broader topic, and that might be a good time for the council to say this is our priority on this technology.'",
        "'speaker_1': 'Amenities, basically.'",
        "'speaker_4': 'Understood. So do.'",
        "'speaker_0': 'We.'",
        "'speaker_4': 'Yes. Councilmember Oscar.'",
        "'speaker_3': 'Timeline. I'm bringing that back.'",
        "'speaker_1': 'It's at the same time, actually Scenic is bringing an MRU, I think, on October. 17.'",
        "'speaker_3': 'Oh, my gosh.'",
        "'speaker_0': 'No, no, no. It's. It's a contract to work.'",
        "'speaker_1': 'Just feasibility, right?'",
        "'speaker_3': 'Yeah.'",
        "'speaker_1': 'To start the first part of the cynic.'",
        "'speaker_3': 'So I'm with the vice mayor. I think public health and safety always has to take precedence and our very pressing infrastructure needs. I do believe you can get free Wi-Fi at the Army, get free library and it's.'",
        "'speaker_2': 'Yeah, right. And none of it's free. So I think there's.'",
        "'speaker_4': 'A cost.'",
        "'speaker_0': 'Of.'",
        "'speaker_3': 'Yeah, but we're not.'",
        "'speaker_2': 'So much paying for. Yeah. We all, we're all paying for it. So I think that's right. It's available. Available without charge charged.'",
        "'speaker_1': 'Do we want to make it not important, not urgent and bring it back?'",
        "'speaker_3': 'It's come back when you're bringing it forward with other items.'",
        "'speaker_4': 'I'm amenable to that. And it sounds like Councilmember Monterrosa is also amenable.'",
        "'speaker_5': 'I'm good with.'",
        "'speaker_4': 'That. Okay. Do I have a motion?'",
        "'speaker_2': 'I move that we give counsel direction. I mean, give staff direction. Sorry. That's consistent with the points in the council referral. Considering no charge wi fi. And that we prioritize the ranking as not urgent, not important.'",
        "'speaker_5': 'I can second that.'",
        "'speaker_4': 'All those in favor.'",
        "'speaker_0': 'Hi. Hi.'"
    ],
    "Consider: 1) Adoption of Resolution Condemning the Increased Incidents of Bias, Prejudice, Discrimination, Violence and Anti-Semitism; and 2) Direct Staff to Provide a Status Update on Hate Crime Training and Possible Training of Community Members; and Direct the City Manager to Provide Periodic Reports to Council on Hate Crimes.  (Vice Mayor Vella and Councilmember Oddie) [Not heard on September 5, 2017]": [
        "'speaker_4': 'I think motion passes or do zero item nine be and we do have four speakers. We have two speakers with two other individuals ceding time to one of the speakers and this is a referral to consider the adoption and resolution condemning the increased incidence of bias, prejudice, discrimination, violence and antisemitism, and to direct staff to provide a'",
        "'speaker_4': 'status update on hate crime training and possible training of community members, and to direct the city manager to provide periodic reports to Council on Hate Crimes. This referral was brought by myself and Councilmember Ody. Councilman Brody, do you want to?'",
        "'speaker_5': 'So I think on the face of it, it pretty much explains what it is. We all witnessed some of these horrible activities happening here in Alameda with the the temple. Temple is real. And then the hate fliers and the vice mayor and I.'",
        "'speaker_5': 'I don't if I speak out of turn, you can correct me. I mean, we thought it was important that we take the stand and we actually call out, you know, these groups and this hate for what it is and name them by names.'",
        "'speaker_5': 'Some people accuse me of being too emotional sometimes up here in this. This may be one of those times when that happens. But, you know, this this type of stuff, you know, there's no place for this in Alameda.'",
        "'speaker_5': 'And I see the family here in the audience. And, you know, I was told that, you know, there's a list of these hate incidents in high schools and we're on their way too many times. It's like five or six times.'",
        "'speaker_5': 'And, you know, this stuff, I mean, it has to stop. Okay. And I think as a council, we need to put a firm foot down. And I'm sure, you know, I hope and I'm sure that we're going to get a lot of support on the council for this.'",
        "'speaker_5': 'But, you know, folks, this is not the place for this. And, you know, our town is much better than this. So I hope that, you know, we can be unanimous in this. And I appreciate the mayor, you know, adding her extra points to this based on the.'",
        "'speaker_5': 'I'm sorry. I forgot the name of the group. See, I'm already the mayor's. The Mayor's compact, so, I mean, that's basically the gist of it. And I don't know Vice Mayor, if you want to add more, but.'",
        "'speaker_4': 'So I just want to also say that, you know, at Temple Israel, I did speak with one of the students that was a victim of one of these hate crimes in the schools. I, you know, want to give credit to her for speaking up and for being vocal.'",
        "'speaker_4': 'It takes a tremendous amount of courage to do so. And I just want to say that I recognize that and I see your strength and I see you. And I think that in many ways there have been other cities that have taken actions to specifically call out acts of antisemitism, to specifically call out acts of hate.'",
        "'speaker_4': 'You know, we also had a noose that was found on our high school campus this first day of school. There are things happening in our own community here, not just nationally. And so we really do need to respond to it and to unequivocally say that hate does not belong here in our city, that we do not condone'",
        "'speaker_4': 'it, that it is not our brand and it is not who we are. I do want to make a couple of clarifying clarifications in our in our actual resolution. We we mention a few different regional issues and some other some other things that are happening.'",
        "'speaker_4': 'I do want to make clear that, you know, it's not just neo-Nazi ism, it's just pure Nazi ism, and that this isn't something that is come out of nowhere. That there has been, you know, continuous targeting of certain groups.'",
        "'speaker_4': 'And, you know, whether it's individuals that are of Jewish, ethnic or religious ancestry. And I think that it's, you know, or people that are being identified because of their skin color. And I really want to make it clear that we are taking a stand against that, that this is not something new, that just because these incidents have'",
        "'speaker_4': 'surfaced in our community as of late, it does not mean that they haven't been latent. And so I do want to make those clarifications regarding the statements, because we mentioned in recent years nationwide and in the Bay Area, but it's been going on for generations.'",
        "'speaker_4': 'So I'd be amenable to removing the in recent years portion of the. The first paragraph of whereas where it says in recent years nationwide and in the Bay Area I would just strike the in recent years portion of that the.'",
        "'speaker_4': 'Other the other statement that I wanted to make is, you know, our police department has, you know, very been very clear that they are investigating the incident at Temple Israel as a potential hate crime, as a hate crime.'",
        "'speaker_4': 'And they are looking for additional evidence. My understanding is that our updating policy there, you know, they are noticing us. I've seen the emails recently with regards to all the incidents in terms of getting the council notification. So I do want to make that very clear to the public that we are getting this and the direction is'",
        "'speaker_4': 'really reflective of what our current policy is. And so making sure that we're actually following through with what our existing policy is. So with that, I want to call up our first speaker. Jessica Lindsay. And her parents, Mel Waldorf and.'",
        "'speaker_4': 'Oh, sorry. Natasha waldorf is the speaker and jessica lindsay and mel waldorf have ceded their time to her.'",
        "'speaker_0': 'Hello. My name is Natasha Waldorf. Members of the City Council. Thank you for considering this resolution condemning incidents of bias, prejudice, discrimination, violence and antisemitism. The resolution is an important step, but I'm here to ask you to do whatever you can to make sure that students like me are protected from anti-Semitism in our schools.'",
        "'speaker_0': 'I've lived in Alameda my whole life and attended Alameda Public Schools in second grade. For the most part, my school experience has been good. However, last year was threatened multiple times because I am Jewish to the point that I felt unwelcome and actually afraid for my safety in the middle of a class.'",
        "'speaker_0': 'Last January, I received a text from an unknown number with a picture of Mr. Clean dressed in a Nazi Nazi uniform labeled Mr. Ethnic Cleansing. I thought, this must be a mistake, or perhaps a bad joke. So I replied with a random picture.'",
        "'speaker_0': 'Then I received a text containing a picture of a Nazi with the words Horns, get the gas. I quickly realized that whoever was sending these text was not joking around. I was called a kike. I was told Hitler's biggest mistake was not killing my family.'",
        "'speaker_0': 'And then I should apologize to all Germans. The text referred to me by name. Whoever was doing this knew who I am, but I didn't know who was threatening me. I was scared. I told my parents and went to the police who said we should work with the school administration.'",
        "'speaker_0': 'The next day, I learned that a German exchange student I knew from one of my classes had instigated the texts. I confronted him about it and his response was that I should just stop being Jewish if I didn't like it and that people don't like Jews because of that little country of yours, meaning Israel.'",
        "'speaker_0': 'He also questioned whether Jews have really been persecuted throughout history. Two days later, I was waiting for a class to start with a Jewish friend of mine when we overheard two boys making Holocaust jokes. We asked them to stop and they immediately replied that they wished our families had been thrown in the ovens.'",
        "'speaker_0': 'After the first incident, my parents went to see the school administration who took the stance that these anti-Semitic threats were simply rude comments and definitely not hate crimes. Then they tried to dismiss the German student's behavior, saying it must have been due to a language barrier, even though the student had no trouble expressing his hatred in English'",
        "'speaker_0': '. When the third incident happened, they again took these as just bad words. My parents talk with the dean and the vice principal, but they clearly didn't understand how hateful, threatening and frightening these incidents were. Telling a Jew that her family should have been killed in the Holocaust is like telling a black student her whole family should have'",
        "'speaker_0': 'been lynched. It's a very clear threat and I can tell you it instills very real fear. The administration says they disciplined the students. But all I know is that I didn't even get apologies from the German student or the two students who threatened me and my friend.'",
        "'speaker_0': 'Despite promises from the administration that I would, I was not asked to fill out a bullying report, even though I was asked to complete one when I witnessed one student push another. No report means no record of these incidents whatsoever.'",
        "'speaker_0': 'We're still I had to sit with these bullies in the same classes for the remaining five months of the school year, sometimes with them sitting directly next to me. Not only was seeing them daily difficult, it was clear from the behavior they believe they had one.'",
        "'speaker_0': 'In one of my classes, the same kids were telling Holocaust jokes right in front of a teacher who said and did nothing in response. Later in the year, I found a drawing on a desk with the words Jews are evil, along with the star of David holding a money bag about to be crushed by a sledge hammer'",
        "'speaker_0': 'with a swastika on it. At the end of the year. The Jewish Club, which I'm a part of, put up posters for the Jewish American History Month. They were all ripped down. Within three days, I informed the dean, who said it was probably just a mistake by students from the leadership class clearing old posters.'",
        "'speaker_0': 'The Dean never even considered that the incident might be anti-Semitic vandalism and should be investigated. My parents tried to help me immediately after I started in January. They spoke repeatedly with the school administration and the superintendent and made constructive suggestions.'",
        "'speaker_0': 'It didn't make a difference. The superintendent defended all actions taken and told us that all incidences were handled appropriately. Appropriately. How? Why didn't the school officials require the police to apologize to me and acknowledge that what they'd done was hurtful and wrong?'",
        "'speaker_0': 'Why was I forced to endure classes every day with these bullies sitting right next to me? Why wasn't the superintendent concerned enough about what was happening to let families know that anti-Semitism was a problem in our high school?'",
        "'speaker_0': 'And to make it clear it would not be tolerated? Why didn't the superintendent show any concern about me feeling safe and welcome at school, especially at a school claiming that everyone belongs here? As if this isn't all bad enough.'",
        "'speaker_0': 'This past Tuesday, I went with my parents to the Board of Education meeting. The board was considering a resolution like this one denouncing bullying, including anti-Semitism. My father wrote a statement because I wasn't comfortable enough to do it myself.'",
        "'speaker_0': 'He told the board about my experiences and how the superintendent knew about all this since last January and did nothing. After my father finished talking to teachers, immediately got up to defend the superintendent, saying he's a wonderful leader and how good he has been for teachers.'",
        "'speaker_0': 'They also took the opportunity to falsely accuse my family of being unwilling to work with the district. They actually claimed that my story was purposeful manipulation. These two teachers were essentially telling me that I don't matter to the district and that I am a liar.'",
        "'speaker_0': 'The superintendent who had just been talking about how much he cares about students, watched me get bullied by two of his teachers and did nothing. I was so upset and felt so betrayed by people who are supposed to care about me that I had to leave the room and barely managed to hold back my tears until I'",
        "'speaker_0': 'was outside. What kind of district is this? What kind of teachers demean and bully a student who's already endured, endured threats and bullying from her classmates? What kind of superintendent can claim he will not tolerate bullying of any sort and that he wants to make right what has been wrong and then sit by and watch me be'",
        "'speaker_0': 'victimized again right in front of his face. anti-Semitism is a serious problem in our schools. I'm not the only victim. I'm just the only one willing to stand up and fight. Members of the City Council, I hope you'll stand up to please do whatever you can to make sure the district makes the necessary changes in its policies'",
        "'speaker_0': 'and practices so that the district can honestly say everyone belongs here. Thank you.'",
        "'speaker_4': 'Our next speaker is Brian Schwartz.'",
        "'speaker_2': 'Thank you. Thank you. Vice Mayor and council member Odie and. My name is Brian Schwartz, and I'm a civil rights lawyer. I live here in Alameda. I'm ashamed. To be in a place where Natasha's having the experiences that she's having.'",
        "'speaker_2': 'I'm a Bay Area native, and I moved here with my family to Alameda. Well, actually, I didn't have kids at the time. We moved here because we thought that even though we could live anywhere in the world, literally anywhere, we chose this place because of its diversity here, not just because of the weather or the beach or'",
        "'speaker_2': 'the lively restaurant scene or any of those things. I moved here because this was the kind of community that I wanted my kids to grow up in because because it's a kind of community where unlike Lafayette or Orinda or Piedmont or San Francisco or Marin County or the peninsula here in Alameda there there really are all kinds'",
        "'speaker_2': 'of people. There are all kinds of people. Income wise, there all kinds of people, race, ethnicity, all living together. And I thought harmoniously and to some degree, that promise has been true. My daughter's best friend in school is African-American, and my son's best friend is Vietnamese-American and, you know, many other stories like that.'",
        "'speaker_2': 'But I never imagined that in moving to this place that that as a Jewish person in Alameda, that my children would not be safe. And it's not just a brick through the synagogue window, and it's not just Natasha.'",
        "'speaker_2': 'I've seen the places in Poland where Nazis murdered millions of Jewish people. And. It does start with things like this. My eight year old daughter last last year when she was eight was told by another eight year old student that she should have died with the rest of the Jews in gas chambers.'",
        "'speaker_2': 'We've seen hate against Muslims, against African-Americans. So yes, we have to pass this resolution, but. That. Is not enough. We have to say that there's this is no place for hate, but that's not enough either. We can't just say that we have to do something about it.'",
        "'speaker_2': 'I'm committed to helping. As a civil rights lawyer, as a citizen of this community, to helping however I can to start building the fabric that we need to build with all of these brilliant strands that we have here in this city.'",
        "'speaker_2': 'But we have to say yes. Free speech exists, but no hate is not consistent with our shared values. And we won't tolerate it. And. Well, I'm excited to see what we do next.'",
        "'speaker_4': 'Thank you. Do we have any council discussion?'",
        "'speaker_2': 'Councilor mutter I it's that's appalling. This resolution has to pass tonight. I'm okay with the edit that you proposed. I think that's the first example that we have to show. I think the next is up to city management from a city side to look at the tenants and the resolution and present to us at whatever occasions that'",
        "'speaker_2': 'they're there are including the city manager's report on steps that we're taking to fulfill. The direction that's given in this resolution. And then I do know that we have a liaison committee between the assumed and the city council.'",
        "'speaker_2': 'And I think that would be a vehicle to. Formulate the next steps. I don't think we can do it here tonight. The next steps that Mr. Schwartz references with, I understand, to members of the school board, two members of the council superintendent and the city manager, and come back to the body with anything that can be coming'",
        "'speaker_2': 'out of that discussion. And I don't think this is a one time deal. This resolution is meant to be durable and. Vigilance is going to be required and we have to act quickly when things do happen.'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'Thank you, Councilmember Councilmember Ashcraft.'",
        "'speaker_3': 'Thank you. And Vice Mayor Violet. So, Jessica Lindsey, mother of Natasha, and I served on the Economic Development Commission together a long time ago. And I knew her when she was, well, just a baby. And she certainly became a beautiful young lady.'",
        "'speaker_3': 'And it is appalling the story you told. We are the city, so we're a separate entity from the school district. But as a councilmember matter, S.E. noted, there is a liaison committee and I sit on it between the city and the school district.'",
        "'speaker_3': 'The mayor is the other member. And I mean, just the thoughts that were running through my mind were if this was and I realize it was more than one student, but if there was an exchange student involved, is it I mean, when I was going to Alameda High a long time ago, I was American Field Service.'",
        "'speaker_3': 'I don't know if, you know, what group sponsors an exchange. And I would think at the very least, they should be made aware of these actions. But this is just what I think. And sometimes even after the fact, you can do things.'",
        "'speaker_3': 'But I do agree that this is something that should be added to our agenda for our next mayor. I can't remember. I think it's next month, isn't it? October 10th we are meeting. And so I just. It's appalling.'",
        "'speaker_3': 'And to me it's just so sad because I want to think that we've made more progress. And in a lot of ways I think we have. But you can't let your guard down. And an education is so important.'",
        "'speaker_3': 'I and I know I should say that. Brian Schwartz I would also like to introduce you to my very eloquent appointee to the Open Government Committee, because my previous appointee moved out of Alameda to Davis with her family.'",
        "'speaker_3': 'And I asked Brian if he would would fill that role because I knew he would be a bright, capable and eloquent voice. So I'm very glad I wanted to get you more involved in the city. And it sounds like we're going to find ways to get you more involved still.'",
        "'speaker_3': 'But and I know your wife and Alicia had told me that story about your daughter, and it was eight years old. It's just. Anyway, yes. Passed the resolution and then hopefully this sort of thing will generate the kinds of discussions we need to have at.'",
        "'speaker_0': 'Schools.'",
        "'speaker_3': 'And religious institutions and community gathering. But we need to talk about it. And this is a first step.'",
        "'speaker_0': 'So just remember. Think.'",
        "'speaker_5': 'Thank you. And I kind of echo a lot of what my council or fellow colleagues said. And that was really brave. And Natasha left the room. I can understand why, but please. Ella was very brave. And, you know, I don't want to deviate too much into social commentary here, but I think a lot of us thought, you'",
        "'speaker_5': 'know, back eight or nine years ago that, you know, this was a different country. Right. That we were over a lot of the evil and horrible and worst in our nature. And in the last year and a half, you know, I think a lot of us have a rude awakening that that's not true.'",
        "'speaker_5': 'And that not only as the vice mayor said, these attitudes, these beliefs, these people that believe them are out there, but now they feel embolden because like it or not, you know, they have a compadre in the White House that thinks it's okay to be this way.'",
        "'speaker_5': 'So that's why we wanted to call out, you know, specifically, you know, white nationalism, you know, Nazi ism. I'm not afraid to say it. I'm not afraid to say that this is the problem. I'm not afraid to say that these are the people whose beliefs do not align with us, and we can't dismiss it as you know'",
        "'speaker_5': '. Language barrier. We can't dismiss it as kids being kids. You know, we can't just dismiss it. We have to acknowledge it. And every time something like this happens, you know, this is I'm asked. We asked for the reporting not to be punitive to anyone on staff or in the police department because they're doing an amazing job.'",
        "'speaker_5': 'But to make sure the public knows and is reminded that, you know, we have to fight these and the I think we fight them is with transparency. And, you know, I think. Brian. Right. I mean, I appreciate your comment that I, too, visited, you know, Auschwitz and the one next.'",
        "'speaker_5': 'I think it's broken out. Right. And that was just, you know, mind boggling. And I told this story before, and I'll say it again, you know, I have a branch in my family. My mother does all the genealogy, and there's one branch from Poland.'",
        "'speaker_5': 'A Western Poland that is just gone. She can't find records. They're not in the Catholic Church records, so perhaps they're not Catholic. So I don't know. And she did the DNA, which shows where your descends into our you know, and you could see where she's found all these people.'",
        "'speaker_5': 'And there's blotches of, you know, dots where where these people live that are potential relatives. But in this area, in Poznan, in western Poland, there's none. So I don't know where that branch of the family is. You know, I don't know if they were massacred by Ukrainians.'",
        "'speaker_5': 'I don't know if they were sent to the death camps and killed by the Nazis. I don't know that. So I mean, it is kind of a personal thing to me, you know? So. I'm sorry. I'm going to start crying, so I'm going to stop.'",
        "'speaker_5': 'But. Yeah. I can't. Thanks.'",
        "'speaker_4': 'So it's 1057, and I'm going to need to have a motion to continue that move.'",
        "'speaker_2': 'We finished.'",
        "'speaker_4': '11.'",
        "'speaker_5': 'A second.'",
        "'speaker_4': 'All those in.'",
        "'speaker_2': 'Favor.'",
        "'speaker_0': 'Hi. Hi.'",
        "'speaker_4': 'So a couple of things that I really appreciate the support that I'm hearing from my colleagues up here tonight. And there was an incredible showing. All five members of the council were at the temple in response to that incident that occurred.'",
        "'speaker_4': 'And so I think that that was a tremendous first step to show that we were all in sync and in line in terms of wanting to have a very clear response. Our city manager was there as well. You know, I think.'",
        "'speaker_4': 'This is one of these issues that you you know, when I. You don't think, okay, we're going to have to get up here and pass a resolution and address it. But what we found is that by talking about it, by having these events, more people are coming forward and to the point where we're asking for training opportunities'",
        "'speaker_4': 'and things like that. There's a lot of training that our police officers get, and one of the requests that we've gotten is could there be an update perhaps at the Shrub board about just the trend in terms of the different hate crimes that have happened and what the response has been and what our general protocol is, how'",
        "'speaker_4': 'we go about identifying these things in the in the general process, because many members of our community don't know necessarily who to call or how to report it or what a hate crime is. And I think it's a term that we're starting to hear more and more of, unfortunately.'",
        "'speaker_4': 'But in many ways, we also want to empower our constituents to understand and feel welcome in embracing the processes that we have laid out and that we already have. And I know that the information is available online, but perhaps it could be a topic that's covered.'",
        "'speaker_1': 'Yeah, we could talk to Shrub about it. There is a couple of things. I mean, I think Natasha story was shocking to the core and it does have to stop. My and the resolution and especially having a liaison meeting with the school district in the city I think is important.'",
        "'speaker_1': 'What I'd like to do, though, there's a difference between a hate incident and a hate crime when a hate crime has a victim. Right. A hate incident is something that you might find that isn't targeted towards an individual.'",
        "'speaker_1': 'Right. There is also part of some of the people who do hate incidents, this or hate crimes, they do it because of the attention. Right. And I don't want to have an unintended consequence of me giving reports of things happening in town to actually increase the number of hate incidences or hate crimes.'",
        "'speaker_1': 'And we have actually seen an increase recently with the Facebook posts and the media coverage on it. What I would rather talk to the council about is what we're doing about it, not about the incident itself, but what is the outcome of a USD in the City Liaison Committee?'",
        "'speaker_1': 'What did Shrub say? What education are we doing to minimize the unintended consequence of giving someone the additional attention that they are somehow shockingly requiring, and instead do it more about how we're going to go forward from here to make a difference?'",
        "'speaker_1': 'So that's my only concern about the way that the resolution or the referral was written for the second part of it. The reporting out.'",
        "'speaker_4': 'I take reporting out to be fairly broad. I mean, you give us updates relative to our resolution that we passed about the sanctuary city in terms of different steps that that you're taking. And I think from at least from my perspective, it's really to talk about what the city is doing to address things that have happened.'",
        "'speaker_4': 'And so we want to make it very clear that the city is not going to be idle and not do anything. I'm not going you know, we will have a response. We are going to investigate. This is what we're doing.'",
        "'speaker_4': 'This is how we're handling it, whatever might be appropriate. But I do want to make sure that that's done publicly, because I think in many ways it takes a tremendous amount of courage to speak up in the first place and to come forward.'",
        "'speaker_4': 'And so I want to make sure that we're not.'",
        "'speaker_1': 'We're not stifling. We're not.'",
        "'speaker_4': 'Stifling that.'",
        "'speaker_1': 'But also being sensitive to that.'",
        "'speaker_3': 'It's a good point. I think that the city manager made we and there's a there's a delicate balance, I think, to be achieved.'",
        "'speaker_4': 'And it's it's not to say that, you know, we did reference some of the specific incidents that have happened. And I think, you know, certainly through the liaison committee and through Shrub and even through this process of reporting out, I want to make it very clear that it's not to say that we're going to gloss over that'",
        "'speaker_4': 'something happened. We're going to say there was an incident. This, you know, this is what happened. This is who was targeting. We don't necessarily have to glorify the incident or give it a lot of fanfare, but we can I mean, in order to talk about what steps you're taking to address something, you inherently have to talk about'",
        "'speaker_4': 'the underlying issues.'",
        "'speaker_1': 'And there's different levels like Natasha's story is dramatic and shocking. There have been some significant incident reports that the police have started doing more of. Some of them were not previously. Mm hmm. Rose to the level. And I personally think that two roommates fighting and using language against each other should not be a significant incident report.'",
        "'speaker_1': 'So I would like to give that discretion back to the police. Say tell us the ones like the Temple and Natasha's story and the ones that rise to a level, rather than saying anyone who comes to the police department to complain is equal and equal to murder or.'",
        "'speaker_1': 'Other things, it's like. Our priority setting is these are really know the difference between a hate incident and a hate crime. And I think we need to make sure that they, as the professionals, contain and have still their discretion that they are granted by state law.'",
        "'speaker_4': 'And I understand that. I think my concern arises out of the fact that, for instance, with the with the Temple Israel incident, I learned about it through members of the public. And there wasn't a report sent out until.'",
        "'speaker_1': 'A couple of days.'",
        "'speaker_4': 'A couple of days later. And so I think from a counsel standpoint, we also I think there's an expectation as elected officials that we respond to certain things or at least be knowledgeable and be aware that they're happening so that we can be of assistance to our constituents.'",
        "'speaker_4': 'So I just want to make sure that we we do strike that balance. I think there's it's one thing when there's some sort of personal dispute between two people, and it's another thing when there's, you know, either a major action taken against a symbolic place or building or something that's, you know, something that rises above and beyond'",
        "'speaker_4': 'where it's very much directed at targeting an individual and the comments being made.'",
        "'speaker_1': 'I totally agree with that. I mean, and I think the temple incident, it was like 12 hours later. Mm hmm. And it should have been earlier and we've talked about that before, but so that going forward and that level is as soon as possible get that information out.'",
        "'speaker_1': 'But that's the the difference and sort of knowing that there's a range and the range.'",
        "'speaker_4': 'Or it's also one of those things and I've heard the comment that hate incidents, you know them when you see them sometimes they're hard to describe specifically in terms of because they can be so many different things and they can occur in so many different ways.'",
        "'speaker_4': 'But, you know, the courts have said that about other types of speech. And I think this is one of those things. I mean, the stories that we've heard tonight have all been very shocking, very disturbing. The other thing that I want to add is, again, the the training aspect of this and letting the public know what the'",
        "'speaker_4': 'routes are in terms of what they can do to report things, who they report to, what type of information matters. There's a lot of constituents. They'll see something and they're shocked by it or disturbed by it. But then they they don't know who to call or what sort of information is necessary.'",
        "'speaker_4': 'Like, I saw this on this day. This is what I did. Don't you know, don't get rid of it. But you have to make sure you documented and give are police officers. So how can they be of assistance in terms of reporting mechanisms, I think would be something that I've heard would be much appreciated and helpful.'",
        "'speaker_4': 'The other thing is the Anti-Defamation League has offered to give a presentation either at Shrub or in conjunction with the city regarding some of their best practices and the trainings that they do. And I think that if we can work with these different organizations, that would also be a nice step in terms of following this up without'",
        "'speaker_4': ', you know, using the most of the resources that exist.'",
        "'speaker_1': 'And our police have. 98% of all our officers did a bias training that we were the first city in the region to do it right. I think in the state. So we we are on it from that perspective as far as the training of our officers.'",
        "'speaker_0': 'Okay, I if I could.'",
        "'speaker_4': 'And then so I had the first amend amendment to the resolution that I mentioned. The Second Amendment that I wanted to add was in the third paragraph where it says these acts. We heard very clearly from one of our student or Almeida Unified students tonight that those acts weren't from a white nationalist or racist group they were'",
        "'speaker_4': 'from. Racist individuals. But they weren't necessarily part of a coordinated group. So I would also like to amend that paragraph to just say some of these. So I would like to add some of.'",
        "'speaker_0': 'Our.'",
        "'speaker_4': 'Paragraphs. It's paragraph.'",
        "'speaker_0': 'Three.'",
        "'speaker_5': 'So whereas some of these.'",
        "'speaker_4': 'Whereas some of these acts appear to have.'",
        "'speaker_3': 'Come third, whereas.'",
        "'speaker_4': 'Correct.'",
        "'speaker_2': 'Ready for motion.'",
        "'speaker_5': 'I'll move approval of the item.'",
        "'speaker_2': 'For.'",
        "'speaker_5': 'As has amended by the vice mayor second.'",
        "'speaker_4': 'All those in favor.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Thank you, counsel.'",
        "'speaker_4': 'Thank you. And so Councilmember Communications.'",
        "'speaker_2': 'Before we leave that, can we summarize what I'm sure maybe as the city manager to summarize immediate steps? That relate to the liaison committee just to make sure that we know what.'",
        "'speaker_0': 'Was going what's going to happen.'",
        "'speaker_1': 'And we will add to the agenda on October 10th. And actually I encourage Pasha to come. It is open to the public.'",
        "'speaker_4': 'What time is the meeting city manager.'",
        "'speaker_1': 'I mean, get it usually 4:04 p.m..'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Yes, it's 4 to 5 and it's here at City Hall.'",
        "'speaker_4': 'And it's a and it's a public meeting.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Okay.'"
    ]
}