{
    "Proclamation Declaring November 17 through November 23, 2019 as United Against Hate Week.  (City Manager 2110)": [
        "'speaker_1': 'And three B, I mean, five B sorry is a proclamation declaring November 17th through 23rd as united against hate week.'",
        "'speaker_0': 'Right. So proclamation. Whereas the City of Alameda welcomes honors and respects the contributions of all residents of all races, national or ethnic origins, gender, sexual orientation, religion, or immigration status. And. Whereas, to combat the propagation of racist, xenophobic, sexist, homophobic Islam, Islamophobic and other bigoted views, cities from across the Bay Area and the State of California are'",
        "'speaker_0': 'participating in United Against Hate Week, a call for local civic action. And. Whereas, elected officials and community members play an important role in promoting a hate free environment and creating safe, flourishing communities. And. Whereas, by recognizing United Against Hate Week, the city of Alameda is taking an important step to bridge divisions and strengthen our community, enabling our'",
        "'speaker_0': 'residents to help create lasting change. And. Whereas, as a sanctuary city, the city of Alameda is committed to the values of dignity, inclusivity and respect for all. And. Whereas, education, compassion and cooperation are key to understanding and embracing differences between people.'",
        "'speaker_0': 'And. WHEREAS, Alameda is annual Unity Picnic, which was held this year on Saturday, November 2nd at Crab Cove from 11 a.m. to 3 p.m., brings people together to celebrate our diversity and shared values, providing a safe space to join together as one island united in friendship with a shared meal and cultural entertainment.'",
        "'speaker_0': 'Now, therefore, be it resolved that I Maryland, as he Ashcraft, mayor of the city of Alameda, do hereby proclaim the week of November 17 through November 23 as united against hate week in the city of Alameda and encourage all residents to participate in community events that celebrate our diversity.'",
        "'speaker_0': 'Thank you, everyone. Okay. So then we move on to, um, item.'",
        "'speaker_1': 'For now. We have three speakers under all communications. There were some speakers just to clarify for the public that submitted under all communications and on the same topic as the Vision Zero. And since that'll be heard very next, we just went ahead and move them into that pile because there were some that had submitted it both ways'",
        "'speaker_1': '. So we wanted them all to be heard together. Okay. There's just three under oral now. All right. It's Allan prior to Spencer and Keith Neely.'",
        "'speaker_0': 'Okay. So this is now oral communication where you can speak. There's 15 minutes set aside, 3 minutes per person to speak on an item, not on the agenda. Alan Prior, I think you first come on up.'"
    ],
    "Adoption of Resolution Establishing a Vision Zero Policy to Work Towards Zero Traffic Deaths and Severe Injuries. (Transportation 4227287)": [
        "'speaker_0': 'Took the words right out of my mouth in a second. It's been moved by the vice mayor, seconded by Councilmember Vela. All in favor. I. That was five. Okay. All right. So then we agreed that we would first hear five m correct.'",
        "'speaker_1': 'Adoption of resolution establishing a vision zero policy to work towards zero traffic deaths and severe injuries.'",
        "'speaker_6': 'Good evening. Hello, Mayor Ashcraft, members of the city council, members of the public here tonight. I'm Andrew Thomas, planning director, and I'm here with Lisa Foster from the transportation staff. Lisa and I are going to introduce the item for you tonight, and we're available to answer any questions, along with Richelle Wheeler, who also helped put this together'",
        "'speaker_6': 'for us tonight.'",
        "'speaker_0': 'And if I might just interrupt you and counsel, you tell me how you feel about this. But I'm thinking that perhaps we would take our public speakers first just because we have a lot with children. Or do you want to hear staff report first?'",
        "'speaker_8': 'We're fine with hearing this from the speakers.'",
        "'speaker_0': 'First that be okay. Okay. If you don't mind, Mr. Thomas, we're going to go ahead because I try to defer when families have children, because I know that the hour gets late quickly. So.'",
        "'speaker_1': 'Seven speakers. So don't get. Okay.'",
        "'speaker_0': 'So when we have seven speakers, it means you each get 2 minutes. But 2 minutes is really quite a bit of time. So the city clerk will call your names, just listen for your names and come on up and so that everybody can hear you, including those who are watching on television.'",
        "'speaker_0': 'Be sure you're getting close enough to that microphone up there. You can bring it down or up to your level as needed. Okay. Take it away.'",
        "'speaker_1': 'Suzy Hofstetter, Britney and Mia Schrag and Jennifer. I'm sorry. I'm having trouble reading. Your last name starts with a t t. Thank you.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'Good evening, Mayor and council members. My name is Suzi Hofstetter. I'm advocacy manager with Bike East Bay, member of Bike Walk Alameda and a resident of here in Alameda. While I don't have kids in our school district, I'm really proud of everyone who's been outside tonight.'",
        "'speaker_3': 'And I really applaud our school communities for standing up for traffic safety here in Alameda. I'm just here to speak in wholehearted support of the Vision Zero program. And I'd like to encourage everyone who's here to participate in the outreach process for the active transportation plan in Alameda.'",
        "'speaker_3': 'This is an opportunity to really envision how our city can be safe and accessible for people biking and walking. And I also hope that parents will keep having your kids bike and walk to school. There is safety in numbers and the fewer parents have cars out there, the safer it will be for everyone.'",
        "'speaker_3': 'So keep keep biking and walking. And if you're driving out there, just slow down and please be more careful while we advocate for more systemic change. Thank you.'",
        "'speaker_0': 'Thank you. Who's your next speaker?'",
        "'speaker_1': 'Brittany and Mia Schrag.'",
        "'speaker_0': 'Come on up.'",
        "'speaker_3': 'Good evening, everyone. My name is Brittany Schrag, and this is my daughter, Mia. Unfortunately, she is one of the statistics in our city. The very first week of school, she and a vehicle collided right outside of Wood Middle School.'",
        "'speaker_3': 'We've lived here for approximately a year and we came from northwest Arkansas, where we were working really heavily on a Vision Zero. So this is definitely a passion that I have. And one thing I will definitely applaud the city is the changing in the wording of Vision Zero, not just deaths and injuries, serious injuries, but life changing'",
        "'speaker_3': 'injuries because even though she was not seriously hurt, she only had some minor physical injuries. Even myself, I felt injured because my safety, my ability to protect my 12 year old daughter on her path to school was completely shaken and felt like the rug was pulled out from under my feet.'",
        "'speaker_3': 'I know there are a lot of families that walk with their children and and have expressed, you know, near-misses and close calls. And so this Vision Zero really is a bold move for the city. I think it'll help us shine in this area.'",
        "'speaker_3': 'And to whatever extent that we can push the envelope and really help us shine, I think will make us better for it. Help. Thank you.'",
        "'speaker_0': 'Thank you both.'",
        "'speaker_1': 'Jennifer Teague, then Jill Deer, come and cut her.'",
        "'speaker_0': 'Hi. Come on. I remember the microphone. Okay. Yeah, my name is.'",
        "'speaker_1': 'Nicholas, and I was one of the kids.'",
        "'speaker_3': 'Who got hit.'",
        "'speaker_1': 'And I just want to say that this bike safety, bike safety.'",
        "'speaker_3': 'Car awareness thing needs to happen because now every time every time when I go to the go to the place where I got hit, I on my way to school, I feel paranoid that I'm just going to get hit again.'",
        "'speaker_3': 'And I don't want that parent paranoia to happen. And I just I just really, really need this thing to happen for my four kids safety, my safety and all other people's safety and how and how and how other people feel about what happens when people get hurt.'",
        "'speaker_0': 'Thank you very much for sharing that. Mom, did you want to say anything? He said it all. Thank you so much. Thank you. And you know what, everybody? I have a rule in our meetings and it is my goal is always to get us out the same day that we started and we've got a bunch more items'",
        "'speaker_0': 'so we don't apply. We don't Bill, we don't do the wave. We just speak and listen. We're really good, respectful listeners and then I'll get you all home on time. So our next speaker is.'",
        "'speaker_3': 'Jill de Giacomo Alameda resident. My two sons are back there, third lot too shy to come up, but my oldest son, Paul, is 11. A couple of years ago, he was almost hit by a car in an intersection.'",
        "'speaker_3': 'I was with him at events and all and Burnside. And the thing that really struck me about what happened was that when we were on the sidewalk, there was not a car on the other side. It was only when we were in the crosswalk that a car approached the intersection and clearly somehow did not see him and'",
        "'speaker_3': 'only stopped because I stepped in front of the car and put my hand up and screamed, stop at the top of my lungs. So that was a pretty scary occurrence and my kids do not bike to school. I'm too fearful.'",
        "'speaker_3': 'I don't know if an intersection like that could have all reds when there are pedestrians in the crosswalk. But that was the first thing that came to mind for me. Having experienced that in San Francisco, the all reds, I don't know if that is an inexpensive solution and expensive solution, but it seemed like a very practical one'",
        "'speaker_3': 'that would make a really big impact because if the car had been at a stoplight, it would not have been taking a left when we were in the middle of the intersection. So I just wanted to share my experience and really hope that nothing like that happens to another child or family.'",
        "'speaker_0': 'Thank you. Thank you. Thank you for sharing with us.'",
        "'speaker_1': 'POTTER Then Rachel Pluto, then Lauren Geringer.'",
        "'speaker_3': 'Lo Potter bike walk Alameda. Love the vision zero but I do think the that the city really needs to step things up. I think the trouble with the plans that we. Put forth is that they take too long.'",
        "'speaker_3': 'We really need to get this done. We need to lower the speed limits at schools to 15 miles an hour. We need to have proper signage. And there really isn't any excuse to delay it. So on behalf of Bike Walk Alameda and the parents and the kids who have suffered through this, please do it now.'",
        "'speaker_3': 'Don't wait until the Vision Zero gets finalized. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'To hear Rachel Potter, then Lauren Gehringer.'",
        "'speaker_0': 'Come on up.'",
        "'speaker_3': 'Good evening. I'm Rachel Plato, concerned parent and PTA president at Loeb Elementary School, as well as the host of tonight's Rally on the Steps. We have had six children hit by vehicles on the street since August. This is unacceptable.'",
        "'speaker_3': 'We as parents are extremely alarmed that our roads are lacking the flashing signs and there is no special speed limits for these zones. I personally believe the speed limit should be lowered to 15 miles per hour during school hours, as was recently adopted in Sacramento.'",
        "'speaker_3': 'We are not traffic engineers. We don't know what's best, but we do know that our children's safety is number one priority for the city. We need to make these changes to save their lives. At left school, we are situated between two busy streets Lincoln Avenue in Santa Clara.'",
        "'speaker_3': 'Currently, there are no school zone signs or road paint on our side for our school. We have 550 students that crosses four busy corners every day with only one crossing guard. This needs to be addressed immediately. Love School, formerly Henry Haight Elementary, is 100 years old.'",
        "'speaker_3': 'Why don't we have a school zone? This is unacceptable. We are optimistic that the city is hearing and sharing our concerns. What? We are thrilled about this voting on the Vision Zero initiative. We need immediate school zone safety improvement for our children.'",
        "'speaker_3': 'Safety. Please do the right thing.'",
        "'speaker_0': 'Thank you. Next speaker is Lauren Geringer. Can you. Can you hear.'",
        "'speaker_3': 'Me? Hi.'",
        "'speaker_1': 'I'm here tonight because eight months ago, while my kids and I were walking home from the elementary, a car sped through the crosswalk at Chestnut and Lincoln to turn right on red coming within an inch of hitting my son.'",
        "'speaker_1': 'If this had been a fluke, I would not be here tonight taking up your time. But I had seen so many close calls at this intersection prior to our incident and have seen so many since. Sadly, it turns out this problem is not limited to love elementary.'",
        "'speaker_1': 'Already the school year, six kids have been hit by cars on their way to schools throughout the island. Well, I'm heartened and optimistic about the Vision Zero initiative, and I look forward to participating in active transport planning. And while I truly appreciate the expressed intentions from the city to be making these urgently needed safety improvements, I can't'",
        "'speaker_1': 'wait quietly and patiently for those changes to be made while our kids are getting hit right now. Last March, at the time of my son's close call, I emailed the city to express my serious concerns. It was explained that nothing could be done until a new traffic engineer was hired.'",
        "'speaker_1': 'Eight months have since passed, and it's my understanding that that person has recently started work. I'm hopeful that means no reason for any more delay. I have to believe the city can do better than what is currently in place to protect our children making their way to and from school each day.'",
        "'speaker_1': 'We need immediate action before the ultimate tragedy occurs because we're getting really close. So thank you.'",
        "'speaker_0': 'Thank you. And that was our last speaker. Was there anyone else who didn't take the speakers to Baton wants to speak? Okay, then I'm going to close public comment and then we'll have our staff report. Now, usually we do it in reverse, but like I said, I just want to make sure that people with children.'",
        "'speaker_0': 'Somebody wants to make a comment. Okay, come on up. Make your comment and then you can fill a speaker slip afterwards. Oh, hello.'",
        "'speaker_1': 'My name is Denise Nelson. My son is James. He was hit in a crosswalk October.'",
        "'speaker_3': '1st at Lincoln and Willow going to school at Lev Elementary School. And it was a miracle that a neighbor saw and came and got me. I was able to get there before the ambulance. When I arrived.'",
        "'speaker_1': 'My son was bloody.'",
        "'speaker_3': 'And scraped head to toe. When I asked how he was, he had to wipe the blood out of his mouth just to say, Mom, and this isn't a shock, actually, because we live on Lincoln Avenue and we watch cars race up and down Lincoln Day and night.'",
        "'speaker_3': 'But the mornings are horrifying. It is difficult. I cross three streets to get to Alameda High School for work and every day I have close calls every day. And I want my son to be independent. He's ten years old.'",
        "'speaker_3': 'I don't want to walk him to school. And the unthinkable happened. And I have to let him go out that door every morning. And my greatest fear happened. And I don't I don't want it to be.'",
        "'speaker_1': 'Too late for someone else. Thank you.'",
        "'speaker_0': 'Thank you. Okay. Okay. Those were sobering. Thank you all for sharing your views. And Ms.. Plato, I know that we emailed about the rally. I tried to move closed session along, but we we went to all seven, but we were thinking of you.'",
        "'speaker_0': 'So now we are going to hear our staff report. So Mr. Thomas said, come on in.'",
        "'speaker_6': 'All right, listen, I'm going to tag team. This will move through this. Quickly so we can get to your questions and comments. The the tonight what we're bringing for for you is a council policy. This is a policy to sort of establish and clarify sort of once and for all how the city will plan for operate and'",
        "'speaker_6': 'maintain our local roadway network for the Alameda public. As all of you know, but and certainly public employees, we know our basic purpose here as city employees is protect the public health, safety and welfare. So there is nothing more basic than this than this this idea.'",
        "'speaker_6': 'Vision Zero is, as the slide says, sort of it's an international movement. It's it's something that more and more cities are sort of grappling with. And it really comes down to this very simple idea. It's not okay for a single person.'",
        "'speaker_6': 'Therefore, the goal should be zero for a single person to be to be hurt, to die, God forbid, or have life changing injuries on the public roadway system that we're providing for them. Accidents are not inevitable. We need to be working as a city and as a staff to make that number zero.'",
        "'speaker_6': 'This is not something that just sort of popped on us yesterday. The city of Alameda and the city council as early as 2017 started integrating this idea of Vision Zero into the general plan. Just this year, the City Council has approved the active transportation plan contract and the funding to really move this initiative along faster.'",
        "'speaker_6': 'On September 3rd, this council said there was a referral saying we need to move some of these issues and Vision Zero was one of those issues and really move things along. Shortly thereafter, at your request, we brought forth a change to the muni code so that we can start daylighting intersections.'",
        "'speaker_6': 'What that means is making it preventing obstacles and parked cars from being within too close to sidewalk crossing so so that we can improve the visibility. So we have less of these kinds of situations where people just don't see each other.'",
        "'speaker_6': 'And then we brought forth this policy which your council or your transportation commission considered on September 25th and unanimously recommended that that we move forward with. So with that little introduction, what I'd like to do is introduce Lisa Foster, who did all the heavy lifting on this, to just take you through about six or seven slides, sort'",
        "'speaker_6': 'of describing what this policy does in a little more detail.'",
        "'speaker_3': 'Thank you, Andrew. Good evening, Madam Mayor and council members. I'm Lisa Foster. So the policy that we are presenting to you today makes safety the explicit highest priority in Almeida's transportation efforts. It requires the city to prepare a Vision Zero action plan that would be based on collision data to show us where the streets are most dangerous'",
        "'speaker_3': 'and develop specific actions to make the streets safer. That action plan would be developed by a multidisciplinary task force that would include members from staff members from planning, building and transportation, police, public works and the fire department, plus other stakeholder organizations like AUC DE and people who can represent senior disability, pedestrian, bicycle and other interests.'",
        "'speaker_3': 'The policy also requires city staff to immediately start looking into a few specific policies and standards that can be implemented quickly to make and inform our paving program to make our streets safer, such as crosswalk and bulb out placement and lane widths.'",
        "'speaker_3': 'It also requires us to implement Vision Zero equitably and to bring an annual report to the Transportation Commission and the City Council. The United States has the highest traffic death rate per capita in the. Compared to peer nations with 40,000 people dying every year on our United States streets.'",
        "'speaker_3': 'In Alameda between 2011 and 2018, 16 people died on our streets, an average of two per year, and 82 people suffered severe and life changing injuries, an average of ten per year. In addition to people being killed and severely injured, more than 1700 people reported pain or endured mild to moderate injuries from traffic collisions from all modes'",
        "'speaker_3': '. And I do want to emphasize emphasize that Vision Zero is about all modes.'",
        "'speaker_0': 'I'm going to stay a little closer to your microphone.'",
        "'speaker_3': 'Okay. And for 2019, that would include the seven children who have been hit by cars for this school year, five of whom were going to and from school. I wanted to take a moment to talk about what the city is doing about that.'",
        "'speaker_3': 'Right now, we we're putting together post collisions, site visits with police department, public works and. This is new information, actually.'",
        "'speaker_0': 'Yeah, no, I'm aware of it. Is there a slide for the audience? Yeah.'",
        "'speaker_3': 'All right. I'm sorry. And planning, building a transportation in the cases with schools involved will invite the principal as well. The idea is that we will review any potential short and long term safety improvements from the standpoint of engineering and maintenance since enforcement and education.'",
        "'speaker_3': 'This is a new cooperative approach for the city and a bit of a practice run for Vision Zero. If that policy is adopted. The police department is also planning to do enhanced enforcement around schools during drop off, and the city has added a transportation safety effect on its website.'",
        "'speaker_3': 'I think U.S.. Back to Vision Zero. A core principle of Vision Zero is that traffic deaths are unacceptable and preventable. We have long as a society, accepted that traffic deaths are a part of the cost of transporting people.'",
        "'speaker_3': 'But we need to shift our mindset and this policy will help us do so. Equity is baked into Vision Zero. And that is because there are disproportionate risks for seniors, children, people of color, people with disabilities, people in low income communities, and people walking and biking.'",
        "'speaker_3': 'In fact, between 2011 and 2018, half of the Alameda traffic fatalities were people walking. And of those people, all of them who all of the pedestrians who died were 59 years old or older. Making it safer for seniors will be particularly important for Vision Zero.'",
        "'speaker_3': 'Vision Zero is uniquely multidisciplinary, bringing together engineering and street design education like a safety campaign or education maybe for truck drivers and enforcement. We know that people will always make mistakes. The idea is to create an environment where human error does not cause death or severe injury.'",
        "'speaker_3': 'For instance, we know that reducing speed saves lives. A person walking has only a 50% chance of living at all if hit by a car traveling 42 miles per hour. But that same person has a 90% chance of living if the car is traveling 23 miles per hour.'",
        "'speaker_3': 'We recommend that the City Council adopt this resolution establishing a Vision Zero policy to work towards zero traffic deaths and severe injuries. As we move forward, the policy will affect, of course, budget requests and priorities, and we believe it will increase partnerships across the city.'",
        "'speaker_3': 'The policy will not immediately achieve all of the necessary changes, but it establishes a framework to guide the years of work and effort that will be required to protect the health and safety of people using the public. Right of way in Alameda.'",
        "'speaker_3': 'Thank you for your time and we welcome your questions.'",
        "'speaker_0': 'Thank you. Council any clarifying questions about staff report before we go into our discussion. Seeing then discussion motion. We'd like to start. Vice Mayor This maybe next week.'",
        "'speaker_5': 'Thank you for that lovely staff report. I'd like to thank all the parents for being here. I'm sorry that you have to be. I've met with a number of you, have spoken with quite a few of you as well.'",
        "'speaker_5': 'And I think before I make my comments, I just want to make sure that it's clear that while there is a lot of work ahead, I think it's really also very clear to me in the first nine months that I've been here that you finally have a council that is taking this very seriously.'",
        "'speaker_5': 'You have a staff that is taking this very seriously. And we are making giant steps forward in the last few months on this issue because of the collaboration that we're doing. It doesn't mean that everything is going to get better tomorrow.'",
        "'speaker_5': 'This is a big battleship. It's going to take a long time. We need the community pushing us forward to do better, to identify issues as well. But but I do want to make sure that it's clear that, at least from my perspective, we have your back and we're here working on this.'",
        "'speaker_5': 'Vision Zero is really important. You know, it is shocking to me that it's actually now seven kids in the first two months of this fall, September and October have been hit in Alameda. Those kids were trick or treating.'",
        "'speaker_5': 'They were walking in their neighborhoods. Five of them were going to school. We pride ourselves on being the community where it's safe and family friendly. And I think people having to feel scared crossing the street just to visit neighbors to get to their schools is really, really important.'",
        "'speaker_5': 'I really, really problematic. We need to do more and we need to do more really fast. We need to change the way we are doing enforcement on our streets. We need to prioritize our enforcement on our streets on things that cause injury and death.'",
        "'speaker_5': 'We have the data to to to make those shifts. And we need to do it fast. We need to speed up. And in February, we unanimously directed staff to come back with a traffic calming program that didn't have requests for making things safer in our community.'",
        "'speaker_5': 'Take for 18 to 24 months, but actually started doing some things fast and, you know, being available, being able to make mistakes. One of the things I think we know and I worked for the city of San Francisco in my day job, one of the things I think some of us up public servants sometimes make the issue'",
        "'speaker_5': 'we make is that we are so afraid of making mistakes that it takes us forever to get to a place because we know that everybody's going to be mad at us. And so I want to say to our staff who I know is working very, very hard on this, that it's okay to make mistakes and I'll have'",
        "'speaker_5': 'your back if we're pushing this forward and we're trying to do we're trying to help people. You know, I and I'm confident my other colleagues will also have your back when we make those additional those mistakes. And we have to rip something out after we put it in because it didn't work quite the well.'",
        "'speaker_5': 'But we need to start moving faster. We need to start seeing changes. You know, I.'",
        "'speaker_0': 'Okay? Yeah.'",
        "'speaker_5': 'Oh, hang on. You know, to the two kids, I was hit by by a car when I was 13 on a bike. It it's not fun. It's going to get better. But as a community, I think we really, really owe it to you to build a place fast, build a place soon, so that before you're out of'",
        "'speaker_5': 'high school, you can feel safe and your parents can feel safe letting you go to your to go to school. You know, again, I feel like this is the start of a movement in Alameda. This is I really appreciate, you know, one of the I'm not going to name you, but one of the meetings I had yesterday'",
        "'speaker_5': 'said, you know, said, you know, I feel like encouraging kids to walking back to school and walking back to school days is almost criminally negligent. It is so unsafe out there. How are you telling kids to get on bikes and ride on these streets?'",
        "'speaker_5': 'We need to do better. I also you know, we had a school meeting, Tony and I, Councilmember de SAC and I met with the school district today at that. We talked about how we can start partnering with them better.'",
        "'speaker_5': 'We need the school and the school community's help as well. Visiting Love School. Last Tuesday I walked out. There was a big sign, says no double parking and there were two cars parked in front of it. Blocking traffic and now a bike lane.'",
        "'speaker_5': 'Know we need parents to also be aware that we are we are all in a hurry and whatever else but we all have a role in this. And lastly, I'm just going to say five of the four out of the five kids who were hit walking to school were hit by drivers that were found to be at'",
        "'speaker_5': 'fault. This is not a problem of kids darting into traffic. Kids on their phone, kids not paying attention. 80% of these kids were hit by adults who made bad decisions. And it is up to us as adults, especially those adults who are behind the 2,000 vehicle that does the harm to to take responsibility, whether we're parents or'",
        "'speaker_5': 'not. And we need to hold each other accountable and we need to hold each other up. And we need to encourage each other to be better. But again, mistakes are going to happen and we're going to have to change the way our streets look in order to to solve this.'",
        "'speaker_5': 'And I'm here for it. I think our whole council is for it and I'm looking forward to approving this. Thank you.'",
        "'speaker_0': 'Councilor Vella.'",
        "'speaker_8': 'I think it's a sad statement of things. You have two council members that have been hit while cycling. I was hit while I was in living in London. I used to ride from central London up to the boathouse every day because I was a poor college student and who couldn't afford travel fare on the tube.'",
        "'speaker_8': 'So I would wake up at four in the morning and ride my bike out and I had no other way to get to the boat house after my bike after my bike accident. So I literally had to get back up on the on the bike again.'",
        "'speaker_8': 'And I can relate. It's very difficult to do that and it's very triggering, having to ride past or go past places that you've been hit. I can't imagine having to do it as a younger individual. And I think that it's, you know, certainly a concern for all of us.'",
        "'speaker_8': 'I think actually the safest is to walk and bike to school. Are those days, the walk bike to school days because we have the critical mass and everybody is paying attention and looking out for that. It's sad to me that those are the exceptions and not the rule.'",
        "'speaker_8': 'Right. And I think that that's what we're all trying to get to with adopting Vision Zero. I'm looking forward to adopting it tonight. I, I also think there's a couple points. One is one of the things that we said we were going to look at was collision data.'",
        "'speaker_8': 'I think that it can't just be collision data that we're looking at. We also need to take into account the near-miss data because I actually think some of the most dangerous intersections are the ones where we have those near-misses.'",
        "'speaker_8': 'I think it's great that we want to work with the school district. I want to work with the PTA, not just the school district. I think that there's a lot that parents see in here that doesn't necessarily get translated to, say, the school board unless it's kind of the last step.'",
        "'speaker_8': 'And I think we need to engage with a lot of the parent group, parent groups. We have very active parent groups here in Alameda. And I think the types of things, the types of behavioral training changes that we need to see like around the double parking.'",
        "'speaker_8': 'And I think, John, I also sent a photograph of that to our city manager. Those are the types of things where if we engage with the parent groups, we work with our police department, we can kind of talk about the traffic calming and traffic safety things that we can do.'",
        "'speaker_8': 'I think one of the things that would be helpful is if our our traffic groups can actually look at the drop offs and do an analysis of how we can improve them and make them safer, whether that signage, whether that's enforcing the double parking and PTA.'",
        "'speaker_8': 'I would love to have your support with that because I also know that we're going to get some angry parents potentially that come out and say, hey, I got a citation. And you know what? I'll take a citation every day of the week if it means that it's safer for our kids that are going to school.'",
        "'speaker_8': 'So that's me. But I want to make sure that that we have the buy in from all of you and that that continues and we can continue to reinforce this narrative and get the behavioral changes. Another thing that I would like to see with the implementation of this is making sure that there is a place for people'",
        "'speaker_8': 'to report the near misses. I think that if that's something that we want to track, we need to have a venue for for actually tracking that. I see them all the time. And part of it is also we have these great east to west streets and that means at certain times of the year, the sun is directly'",
        "'speaker_8': 'in your eyes and it's directly in your eyes at drop off time. I have seen so many near-misses on Lincoln. In fact, I'm the one usually leaning on my horn who's stopped, and I am rolling down my window and trying to like wave cars that are driving eastbound.'",
        "'speaker_8': 'They can't see. We've we're starting to address these with their FAA cues. But I also think that we need to build in places for people to report it. And I don't think that Alameda peeps is that venue. I know that a lot of them get reported there, but that that's not really a solid way of tracking it'",
        "'speaker_8': 'because otherwise it looks like these this collision data is kind of sporadic and spread out in a number of different places. I also think that we need to be focusing around our schools because those are areas where we know we have a congregation of people at certain times of day.'",
        "'speaker_8': 'And so if we can, you know, our vice mayor talked about how we can kind of take steps to do this effectively and quickly. Those are areas where I think we should spend the time and start implementing now to have that effect that we want.'",
        "'speaker_8': 'So I'm very excited about this moving forward. And I the other thing is the 15 mile per hour I did have a question about the enforceability of that. I know that there's a bunch of different decisions that have been coming down from Sacramento on potential state preemption issues.'",
        "'speaker_8': 'I just want to make sure that whatever signage we have posted is 100% enforceable. And so if there's a reason that it can't be enforceable, I'd like to know why. I'd like to know what steps we can take to maybe either lobby for that change or something to that effect.'",
        "'speaker_8': 'But I hear what people are saying. I think obviously short of having people and the other thing is there's a lot of distracted drivers. Sometimes when I'm leaning on the horn, the person's literally looking at their cell phone, which is just completely unacceptable.'",
        "'speaker_8': 'And I do hope that we can start enforcing that a little more as well.'",
        "'speaker_0': 'Thank you. That's Councilmember Desai.'",
        "'speaker_2': 'Well, thank you very much. Thank you, everyone, for coming out this evening during the meeting as well as prior to the meeting, I think one telling statistic. That staff had given was that when someone is struck by a moving vehicle at 25 miles per hour, the likelihood of survival is, I think the number was 90% or so'",
        "'speaker_2': '. And so what that means is that in a city where practically all the roads, perhaps except for five, in a city where perhaps all the roads are 25 miles per hour, they really should be no fatalities when it comes to unfortunate collisions where individuals are hit by a moving vehicle.'",
        "'speaker_2': 'So as a council member, where I want to focus my attention on is certainly an enforcement. There are that typically we talk about the three E's engineering, which is road configuration and a variety of other physical road diets, engineering, education.'",
        "'speaker_2': 'But I believe where we really need to step up is, is enforcement. And this is no knock on police chief where, Larry, I know he and his staff are doing a yeoman's job, but I certainly appreciate the fact that he is putting together an elevated or an enhanced enforcement package.'",
        "'speaker_2': 'So I look I certainly look forward to that. If we can get perhaps an off agenda report on the status of that, as well as the current status of our enforcement when it comes to dealing with traffic issues, the current status, you know, where we're low or not with regard to staffing and how the in Hance enforcement'",
        "'speaker_2': 'will will help and towards dealing with traffic issues particularly at the areas where they are most pronounced and clearly around eight school around out of school traffic fatal accidents are definitely pronounced. I actually on Friday morning I bumped into a friend Bob Poulos and he indicated that the week prior or maybe sometimes as soon on Lincoln and'",
        "'speaker_2': 'Walnut, a car had went into someone's front house. So clearly there's something about that area. I think what it has to do is with a narrowing of those streets, those cross streets and people driving too fast. And the reality is people should, should and must drive 25 miles per hour, because that's that's a great way of enjoying'",
        "'speaker_2': 'our built environment. Is that 25 miles per hour? There's no reason for us to rush through our city, and we should do that for the sake of the kids. And, you know, as as the lawn sign says, we should drive as if we're driving in our own neighborhoods.'",
        "'speaker_2': 'So when it comes to Vision Zero, certainly I support that. But most important, the area where I want to focus my attention on is working with city staff when it comes to elevating our enforcement. You know, it used to be back in the days in the seventies and the sixties, you know, Alameda was renowned.'",
        "'speaker_2': 'Certain parts of Alameda streets were renowned for cops. And we knew who the cops were who were just hiding out there on Otis Drive west of Grand Street or Otis Drive near near, near Know Park. And, you know, back in the day, as a as a kid or as a teen, you knew that.'",
        "'speaker_2': 'I don't think that that same culture is there anymore. And, you know, I get, you know, the engineering type of changes that we want to want to look at. But, you know, sometimes one of the answers is the thing that's the lowest hanging fruit.'",
        "'speaker_2': 'And I think that has to do with with enforcement. So that's where I'll focus my efforts.'",
        "'speaker_0': 'Thank you, Councilman Brody.'",
        "'speaker_4': 'Thank you, Madam Mayor. Thank you for everyone who came out and who rallied. I wish she didn't have to do that. So I guess. Well, answer the question first. I mean, I, I appreciate all the work you've done.'",
        "'speaker_4': 'And, you know, Vision Zero is critical, I think. Before the vice mayor was on the council, we had a chat about this. And the transportation plan is will make sure you get Vision Zero in the transportation plan. So we got that in there.'",
        "'speaker_4': 'But I mean, this. No offense to all of you. This is like completely unacceptable to me. So I would like to know what we're doing now. I mean, a post I mean, post collision, you know, review is great, but we shouldn't have post collisions.'",
        "'speaker_4': 'You know, what are we going to do? What are we doing now as a city to fix this problem? So I'd like at least if we give if we approve this to give some direction, to have some, you know, report back quickly, you know, I can be a little passionate up here.'",
        "'speaker_4': 'I know. And I'm glad this meeting was not Friday morning when I woke up to the text that a three year old was hit trick or treating, because my first reaction was stop all truck cars in Alameda and give everyone training to recognize kids like WTF people seriously.'",
        "'speaker_4': 'And I've calmed down a little bit now, but I mean, I might. It was said in the slide and it was said in the speakers, this is our only job as a city is to take care of people and keep them safe.'",
        "'speaker_4': 'You know, depending on what number you look at, 70 to 80% of our budget goes to public safety, safety, safety. If we're not doing that, we're failing. And for these six kids, we're failing. There should not be any more.'",
        "'speaker_4': 'So I really want to know what we're going to do about it, because I am not the idea person. I'm the priority setting person to me. I'm telling you, we need to make this priority number one, stop kids from getting hit.'",
        "'speaker_4': 'So. Just be glad it's not Friday morning because it would have been a lot worse. So. There is no price tag either. You know, we cannot put a price tag on the life of one kid or one adult or one senior or one person of color or one disabled person or one anybody.'",
        "'speaker_4': 'And John, the vice mayor hit on it. You know, we're telling people, get out of your cars, walk to school, drive to school, reduce greenhouse gas. But then we're not creating an environment where it's safe for them to do so.'",
        "'speaker_4': 'It almost is like negligence. So we need to do better. And I want to I want to know what we're going to do now to do better, because six if that average stays up six and two months, you know, we're going to have another one in two weeks.'",
        "'speaker_4': 'Vision Zero is not going to solve that problem. I'm going to vote for this. I'm glad we're doing it. But it's not going to solve that problem. We're not going to stop a kid from getting hit two weeks by passing this today.'",
        "'speaker_4': 'So, I mean, whether it's the 15 mile an hour or any of these other things, you know, you drive down the street in this day lighting and you see a ten foot high truck parked. Nobody can see next to that.'",
        "'speaker_4': 'I mean, we need to start implementing these things today. Now, granted, we can't, but what can we do tomorrow? What can we do next week? What can we do? I want to know what we can do to fix this problem.'",
        "'speaker_4': 'And if it's a resource problem, I expect to have to come back to us and ask us to give them the resources, because I will do that. This is our number one job and to me this is our only job.'",
        "'speaker_4': 'But I know I realize we have other priorities, but to me this is our number one priority. The community has spoken and you know, to me and Nicholas out there, you know, you will recover from your physical injuries, but you are always going to be afraid.'",
        "'speaker_4': 'We can't have that. We can't have a generation growing up where they're afraid to cross the street or they get traumatized every time they walk past the intersection, especially if it's a young kid that's going to have to do that for five or six years.'",
        "'speaker_4': 'This just has to stop. So I expect our staff, they're really good at what they do. They're really talented. I expect them to come back and give us things that we can do now to fix this problem. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Brody. And so first, I want to thank staff for putting this report together and all the work that went into it and this presentation. I also want to thank our city manager, Eric Levitt. And I think you might not all be aware, but he called his staff together and he oversees almost every department head'",
        "'speaker_0': 'in the city and and wanted to know what can we do immediately to start addressing this? And here and some of those points were brought out by Mr. Foster in the presentation. But but I would say as a city, I am sure that we are taking this very seriously.'",
        "'speaker_0': 'So I guess we have a council majority of council members who were hit by a car because when I was a senior in high school, I was crossing a street on a green light and a driver ran the red light.'",
        "'speaker_0': 'A driver ran a red light and hit me in the crosswalk. It happened in Oakland, but nonetheless I was thrown through the air and landed on my face and broke my nose and went off to college at UC Davis with my nose bandaged because they have to wait till all the swelling goes down before they can do'",
        "'speaker_0': 'the surgery. And I had a bandage and black eyes. It was a great conversation starter. But aside from that, I would say that to this day when I cross the street, my heart just kind of clutches for a minute.'",
        "'speaker_0': 'I'm amazed that my children have grown up to be independent young people because I held their hands crossing the street much longer than they needed me to hold their hand because I needed someone to hold my hand. So it's a terrible experience and I wouldn't want anyone, especially a smaller child.'",
        "'speaker_0': 'I was even a little aside. I was walking with a good friend of mine and she was of a more frail build and she had some health issues. And I told her to this day I was always so glad that I was the one closest to the car because she might not have survived.'",
        "'speaker_0': 'But anyway, so and I told Ms. played her when we were emailing about this that I, I am one you've heard me many times up here urging people to choose to walk or take your bike rather than to get in a car, because we need to do that for congestion, for our air quality, for in greenhouse gas'",
        "'speaker_0': 'emissions and all those things. But we have to provide safe opportunities for pedestrians and bicyclists and we are moving in that direction. Not fast enough, I will grant you that. But I'm really excited about the improvements we're going to see on Clement Avenue and eventually on Central Avenue and some things that we've done already.'",
        "'speaker_0': 'I want to say that I think there are things that we can all do when we're out and about, because sometimes even if we walk and bike, we're we're also drivers. I call it mindfulness. It is so easy in our fast paced, busy world to just your mind slips and you're somewhere else besides just doing that one'",
        "'speaker_0': 'thing, being behind the wheel and someone I think it was Councilmember Vella mentioned that as the time changes now there are times in the morning when you're driving straight into the sun, you have to compensate for that and just slow down and be extra careful and education programs are always so helpful.'",
        "'speaker_0': 'Bonnie Wayman I'm not trying to do product placement anything, but Bonnie Wayman does a program for school children and adults actually of all ages on how to be a safe bicyclist, because you just you have to be a very defensive driver.'",
        "'speaker_0': 'So I would love to see those programs incorporated in the schools. But we're the city council, not the school board. When I'm out as a bicyclist, I try to reinforce the positive behavior of other drivers. So if a driver stops for me in the crosswalk, they get a wave and a smile and I ring my bell.'",
        "'speaker_0': 'And so, you know, let's do that. Let's reinforce good behavior. And and then as far as the near-misses and reporting them, I agree. Alameda peeps possibly not your best venue, but if you're out there and you happen to be taken a cell phone video, you can forward that to the army, the police department.'",
        "'speaker_0': 'And if you've got I mean, don't be don't be confront, you know, don't be confrontational. We don't want to escalate into something dangerous. But really, if you observe something dangerous and you have a cell phone at the ready and you're not driving while videoing that, that is something that the APD should know about.'",
        "'speaker_0': 'And as far as the one of the moms asked about, is it possible to do? I think it's what's called a scramble intersection where the pedestrians and all that can all cross at the same time. You see it in Oakland, Chinatown, you.'",
        "'speaker_0': 'It in some intersections in San Francisco in I think I see our our city engineer Scott with extreme is probably ducking down when I say this but I have said to him a residents have asked me could we do that on Park Street at Central and Park Street, Santa Clara on Park Street.'",
        "'speaker_0': 'Anyway, I he now has someone on his staff who has some experience in that regard. And so it's not. Nothing is ever as simple as Yeah, let's just do this here. But it's certainly something in the toolkit to be to be looked into.'",
        "'speaker_0': 'So I again, I thank everyone for coming out tonight. I also am concerned about these the collisions we've had because the pedestrian and the bicyclist is always going to get the short end of the stick. And so we we we need people to get out of their cars, but we need them to be safe when they do'",
        "'speaker_0': '. So I certainly support adoption of this resolution and all the other good input from our council. Do I have a motion to adopt this resolution?'",
        "'speaker_3': 'So moved.'",
        "'speaker_0': 'I have a motion. Is there a second? Second I've got a motion from Councilmember Vela, second from Councilmember Odie. All in favor I and he opposed your abstained hearing. Then that motion passes unanimously. Thanks, everybody. Okay, now we're going to move on.'",
        "'speaker_0': 'We are still on the consent calendar. We are going back to is it five C?'",
        "'speaker_1': 'Yes, because.'",
        "'speaker_0': 'Again, we have a speaker and five secre. Do you want to announce.'"
    ],
    "Recommendation to Authorize the Purchase of 35 Vehicles, Consistent with the Revised Vehicle Replacement Policy, in an Amount Not to Exceed $1,311,421 from Folsom Lake Ford, $281,666 from Winner Chevrolet, and $126,645 from Freeway Toyota, Including Contingency. (Public Works 703)": [
        "'speaker_1': 'Our recommendation to authorize the purchase of 35 vehicles consistent with the revised vehicle replacement policy in an amount not to exceed 1.311421 billion from Ford. Folsom. Ford Lake Ford 281,606 from Winter Chevrolet and 160 645 from Rebate Chairman.'",
        "'speaker_1': 'And our speaker is Pat Potter.'",
        "'speaker_0': 'This part of the year.'",
        "'speaker_3': 'I'm speaking on behalf of CASA and the Climate Action Plan, and I just really wanted to understand why public works is buying hybrid cars instead of electric and also what kind of engine is going into the Colorado pick trucks?'",
        "'speaker_3': 'Because I guess there's three choices, one of which is a diesel. And I don't know. But anyway, the big question, I mean, there's so many of these cars that you're buying. Why aren't they electric? Thank you.'",
        "'speaker_0': 'Thank you. Okay. I was our only speaker. Okay. So can we have a brief staff report on this item? Hello. Hello.'",
        "'speaker_5': 'Good morning, Madam Mayor. City Council. My name is Forest Heidrich.'",
        "'speaker_0': 'Publicly opposed to the microphone, if you would.'",
        "'speaker_5': 'A little better there. A little better. Wonderful. I'm happy to answer any questions you may have on the staff report.'",
        "'speaker_0': 'So I was ready to pull this staff report just because I was really excited that we are buying hybrid vehicles for police and public works. And I understand the question we just had of why aren't they just straight EVs?'",
        "'speaker_0': 'Do you want to you want to address that?'",
        "'speaker_5': 'Yes, absolutely. So, yes, we are very excited as well to provide hybrid vehicles to our PD, to our fire staff. And the reason why we are not purchasing all EVs comes back to the question of the infrastructure that's needed to charge said vehicles, to charge said vehicles.'",
        "'speaker_5': 'We have implemented EV charging out at City Hall West. We do have EVs planned for replacement where those hubs are located. And obviously our concern is for the success of those vehicles. So we want to go to the next best option, which is the hybrid platform.'",
        "'speaker_0': 'But then does that imply that as we move toward adding even more EV charging infrastructure, we will be looking to make more of the fleet all electric?'",
        "'speaker_5': 'Yes, absolutely.'",
        "'speaker_0': 'Thank you. Thank you. Any other questions? Comments? Vice Mayor.'",
        "'speaker_5': 'Can I I'm just curious, when during the budget, when we talked about vehicles, etc., we talked about not just replacing 1 to 1. And it wasn't clear to me in the staff report if this is just a, hey, we've got a car that meets replacement, therefore let's just replace it.'",
        "'speaker_5': 'How, how did how did that part of the discussion about reducing the size of our fleet play into that General? That's a great question. So one of the takeaways from the budgetary meeting was for staff to review the current replacement step, not staff report administration bulletin.'",
        "'speaker_5': 'And so we did call out some of those minimum requirements for vehicles to be replaced. All of the vehicles that we have cited on this list meet those replacement requirements and are in what we would consider to be maximum use or critical job tasks throughout the city.'",
        "'speaker_5': 'Okay. Thank you. And then I guess the other question I have. I did notice that the the Chevy Colorados and the Toyota RAV4 are about the same cost. Given that Toyota is involved in fighting the car at the state of California's emission standards, have we considered whether or not we might want to go with somebody who is'",
        "'speaker_5': 'committed to our climate goals as opposed to was supporting multinationals who are pushing against it? Another great question. We selected that vehicle based on feedback from staff that day that the pickup truck in some cases was not working for them.'",
        "'speaker_5': 'We wanted to go to a small SUV that still offered them some cargo space and also had ground clearance in the event that they're used in disaster relief. But yeah, there are options out there. What if we were to ask to have that looked at, if there was a way to get something for the same cost that'",
        "'speaker_5': 'met the need but was with a more committed company, would that be problematic? Look at this. You have the option that you could approve this item with holding back on approval of certain vehicles. Okay. But you would need to just state what those vehicles were.'",
        "'speaker_5': 'Understood. Thank you. Okay. Thank you. Those are my questions for now.'",
        "'speaker_0': 'Okay. Any other Ken Brody?'",
        "'speaker_4': 'Just a quick question. So if we do have a long term plan to move to, say, an all electronic fleet, I mean, do we have or will that include some type of backup, like some cities lost power for two or three days.'",
        "'speaker_4': 'So I can't imagine that you don't want your police force dying in day one vehicle wise. Right. So, I don't know. We have set up a plan to do that. Or is that will that be taken care of or.'",
        "'speaker_5': 'Another great question. So looking at our fleet, as always, has a mixed fleet and not 100% EV, but always looking at how we can reduce greenhouse gases, whether that being from implementation of hybrids, driver monitoring, meaning we're not going to have these vehicles idling, shutting down when possible, but also looking at where we're implementing these EV charging'",
        "'speaker_5': 'hubs. Case in point, back to City Hall West, we have emergency generators at that location. So therefore, those chargers would still be online and we would be able to charge the fleet. And that's why that infrastructure part of that question is so important.'",
        "'speaker_4': 'I'm just more worried about, you know, a long term power shutdown because we were spared this time. But, you know, who knows what will happen next time? Absolutely.'",
        "'speaker_5': 'And the quick answer is that that's why you always want to have a mixed fleet available. You definitely want to have the EVs there. You definitely want to implement those wherever possible that you never want to be solely reliant on electric vehicles.'",
        "'speaker_4': 'Okay. So hopefully building that infrastructure and some redundancy would be something that's brought back and feature, you know, capital budgets that we can make.'",
        "'speaker_5': 'Definitely particularly.'",
        "'speaker_0': 'In. Thank you. And I would just comment along those lines that even people who are driving gasoline powered vehicles found that the gas pumps didn't work because they relied on electricity for the pumps. But if the city were to say to go toward solar power on all of its buildings and then storing that electricity, that's that's certainly'",
        "'speaker_0': 'a backup for power. And there's other I do drive an TV. And during all the days when PGE was doing Power Shutoffs, a message would come up on the the screen reminding us to fold to your to recharge to your full capacity every night.'",
        "'speaker_0': 'So, I mean, who knows what the future holds? But I think, you know, part of the policy of getting away from fuel fossil fuel vehicles is trying to help reduce some of the complications that we've seen are causing these fires, the new normal.'",
        "'speaker_0': 'Okay, good points, everyone. Are we ready for a motion? Um, to approve this. So what we're looking at is this is a recommendation to do you know what it is, you read it. But anyway, the, the recommendation is that we authorize the purchase of 35 vehicles consistent with the revised vehicle replacement policy in the specified amount.'",
        "'speaker_0': 'The move. And Vice Mayor, did you want to add.'",
        "'speaker_5': 'Me after Tony has moved? I'll second the motion.'",
        "'speaker_0': 'We had a motion. A second. Okay. All in favor? Oh, yes.'",
        "'speaker_5': 'I just wanted a comment for comments related to Miss Potter's comments. I did want to thank staff. The climate section of this staff report was very explicit about the fact that these vehicles will cut in half the the emissions that will be brought by these vehicles.'",
        "'speaker_5': 'It's not 100%, but I actually just want to thank staff for that. That was a very good use of that section and helpful. So thank you very much.'"
    ],
    "Recommendation to Authorize the City Manager to Execute a Second Amendment to the Service Provider Agreement with CDM Smith to Extend the Term by Three Years and Increase Compensation by $2,200,000, Including Contingencies, for a Total Aggregate Compensation Not to Exceed $2,572,928, to Complete the Project Approval and Environmental Document (PA&ED) and the Plans, Specifications and Estimate (PS&E) for the Central Avenue Safety Improvement Project; and \n\nAdoption of Resolution Adopting Caltrans Local Assistance Procedures Manual Chapter 10 for Consultant Selection. (Transportation 4227287)": [
        "'speaker_0': 'Thank you. It's a good point. It was a it was a very informative report. Thank you. All the comments. Okay. We've got a motion. We've got a second. All in favor. Hi. That was Five Eyes. Right. Okay. That motion passes unanimously.'",
        "'speaker_0': 'So then we go on to vote for a.'",
        "'speaker_1': 'Recommendation to authorize the city manager to execute a Second Amendment to the service provider agreement with CDM Smith to extend the term by three years and increase the compensation by 2.2 million for total aggregate compensation not to exceed 2.57 to 9 to eight to complete the project approval environmental document and the Plans and Specifications and estimates for'",
        "'speaker_1': 'the Central Avenue Safety Improvement Project and Adoption Related Resolution.'",
        "'speaker_0': 'So then do we have a speaker on this or did one of the council. Okay, so councilmember out Councilmember Vice Mayor Knox was also a councilmember. Yeah. Do you want to lead off since you pull this?'",
        "'speaker_5': 'Yeah, I'll just ask a question and I want to be clear. I'm didn't pull this because I have a concern about the actual item itself, but we just had an entire vision zero policy discussion with the school community here, talking about complaint concerns about traffic safety.'",
        "'speaker_5': 'And here we have one of the biggest, most transformative projects that this city has approved to move forward three years ago. And it's 3 to 4 years off from actually existing. And while it's in it's a leading question because I know that it is not city staff who is causing this problem.'",
        "'speaker_5': 'But I wonder if we can talk a little bit about what this city can do and what the city council can do to move the needle. Because what Caltrans is doing on this right that they got the governor to veto a complete streets via bill SB one 127.'",
        "'speaker_5': 'And but yet the governor promised that they were going to fix the issues they have in this case. We have two projects on ants and we have the central project that is a state route. But we also have a flashing a rapid flashing beacon that is on a four year implementation plan to put a sign with lights'",
        "'speaker_5': 'that flash and say somebody wants to cross the street because Caltrans is treating our local streets like a freeway. What can we do? I know you don't know the specific answer. I know that the big cities, L.A. and SF have been working on this for a couple of years.'",
        "'speaker_5': 'But but we need to do something and we need to raise our voice and we need to call this out because, you know, this can't this can't be they can't hold up our residential streets safety projects because they want to overbuild them for four large trucks driving at 65 miles an hour.'",
        "'speaker_0': 'So just for Mr. Thomas's edification, the vice mayor and I did not talk before he got an email from me. There is no.'",
        "'speaker_6': 'Problem. There's your your frustrations are not yours alone. This is other council members have asked similar types of questions. The mayor yesterday a staff has been frustrated by this process. Just how long this has taken. We're using federal money.'",
        "'speaker_6': 'So there are certain hoops that we need to jump through that are established by the federal government. This money passes from federal government through Caltrans to us.'",
        "'speaker_0': 'You know what? I'm sorry to interrupt you just briefly for the public who's following, who might not know, just just just give a bullet point. One points is about real quick.'",
        "'speaker_6': 'This is about transforming the and improving the safety of Central Avenue from Alameda Point Pacific. You can sort of see it on the red line up on the map of anybody behind me is looking so improving central as it moves from Alameda point at Pacific past and central high school past the Hayden school past the intersection of'",
        "'speaker_6': 'Webster Street along central all the way to Sherman. The idea here it's one of the most unsafe streets we have in Alameda. This has been known for years. And there's Gail Payne who is the point person on this, knows all the statistics and but a number of schools in this area, lots of kids, lots of accidents.'",
        "'speaker_6': 'So the city council 2016, you approved this project. You said, let's get this going. There were still some design issues around the Web Street intersection that we still need to work through with Webster Street Business Association. And then the good news is we got a big federal grant to help the construction.'",
        "'speaker_6': 'The bad news is a third of over half of this segment is a designated a state highway. So and I think. The vice mayor sort of described the frustration, at least on staff's part, is we really feel like the way Caltrans is approaching us and Caltrans staff has sometimes described themselves this way as a big, slow bureaucracy'",
        "'speaker_6': 'that is hard for them to think outside of the box. Our basic frustration is this is not a freeway that we are redesigning this. We're not trying to build new freeway on ramps. We're trying to put bike lanes on a city street.'",
        "'speaker_6': 'You would think we were asking to put bike lanes on I-80. I mean, it's we need to have a different process. We are concerned. And I think that to answer the question more specifically, yes, we have been lobbying and pushing on Caltrans staff at our levels for the last couple of years.'",
        "'speaker_6': 'Like how can we move this process faster? How how can you be thinking, can you please think about this project differently? It's a city street. This is about safety. Bike lanes are specifically exempt from further environment review under California state law and under the National Environmental Protection Act.'",
        "'speaker_6': 'So why are we spending almost half a million dollars on environmental review? Why are we struggling to move this project faster? I think help from the council at a more of a higher level to just sort of bring this project to the attention of the folks at Caltrans and your other representatives at the state level.'",
        "'speaker_6': 'This is so solvable. This is so easy. It's not that hard. We're building bike lanes and and protected bicycle ways on an existing street. We're not changing the width of the street. We're not tearing out sidewalks. We're just trying to make it safer for kids to cross the street and all of us to cross streets and to'",
        "'speaker_6': 'drive and to ride our bikes on these streets. So, you know, we'll keep slogging away. We have another meeting with Caltrans next week at the staff level to try to work through some of these issues. But obviously, any help we can get from the council and with your connections would be much appreciated.'",
        "'speaker_0': 'Thank you. Mr. CODY.'",
        "'speaker_4': 'Thank you. MODERATOR Thank you, Andrew. Yeah, Caltrans is that I used to work for the state, as you probably remember, and they're not the worst. The DUI is probably the worst part of education, but they're up there and we had more interactions with them.'",
        "'speaker_4': 'And, you know, if my other colleague who worked for the state can chime in also if she wants, but, you know, we should reach out to our local representatives. I mean, I'm happy to do that. I mean, our our leadership teams to do that.'",
        "'speaker_4': 'That was one of the things we used to do was unclog the bureaucracy. We were able to, I think, to get the crosswalk at in and out. We were able to get the the flashing light on Otis after the the gentleman got run over there.'",
        "'speaker_4': 'You know, we I think before I left that they're actually going to people don't know this but on Doolittle where we had a couple Alameda residents go into the into the estuary and die, they are putting a guardrail all the way, you know, but those things take a while.'",
        "'speaker_4': 'So, I mean, I'll volunteer to do whatever I'm legally allowed to do. So just let me know what that is and I'll do it. You know, I think we might want to think about and you know, San Leandro did this or wants to do this with East 14th and I think Hayward did it with part of one'",
        "'speaker_4': 'of their streets is, you know, see if we want to take it back and we want to be responsible for portions of it. So, I mean, that's not a discussion for today. But, you know, might be something you guys think about and bring back to us.'",
        "'speaker_0': 'Thank you, Councilmember De Soto.'",
        "'speaker_2': 'Yes, thank you. Just a quick reminder. So it was back in 2016 and I think I was on council back then. So is is this the part from Central Avenue, from Sherman, in the direction of Eighth Street? Is this still going to be like a one way, one lane, one lane and then an enhanced bike lanes that'",
        "'speaker_2': 'are protected?'",
        "'speaker_6': 'Yeah. In what? Essentially in 2016, the council. You can think of this segment in three sort of subsegments from Alameda point through to Mackay the sort of the western segment protected to a cycle track along the school side of the road.'",
        "'speaker_6': 'The next segment from Mackay to just passed Webster Street. Mm hmm. Not yet. Completely figured out. Council said go work with Webster Street Business Association and get that sorted out. And then the council approved the third segment, which is just past Webster Street, all the way to Sherman.'",
        "'speaker_6': 'Eighth to Sherman is bike lanes straight three lanes, one in each direction on either side. Yeah.'",
        "'speaker_2': 'And one lane. One direction. One lane. The other direction.'",
        "'speaker_6': 'Right. Right. And the reason for that on that portion is because of all you know, that's the where the the residential curb cuts are literally every house. Right. So. That's right. That's why the lanes made more sense there.'",
        "'speaker_2': 'Currently, the general plan designation, that's still a truck route, right? In our general plan.'",
        "'speaker_6': 'No, I don't. Not. Not. It is. Am I right? Yes. So I'm sorry. Yes, you're correct.'",
        "'speaker_2': 'And the general plan designation also gives it a certain street. Status. I don't know what that has to do.'",
        "'speaker_6': 'Yeah. Designation material. That's a major street traffic.'",
        "'speaker_2': 'Okay. Okay. Well, thank you.'",
        "'speaker_6': 'Yeah. And you know, the other for us, of course, is it's the other piece of this is the conversion from four lanes to three lanes, which has shown and lots of studies to show that that will reduce speeds, increase safety.'",
        "'speaker_2': 'Is it three lanes or are we still going to have two lanes going in one direction?'",
        "'speaker_6': 'No, it would be one in each direction in a center turn lane.'",
        "'speaker_0': 'Okay. Any other questions or do we have a motion?'",
        "'speaker_5': 'I move approval of the staff recommendation with a recommendation that staff engage the Council at their discretion to engage with our legislative leaders, to really break openness and see what we can do to solve it.'",
        "'speaker_0': 'Good suggestion. Okay, so that's a motion. That's a second. All in favor.'",
        "'speaker_2': 'Of.'",
        "'speaker_0': 'Comment. Councilmember Desai I'm.'",
        "'speaker_2': 'Not going to support this, even though I supported this back in February 2016. The concerns that I'm hearing is that poor people who live in the Gold Coast and Pryor and those immediately north of of Central Avenue around Taylor, you know.'",
        "'speaker_2': 'Central Avenue is a major feeder street. If there are safety issues there, as there are, then I think certainly that's where enforcement ought to be enhanced if if anywhere. But I recognize that this is a policy decision that was made back in 2016, and I even supported it in 2016.'",
        "'speaker_2': 'But because this is a major arterial that handles traffic, I think that the approach that we're employing from Sherman to Eighth Street or Sherman to Page Street, I don't think that really is the right solution much in the same way that I didn't support the same reconfiguration of Otis Drive.'",
        "'speaker_2': 'And I do, like I said from the outset, I do think enforcement really is is the key here. Thank you.'",
        "'speaker_0': 'Thank you. Okay. We have a motion in the second. All in favor. I abstain. And oppose the case. So the motion passes with four support and one oppose. And so the motion carries. Thank you. Okay. We are still on the consent calendar, but I think was our last item.'",
        "'speaker_0': 'This is five.'"
    ],
    "Adoption of Resolution Limiting Natural Gas Infrastructure for New Residential Construction on City Owned Property.  (Planning, Building and Transportation 481005)": [
        "'speaker_1': 'H adoption of resolution limiting natural gas infrastructure for new residential construction on city owned property. And we do have one speaker on this.'",
        "'speaker_0': 'Okay. Oh, well, we take our public speaker first. Public speaker. Come on it.'",
        "'speaker_1': 'Melissa, you.'",
        "'speaker_3': 'Hi councilmembers. My name is Melissa. You and I am with the Sierra Club. I'm here today to support this resolution, and I'm going to keep my comments short because hopefully you all have read our long support letter highlighting all the reasons why you all should support this.'",
        "'speaker_3': 'And so I'm excited to be here and I hope that this resolution passes unanimously, because if this passes, Alameda would actually be the 15th city in California to move forward towards being gas free and buildings. And I am also looking forward to seeing how the city continues to find ways to broaden the ordinance to consider not only'",
        "'speaker_3': 'city properties, but also properties not owned by the city. So thank you.'",
        "'speaker_0': 'Thank you. And that was the only public speaker. Okay, discussion or motion.'",
        "'speaker_5': 'I'll make a motion. I just want to. But I want to thank Assistant City Manager.'",
        "'speaker_0': 'Oh, you know what? Actually, this is one. I'm sorry to interrupt you, Vice Mayor, but this is one where. Go ahead. Yeah, well, no, because you remember that little city manager mentioned this at the beginning. There was a change.'",
        "'speaker_0': 'I think we even got an email there.'",
        "'speaker_6': 'Just for public. So they know exactly what you're making a motion on. We circulated. We want to just make a few small changes. So I don't want to talk about right now. Just quickly point out for you and the public the changes from what's before you then from what went out ten days ago and I'm sorry the'",
        "'speaker_6': 'one we just we we I met to get you the strike out version but the basic changes where we left we deleted a reference to San Bruno in the paragraph about gas infrastructure and earthquakes. That was not an earthquake issue.'",
        "'speaker_6': 'That was a construction issue. We eliminated a reference to the 14,000 tons that would be saved by this. Rizzo That was a miss. That was not correct. That's if we that's that's what would be saved by a larger effort citywide.'",
        "'speaker_6': 'And then we added, probably most importantly, an additional finding, which really deals with the fact that we are going to have a natural gas infrastructure with us for quite a while still. And we need to be thinking about the jobs and the people who work on that, that they we will still need them.'",
        "'speaker_6': 'And we need to think about how we convert those jobs over time to we will always need utility jobs. They may not be natural gas, it may be non-fossil fuel utilities. So I just wanted everybody to know what we changed since it went out in the packet.'",
        "'speaker_0': 'Thank you. Okay. Vaisman.'",
        "'speaker_5': 'I was just going to give my thanks to Assistant City Manager Bowden for his work on this and Andrew and his team. I know you guys move very fast in this and it was great to see it happen.'",
        "'speaker_5': 'So thank you very much. And with that, I'd like to move approval.'",
        "'speaker_0': 'Okay, we have a motion and then we have discussion.'",
        "'speaker_4': 'I just also want to say thank you. I mean, it's good to see that something in our climate action plan is is actually getting done. So I appreciate that a lot.'",
        "'speaker_0': 'Yeah. And and I hope some of you at least cut the the op ed that the mayor of Berkeley and I did about building electrification. That was in the Chronicle a couple of weeks ago. Okay. We have a motion.'",
        "'speaker_0': 'We have a second on favor. I opposed any abstain hearing and that motion passes unanimously. Thank you. All right. It's 833 and we finished the consent calendar. So moving right along.'"
    ],
    "Public Hearing to Consider Adoption of Resolution Amending the General Plan Business Park Classification to Clarify the Allowable Floor Area Ratio (FAR) at Harbor Bay Business Park, as Recommended by the City Planning Board. (Planning and Building 481005)": [
        "'speaker_1': 'Item six A public hearing to consider adoption of resolution amending the general plan business park classification to clarify the allowable floor area ratio at Harvard Bay Business Park as recommended by the City Planning Board.'",
        "'speaker_0': 'Hello.'",
        "'speaker_5': 'Hello.'",
        "'speaker_6': 'Good evening, Madam Mayor, Vice Mayor and members of the City Council. I am Alan Tigh, Planning Services Manager. So what's before you tonight is a minor amendment to the general plan text in the land use element. What it does is it's designed to eliminate an inconsistency in which the general plan describes the floor area ratios that are'",
        "'speaker_6': 'embedded in the zoning regulations at the Harbor Bay Business Park. So in 1991, when the City Council approved the zoning for the Harbor Bay Business Park, it allowed properties to be developed up to a factor of 2.0. The vision there was you we would get, you know, mid-rise office buildings.'",
        "'speaker_6': 'In 1991, we adopted a general plan that I would argue mischaracterizes at FSR as, uh, limited to point five when in the zoning that point five is that there's really a special provision that applied to the waterfront. So again, the zoning allowed properties to be developed there to porno for air, except an area that is along the'",
        "'speaker_6': 'water where they would be point five. The general plan characterized that as covering the entire business park.'",
        "'speaker_0': 'So, Mr. Tai, if I could just ask you in layperson's language, could you just explain to the audience just how how would that work? And if they are and if they are, did you already tell us about that?'",
        "'speaker_0': 'Yes.'",
        "'speaker_6': 'The floor ratio basically is the ratio between how much land you have and the amount of area that you have in the building. So, for example, in favor of two on a 5000 square foot lot means you can build a 10,000 square foot building.'",
        "'speaker_6': 'So that's really what it is. So over the last 20 years, there's been a lot of low density development at the business park. This really hasn't been brought to light, but in recent years we're seeing a lot more development in our business park.'",
        "'speaker_6': 'There's currently two projects in the pipeline Exelixis that wants to build an office building with 900 new jobs. There's also a new Hilton branded hotel that's proposed at the entrance to the Harbor Business Park that would be affected by this issue.'",
        "'speaker_6': 'So what the planning board and staff are recommending today is that you amend the text to just ensure that the description of their fair issue is consistent with what's already in the established zoning.'",
        "'speaker_0': 'And this was a unanimous recommendation of the planning board.'",
        "'speaker_6': 'That is correct.'",
        "'speaker_0': 'All right. Do any speakers.'",
        "'speaker_1': 'Specifically.'",
        "'speaker_0': 'Ask any questions about the staff report? Do you have a motion item of approval? I have a motion to move. Approval to have a second.'",
        "'speaker_5': 'A second with my thanks to the planning board that did a great job vetting this and getting to work.'",
        "'speaker_0': 'I will echo your thanks to the the planning board. They they are one of our hardworking, heavy lifting boards and I appreciate that. Okay. Any discussion before we vote? Councilmember Desai.'",
        "'speaker_2': 'I'm going to remain with the status quo. I think the point five is satisfactory. And if someone wants to come in with a higher floor ratio, especially over point eight, you know, they can do it. They can do that through a variance or special special permit use permit process they don't need.'",
        "'speaker_2': 'I don't think it ought to be by right. Because what you're saying is conceivably you can have a parcel like this. Point eight means that the building, if it's going to be a one story building, is going to be is going to take up basically 80% of that parcel like this.'",
        "'speaker_2': 'Or you could have a parcel like this. But instead of being a flat building, flat and squat building, you can have a stacked building. And so I think we really need to be wary of of what we're doing.'",
        "'speaker_2': 'I think the typical floor area ratio for light industrial is maybe around point three. Typical ratio for office in retail is .25, maybe point five. I think point five is pushing it as it is. And I think to give by right point eight, I think you're going to have.'",
        "'speaker_2': 'A lot of buildings that are, quite frankly, inelegant. One of the points of having a floor error ratio is to have a design that is elegant in terms of a design of a building, in terms of its massing and its height, that that is somewhat related to the area in which it is being built.'",
        "'speaker_2': 'Instead, I think you run the risk of having either these really, really short and squat buildings that are taking up a lot of parcel, or you end up having a lot of taller buildings that just seem out of out of whack.'",
        "'speaker_2': 'And so so I think it's wrong to to to go to point A and I would rather remain at point five.'",
        "'speaker_0': 'Thank you. Councilmember de SAG. So we've had a motion we've had a second all in favor. I and I'm going to pose I take it. Okay, that motion passes 4 to 1. Thank you.'",
        "'speaker_5': 'For clarifying.'",
        "'speaker_0': 'That.'",
        "'speaker_5': 'Comment. Wasn't that. That wasn't that was I don't think that was an accurate explanation of exactly what we just did. I just wanted to know if you want to. Yeah. So I should.'",
        "'speaker_4': 'Clarify the.'",
        "'speaker_6': 'So the current zoning allows most of the business park to develop up to 2.0 acre by right. The zoning calls out that the there is an area along the waterfront of the business park that is limited to point five.'",
        "'speaker_6': 'The general.'",
        "'speaker_0': 'Plan. Sorry, Mr. de SAC. We didn't we didn't interrupt you guys, but let's let Mr. Todd finish his comment.'",
        "'speaker_2': 'We voted. It's finished, and we'll move on. We had a chance to give it.'",
        "'speaker_0': 'Thank you for stating your opinion. We've had another request to hear, Mr. Tai. Let's hear him out.'",
        "'speaker_6': 'What we're trying to amend is the is how the general plan describes that FAA. Ah, and in 1991, what we put in the general plan, it was just probably poorly written to describe that the point five that we applied to in the entire area of the business park.'",
        "'speaker_0': 'Not just along the waterfront, and.'",
        "'speaker_6': 'That's what we're trying to correct.'",
        "'speaker_0': 'Tonight. Understood. All right. Okay, perfect. We are moving on. So then we move to item six B.'"
    ],
    "Public Hearing to Consider Introduction of Ordinance Amending Alameda Municipal Code Chapter 30 (Zoning Ordinance) to Streamline Design Review for Small Residential Additions, Window Replacements, and Green Roofs, Update Work/Live Ordinance Requirements, Update Lot Line Adjustment Procedures, and Make Other Miscellaneous Administrative, Technical, and Clarifying Amendments, as Recommended by the Planning Board.  (Planning and Building 481005)": [
        "'speaker_1': 'Public Hearing to consider rejection of ordinance amending the Alameda Principal Code Chapter three Zoning Ordinance to Streamline Design Review for small residential additions, window replacements and green roofs. Update the work live ordinance requirements. Update the lot line adjustment procedures and make other miscellaneous administrative, technical and clarifying amendments as recommended by the Planning Board.'",
        "'speaker_0': 'Hello, Mr. Tie. Yes, me again.'",
        "'speaker_6': 'Thank you, Madam May. Or members of the Council. So this package of zoning text amendments, we are amending chapter 30 of the aluminum code, which is the zoning ordinance. What it does is it would further our climate action goals and as well as some other goals and priorities in the city to reduce costs for housing maintenance in'",
        "'speaker_6': 'the city of Alameda. It would encourage job growth as well as bring our standards consistent with leaders state requirements. There are three areas that we are addressing with this package of zoning amendments. The first are design review streamlining measures.'",
        "'speaker_6': 'We are streamlining window replacements. This would include energy efficient windows. Those would be exempt from the zoning review. So no more public hearings. Public notices. Similarly, small additions. We were allowing.'",
        "'speaker_4': 'Those that review.'",
        "'speaker_6': 'Process to be streamlined as well as green or vegetated roofs.'",
        "'speaker_4': 'So those have climate benefits.'",
        "'speaker_6': 'With regard to the work live studios, we are proposing to expand to locations in the city where they are allowed currently work. Live studios are limited to areas in Alameda Point and the Northern Waterfront. We are expanding that possibility to all commercial zones.'",
        "'speaker_6': 'We are also making revisions to the size, limitations or requirements for work live studios in order to get more smaller offices. We we've done a survey that kind of tells us that this small business space is needed in the city.'",
        "'speaker_6': 'And so.'",
        "'speaker_4': 'That effort is consistent with the.'",
        "'speaker_6': 'Economic development strategy plan. Last but not least, we are proposing changes to the property lot line adjustment process. That ordinance hasn't been updated in 30 years, so we are simply making updates to reflect best practices and to comply with current state law.'",
        "'speaker_6': 'So I'm available.'",
        "'speaker_0': 'Any questions and do we have public speakers on this item? Okay. And so do we have any clarifying questions on the staff report or comment on that discussion or. Yeah. Okay. So that's the luncheon to discussion VICE. We're not quite very short.'",
        "'speaker_5': 'I wanted to appreciate all of this again by listening the planning board meeting. They did amazing work on this. I appreciated the in terms of the development standards, the switch in parking, and I just wanted to flag and actually ask my council members what they thought about can't get into it's not agenda has been in terms of'",
        "'speaker_5': 'just discreet discretion if perhaps in the same way that we're changing parking requirements here if we could ask staff to to look at the city parking requirements citywide for the same reasons so they're having a big impact on our and I think are I time it time time is now to to have this conversation so anyway with'",
        "'speaker_5': 'I checked in with the city attorney he said that giving that direction would be perfectly acceptable tonight. So I'm ready to move this forward. But I also like to move it forward with just discreet discretion for staff to look at it, look at look at how we might make similar just to.'",
        "'speaker_0': 'Bring it back to us. So. Yes, right. Okay. And you know, I realize I had a question on the staff report, Mr. Cherry. So on page three and I support this. But the the amendment would reinforce work live studios as commercial spaces and they could essentially be located in all commercial manufacturing and mixed use zoning districts.'",
        "'speaker_0': 'And the restriction on work with buildings to existing work, with studios to existing buildings will also be eliminated. My question is, and again, I think this is a good thing. We need more housing and we need more. This has been pointed out in the staff report.'",
        "'speaker_0': 'This is a way to help improve our jobs, housing balance. And and if you live and work in the same place, you don't have to commute. But how how do we take into consideration the impact on schools if work lives studios include significant numbers of families with children because I know some do already and it means how'",
        "'speaker_0': 'does that is that the school district's problem? How do we how do we approach that? Yeah.'",
        "'speaker_6': 'So kind of the broader answer would be I think there are state laws that say that if there is development in local city, uh, we, the school fees basically take addresses the demand on school so that responsibility isn't necessarily the city's burden.'",
        "'speaker_6': 'But specifically with this issue work live studios there were other cities call these live work the reason why Alameda calls and work live is the emphasis on work therefore. Strict limitations are on the living portions. And with these amendments that we're doing today, we're further reinforcing that these are work spaces.'",
        "'speaker_6': 'And as sort of, you know, for maybe one or two individuals to live comfortably in, not really intended to big families. I mean, these are really studio spaces.'",
        "'speaker_0': 'So I would just say, to be realistic, I mean, there is a move toward tiny homes, you know, housing people and a much smaller footprint. And so I don't think we can pretend that some children might be a part of these households.'",
        "'speaker_6': 'So that absolutely is true. But in that in those cases, they're the work live studio and the occupants would have to keep a valid business license. It could it could happen. But the restrictions or requirements that we have in place are really catered toward people running businesses out of these places.'",
        "'speaker_0': 'So many of you. Thank you. Councilmember Odessa, thank you.'",
        "'speaker_2': 'I don't think that's correct, actually. I think when this ordinance was created, the emphasis was on work, not live. Yes. And the way in which that emphasis was put into life was by having a standard of 101,000 square feet of work space.'",
        "'speaker_2': 'So what you're doing here is you're reducing the standard of 1000 square feet of workspace to 500 square feet of work space. And. And that was that was the key issue back in 2003 when we dealt with this issue.'",
        "'speaker_6': 'And we're also.'",
        "'speaker_2': 'Voting against this back then and.'",
        "'speaker_6': 'We're also adjusting.'",
        "'speaker_0': 'This today. So I finish his comments first.'",
        "'speaker_2': 'I think if someone wants to reduce their work area from the current 1000 square feet standard of 500, they can get a special use permit or a variance or whatever it is. Right. They don't need we don't need to change the rules.'",
        "'speaker_2': 'Right. They could conceivably. If if we didn't.'",
        "'speaker_6': 'Yes. But what we are doing in terms of adjusting the minimum work requirement, workspace requirement to 500 is we're also adjusting the proportion of the living space so that if you do propose a 500 square foot work live studio, you will have a much smaller 30% living area.'",
        "'speaker_6': 'But that would also be legal.'",
        "'speaker_2': 'It would be a nice micro area and people can, you know. So you're really turning this into from work, live to live work. So and frankly, I think this goes against measure and that was the heart of the discussion as to why I voted against it in 2003.'",
        "'speaker_2': 'Because now when you make it live work, you're basically making a multi-family residential and. That's just my opinion.'",
        "'speaker_0': 'Thank you for sharing your opinion, Councilman Brody.'",
        "'speaker_4': 'I mean, I have a different opinion. I would like it to be live work, and I don't think it goes that far enough. Instead of work live, because we had this discussion with was it building eight over at that Alameda point.'",
        "'speaker_4': 'But I appreciate all the work you guys have done to bring us to this. I wish we could have gone further. But, you know. Maybe next time.'",
        "'speaker_0': 'As you come. It's all right. And I will just say that I spent all of yesterday in Sacramento at a policy meeting on addressing our state's housing crisis, and we just can't provide more housing fast enough for our residents and their ability to create jobs.'",
        "'speaker_0': 'And and things change. Times change in the in the intervening years since this first came about and some of you may remember it was rhythmic that wanted to go into the old clamp swing building and there was such an outcry and you know what would happen and it would turn Missouri on its head.'",
        "'speaker_0': 'And and it was just, you know, the start of terrible things to come and look what an amazingly successful enterprise, rhythmic, has been and has brought so many cultural offerings to our city, to our our school children, and also to visitors from outside of Alameda.'",
        "'speaker_0': 'And yet we placed so many restrictions on them that there haven't been very many of these work live buildings or spaces developed since then. So I you know, again, I think that changing times call for fresh looks at the way we've done things.'",
        "'speaker_0': 'So I'm certainly prepared to support this. Okay. Anyone else who do we want to make a motion?'",
        "'speaker_5': 'I made a motion early.'",
        "'speaker_0': 'Oh, I'm sorry. Let's get going to make it again. Okay.'",
        "'speaker_5': 'But I'll just I'll just point out to your point, the rhythmic that somebody was sued. Rhythmic was sued using our work live via Measure A and they lost. I mean, the the measure is the measure argument lost. So the courts have already found that this is not out of compliance with measuring.'",
        "'speaker_5': 'I just.'",
        "'speaker_0': 'Yeah. No, no, no. And I was there was a lawsuit.'",
        "'speaker_2': 'They found the previous ordinance. This would change that. So this this could conceivably be.'",
        "'speaker_5': 'I would argue that and I don't mean to, but I would argue that this actually makes it much more difficult that this is going to be house the housing the housing portions in these units become significantly smaller. 150 square feet on a 500 square foot unit is not micro-housing.'",
        "'speaker_5': 'That's almost inhumane housing. So we can argue and we'll see. Maybe somebody will will sue. But I don't think I, I again, I disagree with the characterization. That's fine. When I read this, I was like, holy cow, this is going to make the housing side of this much more difficult.'",
        "'speaker_0': 'But I think we can also rest assured that the city attorney's office has had a look at this before it it came to us. Okay. We've had a motion by the vice mayor, a second by Councilmember Vella, correct?'"
    ],
    "Recommendation to Consider Approval of the Recommended Parking Enforcement Program Staffing Plan and Provide Direction to Staff on a Long-Term Parking Management Policy. (Public Works 224)": [
        "'speaker_0': 'Yes. Okay. All in favor. I oppose the motion passes 4 to 1. Thank you. All right. We move on to item six C.'",
        "'speaker_1': 'Recommendation to consider approval of the recommended parking enforcement program staffing plan and provide direction to staff on in long term parking management policy.'",
        "'speaker_6': 'Okay. I think this is the last item you're going to hear from from us on this is to hear from you. This is a return trip on parking enforcement. We were here a couple of months ago talking about parking enforcement.'",
        "'speaker_6': 'I won't repeat that presentation, but the Reader's Digest version was we came to tell you, we were very concerned about our parking enforcement program here in Alameda. It was not it's we felt I think we use the word broken and we were looking for your direction on ways.'",
        "'speaker_6': 'We presented four different ways to sort of move forward to fix it. You pointed us in the way that we felt. We got actually a very good direction from the council that night. We came back to the office the next day and thought about what you would all said, and it became very clear to us very quickly'",
        "'speaker_6': 'the way we need to go, which is in brief, a sort of the approach that our neighbors in Oakland and Berkeley have taken, which is you build a parking enforcement division through a combination of full time and part time city employees.'",
        "'speaker_6': 'What we're bringing you tonight is we're asking once again for a sort of a a vote, telling us that we're headed in the right direction. So what we're saying here tonight is we'd like to start building and improving that that that our parking enforcement staff we would like to add two full time parking enforcement officers to start'",
        "'speaker_6': '. This is, as you remember from the last report, this is not sort of like and well, let me just say what we're recommending, two full time non sworn parking enforcement officers, continuation of the existing part time positions. But we want to increase those salaries to become competitive with the part time salaries that our neighboring cities are offering'",
        "'speaker_6': '. And this is sort of the first step. What we want to do is we want to get started. We want to start building this. Program getting a little bit better. We want to start charging for parking at the ferry terminals.'",
        "'speaker_6': 'We want to start doing a better job collecting at the meters in the parking lots so that our plan is to be back in front of you on on just the enforcement thing. Probably in another year, we hope to be coming back because we are with you and saying, you know what?'",
        "'speaker_6': 'We're on the right road. This is working now. Let's keep building. You know, we think ultimately we're going to need more than this, but let's take one step at a time. So this is sort of an interim, you know, year to two year effort, but we will be most likely back in the future.'",
        "'speaker_6': 'Our goal, if we do this right as a city, we firmly believe that this can be a program that pays for itself. Hearing the Vision Zero discussion today just made me keep hearing, you know, thinking about this people double parking in their cars in front of school drop offs.'",
        "'speaker_6': 'You know, why are we not enforcing that? Yeah, we should be enforcing that. These are the kinds of people who can be helping our police department, enforcing those kinds of things. You have been and our public works department has been out there daylighting intersections.'",
        "'speaker_6': 'You know, it's frustrating. And the last couple of weeks I've seen at least two or three people just pulled up and parked right in the red zone, parked and walked away. Like, you know, if we're not going to ticket them, that's the we can paint all the curbs we want.'",
        "'speaker_6': 'It's not going to make a difference. So we really it's it's it's time to get going on this. The other goal of this program, which we are going to build with you, we want to keep coming back to you, tracking the revenues, tracking the expenses so we can build it to what we ultimately need over time is'",
        "'speaker_6': 'to also relieve. Right now, you've got sworn officers who are trying to on the side manage the parking management program. We also see I think they're also trying to manage the animal enforcement program. You need your officers out there enforcing speed limits and enforcing crazy driving activity.'",
        "'speaker_6': 'So we're trying to build a program over time that not only helps us do a better job enforcing parking, but also lets the police department start spending less time doing this kind of stuff and more time doing, you know, the types of things that sworn officers need to be doing.'",
        "'speaker_6': 'So that's where we're headed. We'd like your sort of endorsement of this approach. If you say yes, keep going. We will be back very shortly with the necessary budget amendments, job titles and those kinds of things that would be necessary with the department to to it, really effectuate it and get moving.'",
        "'speaker_6': 'We are racing against the clock. We want to be we want to be charging for parking and enforcing parking not only in Park City and Webster Street, but at the Seaplane Lagoon Ferry Terminal when it opens next summer.'",
        "'speaker_6': 'So we will be back to you in the very near future with more decisions about parking and parking enforcement around AMI to point. But that's going to be more on the operational side how to charge what to charge those kinds of decisions.'",
        "'speaker_6': 'But we got to get this enforcement sort of piece of the puzzle sort of moving and in place. So that's all I have to say, and I'm available to answer any questions. Liz Acord from Public Works is here.'",
        "'speaker_6': 'We foster also our parking and we anyway, we're here. Oh, and Nancy is that. She's right. You're very competent in resources.'",
        "'speaker_0': 'We know. And do we have any public speakers on this.'",
        "'speaker_1': 'Side of speaker?'",
        "'speaker_0': 'Okay. Comments, discussion.'",
        "'speaker_8': 'Councilmember Vella So I think that this is I like the direction that this is going. I would say that the double parking at school drop offs is part of it. But I also know and I'm not going to name the specific delivery company, but there are certain delivery companies out there that literally have somebody that their whole'",
        "'speaker_8': 'job is paying parking tickets. And that's because they're trying to make as many deliveries as possible in a day. And I see delivery drivers double parked and parked in red zones all the time. In fact, I saw us daylighting an intersection and the next day I saw a delivery vehicle in that exact spot with the bright red'",
        "'speaker_8': 'paint on the curb. So I do think that we need enhanced enforcement in this regard. I also think that cost recovery, there is a forward path to cost recovery. I also think that stolen vehicle there's stolen vehicle cost recovery programs, and there's also programs for, you know, rental car companies where they've got rental cars that have kind'",
        "'speaker_8': 'of stayed out beyond. Where there's different bounty programs to get reimbursement. And I think that there's a pathway forward. So I think that this is a good start and I'm ready to support this.'",
        "'speaker_0': 'Thank you. And he and Counselor Otis.'",
        "'speaker_4': 'Yeah, I remember that discussion we had. I didn't know if you guys would be able to formulate anything out of that, but I appreciate the fact that you did. Credit to your credit. Yes, indeed. So I appreciate this is a really good step.'",
        "'speaker_4': 'And, you know, I always pay the meter on Park Street or Webster Street, so I don't I'm going to keep doing it. I don't want a $30.40 hour ticket. So I'm going to I'll make a motion to approve this.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'And, you know, pending some other people's discussions.'",
        "'speaker_0': 'Any any other comments as councilor. Okay. So it's been moved by Councilmember Odie, seconded by Councilmember decide on favor. I. I. All right. That passes unanimously. Thank you for bringing that to us. Yeah. And so much more coherently than we gave it to you.'",
        "'speaker_0': 'Okay. Let's see where we are. Well, people you made up for lost time. Um, yeah. Okay. Item seven City Manager Communication. Thank you.'"
    ]
}