{
    "Summary Title: Approve Actions to Implement the Alameda Point Transportation Demand Management (TDM) Plan  Adoption of Resolution Authorizing the City of Alameda to Ratify the TDM Fee Amount for Existing Tenants in Alameda Point;   Recommendation to Allow a Pass Through of the TDM Fees from Existing Tenants in Alameda Point to the Alameda Transportation Management Association (TMA); and   Recommendation to Allow a Pass Through of the Special Taxes Generated for Transportation Purposes from Property Owners within Community Facilities District 17-1 (CFD 17-1) at Alameda Point to the Alameda TMA. (Base Reuse 819099)": [
        "'speaker_1': 'And this is to approve actions to implement the only two point transportation demand management plan, including adoption of a related resolution and a recommendation to allow pass through of fees and a recommendation to allow pass through of special taxes.'",
        "'speaker_0': 'Okay. And the public speaker. Okay. Yeah, the public speaker on this one is Michael McCarron. But the USS Hornet.'",
        "'speaker_8': 'Good evening, Madam Mayor. Members of the council. Good evening. I am Michael McCarron. I'm the executive director of the US's Hornet Sea, Air and Space Museum. As you're aware, the Hornet is a 5.3 sea charity. We received no funding from the federal, state or local government to operate the museum.'",
        "'speaker_8': 'What you have before you is a proposal to pass on assessments to the Hornet for transportation plan. This year, the Hornet will be assessed $4,000. Next year, 8000. And in 2020. $12,000. I'll be brief and to the point.'",
        "'speaker_8': 'These assessments propose a serious financial challenge for us in spite of numerous new programs, a revamp marketing campaign and broadening different Grammy demographics. The number of our annual visitors, unfortunately, remains flat. We are now in the process of developing a capital improvement plan.'",
        "'speaker_8': 'So the thought of having to pass these costs of these assessments onto our existing visitors and our members would be self-defeating in our effort to raise capital funds to maintain the ship properly and safely. I respect the request you tables plan until a comprehensive demand analysis can be looked at to see what the visitor benefit would be'",
        "'speaker_8': 'for the Hornet. Because right now we see none and it would not benefit our employees as well, because none of our employees would use any of the proposed options. I thank you for your time.'",
        "'speaker_0': 'Thank you. I believe he's the only speaker on this item, not.'",
        "'speaker_6': 'A mere.'",
        "'speaker_0': 'Member.'",
        "'speaker_6': 'I would request a brief staff report. It doesn't have to be a full thing, but just maybe to give the public an overview of what is the issue at hand.'",
        "'speaker_4': 'Sure. I'll go ahead and start, Jennifer. Acting Assistant City Manager and Gayle Payne, senior transportation coordinator, is here to support us as well. The City Council and May of 2014 adopted a Alameda Point Transportation Demand Management Plan, which was that all employers and residents are property owners, developers, employers participate in helping to fund and participate in programs'",
        "'speaker_4': 'related to transportation demand management to minimize car trips from al to and from Alameda point. So a major part of in fact a mitigation as part of the environmental impact report for Alameda point something that we've been developing for for many years the city the first development is implementing and this is an attempt to take additional measures'",
        "'speaker_4': 'to implement that program, including bringing in our existing employers on board to this this process. We held three or four community workshops with all with the tenants went over numerous different over the course of a year, numerous different options, looked at different options and then ultimately decided on the program that's being proposed here that the primary source'",
        "'speaker_4': 'of is include essentially all employees of all the businesses there will be will have access to essentially free easy passes paid for by the employers. And then we're modifying the line 96 with AC transit help to expand and have a wider catchment of of Alameda point in that's looking to be implemented at the end of this year'",
        "'speaker_4': '. So this is in line with the team plan for by the council the project area committee for Alameda Point that's part of the nonprofit that now that Alameda TMA or the transportation management association that oversees implementing team programs both at both Northern Waterfront and Point, they unanimously approved this program.'",
        "'speaker_4': 'So did the board of the Alameda TMA and really here to ratify this or the council.'",
        "'speaker_0': 'That's right. So I think are you going to do do does the clock work? Are you supposed to be keeping track of the clock on this part? Yeah. Okay. And I'm going to go to member Ashcraft.'",
        "'speaker_6': 'So thank you, miss. My questions are in the approval. The process of approving this program will mean that the Council adopted it. But was any consideration given for a special category 450133? And now we have the U.S. Hornet.'",
        "'speaker_6': 'Hornet, we have the Alameda Naval Air Station Museum. Was there any consideration given to special categories? And then were concerns like the one the gentleman just articulated, raised during the the process of of sharing this with the different entities at the point.'",
        "'speaker_4': 'You know, there was a lot of discussion about different uses and whether or not they fell into certain categories. And because of that input, we actually segregated the rates. We had one rate initially that we had proposed and we ended up putting the other different rates and even hybrid rates because of the different uses there to try'",
        "'speaker_4': 'to address the issues that folks raised about being having different types of uses, some more intense than others, potentially generating more traffic than others. And so we did look at that and I think in the case of the Hornet, even worked with the Hornet because of the square footage being very different, really trying to reduce that and'",
        "'speaker_4': 'minimize that. And did talk about that. We you had an important collaborative here you have the other they're all paying this fee because we we everyone I mean everyone we our hope is really everyone. And that if we start exempting people from the fee, that there's a lot of reasons other employers may want to be exempted as'",
        "'speaker_4': 'well. And then it really starts to open the door for, you know, not full participation in the team program. And we think that essentially undermines the overall program.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Any other questions? So in regards to the Hornet. Their rates are going to go from 4008, whatever he just said. Right. So does that mean what does that mean? We're not going to have the Hornet around.'",
        "'speaker_4': 'No, I don't. I mean, the question this was originally this rate and this amount was negotiated with the previous executive director. And this is the first I've heard that this would be a financial hardship. I hadn't heard that before was not appropriate before that today with regard.'",
        "'speaker_0': 'Okay, so now you've heard that financial hardship, you do like having the horn in town. So then the staff have a proposal of going back. What do you propose at this point?'",
        "'speaker_4': 'I think it's what the council would like to do. So there are other there are other tenants that also had questions about this. And they have essentially gotten on board with the idea that we tried to be very responsive by reducing the overall program to a very minimal program to start really wanting to start something small.'",
        "'speaker_4': 'That was one of their big concerns. So that's what we've done. We also bifurcated the rates to respond to that. And at the last meeting we had with a lot of with the tenants. There was general support for a much more limited program, which is what's before you today and try to minimize the impacts and the fees'",
        "'speaker_4': 'on the tenants, especially as this program starts to get up and running. And we've tried to be very responsive to all the comments we received from the different tenants.'",
        "'speaker_0': 'So do you have a list of the tenants that supported this and the list of the tenants that did not?'",
        "'speaker_4': 'And we did not take we didn't take a vote, but we had a final community workshop after four community workshops, and there was essential general support for proposing the financial plan that you have here. And then the project area committee that actually is made up of tenants at the base voted for this and recommended it.'",
        "'speaker_4': 'And then the table had a.'",
        "'speaker_0': 'List of who the tenants are that are on that committee that voted for it.'",
        "'speaker_4': 'Sure. Yeah. There's Representative Saint George Spirits Representative of the West Tower LLC. So SRM Ernst is on that. And then you have Joanna Hendrickson as well, representative in point developers and you have city staff myself on that. And then you have Doug Beggs, Executive Director of the A Point Collaborative, on that project.'",
        "'speaker_0': 'So you have two developers, one person from.'",
        "'speaker_4': 'A nonprofit.'",
        "'speaker_0': 'Developers, one nonprofit.'",
        "'speaker_4': 'And then one one business of spirituality.'",
        "'speaker_0': 'Four members comprising of to develop.'",
        "'speaker_4': 'In the city and my city.'",
        "'speaker_0': 'All right. So who came up with that composition? Because I think that's actually heavy in regards to that. 50% of the members are developers.'",
        "'speaker_4': 'It was in the bylaws and that was and so determined as part of the initial set up of the bylaws of the TMA and.'",
        "'speaker_0': 'Who said who set that up.'",
        "'speaker_4': 'So the said we we staff worked with the bylaws and with the community. And we asked we asked for nominations from the tenants. We did not receive any offers or nominations. We sent out emails to tenants asking for interests.'",
        "'speaker_4': 'And and those were the folks that ultimately agreed to serve. And we're representative of the interests in the bylaws and we need to have a representative of a largest property owner. We needed a representative of commercial interests and a residential interest city.'",
        "'speaker_4': 'And so those were so the largest.'",
        "'speaker_0': 'Property owner is.'",
        "'speaker_4': 'Well, the right now is the city because we own most of the property, but we as a proxy for that. We have Joe Ernst of SRM Ernst, who is part of the partners who now is the largest, who is now the largest property owner.'",
        "'speaker_5': 'So private property owner.'",
        "'speaker_0': 'So the city and developed Joe Ernst was in that position in the capacity as first a proxy for the city.'",
        "'speaker_4': 'Well know the city as the largest property owner essentially worked with the community and the tenants to determine who would be composed on that board because the city was the largest property owner, hadn't really transferred any property at the time that the bylaws and this nonprofit were formed, we went back out to the tenants and kind of'",
        "'speaker_4': 'sought out folks that represented the different interests. There's term is three years so at the and then the bylaws stipulate who essentially gets to serve. So at this point the largest developer will be element of point partners when the terms are up in three years.'",
        "'speaker_4': 'But the city sought out interests that represented the commercial interest, residential interests and then the largest property owner interests. And so it was SRM.'",
        "'speaker_0': 'Ernst Okay, so is it possible to have this go back with more input from community from community members in a more public process? Do you have a very public option today?'",
        "'speaker_4': 'It was a very public process. It's been no to all of the. So we've had three or four community workshops with the tenants. We then advertised the project area committee meeting. So just a matter that.'",
        "'speaker_0': 'Has to be voted on today or could we have more time to look at the sites?'",
        "'speaker_4': 'I think what if there's an interest in reviewing the Hornets amount and whether or not that seems fair? The council could kind of ask the TMA board to take another look in the project area committee, to take another look at that amount and determine whether or not they think that's an appropriate amount given the use.'",
        "'speaker_4': 'So that might be something that could be directed to staff to take back to.'",
        "'speaker_0': 'And were there any other tenants that voted no? Was there anyone else that voted no or expressed any concerns about this going forward?'",
        "'speaker_4': 'So initially there were a lot of concerns. We put something on the table, a lot of concerns. We met with the ASP, asked the tenants what they wanted, came up with a program that were questions, concerns. Then we worked with the tenants, held a couple of different meetings with them, and then ultimately came up with a number'",
        "'speaker_4': 'of options for them. And at the last meeting that we had, the options that are before you tonight is what they. Generally supported was that they were wanted to move forward with easy passes, with easy transit and a modification to the line 96.'",
        "'speaker_0': 'Yes, I would feel more comfortable if there were an actual vote with each of these tenants to get an input from each tenant. I'm going to go to a member. Oh, did you have question? No, I didn't remember.'",
        "'speaker_0': 'Matter. I see.'",
        "'speaker_2': 'It's my understanding that the Hornet gets a substantial lower cost for the birth than the merit. Is that correct? Mm hmm. And my I would say go forward with this and make that emotion that we go forward this.'",
        "'speaker_2': 'And if that transportation fee becomes a hardship, we can again look at the saving, the cost on another end. And I think it's also a misstatement to say that the city doesn't support the Hornet because that lower berth fee is a substantial savings that the city could be getting revenue from if it was leased to somebody else'",
        "'speaker_2': '. So that's where I'd make that motion that we go forward with the proposal as listed here. And then if there is a true hardship, we can revisit saving some money on the berth fee.'",
        "'speaker_0': 'Remember Ashraf.'",
        "'speaker_6': 'Thank you, Amir. And I'll. Second Councilmember Maher Estes. Motion. I'm concerned with a couple of things. First of all, one of the things that is often said about new development is it brings all this traffic. And what are you going to do about it?'",
        "'speaker_6': 'And this is in part what we're doing about it. We're having all the employers, all the developers paying into this fund to add to the the baseline and free transit passes. I would think that the Hornet would generate a lot of traffic.'",
        "'speaker_6': 'I know there's often events that are held at the Hornet that bring hundreds of people out. And so, I mean, that is a responsibility to to help support the mitigation of traffic to the Hornet and to Alameda Point.'",
        "'speaker_6': 'And I also am concerned that the previous executive director was part of the negotiation and agreed to it. And so, I mean, I get that there was some changing of the guard, but I think Mithat and staff were well within their rights to rely on the agreements they had at the time.'",
        "'speaker_6': 'I also would say we can have this, you know, if there are indeed hardships, then something can be brought back to, you know, perhaps modify. But when I hear that Alameda Point Collaborative and others are going along and paying their assessment, I think it's time that we get behind, you know, putting our money where our mouth is'",
        "'speaker_6': 'that we we know that more traffic will be generated. And this is a way to get at least some people out of their cars and onto public transportation and to provide more public transportation. So I'm in support.'",
        "'speaker_0': 'Throughout the report, it did reference the lime bikes and that went out for an RFP. So I just wanted to make sure that this we're not committing to using line bikes in the future.'",
        "'speaker_4': 'No, no. But Bikeshare has always been a part of the 11 point plan. So I think that is one of the times this was part of the pilot point. Yeah, okay. You're right.'",
        "'speaker_0': 'So we have any other questions? Comments?'",
        "'speaker_7': 'We asked Molly if she had it.'",
        "'speaker_0': 'Oh, I'm sorry, Vice Mayor.'",
        "'speaker_3': 'No, I'm fine.'",
        "'speaker_0': 'All right, then. We have a motion in a second and it would be a roll call vote.'",
        "'speaker_1': 'Thank you, council members. The i. I. Ella. Odie. Sorry.'",
        "'speaker_5': 'Hi, Bella. I.'",
        "'speaker_1': 'Mayor Spencer.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'Thank you. Or I one.'",
        "'speaker_0': 'Yes. That's five ee. The next is five G. And we do have a speaker on this one also.'"
    ],
    "Adoption of Resolution Requesting and Authorizing the County of Alameda to Levy a Tax on All Real and Personal Property in the City of Alameda as a Voter Approved Levy for the General Obligation Bonds Issued Pursuant to a General Election Held November 7, 2000 for the Alameda Library. (Finance 421.1)": [
        "'speaker_1': 'Okay. Adoption resolution requesting and authorizing this county needed to levy a tax on all real and personal property in the city of Alameda as voter approved levy for the general obligation bonds issued pursuant to the general election held on November seven, 2000, for the Army Library.'",
        "'speaker_0': 'So did staff want to give a brief discussion of what this is?'",
        "'speaker_5': 'I ask where Finance Director Elena dare to come in. Describe what this is.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Good evening, Madam. Mayors. Members of council laying out their finance director. So in 2000. Year 2000, the city decided to build a library. Free library, which is really close to the city hall here. And for that purpose, the city issued general obligation bonds in 2013, with the better interest rates, the city was able to refinance the bonds'",
        "'speaker_5': ', but the repayment of those bonds is still under the same resolution that was set in year 2000. So based on the calculation which we do every year, which supposed to support the interest and principal payments on the bonds, we assess all the properties within the city, a certain dollar amount.'",
        "'speaker_5': 'And as I mentioned, it changes every year. And the reason it changes every year because we have different number of properties, we have different assessed values and it fluctuates and we do the calculation and it has to be approved by the City Council before we send it off to the county for an actual final assessment.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_6': 'This is more of a comment. I'm really familiar with this bond because Councilmember Materazzi and I have. Speaker Oh, okay. I will save that for afterwards. Yeah. Let's hear the speaker.'",
        "'speaker_0': 'Thank you. So I'm going to go ahead and call up our speaker, Jim Strelow. He gets 3 minutes.'",
        "'speaker_2': 'Thank you, Mayor. Council staff. Citizens. About 16 years ago, there was a problem that occurred with Park Street trees where the city council had authorized tree removals and stuff. And there was like two or three years later after that, that public works finally got around to doing it.'",
        "'speaker_2': 'But the citizens weren't aware of what had been authorized three years before, and citizens got a little bit miffed saying, Well, why don't you remind us about what's going on? Tell us that you're doing this sort of action.'",
        "'speaker_2': 'Well, what I now dislike here is, is that in the year 2000, had this bond issue passed by the citizens. And then all of a sudden, you make this an automatic pass, a tax on the citizens. Now, without the the discussion, without the releasing the financial information, which is why I asked this item, Leopold, how much is'",
        "'speaker_2': 'owed on the library, how much to its debt obligation? Is it to whom? Is it to Wells Fargo and contractor No, it's probably to the state of California. So that, you know, how much is there, what are the amounts?'",
        "'speaker_2': 'What do we when do we expect to retire this tax? Because you're going to be taxing ulcers, all properties in the city of Alameda. I would think that people would anybody here aware that this new tax was.'",
        "'speaker_8': 'Being passed on them? Probably not. That's why I want.'",
        "'speaker_2': 'The, you know, making it above board. Please present some of the information so that we know what is this total amount due. And, you know, what's the what's a typical I think it's for $54.50 per 100,000 being assessed.'",
        "'speaker_2': 'So that's $45 a year extra or something on people's taxes, you know, for an average house, but then other other properties. And, you know, please tell the citizens so that they know what this actual new obligation is that you're passing on to the citizens.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Amber Matter.'",
        "'speaker_2': 'SC And first of all, this is not a new obligation. The voters voted in 2000 for a 30 year bond. The maximum assessed value was $15.98 per 100,000. It's never been that high. First of all, it's gone down every time because our valuations have gone up.'",
        "'speaker_2': 'It was at nine, something like eight years ago, six years ago, and now it's at 450. It was lit in 2000 and. To. So when this 30 years up so if you can answer that question actually but this is but this is not a new tax.'",
        "'speaker_6': 'I wanted to finish my comment.'",
        "'speaker_2': 'This is not a new tax. This is a reduction because valuations have gone up and we've got more properties. And if you could just answer when it's over, because there's 30 years is a long time and it's going to be reduced as we go for that.'",
        "'speaker_2': 'And we have the library.'",
        "'speaker_0': 'And could you answer the questions of the speaker? Thank you.'",
        "'speaker_5': 'Of course. So if anybody really would like to learn more about Citi's debt, they're very welcome to go in and look at Citi's annual financial statements that are actually presented on the city's website. It's called Capper Comprehensive Annual Financial Report.'",
        "'speaker_5': 'And there's a whole section on the bonds and general obligation bond. This particular one is one of them. It presents what is the outstanding balance on the debt. And as of June 30th, 2017, that was a little over $7.9 million.'",
        "'speaker_5': 'The payments principal payments are made in August. Interest payments are semiannual. The bond is going to be repaid in six years. So we have about 16 years left on this particular bond. And our assessment is really to make a payment on the principal and interest that is required for a year.'",
        "'speaker_5': 'That's coming up. We have accumulated a little bit of extra cash and we take into account, in consultation with the Bond Council, what needs to be done and we reduce the payments. That's one of the reasons why assessment is a little lower than it would have been otherwise to make sure that we do not over collect.'",
        "'speaker_5': 'But the reason for over collection that happened was because the assessed values have gone up.'",
        "'speaker_6': 'And if I could finish.'",
        "'speaker_0': 'Let me just circle back to remember matters you first.'",
        "'speaker_2': 'Did you? Yes. I just want to make sure people know that this is not a new tax and it's been going down and we have the building and 7.9 million left is nothing to the cost of replacing that building today.'",
        "'speaker_0': 'Member.'",
        "'speaker_6': 'And I'll just pick up where I left off. Frank and I. Councilmember matter. As you know, I co-chaired that campaign. And by the way, when we passed that bond measure and Mr. Steele, I think you were one of my supporters, but we had 78.8% of the electorate.'",
        "'speaker_6': 'And it was a high turnout was a presidential election year, 78.8% voted yes. And I remember phone banking for that measure and people would ask, well, how much is it going to cost me? And at the time, we what we believed was $15 per $100,000 of your assessed, not your appraised, but your assessed property value.'",
        "'speaker_6': 'And for the most part, the folks we were talking to on the phone would go, Oh, that's nothing. And so now the way you property owners can look at it is you got a little raise because as Ms..'",
        "'speaker_6': 'Adair explained, as property values go up and our property values have all gone up since 2002, whenever this was initiated, that means that the you know, the percentage amount is less. And we have added more properties, both commercial and and residential.'",
        "'speaker_6': 'So it's a good thing. And as councilmember matter, as he pointed out and we have a library, we can't keep saying it's new because now it's ten years old. But and we were very fortunate that this community also voted to to do the bond because that was a matching fund we needed to apply for the state money'",
        "'speaker_6': '. So the state put in $2 for every $1 of local match the state put into, and you just can't get a better deal than that. And that, by the way, was the last library construction bond the state of California has passed.'",
        "'speaker_6': 'They've tried to get others through the legislature, and it's just never gotten all the way up to the governor's signature. So it's not a new tax.'",
        "'speaker_0': 'Remember 80?'",
        "'speaker_7': 'Actually, I think this is our only bond indebtedness we have.'",
        "'speaker_5': 'Right as a general obligation on. Yes.'",
        "'speaker_7': 'I'm of approval of the item.'",
        "'speaker_0': 'Could be vice mayor. I don't know if you had any comments. Questions.'",
        "'speaker_3': 'No, I second the motion.'",
        "'speaker_0': 'Okay. So we have a motion in the second. Any other questions? Comments.'",
        "'speaker_5': 'Mark?'",
        "'speaker_1': 'Oh, yeah, I think i.'",
        "'speaker_7': 'I i.'",
        "'speaker_1': 'I know you're Spencer.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'It's been five days.'",
        "'speaker_0': 'Thank you. So now we're on five H.'"
    ],
    "Adoption of Resolution Approving a Workforce Change at Alameda Municipal Power to Add One Position, Advanced Metering Infrastructure (AMI) System Administrator and Amending the Salary Schedule of the Electric Utility Professionals of Alameda (EUPA) to Add the Classification of Advanced Metering Infrastructure (AMI) System Administrator, Effective June 5, 2018. (Human Resources 2510)": [
        "'speaker_1': 'Adoption resolution approving a workforce change at medium to some power to add one position advanced metering infrastructure system administrator and amending the related salary schedule.'",
        "'speaker_0': 'So I mean.'",
        "'speaker_7': 'Brody Yeah. I have three quick questions if. Good evening, Mayor Spencer. Council Members. Niko Prokop General Manager, HAMP. Thank you, sir. So first question. This was on your request, correct? Correct. And you're the department head. And is is in your professional opinion, as the department had you judge this as an essential need of AMP.'",
        "'speaker_7': 'Is that correct? Absolutely. As you are aware, we just finished replacing 36,000 meters. We have a lot more data that we're dealing with. We're getting ready to launch a customer portal. We need somebody with a high degree of expertize to be able to monitor the health of the system.'",
        "'speaker_7': 'We get alarms and we get notices that tamper validations that need to happen. We have meters that sometimes go silent. A lot of these issues we did have before with the old meters, we just had no visibility in them.'",
        "'speaker_7': 'We did. We have a consultant who's currently doing the work, but now the amount of data and information that's coming in that we need to troubleshoot really justifies this position. And this is a personal. So we're going to be a paying person on this.'",
        "'speaker_7': 'This is Percival, correct? Okay. I don't have any more questions. Thank you.'",
        "'speaker_0': 'The other questions.'",
        "'speaker_3': 'I have a question.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_3': 'Was this costs factored into or included in the consideration of switching over to the metering?'",
        "'speaker_7': 'So when we embarked on the AMI program, we did do a cost benefit analysis and we looked at. Kind of a broad view of the organization, and some positions were fairly obvious that they were going to be phased out.'",
        "'speaker_7': 'So for example, meter reading positions we did have three of those were now down to one. And then at the same time, though, there was a recognition that this is we're moving towards more of a technology focused platform with these smart meters.'",
        "'speaker_7': 'We're going to need to maybe a disposition. I don't think there are any plans at present to add another position or more positions related to the program, but they're kind of somewhat of an offset. But I think overall the benefit there is a benefit to the utility in terms of cost reductions, both in this perspective and then'",
        "'speaker_7': 'also in operational efficiencies, other operational efficiencies. So for example, we have significantly less truck rolls right now. We're able to do a lot of activities remotely that saves on greenhouse gas reduction and other things like that, that saves on wear and tear on vehicles and and other personnel related issues.'",
        "'speaker_3': 'So this position wasn't factored in into the initial estimate. When you switched over to the MRI system.'",
        "'speaker_7': 'I don't know whether this one was specifically identified. It was there was a recognition that we would need as part of monitoring the platform. A position of this nature. I don't know whether that was a bit before my time.'",
        "'speaker_7': 'I turn to Bob as Bob is nodding his head. So that was part of the original business case assessment. So it was included as part of our analysis.'",
        "'speaker_3': 'And this cost was considered as part of that analysis.'",
        "'speaker_7': 'Yes.'",
        "'speaker_3': 'So this was factored into the potential budget of an anime program? Yes. Cost?'",
        "'speaker_2': 'Correct.'",
        "'speaker_3': 'Okay. Um, my second question is, um, you know, for this for this position, um. Do we have an internal candidate? Is this a position that's going to be posted later on?'",
        "'speaker_7': 'We will be opening up the position and there are some potential internal candidates. It will be an open recruitment, so there could be outside interested parties. This is a very technical, IT focused position. So it requires a unique skill set.'",
        "'speaker_7': 'And that's what we'll be looking for when we when we do the recruitment.'",
        "'speaker_3': 'Okay. Thank you.'",
        "'speaker_0': 'Any other questions from council?'",
        "'speaker_6': 'Move approval second.'",
        "'speaker_0': 'I do. Oh, sorry. I do have a question. Um, my question is. Okay, so if we don't approve this, then what happens? Because I know you installed all the new meters.'",
        "'speaker_7': 'So currently we have a consultant who is performing to a large degree this function. There are other parts of the workforce who are filling in here and there on other components of the function. But by and large, it's a it's a third party consultant.'",
        "'speaker_7': 'It has worked up until now as we've ramped up the deployment of the meters. But we do feel that we need somebody in-house who's going to be able to be there day to day. This position not only has the a high technical component, they're also going to be interfacing with many other areas of the department.'",
        "'speaker_7': 'So, for.'",
        "'speaker_2': 'Example, when.'",
        "'speaker_7': 'Field crews, crews need to go out and and look at meters, they will work with them and then so that they can do their work. So it really makes a lot more sense to have this position in-house as opposed to have it with a consultant.'",
        "'speaker_0': 'So that in here it says something about there is a net savings overall, but there's not a, you know, do you have a dollar amount to give us some idea what kind of savings by I know you've let go some people that go out to the homes and actually do the reading.'",
        "'speaker_0': 'Correct. And now this is going to replace that. Do you have any idea of what the savings is?'",
        "'speaker_7': 'I don't have the numbers. We did we did start out with we had three meter readers. We're now down to one.'",
        "'speaker_0': 'In the pay of a meter reader.'",
        "'speaker_7': 'I don't know the exact approximately.'",
        "'speaker_0': 'Yes. Oh, yeah. And this. This starts at 91,000 per year. The range is 200,000.'",
        "'speaker_5': 'Good evening, Nancy Bronstein. Sorry. There is some savings because the meter readers, probably two meter readers, are probably closer to about 150 between them fully loaded or about 60,000 apiece for salary. So there's still some savings.'",
        "'speaker_0': 'Even with the addition of this position. Okay. Thank you.'",
        "'speaker_3': 'I have one more question.'",
        "'speaker_0': 'Oh, Vice Mayor Brody.'",
        "'speaker_3': 'Did the cost go up recently or aren't services?'",
        "'speaker_5': 'So did the cost go up recently for AMP services? Nice Mary. Talking about rates.'",
        "'speaker_3': 'Yes.'",
        "'speaker_7': 'So the board recently approved a 1% average rate increase starting in July that will impact different customer classes differently depending on the cost of service. At this time last year, we were projecting a 5% rate increase. So we were very happy to to refine the numbers a little bit.'",
        "'speaker_7': 'And it looked like based on the strong financial performance of the utility over the past year, that we were able to return that value to the ratepayers in the form of a lower than expected rate increase.'",
        "'speaker_0': 'Edit I swear. Did you have any other questions?'",
        "'speaker_3': 'That's it.'",
        "'speaker_7': 'I said a quick comment. I know we had a budget meeting a few weeks back and there was a request by a department head who we trust to know what his department needs to fill a position that in his best business judgment he felt was necessary and that even would have been covered by cost recovery.'",
        "'speaker_7': 'And it was the majority of the council said no because it was personal. And now we are faced with a similar situation today with a very high level paid employee being asked for by the department head who we presume knows the business needs of his department.'",
        "'speaker_7': 'And it's also personal. Yet it seems we are poised to approve that. So it seems a little bit, you know, inconsistent with me that, you know, we have one standard for one department and one standard for the other.'",
        "'speaker_7': 'That's my comment.'",
        "'speaker_0': 'I'm happy to respond to that, and I appreciate that. This to me is different in that you have cut other positions because we are installing the automatic what do you call these readers?'",
        "'speaker_7': 'Smart meters, smart.'",
        "'speaker_0': 'Meters for installing the smart meters. And so you eliminated three or two of the people that walk around.'",
        "'speaker_7': 'There's two, and we have a third left and we'll revisit based on workload in January 2019. And I will point out that in the last four years, our staffing level has actually reduced. So some of that's related to the Smart Meter program and some of that is other other things going on as well.'",
        "'speaker_0': 'Thank you, member Ashcraft.'",
        "'speaker_6': 'And I'll just add to the mayor's comments that as I believe it was, the fire chiefs request that was being referred to. And I do recall that we also informed the chief to come back when these prospective cost savings were known.'",
        "'speaker_6': 'At this point, they're just, you know, on paper. And we couldn't we can't base a budget on on speculation. But when those figures are known, then we will take another look at it. But there's always a lot of balancing that goes on.'",
        "'speaker_6': 'But I'm I believe there's been a has there been a motion in the second of.'",
        "'speaker_0': 'I believe, member matters to make a motion and your second on it and yeah. So any other questions or comments at this time? All right.'",
        "'speaker_6': 'Does the acting city manager I.'",
        "'speaker_5': 'Just wanted clarification that thank you that the this is not general fund money. We all okay.'",
        "'speaker_6': 'For another distinction? Still personal time.'",
        "'speaker_5': 'Still personal. But then general fund.'",
        "'speaker_7': 'Somebody somewhere in Alameda is going to be paying that.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Call the remember as the article I addressed. I. I.'",
        "'speaker_3': 'No.'",
        "'speaker_1': 'Mayor Spencer.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_1': 'One note.'",
        "'speaker_0': 'Thank you. Okay. Five. I was withdrawn or will be coming back to council on a later date. Five. Oh, I just said I voted no on, but we did already vote on that. So now I believe we're on six a we're on our regular agenda.'",
        "'speaker_0': 'Item six a mayor member asked.'",
        "'speaker_6': 'My request on six A would be that we bifurcate the vote on the two members. Maybe you were going to do that anyway because.'"
    ],
    "Consider Adoption of Resolution Supporting Alameda Rank-and-File Employees Post a Janus v. AFSCME (American Federation of State, County, and Municipal Employees) Supreme Court Decision.  (Councilmember Oddie)": [
        "'speaker_1': 'Consider adoption resolution supporting Almeida Rank and file employees post a Janice versus American Federation of State, County and Municipal Employees Supreme Court and the sign was placed on the agenda at the request of Councilmember Odie.'",
        "'speaker_7': 'So briefly. It's going to be recognized. Sorry. Sorry. So briefly, I think that the clerk described the referral, and the referral is to actually adopt the resolution that's attached, and that's reinforcing our continued cooperation with all of our public sector unions and supporting the freedom of them to collectively bargain post a U.S. Supreme Court decision on Janus'",
        "'speaker_7': '. And I think everyone knows that that that decision is imminent. It could come down any day now. And this resolution is just to make sure that our workers rights are respected and that any communication related to this and their their rights and any changes of that, and that they don't have that information come from management, that they're'",
        "'speaker_7': 'able to have it come from their bargaining units, and that that can be done, you know, with release time. So I'm sure our speakers will talk more in detail on some of the intricacies about it.'",
        "'speaker_0': 'All right. So I'm going to go ahead and call the speakers now. And I'm not sure which order who wanted to go first. I have Al Fortier with IBEW 1245 and I also have Josie come and watch the sorry Camacho.'",
        "'speaker_0': 'Whoever wants to go first. And if you could identify yourself, that'd be great. Thanks.'",
        "'speaker_7': 'And looks like now it's.'",
        "'speaker_2': 'Thank you, Madam Mayor. I'm now 48. I'm the business representative for IBEW Local 1245. I represent the electrical workers that work for Alameda Municipal Power. I have a 20 year relationship approximately with the city of Alameda, 11 years as an employee, as a journeyman lineman, and eight years as the business representative representing the electrical workers.'",
        "'speaker_2': 'Like I said, I rise in support of nine. See the resolution that supports the Alameda rank and file employees post Janice versus me Supreme Court decision as you guys have seen in the resolution. The whereas is highlight the many benefits of working families who are union members.'",
        "'speaker_2': 'Many of our members are Alameda INS who have benefitted from the relationship between our union and app. They benefit not only from the good wages and benefits that we provide, but also from the training, joint training between the union and app and also the joint safety programs that are provided.'",
        "'speaker_2': 'Our electrical workers have gone through the apprenticeship program, as I said, at and we have a number of them who are Alameda INS. One of our earlier speakers talked about the need to attract high tech in order to provide good jobs for folks who can live in Alameda affordably.'",
        "'speaker_2': 'But I would submit that our relationship with AMP has already provided a model for training through their apprenticeship programs that would provide good jobs. And the union in the city has worked hand in hand for decades and both our parties to the IMO you that covers our agreement for working conditions for providing city services to the citizens'",
        "'speaker_2': 'of Alameda. The provisions of our agreement are put in jeopardy by the Janice versus Asman decision. Particularly, we have agency shop language that governs our dues collections. We also have a provision of our contract. As you may know, the separate severability provision which requires us to meet and confer over items of our MRU that become or become'",
        "'speaker_2': 'deemed illegal, which this likely would as a result of. Janice So I believe that the resolution reinforces the right to meet and confer the rights for union members and workers to have a voice. And I don't think it does anything or says anything that would not otherwise take place statutorily between the union and the city of Alameda'",
        "'speaker_2': '. I think it does reinforce, though, that it is important to maintain a good and vibrant working relationship. I mean, that's you know, we have.'",
        "'speaker_0': 'Thank you. Next speaker, jose, also. I'm sorry. We have a strict time limit. I'm sorry. We just do appreciate it, Jose. You know. Thank you all.'",
        "'speaker_4': 'Jose Camacho. Good evening, mayor and city council members. I am the Executive.'",
        "'speaker_0': 'Secretary Treasurer of the.'",
        "'speaker_4': 'Alameda Labor Council. We proudly represent 132 local affiliated unions, 135,000 union members throughout Alameda County in support of supporting.'",
        "'speaker_0': 'Our public sector unions.'",
        "'speaker_4': 'Under the direction of the Trump administration, there have been nothing but attacks on a national scale and international scale. And this is one of those bullets that starting to hit home, we feel, in light of the MeToo movement, you know, now women more than ever are speaking out and being heard.'",
        "'speaker_4': 'And sexual harassment and abuse is no longer tolerated and never should have been. But now it's taken a movement to fight that. The other is.'",
        "'speaker_0': 'The civil rights.'",
        "'speaker_4': 'Movement. The Trump administration is trying to turn its back 40 years from what we have fought for this very day. My parents came from the island of Guam. There were ten of us and worked really hard during World War Two when the call was made to the people of the islands.'",
        "'speaker_4': 'But living here in Alameda County in Oakland at the time, there was so much racism that we faced just merely because of who we were and what we looked like. And now today we have the attack against unions.'",
        "'speaker_0': 'And I will say proudly that in Alameda County.'",
        "'speaker_4': 'AC Transit last week voted to support its public sector workers.'",
        "'speaker_0': 'Alameda County Board of Supervisors.'",
        "'speaker_4': 'This morning unanimously voted to support its public sector workers. The city of Emeryville Unified School District and Berkeley and other jurisdictions.'",
        "'speaker_0': 'Have it.'",
        "'speaker_4': 'On their agenda. Coming up with the Port Commission, with city of Oakland, city of Hayward, Berkeley, and other school districts and public entities. And tonight I am asking those of you that are elected leaders, that are public.'",
        "'speaker_0': 'Employers, that.'",
        "'speaker_4': 'Have public employees to support this resolution, it would simply mean that in light of the eminent decision from Janice, that you will stand with your public sector workers and allow the continuation of collective bargaining, allow the continuation of people, workers to have a voice, and allow the continuation.'",
        "'speaker_0': 'Through that voice to.'",
        "'speaker_4': 'Exercise raising of standards in terms of wages, benefits and working conditions.'",
        "'speaker_0': 'We have been in conversations with our public employers.'",
        "'speaker_4': 'They have been very receptive, were willing as labor. Thank you very much, Mayor. I got you before you got me.'",
        "'speaker_0': 'I know. I don't know.'",
        "'speaker_4': 'If I should say goodnight or good morning, but.'",
        "'speaker_0': 'Thank you. Yeah, it's 1130. Almost here. All right. Remember matter. S.E..'",
        "'speaker_2': 'I'm. I think the the timing of this is is apropos as far as the whereas as I on the resolution, I don't have any issue at all with that. The city has used collective bargaining in good faith negotiations to provide us with a good framework for our behavior.'",
        "'speaker_2': 'And I think it should be continued. I think when it gets to the further resolved in our direction to staff, because there will be impacts on how we as employers have to change. I think it's important that the direction is not as is written here, but to make sure that we are prepared to address the changes in'",
        "'speaker_2': 'the law should this ruling comes down as expected. So I think that's the first point that should be addressed and in which staff our staff should do. I think our Council I, I am standing for this, but. I think our council is willing to stand for it as well.'",
        "'speaker_2': 'But as far as the implementation of membership cards, our staff really isn't isn't directly involved in that. But I think what we have to provide is the assurance that we're going to continue operating under the model or the standards that are set in collective part, the principle of collective bargaining and the principle of good faith negotiations and'",
        "'speaker_2': '. I'm trusting that staff and I think our direction should be that staff will engage. As far as we know, we're going to have to react with with the union representatives so that and the association representatives so that we're all on the same page in maintaining, again, the principles that are established in collective bargaining and in good faith'",
        "'speaker_2': 'negotiations, which I think, again, is it's a standard that served the city well.'",
        "'speaker_6': 'Amber Ashcraft Thank you, Mary Spencer and thank you to Mr. 14 Ms.. Camacho for coming and staying till all hours to address us. This is an important issue, and I will quickly add that my father was the president of his union, and it was a large union in San Francisco.'",
        "'speaker_6': 'And I very much believe in union principles and the value and good work that unions do. And I also agree with councilmember matter. I have no problem with any of the warehouses. I think the one that talked about union membership declining in Wisconsin.'",
        "'speaker_6': 'Had there been enough time, could probably also have added in union members or former members are suffering and even having to go on public assistance as a result of some of the lack of collective bargaining. I'm also, though, mindful of what my colleague, Councilmember Odie, reminded us earlier in this meeting, that the council must be careful not'",
        "'speaker_6': 'to direct staff, not to step out of our lane, if you will, on things that are not within our purview. And so I would would favor this, and I could support this resolution if the further resolved language is modified to give it to staff, to come quickly back to us to draft language, that that reinforces our commitment'",
        "'speaker_6': 'to union membership, collective bargaining. All of the wonderful programs that benefit our workers and our community because we want people to be able to to live and support their families. But I, I am hesitant to a to for the Council to urge appropriate staff because we have three direct reports in there the city manager, the city clerk'",
        "'speaker_6': 'and the city attorney, and also the way that the specif specific directives are worded. I would just hand it back to staff to make sure that we stay within the appropriate legal framework. And and I believe that's something that they're able to do.'",
        "'speaker_6': 'I believe they are vice mayor.'",
        "'speaker_3': 'So I actually think that. To remove any of the further resolved language is to completely undermine the spirit of what this resolution is trying to achieve. I guess my question is and by the way, Emeryville unanimously adopted this exact resolution tonight.'",
        "'speaker_3': 'Alameda County adopted unanimously this exact resolution tonight. San Francisco adopted this resolution back in March. It's being heard in a number of different jurisdictions. I don't quite understand how this is interfering with staff. Ask them specifically to engage in good faith discussions around implementing membership cards in release time.'",
        "'speaker_3': 'All that saying is essentially to say that, well, we're going to continue to engage in the status quo, but we're also going to work with the new law as well. The new law is going to create a number of different issues that, frankly, our staff is going to have a hard time figuring out.'",
        "'speaker_3': 'And part of it has to do with when. In the year of this protest. This decision is coming out. It's coming out at the end of the fiscal year. So. I think that there could be a lot of issues from a staff perspective, frankly, by not having something in place for what the process is.'",
        "'speaker_3': 'And I'm not sure. I mean, is it our hope that we engage in bad faith? I just I don't understand that. Also, outside of California, this language has been adopted in a number of different cities. Columbus, Ohio. Chicago, Illinois.'",
        "'speaker_3': 'El Paso, Texas. Saint Louis, Missouri. Baltimore, Maryland. Nashville, Tennessee. Philadelphia, Pennsylvania. Durham, North Carolina. So I think it's all fine and dandy to say we believe generally and we're we're going to accept the warehouses. But when it comes to actually giving direction to engage in good faith discussions, we're not going to direct our staff to do that'",
        "'speaker_3': '. I find that to be troubling and not in line with at least my values. And certainly I think. When we're talking about the intent of our own staff, my sense has been that their intent is to engage in good faith discussions around this issue and what could potentially come up and to also adhere to the current contract'",
        "'speaker_3': 'language which, as Mr. Fortier stated, is in line with those exact provisions. So in many ways I think that this is something that we should all be voting on. I think it's imperative that we enact it tonight. And I don't know why we have to rewrite something that so many other jurisdictions who represent similar workers with similar'",
        "'speaker_3': 'charter provisions have already enacted. So I'm ready to support this as written tonight, and I think that we can't wait on it because this decision is imminent.'",
        "'speaker_0': 'So I'd like to speak. Well, actually, remember already that you want to speak next. I'm happy to let member already speak.'",
        "'speaker_7': 'Trying though next. And then I'll hear what you have to say. So, I mean, just a comment on some of the comments. I mean, the first resolved clause is basically a value statement. It says that we support the freedom of all employees to exercise their right to voice and dignity on the job through joining together in strong'",
        "'speaker_7': 'unions. I mean, there's no prescription of how to bargain, you know, not what what to say. You know, there's nothing related to any ongoing negotiations. And I will say that, you know, a lot of those cities that the vice mayor mentioned had adopted this while they were negotiating new contracts and extending contracts.'",
        "'speaker_7': 'So I don't I don't see where that's an issue because it hasn't been an issue before. And then so the first resolved, I think, is just a clear value statement, and I don't know why there would be an issue with that one.'",
        "'speaker_7': 'And the second one, and look at what, you know, we're actually doing. You know, we're urging our staff to work with our labor unions. So that is basically, you know, bargaining in good faith. So if you chunk that up, work with the unions, I don't see how that's a problem, especially given that that probably is one of'",
        "'speaker_7': 'our requirements now for our current contract. So post the Janice decision to cooperate to mitigate impacts but doesn't say how to mitigate those impacts. It doesn't say exactly what to do to mitigate those impacts. It doesn't prescribe any behavior.'",
        "'speaker_7': 'It just as we're going to sit down in a room together in good faith and cooperate to mitigate those impacts, and actually that's the actual behavior that it's prescribing is good faith discussions. So it's not saying that that those good faith discussions have to result in A, B or C, and it just gives some framework around what'",
        "'speaker_7': 'those discussions should be. Membership cards and release time and explaining the negative decision. So I'm at a loss to see where it's being very prescriptive and it's where it's interfering with any ongoing negotiations. But, you know, feel free to enlighten me.'",
        "'speaker_0': 'So I'd like to speak. I haven't had a chance to speak yet, so I'm going to go ahead and everyone else is talking about their connections to unions. So my dad was a part of the Department of Water and Power for many, many years and retired from that.'",
        "'speaker_0': 'So I don't have a problem with unions. And in fact, you know, I have supported many of our employee unions here in town. That being said, we have this other thing that I think is unique to the city of Alameda, maybe is our city charter.'",
        "'speaker_0': 'Our city charter is very clear that the council hires the city manager, the city attorney and the clerk, period. And then the city manager, for instance, here, would work with the employees. And I don't. To me, it's very clear.'",
        "'speaker_0': 'I think we have just had a huge investigation about what is our lane and what is not our lane. At the end of the day, our city ended up paying $900,000 to resolve this issue. I think it's very troubling from my perspective.'",
        "'speaker_0': 'I try to stay in my lane. I think my lane is that I hire the city manager, council hires the city manager, and then the city manager works with the employees union or not. But our charter is very clear.'",
        "'speaker_0': 'We give direction to the city. Actually, we hire the city manager. The city manager then would implement any i'm working with h.r. My opinion of how this works is that then they renegotiate contracts. If there's an issue, staff can come to us and let us know otherwise.'",
        "'speaker_0': 'H.R. handles that. I don't think it's appropriate for our charter for us to be touching directing. I think it either goes through negotiations which is coming up or we're in negotiations already. I think that's appropriate when it goes to negotiations and we go back and forth and then we address this issue there.'",
        "'speaker_0': 'I'm comfortable with saying, you know, just a broad statement, but not in regards to directing the city manager of how she or he would implement our employee contracts and work with that. I think that's out of our lane.'",
        "'speaker_0': 'And so I and I think it is because we have, you know, these other entities, they don't have our city charter. Most places I know do not have our city charter. I think, in fact, we've just gone through this in regards to other councils can get involved in hiring of other employees.'",
        "'speaker_0': 'We cannot. And so I'm going to I think my position is I'm going to honor our city charter. I don't plan to support the second one because of our city charter, I think. And I want to honor that.'",
        "'speaker_0': 'And I honestly, I think we've just been spent the last I don't know how many months on staying in our lanes. And so I plan to honor that and not go not try to dance around it and maybe end up where it's safe or not safe.'",
        "'speaker_0': 'So I think it's appropriate that it goes through negotiations on this issue. I'm happy to address the for the warehouses and support that and the first resolved and maybe some general principle of that we support. And but honestly, I'm confident that we do operate with good faith all the time.'",
        "'speaker_0': 'So I would not want to make any statement that would suggest that we don't do that already. Member matter.'",
        "'speaker_2': 'I'd like to propose a motion. I move the resolution with the amendment to the further resolved statement that will read that the city that the Alameda City Council urges the city manager and appropriate staff to work with the public sector unions at the City of Allen at the City of Alameda Post a Janice versus me Supreme Court'",
        "'speaker_2': 'case. I cooperating to mitigate impacts. And by engaging in good faith discussions around. Around. I'm sorry. Good faith discussions. To explain and mitigate the negative implications of the Janisse decision.'",
        "'speaker_6': 'Question. I know.'",
        "'speaker_3': 'Can I?'",
        "'speaker_0': 'All right, let me do member Ashcraft and then vice mayor.'",
        "'speaker_6': 'I was I might be able to support that. What I was going to ask, though, was if staff because I saw city attorney and acting city manager maybe furiously scribbling. Have you possibly come up with any suggested language?'",
        "'speaker_2': 'Well, I mean.'",
        "'speaker_5': 'Obviously, the city city manager can speak for herself, but we were trying to figure out a way to potentially modify this, I guess, from my own personal perspective. We could come back on the 19th, which is very quickly.'",
        "'speaker_5': 'I mean, I understand that a couple of the council members think that's too late, but we could come back on the 19th. We can try to wordsmith it. Now, what we're concerned about is what you've said. We are in negotiations with bargaining units now.'",
        "'speaker_5': 'And so we want to be careful not to get too specific. But I think we want to definitely we hear all of the council members being supportive of wanting to say that, yes, we we want to continue to have good relationships with our unions, that you are making a statement.'",
        "'speaker_5': 'I heard some of you say that we're going to continue on to be supportive of collective bargaining standards. We're going to do good faith negotiations. I think some of the things that I had heard before had to do with making sure that it was clear that the impacts of this decision, which has not yet been delivered, and'",
        "'speaker_5': 'be reminded, we want to make sure that the union representatives have the ability to convey what they think it means to their rank and file as opposed to just the employees. I mean, we could add a couple of things like that, take out some of the specificity.'",
        "'speaker_5': 'We could try to just what council member Matt, R-S.C., was just trying to suggest as a way to try to modify this. I'm not sure that gets at the more positive aspects. I mean, one of the ways I suppose we could do it is we could even just put a period after engaging in good faith.'",
        "'speaker_4': 'Discussions period.'",
        "'speaker_5': 'That kind of takes out some of this more specific type thing. But if there's time, the best way to do this would be to let us come back on the 19th. But if you don't want to do that, we can try to sit here and wordsmith this.'",
        "'speaker_5': 'Member Ashcraft Can I say.'",
        "'speaker_6': 'Okay. I do want to come back to media, but if the vice mayor wants to.'",
        "'speaker_0': 'Vice Mayor and the member Ashcraft.'",
        "'speaker_3': 'So I just feel like we're trying to wordsmith something that really doesn't need to be wordsmith. If we're going to say that, we're going to engage in good faith discussions around, you know, around this. What specifically has to deal with is implementing membership cards in release time, because I don't know how we're going to engage in good'",
        "'speaker_3': 'faith discussions if we don't have release time. And, you know, as to the fact that we're negotiating contracts right now, those are future contracts. This is we have current contract that are still in effect and they're going to be in effect until December.'",
        "'speaker_3': 'And this has to do with an impact that's going to come into effect potentially right away. So it's in our own best interests to sit down and figure out, do we. Are we going to require a new membership card, all of those sort of details.'",
        "'speaker_3': 'How do we want to streamline it if people you know, how are we going to actually implement this? And from an implementation standpoint, I would think that we would want to do this and we already do it. So I guess I kind of disagree with the fact that this is somehow impacting bargaining because this is about an'",
        "'speaker_3': 'existing contract, not a future one. And I also, in terms of staying in our lane and what we're supposed to do as a council, we also give direction relative to the general values and policies that we're enacting relative to our staff and our employees.'",
        "'speaker_3': 'And so this isn't a department head position where we're directing somebody be hired. This is about taking a policy stance. So. I just I think that we either adopt it as written or we don't adopt it because otherwise we're just making a statement that really is meaningless.'",
        "'speaker_3': 'That's not going to do anything. And I think that there's a lot of people professing to care about certain things. But then when it comes about actually taking a stand and saying, this is what our policy is going to be, people seem to be backing off from that.'",
        "'speaker_3': 'So I'd like to I'd like to adopt it as written. And and do that tonight.'",
        "'speaker_0': 'So we have emotion already still. I'm still I appreciate that. But she, I think, might have been close to.'",
        "'speaker_6': 'My that was in a second.'",
        "'speaker_0': 'So I wasn't sure what to do with the vice mayor's comments. Okay.'",
        "'speaker_6': 'Thank you, Mayor.'",
        "'speaker_0': 'Well so so let me confirm that because member matter he had made a motion. Okay. And I don't think my clock should be ticking down when I'm trying to organize this.'",
        "'speaker_7': 'That's true.'",
        "'speaker_0': 'Right. Sorry about that. So I'm just trying to find it. So member matter. You had emotion. Did anyone want to second that or is that dying? Natural death? Okay. I don't hear.'",
        "'speaker_7': 'Is like a substitute. I do a.'",
        "'speaker_6': 'Substitution. I had my hand up.'",
        "'speaker_0': 'And I appreciate that. Actually, I think vice mayor came very close to making a motion.'",
        "'speaker_6': 'But that was because I ceded the floor to her and I would like to finish my remarks.'",
        "'speaker_0': 'Mayor Spencer. I'll go to so. So we have finished the motion from member matter and then I'll just go ahead to Nebraska.'",
        "'speaker_6': 'This is what I would suggest. And it is not too far off from what Councilmember Matariki said, but and I would also just remind us all that reasonable minds can differ and we can still feel very strongly about our values in supporting a union labor.'",
        "'speaker_6': 'But I'm trying to to take away a little of the specificity and it's minor, but I would say the second further resolve that the City Council urges the city manager and probably acting city manager and appropriate staff to work with the Public Sector Unions Act.'",
        "'speaker_6': 'The City of Alameda Post a Janice versus ask me Supreme Court case decision by cooperating to mitigate impacts and by engaging in good faith discussions calmer which could include implementing membership cards and release time for rank and file union leaders to explain the implications of a Janice decision.'",
        "'speaker_6': 'And so that is a little less specific direction. And it also leaves open the possibility that there might be more things that items that need that could be addressed.'",
        "'speaker_2': 'It is.'",
        "'speaker_0': 'All right. I swear. Is it okay to have Vice Mayor speak you?'",
        "'speaker_6': 'I have a second question.'",
        "'speaker_3': 'I have a question.'",
        "'speaker_0': 'Yes, vice mayor.'",
        "'speaker_3': 'So my question is for the maker of the motion. When you say which could include these things, is your expectation that it that it would include those things that could include other things or that it.'",
        "'speaker_6': 'Says say that last part again, you're a little bit soft there and just repeat it again louder. What you just said.'",
        "'speaker_3': 'So my question my question is when you say it could include I can't really hear you counts Nebraska.'",
        "'speaker_6': 'Mutual I'm afraid. Should I come over to.'",
        "'speaker_0': 'If you can talk louder, then maybe she can hear you.'",
        "'speaker_6': 'Okay. Councilmember Avella, can you hear me?'",
        "'speaker_3': 'Yes.'",
        "'speaker_6': 'Okay. So the wording. I simply actually took out the word around and said, which could include. And the rest is in there. Right. And my explanation is that way we're not giving specific direction to staff, but that is one of the topics we're adjusting.'",
        "'speaker_6': 'And there could be others that maybe aren't contemplated because we haven't seen the decision yet.'",
        "'speaker_3': 'So so my question is as to the intent of what we're voting on. That it's not that it would not include those things.'",
        "'speaker_6': 'Absolutely.'",
        "'speaker_3': 'No, it would be thing.'",
        "'speaker_6': 'Which could include. Yes, absolutely.'",
        "'speaker_7': 'Then you took out the word negative.'",
        "'speaker_3': 'Would it be the same as saying which includes. But I didn't ask you.'",
        "'speaker_6': 'Is that what you're saying?'",
        "'speaker_2': 'Oh, she didn't. And she didn't read. Negative, but it's in there still.'",
        "'speaker_7': 'I was speaking over malice. I apologize.'",
        "'speaker_6': 'Oh oh. And I was kind of trying to hurry because I'm watching the clock, too. But yes, I did it so intensely. Yes.'",
        "'speaker_3': 'You know, when you when you make that change, you mean including. But not limited to.'",
        "'speaker_6': 'Which could include but not be limited to.'",
        "'speaker_3': 'I'm just trying to understand what you're saying, that basically instead of around, you're saying including but not limited to those two things. Correct. That's the intent.'",
        "'speaker_7': 'That's you know.'",
        "'speaker_6': 'It's the intent. I think the wording I mean and I'll just look to the city attorney. What?'",
        "'speaker_5': 'Well, I mean, frankly, I have to say that I prefer councilmember as the Ashcroft's version, because it isn't as directive, it says, which could include and I think the tenor of the previous resolved, along with the idea that we are supporting the unions what have you, but it isn't saying you must do these particular things.'",
        "'speaker_4': 'It says it could include these things.'",
        "'speaker_5': 'And it leaves the door open to even do other things.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_5': 'That it will help support the union's position if we say if instead you're changing it to say you have to do these things and anything else, then I think we're kind of back to where we started.'",
        "'speaker_6': 'Okay. So my motion stands and I believe I have a second though.'",
        "'speaker_0': 'Can you clarify then when she says it also means it doesn't have to include these things? I think that's right. But I think the.'",
        "'speaker_5': 'Intent is there, which is what the vice mayor's concerned about. I think the intent is clear in the previous resolved and and even in the further resolved that the notion is that we're trying to work with and support the unions in light.'",
        "'speaker_4': 'Of this this expected negative.'",
        "'speaker_5': 'Decision. But we're not directing what exactly has to be done to do that.'",
        "'speaker_6': 'Yes.'",
        "'speaker_7': 'I mean, one possible suggestion, because you had released time for rank and file union leaders to explain the amplifications. You could say. Include. Okay. What you said released Hammond rank and file comment. Depending on the implications of a Janus decision.'",
        "'speaker_6': 'Well, I believe that this resolution was actually compiled in large part with the assistance of the Army, the Labor Council. That's how and they're not similar. But but it is true that the Board of Supervisors is transit the city of Oakland to save Emeryville.'",
        "'speaker_6': 'And I believe the Port of Oakland either has or is about to vote on it. But the wording is just a little bit different there. I I'm I would like to see a vote on on this language.'",
        "'speaker_0': 'So can you clarify?'",
        "'speaker_3': 'Would you be.'",
        "'speaker_0': 'Go ahead. Here.'",
        "'speaker_3': 'Would you be willing to delete the word hood and just say which includes.'",
        "'speaker_6': 'No, for the reasons that were explained before. It's it's still it's still positive. It's just not specifically directive.'",
        "'speaker_3': 'Okay. Well, we have a motion and a second we do.'",
        "'speaker_0': 'So can you clarify when it says and release time for rank and file union leaders? Does the release time mean? What does that mean? Does that mean that that they they when they would get paid to go do this instead of their current job?'",
        "'speaker_5': 'That's correct.'",
        "'speaker_6': 'But for the leaders. Yeah.'",
        "'speaker_0': 'And how many union leaders do we have?'",
        "'speaker_5': 'I'm going to ask Nancy Brown, senior director, to come up and she can give you the details. Plus, she stayed here till almost midnight, so I want to make it worth her while.'",
        "'speaker_1': 'So we least time. I mean, we do that now for.'",
        "'speaker_5': 'Certain situations.'",
        "'speaker_1': 'And it's for our union leaders.'",
        "'speaker_5': 'To go meet.'",
        "'speaker_1': 'With the employees. I think with IBEW, we.'",
        "'speaker_5': 'Have two shop stewards who would get some time to go do this. We would work with Al on that and then ACA three. So that would also they would get time.'",
        "'speaker_0': 'Okay. So the release time currently is at negotiated though, but release time it's yet or is not is determined by usually the city manager who makes those decisions.'",
        "'speaker_1': 'There specific items that they're allowed.'",
        "'speaker_5': 'Release time on so to go meet and to confer to go negotiate and then.'",
        "'speaker_0': 'So do they already receive release time to do this under the current contract.'",
        "'speaker_5': 'They they re they do receive release time. It's it's probably a little more specific. This may be a little broader, but we work with labor to make sure to mitigate those impacts of somebody, you know, not being in the work site.'",
        "'speaker_5': 'So we'll work with them on that.'",
        "'speaker_0': 'So does this change then what we would normally do? Because this is actually my concern is I actually think that this is something that normally our for our charter but should happen is our city manager or you would be working this out with labor on your own without coming without getting direction from us.'",
        "'speaker_0': 'And thus, for whatever reason, which I don't think has ever happened during the time I've been mayor, you would come to us and say you need us to give you some direction. But I but I would think that doing so.'",
        "'speaker_0': 'So that's a a concern that I have in regards to council giving direction to the city manager of how to operate with staff per our charter, which is unique to us as opposed to you all just normally implementing the current contract.'",
        "'speaker_0': 'Well, one thing sounds like that's what you would be doing.'",
        "'speaker_5': 'One thing it's which could include.'",
        "'speaker_4': 'I mean, if we go with the change that's been suggested by the motion maker and seconder, I think that doesn't.'",
        "'speaker_0': 'Specifically direct.'",
        "'speaker_5': 'That it has to happen. That gives the.'",
        "'speaker_4': 'Flexibility.'",
        "'speaker_6': 'To the council I'm going to make. I thank you for all of your explanations. I'm going to make a motion to call the question.'",
        "'speaker_2': 'I'm second.'",
        "'speaker_7': 'Second up.'",
        "'speaker_6': 'Okay. I think we've got a two thirds vote there. Okay. It's been moved and seconded.'",
        "'speaker_0': 'She has to do a roll call on the motion to call the question.'",
        "'speaker_1': 'Councilmember, as I see. Yes. Hi, Spencer. Hi. Okay. That passes by five. Now the. Oh, yes, on the original question.'",
        "'speaker_7': 'Marilyn Marilyn's yes. Motion.'",
        "'speaker_0': 'And who made the second? Now. I remember Battersea.'",
        "'speaker_1': 'Council member as Ashcroft. I met Harris. Oh, yes.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Mayor Spencer. No.'",
        "'speaker_5': 'Can we just get clarification on what the languages. Oh, yes, that's everything is the same.'",
        "'speaker_1': 'I typed it while she did it. She added acting in front of city manager and then she just changed the word around to which could include. With a comma in front of it. I have it in the resolution.'",
        "'speaker_1': 'I typed it.'",
        "'speaker_5': 'Washington.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'So.'",
        "'speaker_7': 'My name.'",
        "'speaker_0': 'Okay. So it is now almost midnight here. That means is 3 a.m. or vice mayor is. So there's a professional courtesy to her. I actually do not plan to go forward with nine, eight and nine. Tonight I will kick those over to the next council meeting.'",
        "'speaker_0': 'Those are both my referrals.'",
        "'speaker_6': 'I think that's a nice and nice job.'",
        "'speaker_3': 'That's much appreciated.'"
    ],
    "Consideration of Mayors Nomination for Appointment to the Civil Service Board, Commission on Disabilities, Golf Commission, Historical Advisory Board, Housing Authority Board of Commissioners, Library Board, Planning Board, Public Utilities Board, Recreation and Parks Commission, Social Service Human Relations Board and Transportation Commission.": [
        "'speaker_0': 'I do want to make my nominations. She barely a I get to still do that separate so that we can proceed with that. So for civil services I'll be nominating.'",
        "'speaker_6': 'Are you going to do council communication?'",
        "'speaker_1': 'Yes. She's doing this.'",
        "'speaker_0': 'Under council communications. Okay.'",
        "'speaker_6': 'And then ten days before the rest of the council.'",
        "'speaker_0': 'Does board. Robert and Margaret Maloy. Commission on Disabilities. Elizabeth Kenny and Leslie Morrison. Of Commission, Edward Downey. Historical Advisory Board. There is an error here. There is. There are people that have applied for the one I will be nominating, Alvin Lao L, a U, who's a licensed contractor for the Housing Authority Board.'",
        "'speaker_0': 'I'll be nominating by sheer added tenants. Sandra Kay. Senior Tenant. Stuart Ricard. Incumbent and library board income. Incumbent. Amber Bales. And I'm not prepared to go for planning board or record parks Social Service. I'll nominate the two incumbents, Audrey Hyman and Sherry Youngblood.'",
        "'speaker_0': 'And I'm not prepared to go forward with Transportation Commission at this time. So that completes. I'm sorry. I'm already. I'm sorry, baby. I'm not prepared to go forward with that either at this time. So that completes my nominations at this time now.'"
    ]
}