{
    "Recommendation to Accept the Fiscal Year 2014-15 Audited Financial Statements and Compliance Reports. [City Council/SACIC] (Finance 2410)": [
        "'speaker_2': 'Thank you. So the 3D is, by the way, for the audience who may not have an agenda recommendation to accept the fiscal year 20 1415 audited financial statements in compliance reports. And I had a question or something that I just wanted to know a little bit more about from Exhibit one, which is the fiscal year 20 1415'",
        "'speaker_2': 'City of Alameda Comprehensive Annual Financial Report. Very nicely done, I might add. So my question is. On page 14. And it. This is where at the. Well, it looks like Roman numeral eight. But it's it will say page 14 of 205.'",
        "'speaker_2': 'And you're your iPad screen there. And this is about the EOC, the emergency operation center and fire stations three, which are underway. You can drive by and see that they're under construction. My question is, or it's more of a request that I would like regular updates on the city's emergency preparedness efforts.'",
        "'speaker_2': 'Just last week, if you followed the news, it was like earthquake week around the world because tragically we had earthquakes in Myanmar, southern Japan and Ecuador, and there's earthquakes followed by substantial aftershocks and a lot of, you know, loss of life, injury, damage to property.'",
        "'speaker_2': 'So what I said in my notes was that the building of the EOC, the Emergency Operations Center, is only part of the emergency preparedness for our city. It's a building with with functions that take place out of it.'",
        "'speaker_2': 'But even before that building is completed and, you know, we do the ribbon cutting and inhabited, we I still want to know that our city is is ready if we were to. God forbid that if we were to experience an earthquake.'",
        "'speaker_2': 'And I think just maybe yesterday was the 110th anniversary of the great San Francisco earthquake. So what I'm asking from city staff is can we and not so much you sit here, but can we have some regular updates maybe once, twice a year on the city's emergency preparedness efforts, where we are, what we've accomplished, what we still'",
        "'speaker_2': 'have to accomplish, how the public can get involved. That's my request.'",
        "'speaker_0': 'Yes, we can do that.'",
        "'speaker_2': 'Okay. And then the one other thing, as long as I'm here, this is just it's on actually the very next page of this report, which is page 15. And it talks about other business development highlights that cost plus world market headquarters are moving down limited by the end of this year and it'll energy.'",
        "'speaker_2': 'Some of us took a great tour of this clean tech company a week or so ago, and then also that the Alameda Landing Shopping Center continues to generate boosting activity in the west end of Alameda, contributing to the city's property and sales tax base.'",
        "'speaker_2': 'I just wanted to say, my husband and I had occasion to go out there this last Saturday night. It was a lovely evening and they're really doing things right out there. There's the restaurants and the ice cream place and frozen yogurt in the shops.'",
        "'speaker_2': 'Everything was open and bustling. Lots of families out strolling on these nice wide sidewalks. Everything's very clean. And it's just, as I was saying to one of the staff, it's kind of nice to see a development that actually looks like the renderings that were presented to us way back when I was on the planning board.'",
        "'speaker_2': 'So and if you haven't checked out Alameda landing yet, get out there and see what's going on on that into town. So those are those are my questions and comments. Thank you.'",
        "'speaker_1': 'Remember Day South?'",
        "'speaker_5': 'Yes. Thank you very much. I'm glad this item was pulled for the members of the public who have the time. I really encourage you to take a look at the Kafir, which is short for comprehensive, audited financial report, annual and comprehensive annual financial report, which is the city audit.'",
        "'speaker_5': 'And there's a lot of there's a wealth of information in there and there's a lot a new type of information that had not been in there previously or perhaps maybe I didn't notice in in recent in the most recent gaffers.'",
        "'speaker_5': 'But certainly when you compare the caf from the early 2000, the wealth of information is is quite abundant. In an earlier email this afternoon, I sent to the city manager's staff. I was I wanted to make several points, but one of the things that I really kind of want to just address was the on page 13, there's'",
        "'speaker_5': 'reference to the internal service fund and this is like a reserve of sorts for a variety of cost centers like the reserve for equipment replacement, essential services, worker's compensation insurance. And a lot of those and I am happy to report a lot of those have a positive balance and also as well as into the millions.'",
        "'speaker_5': 'But I just want to make sure that, for example, when we see that the internal service fund for equipment replacement is at $5.5 million, while in and of itself, $5.5 million is always good. Can we do we have any comparison?'",
        "'speaker_5': 'So 5.5 relative to some kind of benchmark that that we have in mind, are you able to report on that?'",
        "'speaker_6': 'Good evening, Mayor. Council members Eleanor Dare, finance director for the city. So the I looked into it because the question came in early. So there's no real benchmark. There's no necessarily a policy of the city that I'm aware of.'",
        "'speaker_6': 'However, the way we kind of look at it, one, you can't really compare all the cities at the same time together and just make them equal because it's really in this particular situation depends on the fleet that really what that fund represents within our city.'",
        "'speaker_6': 'And the way I look at it is what is the value, depreciable value of the life of these assets. So my test actually was to answer your question, what is the cost, how much those assets have been depreciated?'",
        "'speaker_6': 'And we had about 35% of it. So what that means is if you would have been at 50, you would have been right about in the middle, meaning you are replacing your equipment early enough, but not too early where you know it's too new.'",
        "'speaker_6': 'So we're at about 35%. So we're a little below, but we're not fully depreciating it. So which means we are renewing our vehicles and equipment.'",
        "'speaker_5': 'Wonderful. And that's not where the point of this is not for you to suddenly, you know, charge out all the percentages, which would be great. But it's just a note that that for the internal service fund, for many of the cost centers in there and I'll just name a few.'",
        "'speaker_5': 'Equipment replacement, essential services fleet, maintenance workers compensating for many of the cost centers. We have a positive number there, which is good for the workers compensation insurance where we are in the negative at $1.5 million. But but I suspect we can work on that.'",
        "'speaker_5': 'So that's basically the point that I want to just raise. Now, the other point that I just want to mention for the viewing public, should you ever get a chance to download, the capper is to take a look at, for example, page 67 of the capper.'",
        "'speaker_5': 'Page 67 shows the value of the infrastructure of the city of Alameda, the value of the street, the value of the sewers, the dollar value of sidewalks, and also includes a accumulative and an annual depreciation amount. So if anyone is so interested in finding out, you know, the streets that that we drive on or the sidewalks that'",
        "'speaker_5': 'we walk on or the parks that we play in, what is the economic value of that? It's all in the kafir. So go to page 67 for that. And finally, I want to end up by mentioning that on page 77, there is discussions about our pension plans and on page 87, there's discussion about that are CalPERS unfunded'",
        "'speaker_5': 'liabilities. Most interesting, though, is if you went to page 88, there is a sort of a stress test because the unfunded liabilities that are reported in on page 87 are partly a function of the return rates that CalPERS had had projected.'",
        "'speaker_5': 'So they are projecting roughly 7.5% return rates. And then that then has impacts on what is the unfunded liabilities with regard to the CalPERS retirement. And by unfunded liabilities, we mean on several things. On the one hand, for all the workers and the people who are retired, we have an understanding as to how much we need to'",
        "'speaker_5': 'set aside for their retirement. A, B, we also know how much we're actually how much dollars we actually have. So the difference between what we need to do and what we can with reasonable precision indicate how much we have.'",
        "'speaker_5': 'That difference is the unfunded liability. So how much we have to set aside is also a function of of the rate that CalPERS uses to the credit of the Kafir, which is, I think, perhaps maybe a new thing.'",
        "'speaker_5': 'There's also on page 87 indication that, well, what if instead of using an 8.7.5 rate of return for CalPERS? Well, instead of using the 7.5 rate of return and the unfunded liabilities that's generated as a result of that, what if CalPERS rate of return was 6.5% and then on page 88, then there is a corresponding unfunded liability'",
        "'speaker_5': ', which is even greater, which would be even greater. But the point, though, is that the information is here for the public to mull over and look at. So I just wanted to give a shout out to this report to your guys's great work.'",
        "'speaker_5': 'And I understand that our. Our auditors, a new auditor, too. So it was very enjoyable going through this report. Thank you very.'",
        "'speaker_1': 'Academy member.'",
        "'speaker_2': 'Ashcroft I'm happy to move approval. I admit that we recommend that we approve the recommendation to accept the fiscal year 20 1415 audited financial statements and compliance reports.'",
        "'speaker_1': 'All those in favor I motion carries unanimously. Thank you. I will now adjourn the Joint City Council and successor agency to the Community Improvement Commission. S.A.C.. I see. Now we will continue. But the regular city council meeting at 7:12 p.m..'",
        "'speaker_0': 'Roll Call has been noted. Five present.'",
        "'speaker_1': 'Thank you. Agenda changes. I will be pulling item five J and item six B has been resolve. The tenant and the landlord have reached an agreement that that item will not be heard tonight. O member J sort of.'",
        "'speaker_5': 'I will have to recuse myself from item five g so perhaps. Well, anyways, yes, I'll have to.'",
        "'speaker_1': 'But then I'll also be pulling item five G. Any other items? Thank you. Do we have a motion for the balance?'"
    ],
    "Presentation by Dr. Joi Lin Blake, College of Alameda President, on the College of Alameda Promise.": [
        "'speaker_7': 'Thank you for providing me with this opportunity to preserve this evening on the College of Alameda a promise. So I want to thank the Mayor Spencer and the City Council for providing me with 5 minutes to give our pitch and promote our program.'",
        "'speaker_7': 'I've provided a packet for each one of you that outlines a description of the Promise Initiative, the National Promise Initiative. And President Obama has a college for all campaign where he guarantee he wants to guarantee that all graduating seniors have two years of free college upon their completion of high school.'",
        "'speaker_7': 'And so that College of Alameda promise is borne out of that initiative. The purpose of the initiative is to ensure that we have a better educated America. And so the College of Alameda wants to be a part of that process and that movement.'",
        "'speaker_7': 'In your packet, you have the promise, the national promise campaign initiatives that are going on in the state of California, and then an outline and background and scope of the College of Alameda Promise program. To date we have at the College of Alameda promise our framework is going to be that all graduating seniors from Alameda High Schools'",
        "'speaker_7': 'will attend the College of alameda free for their first year. We're going to pilot this fall with Encino High School. We will scale up in at Island next year and then Alameda High School the following year. And then there's charter schools or whatever in Alameda that we'll bring them on board as we go along.'",
        "'speaker_7': 'Our promise will include not only payment of fees, but it will also include a $300 book grant. And then we have some organizations that are willing to provide each student with a refurbished laptop to bridge that technology divide.'",
        "'speaker_7': 'One of the. One of our concerns in Alameda, especially on the west side of the college, is when we look at the Alameda Point Collaborative and the transitional housing and the level of poverty in that area, is that one way for those communities to get out of that?'",
        "'speaker_7': 'Poverty is through education. And so the College of Alameda, we want to be responsive to that and support individuals in Alameda to ensure that they have a higher education. To date, some of our partners are Alameda Unified School District Assemblyman Rob Bond, his office supervisor Roma chan's office.'",
        "'speaker_7': 'CSU East Bay has guaranteed admissions for students as long as they meet the requirements. I met with the president there. UC Berkeley has a transfer admission pipeline, and so we will work with them to prep to make sure that students are prepared to participate.'",
        "'speaker_7': 'We're also Pur Force Foundation is providing funding for the initiative tenacity ten Lacrosse, which is one of our new partners at College of Alameda, gave us $500,000 seed money. So we're able to launch and kick off the initiative.'",
        "'speaker_7': 'Other interested parties are the Jack London soccer group, so they have expressed an interest to partner with us. Mills College wants to do a two plus two plus one where they spend two years at College of Alameda, two years at Mills, and then they will guarantee them admission into their first year of graduate school, which is a'",
        "'speaker_7': 'really nice opportunity. And then San Jose State is waiting for the new president to get on board and then we will work with them and their team to bring folks on. And so we have a we have right now we're at the beginning the infancy of the partnership, but we have enough to launch and get students started'",
        "'speaker_7': 'in participating in our program, and we're just really excited about it. When I first started here at the College of Alameda last year, this was kind of one of my visions or dreams for the college. And to show that we are committed to Alameda because folks have told me that we've been an island unto ourselves.'",
        "'speaker_7': 'And so I want to say I want the community to know that we're committed to them and their students. The students in the program will get intrusive counseling and support services. They will meet with a counselor twice a semester.'",
        "'speaker_7': 'If they're qualify for financial aid, they will be awarded that as well, and they will have an education plan to make sure they don't take empty units and that they're on track to transfer, get an associate degree or whatever their professional goals are.'",
        "'speaker_7': 'But we're there to support the students and the citizens of Alameda and their children. And we've prepared a video for your review. And we also have in your packet connecting with community, a brochure about our college and the programs and our student profile.'",
        "'speaker_7': 'And we're asking you this evening that the city would support the College of Alameda. Promise. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_8': 'A promise of education in next step to the future for Alameda High School, students starts with College of Alameda and Youth with a host of associate degree and certificate programs. College of Alameda provides high quality instruction in job relevant career training.'",
        "'speaker_8': 'Right here on the Island College of Alameda is offerings including our career. Technical education programs are unique with many of the programs offered few other places in the Bay Area College of Alameda offers education on a global scale.'",
        "'speaker_8': 'And to accomplish this, we joined a powerful initiative called the College Promise Campaign. The Promise program was inspired by President Obama's America's College Promise Plan with a vision to make the first two years of higher education free for all students who went to community college.'",
        "'speaker_8': 'The College of Alameda Promise models this program asserting that students success is greatly improved when financial barriers and the associated stress are removed. The College of Alameda Promise will provide priority registration one year of college without fees and a book stipend to graduates of Alameda High Schools who enroll full time at College of Alameda.'",
        "'speaker_8': 'The College of Alameda Promise was designed to serve Alameda residents with the most need of the nearly 10,000 students served by the Alameda School District. Many are English language learners, special education or low income. The promise will begin in fall 2016.'",
        "'speaker_8': 'Serving graduates of internal high in the Alameda Science and Technology Institute, the two schools that serve the highest need students on the island. It will expand to Island High in year two. In Alameda High near three. We anticipate that as many as 667 Alameda High School graduates will attend College of Alameda via the Promise program in the'",
        "'speaker_8': 'first three years. What kind of results do we expect up to? 20% more students attending college and a 30% increase in retention and graduation rates, specifically among at risk students. More students will transfer to further their educational goals.'",
        "'speaker_8': 'The promise will also strengthen students access to career pathways, helping prepare them to join the workforce in Alameda and surrounding areas. Funding for the promise is being generously provided by individual, corporate and foundation donors, and we're asking for local and state support as well.'",
        "'speaker_8': 'How can you help? We ask you to get involved, adopt the promise and support it in every way you can. We invite you to the campus, your campus, and look forward to achieving success together. We promise at College of Alameda.'",
        "'speaker_7': 'I know my 5 minutes are up, but I wouldn't invite the City Council and Alameda City to participate in our Promise initiative and I look forward to working closely with you. We have a meeting this Friday, the kind of finalize our launch.'",
        "'speaker_7': 'We're looking at our launch on either May 12th or May 30th, and we'll have the appropriate folks there to help kick it off, all of our partners, etc.. So again, thank you. Are there any questions or anything?'",
        "'speaker_1': 'Thank you. At this point, I think it's for us to move along because as opposed to be announcements. Okay. So thank you. And regards to us joining the College of Media that will come back to us at a later time.'",
        "'speaker_1': 'Okay. All right. Thank you very much.'",
        "'speaker_2': 'And I just want to say thank you. And that was it's really inspiring to hear how you're looking at the neediest of our students and and partnering with with the school district in this way. So thank you for continuing to be a valuable resource in our community.'",
        "'speaker_3': 'Hey, remember days.'",
        "'speaker_5': 'Out, I'll have you know that back in 1984, when I was a senior in high school at Encino, I did attend classes at College of Alameda with Miss Wise.'",
        "'speaker_1': 'Thank you very much. Now I'm going to proceed with item three Bee.'",
        "'speaker_0': 'Proclamation Declaring April 23rd, 2016 as Earth Day in Alameda.'",
        "'speaker_1': 'And Kathleen Carney of the Library Board will be accepting this and the proclamation. Whereas, April 23rd, 2016 marks the 46th anniversary of the first celebrated Earth Day, a day in which events worldwide are held to demonstrate support for environmental protection.'"
    ],
    "Recommendation to Approve the Webster Street Business Improvement Area (BIA) Annual Assessment Report; Adoption of Resolution of Intention to Levy an Annual Assessment on the Webster Street BIA of the City of Alameda for Fiscal Year (FY) 2016-17; and Set a Public Hearing for May 3, 2016 to Levy an Annual Assessment on the Webster Street BIA. (Community Development 227)": [
        "'speaker_2': 'I move that we approve the Webster Street Business Improvement Area Annual Assessment Report, Adoption of Resolution of Intention to levy an annual assessment on the Webster Street BIA of the city of Alameda for fiscal year 20 1617 and set a public hearing for May three, 2016 to levy an annual assessment on the Webster Street BIA.'",
        "'speaker_1': 'All those in favor by motion carries with one.'",
        "'speaker_0': 'Eye, and the council member only goes to get councilmember. If I needed to make one brief comment that I failed to make on the consent calendar, yes, there were revised plans and specs for five E which were posted to the website and there was just minor correctional changes.'",
        "'speaker_0': 'So just to clarify, was your motion to approve the revised version of the specs and everything?'",
        "'speaker_2': 'Yes, I'm sure it was removed.'",
        "'speaker_0': 'Right, right. Yes. Thank you. Okay, thank you.'",
        "'speaker_1': 'And item five J.'",
        "'speaker_0': 'Iv j is final passage of ordinance. Amending the Alameda Municipal Code by amending, adding and deleting sections of Article eight Sunshine Ordinance of Chapter two Administration concerning local standards to ensure public access to public meetings and public records.'",
        "'speaker_1': 'Thank you. And I pulled this item because this is actually coming back for the second reading. And the first reading I had opposed, vice mayor had also. And my concern was in regards to section two, Dash nine, 1.17 public comment by members of policy bodies.'"
    ],
    "Final Passage of Ordinance Amending the Alameda Municipal Code by Amending, Adding and Deleting Sections of Article VIII (Sunshine Ordinance) of Chapter II (Administration) Concerning Local Standards to Ensure Public Access to Public Meetings and Public Records.  (City Attorney 2310)": [
        "'speaker_1': 'And it includes language that I think could actually discourage members from speaking. Vice Mayor.'",
        "'speaker_9': 'Yes, I had similar concerns and I did not feel that these added any value to the Sunshine Committee or Sunshine Ordinance in instructing us and instructing people to follow it, as well as to improve the transparency of city activities.'",
        "'speaker_2': 'And the section was that, again, mayor.'",
        "'speaker_1': 'Had to dash 91.17 public comment by members of policy bodies. And I believe that there was also a language added by staff that the the Commission had not recommended. That being said.'",
        "'speaker_4': 'Member Thank you, Madam Mayor. I'd like to move a final passage of the ordinance amending Alameda Municipal Code by amending, adding and deleting sections of Article eight Sunshine Ordinance of Chapter two concerning local standards to ensure public access to public meetings and records.'",
        "'speaker_2': 'I. Second.'",
        "'speaker_1': 'Any discussion. All those in favor I oppose?'",
        "'speaker_8': 'No.'",
        "'speaker_1': 'I also oppose the motion carries 3 to 2. Thank you. Now we proceed with the regular agenda items.'",
        "'speaker_0': 'Six A adoption resolution amending the fiscal year 20 1516 Operating and capital improvement budget and approving workforce changes in the city manager's office and Public Works Department.'",
        "'speaker_1': 'Do we have speakers on this item?'",
        "'speaker_0': 'No. All right.'",
        "'speaker_1': 'So if you want to speak on this item, please turn on your slip.'"
    ],
    "Adoption of Resolution Amending the Fiscal Year 2015-16 Operating and Capital Improvement Program Budget and Approving Workforce Changes in the City Managers Office and Public Works Departments. (Finance 2410)": [
        "'speaker_6': 'Good evening again, Mayor and members of the council. Elaina Dare, finance director. So tonight, as you will see, we're going to take a look at the city's budget. As a reminder, the fiscal year 1516 budget was originally adopted about a year ago.'",
        "'speaker_6': 'Well, was prepared and then adopted in June 2015. Today, we're going to discuss the mid-year update to the 1516 budget. It will include General Fund, which will be probably the main focus, but it also provides some updates to other city funds.'",
        "'speaker_6': 'So the first slide you will see is really a summary of the general fund and we tried to build a story for you. The very first column you will see is a the adopted budget. That's exactly how it was presented to you back in June of 2015, and that's how it was adopted.'",
        "'speaker_6': 'Then during the year, actually up to now, we've made some revisions and you will see those listed in their revised budget column and those happened between September and March timeframe. The large one, as you may remember, when the budget was adopted, the concern was what should we do with the available balance within the fund?'",
        "'speaker_6': 'And then in September we got back and you have taken several actions on allocating some of those funds across various programs within the city. So tonight we're actually proposing additional amendments to the budget. And I'll go in detail through those as well.'",
        "'speaker_6': 'And the very last column, assuming those amendments are approved, that's where the staff is projecting to be for the general fund at the end of the fiscal year. So this is not actual this is a projection what we believe would be the best estimate at this time.'",
        "'speaker_6': 'So that said, we expect that by the end of the fiscal year, by June 30th, we will end up at about 24% of available fund balance for the general fund. Okay. So some of the items that you will see.'",
        "'speaker_6': 'First one we're going to talk about is property tax. So we're asking you to update the budget and increase property tax component of the revenues by $1.3 million. And really, the main component of that 1.3 is what we call the water fund waterfall funds from the Dissolution of Redevelopment Agency.'",
        "'speaker_6': 'What happens is once all the bills and all the obligations have been paid that the city put on required obligations, schedules, the remaining funds are then distributed among various jurisdictions and city is one of them. So we've gotten, I would say, a waterfall of funds from that.'",
        "'speaker_6': 'We originally expected it to be around 1.1 million. We're expecting to get probably an additional 750,000. This would be more of a one time funds. Again, those moneys are really dependent on what the obligations are of the redevelopment agency, and we provide those to the State Department of Finance annually starting this year.'",
        "'speaker_6': 'And so it depends on what the obligations are. We also had some small increases in other property taxes. So that made up the difference of 1.3 and about 750,000. Another revenue we would like to update is motor vehicle license fee.'",
        "'speaker_6': 'And Lou, that particular revenue has the same way of increase as the property taxes, even though it's called motor vehicle license fee. In lieu, it is collected through the property tax and as the property tax. GROSS So this particular revenue source as well.'",
        "'speaker_6': 'So our property tax went up and therefore we are getting a little bit more money on this particular revenue source. Property transfer tax. We would like to increase it by a little over $2 million. And again, this particular revenue source is.'",
        "'speaker_6': 'A reasoning for increase change in ownership. So the more homes are sold, new homes are sold and the appreciation, the home prices. So this is really a combination of the two.'",
        "'speaker_5': 'Just a quick question. Do you know if there is one or two projects that drove the $2 million in transfer tax increases? Or is it generally across the board that the appreciation?'",
        "'speaker_6': 'There were a few transactions that happened that were fairly large and more of a business to business type of transactions. But there were some properties that were residential and happened to exceed actually which keep track of those that are over $25,000.'",
        "'speaker_6': 'So there were quite a few that were in that amount.'",
        "'speaker_5': 'Great. Thank you.'",
        "'speaker_6': 'Okay. Utility user tax. So in this particular source of revenue, unlike the other three you just saw, it's actually a declining revenue source. So proposal for us, based on the receipts that we're seeing to date, we're actually suggesting to decrease this revenue source by $150,000.'",
        "'speaker_6': 'Again, we collect utility user tax on four different utilities, gas, electricity, telecommunications and cable. The major decrease is actually within the telecommunication services or attributable to that service.'",
        "'speaker_1': 'Can you be more specific about landlines? Is that what you're talking about?'",
        "'speaker_6': 'It includes variety. Yes. Landlines is one of them. So telecom kind of encompasses many different things and landlines is one of them. And landlines do decrease as people stop using landlines.'",
        "'speaker_2': 'And use cell phone. Is that correct?'",
        "'speaker_6': 'Get more use of the cell phones bundling services.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_6': 'Transient occupancy tax is actually going up and we're asking to increase it by about $220,000. And our consultant who helps us out with projecting the revenues, some of the larger revenues also mentioned to us that the rates, hotel rates are going up and were up about 13.2% from the same time frame compared to last year.'",
        "'speaker_6': 'So that really is increasing for us. The revenue source in this case. And the more people travel, the better the economy. We receive more revenues. Investment income. It has a slight increase, but we wanted to recognize that as well.'",
        "'speaker_6': 'That's the increase on our investment portfolio. So the increase again based on the market condition, but $30,000. Going into. So those were more of a general tax revenues. These are going to be now the departmental revenues. So we have variety of those as well.'",
        "'speaker_6': 'The largest one by significant amount, 655,000 increase is in the fire department revenues. And what it's made up of is mutual aid reimbursements from the state. The department is also doing a good job and doing inspections. They report their inspection fees are going up and the largest one is GMT reimbursement and it's ground emergency management transportation.'",
        "'speaker_6': 'And the fire chief is here in case you would like to get details on that particular program. But it's something the department is actually providing a service and then submits to the state for the reimbursement. It's fairly new program that was established by the state and we're expecting about $300,000 to receive back from the state.'",
        "'speaker_6': 'Okay. The next one is police department. We expect we actually already received an $80,000 grant. You may remember a while back, actually in 2015, around June, July timeframe, you approved the purchase of a boat, which was funded also by a grant.'",
        "'speaker_6': 'So we got the money and we're recognizing that particular grant public works department is actually having a decline or a reduction in the revenues, approximately $100,000. And the reason is decline in the fuel prices, therefore. It's going down.'",
        "'speaker_2': 'QUESTION Mr. Chair, can you just explain that? So how is it that a decline in fuel prices led to a decrease in public works department revenues?'",
        "'speaker_6': 'So the department actually. Gets buys the fuel, and then they charge it out to all the departments that end up using that fuel. So all in it's a charge to other department. And as a result, because the cost went down, they are not charging as much and therefore it comes back to them with the lower amount.'",
        "'speaker_2': 'But then, isn't there also a corresponding decline in the expenses of other departments that buy that fuel?'",
        "'speaker_6': 'Correct. Public works is kind of your central department. So once you start spreading it across all the departments, the changes are small where it wasn't really wanting to actually make an adjustment.'",
        "'speaker_0': 'Thanks.'",
        "'speaker_6': 'So this is actually our first. We told you that changes are happening and hear the words this time around, we actually giving you a picture. So hopefully a picture will worth a thousand words and it kind of gives you a more of a graphical presentation.'",
        "'speaker_6': 'The sources of funds are the how we receiving a where we're getting the revenues from and the uses of funds is where those revenues are actually being allocated too. You will see that the largest one by far is a transfer tax, which is talked about that.'",
        "'speaker_6': 'But with all the uses that we currently have, they're not nearly significant and we're still adding to the bottom line of the available balanced general fund of close to $3.3 million. So we also thought it would be important to kind of summarize for you some of the transfers out that we have.'",
        "'speaker_6': 'So obviously, we just kind of lumped them in some cases together and this gives you a little bit of a breakdown of the transfers out. The part of the requested amendments we're asking to allocate about $25,000 to Capital Projects Fund, and this is for the Dock Replacement Library, asked for an additional $15,000.'",
        "'speaker_6': 'And that and I'll go in a little bit of detail on that on all of those as we move forward. But Library is asking an additional amount for payment to their part time employees because of the wage increases that were effective January 1st and $575,000.'",
        "'speaker_6': 'You may remember back in September, you originally approved a transfer to cover the cost of building demolition at base reuse or Alameda Point. And we evaluated or actually the bases director validated that we didn't need those funds. And so we're returning them back to general fund.'",
        "'speaker_6': 'So this is again, it's actually a repeat of a slide, but on a budget update summary. This is more of of why this is what we just talked about kind of a glance. Again, this is what it looks like as a reminder.'",
        "'speaker_6': 'And one of the items that's always been asked is, well, what is the general fund balance? Because what we generally present to you is the available balance. So what is the total fund balance for the general fund? This particular presentation gives you an idea.'",
        "'speaker_6': 'It gives you all the components that we have within general fund. The total general fund balance is. $30.7 million or close to that. And so we have four components. And the largest by far is the available balance. And that's what we like to refer as 20%.'",
        "'speaker_6': 'That's the our mark sort of speak. But the reality is, as we said, by June 30th, our expectations will be at 24% of total expenditures of the general fund. So that in a nutshell is the general fund and the changes to it.'",
        "'speaker_6': 'So now we're going to talk a little bit about all the other funds that are asking for changes. As I've mentioned earlier, library is requesting $15,000, which is the wage increase effective January one, 2016. And that was not something that the city decided to do.'",
        "'speaker_6': 'This was a state enactment or law, and so we're just complying with that. In addition, the library received a $23,000 grant, and that's for library materials. So library is asking to adjust its revenues and expenditures, but $23,000. Base for use.'",
        "'speaker_6': 'Increase in leasing revenues of 871,000, which is actually offset by a contractual services for a payment to the consultant that assists the city. And actually within their base of use areas in Alameda point with those leasing activities. And again, you will see an adjustment here.'",
        "'speaker_6': 'This is the other side of the transfer that's being reversed on General Fund for the contribution for building demo. Rent Stabilization Program. You may remember that you have adopted or approved an allocation from general fund, $300,000 for the rent stabilization costs.'",
        "'speaker_6': 'A lot of them actually majority of them go to housing authority for the operations and management of this program. We are asking to actually appropriate it now within the rent stabilization program. We've made the transfer out of general fund.'",
        "'speaker_6': 'This is more, I guess you would say, an accounting reason so that we have the ability to spend the money. Again, $80,000 covers contractual services within the city, which actually includes the fee study. And 220,000 will go to the housing authority.'",
        "'speaker_6': 'Alameda lending. We're asking to increase Alameda lending funds expenditures by $34,000. And the only reason is we missed that particular budgeted item during the regular budget season. It was a brand new fund, so it was really just an omission.'",
        "'speaker_6': 'But we have to bring it back to you for the approval. Arbor Bay Assessment District A. An additional increase in the budget for payment to the wedo for ferry services. Capital improvement projects. I've mentioned earlier, $25,000 for the install dock replacement.'",
        "'speaker_6': 'There are three additional ones and I just noted them as really the accounting changes. Particular reason is this particular funds were included as part of the governmental funds. However, they are more out of a restricted sources, so we're just trying to put them in the right bucket.'",
        "'speaker_6': 'So there's no dollar changes. It's just simply moving it from one fund to another. Vehicle replacement. We're asking to increase the revenues and expenditures in a vehicle replacement, $130,000. And again, the expenditure is to do the ambulance remount funded with the proceeds from the bowls ambulance.'",
        "'speaker_6': 'One of the items that the fire chief brought up is a way to assist paying for ambulance remount. And one of the ways was he looked at B-list ambulances that a program that stopped it was a pilot program.'",
        "'speaker_6': 'However, likelihood of restarting is going to be a little bit of time. By then, these particular vehicles would probably be outdated. So while they still maintain the value, the thought is to sell it and actually use it for something that the city can utilize.'",
        "'speaker_6': 'And $30,000 is to purchase a park maintenance truck. Again, one of the trucks that the city had was in the accident and funds by really insurance proceeds partially and also the reserves that are within the Parks Department contributions that already happened.'",
        "'speaker_6': 'Superfund. The Department is actually proposing to reduce the assessment revenues. You may all know that the sewer assessments are collected through the property taxes. So those are the assessments that we're trying to reduce by $1.9 million. Original budget, when it was put together, was done actually before the sewer fund fee study was completed.'",
        "'speaker_6': 'And. This is an adjustment to pretty much be in line with the fee study report that was done. Just as a note, the department's expectation because the fee study was done with assumptions of whatever the revenue supposed to be, wasn't relied on what the budget necessarily said originally.'",
        "'speaker_6': 'All the EPA decrees that require us to do so were replacement. They were still calculated into what the revenue was expected, not the one that was actually in the budget and therefore they're still expected to be on time and have sufficient collections to do the replacement.'",
        "'speaker_6': '$622,000 was actually a revenue increase and this is in the connection fees. I consider those more to be of a one time type of source of money. As you have new development, you get the connection fees. They're not necessarily repeating all the time.'",
        "'speaker_6': 'And again, sure, project capital projects where we for accounting purposes moving to were related projects back to the sewer fund. And if you have any questions, I'm here to answer them as well as the stamp.'",
        "'speaker_1': 'All right. The first question I have is the presentation, as far as I could tell, went with the budget. And there's a second part of this item that we're being asked to approve workforce changes in the city manager's office and public works department or someone else to be addressing that part.'",
        "'speaker_6': 'I can address that. So and I was my right. I apologize for that. So there are a couple of changes that are happening. And one of them, as you mentioned, within the city manager's office, the. I.t. Director original allocation was to be funded half and half between general fund and alameda municipal power.'",
        "'speaker_6': 'However, when the director actually came on board and. Pretty much evaluated the work and amount of work and what needs to be done between the city and Alameda Municipal Power. It was determined that there won't be as much time be spent and allocated to AMP.'",
        "'speaker_6': 'Therefore, the Department is requesting and an adjustment in allocation of the salaries which is going to be changed to 25% AMP and 75% General Fund. And the second one is for public works department. The department is proposing to upgrade the position of program manager one to a program manager two.'",
        "'speaker_6': 'And really, this is based on the need of the department, the program manager, to give us a little bit more responsibility and supervision. We're program manager one duties do not encompass that. And for just operational needs, that position is more appropriate.'",
        "'speaker_1': 'And what is the dollar amount for the I.T. director that's shifting from AMP to the general fund?'",
        "'speaker_6': 'There won't be any impact actually for 15, 16 fiscal year. And the reason is the position was expected to be hired in September of 2015. However, because the hiring didn't actually happen till early spring of 2016, what happens is there's sufficient savings from that position that we're able to cover the cost for additional 25% that's been paid'",
        "'speaker_6': 'out of general fund in 1516. In 1617. As we go through the mid-cycle update, we will provide you 16, $17. What's the difference in the position?'",
        "'speaker_1': 'All right. Thank you. A member Ashcraft.'",
        "'speaker_2': 'Thank you and thank you, Mr.. Nice presentation, as always. I had a question on page four of the staff report and this is when we're talking about. Up at the top of page four, it says that the police department expenditures budget is proposed to be reduced by $450,000.'",
        "'speaker_2': 'This decrease is to recognize the labor savings due to difficulty in filling vacant positions created as a result of retirements in the department. So my question is how will we address adding back the money into the LAPD budget when suitable recruits are found and hired?'",
        "'speaker_6': 'So in each fiscal year we and we did it actually for 1516, we worked with the department to determine what their expectations are in actually hiring new personnel or additional personnel to fill their vacancies. That said, we've already assumed certain savings.'",
        "'speaker_6': 'If you may remember, back in June, actually about half a million dollars for the general fund in savings from the position not being filled. A lot of them were actually for APD. So what happens is even though the department is filling the positions, they actually had quite a few retirements this year.'",
        "'speaker_6': 'Sometime in December, I believe that wasn't exactly expected. And the feeling of positions subsequent to that is not happening as fast as they would like. So what happens is it created additional savings to the department. So when we go into 1617, we still budget at the authorized position level unless the department tells us that we having issues'",
        "'speaker_6': 'are filling the positions and then we'll rely on some of the savings.'",
        "'speaker_2': 'Okay. So this is a one time savings in the local level. They're not going to be able to fill those positions until the fall or the next fiscal year.'",
        "'speaker_3': 'Correct.'",
        "'speaker_6': 'They're actually expecting to feel quite a few positions this year, but it still is not fast enough to fill them all. And we still have savings.'",
        "'speaker_2': 'Yeah, because we're getting coming to the end of a fiscal year, aren't we? Yeah. Correct. All right. Thank you.'",
        "'speaker_1': 'Vice Mayor.'",
        "'speaker_9': 'I have two questions. The first is if you could elaborate a little bit more on the impact of the overstatement of almost $2 million in sewer fund revenues, that the line and the staff report says that in spite of this, we should be able to hit the target.'",
        "'speaker_9': 'How do we lose $2 million of revenue and still hit the target for replacement? If if that can be explained and then this the second is. When we approved the budget last year. We approved a two year budget this year budget.'",
        "'speaker_9': 'This year's budget was in the in the positive about. I think it was $1.2 million. And then next year's budget is supposed to be in the negative by one point. Uh, it was. Well. So we're, we actually actually a little bit more.'",
        "'speaker_9': 'So there's a small deficit if you look at the two years and then I see the trend in, in police and I have the same concern that Council member Ashcraft expressed about. These one time savings, if you will, and I understand adjusting the budget to looking backwards, but looking forward, we're going to have an increase there or'",
        "'speaker_9': 'at least have the same amount so that you answer that question, we'll have the same amounts will be able to staff fully. I also look at the trend for the fire department and we went from an 800 addition to the budget in our mid-year cycle and now we're almost a million over.'",
        "'speaker_9': 'So how does how do we continue to do that and face a budget in our next year that's going to have a deficit? And that's a rhetorical question. I'd like us to come back and resolve that because we're not going to be able to sustain that if that trend continues as.'",
        "'speaker_9': 'Is that accurate?'",
        "'speaker_6': 'Well, one of the items for the fire department actually is even though the increase in the fire department budget is large, a lot of those expenditure increases are offset with the revenues that the department is bringing in. So it's almost like you have to look at the net impact of the department and on the department's budget.'",
        "'speaker_6': 'And the net impact is actually just to let you know, is is under 357,000. Correct.'",
        "'speaker_9': 'But. Even even so when we look and some of those were one time right and and temporary they're not continual except for that transfer of the GMAT. Correct. That's a pilot program or is that that's a new program.'",
        "'speaker_6': 'That was a new program that was established by the state. And so department actually has to ask for reimbursement. So the services happen, they have to ask for reimbursement and the state is actually paying back. So this is something that already happened and it wasn't actually quite expected.'",
        "'speaker_6': 'It's fairly laborer's, as I understand, and I'm sure fire chief can speak to that as to what information needs to needs to be submitted to the state. And they actually review it fairly closely as to what type of.'",
        "'speaker_6': 'Operational indicators they actually have to provide in order to receive a reimbursement. So and I would like to maybe ask the.'",
        "'speaker_9': 'But needless to say that that trend, looking at a second year of the two year budget that projects a deficit. I'd like us to get a full report on what we're looking at. Are we looking still at that $1.2 million hole, or are we going to adjust our revenues knowing what's been built?'",
        "'speaker_9': 'To recalibrate that second year of this two year budget.'",
        "'speaker_6': 'And we are we are going to bring back mid-cycle update for you, which really looks at two fiscal year 1617 and it's expected to happen in June.'",
        "'speaker_8': 'Thank you. Okay.'",
        "'speaker_1': 'And Brody with your questions there.'",
        "'speaker_9': 'Mr. Galan's going to talk about.'",
        "'speaker_3': 'All right. Yeah.'",
        "'speaker_8': 'All right. Madam Mayor, members of the city council. I'm Liam Galan with the Public Works Department. Yes, I can understand that. You might have taken a deep breath when you saw that. What was happening is we had two processes going on at the same time.'",
        "'speaker_8': 'We had the cities adopting a budget and then we had at the same time setting sewer rates for the next five years. And the mistake I made was not having those sewer rates set enough far in advance so we could plug in that revenue number in the final adopted budget.'",
        "'speaker_8': 'So none of the work plans we've developed, including that the five year study was based on 20 years worth of work and the financials related to that, none of that work dependent on this placeholder number in the budget.'",
        "'speaker_8': 'So it's the rate study number that really is the it's the real money. And for that, there's no changes whatsoever that's on target because that makes sense. Thank you. Okay. Thank you.'",
        "'speaker_1': 'Remember?'",
        "'speaker_4': 'I think the question I had was just answered about, you know, what the next steps are when we're going to get an update again. And just to make sure that as we get that update, you know, we see kind of the big picture.'",
        "'speaker_4': 'We're looking at these very minute like maybe quarterly nine month numbers, but not seeing like the yearly picture, the five year picture.'",
        "'speaker_6': 'And that information will be included. It's going to have the general fund for the full fiscal year with all the updates, whether it's revenue related or expenditures related. We'll obviously include the update on the labor costs, which is the largest.'",
        "'speaker_6': 'But as you mentioned, we are looking at the revenues as well. And it's going to come back to you. It's going to be a full fiscal year. And in addition, with the five year projection.'",
        "'speaker_4': 'And, you know, has is our request, usually we can just make sure we know what's one time, you know, and what things we're going to have to think about that are going to be recurring.'",
        "'speaker_1': 'Remember Daisuke.'",
        "'speaker_5': 'Well, thank you. When I look at the. More extensive sheet, not the PowerPoint presentation, but the other exhibit one. The Budget summary Yeah. When I look at the budget summary, the thing that catches my eye is based upon what we adopted in FY 1516 that we adopted on July 1st, 2015, and then that was subsequently revised in'",
        "'speaker_5': 'the following September through March period. And then that subsequently revised even more, which is the point of tonight's discussion at the end. You are projecting a 24% reserve ratio. Okay. And to me, I like that number and. And I want to say that because.'",
        "'speaker_5': 'You know how while we had a really high reserve ratio previously of 38%. And there was, you know, great desire to move, to bring it down to 20%. I think the thing to think about any reserve ratio is that it's not like a thermometer in a house.'",
        "'speaker_5': 'It's not like you can set your hair thermometer and then, you know, your house will be of a certain temperature. The reserve ratio instead. It's a byproduct of all these transactions. And on the revenue side. Revenues that come in or perhaps don't come in at.'",
        "'speaker_5': 'But on the expense side, holding down expenses. So I like the fact that we're above the 20% ratio and I have no desire to. Now go down to 20% just because 20% is some some number. I won't argue with anybody that 38% was high.'",
        "'speaker_5': 'But I think, you know, we should. Position ourselves against thinking that we can be engineers, that we can engineer a permanent 20% ratio. It'll always be something north or something south. But we want to have a certain target.'",
        "'speaker_5': 'And I think at 24%, there's a certain cushion. Between 20% and 24%. That makes me feel comfortable. Um. I just wanted to make sure to note that because to get to where we are, I mean, we did spend a lot of money our previous reserve amount.'",
        "'speaker_5': 'And I'll be the first one to say, hey, that helps pay for the. That's a citywide transportation strategy. So I'm not going to bite the hand that these but that you know, I always am cautious that, you know, you're lucky to have whatever ratio, reserve ratio you have and the higher the better.'",
        "'speaker_1': 'All right at this time.'",
        "'speaker_2': 'I'm sorry.'",
        "'speaker_1': 'Thank you. My questions go to first of all, in regards to when we vote on the adoption of the fiscal year amending the fiscal year budget here, does that have to be today?'",
        "'speaker_6': 'Well, we prefer to be for it to be today because some of the departments kind of relying on their. Budget to be set for expenditures so they can move forward with their programs or projects that they have in place.'",
        "'speaker_2': 'We were also supposed to hear this two weeks ago.'",
        "'speaker_1': 'I'm sorry, that wasn't my question. But what is your state that you need this voted on by? Or is there a certain date?'",
        "'speaker_0': 'It we wanted it voted on as soon as possible. So the departments know for the last couple of months in the fiscal year how much their budget is going to be, otherwise they can't go forward and do the projects that they're intending to do.'",
        "'speaker_1': 'All right. So there doesn't appear to be a date certain. So I'm going to continue with my questions. Then on here. The library is asking for an increase because of the increase in minimum wage. I didn't see that reflected in other departments, for instance, REC and Parks.'",
        "'speaker_1': 'What about other departments that have employees that are at the minimum wage level?'",
        "'speaker_6': 'So with Park and Rec, they actually expected in their rates an increase. And so that was already calculated in their budget. Unfortunately, library did not take that into consideration.'",
        "'speaker_1': 'So out of all of our departments, the library is the only one that will require an increase to cover the increase in the minimum wage.'",
        "'speaker_6': 'Correct. If the other departments needed additional funding, which some of them have asked for it, they had sufficient other appropriations within their departments to cover those increases. So they don't ask for an additional money.'",
        "'speaker_1': 'Okay. What about the items that were in our parking lot? Because this has some new items and yet we had had as a council a parking lot. When does that come back to us for funding or.'",
        "'speaker_0': 'That's tentatively coming back right after the legislative break of September, when we have a better idea of what the close of the fiscal year budget is going to be.'",
        "'speaker_1': 'So why are these and why are these requests given a priority over requests the council had had in the past? For us to look at.'",
        "'speaker_5': 'I can answer one question. One answer to that question just one is the necessity of funding the rent program. That correct. So rent.'",
        "'speaker_0': 'Stabilization.'",
        "'speaker_5': 'Rent stabilization programs.'",
        "'speaker_0': 'Madam Chair, if I might just ask, question and clarify because. So I participated in the parking lot discussion and that was last September. And that parking lot discussion, my understanding was that that discussion was concluded. And I'm I am not aware of other parking lot issues that we're tracking right now.'",
        "'speaker_0': 'So maybe if you could help us understand what you're referring to. Because I'm not aware of any other parking lot issues.'",
        "'speaker_1': 'Okay. I thought that there are items on the parking lot. I'm thinking Alameda Museum may have had a request.'",
        "'speaker_0': 'And we had.'",
        "'speaker_6': 'The art.'",
        "'speaker_0': 'I'm sorry to interrupt.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_0': 'We did have a list. And, you know, we had a fair amount of money and we made sort of decisions where that money was going to go. And some places we said no. And that may have been one of them, which was, I think you're thinking in the Carnegie.'",
        "'speaker_1': 'No. The Burmese army to museum. I thought they might have been asking for money, but I think that we spent some money at that time and the other items we didn't necessarily fund because we didn't know if we'd have money to fund them.'",
        "'speaker_1': 'But now we're being asked to make other expenditures. So I personally would have thought, and I'm happy to, we can review the parking lot and see what items on there. Weren't funded thinking we didn't have money to fund.'",
        "'speaker_1': 'But there's new items here that are being raised, and I would have thought that they would we would consider them all together because we didn't fund everything. On the parking lot is my recollection. So and then also in regards and I want I want to move on because we also received some emails in regards to these items'",
        "'speaker_1': 'and one of them spoke to the army to police department reduction. And the commenter here seemed to think that you had concerns that we do have a need for increased police, for instance, on the street, patrolling for more visibility, doing to help residents feel safe and comfortable in the neighborhood shopping districts.'",
        "'speaker_1': 'More officers could be used to increase community outreach and community building and more interaction with you, things like that. And did you have a response in regards to that?'",
        "'speaker_6': 'So again, we did work with the police chief and the captains in figuring out what their budget would be and if they have the ability to fill their positions. Unfortunately, trying to hire a police officer, the recruitment is quite a challenging process.'",
        "'speaker_6': 'It's not like hiring somebody for finance or public works. Unfortunately, even though I look for the best people.'",
        "'speaker_3': 'You know.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_2': 'I already got the.'",
        "'speaker_6': 'We all look for the best people out there. But police certainly has a different standards. They look at certainly greater details about the people when they hire them. So their success rate in hiring hasn't been as good as they really wanted it to be.'",
        "'speaker_6': 'They're doing it for them currently as a continuous recruitment. So it's not like they just open and close it. It they really they receive applications every day and they try to do their interviews, preliminary interviews weekly if not biweekly.'",
        "'speaker_6': 'I'm not sure.'",
        "'speaker_0': 'If that.'",
        "'speaker_6': 'The chief, I'm sure, talks to the city manager and gives more details on that. But we have to talk to the department and that was their expectation. They want they certainly wanted to hire everybody and fill all the positions yesterday, but unfortunately, that's just not working out for them.'",
        "'speaker_1': 'Okay. So at this point, our city does need people to apply to be police officers and applications are being accepted currently. All right. So I think that's important to share and that that is part of the issue then.'",
        "'speaker_1': 'So will we actually have fewer officers on the streets during this time because of these retirements and not being able to fill these positions, but in practice that have on our community.'",
        "'speaker_6': 'Or the patrol?'",
        "'speaker_2': 'I'm not sure that's a fair question to ask of the finance director, is does the city manager and assistant city manager want to step in every city to different areas? And here I would just throw in my $0.02 worth.'",
        "'speaker_2': 'There's a reason we have a high quality police department because we do go through a very stringent recruitment and assessment evaluation.'",
        "'speaker_1': 'A member and I appreciate that, but I think staff could. So I'm asking the questions right now. If you could hold off, if you feel uncomfortable, I'm happy to hear from someone else.'",
        "'speaker_0': 'Okay. So, Mayor.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'So the police department, as the finance director said, is recruiting. They recruited and one person through that was going through the police academy did not continue on. And so there are actually one position short than what they hope to be, but the police chief is going to do continual coverage of officers and he is not asking for'",
        "'speaker_0': 'additional officers. He's just trying to fill the positions that have become vacant. It's not unusual. It's actually a typical thing that you're constantly replacing police officers as there's retirements and I'm going to other departments. But it is a it's not an issue that the police chief raised as something to be addressed tonight.'",
        "'speaker_1': 'So I appreciate hold on. I want vice mayor. Yes.'",
        "'speaker_9': 'Isn't the point, though, that. The $450,000 delta, the reduction between now and June has no impact. We're looking for impact. Like if it has no impact, they can hire somebody now. They have enough money to get whatever done it has.'",
        "'speaker_9': 'Is that correct?'",
        "'speaker_0': 'Yes. It's salary savings from previous.'",
        "'speaker_1': 'So we did receive this email which was shared with staff in advance. And I think it's important to answer the questions posed by our community. And it doesn't have to be, but I think it is important that these be addressed.'",
        "'speaker_0': 'And we we read that and I talked to the police chief about that particular email, and it was actually a compliment of the police department as, first of all, thanks for the savings. Second of all, we want to make sure I think the misinterpretation of that is that the funds meant a decrease in services, and we haven't'",
        "'speaker_0': 'done that. We just had salary savings previously.'",
        "'speaker_2': 'And I have a question for Mr. Himax. So the implication of the email the mayor read or alluded to seemed to suggest that we're somehow not fully staffed on a shift. But that's not my understanding.'",
        "'speaker_0': 'That is not our understanding at all. It's we meet the minimum police requirements for staffing.'",
        "'speaker_1': 'So actually, I would suggest that this email suggests that we could have greater police visibility and out and on the streets. So that I want to share with you, I think it's appropriate to consider at least when this is showing a reduction.'",
        "'speaker_1': 'The next email I want to speak to was regarding the fire department and that in the past it was commented that we would be exploring of them reviewing the fire department expenditures or staffing. Is my recollection actually staffing?'",
        "'speaker_1': 'Do we anticipate that that's going to be coming back at some point?'",
        "'speaker_0': 'The. Our chief.'",
        "'speaker_8': 'Good evening, Madam Mayor. Council Member City Staff. Dugong. Fire Chief. So what was the stuff in question? I'm sorry, Mary.'",
        "'speaker_1': 'It's my recollection. And there's an email as to this that was also shared with staff in advance that in the past there had been discussion by counsel and in regards to revisiting or looking at staffing as my recollection of the fire department without review, without repeating the entire email.'",
        "'speaker_1': 'And I thought that that was going to come back to us at some point.'",
        "'speaker_0': 'I you know, that's something that we can look at. I think the couple of times that we've had this conversation, I think the last time we had this conversation was on Safer grants. And I think we decided that we were not going to have that conversation.'",
        "'speaker_0': 'So, you know, I think, Chief, and I think you do that and say if this is if that's the will of the council, that's you know, that's something that we can that we can bring back. But I think at this.'",
        "'speaker_0': 'There hasn't sort of been that general consensus direction to staff about about that.'",
        "'speaker_1': 'All right. The next time. So. Thank you, Chief, then.'",
        "'speaker_2': 'Oh, it's nice to see you.'",
        "'speaker_3': 'That's.'",
        "'speaker_1': 'Okay. And then. Okay. So those are my my questions.'",
        "'speaker_3': 'We remember, Audie.'",
        "'speaker_4': 'And are subject to any additional comments, I'd like to move adoption of the resolution amending Fiscal Year 1516 Operating Capital Improvement Program Budget and approving workforce changes in the city manager's office and public works departments.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'And I would request that that be separated into bifurcate into two separate motions.'",
        "'speaker_2': 'We have a resolution. Can we hear from the city clerk what that would do to us? And that's a request. Is that something we vote on?'",
        "'speaker_1': 'That's a friendly, friendly wash.'",
        "'speaker_2': 'She wants to buy for.'",
        "'speaker_1': 'Kate, and I would like it to be too much there.'",
        "'speaker_3': 'Either a friendly amendment or a substitute motion that would have to be seconded.'",
        "'speaker_0': 'And just to answer, Councilmember as the Ashcroft's question, I don't know what the bifurcation would be. It would maybe be back hitting the two now, therefore, be it resolved sections and then.'",
        "'speaker_2': 'At this point certified. I think we're just seeing if we have a second.'",
        "'speaker_5': 'What's the.'",
        "'speaker_1': 'So the and approving workforce changes. I thought that that should be a separate vote. As opposed to being included with the fiscal year operating and Capital Improvement Program budget. During no second. I'm going to go ahead and proceed with the any comments on the motion?'",
        "'speaker_9': 'I would like to make the comment. I do think it's important. When we because two items came up on the largest expenditures in the in the general fund there was. And we had comments from the public on their comments on the state of the police department budget and the state of the fire department budget.'",
        "'speaker_9': 'And I know what we've voted for in the past, but I would like to make sure that we evaluate those. And I think, if I'm not mistaken, the chief had talked about reallocating staff and the ambulances on Bay Farm Island.'",
        "'speaker_9': 'I think that's still worth talking about, especially in light of looking at whether we are and we not. One will find out in June a deficit in the second part of this, in the second part of this two year budget.'",
        "'speaker_9': 'So I think it's very important that we actually do look at the largest portion of our general fund, the police department, the fire department, the trends, and then what that second year looks like and can we sustain it?'",
        "'speaker_9': 'And I think that was the discussion that was alluded to in that one email.'",
        "'speaker_3': 'Right. And I.'",
        "'speaker_2': 'But you're not referring to the motion to buy. Forget the.'",
        "'speaker_9': 'Work. No, no, I'm talking about.'",
        "'speaker_2': 'That's a good direction to staff to.'",
        "'speaker_9': 'Put in this motion so that we're set up for having that evaluation and discussion when it comes time to looking at the second half of this two year budget.'",
        "'speaker_1': 'Okay. And I want.'",
        "'speaker_4': 'That because I'm confused where the deficit.'",
        "'speaker_0': 'Is.'",
        "'speaker_4': 'I'm confused about a deficit. Well.'",
        "'speaker_9': 'It's from the.'",
        "'speaker_4': 'Movie.'",
        "'speaker_9': 'From the two year budget. The first year was projected at $1.76 million, $1.176 million surplus in the budget. F Y 15, 16 and FY 1617 had a $1.229 million shortfall.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'But on the.'",
        "'speaker_9': 'Yeah. We passed a balanced budget sort of.'",
        "'speaker_0': 'Right.'",
        "'speaker_4': 'But the numbers we're seeing today are actually an improvement over what we adopted back last year.'",
        "'speaker_9': 'Yes, but I want.'",
        "'speaker_8': 'To.'",
        "'speaker_0': 'Show the numbers that if they're approved, tonight will change the. We'll come back when the mid-cycle and we'll have updated revenues and updated expenditures. And that change might, you know, the deficit and the shortfall in the surplus might be different.'",
        "'speaker_0': 'And so we'll report on that. As far as the police and fire, if there are issues with I mean, we could do some calculations on what the trends are and growth. Is that what you're. Yes. Talking about for police and fire, both for personnel and revenues and expenditures?'",
        "'speaker_0': 'Yes, exactly. But just big picture, sort of like what we do at the CAF or is data that shows trends.'",
        "'speaker_9': 'Yes. And any time we're beholden to the state, I worry because when the budget bursts, the state is the first to pull back.'",
        "'speaker_0': 'Right. So we'll include the, let's say, for grant information and say for Grant.'",
        "'speaker_9': 'Yes. That's another one that as long as the economy is rolling along, the state is fine. But we all know what happened when the economy adjusted. And I just want to make sure that we're not setting ourselves up for another fall.'",
        "'speaker_5': 'Madam Mayor, if I can just quickly say, I think former council member Doug Duncan used to say it well when he would say to make sure to keep an eye on the what he referred to as the out years.'",
        "'speaker_5': 'So I think that's part of what we're talking about is not just looking at the amendments that we're contemplating this evening, which is to get us to the end of fiscal year 1516, but to also contemplate when we begin the discussions for the new cycle of two year budgets, not only looking at that particular cycle, but the'",
        "'speaker_5': 'out years beyond. 16, 17. 17, 18. And but that's the practice that that we've done quite frequently.'",
        "'speaker_1': 'And it was my understanding that we would see a longer term that go out five years or even more than that because we have been approving contracts. And it's my understanding that we would see projections of farther and I would say five years is actually the minimum because I think we need to see at some point ten'",
        "'speaker_1': ', 15 years. But whenever we're going to hit them all, if there's going to be a wall hit where where we are long term. And I think that was actually agreed upon with staff that we would see a longer term projection.'",
        "'speaker_0': 'With the understanding. I mean, five years is typically what you go as far out as you go to, because after that it is anyone's guess, especially with the volatility of the economy.'",
        "'speaker_4': 'So yeah, I mean, I agree with most of the comments, you know, being said and I think that's kind of what I shared in the questions that I wanted to see how this looked long term. But I just want to make sure that, you know, we're not creating a false narrative out there that the city is running'",
        "'speaker_4': 'a deficit because we have a two year budget cycle. And over that two year budget cycle, we're not running a deficit. And for the first year of that two year cycle, we've actually added more revenue over expenses and we've actually increased our fund balance.'",
        "'speaker_4': 'So, I mean, I know you can pass and you can pick and you can choose and whatever statistic you want to say, it probably fit whatever narrative you want to say. But I just want to make sure we don't get it out there that, you know, we're operating in a deficit.'",
        "'speaker_4': 'And I believe Safer Ground is a federal grant. But I think the question still remains that, you know, we need to look long term on how we're going to fund these these positions.'",
        "'speaker_1': 'And I would agree, we need to look long term based upon our contracts. We have long term contracts. In fact, we have contracts that we've agreed to that are six year contracts. So if we're only looking at two years, I don't think that's appropriate.'",
        "'speaker_1': 'And I think we do have to do our best when we do commit to six year contracts that actually have liabilities that go much beyond that. So that and that being said, I want to add that staff's report showed a two part recommendation.'",
        "'speaker_1': 'And unfortunately, in my opinion, it was included in one resolution. And in the future, I would prefer that we hold in fact, keep it two parts, which is what was in staff's report. And I will not be supporting a single motion member.'",
        "'speaker_1': 'Jason, I.'",
        "'speaker_5': 'Just want to conclude by quickly saying I'm going to support the motion, because I think the issue is to a deal with the positive revenue news that we got a deal with it to allow us to get to the end of this fiscal year.'",
        "'speaker_5': 'And in dealing in dealing with that positive news, we are also able to deal with immediate needs that the citizens require, i.e. the need for funding the rent stabilization project. That was not part of the discussion when we had last year, when we were talking about how to spend down from the 38% reserve to ultimately the 20%'",
        "'speaker_5': 'reserve. This is the new information and new money. And fortunately, we're in a position to do that. And I'm also going to support this finally, because in terms of the workers that I worked at talking about, for the most part, we're giving authority to hire to try attempt to fill vacant positions.'",
        "'speaker_5': 'So it's not additive for the most part. So that's why I support.'",
        "'speaker_2': 'And I'll just chime in to that. We talk about the increase the state increase the the minimum wage, which was a good thing to do to to $15 an hour. And so, I mean, but you stop and think, people who are making $15 an hour, that's still not a lot to live on.'",
        "'speaker_2': 'And so many of the issues we deal with at this council have to do with being able to afford the cost of living here. So we're certainly not going to be grudge the the for the most part, part time workers that we have in the city who are making those hourly wages.'",
        "'speaker_2': 'Are they mostly part time? Yeah. Yeah. Okay. So anyway.'",
        "'speaker_1': 'We have another question, right. All those in favor. I oppose. I oppose. Motion carries for two one. Thank you. And now six be have been pulled because there was an agreement reached between the tenant and the landlord. So then we have six C.'",
        "'speaker_8': 'It works.'",
        "'speaker_0': 'Provide direction staff regarding general policies, municipal code requirements and potential amendments to the General Plan of Municipal Code to address development sites with mixed use zoning. Yeah. No.'"
    ],
    "Provide Direction to Staff Regarding General Plan Policies, Municipal Code Requirements and Potential Amendments to the General Plan and Municipal Code to address Development Sites with Mixed Use (MX) Zoning. (Community Development 481005)": [
        "'speaker_8': 'Ready? Yes.'",
        "'speaker_10': 'Good evening, Mayor Spencer. Members of the council. My name is Sandra Thomas, city planner, city of Alameda. I'll be presenting the staff report and presentation tonight on your workshop. This is a workshop. It's really a continue. It's a in response to the council's March 1st referral to look at the mixed use zoning here in Alameda and our'",
        "'speaker_10': 'general planning policies. It's also a continuation of the tour we did last month of the Northern Waterfront sites. The purpose of tonight's meeting is to. Evaluate our general plan and zoning standards, policies and standards for these sites and in particular to sites which are on our minds right now, which are the Arsenal terminal site and the Alameda'",
        "'speaker_10': 'Marina site. The reason these are on our minds is because they are either they're both right at the beginning of a extensive community planning process. And for that reason, tonight is not the night to be making any final decisions.'",
        "'speaker_10': 'What we would like to do tonight is talk about our overall community objectives for these two sites. Talk a little bit about what our general plan says about these two sites. Talk a little bit about what the zoning says about how these the planning process has to unfold on these two sites.'",
        "'speaker_10': 'And if you see something in the process of tonight's hearing in this workshop that you think needs to be changed in our general plan or zoning. Tonight's a great night to flag those issues, very similar to how we handled the council referral about a year ago on the density bonus ordinance.'",
        "'speaker_10': 'One of you identified a potential problem with our density bonus ordinance. We came to you in response to that referral, essentially with the staff and said, okay, we've looked at our density bonus ordinance and we've we've we see some things we might be able to change to respond to the problems in the ordinance that you identified.'",
        "'speaker_10': 'You think we're on the right track and you said, yes, I think you're on the right track. And then we said, okay, well, we now need to take that through the planning process that's outlined in state and local government about how we change our ordinances, which means we have a public hearing in front of the planning board'",
        "'speaker_10': ', and then they make a recommendation to you that gives the public a lot of opportunity to participate in the process. So in a similar way tonight, if you see some a problem with our general plan or zoning, we'll flag it.'",
        "'speaker_10': 'And that would then be direction to staff tonight. Proceed with either amending our general plan or zoning ordinance. And what we will do is you wouldn't make those amendments tonight, but we would start that process, take it to the planning board, and then it would return to you for a final general plan amendment or zoning amendment.'",
        "'speaker_10': 'I also we're going to be talking about two sites in particular, Alameda, Marina and Alameda and Arsenal terminals. Tonight is not the night to be making any final decisions about these sites. As the council knows here in Alameda, we we take these kinds of sites through an extensive planning process with the community.'",
        "'speaker_10': 'Many community meetings then many planning board meetings. We require a lot of analysis. We require a lot of different studies. We require a lot of various alternatives and analysis. All that information gets sort of put into the public discussion and then the planning board works it all through and then they ultimately they make a recommendation to you'",
        "'speaker_10': '. And at the end of the day, these master plans are going to have to come to the Council for final adoption or denial or amendment or adjustment and approval. But we don't have all that information for you tonight.'",
        "'speaker_10': 'So tonight's not the night for any final decisions, but it is a good night to start talking about these sites with the community, who's here tonight and also between the council and the staff so that we can see if we are on the same page.'",
        "'speaker_10': 'Because if we are if we can articulate kind of what our objectives are as a city. Then we're going to have a more effective planning process. Staff is going to be more effective with the applicant. Staff is going to be more effective with the planning board.'",
        "'speaker_10': 'The planning boards can have a better idea of what you're looking for, and we will all be giving the same message to the the developers, property owners and and architects throughout the process. I showed these two these two pictures up here because mixed use mixed use is something that is just part of Alameda.'",
        "'speaker_10': 'We've been doing it for over 100 years. Park Street on the left turn of the century. This is what we call in the planning jargon, vertical, mixed use commercial on the ground floor, residential upstairs. You know, it goes back to the very first days of Alameda on the right marina village.'",
        "'speaker_10': 'This is more what we would call horizontal mixed use as a master planned community with Marina Village. As you see in the slide, we have boat slips commercial. We have residential separated from the boat slips by the lagoons and the open space and then separated between that and the road.'",
        "'speaker_10': 'The retail portion of the project, all one project, the one of the first master plans done in Alameda. And we think a successful master plan. So Alameda is not new to mixed use. We've been doing it for many, many years and we do it fairly well.'",
        "'speaker_10': 'How do we do it in Alameda for these large sites like Marina Village? And this is true of small terminals and the aluminum marina site. We require a master plan. A master plan sets all of the requirements for the site, you know, the kinds of uses how they should be organized spatially.'",
        "'speaker_10': 'But we also put restrictions and limitations on these uses so that they can coexist well, because it's not just about putting things next to each other, but also thinking about what types of uses we're putting next to each other and then disclosing and making sure that we try to eliminate potential problems in the future.'",
        "'speaker_10': 'For example, residential deed restrictions and disclosures. At the Alameda, the Marina Shores Project on our Future Clement Truck Wrap, all of those houses on their deeds has a disclosure that Clement. In front between them and the water is going to be a truck route.'",
        "'speaker_10': 'Now we want that to be disclosed to those residents as they buy it. They look at the house, they go, oh, this is beautiful on the cross in this little street. And there's going to be a there's a marina in front and looking out of the water.'",
        "'speaker_10': 'That's all wonderful. But that is our designated truck route. The trucks aren't there yet. They will be when we can complete clement. It does not prevent one of those residents from coming down here in five years and saying, Oh, my God, you need to move the truck route.'",
        "'speaker_10': 'It's too loud in front of my house. Staff will be the first to jump up and say, okay, you have that right to ask the council to move the truck route. But don't say you didn't know about it.'",
        "'speaker_10': 'You bought your house knowing this was going to be a truck route. So there were no surprises. There was no fast ones pulled on you. This is we've we've put that disclosure and deed restriction on your property. We have similar deed restrictions and disclosures at Harbor Bay.'",
        "'speaker_10': 'You're buying a house across from a business park, although it looks like a lot of vacant land that is going to be a business park. So understand that if you're going to buy into this neighborhood on the commercial side, we also do we put limitations on the operations, if need be, because of their proximity to other uses'",
        "'speaker_10': ', like residential, so hours of operation, truck delivery, those kinds of things to try to minimize conflicts between uses. But it all starts with good site planning. This slide. I'm sorry about this. A little out of order, but I'll just go through these one by one.'",
        "'speaker_10': 'One of the big questions, one of the things we're going to have to decide on each of these projects, because there are mixed use projects. They are is how much housing to put in each of these projects. This, of course, in Alameda is always a important issue.'",
        "'speaker_10': 'There's basically when you think about these three projects, I think there's going to be three. And the issue of housing, how much housing is appropriate on each site? I think there's going to be three basic issues you're going to have to consider through this process.'",
        "'speaker_10': 'One is what is our what is our state requirement, regional housing need, and are we compliant with state law? Number two, what's our local housing need? And it may be different from our state. You can think of the state need as the absolute minimum the city can do at a citywide level, not on each site at a'",
        "'speaker_10': 'citywide level. It's the absolute minimum. Our local need might be greater than the minimum state need. And then there's a third factor, which is housing pays for a lot of things in a mixed use project. It pays for a lot of the infrastructure.'",
        "'speaker_10': 'It pays for some of the land uses, like open space that don't pay at all. So to have a good mixed use project, you need commercial, you need open space, you need residential. If the commercial, depending on what kind of commercial it is, and let's say it's maritime commercial or something that doesn't pay a lot of rent'",
        "'speaker_10': ', we're going to need residential on that site to help pay for the infrastructure which is needed to supply the open space and the facilities for the maritime as we want. So I'm getting ahead of myself. You have to know about your regional housing need.'",
        "'speaker_10': 'That's the bare minimum. And this is going to be important because this is going to come up a lot. The way this works, I know the council knows a lot of this, but just for the community, because I want the community to also understand these numbers.'",
        "'speaker_10': 'The state basically sets an absolute minimum for each city. It's set through a regional process, and it's based on an eight year term or eight year term is 2014 through 2023. So we're kind of at the beginning of the term.'",
        "'speaker_10': 'We're about a year and a half, two years into our eight year term. April 2016. Our requirement is to have at minimum, enough land zoned for residential for 1725 units. They the city. The state knows that we don't actually build housing, we just zone land.'",
        "'speaker_10': 'So our requirement is to have enough land for 1725 units. That is broken into two categories and this is important for a better understand that land. Some of it has to be in what is called high density, high density land, land that allows for higher density housing and multi-family housing.'",
        "'speaker_10': 'The rest of it can be in low density land. It doesn't have to require multifamily. It doesn't have to be high density. In Alameda, it's very easy to determine which category the property falls in. If we have the multifamily overlay zoning district on the piece of property, then it qualifies for the high density land.'",
        "'speaker_10': 'If it does not have the MF overlay, then it can only be counted to the low density. If you have an excess in the multifamily, you can use some of your multifamily to cover your low density. So the MF land is the only land that can be used for high density.'",
        "'speaker_10': 'It also can be used if you're running a deficit in your low density and you've got excess in your high density, then you can shift it over. So getting too complicated here. The basic require absolute minimum state on the high density side is 692 units.'",
        "'speaker_10': 'On the low density side is 1031. You add those two together, you get the 1725. So those are our base requirements too, as of today. We have a surplus in both categories. You have enough land in the high density category to do 1412 units.'",
        "'speaker_10': 'So you're running a surplus of 720 units in that category. Likewise, in the low density land, you have a surplus. I can explain the surplus and why we have such a big surplus, but I won't do it tonight.'",
        "'speaker_10': 'The point is you have a surplus. What that means is you have more flexibility when looking at each site. So in the housing element we've allocated. How many units we think will go on each site. And I'll talk about each of these sites and how much we allocated on each of these sites.'",
        "'speaker_10': 'But the point is you have surpluses. And what that does is it gives you the council the ability to adjust the numbers, whereas you look at the plan for each site, you might decide to do more units on a site than we said we would in the housing element.'",
        "'speaker_10': 'Of course, from a state point of view, that's fantastic. But you can also decide to do less on a site than we projected because we have a surplus. You have units to play with and you could do less on a particular site and not run afoul of the minimum because you have these extra units in your inventory'",
        "'speaker_10': '. But. A couple of words of caution. You're only two years into your eight year period. If you were to decide on are your first two projects, oh, we don't want to do any housing on those first two projects.'",
        "'speaker_10': 'And you take away your surplus. You are now putting yourself in a very precarious position for the rest of the period. Every single project from that point on, once you use up your surplus, you have no flexibility at all.'",
        "'speaker_10': 'None at all. You have to do, at minimum, the number of units that you promise the state on every single site from that point on. So as we get closer to the end of the eight year period, 2021, 2022 staff is going to not be too concerned about your surplus.'",
        "'speaker_10': 'Two years into an eight year period, we're pretty concerned about the surplus. We want to give you a healthy surplus. You can you can start eating away at it, but eat slowly. I referred to the minimum as like the electric fence.'",
        "'speaker_10': 'And you're walking through the farm. Don't you can walk near the fence, but don't touch the fence. If you violate your housing element and you go start running deficits and somebody calls you on it, we could be in serious trouble as a city.'",
        "'speaker_10': 'You could lose your land use authority as the city council, the city of Alameda, and turn it over to a judge. You don't want to go there, so keep a healthy surplus, but know that you have a surplus which gives you flexibility in designing each site as we as we proceed through the planning process.'",
        "'speaker_10': 'So the two sites real quick and simple terminals on the left, a really unbelievable piece of property. About 15 acres of privately owned land, six acres of state tidelands, which is basically owned by the city for the people of California.'",
        "'speaker_10': 'So you've got about 21 acres of dry land. You've got another nine acres of submerged land basically under water. This is a site that surrounded by water on three sides, kind of unbelievable. No public access out there ever.'",
        "'speaker_10': 'So an incredible opportunity. The housing element programed 234 units on this site. Alamy. I'll meet a marina on the right. Another incredible sight only. A couple of blocks to the east of Arsenal terminals, also on the northern waterfront, 20 acres of privately owned land, approximately five acres of tidelands land, dry land owned by the city.'",
        "'speaker_10': 'On Tidelands, you cannot do residential. So Tidelands land can only be used for things like open space or maritime uses. 19 acres of submerged land, same thing. No housing, but maritime uses on the water. And we programed about 396 so that 396 units, the 234 four and so, you know, you can obviously do more than that on'",
        "'speaker_10': 'any of these sites if you want. You can also do less as long as we keep an eye on that surplus and you don't eat too deeply into that surplus. For example, if you decided to do no units on either of these sites, you have 720 surplus units in that.'",
        "'speaker_10': 'In the high density, you would pretty much be using your entire surplus just on these two sites if you didn't do housing. So that's not something we would recommend at this point in the cycle. So a master plan.'",
        "'speaker_10': 'What is a master plan to do? So both of these sites are zoned Amex mixed use. They are both in the general plan for a mix of uses. A master plan is adopted by this council after getting recommendations from the planning board and after, as I said, months of hearings.'",
        "'speaker_10': 'But ultimately the city council has full discretion over the number of housing units to go on that plan, the amount of commercial employment to go in that plan, the amount of open space to go on the plan, the placement of all of it, where things go.'",
        "'speaker_10': 'It's basically a planning exercise and documenting that in a what's called a master plan. And then these operational conditions and requirements that I talked about, I gave some examples and of course, the phasing of the development. So it's really it's it's a with the master planning the mix district allows is it gives the community full discretion over'",
        "'speaker_10': 'how to organize the site and plan the site which is an incredibly powerful tool it. So but what that does, of course, is it gives us a lot to think about it. And the other point I was going to just quickly make is you also get to customize you get to customize the master plan for each site'",
        "'speaker_10': ', because these are different sites. They're not it's not like Park Street, which is a whole series of properties that are just in one contiguous area that all have sort of the same characteristics. You want a similar building height, similar kind of use.'",
        "'speaker_10': 'They have this coherent district. The mix is used on sites that are not necessarily next to each other. They may know one like me and Marina, has 200,000 square feet of businesses on it today and it's not terminal's has none at all.'",
        "'speaker_10': 'So two very different conditions with the master planning. You can customize those master plans to the specifics of that site and to your community objectives for that site. So what do you have to think about, though? I mean, there's a lot to think about.'",
        "'speaker_10': 'So obviously general plan and community objectives for each site. What are we really trying to achieve on the site? That's the basis of this of the master plan we have to think about. This site needs what's going on with the infrastructure, what kind of reinvestment is necessary on that site for us to achieve our general planning community'",
        "'speaker_10': 'objectives. You're also have local employment needs. Obviously, economic development is big. We need new businesses in Alameda. These sites provide an opportunity to start to plan for that. We have a really awful jobs housing balance. We are basically a residential island.'",
        "'speaker_10': 'Jobs and businesses are important even from a transportation perspective. Your general plan calls that out as a transportation strategy. Adding jobs as a transportation strategy. We have fewer Olympians leaving the island every morning to get to jobs off island.'",
        "'speaker_10': 'Local open space needs. Of course, these both sites have opportunities for open space. And then as at the end, of course, you have to think about your regional housing needs. Stay away from the electric fence. And then, of course, beyond that, easy to stay away from the electric fence.'",
        "'speaker_10': 'But what do we need from a housing perspective here in Alameda? Our local needs may be different than our regional need. We may be looking for certain types of affordable housing. Workforce housing is something we've been talking more and more about.'",
        "'speaker_10': 'Of course, live work, housing, liveaboard there's all sorts of opportunities within this category. And and it comes down to what does this council, what is this community looking for on these sites? I'm just going to take a couple of minutes to talk through some of the basic things about these two sites that we do know about.'",
        "'speaker_10': 'And then we can open it up. You can. It's your workshop. And I know there's people here from the community who would like to talk to you about both these sites tonight. And I will be involved in this these planning processes.'",
        "'speaker_10': 'And I neglected to say at the top. In terms of talking about these sites, what we've provided in your staff report or two attachments. The first one dealt with internal termites. And what it is, is basically an excerpt from the general plan for Internal Terminals.'",
        "'speaker_10': 'We are very lucky. We have the council in 2008 adopted what's called the Northern Waterfront General Plan Amendment, which included 25 odd policies in our general plan, specifically talking about how do you do a master plan for this site?'",
        "'speaker_10': 'So that's great. So what we put in is as exhibit three on the master, exhibit four in the master plan is the internal terminals, general planning policies. And the idea there is the community should look at those policies.'",
        "'speaker_10': 'The Council should look at those policies. They were adopted in 2008. But there may be some policies that we look at today in 2016 and go, you know, that's not quite right. We have some different objectives today. So if you do, we should we should identify those.'",
        "'speaker_10': 'So what are these policies do? I'll spare you. Reading through all 25. But the big ideas. This needs to be a mixed use site, not a single use. A mix of uses, open space, residential and commercial are specifically called out as appropriate uses on this site.'",
        "'speaker_10': 'The general plan talks about the opportunities for water access on this site, both for water shuttles, ferries to the sea, into the estuary, and connecting to the regional transportation system, as well as just recreational access to the what's called the Alaska Basin, which is that kind of incredible basin of water between Wind River and this site.'",
        "'speaker_10': 'And then another obviously big concept is this idea of moving the publicly owned land. Currently the city owned six acres of land. It's right at the core of the of the of the site of this peninsula. And the private property owner owns the whole edge.'",
        "'speaker_10': 'And this the concept is. Make the entire perimeter of this three sided peninsula publicly accessible. Yet for opportunities for the public to get to the waterfront, use the water and put it into public ownership if possible. So big concept there in terms of creating continuous public waterfront access and activities all the way around the perimeter of this'",
        "'speaker_10': 'site. It's over 2400 square feet of shoreline. So it's a lot of shoreline on one piece of property. The internal development team has submitted a first draft master plan. We're starting to evaluate it, look at it. Just want to tell you a little bit about what they're thinking to make this work, because these things, this the entire'",
        "'speaker_10': 'edge needs to be completely rebuilt. It's basically eroding wharfs and docks and needs to be completely rebuilt. The entire site needs to be all sorts of geotechnical issues. And obviously we're not going to want to take on any public waterfront access.'",
        "'speaker_10': 'That, first of all, is not improved. And second of all, it doesn't have a maintenance. Obligation on the development. They're there preliminarily looking at around 500 housing units. They're looking at approximately 50,000 square feet of commercial and approximately five acres of open space.'",
        "'speaker_10': 'I am sure these numbers will change over the next year as we go through the community planning process. We haven't had any discussion about these numbers yet in the public realm, other than small meetings between the developers and community members or me and community members.'",
        "'speaker_10': 'But that is sort of where they are. Their starting point is their initial ideas about this, and this is just a real summary. I think the big issues that we're going to argue about as we move through this planning process with the community are not argue, but debate and analyze and study at great depth is obviously the'",
        "'speaker_10': 'number of housing units. That's always going to be a big issue on any site in Alameda. The building heights and this is going to be a very interesting conversation. If we can get through agreement on the number of units, then the next question is, how do we want to arrange those units?'",
        "'speaker_10': 'We want to arrange them in a lot of buildings that are short and squat and cover a lot of the property, or do we want to arrange them in fewer buildings that are taller, which leaves us more open space on this site?'",
        "'speaker_10': 'It is going to be a very interesting conversation and is going to really challenge a lot of us and our sort of conceptual preconceptions about what is an appropriate height on this site. The general plan says the appropriate height is 5 to 6 storeys.'",
        "'speaker_10': 'So if the community and and the planning board ultimately end up recommending to the council to do something higher than five or six storeys, I think it's 60 feet in the in the general plan. They would require a general planning amendment which ultimately can only be done by the city council.'",
        "'speaker_10': 'So that's going to be an interesting conversation. The other issue that is going to be really important to this planning process is the character and quality of the public open space. I mean, that is the big benefit to the public of this project.'",
        "'speaker_10': 'Moving on, coming down the homestretch here. Let's talk about Alameda Marina. So Alameda Marina, we don't have the benefit of 25 policies in the general plan. This Alameda marina was not in the northern waterfront general plan amendment. It wasn't covered by it.'",
        "'speaker_10': 'There are some very general policies. Obviously, it's mentioned in the housing element. So what we did for this workshop is we included exhibit three, which we call Alameda Marina Staff's recommended guidelines for preparing a master plan. So what we did is staff as we wrote down what we thought would be the instructions we would give.'",
        "'speaker_10': 'We meaning staff to the to the. To the applicant developer about how we would recommend that they put together a master plan. What are the city's priorities for this site? And our thought was tonight and I know you're going to have some speakers tonight who have taken the time to look through this.'",
        "'speaker_10': 'And we really staff encouraged everybody to take a look at this and come tonight with ideas and kind of and adjustments or revisions to our language. Once again, the whole idea here is let's get staff and the council and the community as much on the same page as we can.'",
        "'speaker_10': 'Then we can all speak with one voice to the developer. Our vision on this site, and as we articulate an exhibit three, is we do see this as an opportunity for maritime, what we call maritime mixed use, a mixed use site that has that preserves and reinvests in the public maritime facilities out here.'",
        "'speaker_10': 'So it's a great waterfront site from staff's perspective. Maritime industry is one of our sectors. That's what makes Alameda different than Emeryville or Oakland. We will never compete with Oakland for class-A office space over a BART station. We won't compete with Emeryville for big box freeway oriented retail.'",
        "'speaker_10': 'We don't have freeways. We don't have a BART station. We have. What are those? Neither of those cities have. We have some fantastic waterfront sites which are great for waterfront maritime uses. So it's important to Alameda and we need to be cognizant of that and want to try to build that that sector, if we can.'",
        "'speaker_10': 'So high priority in our sort of guidelines is maintaining that maritime industry, allowing it to grow, maintaining other employment out there. We've got about 100,000 square feet of maritime businesses out there today. We have another 200,000 square feet of of other or of employment total.'",
        "'speaker_10': 'So, I mean, we have, you know, a large number of businesses at Alameda Marina. We don't from stats perspective, the goal is we don't want to lose any of them. We are not the master plan is not going to identify which tenants stay and which go.'",
        "'speaker_10': 'It's just something to talk about square footage. But we can use your your master planning process as essentially a site specific zoning effort for this thing. We also believe that you can improve and expand open space opportunities out at the Marina Alameda area and that you can add housing to this site.'",
        "'speaker_10': 'Here. The on site issues are huge. As with central terminals, you know, the priority here is to reinvest in the infrastructure and the public lands, much of which we.'",
        "'speaker_8': 'Own.'",
        "'speaker_10': 'And which are in desperate need of repair. I'm sorry I had some even better photographs that I wasn't able to get into the power point in time. But once again, about 2700 feet of shoreline, all in terrible condition.'",
        "'speaker_10': 'The photographs that I wanted to show so this is what you see here is a cave in. Right. This is it's caving in behind the piers. Well, if you go around to the shoreline side, you'll see those piers don't actually touch the water.'",
        "'speaker_10': 'They have literally corroded away. So what's happening is the Alameda marina is slowly falling into the bay. The water has been corroding the bottom of the piers. So now that's failing. The soil that's being held back by the piers is starting to sloughed into the estuary, which means the surface.'",
        "'speaker_10': 'Of the marina is starting to cave in. It's happening all over as we've been out there now a few times on various tours. To walk along the water side of these piers and see underneath these docks is really quite.'",
        "'speaker_10': 'Well, it's quite scary, frankly. So many of these, Piers, literally don't even touch the water. They're just hanging in the air because they've corroded. So the idea of maintaining maritime, the challenge for us and the estimate is was probably over $30 million of improvements is necessary ultimately in the way we are thinking about that is if you'",
        "'speaker_10': 'want to maintain these maritime businesses out here, we need to find a way to reinvest in this property because if we allow it to continue to corrode, our maritime businesses are not going to be able to survive there and they're slowly going to deteriorate as well or move away.'",
        "'speaker_10': 'So the idea of doing nothing at Alameda Marina is not a good option. And far as from staff's perspective, we have to do something. And the question is what to will fund these kinds of improvements. Which gets us to the question of housing again.'",
        "'speaker_10': 'Because housing very often is what pays for this kind of infrastructure. We could try to really jack up rents on maritime businesses to help them pay for it. But that is not necessarily productive because maritime businesses very often can't fund a lot of improvements beyond their rent or jackup prices for boat slips.'",
        "'speaker_10': 'But that could be counterproductive as well, because an empty marina, it's not helpful either. I think that this conversation is going to rotate a lot around the dry storage areas. You see this aerial photograph, you see of Alamy Marina.'",
        "'speaker_10': 'You see what is a lot of what we call dry storage, large parking lots.'",
        "'speaker_2': 'You're talking about lower.'",
        "'speaker_10': 'I'm talking about the lower this big area. Right. The lower end where you see it looks like a giant parking lot. And then you get up to those buildings there. That's one giant area. And then at the other end, you see another dry storage area up by the AMP building and Grand Street.'",
        "'speaker_10': 'It's smaller, but it's a parking lot at the northern end. These are dry storage. So this is where you can store your boat. If it's a small boat, you can go out there and take your boat with its trailer, take it over to a crane, put it in the water, sail for the day or for a few'",
        "'speaker_10': 'days, and then sail back and take your boat out of the water and put it back in this parking space. Only about 60% of this area is actually leased for boats, but 40% are random vehicles, containers. There's an AC transit bus that somebody is storing out there.'",
        "'speaker_10': 'Don't ask me why. I don't know even what's in the containers. There's just a you know, somebody had a container and they decide to lease a space. There's a whole bunch of RV vehicles out there. You know, does that have to be on the waterfront?'",
        "'speaker_10': 'I think from staff's perspective, no. Is dry storage important, though, for an effective marina? Yes, absolutely. A couple just data points. Only 24% of all that dry storage is actually leased to Alameda residents, which is, you know, I mean, we don't want to just limit this to Alameda residents, but it's important to know that only 24% of'",
        "'speaker_10': 'the of all the spaces are actually rented by Alameda residents. Of that, 43 boats are owned by resident Alameda residents out there, and only 30 of them are actually operable.'",
        "'speaker_8': 'Boats.'",
        "'speaker_10': 'And only 16 are actually use, I think, active. The definition of active was has it been in and out of the water in the last two years? So. I'm not trying to make any point about dry storage other than we think there's opportunities here with more efficient use of the land.'",
        "'speaker_10': 'Re re looking at the dry storage areas and other areas, but we definitely believe there's ability to plan for this site where you keep all your businesses. And introduce housing to help pay for the infrastructure costs that are necessary to support those maritime industries.'",
        "'speaker_10': 'So we see a planning opportunity here that we think could be a win win for both the maritime businesses, this site as an economic engine as well as a housing opportunity site. Do I know the right number of units right now?'",
        "'speaker_10': 'No, I really don't. So we have our draft staff's recommended guidelines for preparing a master plan. I'm sure you'll hear from some of the speakers tonight on some of those ideas. And they're at the end of the day tonight, what we're looking for is if you have any concerns with the annual general plan policies tonight or in'",
        "'speaker_10': 'the future, the sooner you let us know about it, the better. Because if we need to change our general plan to give a clearer picture of what we're looking for, the sooner we do that, the better. Any concerns with the staff's guidelines for all medium arena?'",
        "'speaker_10': 'It would be great to hear from the community tonight as well as the council tonight on on sort of that those guidelines. They can certainly will be useful to us as we proceed with Alameda Marina. And then, of course, like I said, anything you want to see changed in our general plan or zoning to either that you'",
        "'speaker_10': 'pick up from these or from the community tonight, now would be a great time to let us know. And like I said at the beginning, we're really kicking off a planning process here on two different sites, both very exciting, we think would be great opportunities for the northern waterfront and for Alameda as a whole.'",
        "'speaker_10': 'So this is not the last public meeting you'll be at on these two sites, but it is one of the early ones. So I'm available to answer questions. I know there's representatives from both sites here tonight. I think I've seen some faces, familiar faces from the community here tonight as well.'",
        "'speaker_10': 'So with that, I think I will stop talking and turn it over to you.'",
        "'speaker_1': 'Mayor Spencer. Q Thank you. Thank you for the presentation. We have, I know, over ten speakers steps in there being people are coming up right now and turning minute, turning them in. So I know there's more at this council.'",
        "'speaker_1': 'Have any clarifying questions? All right. None. I'm going to go ahead and start calling our speakers. And you can line up on my right side and then just proceed with the speaker ahead of you completes and it'll be 3 minutes per speaker and our first speaker will be Dorothy Freeman, then Sabrina Svensson, then Sean Murphy, and then'",
        "'speaker_1': 'Thomas Sharon. Dorothy Freeman is first. The rest of you may line up, so we'll be ready to go. Thank you.'",
        "'speaker_2': 'Good evening, mayor spencer. Council members, staff and alameda. I'm Dorothy Freeman. The staff report exhibit three for the alameda marina masterplan is in need of changes. I am requesting that the council direct the staff to make further clarifications to the guidelines for preparing the master plan.'",
        "'speaker_2': 'While the staff report appears to be a plan for preserving the present business environment, there are too many statements that will allow the developer to present a plan for building housing within the marina. The paragraph referencing multi-family residential uses, including the all point seven through nine, should be removed from the document.'",
        "'speaker_2': 'There is not enough land at the marina to both preserve the existing maritime business so important to Alameda and build multifamily residences. Removing the marina housing unit and acre numbers from the housing element will not cause us any harm with the housing element.'",
        "'speaker_2': 'Alameda has provided all the necessary market rate, housing units and acres needed to satisfy the housing element through 2023. The marina owners should be looking to preserve and grow opportunities for maritime and small scale manufacturing businesses. The bulkheads supporting the marina do need repairs, but income from present and improved business opportunities will be sufficient to accomplish these'",
        "'speaker_2': 'repairs over the next two years. Building housing units is not the only way to accomplish the necessary work. The transportation paragraph also has references that are troubling to me. Transportation services to Oakland and beyond, including water based transit, implies water shuttles leaving from the marina.'",
        "'speaker_2': 'Water shuttles planned for internal terminals and Alameda landings should be supported by the marina. But a shuttle crossing at the marina is not practical. There will be no place to park the cars that would bring riders to the marina.'",
        "'speaker_2': 'As stated in the report, services that connect to larger circulation networks within the city are what is needed. A land shuttle bus would take riders to the new estuary crossing. Shadows and keep and help to alleviate the parking problems at the president and proposed Perry stops.'",
        "'speaker_2': 'Many visitors arrive at the marina by boat. A land shuttle traveling around a clump along climate would allow them to visit our business districts during their stay. While I applaud the staff for their efforts to create a solution acceptable to the property owners and the citizens of Alameda, this document is not quite so.'",
        "'speaker_2': 'Has offered an edited version that that better clarifies the need for preserving the present environment. I support their changes, but I request the City Council to direct staff to research the possibility of removing the zoning changes made in 2012 and work with the property owners to improve the marina for what it is best suited for maritime and'",
        "'speaker_2': 'other business opportunity. Alameda needs a vibrant marina maritime business district more than it needs additional market rate housing.'",
        "'speaker_1': 'Thank you. Thank you, Sabrina.'",
        "'speaker_3': 'Good evening. Good evening, Madam Mayor. And Council members and staff. I'm Sabrina Svenson.'",
        "'speaker_0': 'My family has.'",
        "'speaker_3': 'Owned and operated expenses about works for over 50 years within the Alameda Marina. And in this time, our business has changed as the maritime industry continues to evolve.'",
        "'speaker_6': 'We are currently exploring all.'",
        "'speaker_3': 'Options to keep our business in Alameda, as well as exploring the possibility of a smaller footprint.'",
        "'speaker_0': 'At the marina.'",
        "'speaker_3': 'Or potentially even moving some of our services to another location with on within Alameda on the island. One of our main objectives has always been and will continue to remain to obtain as many jobs as possible. As we explore the options for the works.'",
        "'speaker_3': 'My family is also continuing in its role as one of the owners of the marina, and we continue to support plans for a mix of uses at the property. When my dad signed the Tidelands lease agreement with the city in 2008, he intended to prepare the marina for a future by ensuring a funding mechanism that would reinvest'",
        "'speaker_3': 'in the property, not just for a few users, but for all. Alameda. And as co-owners, we want we intend to continue to work with the city, our tenants and the community to fulfill our obligations under the Tidelands lease, including the infrastructure improvements that the marina so desperately needs.'",
        "'speaker_3': 'And there are a lot of them. So thank you very much for your time.'",
        "'speaker_1': 'Thank you. John Murphy. And then Thomas.'",
        "'speaker_8': 'It evening, Madam Mayor, Council Member of Staff John Murphy, Business Development and Alameda Marina. First of all, to thank staff for their work on this item. It's an important item and we appreciate the opportunity to host the council at the Marina on March 11th, on a very rainy Friday, to examine both the Northern Waterfront and Arsenal terminal'",
        "'speaker_8': '. And then I'll meet Marina. We will look forward to continuing to work with the city, our tenants, the community, and developing a master plan for aluminum marina that serves Alameda. Earlier this morning, we submitted a detailed letter in response to the proposed guidelines.'",
        "'speaker_8': 'Without getting into that detail, I wanted to just use a little bit of time to outline a few important points. Our planning timeline has always been guided by the already established framework created by the city's policies. A municipal code.'",
        "'speaker_8': 'We haven't yet submitted a project application and we're working within the existing guidelines and the tidal land lease agreement with the city to create that master plan. This plan is also being informed by feedback we receive from the council, the staff, the tenants, the community in an effort that we really started back in 2008.'",
        "'speaker_8': 'Our plan will consider a mix of uses, including a variety of multi-family housing types for different economic levels to help address the city's housing shortage. It'll preserve and enhance maritime jobs. It will maintain a level of service for the boating community.'",
        "'speaker_8': 'It will include important mitigation for traffic. And to that degree were participating in the upcoming workshops to create a citywide TMA. Our team has a lot of experience in creating both land and water transit solutions that have been successful at Jack London.'",
        "'speaker_8': 'And we'll bring that experience to this project in Almeida. Importantly, the the kind of mixed use plan that we propose is the only way we can pay for the tens of millions of dollars. As Andrew indicated, yes, it's at least 30 million.'",
        "'speaker_8': 'It's unfortunately closer to $40 million of infrastructure. And a bulk of that is on the city owned Thailand parcels. We've already been invested in this property and in this effort. And we'll continue to do so through the development of our upcoming master plan.'",
        "'speaker_8': 'We look forward to ongoing collaboration with the city and community on this project. Thank you.'",
        "'speaker_1': 'Thank you. Thomas Sharon and then Liz Taylor and Helen Source.'",
        "'speaker_11': 'Tom Sharon in an elevator for a few years. Been up here a few times. It's a pleasure to be here tonight. I'm not even going to talk for 3 minutes. I'm a member of Saw the Save Alameda Working Waterfront.'",
        "'speaker_11': 'And it's a pleasure to meet you tonight, Shawn, and I hope we can work with you in this process to do what you say and what Andrew has said to the city council this evening. I do ask you to look at the document which you all have received from saw with its amendments to kind of clarify some'",
        "'speaker_11': 'of the things. I'm not going to go through them all. You've got it in your hands. And finally. I just hope we can preserve unique maritime. Employment. Craftsperson community that we have, as I said, the last time I was here.'",
        "'speaker_11': 'When I came to Alameda 18 years ago, there were four four marinas.'",
        "'speaker_8': 'Or four, four boatyards that.'",
        "'speaker_11': 'Dealt with.'",
        "'speaker_8': 'Residential.'",
        "'speaker_11': 'And recreational boating. Of course, if you put that, they ship and yacht, that's a heavy commercial. You know, as for big.'",
        "'speaker_8': 'Ocean going work. Right now, suspensions. And half of Alameda Marina.'",
        "'speaker_11': 'Are the only places where you can go to get your boats fixed here in Alameda. Unless you've got a big, big boat, you want to take the bay ship and yacht. Thank you.'",
        "'speaker_1': 'Thank you. Liz. And then Helen saw.'",
        "'speaker_3': 'Good evening, council and city staff. I'm Liz Taylor, and we have a business in the Alameda Marina. It's one of the more unique businesses there. I really just wanted to say how much we appreciate the fact that the council is looking at this issue very closely and looking at the value of the maritime jobs and their inner'",
        "'speaker_3': 'connectivity between each other. There's quite a lot of interaction between the large ones, like they ship and Swenson's and Dwyer and sail makers, and they all work together to really make this a vibrant community that has global reach.'",
        "'speaker_3': 'It's not just about jobs in Alameda, but it's about the reach of Alameda to the maritime community around the world. And so it's very much appreciated that you're taking this seriously and giving us all an opportunity to be involved in this in the workshop process and not just capitulating to, you know, the quick fixes.'",
        "'speaker_3': 'So thank you very much.'",
        "'speaker_1': 'Thank you. Ellen Soares and then Brendan Sullivan. Sir, Serene Yana.'",
        "'speaker_0': 'Did. Haney thank you for this hearing. It's a nice opportunity to talk about things when decisions are life shaking or not going to be made, but only explored. In the 50 plus years we've lived here, the changes in the estuary were even more dramatic, and the mixed use for street ships draw such a depth they can't get'",
        "'speaker_0': 'past or two, and therefore the uses in the estuary have changed dramatically. You go down there and see the acres of asphalt and goose poop and it's all over down there. And imagine what could be and what actually is an opportunity for the city.'",
        "'speaker_0': 'We've looked at these drawings in these pictures and they all show open space like the bay is what you see from there. You go down there and stand in, you could easily swim over to the other side. Oakland is building a huge development right across and the partnership that our two cities could develop would be dramatic.'",
        "'speaker_0': 'We get money for our parks, get money for the open space and the infrastructure from the state by partnering and working together with our developers. Mussel and I. Jim probably knows more about that and I do, but it's it's an opportunity.'",
        "'speaker_0': 'And Oakland is eager to talk about those opportunities. You also don't see any boats buzzing up and down, but you go down there and stand. There's a tremendous amount of traffic and they need gas and they need lunch and they need fish bait and whatever.'",
        "'speaker_0': 'There's an opportunity for commercial that we can share as well. So the opportunities of the site are obvious. The need for housing in Alameda, it's obvious. We've had this room filled with people demanding affordable housing, and we've had a skewed housing market for many years because we couldn't build next used housing and and large apartments.'",
        "'speaker_0': 'So we have to have some housing sites and for all incomes. Our Alameda Home Team provides panel discussions. So I'm going to take advantage of this to invite people to come to our June 3rd open discussion of these issues.'",
        "'speaker_0': 'We'll have this featured as well as Sweeney Open Space and Tim have, I hope, a good open discussion. Again, people are there to be informed. The panels are free and it gives people an opportunity to ask their questions, to make their suggestions when a decision is not being made.'",
        "'speaker_0': 'I just want to conclude by saying consider the opportunity of partnering with Oakland. They're very happy and very eager to do so. I've had enough conversations with them that we've been talking about a cross channel panel that might look at it on both sides.'",
        "'speaker_0': 'So I hope you'll keep that in your mind. And also, I have the staff ensure that the developers adhere to the guidelines that are laid out in their plan. Thank you.'",
        "'speaker_1': 'Thank you. Brendan. And then Nancy Hurd. And then Brian Maguire.'",
        "'speaker_8': 'The Mayor and council. My name is Brendan. I was going to just this tonight as part of the wreck anyways, but luckily that got resolved. But I work in the Alameda Marina. I live on Pacific Avenue on the West Side, and I don't necessarily have a position about whether the plan is good or not.'",
        "'speaker_8': 'But I hope to share a little bit of my my experience. It can keep in mind as I go through it. I do have some concern when they talk about. Housing, especially mixed residential in the aluminum arena. I work at a growing ecommerce company there.'",
        "'speaker_8': 'Speak a.'",
        "'speaker_1': 'Little.'",
        "'speaker_8': 'Sure. I work at a growing e-commerce company there, and I go in at 6:00 in the morning and I open the office along with a few other people. We have. Trucks and tractors. Tractor trailers that come in to offload and load are our units that we sell.'",
        "'speaker_8': 'And I also live on Pacific and Fifth, which is really close to some very other large apartments, and there is absolutely no parking available at all. And that is the kind of concern I would have. Going forward as some are going to complain because I'm in the office at 6:00 in the morning doing my job.'",
        "'speaker_8': 'Is there going to be room for a tractor to come in and pick up a pallet of units from from my office? I think that's really practical. Is it? Because I also saw the previous. A few weeks ago, maybe two months.'",
        "'speaker_8': 'You know, there's going to be bike lanes, probably inclement, as is a tractor trailer going to be able to turn onto that. How's that going to work? You know, I work in an e-commerce company. That company will go away from Alameda if it's too difficult to do business.'",
        "'speaker_8': 'And I love LME so much because I live and I work here so that's something to keep in mind that. There's businesses that are already there that employ a lot of.'",
        "'speaker_5': 'And.'",
        "'speaker_8': 'Good paying jobs. You know, nobody's rich, but we're making a living. And it's just something to keep in mind that I'm multifamily housing. I don't know if that would be such a great fit for that space, considering that the businesses that are already there, people aren't going to like the fact that we open up at 6:00 and'",
        "'speaker_8': 'there's a lot of people there at 6:00 in the morning already doing work on boats and tractor trailers are just something, keep in mind.'",
        "'speaker_1': 'Thank you. Nancy Hurd and then Brian Maguire.'",
        "'speaker_0': 'Good evening, Mayor and council members. This whole process started in November and we started hearing from the developer about how they were going to bulldoze everything and put houses all over everything. And we saw pictures and we've come a long way in a very short period of time.'",
        "'speaker_0': 'And I think this has been a great experience working with the city and city council members to come to some agreement. And when we first started the saw organization to save the Working Waterfront, the organization all decided.'",
        "'speaker_1': 'Together.'",
        "'speaker_0': 'That what we really wanted was commercial.'",
        "'speaker_1': 'Industrial.'",
        "'speaker_0': 'A little bit of retail. And if we absolutely had to have housing, it needed to be work, live. And through the process that we've been working with, with the planning department, we came up and we we felt like we were really heard with all the things that Andrew put into the.'",
        "'speaker_1': 'The staff report and.'",
        "'speaker_3': 'Ah, the proposal for.'",
        "'speaker_0': 'What the master plan might look like. And then we sent you a copy of our reaction to it and the changes that we'd like to see in some of the words and some of the things that we think could be changed.'",
        "'speaker_0': 'And I hope you do take a look at what we proposed. You know, that's just a little different. Things that I am particularly concerned about at this point is the dry storage. I it cannot go away. And parking there is really hard it's really hard to find a place to park during the week.'",
        "'speaker_3': 'During the day. There is just.'",
        "'speaker_0': 'Nothing on a monday morning. If you go to any of those businesses, there's no place to park. And that's that is an issue. And so this the idea of having the.'",
        "'speaker_1': 'Transit across the the.'",
        "'speaker_0': 'Estuary for and having to provide more parking is going to be hard. And the other.'",
        "'speaker_3': 'Major thing I'm concerned about is.'",
        "'speaker_0': 'The identification of the historic buildings. They are deemed to be eligible.'",
        "'speaker_1': 'For the national.'",
        "'speaker_3': 'Registry.'",
        "'speaker_0': 'According to a report that was done by the state in 1988. It is not well, it's not easily too easy to find this report.'",
        "'speaker_3': 'It we currently resides.'",
        "'speaker_0': 'In an office in Sonoma. Took a lot of digging to find where I could find this particular place this the report outside of the Alameda Department Planning Department and during the school process. I'm very concerned that it's going to be overlooked and I want to make sure that those buildings do not get harmed in any way because'",
        "'speaker_0': 'they are historic resources to our city. Thank you.'",
        "'speaker_1': 'Thank you. Brian McGuire and then Doyle Sayler and Laura Thomas.'",
        "'speaker_11': 'Good evening. First, I'm just a little surprised after a couple of speakers ago to hear a renter, a representative for the rent review advisory committee, that the mayor of point a few months ago up here speaking against workforce and affordable housing at this site.'",
        "'speaker_11': 'You know, it makes me wonder what viewpoint is being represented when our renters are coming before that body. But anyway, it's surprising to hear that from from somebody who's supposed to be advocating on behalf of renters in the city.'",
        "'speaker_11': 'First off, I'm a sailor. I live in Alameda. One of the reasons I moved here was because of the maritime focus of this community. And I understand that Swenson's in the boatyard and the community there is sort of it's regionally significant to the Bay Area's boating and sailing community.'",
        "'speaker_11': 'And, you know, I hope that the. The maritime community in Alameda and in the Bay Area doesn't allow themselves to be used as pretext for people who really just don't live a block away from the marina and don't want any housing built across the street from their house because, you know, they want everything to stay a certain'",
        "'speaker_11': 'way. I think the sailing community in the maritime industrial community can definitely work with the developer, hopefully to do what it takes to preserve as much. Of that community as possible for the city and for the for the region.'",
        "'speaker_11': 'But at the end of the day, we need workforce housing. We're talking about potentially doing the bare minimum versus starting to make up for 40 years of shirking our responsibilities thanks to things like Measure. I mean, we're talking about potentially a hundred plus or minus, give or take affordable housing units at a place like Alameda Marina, potentially'",
        "'speaker_11': '. And using leveraging that to pay to fix the city's asset, which is the working waterfront and preserving that for the next generation. I mean, right now we're using that land to store wealthy Alameda and Arby's while, you know, many families are struggling just to hold on to the roof that they have.'",
        "'speaker_11': 'There's lots of options. You know, I think the staff report outlines some of the trade offs very well. I mean, looking at the Tidelands Parcel and Arsenal terminals for potential programing of dry storage hoisting capabilities, I don't know about boatyard, things like the northwest corner of Seaplane Lagoon where the Alameda Community Sailing Center is hoping to be'",
        "'speaker_11': 'relocated west of site. That's a natural complement to something like dry storage or even a boatyard, you know, capability. But we can you know, these are solvable problems and housing is not. At odds necessarily with preserving the maritime jobs at the site.'",
        "'speaker_1': 'Thanks. Thank you. Royal sailor Laura Thomas and then Karen Bay.'",
        "'speaker_8': 'Madam Mayor, city council members and royal sailor. I'm with renewed hope and I'm coming here to show my support for housing, affordable housing, which I think is very important. I like what Andrew's made a point with is that housing pays for infrastructure that we need and that the city council, I think, you know, understands this issue pretty'",
        "'speaker_8': 'well that we need to do something. I think the economy's distressed and when the economy is distressed, it provides political forces that go behind these sorts of development of our city. So I just want to encourage the city council and the mayor to move forward on developing and plenty of affordable housing.'",
        "'speaker_8': 'And I just want to thank Brian for his articulate statement a moment ago. Thank you.'",
        "'speaker_1': 'Thank you. Laura Thomas. And if you want to speak on the sign in, please turn in your slip.'",
        "'speaker_12': 'Good evening. Counsel for Thomas from Renewed Hope. I want to say that I actually first came to Alameda because the man I was going to marry lived on his Cal 34 enforcement basement, then called the Alameda Yacht Harbor.'",
        "'speaker_12': 'And at the time, he took me sailing up the estuary one day and he described everything along the way. And it was fascinating. It was a world I didn't know anything about. And yet I grew up a few blocks from the Oakland side of the estuary.'",
        "'speaker_12': 'I actually think it's a world that most Alameda don't know anything about either. And and I think bringing housing to part of the Alameda Marina site would actually solidify the maritime tradition in this city. It would bring more people into the onto the marina.'",
        "'speaker_12': 'They would be able to live there. They would have interaction with the maritime uses that are there. And it probably would enhance and strengthen the economic viability of Alameda Marina. Ultimately, yes, there's a lot of development going on on the estuary, taking over areas that have been moribund.'",
        "'speaker_12': 'Yes, we need to preserve the recreational activities and the jobs that the maritime. Industry offers now and we can create new possibilities for it. We would be poorer without the maritime presence on that part of the estuary. The reason but we can't shut it off from the public and keep it as a museum.'",
        "'speaker_12': 'Of the past, adding housing won't detract from it. In fact, if you really like I said, if you want people to respect Almeida's maritime history, I think that people living in there among the docks, the cranes and the small sailing shops is a good way to really enhance people's interest in boating.'",
        "'speaker_12': 'If there are only two boatyards left in the city, it's not because housing pushed them out. It's because. Again if I have to get personal. My last marriage ended because of a boat. Because keeping up boats, paying slip payments is very expensive.'",
        "'speaker_12': 'And, you know, I think the fact that there are fewer boatyards is a lot to do with people's ability to maintain sailboats more than anything else. And if you have more people living near the waterfront, I bet there would be more people able to sail and maybe more people would have boats and maybe, maybe even we could'",
        "'speaker_12': 'offer affordable slips. That would be a good idea. So. Okay. I think it's educational and salubrious for people who work over computers all day to get down to the water and maybe even live near it. I think you can have your cake and eat it too.'",
        "'speaker_12': 'Here. Because the money from the housing will will enhance this area, will support the infrastructure. I also want to say that we've spoken renewed hope has spoken to the developer. We know that they're interested in a partnership with nonprofit, affordable housing people, which means we can get some low income housing there.'",
        "'speaker_12': 'We might even be able to get a higher proportion of housing than the 15% we usually get. Maybe we could get 20 or 25. Okay. And I guess that's it. That's all I have to say. Thanks.'",
        "'speaker_1': 'Thank you. Aaron Bey and then Maggie Sabol, Rich Savage. Thank you. And then Mike O'Hara.'",
        "'speaker_7': 'Good evening, Mayor Spencer. Members of the city council and staff. I just wanted to start off by sharing some news that I thought was pretty exciting for the East Bay in general. One of the largest construction and engineering companies at AECOM is close to leasing 120,000 square feet at the Lakeside Tower.'",
        "'speaker_7': 'Kaiser They are going to be bringing over 600 new jobs. And these are.'",
        "'speaker_8': 'Construction.'",
        "'speaker_7': 'And engineering jobs. So that's.'",
        "'speaker_8': 'That's a big signal.'",
        "'speaker_7': 'That something exciting is happening in the East Bay and. I think we are uniquely positioned to take advantage of whatever is happening out there. Alameda The Northern Waterfronts is a great asset, and the Alameda Marina project, I think is is a great project from what I've been hearing.'",
        "'speaker_7': 'We have the potential of adding new jobs. Mix a mixture of uses. Let's see. The last time I read the marina village is about 80% leased. Harbor Bay is almost completely fail filled. Alameda Point is positioning itself for new jobs with a third ferry terminal.'",
        "'speaker_7': 'But it's important that we continue to create an environment to attract jobs. Housing is very a very important component of creating the environment. That's what employers are looking for. Are you creating the environment for me to move my company and move my employees here?'",
        "'speaker_7': 'If you start talking about no homes, we don't want any homes. That's a that's a flag. And so I invite you to be careful of the words that we speak. We want to continue to position ourselves to attract jobs in Alameda.'",
        "'speaker_7': 'Again, the northern waterfront is one of the greatest assets. And I'm telling you, we have a tremendous opportunity with mixed use development to serving the jobs that are there, adding new jobs, increasing improving our infrastructure and planning for the next ten, 20 years.'",
        "'speaker_7': 'That's what this is about. So I invite you to develop the northern waterfront, look at it as a tremendous asset, a tremendous opportunity for growth.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Maggie, survive it. And then Mike O'Hare.'",
        "'speaker_3': 'Mayor Spencer. City Council members. Staff. Here again this month representing the Pacific Inter-Club Yacht Association, an association of 106 Bay Area Yacht Clubs. And we also sponsor recreational boaters of California, representing the individual interests of boaters up and down the coast.'",
        "'speaker_3': 'We are obviously in favor of the mixed use component approach. And I remember when we first had our meeting, the first meeting I came to in December and it was brought up that Alameda Marina was being considered by a developer or a site of 500 plus housing units.'",
        "'speaker_3': 'And we looked at the. Developers outline and you could see sort of a ghost outline of these boats. In the marina facility without parking for the owners of those boats. Without dry storage for those boats when they come out of the water and have to be painted and maintained by all the businesses there.'",
        "'speaker_3': 'And it was very clear to all of us, the developer historically has not been involved in maritime projects and had no ultimate. Desire to support the boating component. That's why we as see why eight representatives, delegates, members throughout California became very concerned because as others have mentioned, this is a primary resource for voters.'",
        "'speaker_3': 'In the San Francisco Bay area other than going to San Francisco that has one boatyard. And perhaps going all the way to Vallejo. And by the way, I'm a member of the Vallejo Yacht Club, as well as the Oakland Yacht Club.'",
        "'speaker_3': 'And right now, as far as money and revenue is concerned, the developer who has bought into that property is currently not really utilizing. The property effectively. I have had many friends and acquaintances who say to me, What is going on?'",
        "'speaker_3': 'We're being turned away at the Alameda Marina when we want to leave our boat there, because it's always been an excellent source of both services for boats. I want to bring my boat in. I want to have it serviced at Swenson's.'",
        "'speaker_3': 'I'm being refused. So as I understand it, and I don't know exactly the proportion the city derives income from the activity of the boatyard, and seemingly boaters are not being allowed to utilize the boat yard at this point in time.'",
        "'speaker_3': 'So I think we need to rethink and go back to the original usage. And perhaps, you know, I suggest in live work initially, if you have people in a normal development, they don't particularly like looking at cranes, they don't particularly like hearing loud welding noises all day long in spite of the fact that someone else considered that'",
        "'speaker_3': 'somewhat romantic.'",
        "'speaker_1': 'At any rate, I wind up.'",
        "'speaker_3': 'I think we need to maintain it as it is with live workspace and utilize it property and properly and also use monies that we may be able to access from the State Department of Boating and Waterways in addition to federal.'",
        "'speaker_1': 'Okay. Thank you very much, Mike O'Hara and then Brian Schumacher and Paul Mueller. And our last speaker is Alan Hebert.'",
        "'speaker_11': 'Leaving Mayor Spencer, members of the City Council and staff. My name is Mike O'Hara. I'm here. Creating quite a mood.'",
        "'speaker_0': 'Taimur apparently had no.'",
        "'speaker_8': 'Right. Thank you.'",
        "'speaker_11': 'I'm Mike O'Hare here from Tim Louis. Communities representing the internal terminal site. First of all, I wanted to thank you and commend you for your desire to make the most of of truly a tremendous asset that a lot of people have spoken to tonight.'",
        "'speaker_11': 'Your commitment to the Northern Waterfront exhibited by your tour last month is is commendable and I think was very helpful to you all to to see the challenges and the and the assets of each site firsthand and to see just how massive some of those opportunities would be.'",
        "'speaker_11': 'We're certainly glad to have you there. And we recognize and appreciate your desire to continue to guide the development of these sites. What you saw it and answered all terminals was really a blank canvas. Couple of vacant buildings.'",
        "'speaker_11': 'And really the opportunity is, as Andrew laid out, is is how best to make use of those 22 acres of upland property surrounded on three sides by water. How best to implement the the guiding principles already included in the Northern Waterfront Plan that dictate how it how it is to be developed?'",
        "'speaker_11': 'We've spent the last three years evaluating the costs, which are many. Similar to the Alameda Marina, site of $30 million in infrastructure, $12 million of which just to go to to fixing up the wharf. So we feel like we've we've we understand that quite well, but we also understand the opportunities.'",
        "'speaker_11': 'We spent the last eight months out in the public eye hosting site tours, hosting neighborhood meetings, giving the Alameda residents an opportunity to give us their feedback and their input as to how they want to see that we're we started our process with the planning board, had a workshop with them in January.'",
        "'speaker_11': 'We look forward to getting back with them next month using the Northern Waterfront plans and plan. And as the general plan policies is the guiding principles we're implementing, the feedback that we've received from the public into our master plan.'",
        "'speaker_11': 'As such, we're fully engaged in the process with with the city and engaged in the process of the general plan mandates for northern waterfront sites, which is to create a master plan. Our master plan then gets vetted fully through the planning board.'",
        "'speaker_11': 'Secret process is completed and it allows a full comprehensive review of all of the project elements, including benefits and potential impacts. For main points I wanted to make tonight. We value the iterative process that is part of the planning board process and working with you all.'",
        "'speaker_11': 'Each site is extremely unique as I think you you have seen to. Public input has told us that that all the sites don't need to provide all things to all people or all all aspects of society. We want to avoid redundancy and create unique opportunities that excite the general plan policies we think are a great framework for'",
        "'speaker_11': 'for the development of the site. There are a couple, as Andrew had mentioned, that that we look to engage the public in with regard to height and and and and density and how the density spread out there. But we we want to urge you to not necessarily direct changes, but embrace the general planning policies that already exist'",
        "'speaker_11': 'and allow us to to create the most of that mixed use hub that we've created at at the Domani warehouse, extend it further north and use the mixed use approach approach with a commitment to the public waterfront access that the Northern Waterfront Plan mandates for this site.'",
        "'speaker_11': 'So appreciate your time. Look forward to continuing our dialog through the approval process at the Install Tool site.'",
        "'speaker_1': 'Thank you. Thank you. Brian Schumacher and then Paul and then Alan and then Gretchen. And if you'd like to speak on this item, please turn on your slip.'",
        "'speaker_11': 'I had a mayor and council members and staff. Thanks for all your work and for giving us each of us a few minutes tonight. To let you know what's important to us. I appreciate the work that Andrew and his staff have done with the S&D Group and with Anti Hurt, and I will leave all that technical material'",
        "'speaker_11': 'to them. I just wanted to give a little personal and historical comment tonight and I will be brief. Over 35 years ago, when my wife Kathy and I left San Francisco and moved to the island city for its charm and surrounding water.'",
        "'speaker_11': 'And we made it home here and we raised our family and have sailed small boats out of the boat clubs and marinas that dot the shoreline. Alameda Marina was one among many in the seventies and much more recently when the city identified Alameda Marina as a place for more housing.'",
        "'speaker_11': 'But it strikes me that today there are many places for housing remaining. But the marina is the last one with significant, substantial facilities, and without that, there would be little left of the boat sales and repair businesses that support or of Alameda.'",
        "'speaker_11': 'This maritime heritage that many have spoken about which was active until as late as the 1930s as the winter home of the Alaska Packers. Tall ships sailing fleet. I. Would close with the thought that if folks who aren't crazy about public speaking like myself, are willing to get up.'",
        "'speaker_11': 'If there's one of me, there are ten or 100 or maybe a thousand or more out there. We're kind of thinking these same things.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Paul.'",
        "'speaker_8': 'Well, one thing when it back in the forties and fifties when they were changing the waterfront from what it was during the war, they put the new pilings up in the new stuff. They didn't quite demolish the old ones.'",
        "'speaker_8': 'They left them hanging there. And when you guys look at the waterfront and take those pictures of the horrors, you are taking pictures in many cases of stuff that should have been removed 50 years ago and is of no significance.'",
        "'speaker_8': 'It's just ugly and pitiful. And I'm not saying that's not time to change things, but it's very easy to get an impression that it's much worse than it is because you're looking at garbage that should have been removed, but wasn't because nobody funded getting rid of it.'",
        "'speaker_8': 'Now I'm at a dry sale, though. I don't call myself having a I don't like to take my boats like a storage. I don't store my boat on the marina by the hoist. They sail it at it from the hoist.'",
        "'speaker_8': 'I've been doing that since the 1980s. There's a whole lot of people like me. I don't not live in Alameda. I live in Oakland, and I've been doing it since then. For a long time, I rented a shop on Clement Street and worked on boats there.'",
        "'speaker_8': 'A lot of the people I sailed with on Friday night in the races grew up in Alameda, but they moved to Walnut Creek. They moved to Concord. That's where they live now. But their boats are at the Alameda Marina.'",
        "'speaker_8': 'So don't take that figure and say 40 only 40 boats in the marina alone. Two people in Alameda just thrown the rest of us out. I mean, we are we are we are part of the life that's there.'",
        "'speaker_8': 'Now, look, when you look at the boats in the water sailing all around all the time, the ones you saying, a lot of us that were dropped in those big boats that are sitting in the water not to dry sailed.'",
        "'speaker_8': 'Once people get in those, they motor out to the end of yesterday. They pull up this house and they go sailing. The boats that give you this life in the marina are very often the dry seal boats that we are popping in the water every day or not every day, but every weekend.'",
        "'speaker_8': 'And that in the sailing, that's what it comes from. So keep that alive. I agree with you. You get rid of half of them. That. I agree with that. But that that's a cut. But keep plenty of room for the ones that are there.'",
        "'speaker_8': 'Now, the only other thing I'm going to add on quick is there's an opportunity for all of you. I'm at the Island Yacht Club and we're going to put on a memorial Day week on Memorial Day weekend on Saturday.'",
        "'speaker_8': 'We're going to have a open house normally with an open house to the clubs, so to get members in. But this time, we're going to try and throw it open to the marina, invite the community into the marina, and we could take them for a boat ride.'",
        "'speaker_8': 'There's a reason we do it on the Memorial Day weekend, on the Saturday on that Saturday afternoon. Every year, for as long as I can remember, the Master Mariner fleet sails into the Alameda after the whole day of having a regatta out in the bay.'",
        "'speaker_8': 'It's incredible to see. These are the master mariners and not old sailors. The old boats. These are the boats from before World War Two. They all come down the marina and tie up right by the snow basin. It's really something now.'",
        "'speaker_8': 'We applaud everybody we can find on boats and take them out and let them see the end of the race and have sail down into the marina. I invite you from the city to come and I invite everybody from the community to participate in that.'",
        "'speaker_1': 'Thank you, Alan. Alan Heber and then Gretchen Lipo. And those are our last two speakers. If you want to speak on this item, please turn your slip.'",
        "'speaker_8': 'Hi. I'm Alan. He wrote, and I don't live in Alameda. I live in Menlo Park. I drove up here at rush hour. Why would I come from Menlo Park? Because for years, I had my boat in the Alameda Marina because the Alameda marina is not just another place to do this stuff.'",
        "'speaker_8': 'It actually is a unique community. There really is nothing quite like it. And it's important enough to me that I got in my truck after work and came up here to talk to you. The dry storage is my particular concern.'",
        "'speaker_8': 'Storage for ARVs is one thing. Storage for boats is something else. You can't just put a 25 ton gym. You want a 25 ton hoist in your backyard, maybe, you know, pick up some of the you don't want.'",
        "'speaker_8': 'Okay. It's not hard to put a 25 ton hoist on the ground. It's really hard to find a place where the water, the land, there isn't overhead. Power is really short. All that stuff that you need is there.'",
        "'speaker_8': 'It's just kind of not everywhere. There is there are several hoists around the Bay Area. There are two places in the San Francisco Bay Area where you don't have to be a member of the club to get to use the hoist.'",
        "'speaker_8': 'Richmond and Alameda. I was in Alameda for quite a while until I was evicted for doing something that well that some folks didn't like. So I was evicted and I moved up to Richmond. And so now instead of spending money at Chevron at the corner of Buena Vista and Park, instead of having breakfast at all lofts on'",
        "'speaker_8': 'Park, instead of spending another 20 bucks at Pagano Hardware because I need a tape measure all of that money I'm spending in Richmond because I'm not here anymore. In fact, I've been here once since I was asked to depart.'",
        "'speaker_8': 'One other time. This is the second time to talk to you. Because what's out there is not just another conglomeration of brown buildings. Right. It is a community. It's a unique resource. And it's just like. You ever been to a Giants game between Giants game?'",
        "'speaker_8': 'Yeah. You've been rejected. How could you possibly go to a Giants game? You don't live in San Francisco.'",
        "'speaker_2': 'I'm a San Francisco native, and I could take the ferry from Alameda to there.'",
        "'speaker_8': 'Yeah. Yeah, exactly. Son of a gun. So I would. You've got a regional resource here. You know, it's not just Alameda. It's something kind of special enough to get a guy to get in this truck from Menlo Park to come up here to talk to you.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_1': 'Thank you very much. Gretchen and she's our last speaker.'",
        "'speaker_8': 'Hmm. I'm hungry. Folks.'",
        "'speaker_3': 'And Madam Mayor and council people. So isn't this wonderful to listen to this unique community of voters talk to you? And I kind of stepped in and was watching the process and reading over some of the documents, looking at the map and realizing that the northern half of Alameda Marina is Tidelands Truss.'",
        "'speaker_3': 'So you can't build anything. No residential there anyway. But looking at the big picture, what's happening on Clement and you know, it's all just wonderful to be able to live by the water, but there's always a price to pay when you overdo things.'",
        "'speaker_3': 'So I started looking at the numbers and I thought, Oh my God, look at this. In the boat works, you got 130. These are all on Clement and you have 52 coming in at 2100 Clement. Then you have the Alameda Clement.'",
        "'speaker_3': '2033 Clement, 240 units. I heard that might be 500. That's that's the instantly terminals 500. Then you have 400 at Del Monte and you have the Arch Whitman Marina Cove at 89 and the Corporation Yards at 41, Pennzoil 64.'",
        "'speaker_3': 'I mean, it goes on and on. So I'm saying, wait a minute, how are we going to get all these folks back and forth off the island at one end of the island here that we're creating a a freeway on?'",
        "'speaker_3': 'Clement So I like to look at numbers and see how they impact reality. The other piece of information I picked up in talking to the committee was that there's 84 businesses and the Army and Marine 84, and that represents about 200 workers.'",
        "'speaker_3': 'Oh, so those are numbers that tell you something. And you've got to numbers are good. They tell you things. They tell you how to think. Thank you.'",
        "'speaker_1': 'Thank you very much. All right. It's 10 minutes after ten. We are going to take a ten minute break and then we'll resume. Thank you. If everyone could please take your seats. We're going to resume. Thank you.'",
        "'speaker_9': 'Excellent.'",
        "'speaker_1': 'Thank you. All right. We're going to resume. And we've now heard all of the public comments, staff's presentation and counsel that it's time for our feedback. Vice Mayor. And it's Your Honor referral.'",
        "'speaker_9': 'Thank you, Madam Mayor. I, I think there was a very good discussion, and I thank staff for the. Guidelines that they submitted to help us frame the discussion. A couple of things that I want to make sure that.'",
        "'speaker_9': 'Get considered as this goes, which I'm assuming will go for some action to the planning board, and then a recommendation to council. Is that one of the one of the reasons I put this referral in not just for Alameda Marina, but all Amex zoned parcels in the city is because there is a dynamic between commercial and residential'",
        "'speaker_9': 'and. We have I think there were three sites that were mentioned that are zoned but are vastly different. We have on one end of the spectrum aluminum arena, where there's a a fairly healthy commercial activity. We have at the other end of the spectrum internal terminals where there's no commercial activity.'",
        "'speaker_9': 'And then we have something in the middle. When you look at ship ways where there is some, I would say a not nothing spectacular minimum commercial activity. But all of these share. One thing is, at one time they were zoned commercial and now they have mixed use.'",
        "'speaker_9': 'So value has been added by this to the city, to property owners for this. And I think the considerations that come with that value added are to make sure that. We maintain jobs that are there and we create jobs there.'",
        "'speaker_9': 'And I think one of if we. I'd like the staff to look very carefully at what Sol put in on their edited guidelines because. They did highlight and this was my main point is for army and especially as maintain the jobs, not encourage I think we need to be stronger in the language and that we need to'",
        "'speaker_9': 'where there's commercial activity that's one of our guidelines is we need to maintain it. Where there's no commercial activity, you need to create it. And I think that's another policy statement that we have to elevate because and I just watched how the presentation went on the internal terminals and the end of the presentation.'",
        "'speaker_9': 'We, we do what often happens and I'm guilty of it myself. Not having been on the planning board and the council before is we end up talking about a residential and open space and these are mixed uses that in the final statement it was that the big discussions we were about around residential and open space and with'",
        "'speaker_9': 'almost 50,000 square feet of commercial activity, there's that's not going to be that should be a big discussion and there should be heavy discussion on what is in there and what kind of jobs it's going to create. And that's part of the ticket for being in a mixed use that used to be commercial.'",
        "'speaker_9': 'So I think that's a very important point that I'd like to underscore. Second is, I think we need to be more stringent on the compatibility of uses. Alameda Marina is an industrial site. It's not a light industry or commercial commercial site, so I don't want residents to be surprised or coming to council when.'",
        "'speaker_9': '6 a.m. rolls around and a tractor trailer runs in or there's sandblasting of the hull or there's other heavy industrial use. So I think the deed restriction idea and not just disclosure, but deed restriction is something that we should.'",
        "'speaker_9': 'Evaluate to protect the businesses that are there. The anecdotal discussion around Emeryville, where I worked for many years, was when the the. Residents came in, the businesses had to move out. We were the beneficiary of actually two of those businesses, semi Freddy's and Pete's coffee roasting because they were incompatible all with the residents that that moved in'",
        "'speaker_9': 'next to them. That was the anecdote. I want to make sure that we avoid that anecdote. We also, I think, have to consider the. In every mixed use setting the interface between residential and commercial so that we heard the complaints about lights at VF Outdoor.'",
        "'speaker_9': 'That's one of those one of those interface issues. We're going to have a project coming toward the council, the council at some point of Taylor and Webster Street. And there has have long been. And problems that have come up between people who live right next to restaurants or bars or wherever you are in the community commercial district'",
        "'speaker_9': '. I think we have to do an enhanced set of policies that deal with that interface as well. The other point that was brought up, that's I think a step toward compatibility with the with a site like aluminum arena is the notion of work live, even though those don't count to our residential component.'",
        "'speaker_9': 'I think they provide. They might provide the market rate. Income that the developer needs to provide affordable housing or whatever other amenity is needed or whatever other infrastructure cost is going to be incurred in that property. I think those key points along with making sure that again we elevate the goal for the property go for the for'",
        "'speaker_9': 'Alameda marina is to make sure that we take advantage of the many mariners that are here and preserve and develop the maritime related businesses and a clean slate operation. I think one of the directions that I would like the planning board to consider in this council to consider is what what jobs are you delivering?'",
        "'speaker_9': 'As part of that discussion and not have it ended up being a question of just how much open space can we get. But you've got 50,000 square feet of commercial. How many jobs. And then I think we need to keep our eye on the ball on on as Mr. Thomas mentioned of.'",
        "'speaker_9': 'Allocating those numbers toward our regional housing needs allocation and looking at where we are. As we go through each side application. Those are my comments.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'I'm going to. Member, Brody.'",
        "'speaker_4': 'Thank you, Madam Mayor. I want to thank everyone who came out. I thought this was a very interesting discussion. I really enjoyed hearing the various perspectives. So but just a couple of quick comments to begin with. I'm a little bit concerned when we use the word surplus when it comes to housing, because I don't know anyone who'",
        "'speaker_4': 'lives in the Bay Area who believes we have a surplus of housing. I mean, we do have an excess of what we've committed in our state arena numbers, and that gives us some wiggle room to play with. And, you know, we could reduce it here and there and, you know, we can eliminate some projects if we want'",
        "'speaker_4': 'to. We could down zone some projects if we want to. But, you know, 90,000 people moved to Alameda County last year I'm sorry, the Bay Area last year, 25,000 to Alameda County. So to say that we have a surplus, I think we have a shortage.'",
        "'speaker_4': 'And if anything, I think we all have the battle scars, you know, as one of the symptoms of that shortage in in what we did with rents. So we just went through that, that horrible process, you know, of hearing people's tragic stories and try to do the best we can to fix them.'",
        "'speaker_4': 'So but let's just be clear on the narrative that, you know, we do have a housing shortage when you think about it overall. And, you know, to hammer home that point, a couple of weeks ago, I had the honor of attending a meeting with the secretary of Housing, Mr. Castro.'",
        "'speaker_4': 'Congresswoman Barbara Lee was there. Mayor Libby Schaaf Council President McElhaney Our mayor was there are Spencer and she had the opportunity to speak. And, you know, she acknowledged, you know, that we do have an issue with housing. And, you know, she was able to at least bring some positive vibes to the room by saying that we in'",
        "'speaker_4': 'Alameda took steps to to address that with some of our rents. And I think, you know, we're kind of leading the way for other cities because Oakland did a moratorium. But I digress off that. So I you know, I encourage folks to look at the L.A. Report.'",
        "'speaker_4': 'I mean, the L.A. report came from the Legislative Analyst Office, the one from March 17, 2015, that talked about California's high housing cost and causes and consequences. And there was another one that didn't make it into the agenda.'",
        "'speaker_4': 'But when that came out just this year, February 9th, perspectives on Helping Low Income Californians Afford Housing. You know, and one of the things they talked about is that, you know, why do coastal areas not build enough housing?'",
        "'speaker_4': 'And, you know, one of the areas is community resistance and new housing. I mean, it's an issue we hear every day here. We hear it in our emails. You know, there's a difference of opinion on this council. There's a difference of opinion in this community.'",
        "'speaker_4': 'So, I mean, do we you know, do we step up, you know, and do our part, you know, and participate in the solution, you know, or do we continue to be you know, one of the reasons that they list is is why we don't build enough housing.'",
        "'speaker_4': 'So I think that's you know, that's a decision we as a council have to make and we as a community have to make. And I look forward to continuing to have that discussion as we go forward. So if I can just make some quick comments, I think these guidelines were, I think, really helpful as far as this'",
        "'speaker_4': 'discussion is concerned. I'd be hesitant to say whether, you know, we should adopt them or even reject them. I think as far as adopting, they're a little prescriptive. And I also think we have to be careful on exactly what we say and what we do like.'",
        "'speaker_4': 'For example, the application for internal terminals is already there. So for us to go and change that and prejudge that, you know, just like we had the issue with packet landing and I'd be a little hesitant to do that, but I will make some general comments about zoning because I think it's important, you know, that each of'",
        "'speaker_4': 'us communicate, you know, where we are on some of these things without getting in too much into the weeds on each of the individual projects. I mean, so if you look at a staff report, you know, the summary of them zoning says, you know, the required master plan can be customized to respond to the unique characteristics of'",
        "'speaker_4': 'each site and respond to current community expectations and objectives for each site. By providing few specific development standards, the district avoids a cookie cutter approach that would result in every site looking, operating and serving the community in very similar ways.'",
        "'speaker_4': 'The flexibility and the district allows for different community needs to be met at different sites. And I think that's kind of the message that we've heard today, that, you know, the needs of the terminal may be different than the needs at Alameda Marina may be different than the needs, you know, at Webster and Taylor.'",
        "'speaker_4': 'So. I really don't know if that really means to me that we need to relook at zoning, because what what we have in there is the flexibility that we need. If we have a situation like we do at Aluminum Arena or we have businesses, we have jobs that we want to protect, then the zoning gives us the'",
        "'speaker_4': 'ability and the flexibility to do that. So, I mean, if we have a situation like on Park Street or on Webster Street where it's the, you know, commercial zone, quote unquote, our main streets, you know, the zoning gives us the flexibility to do that.'",
        "'speaker_4': 'So I think guidelines are a little bit premature at this time. And I don't even know if listening from the speakers that we had today that we even have an agreement on that. You know, some people want multi-family housing, and that was in the guidelines.'",
        "'speaker_4': 'Some people think there should be no housing there. So, I mean, to adopt guidelines when we really haven't had a full community discussion on that might be a little bit premature in my mind. You know, I there was a question about the historical analysis and I know that's going to be part of the equation.'",
        "'speaker_4': 'I was out there yesterday at Aluminum Arena, thankfully not in the rain this time. You know, and when we saw the picture, you know, there's this beautiful big marina building, you know, that's amazing. That's something that we want to keep.'",
        "'speaker_4': 'That's something that we want to preserve. So I think as we go through that process, you know, all this will come out and the community will have an opportunity to see that. And, you know, I encourage saw and they had some very valuable comments and input and they've been engaged in this process.'",
        "'speaker_4': 'I mean, I don't know if it's from the beginning, but it's now since November. So I encourage them to keep being engaged in that process. Renewed hope, keep being engaged in the process. Work with the developers, work with planning staff and.'",
        "'speaker_4': 'Just you know, the vice mayor called it his goal for the property. You know, I kind of. See. Pretty much the same way that we kind of have a value statement. So what's my value statement? And, you know, I go out there and I see, yeah, we do need to keep our maritime business.'",
        "'speaker_4': 'You know, you go out there and that's the only hoist out there. I saw the painting spot where the boats are painted. Now, do we need all of that, that dry space? You know, I don't know if you have a boat and, you know, you have the catamaran and you fold it up because you start on the'",
        "'speaker_4': 'land and and it can be, you know, a lot less space than you would need it in the water. And some of those catamarans you don't store in the water. So, yeah, we need that there. If you I saw a boat that, you know, it had the shiniest hole in it.'",
        "'speaker_4': 'And I was told that they do that because they want to race really fast. And if they keep waxing the bottom of the hull and they're able to, you know, get through the water really fast. So we need that in there.'",
        "'speaker_4': 'Now, do we need an AC transit bus? I don't know. I don't think so. Do we need a dozen, two dozen shipping containers? I don't think so. We need RV's with flat tires. I don't think so. We need boats that are on trailers that haven't been registered since 2025.'",
        "'speaker_4': 'You know, maybe, maybe not. I mean, that's a question we have to think about. So, you know, my value for, you know, this particular property without pre-judging anything is to preserve, protect, maintain, expand to the extent we can, not only our existing maritime, but, you know, the new economy maritime.'",
        "'speaker_4': 'So I think that's that's an important thing. And, you know, as long as I'm here, you know, I'm going to work to do that and hope that any plan for the aluminum arena does that. Just kind of enclosing.'",
        "'speaker_4': 'One thing that I've noticed since I've been here is. We are an island city and we have a lot of, you know, docks and wharfs and terminals, Olina Bay, where the mayor and ships are docked, Alameda Landing, where there's controversy now over what we're going to build there.'",
        "'speaker_4': 'Alameda Marina Grande Marina took me on a tour, showed me where things are deteriorating. And there's a lot of infrastructure in our peers and our wharves that it just is deteriorating. It needs fix. So I don't know how we're going to afford all that.'",
        "'speaker_4': 'I guess we're going to have to wait to see on these individual projects, you know, how these developments pencil out. But you know, what I'd like to see us do more is trying to figure out a way that we can finance getting these things.'",
        "'speaker_4': 'One gentleman said some of them should have been replaced, I think a few 50 years ago. So we need to figure out a way we can you know, we can find a way to raise money to do that.'",
        "'speaker_4': 'So that's one of my big concerns. So. That's pretty much just make sure I got all my points and I realize, you know, development and housing is always going to be an issue. Traffic is going to be an issue.'",
        "'speaker_4': 'You know, I'm very hopeful that with I'm going to call another day slog, study the TDM plan that we adopted that we're going to start having results on in the next 18 months is really going to help us, you know, address these problems and help us step up and be leadership and just show some leadership on this'",
        "'speaker_4': 'housing issue. It's really important and we need to take care of it. Thank you.'",
        "'speaker_1': 'Member.'",
        "'speaker_2': 'Ashcroft Thank you, Mayor Spencer, and thank you to all of the folks who came out and spoke to us and who have been all along the tours that were hosted in allowing us to come and visit your properties on the water.'",
        "'speaker_2': 'So I've said this more than once, but as a council member, I have to balance all of the different issues that come before me way, what often seem like competing interests. But it is a matter of balance, and I think in this particular case, balance can be achieved.'",
        "'speaker_2': 'At the outset, though, I want to say that I don't believe that we can examine local issues one at a time in a vacuum, because I think they're all interdependent. And so I'm thinking about housing and I want to I have a few themes that I picked out of the the staff report and the exhibits, the letter'",
        "'speaker_2': 'we got this morning from Bay West Development and if they've been repeated in the speakers but one of them is community objectives and your staff report talked about community objectives. And I note that I put in my my margin on my my staff report when I was making notes is that who speaks for the community when we'",
        "'speaker_2': 'talk about community objectives? And I would simply say to you, the community speaks with many voices and we heard representatives of that tonight. So we have let's talk about Alameda, meaning Alameda Marina, because I think that's the the project that has the most controversy because there are existing uses there now as opposed to in El Terminal, which'",
        "'speaker_2': 'is more of a blank slate. So we have a need to preserve the working waterfront, to preserve the maritime uses. I am awed by the work that Liz Taylor of Do our deep ocean exploration research and her folks do out there.'",
        "'speaker_2': 'They let us traipse through and gave us tours. And it's it truly is. It has an international reach. What they've what they've done and and all the others I've known this friends and family for a long time. But I also know, because I know this friends and family, that they do not believe they can continue to exist'",
        "'speaker_2': 'in as large a footprint and as large an operation as they have now. But the developer is working for them. So we need our working waterfront. We need to preserve it. But that working waterfront at Alameda Marina and in fact our other existing waterfront properties needs an infusion of capital.'",
        "'speaker_2': 'Everyone wants those jobs to stay there. They want the uses to stay there. But where is the money going to come from? Development is one answer. And and it's it's also possible. I mean, if we were if you went on the tour and you got to drive all the way around and maybe even got to look at'",
        "'speaker_2': 'an aerial photograph, you can see that the footprint is spread. It's sprawling. That footprint, footprint of maritime uses can be consolidated, preserving all the important uses and jobs that were talked about. And I want, you know, repeat what others have said, but.'",
        "'speaker_2': 'Yeah. RV storage. No. And. Anyway. It's possible to do that on a smaller footprint and still preserve those uses and yet also repair and renovate and restore that working waterfront. But Alameda needs housing, too, and I agree with what Councilmember Otis said.'",
        "'speaker_2': 'We hear about recent numbers, a regional housing needs allocation and that, you know, we've reached our our quotas. Are we we are on track to reach our quotas. And yet I don't think that anybody who's been paying attention to the hours and hours of testimony we've heard before this council in the last year, almost two years now'",
        "'speaker_2': ', can think that we don't have a housing shortage. And, in fact, I, I was very pleased to see the Legislative Analyst's Office report included as one of our exhibits. And it's aptly titled California's High Housing Costs, Causes and Consequences.'",
        "'speaker_2': 'And just a few brief points that it touched on that they apply to Alameda and I think they're significant. The report describes how community resistance to new housing has led to less housing being built all over the state, which in turn leads to higher rents and higher home prices.'",
        "'speaker_2': 'Home ownership remains out of reach for many renters who aren't able to save for a down payment. I mean, we know from studies that more than 50% of our renters are paying more than 50% of their income on housing costs, which leaves especially seniors with choices to make hard choices to make, like whether to refill their prescription'",
        "'speaker_2': 'that month, pay the utilities, they've got to pay the rent. So, you know, let alone saving for a down payment. But save for a younger renter that's their homeownership goal is is remaining quite elusive. High housing costs also lead to longer commutes, and that has implications for all of us, for the quality of the air that we'",
        "'speaker_2': 'breathe. And and this was touched upon by one of our speakers, high housing costs, I think it was Karen Bay, maybe also make it difficult for employers to recruit employees and retain qualified employees because they can't find housing that they can afford near the jobs that they would like to have.'",
        "'speaker_2': 'And this will eventually impact our state's economy. But there's there's hope. It's not all bleak. The the study concludes by saying that local governments do have the ability to promote additional housing and construction and therefore slow down growth, the slowdown, the growth and increase in home prices and rents going forward.'",
        "'speaker_2': 'And I think this is very much what we have an opportunity to do with this project. So mixed use, it is mixed use for a reason. And it's of course that some uses are incompatible and oh, I don't know, maybe the e-commerce guy who's, you know, starts at six in the morning with the trailer trucks backing up'",
        "'speaker_2': 'because I'm not sure that was maritime related. Maybe that really is a use that would be better suited out somewhere in the far reaches of Alameda Point, I don't know. But there is also in some ways this is very much the new urban strategy that people are wanting to live and work closer to the sources.'",
        "'speaker_2': 'And so I would think that the people who choose to live in a place like Alameda Marina, especially Alameda Marina, because that's the working waterfront, would go in with their eyes wide open. And the fact that Laura Thomas of Renewed Hope spoke of her very positive interactions with the developer, the potential and I'm paying attention here for'",
        "'speaker_2': 'maybe more than 15% affordable, 20%. 25%. I know. I've heard the mayor say very similar things about wanting to see higher percentages of affordable housing in Alameda. I think that addresses some important needs that we have as well as providing market rate housing.'",
        "'speaker_2': 'It should be a mix of housing, a mix of uses, commercial, residential, industrial and a mix of housing types. The market rate pays for a lot of the infrastructure, and any housing we add is going to take pressure off the limited supply of housing stock we have now.'",
        "'speaker_2': 'And then I also wanted to talk a little bit about process, and I, I do come down in agreement with Bay with development. Mr. Murphy, who wrote us the letter this morning, it said and it was brought out in the staff report, there is already a process for.'",
        "'speaker_2': 'Making our application, bringing our proposal to the planning board, to the city council. It can be tweaked. I don't know what the problem is we're trying to solve now. It almost seems like we want to be preemptive and not even give.'",
        "'speaker_2': 'A project, a chance to show us what is possible. I will hasten to say, though, that I give credit to the save out me to working waterfront. I don't agree with the amendments you're suggesting, but that squeaky wheel did bring the developer around to many iterations of that plan.'",
        "'speaker_2': 'That got to be more, I think, more user friendly for all users. But. I don't I, I think that it's perfectly fine to let the process as is currently contained in our, our, you know, our what it is we do in it when a developer comes forward, others, those processes, they've worked for us so far.'",
        "'speaker_2': 'We tweak when necessary and otherwise. What's the message we're sending to developers that you came to us with certain expectations and willing to work with within the system and go back and back and.'",
        "'speaker_3': 'Back.'",
        "'speaker_2': 'Trying to refine your project. And now we're going to tie your hands even further. And bear in mind something else that the Legislative Analyst's Office report brought out, that the developer fees that developers in California pay are the highest in the nation.'",
        "'speaker_2': 'So we expect a lot from our developers and they do help us fund our affordable housing, our open space, well needed renovations to infrastructure. But I think we need to play fair at the same time. That's not to say that we throw up our hands and say whatever you want to do.'",
        "'speaker_2': 'Far from it. But I don't think we we changed the rules in the middle of the game. So just to reiterate, our community objectives are expressed by a wide variety of individuals, not just here tonight, but all the folks who've talked about the housing crisis, employers we've heard from, including at Alameda Marina, who have told me we'",
        "'speaker_2': 'have trouble attracting and retaining workers for good jobs, good technical jobs, because they can't afford to live in Alameda. So it's all interrelated. I say we stay the course and I appreciate all the input in the comments and I think we can get some good projects out of it just the way the regulations are fashioned now.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Amber de SAC.'",
        "'speaker_5': 'Thank you. I don't really have any ideological points of view tonight. My main concern is threefold. One is to voice my vision for the area, to make sure to articulate that whatever we do along the northern waterfront or not do is aligned well with our imminent.'",
        "'speaker_5': 'City wide transit plan. Also known as the transit point. Thank you, Mr. Modi. And three let residents and other stakeholders try to work things out. I mean, it's just those three points, that's all. I at the end of the day, I see a project I don't like.'",
        "'speaker_5': 'Not rocket science. Vote against. I voted against the DEL Project isn't convinced about the Trans Eden Plan. I also voted against the Clement Avenue Project right next to McKinley Park in Thompson Field. Likewise, if I see a project, I will.'",
        "'speaker_5': 'Certainly embrace the site, a project. Alameda. Partners project. Let me just go over those three points. Vision. My vision for the area is a viable working waterfront area here in the viable, working waterfront area. To me, that's as important as the ship anchor on the flag of Alameda.'",
        "'speaker_5': 'A city whose maritime traditions as far back as the day Alameda came into existence. 160 year 102 years ago to this day on April 19th, 1854. In terms of the citywide transit implementation and the emphasis is on the implementation.'",
        "'speaker_5': 'That's important. The reason why I like to cite a Alameda point was because Joe earned a contract, not just a policy commitment, not just some vague document that he could point to, but he made a contractual agreement to do a 15 minute shuttle that would come every 15 minutes in the peak hour mornings.'",
        "'speaker_5': 'What that meant is the typical commuter would only have to wait on average 7 minutes for the shuttle. 7 minutes b eight point. And so that, in essence, was a real e e touch. It was a type of solution.'",
        "'speaker_5': 'Likewise, you know. Thank you very much, Mr. O'Hare. I appreciate all the efforts of TLC and everything, but I really wasn't too convinced by the team plan. But I think as a result of that, that we started this process of really putting together a transit strategy that that we can implement, and that's going to make a real'",
        "'speaker_5': 'dent. So whatever we do at the Northern Waterfront, particularly the aluminum arena site or the INS and out terminal site, you know, that's still a sticking point. I want to know that that and that it will result in real usage of alternative modes of transit.'",
        "'speaker_5': 'Finally, you know, my feeling is let the residents. I've met frequently with many of the residents that the residents and the stakeholders try to work things out. I have to believe that when I see the set of people coming to this issue, when I see is Freeman or Mr. Woodard or Ms. heard that these are people who'",
        "'speaker_5': 'can find common ground with the project proponents. It won't be easy. But, you know, let the process work itself out, because I am confident that at the end of the day, we'll have an outcome that we can all be proud of.'",
        "'speaker_5': 'So my encouragement is for people to get in there and. I think the question on the table tonight is whether we should change the guidelines that are in place with regard to the mixed use project. My sense is that.'",
        "'speaker_5': 'I like to see a palate, to speak with as many colors as possible so that we can paint the best possible pictures that Alameda can be proud of. If we begin to limit the type of colors, um. I wonder how that will affect.'",
        "'speaker_5': 'The picture that we're all striving for to require compromise in all. That's about it. I mean, at the end of the day, you know, if there's a project I don't like. Vote against it. In the day. I am.'",
        "'speaker_5': 'To people either. But a before. But I'm confident that we can have a process out of which, you know, everyone will. Something will will result that people will be proud of.'",
        "'speaker_1': 'All right. Thank you. I also want to thank everyone who has spoken on this issue and emailed us and reached out to us in different forms. When I look at this, I have concerns about asking us to actually put something in writing and vote on something just like I did on the Harbor Bay Club issue.'",
        "'speaker_1': 'I think I appreciate the opportunity to give feedback. I think that is important. I think it's important to give feedback as early as possible because at the end of the day, I would prefer a project I would be able to support, and that's how we can communicate so that hopefully the developers out there have the opportunity.'",
        "'speaker_1': 'I think it's fair to give the developers an opportunity to hear from us and our priorities and regards the community objectives. When I look at that, we have had feedback and when it comes to voting on the project, I think that's what we are doing.'",
        "'speaker_1': 'We are voting on behalf of the community and that's how that works. My priority and I appreciate Andrew Thomas speaking about this, we also not only have and I'm going to say, a shortage of housing, of affordable housing and workforce housing.'",
        "'speaker_1': 'I do not think we have a shortage of market rate and housing. The people that come and complain and express their concerns and are being displaced and which I spoke to at the meeting that member already spoke, referred to, truly, it is people that have lived here forever and are being displaced, are being pushed out of our'",
        "'speaker_1': 'community. And the market rate housing that is being offered, unfortunately, is too high. They can't afford it. So when I talk about housing and the need that I see is actually affordable and what I'm going to call workforce mid level housing.'",
        "'speaker_1': 'And I and I really hope that when developers and, and I'll say the 10% or 15% of affordable and maybe no no middle housing. I don't think that solves the problem. I really do think we need developers interested in building housing that people in the.'",
        "'speaker_3': 'Middle can afford.'",
        "'speaker_1': 'And how. Okay. And in regards to the waterfront specifically, I would like us to look at a liveaboard. That is something that I hear that people actually cannot find a space to live aboard and they would like to have that.'",
        "'speaker_1': 'And that is another type of what could be more middle rate housing, smaller and it's multi-use, so that if someone can is interested in using a boat that possibly they could live on it. And I would like us to look at offering more liveaboard and and considering if there's a way to have that actually count towards our'",
        "'speaker_1': 'housing, that that's another thing we are encouraged to build or to have available the work live. I think that that should count towards our housing. I think that when we as a city are building housing, that doesn't count.'",
        "'speaker_1': 'That doesn't make any sense to me, and especially when we're looking at areas that have housing overlays and whatnot. I think all the housing where people are going to be living should count towards those numbers because at the same time, in regards to a balance, we are trying to offer jobs that are middle, mid-level and high level'",
        "'speaker_1': 'jobs where people can actually have a job here in town and be able to live here ideally. Which means to me, the low end, which is mostly retail, does not get us there. I think it is critical that we support the remaining waterfront working waterfront that we have and.'",
        "'speaker_1': 'And try to support it and actually enhance that. We are one of the few, as we've heard, areas in the area that have that in regards to being able to see the sailboats go by. We love that. We embrace that as our maidens.'",
        "'speaker_1': 'It is on our flag. I appreciate all those comments and it is something that anyone that's coming up with a plan for a big area, which some of these are one of these areas I think is for over 40 acres.'",
        "'speaker_1': 'Let's think about how do we protect those jobs and the maritime. That's that's what we like. And. Okay. I want to hit some other points real quick. The historical buildings, I think that is also very important. We figure out a way we we support the historical buildings.'",
        "'speaker_1': 'That's another important part of Alameda, the the height of buildings. Okay. As you're driving down climate right now are playing a vista more and more, you cannot see the water at all. We get to see these high buildings.'",
        "'speaker_1': 'That's to me not ideal. And hopefully some developer can figure out a way to make it so that we can actually see the water. We do live on an island and access for the community to the waterfront to actually be able to see it now.'",
        "'speaker_1': 'To me, that does not mean and I appreciate vice mayor's comments when you put residential right next to industrial. We get complaints, someone's going to get pushed out. And unfortunately, in this situation, I think it will be the industrial.'",
        "'speaker_1': 'And to me, that is the priority in that area. So it has to make sense. Any work with would have to be people that somehow know that there's going to be noise out there.'",
        "'speaker_0': 'The 11:00 and 11:00.'",
        "'speaker_1': 'AM, we need a motion to continue requiring three votes. Do we have a motion? Ocean all second. Okay. All those in favor. I like most officials, though, as far as I understand. Is that correct? Motor. Okay. It's 11:00, which means next time I'll try to go first.'",
        "'speaker_3': 'Thank you. Yeah, because I.'",
        "'speaker_1': 'Get cut off. So I appreciate working with a council that does this.'",
        "'speaker_6': 'And so.'",
        "'speaker_0': 'The direction that staff.'",
        "'speaker_1': 'Heard.'",
        "'speaker_3': 'Is.'",
        "'speaker_0': 'That.'",
        "'speaker_1': 'We are at the club, we are over.'",
        "'speaker_3': 'The developer.'",
        "'speaker_0': 'Will start the process at the planning board.'",
        "'speaker_2': 'Tomorrow. The manager.'",
        "'speaker_1': 'The mikes should be off this note this.'"
    ]
}