{
    "Adoption of Resolutions Appointing Ben Finkenbinder as a Member of the Golf Commission; Reappointing/Appointing Bachir Hadid, Elizabeth Kuwada, Sandra Kay, Kenji Tamaoki, and Vadim Sidelnikov as Members of the Housing Authority Board of Commissioners; and Appointing Xiomara Cisneros and Reappointing Ron Curtis as Members of the Planning Board.": [
        "'speaker_1': 'Okay, perfect. With that, we move on to our regular agenda item. And this next one is a very fun one. This is where we are going to adopt resolutions, and I hope we can just do it as one vote on all the resolutions because we are going to approve appointments to the Golf Commission, the Housing Authority Board'",
        "'speaker_1': 'of Commissioners and the Planning Board this evening. And Council Riviera has your hand up. You want to and.'",
        "'speaker_5': 'I just wanted to go ahead and make a motion for approval and to thank the mayor for her hard work in in terms of I know you went out and interviewed a number of key and it took time to interview the candidates and also thank all of the applicants who put in and who are going to be'",
        "'speaker_5': 'serving in this volunteer position. So with that, I move approval.'",
        "'speaker_1': 'Thank you. Do we have a second question? Every second. And I just and I've said it before, I have just been overwhelmed by the amazing and very generous and community oriented members of our community who have wanted to serve.'",
        "'speaker_1': 'And so let me introduce them to you now as they as they appear on the screen. We have been thinking Binder, who is and you appointed to the golf commission. And we have I see Elizabeth Calata and Basheer Hadi and Kenji Tamaki are all appointees to the Housing Authority Board of Commissioners.'",
        "'speaker_1': 'And there is four dame sit down the court he's appearing and what about okay there's Sandra kay figured that there's the housing authority board of Commissioners right there. And then coming up on screen for the the planning board are Ron Curtis, who is our incumbent, who's returning for another term.'",
        "'speaker_1': 'And Seema Cisneros is also an appointee. Is Ms.. Cisneros in the house?'",
        "'speaker_2': 'We we don't see her name on the list of attendees. If you are here, if you could raise your hand, perhaps hear something under some other name or university.'",
        "'speaker_1': 'Yeah. So tomorrow, if you're out there, raise your hand against your hand either. That's okay. We will make arrangements to administer the oath. But first, I believe we need to. So we can.'",
        "'speaker_2': 'Just can take the vote, and then I can administer the oath. Yeah.'",
        "'speaker_1': 'So we've we've we've had the motion to approve this ordinance or the resolution appointing all these fabulous people to their positions. And maybe we have a roll call vote, please.'",
        "'speaker_2': 'Councilmember de SAG.'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'Yes.'",
        "'speaker_6': 'We're there already. Thank you and welcome. Yes.'",
        "'speaker_2': 'Odie.'",
        "'speaker_3': 'Congratulations, I.'",
        "'speaker_2': 'I may. Or as the Ashcroft.'",
        "'speaker_1': 'I think, five eyes. All right. Perfect. And now I believe these folk will administer the oath of office. Is that correct?'",
        "'speaker_2': 'Correct. If you don't mind standing and raising your right hand. Sorry. I know it's a bit to juggle with the Zoom situation, but if you're able and then if you raise your right hand, do you solemnly swear to uphold the Constitution of the United States and the Constitution of the State of California, and that you'll well and'",
        "'speaker_2': 'faithfully discharge the duties upon which you're about to enter?'",
        "'speaker_6': 'Yes. Yes, yes.'",
        "'speaker_2': 'Thank you. Congratulations.'",
        "'speaker_1': 'All right. Well, thank you all so much for your for starting your new terms. And we are grateful the community is grateful for you, for the hard work you're going to do on behalf of all of our residents.'",
        "'speaker_1': 'So many thanks to all of you. Take care and stay safe.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. All right. And then we will move right along to item six B, which is a recommendation to appoint as our new Alameda Poet Laureate Kimi Ciccio OC. And I want to tell you a little bit about this.'"
    ],
    "Recommendation to Receive an Update on a Strategic Plan for Addressing Homelessness in Alameda. (Community Development 267)": [
        "'speaker_1': 'Okay. All right. So with that, we will move on to item six C.'",
        "'speaker_2': 'Recommendation to receive an update on a strategic plan for addressing homelessness in Alameda.'",
        "'speaker_1': 'And who is presenting that? Oh, look, we got her back. Our wish was granted. All right, whenever you're ready. Go ahead. And Mr. Potter.'",
        "'speaker_0': 'Okay. So, yes, it is my last meeting. And so I have a really easy job tonight, which is introducing Anna back to us, who is our new development manager in charge of homelessness. And she's going to provide a presentation.'",
        "'speaker_0': 'And she and I, along with Lois Butler, who is the who will be standing in as the interim committee development director next week, are all available to answer questions. With that, I would ask Ed, we have we have a she has a brief PowerPoint, so hopefully we'll get that set up.'",
        "'speaker_0': 'Okay. Thanks.'",
        "'speaker_1': 'Start screen sharing. Looks good. Take it away. Hi, Miss Baptiste. And my bet is you need to unmute. Prager, can you hear me? We have perfectly.'",
        "'speaker_4': 'Perfect. Okay. Good evening, Madam Mayor. And members of the City Council. It is difficult to follow Ms.. So Gilchrist's poem and her presentation. But I will try. And I really appreciate what she said about Alameda being a community for for everyone, its community together, because addressing homelessness is really about addressing it as a community.'",
        "'speaker_4': 'Thank you for this opportunity to give you an update on homelessness in Alameda. And on March 28th, 2018, which was my first week as a city employee, council, adopted the first Alameda Strategic Plan, and it's called Alameda Homelessness Report.'",
        "'speaker_4': 'This was jointly developed by the Social Service Human Relations Board and the Housing Authority. We have been using this report as our strategic plan for homelessness in Alameda. And please move onto the next slide. So you'll see in this report there are four policy recommendations that were presented to address the immediate needs of our unhoused residents, as'",
        "'speaker_4': 'well as develop long term solutions to end homelessness. Today, the city of Alameda offers 20 different programs, of which 14 were made possible through the $725,000 in Keep or Homeless Emergency Aid Program funds allocated to the city by the state as well.'",
        "'speaker_4': 'City Council has been funding the public outreach program since 2016 and has dedicated funds for initiatives such as the Parking for the Homeless Parking Meter for the Homeless Program Planning Grant for the Health and Wellness Center on McKay Avenue.'",
        "'speaker_4': 'And the new program that will be starting in Alameda at the this month called BLOCK by BLOCK. To be able to end homelessness, however, we need housing. Eden Housing 20 unit for low income seniors opened this year. Their next project, a 70 unit housing for low income and homeless families, is opening next year.'",
        "'speaker_4': 'About 300 new housing units for the homeless and low income are in the pipeline and are expected to become available in 2 to 5 years, including North Housing. The Alameda Health and Wellness Center and the Reshape Project. If we plot these projects along a continuum of care and evaluate how we are doing with the policy recommendations in'",
        "'speaker_4': 'the homelessness report. This is what it would look like. Next slide, please. As you can see, we have done a great job with policy area number one, which addresses the most immediate health and social service needs of our unhoused residents.'",
        "'speaker_4': 'However, as the report noted, these services do not end homelessness. For policy area number two, temporary shelters, we have a big gap. We currently have four FEMA trailers that are being used for shelter to shelter elderly and medically vulnerable unhoused individuals during COVID, which will be at our disposal at the end of the pandemic.'",
        "'speaker_4': 'This could get us started with a temporary housing or community cabin option. The city manager, the mayor and staff visited navigation centers at community cabinets last year to see what might be possible for Alameda. On the other side of the continuum for policy, recommendations to wait for housing is coming, which is the ultimate solution to end homelessness'",
        "'speaker_4': '. But these are 2 to 3 years away. So where do we go from here? Next slide, please. Council had a retreat in December and again in July, where you identified homelessness as a priority for your 2020 2021. Under your focus area three.'",
        "'speaker_4': 'Supporting Enhanced Livability and quality of life. You ask for the development of a long range plan for the homeless. In a sign this test that the Community Development Department staff went to the Social Service Human Relations Board and asked them to help guide the planning process, which they approved last week.'",
        "'speaker_4': 'We will be seeking a consultant start of work this this coming fall or this fall. We will be soliciting input from community stakeholders and we will be exploring ways to fund projects.'",
        "'speaker_1': 'This long range plan.'",
        "'speaker_4': 'Which updates our current strategic plan, we will need to identify three things. Number one, how to sustain the programs beyond the heat funding or the Homeless Emergency Aid Program, which is ending in March 2021, especially the programs and services that are preventing individuals and families from becoming homeless.'",
        "'speaker_4': 'We need to address the big gap in our homelessness strategy by exploring short term temporary housing options. A 2 to 3 five way, two or three five years of wait for permanent housing is a little bit too long, while our encampments continue to grow during the development of this long range strategic plan.'",
        "'speaker_4': 'Staff will work with the Social Service Human Relations Board to explore the feasibility of establishing a cabin community or tiny homes. This is an important strategy to move people out of encampments and street living into a housing option that can bridge and ease their transition into permanent housing.'",
        "'speaker_4': 'In January of next year, we will come back to Presents the Council with a plan that includes how the project will be funded for a community cabin option or some kind of a shelter. Finally, we need to look at our housing policies to prioritize our most vulnerable residents.'",
        "'speaker_4': 'The homeless is a population that face enormous barriers that make them ineligible, not prioritized or not ideal for housing as tenants in this long range strategic plan. We will look at other cities for models through ordinances, resolutions and partnerships, such as working with the housing authority to break down these barriers.'",
        "'speaker_4': 'In late spring or early summer, staff will be presenting council with the final plan, which updates our strategic plan that includes strategies to sustain our supportive services, establish temporary and transitional housing, and explore housing policies that prioritize the homeless population.'",
        "'speaker_4': 'We will be seeking your approval to adopt the plant at that point. Thank you again for this opportunity to provide you with a status on homelessness in our Altadena community. And at this point, we welcome your questions and comments.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Miss Practice, do we have any clarifying questions from the City Council before we go to any public comment? I guess I should ask the city clerk, do we have public comment?'",
        "'speaker_2': 'So far we have one speaker.'",
        "'speaker_1': 'Okay. So any clarifying questions? Councilmember Otis, your head's up.'",
        "'speaker_3': 'Sure. Thank you. Thanks for that presentation. Just a couple quick questions. So I know we you mentioned Project ROOMKEY and the staff report related to the FEMA trailers. Is there any other effort in Alameda to participate in Project ROOMKEY?'",
        "'speaker_3': 'I know there was some discussion about one of the hotels. I'm Marina by Marina Square.'",
        "'speaker_4': 'Correct. And Marina village in is still part of the project Roomkey and that there was a an intent to purchase that property so that we could turn it into our we believe the county could turn it into permanent supportive housing after the pandemic.'",
        "'speaker_4': 'The county applied for funding to purchase the property and unfortunately during this first round of funding, the project did not get approved. However, the county is still optimistic that there may be some funding available to move forward with that purchase.'",
        "'speaker_4': 'But right now, it's it's uncertain.'",
        "'speaker_3': 'Okay. And then my second question, I think you mentioned it also in the staff report about the warming shelters, which are opened in November. And I recall two years ago when we had the fires, there was a lot of issue regarding homeless being exposed to the to the smoke and the warming shelters hadn't opened yet.'",
        "'speaker_3': 'And now this year we have the fires in September and October. So can you maybe share what we're doing to help some of the. Vulnerable unhoused neighbors. And you kind of get into some place where they can breathe during during these times.'",
        "'speaker_4': 'Yes, yes, yes. Fires have been really devastating this this year at two things. We are very fortunate that that the day center is now open. So during the day, folks have been going to the day center to take refuge and the out of the smoke.'",
        "'speaker_4': 'And also what we've had heat waves. The day center is actually a good place to be because they have air conditioning, which is pretty rare in Alameda. The other option that we are considering actually for the warming shelter and we have some funding for CARES Act as well as through help.'",
        "'speaker_4': 'The Homeless Emergency Aid Program is issuing some emergency motel vouchers. We have been in conversation with Building Futures, which operates the warming shelter about how to make sure that there's a safe distancing at the warming shelter, because last year there were times when we really had too many people, and this is before COVID.'",
        "'speaker_4': 'Now that we have COVID, we are looking at how to contain the number of people at the warm shelter and that what do we do with the rest of the folks who we know will be in shelters? So that's still a conversation.'",
        "'speaker_4': 'And we are working as well with Christ Church where this program is hosted and how to maintain safe distancing, maintain the number of contain the number of people to make it safe at that and then other options that we could offer for folks who are not able to be at the shelter that evening.'",
        "'speaker_3': 'Okay. And, you know, you know that homeless people were identified in our Karp as, you know, most vulnerable to, you know, things like climate action, climate emergencies. And then the last question, you mentioned the Boise case in the staff report also.'",
        "'speaker_3': 'I mean, can you tell us a little bit about, you know, what what boundaries that establishes and then how we're trying to get people services and temporary housing within the constraints of the Boise case?'",
        "'speaker_4': 'Yeah. Yeah. So the Boise, as many of you know, is what constraints such as to get some of the folks out of encampments because you have to have an option to offer as an alternative to where they're living right now, which are encampments set up on the streets.'",
        "'speaker_4': 'So with establishing a tiny cabin community or or some kind of a temporary shelter there, those options will be offered to folks at the encampments and other streets. And the initial sort of conversation we had about about these kinds of temporary housing options is that we can have up to we can house up to 20 individuals using'",
        "'speaker_4': 'tiny cabins or community cabins, and that's housing on site for staff. So when we have these kinds of options to offer, then we can present to our how to our unhoused population. Moving them into one of these units that are available.'",
        "'speaker_4': 'And if they decline, then we need to make sure that, you know, that that's documented. Because at that point, since we have housing available and if the idea is to abate at the encampment, then we will continue with the abatement.'",
        "'speaker_4': 'Of course, we will follow the rule of the rules and the law regarding those kinds of action. And we will be working with the city attorney's office and Alameda Police Department in moving forward with that kind of action.'",
        "'speaker_3': 'Okay. Um, I had another one, but I'll save it for later. Thank you.'",
        "'speaker_1': 'Okay. Thank you, everybody. Does anyone any other clarifying questions from the council? I have a couple on the staff report. Um, my temperamental iPad will let me in. Okay. Um, so thank you for the presentation, Ms.. Badges. This is a very important and complex and not easily understood topic, so I want to direct your attention to the'",
        "'speaker_1': 'staff report. Page three And there is just the reference and you're the bullet point trying to talk about the other funded initiatives include the next paragraph talks about the city council approves the parking meter donation collection program coming soon.'",
        "'speaker_1': 'And I would just comment that whenever it comes, I don't think it's going to raise a huge amount of money. So I know we've waited a while, we can wait a little longer. But what I was really interested in within the last line of that paragraph where it said partnership with the county's health care for the Homeless'",
        "'speaker_1': 'has also brought the mobile health clinic, which I'm well aware of, which is wonderful. They come out when they do the dining connect events and they it's it's an amazing mobile clinic that provides all kinds of services and street health program.'",
        "'speaker_1': 'Where and in what capacity are we seeing the street health program operating in Alameda? Yeah.'",
        "'speaker_4': 'So that street health is another, as you mentioned, another program of the county's health care for the homeless. And it is a medical based model kind of similar to the mobile, but they actually are not on wheels. They actually got flipped out of the encampment.'",
        "'speaker_4': 'Yes. Yeah. They go to the encampments. They go to wherever the homeless folks are located and they're working this team is working side by side with our existing outreach team here in Alameda so that they can show up and introduce them to the unhoused population and start building that trust so that we can connect or they can'",
        "'speaker_4': 'connect the our house population to primary care, mental health services, dentistry, you know, those kinds of services that we've not had before here in Alameda. So we've been really fortunate to bring that for a group here.'",
        "'speaker_1': 'And when did we first bring that here?'",
        "'speaker_4': 'This is like I would say three weeks ago. And they started at at the day center, actually, they had two nurse practitioners that met with folks there, and they set up a small room for consultation at the day center.'",
        "'speaker_1': 'And do they have a regular schedule of, you know, certain days of the day center, certain days out in the field or had a heads up?'",
        "'speaker_4': 'Yeah. So we clarified that with the street team this week because we we thought that they will be at the day center on a regular basis, like a regular schedule. And they said no because their intent is to really be out there in the community and mostly around encampment.'",
        "'speaker_4': 'So they're working with Operation Dignity. I know they're scheduling some visits at these account beds and then at some point that, you know, once they establish a routine and they have established some relationships with folks, they will go up their own to this account.'",
        "'speaker_1': 'Okay. But on a regular basis.'",
        "'speaker_4': 'On a regular basis, exactly.'",
        "'speaker_1': 'Like a few times a week.'",
        "'speaker_4': 'At least once a week.'",
        "'speaker_1': 'Okay. Okay. And. Well, that's good to know. They it's one of these programs that has an impressive track record where it does operate. And then my other question about the staff report comes from page six, note five, where the first full paragraph of page five talks about as part of this process, staff work with the Social Service'",
        "'speaker_1': 'Human Relations Board to develop a transitional housing option. I think this is talking about the possibility of tiny homes or community cabins such as tiny homes, community cabins which could be implemented ahead of and separate from the strategic plan that the residents could live in the community for up to six months while working on securing permanent housing'",
        "'speaker_1': '. And my question is, what happens if it takes more than six months for someone to secure a permanent housing? Is this is this following the model of the the navigation centers that I guess, if I recall correctly, do set a timeframe?'",
        "'speaker_1': 'But if you could just back.'",
        "'speaker_4': 'This short clarify that. Yeah. So it is sort of following the model of the navigation center and also community cabin that are in Oakland, mostly the ones that we have visited, operated by Operation Dignity. And they do set a time limit.'",
        "'speaker_4': 'However, it's not a fixed time limit because there are some situations where folks would need more than six months. I think the the the the the most important part about the putting a timeline is that they need to be able to see progress.'",
        "'speaker_4': 'And also it gives incentive to the clients to really work on and be engaged in ending their homelessness. So there's a timeline that kind of gives them that sense of urgency and to really, you know, work with with the staff.'",
        "'speaker_4': 'However, you know, we will we will, you know, it's up to the discretion of the provider to look at the situation and review on a case by case basis and extend that as long as they're continuing to work and be engaged in the process.'",
        "'speaker_1': 'And you're right, that is following the model of the navigation centers that we visited and the idea being there would be really intensive outreach and work with these individuals while they are in these transitional housing, supportive housing. And so they have work with caseworkers helping them to find housing, connect them with medical, mental health services, substance abuse'",
        "'speaker_1': ', whatever they need. And the idea is that they need to see progress because after all, there's a whole other cohort of sheltered individuals waiting to be able to be assisted by a program like this. So thank you for that clarification.'",
        "'speaker_1': 'So any counsel clarification questions before I open this up to public speakers? Okay, madam, let's have our public speakers, please.'",
        "'speaker_2': 'James Downey.'",
        "'speaker_6': 'Downey Fox. Thanks for having me on again. I have two clarifying questions. I'll ask them both and then I'll step back for comment. One would be, what does the budget decision or how does the Boise decision prevent us from cleaning up waste?'",
        "'speaker_6': 'Just garbage, just the waste that accompanies being unhoused? And secondly, I often hear us conflate the issue of homelessness, drug addiction and mental illness as backed up. By your own admission, some of these folks have told you or our teams they don't want to go into housing.'",
        "'speaker_6': 'Have we considered re allocating funds to focus more on the mental illness and more excuse me, mental health and on the drug addiction issues versus building homes? Because I fear we could have all the homes in the world and there still will be a subset of folks who, due to their condition, you know, I use to defeat'",
        "'speaker_6': 'my mental illness. I have mental illness, so I use it. There will always they will always be there. And I think we could reallocate somewhere, often funds towards those services. What have we considered in regards to doing just that?'",
        "'speaker_6': 'Reallocating funds from homes to mental health and drug addiction. Thank you.'",
        "'speaker_1': 'And Mr. Downey, just for clarification, for other public speakers, this is public comment. It is not Q&A, but thank you for posing those questions that our staff definitely works on and could be answered in a different venue. Perhaps the communication with the city manager.'",
        "'speaker_1': 'Do we have another public speaker this way?'",
        "'speaker_2': 'No, that was our only public speaker.'",
        "'speaker_1': 'All right. So then at this point, this is not an action item so much as a minimum.'",
        "'speaker_6': 'We had another speaker put their hand up right as the city clerk was saying there was nobody else.'",
        "'speaker_1': 'Well, then we will reopen public comment.'",
        "'speaker_2': 'Tamika Perkins.'",
        "'speaker_0': 'Hi. Good evening.'",
        "'speaker_1': 'Good evening, Mr. Ricketts.'",
        "'speaker_0': 'Good evening. Councilmembers Mayor Ashcraft and Debbie. I worked to Debbie and she will surely be missed. And I just want to make a comment. I am with Operation Dignity, and I just wanted to make sure everyone knew that there are no quick fixes when it comes to homelessness and we have to start somewhere.'",
        "'speaker_0': 'So I know that issue is on the table about community champions and it is a way to stabilize folks who are in the.'",
        "'speaker_6': 'Process of.'",
        "'speaker_0': 'Getting their lives together. It allows the Operation Dignity Team as well as other providers to address folks immediate needs. Right. So before we can deal with the bigger issue, we have to deal with the immediate needs. And that oftentimes is getting them document ready, getting them connected to mental health and substance abuse programs.'",
        "'speaker_0': 'Right. And getting them family reunification. So all of these things kind of takes place and the community cabins offer an opportunity to do that without being moved around from place to place. When you're in an encampment, right, or having their items stolen, they're able to kind of go in somewhere where they can lock the door and have'",
        "'speaker_0': 'a key. And also the other thing I wanted to mention was I would say, as we look to programs for housing, the unsheltered, that we'd be mindful that we don't unintentionally exclude them by placing additional barriers on them when it comes to low income and affordable housing for most, low income, affordable housing that I've seen is not'",
        "'speaker_0': 'very affordable and that very low income and especially with dealing with our particular population, right? So working with our policymakers and our housing authorities on relaxing some of those rules when it comes to criminal background, income eligibility and rental evictions.'",
        "'speaker_0': 'Thank you for your time.'",
        "'speaker_1': 'Thank you, Mr. Perkins, and thank you for all the good work that Operation Dignity does. You're a valuable partner to the city of Alameda. Miss Potter, please.'",
        "'speaker_0': 'So I thought I would just quickly follow up on some of the points that Ms.. Perkins made. I think it's considered in kind of the industry that the Housing First model is a best practice. And the emphasis on Housing First is to make a point that the key is to stabilize folks.'",
        "'speaker_0': 'When you get people stabilized in transitional or permanent housing, then you tackle the drug addiction, then you tackle the mental illness. Back in the day, the model was clean and sober, right? That you had to be clean and sober before you got into housing.'",
        "'speaker_0': 'And I think that that model has really been replaced with the best practice, which is called the Housing First model. And that is why what you see being reflected in our recommendations in this strategic plan is the emphasis on permanent supportive housing, and that is consistent with the work that the county does with the everyone home, the'",
        "'speaker_0': 'plan that everyone at home does. So I just want to underscore that point about the importance of that best practice of the Housing First model.'",
        "'speaker_1': 'Thank you, Miss Potter. Very true. Do we have any more public speakers in this part of.'",
        "'speaker_2': 'We have no more.'",
        "'speaker_1': 'So what is public comment at this time then in I'm going to lead off just because housing is an issue that is so near and dear to my heart. I want to just give you a couple of examples of real life examples and I'll just preface surprising.'",
        "'speaker_1': 'Homelessness is a complicated issue, and I think there is more I know there's more homelessness in our city of Alameda even than is apparent to the naked eye. And it is not just the encampments that are so visible on the approach to the tubes, it is those families living in their cars.'",
        "'speaker_1': 'And we do now we've opened our safe parking at Alameda Point and I saw the statistics for August, which is the first month of statistics, and we're off to a good start in just giving people a secure place to live while they work to find housing.'",
        "'speaker_1': 'And we need more housing. We just need more housing so badly. And it's hard to see measurable success. I mean, the people from Operation Dignity and Building Futures who work with these folks are certainly seeing it case by case.'",
        "'speaker_1': 'So the examples I want to tell you about are the Marina Village in and I've got my fingers crossed that some funding is going to be found to to keep that is permanent supportive housing because right now I think the council knows there are both residents from our Midway Shelter, domestic violence victims and their children, and also'",
        "'speaker_1': 'women from some of the encampments who would have been very vulnerable had they gotten COVID 19. And they're living there. And at first, we had a little bit of pushback from the neighbors. Why don't we talk about this?'",
        "'speaker_1': 'What this trash is this? So our supervisor, county supervisor, Wilmot Chan, convened a town hall and she asked me to be their city manager. Was there like this on Zoom? And I was just ready to hear all the different complaints, the neighbors.'",
        "'speaker_1': 'And they almost moved me to tears because. But the outreach, I give huge credit to Anabaptist, Kerri Abbott from the counties, she's the county's homelessness person and Alice Varella from Billy Futures, who had gone out and done the outreach, met with the neighbors, found it with the problems, were met with the residential manager, got them address to'",
        "'speaker_1': 'the point that these residents to a person and the manager of the Oakland Yacht Club which is a neighboring property all spoke up and said, wow, this is so well managed. We just heard that they didn't get the funding.'",
        "'speaker_1': 'What's going to happen to these people and how can we help? How can we help these children? Can we can we do school supplies, we do tutoring? And then Luis Varela told me the next day that they reached out to her and said, we want to do a holiday drive for these residents.'",
        "'speaker_1': 'So, you know, kudos to all of you for stepping in. And it's not easy to just put people in a place and walk away. And then a year or so ago, the assistant city manager, Jerry Bowden, and I had a chance to visit a community cabin in Oakland down near the the Civic Auditorium, used to be called'",
        "'speaker_1': 'anyway. And Mayor Libby Schaaf was telling us that the first thing for and they're just they're very rudimentary. But you get a key and you there's cots and you go in, you can have pets. And she said the first thing people do when you give them their key and they just walk in and realize it's quiet, it's'",
        "'speaker_1': 'safe, I can lock the door. I'm safe if they burst into tears. And the second thing they do, she said, is they lay down in the car and they sleep for 48 hours because they have not had a night's sleep where they weren't sleeping with one eye open.'",
        "'speaker_1': 'They're going to be attacked. Everything's going to be stolen. Am I safe? And so these are the things we need to do. It's not easy, it's not pretty. But these are human lives and it is possible to make things better and we've all got to work hard together.'",
        "'speaker_1': 'So for me, let's hear from the others in the council. Can't Somerville. I said your handout. This is my colleague on the Housing Committee, Economic Development Committee of the League of California Cities.'",
        "'speaker_6': 'Councilmember Avella.'",
        "'speaker_5': 'Yes. And also your, your partner, when we were going to do the homeless count this past year. And, you know, I think many of us on the council have participated in the the count of where we go out.'",
        "'speaker_5': 'And we we actually tried to countywide count all of the unhoused individuals. And I want to talk about trauma for a second because I think that that's inherently part of this in. Our conversation. And I heard a speaker say, well, you're conflating homelessness with mental health issues and drug abuse.'",
        "'speaker_5': 'And the reality is, is that there is trauma experienced by anybody who is having to experience life in an unstable or insecure way. And I think a lot of the conversation around either the cottages or the cabins is is really around creating a sense of stability and a foundation for that to actually address the trauma that occurs'",
        "'speaker_5': '. Not everybody who becomes unhoused has mental health issues or drug issues at the start, but they certainly lose their sense of security and safety. And I think that that's been a big part of what we've been discussing, whether it's around reimagining policing or the services that we want to provide.'",
        "'speaker_5': 'And it's certainly part of this conversation. I think it's inherent in this part of this conversation when we talk about the unsheltered population and the vulnerable population in our own community. So I just I want to make sure that when we when we talk about that, that's really what we're getting at.'",
        "'speaker_5': 'And we hear the conversation about the different services. That's really what it's geared, geared towards. And there are a number of individuals who I've spoken with. I've had students who were unhoused or unsheltered. It's all walks of life, and there is a complete loss of security and safety.'",
        "'speaker_5': 'And the point gets brought up all the time, the sense of being able, even with our secure with our trailers and your parking overnight and the sense of security that people get because they know nobody's going to come and attack them or take their things or hassle them in the middle of the night.'",
        "'speaker_5': 'And that's something that many of us take for granted. And I certainly hope that that remains a focus of our community. I've seen in our community exercise compassion and empathy, and this is all part of that conversation. So I appreciate all of the work that's gone into this report.'",
        "'speaker_5': 'I think that that this is tremendous progress from from what we had a few years ago. And I also want to thank our staff. I was on Webster today talking with some of the business owners, and they said, you know, Anna and Debbie and Lois, they were all out here handing out these cards, letting us know about'",
        "'speaker_5': 'these programs. And I want to thank our business community, because it's not a sense of we need to get these people out of here so much as we want to make sure everybody's taken care of and has a place to go.'",
        "'speaker_5': 'And on these bad air quality days and with with the different weather, that they have a place to go. And I hear that a lot from our business owners. And again, that's that sense of compassion and empathy and wanting to find a place for people.'",
        "'speaker_5': 'But it also takes our staff who we don't have a lot of going out there and making sure that the resources that we're funding as a council are actually being used. So I want to acknowledge that work that's being done and just let the public know that that our staff is literally the boots on the ground getting'",
        "'speaker_5': 'the word out about the different services that they discuss in this report. And they've been very much a part of the solutions. I want to I want to acknowledge that work as well. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Bella Council Brody.'",
        "'speaker_3': 'Thank you. I want to thank our staff. I think you mentioned how complex this issue is. And I appreciate all the work and I and Lois and Debbie have put into this. I think my colleague, Ms.. Vella hit the needle on the head when she talked about these being compassionate solutions.'",
        "'speaker_3': 'And, you know, our community stepped up and was compassionate when we approved the respite center last year. So I know we have it in ourselves to help those that are less fortunate. And I appreciate the the kind of the emphasis, Ms..'",
        "'speaker_3': 'Potter on Housing First. I mean, people can be many different things, but, you know, if your first title is unhoused or homeless, it basically indicates one thing, right? You know, you don't have housing and, you know, whether it's through, you know, mental health issues or addiction or, you know, loss of income or, you know, your rent got'",
        "'speaker_3': 'raised too high. You know, there's a lot of reasons. A lot of people are unsheltered. So I appreciate the focus on housing. That's why it's kind of interesting know I know we're wrapping up as best we can. You know, the first part and the third part I always thought was the hardest permanent housing.'",
        "'speaker_3': 'But I'm glad that we got things in the works, like the 90 units over over at North Housing. But the temporary thing, I mean, just a couple Q&A. I mean, do we have a timeframe on when we might be able to see some additional temporary housing services provided?'",
        "'speaker_3': 'Or do we not? Do we know or.'",
        "'speaker_4': 'I think that part of our planning process to identify timeline, of course, we will have to identify a location which will be, I think, one of the challenges in undertaking such a project. And then we will have to go through stakeholder input process and all of that.'",
        "'speaker_4': 'So but the plan right now is to come back to you in January with an actual plan. Okay. You will debt review and approve.'",
        "'speaker_3': 'Okay. I mean, because as you said, you know, we can't move people into a shelter until we have shelter. And I know there's many people that are concerned for whatever reason they're concerned about. But, you know, we need to get those temporary units up.'",
        "'speaker_3': 'And then the other thing, I hope that our community can be compassionate as you make those recommendations, because it's going to be critical that we provide them. Now, I recall six years ago, I started this job and I think we had 34 homeless in our in our count.'",
        "'speaker_3': 'And that could have been because we weren't counting everywhere. But, you know, last it was over 200. So, you know, it's definitely been an issue. But I remember that there was just a statistic that, you know, the large majority of people that were counted in the census actually are alamitos.'",
        "'speaker_3': 'I mean, is that still pretty much the the truth or the fact?'",
        "'speaker_4': 'That is still the truth. And the county, Alameda County appointed time count for 2019, which is the most current one. In that report, they found that majority all over Alameda County are from this county. Something like three quarters of the population who are homeless are from the town or city or where they're living right now as homeless'",
        "'speaker_4': 'individuals.'",
        "'speaker_3': 'Okay. So what I think it's important there is. Now, these are our neighbors. Yep. So in a way, we're trying to find solutions for our neighbors. And I don't think there's going to be an influx of people coming from other cities to take advantage of our services.'",
        "'speaker_3': 'And if they are great because we're providing shelter. But let's let's make sure people understand, you know, we're trying to help our neighbors. And these are solutions for Alameda. And then I know there's been some issues with these these cabins with safety.'",
        "'speaker_3': 'So I hope when you put them together and I know there's some places in Oakland where they're women only so they can be, you know, protected from being sexually assaulted and things like that. So. And then I understand the question from the the public about trash.'",
        "'speaker_3': 'Maybe you can just touch a little on this because you know what? Someone may look as trash when you're driving by is actually someone's belongings. I know there's issues with liability about just removing things. Can you kind of talk a little bit about what we're doing, you know, for legitimate refuse and, you know, maybe sanitation versus, you'",
        "'speaker_3': 'know, what we have to do to respect people's personal property?'",
        "'speaker_4': 'Yeah, yeah, yeah. You're absolutely right. What might look like trash to some of us are actually belongings and property and probably the only property that folks have. So what we do is we work very closely, for instance, in the at the positive, which is that property is owned by Caltrans.'",
        "'speaker_4': 'We work very closely with our outreach and our outreach team, your locally to inform folks way ahead of time. And we and I just want to also announce that we have a cleanup scheduled with Caltrans on October 15th.'",
        "'speaker_4': 'So that's our next clean up scheduled. We work very closely with our outreach team to inform folks way ahead of time about where the trash needs to be placed so that the day of the pickup, the the the folks know exactly what to pick up and what to leave up and for properties that are left behind.'",
        "'speaker_4': 'And it looks like just things that have not been touched in quite a while. But somebody left, you know, lived there at one point. We will put a notice of that property and do some more outreach, you know, to see who might who the property might have belong to at some point.'",
        "'speaker_4': 'And and we kind of know our outreach team kind of know where they're located, even though they do look around and try to talk to those individuals to see if they are things that they want to get rid of or if those things are really just for trash, that we will do our best to put them in'",
        "'speaker_4': 'the proper place so that when the pickup happens, we know those are trash and not property.'",
        "'speaker_3': 'Okay. And then I think the mayor kind of raised this point. You know, being homeless manifests itself in different ways, whether it's, you know, in a shelter or whether it's in encampment or whether it's in your car or we also have folks living out of our bodies and such.'",
        "'speaker_3': 'And, you know, my understanding is if you have an RV, you can't go to the day parking. So. Can you maybe talk about what services we may have for folks who are living out of our RVs or campers?'",
        "'speaker_3': 'Because I know there's, you know, a few of them, quite a few of them past the ferry station, you know, out to the entrance of the base.'",
        "'speaker_4': 'Yeah. Correct. So are these are not included in the Safe Parking program. However, we do continue to work with everyone who's homeless, including the ones who are living. There are these with outreach services, harm reduction programs. If they need anything, it could be what they call this, a voucher for a motel.'",
        "'speaker_4': 'If they're if they really need some kind of a shelter besides where they're living now, we also provide them with food. If they need food, you know, whatever it is that that that we could provide through our outreach team, we we do provide that and as well, you know, we encourage them if they if we think that'",
        "'speaker_4': 'they need medical assistance, we encourage them to get in touch now that we have the street team to get in touch with those folks, the nurse practitioner. And if we need to connect them to primary care or doctors and what have you, we would try to make those connections as well.'",
        "'speaker_3': 'So. Okay. Well, thank you again. I want to thank you all for your hard work on this. And the mayor, who's a leader in the state on this, and Councilman Avella also with the League of Cities. And I would plead with our residents to show some compassion to our unhoused neighbors as we try to resolve this issue'",
        "'speaker_3': '. And, you know, by compassion, you know, I mean, you know, let's not have a battle like we had over the respite center, right, you know, where people were saying, I don't want this in my backyard. You know, we're going to have to provide some temporary shelter and, you know, and compassion when it is to, you know, finding'",
        "'speaker_3': 'people services and getting people shelter and, you know, putting them in proper shelter. So I hope that, you know, in the next two or three months, as the time it takes to get to the point where we can provide adequate temporary housing, that that our community continues to show compassion like we have for many years for our'",
        "'speaker_3': 'unhoused neighbors. And I also thank you for all for working on this. And, you know, I think together we'll get through it. But, you know, it's it's very it's very sad to see, you know, what's happening, but it's very heartening to see, you know, the commitment that everyone on our city staff from the city manager on down'",
        "'speaker_3': 'and everyone on council has to, you know, finding compassionate solutions for this, for our neighbors. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Brody. Anyone else? Right. Fair enough. Right.'",
        "'speaker_6': 'So I'm learning to at least look like I'm fine in the movie, but you can tell. Thank you. So I want to thank I'm going to say in first off, every time I see him aspect is to do a presentation on these issues.'",
        "'speaker_6': 'I'm just constantly impressed and I feel very lucky to know that we have somebody with so much knowledge and understanding about this issue, not just, you know, specific programs, but actually understands the kind of holistic, comprehensive program and how everything fits together.'",
        "'speaker_6': 'So I just want to thank you for that. I want to thank everybody one last time as as this is your last item. Yeah. And I also do priority because Lois has been sitting on my screen for service.'",
        "'speaker_6': 'Butler has been sitting right here for so long. I just want to also acknowledge now is as you're stepping into the interim acting position, thank you for all the work you're doing on this as well, because right.'",
        "'speaker_0': 'Now you're the silent partner.'",
        "'speaker_6': 'Because you're somewhere in between there, whatever. But I know you've been very involved in a lot of these conversations because they really are. This is so thank you for that. I just also wanted to kind of touching on the housing issue again, because housing first as a as a as a solution tried to helping and aiding those'",
        "'speaker_6': 'who are unhoused is really important. But what we also know is that most of the unhoused in our area started off as housed. And we know that the reason they are unhoused now is because they got pushed out of the housing that they had and many of them were pushed out of that housing with with your not'",
        "'speaker_6': 'necessarily, you know, drug addiction and mental health issues, but that they may for all sorts of reasons that those get exasperated when you're living on the street. And so, you know, this is a great solution for addressing the issue that exists on our streets.'",
        "'speaker_6': 'But we also need to be, you know, kind of to Mr. Downey's point a little bit, we need to be making sure, you know, I would say action to the opposite of his point a little bit, but not argument.'",
        "'speaker_6': 'Argumentative. I appreciate the comment. We need to be making sure that people are not getting pushed out of their homes so that we have this problem that we have to deal with very much. I am ready and I know Councilmember Isaak has comments but I'm ready to support the staff recommendation.'",
        "'speaker_6': 'I really appreciate it. I remember speaking with Inspector Simmons. Potter I'm going to go with July kind of as we before we went on the August break, kind of about this issue and my hopes that we could be kind of talking about some real solutions here in October.'",
        "'speaker_6': 'And I was very pleased when I talked to the city manager and to hear that that was staff's staff's goal. And here we are. So I really want to thank you for that. I really want to encourage us to make sure that this strategic planning process, as we go forward, that we are communicating out very clearly to'",
        "'speaker_6': 'the to the council, and also that we are very clear with our timelines and our dates so that we know we have a lot more planning to do. I think if we can get these community cabins in and whatnot, we're going to end up back in here.'",
        "'speaker_6': 'Okay. Now what next? And I think that the more that we can be thinking about as we're doing that planning, what are the other things that we can also be looking to reach out and instill in the community?'",
        "'speaker_6': 'I just want to encourage staff to make sure that they're there. You know, if they're off agenda items and we're not just keeping us in the loop so that we can be supportive and help leverage our voices or help make decisions when the when there are decisions to be made that will help move us forward.'",
        "'speaker_6': 'But thank you. This is again, great work. I really appreciate it. We're lucky to have a county with a really good plan. We're a city with a really good plan and it's really good to see a lot of these things moving forward.'",
        "'speaker_1': 'Thank you. Behavior Council member Jason.'",
        "'speaker_6': 'Great. Well, thank you very much for your presentation this evening. And I especially liked the discussion regarding, you know, trying to put more emphasis on temporary shelter, whether there are the FEMA trailers or whether they are the cabins.'",
        "'speaker_6': 'I think that kind of temporary shelter is especially important when it comes to assisting those who are in the encampments around around Posey Tube. But I think the other great part about tonight's discussion was the range of carrots that have been discussed in terms of outreach, medical assistance, things like that.'",
        "'speaker_6': 'So I think we're we're moving in the right direction with regard to generally dealing with the matter of of homelessness. But obviously, you know, specifically, let's not kid ourselves putting in the strategies to deal with the situation right outside of the Posey to be encampments there and with things like the temporary shelters in the form of FEMA'",
        "'speaker_6': 'trailers or or the cabins that were discussed. If we do put more emphasis onto that, I think we can definitely begin to deal with the campaign issue in a very compassionate issue. By the same token, it seems to me that I also heard that we are carefully working within the framework of of Boise, of the Boise decision'",
        "'speaker_6': '. And to me that that's important because it shows that, yes, we are putting a lot of carrots out there. But, you know, Boise clearly says that if you do have shelter available, then a city can work to do to exercise what it considers to be public safety concerns.'",
        "'speaker_6': 'And this might be an issue certainly outside of of those tube. But I think the range of carrots that were discussed tonight, I think, should really hearten a lot of people that we are beginning to move forward, especially on the encampment issue.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember. They said, okay, by my calculation, all the council members have spoken, so we are being asked to receive an update. So we received an update and and staff you've heard our comments and our praise and our thanks for your hard work.'",
        "'speaker_1': 'So please continue to do what you're doing and we look forward to hearing back from you about your progress. All right. Thank you. So with that, we are going to close item 60. Okay, Council amendment of decision with 9:00.'",
        "'speaker_1': 'Now, we started at seven, although we really started at 530. Do you all want a five minute break from that five minute break? Five minute break. Okay, so everyone, we will be back in 5 minutes. Council, I recommend you put your microphone on mute and you can do whatever you want with your camera.'",
        "'speaker_1': 'Okay, 5 minutes. We'll be back. Thanks. Everyone. Let's see. Lara, are you there?'",
        "'speaker_2': 'Yes, I am here. I'm ready.'",
        "'speaker_1': 'You ready for us? Yes. All right, then. Everybody ready to go? You're back. Okay. So with that, we are back from our break and we have item six D.'"
    ],
    "Recommendation to Authorize the City Manager, or Designee, to Negotiate and Execute Rent Relief Agreements with Commercial Tenants in City-Owned Alameda Point Properties via a $1.5 Million Loan Conversion Assistance Program and Implement an Alameda Point Non-Profit and Spirits Alley Businesses Rent Relief Program in Response to the COVID-19 Pandemic; and \nAdoption of Resolution Appropriating $1.5 Million from the Base Reuse Fund for the Loan Conversion Assistance Program and $315,000 from the General Fund to Assist the Alameda Theater. (Community Development 858/442)": [
        "'speaker_2': 'Recommendation to authorize the city manager or designated negotiate and execute rent relief agreements with commercial tenants and city owned Alameda Point properties via a $1.5 million loan conversion assistance program and implement an Alameda Point nonprofit and Spirit's Alley Business Rent Relief Program in response to the COVID 19 pandemic and adoption of related resolution.'",
        "'speaker_1': 'All right. So I see that volcano on screen. Is it your item?'",
        "'speaker_4': 'It is my item. Yes.'",
        "'speaker_1': 'The floor is yours. Well, thank you.'",
        "'speaker_4': 'Thank you. Good evening. Mayor and City Council members. I'm Nanette Mekonnen from the Community Development Department. So tonight we have in front of you a recommendation to to provide relief to some of our tenants. We have been we I mean, staff and the council may mostly have been kind of wringing our hands about what to do to'",
        "'speaker_4': 'help our tenants and how much. That's really the question is how much? And I think we have had many iterations. I think this might be my fourth time in front of you to discuss how since March to discuss how to help the tenants.'",
        "'speaker_4': 'What can we do? I think we all can agree that this situation has gone on longer than any of us could have imagined. Initially in March, we had talked about doing a 60 day program for our tenants, and then we added another 30 days for 90 days.'",
        "'speaker_4': 'And it's October. And there's sort of I mean, we can't we cannot see the horizon, I think. And so I think we are back here seeking some concrete action, some steps from the council. And I'm just going to walk you through where we are, how we got I mean I mean, you guys, you know how we got'",
        "'speaker_4': 'here, but I'm just going to walk you through where we are, what our thoughts are, and then just let you guys kind of continue to grapple with this. And hopefully by the end of your grappling, we will have a clear path of what we can offer to our tenants, because really that's what we want to do, is'",
        "'speaker_4': 'that it's it is October. And so far all we've been able to offer our tenants definitively is the 90 day deferral. And we have offered that to our tenants with a repayment to start in October and it is October.'",
        "'speaker_4': 'And and that may not have been enough for some of them. So let me just walk you through the three things that we're discussing tonight. So the first thing I think we should talk about is the loan conversion program, which you approved in May and April May, which to remind you, is the program where the tenants can'",
        "'speaker_4': 'apply for a six month deferral. And then we would meet with the tenants and negotiate some benchmarks, performance measures that that would potentially turn a portion or all of that loan into a grant. The program was fashioned after the Federal Government PGP program, and at the time when we when the Council approved it, we we we feel'",
        "'speaker_4': 'we don't we feel that there was not a lot of clarity about the magnitude of what you guys were were thinking about. And so when we introduced the program to our tenants and the numbers came back very large.'",
        "'speaker_4': 'And so rather than rather than than granting large grants or programs to our tenants, we are asking the council to give us a large fund that we can then negotiate and figure out how to help the tenants. Some of you received some information about some of the specifics that some of the tenants requested.'",
        "'speaker_4': 'We are asking for $1.5 million to have that, give the city manager some flexibility to negotiate with some of the tenants and offer relief. In the staff report, you'll note that some of the tenants pay up to $60,000 a month in rent.'",
        "'speaker_4': 'And so some of the the citywide program that offered $10,000, 70 $500, would not have made a dent in the operating obligations of some of these tenants, which is why we're asking you to consider this this fund. In addition, some of our tenants lease over 100,000 square feet and so their rents are large.'",
        "'speaker_4': 'And also of note is that the city offered about $1,000,000 for citywide programs for those smaller grants and and for assistance. So the 1.5 is for Alameda point is on par with what was offered citywide. So we feel like if you gave if you allotted that 1.5, we could have it go a long way between it with'",
        "'speaker_4': 'our tenants. In addition, the loan conversion program that you put forward was specifically designed for your larger employers. The council said you wanted them to have more than 25 employees or to have a significant impact on the sales tax revenue.'",
        "'speaker_4': 'And so there were some applicants that we received that we turned away because they did not meet that benchmark. And so we are hoping that the council will give us that fund to be able to then negotiate with the tenants and figure out a way out.'",
        "'speaker_4': 'And so when after the council approved that program and we saw that it didn't quite meet the needs of everyone. More specifically, I received several calls from our Spirits Alley tenants. And, you know, they were hard hit and we knew that they were going to be hard hit because they're they're like they're sort of like the wine'",
        "'speaker_4': 'tasting facilities in Sonoma that they can't open up. And there are many of them. As you know, our big hole in Spirits Alley is food service. So many of them don't serve food, so they couldn't get around that obligation.'",
        "'speaker_4': 'So they were just closed and they were creative doing, you know, the drive by pick up of growlers of beer and and your wine club pickup. So they were being creative. However, it just wasn't enough. And then when the county opened up and the fires impacted them so they couldn't have the outdoor activity.'",
        "'speaker_4': 'And so the Spirits Alley tenants were, they were being hammered every which way. So I received many calls from them and it became clear that they needed a little something extra. So the city manager and I, we kind of we created this this other program that specifically designed for our nonprofits and our Spirit Alley tenants.'",
        "'speaker_4': 'And it is not a grant conversion. So the 1.5 that we're asking for is separate from this. And this is a deferral program where the tenants can get up to nine months of deferred rent. So really what this does in reality for our tenants is it takes them to the end of the year.'",
        "'speaker_4': 'Some of the tenants have them paying, but they do need like meeting breathing room. And so it gives them nine months of deferred rent, but then they have to pay it back over a three year period of time.'",
        "'speaker_4': 'So so what happens is in the first year, they'll pay they'll pay their regular rent plus three months of the rent that they that was deferred. This is similar to your rent deferral program that you offered to your other tenants because we gave the other tenants one year to pay back three months of rent.'",
        "'speaker_4': 'So what we're doing is we're giving Spirit's Alley and your nonprofits three years to pay back three years of rent. Now we know that we're not going to be and this well, we hope that we're not going to be in this pandemic forever.'",
        "'speaker_4': 'And so we miss McCord.'",
        "'speaker_1': 'I'm sorry, interrupt. You were saying we're giving them three years to pay back. Three years of rent.'",
        "'speaker_4': 'They owe three years of pay back nine months. And there.'",
        "'speaker_1': 'You go. My blood pressure went back down.'",
        "'speaker_4': 'I mean, great. So we we hope that this this pandemic doesn't last forever, and some of our tenants may bounce back more quickly. And so we're giving an incentive that if they bounce back more quickly and they pay off that nine months rent, let's say that.'",
        "'speaker_4': 'So for every year early that they pay it off, we will defer one month, we will abate one month rent so that tenants could get up to three months of abated rent. And that is just an incentive just to try to help them if if the money's coming in, that they'll pay us and so we can be'",
        "'speaker_4': 'closer to becoming whole. We feel very confident, by the way, about both of these programs because even with the pandemic and you've seen this in the staff report, even when the Bananas hit the fan in March, we closed our fiscal year with a $2 million excess.'",
        "'speaker_4': 'And so we think that we have a lot of wiggle room. Our fund balance is healthy. And I know that the other thing in the back of you guys is mine is development, development, development, that we have to not just rely on this interim stage, that we need to get the infrastructure in the ground.'",
        "'speaker_4': 'But we do feel that we need to stand alongside of our tenants who have been with us in the difficult times. So it is sort of an investment. One thing that I want to remind you guys is this is not money going from us to the tenant.'",
        "'speaker_4': 'It is money coming from our fund balance to go into our operating budget. So it is it is us loaning the money to us to continue our operations and then the tenants will pay us back. So it is not like money just out the door.'",
        "'speaker_4': 'I just want to remind you of that. The last thing the last part of this action is for the Alameda Theater. Way back in April, you guys, we received a proposal from the Alameda Theater. And you might remember there were four components of that proposal.'",
        "'speaker_4': 'And we we addressed all four except one of them. We were not able to completely address. And that was the tenant's request to to just roll let me let me make sure I say this correctly without misspeaking. So it was the tenants request to roll back the rent to 2010 until a vaccine was widely available in California'",
        "'speaker_4': '. So the council wasn't too enamored with making a financial decision based on a vaccine. So what we came up with was we were we said this tenant is eligible for all of our like a loan conversion program that we just approved.'",
        "'speaker_4': 'And and they could they could that could happen. But then we hit a roadblock because deferring rent on the theater impacts an obligation that we have for paying back our Section 108 loan. The Section 108 loan, which we took out when we were building the theater and parking garage, is backed by the Reds from the theater complex'",
        "'speaker_4': '. And so we are unable to just completely defer rent for the theater because we have this other obligation that needs to be paid. And so what we had come up with, the recommendation that we came up with at the time was that we would grant we would loan the money to the theater.'",
        "'speaker_4': 'And again, this is a money transfer from one fund into our operating fund or into the debt service fund for the Section 108 loan, basically. So we would loan we would loan the money to the theater. They wouldn't have to pay rent.'",
        "'speaker_4': 'And that debt won't become payable until they exercised their option for a longer term, which is in 2037. Or if we negotiate that they want to buy the building and we negotiate a price. There's a price already set in the DDA or in the lease, by the way, but we might want to change that or something.'",
        "'speaker_4': 'We would put the dollar amount that we're loaning the theater on top of that purchase price so that this obligation will come due 17 years from now or or whenever they decide to buy the the theater. It is not something that's imminent or heavy on the theater operations.'",
        "'speaker_4': 'We thought that that was a gentle transition. Now, I know that you guys were contacted by by the theater operator about where did where did that come up with that $315,000 number? Well, what was missing from my staff report was the complex, because all the rents from a theater complex are go are pledged to the Section 108'",
        "'speaker_4': 'loan. And so that is about $315,000 for that nine month period. We may not need to use it all. We may need to use it all. I just wanted to put that dollar amount there in case we needed to use it.'",
        "'speaker_4': 'So it is and it would not be the sole obligate obligation of the theater owner. Each individual business would have the obligation on their own. But I approached the project as one project, the theater complex. So tonight what we're asking you guys to do is number one.'",
        "'speaker_4': 'Set aside the $1.5 million for the city manager and staff to administer their loan conversion program. Finally, I want you to know that we approved that program in April and May, and we have not made a decision on any of those applications.'",
        "'speaker_4': 'So so the tenants have been waiting and they provided us with a lot of information. We've gone through their financials. We've asked a lot of follow up questions. But and but we want to make sure that we're on the same magnitude that you guys are on.'",
        "'speaker_4': 'Number two, what we're asking for is, would you guys entertain this other program that's specific to Spirit's Alley and nonprofits? Now, the nine month repayment, nine month over a three year repayment program. I would like to offer that to anybody who did a loan conversion grant in case they want to do that, so that our loan conversion'",
        "'speaker_4': 'application, so that we would not be in the grant situation with some of those tenants, but instead they could get the nine months and repay over the three year period. I'd like to extend that to them just because they've been waiting a long time and there's lots of uncertainty.'",
        "'speaker_4': 'And then finally, we're just asking you to appropriate the $315,000. It may not be that much. It may be a little less from the general fund reserves to help the theater complex, and mostly it is to help the city meet its obligations for the Section 108 loan.'",
        "'speaker_4': 'Finally, I just want to say one thing to you guys is that I know you have been grappling with this since March about how to help our tenants, but I want you to feel encouraged about some of the things that our tenants are doing to help themselves.'",
        "'speaker_4': 'One of the tenants who is an applicant for the loan conversion program is a business that would be done because of COVID. They there that their core business would not allow them to operate at all. But what they did was they immediately changed their their operations and they instead of manufacturing the thing that they did that would'",
        "'speaker_4': 'not be allowed or would not be marketable under COVID. They started making prefab panels for multifamily housing. They just completely changed their business model. And they are now becoming very competitive and selling these that these panels for prefab housing.'",
        "'speaker_4': 'And that was something they did quickly. And we think that we would acknowledge that innovation of our tenant and being able to keep the jobs, keep the operations and be at Alameda Point, we think that they should be acknowledged.'",
        "'speaker_4': 'We have another tenant who, you know, they could ask for the six months they've asked for three because that's all they really need to get by. And we think that that that is the candidate for the loan conversion program.'",
        "'speaker_4': 'And we just think that there have been a lot of there's been a lot of innovation. You guys know one tenant who who was, you know, their their business model. It was not compatible with, you know, the shut down, the shelter in place.'",
        "'speaker_4': 'And they started using their their facility to make hand sanitizer and to distribute it throughout the city. One of our tenants offered up their property, their driveway, for nonprofits to do certain events in their driveways to help people.'",
        "'speaker_4': 'And so I think that the people who are applying for this and asking for help are tenants who are committed to our city and who have shown some leadership. They responded to the things that you guys said you want it, which was, you know, people who are going to step up.'",
        "'speaker_4': 'And so I think that the applicants that we have on hand that you would be very pleased to stand alongside of them. And and basically, I want to just say that we feel that tonight we are addressing our two big anchors in Alameda, Spirit Valley and the theater.'",
        "'speaker_4': 'Both of them have become part of the Alameda identity. And we think that we need to assist and helping them continue. Thank you.'",
        "'speaker_1': 'Thank you, Mr. McConnell. That was an inspiring presentation by the man. Do we have public speakers?'",
        "'speaker_2': 'We do not have any public comment.'",
        "'speaker_1': 'Okay. So then, counsel, you can do a combination of your. I see your hand up. Give me a sec. We can do a combination of questions you may have for staff and your comments. Why don't we start with Councilmember Vela?'",
        "'speaker_5': 'So I want to start with some questions that I had. And obviously, we've given some direction previously, and Mr. McCarney touched on that. But I just want to clarify a couple points. So I know this comes out of this isn't necessarily money out of our pocket, but does this impact other our ability to pay for other things'",
        "'speaker_5': 'at Alameda Point. Because potentially this money is getting put into a fund and that fund is supposed to be paying for certain things. So have we calculated the impact on that?'",
        "'speaker_4': 'Now what is it? Okay, sorry. I'm sorry to interrupt. So this money is coming out of a fine balance. And so right now we have many we have about $16 million in our fund balance. So it's very healthy.'",
        "'speaker_4': 'That is enough to operate alameda point. If no money came in for a year. Our operating budget is about $14 million. So we have a very healthy fund balance and we're lucky. And so in the past, I would just tell you that in the past, the council felt that $2 million fine balance was really good, and that'",
        "'speaker_4': 'was our rainy day fund. So right now we're in a very good place and it's mostly because of the really competitive deals that you guys have approved in the last few years. And I mean, I just want to compliment you that even in the reduction of the Mirage ships, which is one of our largest tenants, we managed'",
        "'speaker_4': 'to continue to be, you know, pretty, pretty competitive and have a great revenue generation at the base. So.'",
        "'speaker_5': 'So I think my question is, if everybody defaults. Worst case scenario, if everybody defaults, right.'",
        "'speaker_4': 'We would be okay.'",
        "'speaker_5': 'And then. But are there any be.'",
        "'speaker_1': 'Okay for a time? Right.'",
        "'speaker_4': 'For a time. For a. I mean, I think she's asking of everybody who got the loan defaulted on.'",
        "'speaker_1': 'And couldn't pay back.'",
        "'speaker_4': 'Yeah, that's 1.5 million. We're talking about 1.5 million in a $14 million portfolio.'",
        "'speaker_6': 'So, yeah, I'll answer it.'",
        "'speaker_1': 'A city manager.'",
        "'speaker_6': 'Yeah, I. I'll answer a little different. I mean, obviously the fund balance is used for a variety of things and I mean a point and I agree with and, and that that if just the loans were defaulted, that would be 1,000,005.'",
        "'speaker_6': 'I think what we're really trying to do is look at the other side and what I think the Nats proposals are for is that we're trying to help. And this might be a little bit of an overstatement. I hope not is save some of these businesses and help them to succeed in moving forward.'",
        "'speaker_6': 'And then so it's not really on the default side, it's more what I think the Nats proposals which I have agreed with is to try to preserve those businesses out there so that we will have long term revenues.'",
        "'speaker_6': 'I don't think the loan program is to provide just assistance. I think it's to provide assistance to help them stay to to try to sustain through the COVID and become healthy businesses and stay out there and be healthy for the long term.'",
        "'speaker_6': 'So I think it's not necessarily the default and on that side, because if it is defaults, we will have to to readjust expenditures out there. I think what she's trying to do is create long term revenue sources for for the base based on preserving these businesses and helping them move through the COVID.'",
        "'speaker_5': 'And potentially there's a bigger problem, correct. If they if they default, because it means that potentially there's a larger issue and we perhaps are losing an anchor tenant. Correct.'",
        "'speaker_6': 'That would that could be correct, yes.'",
        "'speaker_4': 'Just that the proposal for the loan conversion program way back when, which you guys might not remember, is that we had discussed negotiating promissory notes for the tenant that would be crossed, defaulted with their lease. So if there is a default, the lease is defaulted.'",
        "'speaker_4': 'Probably all of these tenants have a security deposit. So there is some recouping of funds there. Right. So we do have a little bit of cushion.'",
        "'speaker_0': 'I do think you clarify just slightly.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'Just to clarify for the council. The 1.5 million that we're asking to be allocated to the city manager to make decisions about a loan forgiveness program. It is possible that the assistance that we would provide would be up to 1.5 million in loan forgiveness.'",
        "'speaker_0': 'That's not a default, and it's not intended to be repaid to the city. But the potential for a default is on a nine month of deferred rent for the spirits, Ali, and the nonprofit businesses who then are being given three years to repay that that loan.'",
        "'speaker_0': 'So I just want to.'",
        "'speaker_4': 'Know if there's a chance that we don't differ all I mean, we don't get all of that loan. So there is a chance that the tenant could default in the loan conversion program. But we're not saying.'",
        "'speaker_0': 'Right or that we may not want to give.'",
        "'speaker_4': 'Fodder for the loan conversion program. Does it mean they're going to get a grant? It's a possibility, but that's all negotiated.'",
        "'speaker_5': 'Yeah. And I just want to clarify what we're we're making a decision on tonight is not on the not on the the loan conversion, but on the additional 1.5 million where we give them the nine months of deferral, correct?'",
        "'speaker_4': 'No, sorry. It's confusing. So there's three components. The $1.5 million is specifically for the loan conversion program that allows the city manager and gives us some room to negotiate what you know, how much we would allow or grant to each tenant.'",
        "'speaker_4': 'And as you know, right.'",
        "'speaker_5': 'Before you continue, is that in addition and this is a question for the city manager, is that in addition to the authority that we already gave about this, up to the previous authority that we gave was up to a certain amount.'",
        "'speaker_5': 'Well, we did not all of the way.'",
        "'speaker_1': 'It went at a time when it is, as the council member said. Okay. Mr. Connor. Then, Mr. Levitt.'",
        "'speaker_4': 'It wasn't clear to us what the authority was. That's why we haven't awarded any of those grants, because we were we were not sure how much we had to work with. And that is why we're asking for the $1.5 million.'",
        "'speaker_0': 'And it is additional authority to do so on top of the prior authority that was granted to the city manager for citywide activities. This 1.5 million would be in addition to that.'",
        "'speaker_5': 'Well, some 1 million.'",
        "'speaker_6': 'Maybe I can clarify. Yeah.'",
        "'speaker_1': 'Let's hear from the city, man.'",
        "'speaker_6': 'I'm not sure whether I'll clarify to confuse, but I think there are three. I try to simplify and say there are three basic actions that council has done during COVID. I mean, there's been a lot of smaller pieces during that.'",
        "'speaker_6': 'One was and I think this might be why you talk about the you gave opportunity to defer rent I believe as for 60 and then we extended to 90 days, we did not provide any forgiveness of loans during that time because like then that said, we I had a concern in particular that any forgiveness was not specifically'",
        "'speaker_6': 'authorized by council. So we did not doing forgiveness. We just did deferrals of three months, up to three months during that time. Then there was obviously the grant programs to businesses as well as to there was 100,000 that was given to.'",
        "'speaker_6': 'Up to 100,000 is given at Alameda Point because there is me a point and then other grants that were given to other businesses through the competitive grant program. And then the third was the 2 million and the 2 million.'",
        "'speaker_6': 'All that went into the 2 million. But that was not. This is not an addition to that.'",
        "'speaker_5': 'Okay.'",
        "'speaker_1': 'So we have so kilometer radius here. And it's just a.'",
        "'speaker_3': 'Point of clarification. I mean, looking at the plate, looking at the minutes from I think it was May 19, the motion was to give staff authority to provide any three month deferral and up to an additional three month deferral per tenant, which would be converted into a promissory note.'",
        "'speaker_3': 'And then we get put a cap on a Bateman and you're going to come back and talk about removing that cap. So I think it was six months worth of deferral that we authorized. So it's not unclear to me because I read the minutes.'",
        "'speaker_3': 'So I made the motion.'",
        "'speaker_6': 'So so what the the unclear part was, was whether or not we could do forgiveness. So that's what I went on. And we didn't do any forgiveness of any of that. That's what I said.'",
        "'speaker_1': 'So, my fella, you're next.'",
        "'speaker_5': 'So, yeah. So so my question is really because as part of that motion and on May 19th, we gave a specific cap on abatement. What I'm what I'm not clear on is what is the ask from staff. You want to be able to abate all 1.5 million.'",
        "'speaker_5': 'You want to be able to abate what is the cap that you're looking for? Because we gave you a number back then. You didn't exercise that. And now I'm concerned that you're asking us essentially to write a $1.5 million check to you where there is no review by counsel of what money gets given out as grants to'",
        "'speaker_5': 'whom and to and what percentage to which business. So if you could walk me through that, I'd appreciate it. That questions for the city manager. I would like to hear from the city.'",
        "'speaker_1': 'And may I just ask for clarification from you? Councilmember Avila, are you suggesting that the council should get to approve what loan is made, to which business, or that we.'",
        "'speaker_5': 'Know.'",
        "'speaker_0': 'And.'",
        "'speaker_1': 'Criteria.'",
        "'speaker_5': 'Approve a program, the process criteria. And I just I haven't seen that proposed in the in the thing. And so I'm I'm kind of wondering where this all fits together. So I don't want to be involved in the individual decision making.'",
        "'speaker_6': 'Okay. So there.'",
        "'speaker_1': 'Was neither.'",
        "'speaker_6': 'So there was no deferrals made because they are not deferrals, but no forgiveness made because I read it more conservatively on that and was concerned that I did not want to surpass my authority because. Doing forgiveness would be equivalent to an expenditure.'",
        "'speaker_6': 'We have a 75,000 cap expenditure. I want to make sure if I was going to air, I had more on the conservative side on that particular one and we did have the we have done deferrals of the rent.'",
        "'speaker_6': 'But as far as forgiveness, we have not done the 1.5 billion is a cap which could be forgiven up to that 1.5 million if you want to put more restrictions on it. I'm open to hearing that and we are open to hearing that and moving those in there.'",
        "'speaker_6': 'But unless I am wrong then that the 1.5 could be that could be the limit on the forgiveness within those loans.'",
        "'speaker_4': 'You're right.'",
        "'speaker_5': 'Okay. And then, is there a potter?'",
        "'speaker_1': 'I see Mr. Potter with your hands up. Let's hear from her. She might have so other information.'",
        "'speaker_0': 'Right. So thank you. The 1.5 million. It would be a cap. It would be a maximum. We have received six or seven applications to date.'",
        "'speaker_4': 'That have met.'",
        "'speaker_0': 'The eligibility requirements for the program as previously adopted by counsel, so that this 1.5 million would be spread across a number of businesses who have asked for assistance. And then I wanted to respond to Councilmember Vela's point. That criteria were established for what needed to be met to go from from deferral to abatement.'",
        "'speaker_0': 'The council did that in the spring. They were things like bringing back your workers, innovating, you know, working with the community. There were a number of criteria. We are not proposing any changes to that criteria that were previously established.'",
        "'speaker_0': 'We are just seeking, as the city manager has said, the authorization and clarity that there is understanding that the request is for a 1.4 or $1.5 billion pot of money that could be applied to businesses based on staff's analysis of need, and then of how the criteria for the program to to qualify for abatement is met.'",
        "'speaker_0': 'And so that we wouldn't be bringing back the individual proposals to the Council, rather, we would work within the criteria and the capped amount of money so that that's our proposal about how to move this forward.'",
        "'speaker_1': 'Thank you, counselor. Did you finish before I got to the next speaker?'",
        "'speaker_5': 'No, I had a couple more questions about that.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_5': 'So in terms of the up to three months of abatement on the deferral, how is that going to work if somebody defers four months of rent? Is it is it is the proposal that you get one month's for every three months you pay early?'",
        "'speaker_5': 'So if I if I have the nine months deferred, but I pay three months or two, how do I have to pay all nine months ahead of time and then I get three months back? How is that going to work?'",
        "'speaker_4': 'You get one month for every year that you pay back early, so the maximum that you could get deferred would be three months. So if it's so, if in one year a tenant pays back everything. They would get three months of deferred rent or baby.'",
        "'speaker_5': 'But if they're but if they've only if they've only deferred three months, they would get out or they only deferred four months. How does that work?'",
        "'speaker_4': 'And.'",
        "'speaker_5': 'Well, it just seems like the wording is kind of open. So I'm trying to understand.'",
        "'speaker_4': 'Well. So the thing is, is that most of the tenants who are are they need more than three months. I mean, because we've already given them the three month deferral just carte blanche in the beginning, we gave them the three months and the one year to repay it.'",
        "'speaker_4': 'Everybody has that possibility.'",
        "'speaker_5': 'But so then if people if the people that repay that, will they be getting the one month? Will this also apply to them?'",
        "'speaker_1': 'And I'm just going to ask that that one speaker let the other one finish. Ms.. Mercado, we're still speaking, but go ahead.'",
        "'speaker_4': 'One. So, no, this is just for spirits, ally and nonprofit. So it's a it's a it's a finite group of people. And it is the people who have been hardest hit, who've been unable to open all of our museums.'",
        "'speaker_4': 'You know, they have been unable to open. So and it's and it's it's from March till October. So they we anticipate that those people and I have heard from the Spirits Alley people you know Spirits Alley people are they're not able to open and they're also getting huge tax bills right now.'",
        "'speaker_4': 'And I mean, it's just everything is compounding on them. So the nine months just gets them to the end of the year.'",
        "'speaker_5': 'Right. But I guess my my question still stands, which is in the event that they don't need the whole nine months. Are we going to clarify? Is that.'",
        "'speaker_6': 'The way I would interpret.'",
        "'speaker_5': 'This three months?'",
        "'speaker_1': 'Mr. LEVITT.'",
        "'speaker_6': 'The way I interpret is that they could get the three. So if they only did three months and they prepaid it for three. They prepaid it within the policy that's being proposed. They could get up still to the three months abated, is that correct?'",
        "'speaker_6': 'Is that correct? That's the way I read it.'",
        "'speaker_4': 'I would say that not the are the nine and three. The nine and three is really our base. So if you only take three months and you pay it back in a year, you get one month abated. If you if you take six months and you pay it back in two years, you get two months abated.'",
        "'speaker_4': 'I think we would just do it across the time frame.'",
        "'speaker_0': 'As a prorated asset.'",
        "'speaker_1': 'I was going to say prorated and could come in handy. Okay.'",
        "'speaker_5': 'All right. So I. Okay. I just wanted to clarify, basically, if it's prorated or if it's just a lump sum. Thank you.'",
        "'speaker_4': 'And you make clear to the tenants if you guys approve this.'",
        "'speaker_1': 'Okay. And then we'll go into Councilmember Odio.'",
        "'speaker_3': 'Thanks. Thanks, Matt. So just some clarifying questions. So just so I can be clear, the 1.5 million. That is. Well, help me. What is that? That's the. The abatement portion of it.'",
        "'speaker_4': 'That is the loan and potential abatement portion of it. So and it's and it's up to six months. So if I'm a tenant and I've put in my application for $250,000, the city would enter into a promissory note for $250,000.'",
        "'speaker_4': 'With some benchmarks, employees return, you know, sales tax generation, you've got a competitive business plan. And then if you meet those requirements, let's say, in 24 months, the city would consider a building all or a portion of that.'",
        "'speaker_4': 'And it's going to be negotiable. And so that's so that so that $250,000 is spoken for off of that 1.5. Okay. If if we're going to abate the whole thing, if we decide we just would only abate $100,000 of that.'",
        "'speaker_4': 'So $100,000 comes off of that 1.5. And so the tenant is on the hook for $150,000 repayment plan.'",
        "'speaker_3': 'Okay. So that's a little bit different than the way I heard it explained. But that could just me not understanding it. So. I thought we were only considering a building up to three months over a course of three years.'",
        "'speaker_3': 'And now you're saying, you know, we could add staff action to nine months worth of rent up to next month. The company. Okay. Well, that's a little bit different. And then on the theater, um, I think there's a, a line in the staff report that talked about deferral on page four and then a line that says abatement'",
        "'speaker_3': 'on page five. And those are different. Not that I would have any issue with either one of them, but I mean, are we proposing an abatement for the theater or we're proposing a deferral?'",
        "'speaker_4': 'Um, I, I think that we're proposing, um, I think, I think initially we're proposing a deferral and the deferral is until 2037 or when they, if they decide to purchase the, the facility now that's, that's, that's like how it we left it back in April or May.'",
        "'speaker_4': 'But what I would say is that it, there's, um, it's a lot of time between now and 2037 and I would say that all of us are invested in the success of the Alameda Theater. And so I would I would say that after that Section 108 loan is paid off, which is in 2027, I if I were'",
        "'speaker_4': 'the theater operator, I would come back to the council and say, you don't need my money anymore to pay this obligation, and perhaps you would consider an abatement of this obligation. Um, it's a long time away and a lot can happen.'",
        "'speaker_4': 'And, um, and so I think it's, it's better for the theater operator and it's better for us to meet the immediate need and, and figure out the obligation of repayment when it's more imminent.'",
        "'speaker_3': 'Okay. I mean.'",
        "'speaker_1': 'I would just add that if you read the resolution that was drafted in that will be voting on unless it is amended on the, uh, the next to the last. Whereas, um, sorry, the, uh, it then yeah, the next to the last.'",
        "'speaker_1': 'Whereas on page one says whereas Stafford, you have to build the conversion applications but over and, and the nine months of rent deferral for the Alameda Theater. So that is what is proposed to me. And who was I?'",
        "'speaker_1': 'Was that you? Mr.. Mr.. That is something. And Mr. Leavitt has his hands up.'",
        "'speaker_6': 'So I think.'",
        "'speaker_1': 'Oh, that's Eric. Yes. Yeah.'",
        "'speaker_6': 'So I think, I think the theater's a this is all very complicated, but the theater's definitely an important entity in Alameda. And I think we see this is or at least I view this as an interim approach to at least try to to help them in the near term, but that we would be coming back with more'",
        "'speaker_6': 'the possible proposals, including forgiveness with the theater. The complicating factor that we're trying to work through, which I think and that was explaining, was that because it's tied to a loan. So when Alma did loans, I think they wisely did.'",
        "'speaker_6': 'They tied them to revenue sources. The revenue source that part of this loan was tied to was payments coming from the theater. So if we forgive that, then we're going to have to make up those payments for that loan from some other source, such as the general fund.'",
        "'speaker_6': 'Okay.'",
        "'speaker_3': 'I appreciate that clarification.'",
        "'speaker_1': 'And I think Ms.. Mercado might have wanted to clarify further. Mr.. If you can hold on.'",
        "'speaker_4': 'I just am going to piggyback on what the city manager said, which is if we default on that Section one eight loan, then that we would no longer receive any CDBG money from the federal government, HUD for its HUD funds.'",
        "'speaker_4': 'And as you guys are well aware, that is that is funding that goes to our most vulnerable populations. So that's why we have we like very concerned about making sure that that the theater can pay its obligations.'",
        "'speaker_6': 'But but.'",
        "'speaker_1': 'But if.'",
        "'speaker_6': 'I could just add the reason. The other complicating factor is, as you may have read, like Regal Theaters has put out an announcement that nationally they're going to be at least closing them at least for some time here in the near future.'",
        "'speaker_6': 'I don't know if I care or if I read those permit or just for over a period of time. But I think those same factors are affecting our theater here. That the local theater.'",
        "'speaker_1': 'Absolutely. And Mr. Brody, back to you.'",
        "'speaker_3': 'Thank you. I mean, to that point, you know, when the theater owner spoke to at least me back in May, they were anticipating that a 4th of July reopening. And that hasn't happened. And given the fact that there's a complete denial in Washington now that this thing even exists, I don't think we're going to see anything until'",
        "'speaker_3': 'January or February. So I'm all for helping out the theater. I'd like to see us do a little bit more than was proposed. You know, we've we've offered you know, there's been a plan to abate rent for some of our other tenants.'",
        "'speaker_3': 'But I'd like to see some plan that we could possibly abate rent for the theater, maybe in exchange for additional community benefits. I think there are other ways we can also help the theater. I know that, you know.'",
        "'speaker_3': 'That's the city owned property. Right. And, you know, AMP is providing power to that. So I'm more than happy to approve anything related to theater and even more than than we've we've suggested. So I'll just leave that aside.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Thank you, Councilmember.'",
        "'speaker_3': 'I'm not done yet, though. I mean, I'm done with the theater, but Ms.. Mercado may have her hand up, so. Yeah, that's my question.'",
        "'speaker_1': 'Yeah. Puerto Ricans remind.'",
        "'speaker_4': 'You that you have done you have already waived the percentage rent payment for this year, which was $175,000. You've already waived it for next year, which is anticipated. We don't know what it will be. Might be nothing because they haven't had any revenue.'",
        "'speaker_4': 'You've already increased the percentage rent number four in perpetuity. So the city has done a lot to help the theater. And and this one is just an outlier. And I'm sure that we would have done more, but we were like, we're we're sweating that Section 108 payment.'",
        "'speaker_3': 'And so I'm perfectly happy to sign off on that.'",
        "'speaker_1': 'Um, again, I'm not sure what's in the air or water, but please, let's let one speaker finish before we start. I think Mr. Cano is about to wrap up your jam. Okay, Mr. Odie, back to you.'",
        "'speaker_3': 'Thanks. So just a couple clarifying then. How are we defining the tenant as far as the 1.5 million?'",
        "'speaker_4': 'We had some we had some criteria that we listed that, you know, for the $1.5 million, they've had to have over 25, 25 employer employees. They had to be consistent with a long term plan for Alameda Point. So it can't be a tenant that's in a building that's eventually going to go away and they have to be'",
        "'speaker_4': 'a sales tax generator. So we we were specific about either jobs or sales tax. We were specific about who would be eligible for that that pot of money.'",
        "'speaker_3': 'Okay. That's thank you. But that's a different question. I mean, how are we defining attendance? Is it to someone that we have a lease arrangement with? That the council has approved only. Only. Quote unquote, tenants out there that have council approved leases are going to be eligible.'",
        "'speaker_3': 'Correct.'",
        "'speaker_1': 'Are you thinking of some particular example, Mr. Rudy?'",
        "'speaker_3': 'I just want to make sure we're defining Tenet as Tenet. Because if you have, you know, some tenants or licensees or whatever, I mean, I want to make sure that, you know, really they're interested in that.'",
        "'speaker_4': 'Sorry. I'm sorry, Mayor. I'm sorry. I didn't mean to start up.'",
        "'speaker_3': 'I stopped.'",
        "'speaker_4': 'Now we have we have one applicant who is under. They are in law. They are on a long term license that expired and has gone month to month. And we were in the throes of doing a long term lease with them, but we were smacked in the face with the Surplus Land Act.'",
        "'speaker_4': 'So we that we would consider them a tenant because they were caught in the middle of the over of some something external to our operations. We do have a lot of trepidation about that, and I think the city manager is majorly conservative about the relationship that we would have with them.'",
        "'speaker_4': 'And however, I don't think that we would exclude them from consideration because. Only they have multiple. They have one least with us that did come to council. That's now on a month to month only because we can't come to you with a longer term lease.'",
        "'speaker_4': 'So I think that one would be a little bit more tricky. But the rest of these people who have applied have leases that have come to the council. There's just one strange.'",
        "'speaker_3': 'I don't remember signing off on a month to month lease, lease or license now either.'",
        "'speaker_4': 'So it's in a hold over because it expired and we can't renew it because of this new Plus Lands Act.'",
        "'speaker_3': 'So is it a license or is it a lease?'",
        "'speaker_4': 'There's that they have multiple properties, so they have a lease that's in a holdover and they have a couple of licenses that that we are we can renew those for up to one year that renew themselves under the Surplus Lands Act.'",
        "'speaker_4': 'But we have to be super careful.'",
        "'speaker_3': 'Okay. And then my other question, I remember my next one was how are we qualifying? I think you answered that previously. So if we decide to give some abatement, I mean, are these lease amendments that have to come back?'",
        "'speaker_3': 'Because I know we did have a discussion with one of our tenants that we approved. I want to say it was last meeting where we actually amended the lease. Because it is what it seems to me here is we're trying to do this in a vacuum where you have a list of people that you think are qualified'",
        "'speaker_3': ', but we can't reveal that to the public. So there's a to me a little bit of a transparency issue that we're kind of skirting around, you know, who's actually going to get this money and definitely not willing to tell the public or the council who those people are.'",
        "'speaker_3': 'So, I mean, is that is it at some point we're going to have a public discussion on that? And if not, that's fine. But just let me know.'",
        "'speaker_1': 'What I was gonna say. Is it. And then the city attorney can certainly feel free to weigh in on this, but are we not talking about a business arrangement between our tenants and our our property management staff?'",
        "'speaker_0': 'What's the city.'",
        "'speaker_1': 'That the city attorney do you want to weigh in?'",
        "'speaker_3': 'It would be my current understanding that any changes to the lease that's existing would come to council for final approval unless Mr. McConnell or Ms.. Potter sees this differently. I would expect that if we are making fundamental changes to the underlying lease, that that would come to the Council for approval.'",
        "'speaker_4': 'Initially, we had said that we would enter into these promissory notes that would be defaulted with the lease. I do not believe that it was our intention to come back to the Council with the promissory notes. That is your decision on the program that we're talking about with up to nine months and the three over three.'",
        "'speaker_4': 'We those we said that would be done by a lease amendment. I think that this could come to the council, I guess. And but I think and I, I think we're not opposed to coming to the council. But I would just tell you that my, my initial hesitation is with the with the conversion and abatement.'",
        "'speaker_4': 'Is that. We developed this program in April and it's October. And our tenant, I mean, I just for the expediency for helping our tenants, that would be my only hesitation.'",
        "'speaker_3': 'Okay. So then help me with some boundaries then. So nonprofit. That's just a five. The 1c3. Right. That's who's eligible. Okay. And then spiritually, is there a boundary around who would be eligible?'",
        "'speaker_4': 'It's the tenants are monarch.'",
        "'speaker_3': 'Okay. So any tenant on monarch, whether they are, you know, alcohol, spirit producing brewery, whatever. Right. So they have to have a monarch in their address.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_3': 'So then help me. The difference between the rent assistance program and the nonprofit Spirits Alley, is that one bucket of money or is it two buckets of money? What are we looking at here?'",
        "'speaker_4': 'So it's it's one bucket of money. It's all five, eight, five, eight, which is the base we use to fund. The $1.5 million is coming out of the an appropriated fund balance and then the the not the. So that's spoken for from the bottom line.'",
        "'speaker_4': 'Under the bottom line. Just think about it that way. And then the program, the nine month, three year program is operating of the operating fund of the $40 million anticipated. We would adjust our revenue projections accordingly and it would probably lower our revenue projection in this year and this fiscal year.'",
        "'speaker_4': 'It would raise it over the next three years anticipating the repayment of those funds.'",
        "'speaker_3': 'Okay. I guess what I'm still unclear about is what is the maximum amount of potential rent abatement authority that you're asking for? Is it 1.5 million? Is it 1.5 million plus something extra for spirits, nonprofits? Is it some other number?'",
        "'speaker_4': 'It is. It is the second one. It is the 1.5 million plus whatever the whatever the tenets, hospitality and nonprofits ask for over the three year period of time.'",
        "'speaker_0': 'Well, I just. I'm not.'",
        "'speaker_1': 'Here. Okay.'",
        "'speaker_0': 'Sorry. I'm just sorry. And just to qualify, it's for the Spirits Alley and the nonprofits. The maximum abatement would be three months of rent abatement over a three year period. If every one of those tenants repaid early. Otherwise, it is simply a deferment or a rent deferral.'",
        "'speaker_0': 'It is. The only abate portion of that is if.'",
        "'speaker_4': 'You.'",
        "'speaker_0': 'Repay early and then you have a max of three months of. Of abatement, and that would happen over a three year period. So it would start next year and go forward three years. So it really is a future looking program.'",
        "'speaker_0': 'So 1.5 is an immediate authority that would start as quickly as these deals are associated.'",
        "'speaker_1': 'Okay. The city manager has his hands up.'",
        "'speaker_6': 'So I have maybe an alternative option that wasn't in the report as an alternative, but it's off the same concept. So maybe an alternative. Great.'",
        "'speaker_1': 'You need to move around here. It's good for your circulation. Yes.'",
        "'speaker_6': 'So maybe an alternative would be. If you approve the program as presented the two parts as presented the nine month deferral and the and the 1.5 that if it's a deferral with a repayment in the let's say the 1.5, if it's a repayment, then that will could be approved at a staff level at my level by the'",
        "'speaker_6': 'if there was any abatement that was agreed to in that, that that would be a change in the lease rent that we would get throughout the lease. So in that case, as an abatement, it would have to come back for a lease amendment to council.'",
        "'speaker_6': 'That might be an option, if you like, the program with concern about too much, about the concern about having too broad a span for the abatement we could have. If there's an abatement that would have to come back as an amendment to the Council for approval, I just want to throw that out as an alternative option.'",
        "'speaker_3': 'Okay. Well, I mean, I'll just make one last comment and then see the floor. I mean, what what concerns me about this is the same thing that concerned me back in May was that it's a blank check. So basically what I hear today is we want to we want to abate up to $1.5 million in rent for'",
        "'speaker_3': 'anybody. And then we want to abate up to three months rent from Spirit Alley and nonprofits. But you're not giving us a number on how much money that could be. And, you know, maybe we can get that before we vote.'",
        "'speaker_3': 'So because we're just voting on a blank check, in my opinion, and I'll see the floor now.'",
        "'speaker_1': 'Thank you, Mr. Brady. We're going to go to the vice mayor now because he can't stay.'",
        "'speaker_4': 'On the.'",
        "'speaker_1': 'Line too much longer. So Vice Mayor Knox White.'",
        "'speaker_6': 'Thank you very much. So I'm sure I mean, I have to leave in about 5 minutes. So I didn't think this is going to go on so long in general and run supportive of the staff proposal. I also am in support of it moving this forward and getting getting the idea that we were talking about this in'",
        "'speaker_6': 'May and it's now October and we still haven't helped out these businesses is the biggest provide for me out of everything. And so, you know, I worry that we're over complicating things a little bit, but I guess I also appreciate the concerns that are being raised.'",
        "'speaker_6': 'Like I don't want to be flippant, but with the public's money. You know, I'm not in the theater because my roadie mentioned, you know, I would quite honestly be willing to started. I had a year's worth of deferral rather than nine months.'",
        "'speaker_6': 'I just honestly, the idea that the movie theaters are going to be back sometime next year in a meaningful way is just crazy. And I do think that we keep incremental izing these things. And we're going to be back here in three months or four months having the same conversation, and it's going to be agonizing or whatever'",
        "'speaker_6': '. Let's just call it theaters. We're not going to be back. I mean, he might be open and we're operating at ten or 25% occupancy and maybe holding on. But he's certainly not going to be running that theater at a level where where it's done.'",
        "'speaker_6': 'So I would like to at least give the city manager the authority, and I'm not sure I'm going to be here for the vote because I don't know, 5 minutes. But I would like to see the theater go for a for a maximum of 15 months.'",
        "'speaker_6': 'And then, you know, again, I just want to reiterate what I heard the city manager said, which is this is the beginning for all of these all of these businesses, the beginning conversation. It's not the final word. We're just trying to get some certainty there.'",
        "'speaker_6': 'And as long as you know, I would be very supportive of anything that just made it really clear that we're not going to come back and say, why are people asking us for more money in January when our, you know, our county and our city is have required them to be closed in the buildings that we have'",
        "'speaker_6': '? So those are my short term.'",
        "'speaker_5': 'Thinking behind.'",
        "'speaker_6': 'Trying to work as these very complicated and difficult.'",
        "'speaker_1': 'Thank you. All right. So we haven't heard from Councilmember De Saag and and I haven't spoken. So before we go back to councilmembers who have spoken, let's hear from Councilmember Desai. Are you unmuted?'",
        "'speaker_6': 'Okay. One more time. Yeah. Quick question for the staff when it comes to the nine month rent deferral that's contemplated for the theater. Is there something special about nine months or could we conceivably do 12 months as vice mayor Knox White had mentioned?'",
        "'speaker_6': 'I mean, if it's just as well I mean, if there's nothing special about nine months and that we can do 12 months, I think I think the rationale that it presented is it probably applies here so we can get a.'",
        "'speaker_6': 'Response to that.'",
        "'speaker_4': 'Nine months. It takes us to the end of the year.'",
        "'speaker_6': 'Oh, okay. Well, that's all it is. It's just kind of this convenience thing. Okay. All right. Okay. No, I think the idea of 12 month rent deferral probably makes more sense, I think. So, you know, that's something that that I can certainly support.'",
        "'speaker_6': 'In terms of Alameda point, I think it's clear that the businesses there that we're talking about, they they've really made. They've really put Alameda point if not Alameda on the map. I mean every year of the Chronicle and perhaps with the assistance of the city of Alameda.'",
        "'speaker_6': 'But every year the Chronicle comes out with their city of Alameda insert touting businesses. And we all love how they always have those beautiful photographs of of the of St George's facility. I mean, so so they've really put us on the map and certainly rock wall has been an important part.'",
        "'speaker_6': 'But when I think of Rockwall, obviously I'm also going to think of Rosenblum Sellers from many years ago. So I'm very supportive of what staff is recommending. I think they've laid out a workable framework for assessing the businesses, whether with a $1.5 million conversion loan idea or with the rent deferral idea.'",
        "'speaker_6': 'I think we can work with that. It's very limited in its in its geographic scope, namely the Spirits Alley. And and for good reason. Like I said, the these areas, these businesses really have put us on the map.'",
        "'speaker_6': 'I mean, cheeses, you know, I just remember way back in the 1990s, you know, we were always grousing about, you know, work and work and, you know, young middle age adults have a fun place to hang out, you know, in the city of Alameda.'",
        "'speaker_6': 'Well, you know, lo and behold, you know, this the idea of Spirits Alley came about and a lot of businesses were were cropping up on their own. And I think we got to hold on to that. And it goes without saying, obviously, for the east and, you know, the what the theater has done for for Park Street'",
        "'speaker_6': ', we all know that story. So so that so we don't have to rehash that. So I'm very supportive of what staff is outlining, and I'm confident that that staff can, when it comes to negotiating the rent deferrals and converting it to abatements, etc., I'm very confident that our staff can figure things out on our behalf.'",
        "'speaker_1': 'And this kind of.'",
        "'speaker_4': 'I'm so I'm council member Odie I have been diligently doing my math here to help.'",
        "'speaker_5': 'Out with.'",
        "'speaker_4': 'That. That total number would be for Spirits Alley and and nonprofits and I estimated to be about over a three year period of time. Potentially it would be $390,000.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'So $10 a year.'",
        "'speaker_1': 'This is tell us what that represents again.'",
        "'speaker_4': 'Now, what I did was if we deferred three months rent of all of those guys, what's the what's that magnitude, the number that Councilmember Ody was asking for? And so it's about $390,000.'",
        "'speaker_6': 'And that's assuming that if and that would be a payment if they prepaid and only one year, right?'",
        "'speaker_3': 'Yeah. Thank you. It gives me much better comfort. Thank you.'",
        "'speaker_1': 'Okay, so I'm getting this powder.'",
        "'speaker_0': 'And the only thing I wanted to add that if the council wanted to offer extended rent deferral to the theater, the only we would have to either come back with a second budget amendment to capture the additional funds we would need to make the 1 to 8 loan, or we would have to amend the resolution this evening'",
        "'speaker_0': '. And I think we would probably want to come back separately with a resolution on any extended time so that we could calculate what that actual number is. But I just wanted to remind the council that there is a cost to the general fund to extending the time.'",
        "'speaker_6': 'See.'",
        "'speaker_1': 'Thank you. So here's what I want to say. I'm going to start with Alan made a point. I think if I were in Alameda Point business listening to this discussion and I think a few of the business people from out there are listening, I might be rather dismayed.'",
        "'speaker_1': 'I mean, I think it's great that we want to be careful with the expenditure of our dollars, and I hope that cuts across the board. So our expenditure on all kinds of things. But stop and consider our Alameda Point businesses.'",
        "'speaker_1': 'They have been out there what I call the wild, wild west from the beginning. They have suffered through infrastructure that is World War Two era.'",
        "'speaker_0': 'Or.'",
        "'speaker_1': 'Earlier. I mean, it's getting better now, but that means they've lived with all the construction and everything that that brings, but they have lived with their power going out through water, going out, their telephones going out, and they still run businesses.'",
        "'speaker_1': 'Those were in the good times. And then we came to this pandemic and they are struggling as best they can and time is money. And I'm also pained that we have discussed this, as was noted back in April and May, and here we are in October still discussing it.'",
        "'speaker_1': 'So I, I think it's a reasonable amount of money and it's coming from the, the Alameda Point, the base reuse fund. And Ms.. McIntyre just gave us the you could call it the worst case scenario, but maybe you'd call it the best case scenario.'",
        "'speaker_1': 'Truly, if every business out there that gets one of these loans is able to repay it early, that says something about business recovery, and that'll come back to help us in other ways. But right now, the simple fact is none of us has that crystal ball and can see into the future, but we can be reasonably sure'",
        "'speaker_1': 'this that we're going to be dealing with the impacts of the pandemic. I don't see the federal government coming up with a stimulus package before the end of the year, does anyone else. And so we have to help our own sometimes.'",
        "'speaker_1': 'And so I think it's a reasonable risk that we're taking. I think it's an investment. Do I know exactly how it'll come out and that everyone will be able to pay back and in a reasonable amount of time?'",
        "'speaker_1': 'I don't. But I think these businesses have stretched themselves to operate and brought a lot of benefit. As Councilmember Days have noted to our city. I think this is the time we step up and help them survive a little longer into this this pandemic.'",
        "'speaker_1': 'You know, you've probably read the letters that were attached, but in the beginning people were doing better, but now they're getting to the end of their reserves. So I think this is the time when we need to step in with a lifeline on the theater.'",
        "'speaker_1': 'I do want it to be a rent deferral, not abatement, at least initially. We can always, you know, further down the road in time we could make changes, but I think we can ramp up gradually. Mr. Potter makes a good point that if we vote to approve the resolution and perhaps with the the amendment that the city'",
        "'speaker_1': 'manager suggested, whatever we do, I would like us to be able to move forward this evening rather than having to have this item come back again to the council and delayed that much longer getting. The assistance into the hands of the the folks who need it.'",
        "'speaker_1': 'And again, with the theater, it's helping us pay to learn the section. When we learn that if we defaults on, we lose CDBG funding and we don't want to do that. So let's see if we can't find a way to wrap this up tonight.'",
        "'speaker_1': 'I see Councilmember O'Dowd and Councilmember Vela in that order.'",
        "'speaker_3': 'So I'd like to make a motion, but the way to do it, to do two separate motions.'",
        "'speaker_1': 'The city attorney is shaking his head. No. All right.'",
        "'speaker_3': 'So I would like to authorize the city manager to negotiate and execute rent relief agreements with commercial tenants on city owned properties via the $1.5 million Loan Conversion Assistance Program and implement an Alameda Point nonprofit and separately business relief program in response to COVID 19 pandemic.'",
        "'speaker_3': 'And then if that number exceeds 400,000, come back. And then approve a budget amendment appropriate at 1.5 million and base reuse fund balance for the Alameda Point Theater Loan Conversion Assistance Program and 315 and General Fund to assist Alameda Theater and give staff direction to come back with possible extensions of that deferment.'",
        "'speaker_3': 'And I just say one thing. I mean, the vice mayor and I have been pushing, you know, at least twice or three times to increase the amount of grant money for our small businesses by 300,000 or 600,000. And that's been rejected.'",
        "'speaker_3': 'So, you know, we've been pretty strong about providing money to businesses. You know, whether or not, you know, we require a big ask like this to be delineated with the actual dollar amount, I think is different than, you know, our commitment to to our small businesses.'",
        "'speaker_1': 'Thank you. I'm somebody Counselor Avila.'",
        "'speaker_5': 'So I actually still had questions and I haven't made any comments yet. I only ask questions.'",
        "'speaker_1': 'I see. Can we see if we can do it a second so we can just. Well.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'I would like you to question answered before.'",
        "'speaker_5': 'So we did we did give a list of criteria before, but that was under a different cap of money. And so I'm just wondering if we could and the criteria were not provided with this. So I'm just wondering where it stands.'",
        "'speaker_5': 'I'm hearing that the staff is going to keep the same criteria. I know there was a question before and there was a question about the boundary of spirit. Sally, does that include the missions actions by the bay building?'",
        "'speaker_5': 'Does that include the the the catering company? I know we had had a also there was something in there about making sure that there wasn't any enrichment to folks that were elected officials within the city. So I'm just wondering where we stand on the criteria and if the criteria are going to be made public.'",
        "'speaker_4': 'Well, so I'm for the Spirits, Ali, and the nonprofit. I did not I did not suggest any criteria. And if the council wants to add some on there, if you want to roll the ones over from the loan conversion program, that's fine to you.'",
        "'speaker_4': 'I just thought that we should that the that the three the nine month three year program should be simple. But if you want to add those things on there, I'm perfectly open. I just didn't recommend them.'",
        "'speaker_5': 'I just well, I wanted it's really two separate questions I think is what I'm looking for is for the for the abatement portion of this. We did talk about a list of criteria, and I'm just wondering that was back in May.'",
        "'speaker_5': 'I'm just wondering if that list of criteria, how that's going to be applied, is that being made public or are the businesses being aware of it? What's the process for that? And then the.'",
        "'speaker_1': 'Second part, what is the application process?'",
        "'speaker_5': 'Right. What's the application process look like? And then for the for the Spirits Alley portion of it, the question is really, again, you said all of monarch. And so I'm just when you answer that, you said, are any of the distilleries and all that, but there's a lot of other things on Monarch.'",
        "'speaker_5': 'So I just want to clarify, every business on Monarch would qualify for that, or only the distilleries and nonprofits on Monarch. I'm pregnant.'",
        "'speaker_1': 'Yeah, I was asked to say that.'",
        "'speaker_4': 'Most of the businesses I'm monarch are public serving businesses, and we intentionally put them there for that reason. For example, the antiques fair and the auction, those are all public serving businesses that have been struck by the same restrictions that the that the distilleries, the breweries have had.'",
        "'speaker_4': 'So I would I would lump them in there regarding the criteria and restrictions that you had on the previous and the loan conversion program. Quite honestly, we didn't really receive applications from people who would be. There were a couple of things that greeted the public officials.'",
        "'speaker_4': 'And then the you didn't want people who received the small business, you didn't want double dipping. So there was there was one tenant who received the small business and that tenant was denied for further and they didn't meet the employment qualifications because again, you guys set the bar, you guys intentionally.'",
        "'speaker_4': 'The small business loans were for 25 and under employees and you said 25 and over for the loan conversion program. So it was already mutually exclusive. But again, we never we didn't receive any applications from people who would have been denied on the criteria that you guys set out.'",
        "'speaker_5': 'And so the criteria because it's listed, the three of these three criteria, I'll just put it out there for people that haven't seen it. It's in the staff report on page two, but those criteria will stand for the abatement.'",
        "'speaker_5': 'So they'll still be used for this $1.5 million abatement process.'",
        "'speaker_4': 'Yes, absolutely.'",
        "'speaker_5': 'And then Councilmember Ody had raised the question earlier about what is a tenant? Is that going to be added as a as an additional criteria?'",
        "'speaker_4': 'Well, I guess I'll have to figure out how we answer that, Amina.'",
        "'speaker_5': 'Because I'm also trying I'm also trying to understand the emotions relative to his question, which is really I guess, the question for the of the.'",
        "'speaker_1': 'Ocean City attorney shared, is there anything you can add to help help us move this along?'",
        "'speaker_6': 'I would definitely.'",
        "'speaker_1': 'I'll throw these things to him without any warning. And he's graciously I would.'",
        "'speaker_3': 'I was also similarly trying to understand the the limits of the emotion. And if my understanding is correct and it is that it's 1.5 million for General Alameda point rent relief, another 400,000 for Spirits Alley and nonprofits relief, and then another 315,000 for Alameda Theater relief.'",
        "'speaker_3': 'Essentially, Councilmember Ortiz motion adds the 400,000 limitation to the nonprofit and Spirituality Assistance Program, where the staff recommendation did not have a cap. I believe that's my understanding. And Councilmember Otis motion and please correct me if I understood incorrectly.'",
        "'speaker_1': 'So everybody.'",
        "'speaker_3': 'Yeah it was basically the staff recommendation with the caveat of the 400,000, which is a little over 390. So that's fine I hope. And then direction to bring back some extension on the deferral to the for the theater because this Potter said we shouldn't do that today.'",
        "'speaker_1': 'And I think in this party.'",
        "'speaker_0': 'And then just to clarify to Councilmember Bella's point about the definition of a tenant, I think we have said that the $1.5 million deferral loan forgiveness program, the promissory note, will be cross collateralized against the lease. So a tenant will have to have a lease by definition in terms of how that program works.'",
        "'speaker_0': 'And if and we may if we have the ability to cross collateralize against a long term license, then then that should work, too. It serves the same principle of how how we define. And so I think that that would be our working definition of a tenant.'",
        "'speaker_0': 'If you if we have the ability to cross collateralize that note with your lease, which is what we're saying we're going to do, then you're a tenant by virtue of that.'",
        "'speaker_5': 'Okay. So I you know, I'm supportive of the motion. I did like the idea of having that the city manager put out about having potentially for the leases to come back as a lease amendment just because especially if it's going to be larger portions of of money.'",
        "'speaker_5': 'I don't want to leave that on the city manager. I think it does need to come back at least to be run by council for for approval.'",
        "'speaker_1': 'So, Kelly, I'm sorry. I didn't mean to cut you off. Go ahead.'",
        "'speaker_5': 'No, no. So I'm just I'm just wondering if if we could clarify that with the maker of the motion and and.'",
        "'speaker_1': 'What I was going to ask you, Councilor Arabella, is could we do that as a council direction to staff and keep the motion clean?'",
        "'speaker_5': 'I'm fine with that as long as it's a clear directive.'",
        "'speaker_1': 'We should probably go back to the maker of the motion. But, Ms.. Potter, you want to throw in something?'",
        "'speaker_0': 'And then I think that staff completely sympathizes with the desire and issue around transparency. So I don't I would say that we may want to bring would you consider would council be amenable to perhaps a report out so that we are documenting and reporting?'",
        "'speaker_0': 'If we do it as a lease amendment that is by ordinance, it's a first reading. It's a second reading. It's 30 days time. And and I'm wondering if a report out would be something that could satisfy that council's desire for transparency and information, knowing that we've kept the two programs.'",
        "'speaker_1': 'And and tell us what would be in the report at this point, if.'",
        "'speaker_0': 'It would be essentially the deal, what the deal, you know, the deal structure, what that what the deal structure is.'",
        "'speaker_1': 'So we've made these agreements with these two tenants. Tell me the point. And these are the terms.'",
        "'speaker_0': 'Yes. And I think we would we may want to work with the city attorney about whether or not there's any kind of proprietary information that we might want to address. But to be as transparent as we can with with a report and with an update about the activity of the $1.5 million program.'",
        "'speaker_1': 'So let me and Councilor Rebecca, you are next. But let me just ask for the city attorney to weigh in on what Ms.. Potter just said about the reporting and transparency. Does that give you any cause for concern?'",
        "'speaker_3': 'I'm assuming what Ms.. Hunter's proposing is that is is that in the program, staff is proposing we're not making fundamental changes to the lease. We're simply engaging in deferment and forgiveness. The lease remains the same. So if that is the program staff is proposing ultimately, which we're deferring and then forgiving, but not making the fundamental changes to'",
        "'speaker_3': 'the underlying lease, then council could delegate that authority to the city manager. But if we're making fundamental changes to the substance of the lease for some reason, then we need to bring that to the Council for your approval.'",
        "'speaker_3': 'I think that's sort of where the limitation is, is that you can delegate to staff, to defer and to forgive money. But if we're changing the lease structure, council has to vote to approve by ordinance.'",
        "'speaker_1': 'And what about the reporting out of details of the transaction?'",
        "'speaker_3': 'I think as soon as the city executes an agreement, then that agreement becomes a public record. So every part of that is public information, whether it's executed because the city manager did so with more delegation of authority or if the council did it in open session.'",
        "'speaker_3': 'Either way.'",
        "'speaker_6': 'The totality of that agreement has to be a public record.'",
        "'speaker_1': 'Okay. Back to you, Mr. Clark.'",
        "'speaker_5': 'So I would be fine with that, except for anything over six figures for one individual tenant, or if we could break it down because 1.5 million, let's say we give forgiveness for. I guess my concern is I don't want to get a letter or email from from a tenant saying, you know, I was denied.'",
        "'speaker_5': 'But this other this other tenant got, you know, all of their rent deferred. And it was this huge portion of that. And there was a read out and there was no approval. We didn't renegotiate anything. So is there is there like a or even I'd even be fine with one point or 150 up to 150,000, which.'",
        "'speaker_5': 'Is 10% of the 1.5 million.'",
        "'speaker_0': 'I. But I think every.'",
        "'speaker_5': 'Sorry. Go ahead.'",
        "'speaker_0': 'I believe that every every applicant that we're looking at, the net rate is over 150,000, correct? That's correct. Yes.'",
        "'speaker_5': 'So but in terms of forgiveness. Like, I think it's one thing to defer over 150,000, but everyone's looking at over 150,004 in a grant.'",
        "'speaker_0': 'Yeah. If you recall from the beginning tation that if you're right, if you're if one month's rent is $60,000 and you ask for two months of of abatement, you're at 120,000 right there on two months of rent. So we're talking about that's been some of the challenge with this is that we are talking about large, large monthly'",
        "'speaker_0': 'rents and large monthly obligations. So perhaps to address your concern, though, a capital letter scenario, as I was just going to say, perhaps 350,000, you know, maybe for if an abatement is going to be more than 350,000, we would bring it back.'",
        "'speaker_5': 'I guess my question is because on page three of your report, it says that the buildings at Alameda Point are large, the average is 20,000. The larger buildings range from 30000 to 64000 per month. So I guess I'm just trying to understand.'",
        "'speaker_5': 'And you're saying now that that all of them that are asking for this are on the 60,000 range. So none of them are on the 30,000 range.'",
        "'speaker_4': 'Now. Some of them are on the 30,000 range. When we talk about the average, you have to think we're also averaging the smaller tenants, like the caterer, like the kale, dry kale. I mean, those are like $6,000 and $7,000 a month.'",
        "'speaker_4': 'And so when you add those in and then you also have buildings but that are split, you have products, you have a hanger, one and faction and a split building. And so those rents are lower than like a larger building like Saint George Spirits or Rockwall.'",
        "'speaker_4': 'So when we say the average is 20 to 30, that is the average. But there are there are tenants that are $60,000.'",
        "'speaker_1': 'So would it be city manager I think wants to add some enlightenment, I hope. Okay.'",
        "'speaker_6': 'Well, hopefully I agree with you.'",
        "'speaker_1': 'No pressure.'",
        "'speaker_6': 'But I would go back to that if you go with your motion. But you say if it's forgiveness, that the forgiveness would have to come back as a lease amendment to the council. I just get really concerned. So the deferral, the agreement, all that could be done through this motion benefit.'",
        "'speaker_6': 'If the company negotiates a lease, forgive or forgiveness, then that the final deal on that part would come back as a lease amendment to the council. I'd recommend that. I think it gets too confusing. You have a variety of issues because that would be considered bad debt.'",
        "'speaker_6': 'There's those issues. I'd rather just come as a lease amendment than it clears clears it for that for the company to.'",
        "'speaker_1': 'So you're saying to come back as the lease amendment if it was over a certain dollar amount?'",
        "'speaker_6': 'No. If it was forgiveness, if they were asking. If they were asking forgiveness.'",
        "'speaker_1': 'Of any amount.'",
        "'speaker_6': 'Yeah. And Evans raising his hand.'",
        "'speaker_1': 'I can see that. I get the screen. Yeah. City attorney.'",
        "'speaker_6': 'I want to.'",
        "'speaker_3': 'Support the city manager's request. I think the way he's making the suggestion is more legally sound.'",
        "'speaker_1': 'It gets legally sound, that's for sure. Okay.'",
        "'speaker_3': 'But if you gave the city manager the right to forgive, what ends up happening is that that's just bad debt that essentially he's authorized to not collect, that we're not I mean, if it's doable, but it's it's more complicated and more messy, the city manager's recommendation is much legally cleaner.'",
        "'speaker_3': 'And so I just want to echo his recommendation is one that I find to be to be the better legal approach.'",
        "'speaker_1': 'Thank you, Mr. Chairman. Council member. Got to see you nodding your head. Yes.'",
        "'speaker_5': 'You're that comportment that that was. That's exactly what my concern is. I think in the long run, I understand wanting to help the businesses. I just want to make sure that we don't get ourselves into a bind.'",
        "'speaker_1': 'We have to be realistic. Yeah. Okay. And so then Councilmember Odie is the maker of the motion.'",
        "'speaker_3': 'Yeah. I mean, I. I appreciate that as well, because my worry is that, you know, five large ones will take all of that money and then, you know, some of these smaller caterers, you know, slash, you know, whatever, you know, there are one or 2000 a month.'",
        "'speaker_3': 'You know, they're not going to be anything left over. So I'm happy with with amending the motion to include that requirement. Do I need to restate it.'",
        "'speaker_1': 'Madam Clerk?'",
        "'speaker_2': 'I think we can, you know, from from the amendment being accepted, I think I think we'll get it in the record down clearly.'",
        "'speaker_1': 'Okay. So all I need.'",
        "'speaker_5': 'Is a second. All right. And second, by second.'",
        "'speaker_1': 'Is there any further discussion seeing? Then maybe we have a roll call vote with.'",
        "'speaker_2': 'Councilmember de sac.'",
        "'speaker_6': 'Yes.'",
        "'speaker_2': 'By Fred Knox. Light is absent. Councilmember Odie.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Vela. My mayor as he Ashcraft High that carries by four eyes.'",
        "'speaker_1': 'Thank you. Thank you. Thank you. Staff and city attorney and city manager. This is I mean, it's complicated. We're kind of learning as we go and trying to, you know, do our best.'",
        "'speaker_0': 'Work.'",
        "'speaker_1': 'And in an ever changing situation. And so so thank you for what you've done. But it just makes me feel better that we can move forward and start getting this these funds out to help prop our businesses up.'",
        "'speaker_1': 'And in the meantime, I want everybody who's listening to be wear your masks every time you walk out the door. I don't care what you're hearing on a national level here. You're hearing it from me. This is the way we're going to get past COVID and get our businesses back and business and our kids back to school'",
        "'speaker_1': '. So thank you all for for a great effort. All right. So that and item six D and then we move on to city manager communication that you need to be fully communicative. Mr. Leppard Yeah, but we've got that.'"
    ],
    "Consideration of Mayors Nominations for Appointments to the Civil Service Board, Commission on Persons with Disabilities and Social Service Human Relations Board.": [
        "'speaker_3': 'a while. And now we're going to talk about the concept of landfill obsolescence. So the recycling plan is currently in the process of being updated, and I should have more to provide as that's taken care of. Thank you.'",
        "'speaker_1': 'Great. Okay. So then I will move on to Item 10-K, which is the last of my board and commission appointments. I have done lots of interviews, but I've enjoyed them all because as I've said more than once, we have amazing residents.'",
        "'speaker_1': 'And so here are my three boards and commissions that I'm filling vacancies for. The first one is the Civil Service Board, and I am recommending there's two terms or two openings that I'm recommending that the incumbent, Troy Hayes Murphy reappointed.'",
        "'speaker_1': 'And Mr. Hosmer is actually a retired Coast Guard commander and has been a valuable member of this commission and would like to spend another term, serve another term, and we would like to have him do that. And it was we had amazing candidates.'",
        "'speaker_1': 'It wasn't easy to choose, but I have selected April Madison Ramsey as my as my appointee for the new position on the the Civil Service Board. And Ms.. Madison Ramsey is an attorney, an amazingly qualified attorney. She currently is on the staff of legal counsel to the Stanford Medical Center, which is besides Stanford Medical Center, Stanford Hospitals'",
        "'speaker_1': 'of the SEALs, Salter Packard Children's Hospital, Family Medical Center and more. She was senior counsel to Dignity Health before then, where she handled employment, litigation and risk management. She has a very full resume, but a few highlights that are very relevant is she's worked in the Oakland City Attorney's Office and also in the San Francisco city attorney's'",
        "'speaker_1': 'office where she served as legal counsel to the Civil Service Commission. So you can imagine the Civil Service Commission in a city city county the size of San Francisco is a pretty big deal. But she is happy to volunteer to serve as a.'",
        "'speaker_1': 'Member of the Civil Service Board in Alameda. So those are my two appointees for that board and then the Commission on Persons with Disabilities. Again, just a very inspired group that applicants. And so I am these are my appointees.'",
        "'speaker_1': 'There were three openings to fill. So Arnold Berlinguer is the incumbent and Mr. Berlinger is a former schoolteacher. He's a former school principal. He is is in a wheelchair because he's lost a leg. He is an advocate for disabled individuals.'",
        "'speaker_1': 'And when it's not times of COVID, he is a frequent user of public transportation. But he's just you know, he's in a vulnerable category. And so he's had to curtail his use of public transit for the time being and also reappointing another incumbent.'",
        "'speaker_1': 'Her name is Jennifer Linton and Ms.. Linton, like my other appointee, Alison Mullings, they're both parents of children with special needs. What if the child has had special needs since toddlerhood the other because of circumstances became disabled as a teenager.'",
        "'speaker_1': 'And but yet they're passionate advocates for their children and bring so much awareness of what it's like to just navigate through daily life in school and living circumstances as someone with disabilities. So we are happy. I am happy to nominate them, introduce them to you for my nominees to the Commission on Persons with Disabilities.'",
        "'speaker_1': 'And then we have our very busy. They're all busy. But the Social Service Human Relations Board, you heard from Ms.. Baptiste earlier, they're going to be doing some more work, looking into programs around homelessness. So I am pleased to reappoint the incumbent, Christine Chilcote.'",
        "'speaker_1': 'And Christine, chocolate is well known around town because she is the executive director of Girls Inc of the island city. She also has worked closely with the school district on the mental health awareness programs and the studies and assessments that were done of the mental health needs in our school district.'",
        "'speaker_1': 'And so she is and she has a master's degree in education and so and reappointed is Chilcott and they are very excited to appoint two newbies and one of them is create and then create. You might have met her because she's the mother of what is the Butterfly Girls.'",
        "'speaker_1': 'You remember the Butterfly Project, but pretty impressive. In her own right, she has an undergraduate degree in biology from UCLA, a master's in public health from the UC Berkeley School of Public Health. She's currently working in Oakland in a program called Starting Oakland Starting Smart and Strong, which is a cross-sector early childhood collaborative focused on improving urban'",
        "'speaker_1': 'care in education in Oakland, especially in the most underserved areas. She has worked in the city of Oakland, Department of Human Services and the Violence Prevention Unit and in Headstart. And she brings a wealth of skills to the set of Social Service Human Relations Board.'",
        "'speaker_1': 'And then we have Mr. Anthony Lewis, who has worked as a vocational rehabilitation counselor for the state of California, assisting people with severe disabilities to achieve employment. He's retired now, but he is a volunteer with the Institute on Aging and help staff their San Francisco call center.'",
        "'speaker_1': 'And so he was telling us about how they're definitely hearing from seniors, many of whom live alone, who are experiencing loneliness and depression from the shelter in place requirements. And he's also a member of the Paratransit Advisory Committee of the Alameda County Transportation Commission.'",
        "'speaker_1': 'Mr. Lewis is also blind, and so he is a also a frequent user with his golden retriever of public transit. And I said AC Transit and he said all forms of transit. So those are my. Nominees to the Social Service Human Relations Board at our next council meeting on October the 20th, you will have a chance at'",
        "'speaker_1': 'the opportunity to meet them and to vote on them. And so then Councilmember Odie 410 be that you kind of give us your stop waste topic three.'",
        "'speaker_3': 'Yeah, I think so. I apologize for news out of Turkey.'",
        "'speaker_1': 'You know, it could have been a council communication. So I would say with that that end and we will adjourn this council meeting at 11:00. So well within the same day we started. Thanks, everybody. A lot of work.'",
        "'speaker_1': 'A lot of good work. Thank you for your time. Take care. Stay safe. Let's see at the next meeting. Thank you, staff. Great job. Good night. Thank you so.'"
    ]
}