{
    "Adoption of Resolution Appointing Christopher Griffiths as a Tenant Member and Suzanne Warner as Homeowner (Non Housing Provider) Member of the Rent Review Advisory Committee.": [
        "'speaker_0': 'All those in favor I motion carries unanimously. But now we're on six a regular agenda items.'",
        "'speaker_1': 'Adoption a resolution appointing Christopher Griffiths and Susan Warner as members of the Rent Review Advisory Committee.'",
        "'speaker_0': 'We have a motion.'",
        "'speaker_2': 'The move second.'",
        "'speaker_0': 'All those in favor. I oppose motion passes unanimously. Thank you.'",
        "'speaker_1': 'Do you solemnly swear to uphold the Constitution of the United States and the Constitution of the state of California that you well and faithfully are about to enter?'",
        "'speaker_0': 'So unfortunately we did have. Speaker six And John Kline, I'm sorry if you could come and speak.'",
        "'speaker_2': 'My name is John Klein with the Alameda Renters Coalition. And thank you for a new batch of RAC members. It's a distinctly different group of BRAC members that you now have. I have to say, I was a bit shocked and aghast.'",
        "'speaker_2': 'The first time I looked at the composition of the rack, it was attorneys and real estate agents and had been that way for six or eight years. And so I'm I'm glad that you're diversifying the, you know, the board members on the rack.'",
        "'speaker_2': 'There's still the issue of that of the 10% rent increases. I'm looking forward to some actual debate on the rack among the members. Those 10% rent increases for years have been handed out unanimously. So this could be a good turning point for the rack.'",
        "'speaker_2': 'But the real the real test there is going to be how the landlords are going to respond to a recommendation that's 5% increase or 3% increase. That's the real test of the RAC. Thank you.'",
        "'speaker_0': 'Thank you very much. Uh. And now six be.'"
    ],
    "Consider Adopting an Urgency Ordinance to Remove Certain Grounds for Just Cause Evictions by Amending Ordinance No. 3140, an Urgency Ordinance of the City of Alameda Imposing within the City of Alameda a Temporary (65-Day) Moratorium on Certain Residential Rent Increases and on Evictions from all Residential Rental Units Except for Just Cause Evictions.  [Requires four affirmative votes] (City Manager 2110)": [
        "'speaker_1': 'Consider adopting an emergency ordinance to remove certain grounds for just cause evictions by amending Ordinance 3140 an urgency ordinance of the city amount of to imposing within the city. A temporary 65 day moratorium on certain residential rent increases and on evictions from all residential rental units except for just cause evictions.'",
        "'speaker_0': 'And if you want to speak on this item, if you could please turn in your your slip. So we have all the slips. And how many slips do we have? So at this point, we have ten speaker slips.'",
        "'speaker_0': 'And then is this the order that they returned in? And I'll be reading them in the order. And we're going to start with stealth presentation. Thanks.'",
        "'speaker_4': 'Good evening, Mr. Mayor, and members of the City Council. My name is Debbie Potter, and I'm the city's community development director. I'm going to be providing a brief staff report this evening. And then myself, along with the city attorney, are prepared to answer any questions.'",
        "'speaker_4': 'On November 5th, the City Council adopted an urgency ordinance that limits rent increases to no more than 7.99% over a 12 month period for multifamily rental units built before 1995. The moratorium ordinance also limits the basis on which property owners can serve termination notice termination of tenancy notices to enumerated reasons of just cause for a 65 day'",
        "'speaker_4': 'period. The urgency ordinance terminates on January 9th, 2016 or when legislation is adopted that replaces the urgency ordinance, whichever comes first. One of the primary reasons that the urgency ordinance was adopted was to provide stability in the rental market, while staff drafted legislation requested by the City Council to provide additional renter protections, including mediation, rent stabilization, relocation'",
        "'speaker_4': 'benefits and eviction protections. Several council members at the time the ordinance was adopted expressed their desire to maintain the status quo regarding tenancy and current rents. As noted, the ordinance currently provides 12 reasons that a property owner can serve a notice to terminate a tenancy ranging from 90 I'm sorry, ranging from nonpayment of rent to going out'",
        "'speaker_4': 'of the rental business. And those 12 enumerated reasons for eviction are included in Exhibit A of the ordinance. There is a there is a there is one of the one of the reasons that our is currently allowed for providing a notice of termination is to undertake substantial rehabilitation.'",
        "'speaker_4': 'That is number ten and exhibit A in the listing of the reasons for which you can serve a notice of termination of tenancy and that that Section ten and erm is going to call it up here on the Power Point.'",
        "'speaker_4': 'Section ten provides that a housing provider can serve a notice if the provider is proposing to do work on the unit that is valued at eight times the rent. Times the number of units for which the work is being proposed.'",
        "'speaker_4': 'And that the work will take more than 30 days to complete. And therefore the tenant needs to be terminated. So on on kind of reflection on this language, staff really feels and the council expressed concern about the fact that this language there's not a lot of process that's included in in this reason for notice of termination.'",
        "'speaker_4': 'There is there is no discussion about who determines that the value of the work is eight times the monthly rent, that the work will take at least 30 days to be completed, that whether or not building permits should be pulled before termination notices are are served.'",
        "'speaker_4': 'So given that there is ambiguity in this language and that there is not a lot of process that's been been outlined. Staff is recommending that that this Section ten, one of the 12 reasons that this this section be deleted from the ordinance and that we adopt that the council adopt an amended urgency ordinance, and that Section ten'",
        "'speaker_4': 'would be essentially listed as intentionally omitted. And the other thing that staff is proposing relative to Section ten is that for any notices that have been served. For substantial rehab, that those notices served between November 5th and December one, that those notices be deemed null and void and no longer in effect.'",
        "'speaker_4': 'And the removal of this provision is for the 65 day period that this ordinance is in effect. So that is one of the recommendations we have this evening for the Council. And then additional direction that was provided to staff was for staff to go through and look at the other 11 reasons that are provided for just cause'",
        "'speaker_4': 'of action under our ordinance. And if I could ask four for Exhibit A, Section five. There is another section of another basis on which just cause eviction notices can be served. And once again, staff feels like this provision of is perhaps also not as clearly drafted as it could have been and not as well informed by way'",
        "'speaker_4': 'of process. There is not we're not clear about how notice should be given and to whom notice should be given. And we did. I just want to say that we when we were drafting this ordinance for counsel's consideration, we took a look at ordinances in other jurisdictions and we focused in particular.'",
        "'speaker_4': 'And this is something that we often do because we want to make sure where we're really incorporating best practices when we recommend policy actions for the Council. And we were looking at the Richmond's ordinance. They were the most recent ordinance that was being looked at by by a local jurisdiction in the Bay Area.'",
        "'speaker_4': 'And we feel like this this may have been a provision that met some of the specific needs of the Richmond community, but we feel is maybe less less directly related to Alameda current situation. And so we just think because we don't want to trigger any unintended consequences in the next, you know, remaining month or so that we'",
        "'speaker_4': 'have on the moratorium, we would recommend that the council delete this section, too. And once again, we would if the Council wants to do that, we would replace number five this language with intentionally omitted. That would be the change that we would make.'",
        "'speaker_4': 'So that concludes my staff report and I am happy to answer any questions.'",
        "'speaker_0': 'Any clarifying questions from council. Then proceed with our speakers. Crystal Osorio and I'm going to name three at a time. J. Mariah I think it's f e r i. H it looks like than Aaron Subito. And you each have 3 minutes.'",
        "'speaker_1': 'Hello. My name is Krystal. I live in the Bayview Apartments and I'm also a student. And so now not only baby apartments are affected by this, but also other apartments here in Alameda. US renters make up almost half of the population in Alameda.'",
        "'speaker_1': 'Therefore, our rights deserve to be protected. If you could state.'",
        "'speaker_0': 'Your name when you speak.'",
        "'speaker_1': 'I'm Aaron Subito and I stand in solidarity with those who are affected by the evictions on Bayview Apartment. As a citizen, as a resident of Alameda myself, I can definitely see how gentrification it affects not just coming from San Francisco.'",
        "'speaker_1': 'It comes from San Francisco to Oakland's Alameda and a town where I've been spending 17 years of living and growing up in. I may not be living in the same apartment complex as Bayview, but who knows? This might be happening to my own family and that scares me and I don't want that to happen.'",
        "'speaker_1': 'And so we need to put some importance on rent control, not just we just do it now, not later. Now.'",
        "'speaker_2': 'And good evening. My name is.'",
        "'speaker_6': 'Jeffrey and like them, I am also a senior.'",
        "'speaker_2': 'Here at I'm a senior at Indiana High School. Now, the reason I'm here today is I want to show my support for not only for myself, but many of the people here as well, because this whole day I've been going around to several classes in my school to inform students about what's going on at the Bayview Apartments'",
        "'speaker_7': '. To explain the increase in gentrification that's.'",
        "'speaker_6': 'Going on here in Alameda.'",
        "'speaker_7': 'There are 33 families living there, 33 families that have been living there for years. It's extremely.'",
        "'speaker_2': 'Difficult.'",
        "'speaker_6': 'To find affordable places to live.'",
        "'speaker_2': 'Nowadays. And now that they finally have a place that they can call home, they're being evicted. Now, as I spoke in these classes, every student gave me the same reaction of disbelief.'",
        "'speaker_7': 'They couldn't believe that this.'",
        "'speaker_2': 'Was going on, especially in their own communities. Some of these students live in these apartments.'",
        "'speaker_6': 'They have friends that live in these apartments and they have family that goes that lives there.'",
        "'speaker_2': 'Now to show.'",
        "'speaker_7': 'How much we support for this.'",
        "'speaker_2': 'To pass. I would like all the national students to stand up to show that we are supporting for this ordinance to pass. We have all gathered.'",
        "'speaker_7': 'Here today because.'",
        "'speaker_2': 'We don't want these families to lose their homes. It's the it's it's the it's it's getting Christmas. You don't want them to lose their homes. This. I just really I don't have any words for really what's going on.'",
        "'speaker_2': 'And we are here to show that we are here with these renters. If if a landlord wants to evict somebody, they better have a justifiable reason they cannot evict them.'",
        "'speaker_6': 'Just so we could let gentrification grow here in Alameda. And it's not just me.'",
        "'speaker_7': 'Every single one of these students that.'",
        "'speaker_2': 'Are standing up. They have family that lives here.'",
        "'speaker_6': 'And who knows, they could be targeted next. And we don't want that to happen.'",
        "'speaker_2': 'So, please, if you can pass this ordinance, you can stand with us and keep these homes.'",
        "'speaker_6': 'Thank you. And I.'",
        "'speaker_0': 'I counted approximately 60. If you have a different number, please let the clerk know before you leave. God. Thank you.'",
        "'speaker_2': 'Also, there are some who cannot make it today, but they're also either out there or spreading the word.'",
        "'speaker_0': 'Thank you very much. Sammy Gutierrez. Jimmy. When. Barney Duncan.'",
        "'speaker_2': 'But. It. Well, I thought you'll have my back. What?'",
        "'speaker_5': 'Okay. Yeah. But everybody goes, okay, I'm gonna start talking because I know we all want to get out here on time. My name's Sammy Gutierrez, and I am a counselor and civic engagement coordinator with Filipino Advocates for Justice.'",
        "'speaker_5': 'And I work with many of these students, and I work with students who live at the Bayview Apartments and. Bang. Okay. These are all the folks who are with us. This is their community. They are the folks who are living here.'",
        "'speaker_5': 'They. They're the families, the children who are living here. They are the friends. This is their community we represent. And so now we represent Bayview. We represent Alameda. We represent. And so now and we also represent by any hand, youth group.'",
        "'speaker_5': 'Bayanihan is a word in Tagalog. That means essentially the the community is going to work together in order to get something done. Here. We are here in order to protect these families and make sure that this ordinance is passed.'",
        "'speaker_2': 'We want you to see how how many folks support them. And we are asking you.'",
        "'speaker_5': 'To join us in that spirit of Bayanihan and pass the ordinance to protect these families. So we thank you for that.'",
        "'speaker_0': 'Jimmy Nguyen. Yes.'",
        "'speaker_8': 'Hi, everybody. My name is Jimmy Nguyen. I am a. My family rents a home here. Now, Amita and I. I just want to tell my own personal experience. I'm in a house with five boys. It's kind of, like, keeps you on your toes, but, I mean, it's.'",
        "'speaker_8': 'Telling them that we will be having to move away from the house that we've been in for all my life. It's is just so heartbreaking, you know? Sorry.'",
        "'speaker_4': 'It's super.'",
        "'speaker_0': 'Even taking a speaker.'",
        "'speaker_8': 'Every night. They tell me, are we going to stay in this house tomorrow? Don't. Just hear them say that. I usually don't cry. This is a little crazy. Just my mom works every single day from 8 to 8.'",
        "'speaker_8': 'I barely see her at home. And knowing that her her working is not enough to keep us here in this beautiful community where everybody here is a friend. We all. We make of this community as being diverse and just.'",
        "'speaker_8': 'Oui, oui, oui, oui. Just give this eccentricity to Alameda and the people there being displaced. We can't find homes anywhere else near here. It's so beautiful here. I've been here all my life, and I just. I don't want to change.'",
        "'speaker_8': 'Neither will it be for my brothers either. Please pass on its thank you.'",
        "'speaker_0': 'Annie Duncan. And then Dwayne Moles and then Michael John Torres.'",
        "'speaker_4': 'Hello, Mayor. Hello.'",
        "'speaker_0': 'City Council. I know.'",
        "'speaker_4': 'Most of.'",
        "'speaker_0': 'You and I've been.'",
        "'speaker_4': 'Up for 70 Central helping them.'",
        "'speaker_9': 'I've got to know many of them.'",
        "'speaker_4': 'It's terrible.'",
        "'speaker_0': 'To find out, especially at Christmas and.'",
        "'speaker_4': 'Thanksgiving.'",
        "'speaker_9': 'That you're getting kicked out of your.'",
        "'speaker_4': 'House. And now Christmas is almost over.'",
        "'speaker_0': 'Where are they going to go? Are we going to have tent cities here in Alameda like they have in Oakland?'",
        "'speaker_9': 'Because right now we have something called the fields and that's where a lot of them are staying. Not the people from 470 Central. The other people that have got evicted. And it's right next to the trailer where you get from the food bank.'",
        "'speaker_9': 'There's a lot of people.'",
        "'speaker_0': 'Living there in tents.'",
        "'speaker_4': 'In this cold.'",
        "'speaker_9': 'Weather with babies, with children. So, Mel, I'm looking to you.'",
        "'speaker_4': 'To make a decision.'",
        "'speaker_9': 'Because you're number one up there. So you've got to let these people know.'",
        "'speaker_2': 'What's going on?'",
        "'speaker_9': 'You have to know you've been a teacher, so you know what these kids are going through.'",
        "'speaker_0': 'Don't let them go.'",
        "'speaker_4': 'Through it any longer. I mean, they're stressed out as it is. Let's get something done about these rent increases. Ask the landlords to pay their own.'",
        "'speaker_9': 'Rent and maybe that'll help.'",
        "'speaker_2': 'Okay. Good evening, Mayor. City Council members. My name is Dwayne Moles. Here specifically to ask you to change the language in the emergency ordinance.'",
        "'speaker_0': 'And that is the Speaker of the House. Yep. Yep.'",
        "'speaker_2': 'People live through remodels all the time. I think. You could ask any number of people in this town. I owned I owned a house at 1905, Craftsman Cottage here in town for the better part of a decade. And, you know, remodel floors and kitchens and bathrooms and all that stuff.'",
        "'speaker_2': 'And, you know, I didn't need to be. I didn't need to affect myself. So what is it we're talking about here? We're talking about efficiency. Versus family stability. That's really what we're talking about, this issue. Can we do it cheaper if we kick everyone out?'",
        "'speaker_2': 'Versus I. We let the families stay. And this city in particular. As values, as values that it expresses through ordinances and through its regulations. We do it all the time where we say efficiency isn't the guidance for everything.'",
        "'speaker_2': 'That same cottage. I was putting in new windows at these really cheap, terrible aluminum side sliders was not period. And you know what? I could replace those with the cheapest possible option there. But now our city says, you know, we value we value our architectural heritage.'",
        "'speaker_2': 'So you know what? You need to actually go back. You need to put something in that's not the cheapest option available, not the most efficient version available, but something that represents this part that we value in our city architectural heritage.'",
        "'speaker_2': 'I agree with that. I'm glad that the city has that. I would argue in this situation, family stability. Stability of all the people you've seen come up here is a value that this community has that outweighs any of these efficiencies that you get when you evict people.'",
        "'speaker_2': 'We're talking about the ability to come in and do a little renovation here and there. We're not talking about you know, there's already stuff for demolition, demolition, health and safety. Those are the other items. So, you know, I would just ask that you give the people that live in the buildings the same kind of protections that we'",
        "'speaker_2': 'give the actual buildings in this town. And I think this is this is this is a value that this town has that applies not just to this little raw. But the ordinances that we're looking forward to next month and continuing in the city.'",
        "'speaker_2': 'Thank you so much for your work so far. Thank you.'",
        "'speaker_0': 'So I have only three more speakers Philips, Michael, John Torres, Eric Strimling, and then John Klein. If there's anyone else that wants to speak on this issue, please turn in your slip. Thank you.'",
        "'speaker_5': 'Honorable Patricia Spencer Mayor, Honorable Frank Matter, U.S. Vice Mayor, Notable Members of the City Council. Michael John Tory, former member of the Board of Housing Commission of the City of Alameda. I know, as you know, some time ago, another group of people came with a situation similar to this back, I guess, 2003, 2004, I think they were'",
        "'speaker_5': 'the harbor and the Tenant Association Group that came because some landlords wanted to remodel their units and they were evicting units, evicting tenants too fast and not giving their notice. Seems to me like the same thing is happening from what I've been reading with the Bayview.'",
        "'speaker_5': 'Apartments that tenants are being rushed out because they want to do some remodeling. And I can't argue with remodeling, but I think that tenants should have been given a fair notice, a warning that that was going to happen so that they would be able to find another place to stay without having all this turmoil.'",
        "'speaker_5': 'And I thought that you, Mr. Vice Mayor, and Tony de Soto had worked out that that issue and came up with a policy that went into the the the charter that would allow for tenants to have a fair amount of time to move out and find another place without being impacted by a landlord so quickly because they'",
        "'speaker_5': 'want to remodel. Thank you.'",
        "'speaker_0': 'Thank you. Eric Strimling and then John Klein.'",
        "'speaker_2': 'Good evening. There's nothing that I can say that it would be anything close to as powerful as these youth coming up and speaking to you. I think that what's at stake here is a stable Alameda community. What's at stake here is the right.'",
        "'speaker_3': 'Of an Alameda to live in their.'",
        "'speaker_2': 'Home securely. How many want to live under a 60 day? You can you can be forced to move. I'd like to point out to you, I strongly support this ordinance. But it only is going to last for another 35 days.'",
        "'speaker_2': 'I ask you, make it permanent. Make the eviction ban a permanent law in Alameda. We can adjust it. You're adjusting it now as you find the faults. You'll adjust them. But how do you ask these kids and not know if they're going to stay in school for the rest of the year?'",
        "'speaker_2': 'Every year of their lives. How do they know, not know if they can go on the Boy Scout camping trip because they may not live in town anymore by the time it actually happens. I didn't live like that.'",
        "'speaker_2': 'When I was a kid, I was thrown out of an apartment because the landlord wanted to remodel. They changed the carpets and painted the walls. That was the remodel. That was in Santa monica. Santa monica passed a very successful rent control model.'",
        "'speaker_2': 'And I'd like you to look at it. I'd like you to really consider making it the law of this city. But please make the eviction ban, at a minimum, the permanent law of the city. Thank you.'",
        "'speaker_0': 'And our last speaker on this item, John Kline.'",
        "'speaker_2': 'Managed John Combs Alma to Renner's coalition. I can't add much. Thank you for having the political will to back up and make this change. It's obvious that it was it's needed and we look forward to doing something similar with in the long term and permanent.'",
        "'speaker_2': 'You've seen all the students. I want everybody else that's here for in support of the change to stand up. Everybody else stand up for all of us. You see all the students over there. But then you have all of these people in support as well.'",
        "'speaker_2': 'So we're going to keep coming back until you get it right. You got it right. You're getting it right. And so. Thank you. Thank you.'",
        "'speaker_0': 'All right. Comments from Council. Nebraska. I'm ready to make a motion, but I will just insert that in the last. Well, since we met before and passed the emergency ordinance, I've had an opportunity to talk to a lot of landlords in this town, especially the smaller property owners, a number of property managers, all of whom were horrified'",
        "'speaker_0': 'by what the new owner of 470 Central did to serve a notice notices of eviction on all the tenants at 470 Central, the very day after we met in a special meeting to consider the emergency moratorium. So and what I heard from them is that they would never have done the sort of thing he did, the timing'",
        "'speaker_0': ', the way it was done. Some of them are already paying relocation assistance to tenants when there is a reason, a legitimate reason that they need to vacate. And so certainly what this experience has done for the council, I think, at least for me, is to help inform us and staff of the kinds of measures we want to'",
        "'speaker_0': 'make sure are incorporated into an ordinance that we come back and vote on in January when this moratorium is up. And and I will say, I also met with the the owner of 470 Central Avenue and, you know, had a discussion about the way I wish things would have happened.'",
        "'speaker_0': 'But this is an opportunity for the council to step in, to add a protection that we now realize is needed. And so with that, I would like to move that. We adopt an urgency ordinance to remove certain specified grounds for just cause evictions by amending.'",
        "'speaker_0': 'Ordinance number three went for, oh, an emergency ordinance of the city of Alameda imposing within the city of Alameda a temporary 65 day moratorium on certain residential rent increases and evictions from all residential units except for just cause evictions.'",
        "'speaker_0': 'And specifically, the two amendments we were making were to remove paragraph ten, which is the evictions for for doing renovations and paragraph five, which has to do with tenants who have not. Executed a new written agreement with the housing provider.'",
        "'speaker_3': 'I'll second that, but would also like to talk in my turn.'",
        "'speaker_0': 'All right. And also, I think Steph suggested that in regards to paragraph five, that we substitute language. And do you want to say what that was?'",
        "'speaker_4': 'So just to to be clear on the motion, you do have and they are on the website as well. You do have proposed ordinances that are red line showing the amended provisions which have some, whereas is and also address in the body of the ordinance itself, the fact that the notices for rehabilitation evictions would be null and'",
        "'speaker_4': 'void if they were issued between November 5th and December one, which is today's date. So that is on the website in there and then on Exhibit A, which is part and parcel of the ordinance. There are two sections within Exhibit A that are just cause evictions.'",
        "'speaker_4': 'One being Section five and one being Section ten. And each of those would be the language that is in there now would be struck.'",
        "'speaker_9': 'And instead, what would appear in.'",
        "'speaker_4': 'The ordinance is that that section was intentionally omitted. And that is what I believe the motion is and seconded.'",
        "'speaker_0': 'It is indeed. Thank you. Councilmember Ashcroft, did you have any other comments? Not at this time.'",
        "'speaker_2': 'Vice Mayor and I just wanted to note that. Our intention in putting the moratorium in place on November 4th. My understanding of these amendments are to emphasize the intent that we had, that during this moratorium period, we would freeze no fault evictions.'",
        "'speaker_2': 'That would provide some sort of protection while we were while staff was putting together ordinance for our consideration on January 5th as is that meet the Skull City attorney.'",
        "'speaker_0': 'That is correct.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'A number. You.'",
        "'speaker_3': 'Thank you, Madam Mayor. I think the one speaker I think put it best that this represents our values. I can't remember which speaker it was, but for me the value is and this should be the underlying premise of anything we do here to protect tenants is that.'",
        "'speaker_3': 'Everyone has a right to stay in their home. I mean, that should be the number one value. That should be the number one goal of any protection. Now, I understand that there's sometimes when that's not always possible. But if you pay your rent, if you're not a nuisance, if you're not committing criminal activity, you basically should be'",
        "'speaker_3': 'able to stay in your home. I mean that to me and as staff is drafting our new ordinances. To me, that should be the underlying premise behind all of those ordinances. So that was our intent earlier this month when we met.'",
        "'speaker_3': 'I mean, our intent was has the vice mayor said to put a freeze on these unjust evictions and give staff a time to draft an ordinance that we could all have some consensus on? You know. Without talking too much about what happened in the last not this close session, but the last one.'",
        "'speaker_3': 'I've never seen this council so united as we were in that meeting, so I think bravo to our council for being united. And when I look at this, I'm hoping that staff comes back with a comprehensive set of tenant protections and not a menu where we can pick and choose.'",
        "'speaker_3': 'Because if you do that, then it's like the Jenga game, you know, you pull one out. I don't like some things. Another council member doesn't like something, and then before you know it, you pull enough things out, it collapses and we don't end up with reasonable tenant protection.'",
        "'speaker_3': 'So I'm hoping to see that when it comes back. And again, you know, if we focus on making sure that we keep people in their homes, you know, we passed this ordinance. The vice mayor said it was our intent to do freeze the status quo, to make sure that we could protect tenants.'",
        "'speaker_3': 'And I'd like to see that we protect tenants above and beyond Christmastime and above and beyond this moratorium, because this is not something that's going to go away. And on January 11th, when the moratorium expires and and the reason I do that is I don't particularly care for this term, but now it's it's being used housing provider'",
        "'speaker_3': '. But the critical part of housing provider is your housing provider. And housing to me is one of the most critical needs now on food, shelter, clothing. And that's where we have to come down. When we come down on a policy, in my mind, on the side of the tenants, on the side of protecting people's right to live'",
        "'speaker_3': 'in quiet enjoyment in their home, it doesn't matter whether their home is technically owned by somebody else or it's owned by them, they should have the right to quiet enjoyment and be able to not worry not only at Christmas time, but all year round that they're not going to be evicted.'",
        "'speaker_3': 'So as we go forward, you know, we've we've listened and we've, you know, we've had reasonable landlords come up here and say, let us police ourselves. And I think that has worked with other reasonable landlords. But despite letting them police themselves, we've had double digit ten, 20, 25% increases and we've had these mass unjust evictions.'",
        "'speaker_3': 'And then we've been we've been asked to, well, let's just try enhanced mediation. Well, in my mind, you know, mediation is you get in a room and you figure out how much you're going to pay so I can leave my building or leave my unit.'",
        "'speaker_3': 'And to me, that does not meet my fundamental goal, which is to keep as many people in their houses as possible. So I hope as we go forward and we find ways to structure our ordinance, you know, whether it it it provides temporary relocation and requires that tenants are allowed to come back in their homes because basically'",
        "'speaker_3': 'these are their homes. I'd like to make sure that we we protect that right of tenants to be able to stay in their homes, even if they do have some type of renovations. Because, you know, face it, folks, we have we don't have any rental units that are under or under 40 years old here in town.'",
        "'speaker_3': 'So some of them will require some type of renovation. But let's find a way to do that in a way where we don't kick people out.'",
        "'speaker_0': 'I'm ready.'",
        "'speaker_6': 'Well, thank you very much. Thank you very much to all the youth who had come out this evening. I know this is a busy time and like many of you, you want to be with your families in your homes.'",
        "'speaker_6': 'But let us make sure to say that when the property owners serve the eviction notices to the 33 families, they not only punched their families in the gut, but they punished all of Alameda as well. And rest assured that in city hall you have a force that has awakening that will fight on behalf of the residents here'",
        "'speaker_6': 'to do whatever we can to make sure that the residents at 470 stay there. What that means in the long term is that we have to do new types of legislation and talent that has never been in place, such as just cause evictions.'",
        "'speaker_6': 'We have to look. We have to implement a just cause eviction in the city of Alameda. It has to be done in the immediate term. We have to modify the ordinance along the lines that we're talking about. So stay tuned.'",
        "'speaker_6': 'The fight is just beginning, and it's not just about a470. It's not just about this or that apartment. It's about the character of all of Alameda, not just the west end of town, as socio economically diverse as it is, but it's also all all of Alameda is at risk.'",
        "'speaker_6': 'And so we need to do new things that we have not done before. We need to look at a strengthened just cause of action so that you can only get evicted if you're if you haven't paid your rent, if you've done some kind of crime and then some kind of damages.'",
        "'speaker_6': 'We also have to look at strengthening the rent review advisory committee process on the table. For some on the table for some is rent control. You know, there are different models to help protect the residents. But for some, that that is on the table.'",
        "'speaker_6': 'Everything is on the table now because the force has awakened. We as your five representatives of our city council, we are doing our best to represent the city because we know that the city is behind us in being behind you.'",
        "'speaker_0': 'Thank you. I want to thank staff for bringing this back at this time. I think it was critical that it be returned to us. I think what you're hearing is that council is united behind this. This is a serious problem.'",
        "'speaker_0': 'From my perspective, I think we all got together and we had a meeting where we had a huge turnout of people that want to speak on November 4th. We were here until 130 in the morning and we made a decision.'",
        "'speaker_0': 'And then the next day we hear from tenants that have received eviction notices. That was a problem. It was disappointing to me. We have many landlords in our town who are excellent landlords, who really do care about our community, who are part of the fabric of our community.'",
        "'speaker_0': 'There are many that do not raise rents or have reasonable rent increases. Many with long term tenants. At this point, we have a few that I call outliers that don't really seem to get the message. Which is why we're back today.'",
        "'speaker_0': 'To clarify the message to me, the intent. My intent was that we really would give everyone what I call time to breathe. We have all known people that have been receiving these notices, sometimes rent increases that they can't afford that make it so that they cannot continue to reside here in town.'",
        "'speaker_0': 'We also know many that have received these notices, 60 day notices to vacate. We know families. We have students that are being forced to find new homes outside of the community. Many and and I appreciate having so many students from Encino here today.'",
        "'speaker_0': 'I think it's very important that students be part of the government process. It's absolutely important that we hear your voice as you are impacted by these decision. So thank you for coming out tonight. Moving forward, I continue to hope that we will be able to work together as a community and that these outliers will get the message'",
        "'speaker_0': '. I really want to thank all our meetings for working with all of the landlords and trying to share with them. But we think is important what I'm going to call the Alameda Way. So thank you for coming out.'",
        "'speaker_0': 'Thank you for continuing your work, your public work, as well as the work that's happening behind the scenes to reign in what I'm going to call reining in these these outlier landlords, of which the majority of our landlords are not.'",
        "'speaker_0': 'Yes. Member Ashcraft thank and I did just want to add while you were speaking Madumere, it occurs to me that you and I and I think Councilmember Desai just said that everything is on the table. And I do think that this council has some serious challenges before it going forward, not just with crafting the right ordinance that'",
        "'speaker_0': 'gives protection to our renters and also takes into account the needs of landlords. Because as was also noted, we have aging housing stock in this in this community, and there are legitimate needs to to renovate it. But there are better ways of going about it than the examples that we saw the day after a special meeting.'",
        "'speaker_0': 'But I think something this council is going to have to grapple with is it is supply and demand. And when we have the opportunity to add to our housing stock and especially some multifamily of which has been noted, we have it built with a few exceptions for more than 40 years.'",
        "'speaker_0': 'We've got to look at doing that and finding out the best way to do it, address traffic at the same time. But we we can't you know, there have to be a lot of tools in our toolkit going forward that we know what we have to do between now and January.'",
        "'speaker_0': 'And I also want to commend our staff. We have thrown a lot at them in the last couple of weeks, months, and they've got even more to do. But they're doing a great job for all of us and all of you.'",
        "'speaker_0': 'So thank you, staff. Thank you, Mayor. Thank you. I don't believe I use the term. Everything is on the table. That was Councilmember Davis. All right. Thank you for clarifying that. And with that being said, no other comments by council.'",
        "'speaker_0': 'I'll call the question. All those in favor. I oppose abstentions. Motion carries unanimously. And I'm going to call for a short recess. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Then. Thank you very much.'",
        "'speaker_4': 'If you can take your seats.'",
        "'speaker_0': 'And we have item six. See?'"
    ],
    "Public Hearing to Consider Adoption of Resolution Upholding the Planning Board Decision to Approve Design Review and Use Permit Application PLN15-0198 for the Construction of a Five-Building Mixed Use Development Constructed with Shipping Containers with Ground Floor Offices and Outdoor Seating at 1926 Park Street. (Community Development 481005)": [
        "'speaker_1': 'You get there eventually. Public hearing to consider adoption of a resolution upholding the Planning Board decision to approve design, review and use permit application. PLN 15 0198 for the construction of a five building mixed use development constructed of the shipping containers with ground floor offices and outdoor seating at 1926 Park Street.'",
        "'speaker_2': 'And you were on.'",
        "'speaker_4': 'Oh.'",
        "'speaker_1': 'And for you. Oh, that wasn't the first time. Not very good. There we go. You got it. All right.'",
        "'speaker_7': 'Good evening, Mayor Spencer. Members of the council. My name is Andrew Thomas. I'm your assistant community director, and I'm here to present the project on behalf of the planning board, the city staff, and also the applicant. You will not be getting a second.'",
        "'speaker_7': 'Presentation from the project architect. I'm going to go through a few slides showing the design that's before you tonight. And then the applicant, the property owner and sponsor of the project has put in a speaker card and would like to speak if he can after briefly after I speak, and then you can go right into your public'",
        "'speaker_7': 'hearing. I re sure you have some speakers for tonight's hearing that the the item before you tonight is what we call a city council call for review of a planning board decision to approve a project. The project is located at 1926 Park Street.'",
        "'speaker_7': 'You can see the site on the left there. Its right as you enter the city. The planning board approved two permits, a use permit and a design review permit for this project. The project's been in review. That basically took about a year from the time it originally came in, was submitted to the city, worked with city staff'",
        "'speaker_7': 'quite a bit on the design and the layout of the project. And then it went to the planning board over the course of three meetings before the planning board, which they continued to refine the design. I think tonight's hearing is really about the design review permit.'",
        "'speaker_7': 'This is a very small site. It's a very small project. The the use permit piece of it, it permits some small incubator office space for startup companies, a small ground floor cafe right on Park Street with an outdoor seating area and a single residential unit upstairs.'",
        "'speaker_7': 'So classic mixed use site. Exactly. Excuse me. Mixed use project. Exactly. With the kind of mixed use projects that we're trying to encourage and make happen on Park Street. So there's nobody has ever raised any concern about the uses proposed or the configuration of the uses for the project.'",
        "'speaker_7': 'The debate has always been about the design review piece. It's the design of the buildings that are proposed. There's really an issue for you today. And I think the other key thing we will you'll talk a lot about tonight and hear from people on both sides of this issue is it's a very, very small project, but it's'",
        "'speaker_7': 'at a very, very important location. It's right at our one of our major gateways coming across the Park Street Bridge. So anybody who drives across the Park Street Bridge on a daily basis is going to see this project.'",
        "'speaker_7': 'Every time they cross the bridge. And they are. And when their friends come from Iowa to visit, this is going to be one of the first buildings they see as they cross the bridge. So gateway design, I think, is really sort of the focus of the debate, and it has been the focus of the debate the entire'",
        "'speaker_7': 'time that this project has been in city hall and being worked through for the last year. So it's not a new question. It's just this is the final step in this process. If you approve this project tonight, it can move forward and get building permits.'",
        "'speaker_7': 'If you deny it tonight, then the project does not move forward. So just talk about design review for a minute.'",
        "'speaker_0': 'Can you expand on that? Yes, it does. Come back and try again. What happens?'",
        "'speaker_7': 'Well, if you deny the project, I think and what my big point to you tonight is, if you really this is about the design of this project and if you deny it, I think you should be clear and say we are denying it, not because of the users.'",
        "'speaker_7': 'We like the users. We're denying it because we don't like the materials and the building design that you've proposed so that then the property owner knows if he's going to try again, he knows what to do. And this is a really good transition to the three findings.'",
        "'speaker_7': 'And I wanted to just talk a minute about this to approve design review. The city needs to make three findings and you have to make all three. So the planning staff made all three findings when recommending to the planning board.'",
        "'speaker_7': 'The planning board made all three findings. And if any individual one of the five can't make any one of the findings, well, then you can't really vote yes. So you really have to be comfortable with all three. Number one, the project's consistent with the general plan, the zoning and the design review manual.'",
        "'speaker_7': 'Staff determined that it was planning board determined it was a couple of quick notes. There's been a lot of email traffic just in the last two days between me, city staff and Alameda Architectural Preservation Society. You've probably been keyed on a number of those things.'",
        "'speaker_7': 'Two quick points. Number one, zoning. There's an interpretation about whether the porch on the front, which is the outdoor seating cafe, whether that should be treated as a setback or whether that's a zero. Property line city staff interprets the code and the planning board agreed that that meets the code.'",
        "'speaker_7': 'I would not if I were. You deny this project because you both agree with the APS decision that you think their interpretation of the zoning code is better. And the reason I say that is because the application fix that in in 5 minutes, they just move the building five feet and then that whole issue goes away.'",
        "'speaker_7': 'So if you don't like the design, then just say, I don't like the design. Because the zoning issue in that interpretation I think is a little bit of a distraction and can be so easily changed if that is the concern.'",
        "'speaker_7': 'So I think that's not really something that we should spend a lot of time and energy on. The next issue that's been and a lot of confusion about, well, what about the design review manual? What about the guidelines for design?'",
        "'speaker_7': 'Is it consistent with the guidelines or design and alignment? Architectural Preservation Society has been raising a number of issues about that, and part of the confusion this late in the game has been that they were looking at a draft version, not the final version, and that we contributed to that confusion because we had both versions posted on'",
        "'speaker_7': 'our city website, which was our fault, and we have since corrected that. But page one of both versions says these are guidelines. If we could write a recipe book for excellent architecture, then we wouldn't need architects. Any one of us could just design the building following the recipe book.'",
        "'speaker_7': 'There are guidelines and page one says, Look, these are guidelines. If you see a design you like and it doesn't meet one of the guidelines, you can still approve it if you like the design. And that's ultimately what we're trying to achieve here.'",
        "'speaker_7': 'Good design. And we can't cover every single scenario. Every single design. Good architects do good, good design. These are guidelines to help you evaluate. So what I think it really comes down to is the next two findings. And this is really where I think we need to stay focused.'",
        "'speaker_0': 'Scuse me, member.'",
        "'speaker_3': 'I had a question. We can go back. Yes. So we had an outdated version on our website.'",
        "'speaker_7': 'We had both versions posted the.'",
        "'speaker_3': 'Okay. So can you staff go back and do an audit and make sure that the things we have posted on our website are the most up to date? Just just so we can be sure, because not only do we rely on them, I mean developer potential developers rely on them and it would be appreciated.'",
        "'speaker_7': 'I totally can't agree more wholeheartedly. The outdated version has been removed, so that's gone. Now there's other things on the website. I, I just check.'",
        "'speaker_3': 'Sure. That every if yes. I know we're giving you a lot of work.'",
        "'speaker_7': 'No, no, no, no.'",
        "'speaker_3': 'But let's just make sure that totally we do we do an audit and a review, and we make sure that everything is up to date. Please. Thank you.'",
        "'speaker_7': 'So the next two findings, I think, are what we really are all going to need to focus on. And I think the speakers behind me should focus on these two things. The two findings, as articulated in the zoning code are is the project design appropriate for the site and compatible with its surroundings?'",
        "'speaker_7': 'If you think it is, then you can make the finding. If you don't think it is, then you can't make the finding. And then the third and final one is the proposed design of the structure and the exterior materials, which is particularly appropriate with this and relevant to this proposal.'",
        "'speaker_7': 'Are they visually compatible with the surrounding development? So those last two, they're very subjective and this is what makes design review both very hard, but also very easy. This is a subjective discretionary set of findings. As those of you who served on the planning board, I know some of you have you know that this is design review'",
        "'speaker_7': '. There's there's no strict rules here. You kind of have to go with your gut. You have to listen to what you hear from the architects and the and the public, and then you need to make your decision. Last thing, I put a picture here of Jackson Pollock.'",
        "'speaker_7': 'I bet any ten of us could anybody in this room, the ten of us could go to a museum and we would see some some art that we all agree is beautiful we'd love to have in our living room.'",
        "'speaker_7': 'And I guarantee you there would be some paintings where some of us would say, Oh, I love that. And others would say, You know what? No, thank you. I do not want that painting in my living room. So look, at the end of the day, I think this some of us think this design is is really a'",
        "'speaker_7': 'wonderful gateway design for the city. And some of us don't. And it just comes down, I think, to that simply. I think we just all need to respect each other's opinions. And at the end of the day, as our five elected officials, you get to make the final decision.'",
        "'speaker_7': 'If three of you think it's a cool design, it passes. If three of you don't, it doesn't. But you know what? We will all either way, we will all move on and and keep making this a, you know, maintaining this fantastic community and keep working to make it better.'",
        "'speaker_7': 'Okay. So what I'm going to do is spend six slides, try to explain to you why city staff and the planning board thought this was a cool design. Where do we start? We started with Gateway. It's right at the entrance of the city.'",
        "'speaker_7': 'So where did we start up? We started at where our general plan was a general plan. So it says Alamitos entrances should create a sense of civic pride. Okay, that's not that helpful. But all right. That's it's good to know the zoning code for this area, one of its primary purposes.'",
        "'speaker_7': 'It's a support almeida's unique character and encourage innovative design that supports an attractive pedestrian district. Okay, that's good. And then you look at the actual gateway. This is coming right across the Park Street Bridge into Alameda. We don't think it meets any of those criteria.'",
        "'speaker_7': 'We need to do something and we need to do something to really improve this gateway. And the site you can see is just on the left there with the brick wall at the Salvation Army. It's a it's a used car lot today, and it has been for years.'",
        "'speaker_7': 'So we started there. So what is civic pride? What do we mean? What do we do? What's the message we're trying to send with this building? We start thinking about what is the message for us? And yes, Alameda is about history, Park Street history, the history of Alameda history, architectural excellence.'",
        "'speaker_7': 'Absolutely history. But Alameda is also about innovation. We have great new companies coming to Alameda. This is the pur force building. And what they do there represents in sort of in our mind, you know, some of the great cool new businesses and innovation that occurs here in Alameda.'",
        "'speaker_7': 'And then, you know, creativity is also something that as you go around the city and you get to know people in this community and hear what they're doing, this is the Little House Cafe with the wonderful shoes that the building fell on the palace or whatever.'",
        "'speaker_7': 'I just love that.'",
        "'speaker_0': 'It's the.'",
        "'speaker_7': 'Oak.'",
        "'speaker_0': 'I think it's the wit.'",
        "'speaker_7': 'Yeah, the which. Excuse me.'",
        "'speaker_0': 'Not on that which got given stories.'",
        "'speaker_2': 'Sorry I didn't get it.'",
        "'speaker_7': 'Fell on somebody. You're right. The which the which is dead, you know, creativity. It's like that is one of the things that makes Alameda just a great community. I'm not an Alameda resident. I've just worked here for 12 years.'",
        "'speaker_7': 'And these are the things I think about when I think about Alameda. And I think it's things that Alameda should be embracing. And part of the message, yeah, our logo is yes.'",
        "'speaker_0': 'So just because we need a little levity tonight, so this this picture isn't absolutely current because if you've been to Little House recently, you know, she's wearing ice skates on her feet because of the little of little rain.'",
        "'speaker_0': 'Yes. That appetizer that is also sponsored by perforce, of course.'",
        "'speaker_7': 'Yes. So, you know, so, you know. Yes. Our logo is is home of the city of beaches and homes. Well, that didn't seem to be the right message. Beaches and homes. How do you do that? In a new commercial building on Park Street.'",
        "'speaker_7': 'So we were thinking about these kinds of concepts with this design. And when Marcel and his team came in with their design, we were like, Wow, that's really interesting. Innovation, creativity in design. So but one of the findings like so Marcel comes in with this design.'",
        "'speaker_7': 'This is the final approved version, metal glass using shipping containers as a recycled material to build a new building. Let's not cut down trees. Let's use recycled materials. Let's do something sort of innovative and creative and was like, Well, yeah, that's kind of out there.'",
        "'speaker_7': 'That's we haven't seen something like that in Alameda, but it's kind of cool. But I'm not sure we started thinking about it. I'm like, All right, surrounding how do we make the findings? We have to make those findings.'",
        "'speaker_7': 'Compatibility with surrounding structures, you know. Well, what's the most iconic, most important structure right there? It's not the used car lot across the street, and it's certainly not that park landing sign that goes up. It's this.'",
        "'speaker_2': 'Bridge.'",
        "'speaker_4': 'This bridge is.'",
        "'speaker_7': 'Literally 25 feet, 30 feet across the street. This bridge is become sort of an Alameda icon. You see it on people's T-shirts, you see it on postcards. This when people see the shape of that bridge, they think Alameda and it's also this cool metal structure with these, you know, the green color and this the shapes and the'",
        "'speaker_7': 'shadows. I mean, for those of you who haven't, I'm sure everybody here has done it. But walk across it another time. I mean, it's just a really cool structure and it's become an icon for Alameda and it is the most important structure next to this site in our view.'",
        "'speaker_7': 'So the idea of the green metal and the metal and glass modern design for us, it clicked with the with the Park Street Bridge because there ain't a lot else to click with right there. Vertical mixed use. That's what we do in Alameda.'",
        "'speaker_7': 'That's what everything we are trying to do. Our Park Street district is all about that we want a few housing units above ground floor retail. Marcel and his team came in with sort of a modern interpretation of that using those those metal and glass materials, the ground floor cafe with the with the outdoor seating, with the residential'",
        "'speaker_7': 'unit above that, the roof deck for the residential unit. On top of that, it just struck us as yeah, that's, that's interesting. That is a very interesting way of interpreting kind of what we are looking for on Park Street here in Alameda.'",
        "'speaker_7': 'The yard is in San Francisco. You know, it's obviously the use of shipping containers as a building material is something that more and more cities and it's just becoming more and more prevalent. Have we done it here in Alameda?'",
        "'speaker_7': 'No, we have not. Is this the first time in Alameda? Yes. Is this pushing the envelope for Alameda? Absolutely. I think the end of the day, this comes down to are we ready to push the envelope or not?'",
        "'speaker_7': 'Maybe this is going too fast, too far, too quickly. But we think that Alameda can do it. The other thing, just quick note. Yeah, these are it's recycled shipping containers. It's recycled materials, building materials, but it meets all the building codes, all the health and safety codes of any building.'",
        "'speaker_7': 'It meets the same requirements. If you go and cut down a bunch of trees and build it out of wood, it's the same set of health and safety codes, building codes. You know, these some of the letters about oh my God, the toxic waste that we have to worry about if we use shipping containers.'",
        "'speaker_7': 'Yeah, you know, interesting issue. And it's covered. There's a whole industry that is being built up around the how to reuse, clean, modify shipping containers as a building material. Um, the corner tower, you know. This is, as you can see, the Park Street.'",
        "'speaker_7': 'We have a long history of corner towers. We are a CIT Park Street as a community and an urban place with with buildings on right on the property line. Corner towers demarcating the edge of corners. You know, around the turn of the Century Park Street was quite a cool looking place.'",
        "'speaker_7': 'We've been doing it with our new buildings. We do have sort of a you know, I think the Walgreens building came out very nicely from a massing perspective. The the the the scale of the tower, really well done.'",
        "'speaker_7': 'We got it rolled up. But, you know, it is trying to look like an old building. This one is not this one is saying, no, I was built in 2015. I was not pretending that I was built in 1890.'",
        "'speaker_7': 'This is a building that is clearly a modern building with a modern style and not pretending to try to be something else. We we found that very intriguing. And and once again, playing to that issue of, you know, Alameda what's Alameda about?'",
        "'speaker_7': 'It's not just about history and redoing old things. It's also about innovating and being creative. And we thought that was a very creative way of handling the corner element.'",
        "'speaker_0': 'Before you continue, is this presentation online? Has it?'",
        "'speaker_4': 'Where is it?'",
        "'speaker_1': 'It got added up just right before the meeting.'",
        "'speaker_7': 'I apologize.'",
        "'speaker_4': 'I was.'",
        "'speaker_0': 'Late. Retrieve it again and try to see if it pops up this time.'",
        "'speaker_2': 'Okay.'",
        "'speaker_7': 'Last thing. I'm almost. I'm coming down the homestretch here, and then everybody behind me can tell me where I'm wrong. We were intrigued by the night time, you know, coming across the park bridge at night. What's it going to look like at night?'",
        "'speaker_7': 'You know, the success of a commercial street. We've got some cool you know, the McGee's and the way they light up their little turret with the red lights obviously the army the theater is spectacular at night. The this slide on the right is not trying to depict nighttime.'",
        "'speaker_7': 'But if you can see the big composition of square glass windows, imagine nighttime. Imagine just the windows lit up because the people are inside. It's 5:00. They're just the office users. Users on the left are still there. The residential users who are in the top two units or it's one unit but two stacked windows, those lights are'",
        "'speaker_7': 'on. It becomes a composition of large square glass things, elements. We've also working with Marcel and his architectural team about how do you light the outside of the building? We think it could be and will be, if approved, a very attractive building at night, as is the Alameda Theater with its lighting.'",
        "'speaker_7': 'All right. So, planning board. Decided that it met these three findings. Staff is recommending that you uphold the Planning Board's decision. We think it is an exciting project for this location. We but we also acknowledge we know it's pushing the envelope.'",
        "'speaker_7': 'We know there are a number of people in this community who who are not comfortable with this design. People have been coming up to me all day just recently, like, oh, yeah, nobody liked this building or that building when it was first built.'",
        "'speaker_7': 'But now it's, you know, landmarked in different places in Spain and elsewhere. But, you know, is this going to be a landmark in 50 years? I don't know. But at the end of the day, I think it really comes down to you, the five of you, after hearing from the people behind me, after just looking at it'",
        "'speaker_7': 'yourselves, looking at the material. If you if you like the design and you think it's compatible with the surrounding and appropriate for its gateway location, then I think you vote yes if you're uncomfortable with this design, if you don't like the design, if you just feel like it's not working for you, then you don't vote for it'",
        "'speaker_7': '. It's really that simple. So with that, I am. Finished. And I. If it's okay with the mayor, I think Marcel would like to just take a couple of minutes. Yes, introduce.'",
        "'speaker_0': 'Me. There he is. A clarifying question I remember asking. So, Mr. Thomas, thank you for the presentation and for the slides. So if this project were to be approved and in looking through the plans, it has a lot of elements of glass and wood siding, but there are different qualities of glass and windows.'",
        "'speaker_0': 'And we've had some issues with windows in renovated buildings before when I was on the planning board. What kinds of safeguards are built into approval, if at all, to make sure that we are getting the highest materials? Yes.'",
        "'speaker_7': 'I think quality the staff has the ability to review all of that at the at the building permit level, the planning board in its final approval. And this condition is in the draft resolution that we are recommending that you approve as a condition of approval, that there was two things that they were they were very concerned about'",
        "'speaker_7': 'and felt the same way. It has to be done and it has to be just right. And what there's a commissioner. Colors and materials. Final selection has to come back to them for final approval. Of course, that's also a call for review.'",
        "'speaker_7': 'Viewable, if you'd like. So that was wood panels that were too. Sort of the wood panels, the green and the blue colors. They were like, look, we need to see the final actual samples and it needs to be just right.'",
        "'speaker_7': 'So they wanted that final review. I think they did not talk about the windows in particular on that condition of approval. But I would agree with you, there are very important we will handle that at staff. And that's something that through the review of this, your thinking also should be something that you would like to see a'",
        "'speaker_7': 'lot more detail on before the city gives a final stamp of approval than what I think you would do is you would simply mend that condition to include Windows as well to come back for final detail approval by the planning board.'",
        "'speaker_7': 'And, you know, like once again, if if people are still uncomfortable with those details, that could also be called for review to the council. Obviously, color and the materials, you know, are you know, it's critical to the success of this project and we acknowledge that.'",
        "'speaker_0': 'Madumere everyday.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_6': 'Thank you, Mr. Thomas. I appreciate your assistance in all this, as well as the assistance of the city staff. I have very specific questions right now. I think the one question that I want to make sure to raise is that in the design review manual that is on the city's website, in the very last section, it's broken'",
        "'speaker_6': 'up into three categories part one, part two, part three. In the very last section, on page 103, there is something called the Northpark Street Waterfront. Streets. North North Park Street waterfronts.'",
        "'speaker_7': 'Yes.'",
        "'speaker_6': 'Though. But. But we so we know for sure that there's an area called the North Waterfront North Park Street, Waterfront Street. Right. And. We know that there's a map that's associated with it. Actually, it's page one, two, one.'",
        "'speaker_6': 'There's the North Park Street waterfront. Correct. So there's an area called the North Park Street waterfront. It's not necessarily a zoning designation. In fact, within that area, there are probably two types of zoning designations. It's just an area.'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_6': 'So. And that's I think that's an important point, just to remind ourselves, because on the very much contested page 82 of the design review manual, page 82 in the. Manual that's online. Age 82 on the manual that's online says.'",
        "'speaker_6': 'Make sure I'm at one. One key part of it says that. Alameda does not know, does not currently have many examples of modern buildings. However, applicants may consider modern architecture as an appropriate style for in-fill opportunities. Waterfront districts in particular, including areas such as Alameda Point, the Park Street waterfront and adjacent in areas adjacent to the estuary'",
        "'speaker_2': '. May.'",
        "'speaker_6': 'Provide an appropriate setting for modern design. So the two key things that come out of that is that, one, it references the Park Street waterfront district. So therefore it is referencing the district that's on the last part of the page of the design manual starting on page 101.'",
        "'speaker_6': 'The second thing to take out of that, which is on the on the website right now, is that it says that it that these areas may provide an appropriate setting. So it doesn't say it could be something.'",
        "'speaker_4': 'It doesn't have to be, but they might.'",
        "'speaker_6': 'It might not. So.'",
        "'speaker_7': 'Right. Right.'",
        "'speaker_6': 'And that's an important issue to raise, because from my vantage point, we as a city council, we voted in March of April of 2013. We voted on a document called the City Design Manual calling North Park Street District.'",
        "'speaker_6': 'And that's what we voted on. And as part of the discussion, it's all there in the whatever was decided on for that particular manual, it was to be inserted into the citywide manual. So so that's the key thing, though, is that the language of what's in the March 2013 document says something else.'",
        "'speaker_6': 'What it says is that the waterfront district in particular, which currently has an existing stock of industrial buildings, comma, provides an appropriate setting or modern design. So it says it provides an appropriate setting for modern design. It's the waterfront district.'",
        "'speaker_6': 'Again, it's referencing that same place north. It's the planning avenue north towards the water. That's the waterfront district. So I'm just. Yeah, we've shared emails, you know, where I'm coming from.'",
        "'speaker_7': 'Totally understand. And I think just for the benefit. I mean, I, there's, there was never the intent of this, of the design man, say, and in no other areas is modern design permitted in the city of Alameda. I mean, that would have been a very strong statement to make if that was the intent.'",
        "'speaker_7': 'We didn't say that in this manual. But at the end of the day, I think, look, if you don't like the modern design on this site and you're right, it's for if you look go to the next page, there is a district which is right on the waterfront that's outlined and it can reference that and it's OC'",
        "'speaker_7': 'and that's that's a good point.'",
        "'speaker_6': 'But the issue really isn't from my vantage point. The issue perhaps isn't one about design, but it's really one about process. For example, if one believes that what was in the North or the North Park Street Design Manual of 20th March 2013, if one believes that that's the correct language, and then the intent is clear, that there's'",
        "'speaker_6': 'a clear delineation of appropriate types of buildings north of Blanding Street and those that are appropriate for south of Blanding and and for the type of buildings south of Blanding, it would be one of the nine items that are listed in the building style.'",
        "'speaker_6': 'And if that's the case, then it does become a process issue in that the zoning says or the gateway, the zoning says that that you have if you're going to do something other than the things that are in the nine items.'",
        "'speaker_6': 'Then you have to get a variance. That's what the zoning says.'",
        "'speaker_7': 'No, it doesn't. There's nothing in the zoning that says that nowhere else in the city can you do modern architecture. We do not have a zoning provision that says if you're not on the one block along the water, then you cannot do modern architecture.'",
        "'speaker_7': 'We would never recommend that as in your design. And it certainly wasn't our intent to say.'",
        "'speaker_6': 'If you want to do modern architecture south. Of Blanding Avenue.'",
        "'speaker_7': 'South of Blanding Avenues, and you need a variance from the zoning ordinance.'",
        "'speaker_6': 'You need a well.'",
        "'speaker_7': 'Let's not argue about it.'",
        "'speaker_0': 'It's not before us today.'",
        "'speaker_2': 'All right.'",
        "'speaker_4': 'Well, we'll get to it.'",
        "'speaker_7': 'We'll go. It just. That would be a very serious statement that we should then have probably have hearings about, because what you would basically be saying is you cannot do modern architecture in Alameda. If unless it's south. Lessons north of Blanding.'",
        "'speaker_7': 'I mean is that.'",
        "'speaker_6': 'Well well in the Gateway District you can do the architecture that's related to the on the style of the Gateway District, which is nine things. And if you want to do other than the nine things, then you have to get a variance for it.'",
        "'speaker_0': 'It's a possible to have staff look for those documents while we're having this discussion, and then it can be brought up on the screen.'",
        "'speaker_7': 'But he's saying it's in the zoning. Zoning.'",
        "'speaker_0': 'I mean, come back.'",
        "'speaker_7': 'We'll come back. Let's come back to it. I mean, I don't take up too much of your time here.'",
        "'speaker_0': 'So many other clarifying questions at this point.'",
        "'speaker_6': 'So no.'",
        "'speaker_0': 'All right. Then we're going to proceed with the The Developers Project.'",
        "'speaker_2': 'Thank you. I appreciate it. Members of the council. Mayor, good evening. I want to first thank Andrew again for being very detailed in his in his specifications of the property of the actual project itself and explaining all the technical aspects.'",
        "'speaker_0': 'If you get closer to.'",
        "'speaker_2': 'Yourself, I'm sorry, Marcel saying I'm the owner of the property, excuse me for myself personally, I'd rather. I think Andrew did a great job of explaining all of the design aspects, technical aspects, and answering questions about zoning. Personally, just to introduce myself, I would like the board I'm sorry, the members of the Council as well as the'",
        "'speaker_2': 'public to know that I am a local businessman. I'm not an outside developer. I do have a passion for this project. I'm pretty much married to Park Street. I have a vested interest in producing the best version of this actual design.'",
        "'speaker_2': 'I believe member Ashcroft had a question about quality of window treatments and other treatments on the actual building itself. It's personally in my nature to do nothing but build quality, especially if I'm actually going to be occupying the space myself to be living in and working in.'",
        "'speaker_2': 'And it's just always been my style to actually own and utilize the best controls that I can, only because of the fact that I'd like it to look the best, not because it's an investment for myself, but also because I'm going to be utilizing it myself as well.'",
        "'speaker_2': 'As far as the. The use of the space is concerned. I sort of see this as as a space for smaller tech companies that can utilize small incubator spaces on something like this to where you see actual small structures that are spread out between a courtyard where you'll have plenty of people that either work in the actual'",
        "'speaker_2': 'space itself or just walking through, getting a cup of coffee can. Have a seat, relax, walk through. This is almost the embodiment of what the design manual asks for. This is very pedestrian friendly. Everything from seating, greenery, the ability to walk through the space from either blanding or park streets.'",
        "'speaker_2': 'As far as the tenants are concerned, I think it's something that Alameda really it needs as far as smaller spaces such as this to sort of incubate smaller tech companies, to give them a space to start and grow on something like this that.'",
        "'speaker_2': 'I do understand that some folks do have some concerns. I do share some of those concerns. The only argument I have against that really is that on something like this, just the fact that I am local and will be utilizing the space myself.'",
        "'speaker_2': 'Should sort of alleviate some of those concerns and sort of explain the fact that I will be making the best version of this actual structure to begin with. It is, as I stated earlier, that, you know, Andrew did a great job of explaining all the technical aspects.'",
        "'speaker_2': 'In two years, almost two years to the day where we came up with the idea and then go through the process with a city staff has been very supportive through the process with the planning board, has been very supportive and approved it.'",
        "'speaker_2': 'And I believe the experts have actually done a great job in actually going through all that minor details as well as the general idea. So in something like this, it really comes down to, as Andrew also explained, it's a matter of taste, really.'",
        "'speaker_2': 'Some people would like a certain color, some don't. Some people like certain paintings and others don't. I also actually want to make a small statement about some of my supporters who were here earlier that did have to leave.'",
        "'speaker_2': 'Unfortunately, they did turn into speaker slips, but they couldn't stay as late. So I would like to have that knowledge as well. Otherwise, that said, if you guys have any questions for me personally. I welcome them.'",
        "'speaker_0': 'I have a few questions. First of all, thank you for being here this evening and for your presentation. My questions go to how many units will be upstairs.'",
        "'speaker_2': 'Upstairs in the main corner unit or total.'",
        "'speaker_0': 'So that's kind of where I'm going on this. It looks like you're being counted as separate. They're not actually connected.'",
        "'speaker_2': 'Correct. So there are actually there are actually five separate structures. We can talk about the first four structures that are off of Park Street towards Blanding. Those four structures, two stories each. Or one actual office unit. So one small company will inhabit one whole structure, both floors complete.'",
        "'speaker_0': 'And do those have elevators in each one or stairways? How do you get second?'",
        "'speaker_2': 'They have stairways.'",
        "'speaker_0': 'Right. And then the last unit.'",
        "'speaker_2': 'Sorry, the last unit will be most like the sort of coffee shop, except sort of a coffee shop with maybe pastries, a little bit of outdoor seating. And the upstairs will be a residential unit for my wife and I.'",
        "'speaker_0': 'And is that two floors then or is that three floors?'",
        "'speaker_2': 'Two floors for the residential unit, actually.'",
        "'speaker_0': 'So the building is actually three floors high. So.'",
        "'speaker_2': 'Correct, the corner unit is. Yes.'",
        "'speaker_0': 'All right. Any other questions at this point? No. All right. Well, thank you very much.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Appreciate it. Did you want to add anything else at this point?'",
        "'speaker_2': 'Not necessarily.'",
        "'speaker_0': 'Did did you want to list your supporters who weren't able to stay?'",
        "'speaker_2': 'I could. And I actually. Ken Carvalho and Bill Poor. In those two are gone. I think those are the two that were actually left. Thank you.'",
        "'speaker_0': 'Thank you. Right. So we have approximately 20 speakers. And some are for or against, some are for, some are against and some are. They drew both lines. At least one did. And I'm just going to call them in order.'",
        "'speaker_0': 'I don't see no objection. I'm just going to call them in order. All right. Dave Case, Jim Smallman and then Dave Camp David CAVANAUGH. And then Jeff CAVANAUGH.'",
        "'speaker_2': 'At a mayor council staff. My name is Dave Case. I've lived in Alameda about 40, 44 years. I'm still new in town, but I'm trying to get the feel of it. Basically. There's a reference to the gentleman there.'",
        "'speaker_2': 'It's a nice line. But I don't think it belongs on the entrance over the bridge on that piece of ground. You are to put it in Harbor Bay. If you are to put it in an asylum. To give it a shot.'",
        "'speaker_2': 'See how people like it. There's nine containers that I counted there, correct? Nine containers. There's nine containers there. That's correct. And the sentence here in this paragraph says, Use development constructed with shipping containers. Now, all of you people, if not all, most of you live in Alameda.'",
        "'speaker_2': 'You take great pride in Alameda. All of you do. Come over the bridge. It's a gateway. You want to see alamy so as you walk over the bridge or you drive over, my wife always says, God, we're home.'",
        "'speaker_2': 'Isn't that nice? I don't want to say God, we're home. And look at a shipping container. I don't care how tricked it is, it's a shipping container. And when you get through looking at it, it is still a shipping container.'",
        "'speaker_2': 'And even if you paint it green like the Alameda Bridge, it's a shipping container with construction paint on it. And please, guys, don't shoot down the guy's idea as far as shipping containers as a as a spot. Yeah, but not that spot.'",
        "'speaker_2': 'But it's someplace else. It's just I can't see it as a gateway. It just isn't Alameda. And that's basically all I got to say. I'm sorry I couldn't take up 30 minutes. But if I ever want to buy a used car, I know where I'm going to go.'",
        "'speaker_2': 'I'll tell you that. Gee whiz. Thank you very much for your time.'",
        "'speaker_7': 'I got one thing.'",
        "'speaker_2': 'Make sure. He's. Oh.'",
        "'speaker_0': 'Jim Spellman.'",
        "'speaker_2': 'Thank you. I'm Jim Small, and I'm an advisor to the board of the apps. And and I'm not going to speak very long because we wrote a lot of material that we based on the document that is now we understand out of date or not complete or something, we're not really sure what the situation is with that'",
        "'speaker_2': 'document. But there are a couple of things that I will say about this design and about Mr. Thomas's presentation. First of all, the Preservation Society is absolutely in agreement on the uses. We have no problem with the intended uses with one asterisk, and that is the living quarters have no parking.'",
        "'speaker_2': 'There is parking 500 feet away down the street and around the corner. I'm not sure you want to set us sort of standard for that, for for residential units. But except for that, I don't have a problem with the with the use description.'",
        "'speaker_2': 'The board does not. But we feel that this is, as the previous gentleman said, a keystone location is critical. The location is as important is as anything. And it's an opportunity for us to establish a design philosophy with compatible materials that would extend what's already happened on on Park Street.'",
        "'speaker_2': 'It's very there's some very nice designs. I'm one of those one of those who likes the the Walgreens building and the predominant use of brick in those in those blocks is is very desirable and I think could be extended.'",
        "'speaker_2': 'I will say one thing. The developer was kind enough to come to our board meeting and and make his presentation to us. And one of the things that he said, which I think is notable, is that this is not cheap construction.'",
        "'speaker_2': 'And he's obviously sensitive to the accusation that it looks cheap. I tend to think that it looks cheap, but he he assures us that this is more expensive to do than conventional construction. Well, if that's the case, we'd like to save him a little money.'",
        "'speaker_2': 'That's all I.'",
        "'speaker_0': 'Have. David CAVANAUGH. Jeff CAVANAUGH. And then, bill, E.H., you a follow up that he had, right? And then Marcel. You already spoke.'",
        "'speaker_2': 'I'd like to say something. I walked across the.'",
        "'speaker_5': 'Bridge like street bridge.'",
        "'speaker_2': 'When it was built. I was five years old. I was born in this town in 29. My family came now me to end at seven in the night. Eight night in 1870. And I've been all over the world.'",
        "'speaker_2': 'I was lucky enough.'",
        "'speaker_5': 'Korean War.'",
        "'speaker_2': 'I was sent to Germany and we had four people division and we wife and I would travel to all these European cities. All these cities are old, but every city had a new design. But, Garcia, all these people have changed their mind.'",
        "'speaker_2': 'The world is changing. San Francisco are changing. Look at the building itself. Just a lot of ugly, but some of the new ones are fantastic. Why don't we go one? But one will happen. Coming. This. Coming. People come in and say, look at that.'",
        "'speaker_2': 'Look at that, alameda. They don't have the old buildings. They was nothing but old buildings and old folks like me. Why don't we. Why don't we go for that? And those containers. There's nothing wrong with them. They have containers all over the East Coast.'",
        "'speaker_2': 'But people that want vacation homes and also student homes and so forth. I think the thing is, when people are going to come back afterwards, they remember Alameda. Now they're coming. Alameda. What do you got? You got a bunch of old buildings.'",
        "'speaker_2': 'My building was built in 48. They we we moderate. We have a lot of good things going that we want Palk Strait to be modern and we don't need those old houses in town. We have enough old houses, let's have something new.'",
        "'speaker_2': 'And the this is going to be the movie. People will come and they come across the bridge and they'll say, Look at that and that Italian meter and let's change our meter and I'm ready for the change. And I hope I live long enough to see it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Good evening. I'm Jeff CAVANAUGH. Thank you for having me. And thank you for being our government here in Alameda. I do support this project. I think that some modern designs, especially right off Park Street, is fantastic because. What do we have?'",
        "'speaker_5': 'We have waterways. I mean, as an island, we have a lot of shipping industry here in Alameda. And having something like this for people to see is fantastic. I think the more you look at it, I think it grows on you.'",
        "'speaker_5': 'And as far.'",
        "'speaker_2': 'As the containers, they are definitely.'",
        "'speaker_5': 'A situation where it's an alternative way.'",
        "'speaker_2': 'It's green.'",
        "'speaker_5': 'It's a way of of building something that will last.'",
        "'speaker_2': 'A super long time. So I do ask that you uphold the planning board.'",
        "'speaker_5': 'Because the planning board, I think, has done a fantastic job with this, and I would not vote against it. Thank you.'",
        "'speaker_0': 'Thank you. Scott Koehler, Bill Gonzalez, Elizabeth Tuckwell and the Mary Anderson.'",
        "'speaker_2': 'Mayor Council. My name is Scott Koehler. I've been living and working here in Alameda for 35 years now and it's been a long time. Every time I'd come over that bridge, you just look and you see car lot.'",
        "'speaker_2': 'Car lot. Now, empty car lot, though. Carla And they built the gateway thing. You see the sign, you go. It didn't look like Almeida. But then I heard about this project. I'm going, Hmm. It'll take a good look at that.'",
        "'speaker_2': 'And I looked at it and said. So pretty neat design. Plus you get to see the brick on the back side of the. Yeah, they're both buildings. And then a lot of people go, Yeah, but it's just shipping containers.'",
        "'speaker_2': 'But a lot of people don't realize the history of Alameda with shipping containers, with having one of our own shipping container places right here in Alameda, which was one of the first ones around from according to what I was told from a couple of fellows that I work with that their father worked there.'",
        "'speaker_2': 'So I'm going, Wolf. Here's history. Of the shipping container. And perfect place to put it. But the other thing is everybody calls this modern architecture. It's not nowadays. It's essential architecture. Because almost all the goods and everything we buy nowadays comes in those containers.'",
        "'speaker_2': 'I think it's a great project and I think it'd be really asset for me to be able to come over the bridge and see something like that instead of a car lot. Thank you.'",
        "'speaker_0': 'Thank you. Bill Gonsalves.'",
        "'speaker_2': 'Yeah. My name is Bill Gonzalez, and I own several pieces of property on Park Street in that area, and I like the project very well. Thank you.'",
        "'speaker_0': 'Elizabeth Tuckwell and then Mary Andersen and then Michael McDonough.'",
        "'speaker_9': 'Thank you, Mayor Spencer. Council members. My name is Elizabeth Tuckwell. I've lived in Alameda over 30 years, so I know the city pretty well. And I. I agree with Council member de Saag that this is not purely subjective, as Mr. Andrew Thomas would have us believe.'",
        "'speaker_9': 'I think it's I think it's very much a matter of process analysis here. I, I personally. Found the analysis by the Alameda Architectural Preservation Society that was stated in a letter to the mayor and council dated November 27.'",
        "'speaker_9': 'I find that analysis very compelling and it is not subjective. It's very specific about which areas of the design manual and which areas of the zoning ordinance are being violated by this by this project. I agree with Mr. Thomas completely that this building is indeed modern.'",
        "'speaker_9': 'He did not think that was at all subjective. He restated. You can look at the television replay of it if you wish. He stated at least three or four times that it is modern. The problem with that is that the design review manual does get quite specific about what types of architecture are allowed in certain subdistricts.'",
        "'speaker_9': 'It certainly does not say that there cannot be modern buildings in Alameda, as Mr. Thomas was trying to infer. We would have to conclude if we do not allow a modern building in this particular area, that is not what the design manual says.'",
        "'speaker_9': 'The design manual divides the city into many, many subdistricts. The subdistrict on which this building will be is the Gateway Subdistrict. The modern start. And that the design manual lists several different types of architecture that can be used and modern is among them.'",
        "'speaker_9': 'But as far as this area of the city is concerned, the northern waterfront, which includes the Gateway District and several other districts, also subdistricts, I should say. The modern architecture is permissible only in the in two of those subdistricts in the northern waterfront area.'",
        "'speaker_9': 'And those two separate districts are the waterfront. That's one of the subdistricts where you can have modern. And the other one is work place, commercial subdistrict. It's very specific. I don't think there is there is fudging around in it.'",
        "'speaker_9': 'And it does not allow modern architecture in the Gateway Subdistrict, which is the subdistrict we're talking about here. Thank you very much.'",
        "'speaker_0': 'Thank you. Mary Anderson and then Michael McDonough and then Gretchen LeBeau.'",
        "'speaker_4': 'Mary Teresa Anderson. I'm a resident of Alameda.'",
        "'speaker_0': 'I want to agree with Andrew.'",
        "'speaker_4': 'Thomas on three important.'",
        "'speaker_0': 'Points that he made. One is that this is a very prominent location, very high visibility. He stressed that, and I think we all agree on that. It is high, high visibility. Another point that I thought he did very well.'",
        "'speaker_9': 'Was showing the slide.'",
        "'speaker_4': 'Of the market place and Walgreens.'",
        "'speaker_9': 'I think we all appreciate.'",
        "'speaker_0': 'The beauty of that.'",
        "'speaker_4': 'The dignity, the good proportions.'",
        "'speaker_0': 'The lovely arches.'",
        "'speaker_4': 'And so I thought it was.'",
        "'speaker_0': 'Very nice of Andrew.'",
        "'speaker_4': 'Thomas.'",
        "'speaker_0': 'To show us that.'",
        "'speaker_4': 'Building.'",
        "'speaker_0': 'And it also.'",
        "'speaker_9': 'Serves as an excellent contrast.'",
        "'speaker_0': 'Another point that Mr. Thomas made.'",
        "'speaker_9': 'He said It has to be just right.'",
        "'speaker_0': 'Those were his very words. It has to be just right.'",
        "'speaker_9': 'Well, I don't think it helped his argument.'",
        "'speaker_4': 'To have all of us looking at this picture for such a long time. If I had been presenting his case.'",
        "'speaker_0': 'I would have put that out.'",
        "'speaker_4': 'Of sight as quickly as possible. And I'm sorry.'",
        "'speaker_0': 'That you don't get the full effect of it here with the full.'",
        "'speaker_9': 'Color showing. I think on your screens.'",
        "'speaker_0': 'If your screens are like Mr. Thomas.'",
        "'speaker_4': 'You're not getting the full effect of this. I am speaking as a person.'",
        "'speaker_0': 'Who is very sympathetic to building with containers. I think they're.'",
        "'speaker_9': 'Wonderful, and I think we are just.'",
        "'speaker_4': 'On.'",
        "'speaker_0': 'The edge of a wave of.'",
        "'speaker_4': 'Requests for containers as building materials. I know people.'",
        "'speaker_0': 'That have bought them and renovated as their homes and they are beautiful.'",
        "'speaker_4': 'If you look up container homes or tiny houses on Google, you will see many beautiful, creative, innovative ideas. And we need to be.'",
        "'speaker_0': 'Aware of that. We need to educate.'",
        "'speaker_4': 'Ourselves.'",
        "'speaker_0': 'About the use.'",
        "'speaker_4': 'Of containers.'",
        "'speaker_9': 'As building materials.'",
        "'speaker_4': 'But even though.'",
        "'speaker_0': 'I'm in very, very much in favor of that and I.'",
        "'speaker_9': 'I'm.'",
        "'speaker_0': 'Sympathetic to people who.'",
        "'speaker_4': 'Want to live simply.'",
        "'speaker_0': 'Reduce.'",
        "'speaker_9': 'Their carbon.'",
        "'speaker_0': 'Footprint, have a place they can afford, and they they want to live minimally.'",
        "'speaker_4': 'Well, I think.'",
        "'speaker_0': 'That's very admirable. And if especially if they are young.'",
        "'speaker_4': 'And single and have no pets and can live in such a small.'",
        "'speaker_0': 'Area, it may suit them just fine.'",
        "'speaker_4': 'Oh, dear. Is that my.'",
        "'speaker_0': 'Signal? Okay, I'll try to finish this.'",
        "'speaker_9': 'So I'm not against containers.'",
        "'speaker_0': 'And I think we have to be ready for many requests.'",
        "'speaker_4': 'In the future.'",
        "'speaker_0': 'But this.'",
        "'speaker_4': 'If it would do.'",
        "'speaker_9': 'Anything, would turn.'",
        "'speaker_0': 'People away from.'",
        "'speaker_9': 'Containers.'",
        "'speaker_0': 'And that's not what I want. I want them to be acceptable in the right places, design the right way. And this does not meet that criteria. Thank you. Thank you. Michael McDonough. And Gretchen Lebow.'",
        "'speaker_2': 'Good afternoon. Good evening, Madam Mayor and the rest of the council and staff. I'm Michael McDonagh, president of the Alameda Chamber of Commerce. You know, the elimination of the Chamber of Commerce, as you know, represents business. And normally, we're here to represent members who may have some issue with something before you today.'",
        "'speaker_2': 'The the people that are trying to get this done are not members of the chamber. But we're here anyway. And we're here for a couple of reasons. We're here because I think we witnessed in the in the previous item before you, we talked about Alameda having values.'",
        "'speaker_2': 'I think that's important for Alameda have values. And I was really happy to see what you did to come to the conclusion you did to help the residents, the renters here in Alameda, because we do have values in Alameda, but we also need values when it comes to business in Alameda.'",
        "'speaker_2': 'And of course, that's what I stand for, is the values when it comes to business. And I think there was another thing that came down here. Tony brought it up himself. This is about process. And we have a process in Alameda for having projects approved.'",
        "'speaker_2': 'There's some great things I'm not here to say. I love this does I do think it's pretty cool, but that's not the reason I'm here. We have people who would love it. As Andrew was saying, we have people who would hate it.'",
        "'speaker_2': 'I mean, that's just with any design we've ever had. We have people on both sides. I'm not sure it's ever been a design where everybody in the whole town was for it. I think there are people who would like to see Alameda stay Alameda in the 15th century, but this is the 21st century and it's different now'",
        "'speaker_2': '. We need to move forward, not try to hold on to the past. But again, that's just a personal thought. That's not really what I want to say. This is a green project and Alameda is known for its green values.'",
        "'speaker_2': 'It's known for the greenest little utility in America. It's known for our it's known for a lot of our other projects that we have solar on. It's known for our harbor, Bay Island. We did the whole landscaping to produce less water and runoff into the bay.'",
        "'speaker_2': 'We are known as a green community and what a great entrance into our town to show that we can recycle, that. We are great recyclers and we are great recyclers. We have Alameda Industries that really helps all of us recycle.'",
        "'speaker_2': 'And it's a great thing. This is a great project to demonstrate the greenness and the recycling ability in Alameda. We do have values in Alameda and they have a lot to do with recycling and greenness. But I want to talk about process, too.'",
        "'speaker_2': 'And this is also a value, a business value. We have a planning board. We have a planning board that goes through the process to issue user permits and design review permits. We've been through that process and what I don't understand is where all of these people were during that process.'",
        "'speaker_2': 'That was the process. That's the way it's supposed to be done. When the does when the planning board is reviewing these projects, that's when we're supposed to be hearing this. Now, all of you have the right to bring a review.'",
        "'speaker_2': 'And so I'm not saying you shouldn't have the right to to judge this project. But where was this dissent when the process was happening? We have values. We have process. And we need to stand behind our businesses, because at the Chamber of Commerce, I heard today from our executive director that we have calls into the Chamber of'",
        "'speaker_2': 'Commerce that say what's going on over there? This was developed. This was approved by the planning committee. And now it's up for review again. What about the developer or the owner of the property who has the right to build on his own property?'",
        "'speaker_2': 'And he went through a approval and he spent money. And he's sitting here now going, Did I spend my money in vain? Because now I'm up for review. This is not good business friendly. This is not business friendly atmosphere.'",
        "'speaker_2': 'When you have businesses go through the process and then have to wonder if they spent money they thought they were approved on and now they're not approved. This is Alameda. We have values, we have process. And we should honor the values of business as well so that we continue to get businesses into Alameda from outside, not wondering'",
        "'speaker_2': 'if their approved project will then be disapproved. I urge you to go ahead and approve this project because that's what the planning board did. They went through all the zoning and all of this and all of that and came up with an approval.'",
        "'speaker_2': 'And I urge you to do the same.'",
        "'speaker_4': 'I'm Gretchen Lipo live here in Alameda and I'm representing A.C.. I'm glad the last speaker said what he said, because let me tell you about process. This city spent $100,000 putting together part street Gateway District Strategic Plan. Here it is.'",
        "'speaker_4': 'And a whole mess of us worked on this in 2008. Okay. And somehow I don't think this document ever made it into the hands of the planning board, because what came out of the planning board is that and there's nothing in here that refers to this.'",
        "'speaker_4': 'So let me just say this. You know, Alameda is a very unique city. And what makes it unique is because we have these wonderful historical buildings. The number I've heard is about 10,000 historical buildings. But it's not just the buildings.'",
        "'speaker_4': 'It's all of us who live in those buildings and take care of them and rehab them and restore them and rebuild and remodel them and so forth. There's a lot of love in this town for these old buildings, and we've got to start showing that love.'",
        "'speaker_4': 'And one of the things we want to see at the gateway is the the values of these these homes right there at the spot. So when people when the curtain opens and they enter and animated, they realize, yes, they're in Alameda.'",
        "'speaker_4': 'And everybody in the Bay Area knows that Alameda has a wonderful selection of historical buildings. It doesn't mean this thing is no good. It just means it doesn't belong there. And there's a lot of building going on right now in Alameda.'",
        "'speaker_4': 'There's going to be a lot of locations that this place, this kind of architecture would fit into just fine. So I just wanted to I was looking at the vision and the goals of the process that we went through in 2008.'",
        "'speaker_4': 'It says the district can contribute to the city's distinctiveness by embracing the patterns of development and overall character of the city's cherished neighborhoods.'",
        "'speaker_9': 'And historic centers.'",
        "'speaker_4': 'The current pattern of auto oriented building parking areas and auto oriented streetscapes environmental detract from. Well, that is. And that's the other point. Architecture should reflect the high degree of craft that is indicative of Alamitos past and forms the foundation for its future.'",
        "'speaker_4': 'There will never be any of the buildings that were built back in the 1880s, 1890s, ever, ever built again. The the the the just the detail and the structure and the all the little things that make those Victorians and the colonial revivals so unique will never be replicated.'",
        "'speaker_4': 'And so what we're saying is we are. Take advantage of who we are and come up with something that is much more conducive to connecting to his historical architecture. And I think there's a picture on the front of this.'",
        "'speaker_4': 'It's very nice. It's a beautiful wrought iron arch across the bridge. And I think we ought to do an arch. Thank you.'",
        "'speaker_0': 'Thank you. Maria Dominguez, Janet Koike, Kate, I, Katy and then Tina Blaine.'",
        "'speaker_4': 'Maria Dominguez Madam Mayor, City Council Members, I am requesting a rejection of the Park Iskandar project. The placement of cargo containers that are to be used as habitats, cafes and office space and placed at the gateway to Alameda will be an enormous embarrassment.'",
        "'speaker_4': 'And in essence, the trashing of Alameda. The project is fast, easy and cheap. It doesn't matter how the cargo containers are mask, they can be painted, have windows and doors, but at the end of the day, they are just unsightly cargo containers.'",
        "'speaker_4': 'There's simply nothing.'",
        "'speaker_0': 'Esthetically.'",
        "'speaker_4': 'Pleasing about them. They cheap in Alameda and the containers clash with our rich architectural history. Should you approve the project, there is no doubt that the idea will take hold and in time containers will be sprinkled throughout the island.'",
        "'speaker_4': 'This will be the ghettoization of Alameda. Please do not sell Alameda out to special interest.'",
        "'speaker_0': 'Thank you. Janet Koiki. Tina Blaine and then Mary Tighe. I. I'm Janet.'",
        "'speaker_4': 'Kweku, the founder of Rhythmic Cultural Works and the developer of the building that rhythmic is in. And I'm here to say. I have in full support of this project, and I'm speaking as someone who brought a new idea to Alameda and also received a certain amount of objection to it.'",
        "'speaker_4': 'But I think new new ideas are great. And I think we've proved to the community that. We brought a lot. We brought a lot of life here. We've facilitated a lot of great things in the arts and and developed a lot of community as a result of that.'",
        "'speaker_4': 'So new things bring new ideas, bring new people. And maybe that's not very appealing to to others. I also think we really do need to to respect our history and preserve our history. And I love that about Almeida.'",
        "'speaker_4': 'And I am spearheading a project that addresses just that. And but I think there can be a combination of both history and new. And you don't have to be just one way or the other. And when you come across that bridge, which I do very, very often, I'm seeing, as the gentleman pointed out, parking lot and parking'",
        "'speaker_4': 'lot, and that's all I've ever seen. So I was thrilled to hear that someone was interested in this very peculiar shaped lot and was willing to make something interesting there and innovative and appealing so that when you come over the bridge, you're engaged instead of seeing a parking lot and a parking lot.'",
        "'speaker_4': 'So and I also really value the building department and the planning and the planning board. I saw how they dealt with my project, and I'm in full respect of the systems that are put in place here and their opinions and how they conduct their business.'",
        "'speaker_4': 'And I want to compliment them and support them. And I hope that you approve this. Good evening, everyone. My name is Tina Blaine. I'm a resident. A block away from this proposed project. I've been living in Alameda now for eight years, which I realize is a very short time by island standards.'",
        "'speaker_4': 'But. I appreciate what everyone is saying about the historic nature of of Alameda. And it is one of the great things about this community. But the fact of the matter is, is you can't build an old building on a used car lot.'",
        "'speaker_4': 'You know that. It just isn't appropriate for that kind of a space. And the other thing is, as I just want to point out, as a resident of this neighborhood, is that it is one of the bleakest, most desolate areas in this entire city of Alameda.'",
        "'speaker_4': 'It is full, not only of empty car lots or partially filled car lots, but some of the other structures that around there are abysmal. And, you know, it's hard to even call buildings like the water's edge, you know, an architectural highlight of the neighborhood, which is also part of our Gateway District.'",
        "'speaker_4': 'And, you know, the Salvation Army building is not exactly a historic building to hold up as an example of the best of architecture that could happen in the city. Nor is even the electrical building that's next door to this site.'",
        "'speaker_4': 'You know, I mean, I could go on and on. But I think you get the point. It's it's a highly industrial neighborhood. The old engineering across the street is really old and in desperate need of a facelift as well.'",
        "'speaker_4': 'You know, I'm proud to live in the rhythmic building. It's beautiful reuse. And I love that this building is reusing materials. It's very green. We take pride in that in the city. We take pride in that in the building in which I live.'",
        "'speaker_4': 'I think it's really important heading into the future because we don't have unlimited resources here and we need to start thinking about creative ways to embrace the materials that we do have on this planet. So I am fully in support of this project.'",
        "'speaker_4': 'I love that there's an incubator, an incubator site for young businesses and startups to actually have the opportunity to create new businesses in this community as well. That there's a cafe, that there's a really sincere attempt to try and create a community hangout space here.'",
        "'speaker_4': 'And you know, just in closing, I'd say even esteemed architects like Frank Gehry, you know, some people love his buildings and other people really hate them. So it's just what comes with new design and. I happened to like this and think it would be a great thing for the city of Alameda.'",
        "'speaker_4': 'I urge your support for it.'",
        "'speaker_0': 'Mary Tighe Reilly Graber. And then Patricia Gannon. And Rich Creek.'",
        "'speaker_4': 'Thank you, Mayor Spencer and City Council. My name is Mary Tye and I have lived in Alameda since 1972. I've seen many successful projects that have helped beautify our lovely island city, the renewed shopping center, our lovely theater, and all the very nice shops and restaurants along Park Street.'",
        "'speaker_4': 'This design is has some beauty to it, but it does not belong, I don't believe, at the entrance to Park Street. I think that it's just such a drastic contrast that if I was coming into Alameda, even as a resident since 1972, I might think I had made a wrong turn.'",
        "'speaker_4': 'Is this really Alameda? So I do ask you to come up with something else or to ask the planning committee to come up with another design, something more in keeping with the history of Alameda, because we are known for our lovely historical buildings and I think that people look towards that when they come to Alameda.'",
        "'speaker_4': 'I have friends that come just to walk and see our beautiful homes, so please take that into consideration. Thank you.'",
        "'speaker_0': 'Reilly Graber, Tricia Gannon and Rich Cranks.'",
        "'speaker_9': 'You know, the design manual. I think I got the correct design manual because I got it from Nancy McPeak. So I'm sure this is the right one. The overview, I just want to quickly read quote this in the overview.'",
        "'speaker_9': 'It says The proposed design of the structure and exterior materials and landscaping. This is for the North Park Street Design Manual. And landscaping should be or it says ARC visibly compatible with the surrounding developments and design elements. And the design elements have been incorporated to ensure that compatibility of the structure with the character and uses of adjacent'",
        "'speaker_9': 'developments. And it says in exceptions the applicant there is an exception. The applicant demonstrates that a clearly superior design solution would result if the exception were granted. I cannot see in any way how this this design can be claimed to be a clearly superior design, particularly for the gateway to Alameda, which is within the Gateway Zoning District'",
        "'speaker_9': '. And this particular lot is at the gateway to Alameda. And as such, according to the Gateway Strategic Plan, everything I've read should be treated architecturally with thoughtfulness, sensitivity, with attention to the architectural detail logically, logically, or maybe not logically.'",
        "'speaker_9': 'But according to the design manuals, everything I've read it should be developed to relate to other theme buildings. This is this may be my I'm can't remember now theme buildings in the Gateway District. What is the main theme running up and down North Park Street?'",
        "'speaker_9': 'Having walked up and down myself. To me, the most visually dominant, the most interesting theme is brick buildings. Mainly the 19. I don't know if they're 1930s, 19, forties, 1950s. Even this store next to this, the two, the Salvation Army and the Salvation Army has this wonderful brick wall that goes down this way, 132 feet.'",
        "'speaker_9': 'And then and then it comes out here in, by the way, the South. That's a false rumor that the Salvation Army has lost their lease. They have not lost their lease, at least when I talked to one of their administrators.'",
        "'speaker_9': 'And they're going to be there for several years. So anyhow, the Salvation Army is composed of brick. Inside and out across the street are three brick buildings on Park Street. Then moving up Park Street are many more stores and businesses built from brick or with brick facades, a combination up to and including the marketplace.'",
        "'speaker_9': 'We've got to in like 3 minutes already. We've got a really good theme going on here. We did something right with the brick marketplace, the new Walgreens, and with redeveloping the old CAVANAUGH corner across from the marketplace where Crispin Bakery is now.'",
        "'speaker_9': 'These are great buildings showing love for tradition and with good architectural details. There are no steel buildings here or anywhere on North Park Street. So why would we now allow this most important corner lot, the gateway to Alameda, to be messed up with a steel can development showing no allegiance to anything but itself?'",
        "'speaker_9': 'It relates to nothing on Park Street. Real quick. Okay, if visitors coming over, they're going to see that and they're going to say, wow, they're going to start naming that the green monster of Alameda. That's the way it looks.'",
        "'speaker_9': 'Okay. Thank you.'",
        "'speaker_0': 'Patricia Gannon, Bridget Creeks, and then Anthony Sloan. Good evening, Mr. Spencer. And City Council members.'",
        "'speaker_4': 'I am Patricia Gannon. I live on Bay Farm Island and I am here in.'",
        "'speaker_0': 'Opposition to the.'",
        "'speaker_4': 'Proposed park is keen to.'",
        "'speaker_0': 'Obtain your project and for the Park Street Blanding Corner.'",
        "'speaker_4': 'This is.'",
        "'speaker_0': 'The gateway to Alameda and it should reflect Alameda.'",
        "'speaker_4': 'Small town feel and maritime history.'",
        "'speaker_0': 'Residents and visitors entering Alameda via the Park Street Bridge.'",
        "'speaker_4': 'Should enjoy an inviting, welcoming vista, not ugly containers. Now I do I support.'",
        "'speaker_0': 'That these containers are made out of recycled material.'",
        "'speaker_4': 'And being an environmentalist, I think that's great. And these containers might well fit in in some areas.'",
        "'speaker_0': 'At Alameda.'",
        "'speaker_4': 'Point. However, I believe it would be a travesty and an insult to Alameda. And you place them at the gateway to Alameda. Please vote no on this ill conceived project. Thank you.'",
        "'speaker_0': 'Rich Greeks Anthony Sloan and then Arthur Mercato.'",
        "'speaker_2': 'Good evening, Mayor Spencer, vice mayor, motor city and the council members. My name is Richard Drinks. I'm a long time resident of Alameda and I'm also been a real estate broker for 26 years. Commercial, mostly, and some residential.'",
        "'speaker_2': 'I spend most of my waking hours trying to bring businesses to Alameda, and this is a very important project, obviously, as everyone has talked about being the gateway and I'm very much in support of it. It's a very tough lot to build on.'",
        "'speaker_2': 'Very small. I've brought many clients over that bridge many times and we've talked about, don't worry, this is going to change. And now here we are. And it's very interesting is how the cars along the car, businesses along Park Street have changed.'",
        "'speaker_2': 'And we've done some really great jobs with that. There's some great structures and yes, there is an older design, but why does this have to be an old design? One very powerful thing that I keep hearing is the direct neighbors that look at this every day.'",
        "'speaker_2': 'They're all in support of the project. I think that goes a long way. Previously we've had this type of development in Alameda. Now, granted it was not at a gateway, but we had a series of box cars, believe it or not, ten boxcars and a caboose.'",
        "'speaker_2': 'And they were structured that when you walked inside the boxcar in the caboose, you were inside an office building. Very much like this is going to be. I think this is even nicer than the boxcars that we had at Mariner Square.'",
        "'speaker_2': 'There were many small companies that started their lives and their careers in these 500 square foot boxcars. One of my greatest stories is that when I managed that property, a guy started in a 250 square foot space, went to 500 square feet, then he leased 2000 square feet.'",
        "'speaker_2': 'He bought a 10,000 square foot building in Alameda. It's a great, great story. And one thing that was not mentioned is this is great incubator space for small business tenants in Alameda. We do not have small space like this.'",
        "'speaker_2': 'I get calls for it all the time. So this is a great spot for somebody who could start and design something that who knows it's going to change the world. It could happen right here. And this is the gateway, I understand.'",
        "'speaker_2': 'And everybody has their opinions on the design. But why does it have to be an old building? I'm old and I like it. I hope you vote for it.'",
        "'speaker_0': 'Anthony Sloan, Arthur Mercado and then Kyle Conner.'",
        "'speaker_2': 'From. Oh. If. Thank you very much. My name is Anthony Sloan. A lot of people have talked about taste. Some people have talked about process. And I just want to talk a little bit about vision and I want to kind of a reference back to thank you for the fine presentation.'",
        "'speaker_2': 'Thomas.'",
        "'speaker_0': 'I'm sorry to interrupt. Are you going to be going to following your presentation? Because we can have it shown on this white table here. So flashes until you speak.'",
        "'speaker_2': 'It would be great.'",
        "'speaker_0': 'Yeah. They'll turn it on for you. Then we can all follow along. Thank you.'",
        "'speaker_2': 'Okay. I think we're all in agreement that this is, you know, the entrance to Park Street. We have a very dramatic bridge that goes to the front. And then we come to a kind of what a lot of people have described here is a wasteland of concrete.'",
        "'speaker_2': 'And if we go on to the next page here. We can we can see that a lot of places that have been referenced already, the marketplace and the new Walgreens on the side there, those are things that we all agree that we really like.'",
        "'speaker_2': 'You know, they have beautiful perspectives that go down to this focal point. And if we go on to the next page here. It reminds me of of the some other places that I think we should take inspiration from.'",
        "'speaker_2': 'Namely, here in Chicago, here's a beautiful bridge with towers on either side, the mirror each other, going all the way down to the Board of Trade. And if we go on to the next page here. To be a little hyperbole and critical.'",
        "'speaker_2': 'This is something I think that really is is uninspiring. If we look at what we're presenting on the left of what we've been looking at all night, that's kind of a cartoon version if on the right. And I'm not sure if it shows up as well on the overhead here.'",
        "'speaker_2': 'That's a that's an actual picture of an executed design. And to me, it's just a box. Once we get past the kind of the esoteric descriptions of of kind of explaining it, like you have to explain a piece of art.'",
        "'speaker_2': 'You, wow, it's a container. But once we look at the executed design, it's a box with glass. And the one on the right is it's almost the exact replica. It's got the same windows. And it to me, it just looks like a box.'",
        "'speaker_2': 'And when I say that we're talking about vision as opposed to taste, I just think that we can do so much better here. And if you go on to the next page, these are just more examples. I looked for more examples of something that would be really inspiring and really kind of amazing to look at at this'",
        "'speaker_2': 'location. And in the end, it just looked to me like cheap corrugated metal boxes with windows. And if you go to the next page, please. Now people did references, sometimes art and overcome criticism before becoming iconic like the Guggenheim and the Eiffel Tower was widely criticized.'",
        "'speaker_2': 'The Picasso was completely derided in Chicago when it was unveiled. But if we go on on the next page, I just. I don't think that it's necessarily that case. Here are some great examples of some kind of really neat things that people have done with container, and I could almost see something like that, something that could become'",
        "'speaker_2': 'iconic. But again, if we go to the next page. I just don't think this project is it. So on the last page here. I just feel that we can do better at this location. I jump to the end here and just kind of quote Daniel Burnham.'",
        "'speaker_2': 'He said, Make no little plans they know, have no magic to stir men's blood. And I would like to challenge the owner who I believe is very sincere in bringing something amazing to Alameda. I would love to see him bring something even more amazing to that location.'",
        "'speaker_2': 'So thank you for your time.'",
        "'speaker_4': 'Arthur McCotter and then Kyle.'",
        "'speaker_0': 'The robber.'",
        "'speaker_9': 'Out of.'",
        "'speaker_2': 'Good evening. My name is our son, Ricardo. I happen to know 1911 and 1913 Park Street on the 1900 block, otherwise known as Alameda Collision. I'm also a resident alameda and live on the east end. And in reference to what the previous gentleman just said, I do want to make a kind of an analogy and reference also'",
        "'speaker_2': 'to what Mr. Thomas said, is that I think our most iconic entryway is the bridge, a lot like San Francisco. When I come in on the either Golden Gate Bridge or on the Bay Bridge, I don't really have any recollection of what's on either side when I get into the peninsula.'",
        "'speaker_2': 'I just know I'm on the bridge. Another note my building was actually one of the buildings that was a pretty blight shack housing about 15, 20 years ago and received a facade improvement. And we put a brick facade on the building to come into what Alameda wanted.'",
        "'speaker_2': 'It's a very nice brick facade and I personally like it. However, the 30,000 cars that come by every day, the most common comment on our phone calls. Whenever we tell people where we were at, they say, Wow, I drive by there every day and I never knew you were there.'",
        "'speaker_2': 'Not until I put 1950s style bright neon on there to go with the whole kind of cars theme. People finally realized where we were at. So. I am in complete approval of Marcel's project. All the neighbors on the block are in approval of his project.'",
        "'speaker_2': 'I speak to all of them on a daily basis and in a you see the stark difference of having an empty lot or currently sometimes homeless. The vagrants congregate. I'd much rather see what I consider a very nice shipping container complex there.'",
        "'speaker_2': 'Recently I had just come back from travels from Mexico City in the very historical chocolate district and right across the street from me, as which is basically their National Symphony Hall is a Container Project restaurant thriving on one of their most, you know, private and poised avenues leading into the national palace.'",
        "'speaker_2': 'So I don't see anything wrong with Marcel's project coming in. Thank you.'",
        "'speaker_0': 'Thank you. Kyle Connor.'",
        "'speaker_2': 'And Rob Trudeau.'",
        "'speaker_0': 'And Nancy Gordon.'",
        "'speaker_2': 'I am Kyle Conner, Mayor Council, and thank you for your time tonight. I have been listening to a lot of comments. I've been here in a while and I went through a process that was pretty exhausting myself. I support Marcel because it's his land, for one thing, and it is an iconic one, and he feels like what'",
        "'speaker_2': 'he's proposing is an important piece. To what? He sees as the entrance to Alameda. He owns the land. I think everybody has an opportunity to express their opinion about what's right or wrong or art or not art. But.'",
        "'speaker_2': 'He's gone through a process with Andrew and I think Andrew. Was very compelling in his presentation to all of you tonight about. The merits of his project. And I thought. You know, he's he's presenting something that is not going to be loved by everybody.'",
        "'speaker_2': 'But I think I think in the end, if it's executed properly and I think that's the key is if executed properly. It'll be a great entry. And there's other things that we can do to enhance it, to work off of the architecture that's there from the bridge.'",
        "'speaker_2': 'Do a gateway project that blends with it, because this is not the Gateway project. This is his land. And he has some right to to. To move this project forward. I think, you know, there's some comments about process.'",
        "'speaker_2': 'I was looking at that that study that was done, I think in 2008. And I don't know that it really talks about. You know, who's who has the right to determine what is appropriate or or proper architecture in it.'",
        "'speaker_2': 'You know, it's, it's it's. It's different people's opinion. But. As far as whether it's modern or not or, you know, is perforce building modern. Yeah. Is the Alameda Cineplex modern? They're inside lending. So I don't understand what the comment or the concern about whether or not it's permitted or allowed to build a modern looking building inside.'",
        "'speaker_2': 'The waterfront of Alameda gets you really if you're saying that it's Blanding North sounds to me like the only place you can build anything that's not a historic building is on the waterfront. I don't know if that's what the intent was.'",
        "'speaker_2': 'It doesn't sound like it would be, logically to me, the intent of that document. But. You know, again, I support Andrew's. I think he's done his homework. He's done his job, which you guys pay him to do. You know you should.'",
        "'speaker_2': 'Allow this project move forward. That's my opinion. Thank you.'",
        "'speaker_0': 'Thank you, Rob. And the Nancy Gordon and Joe Klein. And if you plan to speak on this item, please turn in your slip.'",
        "'speaker_2': 'One the autograph show. I Rob Rato. I am the executive director of the Downtown Alameda Business Association. I'm not referred to as Darva, by the way. We refer to ourselves as the association. Couple of points. First off, the Darva board unanimously approved.'",
        "'speaker_2': 'I just use Darva, didn't I? Thank you. Sorry. Kate unanimously approved this project. They think it is more than appropriate at the site that it's going to be built on. And, you know, as you well know, these are 13 business owners in in the downtown district.'",
        "'speaker_2': 'Okay. They have more stake in this than anybody else. No offense to any of you, anybody out here that's opposing the project, but that board of directors is on the street making their living. And if anybody thinks that they would approve something that they believe is going to be a detriment to the district, then they just have'",
        "'speaker_2': 'not been paying attention in the last 17 years. Not only did our board approve the project, your planning board. Voted 6 to 1 in favor of this. And, Tony, I understand your your concern about process, but as I see a number of planning board members on this council today, that planning board vetted this project at at least'",
        "'speaker_2': 'three meetings. Andrew. And again, no offense to the planning board. These folks can sometimes be very picayune in their process of determining if a project is appropriate or not. And again, they voted 6 to 1 in favor of this project, and at the final approval they had very few additional conditions in their approval.'",
        "'speaker_2': 'We think that's very important. You know, this we've been using the word innovative. And again, no offense, Marcell, this is actually not an innovative project. There are these types of projects all over the world. If you have not done so yet, you get Google shipping container buildings and you're going to get wonderful pictures from all over the'",
        "'speaker_2': 'world. Now, it may be innovative for Alameda and one of the previous speakers spoke about buildings from the thirties, the forties in the fifties. Well, I contend to you that it is time for Alameda to get out of the thirties, the forties, in the fifties and get on board with modern up to date hip buildings like this'",
        "'speaker_2': ', that these young entrepreneurs are going to want to rent and use and build their businesses in Alameda along the way. And speaking of young hip entrepreneurs. There's one right there. This is not a large corporation. He's not asking the city of Alameda for any money.'",
        "'speaker_2': 'This man's put his money where his mouth is for purchasing the property and developing this property. And I don't think you folks want to give the impression to other young entrepreneurs and and independent developers in this town that, well, you know, if you're too innovative, if you're too modern, we don't want you in this town.'",
        "'speaker_2': 'I don't think that's what you want to do. I think you want to tell the people in this town, independent developers like this guy right here. There is that. Yeah, we like projects like this. We want you to put up the capital for this project and we want to move forward into the 21st century.'",
        "'speaker_2': 'God bless you all. Thank you.'",
        "'speaker_0': 'Nancy Gordon joke, Lauren and then Dr. Hahn.'",
        "'speaker_4': 'I'll be a little quieter. I moved here in 1973, so I missed what Andy Pagano used to show us in the films of The Wrecking Ball destroying architectural masterpieces. I don't have to give locations you all know or I've heard about heard about them.'",
        "'speaker_4': 'When some of the places were torn down, they were replaced by things that we still see, ugly boxes. They're not well taken care of. They have no design features. Some of them look okay. They have nice plants. They have maybe window boxes or something, but a lot of them are hideous looking and we were stuck with those'",
        "'speaker_4': '. I don't blame the people for a passing measure a long time ago. When I go to an art museum, I expect to see varieties, everything from Sculpture Roses in New York recently and saw all the things that Picasso did.'",
        "'speaker_4': 'I like things in a museum. I don't want them all in my house. I don't want to have to look at them every day. I can appreciate the great variety. I don't appreciate the looks of this building in that location at all.'",
        "'speaker_4': 'I've been involved in community organizations in 75 when I bought my first home and many of us were involved in talking with business owners on. Park Street and also Webster Street to try to get them to restore the facades, which I think has been an incredibly beneficial upgrade in our community compared to what was there before.'",
        "'speaker_4': 'I don't know if you remember Victoria Boddington, but she went around and had my slide projector and my slide screen and showed Mainstreet projects all over the place. It's. It's a national. Impetus to create the business areas that attract people.'",
        "'speaker_4': 'If we left it like it was, you think South Asia would be the only place people shop? Yeah, they would. People now want to be around what's happening on Park Street because it's beautiful, it feels good and it's consistent.'",
        "'speaker_4': 'And we put up with the. The car places and the motorcycles and the ugliness when you when you come into the city, because we're kind of used to it and we can't do anything else, but now we can do something else.'",
        "'speaker_4': 'And this ain't it. In my opinion, I'm okay with putting it somewhere else. I've raised a lot of money for the hungry and homeless organizations since 1980, and there are a lot of great designs. Some are being implemented in San Francisco between buildings.'",
        "'speaker_4': 'And that's a possibility in all different areas. I mean, Alameda Point has a lot of acreage. There could be a lot of great things down there. I think that if we want to have modern buildings, we can start thinking about geodesic domes on top of things.'",
        "'speaker_4': 'But we've worked so hard to pay attention to the height limitations and the window designs, like on the church place. I mean, you know, we've been we as a community have been very. Detail oriented and very concerned with making something that appeals to most people.'",
        "'speaker_4': 'So I am concerned with that design. That's it. Thanks. Don't do it.'",
        "'speaker_0': 'Thank you. Joe Klein. Dr. Horn. Joe. All right, Dr. Hahn.'",
        "'speaker_2': 'This. Good evening, Mayor. Vice Mayor of Council and staff. I passed out a piece of paper before you. It's kind of a summary of what the Park Street Gateway District's 3G plan. More exact Arc Street Business District north of Lincoln Avenue.'",
        "'speaker_2': 'November 2008. Seven years ago. Let me go through it quickly and the reason why I put it in front of you. Back in the mid-nineties, we are trying to save the auto roll. And within that we talked about gateway and and the viable asset of Gateway.'",
        "'speaker_2': 'The Council was wise enough that there we are knowing that we're going to lose auto roe. It was gone. It was moving forward. Toyota was moving. The. The Council had the vision and the desire to make sure that we look at the future planning of Park Street, north of Lincoln.'",
        "'speaker_2': 'You got to remember, our EDC was always active in downtown, visiting with visionary activities. We got everyone involved. This one was extremely important. I give you the timeline. Kicked off in February 2020. Community Charrette March 1528. Open Studios.'",
        "'speaker_2': '2620 7th of March. Community Open House Gallery April. Graph Review. Historical Advisory. Transportation Commission. Economic Development and Planning Board. Public Review on August Planning Board and Council Review in September and November. The plan was adopted. I don't know if that was shared with planning group.'",
        "'speaker_2': 'And I'm not I don't think it was. You could correct me. You take those highlights that were part of it and and the conceptual drawings that were given at that point in time, if you go back through the body, you'll see the conceptual drawings.'",
        "'speaker_2': 'The real flavor of it was to be able to build out all the way. To ensure that new and existing developments reinforce the desired look and feel of the district and complement the city historical buildings. I'm going to quickly go back to the back side.'",
        "'speaker_2': 'The corner treatment design and kilos kit locations. An intersection of Park Street and Blanding is to announce the entry into the district and emphasize key aspects of the architectural character. This was approved by the Chamber of Commerce. This was approved by the Park Street Association, our downtown downtown association.'",
        "'speaker_2': 'It was approved by these people. And I'll give you a few names. Marie Gilmore. Frank Manor. Ricci is the Ashcraft John Knox White. These were the guidelines that we set forward. We had conceptual drawings. Go to the back side and you can see the corners of being extremely important.'",
        "'speaker_2': 'When you talk about prices, we should be talking about what went forward over the years, a dedication that the community put in to make sure what we were going to do. I can I can only vision that we did a modern container of the library.'",
        "'speaker_2': 'Our modern container of the multiplex theater. We? Set the guidelines. You set the guidelines. Rob Bonta was actually the head of Economic Development Commission back then.'",
        "'speaker_3': 'I listened to him and I said, okay.'",
        "'speaker_2': 'So I share with you the commitments that we have made. The process that went forward and the that that the guidelines that were given. Thank you very.'",
        "'speaker_0': 'Much. Thank you. Next speaker, yale y, adl, ameera and y. Ari, thank you. And then chuck the greta and then Janet Gibson's our last speaker. So if you want to speak on this, please turn in your slip.'",
        "'speaker_1': 'Hello.'",
        "'speaker_0': 'Good evening, mayor.'",
        "'speaker_4': 'Vice mayor and council members.'",
        "'speaker_1': 'My name is Joe Elmira and I just moved to Alameda this year and I've lived in the Bay Area for about 18 years. I am in support of Marcel's project. I myself am working with tech companies that want to bring accelerators and incubators.'",
        "'speaker_4': 'Into the.'",
        "'speaker_1': 'East Bay, and I was really very excited to hear that Marcel had developed this project and that it in fact had. Already passed one set of approvals. And if this gets built, I think that this project is very innovative.'",
        "'speaker_1': 'It's progressive.'",
        "'speaker_4': 'It's going to.'",
        "'speaker_1': 'Be a place that's energized and that will bring younger entrepreneurs. I myself am a mature tech worker that lived and worked in San Francisco and in Los Angeles. And I've decided to. Stay here and live here in Alameda.'",
        "'speaker_1': 'And I have a vested interest in finding, you know, the next half of my work life in a place where I also live. And I think that this would be a great gateway. It would inspire other colleagues of mine that have gotten pretty far in technology.'",
        "'speaker_1': 'And I think this would be just a really great project. So I hope that you will prove it. Thank you.'",
        "'speaker_0': 'Chuck and then Janet.'",
        "'speaker_2': 'Hello, Madam Mayor. And Council members. My name is Chuck Guido. I am a manager of Bridgehead Studio, which is down the street from Marcel's place. I don't know him, I've never met him. But I also am a former president of the Alameda Business Association or the Alameda Business Network.'",
        "'speaker_2': 'I'm a photographer here in town, and I want to represent maybe the artists in town because that's what I do. A bridge head is an incubator for small artists in the area. I want to.'",
        "'speaker_5': 'Make the.'",
        "'speaker_2': 'Point that, you know, this city's been built over the last 150 years and every building in this city was modern at one time. And it's now 2015. It's not 1915. Modern is different now than modern was 100 years ago.'",
        "'speaker_2': 'And 100 years from now, that building is going to be one of the buildings we're trying to save, and we're going to be having this conversation to save that cornerstone. It's an industrial city. It's been built an industry that Park Street Bridge is an industrial bridge.'",
        "'speaker_2': 'It's beautiful now. But when it was built, it was an erector set and now it's beautiful. And we're going to look at that corner the same way, I think, in a few years from now, when we look at the transition between that bridge, the building and the older buildings that are down Park Street that 100 years ago'",
        "'speaker_2': 'were modern and were probably not appreciated and not accepted and fought for at that time. I think it's a wonderful project. I have no connection to it other than I'm down the street. If you know what Bridge Head Studio is, it's the old pitch.'",
        "'speaker_2': 'A propeller factory. About? Well, when I moved in there 12 years ago, that was Alameda Ghetto. And I was one of the first ones. Janet, shortly after that. The neighborhood changed quickly. And I think this is a beautiful.'",
        "'speaker_2': 'Addition to what's going on down all the way down BLANDING And. A great addition. Anyway, thank you very much for.'",
        "'speaker_0': 'Janet Gibson, and she's our last speaker. If you haven't turned in your soap, now's the time. On the white table there? Yes. Staff will help you.'",
        "'speaker_4': 'That's. Okay. So I'm Janet Gibson. I moved here in 1973, same as Nancy Gordon. And my experience is that over the years, people who have found Alameda there, their big impression is tree lined streets, you know, like a midwestern town.'",
        "'speaker_4': 'Graciousness is just something that doesn't exist in in many, many cities anymore, and particularly in California. So I'm I'm against this project because I do believe that Park Street is a gateway entrance for thousands of people who come here every day.'",
        "'speaker_4': 'And and I do find that it's sad that more of us didn't get involved earlier or with our feelings about this project. So I, I want to encourage the, the council to rethink how people are notified and learn about things and the planning board also.'",
        "'speaker_4': 'I know it began in, in the summer and then went to a September meeting. And, and then the first meeting I attended was the, was the final meeting. And each time the planning board follows the regulations that are set forth by the state that you have to notify people with a hunt within 300 feet, I believe.'",
        "'speaker_4': 'Is that right, Andrew? So I'm asking you to think of the spot there and take a radius of 300 feet. And most of it's water or we have the elders. Is that elders in. They were notified.'",
        "'speaker_0': 'What?'",
        "'speaker_4': 'What is it? What is it? There we go. But. The people when you have a situation like that. And I do think we're facing this all along, Clement, where we were having much construction and much of it is if you go through our feet, it's a lot of water.'",
        "'speaker_4': 'You have a few people. But the people who drive their cars down those streets and who will be going to businesses and so on live in all parts of Alameda now. So I think there has to be a better way and you have to discover it of of not exhausting your budget by sending a note to everybody'",
        "'speaker_4': '. But I'm thinking that the first thing that I saw in the newspaper was on October 26. Our 23rd October 23rd, three days before the October 26 meeting, it was on the front page of the Journal talking about and it showed a picture of the structure.'",
        "'speaker_4': 'So I think our newspapers would be very happy to have even a column by the by the planning board or something talking about about projects. Because that way at least people would be start becoming aware and you wouldn't have the problem that you've voiced and been concerned about.'",
        "'speaker_4': 'So at any rate, there's no doubt in my mind that that this is not going to be an iconic building in ten or 20 years or 30 or 40 or 80. And I encourage you to think of of the all the things that have been written and that hundreds of people and hundreds of hours have been spent'",
        "'speaker_4': 'on about having a vision. And the vision did include, if you look at the picture, you know, maybe thinking in terms of a gateway, an arch. And unfortunately, the second picture doesn't come down. But but you see the bridge in the second picture and it comes down and there's a kind of some special things leading you in'",
        "'speaker_4': '. But when you get to that corner, both sides of the corner and I thought that that was a picture that I had. But both sides have a picture, a building that is substantial brick and and and sets a feeling for the rest of of that.'",
        "'speaker_4': 'And let me say this today I drove the opposite way toward the bridge. And that first block has three of the oldest, most beautiful trees left. And Moorpark Street. We know what happened with some trees. But those trees, when you're going up in that last block, they're touching each other.'",
        "'speaker_4': 'They're that big. So you have the opportunity and this the vision of that of that early report didn't give you the nuts and bolts, but it gave you the feeling of what people wanted. And now we have to figure out how we can how we can bring that about.'",
        "'speaker_4': 'And I think this council can do it. Thank you.'",
        "'speaker_0': 'Thank you. All right. So she's our last speaker. We don't have any other speaker subs at this time. All right. So an outside counsel comments. Questions, Minister. Yes. Member Ashcroft. Thank you, Mary Spencer. And I did want to start because as a former council member and former Vice Mayor David Hyde noted, I was on the planning board'",
        "'speaker_0': 'when we developed this Park Street Gateway District Strategic Plan. And I think we can all agree, because many of your photographs are in there showing that your participation in public forums that it was a good process and it was well vetted.'",
        "'speaker_0': 'And I want to commend all the people who came out to speak out tonight. At some points, I felt like I was at a wedding and we had, you know, the bright side on one side and the grooms in the other.'",
        "'speaker_0': 'But what what I think it it reflects is that we have a lot of people in this town who care a lot about their town. It's part of what I love about Alameda. It's part of what makes us special.'",
        "'speaker_0': 'Do we all agree? No. But when we're at our best, we do so civilly and we don't make it personal. And I have to say, before this meeting last week, I met with both representatives from the Architectural Preservation Society, many of whom are here tonight, or maybe all of whom are here tonight.'",
        "'speaker_0': 'And I also met with the developer, Marcel Single. And but I want to just go through it was nice to get this strategic plan on my desk the other day. And I went through and I just want to highlight a couple of things that were important to me and I think are very applicable in what the council's'",
        "'speaker_0': 'going to decide tonight. So in the introduction, the overview section are the guiding principles and it says that the strategic plan ties a series of urban design strategies to an overall vision for change. The following operating principles recognize that revitalization in the north of part north of Lincoln District is likely to incur to occur incrementally and over'",
        "'speaker_0': 'a long period of time. And I think the key word here is revitalization and that the hon. Very aptly pointed out that at the time that he was on the council, maybe Mr. Motor City, too, we had lost our we were the auto dealerships were leaving one by one.'",
        "'speaker_0': 'That was a major source of of sales tax revenue for the city. We all needed to work together the boards and commissions and the city council to decide how to backfill that loss of revenue. But it was also an opportunity, much in the way that the departure of the Navy, it was devastating when we heard we were'",
        "'speaker_0': 'going to have base closure because it had been there for so long and we had come to rely on it. But it has turned out to be an opportunity if you look at all the exciting things that are happening at Alameda Point.'",
        "'speaker_0': 'So then I also looked at the section of the strategic plan that talks about, unlike this is the background, unlike Alameda is historic downtowns which emerged during the late 1800s and early 1900s when goods and services were transported via railroads.'",
        "'speaker_0': 'The business district north of Lincoln Avenue developed mainly during the early and middle part of the 20th century, when the automobile was the dominant form of transportation. And eventually and there's still remnants there, there's, I think, a motorcycle scooter shop in the block that we're talking about.'",
        "'speaker_0': 'There are lots of automotive. Automotive uses mud check, repair, auto glass businesses. Those are the businesses that eventually we reached when I was on the planning board would love to get off of our main thoroughfare and into the side streets.'",
        "'speaker_0': 'It's still an appropriate area, but we would rather not have it be the the gateway. But so so bear in mind that the we also don't have a magic wand or a pot of money in development, as it pointed out earlier, is incremental.'",
        "'speaker_0': 'When you look at some of the designs or the drawings that were shown up on this screen, it looks like somebody was able to buy that whole corner property, including the Salvation Army building. But that's not the reality today.'",
        "'speaker_0': 'We're looking at a lot. We're considering a lot that is 50 feet by 150 feet. And the 50 feet frontage is on the Park Street side of things. But I also want to talk about innovation, because some of the most innovative things that have happened on and just off of Park Street in the last several years, and'",
        "'speaker_0': 'that they were referenced tonight, the the Walgreens building and and the building next to it, I think that, you know, are down on the same block as the marketplace. Those were done with investment and planning by local. Local residents and local business people.'",
        "'speaker_0': 'They cared about their community. They saw a need. They saw, you know, remember the car dealers had gone out. We had this empty lot for the longest time. Actually, there was a move to try to get them to allow there to be some residential above the building.'",
        "'speaker_0': 'That's now Walgreens and some set back with some roof garden. But that, you know, you can't lead a horse to water. But the point is that they they have been innovative. The PRIFORCE software building is another one, definitely modern.'",
        "'speaker_0': 'As part of that project, the owner moved the historic building because he wanted to expand his space. He moved it to the old house that was in the way to the corner. It's now a little house cafe. But we're not just talking about design.'",
        "'speaker_0': 'I mean, design is very important in design, as we have noted or it has been noted, is subjective. I think seriously about a decision that six out of seven members of a planning board, two of whom are architects themselves approved.'",
        "'speaker_0': 'And I talked at length with a number of people in the community who are historical preservationists, and some of them said, we think this is great. But I also want to point out another strategy that was important in this strategic plan for this area of Park Street, and that was the economic strategy because, again, remember, we're backfilling'",
        "'speaker_0': 'a significant loss of sales tax revenue to the city. So well, strategies one, two and three are and attract desired businesses, recruit desirable businesses, increase market support for new and existing businesses by attracting residents, customers and businesses and employees to the Park Street Gateway District.'",
        "'speaker_0': 'This is what this project is doing. It's an innovative use that as the woman, a recent resident welcome talked about as she's a recruiter in the tech field is there is a market for these sort of small spaces.'",
        "'speaker_0': 'And while I very much appreciate and honor our historical heritage, I live in a Victorian. I put a lots of money into my home. I also worry that if we are to fixated on the past, we will miss focusing on the present and also the future.'",
        "'speaker_0': 'And when I met with the members of the apps, I was talking to them about, do you know all the exciting, innovative companies we have in Alameda, nanotechnology? We are leaders in the field and some amazing things going on around Alameda and there's more opportunity for that to happen.'",
        "'speaker_0': 'So we want to give those opportunities, encourage those kinds of opportunities. And then in the land use section, it talks about encouraging mixed use development. And you've got three different uses here in that one small corner lot. You have office, you have the retail coffee shop.'",
        "'speaker_0': 'I don't think we can build too many places where people can sit and gather and sit out on a outside covered patio to drink their coffee inside. But we've encouraged mixed use. And and there's even a residence there.'",
        "'speaker_0': 'The the developer and his wife plan to live there and getting more residences to Park Street gives you that eyes on the street. I know that there's been a lot of talk about whether modern buildings should be allowed or not.'",
        "'speaker_0': 'But if we go back to what Andrew Thomas pointed out to us is the three findings that we have to make. One is that the project is appropriate for its site and compatible with its surroundings. And if you spend time not in your car, but actually walking that block, it is not the loveliest block of Park Street'",
        "'speaker_0': 'and it might be one of the worst. And I don't mean to cast aspersions on folks who have their businesses there, but the and I'm not saying so there's ugly buildings. Let's build another one. What I'm saying is this has a modern vibe to it.'",
        "'speaker_0': 'It's cool. It's urban. Yeah, it's a little bit edgy. But as I stood and looked across the bridge, there's the new development just over the Park Street Bridge, which I think it's called Phenix Commons, and it's kind of community housing for seniors.'",
        "'speaker_0': 'I think it's a pretty cool modern design, and that's just on the other side of our beautiful iconic Park Street Bridge. So what and the marketplace and Walgreens and the building in between Angeles restaurant is yes, they turned out very well, but they're appropriate for their usage.'",
        "'speaker_0': 'The corner property we're talking about doesn't have any Victorians and it's. It is industrial. And this is something that I think is respectfully industrial, but, you know, held to a higher standard. And I really appreciated hearing from Janet Corker, who developed the rhythmic cultural center, because I do remember some very contentious debates before the city council back'",
        "'speaker_0': 'in those days. And the same with the theater in the Cineplex and the parking garage. And look what a boon that has been to our whole Park Street downtown district. So I, I think what we have here is a chance to look at the future, take a bit of a leap of faith, maybe move out of our'",
        "'speaker_0': 'comfort zone a little. But I, I think that all of the consideration, the local element of this young man who's been a business owner here in town for a number of years, and all of the process that this project went through before it came to us merits our support.'",
        "'speaker_0': 'It certainly has mine. Thank you, Mayor. Thank you. Member de.'",
        "'speaker_6': 'Saag. Thank you very much, Madam Mayor. Thank you very much to all the people who had come out and taken their time out of these holiday season to take part tonight. Really appreciate everyone who not only spoke tonight, but also sent emails expressing their thoughts, pros and con.'",
        "'speaker_6': 'I think one way to begin this discussion is just simply to say that, you know, when you go to San Francisco and you go to the Haze Valley, you see the Container Project there. In my opinion, it's actually quite beautiful.'",
        "'speaker_6': 'You go there and you enjoy it. The environment is cool. And for that reason, when we started the planning for a site, a having selected SOCOM, the urban planners to create a plan for the area that ultimately Alameda Point Partners are hopefully going to develop.'",
        "'speaker_6': 'We also we wanted to capture that cool, edgy, kind of funky feel to it. And that's important to keep in mind, because, you know, how we plan one part of Alameda isn't necessarily the way in which we plan in other part of Alameda.'",
        "'speaker_6': 'And so I think the way in which Andrew Thomas laid out what are the key issues that we need to grapple with tonight? I think those are the key issues that need to repeat be repeated, because I think that's the crux of the debate and of the three key issues.'",
        "'speaker_6': 'The first is the one that's the most paramount. And as he stated, the question is, is this project consistent with the general plan zoning and the design review manual? So once again, the crux of the issue is this is this project consistent with general plan zoning and the design review manual?'",
        "'speaker_6': 'Now in starting off earlier this evening asking Mr. Thomas about the the design review manual, whether it was the one that Council, including myself, voted on in 2013 or whether it's the one on the website right now. In asking the question about the existence of what within on page 101 or 103 is the North Park Waterfront District'",
        "'speaker_6': '. The point of of raising that. Asking that question in the context of the design review manual was to lay out that there is a place within the design review manual that we where we contemplated certain attributes. And one of those attributes, whether we go off the language of the March 2013 design review manual or we go off'",
        "'speaker_6': 'the the most current one. One of the attributes of the North Waterfront Park Street District is that that would be the appropriate place to house modern style architecture within the Gateway District. And that that area, the waterfront district, Park Street Waterfront District is north of Blanding Avenue.'",
        "'speaker_6': 'This project is south of Blanding Avenue. So when it comes to the design review manual, there is a bit of an inconsistency, in my opinion. Now you might say, okay, well, you know, the design review manual is the design review manual.'",
        "'speaker_6': 'Maybe what really matters is what's in our ordinance, specifically what's in the general plan zoning for the area, in which case then we have to turn to the zoning for that area. Now, in our ordinance, the zoning is it's under 30 dash 4.25 North Park Street District.'",
        "'speaker_6': 'A 30 dash 4.25. And now we're going to address the second issue that's at the crux of the matter. Emma, the crux of the matter is, is the project consistent with a general plan zoning and is it consistent with a design review?'",
        "'speaker_6': 'That's the challenge that that anyone has to to meet. So within 30 dash 4.25 when you look at the North Park Street District. It states immediately and sections a and aaa1 small, small, small case I purpose the section of the aluminum.'",
        "'speaker_6': 'In this section of the aluminum meet, Alameda Municipal Code provides regulations and standards to facilitate and guide future development within the North Park Street District. And here's the catch phrase insistent with the city of Alameda General Plan, the Economic Development Strategic Plan, and the Gateway District Strategic Plan.'",
        "'speaker_6': 'The regulations within the sections are intended to, among other things, one guide desirable reinvestment in the district consistent with general plan policies and Gateway District Strategic Plan goals. So the question then is that you have to take a look not only at the zoning, but the way in which certain documents are embedded in the in the enabling'",
        "'speaker_6': 'legislation. And one of the documents that's embedded within zoning is the Gateway District Strategic Plan. Now, what is the number one strategy within the Gateway District strategic plan with regard to the Gateway area? Well, the number one strategy as actually as Janet Gibson had pointed it out.'",
        "'speaker_6': 'Strategy will. Strategy number one is strategy one. Establish a gateway at the intersection of Park Street and Blanding Avenue to announce entry into the city. 1.1 build on the character of Alameda is a rich history of built forms.'",
        "'speaker_6': 'So that. Within the zoning for the North Park Street District. There is.'",
        "'speaker_2': 'No.'",
        "'speaker_6': 'Legislation to this plan. And so this plan, therefore, begins to color subsequent. Items within the North Parker Street District. And so one of those items happens to be with the with what are the appropriate building types of which there were are nine.'",
        "'speaker_6': 'And one of the appropriate building types is the community. The community. I mean, a commercial block and another one is workplace commercial. But those building types need to be there and we have to then retrace back to the retrace back.'",
        "'speaker_6': 'The Design Review manual. Which says that these if there's to be a modern type of building barter modern refers to a style, an architectural style. Building types refers to a type of building, you know, its massing how big it is.'",
        "'speaker_6': 'So if there's to be a building type, whatever that has a modern style attribute to an architectural attribute to it. And what regulates that with regard to the design review manual is that it has to be north of 90.'",
        "'speaker_6': 'So in my perspective. When Mr. Thomas threw down the gantlet as to what the crux of the matter is, this consistent with the general plan zoning and is it consistent with the. Design Review manual, in my opinion. I'm not seeing a consistency there now.'",
        "'speaker_6': 'Council is free to make its decision howsoever it wishes. I mean that that's what this process is about. It's a de novo process. But at this point, I'm stretched to believe that, you know, this answer, that this answers the question that was thrown down as to whether or not this is consistent with the.'",
        "'speaker_6': 'Enterprise Plans zone and and the design review manual. So let me finish for now this way. There was this process, it was a lengthy process of creating this Gateway district, and within that was certain outcomes, which was the design review manual, particularly with regard to the North Park Street District.'",
        "'speaker_6': 'There were two documents, mind you, when it comes to design reading manual, there's the North Park Streets District, which the findings of which were then put into the citywide design review manual, and that, along with the zoning, helped to shape the type of buildings that we saw, that we saw built at the intersection of Lincoln Avenue and'",
        "'speaker_6': 'Park Street, as well as at the intersection of Pacific Avenue or close to close to Pacific Avenue. And and in Park Street, they were working within the palette and the flavor and the textures that were contemplated by that whole process.'",
        "'speaker_6': 'In this project. I'm not seeing I'm not seeing that. But again, you know, council is free to make its decision howsoever it chooses as this novel process. But but at this point, I don't believe that that the proponents have satisfied the burden of proof of demonstrating that they are consistent with the inner plan zone and the urban'",
        "'speaker_6': '. Design review. Finally, let me just say, you know, I suspect this project will be it will be if it's if it's passed, it will be beautiful. People will like it. I believe that. I have no doubt that the coffee shop downstairs will be will be wonderful.'",
        "'speaker_6': 'But the question really is very narrowly tailored. It really isn't to me a question of of this design versus that design. It's a question of what are what are the processes that we've been putting in place and whether or not we're going to pay respect that process or, you know, for now, maybe we won't and.'",
        "'speaker_6': 'And actually, because this is the novel process, we don't have to. But I just want to say for myself as a council member, though I'm stressed believe that that this met the burden of of of of the first of three key issues.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'You want to go next? And Brody.'",
        "'speaker_3': 'Thank you. Before I go and say what I'm going to say. Can, can, Steph can. Andrew can. And you kind of address.'",
        "'speaker_2': 'Course.'",
        "'speaker_3': 'Because that's kind of a critical issue and. Can you give me your thoughts on it?'",
        "'speaker_7': 'Yeah. On the zoning we look, I'll just restate what we said before. We. We believe it meets the zoning. There's the word of the zoning text. The zoning specifically does not get into architectural design. It references the design review manual as a place to get guidance.'",
        "'speaker_7': 'Page One of the design review manual says this is to provide guidance. You can approve a plan or a design that doesn't meet this manual if you think it's a good design. Because at the end of the day, the goal is the way you regulate design through design review.'",
        "'speaker_7': 'So we feel strongly that the project is consistent with the zoning we can debate. At length about whether it's consistent with the design review manual. I think Councilmember Desai is making a good point. We read the section that says in the manual, Modern design is good in waterfront districts like Alameda Point, I mean, the Northern Waterfront Waterfront'",
        "'speaker_7': ', the North Park Street waterfront, we never have read that meaning that the manual is saying no. Where else in Alameda can you do modern design? So we think it's consistent with the the design review manual as well. But I also think it's it's sort of a waste of time to discuss whether it's consistent with design review manual'",
        "'speaker_7': 'or not, because the design manual on page one says if you like the design. You can approve it, even if it doesn't meet every single word of design review manual. So the point of the manual is guidelines, I guess, you know, so I totally respect Councilmember De Sykes interpretation.'",
        "'speaker_7': 'He can't make the findings to vote yes. You know, that's you know, each of you have to make that decision on your own. But from a from a technical standpoint, we believe and we make and I'm not you know, this is the recommendation went to the planning board and we have multiple staff reports from a staff perspective'",
        "'speaker_7': '. It meets the general plan and the zoning and the design review manual. If if you don't like. But that doesn't mean you have to approve the design either. You can say, yeah, that's fine. But if it meets all three of those documents, I still don't like it.'",
        "'speaker_7': 'So I can't make those other two findings for design review approval. I don't think it's compatible. But does that answer the.'",
        "'speaker_3': 'Question I kind of got from my colleagues comments that it was kind of a black and white, no issue that, you know, it's not consistent with our general plan and our zoning, so therefore we can't approve it. So, I mean, if if it's that black and white.'",
        "'speaker_3': 'Or.'",
        "'speaker_6': 'Well, no, no, I didn't say that because remember, I was in my opinion, it's not consistent with the that the two items referenced. But I also said, because this is a de novo hearing, you can make your decisions based on howsoever you think.'",
        "'speaker_6': 'You have a clean slate. You're looking at it. That's up to you. So it's not black and white in that sense.'",
        "'speaker_7': 'From staff's perspective. This is the same recommendation we made to the Council Planning Board, which they also made the findings.'",
        "'speaker_2': 'That.'",
        "'speaker_7': 'The project is consistent with the zoning and the general plan. And so. And I guess what worries me about hanging the whole decision on that is, okay, so if you're saying you actually like the design, but the problem is the zoning.'",
        "'speaker_7': 'Or there's no review manuals. And it just begs the question, well, should we just change the design review manual, if you like the design? So don't use that argument if you in fact, you don't like the design because at the end of the day, that's what we have to decide, that you can absolutely approve this project with'",
        "'speaker_7': 'the existing general plan, existing zoning, exactly the way it is without changing anything. But if you're want to make the argument, it's not consistent with the you can't make the finding of that consistency, which I completely respect. It just leaves me and the applicant with kind of a.'",
        "'speaker_7': 'Question tomorrow morning. Well, is the problem the zoning in the general plan, should we go back to the planning board and try to change the zoning? And that is the problem that has maybe we should eliminate that one sentence about the waterfront because we just don't want to be in a conversation with Marcel tomorrow going, well, maybe'",
        "'speaker_7': 'if Tony is is fine with changing the manual, in which case then he loves the design. Then we just bring it right back to you. I mean, is that are you comfortable?'",
        "'speaker_6': 'And that would imply.'",
        "'speaker_7': 'I don't think so. I don't think that's what you want. So that's why I keep trying to bring you guys bring the council back to the question. If you don't think the project and all the arguments were made by the opposition, we just don't like it.'",
        "'speaker_7': 'We don't think it's compatible for that site. If that's the way you honestly feel, you you can say it's consistent with zoning, but I just don't think it's compatible for site. So I'm voting no. And that's why I keep trying to steer you to those last two findings, which I think are just so well, because they're really'",
        "'speaker_7': 'about the project itself. So let me.'",
        "'speaker_6': 'Be clear, though. I don't think that's the that that's properly restating the issue. To me, the issue is for me as one of five council members to exhibit fealty to the process that was put in place as to how the the that art of Landing Park Street intersection could be developed.'",
        "'speaker_6': 'Now, we might have differences with regard to what constitutes could be develop and it clearly we do. But to me that the difference is is the predicate. What really matters is the subject, which is the process that went into place.'",
        "'speaker_6': 'And for many people, you know, there there is a strong commitment that there was a process and a commitment to have, you know, some kind of architecture style that a fealty to that kind of traditional planning that that that ultimately you saw in the Walgreens project and in the in the project across from Alameda Marketplace.'",
        "'speaker_7': 'And that makes the way you've stated it there makes sense to me I think as I would interpret that is you don't believe we should be doing these modern designs on this side of of Blanding and that's then that that I can that I know how to transmit to the applicant if if at the end of the'",
        "'speaker_7': 'day this doesn't get approved tonight is I can say look here's no we don't want to go back and change the design review manual.'",
        "'speaker_6': 'That isn't in the day. I don't agree that is an accurate summary.'",
        "'speaker_7': 'I mean, that's an that's a legitimate position for you to feel about the design. Somebody else can think differently. And and my point is, you don't need to change the zoning design review manual to have a different position than that.'",
        "'speaker_9': 'And Brody.'",
        "'speaker_3': 'I still have another question coming up against the 1030, because I always get kind of.'",
        "'speaker_0': 'Because we don't have another agenda item. Right. This is the last time.'",
        "'speaker_3': 'Okay, so we're okay. So can you talk a little bit about the Gateway Project? You know, for those that may be new to it, yeah. Listening at home that.'",
        "'speaker_7': 'You mean the planning process.'",
        "'speaker_3': 'Right? You know, what is the vision for those four corners when you come in?'",
        "'speaker_7': 'Oh, okay. So there was the visioning document originally the North Park Street Strategic Plan, which has been very well described by the speakers and and the council members. There was a talk about an arch. You saw the drawing of the arch.'",
        "'speaker_7': 'That's not on these this corner. It's on the corner of the bridge. There was the the vision is that we should try to take the the metal bridge structure and with these lamp posts and then maybe an arch.'",
        "'speaker_7': 'I mean, there was never any like we're building the arch. Here's the money to go build it. We've never gotten to that point. But it was a it was a vision of how do you create that? And then how do you do?'",
        "'speaker_7': 'And I think it was accurately described, you know, by everyone tonight. Yeah. The idea of those two lots should go away. The two parking lots each were replaced by buildings that create a corner statement, which then transitions, you know, each that whole North Park Street area then redeveloped.'",
        "'speaker_7': 'I think the way we have always looked at that vision and the way we have read that document and as we've talked to people, we have been very sort of our vision has always been at least in city hall is you there's there's the bridge at one end of this district.'",
        "'speaker_7': 'At the other end is the designated historic district of Park Street, South Park Street, which is south of Tilden, Lincoln. And so what's been interesting for us as we plan the projects in between those two areas is this concept of.'",
        "'speaker_7': 'Not every building has to be historic. We're building new buildings in the North Park Street area. When we were doing the Walgreens project, which I agree. I mean, we recommended approval of that, too. We love that project. We think it came out great.'",
        "'speaker_7': 'It was a new buildings which were trying to tie very, very closely architecturally to the the designated historic district just across the street. Our thinking was then as we move closer to the bridge and as we move further from the designated historic district, you can start being a little bit more liberal with the historic interpretations.'",
        "'speaker_7': 'You can start introducing more sort of modern designs. The original language that was in the original version and that Tony has been talking about, also sort of reinforced that, you know, of. Right. You know, as you get closer to the water, you can get more modern.'",
        "'speaker_7': 'We have never seen a, you know.'",
        "'speaker_2': 'A.'",
        "'speaker_7': 'A rigid line like, oh, my gosh, you know, once you cross landing, no more modern, it was like, how do you create a smooth transition? When Marcel came in with his project at that corner. You know, it was like, okay, that's that fits with the vision.'",
        "'speaker_7': 'Now this project go too far. Is it too edgy? Is it too modern? I think that's kind of what I'm hearing from this side of the room. Like, Yeah, you guys went a little too far with that modern thing.'",
        "'speaker_7': 'A little too much, a little too edgy, a little too crazy. I mean, I think I think they acknowledge we're not going to build a historic building. You can't build a historic building. You have to build something on that corner that holds the corner.'",
        "'speaker_6': 'But there is something that there is something that I have to correct, though, the notion that modern within the context of the design review manual can only be built north of Planning Street. That's not accurate because the reading, at least of the March 2013 document is that it is.'",
        "'speaker_6': 'This is that Alameda does not currently have many examples of modern buildings. However, applicants may consider modern architecture as an appropriate style or infill opportunities throughout the waterfront and workplace commercial districts. Workplace commercial districts, for example. That zoning is right next door to on the directly east of this project.'",
        "'speaker_6': 'Correct. So so you can have modern south of of of Landing Avenue. So long as it's in the workplace, it's it's more appropriate within the workplace commercial district. This project is not in the workplace, it's in the gateway.'",
        "'speaker_7': 'And hindsight's always 2020. If that was our intent, I wish we had written because I then in the gateway modern is prohibited and then it would have been very clear and, and Marcel's project a year ago would have been stopped in its tracks.'",
        "'speaker_7': 'That's not the way we wrote the question.'",
        "'speaker_0': 'What is the zoning designation or the the the Blanding site of this project. What what district is that considered.'",
        "'speaker_7': 'The well his his entire property is in the Gateway Zoning district.'",
        "'speaker_0': 'Even the Blanding side of it.'",
        "'speaker_7': 'Yeah. The entire.'",
        "'speaker_0': 'The blanding.'",
        "'speaker_7': 'His entire.'",
        "'speaker_0': 'Front landing.'",
        "'speaker_6': 'Is. No, no, no Blanding nor north of Blanding is, is the where the convalescent home is. That's.'",
        "'speaker_7': 'Oh that's.'",
        "'speaker_6': 'Commercial. And then east of the convalescent home is industrial. And then his project.'",
        "'speaker_7': 'Sorry, your time. I thought your time it is. So you're talking. Your question is Marcel's property. Property is entirely in the Gateway Zoning District, which is the zoning district, which basically includes all parcels that have frontage on Park Street, but not including the what's called waterside.'",
        "'speaker_2': 'Quarters.'",
        "'speaker_7': 'Senior senior facility. And.'",
        "'speaker_3': 'I guess I'm still kind of struggling with, you know, what is our ultimate is there was a lot of people that said, you know, this may be a great project, but just not at the gate. I mean, what is our vision for the gateway?'",
        "'speaker_3': 'Because we come in and you have a sniff, a nursing facility on one side with solar panels on the roof. Yeah. And I don't think that's going anywhere anytime soon. We have on the other side a strip mall, you know, that it was not the most attractive strip mall.'",
        "'speaker_3': 'And there's there's really no use of the waterfront like like we did at Bridge Side. So and then on the other corner, you have a parking lot. And then on this particular piece of property is also a parking lot.'",
        "'speaker_3': 'So, I mean, what what is our our vision, given that, you know, there's two two structures that probably aren't going anywhere, anywhere soon?'",
        "'speaker_7': 'Well, our vision is really to incrementally improve the entire district, all four of those corners. But as a number of people have said and you just pointed out, I mean, we we the city of Alameda can't do any of it.'",
        "'speaker_7': 'We need the property owners to, on their schedule, step forward. And then and then we we we work with them to try to create the best possible project, the best possible improvement for that site. We thought we're working with the planning board that we had done that on this site.'",
        "'speaker_7': 'You know, it was a it was a it was a well, it's a word I'm looking for. You know, I mean. We could have done something safer or so could have designed something safer, something easier. The Walgreens project was it was a piece of cake to get this I mean, approved.'",
        "'speaker_7': 'I mean, it was one of those designs was very safe. You know, the proportions were right. And it was played to the historic character. I mean, the maybe not a piece of cake. Marilyn, you're right. This week we spent months.'",
        "'speaker_0': 'Remind you on.'",
        "'speaker_7': 'On the parking design in the circulation. We, I think.'",
        "'speaker_0': 'It was the second user that. Yeah.'",
        "'speaker_7': 'But from an architectural standpoint, you know, it's just an easier project to look at. It's an easier project for people to get comfortable with more quickly. This is a much more adventuresome design and just, you know, it's it's.'",
        "'speaker_3': 'I guess my question is, if we build a building there that, you know, is beautiful in the eyes of one half of the room. Right. It's still next to the Salvation Army.'",
        "'speaker_7': 'Nothing else.'",
        "'speaker_3': 'Changes. A beautiful building.'",
        "'speaker_7': 'I'm sorry.'",
        "'speaker_3': 'It's next to the water's edge, which they're great people who run it and they do a lot of good work there. But it's not a beautiful building. It's kitty corner to the shopping center with the auto parts store, you know, which does not really scream welcomed Alameda I mean it's this is a beautiful place and it really'",
        "'speaker_3': 'you know it. If you build something, quote unquote beautiful, they're like some people believe as beautiful. Isn't that kind of out of place in your mind? Yeah, in that spot or.'",
        "'speaker_7': 'I my personal feeling is that we should be trying to get excellent design on every site. Now, I think the problem here is, and I think this is an excellent design I wouldn't be recommending if I didn't. I think the problem that we all struggle with, with this property is you would like to play off some other'",
        "'speaker_7': 'excellent design nearby.'",
        "'speaker_3': 'We don't have anything there isn't.'",
        "'speaker_7': 'That's right. Excellent design. That's why. And that's why the first slide I showed you was the bridge. We jumped to the bridge. That's the best, in my opinion, the best example of good design in that immediate neighborhood. And that's why we played off of that as a sort of design.'",
        "'speaker_6': 'Let me make sure to say to that. You know, I think, you know, the thrust of where I'm coming from, but. You know, I don't really believe that this is a show in which there are only men in white hats and men in black hats.'",
        "'speaker_6': 'And I say that because I think I and anyone has to acknowledge that that parcel on which this project is being contemplated is a difficult parcel to build on, given the nature and kind of its kind of nothingness.'",
        "'speaker_6': 'So, you know, I recognize the difficulty in doing a project on that parcel and and so that then, you know, the predicate to that is, well, then, you know, sometimes you're going to have to think out of the box on that kind of project.'",
        "'speaker_4': 'So I you know, that is.'",
        "'speaker_6': 'A a thing that I recognize is on the table. So.'",
        "'speaker_4': 'Let me make sure to say that.'",
        "'speaker_3': 'Okay. Thanks, Andrew. I'll just kind of wrap up. Appreciate that. So just quickly, I also want to thank everyone for coming out today and sharing your opinions. And on an issue like this, you know, it does come down to an opinion.'",
        "'speaker_3': 'Do I like it or do I not like it? So, you know, it's a different decision. And, you know, the one we wrestled with earlier in the day, you know, with the moratorium about people's housing and, you know, rent control and issues like that.'",
        "'speaker_3': 'But, you know, it kind of reminds me of some other projects. And you hear some of the words, you know, described in the theater and parking garage were monstrosities. And now everyone loves them. And, you know, the vice mayor, you know, put a lot of political capital on the line to get those projects through and through his'",
        "'speaker_3': 'leadership. Now, that's what's responsible for Park Street's regeneration in my mind. I remember reading that the library looked like a Quonset hut. And yet now everyone seems to love the library. And it's, you know, a source of civic pride.'",
        "'speaker_3': 'And, you know, the Safeway in South Shore was the Taj Mahal. Safeway. Okay. I mean, I don't know if it's happened, but, you know, I like to shop there because they have a really great selection and you can get a lot of a lot of stuff you can't find anywhere else.'",
        "'speaker_3': 'My first week in office, I got a voice mail from somebody. How dare you? A voted for the Las Vegas style strip mall over at Alameda Landing. Well, first of all, that person didn't know that I was only in office one month or one week, and I didn't vote for that.'",
        "'speaker_3': 'But, you know, these are the type of, you know, derogatory terms that we see attached to these these projects when they come out and, you know, when when, you know, emotions fade, you know, and everyone gets used to them, you know, then they become the fabric of our community.'",
        "'speaker_3': 'So I think we should, you know, be careful about demonizing a project and especially demonizing a small business person who really won. It's his property, you know, who wants to do what we all say that we want to do here in Alameda, you know, is create jobs.'",
        "'speaker_3': 'You know, we've heard everyone up here say, you know, we lo the fact that besides Piedmont we have the lowest jobs housing ratio in the Bay Area yet. What message does it send to businesses and to property owners?'",
        "'speaker_3': 'We basically tell them, yeah, we want you to create jobs, but, you know, we don't like the way your project looks. So, you know, we're going to let you go down the path of a year through the planning process and go through all the public hearings and get approval by the planning board.'",
        "'speaker_3': 'And then at the end, after you invested all that time and all that money and we're just going to yank your project. So I think that sense I think that sends the wrong message to business people. And, you know, we really want to be a place of innovation and incubation is the things we're doing at Alameda Point'",
        "'speaker_3': 'with the food incubation, the things that Marcel wants to do here, you know, with with his tech incubation, you know, these are the people that are going to start with one or two people and then they're going to hire two, three, four, and they're going to move to another building, maybe on Park Street, maybe on Blanding, maybe'",
        "'speaker_3': 'Alameda Point, maybe they'll get to 20, 30, 40, then they'll be in Marina Square, you know, get to even bigger. Then they'll be, you know, building a factory out on and Bay Farm Island. So I think these are the types of things that we want to encourage as a council and not discourage.'",
        "'speaker_3': 'And then I look at, you know, we have South Shore. There's a if that's supposed to be the waterfront is supposed to be sacrosanct. Yet we have a courthouse, we have a McDonald's. And lo and behold, what do we have between the sushi house and the McDonald's?'",
        "'speaker_3': 'We have a container. We have a business on the waterfront, which is our most pristine, prestigious, you know, piece of property that we have in the city on shoreline. And we have a container. And yet I don't see anyone, you know, complaining that we need to shut that container down.'",
        "'speaker_3': 'In fact, my colleague here defended them a couple of weeks ago. You know, when I brought up an idea to have bike sharing because we wanted to protect that business, yet they operate out of a container. So and then one of the things, you know, in my day job is I get a chance to meet a lot'",
        "'speaker_3': 'of interesting people. And when one day I had a chance to go to Berkeley and meet with a Nobel Prize winner, and I can't remember what discipline, I apologize, but we were talking about climate change and AB32 and greenhouse gas emissions.'",
        "'speaker_3': 'And he told us that the. Most effective way we can reduce greenhouse gas emissions is through changes in construction. So that's a state goal. And I've heard almost everyone in Alameda say, you know, I'm for the environment, I want to save our planet.'",
        "'speaker_3': 'I want to be green. And we have in front of us a project made out of recycled materials that reduces greenhouse gas emissions. You know, we're going to tell the property owner that, no, you need to go back and build a traditional, you know, brick and mortar and wood building that basically contributes to greenhouse gases.'",
        "'speaker_3': 'So I think, you know, it's a little bit talking out of of one one side of your mouth. Sometimes when people talk about environment, because this is a chance to put our money where our mouth is. And lastly, in these type of things, what's important to me, I think, is what the neighbors think.'",
        "'speaker_3': 'You know, when we had the Del Monte project, you know, Alison Green and all the neighbors, they became really engaged and now they bought into the project. You know, we had Alameda Point, we had folks like Dutton Pigs and the Alameda Point Collaborative and folks who live on the West End really buy into Alameda Point.'",
        "'speaker_3': 'And, you know, when we make decisions about what to do on Harbor Bay Island or Bay Farm Island, you know, it's important what the neighbors who live in those adjacent neighborhoods think and hear. You know, I basically heard that all of the businesses or most of the businesses neighbor, you know, Mr. Rattle's organization, they're supportive of this'",
        "'speaker_3': '. They're supportive of this. And the neighbors really, really think it's a good thing to have as a gateway. And they think it's not going to be a detriment to their business. In fact, they think it's going to be an asset to their businesses.'",
        "'speaker_3': 'And ultimately, you know, that's where what's most important to me is in these type of decisions where the neighbors are. And I think the neighbors support this project. And you know that that's why I give great way to to what the neighbors feel.'",
        "'speaker_0': 'I swear.'",
        "'speaker_2': 'I think this is a very difficult site. And one of the reasons I think its difficulties and its major constrains is the gateway is the first thing you see when you come across the bridge. And one of the I was actually very attracted to the project.'",
        "'speaker_2': 'But in the back of my head is, you know, people are going to see containers and. This is one of the few times where I really. Because of this, I am looking at what Mr. Thomas said about the findings we have to make, and I'm looking carefully at the at the design and I take my lead from'",
        "'speaker_2': 'the feedback that I've gotten from the community and, and this is not what council member matter SC thinks is a beautiful design or not. It's I think it's what the people think and the feedback I've gotten most recently after this got on the council agenda is.'",
        "'speaker_2': 'People don't think that design is too much to use Mr. Thomas's term and it's, it's, it's too edgy, it's, it's beyond what should be there. And that's bookend against what was invested in 2008 and then 2013. And if it was a superior design, I would think there would be more acceptance of it.'",
        "'speaker_2': 'I have heard no feedback that the uses were objected to back to everybody welcomes the uses. So to get to the point from my message back is that if the design can be changed, people will welcome the users and welcome.'",
        "'speaker_2': 'It's a gateway project.'",
        "'speaker_0': 'Thank you. I also want to thank everyone that's come out this evening as well as written emails. We've received a lot of emails on this issue. I want to thank the owner for taking the time on this and I was able to spend time with him on this.'",
        "'speaker_0': 'I have concerns about the project. I appreciate the comments in regards to the Park Street Gateway District Strategic Plan. I think it does matter when you look at it. It was a ten month process. It was only seven years ago that it was completed.'",
        "'speaker_0': 'I don't think you can disregard it as just a guidance. I think there are actually some very strong statements made in here and I really think it needed to be included in the presentation. I think it should have been shared with the owner back at the beginning of this.'",
        "'speaker_0': 'That document back in 2008 before I was on council, specifically calls out that intersection. Encouraged special corner treatment building design at key locations such as the intersection of Park Street and Blanding Avenue to announce entry to the district and emphasize key aspects of architectural character.'",
        "'speaker_0': 'And then throughout that document there are multiple references of architecture should reflect the high degree of craft. Comments like that. I don't think we can have I don't think our city can have a ten month process. Including many, many community members and input and then discount the entire report is mere guidance.'",
        "'speaker_0': 'I think that is a serious problem. I really think it needed to be and and I am concerned. I think it does need to be shared with the planning board. I think it should have been attached to this when it came to us.'",
        "'speaker_0': 'I don't think we should be dependent upon members of our community that were active in that back in 2008 to bring it to our attention. I do. In regards to our community being green and whatnot, I agree that our community supports green efforts.'",
        "'speaker_0': 'Is there a place for container buildings? I'm not sure. I personally was not asked about the one on South Shore. I don't know what was considered at that time. I know recently the decisions have come to us regarding containers, shipping containers or medicine at the point and they tell and the the feedback back on those projects were'",
        "'speaker_0': 'that they would be as invisible as possible or decorated as nicely as possible so that they were. Somehow presentable and really not seen as shipping containers. And when I look at this project, I don't think it really has passed the hurdle of not being seen as shipping containers.'",
        "'speaker_0': 'I think from an artistic position or a design perspective. If more work were put into this somehow, maybe it would at some point become that it has that potential. I really do like the green aspects. I like having.'",
        "'speaker_0': 'I mean the green as an open areas, the coffee shop aspect. I am concerned that I know we have required elevators in buildings that have like five offices and that this gets around that because there are separate buildings.'",
        "'speaker_0': 'But universal design I think is important for our community. I think it is a value and and it's my understanding that the planning board suggested this building at this angle and there were references. That's like a tower. I don't see it as a tower when I look at it.'",
        "'speaker_0': 'I do see Maggie's as a tower. I think what used to be on this building as a tower. And I actually see that as a building that goes over the sidewalk. And so so I will not be able to support this project.'",
        "'speaker_0': 'And I'm concerned that there has been so much time for the owner with regard to the community effort. Ten month community effort, Park Street, Gateway District Strategic Plan. I think that's a serious problem. With that being said, at this point, I'm going to call the question actually, do we have a motion?'",
        "'speaker_2': 'A.'",
        "'speaker_0': 'This was brought by you?'",
        "'speaker_6': 'Yeah. So. I guess the way to frame the motion is. That. Until I move. Well. Wordsmithing. Assistance would be greatly appreciated. Council does not believes that the findings, as referenced in the three key issues were not met and therefore denies this project.'",
        "'speaker_6': 'Is that.'",
        "'speaker_0': 'Their second.'",
        "'speaker_4': 'Or just.'",
        "'speaker_6': 'Well, actually, I just want to make sure. Does that sound like a correct wordsmithing of this?'",
        "'speaker_0': 'And I'd ask, does it have to be that specific? And it just be that we. Don't adopt. But we don't approve the project. It was approved by the planning board.'",
        "'speaker_3': 'So the question for those that may be inclined to not approve this, are there any changes to the design that may make the project more palatable to you? I mean I mean, is there something that, you know, you said I heard some people say, well, I don't like it.'",
        "'speaker_3': 'I mean, what, if anything, could be done to make you like it more?'",
        "'speaker_6': 'Well well, the answer to that question for me is, as I indicated earlier, is that the project in terms of its massing materials.'",
        "'speaker_2': 'I'll.'",
        "'speaker_6': 'Coloration and all that has to follow. What, in my opinion, is in. The Design Review manual, as well as the Gateway District plan, especially for areas south of planning it. I can't tell you how to design the project other than to say that in my opinion there is a framework in place from which a certain project could'",
        "'speaker_6': 'be crafted. But that framework, in my opinion, does not include. A container project or that swap.'",
        "'speaker_2': 'That a mayor may suggest to Councilmember De Saag that I think that's the to reference the criteria that are described in both those documents to get move to design closer to that and its design only not use. Is what I would support that because I think Mr. Thomas's point is that we can't just say we don't like'",
        "'speaker_2': 'it and go on because then it's a mystery. The point is I support the use. I support the placement, I support the massing. But I've heard enough comment from people. You see it as stacked containers. And while it's intriguing to me, I think the community invested enough time.'",
        "'speaker_2': 'And when the community responds to an issue like this, when it hit the city council agenda so strongly and it wasn't all full of vitriol and trashing, the developer just said, Oh, do we really do you really want to put containers on the corner of Blanding and Park?'",
        "'speaker_2': 'And I think it's on some respect. It's that simple. So the other the executing the fix is I think is complex and has to go back to the design criteria that are in the manual.'",
        "'speaker_0': 'Madumere if I could just add to that member. Ashcroft So I really would like to see some analysis, both from the city attorney and from the planner, from Mr. Thomas about the applicable language. And I, I really am not comfortable with that.'",
        "'speaker_0': 'What seemed to be a conclusion that modern buildings weren't allowed in that area. Because if what we're doing is telling the developer to go back and build a, you know, a Victorian replica or something, I don't I don't think that's realistic.'",
        "'speaker_0': 'So I want to make sure that the guidelines we're following, unfortunately, I didn't have the language in the context to refer to when Councilmember Desai was referring to it. So before I could vote on anything, I would I would want that professional analysis.'",
        "'speaker_0': 'And I mean, I'm not I well, I just want to hear it from the people who work on this day in and day out. And we need a motion to continue our meeting past 11.'",
        "'speaker_2': 'I'll move again.'",
        "'speaker_0': 'All those in favor I. I carry unanimously. Thank you. And Brody.'",
        "'speaker_3': 'May make a better a different suggestion to substitute the motion instead of to deny the project is to revert back to the planning board based on the comments that came out of the council today for some type of redesign.'",
        "'speaker_6': 'Appraisal.'",
        "'speaker_0': 'I like that. Well, and I'd like to though, make it clear that I am looking for a significant redesign. This to me is not.'",
        "'speaker_3': 'The time to make.'",
        "'speaker_0': 'I want to say this. Okay, so when I look at this, I think that it well, and I actually think that we had quite a few very clear comments from speakers today. I think that I would encourage everyone to look at this Park Street Gateway District strategic plan, especially the owner who's trying to do this.'",
        "'speaker_0': 'And I would say every planning board member should be handed this. You cannot have a ten month process and disregard it. It's just that simple to me. But when I look at this, the parts that I like are the openness.'",
        "'speaker_0': 'If it were made out of a different material, or if you take these containers and have them not look like stacked containers, and if you look at container building projects, there are some and we had a speaker speak to that that are beautiful.'",
        "'speaker_0': 'To me, this has not reached that mark.'",
        "'speaker_6': 'So Councilmember Ody, I think had framed emotion that that seems reasonable so if that the motion and all.'",
        "'speaker_2': 'Second there.'",
        "'speaker_6': 'You go.'",
        "'speaker_3': 'Yeah but you know to follow up on the mayor's point, I mean, if if it if it was more camouflage, for lack of a better word, would it matter to you that it was made out of recycled containers?'",
        "'speaker_0': 'So apparently it does because direction is so. So we take buildings and we put facades on them bricks, for instance, wood. And but when I look at the blue and the green, I have spent many hours in a blue container.'",
        "'speaker_0': 'It's an SNL snack shack. If we have been out there, would I say that that's appropriate to put on Park Street? No, I do have an issue with shipping containers being used as storage and visible on Park Street.'",
        "'speaker_0': 'I think that does need to be addressed. We have set the mark high when we talk to other businesses that come in front of us and we tell them that they need to at the point camouflage the containers, I don't think it's appropriate to sit and sit here as a council and send another message that so to'",
        "'speaker_0': 'me they still look like containers. Is there a way to make them not look like containers? Yes, and there are there are models of that out there. To me, this is not that.'",
        "'speaker_3': 'So without prejudging, you'd be open to a redesign of the project, even though it's still made out of the same material that doesn't look like.'",
        "'speaker_0': 'So I appreciate that because to me it's just a material. It's a material we're being asked to use. I don't have a problem with using steel as a as a as a building material when it looks like shipping containers stacked.'",
        "'speaker_0': 'I think that's why we're getting so much pushback from the community. And yet I think that there can be work. So the design actually I don't have a problem with I think if there's a way to manipulate so it doesn't look like shipping container stack I.'",
        "'speaker_0': 'Have a problem with the two that are extending over the sidewalk. That to me, it looks like Legos. I, I know some people may think that that is adds to the architecture. I don't personally.'",
        "'speaker_3': 'So something like, you know, instead of the I'm sorry, the, the, the blue I mean, I don't particular care for the blue, but, you know, it is what it is. I mean, if instead of the blue there is maybe windows, I think we're at the bottom.'",
        "'speaker_0': 'Or so I've given some feedback to the owner myself. Okay. Um, you go to Chicago, there's a being is very bright silver it is. And a piece of art to me. People love it. So I'm not to me, I'm not sure that.'",
        "'speaker_0': 'You couldn't make it more artsy and have it work that maybe it's because it's this in between trying to make it look like a building but also and still contain or I'm not sure. Maybe so but I would suggest that I had had suggested before to the owner is reaching out to the people that came and had'",
        "'speaker_0': 'concerns and I see them as reasonable people and I actually think that we could look at this and try it now. I think it maybe it needs some curves added to it. Some when you look at the architecture of the buildings that we like, it's not all straight lines.'",
        "'speaker_0': 'And what's been added here are windows with straight lines. To me, it's it could be softened with curves. If you look at the bridge, it's steel, but it has curves and there aren't any curves in this design. So if I could just add.'",
        "'speaker_3': 'In, those are very good suggestions I would agree.'",
        "'speaker_0': 'With. Insert a comment. I think we should also leave it to the developer if he wants to take another shot at this to perhaps go forward not using containers at all. Because I it's kind of the way I feel about trying to make a new building look old, you know.'",
        "'speaker_0': 'FAUX So maybe he wants to start over with different materials. I think just taking notes on the the the speakers that there was enough outcry over the fact that shipping containers were there in the park on the corner of Park Street and planning on say, I can't quite see how you add curves to shipping containers.'",
        "'speaker_0': 'So if we're concerned about not letting shipping containers used for storage, so on the street front, maybe, maybe it's time to move away from the shipping containers altogether. But I think that's the sort of thing the developer and planning staff and eventually the planning board can work on.'",
        "'speaker_3': 'And it was a sizable amount of people that said yes to this too. So, I mean, let's just not say that it was an overwhelming and, you know, denial by the community. I mean.'",
        "'speaker_0': 'I still think at the end of the day, it's the the project sponsor, the owner of the property and the person who's investing his capital and his time and who who should have the ultimate say. So good to have a lot of feedback, but my mind also counts.'",
        "'speaker_3': 'I just don't want him to go back and do something and I'm sorry. And then, you know, have us rejected again after we gave him direction. I mean, that's.'",
        "'speaker_0': 'My and I appreciate that. Is there anyone else would like to share additional comments at this time? Mr. Thomas.'",
        "'speaker_7': 'I just want to make I don't want to belabor this. We you the to the mayor and household member talking about how you might change it to make it more acceptable. But when I'm hearing you talk, I'm still imagining and I can imagine it.'",
        "'speaker_7': 'It's still a modern design. If I just think it might be helpful for the applicant and me to hear if you have a fundamental problem with a modern design, that would be good to know.'",
        "'speaker_6': 'Now let us be clear to modern, amusing, modern, in the sense of a specific architectural style that's late. And in our urban design manual, we lay out specific types of architectural styles. So modern doesn't necessarily mean any building built.'",
        "'speaker_6': 'In 2014, for example, there could be building 49, 2050. There could be a building built in 2016 that has kind of kind of a historic quality to it. But because it was built in 2016, one could call it modern.'",
        "'speaker_6': 'But the issue isn't the time in which it was built. It was the issue is the style in which it was built. And the Urban Design Manual is clear as to modern as being an architectural style.'",
        "'speaker_7': 'And I'm thinking that you're looking for an architectural style that's not modern.'",
        "'speaker_6': 'That there are the nine or so listed acceptable styles.'",
        "'speaker_0': 'That the rest of us might think. Yeah, the rest of you can speak if you want to answer that in regards to did you want your. Okay. So I personally am not opposed to a modern design. I don't see how that's addressed here in this the Park Street Gateway District Strategic Plan.'",
        "'speaker_0': 'If that was a eliminate that it can't be there. What but I take note of is should reflect the high degree of craft that's indicative of this past and forms the foundation for its future. That is the sentence here.'",
        "'speaker_0': 'So.'",
        "'speaker_7': 'Okay. I that's. I'm glad you said that.'",
        "'speaker_2': 'I just.'",
        "'speaker_3': 'I mean, could we bring back that design manual to fix whatever flaw? Councilmember Desai thinks there is in it.'",
        "'speaker_2': 'Or.'",
        "'speaker_0': 'The planning?'",
        "'speaker_7': 'Yes, well, we certainly can. I think that this has been a very helpful we'll go back to the planning board with the applicant. Hopefully they will be willing to continue this dialog with us. And if the planning board and that that process, the planning board says, look, we need to clean up this manual just so it's clear'",
        "'speaker_7': 'in the future as well. And or and staff will spend more time looking at to we might very well just package the two together and.'",
        "'speaker_6': 'Let me make sure to finally say, though, I do not not oppose modern art. The issue is not what style is appropriate. To me. The issue has always been what has been the planning process that says what is appropriate where.'",
        "'speaker_6': 'And in my opinion that. Modern is supposed to be north of Blanding Avenue.'",
        "'speaker_7': 'And as long as the community discusses it, yeah, the potential amendments and everybody seems to be on board. The process is respected. The new council decides, you know what, we're going to make some changes to our annual clarify our current expectations.'",
        "'speaker_3': 'And then one final point. I mean, I realize a lot of work went into the gateway, you know, plan. But in 2008, you know, it was also the plan of the city to build 6000 homes at Alameda Point, the sun cow.'",
        "'speaker_3': 'So the community changes. And even though six years ago or seven years ago may seem like a short time ago or some type of things, it is a long time ago.'",
        "'speaker_0': 'And I remember Ashcraft I have a question slash comment said this north of Blanding and no modern except south of planning. But what architectural style would you describe the perforce office building is? Not the Little House Cafe, but that's also Blanding, right?'",
        "'speaker_2': 'Not in the gateway.'",
        "'speaker_6': 'But it's not the Gateway District.'",
        "'speaker_0': 'Isn't it, on both sides, because it's that far from the corner.'",
        "'speaker_7': 'It sits on a town.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Okay. And the Salvation Army building, that would be.'",
        "'speaker_6': 'And also also keep in mind the the.'",
        "'speaker_0': 'But what store.'",
        "'speaker_6': 'Force building is in the zoning where the are the things says modern is appropriate for that zoning.'",
        "'speaker_0': 'And then the Salvation Army building.'",
        "'speaker_6': 'That's eight way.'",
        "'speaker_2': 'Or on the finger of Parkes.'",
        "'speaker_0': 'All right, so we have a motion. And a second. Someone on repeat the motion.'",
        "'speaker_1': 'Oh, do you want me to repeat it?'",
        "'speaker_4': 'Yes, that'd be great.'",
        "'speaker_1': 'So the emotion, the motion was amended to refer the matter back to the planning board based on the Council comments for redesign.'",
        "'speaker_0': 'All right.'",
        "'speaker_4': 'So that's. Yes. That's good.'",
        "'speaker_7': 'Enough. I think just to add just to add confirming the use permit findings, I mean, you're okay with the use permit design review findings. You're not just so it's very clear for them and for that planning board. Right.'",
        "'speaker_7': 'You like the uses. I think you like the uses. Don't worry about that. It's the architectural design of this building that needs to be.'",
        "'speaker_0': 'And in regards to the use it's one resident. So. Mr. Thomas in regards to the uses it allows for residential must because there's one residential unit.'",
        "'speaker_7': 'No, no. The use permit deals with the mix of uses and specifically the office uses. So all by referring it back, you're referring the entire thing back. And what you're saying for the record, for everybody here and for the planning board and the applicant.'",
        "'speaker_7': 'We're good with the findings. We're not referring it back because we can't make the use permit findings. We can make those findings. It's the design review findings because of the architectural style. So go back and work on those.'",
        "'speaker_0': 'And the other comments, all of them favor. I oppose motion passes unanimously. Thank you.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'All right.'",
        "'speaker_2': 'I still think.'",
        "'speaker_0': 'My. All right. Next. Next item, City Manager Communications.'",
        "'speaker_4': 'Thank you, Madam Mayor. I just want to let folks know that starting Tuesday, December 8th, will be.'",
        "'speaker_0': 'I'm going to call for a short recess.'",
        "'speaker_4': 'All right. Good. Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_2': 'Thank you. I know my hearing.'",
        "'speaker_0': 'Thinking about doing our.'",
        "'speaker_2': 'Was it?'",
        "'speaker_1': 'Oh, he's doing. Did he manage.'",
        "'speaker_2': 'This to give a report?'",
        "'speaker_0': 'Yeah. Right. And we're going to resume. City Manager Communications.'"
    ]
}