{
    "Adoption of Resolutions Authorizing the City of Alameda and the Alameda Public Financing Authority to Commence Proceedings in Connection with the Substitution of the Letter of Credit relating to the Alameda Public Financing Authority Variable Rate Demand Revenue Bonds, 2003 Series A and Series B (Alameda Point Improvement Project). [City Council and APFA] (Finance 10024051)": [
        "'speaker_1': 'The finance director and Bond Staff Balance Council. And I believe the letter of creditors is also joining. So they are coming in momentarily.'",
        "'speaker_0': 'Coming in. Okay, great. I see Ms.. TOS name on the screen and now I see her in person. Welcome. Hi.'",
        "'speaker_4': 'Thank you. Good. Good evening.'",
        "'speaker_1': 'Mayor. And some members of the City Council. My name is Anita.'",
        "'speaker_4': 'I'm here to present this item for you tonight. With me tonight is also.'",
        "'speaker_1': 'Up on council.'",
        "'speaker_4': 'Ryan Quinn, as well as members from.'",
        "'speaker_1': 'Wells Fargo team who are here to answer any questions you may have. Just a little bit of background in April of 2016. Union Bank was hired by the city to.'",
        "'speaker_4': 'Provide a letter of credit for the Alameda Public Financing Authority Variable Rate Demand Bonds known as Alameda Point Improvement Project.'",
        "'speaker_1': 'For $9,080,000.23 Series A and 4,000,003 360,000.'",
        "'speaker_4': 'For the 2003 Series.'",
        "'speaker_1': 'B bonds for the taxable taxable bonds.'",
        "'speaker_4': 'As background, Alameda Public Financing Authority issued a total of approximately 12.4 million and variable rate bonds.'",
        "'speaker_1': 'Related to allow me to point in 2003, the source of repayment for these bonds as a rental income received from properties managed by the city's Base Reuse Department. Union Bank expired in.'",
        "'speaker_4': 'The LLC, with Union.'",
        "'speaker_1': 'Bank expire in June 14 of 2021. Fortunately, the city was able to receive an extension until November 15, 2021. With that extension, however, Union Bank increased the fee from 115 basis point to 125 basis points.'",
        "'speaker_4': 'Plus they charge a one time fee of 5000 for the one time extension.'",
        "'speaker_1': 'Union Bank has told us that they will not extend the LLC beyond the November 2021 expiration date. The market for the city's LLC is very limited because of the small size of the outstanding bonds. Typically, banks prefer large deals so they can.'",
        "'speaker_4': 'Fine spread the cost of the.'",
        "'speaker_1': 'Transaction over the size of the bonds. So the city reach out to other banks about providing a.'",
        "'speaker_4': 'Letter of credit only.'",
        "'speaker_1': 'To banks to express interest.'",
        "'speaker_4': 'U.S. Bank in Wells Fargo.'",
        "'speaker_1': 'Wells Fargo stepped.'",
        "'speaker_4': 'Up and submitted a term sheet which offer a three year.'",
        "'speaker_1': 'LLC at 100 basis points to the city. So is my.'",
        "'speaker_4': 'Recommendation that we proceed with the substitution of the letter of credit. A bond counsel, Brian Quinn, is here to answer.'",
        "'speaker_1': 'Any questions that you may have. Thank you very much.'",
        "'speaker_0': 'Thank you for that clear and concise report. Ms.. TA And Madam Clerk, I meant to ask, do we have public speakers on this item?'",
        "'speaker_1': 'We do not.'",
        "'speaker_0': 'Okay, so I'll close public comment. So then, counsel, I will open the floor to counsel for any clarifying questions for a motion. What's your pleasure? By my count, from every next flight.'",
        "'speaker_3': 'I'd be happy to move approval of the staff provider resolutions.'",
        "'speaker_0': 'All right, Councilmember Spencer. All right. Any further council discussion? All right. We really appreciate all you representatives of Wells Fargo, Aspen Council for being here. Welcome. We'll get you home early tonight. Okay. So seeing no discussion. Madam, may we have a roll call vote, please.'",
        "'speaker_1': 'So, member day. Thank. Yes. Herrera Spencer. I knocked like.'",
        "'speaker_3': 'High.'",
        "'speaker_1': 'Villa. I may or as the ashtray.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'That carries by five.'",
        "'speaker_0': 'All right. Thank you. Thank you, Mr. Two. Thank you to our guests. And we look forward to to working with you going forward. All right. That set a record for the. I hope that's a trend that is just starting to play out tonight.'",
        "'speaker_0': 'Garrett, thank you all. Good evening. All right. So then I'm going to adjourn that special joint meeting of City Council and Alameda Public Financing Authority. And we will move on to the regular city council meeting and may we have the roll call please.'",
        "'speaker_1': 'Welcome has been voted five present and there are 64 attendees on the zoom.'",
        "'speaker_0': 'Thank you for remembering to say that. All right.'",
        "'speaker_1': '64 I'm at 55 change just out and I said it wrong do.'",
        "'speaker_0': 'That was because the Wells Fargo crew left and took their entourage with them I guess. But anyway. Our next item is item two agenda changes. Do we have any agenda changes? Council member. Not quite. I see your hand up.'"
    ],
    "Consider Adopting a Resolution Calling on the State Legislature to Implement a Ban on Medically Unnecessary Animal Surgery, Such as Declawing of Cats.  (Councilmember Knox White)": [
        "'speaker_0': 'Perfect. All right, so, council member Knox, right? This is your referral. Take it away.'",
        "'speaker_3': 'Thank you. So I'm going to be very short and short of singing the praises of a whiskey who I believe is here tonight and has some comments that she's prepared. As I said, she came forth in June with a proposal for an ordinance that would allow would have the city ban decline.'",
        "'speaker_3': 'After some quick conversation with the city staff, it turns out that cities are no longer allowed to do that in California. So we worked together to put together a resolution to the state legislature that is before us tonight asking the state legislature to enact this.'",
        "'speaker_3': 'They they've taken that right away from us. I just want to acknowledge how incredible it was to work with Miss Lasky. You know, just every word in the resolution is hers. We made two I mean, two very tiny little things.'",
        "'speaker_3': 'She did all the research. It was about the easiest referral I've ever done because I didn't have to do anything. And I just want to share my great appreciation for her. So anyway, I don't know. I saw that she had her hand up, but it looks.'",
        "'speaker_0': 'Yeah, yeah. Let's get it back.'",
        "'speaker_1': 'Yeah. Sorry we promoted her prematurely, but yes, we will protect her. Well, and.'",
        "'speaker_0': 'I was just going to chime in and say that I think sometime in the summer I had or maybe spring, I had the privilege of doing a zoom with Miss Solecki and her teacher at Wood Middle School. There's a class, actually, Ms..'",
        "'speaker_0': 'Hill, as I mentioned, the class, it's pretty cool that that she took, but yeah, she really ran with this item. So let's hear from Ms.. Husky.'",
        "'speaker_1': 'Good evening, council members and staff. And thank you, Council Member Knox White for allowing me your time. I'm here once again to ask for your assistance to ban the cruel act of cat decline. This procedure causes only lifelong pain and suffering to our beloved felines, and we need to agree to end this procedure.'",
        "'speaker_1': 'A yes vote tonight will ensure the following the safety of our cats, the education of the public, and how important this issue was. And to prove that Alameda takes animal rights seriously, Alameda will be leading the way by supporting this resolution and bringing attention.'",
        "'speaker_1': 'Bringing this attention to the state level. Please vote yes to pass this resolution. Thank you for your time.'",
        "'speaker_0': 'Thank you. Solecki, before you sign off. Remind us, what grade are you in this year?'",
        "'speaker_4': 'I'm in seventh grade.'",
        "'speaker_0': 'Pretty impressive. Hi, everybody. I'm impressed. All right, so the so the the referral is before us. Any council discussion or do we have a motion to approve? Vice Mayor Vella.'",
        "'speaker_1': 'I'd like to move the approval.'",
        "'speaker_0': 'We have a motion to approve by Vice Mayor Vella. Councilor Harris Spencer thank you.'",
        "'speaker_4': 'I am happy this second.'",
        "'speaker_0': 'Seconded by Councilmember Harry Spencer. We didn't have council discussion before, so I think we're ready for a vote. Madam Clerk.'",
        "'speaker_1': 'Councilmember de SAG I. Herrera Spencer, I. Knox White.'",
        "'speaker_3': 'Great appreciation. Ella, I.'",
        "'speaker_1': 'Bella. Hi. Mayor, as you Ashcraft High. That carries by five eyes. Yay!'",
        "'speaker_0': 'Good work.'",
        "'speaker_4': 'Ally.'"
    ],
    "Mayors Nominations for Appointment to the Commission on Persons with Disabilities and Housing Authority Board of Commissioners.": [
        "'speaker_0': 'All right. Thank you. Thank you so much for that. And then, councilor, we're going to slide.'",
        "'speaker_4': 'Right into.'",
        "'speaker_0': 'My item. And not my item are item 11, which are my nominations to the Commission on Persons with Disabilities. And I am happy to report that I have three impressive nominees and I just want to give shout out my appreciation to our community.'",
        "'speaker_0': 'I am just overwhelmed by the amount, the quality, the quantity and quality of applications. I'm getting to all of our boards and commissions. These decisions aren't easy. I'm really touched by people's commitment. They just desire to serve their community, to lend their time and talents.'",
        "'speaker_0': 'So what I'm doing, my recommendations are that we reappoint two of the incumbents and then appoint a new individual. And so whenever incumbents is Lisa Hall Lisa has a wide range of experience with disability issues, including from a personal basis, from working with a parent.'",
        "'speaker_0': 'She has done a lot of work with our less privileged individuals for many years, found Christ Episcopal Church as food bank program and does work with our Rantoul community and she has served a term on the commission with persons in just with a commission on persons with disabilities would like to serve in others.'",
        "'speaker_0': 'She is one of my nominees and the next nominee is us. And this is in no particular order. It's in the order in which they were interviewed. Jennifer Rohloff is another incumbent and Jennifer has a brother. Her younger brother has special needs, lives in a group home in the area.'",
        "'speaker_0': 'But Jennifer, from a young age, in part because of her commitment, in part because her mother was a teacher in the school district, she was actually called upon and agreed to be a tutor in special ed classes when she was in elementary school.'",
        "'speaker_0': 'She remembers tutoring in Neil Tam's special ed class, and Mr. Tam is a revered educator. Then the late Neil Tam, his friends and family are still in the that community, but he was a special ed teacher before he became a principal.'",
        "'speaker_0': 'Jennifer has served on the board of class in house, which trains and provides employees with special needs folks that serve you at Safeway and other other establishments. And she's said she is a very passionate advocate for persons with disabilities.'",
        "'speaker_0': 'And then my third and newbie appointee is named Katie Beeler. And Katie is well, I'll just give you a little, little background. She actually applied to serve on the library board, but I was so, so taken with the description she put in her her application that I reached out and said, would you possibly consider serving on the'",
        "'speaker_0': 'Commission of Persons with Disabilities? Arranged for her to meet with Sarah Henry, our public information officer, who also staffs that commission. And so she's Katie Bieler, who works in the publishing industry. In particular, she is project manager on global literacy and education for a company, an independent publishers group, where she oversees publications for persons with reading challenges'",
        "'speaker_0': ', whether they're visually impaired, have dyslexia, ADHD. And she says that after 15 years in the publishing industry, my passion for equitable access to information led me to my current role, where I create software products for people with print reading disabilities.'",
        "'speaker_0': 'She's currently the president of the Bay Area Women in Publishing. She also has a master's degree in Jewish art and in visual culture from the. Jewish Theological Seminary of America, as well as bachelor's degree in History of Art from University of Michigan and another and another bachelor's degree in anthropology from University of Michigan.'",
        "'speaker_0': 'And she's excited to join this commission. So that's just an introduction. At our next meeting, we'll have a chance to vote on their nominations, but I just wanted to introduce them to you. Thank you, all of you, everyone who applied and those who were nominated.'",
        "'speaker_0': 'And we look forward to voting on your nominations next week. So thank you very much. And now we will move on to item three. And item three is proclamation, special orders and announcements. And there are two proclamations, one I'm going to read this evening.'",
        "'speaker_0': 'The other one will will be posted on the website and go in the record. But I wanted to read our proclamation recognizing declaring September 15 through October 15, 2021 to be National Hispanic Heritage Month. So here's our proclamation.'"
    ],
    "Recommendation to Authorize the City Manager to Negotiate and Execute an Agreement with Alameda Family Services for an Amount Not to Exceed $500,000 for One-Year, with an Option to Extend for an Additional Year for an Amount Not To Exceed $1,000,000 for Two-Years, to Provide for Mental Health Services Related to the Citys Alternative Response to Calls for Mental Health Crisis Support Pilot Program. (City Manager 10021030)": [
        "'speaker_1': 'Recommendation to authorize the city manager to negotiate and execute an agreement with Alameda Family Services for an amount not to exceed $500,000 for one year, with an option to extend for an additional year for an amount not to exceed 1 million for two years.'",
        "'speaker_1': 'To provide for mental health services related to the city's alternative response to calls for mental health crisis support pilot program.'",
        "'speaker_0': 'Okay, thank you very much. And Assistant City Manager Jerry Bowden. Are you presenting tonight?'",
        "'speaker_3': 'I am.'",
        "'speaker_0': 'Yes. Thank you. Welcome.'",
        "'speaker_3': 'Thank you so much. And Laura's has a presentation for us this evening as well. So that'll come up as we go. Good evening, Mayor. As he Ashcraft, Vice Mayor Vela and members of the city council. It's great to be with you tonight to basically put together another piece in our puzzle, which is our alternative response to mental'",
        "'speaker_3': 'health crisis calls in the city of Alameda. Next slide. You'll recall that the city council authorized a pilot program in July. Since that time, we've been working to address a number of different components for this program the required personnel, the training needs, dispatch processes, modifications for a new vehicle that will help the program, the the first responders'",
        "'speaker_3': 'get around in our community. In addition to working with our county partners, with EMS, as well as with county health, to secure the necessary approvals to launch our pilot. And where we're in those negotiations as we as we bring this forward for your consideration this evening.'",
        "'speaker_3': 'A critical step is identifying and getting authorization from the city council to enter into an agreement with that mental health support partner, which is really why we're here tonight. Next slide, please. Thank you. After council direction in July, we did put an RFP out.'",
        "'speaker_3': 'In August, we received one proposal from Alameda Family Services. After reviewing the proposal, we we did. We did sit down and discussed the needs of the program. We ended up with a revised proposal. And we're recommending a combination of options, one A and one C from that proposal.'",
        "'speaker_3': 'From that revised proposal, it is a combination option. It summarized in a fairly high level on this slide. Note that there would be two full time staff people involved in the program. There'd be the program supervisor and the crisis response case manager.'",
        "'speaker_3': 'You can also see that there would be several part time FTE positions that would come from the Alameda Family Services Group to be able to support all of the needs of the pilot program. And this is on a 24 seven basis.'",
        "'speaker_3': 'And the cost estimate that we put together for the program is in the $400,000 per year range. And I'll talk a little bit more about that number and how it relates to the staff recommendation in a moment. Next slide.'",
        "'speaker_3': 'Just stepping back from all of the details just for a moment, the AFS proposal did set out to achieve seven goals which are listed on the slide. I won't go through them individually, but just to summarize, the really is an effort in building a strong relationship between Alameda Family Services and city staff for this program, including seeking'",
        "'speaker_3': 'out training opportunities for for our fire department personnel and possibly other training opportunities as well. Also assisting our community members who are in need of these these support services. So making the case management component is critical, linking folks to services in a timely fashion and then following up to ensure that the services are being utilized appropriately and'",
        "'speaker_3': 'as necessary is an important part of the program. Finally, the overarching goal here is to reduce traditional police interventions with respect to calls for certain kinds of mental health crisis in our community. And so all of these things start to form what could be what can be metrics for the program.'",
        "'speaker_3': 'Obviously, our firefighters, the fire department, EMT, paramedics, we're going to need to to also come to that that metrics discussion and we'll get into that as well. As the program continues to develop and before we go live. So I'll say next slide.'",
        "'speaker_3': 'Thank you. The proposal from Alameda Family Services was was very responsive relative to the the support services and the follow up care that was contemplated in the request for proposals that was sent out. There were three primary options in that in that proposal.'",
        "'speaker_3': 'Options one, A, B and C, they did allow for a range of service levels and coverage days and hours to be able to to craft different options, as I mentioned earlier, to provide a pretty robust program right out of the gate.'",
        "'speaker_3': 'Staff is recommending a combination of options one C, one A and one C. And what that does is it allows for 24, seven, seven coverage from from the start of the program, including access to an on call licensed clinician during non-business hours, which it would be unique for our county and something that that would would set us'",
        "'speaker_3': 'apart from many other programs that that particularly that are in the earlier stages of development. The cost for that option was refined by all media, family services staff after talking with city staff about how to best meet the needs of the community as we get going.'",
        "'speaker_3': 'But also but also just managing the costs of the program. So you'll see on this slide that when you combine options one and one see the total is about $550,000. But we did discuss how we could streamline the staffing and manage the the kind of the outside overhead or support that's necessary.'",
        "'speaker_3': 'So that number does now come in just under $400,000 a year. In the recommendation, we're suggesting, a, not to exceed amount of $500,000. That extra $100,000 just allows us some wiggle room. It is a pilot and we want to make sure that we can keep it all up and running, particularly as we hire staff and and move'",
        "'speaker_3': 'forward. There is there is also. A budget allocation that has been made that supports this number. So it is it is something that was contemplated as part of our two year budget process. Next slide. Of course, the pilot is an attempt to address the the the direction provided to date on this topic.'",
        "'speaker_3': 'As contemplated, the program would be led by the fire department and this is its approach does need mental health expertize to support the fire department's field work. That is something that is is we're discussing with our county health partners and something that we think is a critical component for the overall pilot success.'",
        "'speaker_3': 'And so what I'll say is if council would like to consider alternatives to the staff recommendation, recommendation this evening, here are some options that we included in the staff report. Just pursuing other options within the Alameda Family Services proposal, something like not going for a 24 seven model right out of the gate might be something that we'",
        "'speaker_3': 'could pull from that alternative. Directing staff to evaluate other community based organizations or mental health support options that would meet this need for our pilot program is another alternative. There's also support for the pilot program, but concerns about authorization for for the second year.'",
        "'speaker_3': 'And if that is a concern, then council might consider authorizing just one year rather than one year with the option for the second year. And of course, we can always redo the request for proposal process with a modified scope of work.'",
        "'speaker_3': 'If the items that are proposed in the in the of Family Services proposal aren't meeting the needs or the, the, the, the desired outcomes that the community is looking for. So next slide. Now, with all that being said, at this time, staff is recommending that the city council authorize the city manager to negotiate and execute an agreement'",
        "'speaker_3': 'with Alameda Family Services for an amount not to exceed $500,000 for the for the first the first year with an option to extend for an additional year in an amount not to exceed $1 million. This option would allow us to spend the next year or possibly two evaluating those those needs in our community.'",
        "'speaker_3': 'We would anticipate regular updates with the City Council and the community and city staff, as well as the leadership from Alameda Family Services are here this evening to answer any questions you may have. That concludes staff's presentation this evening.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Burton. And I want to particularly thank our assistant city manager, Jerry Byrd. And he has done the majority of the heavy lifting on putting this proposal together, and I thank him for bringing that forward. I want to share a concern that I have at the outset.'",
        "'speaker_0': 'And then we will certainly hear from many public comments and staff and council questions of staff and council comments. But my concern is that this proposal really isn't ready to be brought forward for a number of reasons, starting maybe from the back.'",
        "'speaker_0': 'We're being asked to provide, to approve, to give the city manager authority to enter into a services provider agreement. And there is indeed an agreement that is in attachment to this agenda item and it references the services to be performed.'",
        "'speaker_0': 'And I'm on I am for anyone who wants to follow along the the draft agreement is exhibit three and at the bottom of page one of exhibit three services to be performed and there's a paragraph and it talks about that the provider shall do all the necessary work included in Exhibit A as requested.'",
        "'speaker_0': 'The only problem is that there is no Exhibit A and it's not an attachment to this staff report. And in fact, what I've learned from talking to staff is that there just wasn't time to put it together because there's still so much that needs to be done in terms of getting approvals by the county.'",
        "'speaker_0': 'And the other thing that concerns me is that the the RFP that went out and again, a lot of people spent time on this, I acknowledge the work of our fire department, but it's a very generic RFP. It was put together by fire that has no experience in this area.'",
        "'speaker_0': 'In fact, they're awaiting their own mental health training. And so that rather generic RFP yielded one response. And I have a few concerns with that response. But in the interim, because we're kind of, you know, just learning more as we go along.'",
        "'speaker_0': 'So I mentioned earlier we've had great public response to. Board and commission applications. And I hear from very talented residents all the time. And one day I got a phone call in an email from a resident who works for San Mateo County, where this individual set up Santa Clara County's mental health response to assist with their first'",
        "'speaker_0': 'responders. And they very graciously said we'd be happy to to meet with city staff. And so I immediately directed them to city manager and assistant city manager who have been in conversation. My suggestion would be, I know we gave the city manager a deadline to get this done by the end of the year, but I think it's'",
        "'speaker_0': 'even more important to get it right. I would like to see another RFP issued, the RFP reissued, but this time to have it drafted in consultation with someone with actual relevant experience. And there's other possibilities, folks from county behavioral health care services.'",
        "'speaker_0': 'But and then to reissue the RFP anyone is is welcome to apply or reapply and this time we have a new fire chief who's about to start, I believe, next month. And that individual should be part of the selection process.'",
        "'speaker_0': 'But I am concerned that we're asked to approve the services provider agreement. I have a few concerns with what's in it, even the part that that doesn't exist, the Exhibit A But I think that this is premature. We should give staff a little more time to come back to us because it's more important to get this done'",
        "'speaker_0': 'right than to get it done fast. And the last thing I'll just throw in a concern that I had reading over how many family services proposal is that they won't work with anyone who is violent or has engaged in in criminal activity.'",
        "'speaker_0': 'And so the so for nonviolent non-criminal service calls. But that leaves kind of a wide gap. There are times, I think, when police do need someone with with clinical experience to be out there as a backup, certainly in a safe situation.'",
        "'speaker_0': 'But anyway, I just.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Think we we need to take a little more time and a little more put a little more experience into this proposal. So, Councilmember Herrera Spencer.'",
        "'speaker_4': 'Thank you, Mayor. I believe that was at this time we're normally having clarifying questions and then public comment and then our comments and I would like to proceed with the item is agenda.'",
        "'speaker_0': 'I raised that my concern just that I think we might be getting into brown actor open government commission problem territory and I wanted to flag that at the outset, but I have done just that. So, Madam Clerk, do we have public speakers?'",
        "'speaker_1': 'Yes, we have two.'",
        "'speaker_0': 'Okay. So at this time, let's hear any clarifying questions from the council. And I'm sorry, what was that?'",
        "'speaker_1': 'That many people just raised their hand just to age seven.'",
        "'speaker_0': 'Okay. Okay. So that means 2 minutes for public speaker. Okay. Okay. So let's take clarifying questions now and then we will get to our public speakers. Any clarifying questions of Mr. Bowden? Okay. Let's go ahead. And I don't see anybody's hand up, so let's go ahead and take our public speakers, Madam Clerk.'",
        "'speaker_0': 'And so that is 2 minutes per speaker.'",
        "'speaker_1': 'And the first one is Aaron Frazier.'",
        "'speaker_0': 'Thank you. Good evening, Speaker Frazier.'",
        "'speaker_3': 'Evening, Madam Mayor and Council Members. First, I just wanted to echo Councilmember Herb Spencer's point that my understanding of the rules of the meeting are the Council comments are reserved for after the public comment and for the period before public comments for clarifying questions, which I didn't hear.'",
        "'speaker_3': 'I wanted to speak in support of my fellow former committee member, Catherine Schwartz, who is the executive director of AMI Family Services and in support of staff's proposal to engage with healthy family services as an important first step.'",
        "'speaker_3': 'Further delay is an is an unjustified extension of the status quo. That is simply unacceptable. Several people have died in Alameda police custody, including one on this council's watch. And because of this council's inaction. Inaction. It is time to act.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Elise Castro.'",
        "'speaker_0': 'Good evening, Speaker Castro. You're still muted.'",
        "'speaker_1': 'Thank you so much. I am. Yes. My name is Elise Castro and I am speaking in favor of crisis mental health pilot with an emphasis on the pilot with Alameda Family Services. Many of you know me as a high school principal here in Alameda Unified for about ten years, mostly at Island High School.'",
        "'speaker_1': 'And it was my involvement with Alameda Unified and with our highest risk students here on the island that led me to become involved with Alameda Family Services. And I really want to speak to my experience with this organization as a partner.'",
        "'speaker_1': 'I am, and I know that Alameda Family Services is a particularly effective partner for a pilot because I piloted a number of really innovators services with them and they are uniquely positioned to really respond to the wraparound supports that we hear so much from the chief that we hear so much in these council meetings about meeting, we'",
        "'speaker_1': 'have worked together to divert youth from the justice system to intervene and support families that are dealing with gun violence, dealing with addiction, dealing with domestic violence and many mental health needs. And the Alameda Family Services has continued to step up during the pandemic.'",
        "'speaker_1': 'And there are. You know, it's it's a hard job, but making it fit in any community is going to require some. Somebody that knows the community that is deeply tied in, that has the established history of providing the intervention and diversion that's evidence based and trauma informed.'",
        "'speaker_1': 'And Almeida Family Services is plugged in to the needs and resources in this community in a way that no other agency is. And they have the multilingual, multicultural staff to support equitable access to the quality of life and the community that we value in Alameda.'",
        "'speaker_1': 'And you couldn't find a better partner for a pilot.'",
        "'speaker_0': 'Thank you. Her next speaker.'",
        "'speaker_1': 'Lisa Anderson.'",
        "'speaker_0': 'Good evening, Speaker Anderson.'",
        "'speaker_1': 'That evening. I'm kind of astounded to hear you, Mayor, say that you are in favor of delaying this further. Just a few weeks ago, you were in favor of handing out $2 million to institute some sort of pilot program in our city.'",
        "'speaker_1': 'And I just mean further delays will result in more harm in our community. I, for one, greatly appreciate the very detailed proposal from us. This should more detail and clear forward language than the previous proposal that had more than double the budget.'",
        "'speaker_1': 'I'm only here. I was only here to support the staff recommendation to adopt an option that offers a 24 seven option for care. Having recently started with MH first in Oakland, I can say that the need for a program like this is not is out there and the need is not Monday through Friday 9 to 5.'",
        "'speaker_1': 'I truly hope that this will be considered and is just the beginning of our city's efforts to limit police contact with our vulnerable neighbors and to financially committing to a true mental health response in our community. My only criticism was that the budgeting for this program was too low.'",
        "'speaker_1': 'If we're taking responsible responsibility away from APD, we should be able to reduce their funding in a corresponding amount. However, we can prevent another Mario Gonzalez from being killed in our neighborhood. Just do the right thing. It's.'",
        "'speaker_0': 'Thank you, Speaker Anderson. Our next speaker.'",
        "'speaker_1': 'Marilyn Rothman.'",
        "'speaker_0': 'Good evening, Speaker Rothman.'",
        "'speaker_4': 'Hello again. I agree with Janiece that this absolutely has to be a 24 seven kind of program. Even though they said they stay laid on one day a week, it's not late enough. You know, half of the problems are when most of us are sleeping this kind, this kind of program.'",
        "'speaker_4': 'Would actually help crime, the prevention of crime, because it's obvious that all the crime statistics have gone up because of the pandemic and people's lack of housing, lack of work. That's why crime goes up. It's not just in Alameda.'",
        "'speaker_4': 'It's all over. And we need a strong 24/7 response by non-police to incidents that happen in order.'",
        "'speaker_1': 'To.'",
        "'speaker_4': 'Stop. More of this happening. I. Yeah. I guess that's all I want to say. Thank you.'",
        "'speaker_0': 'Thank you. If we could hold for just a minute, I just got a text from our vice mayor, Willie Avila, who inadvertently got kicked off a zoom. Can you see if we can get her back on?'",
        "'speaker_1': 'Yes. She texted me, too, and I'm as she's calling me. So let me work on it right now. All right.'",
        "'speaker_0': 'Sorry about this. We sometimes have technical difficulties. But it's an important discussion and I want our entire council to be present. And there's the vice mayor connecting to audio.'",
        "'speaker_1': 'She did it all on her own. She rebooted and fixed everything. Right.'",
        "'speaker_0': 'Yeah. Okay. So, um, but I believe we finished the previous year.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Okay. Thank you. The next speaker, then.'",
        "'speaker_1': 'Jennifer Rakowski.'",
        "'speaker_0': 'Good evening, Speaker Rakowski.'",
        "'speaker_1': 'I mean, they.'",
        "'speaker_4': 'Is she.'",
        "'speaker_0': 'Is she connected?'",
        "'speaker_1': 'She disappeared. So now we have Jonna struggling. So why don't we take Baker Saigon?'",
        "'speaker_0': 'Okay. All right. Good evening.'",
        "'speaker_3': 'Good evening, Madam Mayor and council members. Thank you for the opportunity to speak on this item. And I am speaking in favor of the proposal. I'm fortunate to be now a member of the Board of Directors of Alameda for Family Services, but has also served on the subcommittee on unbundling police services.'",
        "'speaker_3': 'And we were the entity that made the initial recommendation to remove mental health calls from the purview of APD. And the next step we have to take is to. Engage mental health provider in the process of responding to those calls.'",
        "'speaker_3': 'We've got fire and now we need mental health engaged in that. And you couldn't do better than me and family services. Decades of experience with proven excellence in mental health services in the city. They've all the partnerships you would want to see for some work like this with Building Futures ABC, they used in more to address a'",
        "'speaker_3': 'couple of the mayor's concerns. I would say the weaknesses of the RFP. Are bounced out by the robustness of what we know AFS can provide with their years of experiences, their network, their experience and community. And that has to be also balanced out by the delay.'",
        "'speaker_3': 'I mean, we had the presentation from cahoots with the Mayor's meeting with Cahoots. A video was in July of 2020. It was pretty clear that what we needed was mental health response out in the process, and we're more than a year out from that and it's time to make it happen.'",
        "'speaker_3': 'And I think whatever weaknesses in the RFP are balanced out by that need to to make this happen finally after all this time. So I hope you can all support the proposal. Thank you.'",
        "'speaker_0': 'Thank you for your cycling. And I did see Jennifer Rakowski here.'",
        "'speaker_1': 'Before, try to.'",
        "'speaker_0': 'Get her back. There she is. All right. Good evening, Speaker Rakowski.'",
        "'speaker_4': 'Yes. Thank you for letting me back in. I bounced out. I wanted to echo what other people have been saying. We wanted strong mental health support. We wanted rooted in community with strong, consistent local ties. We directed staff and staff listen to the absolute necessity for 24 seven respond.'",
        "'speaker_4': 'And they didn't just take the proposal but really engaged with it and improved it to make a strong but also fiscally sound 24 seven response that I agree with the other speaker still underfunded the need so I absolutely support this proposal moving forward I support the ability for a second year because we need to start and we'",
        "'speaker_4': 'need to start now. And thank you. And I want to appreciate the staff time from the fire department and from the city in general on this proposal.'",
        "'speaker_0': 'Thank you, speaker Caskey. Our next speaker.'",
        "'speaker_1': 'Abra mendoza.'",
        "'speaker_0': 'Good evening. Speaker Mendoza.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_0': 'I'm here also with.'",
        "'speaker_1': 'Others in solidarity and in support of this mental health proposal, this pilot.'",
        "'speaker_0': 'Program.'",
        "'speaker_4': 'And since we listen to such data driven.'",
        "'speaker_1': 'Evidence before, we know there's a need for this.'",
        "'speaker_0': 'Service.'",
        "'speaker_1': 'We know.'",
        "'speaker_0': 'People.'",
        "'speaker_1': 'We're taking risks right now.'",
        "'speaker_0': 'The more delays.'",
        "'speaker_1': 'That we make. I think another thing.'",
        "'speaker_0': 'That's.'",
        "'speaker_1': 'Important to understand is since the murder of George.'",
        "'speaker_0': 'Floyd, there.'",
        "'speaker_1': 'Has been such an increased demand in alternatives. And so we should be thankful that we have a qualified, community based organization like Alameda Family Services that has risen to the occasion. It does not make any sense to issue another RFP.'",
        "'speaker_1': 'I also came.'",
        "'speaker_0': 'Here to.'",
        "'speaker_1': 'To support this program to say that I'm in favor of it, that we need a 24 seven, we need $1,000,000 this.'",
        "'speaker_0': 'Year.'",
        "'speaker_1': 'Another million the next year. We need to continue to grow our alternatives to police. That's 50% of nine one. One calls are non-criminal in nature anyway. And so.'",
        "'speaker_0': 'To.'",
        "'speaker_1': 'Delay, this would just.'",
        "'speaker_4': 'Be a.'",
        "'speaker_1': 'Miscarriage of justice. So I'm asking all of you city council members to approve this, approve it with flying colors, and we are going to see our community improve. And this is the first step. This is the first of many, many steps.'",
        "'speaker_1': 'I urge you to do the right thing, to do it swiftly. Thank you.'",
        "'speaker_4': 'City manager Jerry Bowden.'",
        "'speaker_1': 'For that presentation and for negotiating and working with this nonprofit to make this pilot program work for our community.'",
        "'speaker_0': 'Thank you. Speaker Mendez Our next speaker.'",
        "'speaker_1': 'Matthew Maddox.'",
        "'speaker_0': 'Good evening, Speaker.'",
        "'speaker_3': 'Matter my doubts.'",
        "'speaker_0': 'Yes, madam. Sorry.'",
        "'speaker_3': 'My name is Matthew Meadows and I'm speaking in support of Alameda Family Services proposal. I'm a licensed clinical social worker and the executive director of the Behavioral Health Collaborative of Alameda County. We're an association of 30 for mental health and substance use providers, and we provide the vast majority of mental health services throughout the county.'",
        "'speaker_3': 'In my role, I've had extensive opportunity to work with the AFL staff and I can absolutely attest that they have highly competent staff, experienced leadership. They have a continuum of services and strong relationships with both the community and other providers that I think will really support this program.'",
        "'speaker_3': 'I am really confident that they'd be able to provide highly effective crisis mental health services, and I'd definitely recommend them for this really important program. The other comment I want to make is I've been very involved with the justice involved Mental Health Task Force, and this is exactly the type of program that the community needs, and I'",
        "'speaker_3': 'believe it can really have a significant impact. So I strongly recommend them. Thank you for your time.'",
        "'speaker_0': 'Thank you. Speaker Midas Oak. Next.'",
        "'speaker_1': 'Speaker Savannah. Chair.'",
        "'speaker_0': 'Good evening. Speaker. Chair.'",
        "'speaker_1': 'I. Can you hear me?'",
        "'speaker_0': 'Yes, we can.'",
        "'speaker_1': 'Okay, great. I just wanted to echo generally what everyone has said. Much like Denise, my comments initially were going to start with just really the emphasis on that 24 seven care. I really appreciate, Jerry, that you included that and that his staff included that in the proposal.'",
        "'speaker_1': 'It won't work if you don't have if not everyone can access these really important services. I just really want to echo and put a lot of emphasis the point that like, you have to stop delaying this. It's just been too much time in the time that you delayed this, the police murdered someone.'",
        "'speaker_1': 'So we don't have any more time to wait. You already have that blood on your hands, so you have an absolute responsibility now to do something. A pilot's a pilot for a reason. I think Jerry commented on this actually in his proposal that this would be really unique and it would be more than anyone in the county'",
        "'speaker_1': 'has done. And it would be we would be position to try something and to imagine a new way of living that would help everyone. Right. That's should be the goal. That should always be your goal. The specifics around it and then nit picking details are, while perhaps warranted, not saving lives to spend time doing that.'",
        "'speaker_1': 'Getting in and doing the work is what saves those lives. And that's been clearly communicated to this council. I don't know how many times. I'm not too sure how many more times you need to hear that. So just echoing what everyone has said in general about PFS, that clearly there are providers that can support this type of'",
        "'speaker_1': 'programing and offer these critical needs to our most vulnerable friends and neighbors. And that should be the priority of everyone that sits on this council. That's your that's why you're elected and what you should be doing. So thanks to everyone for for putting in the time to make this happen.'",
        "'speaker_1': 'And we need to get this off the ground now. Really? Yesterday. Thanks.'",
        "'speaker_0': 'Thank you. Speaker. Chair. Our next speaker.'",
        "'speaker_1': 'Melody Montgomery.'",
        "'speaker_0': 'Welcome, Speaker Montgomery.'",
        "'speaker_4': 'Hi. Thank you. I want to say it's good to be here again, but I that's really not true. I just am tired of the waiting, the delays. So no more waiting, no more segways normally no more delays. No more red tape.'",
        "'speaker_4': 'It's a pilot. Let's get it started. We can we can make tweaks along the way. We can fix this as we move, but we're never going to have anything to fix if we don't get it started. People, please.'",
        "'speaker_4': 'It's your job. And you all voted for these things to happen. The community has spoken time and time and time and time. Time and time and time and time and time again. I'm not sure what the holdup is.'",
        "'speaker_4': 'I so appreciated the proposal and I'm all in favor of this this combo proposal. So let's take a vote. Let's say yes and let's get something moving for our town and for the people that are so affected by your non-action.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Speaker Montgomery, our next speaker.'",
        "'speaker_1': 'Early stadium meeting.'",
        "'speaker_0': 'Good evening. Speaker State m lang.'",
        "'speaker_1': 'Good evening. Thank you. I just want to echo what other speakers are saying, that this is the time to act, that this is a pilot and it does not have to be perfect. So I just urge city council to approve this proposal by first.'",
        "'speaker_1': 'And I also just want to point out that we can't really critique the fire department for putting forth this RFP when city council already gave them responsibility for putting together this program. So saying they're not then equipped to put out this RFP is disingenuous.'",
        "'speaker_1': 'And also in reality, this is almost like the second RFP the City Council has already put out because there's a first opportunity for agencies to apply to run the program as a whole. And at that point Felton applied and the fire department.'",
        "'speaker_1': 'So and then now we're going through the second RFP and any other organization could have applied at either of those two points. So opening up again would just cause further delay and also saying that critiquing officials for saying they wouldn't work with someone who is violent or committing a crime, that's not really fair because I believe the'",
        "'speaker_1': 'program is restricted from handling those types of calls anyways. So it's disingenuous to not critique them for saying that they wouldn't respond to those calls. And also, the program was never meant just to be to, you know, send out caseworkers to serve as backup for law enforcement.'",
        "'speaker_1': 'So that asking for a program that would be willing to do that is not accurate either. So I don't think any of these excuses should be reason for a delay. I've read through the AFS proposal and I believe it is a sound comprehensive proposal and I support the City Council awarding this contract to address AFS.'",
        "'speaker_1': 'If if City Council does not, we'll be leaving our vulnerable community members without the services they need. And we.'",
        "'speaker_0': 'Thank you for your comments, our next.'",
        "'speaker_1': 'Speaker and any.'",
        "'speaker_0': 'Good evening, Speaker Kenny.'",
        "'speaker_4': 'Good evening, Mayor. City council and city staff. You've heard from me many times on this issue in many ways. So you know how I feel about this. You know that this the need for these types of services.'",
        "'speaker_0': 'Has greatly.'",
        "'speaker_4': 'Increased during the pandemic. You know that we don't have time to.'",
        "'speaker_3': 'The services weren't.'",
        "'speaker_4': 'Available before the pandemic. You know that this needs to happen in order for us to have an alternative response team, it has to.'",
        "'speaker_1': 'Contain mental health clinicians.'",
        "'speaker_4': 'In order to be.'",
        "'speaker_3': 'Effective.'",
        "'speaker_4': 'I ask you to please support what the city staff has put forward and accept options one A and one C. And I want to thank city staff for putting this forward. And it is a pilot so we can make adjustments.'",
        "'speaker_4': 'It's more important to have something at this point than to have something perfect. Thank you.'",
        "'speaker_0': 'Thank you, Speaker. Kenny. Madam Clerk, how many more speakers do we have? That was our last speaker. Okay. I'm going to close public comment now, and we need to do our housekeeping because we're coming up on 11 p.m..'",
        "'speaker_0': 'So we need to and by the way, a hearty thanks to all of the speakers. You were quite persuasive. I so we've got 1 to.'",
        "'speaker_4': '3 more.'",
        "'speaker_0': 'Items under know regular agenda items. I would entertain a motion to go as far as we can to midnight tonight. We need four votes to pass that. But I say we just keep plowing through until we get to midnight and hopefully at least finish the regular calendar.'",
        "'speaker_0': 'Vice Mayor of L.A..'",
        "'speaker_1': 'I'd like to make a motion that we continue to midnight and try to get through as many items as we can remaining on the agenda.'",
        "'speaker_0': 'Thank you. We've had a motion to have a second. Councilmember Desai. Seconds. Okay. Maybe we have a roll call vote, please, Madam Clerk.'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'First, I'm sorry. I'm not quite.'",
        "'speaker_3': 'High.'",
        "'speaker_1': 'Villa. I may or as Ashcroft I. That carries by five eyes. Okay.'",
        "'speaker_0': 'All right. And so we we heard some pretty profound public comment just now. So let's have our council comment. Who would like to leave? Vice mayor of L.A.?'",
        "'speaker_1': 'So I have some questions about what's being proposed, because I think we can we can say that it's a 24 seven program and people have read through the proposal. But I do have some questions about the details. And I do think that the details matter because as many of the callers put it, is a matter of life'",
        "'speaker_1': 'and death. And if we have you know, if we say we are providing a certain set of services and people call in, you know, to get assistance and we are not writing those services, I also have concerns in that direction.'",
        "'speaker_1': 'So. The Assistant City Manager. Bowden The 24 seven on call says that they'll receive a stipend for being on call. The councilors would. I'm assuming that by agreeing to being on call, they're agreeing to not just like we would with any other city employee there.'",
        "'speaker_1': 'They would be bound by basically not they're not going to be drinking or anything like that while they're on an on call shift. They're going to be essentially on call and ready to go to work.'",
        "'speaker_3': 'Correct. Yeah. The and I will say.'",
        "'speaker_2': 'That Kathryn.'",
        "'speaker_3': 'Schwartz is available. She's she's on the call this evening and can probably help to better articulate as far as internal policies. But our expectation with this contract would be that these are these are these are trained medical professionals, clinical professionals who are clinicians who who are able to deliver the services that at any given hour.'",
        "'speaker_3': 'And they'd be available on call just like any other professional would be working on behalf of the city.'",
        "'speaker_0': 'If I could tag on to the Vice Mayor's question about the 24 seven on call provision on page eight, the eight a under paragraph premature rule for ability to provide behavioral health professional services on a 24 seven on call basis to respond to acute emergencies in the field to assist field responders, provide response within 90 minutes.'",
        "'speaker_0': '90 minutes. Sounds like a long time. And I do think that these details are important, but I think we have been joined by Catherine Schwartz, executive director of Alameda Family Services. Welcome to do you want to you want to speak to those questions?'",
        "'speaker_1': 'Yes. Thank you, Madam Mayor. And good evening, city council members. And I'm pleased to be able to answer your questions. Yes. The answer is that if someone is on call and they are being paid a stipend, under no circumstances will they ever.'",
        "'speaker_1': 'Do anything that would inhibit their ability to perform their job functions fully, just like they would during a regular 9 to 5 shift. And we would pay them hourly if they were activated, if someone called them and they would be prepared to either respond in person or by phone, whichever was necessary.'",
        "'speaker_1': 'And the expectation that was articulated in the proposal is that they will call back within 15 minutes. The RFP indicated that buyer would accept 90 minutes. And so the indication was that would be the longest possible. But that clearly we reiterate repeatedly in the proposal that the expectation is that they would call back within 15 minutes.'",
        "'speaker_0': 'Okay. Thank you. Other other questions are vice mayor restore you? Sorry.'",
        "'speaker_1': 'And by callback, they would be calling and interacting with the first responder. Is there is there going to be an opportunity for them to speak with the individual at all? Or is all of the communication and response going to be within that just limited to first responder, even if they come in person?'",
        "'speaker_1': 'How's that? What's the if they if they if they come in person, then the expectation would be that they would engage with with the caller, but with the consumer. Yes. And if they respond as a consultant, there would also be a potential opportunity as needed to speak to the person who was having the crisis.'",
        "'speaker_1': 'The way that our person that our staff is going to respond is going to be dependent on the situation. They're going to use their clinical judgment and work in collaboration with the first responder, the fire department, to determine the best course of action.'",
        "'speaker_1': 'But if we were called to the scene in order to support, the expectation would be that we would engage with with the caller. But the clinician will be the one making the determination of if they will be responding in person.'",
        "'speaker_1': 'It wouldn't be our first responder saying we would like a clinician to come. It would be. It would be a discussion. So, for example, the first responder could say, could call us and say, we need you to come out.'",
        "'speaker_1': 'We have a situation that we feel. We need your you know, we need you to come out in person to support. Or in the course of a phone call based on the information that the first responder gives the clinician, the clinician could make the recommendation that they would like to come out to support.'",
        "'speaker_1': 'So the clinician with the clinician is going to use their clinical judgment based on the information that they are receiving from the first responder, as in any situation, but also as in any uncalled situation, the person can make a judgment and say, I think it would be helpful for me to come in person and support you.'",
        "'speaker_1': 'So I do have a question. Would there be a scenario where first responders are asking for the clinician to come, where the clinician would be able to say, no, I don't think I should come? Or is when the request is made, the person would then come.'",
        "'speaker_1': 'So if our firefighters are saying we want a clinician here, then that would be an end of story. The clinician would would come in.'",
        "'speaker_0': 'Okay. If I could just ask. Sorry to interrupt, but one person speaks at a time. So advice Maravilla, finish speaking then I'm back to you, Mr. Shorten. I do see Acting Chief as I'm back with his hand up, so we'll call on him next.'",
        "'speaker_0': 'But Vice Mayor, go and finish your question.'",
        "'speaker_4': 'And then and then.'",
        "'speaker_1': 'In the interim, so as the person and I'm assuming that the 90 minutes is to allow for travel time or whatever in the interim, what would happen is that is the first are the first responders going to be on the phone or they're going to be checking back in with the clinician?'",
        "'speaker_1': 'Can you walk me through that a little bit? I just want to understand, obviously, things can change in a certain matter of time. Is the expectation that our first responders from our fire department or then to stay with the person that's in crisis for the for that waiting period?'",
        "'speaker_1': 'And then is what what's the communication looking like during that time? I see Chief Beck has his hand and know if you want to speak to that or if you want me to try. What would you prefer, Chiefs?'",
        "'speaker_0': 'Well, I'm actually running the meeting, so I'll make that decision. Thank you. I would like to hear the acting chief is on Beck because you had your hand up during that line of questioning earlier.'",
        "'speaker_3': 'Yeah, just clarification. So, first of all, mayor and city council, I'm recused on back the interim fire chief. And there is a point of clarification here. So we've asked element of family services to provide support to the program.'",
        "'speaker_3': 'Of course, as we well know, and there are several different options situations where we we expect their assistance. One would be a telehealth connection between our first responder and their agency. So we would have an opportunity to put the client on the call and speak directly to a clinician.'",
        "'speaker_3': 'In certain instances, if it was warranted, because this would be and that's part of what we are working on with county mental health. So it's important that it be understood that, yes, the client could talk directly to the clinician over a telehealth connection and our first responder unit would stay on the scene until the completion of the'",
        "'speaker_3': 'call. So once we take a client on service, then we're going to stay until the completion. The other possible interaction with element of family services would be if we asked for them to respond directly to the scene. And again, we would wait with with the client until and even during the time that Air Force responds and is'",
        "'speaker_3': 'on the scene with the client. So those are two different scenarios per se. So that's just for clarification.'",
        "'speaker_0': 'Okay. Back to you, Vice Mayor.'",
        "'speaker_1': 'And have we we've been working with the county currently. Is that correct?'",
        "'speaker_3': 'Yes, we are negotiating with the Council on Development of the Programs protocols as well as some of the additional response criteria. So in Chief Del Bono's on the call, by the way, and he can answer some questions related to operational issues.'",
        "'speaker_3': 'But we'll wait to hear what your questions are.'",
        "'speaker_0': 'Yes, he did. He didn't raise his hand, but. Oh, I see. The city manager with his hand up. Sorry. Let me let me go to Mr. Leavitt.'",
        "'speaker_3': 'And so I just want to add two things to what Houston back said. The third thing when we set out the proposal was the wraparound services after and referring them to the right agency and follow up the next day, which is also a critical component, whether it be this proposal or anyone.'",
        "'speaker_3': 'That's what we were looking for, an army of family services proposed in that way. And then I think interim chief Deputy Bono can also add where we are with the county. I think part of it is they're waiting until we have a decision of who the partner is because.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Leavitt. I'm going to make sure that the the vice mayor has the fire. Just want to make sure that she's completed her line of questioning, because I think she's still in the stage where the call is happening.'",
        "'speaker_0': 'So I wasn't sure if you were again vice mayor.'",
        "'speaker_1': 'Well, yeah, I just wanted to kind of get walk through what does it look like? Because I think what it says on paper is one thing that our fire department is currently responding right now. And so they have an understanding of kind of what their needs are.'",
        "'speaker_1': 'So I would really like to hear from our deputy chief about kind of how things are going. And then also because my understanding is we are in talks with what will be required by the county if we need to make changes or modifications to this agreement, if we move forward with it.'",
        "'speaker_1': 'Is there, you know, what would we need in the agreement to allow for that to occur? If, for instance, if the county comes back and says, yes, I know you have this agreement, however, we're requiring these additional things.'",
        "'speaker_1': 'Do we need to negotiate that now? Are there things that that the chief can foresee becoming issues? Those are my questions.'",
        "'speaker_0': 'Okay. So Deputy Chief checked up on her. Welcome. Would you like to take a shot at that?'",
        "'speaker_3': 'Thank you, Mayor. City Council Members Deputy Chief Jarvis. I'll go now. Yeah, I'll take a shot at it. There's a few things here. So we're we're out with the county right now is we're working with public health and county EMS.'",
        "'speaker_3': 'We work as paramedics. We work under a doctor sports license. So he's he's our county medical director. And one of the things that public health wanted, in order for us to be able to initiate the 5150s and remove PD from there, they wanted oversight from a licensed clinician that we would have access to, meaning that we could'",
        "'speaker_3': 'pick up the phone kind of like we do. We used to do it in the county for medical medicines and things like that. So now we have access to a license condition 24 seven that we can call and say, hey, we're on scene of A, B and C, we're looking at initiating a 72 hour hold on this'",
        "'speaker_3': 'client. We want to get your input on it and kind of have somebody to consult with that allows us to do that. That was a requirement of the county. The police officers do not need to do that right now.'",
        "'speaker_3': 'The reason behind that is because public health doesn't want to expand the the the right for people to 5150. They kind of want to limit it because that was part of the goal of putting them in the county cat units was to limit the 51 phones that were being placed and that type of client being taken to'",
        "'speaker_3': 'hospitals in overwhelming the system. So that was the county's requirement for the telemedicine, the clinician part of it, obviously, just this week, yesterday, actually, our our nine paramedics who all volunteered to go through over 60 hours of training with the Bonita House as clinicians just completed it yesterday.'",
        "'speaker_3': 'So just to give you an idea, if we responded to some type of call where we got there and it was above what we could handle, our our personnel will be trained not just in the clinician type training, but the city type training to to de-escalate the situation, calm things down.'",
        "'speaker_3': 'That's where we would initiate, you know, the clinician and call AFC to come in and assist us. And, you know, Marilyn, you pointed out that that can take a long time, 90 minutes. These calls would take a long time.'",
        "'speaker_3': 'These are these aren't calls that are going to go fast. These are people that need you need to take time with. You have patients with be trained and talked to. And that's what our personnel wear now and then to have the clinician there to be able to come in after us and be able to bring their expertize'",
        "'speaker_3': 'there and complement the program because we're not. The word to lead the program. This is going to be a team effort. We're all going to be working really hard together. As you know, Emily's army, the family services, our community paramedics in program PD.'",
        "'speaker_3': 'There's going to be a lot of people involved in this. So I don't know if that gives an idea of how a call would go. I can ask more I can answer more specific questions if you need me to.'",
        "'speaker_0': 'I would just like to ask you, Deputy Albano, how often are you able to use telemedicine for some of these calls? I mean, you really could get someone on the screen and having a conversation. We heard a lot of references to the Mario Gonzalez case.'",
        "'speaker_0': 'Would telemedicine have been used there or what? Help us understand the parameters.'",
        "'speaker_3': 'Well, I'm I'm not going to go back and second guess what happened on that, because I was not on that call. But I would say in a situation like that, I think, you know, part of what everybody's experiencing with it is and I know I've talked about with San Francisco's models doing along with New York's model with'",
        "'speaker_3': 'that crisis mobile units, that would be a situation where you probably end up showing up there and moving back if, you know, in de-escalating the situation and and trying to talk to him and get him, you know, somebody that that's in crisis to calm down, work with with what tools we had.'",
        "'speaker_3': 'If we're not able to get that person to calm down and get in a position to where we can get them to help, and that's what we would call in the clinician to come in and and assist us with that.'",
        "'speaker_3': 'That makes sense. Okay.'",
        "'speaker_0': 'Okay. And what if the person was violent?'",
        "'speaker_3': 'Well, anything that if somebody was violent, we would we would have to have to be there for anybody. It would be a safety issue. Okay. You know, but again, we would be working as a team with PD, L, Alameda Family Services, us being there, you know, not putting people in harm's way and trying to get that that'",
        "'speaker_3': 'client out of out of harm's way. So.'",
        "'speaker_0': 'Thank you. Okay. Back to your first mayor.'",
        "'speaker_1': 'And just to follow up on that, when we talk about violence, it wouldn't be it would be a a team effort, as you mentioned. Deputy Chief. So when you talk about de-escalating, you would, you know, perhaps in a similar scenario or similar future scenario, fire would come in and be the first phase of the interaction.'",
        "'speaker_1': 'Is that what you're you're saying so that it wouldn't necessarily be a situation where your your approach would be would be different from that of police coming in? Is that what you're saying?'",
        "'speaker_3': 'I would say, yeah, that we're hoping to have us out in front first. And this would be two people on a low profile crisis unit. This isn't going to be a fire engine, an ambulance PD officer showing up.'",
        "'speaker_3': 'This is literally going to be two people in a vehicle together that are going to be in polo shirts, that are going to come out and engage, engage the patient, you know, are the client and see where they're at.'",
        "'speaker_3': 'If they're on the street in the building, you know, PD would probably be there a bit in the background. And we're and we've we've had several meetings with PD and they they they understand what they would their role would be to and, you know, we would work to de-escalate the situation.'",
        "'speaker_3': 'If there's a weapon involved and somebody is violent right off the bat, obviously, we would have to we'd have to make sure that the scene is secure in our police officers are the ones that know how to do that.'",
        "'speaker_3': 'But I really think that, you know, from the type of clientele and, you know, we've been transporting mental health patients since 1982. I mean, this is not new to us. And like Catherine had pointed out, this is this is to expand our options to get people to the right place for the right needs.'",
        "'speaker_3': 'So if we show up on a call, our only choice isn't to 51, 50 somebody and take them to a psychiatric felicity or restrain him and take him to the E.R. room. We're going to have a lot more options here, including treating and releasing.'",
        "'speaker_3': 'And that's one of the options that we're going to have under our pilot, meaning that we can show up and we call it refer and release in this type of situation. So if the client is somebody that we really feel comfortable with, that we can refer and release, we're going to have A.f.c. on site Monday through Friday'",
        "'speaker_3': 'handling a caseload that can go and do follow up with with this person the next day. Maybe it's not a mental health situation. Maybe it's a an addiction issue, maybe it's a homeless issue. And I don't know if I added this, but we already have office space for them in our community.'",
        "'speaker_3': 'Paramedics at the office where Catherine is agreed that this this clinician will be embedded Monday through Friday in our office. So, you know, again, that's a big deal for us because we'll be working as a team together with all of us tonight.'",
        "'speaker_3': 'That clinician is going to be here and like part of our family. So that's that's how that's how we're going to approach this, you know. So I hope that explained it all.'",
        "'speaker_1': 'That helps. And and so to follow up the the having the clinician there, there will be an ability for fire to to follow up to actually make sure that the person's been seen as part of your refer and release program.'",
        "'speaker_1': 'It's not just here's the information. You'll actually have the person there on premises so that you can check in and say, Has this person come in? What's happened? And if the person doesn't come in or there's other issues, you'll be able to do additional follow up?'",
        "'speaker_3': 'Absolutely. I think that's going to be a huge part of the success of, you know, our response is having that follow up care. I mean, you know, the majority of time that these these clients are like put on a hold, they go to John, George, they're released a couple of hours later.'",
        "'speaker_3': 'There's no follow up care. This is this is going to be you know, you know, like somebody had mentioned, this is going to be, you know, pretty much one of the one of the only kind of programs that are going on in California right now.'",
        "'speaker_3': 'So along with San Francisco, they're they're doing the same thing, really high success rates. So.'",
        "'speaker_0': 'You have a.'",
        "'speaker_1': 'Sense and then I really appreciate this. I think that this makes it more real and digestible for people to understand what the what the conversations have been among staff in terms of what's being envisioned by this. So I really appreciate the detail of the response.'",
        "'speaker_1': 'There were two things. I'm just going to go into kind of what my my comments, I guess are for the Quality Assurance Board. I would like to make sure I notice that AFS would be a part of it.'",
        "'speaker_1': 'I, I well I think AFS is going to be reviewed. I don't necessarily think having AFS be part of the board. I don't know if it was a semantics thing that I'm reading incorrectly, but I just want to make sure that that board, like AFS isn't reviewing itself.'",
        "'speaker_1': 'I think that's really important. And Chief. So I'm back. I, I see your hand up.'",
        "'speaker_0': 'You want to comment? Interim Chief Zon.'",
        "'speaker_3': 'Back. So first of all, let me explain the quality assurance board. We have one for each of our programs, community promotion program or our class or permanent program. So we have oversight. That's part of the process. We review what we do and we look to see how we can improve.'",
        "'speaker_3': 'So what we want to do, this is a collaboration. So we want to review together what we're doing and we want to understand where we're doing something right and where we need to improve. That's what the Quality Assurance Board is about.'",
        "'speaker_3': 'Now, we've also discussed the prospect of having an open meeting to the public, some sort of a committee are meeting potentially where we can then have a Q&A with the public about the program on a periodic basis. So that's another I would say what we want to try to do is be as transparent as possible on how'",
        "'speaker_3': 'the program's doing. Obviously, we're going to have data reporting that's going to be coming from both the fire department's data sources and Air Force. And we have some robust data reporting internally because we have our call response system, our record management, and we also have our our client services reports.'",
        "'speaker_3': 'We have what we call patient care reports, but there's something that we use for community paramedics and that we envision we use for this program. So we'll have data. We can report that out. Obviously, you'll want that. But we also we would like to be able to answer questions as appropriate to the community on how we're doing'",
        "'speaker_3': '. The quality assurance is a big part of what we always do internally.'",
        "'speaker_0': 'And I wonder, chief interim chiefs are back and Deputy Chief Charbonneau, is there a place for peer review in this process, perhaps from San Francisco, that's doing something similar, maybe what San Mateo County's doing? Deputy Chief And by the way, thank you so much for all the additional insight you provided.'",
        "'speaker_0': 'I learned a lot just from listening to you.'",
        "'speaker_3': 'Yeah. So one of the peer reviewed things we're going to we're going to actually have our our personnel go right along with San Francisco's crisis mobile units. They're going to go spend a day or two out there and right along with their units to kind of see what they're doing.'",
        "'speaker_3': 'But yeah, there is going to be peer review and I know public health, the Alameda County Public Health and our EMS County because we're under a pilot, we're going to have review up there, too. They're going to want to they're going to want to take this data, look at it, see what kind of, you know, responses we'",
        "'speaker_3': 'have and how that goes. I want to I want to say one last thing, just so you guys get a little bit more comfort level. You know, part of the training was, you know, it was nine days. We had people volunteer board three, our personnel in there, which I learned hopping on in the morning and hearing why'",
        "'speaker_3': 'they were there. Our veterans, that two of them were were veterans, war veterans that were in Iraq and Afghanistan, one of them ten years and very heavily involved in PTSD stuff. And so these these these nine people, we have volunteered to do this.'",
        "'speaker_3': 'They didn't they weren't forced to do it. They want to do it. We're going to meet next week and also they're going to be part of forming this program.'",
        "'speaker_0': 'So thank you guys there.'",
        "'speaker_1': 'So I wasn't necessarily asking in terms of having community oversight in in the quality assurance. I think the peer review aspect is really what I was getting at. And I think if we can just build in something in the agreement that would allow for collaborative peer review or it doesn't it doesn't need to be quarterly or anything'",
        "'speaker_1': 'like that. I think maybe a six month check in and then one at the 12 month mark, something like that. You know, San Francisco has been doing their thing for a little bit and yeah, a little bit of time.'",
        "'speaker_1': 'I think just hearing what's happening within the region and when I say peer, I really mean peer peer programs, regional programs, because these are regional issues. So I just think that would be helpful and give you know, give you insight.'",
        "'speaker_1': 'I don't I worry about just opening it up to a full, you know, anybody from the public coming in to sit on that the quality assurance board because these are these are it is a pilot program and it's an emerging area and it's also an area where there's a lot of expertize needed.'",
        "'speaker_1': 'But I would like some sort of built in peer review. The other thing and I'll wrap up, I'm not necessarily in favor of that. The way that it's worded for the second year option by mutual agreement, I do think it should come back to the council at the one year mark we can review.'",
        "'speaker_1': 'That would be where I would want to hear the data presentations, what the peer review recommendations were because I don't know. If this is where this is a good starting point. I think there's been a lot of work to get us here.'",
        "'speaker_1': 'But we could be looking for an entirely, you know, a bigger build out to the program. We could find that there's a greater need in one area and not in another. And so I really think that at that point, we need to make that decision and to have it come back to council with that data and that'",
        "'speaker_1': ', you know, all of the insight that you've learned to really make sure that whatever the program is, that we continue it in a way that is most appropriate for our community and for our department and what our needs are.'",
        "'speaker_1': 'So that would be that's my feedback on that. You know, I appreciate all the work that went into this, and I want to thank you all. I think that the goal here is really to just make sure that we have this alternative option.'",
        "'speaker_1': 'I do also worry about the exhibit A thing. So I feel like we might be able to give some direction tonight on the specifics and maybe have it come back at the next council meeting fully agenda and vote on it that way.'",
        "'speaker_1': 'I just want to make sure it's clean. So thank.'",
        "'speaker_0': 'You. There might be a workaround on that one. Let's hear from some other council members who wants to go next. Councilmember Herrera Spencer.'",
        "'speaker_4': 'Thank you, Mayor. So I would like to hear at some point from the city attorney in regards to the exhibit, because when I read it, it just says it's like a tentative document or something like that. I forget what the word was.'",
        "'speaker_4': 'So would it be okay to have that discussion now? I'd like to hear from the city attorney.'",
        "'speaker_0': 'Okay. And I'm sorry. Your question is what again?'",
        "'speaker_4': 'The issue you raised in regards to the exhibit? Because when I read the contract, I actually think that it's all right that we can proceed with the language that was used in here.'",
        "'speaker_0': 'Sure. I mean, my concern is that will they open government commission, bring a complaint against us? But I don't have a crystal ball. But, Mr. Chan, is there anything you'd like to add?'",
        "'speaker_3': 'Sure. Councilmember Spencer, if the council wish to proceed tonight, as Councilmember Avella indicated, you could provide direction as clear as possible. Right. As the staff report acknowledges that the contract is not done, then you would want to provide as many clear directions as possible so that when you're delegating that ultimate authority to the city manager, he understand'",
        "'speaker_3': 'what your directions are. So that is one path to proceed. Alternatively, you could consider the vice mayor his approach, which is to give direction and have staff bring you back a clean exhibit. Both are legally viable at the Council's pleasure.'",
        "'speaker_4': 'Thank you. So my preference would act. So if you look at the bottom of page one of the proposed agreement, it says provider agrees to do all necessary work except the right to include it in Exhibit A as requested.'",
        "'speaker_4': 'Provider acknowledges that the work plan included an exhibit is tentative and does not permit the city to request provider to perform all tasks included therein. So I think it is actually written in a way that it is broad enough that I would my preference would be to move forward and give an allow, which is in fact the'",
        "'speaker_4': 'title of the document is recommendation to authorize the city manager to negotiate and execute an agreement with Almeida Family Services. So it actually provides that to negotiate and execute. So that does within the title itself tell us that the negotiations will still be going on, but that that's what the ask is from staff in the title.'",
        "'speaker_4': 'So going back to the city attorney, how would you respond to that?'",
        "'speaker_3': 'I think I think what the councilmember said is consistent with my response to you, which is that you have multiple path forward. You could give the city manager direction tonight. Delegate authority and help negotiate and execute the contract.'",
        "'speaker_3': 'Or you can direct him to bring back something that's precise. Both are within your authority tonight.'",
        "'speaker_4': 'Thank you. So I would move that we accept the recommendation here to authorize the city manager to negotiate and execute an agreement with me to family services for an amount not to exceed 500,000 for one year. And I appreciate vice mayor's comments in regards to the not wanting to proceed with the option and have it come back'",
        "'speaker_4': '. But I would like to at least start with the year one and make a decision tonight and give that direction, which I think does comply and does honor exactly what the agenda item says here to negotiate and execute four options than one A and one C.'",
        "'speaker_4': 'See, and I'm going to. So I'm making that motion. I'm hoping that council will support moving forward today. I agree with all of our speakers and we had this like almost ten speakers in regards to how important it is to move forward with this.'",
        "'speaker_4': 'I was not on council when this process started. However, I agree with our community. It is time and I would actually say it is past time. And when I and some of you may remember back in July when I looked at the zoom screen, I said, In a time of crisis, I want our first responders.'",
        "'speaker_4': 'That is who I want. When I look at the screen today and I see the executive director of Alameda Family Services, Catherine Schwartz, joining our police chief, our interim fire chief, our deputy chief, that is Alamitos team. Why is that?'",
        "'speaker_4': 'Our team? First of all, for some of you that don't know this, Alameda Family Services has been serving Alameda, the city since 1969. Our community has been supporting Alameda Family Services for over 50 years. We heard from some of these people today that volunteer.'",
        "'speaker_4': 'Many of us donate to Alameda Family Services, time and money. They are in our schools serving our community. They are out. And there's a letter from Alameda Point Collaborative. They serve people at Alameda Point Collaborative. They have a presence in our community, bar none.'",
        "'speaker_4': 'There is no other provider of mental health services that knows Alameda and serves Alameda better than Alameda Family Services. This is, in fact, what I would call the A team that I was hoping we would get. And I strongly appreciate the assistant city manager's efforts and the city manager's efforts in bringing this.'",
        "'speaker_4': 'But and I agree and the vice mayor's comments in regards to an emerging effort here, cities across the country are trying to figure this out. I'm going to submit that we have a head start because our fire department is acting.'",
        "'speaker_4': 'I'm sorry, Deputy Chief Telefono said has been transporting transporting mental health patients since 1982. That's amazing. So this is exactly what I want and I thank everyone for stepping up. I hope that someone will second my motion and we can start serving our community to the best of our ability.'",
        "'speaker_4': 'Now, someone had said, you know, maybe more money should be at some point we may need more money for this some. And I would agree at some point we may need more money now. We do have the ARPA funds.'",
        "'speaker_4': 'I'm not sure if any of that can be used for mental health, but all the speakers that spoke to increased mental health demands and issues because of COVID. That's absolutely true. The data is there, which is why time is of the essence.'",
        "'speaker_4': 'And so thank you very much. I appreciate everyone stepping up. And actually, I appreciate you stepping up all these years to serve our community.'",
        "'speaker_0': 'Thank you. Thank you. Kasper Harry Spencer. And there were many suggestions made by the vice mayor and also by myself. Are you including that is direction to city manager?'",
        "'speaker_4': 'You know, I so I'm not sure what specifically I certainly do not want to backpedal. I want to move forward. So if you want to enumerate what all the suggestions were, I, I did articulate the one year coming back in a year and we can reevaluate.'",
        "'speaker_4': 'But I think that the ask is actually, hi, I'm here and I don't think we necessarily have to get into the weeds. When I read the agenda item that was said, if you want to make friendly amendments, I'm happy to consider your friendly amendments.'",
        "'speaker_0': 'Let let's hear from Councilmember Knox White.'",
        "'speaker_3': 'So I'm going to second the motion, but I'm going to start off by almost immediately asking to be commended. I appreciate it. I think there's ways to address the issue of the second year. But as somebody who's running two year programs, we're going to be a year and a half through this program.'",
        "'speaker_3': 'Before we have the data, we need to decide whether we should be moving forward. We're not going to be able to make it a value. I mean, it's taking us four months to get to this point, to have something in front of us, to start negotiating it just because of the turn times and whatever else.'",
        "'speaker_3': 'We're going to have to be almost back in front of the council on three months starting the conversation about what to do with your two. And I would recommend that we include the option to extend. If things are going badly, we can stop.'",
        "'speaker_3': 'If they're doing a six month, six month check ins and things are not working and we're not seeing the world seeing the results we want or we're getting complaints and things like that. That option gives us the opportunity to not move forward.'",
        "'speaker_3': 'But I would like to, to to I just we're going to we're going to cause a lot of work with without much benefit.'",
        "'speaker_0': 'I think the question for you, Councilmember, not quite the the question that I think the vice mayor and I both had was that the agreement may be mutually extended to when you're at the sole discretion of the city manager, would you want it to come back to the council?'",
        "'speaker_3': 'I personally, I would like to just give the city manager the authority. I feel like we're I worry that we're walking the walk.'",
        "'speaker_0': 'That's a no. Okay. Okay. Got it. Okay.'",
        "'speaker_4': 'We accept his friendly amendment on.'",
        "'speaker_0': 'You know, it's. I've been studying up on procedure. I think you're actually creating a new motion, but it's perfectly fine. Why don't you go ahead with your amendments? I'm taking notes. Councilmember.'",
        "'speaker_3': 'So, you know, I was going to say, I want to be careful that we're not stepping into the administrative realm by actually starting to write the contract. I think we I want to get my great appreciation. I was as we were going through the presentation, I was thinking about a year ago June, after the Watkins tapes came'",
        "'speaker_3': 'out and we stood on city hall, we stood there with city manager Eric Levitt, and he committed to the to the to the community that I think you said a year. But I'm going to say this council kind of blew a hole in the idea that it was going to take a year, but that we were going'",
        "'speaker_3': 'to be a leader in how we how we respond to these types of things within the next year or so. And I, I said at that point in time that I believe that we were that we had the leadership that was going to get us there.'",
        "'speaker_3': 'And I think we are here tonight, and I want to thank him for for that commitment very early on. Obviously, all the staff from assistant city manager about and chief and deputy chief and Tom Beck, Miss Schwartz and Chief Joshi as well, who I know is also part of these conversations just getting us here.'",
        "'speaker_3': 'So I want us to move forward to the point when we move when we pass the motion to do to bring this forward. One of the things we talked about was, you know, this was a pilot and we kept hearing that tonight.'",
        "'speaker_3': 'We talked about the idea that we wanted to make sure that it was a pilot that was iterative and I might my direction or recommendation or whatnot that I would suggest that I think gets to some of the concerns I'm hearing is that we write the contract in such a way that whatever ends up in Schedule A'",
        "'speaker_3': 'as the things that need to be done can be changed by the city, with agreement from his words, with 45 days or 60 days, you know, kind of notice or something like that. So that as we're iterating, if we find out something's not working and we want to make that change and you know, you know, either Almeida'",
        "'speaker_3': 'Family Services or the or the City Fire Department says, hey, you know what, we really should be doing something else because we're not we're not removing cause from the system of where we thought we should create some sort of mechanism for for you to go back as you're doing the quality review and even change the schedule very'",
        "'speaker_3': 'simply, rather than having to come back and re amend the contract every single day, every single time, I think having that flexibility would be really good. And then I think that if we can give the direction also to get to the address, I think as you're doing the check, you know, it would be good to get quarterly'",
        "'speaker_3': 'updates just on what's going on and what the numbers look like so that the council, if they have a problem, can raise it before that one year extension has come out. I it doesn't take much for one of us to put it on the agenda and say, hey, this is a problem.'",
        "'speaker_3': 'We don't want to we don't want to move forward and give that direction to the city manager in the future. So I think that there are ways we can kind of create those breaks. But I also I just I, I agree with our speakers.'",
        "'speaker_3': 'We have we have sat and talked 15 months on this issue or 14 months on this issue, and it's time for us to move forward. And I think we've got a team that can do this and I'm excited.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Okay. Thank you. And so if I get my procedure correct and Madam Clerk, help me out here, I think this actually becomes the office amendments, become a substitute motion. Is that correct?'",
        "'speaker_1': 'I was thinking I thought that I heard Counselor Knox, like, just say them as amendments to the motion.'",
        "'speaker_0': 'And so, again, I was setting procedure for the League of California's Cities, and I thought that it isn't so much the maker of the motion who accepts the amendments that the the whole council has to decide on that.'",
        "'speaker_0': 'But what do we usually do now?'",
        "'speaker_1': 'The usual process that we have followed typically here and I can study it more myself too. Thank you for bringing it up. But is that the maker of the motion does accept the amendments as the way we are practices?'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Well, we can we can do it the Alameda way. That's fine. Okay. We've had a motion then by Councilmember Herrera Spencer that's been amended by Councilmember Knox. Right. And the maker of the motion accepted those amendments. And I believe Councilmember Knox.'",
        "'speaker_0': 'Right. You also seconded the motion. Correct. And so so let's have discussion from the one member. We well, people have time left, but councilor member distracted. You wish to to weigh in.'",
        "'speaker_2': 'Sure. You know, I think this represents. A historic opportunity for reforming policing in Alameda, an action that I think generations and generations of Alameda will look to and be proud of. So I think we should move forward with the motion as amended.'",
        "'speaker_2': 'And while I voted for Felton Institute, I think the night that I said I voted for Felton Institute, I also indicated that I'm. Confident that the Alameda Fire Department can manage this contract on the substantive issue of the RFP, it is true that the RFP is all of, I think, a page and a half.'",
        "'speaker_2': 'But the way that I look at the RFP is basically it's really not an RFP. What you really have is an RFQ. You're asking for the qualifications with respect to the items and the sub items and the subset of items that are in the RFP.'",
        "'speaker_2': 'And the response that Alameda Family Services had provided was quite in-depth. I mean, there there are proposal is is is 27, 26, 27 pages. And they hit all the points that the Alameda Fire Department said were pertinent points with regard to making sure that we reform policing in ways that allow for mental health professionals to deal with'",
        "'speaker_2': 'nonviolent situations where mental health issues are certainly implicated. So I think we should not miss this rare opportunity to really reform policing here in Alameda. Will it be a model for others to look at much in the way that people look at cahoots in Portland, Oregon?'",
        "'speaker_2': 'I don't know, but I know that, hey, you know, this is really this is a big deal that we're doing. And so I support this.'",
        "'speaker_0': 'Okay. Thank you. Councilmember Desai, I have vice mayor of L.A..'",
        "'speaker_1': 'Questions through the chair to Councilmember Knox. For the quarterly updates, how would you want those or how are you asking those to come? I just don't want them to necessarily be agendas on a council meeting and then become like massive updates.'",
        "'speaker_1': 'The second thing is, if we could just make sure that this gets agenda ahead of the one year mark, I would appreciate that.'",
        "'speaker_3': 'Okay. Yeah. Off agenda reporting seems great. Can always be put forward by a council member who wants to. And similarly, I think we can give direction to, you know, a month before the one year extension is is executed.'",
        "'speaker_3': 'Agenda. Is it for conversation? Okay. Then it will be. We know it's going to be all on. I mean, I borrowed great job of remember remember that? Remember late.'",
        "'speaker_0': 'Okay. Yes. Councilmember Harris Spencer.'",
        "'speaker_4': 'Thank you. For the record, I want to say that I am accepting all of the amendments from Councilmember Knox like. Thank you.'",
        "'speaker_0': 'Thank you. And I'll just go last. And I, I will say this. I, I have been persuaded, I, I've listened to many of the speakers for over a year now, and I have huge respect for you and the time and effort and passion you've put into to this.'",
        "'speaker_0': 'And again, I can't think. Assistant City Manager Jerry Bowden And if I was not in any way questioning your competency and the diligence with which you've approached this Herculean task, but I know there's also been more recent information, but I guess there always will be.'",
        "'speaker_0': 'And it is, as was noted, an iterative process. Thank you for all the representatives from Amalgamated Family Services, the fire department. Thank you. Especially Deputy Chief Del Bono. You really, really shed a light, really illustrated what's been going on, what's what's already in place.'",
        "'speaker_0': 'And and I appreciate that. And so I, too, will be moving to support this. I think it's appropriate that we we move forward expeditiously, meaning now and I know the city manager has heard all the concerns that were raised by in the discussions and that he and the assistant city manager will take all of those things into'",
        "'speaker_0': 'consideration when they're finalizing the negotiations. So I would say we just approved this motion and we don't even worry about that. Service provider agreement and Exhibit A, it's not even part of this, writes makers of the motion. So just remove that as an issue.'",
        "'speaker_0': 'So with that, Madam Clerk, would you please do the roll call vote?'",
        "'speaker_1': 'Councilmember de Shag. Yes. Herrera Spencer, I. Knox, wait.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Fella. I mayor as the Ashcraft I if that carries by five eyes.'",
        "'speaker_0': 'All right. Thank you. And thank you to everyone who's been involved and for, you know, really over a year on getting us to this point. So. Okay, everybody roll up your sleeves and we look forward to getting this program up and off the ground.'",
        "'speaker_0': 'Councilmember Knox. Right.'",
        "'speaker_3': 'So just a procedural I'm wondering, I believe the Dave Park item actually has a time sensitivity given that there's an upcoming grant. I would like to take that first since the other the other items and.'",
        "'speaker_0': 'Next it is the next when we should we should move quickly. Okay. So I.'",
        "'speaker_3': 'Am sorry. That's all.'",
        "'speaker_0': 'Right. But I'm I'm watching the clock to no. Good point. Okay. Thank you, everyone, for all involved. We're going to say good evening to you. Good night. And we are going to queue up item 70. Madam Clerk, could you please introduce that item to us?'",
        "'speaker_1': 'Adoption of resolution to apply for the San Francisco Bay Restoration Authority, measure a grant to fund planning and design of the park, and allocate 50,000 in matching funds if awarded.'",
        "'speaker_0': 'Thank you. And that. Okay. I have a suggestion. I know that we have, I believe it's recreation parks director Amy Wooldridge here to present, but I'm wondering if we might just oh I should stop and ask Madam Clerk, do we have public speakers on this item.'",
        "'speaker_1': 'We do have one. Linda Karlan. Oh, now do you?'",
        "'speaker_0': 'Okay. Okay. Okay. So good evening, Director Wooldridge. Good to see you, Councilor. How about we take our public speakers and then just because we're playing Beat the Clock here, we'll see if we have any questions of Ms. Wooldridge and perhaps we could then entertain a motion without even needing a full glowing staff report.'",
        "'speaker_0': 'But let's please start with our public speakers. And the first speaker is Linda Carlon. Right. Welcome, Speaker Carbone.'",
        "'speaker_1': 'Thank you. Can you hear.'",
        "'speaker_0': 'Me? We sure can.'",
        "'speaker_1': 'Great.'"
    ],
    "Adoption of Resolution to Apply for the San Francisco Bay Restoration Authority Measure AA Grant to Fund Planning and Design of De-Pave Park and Allocate $50,000 in Matching Funds, if Awarded.  (Recreation 10051400)": [
        "'speaker_4': 'First, I just. I will be very quick. I first want to thank Amy for all of her work and her energy and her expertize that she put into getting this project to the state we're in. I also want to thank the city staff and the council members and also CASA, who have been instrumental in bringing this project'",
        "'speaker_4': 'to this path to this point. As we said in our letters over time, DPA Park is an opportunity that that would be a must take. Without repeating all the details. I'll just say that it will make when it's built.'",
        "'speaker_4': 'They'll be a unique resource for wildlife because it's located. It'll have significant potential to sequester carbon. And it will be a beautiful place of respite and of learning for all our means. So we'll get are I'm speaking on behalf of urges you to vote in favor of the grant application and matching funding.'",
        "'speaker_4': 'That's it.'",
        "'speaker_0': 'Thank you. Our next speaker is Abby. Good evening. Speaker Abby.'",
        "'speaker_4': 'Good evening, Madam Mayor. Members of the City Council. Community Action for Sustainable Alameda seconds is the recommendation of the Audubon Society and the Sierra Club and others who have weighed in and supported this work. I did want to just say that we were very supportive of the idea of the matching funds.'",
        "'speaker_1': 'We think that that would make.'",
        "'speaker_4': 'A difference in the application. The city did apply last year.'",
        "'speaker_1': 'And was not successful and we really think that it is important to do the level of matching funds. If you recall, when we were at the budget hearings, we.'",
        "'speaker_4': 'Were looking for $280,000. So $50,000 would be a bargain.'",
        "'speaker_1': 'So that's it. Thank you very much. Coming.'",
        "'speaker_0': 'Thank you. Good night. Our next speaker.'",
        "'speaker_1': 'Is our last speaker. Okay.'",
        "'speaker_0': 'I'm closing public comment on this item. But, you know, actually, for the benefit of the public and I know this, voters can do this really quickly. In a nutshell, tell us what it is we're voting on in this resolution tonight.'",
        "'speaker_0': 'Please disclosure and welcome our recreation Parks Department director.'",
        "'speaker_1': 'Thank you, Mariza Ashcroft. And if I will keep it brief, but if we could please have a slide. The presentation, it's very version share while that's coming up. Deep park concept is it's a park in which all existing concrete from a formal naval base or air filled runway system is removed.'",
        "'speaker_1': 'And it's intended to inundate over time to create tidal wetlands and wildlife habitat and adapt to sea level rise. So what you see what we're presenting here, next slide, please, is a high level vision vision plan. That was it's from a high level vision plan that was conducted in the spring of 2020.'",
        "'speaker_1': 'And I want to really emphasize to counsel the community that there's significantly more work to do to solicit the broad and diverse community input. And this grant would do that through one component of what we're asking for funding in this grant.'",
        "'speaker_1': 'So $1.2 million grant is a master plan process that would be an in-depth process, community wide and with a diverse group of our constituents and all of our community. This plan before you. The vision includes elevated picnic area, bike, ped trails, viewing areas, and it also creates which is unique additional subtitled habitat including oysters eelgrass that sequester'",
        "'speaker_1': 'carbon. So this is a park that will sequester carbon pretty quickly. As was mentioned by one of the speakers by Ms.. Abbey, that the grant was not awarded last year. But we did receive a lot of positive feedback and constructive criticism that I've incorporated into the next grant application.'",
        "'speaker_1': 'One of those things was was wanting to see the skin city has some skin in the game essentially that the city is committed to this project and a funding match does that. The last thing I wanted to mention is that the Saturday on September 25th, the city in collaboration with Alameda Point Collaborative and CASA is hosting a'",
        "'speaker_1': 'tour of the park specific for Alameda Point Collaborative residents since they live out at Alameda Point. And so their voices are really important in this process. And so the tour will include education about parks in the area as well as wildlife at a limited point and overview.'",
        "'speaker_1': 'And then a design charrette really intended to learn more about what residents want from this park. And then all of that feedback from this event will be incorporated into the planning process. So with that, I'm open to any questions.'",
        "'speaker_0': 'Thank you. And I just want to say it was my privilege to work with Ms. Wooldridge on a newspaper article that I authored about D Page Park and the second our second chance efforts. And so thank you so much for all your hard work in helping educate me.'",
        "'speaker_0': 'So with that, I think I first saw Vice Mayor Vela's hand and then counts her not quite right hand. So I don't know if there's question or motion that Vice Mayor Vella know is that.'",
        "'speaker_1': 'I'm moving approval. And I think that if we can, you know, I appreciate the work that's gone into reaching out to the community. I just want to continue to encourage those conversations and to have them continue and to be meaningful and with the with the neighbors without move approval.'",
        "'speaker_0': 'Thank you. And by Councilmember Knox White.'",
        "'speaker_3': 'Yeah. So I will second the motion with my my also appreciation and just that the comment that I'm really glad that we've gotten here where where we actually are doing the outreach to the people who live there. And just a reminder to all of us that, well, we have lots of people who are experts in lots of'",
        "'speaker_3': 'places. We're not building something for everybody if everybody's not at the table. At the beginning, I one of my coworkers always has the if you're not at the table, you're what's for dinner. This is his his statement. And, you know, I really appreciate that we found a way to bring the bring bring the residents who actually will'",
        "'speaker_3': 'be closest to this park into the process before the process begins.'",
        "'speaker_0': 'Thank you. Thank you. And we have an emotion, a second comment. Councilmember Herrera Spencer.'",
        "'speaker_4': 'Thank you. I have a clarifying question. I know. And I noticed that in the vision plan B, paiva spelled as one word capital P and no hyphen. However, in the staff report it has a hyphen throughout. So my suggestion would be to come up with how we're going to spell it and then be consistent throughout.'",
        "'speaker_4': 'And also I want to confirm that we are not I noticed in a building 25 and 29, I actually want to have a whole discussion on whether or not what we're going to do with them. And I want to make sure to affirm that we are not agreeing to demolish those buildings by granted approving this grant.'",
        "'speaker_4': 'Yes. But we're not.'",
        "'speaker_0': 'Proving just for clarification, we're not approving a grant where we're approving a resolution to allow us to apply for a grant. And but I misquoted your you, Fiona.'",
        "'speaker_1': 'I just want to add that I didn't actually get to the final couple of slides for, for brevity sake, but building 25 and building 29 and then those and how they sit within the park will be a major topic of conversation for as part of the master planning process that this grant would fund and would enable.'",
        "'speaker_0': 'Right. Yeah. Okay. And I hope that it someday we find a new name other than the Pave Park, but it's a great place holder. Okay. We've had a motion, we've had a second clarifying questions. Anything further seeing them?'",
        "'speaker_0': 'Let's have a roll call vote, please.'",
        "'speaker_1': 'Some objection. CABRERA Spencer.'",
        "'speaker_4': 'I not.'",
        "'speaker_1': 'Quite.'",
        "'speaker_3': 'In support of the Pervy Park High.'",
        "'speaker_1': 'Vela High Mayor as the Ashcraft.'",
        "'speaker_0': 'I'm not going there, and I'm care if there's a hyphen or not. Oh, hi.'",
        "'speaker_1': 'Yes, I raised my five eyes.'",
        "'speaker_0': 'That's wonderful. Thank you so much. Good work. Thank you, Miss Walker. It's great to see you.'",
        "'speaker_4': 'Okay, we.'",
        "'speaker_0': 'We need to make a decision here. STAFF Or maybe Mr. Leavitt, you can help me. The we've got two more items to go and we've got, you know, 12 minutes. Do you think that item seven asks the public hearing to consider introduction of ordinance?'",
        "'speaker_0': 'Amending the municipal code to add a section prohibiting gasoline powered leaf blowers might be fairly quick, and we could try to get it done by midnight. Or should we just push it to another agenda? Because I don't I don't think that 70 is correct.'",
        "'speaker_0': 'But Mr. Leavitt, if you wanted to. I think you're still muted on one level.'",
        "'speaker_3': 'Oh, we've had a lot of public comment on it, but public comment, I know that there's been a lot of desire from many council members to add this come forward. So it could potentially be.'",
        "'speaker_0': 'Are we ready to queue it up? Should we give it a shot? Give it a go. I want to say that. Okay. Can we bring in let's see if that is your top.'",
        "'speaker_3': 'Thomas Andrew I think or.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_0': 'We, we is titled.'",
        "'speaker_1': 'Yeah. You want me to read the title what we recommend. Yes.'",
        "'speaker_0': 'I would love that.'"
    ],
    "Public Hearing to Consider Introduction of Ordinance Amending Alameda Municipal Code Chapter XXIV Public Health to Add Section 24-14 Prohibition on Gasoline-Powered Leaf Blowers.  (Planning and Building 20962710)": [
        "'speaker_1': 'Public hearing to consider introduction of ordinance many amendments book chapter 24 Public Health to add Section 14 Prohibition on Gasoline Powered Leaf Blowers.'",
        "'speaker_0': 'All right. And do we have any public speakers on this item?'",
        "'speaker_1': 'We do not.'",
        "'speaker_0': 'I'm closing public comment and. All right, I see we have both Alan Thai and Andrew Thomas. Take it away, gentlemen. And brevity is the key word here.'",
        "'speaker_3': 'I'm going to turn over Tallentire did all the work on this. Thank you.'",
        "'speaker_2': 'Good evening, Madam Mayor, Vice Mayor and city council members. I'm just going to make this very quickly. So there the city's Climate Action Resiliency Plan contains an action item to enact the ban on gasoline leaf blowers. Gasoline leaf blowers have been well documented as a source of greenhouse gas emissions.'",
        "'speaker_2': 'In Alameda, our Karp anticipates a reduction of 76 metric tons of carbon dioxide equivalent. So and many cities have enacted similar bans, most recently Oakland and Berkeley. The draft ordinance that is in front of you would ban the use and the sale of gasoline powered leaf blowers starting on January 1st, 2023.'",
        "'speaker_2': 'So that's a lead time of 15 months. The city staff plans to use that time to further outreach to.'",
        "'speaker_3': 'Property owners and businesses and.'",
        "'speaker_2': 'Allow the conversion transition to electric alternatives.'",
        "'speaker_3': 'And we've discovered that there are about a.'",
        "'speaker_2': 'Hundred landscape companies that do business in Alameda and we have all notified them. And so staff is recommending the introduction of this ordinance and I'm available for any questions.'",
        "'speaker_0': 'Thank you so much, Mr. Tie. Councilmember her Spencer.'",
        "'speaker_4': 'Thank you, Mayor. I had asked before. Is the city still using gasoline powered leaf blowers? The city?'",
        "'speaker_2': 'I believe I believe the answer is no. Our contractors are not using.'",
        "'speaker_3': 'Gas leaf blowers.'",
        "'speaker_4': 'Okay. Because I did receive a complaint, I think some of us have at one of the parks there. I believe that they did work for the city. So I would like clarification. I saw two other hands.'",
        "'speaker_0': 'Mr. BURTON, did you have your hand.'",
        "'speaker_3': 'That I'll I'll defer to City Manager Leavitt. So he's got the answer. I was going to clarify that we are converting to gas. I know I'm running away from gas, too. So and I it's getting late burning though too electric in our contracts with our outside contractors where the complaints have come from, what I've seen tend to'",
        "'speaker_3': 'be where we have outside contractors working for either public works or parks. I think it's for public works and some of our ride away areas and we're trying to convert those contracts and we're trying to do it consistent with this ordinance.'",
        "'speaker_0': 'Thank you for that clarification. Councilmember Harris Spencer, then Vice Mayor of L.A..'",
        "'speaker_4': 'Thank you. So I support this, but I, I hope that the city will finish the conversion of who we hire, who the city hires, as well as what we use, because we can be the leader on this thing.'",
        "'speaker_4': 'And so thank you very much.'",
        "'speaker_0': 'Thank you, Vice Mayor L.A..'",
        "'speaker_1': 'I just want to move approval of the ordinance as written, and then I hope that we actually follow and execute as the city and comply with it.'",
        "'speaker_0': 'Thank you, counsel, over there.'",
        "'speaker_2': 'So I'd like to second that with a quick comment. Finally, thank God, no more loud, obnoxious, odorous gas powered leaf blowers. Thank you, city staff.'",
        "'speaker_0': 'Thank you. All right, Councilman, relax. Okay.'",
        "'speaker_3': 'So I was. I plan to support the motion. My only potential change would be to consider whether we wanted to actually make it make make it go into effect immediately. But have enforcement not start until the 23rd? I'd say till 2023.'",
        "'speaker_3': 'So basically the same timeline for enforcement. But rather than giving a year and a half of people to be able to continue using leaf blowers, you know, people we can start making sure that part of the part of the education could be the phase in of people getting notices that, hey, these aren't allowed and we're going to'",
        "'speaker_3': 'start enforcement in the next year. So just throwing that out.'",
        "'speaker_0': 'So I actually would like to stick with the staff's recommendation. I have talked to some other cities where it's done and the education pieces is really important and the bilingual education and we are impacting people's employment. And so I bet.'",
        "'speaker_0': 'But the hope would certainly be that it happens sooner. But anyway, I but I do think the motion was as to the original ordinance, unless anybody wants to make amendments. Okay, let's. It is 1155. Madam Clerk, may we have a roll cover, please?'",
        "'speaker_1': 'Councilmember dialog. Yes. Aurora Spencer.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Knox Light.'",
        "'speaker_4': 'Hi, Bella.'",
        "'speaker_1': 'I mean, as Ashcroft.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'That carries by five eyes.'",
        "'speaker_0': 'All right. Thank you very much, staff. Mr. Time, Mr. Thomas. Thank you so much. And good work, counsel, for moving things along so expeditiously. So we aren't going to be able to get to item seven E today. So, Madam Clerk, help me out here.'",
        "'speaker_1': 'We you have two options with this item. You could just have could just put it back on the regular agenda for the next meeting without you taking a vote and considering it. If you wanted to put it in that continued section, you could you would it would require council vote to put it in that section.'",
        "'speaker_1': 'So it's up to Council's discretion.'",
        "'speaker_0': 'Counsel What do we think? We can have a vote to add it to the Section six, which means, if I understand correctly, it's heard before the rest of the regular agenda items at our October six meeting. But we have to decide quickly because time is running out.'",
        "'speaker_0': 'My man, Vice Mayor.'",
        "'speaker_1': 'Yes. I moved to put it in Section six.'",
        "'speaker_0': 'Okay. Do you have a second? Councilor Herr Spencer.'",
        "'speaker_4': 'My second.'",
        "'speaker_0': 'Okay. Any discussion thing, then? Maybe have a roll call vote with member station?'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'However, Spencer I Naxalites II, Valley High Mayor as Ashcraft.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'I'm curious my. If I might.'",
        "'speaker_0': 'Okay, that's great. Thank you. Okay. So the. We will take the city manager's comments and. And do we have the oral communications network?'"
    ]
}