{
    "Public Hearing to Consider Adoption of a Joint City Council/SACIC Resolution Approving the Development List of Affordable Housing Projects and Funding Request for Such Projects as Requested by the Alameda Unified School District (AUSD); and \nRecommendation to Authorize the City Manager to Submit the Recognized Obligation Payment Schedule (ROPS) and Administrative Budget for the Period from July 1, 2021 to June 30, 2022 to the Countywide Oversight Board.  (Community Development 207)": [
        "'speaker_0': 'Thank you, Madam Clerk. Okay, I see a distinguished list of staff and consultants in front of me. Just let me know who is going to present this item.'",
        "'speaker_4': 'Lisa Fitz is going to present this item.'",
        "'speaker_0': 'Thanks, Ms.. Maxwell. I see your name.'",
        "'speaker_4': 'This shit. I'm here.'",
        "'speaker_0': 'Here you are. And now I see all of you. Well, at least from the shoulders that. Welcome. Happy New Year. And please, the floor is yours.'",
        "'speaker_4': 'Thank you. Madam Mayor, council members and staff. Every year, the successor agency to the Community Improvement Commission is required to prepare the ROPS, which stands for a recognized obligation payment schedule. The ROPS includes the cost of managing the enforceable obligations of the former Community Improvement Commission and includes project and staff costs.'",
        "'speaker_4': 'There are five outstanding obligations boundary repayment Alameda Landing Disposition and Development Agreement, the operating subsidy for Independence Plaza, the Boat Works Settlement Agreement, and the Guidant Judgment Settlement Agreement and School District Pass through agreement. In the packet. There are two exhibits that list the remaining obligations and anticipated payments for the upcoming fiscal year.'",
        "'speaker_4': 'It should be noted that Exhibit one shows a lower administrative cost, while Exhibit two shows 160,000. Exhibit two contains the correct number. And that concludes my presentation.'",
        "'speaker_0': 'Thank you. So, Counsel, do we have any. Any questions? Clarifying questions about the staff report. CNN. Madam Clerk, do we have any public comment on this item?'",
        "'speaker_2': 'We do not.'",
        "'speaker_0': 'Okay. Would anyone like that? Well, I just want to say a little bit about this item, because I think it's pretty exciting. Well, I mean, repayment of bonds or whatever they are. But this this recommendation includes providing approximately $2.032 million in redevelopment property tax trust funds to be allocated to Rose Fields Village, which is, I want to'",
        "'speaker_0': 'say, our oldest housing authority property. But now it is under construction being rebuilt and actually made into more units because there were some really big units, actually misfits. Why don't you tell us a little bit about that and tell us the connection to a USD two, if you would?'",
        "'speaker_4': 'Sure. Rose Field Village, like you said, is owned by the Housing Authority. It contains modular built units that have been demolished and currently construction is ongoing at the site. The construction has will result in a total of 92 units on the site.'",
        "'speaker_4': 'Some of the existing stick built buildings will remain and be rehabbed and then but in total, we will have a larger, denser building on the property there. And then in terms of the second part of your question, the relationship to the school district, the housing authority has a an Emmylou with the school district and the school district'",
        "'speaker_4': '. Let me back up. The school district receives Rob some money. And that money may be used for the development of housing for school district employees. Obviously, the housing authority has expertize in affordable housing development. They have entered into an Emmylou with the school district, and the housing authority builds affordable housing, and they will either set aside or'",
        "'speaker_4': 'provide a preference to school district employees in exchange for the funds that are provided by the school district to help build the affordable housing.'",
        "'speaker_0': 'And if I recall correctly, it's also school district employees who make of whose income qualifies for the affordable housing.'",
        "'speaker_4': 'Yes, they must be low income. Thank you for that clarification, Ray.'",
        "'speaker_0': 'So Council, I think Councilmember Jason, do I see your hand go up?'",
        "'speaker_1': 'Well, I was just going to make a quick comment and if if if it's okay to make a motion to accept staff recommendation. The quick comment is two. One is I recall many years ago former assistant city manager Rob Wunder talking so excitedly about the day that he helped bring the modular units to where they are over'",
        "'speaker_1': 'there on Eagle Avenue. And and I'm sure he would be just as excited today about the major modernization that we're doing over there and the expansion project as well. And the second thing I just want to say is, you know, I think this is a great partnership with the school district.'",
        "'speaker_1': 'And so I'm glad to see that that we're we're able to continue where we can when it comes to providing housing for for employees over at a USDA.'",
        "'speaker_0': 'Thank you. So you're making a motion.'",
        "'speaker_1': 'To make motion to a priestess recommendation.'",
        "'speaker_0': 'Great. And do I have a second? A vice mayor validates your hand.'",
        "'speaker_4': 'Go second.'",
        "'speaker_0': 'Okay. Any further council discussion thing then? May we have a roll call vote, please?'",
        "'speaker_2': 'Councilmember Jason Knox White.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Spencer. I think you're muted.'",
        "'speaker_4': 'Right.'",
        "'speaker_2': 'I think Villa.'",
        "'speaker_4': 'High may.'",
        "'speaker_2': 'Or as the Ashcroft high carries by five eyes.'",
        "'speaker_0': 'Perfect. Thank you. Okay. With that, that was our last agenda item. I now adjourn this special meeting of the city council and successor agency to the Community Improvement Commission, and I will call to order the regular city council meeting.'",
        "'speaker_0': 'Roll Call, Madam Clerk.'",
        "'speaker_2': 'Roll Call has been voted five present.'",
        "'speaker_0': 'Thank you. Thank you, staff for your presentations. That was great and happy New Year. Okay. And do we have any agenda changes for this evening's meeting? Councilmember de.'"
    ],
    "Introduction of Ordinance Authorizing the City Manager to Execute Lease Amendments for Rent Relief Programs to Rock Wall Winery and St. George Spirits Through the Loan Conversion Assistance Program for Rent Relief in Response to the Covid-19 Pandemic. (Community Development 858)": [
        "'speaker_4': 'A loan of a maximum of six.'",
        "'speaker_3': 'Months of rent. Again, attempting to help these tenants out in a.'",
        "'speaker_1': 'Challenging COVID.'",
        "'speaker_4': 'Environment, the tenants are required to meet specific.'",
        "'speaker_3': 'Requirements in order to qualify for this.'",
        "'speaker_4': 'Program. Namely, the.'",
        "'speaker_3': 'Tenants. Business operations had to be consistent with the long term land use and development plan for Alameda Point.'",
        "'speaker_4': 'They had to have 25 or more full time.'",
        "'speaker_3': 'Employees or generate significant.'",
        "'speaker_4': 'Sales tax. And then thirdly, they had to demonstrate to the city that there.'",
        "'speaker_3': 'Was a significant loss of income of 30% or greater since March.'",
        "'speaker_4': '17th of 2020. So these, to qualify, have qualified for that program. And in addition, if they then meet certain negotiated.'",
        "'speaker_3': 'Performance milestones that are set out in each of the respective amendments, they would have the opportunity to have some or.'",
        "'speaker_4': 'All of the.'",
        "'speaker_3': 'Deferred rent converted from the loan into a grant. So they would be forgiven to some degree for a portion of it if they met certain requirements that are spelled out in those amendments.'",
        "'speaker_4': 'And that that is what I have to share on this.'",
        "'speaker_0': 'Thank you, Miss Mercado.'",
        "'speaker_4': 'Yeah. I just wanted to add a little context, because we do have a new council member who was not here when the council approved and created this program. So just a little bit of gist, just a little bit of meat on the bones for you.'",
        "'speaker_4': 'Councilmember Herrera Spencer.'",
        "'speaker_0': 'Well, it's also good for members of the public, too.'",
        "'speaker_4': 'That's right. So the council had been grappling with how to provide some assistance to our tenants since March. And we have we've considered, I think, this program at least three times since March, just trying to get it right.'",
        "'speaker_4': 'And we initially came up with this program because we scoured around to look at what other landlords were doing. And what we discovered is that a lot of landlords were not really knowing what to do. And then there was this program where the landlords were landlord said, Hey, we can like share a little bit of the pain'",
        "'speaker_4': 'with you. And it was a little bit crafted after the Federal Government's PGP program, which, as you recall, gave businesses grants and if they met certain qualifications, the grants could or they were loans which if they met certain qualifications, they would convert into a grant and would need to be repaid.'",
        "'speaker_4': 'So we crafted our own program to look similar to that. We we think that we captured the large employers of our tenants. The reason we we pegged it to 25 was because there was, as you might know, another program for business assistance citywide for four businesses that had under 25 employees.'",
        "'speaker_4': 'So this was to supplement that and to hit that larger number. In addition, we knew that there were some some of our tenants, the larger tenants really needed help. So the council created this program. And then in October, they added that they after grappling with what this program would look like in October, the Council actually offered $1.5'",
        "'speaker_4': 'million to fund this program. So we had eight applicants and and then three of them did not meet the qualifications. And then three of them went to go to. Also in October, we created the program that you considered just earlier tonight, the 933 program.'",
        "'speaker_4': 'That's what I call it. Nine month deferral paid over three years and you could have up to three months deferred. So I call it 933. So three of the tenants decided to go with that program instead of the loan conversion program.'",
        "'speaker_4': 'So then we're left with these two tenants who who were offered the opportunity to do the 933, but really wanted to stay with this loan conversion and negotiate some milestones and really wanted to try to get the six months of abated rent.'",
        "'speaker_4': 'And the last thing I would just add is that when we negotiated these milestones for the tenants to meet, we really took into consideration the direction that the Council and the spirit that the Council had at the time.'",
        "'speaker_4': 'The Council was very specific that they wanted to to give some credit to that, for lack of a better description. Two tenants who have been community spirited and community minded, not necessarily just during COVID, but in general. And so you will see some of those milestones that are pegged for, you know, offering for providing programs or offering'",
        "'speaker_4': 'their space and things like that. And also the big one is the hand sanitizer, creating the hand sanitizer and distributing it citywide and a region wide, really. And then the council also really, you know, grappled with, you know, trying to be all things to all people and and realizing that we couldn't just give things away.'",
        "'speaker_4': 'And so they really wanted the the tenants to show that they had a hardship. And so that that that we looked at, we kind of worked over the financials of the tenants a great deal. We we think that we came up with some creative things.'",
        "'speaker_4': 'They're not perfect. But we thought that we captured the spirit of what the council wanted. The other thing that I think the council there was a some division, but the council really were they were saying if you if they can't open, we need to be able to help them.'",
        "'speaker_4': 'And there were some. Some council members went as far as saying we want to give them one month for every month that they're unable to open. And we couldn't do that. And so we kind of came to a happy medium.'",
        "'speaker_4': 'And that's what you see in front of you tonight. It's not perfect, but nothing about COVID is perfect. And we've been so we're we're trying to capture something that offers help but feels fair.'",
        "'speaker_0': 'Great indignation, Ms.. Mercado. And who is that? Just. I missed you.'",
        "'speaker_4': 'I just.'",
        "'speaker_0': 'Know. I'm sorry, Miss MAXINE. Sorry.'",
        "'speaker_4': 'No, no.'",
        "'speaker_3': 'Problem. I just wanted to jump in and say. And when we.'",
        "'speaker_4': 'Talk about not being able to be open, I think we really are meaning not being able to be open in the robust, full way.'",
        "'speaker_3': 'They were pre-COVID. They may.'",
        "'speaker_4': 'Be able to be open in some limited ways, but it certainly isn't.'",
        "'speaker_3': 'Providing.'",
        "'speaker_1': 'Them the.'",
        "'speaker_3': 'Income that they were used.'",
        "'speaker_1': 'To in the pre-COVID.'",
        "'speaker_3': 'Days.'",
        "'speaker_0': 'Yeah. Thank you for that clarification. And the reference to hand sanitizer, just for people listening and who might not know is that is our own St George spirits. And very quickly, at the beginning of this pandemic, Lance Winters, the he's got a a title that's more clever than CEO, but whatever it is.'",
        "'speaker_4': 'Like creative genius or.'",
        "'speaker_0': 'Something like that. Anyway, he pivoted because they already had all the FDA approvals for what they were producing in terms of spirits. He pivoted to producing hand sanitizer and I mean for Alameda County Health Systems, the Highland Hospital Center and for public safety departments around the region, what I did not know is they were giving all that'",
        "'speaker_0': 'away. They weren't charging anyone anything. I did not realize that. So not only did they help their production of spirits, but they started producing hand sanitizer and donating it. So that is just kind of carrying out the community spirit that we've seen from this and in other businesses, too.'",
        "'speaker_0': 'So thank you so much for for the explanations. And then let me ask two questions. If staff has any clarifying questions about the staff report, and then I'll ask the city clerk, do we have public speakers on this item?'",
        "'speaker_2': 'We do not have any public speakers.'",
        "'speaker_0': 'Okay. Clarifying questions. Or if we don't have public speakers, we can actually just launch into our council discussions, I think. I think Councilmember de SAC, I saw your hand go up. Then I saw Councilmember Spencer. So let me take you in that order.'",
        "'speaker_1': 'Okay. Well, thank you. You know that that break was very helpful. It allowed me to kind of reflect on on and reflect more on kind of the concerns that Councilmember Herrera Spencer had raised, because I think they are there.'",
        "'speaker_1': 'They apply here as well. So what I'm kind of concerned about is and I'm concerned about that now retrospectively from the previous issue, but I think it applies here is is coming up with a policy after the lease agreement has already been agreed to or not the lease agreement, but the agreement for the program has already been'",
        "'speaker_1': 'agreed to. So so, you know, is there and the question that I have for staff is, you know, is there anything about now where we can. Deal with, you know, the policy issues regarding how to guard against overreach.'",
        "'speaker_1': 'Is there anything about how we can deal with those policy issues now? Because I'm realizing that and the previous issue, I realized that, well, maybe we should have dealt with the policy issues before agreeing. So so so that's the question that I have.'",
        "'speaker_4': 'Well. Well, any.'",
        "'speaker_0': 'Party. I, I think I see. Vice Mayor Vella, did you want to comment on that or. I'm a conservative.'",
        "'speaker_4': 'I guess I just I have a concern about what's been agenda is specifically in terms of what we're talking about. I hear the concerns, but the main goal, my understanding is that we are trying to give financial assistance to some of our tenants.'",
        "'speaker_4': 'So I guess this this kind of I just I'm trying to understand how a conversation about overreach comes in when when we're how it comes in relative to what's been agenda ized. And I feel like we keep going.'",
        "'speaker_4': 'We're talking about something that's not really before us.'",
        "'speaker_0': 'Okay. Thank you. I'm a.'",
        "'speaker_4': 'Little concerned about.'",
        "'speaker_0': 'Mom. Okay. And before I go back to Mrs. Spencer, did I hear Ms.. Maxwell start to address that concern? No.'",
        "'speaker_4': 'No.'",
        "'speaker_0': 'Thank you. Okay. Councilmember Spencer, I'm your muted.'",
        "'speaker_4': 'Right. Thank you. And I wanted to go back to I did have clarifying questions. And once again, I wasn't I haven't been involved in all these meetings that you all have and staff member McConnell she raised this issue of a described and thank you very much.'",
        "'speaker_4': 'I thought that was very helpful for me this 933 that there if I have it correctly after each year that one year then is that one month is abated. So a tenant pays 11 month, one month is abated.'",
        "'speaker_4': 'And then I look at this and I think that maybe I'm mistaken about the 933. And so I thought that was what I heard three years, three months end up getting abated after like that. So with this, my understanding is that it's.'",
        "'speaker_3': 'Up to.'",
        "'speaker_4': 'Six months that can be abated and that's about maximum figure is and that's why it's different for each tenant. But but I was trying to figure out how do they get especially like when you're talking about the hand sanitizer, which is wonderful that they did it, but do they get the abatement right up at the front so'",
        "'speaker_4': 'that at six months it was taken away that they owe from the beginning? Or is it each year that they pay 11 months and then one month? So after six years they then get one month abated. How how does that connect?'",
        "'speaker_0': 'This. Nelson Who wants to take that?'",
        "'speaker_4': 'I don't care. At least if you want to answer, that's fine. Yeah. I mean, as the event, as they met the event is, they provided the evidence.'",
        "'speaker_3': 'Associated with the particular event and they would get the opportunity to abate that amount of time and it would be applied thereafter. Does that respond to your question?'",
        "'speaker_4': 'So can I just add a couple of things? All right. So you are correct. Councilmember Spencer, these are two separate programs. So the 933 was the one that was discussed prior and that prior action. And this is the loan conversion program.'",
        "'speaker_4': 'And for example, the the I believe that at the time we, I negotiated the, um, the agreement for lone conversion. They were not near the number that we put in there for hand sanitizer. So it was a goal for them to, to meet.'",
        "'speaker_4': 'And when they meet that goal, then they would provide proof to the city that they've done it and then would say, thank you very much, that's one month's rent abated. And then let's say they did something else and they they provide evidence that they reached that.'",
        "'speaker_4': 'We would say, thank you very much. That's two months, you know, so it's ongoing for a three year period of time.'",
        "'speaker_0': 'Thank you, Miss Maxwell, that you have?'",
        "'speaker_4': 'No, I think.'",
        "'speaker_0': 'That.'",
        "'speaker_4': 'We got it collectively.'",
        "'speaker_0': 'Teamwork on Mr. Spencer. Council member. Spencer.'",
        "'speaker_4': 'Thank you. So, going back to the hand sanitizer, have they already performed the amount of hand sanitizer being distributed so that they've already earned the stream up to three months, I believe it was. Or what? What are you looking for on that?'",
        "'speaker_4': 'So I believe that I, I don't I'm not recalling off the top of my head, but I think we had like a 3500 or something like that in the agreement. And I believe that they were at like 2000 when we negotiated.'",
        "'speaker_4': 'So they have they have more to go.'",
        "'speaker_0': 'And I'll just add a little spoiler alert. The Mr. Lance Winters is waiting to be one of our public speakers. So as soon as we finish clarifying questions, we can hear when we can learn what his title is that's escaping me.'",
        "'speaker_0': 'So Councilmember Spencer.'",
        "'speaker_4': 'Thank you. So yeah, it is the 3600 from the report at least. And so I don't know the relationship between if they do 12 and then they get a certain dollar amount. So and then they like that or or so so it feels like and this is where now I from member datacom I feel like this has'",
        "'speaker_4': 'already been negotiated. You have a candidate that's already been performing and now it's coming to us essentially for ratification is what I'm hearing. Which I am. Is it my concern? So we were responding to the spirit of the conversation in which the council had when we created the program.'",
        "'speaker_4': 'And so, yes, they are they are producing hand sanitizer. The big bulk of it has been done. But we wanted to encourage that. They continue to do that and continue to be a community partner. So we set a goal for them.'",
        "'speaker_4': 'I mean, the the point of this program is to create performance measures. And so from the 2000 where they were to the 3600, we thought that that was worth something to us and to our community and should be rewarded with with an abatement.'",
        "'speaker_4': 'And so while I understand what you're saying, it feels like it's like they're getting credit for things they've already done, but it's not it's things that they're doing that the council said, Hey, we want to acknowledge people who are doing things in our community to help and to that, that's why that measure was created.'",
        "'speaker_4': 'But if I have it correctly, it's 115, $118,000 that we're being asked not to have them pay to offset 3600 gallons. So is there some did someone put a value on 3600 gallons? Because as we all know, we have many and we're fortunate we have many members in our community that are stepping up and not necessarily receiving'",
        "'speaker_4': '$118,000 value to offset their donations to the community.'",
        "'speaker_0': 'And your question was, how did they reach the calculation? That my calculation.'",
        "'speaker_4': 'And we didn't do that. We didn't do the value of each gallon of hand sanitizer for the rent. I mean, we were being responsive to the council's direction, which was help these people help the community and let's acknowledge them so that we can help them.'",
        "'speaker_4': 'And I mean, so none of these tie back to, you know, a mathematical equation that says, you know, 1000 gallons of hand sanitizer equals this X amount of dollars, which then is applied. If the council wants to do that, then we just need to figure out what a gallon of hand sanitizer is worth and then do that'",
        "'speaker_4': 'math. But we were following the spirit and the direction and which the council had given us when they created the program, which was acknowledge that they're doing something. I mean, because we were at the point where there was some council conversation which was give them one month for every month that they're closed.'",
        "'speaker_4': 'And that would have been way more than what we're discussing right now.'",
        "'speaker_0': 'Thank you, Ms.. Mercado. I also just note that there is a reason that the term unprecedented is used over and over when describing the events of the last ten, almost 11 months as Sandy, how it's over. The food bank says, This is my first pandemic.'",
        "'speaker_0': 'It's mine, too. But I do want to commend staff for, I think, doing a Herculean effort at trying to interpret staff and counsels direction and wishes. So any further clarifying questions, Councilmember Spencer, you still have the floor.'",
        "'speaker_4': 'Yes, thank you. So when I look at the agreement here, it has year one, two and three. So is this really a three year lease? But during the payments over three years, they will have the opportunity to have six months.'",
        "'speaker_4': 'So essentially abated. So essentially two months per year. Whereas the prior one we were looking at was one month per year. And the city is also, you know, landlords for residential. We have renters. All right. Is this something that we're offering to those trying to figure out how we choose which tenants we're helping?'",
        "'speaker_0': 'And again, I would just maybe channeling the city attorney. I just make sure that we are talking about the specific item before us.'",
        "'speaker_4': 'Also, I would just say the previous one was three months per year because that's how you three, three and three, they get to the nine months. And so this one is a shorter one. And then, I mean, if I may answer a little bit, the residential tenants are receiving what every residential tenant is receiving citywide.'",
        "'speaker_4': 'We did not do a special program for them. They are under the city's residential agreement. So while so we're following that edict, the city is subject to what every other landlord in the city is subject to. Okay.'",
        "'speaker_0': 'Thank you. Any further clarifying questions? Council. Yes. Sorry.'",
        "'speaker_4': 'So I heard. I'm sorry. So it was three, three, three. So it's three months per year. That was the date after being abated on the other contract. Right. And this is two months per year then. So the first one is nine months within the between March of last year and June of this year can be abate.'",
        "'speaker_4': 'It can be deferred. Then they have three years. They pay it back three months over a three year period of time. So so for the next three years, they're paying back at least three months of those nine months that were deferred.'",
        "'speaker_4': 'And if they pay back early, if they have a banner year this year and they pay back everything, then they get a they get an abatement for every year early that they pay. So if they pay back three years early, they're going to get three months abated rent.'",
        "'speaker_4': 'So essentially, they're going to get. I'm sorry. I'm sorry. I just want to clarify that the maximum is one month per year, though, because they have three months for three years. But when I look at this one, it looks like the maximum is two months per year.'",
        "'speaker_4': 'There is been offered to be abated and not paid by the tenants. No, there and they have the same thing. They have six months between March of last year and June of this year. So they can pay they can abate six months within that same time period.'",
        "'speaker_4': 'And then they have three years to meet those those milestones to to get to the abatement. But that six months evaded, if I'm hearing you correctly, that is six months. That's correct. That's three years or three years per year for the other program.'",
        "'speaker_4': 'One month per year? I think that's correct. Well, I don't think they were thinking of it as that per year, because what if they meet all their milestones in one year, then they'll get all six months abated. But what if it if it takes them three years to meet all their milestones, then they will have had their'",
        "'speaker_4': 'six months abated. So we're not unlike the other program, which requires them to pay at least three months per year to get to the nine month repayment. This one doesn't have that requirement. This just says meet these milestones.'",
        "'speaker_4': 'In whatever order you can. So they could receive the credit for six months immediately and then at some point unfortunately not be able to continue paying rent in years two and three, whereas the other programs they pay 11 months, they get one month abated, they pay 11 months, they get one month abated.'",
        "'speaker_4': 'This is what it sounds like. They could get abatement for six months upfront, not pay rent for six months, and then at some point not finish the balance and be unable to pay back. Well, I mean, that that's correct.'",
        "'speaker_4': 'There's a default risk with each of these with each program. I mean, the first program could get nine months deferred rent and then be able to make the three month payment in the next year. I mean, so there's a risk there as well.'",
        "'speaker_4': 'And then they won't get any abatement. We won't get any rent. So there is there is a risk of default in both programs. There's the first program. There's there could be a risk of a nine month default. And in this program, there could be a risk of a six month default.'",
        "'speaker_4': 'Thank you. Sure.'",
        "'speaker_0': 'All for now, Miss Spencer. Yeah. Okay. So then any other clarifying questions before we go to our public speakers? All right, Madam Clerk, our first public speaker, please.'",
        "'speaker_2': 'Lance Winters.'",
        "'speaker_0': 'Good evening, Mr. Winters. Happy New Year. Welcome.'",
        "'speaker_3': 'Good evening. Happy New Year, Madam Mayor. Council City of Alameda Council Staff. Everyone, thank you for your your careful stewardship of the city and for considering all this. We find ourselves at a strange place after nearly a year.'",
        "'speaker_3': 'And I just want to come back and point out that at the beginning of this whole thing, I don't think any of us had any idea how long it was going to last. And we exchanged words. Spirits knew that we needed to do something, and we invested thousands of dollars in the additional ingredients that we would need'",
        "'speaker_3': 'to manufacturing hand sanitizer. And those were those were things like glycerin and hydrogen peroxide and packaging supplies, because we don't typically package things like this. A number of small distilleries across the country pivoted to make hand sanitizer, to make up for losses in sales of their products and charge astronomical fees to.'",
        "'speaker_3': 'To address Councilmember Spencer's questions about the cost and value of hand sanitizer. We were seeing it go for upwards of $50 a gallon in bulk rates. And so that's it's a significant amount of money. We spent thousands of dollars to be able to make this without the intention of ever selling it.'",
        "'speaker_3': 'We wanted to be good members of our community. We wanted to help support people who were in need. This seemed like a time when everybody was in need and we had the ability to make this. We had the bulk of the ingredients already on hand.'",
        "'speaker_3': 'So we didn't we didn't sit and labor over who deserved it, who who should be paying what. We just said, let's make this and let's put it out there to our community because our community needed it and that was it.'",
        "'speaker_3': 'And and I think that's the I think that's the spirit that we should all be operating under during these trying times is looking out for one another. We would have been doing this regardless of any sort of programs the city would put in place.'",
        "'speaker_3': 'And honestly, you know, if you don't take it into account, that's totally understandable as well. And if we don't get if we don't get the the rent abatement passed, we will continue making and giving sanitizer away because it would be criminal not to.'",
        "'speaker_3': 'But I do appreciate the council taking the time to to be able to consider this abatement for us. And thank you all for that.'",
        "'speaker_0': 'Thank you, Mr. Winters. And do you have another speaker, Madam Kirk?'",
        "'speaker_2': 'That was our only speaker.'",
        "'speaker_0': 'Our only speaker. Okay.'",
        "'speaker_2': 'So another person has raised in Lord their hand, but I think I'm listening.'",
        "'speaker_0': 'Okay. So if anyone would like to speak now on this item six B, please indicate the way you need to do that. Otherwise, I am closing public comment and so we will go to council discussion. Who would like to lead council everyday?'",
        "'speaker_4': 'Well.'",
        "'speaker_1': 'Great. Well, thank you very much. You know, let me start by a kind of overarching view of the ordinance process and and the way in which these agreements have come up this evening for me, since I kind of like stumbled into the first one, kind of really implicates that process.'",
        "'speaker_1': 'So the way in which ordinances are adopted or passed in the city of Alameda and I suspect a lot of other places, is that there are two readings. There is the first reading. And then 30 days after there's another reading, there's a final passage.'",
        "'speaker_1': 'And then and then 30 days after the final passage, the ordinances is is or an agreement is adopted. So I think the reason why we have that is because we want to be in a position that if there is new questions or new information that comes to light, if there are new ways of seeing things that that'",
        "'speaker_1': 'we perhaps missed on the first go around, that we can catch it on the second go around. I'm. And I think it's it's the fact that new member or returning member actually returning member council member Herrera Spencer had pointed out concerns about the way in which COVID 19 enforcement violations might be pursued by staff.'",
        "'speaker_1': 'It's a new for me, it's a new information. And I didn't grasp it as quickly when we were first discussing this matter about 45 minutes ago. But as I look at number four of the agreement, Section four is about COVID 19 enforcement violations.'",
        "'speaker_1': 'I think the new lens with which.'",
        "'speaker_0': 'Councilmember Desai, excuse the interruption, please hold is time. Could everyone who's not speaking please mute your microphone? We are getting some background noise and I'm not sure where it's coming from. So if you're not the speaker, please mute.'",
        "'speaker_0': 'Thank you. Sorry. No problem.'",
        "'speaker_1': 'Okay. So. So I appreciate the the point that I believe Councilmember Herrera Spencer was getting at in terms of guarding against overreach, because I'm looking at for section four, I, Double-A, Triple IV. And it does seem a little cut and dry.'",
        "'speaker_1': 'Now I get that. Earlier tonight, we talked about a framework by which we might deal with guarding against overreach and that framework which is coming up with policy language. But the question I still have is. Might we adopt policy guidance language offline first?'",
        "'speaker_1': 'Before we adopt the the agreement or if the city attorney has other suggestions to how we might deal with policy guidance now or offline. I'd certainly be all ears because because I do think that, you know, taking the points that were raised previously, because they're applicable now, right now, I do think that we need to hammer that'",
        "'speaker_1': 'out for us. We need to hammer out guarding against the overreach issue that was raised earlier. And I think it still is still an issue because I'm looking now with a new fresh set of eyes asked for. And and I'm realizing that, okay, I think there are some good points that were raised.'",
        "'speaker_1': 'And I think we should we should discuss it. So I'll leave it at that.'",
        "'speaker_0': 'Vice Mayor Vella, I'd say you're having good.'",
        "'speaker_4': 'I actually think that we laid the foundation for addressing that issue and doing it in a way that comports with and complies with the Brown Act in terms of agenda, using it properly and allowing for a thorough discussion.'",
        "'speaker_4': 'So I'm actually not interested in having something transpire in a way that would be pausing this meeting to try to circumvent the Brown out to do something in a nontransparent way. That would be a concern of mine. The other thing is we heard from Lance Winters, who is, you know, literally one of the one of the two'",
        "'speaker_4': 'parties that would be entering into this agreement with the city. And this issue was not raised by him and he was paying attention to this meeting and the previous meeting. So I'm wondering if we aren't jumping down a rabbit hole that's of our own creation, as opposed to addressing the issues brought forth by the businesses that we're'",
        "'speaker_4': 'actually trying to help. And I don't want to lose sight of the bigger picture, which is providing that financial assistance to businesses who have been good community members, who have risen to the occasion during this pandemic to not only be good businesses and trying to keep people employed, but also being stewards to the community in terms of'",
        "'speaker_4': 'providing services. And so I, I, I really want to focus on that. I think the path that we laid out on the previous agenda item is going to apply to all of these different things. I think that it's a red herring to say that we're overreaching when in fact what we are trying to do is provide a'",
        "'speaker_4': 'benefit to to the businesses and keep them afloat. They're not raising this issue. And I think we've gotten really off topic and off path. And I think we've laid the foundation will have that conversation. If there is a concern for this hypothetical overreach, which again, I want to remind my colleagues is a hypothetical that's been created by'",
        "'speaker_4': 'us. It's not something that's actually occurring or an issue that's actually been raised by any of these businesses. So I am inclined to support what's been put before us tonight. I think that we need to focus on that, making sure that we address the immediate hurdles that lay before our businesses to keep them afloat.'",
        "'speaker_4': 'And then we can deal with this issue. It's going to come back to us on the issue of a potential hypothetical. Maybe it will happen, overreach will come back to us in February and we can have a robust and transparent public conversation that's been agenda ized pursuant to the Brown Act in our Sunshine Ordinance.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Anyone we haven't heard from yet? COUNCILMEMBER That's why, before I go back to Councilmember Spencer.'",
        "'speaker_3': 'No, I think so. For Councilmember Baysox benefit, because it wasn't at the at the earlier thing. I do think that there is some consistency that needs to happen between these, even though these are different contracts. I think having different sets of expectations in different contracts is problematic.'",
        "'speaker_3': 'And I do agree with Councilman Vice Mayor Bell. Now I'm going to start calling you Councilmember Vice Mayor Avella. You know, I agree with that. I think we have addressed this issue. The businesses that have signed on to that have already we've already approved their contracts, signed on to a very vaguely worded thing that said one.'",
        "'speaker_3': 'One violation is a problem and would cause them to to lose their funding. I think, you know, I raised some concerns about about the vagaries of that. And we we took some action. Councilmember her Spencer has highlighted that she has some further concerns about that.'",
        "'speaker_3': 'And I think we can address those as a part of the policy. It's how it's being addressed now, and it is actually after the fact adding additional protections to an agreement that these businesses have already said they are comfortable with.'",
        "'speaker_3': 'And therefore, I'm comfortable moving forward and I hope that we can do so. I appreciated the email we received in December from Saint George Spirits asking us to please take action as fast as possible. And the idea of putting a halt on this and waiting a month or a month and a half to to really hammer something'",
        "'speaker_3': 'out just does not seem wise. We've been through this whole thing saying we need to act fast. We need to act when people need the help so that they don't get to a place where we are taking action after it's already too late.'",
        "'speaker_3': 'And I think that we're getting to some places where we're at risk of that. So I'm happy to support the staff recommendation.'",
        "'speaker_0': 'Thank you. Councilmember Knox White Councilmember Spencer Tracy and. You might still be muted.'",
        "'speaker_4': 'Thank you. I was. Appreciate that. One of my concerns in regards to asking about the rent being abated is that these are monies that then would go to the base reuse fund by city money. And I feel like there needs to be some balancing act between what is being abated and what someone in the city is receiving'",
        "'speaker_4': 'or somehow a council has determined. It connects, right, that there's some relationship. And because this money is not our money is and we're talking about approximately, I think, 300,000 that we're talking about abating, which would be money that the city has not received.'",
        "'speaker_4': 'So I want to put that in the context as much as I want to help these businesses. I also want to be able to provide services and whatnot for our community and do the. Repairs and whatnot at the bay so that we can continue to support all of our tenants and our community members out there, including those'",
        "'speaker_4': 'that live out there. Right. So this is this is, as I see it, as honestly, a big ask. We have many and I appreciate the program of up to 7500 for a certain tenant, I mean, across our town.'",
        "'speaker_4': 'But here we're actually talking about hundreds of thousands of dollars, not 7500. So that I think it is important to be clear on what the ask is. And then in regards to the paragraph, I appreciate member day for expediency that the language is actually very specific in the contract.'",
        "'speaker_4': 'The city may. Upon the written approval by the city manager and city attorney in their sole and complete discretion, impose some or all of the remedies, including the tenant shall immediately owe and pay to the landlord. All unpaid deferred base rent together with late charges interest do a reason to me that is not just loose language at'",
        "'speaker_4': 'all. It's actually extremely precise. And that's why I have the concerns that it does not allow for the discretion. It actually says any. It doesn't say anything about the type of violation. So that's why I see that as a concern.'",
        "'speaker_4': 'And I think it is important to balance that regardless of what my other colleagues have done in the past. I think it just and I, I do appreciate the memory. So I have read this and I think it is an important issue to be addressed.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Thank you. And Councilmember Spencer, just so that we don't mislead anyone in the public who doesn't have the benefit of having this agreement in front of them, I continue reading where you left off because it does say that the city may opine that the written approval of both the city of Alameda City Manager and city attorney in'",
        "'speaker_0': 'their sole and complete discretion, impose some or all of the following remedies. And yes, Tenet, one of them might be that the tenant shall immediately owe and pay the landlord all unpaid deferred deferred base rent together with bank charges and interest.'",
        "'speaker_0': 'And the next option, though, is that the possibility is the tenant shall return to landlord within ten days of the date of the written notice from the city, all previously earned rent credits defined below or the tenant another option.'",
        "'speaker_0': 'The tenant shall not be entitled to any further benefits established by and described in this amendment or the fourth possibility. Tenant shall timely and fully comply with the remedies imposed by the set the city under this subsection. If they and and again this is after they've met with been warned had a chance to cure.'",
        "'speaker_0': 'But it also, as the vice mayor reminded us, is coming back to the council for further refinement of policy by this council. So it's there's a lot of permissive language. And it and again, I want us to all keep in mind the reason we're doing this is to stem the spread of COVID 19 so our businesses can'",
        "'speaker_0': 'reopen again, our kids can go back to school. But you raised a good point about the base reuse fund. And I want you, if I can, call on city manager Eric Levitt to just tell us what you've addressed before.'",
        "'speaker_0': 'When we've discussed the base reuse fund, it is true that this money would come from it. But what's the what's the condition of the base reuse fund and how will this impact it?'",
        "'speaker_1': 'I think in the short term, definitely it puts pressure on the base reuse fund in the short term. I think we're looking at the long term as far as the business is out there and we're trying to make sure that we keep attractive tenants out there and that we have strong tenants out there.'",
        "'speaker_1': 'And I think we're trying to help them work through this time so that long term we continue to have these tenants out there and then that would replenish those funds that would be lost in the short term. So that's what we're trying to do.'",
        "'speaker_1': 'But this is a difficult financial time for the city as well as for for the tenants, for sure.'",
        "'speaker_0': 'Death to quote from the. Thank you, Mr. Levitt, and to quote from the financial impact paragraph on page four of the staff refer staff report fund eight five, which is the base for use fund received 16.6 million on a revenue budget of $14.2 million, which and that was in fiscal year 2019, 2020.'",
        "'speaker_0': 'So it received $16.6 million on a revenue budget of 14.2 million, which added over 2.4 million to the fund balance. So the reduction of $393,140 is unlikely to adversely affect the health of the fund in fiscal year 2021, but 20 and then 2021.'",
        "'speaker_0': 'But I think the other point is that we don't know where this when this is all going to end. I'm really hopeful that the vaccines get here in a timely manner. We get people vaccinated that 80% to get our herd immunity.'",
        "'speaker_0': 'But how long that will take, we don't know at this point in time. So that's why it is really important to make sure that in addition to our largesse to our business community, we make sure that the very logical and sensible orders of the public health officer are being followed.'",
        "'speaker_0': 'And it's not that we try to play gotcha, but we don't want to be creating problems for other businesses or specific businesses by ignoring the public health officers orders. And I will say that in all of Alameda, I think we had very few businesses cited for for violations.'",
        "'speaker_0': 'So anyway, I thought. Councilmember Desai.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'Yeah. No, I don't see myself supporting this agreement until we have the protected policy, the language regarding protecting against overreach, I'm not going to support this.'",
        "'speaker_0': 'And notwithstanding the policy agreement that's coming back to us in February.'",
        "'speaker_1': 'No, no. You know, that was a lesson that I had learned on the first go around, as if I had to do it over again. I would have I would have said, let's get the policy, hammer out the policy first guard against overreach.'",
        "'speaker_1': 'I think it's a real issue. Other people might not think it's a real issue. I think it's a real issue. So I'm not going to support this until I see it.'",
        "'speaker_0': 'Garrett Thank you. Visalia Villa.'",
        "'speaker_4': 'So we heard twice from one of the business owners asking for aid. And I just want to understand, my colleagues that you want to withhold aid to these businesses, you want to withhold financial aid to our businesses. You would rather see our businesses suffer financially.'",
        "'speaker_4': 'Because of a hypothetical issue that we are going to address before the contract is even even going to be enforced. I'm just trying to understand where the issue is, because the business owners themselves have not raise these issues.'",
        "'speaker_4': 'They're not expressing a concern about an overreach. And we have an opportunity to actually address it because of the timeline. This is the first reading. There would be a second reading and there's a 30 day period. Correct after that.'",
        "'speaker_4': 'Madam Mayor.'",
        "'speaker_0': 'Yes, according to his staff, has told us so.'",
        "'speaker_4': 'So ultimately we have time to enact the policy, but we're going to withhold. Your plan is to withhold financial aid to businesses that are struggling. We'd rather see our businesses go under or struggle financially. And we'd we'd we'd rather see people lose their jobs.'",
        "'speaker_4': 'I'm just I'm trying to understand.'",
        "'speaker_0': 'How a council member decide they want to address.'",
        "'speaker_1': 'I think I said my piece.'",
        "'speaker_0': 'I right.'",
        "'speaker_1': 'We need to guard against overreach.'",
        "'speaker_0': 'Okay. Councilmember Spencer.'",
        "'speaker_4': 'Thank you. You know, I really do appreciate the vice mayor's comments. And I was going to put it in perspective. I think there is a compromise here that removing the paragraph regarding the COVID 19 enforcement violations that I think she so eloquently describes is hypothetical.'",
        "'speaker_4': 'So I think I would be very comfortable moving forward if we remove that paragraph that honestly, I would agree. It's a hypothetical, apparently these differences and I think they truly are good, solid basis and we don't have that issue with these businesses.'",
        "'speaker_4': 'So I don't even know why it was added. I actually don't. I think it was overreach to add it. I think we can trust our businesses, work with our businesses like every other business in town that they don't need a hammer on them.'",
        "'speaker_4': 'I mean, so I say this is why in the world was it even admits a hypothetical, so let's remove it in its entirety and then I'm more than happy to support that. Thank you.'",
        "'speaker_0': 'Vice Mayor Valet.'",
        "'speaker_4': 'Because as my learned colleague so eloquently pointed out earlier in this meeting, we are giving them substantially more financial help than all of the other businesses in town, and we're giving it from an account that she expressed concerns over.'",
        "'speaker_4': 'So I think that there is a give and take. There is agency on the part of the businesses in question. They have had an opportunity to raise these issues. And I frankly find this whole conversation to be a distraction from what the real issue is.'",
        "'speaker_4': 'And I found us going veering so far off topic that it seems as though we're willing to kill a deal that's been agreed to. And that's a frustration that I I'm sure the business owners share. I think it's disappointing.'",
        "'speaker_0': 'I thank you for your comments. City manager, address your hand up.'",
        "'speaker_1': 'Yes. And so I can clarify a little bit more on the finances. So I actually just received on Friday of last week or Thursday of last week, I just received the initial estimate of what the revenues and expenditures were for the end of last year, not for this year, but to June 30th, 2020.'",
        "'speaker_1': 'And we did end up with a net positive balance of $6 million in this particular fund. Some of it may have been from sales, but a lot of it is because we did reduce certain expenses. So we had about 14 million in lease revenue, about 2 million in revenue last year, which is the 16 million you referred'",
        "'speaker_1': 'to. And then we were able to reduce expenses. We still have major capital expenses out there and that all of this also goes to the capital expenses. But we do have that access and I feel very comfortable. I want to make sure everyone is aware we recommended these lease because we feel that the long term viability of'",
        "'speaker_1': 'that area and the Spirits Alley, that these lease agreements would help keep these businesses afloat right now in a time of need and then have them be able to come out of it stronger, which I think in reverse.'",
        "'speaker_1': 'In in the end would make the city of Alameda stronger by having these strong leases out there. So I want to make sure and clarify I didn't fully answer that question earlier.'",
        "'speaker_0': 'Thank you. Mr. 11 is Max. So I see you hand.'",
        "'speaker_4': 'Up and building on Mr. Lovett's point, we don't expect.'",
        "'speaker_3': 'Any further applications.'",
        "'speaker_4': 'For this program.'",
        "'speaker_3': 'And it was $1.5 million allocated for it, and we will have spent approximately one half of that and anticipate that's about what we will spend.'",
        "'speaker_0': 'Thank you, Miss Mansoor. Miss Spencer.'",
        "'speaker_4': 'Thank you. I'd like to make a motion to approve this, but strike the provision of the COVID 19 enforcement violations.'",
        "'speaker_0': 'Certainly, we have a motion to have a second. No second. So that motion fails for lack of a second. I am going to just ask us all to take a deep breath, take a step back. Let's look at this from a number of different perspectives.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Rarely in political life do we come to an agreement that everyone thinks is absolutely perfect, and we like it just the way it is. But at the end of the day, as elected representatives, and not just any elected representatives, we are governing at a very precarious time for our residents, for our businesses, for city government.'",
        "'speaker_0': 'None of us knows exactly where this all ends. Hopefully it ends well. And I truly believe, as I have said many times, that time and science are on our side. If we can just hold out until enough vaccine is out there to get us past this terrible scourge that we have lived through.'",
        "'speaker_0': 'And again, while we are all impacted by COVID 19, not everyone is impacted equally. And when we think of these businesses, it's not just the business owners, it's the people that work there that they employ. And so are there other ways that we can achieve the same objectives?'",
        "'speaker_0': 'I think, you know, Councilmember Desai, Councilmember Spencer, I think your concerns are valid. I don't disagree with you, but I feel that we have already in the previous item over which we spent a great deal of time in discussion, we came up with something that would satisfy the concern about overreaching.'",
        "'speaker_0': 'In fact, I, you know, implored that I would love to put together an ad hoc committee to advise exactly precisely what kind of language you would want to see in there to to guard against this overreaching that you've both referenced.'",
        "'speaker_0': 'And, in fact, I'll make my offer once again that I would be delighted if the two of you would agree to be that ad hoc committee to work with the city attorney's office and city manager and community development and come up with that language that you think addresses any deficiencies.'",
        "'speaker_0': 'But we we stand here at a crossroads where we can just walk away and say, okay, you two legacy building businesses that have been added alameda point a long long time we have helped other businesses out here you we are turning your back our back on because we just couldn't agree on the precise wording i'm asking you'",
        "'speaker_0': 'to stop and consider are there other ways to achieve almost all of what you want? Because I don't think any of us is going to walk away with everything we want. So, okay, before I hear from one of you, I see Councilmember Knox White's hand.'",
        "'speaker_3': 'So I just want to know, we developed this program early. In November, I believe, early November and December. We've been negotiating with these with these companies for six weeks. We've heard from them. They've sent us emails asking us, please, to do this.'",
        "'speaker_3': 'I guess I, I do feel that we have come up with a solution that addresses the issue, an issue that none of the businesses who already agreed to these contracts and are aware of the issue have raised. And I think that in fairness to all the businesses that we have already signed agreements with, the idea that we'",
        "'speaker_3': 'would, at the end of the day, sign two agreements with different terms seems really odd and off putting. And I guess I'm a little concerned, I guess, that that my colleagues are suggesting that the three three people on this council are going to somehow turn around and change the policy in order to start pulling the rent out'",
        "'speaker_3': 'from under some of the businesses that we're trying to help, which really at the end of the day is kind of the intimation of what's happening with this policy. And I would like to just make the make make the one case that we just we move forward with this.'",
        "'speaker_3': 'We fix the issue through the policy at the end of February. And then we and then we, you know, in future ones, I will be happy to work to make sure that we don't get into this situation. Again, it's you know, this is one of those things is we're somewhat sometimes building the airplane as we're flying it'",
        "'speaker_3': ', trying to address issues and needs. And, you know, we clearly could have done this. And by we I mean the council, because this is actually something the council inserted in at the end at the last minute, which is why I'm nervous about making changes at the last minute after an entire negotiation that has completed.'",
        "'speaker_3': 'And and this is not an issue in which we are actually putting the city at risk around this. This is an issue in which we're now making the case that we want to actually provide more more protection to businesses themselves than than to the city, who we are actually negotiating.'",
        "'speaker_3': 'We're negotiating against ourselves a little bit here. I think it's all in good faith, and I'm not arguing against that. But I just want to say, like, we're not with this issue that we're talking about is not one where the city is going to somehow be on the hook for things because of a mistake.'",
        "'speaker_3': 'We're actually trying to make sure that we're clearer to our tourist folks. So I'd like to make a motion, quite honestly, to approve the staff recommendation with the hope that we can honor the negotiations and the work that our staff has done at the direction of a unanimous city council about six weeks ago.'",
        "'speaker_0': 'We have a motion. Do we have a second? Vice mayor.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'Then seconded by Vice Mayor of L.A. Discussion Councilmember Spencer. I think I saw a hand up.'",
        "'speaker_4': 'So I did watch the meeting when this was discussed and it was this paragraph is injected at the end and I believe by the mayor because she had this concern and I appreciate that. But honestly, the discussion that this has been going on and on and on, that is correct.'",
        "'speaker_4': 'And I am not right. But if the last at the end when I watched the middle of all this was an objective and added. And so honestly, I don't believe that this actually was part of the discussion from day one of these discussions.'",
        "'speaker_4': 'So that's why I feel like it is a good compromise. Just remove that paragraph then if we can't reach it and come back later, or the policy of how we're going to enforce all of that does apply to all of them.'",
        "'speaker_4': 'But this language, I think it is harsh. When I heard it during the meeting, I was caught off guard, quite honestly, that wow, where it got even come from. It is an extreme. I think it's extreme. I think it's unfortunate that somehow it got included and I and I so I, I don't feel comfortable that the language'",
        "'speaker_4': 'and the solution is not a real solution if it's not in the contract. And quite honestly, policy can change by a vote of three any time. So I think that is not a real solution to have it. Some document, three people, three council members can change any time.'",
        "'speaker_4': 'It's not part of the contract.'",
        "'speaker_0': 'Thank you. Any further discussion? Okay. CNN May we have a roll call vote, please?'",
        "'speaker_2': 'Councilmember de SAG.'",
        "'speaker_4': 'Nope.'",
        "'speaker_2': 'Not quite.'",
        "'speaker_3': 'All right.'",
        "'speaker_4': 'Spencer at State.'",
        "'speaker_2': 'Villa.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Mayor. As the Ashcraft High that required four votes since there was only three eyes, one now and one abstention, it fails.'",
        "'speaker_0': 'All right. Thank you. We have dispensed with item six B. And before we move on to item and I do, I just want to say one thing and then I'll call on you. Vice Mayor Elect Elector Council Member.'",
        "'speaker_0': 'Now, that's why I am very disappointed and I don't like to see us treating different businesses differently and I hope moving forward we can find a way to do better. Perhaps after our policy discussion, Councilmember Knox White and then the city manager.'",
        "'speaker_3': 'So I'll see what that city manager has, but I'd like to make a second motion.'",
        "'speaker_0': 'Okay. Vice versa.'",
        "'speaker_1': 'So as I understand it, the vote failed on the two lease agreement for failure of gain to four votes. So do you want us to try to figure something out and bring another solution back for another first reading for the next council meeting?'",
        "'speaker_1': 'January 19th. I'm assuming that's what you would like, but I just want to make sure that I'm consistent with the desires.'",
        "'speaker_3': 'Of the Council.'",
        "'speaker_0': 'Back to Councilmember NOx. Wait, please.'",
        "'speaker_3': 'So I will move that. We approved that we remove section four and approve the approved the contracts because I do believe that we need to move these forward with direction to staff to work on a is to work to insert the final policy work into an up lease amendment after the after after we have an approved council'",
        "'speaker_3': 'lease amendment. I've heard from our from the point of that these two businesses that they really need us to move this forward. And if we don't if we give direction, we're going to be off in two or three months to two months before this thing comes back and is back to being.'",
        "'speaker_3': 'And I don't want to wait that long.'",
        "'speaker_4': 'I'm having a second thought and discussion.'",
        "'speaker_0': 'I, I have a concern about just suspending any reference to COVID 19 public health order violations. I would mind if you modify the language. I might consider it Vice Mayor.'",
        "'speaker_4': 'I have a similar concern also because we had other businesses at Alameda Point completely flouting the health regulations, and these were two businesses that were, in fact, not doing that to the detriment of their business. So I do have those concerns, and I think I'm not in a place to vote for that with that completely being removed'",
        "'speaker_4': ', especially when we have the other requirements for the other contracts.'",
        "'speaker_0': 'Councilmember Spencer.'",
        "'speaker_4': 'Thank you. I I'm not sure you all heard. I'm seconding the motion. I think it's a great motion, great compromise, and then we can move forward.'",
        "'speaker_0': 'Vice Mayor, do you want to try to suggest some modified language for paragraph four?'",
        "'speaker_3': 'I don't know what I.'",
        "'speaker_0': 'Mr. Knox, wait. We have a new vice mayor, and I was actually.'",
        "'speaker_4': 'Calling about.'",
        "'speaker_3': 'Is the maker of the motion. You were talking to me. My apologies.'",
        "'speaker_0': 'I guess you'll be next.'",
        "'speaker_4': 'You know, I think that we still need to have language in there that references the COVID 19 health and safety ordinances, that if there's an ocean violation related to COVID 19 or a violation of the county health orders such that the county Department of Health takes action, that the contract be suspended pending a review of our legal'",
        "'speaker_4': 'counsel and coming back to council. Something to that effect.'",
        "'speaker_0': 'And City Attorney Shann, perhaps you could help us out here. I wouldn't mind seeing language that articulates the opportunity for someone who's found to be in violation, to cure that violation within a certain period of time. I mean, I guess if the rave was held, but that's where some discretion would come in anyway.'",
        "'speaker_3': 'If it.'",
        "'speaker_4': 'Didn't fit.'",
        "'speaker_3': 'So what? One one easy fix for the contract that might satisfy the the concerns of the councils are currently it provides that and currently it provides the list of potential remedies but that the decision makers or the city manager and the city attorney would the.'",
        "'speaker_3': 'What if we just remove that and change the decision makers to the city council? It wouldn't change much of anything else in this agreement other than just to say upon the approval of the city council in its complete sole and complete discretion.'",
        "'speaker_3': 'I think with that, would that would that typify the Council?'",
        "'speaker_0': 'What about the opportunity to cure.'",
        "'speaker_3': 'And so the council. So number four gives the opportunity to hear, right. So options for the current lease gives the council the discretion to essentially ask for a cure. And so then it puts the decision making back into the council's hands, which I heard is a major concern that staff might overreach.'",
        "'speaker_3': 'And then the council can elect to go with step four, which is a cure.'",
        "'speaker_0': 'Councilmember Spencer.'",
        "'speaker_2': 'You to vote. Thank you. Give additional time. I'm sorry. I'm sorry.'",
        "'speaker_0': 'I am sorry. Councilmember Spencer, you're out of time. And I'm almost out of time. I would move that. We give ourselves five additional minutes. This takes four votes.'",
        "'speaker_4': 'I'll second that. Oh.'",
        "'speaker_0': 'We may not have four votes. Okay. It's been moved by the mayor and seconded by Councilmember Spencer that we get five more minutes each. Roll call vote.'",
        "'speaker_2': 'Councilmember de SAG.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Not right.'",
        "'speaker_3': 'Now.'",
        "'speaker_2': 'Spencer. I vella know mayor as the Ashcraft. I know that fails because it needed four votes and it was 3 to 2.'",
        "'speaker_0': 'Yeah, I got that calls every day.'",
        "'speaker_1': 'So do the rules allow me to yield time to someone without?'",
        "'speaker_0': 'They do not. But you can keep talking.'",
        "'speaker_3': 'I guess I call it the question.'",
        "'speaker_0': 'That we have. I was just about to call the vice mayor of vice mayor of L.A..'",
        "'speaker_4': 'So I heard a suggestion from the city attorney. My question threw the chair to the maker of the motion. Is, is that something that is amenable to the maker of the motion? To give to replace the city manager and city attorney with a decision by the council, since the issue seems to be discretion to unelected staff.'",
        "'speaker_3': 'Yeah, I'm not comforted. That's what I've heard the issue is. But. But Councilmember Desai, would that be something you would support?'",
        "'speaker_1': 'You know, it's. I think it's how you frame it. I think were we the city council are not. Playing an administrative role in terms of managing a contract. That's that's not what we do. And if if if what we mean is that.'",
        "'speaker_1': 'When the city manager or city attorney comes to some kind of decision, they will before executing that decision, they will forward it for ratification by the city council. That's a. You know, frankly, I don't think there's any higher authority when it comes to dealing with overreach than the city council.'",
        "'speaker_1': 'And it is a public it would be a public it would be a public meeting. So.'",
        "'speaker_0': 'So tell us how you would phrase it so that you would support them. You would want any decision of the city manager and city attorney ratified by. The Council rather than if you tell us.'",
        "'speaker_1': 'Yeah. I don't know. I think. I think we're moving in the right direction and frankly. I'm probably not as much on my toes to make some kind of policy language on the fly right now. So I still go back.'",
        "'speaker_1': 'I would rather have a hammer out the policy before they. Like I said before, you know, let's hammer out the policy before we make we make some kind of agreement. And I know what you're saying. Well, as hammer out tonight, I don't I don't know if we can hammer hammer that out tonight.'",
        "'speaker_0': 'So Vice Mayor Villa.'",
        "'speaker_4': 'So Councilmember de SAG, might I propose that we get language in there that just says that the ultimate decision rests with the council with a vote of the council, that there could be a recommendation made by staff. We're going to be developing policy.'",
        "'speaker_4': 'That policy will be in place before anything actually happens. So we would be guided by our own policy when we make a decision to ratify.'",
        "'speaker_0': 'Cancer every day. So because.'",
        "'speaker_4': 'Of that. Because of the dose or because of the delay in in and acting things that we're going to be making a decision on policy in February. So that policy would then guide our ratification vote?'",
        "'speaker_1': 'Well, I think it is a substantive it is a substantive move to have the city council. The issue is staff overreach. That's the way issue that I'm seeing that I'm agreeing with. Councilmember Herrera Spencer I see articulated in the previous matter and I think it still is still exists here whether or not people believe it's true or'",
        "'speaker_1': 'not. I mean, it's completely possible that maybe these guys didn't want to raise it as an issue and they caved to language for as harsh it as it is because they didn't want. So I think there's room to say that it's incumbent on us.'",
        "'speaker_1': 'I think ultimately the decision has to be on the city council when it comes to either one, two, three, one, well, one, two and three are basically penalties for is kind of this kind of very vague due process.'",
        "'speaker_1': 'So all the things that I'm reading is there's a lot of concern about businesses that they feel across California that they feel are being punished by by government. And so I don't know. I mean, I'm leery of making policy on the fly tonight, that's all.'",
        "'speaker_1': 'I think we're moving in the right direction. I'll leave it at that. I have 30 seconds.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_4': 'I guess my concern is, is that if how would there be staff overreach if council ultimately votes on it, but on whether or not we're enforcing that provision?'",
        "'speaker_1': 'I think that's.'",
        "'speaker_4': 'Okay. So. So if we if we added that, would that make. Would that make this something that you would be agreeable to?'",
        "'speaker_3': 'I'm.'",
        "'speaker_1': 'Now I just have to see the language first. So.'",
        "'speaker_0': 'Can we put the language up on the screen and what do you think of that? Councilmember That's why.'",
        "'speaker_3': 'Go through the chair. Attorney Shen Would we be able to in this? So what I've heard is not necessarily just overreach of the city staff, but I've heard an outright essential. I'm going to stop short of saying an accusation, but that three, even three council members cannot be trusted making this decision.'",
        "'speaker_3': 'And so I'm wondering if we can, because this would not be an ordinance or anything else we could actually, the contract said by a vote of four city council people, I think, for the final determination. Or is that problematic if Councilmember NOx is against that?'",
        "'speaker_3': 'The Charter makes clear that the council takes three votes to take action. Otherwise, all throughout the charter and the Council taking steps that affect the Council, increase the voting threshold for itself for future items on the charter. Thank you.'",
        "'speaker_0': 'Okay to my question, because council then Councilmember de SAC said he is not comfortable not seeing the language. Is there something we can put up on the screen? Do we need to take a break?'",
        "'speaker_2': 'I mean, I can put up the ordinance on the street if you just give me 1/2, please.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'And Madam Clerk, if I may suggest that you put up section four on page three on the screen, which is the lease provision that's at issue. I thought.'",
        "'speaker_4': 'Subject.'",
        "'speaker_2': 'Can everybody see that now?'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'Yes. Thank you. But you know what I think? Well, no, it's it's actually the council voted. So I think the that first full paragraph is where. Well, I should probably call Vice Mayor Valley because I think you were suggesting some rewording.'",
        "'speaker_4': 'My, my, my suggestion would be based on the recommendation of the city attorney that we changed that last couple of lines that the city may upon the written recommendation of the city or based upon a vote of the city council.'",
        "'speaker_4': 'Just replace the city. They'll need a city manager and city attorney with upon a vote of the city council. Or.'",
        "'speaker_0': 'So the city may. And after the comet.'",
        "'speaker_4': 'Mm hmm. It would say upon a vote of the majority of the city council. Seconds.'",
        "'speaker_1': 'You writing?'",
        "'speaker_4': 'I think the problem is that the pdf. Yeah, I.'",
        "'speaker_2': 'Only have a pdf of it. I do not have a word. And I was trying to figure out a way to type or do something and I couldn't do it.'",
        "'speaker_4': 'So I my time my time was running even though I wasn't speaking.'",
        "'speaker_2': 'And I can show it again. But unfortunately, I. I can't figure out a way to tie. Maybe let me try cutting and pasting it into a word document quickly. Just give me 1/2.'",
        "'speaker_4': 'Can someone check the time of where it was when a member of vice mayor was speaking? I believe it was well within the 2 minutes is now out there. Laura. It's Nanette. I just sent it to you in an email.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_0': 'Thank you. You know, we're going to do I'm calling a five minute break. It's almost 1035. We're going to come back at 1040, ten four oh. So we'll take a break and take a little pressure off the city clerk.'",
        "'speaker_0': 'Thank you. Be back at 1040.'",
        "'speaker_4': 'Everyone in the.'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_0': 'Okay, everyone, it is 1041. So we are back in session. Okay. Madam Clerk, did you have the opportunity to. Yeah, look at that.'",
        "'speaker_2': 'And I started. The city attorney had kind of captured some of the changes that he thought he was hearing. So I started to capture those. So they are here, if that is helpful.'",
        "'speaker_4': 'Now.'",
        "'speaker_2': 'In strikethrough so everybody can see it.'",
        "'speaker_0': 'Do you want to read that for us?'",
        "'speaker_2': 'So it would be changing that section to upon the approval of City Council in its sole and complete discretion, impose some or all of the following remedies. So that was striking the city manager and city attorney part and the written approval just changes to approval.'",
        "'speaker_0': 'Okay. Councilmember Desai as your handouts.'",
        "'speaker_1': 'What I would recommend is where it says underlined the City Council. It should be the city council on a 4 to 1 vote. And then I have 20 seconds on number. I replace all unpaid with the phrase some or all unpaid.'",
        "'speaker_1': 'Number two replace all previously with the phrase some or all previously. And number three 6 seconds. Any further replace with some or all of any further.'",
        "'speaker_2': 'Furthered.'",
        "'speaker_1': 'Number three.'",
        "'speaker_2': 'Oh.'",
        "'speaker_1': 'Any further.'",
        "'speaker_2': 'Oh. Some.'",
        "'speaker_1': 'Yeah. Some or all of any further.'",
        "'speaker_0': 'City attorney. Are you finished, Mr. De? Yeah. Yeah. Did you turn the. Please? Yes.'",
        "'speaker_3': 'Yeah. Councilmember, I want to reiterate my concern over increasing the voting threshold, which is not authorized by the city charter.'",
        "'speaker_1': 'Oh.'",
        "'speaker_4': 'Oh.'",
        "'speaker_1': 'Okay. That's. That's fine. Remove.'",
        "'speaker_0': 'Okay.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Okay. Are we ready? Well, make of the motion back to you.'",
        "'speaker_3': 'On the assumption that Councilmember De Saag is putting this forth as a motion, I withdraw of the previous motion.'",
        "'speaker_0': 'You're going to have to nod your head or shake your head. Oh, that's a yes. Okay.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'All right. So if I'm understanding correctly. Madam Clerk. Do you want to start the motion for us?'",
        "'speaker_2': 'Yes. So I think the motion has been withdrawn by Councilmember Knox White. And then Councilmember de SAG has made a revised motion to introduce the ordinance with this language added to the leases.'",
        "'speaker_0': 'This modification. So here. Okay. And then do we have second. I see. Councilor remarks. White has seconded any further discussion. Okay, CNN, may we have a roll call vote, please?'",
        "'speaker_2': 'Councilmember de SAG. Mike Knox. Right.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Spencer. You're muted.'",
        "'speaker_4': 'Sorry about that abstain.'",
        "'speaker_2': 'Vella.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Mayor as he Ashcraft.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'This carries by 4 to 1 with one abstention.'",
        "'speaker_0': 'Thank you and thank you to both Councilmember de site and Councilmember Knox Way and Vice Mayor Vella for that for keeping at it a little longer. Much appreciated. Okay. Now another little agenda adjustment. We were able to get the the assembly member.'",
        "'speaker_0': 'I I'm assuming we still have him. Do we still have the assembly member?'",
        "'speaker_2': 'Yes, we do.'",
        "'speaker_0': 'All right. So before we go to item six C, we are no, not yet 60. But when we get to 60, we are going back to 6 a.m.. And I want to welcome almeida's own resident and this.'",
        "'speaker_2': 'We might have lost him. He was there just a second ago.'",
        "'speaker_0': 'Oh, no. Past his bedtime, probably.'",
        "'speaker_2': 'Oh, shoot. I mean, he was. We just saw him there.'",
        "'speaker_4': 'Oh. Hmm.'",
        "'speaker_2': 'I'm not sure what happened.'",
        "'speaker_0': 'Assemblymember Bonta. If you are listening, please come back.'",
        "'speaker_2': 'I can't find him now.'",
        "'speaker_4': 'Oh, shoot.'",
        "'speaker_0': 'I'm sorry.'",
        "'speaker_4': 'I'm sorry.'",
        "'speaker_0': 'Too. Well, I'll tell you what. We will work with the Assembly members office, and we will hopefully get him back for our next our next meeting in January, because we'd love to hear from him. So many, so many important issues happening at the state level.'",
        "'speaker_0': 'Okay. So with that, we're going to go. Are you getting dizzy yet? We are going to go to item six. Madam, quick, would you introduce that item, please?'",
        "'speaker_2': 'Public hearing to consider adoption of resolution, adopting a medicated negative declaration and a mitigation monitoring and reporting program to present the property at 23/55 Street from annex mixed use to our four neighborhood residential district to facilitate residential use of the property and introduction of ordinance.'",
        "'speaker_2': 'Amending the Zoning Map designation for the property at 23/55 Street 1870 4135623. From annex mixed use to our four neighborhood residential district to facilitate residential use of the property as recommended by the City Planning Board.'",
        "'speaker_0': 'Thank you. And who is his presenting this item? Yeah.'",
        "'speaker_2': 'Mayor, I am so sorry. Assembly member Fonda is back now. I don't know me. He must have lost his connection. And I'm so sorry. I don't know what you guys want to do, but I just wanted to give, you know, I.'",
        "'speaker_0': 'And Mr. Thomas and Ms.. Chen, if we could just impose on you a little longer because the Assembly member, I think we're confusing him to now you see it. Now you don't. So if we could just hop. Don't go far.'",
        "'speaker_0': 'Don't go far. So I think I was starting to introduce someone who needs no introduction. He was actually a member of this body at one time, and he is our friend and neighbor and has represented us in the State Assembly for how many years?'",
        "'speaker_0': 'He can tell you himself. Hi, Assembly member. Apologies for keeping you up so late, but you are welcome and the floor is yours. Happy New Year too.'"
    ],
    "Public Hearing to Consider Adoption of a Resolution Adopting a Mitigated Negative Declaration and Mitigation Monitoring and Reporting Program to Rezone the Property at 2350 Fifth Street from M-X, Mixed Use to R-4, Neighborhood Residential District to Facilitate Residential Use of the Property; and  Introduction of Ordinance Amending the Zoning Map Designation for the Property at 2350 Fifth Street (APN 74-1356-23) from M-X, Mixed Use to R-4, Neighborhood Residential District to Facilitate Residential Use of the Property, as Recommended by the City Planning Board. (Planning, Building and Transportation 481005)  [Continued from November 17, 2020]": [
        "'speaker_3': 'The zoning change would change the zoning from M x, which is a mixed use zoning that requires at least three uses on every site. It's designed for large sites like Alameda Landing, like Alameda Point. It's it and it says it right in the body of the ordinance.'",
        "'speaker_3': 'It's it's for large, complicated sites where you want a mix of uses. We have this small remnant parcel. It is owned by the city. It was originally owned by the excuse me, not the city technically, but the redevelopment agency.'",
        "'speaker_3': 'This is a successor agency parcel. The city is obligated under state law to sell this property. This rezoning makes it feasible to sell the property at only 8/10 of an acre. It's a very small, very oddly shaped parcel.'",
        "'speaker_3': 'That's why we call it the bottle parcel. The rezoning essentially changes it from max to R four, which is a residential zoning. So that would allow the site to be used for just residential, would not require the three uses and would not require that there be commercial uses on this site.'",
        "'speaker_3': 'It does not change the residential density allowed. The mix does allow residential up to 21 units. S.A. The R four has the same residential density, same parking requirements. It just eliminates the mixed use requirements. And we think this will make it facilitate the sale of the property to a future buyer for development of housing on the site'",
        "'speaker_3': '. So our recommendation is that you approve the environmental document that was prepared analyzing the potential environmental effects and approve the first reading. Tonight, I'm available to answer any questions I have throughout. I'm, as always, assisted by Selina Chen from the City Attorney's Office, who makes sure that I stay out of trouble.'",
        "'speaker_3': 'And she can help answer the more difficult questions you might have.'",
        "'speaker_0': 'Thank you so much. I should ask city clerk do we have public speakers on this item?'",
        "'speaker_2': 'We do not have anyone.'",
        "'speaker_0': 'All right. So we could entertain discussion. We could entertain a motion. I am open to just about anything. Council.'",
        "'speaker_4': 'I have a clarifying question.'",
        "'speaker_0': 'Oh, Councilmember Spencer. Yes, ma'am.'",
        "'speaker_4': 'Clarifying question. It's my understanding the number of housing units, the base is 17 and then the density rises up to 25. How much parking is required under each of those scenarios?'",
        "'speaker_3': 'The parking requirement in the existing zoning and the proposed zoning is two spaces per unit.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Okay. Any further clarifying questions? Counsel, do I have a motion? Councilmember.'",
        "'speaker_3': 'That's why I move approval of the staff recommendation as proposed.'",
        "'speaker_0': 'All right, just a second. Vice Mayor Vella, is your hand up.'",
        "'speaker_4': 'Second.'",
        "'speaker_0': 'Okay. Any discussion? I'm okay. I see calcium every day, so I'd stand up. I'm going to call him first and then we'll go back to.'",
        "'speaker_4': 'Councilmember.'",
        "'speaker_0': 'Spencer. And I'll just for clarification, as city attorney, three votes needed to pass this.'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'All right. Thank you. I can't separate data.'",
        "'speaker_1': 'Okay. Yes, thank you. You know, it seems to me that this place would be an ideal place to have some level of commercial. I think I think it should be some kind of mixed use it. You know, the way the way that I look at the whole Bayport development.'",
        "'speaker_1': 'You know, you got like kind of like neighborhoods serving. Kind of commercial down at the. Northwest corner of Bayport. And then, you know, you got the whole shopping center, of course, to the south east corner of of Bayport, but that's the shopping center.'",
        "'speaker_1': 'I mean, but it just seems to me that there could be something smaller scale that's more neighborhood surveying. So. So my senses is I would rather keep it the, the mixed use that it is. I'm not sure you know, just plopping down this whole residential thing right there on that on the on that oddly shaped project.'",
        "'speaker_1': 'It I don't know. I don't know. So. I'll leave it at that.'",
        "'speaker_0': 'Then. Thank you, Councilmember Desai. Councilmember Spencer.'",
        "'speaker_4': 'Thank you. Um, I. I couldn't hear very well. I thought I heard someone ask how many votes this is required to pass.'",
        "'speaker_0': 'He requires three.'",
        "'speaker_4': 'Even though it's a piece of property we're not selling.'",
        "'speaker_0': 'Yes. City attorney, do you want to explain what we're voting on?'",
        "'speaker_3': 'Sure. Councilmembers. You're not voting on property disposition. And in fact, I think this is actually not city property, but CIC property. But even if it were city property, the actions you're taking is only to rezone. It's not to transact real property, which would otherwise require for.'",
        "'speaker_3': 'And so because this is just rezoning to regulatory action, three votes are needed to take action.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Anything further, Councilmember Spencer? Okay. Okay. So we had a motion by Councilmember Alex, right? It's been seconded by Councilmember Vela and vice mayor below him. So sorry it's getting late. And I will just say, in reading this staff report and I'm familiar with this, this parcel that is the staff report brings out, it has left'",
        "'speaker_0': 'interest and purchasers, potential purchasers in its current zoning configuration. And so that coupled with the fact that we have a housing crisis in the Bay Area, we've heard concerns raised to the Assembly member who just addressed us that we have homeless people, we have unsheltered people.'",
        "'speaker_0': 'We we need more housing. That's that's what we need. So this is not a huge number of housing. It is the staff report brought out. It is close to services. As Councilmember Desai pointed out, there is an entire shopping center.'",
        "'speaker_0': 'There is a school nearby. College of Alameda is adjacent. There's transportation, it's on bus lines. So I, I am very favorable to this. So the hour is growing late. I mean, we have a roll call vote unless anybody else want to add anything.'",
        "'speaker_4': 'Oh, I'm sorry. I don't think I also would prefer keeping an excuse, so I don't plan to support this.'",
        "'speaker_0': 'Thank you. Maybe we have a roll call vote, please.'",
        "'speaker_2': 'Councilmember de SAG.'",
        "'speaker_1': 'And. No.'",
        "'speaker_2': 'Not quite.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Spencer.'",
        "'speaker_4': 'You know.'",
        "'speaker_2': 'Vela.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Mayor as the Ashcraft guy. I mean, she carries through to two.'",
        "'speaker_0': 'Thank you. All right, so thank you very much, Mr. Chen and Mr. Thomas. And apologies for keeping you out.'",
        "'speaker_4': 'Until all.'",
        "'speaker_0': 'Hours. Should be a party or something, right? All right, so then let's just get this in here somewhere. We move because we said no and no later than midnight. So we can still go to city manager communication. And I don't think there's any oral communications that.'",
        "'speaker_0': 'Correct. And then Kirk.'",
        "'speaker_2': 'We don't have any money now. Now.'",
        "'speaker_0': 'Okay. So, city manager communication. Mr. Levitt?'"
    ]
}