{
    "Introduction of Ordinance Authorizing the City Manager to Execute Lease Amendments for Rent Relief Program with Pacific Pinball Museum and Wonky Kitchen via the Non-Profit Spirits Alley Program for Rent Relief in Response to the Covid-19 Pandemic. (Community Development 858)": [
        "'speaker_0': 'Thank you. And do we have a councilmember day so you can get your hand up? Yes, sir. Yes.'",
        "'speaker_4': 'Thank you, Madam Mayor. You know, in the past, I have recuse myself on anything related to the Pacific Pinball machine, even though this is something on the base, they do. I think their headquarters is Webster Street near my place.'",
        "'speaker_4': 'So I'll maybe just to be consistent, I'll recuse myself from this thing.'",
        "'speaker_0': 'Or did you want an opinion for from the city attorney or. Oh.'",
        "'speaker_4': 'Sure, sure. That's fine.'",
        "'speaker_0': 'Yes, Mr. Chan.'",
        "'speaker_1': 'I think in.'",
        "'speaker_2': 'Previous conversations with Mr. De Keyser, he he is indicated to me that because of the proximity of his home to the headquarters of this particular business, that recusal is appropriate. And I have no objections. And I appreciate Mr. de Thor.'",
        "'speaker_1': 'Informing me of his living location. Okay.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Okay, then. So, Councilmember Desai, we will excuse and recuse for this time. Excuse you as you recuse yourself. All right. And so who from city staff is presenting, huh? Like magic. There's Ms.. Mchunu. Good evening. We say. See her name and Lisa maxwell.'",
        "'speaker_0': 'Good evening. And I expect that we'll see their lovely faces. So there's one now. Coming.'",
        "'speaker_5': 'I'm coming.'",
        "'speaker_1': 'Sorry.'",
        "'speaker_5': 'That's all right.'",
        "'speaker_0': 'Good evening. There you are. Hi.'",
        "'speaker_5': 'All right. Good evening. Sorry. Sorry. We were having technical difficulty.'",
        "'speaker_0': 'As we worked him out. No worries. It's all good. So I'm just. Whoever I'd like to start, please start.'",
        "'speaker_5': 'I'll start. This is the almost exact same staff report that the council considered at the time of the council meeting. I'm presenting it to tenants who would like to participate in the rent relief program that the council approved in October.'",
        "'speaker_5': 'These are applicants for the the program that's specific to non-profits in Spirit's Alley.'",
        "'speaker_3': 'These are Spirit's Alley tenants.'",
        "'speaker_5': 'And and while the Civic Pinball Museum is a nonprofit. Just to quickly recap, this is the.'",
        "'speaker_0': '933 program.'",
        "'speaker_5': 'Which is the tenant is able to defer red for nine months and repay the rent over a.'",
        "'speaker_0': 'Three.'",
        "'speaker_5': 'Year period of time. If they repay early, they could have up to three months of rent abated. So what you're considered what you see in front of you is what three.'",
        "'speaker_3': 'Months rent would be for each of these tenants, the maximum amount, which is $42,225.'",
        "'speaker_5': 'Which I was.'",
        "'speaker_0': 'Doing the math.'",
        "'speaker_5': 'Which would mean that of the $400,000 that the council has allotted for this program, if you approve these tenants tonight, you will have allocated or we we could conceivably abate up to 156,357. And so it's less than half of what you've appropriated.'",
        "'speaker_5': 'And it would, as you will have, as did ten tenants.'",
        "'speaker_0': 'And I believe that you also noted in the staff report that this money would come from the base reuse fund and that revenues are actually doing better than anticipated. Is that correct?'",
        "'speaker_5': 'Yes. Okay. I think what I say what I'm saying is that a fund balance is pretty healthy and it could absorb this program as well as the loan conversion program that the council approved in October. So the appropriation that you made for both programs are definitely we're able to handle those and keep operations at the same level'",
        "'speaker_5': '. Okay.'",
        "'speaker_0': 'Um, okay. Great. Any any clarifying questions from council? This next one that you want to. Oh, I think I see the city manager's hand to doing. Mr. LEVITT. Yeah.'",
        "'speaker_1': 'So I just want to add a little bit to what Nanette said. Yes. I think we have a healthy fine balance now, obviously, with the stress on the businesses out there. We are concerned about future lease revenue, or at least I'm concerned about future lease revenue, although I think these programs are to help to try to stabilize'",
        "'speaker_1': 'the businesses will help, which will hopefully help the city in the long term. But we are keeping an eye on the lease revenue as we move forward into the future.'",
        "'speaker_0': 'Thank you. And Ms.. Maxwell, did you want to add anything?'",
        "'speaker_5': 'The only thing.'",
        "'speaker_1': 'I'd add if there were any concerns.'",
        "'speaker_4': 'About know we had added.'",
        "'speaker_5': 'Some language.'",
        "'speaker_1': 'With respect to Koven.'",
        "'speaker_4': 'Compliance and if anyone had any particular concerns about that and wanted to raise them.'",
        "'speaker_1': 'We have some thoughts on how we can address those concerns if there were those.'",
        "'speaker_0': 'Well, that was my request and I feel pretty firmly about it. Okay. I because, you know, the reason that our businesses and our residents are many of them are suffering so much financially, psychologically is because of COVID 19.'",
        "'speaker_0': 'And certainly we've had some great news on the horizon recently with the vaccinations arriving and starting and more on the way. But it's going to take a while before we get enough people vaccinated to to really make a difference.'",
        "'speaker_0': 'And so in the intervening time, we have to adhere to the public health officer's guidelines. And I was certainly satisfied with the language in the in the amendment because it would take an actual violation, which which is something that comes after education after warning.'",
        "'speaker_0': 'So it's not like the first time out of the gate that I just think we have to be really consistent with our messaging and we want to help our businesses out, but they have to help themselves and others in the community.'",
        "'speaker_0': 'My feeling is thank you. And so if council same you clarify questions at this time. Madam, do we have any public speakers?'",
        "'speaker_3': 'Do not have any speakers.'",
        "'speaker_0': 'Okay. Counsel, let's open the discussion.'",
        "'speaker_1': 'I'd be happy to move approval if there's if for their approval.'",
        "'speaker_5': 'But I'd like to second that. We I thought we had a this is very much related to the conversation that we had at the last meeting. We just re agenda this to add the additional tenet. So, yes, I'd like this, actually.'",
        "'speaker_0': 'All right. We've had a motion by Vice Mayor Knox White, seconded by Councilmember Vela. Any further discussion being.'",
        "'speaker_5': 'Held.'",
        "'speaker_0': 'Here? Did you want to add anything? Your favorite thing then? May we have a roll call vote, please?'",
        "'speaker_3': 'Vice Mayor Knox. Right.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Councilmember Odie. I vela. I may or as the Ashcraft high that carries by four eyes one absent and Councilmember De is on his way back in.'",
        "'speaker_0': 'All right. Excellent. Thank you. Thank you so much, Miss Maxwell.'",
        "'speaker_5': 'Thank you. Thank you.'",
        "'speaker_0': 'Very staysafe. Yeah. This is our last council meeting of the year, so. Yeah, but a year. Yeah. All right. Yeah, he's back with this. Okay, so then we are going to move on to item four, be.'",
        "'speaker_3': 'Adoption of urgency and codified ordinance amending in part on codified ordinance number 3 to 7 five and imposing and extending within the city of Alameda a temporary moratorium on rent increases for fully regulated residential units until June 30th, 2021.'",
        "'speaker_3': 'This ordinance requires for 50 votes and a recommendation to production to staff to explore additional opportunities to further provide assistance to landlords, especially small operators impacted by COVID 19.'",
        "'speaker_0': 'Thank you. This way, I figure. So I see that Lisa Phipps has joined us, as has Michael Roush. Good evening. So go ahead. Whoever is starting, please, and yourself, have we look forward to your report.'",
        "'speaker_5': 'I'll start. I actually have a presentation.'",
        "'speaker_3': 'We are getting it up.'",
        "'speaker_5': 'Thank you. So, Madam Mayor, members of the City Council and staff. My name is Lisa Fitz. I'm a program manager with the Community Development Department. Thank you. Tonight, we're going to talk about the rent increase moratorium and landlord assistance.'"
    ],
    "Adoption of Urgency Uncodified Ordinance Amending in Part Uncodified Ordinance No. 3275 and Imposing and Extending within the City of Alameda a Temporary Moratorium on Rent Increases for Fully Regulated Residential Rental Units until June 30, 2021 [Requires Four Affirmative Votes]; and \nRecommendation to Provide Direction to Staff to Explore Additional Opportunities to Further Provide Assistant to Landlords, Especially Small Operators, Impacted by COVID-19. (Community Development 265)": [
        "'speaker_5': 'Can I go to the next slide? Thanks. So the purpose tonight is to speak specifically about the proposed moratorium on residential rent increases and exploring additional opportunities for landlord assistance. Next slide, please. By way of background. Several events in September 19, September 2019 have led us to this point from the implementation of rent control to the growing'",
        "'speaker_5': 'COVID 19 public health pandemic and the resulting shelter in place orders that impacted the physical, economic and mental health of our residents. In addition to Council's actions, the State has also implemented AB 3088, which limited landlords ability to serve an eviction notice for not on payment of rent.'",
        "'speaker_5': 'Next slide, please. To recap the landlord survey data from this past August, 79% of the landlords in Alameda were receiving close to 100% of their rent. Unfortunately, there were 5% of landlords who are not receiving any rent. In that survey, landlords also acknowledged that their non-mortgage expenses continue to remain due and also rise in some cases.'",
        "'speaker_5': 'Finally, they asked for assistance with addressing these fixed expenses. Next slide, please. Next slide, please. If. From this. I'm sorry. Thank you. From this survey, we also learned that landlords were experiencing longer vacancies and lower rents. Which begs the question, are our tenants nervous about committing to a year lease?'",
        "'speaker_5': 'We also learned that landlords with fewer that fewer than five units are most impacted by non or partial payment of rent, since rental income represents a large portion and sometimes all of their income. With that said, landlords who own 5 to 10, 5 to 15 units tended to have the highest percentage of tenants who were paying less'",
        "'speaker_5': 'than full rent. Next slide, please. That takes us to the emergency rent relief program, recognizing the growing need for assistance. Council approved the Emergency Rent Relief Program, which was designed to assist Alameda tenants who are suffering a temporary financial setback due to the COVID 19 public health emergency and who needed help with rent due.'",
        "'speaker_5': 'The program launched in August and both tenants and landlords have benefited from this program since. Eligible tenants have some portion of their pass to rent paid directly to the landlord. I would like to point out that applications are currently being accepted and will be accepted through this Sunday, December 20th, and all applicants who have not been awarded'",
        "'speaker_5': 'a payment in the first round are eligible to apply. Next slide, please. So what is the potential impact on landlords of the proposed ordinance due to the timing of the COVID 19 health pandemic? Landlords have been impacted differently depending on the anniversary date of their rent increase.'",
        "'speaker_5': 'So for example, if you look at the first row of the table, landlords with an anniversary date between January and March have not been impacted by the current freeze, but will be impacted by the the proposed freeze. By contrast, if you look at the second row, landlords with an anniversary date between April and August have the largest'",
        "'speaker_5': 'potential impact. Next slide, please. Recognizing that the impact varies by anniversary date, I have prepared an example which assumes the following. First, I've assumed an April anniversary date because, as we saw on the previous slide, the landlords with an anniversary date between April and August are most impacted.'",
        "'speaker_5': 'Second, I have assumed that the landlord would have otherwise increased rent if not for the COVID 19 health pandemic and the current rent moratorium. Rent Freeze Moratorium. Third, I have assumed that the tenant would have remained in the unit until after the rent was increased.'",
        "'speaker_5': 'So this table shows that the cumulative projected financial impact of the proposed rent freeze ranges from $301 to $715 for the six month period. The of the most impacted landlord. And I just want to. Point out that that is that one month of vacancy would offset the captured rent increase.'",
        "'speaker_5': 'Next slide, please. Here we have a chart that shows the rent growth in buildings with three or more units peaked in the first quarter of 2020 and that it also still remains about down about 5% from the peak.'",
        "'speaker_5': 'It should be noted that ultimately landlords have three financial levers to increase rents, to decrease expenses or to sell their property. Next slide, please. So tonight, staff recommends that council adopt the Oregon ordinance and then recognizing that rents may be falling and that home prices may be rising.'",
        "'speaker_5': 'Staff also recommends that we explore additional ways to assist impacted landlords. And that concludes my presentation.'",
        "'speaker_0': 'Thank you, Mr. Fitz, for your presentation. And while we're waiting to see if we have any public speakers. Counsel Did you have any clarifying questions? Councilor Brody.'",
        "'speaker_2': 'Thank you. Thanks for that presentation. On your Slide eight, I mean, would it be also fair to say that, you know, for example, in a studio apartment that somebody that's been a tenant who's been unemployed for, say, six months, you know, also would be financially impacted by, you know, having to pay $301.44 for rent during that six'",
        "'speaker_2': 'month period. And that there's also a financial impact on tenants of these rent increases. Or not fair to say.'",
        "'speaker_5': 'Guess that seems like a fair statement.'",
        "'speaker_0': 'Thank you for any other clarifying questions, Councilmember Desai.'",
        "'speaker_4': 'Thank you. This is perhaps a question for the legal staffs, and I kind of submitted the question a little bit earlier, so hopefully I gave them time to think about it. So the thing that's before us contemplates an extension of the rent increase moratorium from the current December 31, 2020 to perhaps June 30th, 2021.'",
        "'speaker_4': 'So my question is. If a landlord has an anniversary date, i.e. the date when the rent could be increased, if the landlord has an anniversary date of, let's just say hypothetically September 1st. When the June 30th moratorium rent increase moratorium ends.'",
        "'speaker_4': 'Does that mean that this hypothetical landlord has to wait until September 1st to do all to increase the rents by a cumulative, perhaps potentially 3.8%? Or can they begin to recoup whatever rent that they had foregone? Let's say one day after June 30th by by starting the process of issuing the notice and all that.'",
        "'speaker_4': 'So so that's that's my question.'",
        "'speaker_0': 'Mr. Ralph, did you want to address that?'",
        "'speaker_1': 'Thank you, Mayor. Councilmember de So what would happen is if the council agrees to extend the moratorium to June 30th of 2021, to the extent that a landlord has not imposed the 2.8% agree that the landlord could have imposed after September of 2019.'",
        "'speaker_1': 'And again, because the rent freeze for the September 2020 a year has been frozen. A landlord who has that September anniversary date, for example, could raise the rent a tenant to 3.0 an additional 3.8% as of July 1st, 2021.'",
        "'speaker_1': 'They would need to give proper notice to the tenant, typically 30 days in order to do that. But the July 1st date would be the the operative date for the 3.8%. And then because the the regulation that has been adopted to implement this COVID red freeze ordinance, the way that the regulation has been drafted, the landlord could'",
        "'speaker_1': 'then raise the rent again come September one by the age that would kick in as of September of 2021. We don't know what that number will be until the April 20, 21 time frame. That's right. So the tenant.'",
        "'speaker_1': 'But the landlord would be able to increase the rent additionally, again, in the absence of a moratorium, either on the local level or on local level or on a statewide level. If that answers your question. Yes.'",
        "'speaker_0': 'I see your hands still up, Councilmember Day. Yes.'",
        "'speaker_4': 'Just one more follow up question. And yes, that does answer my question. I certainly appreciate that that I also appreciate Ms.. Fitz's presentation. Just my quick follow up question for staff or for for for council members to contemplate.'",
        "'speaker_4': 'Is there really anything special about June 30th, 2021 as an end date? Because to me, it seems as if we had April 30th, 2021 as an end date. There's kind of an elegance there and that it would have been one full year basically of a rent increase moratorium.'",
        "'speaker_4': 'So I guess the question is, is there anything special about June 30th as far as our potential and end date for the extension?'",
        "'speaker_0': 'Okay. So that's a question for staff because we haven't got the council's operations yet, but just staff who wanted to address that.'",
        "'speaker_5': 'Sure.'",
        "'speaker_0': 'It fits with.'",
        "'speaker_5': 'I am sure, depending on who you trust or what data you rely on, the vaccinations are expected to be throughout the US. Between June and December. But realistically, it's not expected that every adult over the age of 16 will have access to the vaccine in the United States before the end of June.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, everybody.'",
        "'speaker_2': 'Thanks. I just wanted to follow up on my colleague's question because I think in his hypothetical, it was somebody that had a September 1st anniversary date. So just to say, hypothetically, this goes frozen till June 30th and July 1st.'",
        "'speaker_2': 'They could only raise it 2.8%. Right. Because their anniversary date for the 1% is not until September.'",
        "'speaker_0': 'Droops. Yeah.'",
        "'speaker_1': 'Well, the 1%, they would have been able to raise their rent 1% in September of 2020, but that was frozen. So they would be able to raise the rent both by the 2.8. Assuming that they hadn't raised the rent by 2.8% between September of 2019 and the moratorium in April of 2020.'",
        "'speaker_1': 'If you assume that did not happen, then they would be entitled to imposed a 2.8 plus the 1% that kicked in in September of 2020. So that's where we get 2 to 3.8. But certainly, if they had imposed a 2.8 in September or October of 2019, then the most they could impose in the July time frame of'",
        "'speaker_1': '2021 would be the 1%, the September 20, 28 year.'",
        "'speaker_2': 'Okay. I still think I still think that's a double dip. So that the 2.8. The 2.8. Was that really frozen for this year or was that the 2019 increase?'",
        "'speaker_1': 'The September of 2019 is when the 2.8 could be applied.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'So we are. So we're assuming that the land.'",
        "'speaker_0': 'Sorry. No. Mr.. Mr.. Walsh finished.'",
        "'speaker_1': 'Up with. So we're assuming for the sake of Councilmember de SA's question that the landlord did not impose that 2.8% in September of 2019 all the way through April of 2020. So if we assume that then and then the moratorium kicked in, the landlord could not have raised that 2.8% going forward.'",
        "'speaker_1': 'And then September of 2020 would have rolled around and the council had the rent freeze moratorium in place so that the landlord could not have the 1% at that time either. So that's where we get the combination of the 2.8 and the 1%.'",
        "'speaker_1': 'And so that's where they're making up for that, as it were, when the moratorium rent freeze would be lifted.'",
        "'speaker_2': 'Okay. So what I'm not clear is in September of 2019, there was no COVID in September 2019. There was no moratorium. You got to do your 2.8% increase on the anniversary of your tenancy, which, you know, September, October, November, December, whatever.'",
        "'speaker_2': 'And if you choose not to do that, then and you renew the at least for a year and you're not allowed to do it, my understanding of the rent norms, you're not allowed to do it for another year.'",
        "'speaker_2': 'You can bank it based on the banking rules and such. But, you know, I think the way that this slide is is presented, it's double, double dipping on the 2.8% because we didn't freeze anything in September 19, October 19, December, on November 19 and December 19.'",
        "'speaker_2': 'In fact, we didn't freeze January to March either. So I get what you're saying now about the 1% for September to December. But the 2.8% is not this year's number. That's last year's number.'",
        "'speaker_1': 'So I know that what you're saying is true. But the fact is, if the landlord did not take that 2.8% when the landlord landlord was allowed to, the landlord could take that 2.8%, you know, any time. I mean, essentially just because they don't use it, they don't lose it.'",
        "'speaker_1': 'You know, it can be essentially banked, as it were.'",
        "'speaker_2': 'But think bank on the next anniversary date, not just bank on any random date. Right. Well, we didn't have the banking. That's true. But they have to wait till the next September and say, okay, you know, we were allowed to do this, but we did.'",
        "'speaker_2': 'And so we're now imposing your your new number for the next year because we're not allowing rent increases, you know, midyear, so to speak.'",
        "'speaker_1': 'Well, during that during that year, between 20 between September 2019 and August of 2020, there's nothing that would have prohibited the the landlord from imposing the 2.8. If the landlord would have done that. You are quite correct. The landlord would have had to wait 12 more months before they then could have have imposed the additional 1%.'",
        "'speaker_1': 'I don't disagree with that, but I'm saying that for the sake of every day. So I was hypothetical. It wasn't done that way. And so that's why I'm answering the question the way I did that the 3.8 could be applied.'",
        "'speaker_2': 'I just hope that in the future we're clear with the communications that come out of whoever our administrator is, because there was some confusion about that. So thank you for for clarifying.'",
        "'speaker_0': 'Thank you, Miss Jodie, any other clarifying questions before we go to public comment? Okay, let's move to public comment. Madam Clerk, how many members of the public would like to speak?'",
        "'speaker_5': 'Three.'",
        "'speaker_0': 'Okay. So then.'",
        "'speaker_3': 'Go ahead. First is Cherry Johannsen.'",
        "'speaker_0': 'And you each have 3 minutes, correct?'",
        "'speaker_3': 'Correct.'",
        "'speaker_0': 'Thank you. Good evening, Mr. Johansen.'",
        "'speaker_5': 'Good evening, ma'am. Okay. I think it's okay. Good evening, manager and counsel and. And Staff. I'm speaking tonight for the Alameda Progressives in support of extending the moratorium. We feel that with the vaccine literally on our doorstep, that this is no time to end the protections for renters.'",
        "'speaker_5': 'We implore you to protect the renters for a few more months. We don't want to see.'",
        "'speaker_0': 'A massive.'",
        "'speaker_5': 'Eviction when the end is so close and people will be able to get back on their feet again soon. So we we so appreciate the council's effort in protecting both the renters, renters and the landlords. But we are seeing our way through this and there's hope very soon.'",
        "'speaker_5': 'So I hope you will extend the moratorium. Thank you and happy holidays to everyone.'",
        "'speaker_0': 'Thank you. Happy holidays to you as well. Thank you. And our next speaker.'",
        "'speaker_3': 'Tony Graham.'",
        "'speaker_0': 'Good evening, Mr. Graham.'",
        "'speaker_5': 'Good evening. To emphasize the message from the Alameda Renters Coalition that we believe that the moratorium on rent increases should be extended along with the local emergency declaration. The unprecedented pandemic and economic crisis are only getting worse, not better.'",
        "'speaker_5': 'Now is not the time for the city to step back from tenant protections. One half of the city residents we have received messages from renters are confused and anxious about what will happen to them. The situation is getting dire for many people.'",
        "'speaker_5': 'They still need your help. Please extend. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Graham. Our next speaker.'",
        "'speaker_3': 'Laura Woodard.'",
        "'speaker_0': 'Good evening, Ms..'",
        "'speaker_5': 'Hi. Good evening. I'm also asking you to extend the the temporary rent freeze. I'm I'm volunteering as a tenant counselor through a renters coalition. And we hear from tenants on social media as well. Tenants are in distress about possible increases coming in January.'",
        "'speaker_5': 'As you know, many independent work ers and business people have not financially recovered since the pandemic began, and many of the lowest paying jobs will never come back. And looking at the stats data on market rent, it's still extremely high, even with a dip.'",
        "'speaker_5': 'Many people still feel insecure in their income, their futures and ability to cover rent during the public health crisis. We we hope you'll help to relieve this burden. I also want to note that some tenants were confused by the rent program's letter informing them of maximum possible percent and increase their landlord can implement effective in January January'",
        "'speaker_5': '1st. Some thought they were receiving a notice of increase and unfortunately at least one tenant was given a percentage that was incorrect that was too high because she hasn't been in her unit. She's only been there just over a year and her tenancy isn't eligible for banking.'",
        "'speaker_5': 'So generally the discussion, this discussion emphasizes the cost and confusion that banking presents for renters, especially during COVID. I hope you'll strongly consider extending the moratorium to June. Thank you very much.'",
        "'speaker_0': 'Thank you, Ms.. Woodard. And is that all of our speakers? Madam Clerk.'",
        "'speaker_3': 'That is all we have. No more speakers.'",
        "'speaker_0': 'Okay. With that, I will close public comment on item four B and will come back to the Council for discussion. Councilor Brody.'",
        "'speaker_2': 'I've said a lot about this issue and in a year or so, pending the rest of you having an opportunity to comment, I would like to move approval of the item to impose and extend within the city of Alameda a temporary moratorium on rent increases for fully regulated residential rental units until June 30th, 2021.'",
        "'speaker_0': 'Thank you, Councilor Odie. And would you also include a recommendation to provide direction to staff to explore additional opportunities for further assistance to landlords, especially small operators impacted by COVID 19?'",
        "'speaker_2': 'I'll let somebody else make that motion.'",
        "'speaker_0': 'Okay. Councilmember Desai has his hand up.'",
        "'speaker_4': 'Yes, thank you. I just want to say that I. I'll second the motion made by Councilmember Odie. You know, I've. Yeah. So I'll leave it at that and I'll talk about more when we get into discussion.'",
        "'speaker_0': 'Okay. Well, I will go last, but I am also hopeful that will provide some staff direction as was outlined in the staff report. Conservative fella has your hand up.'",
        "'speaker_5': 'You know, I think staff for the presentation. I do think that there's a lot of questions out there. Having spoken with a number of landlords and tenants, I think that there's a degree of uncertainty on both sides and people are trying to figure it out.'",
        "'speaker_5': 'I do hope that we will look at things like perhaps waiving the program fee for for landlords whose tenants are unable to pay rent. I think those are the types of things that we can do to help make sure that people will take the steps needed to register and participate in the program and not feel afraid of'",
        "'speaker_5': '. I am a little concerned with the letters that went out. I think it's a good thing to to try to get compliance. But I think we have to also walk that line because there are so many people who are unable to pay rent right now.'",
        "'speaker_5': 'And I would hate for people to be sidestepping the use of the program, essentially to everyone's detriment. So I think that that would be something good to look at. I think I am open to having staff and to giving that direction to find ways because I think when we help out our landlords who have fewer units and'",
        "'speaker_5': 'we are also helping our tenants and we are trying to alleviate the stress that exists there. And so I do hope that we we will we will give that direction. I certainly am supportive of it. I also am very concerned about this concept that even though we're giving this protection through June, that people are contemplating a rate'",
        "'speaker_5': 'increase essentially as soon as possible. And I you know, I think that that's very worrisome and stressful because if people are having to pay the back rent and we want them to pay the back rent, then the nickel and diming people on that increase, it is very worrisome to me.'",
        "'speaker_5': 'I would like us to also perhaps give direction to staff to consider looking at some sort of longer period of extension for the bank amount of the increase so that people don't feel like they have to use it or lose it.'",
        "'speaker_5': 'Perhaps we could extend the bank to of the period of time that the increase could be banked in light of COVID so that landlords don't feel like if we don't give that increase from 2019 right away, we're going to lose it.'",
        "'speaker_5': 'You know, I think we're going to have to be creative. I really want to have us take steps. The goal here is to prevent displacement. I would hate to see a mass displacement of so many of our community members.'",
        "'speaker_5': 'I also just think that the stress of housing insecurity is so much and it passes on to our youth and it impacts their mental health and it impacts so many other things. And there are so many families in need right now.'",
        "'speaker_5': 'People are signing up for for supportive services. You know, the number is just through the roof. We're seeing it in our food bank. We're seeing it through the various community groups. And so this is a way for us to also address the stress and anxiety that that is compounding with the pandemic.'",
        "'speaker_5': 'So I'm very supportive of this. I think that there's more we can do. I look forward to continuing this conversation. I think the more we can be proactive and creative ahead of time, you know, the better just to try to alleviate that anxiety and stress and really bring people together.'",
        "'speaker_5': 'Because I don't think, you know, I would hate for us to see this as an issue where we put people against each other, and I think we can work collaboratively on it. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Vella. And I'll just go quickly that I very much agree with what you have just said. And also, I feel that the there is good reason to do this and do this now. I think the June date is a reasonable one.'",
        "'speaker_0': 'Again, I'm very hopeful with this vaccine here being given to our frontline medical workers right now. And it's pretty encouraging that the latest polls show that now 71% of Americans indicate that they would take the vaccine if they see more from science about safety.'",
        "'speaker_0': 'But we are not just going to emerge from one day to the next week. You know, when we did this ordinance before, we thought that by January 20, 21 New Year and we'd be out of it and we do see light at the end of the tunnel.'",
        "'speaker_0': 'It's true, but we need to extend this longer. The reason I'm very supportive of also seeing what we can do to. Of our small landlords is that we don't want them to lose their property because being foreclosed by the bank, that wouldn't be a good thing for tenants.'",
        "'speaker_0': 'It is better to keep people who have these properties who presumably the majority of whom are good landlords, to keep them doing this business. They are all part of the community. And I agree with Councilmember member that we don't want to pit one segment of the community against the other.'",
        "'speaker_0': 'And I'm I'm very encouraged and appreciative that staff has been working with groups of landlords and different sized landlords. So, you know, where the most pain is being felt. So I would encourage you to keep doing that. I think we heard some good suggestions from my colleague, Councilmember Vella, but it's we need to listen to each other'",
        "'speaker_0': ', so let's get some practical suggestions for what would help. And, and we've heard some great suggestions for what could could also help our renters. So I'm vice mayor. That's what I don't think we've heard from you.'",
        "'speaker_1': 'Thank you. I yeah, I definitely support continuing something. I think it's unfortunate that we got here. If we could have stopped those letters going out, if we had if we had managed to get this before the council a month ago for a different reason, then the council member de SAC i to question the whole June 30th date'",
        "'speaker_1': 'because it seems like we continue to put ourselves in a place of putting in hard, hard, hard and fast stop dates. And then when we get to those dates, because things aren't going as well as we had hoped, we then rush to fix things or extend them and whatnot.'",
        "'speaker_1': 'And so I'm wondering whether or not we might want to consider putting a date that is actually connected to win the state of emergency is is rescinded. And and then adding I'm going to assume that since we're doing that, since we're doing this, that, you know, people are not going to go back to work the next day'",
        "'speaker_1': '. So the impacts are going to continue. So whether we said it for 30 or 60 days after the the rescission of the state of emergency, that seems to be a way of just kind of continuing to benefit. The one fear I would have in doing that is putting an open ended date on never have it, never allowing'",
        "'speaker_1': 'for rent increases and whatnot in a way to maybe deal with that would be to allow for a rolling 12 month rent increase so that as you get to the 12 month period that you would landlords would be able to use the rent increase that they had to forego for that the previous 12 months.'",
        "'speaker_1': 'In this case, it would mean for two or three months some landlords would be allowed to add the 2.8% that they weren't allowed from April to August. But then after that it would be the 1% probably until this thing is over.'",
        "'speaker_1': 'So anyway, I just want to throw that out there as is a possibility for how we might just give a little bit more certainty as to how long this is going to go, as opposed to kind of, you know, getting to a getting to an artificial deadline.'",
        "'speaker_1': 'We're going to have to deal with this in April again. And I don't I don't know of anybody who says that this is going to be we're going to be out of this in April. So we're going to be back here in April having this conversation again.'",
        "'speaker_1': 'I think if we don't go longer than than June 30th. So those are my comments.'",
        "'speaker_0': 'And I'd be interested to hear from staff in response to the Vice mayor's comments. Ms.. Maxwell?'",
        "'speaker_5': 'Mr. WRIGHT Yeah, I.'",
        "'speaker_4': 'Think that's an interesting idea. I mean, I.'",
        "'speaker_1': 'Agree with with this very next flight that we don't want it.'",
        "'speaker_4': 'To just continue without any event that would cause it to terminate.'",
        "'speaker_1': 'So maybe and I'm different and Mr. Rash on this, is.'",
        "'speaker_4': 'There a way to bake in some language that would, you know, give the city council the authority to come back and modify the duration to the extent that.'",
        "'speaker_5': 'The event didn't occur as.'",
        "'speaker_1': 'Planned? But we thought that the timing.'",
        "'speaker_4': 'Was appropriate to end that.'",
        "'speaker_5': 'Limitation.'",
        "'speaker_1': 'It would it would seem to me that if to carry out vice mayors. What his thinking is that at least with respect to this ordinance, it would be tied to the determination of the local emergency. I think what we need to do to come back is to address sort of his second concern about how we would deal'",
        "'speaker_1': 'or what would the council would want to do with respect to allowing this kind of rolling rent increase concept, because we need to sort of think that through and how that would be worded. And we don't want to do that on the fly tonight.'",
        "'speaker_1': 'But we could certainly amend what's in front of you tonight to have it not end as of June 30th, but tie it to the termination of the declaration of the local emergency. I think that would be within the ambit of what was presented.'",
        "'speaker_0': 'I'm going to call in myself here. I wonder if we might have language to say that the program would conclude by June 30th, 2021, or the conclusion of the state of emergency, whichever is later, later. And I you know, vice mayor notes, but I agree with you, we are I'm still looking for that crystal ball.'",
        "'speaker_0': 'But I think the closer we get with the vaccines, I think there's some basis to to have hope that by the end of June, we could do something like that. But again, we're just seeing day two of the rollout.'",
        "'speaker_0': 'We don't know how it will go. But I'm just wondering if those two are, you know, maybe no date at all that says I think Maria then has a very valid then councilor, everybody with their hands up. Councilman Rivera.'",
        "'speaker_5': 'Not me. I'd be supportive of your proposal. I think it covers both bases. I and then I think we would have to then add the direction. And this is a question for the maker of the motion with that language changes proposed in combination by the mayor and vice mayor.'",
        "'speaker_5': 'Would that would we be able to add the direction to look at the various relief items? Because one of the relief items would be the rolling period for for the rent increase, and it could either be a rolling 12 month period or just an extension of when the increase could occur.'",
        "'speaker_5': 'But that would be one of the things or the remedies that staff would be looking at to to help alleviate any stress on the landlords.'",
        "'speaker_0': 'I think it will. We go to the maker of the motion next, Councilmember Odie?'",
        "'speaker_2': 'Sure. Just for clarification, I thought I heard the Vice Mayor propose that it would be 60 or 90 days after the termination of the emergency. I mean, is that something that would be acceptable to you, Madam Mayor? I think when I heard your comments, it was terminating coincidentally with the end of the emergency.'",
        "'speaker_0': 'Um. Yeah, I, I, I think, and again, I, my best assessment hanging on the, every word that I hear from public health officials, from Dr. Anthony Fauci down to our amazing county public health officials, that I think we are going to see a gradual reopening of our economy, too.'",
        "'speaker_0': 'I mean, that was part of the push that Alameda County made to be proactive to join the state's order even before we were down to only 15% capacity in our ICU to see if we could turn things around.'",
        "'speaker_0': 'And, you know, last week the public health officer, Dr. Nicholas Moss, spoke to the Alameda County mayors and told us that he doesn't see the ability to do this to our economy again. We just can't keep turning the spigot on and off.'",
        "'speaker_0': 'So this is like one last, you know, full court press. But the timing's great. You know, we're we're doing this with the vaccine. But which is just to say, I think I guess we could add that additional. I mean, Counsel, help me out with your thoughts.'",
        "'speaker_0': 'I guess we could say 30 or 60 days passed a day or 30 days past the declared end of the state of emergency. Remind me, there's something else we did that has a plus 30 days scale.'",
        "'speaker_2': 'It was the rent deferral repayment. Okay. Well, I'm happy to.'",
        "'speaker_0': 'Reiterate.'",
        "'speaker_2': 'The motion if if you would entertain that.'",
        "'speaker_0': 'Sure, that's right.'",
        "'speaker_2': 'So I would actually include both because there were some good comments from all of my colleagues. So adopt the staff recommendation, including both a moratorium and the direction to explore additional opportunities. And and the moratorium would be until June 30th, 2021 or 60 days following the termination of the local emergency, whichever is later.'",
        "'speaker_0': 'Elsewhere every day.'",
        "'speaker_4': 'You know, I'm more than happy to continue to second this, and I would love to have some direction. Also, I think some great ideas came out in terms of, you know, how to make some assistance to the smaller landlords.'",
        "'speaker_4': 'So that would be great. It seems to me in thinking about what we're doing right now, it seems to me that in effect, we are we are really not having a June 30th deadline. Right. I mean, because theoretically.'",
        "'speaker_4': 'I mean, mathematically. We I. Does any of us of us really think that June 30th -60 days is, what, April 30th? April 30th? Does anyone really think that between now and April 30th that the emergency is going to be lifted?'",
        "'speaker_4': 'So, so mathematically. And because I don't think that's going to happen mathematically, there really is no June 30th. And you're right. It's just whatever the the the science, the scientists says, is the end date plus. Did we say 30 or 60 plus whatever?'",
        "'speaker_4': 'I think that's I think that's what we're really calling the triggering point. Is that right? I mean, it's but if you want to insist on including June 30th and that's fine, it doesn't it doesn't hurt. But I just I just want to.'",
        "'speaker_4': 'Mention that.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Yeah, we. We could all trade our guesses in it.'",
        "'speaker_5': 'Oh.'",
        "'speaker_0': 'I don't. I don't really know that how long the state of emergency will last, because I don't know how successful the vaccine rollout is going to be. But I actually maybe I'm just hopeful. But but anyway, what do we want to do?'",
        "'speaker_0': 'We need to move this item along. Council. I am happy to use both the date and the end of the order, plus the detail.'",
        "'speaker_5': 'But I'll say.'",
        "'speaker_0': 'Okay, we have a second for the discussion. Maybe have a roll call vote with.'",
        "'speaker_3': 'Councilmember de sac. I actually i i o.d.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Vela. I Mayor, is the Ashcroft high that carries by five eyes.'",
        "'speaker_0': 'Thank you, everyone. And that concludes the last item of business for this meeting. But I want to adjourn this meeting in honor of a very special Al-Ahmed. And I think a lot of you knew who who passed away last month.'",
        "'speaker_0': 'That was Dr. Jepson. Boone and Dr. Jepson. Boone was a long time physician in Alameda. He practiced for 35 years here. But before that, he he grew up in East Texas and was raised by his grandparents. He went off to Texas Southern Southwestern Medical School.'",
        "'speaker_0': 'But then in the third year of his medical residency, he was drafted and he served in the in the Navy as a as a Navy doctor. He was there in Berlin as the wall was going up. He also served in Vietnam during the Vietnam War in a number of different assignments.'",
        "'speaker_0': 'When he was on assignment in France, he met a lovely Scottish nurse named Valerie, who he later married. They had five children and settled in Alameda in in 1971. I got to know Doctor Boone when I was chairing the campaign to build the new main library.'",
        "'speaker_0': 'Co-Chairing it with Frank Matter SC and Dr. Boone was just a dedicated supporter of libraries and just his wonderful supporter. And then later he was a huge supporter of the campaign to keep the hospital open when I chaired it.'",
        "'speaker_0': 'And he was also my parents physician for a number of years. And so when we both served together on the hospital board and I talked to my would I also always say Dr. Boone, Dr. Brennan, he'd say that if you knew him.'",
        "'speaker_0': 'That deep voice. Marilyn, I have a first name. It's Jeb that I said. I know, but I don't think I can call you that. But what I loved in the end also, he was a longtime member and leader of Christ Episcopal Church here in Alameda.'",
        "'speaker_0': 'But in his obituary, which appeared in our local papers, I love this find that he is and his children will remember him as a tireless supporter and a source of calm in any crisis, real or imagined. He is fondly remembered for his warm, heart wise counsel and a deep skill as a peacemaker.'",
        "'speaker_0': 'And that's certainly how I remember him fondly. And Councilmember o.T, you you knew Dr. Boone, too, from the hospital board, correct?'",
        "'speaker_2': 'Yes. And I think you encapsulated everything and definitely a great loss to our community. And his many years of service will be missed.'",
        "'speaker_0': 'All right. So anyway, this meeting will be adjourned in honor of Dr. Jeff Coburn. So we are going to adjourn this meeting. Madam Clerk, tell us how this goes.'",
        "'speaker_3': 'So this meeting is adjourned and then you just go on to the regular meeting and start with the.'",
        "'speaker_0': 'All right, so we got no. No break, people. Sorry. So may we have the roll call, please? Madam Clerk.'",
        "'speaker_3': 'I've been notified. Present.'",
        "'speaker_0': 'All right, so then we come to a resolution acknowledging service and some farewell comments. So I am going to start off with a resolution for our colleague Jim Odey, whose last council meeting is this evening. And it is my pleasure to read this proclamation, which later this evening, a masked woman will appear at your door with.'"
    ]
}