{
    "Recommendation to Modify Rent Relief Programs Offered at Alameda Point in Response to the Covid-19 Pandemic to Allow Loan Conversion Applicants to be Eligible for the Newly Approved Assistance for Non-Profits and Spirits Alley Businesses and to Allow Recipients of Business Assistance Grants to be Eligible for the Alameda Point Programs with the Obligation to Repay the Business Assistance Grant. (Community Development 858)": [
        "'speaker_1': 'Okay, great. So then we come first time five H and council member Odie. You asked to pull this.'",
        "'speaker_4': 'Thank you, Madam Mayor. I mean, given that we're talking about rent and COVID and the comments brought up during item four, and if it's inappropriate and you could you could tell me it's inappropriate, but I think it'd be worth agenda raising that discussion before the end of the year.'",
        "'speaker_4': 'On whether the rent increase moratorium should be continued. Otherwise, I have no problem with the item.'",
        "'speaker_1': 'I'm sorry, is this in relation to five?'",
        "'speaker_4': 'H Well, H is rent and COVID, so there's at least tangentially a link. But if you all think it's too gentle, you can tell me so. But, um, I think there should be some discussion about agenda.'",
        "'speaker_6': 'Easing.'",
        "'speaker_4': 'An extension before it's one one or 1231.'",
        "'speaker_1': 'Um, I would look to the city attorney to tell us I don't disagree that it's an important topic. I would just look to the city attorney to give us a little direction here, if you would, Mr. Chan.'",
        "'speaker_4': 'So I believe Councilmember Brody pulled five H Or did you pull anything else besides five H I'm sorry. H Rent related to COVID. Yeah. Yeah. So, um, so because five H relates strictly to businesses and the direction that the councilmember would be giving us does not relate to businesses.'",
        "'speaker_4': 'I think that would be a direction probably too far from five H But we fully recognize your comments and we hear them without you having to specifically take action. Okay. Well, with that, I'll move approval of the item.'",
        "'speaker_1': 'All right, I council member Vela second. Okay, so we had a motion by councilmember decided by Councilmember Vela to adopt to approve item five h um, recommendation to modify rent relief programs offered down to point and commercial and nonprofit properties.'",
        "'speaker_1': 'And any discussion comments saying that we have a roll call vote, please.'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_4': 'Yes.'",
        "'speaker_0': 'That's right.'",
        "'speaker_4': 'Hi.'",
        "'speaker_0': 'Odie. I avella.'",
        "'speaker_2': 'Hi.'",
        "'speaker_0': 'Mayor. As the Ashcraft frame carries by five eyes.'",
        "'speaker_1': 'Okay. Thank you. And so then we move to item five L And is this where we have a couple of speakers, Madam Clerk?'",
        "'speaker_0': 'We do. We have a few speakers.'",
        "'speaker_1': 'This is speakers. Okay. So do we want a brief staff report on this one?'",
        "'speaker_0': 'We need to admit the H.R. director. She's coming in so generally.'",
        "'speaker_1': 'So while we are awaiting the arrival of H.R. director Nancy Bronstein to introduce the item.'",
        "'speaker_0': 'Adoption, a resolution approving an amendment to the memorandum of understanding between the City of Alameda and International Associate Association of Firefighters Local 689 extending the term through December 19th, 2023.'"
    ],
    "Adoption of Resolution Approving an Amendment to the Memorandum of Understanding between the City of Alameda and the International Association of Firefighters, Local 689, Extending the Term through December 19, 2023.  (Human Resources 2510)": [
        "'speaker_1': 'Thank you. And Ms.. Braunstein, feel free to add. Meet yourself to do that. Yeah. And there she is. Hello.'",
        "'speaker_2': 'Do you need. I can. I can just keep a brief overview of this item. This is to adopt a memorandum, an extension of the current memorandum of understanding with the International Association of Firefighters. What this item does, it extends the term an additional two years.'",
        "'speaker_2': 'The firefighters will not receive an increase this year. In 2021, they would have been eligible for a 2% increase. They will not receive that increase. But during the extension in.'",
        "'speaker_1': '2022 and.'",
        "'speaker_2': '2023, they will receive 2%.'",
        "'speaker_1': 'So it extends it for the additional two years. So for a three year term. Say. Thank you, Miss Bernstein. Why don't we? Unless there are clarifying questions about the staff report, let's hear from our public speakers and then we'll go back to public to council.'",
        "'speaker_1': 'Comment. Are there any clarifying questions? Okay, so let's take our public speakers, please.'",
        "'speaker_0': 'Kirk Van Kearney.'",
        "'speaker_1': 'Kevin Brady. Good evening, Mr. Kearney.'",
        "'speaker_3': 'Hello, Mayor de Council. Nice to see you all. Existing contract with the IAF Local 689 does not expire until December 18th, 2021. The uncertainty with regards to the economy and the effects of COVID 19 on the city budgets provides too many variables when considering the renegotiation of a labor contract that has one year remaining.'",
        "'speaker_3': 'In my opinion, the prudent financial option is to wait and see how the coming months events unfold before discussing a new contract. Our business, community and citizens have suffered severe financial damage. The possibility of continued curfews and shutdowns is likely as the COVID 19 crisis has spiked again.'",
        "'speaker_3': 'The state in some cities, as well as numerous private companies, including those in our business community, have laid off workers and curtailed business activities. There is a real possibility that our city could also be forced to invoke pay cuts and layoffs.'",
        "'speaker_3': 'Engaging in a negotiation with only one bargaining unit, especially one that comprises a large percentage of the city's payroll and not all of the city employees is not prudent, nor is it fair to the other bargaining groups. The city and its residents are truly in this together.'",
        "'speaker_3': 'Now is not the time to negotiate a separate deal with IMF f 689. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Kearney. And our next speaker.'",
        "'speaker_0': 'Trish Herrera. Spencer. Former mayor.'",
        "'speaker_1': 'Mr. Spencer. Good evening.'",
        "'speaker_2': 'Anything. Can you hear me now?'",
        "'speaker_1': 'Yes, that's fine. Okay. Great. Thanks.'",
        "'speaker_2': 'I wanted to also speak to this item. My concern that I would be echoing Kevin Kearney, the Treasurer. I believe we're out of the sorry and I'm back. When I was on council I had voted against this as had member decent.'",
        "'speaker_2': 'And at this point, I believe it's appropriate that we do not grant the extension. It is a serious matter if you look at the cumulative raises that the Firefighters Association have received under this contract. It is actually 20.7% since 2000 for 2014, which is very significant.'",
        "'speaker_2': 'I think the staff's report should have included that. I would have liked to have seen a breakdown of the annual raises for the firefighters, as well as their supposed to be a compensation that was supposed to happen in 2020.'",
        "'speaker_2': 'There's no update on that. There was also I think there should have been a link to the current contract. And in regards to the fiscal health in the staff report, it shares of savings at 174,000. That does not speak to.'",
        "'speaker_1': 'The.'",
        "'speaker_2': 'Additional two years of the 2%. I think it's very likely we will be asking once again all departments to have some savings. And there doesn't appear to be. And this seems to put the firefighters association in front. And I also want to share that if you listen to the transcript, if you look at the transcript from the'",
        "'speaker_2': 'grand jury, we the conversation with the former city manager that in fact, shares a comment by a member to request a short extension or something of the firefighters contract, which is interesting that that's what's appearing to be happening.'",
        "'speaker_2': 'Also, if you look at the recent contributions to member Ody and member Bella's campaigns for the their last campaigns, you will see. This is old information, I think, but it was approximately 30,000 from our Firefighters Association to member of this campaign and almost 23,000 to remember Bella's campaign, which is by far the largest donors.'",
        "'speaker_2': 'The next ones are like 70 $500. So I actually think they should consider recusing themselves from the vote on this. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Spencer. Our next speaker.'",
        "'speaker_0': 'Jay Garfinkel.'",
        "'speaker_1': 'Mr. Garfinkel, good evening.'",
        "'speaker_4': 'Good evening. I have a few concerns, some of which have already been shared by Ms.. Spencer. One is that the firefighters contract, which is extremely generous, is playing a significant part in the city's financial budget woes. And I think that we should not be too quick to make it even more generous.'",
        "'speaker_4': 'We have I don't believe there's been any comment from the Treasurer or auditor and what the financial impact will be. It appears that the financial impact will be to increase the debt or relative debt of the city. And I think we should have the expert comment from our two elected financial.'",
        "'speaker_4': 'People. I was concerned that the City Council participated in the drafting of the memorandum by virtue of sitting in on the closed session and then giving direction to the city manager. I'm also concerned regarding the campaign contributions that were received by two of the members, as was just pointed out.'",
        "'speaker_4': 'And I believe that's patently a conflict of interest. And the city attorney doesn't seem to have any concerns about conflicts of interest these days. So I think that both Councilmember Odean, Councilmember Vella should recuse themselves from any voting.'",
        "'speaker_4': 'I also think it should be put off until next year as the first speaker recommended. There is absolutely no urgency in taking action on this issue tonight. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Garfinkel. Next, public speaker Harman Reed. Is right. Good evening. Good evening.'",
        "'speaker_2': 'And. And thank you very much, Madam Mayor. And City Council members. I would just like to echo what Mr. Spencer and Mr. Garfinkel stated, and I respectfully request that Council Member Odie and Councilmember Bella recuse themselves from this from this vote based on the the contributions that they received for their for their campaigns.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you, Mr. Reed. Our next speaker.'",
        "'speaker_0': 'We have no more speakers.'",
        "'speaker_1': 'Okay. And do we have council comments and questions? Councilmember Vela, I see your hand up, followed by Councilmember Odie, followed by Councilmember Dave and Councilmember Vela.'",
        "'speaker_2': 'So, you know, first of all, I would recommend that any incoming member to the City Council get acclimated with and familiar with our council handbook, which we passed while that person was not on city council. Second of all, I would like to ask.'",
        "'speaker_2': 'There were some allegations raised essentially during the comments, and I'd like to hear from our city attorney about the conflict of interest. There also seems to be some misinformation. There are requirements that we report. Any in-kind contributions. Whether or not we have any control over those things does not make them a monetary contribution.'",
        "'speaker_2': 'I'd also like to find out. So I'd like to hear from our city attorney on that. And then I'd also like to wonder, Mr. Garfinkel is a top donor to Councilmember De Saag and to Ms.. Spencer. And so whether or not they need to recuse themselves from similar votes.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'So, Mr. May. May I call on you next?'",
        "'speaker_4': 'Of course. With respect to the question about conflict of interest, there is no state or local law requirement that mandates that council members.'",
        "'speaker_3': 'Recuse just because they receive.'",
        "'speaker_4': 'Campaign contributions. And that is a longstanding and black letter law. Council members could choose voluntarily to recuse on any number of things, and that's beyond what we.'",
        "'speaker_3': 'Would be recommending. But in terms of.'",
        "'speaker_4': 'Legal requirements, state law does not require recusal based on campaign contributions, and neither does local law.'",
        "'speaker_2': 'And not a mayor. There was there was also a statement made about council writing the staff report, if we could hear from the staff. I wasn't involved in drafting the staff report, so I'd like to hear from staff about that.'",
        "'speaker_1': 'Maybe the MRU, but yeah, I could.'",
        "'speaker_5': 'Yeah, I can.'",
        "'speaker_1': 'Mr. Leavitt is your Eric Leavitt, please?'",
        "'speaker_5': 'Yeah, I can. I can address both. I can address that. And also just expand to make sure people are well aware of what's in the contract or what's in the what before the council tonight. So no city council member was involved and no see as far as the drafting of the staff report.'",
        "'speaker_5': 'So obviously in negotiation with the firefighters union, I had to go for direction to the city council in closed session and that was our involvement of the city council and no city council member or city council as a whole had any involvement in it.'",
        "'speaker_5': 'Other than that, I want to lay out just so to make sure people are understand because I got some emails which confused me a little bit when I read the contract. I was trying to understand how the email related to the contract, but this extension would be a two year extension.'",
        "'speaker_5': 'If I could just explain real quick to make sure the public understands it's a two year extension.'",
        "'speaker_1': 'That's very helpful. I appreciate it.'",
        "'speaker_5': 'Okay. It's a two year extension right now. They are scheduled to receive a 2% increase based on the salary survey survey on January of 2021. So that's in about one month from today. And with this extension, if approved by the city council tonight, that 2% would become a 0%.'",
        "'speaker_5': 'So that's worth $174,000 savings for the fiscal year. And about $348,000 savings for a calendar year would occur. That 2% would then go into the following year. So for what was a 2% this year would not become a 2% until 2022, not 2021.'",
        "'speaker_5': 'And so the reason for the action today or the action before January one of 2021, is that once the increase goes in, then it would become a take back and there would be a different type of negotiation that council would have to do with the firefighters at that time.'",
        "'speaker_5': 'So the increases with the two year extension as as shown is about 4% over the three years. So over the last year of the contract and two years of extension would be about a 4% versus the average that the firefighters have received, which I think one of the speakers I did did refer to was about a 3.2%'",
        "'speaker_5': 'per year for the previous six years. So this is a 4% over three years. Collectively, for the entire three years, it's a 4% versus the average of about a little over 3% per year. Prior to this, I think I thought that that was something that was a fair deal.'",
        "'speaker_5': 'And I felt the firefighters also deferred this year's increase, which actually doesn't even factor into that. What I just said, in addition that we didn't even put into the financials, is that they do pay between two and 4%.'",
        "'speaker_5': 'In addition on their pension and in what's before the council tonight, they would continue to pay that for the two year extension, which if this was not approved tonight, we would have to renegotiate that in one year from now.'",
        "'speaker_5': 'So that's not even projected in the financial savings to the city, but that is a assumed financial savings also within the contract.'",
        "'speaker_1': 'Thank you, Mr. Levitt. Councilor, are you finished? And then. Okay, so then we're going to Councilmember Ody and then to you. Councilmember Desai.'",
        "'speaker_4': 'Thank you, Madam Mayor. I mean. Mr. City Manager So that to the fore that was on top of the 11 that were allowed by maximum law. So I mean, it's really between 13 and 15% of their salary for pension, right?'",
        "'speaker_5': 'Right. It's over and above the regular percentage. That is.'",
        "'speaker_4': 'Correct. And then there's also a contribution of 4% for OPEB that the bargaining unit is contributing that continues for another two years in this contract as well. Correct.'",
        "'speaker_5': 'I'll let the h.r. Director speak to.'",
        "'speaker_2': 'That. That that's correct. They are paying.'",
        "'speaker_1': 'The additional.'",
        "'speaker_2': '6% toward hers and then in addition, another 4 to 4% to the OPEB liability. And that is what I continue.'",
        "'speaker_1': 'With this in your I'm going to ask just for the benefit of the lay audience that might not deal in these acronyms as often as we do. Just tell us what personnel are you referring to them, if you would, please respond to that.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'So for the retirement system, the oh, our public safety pay an additional amount as a portion of what the employer would pay. They contribute to that. So they pay 6% toward the employer's contribution.'",
        "'speaker_1': 'And then separately from that, we are setting.'",
        "'speaker_2': 'Aside money to pay down future cost, and that is the OPEB trust. And they pay between two and 4% into that trust as part of their contribution.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'And then the prize is the public employee retirement system. Public employee record. The OPEB is the other other post-employment benefits.'",
        "'speaker_4': 'CARLSON There was another provision in the current contract, something called the Breather Balanced Revenue Index, which created a floor and a ceiling for increases based on how well the city's financial performance was. And that's taken out of this two year extension, isn't that correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_4': 'So for 2021, then they're forgoing a 2% increase and getting a 0%. That correct?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'That's correct. How much is how much are other bargaining units getting as an increase in 2021, the same year that the firefighters are taking a 0% increase?'",
        "'speaker_2': 'The other firefighter group will receive 2%. And then.'",
        "'speaker_1': 'Our public park police.'",
        "'speaker_2': 'Officers, it's based on a salary survey, will receive four and a half and then miscellaneous employees are 2%.'",
        "'speaker_4': 'Okay. So I appreciate that. Just a couple quick comments. It never ceases to amaze me that we have the you know, the haters of the firefighters come out whenever there's a contract. And I can never figure out why it is.'",
        "'speaker_4': 'I mean, is it because they save lives? Is it because they protect our property? Is it because, you know, when we have an arson string on Park Street, they respond quickly. So a whole block of of wooden buildings is not burned down.'",
        "'speaker_4': 'Is it because they risked their life and limb to in mutual aid to help the state while it's burning? Or is it because they exercise their First Amendment rights, First Amendment rights guaranteed in the Constitution of the United States?'",
        "'speaker_4': 'So, I mean, some day somebody, you know, I'm not going to be here much longer, but someday somebody will tell me, you know, what what what the problem is with firefighters, you know, is it that they do their job and they protect us and we don't like that?'",
        "'speaker_4': 'Or is it, you know, that, you know, they just decide on their off time to exercise their First Amendment rights and including and First Amendment rights is the right to make an in-kind contribution to a candidate of their choice that they've endorsed.'",
        "'speaker_4': 'And they've chosen to do that. And as Melissa, our councilmember Bella, but by the way, won the election going away, as she said, that's their right to do and we really have no control over it. So it's just kind of interesting.'",
        "'speaker_4': 'And I will point out that, you know, according to our charter, which I continue to read and reread, you know, the only response, the only qualification of an auditor is to be a CPA, and the only qualification for treasurer is to have investment experience.'",
        "'speaker_4': 'There is no requirement and maybe they have imputed on themselves some magical financial analysis powers that they're not required to have. But if I'm going to be listening to somebody's financial analysis, I will listen to our finance director and Eric Levitt, our city manager, and Jerry Bodin, our assistant city manager.'",
        "'speaker_4': 'So know this whole idea that, you know, campaign contributions are some time link. I mean, that that's the new standard we're going to have then. You know, I think when two people one person on council now and one that will be sworn in in two weeks decides to vote on anything related to tenants.'",
        "'speaker_4': 'You know, I think I'm going to be the first one in line that says you need to recuse yourself, because under your standard, if you receive campaign contributions, you're not allowed to take a vote on that. So we'll just see how far that works.'",
        "'speaker_4': 'So again, it just boggles my mind that there's so much angst over, you know, people that are protecting our city when, you know, they volunteered or offered to take a 0% increase during a COVID year when, you know, their fellow public safety officials are happy to take a 4.5% increase.'",
        "'speaker_4': 'So it is what it is. But, you know, I hope someday there's animosity towards the fire department and their hardworking employees goes away. I'll just say one last thing. I mean, it's a little bit weird for me to sit up here and have my ethics criticized by someone who accused of taking city funds and depositing it in'",
        "'speaker_4': 'their bank account. But, you know, life is what it is.'",
        "'speaker_1': 'Thank you, Councilmember Odie. I'm going to ask our H.R. director, Nancy Bronstein, to comment, because I also don't want to pit one public safety group against another. I think that anyone who risked their life in the course of doing their job deserves the measure of respect.'",
        "'speaker_1': 'Ms.. Bronstein, could you explain to us why it is and I believe that the salary survey has something to do with the difference in the percentage increase that fire is seeing as compared to police. Yeah. Since Mr. Latte raised that.'",
        "'speaker_2': 'Is that the memo you are the the negotiated agreement with all four public safety units had this coming salary increase the January 21 salary increase is based on a salary survey. Those agreements identify what agencies will survey. So we look like agencies.'",
        "'speaker_2': 'And we did a survey and the language in the agreement said that the salary increase would be based on the survey and could be that it would be between two and 5%. So based on the survey results, so the police were four and a half percent below market.'",
        "'speaker_2': 'So they see that four and a half percent fire was not below market. So that's why they're receiving the 2%. So it's just.'",
        "'speaker_1': 'To.'",
        "'speaker_2': 'Equalize salaries.'",
        "'speaker_1': 'In fact, fire was above market, if I recall.'",
        "'speaker_2': 'I guess above market and place was below.'",
        "'speaker_1': 'Thank you for that clarification, Councilmember Desai.'",
        "'speaker_6': 'Thank you. Thank you very much. I pulled this item from the consent calendar largely because I wanted to do it as I think that the council ought to extend as a courtesy the CEO, the new incoming council member, an opportunity to officially participate in the vote on a topic that is a large part of the City of'",
        "'speaker_6': 'Alameda budget. Granted, what's before us right now is about is about extending for two additional years a contract that will sunset on December 2021, I believe. So so that what's before us is specifically about the contract and extending the contract.'",
        "'speaker_6': 'But really, the topic, the subject for which this contract is being considered or for extension is a large part of our of our city hall operations. So for that for that reason, I it was my feeling that we should include the incoming councilmember.'",
        "'speaker_6': 'I do want to extend a heartfelt thank you to Councilmember o.T. I do know that, you know, with great passion that he's represented. Public service, public safety service. And I think for that, he should be thanked. And and no one, you know, should she should hold that against him.'",
        "'speaker_6': 'But I do think, though, that the subject matter, because it's a large part of our city hall budget, I think because there will be a new council member, that she should take part in that discussion. And that's why I pulled this.'",
        "'speaker_6': 'In terms of the substance of the agreement, there are actually some very good things within the extension. For example, not doing the BRI. I'm not going to go into the details of what the BRI is. But it was this way in which the rate the percentage increases was was calculated.'",
        "'speaker_6': 'And when you go into the details of it, you know, it resulted in these. Year in, year out kind of increases several years ago that cumulatively, in my opinion, as one of five council members was a slightly excessive.'",
        "'speaker_6': 'So I'm glad to see that the Brea formula is being stripped out so that that's actually a positive when it comes to this extension discussion. And it is also a positive that that there is a 0% increase, which is a misnomer.'",
        "'speaker_6': '0% increase this coming year as one of the trade offs and a 2% in the following year. And that's a the 2% is a positive in relationship to the average that you heard earlier this evening. I think you heard an average of roughly 3.5% a year.'",
        "'speaker_6': 'You know, over time, cumulatively, that that added up. So what's so within the the the substance that's being discussed, there are actually some positives. But I think the larger issue, though, is that we should include the new incoming council member, Tricia Herrera Spencer, in this discussion, because this is a large part of City Hall and it will'",
        "'speaker_6': 'be so going forward beyond the December 2021 sunset into the end of 2023. I suspect so. Okay. So that's why I pulled it.'",
        "'speaker_1': 'Thank you, Councilmember. Dislike for that explanation, Councilmember Vela.'",
        "'speaker_2': 'I appreciate that. However, I also inherited a bunch of contracts that were voted on fairly, but within a few months of me coming into office. So I think that, you know, we've seen this at the federal level, you know, Obama having to wait essentially and people filibustering Supreme Court appointments.'",
        "'speaker_2': 'I think that that we can go back and forth on this. My concern is that there there is a scheduled increase that they are due to get under the existing contract next month, I believe. And so there is a timing aspect to this.'",
        "'speaker_2': 'And sometimes, you know, those for those reasons, it's important to to know whether or not that we're going to be paying out the 2% or not and merely holding it up so that a new council member can vote on it might not be the most prudent thing because of the existing requirements of the contract.'",
        "'speaker_2': 'So for that reason, I think that we should move forward tonight as planned because we're going to get that savings and we need to be able to factor that in when we go into the midyear. And I, I would like I think staff also would like to know what we're doing.'",
        "'speaker_2': 'I think it's with our noticing requirements and everything else, if we waited, it would it would really put it down to the wire.'",
        "'speaker_1': 'Thank you. Councilmember Avella, Councilmember de SAG. You are welcome to make a motion to. To carry out your desire. I don't know if.'",
        "'speaker_2': 'You're.'",
        "'speaker_1': 'As is your right.'",
        "'speaker_6': 'I'll I'll move that we postpone this item until the first meeting in January 2021.'",
        "'speaker_1': 'All right. We've had a motion by Councilmember Desai. Do we have a second? I'm not seeing a second. So that motion dies for lack of a second. Any further comments, questions on this item? Counsel, you're still on the consent calendar.'",
        "'speaker_1': 'I see you're next.'",
        "'speaker_5': 'I'd just like to make one quick comment that I'd be happy to move to the staff recommendation.'",
        "'speaker_1': 'And I make my quick comment. Okay, go ahead.'",
        "'speaker_4': 'Gladly.'",
        "'speaker_5': 'Because I have a great idea. So my comment is that that this process is not something that just popped up and is being rushed through. It's been a part of council conversations. I believe we had two council meetings over the over the one over the summer and one in the early fall as well.'",
        "'speaker_5': 'This is the culmination of long conversations and negotiations and the idea that we would stop so that that we could possibly change course after all those good faith negotiations is a little disconcerting to me. I also just wanted to say that nobody else has acknowledged it.'",
        "'speaker_5': 'I wanted to just call out that. I think that the attacks on the integrity of our city attorney, especially given how factual and inappropriate they were, were uncalled for. And that I have I work with a lot of city attorneys in my job, and I have worked with a number of them here in this in the city'",
        "'speaker_5': 'of Alameda as well. And I hold Mr. Shin very, very high regard, especially as it comes to ethics and following the law. And I think that it was just absolutely unconscionable to assume that he is somehow not care has turned a blind eye.'",
        "'speaker_5': 'The comments themselves, I think, really did call themselves out as being uninformed, and I will put that down to that. But I wanted to just offer my strong support for our city attorney because I think he does a fabulous job.'",
        "'speaker_1': 'So thank you for raising that point. I was taken aback by the speaker's suggestion that Mr. Shin doesn't care about conflict of interest. He follows the law. He's very knowledgeable about the law. Perhaps this council, moving forward in the next year, would like to entertain a conflict of interest, provision, ordinance, what have you.'",
        "'speaker_1': 'There's lots of lots of potential, I'm sure, but one of the things we talk about as a council are our responsibilities to the public when we're serving as council members and not to engage in ad hominem attacks on members of the public.'",
        "'speaker_1': 'There is not a handbook for the public, at least not not a written one. But I've often suggested that we would all do well to treat people the way we would like to be treated. And we can always elevate our discourse.'",
        "'speaker_1': 'And, you know, we don't all agree with each other, but for the most part, the council is able to communicate civilly with each other. And that's what I ask all of you, the five of us, that let's just keep it civil when we're talking.'",
        "'speaker_1': 'I know we get passionate and excited and let's set a good example for the public hopefully to follow. And I do want to thank all of our staff for their input. Mr. LEAVITT Great explanation. This party. Mr. Shen, I will tell you, I'm not fully in love with this proposal, but I do understand the merits.'",
        "'speaker_1': 'I'm going to support it. And so with that, I believe you by spirit. We're going to make the motion to adopt this resolution.'",
        "'speaker_5': 'Thank you. I'm approval of the staff recommendation and the resolution as written.'",
        "'speaker_1': 'Thank you. In a second.'",
        "'speaker_4': 'I'll second.'",
        "'speaker_1': 'All right. It's been moved by Vice-President Slade, seconded by Councilmember Ody. Any further discussions? Seeing. And may we have a roll call vote, please.'",
        "'speaker_0': 'I'm sober, Doug.'",
        "'speaker_4': 'No.'",
        "'speaker_0': 'Not quite. All righty, Odie. I vela i mayor as the guy that carries 41.'",
        "'speaker_1': 'Thank you, Madam Crooks. We have one more item that was pulled also by Councilor Woodside and that's item five. Oh, Madam. Quick, could you introduce that item, please?'",
        "'speaker_0': 'I know. Positive audience approving a Third Amendment to development agreement by and among the city of Alameda Partners and Alta Vista owner governing the Del Monte Warehouse Project located at the northeast corner of the intersection of Sherman Street and Buena Vista Avenue to extend the completion date for the Common Extension improvements by one year and authorizing the'",
        "'speaker_0': 'city manager or designee to grant an additional one year extension without further action by the City Council Planning Board.'",
        "'speaker_1': 'And I think the city manager would like to recuse himself. Yes, yes.'",
        "'speaker_5': 'Yes, you're.'"
    ],
    "Final Passage of Ordinance Approving a Third Amendment to Development Agreement By and Among the City of Alameda, TL Partners I, LP, and Alta Buena Vista Owner, LLC Governing the Del Monte Warehouse Project Located at the Northeast Corner of the Intersection of Sherman Street and Buena Vista Avenue to Extend the Completion Deadline for the Clement Extension Improvements by One Year and Authorizing the City Manager, or Designee, to Grant an Additional One Year Extension without Further Action by the City Council or Planning Board. (Planning, Building and Transportation 481005)": [
        "'speaker_1': 'Correct. He lives near the property. Okay. So we will let you disappear. And Councilmember De said, do you want staff reported? You said.'",
        "'speaker_6': 'I voted no last time. So to be consistent.'",
        "'speaker_1': 'Okay, anybody else have anything they want to say? Did we do this council member only? Lots to tell you.'",
        "'speaker_0': 'We're bringing him back.'",
        "'speaker_1': 'Sorry about that. All is forgiven. Whatever it was, it's just as you guys are. Turn away when he drops off.'",
        "'speaker_0': 'Sorry about.'",
        "'speaker_4': 'That. Hi. I can still see you. I hear you. You just couldn't see me.'",
        "'speaker_1': 'I figured you just needed to take a bite of your dinner or something.'",
        "'speaker_4': 'Anyways, that earlier.'",
        "'speaker_1': 'You did that. Okay, so where we are is we're. I'm about to ask for a vote. A motion to approve final passage of this ordinance of five. That is in favor. Is that a motion vice mayor.'",
        "'speaker_5': 'Who moved.'",
        "'speaker_1': 'Move by the vice mayor may have the second seconded by Councilmember Odie may any further discussion then maybe a roll call vote please.'",
        "'speaker_0': 'And seven days to go. Next fight. Hi Odie.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Mela.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Mayor as the Ashcroft high that carries 4 to 1.'",
        "'speaker_1': 'All right. Thank you, Madam Court. So with that, we come to the close of the consent calendar and we move on to the regular agenda. And we should probably bring the city manager back for this. Yes.'",
        "'speaker_0': 'And we have the three members that we will also move in. This item is verbal status update by the Police Reform and Racial Equity Steering Committee and city staff. And we have three members Alamance, Cher, Cheryl Taylor and Jolene Wright, who will be coming in.'",
        "'speaker_1': 'Great. All right.'",
        "'speaker_5': 'And I can briefly introduce this if you would like, that.'",
        "'speaker_1': 'Would be great. So, Levitt, would you please do that?'"
    ],
    "Verbal Status Update by the Police Reform and Racial Equity Steering Committee and City Staff.  (City Manager)": [
        "'speaker_5': 'So our man, Jolene Rae and Sheryl Taylor are all are three of the four members of the steering committee. The fourth is Christine Chilcott. And she could not make it for this meeting, but they are going to be providing the city council just with an overview of what the process has been, what they're doing and what their'",
        "'speaker_5': 'plan for public involvement and public input into the recommendations are as we move into the new year of 2021. It's more of a verbal report. There was a question by a speaker, and so I'll just answer that right now about the public not having the recommendation from one of the subcommittees.'",
        "'speaker_5': 'The recommendations of the subcommittees did not go to the city council or the public at this point, based on timing and based on the Sunshine Ordinance. We did not get those recommendations until less than 12 days prior to the council meeting.'",
        "'speaker_5': 'And based on that, I've held those in order to not violate the Sunshine Ordinance. They can, after this meeting, either be distributed to the council. And then and then that will be a part of the public process. I'm going to leave that to the steering committee.'",
        "'speaker_5': 'Whether they want to do that or whether whether they want to wait until closer to the council meeting in the next year. But they can go into that. We can answer those questions. So just for clarity, you heard the council does not have those recommendations and nor does the public because of the Sunshine Ordinance.'",
        "'speaker_5': 'And based on that, those came forward to my office less than 12 days prior to this council meeting.'",
        "'speaker_1': 'All right. Thank you, Mr. Levitt. And I would also note that we have with this our interim police chief, Randy Finn. So welcome, Jason, and welcome to our steering committee members who I know have been hard at work well since the summer.'",
        "'speaker_1': 'Right. So we've got Ms.. Jolene, right. Cheryl Taylor, maybe camera shy or maybe getting here, whatever you like is fine. But we and we are very appreciative for your work and I am going to turn the floor over to you to proceed in any way you want to starting and just in mute yourselves.'",
        "'speaker_1': 'Are you able to mute?'",
        "'speaker_7': 'Yes. Can you hear me now?'",
        "'speaker_1': 'Yeah, that's perfect.'",
        "'speaker_7': 'Great. Hi. Hi. My name is Alfonso Mance, and I'd like to start by saying thank you to you, Ashcraft, and to the other members of the Council for allowing us this opportunity to speak to you and give you an update we've been working on.'",
        "'speaker_7': 'So together with Ms.. Taylor and Ms.. Right. We are three of the four members of the Police Reform and Racial Equity Steering Committee. In August of this year, the city approached us about organizing the effort to organize the community to make recommendations regarding reforms to policing in Alameda.'",
        "'speaker_7': 'And since then, we've been hard at work trying to determine the way to be most effective and make the best record recommendations. It's been an exciting process. We've put a lot of hours into it and we've learned quite a bit.'",
        "'speaker_7': 'And as city manager Levitt said, we have at this point made some preliminary or even preliminary recommendations. They are still a work in progress. And we're here tonight just to give you an update on where we are, tell you what our process is, and to answer any questions that you may have.'",
        "'speaker_7': 'The we've got about 50 members in the committees and they've been working incredibly hard. We've got some very talented folks. I think it's very important to note at the beginning that we are all residents of Alameda and we're all just civilians, so to speak, laypeople.'",
        "'speaker_7': 'We don't have any particular expertize in this area. So an important part of what we've been doing is educating ourselves and becoming familiar with policing in general, and specifically and most importantly, policing in Alameda and Chief Fin and other members of LAPD have been extremely helpful in giving us some insight into the way they do things.'",
        "'speaker_7': 'And of course, we've done other outside research as well. We've had speakers come and speak to us and educate us. You know, particularly and that has been also on a subcommittee of various subcommittees, have had different speakers come in, but people have been very hard at work and I want to thank them all for the work that'",
        "'speaker_7': 'they've done. So it's important to note, and this is probably really obvious by looking at us that. The four of us were members of the steering committee. Are people of color, specifically black folks. And that is something that when we look at this issue that we bring with us, and it's an important part of what colors our'",
        "'speaker_7': 'view of the of the situation. We are also residents of Alameda. We are devoted to the city of Alameda. And we want to see we appreciate the job that the police do. We want to see it be a situation where and what of the things we say in our mission statement is that we want it to be'",
        "'speaker_7': 'a place where everyone feels protected and everyone feels welcome. And that's something that. In the past, it historically has been missing from policing. So with regard to what we've been working on, I think we've got to the philosophy of the committee.'",
        "'speaker_7': 'We're committed to the idea of reforming aspects of the way in which policing is done in the city of Alameda. But we hope to do it in a collaborative way. We understand the policing is important to our community, and we respect the Army, the police department's commitment to the safety and security of our community.'",
        "'speaker_7': 'We do believe that the manner of policing can be improved. For the reasons I just stated, so that all people will feel safe, secure and respected. As I said, with a few exceptions, we're laypeople. So we are doing this because of our love of the community and work.'",
        "'speaker_7': 'And we're starting from scratch. What we have, what our knowledge is that of what it is like to live in Alameda. And what we're trying to do right now is add to our add to our knowledge what it means to police in Alameda and the needs of the community on.'",
        "'speaker_7': 'With regard to the subcommittees and how they were selected. The city approached us in August about forming the steering committee, and we put out a call for volunteers. We received about 250 responses, which was pretty overwhelming in the responses.'",
        "'speaker_7': 'A number of people included detailed background information. Some did not. We felt a sense of urgency as well as as the city did as well. And as a result of that, we use the information that we had to make a solid make to make our selections.'",
        "'speaker_7': 'We select about 50 folks, and that was based on the fact that we had formed or envisioned five different subcommittees, and we wanted to limit those subcommittees to about ten different people. I guess it's just reviewing best practices on.'",
        "'speaker_7': 'The common knowledge is that it's seven is sort of the ideal meeting size, you know, give or take a few people. So we figured with ten we would get the benefit of the diverse experiences of those people, the diverse knowledge of, but also keep it small enough to be workable.'",
        "'speaker_7': 'And so approximately right now we have approximately 8 to 10 people on each of the committees. We let everyone put down what their first, second and third choices were. And we were able to give most people their first choices, and some people were willing to.'",
        "'speaker_7': 'Since the process has begun, some people have shifted from one committee to the other because it turns out that their interests are more aligned with that other committee. The subcommittees meet at least weekly. We, most of us, have standing meetings, most of the subcommittees, and additionally, of course, we communicate as necessary between those formerly scheduled meetings to'",
        "'speaker_7': 'get the work done. The larger group, the group as a whole meets once or twice a month as needed. The Steering Committee. The four of us meet at least once a week. We often meet with the city manager as well as other members of the city staff.'",
        "'speaker_7': 'And on a few occasions we've met with the chairs of the subcommittees to make sure that we are you know, we're constantly recalibrating and refocusing as we learn more information and our priorities might shift and also based on input that we get as individuals from members of the community on.'",
        "'speaker_7': 'As we have said a couple of times, it's community run the chairs or people who are chosen from the city of Alameda. They were chosen by the subcommittees themselves. And so it is representative. As the City Council is no doubt aware and was referenced in a couple of the public comments.'",
        "'speaker_7': 'We recently completed three nights of informational meetings with the leadership of APD Chief Ben attended and Captains McMullen and Emmet, who attended all three of the meetings which comprised about 7 hours. All told, they answered dozens and dozens of questions and the meetings were very successful.'",
        "'speaker_7': 'The almost all of the committee members were able to attend all three of the meetings, and the meetings were also shown on YouTube and in each of them has received over a hundred views. And as I said before, while it did answer many of the questions that we had, it also highlighted the need for continued communication between'",
        "'speaker_7': 'the subcommittees and APD, and also just the value of smaller scale interactions in that large format. We were able to ask to ask questions and get answers, but it was sort of a one way communication rather than. A give and take, which I think would be very beneficial for the committees, committees, and also for the officers and'",
        "'speaker_7': 'for APD. An important aspect of the process is, of course, making sure that it's public. And as I said earlier, it is comprised completely of members of the community of Alameda, members who volunteered to be involved. And we felt that once we selected those members, it was critical that our initial meetings and discussions and the workshops that'",
        "'speaker_7': 'we did were a safe space for people to explore their own biases, privilege, experience and expectations of the process. You know, it can be very difficult to have real productive discussions on the issue of race and the issues involving race in a public forum.'",
        "'speaker_7': 'So what we wanted to you know, the committees, each of the committees, people to find their voice, you know, in the sort of a more private space so that the debate could be free and so that everyone was able to you know, obviously, I think we can all agree that diverse opinions engender the best result.'",
        "'speaker_7': 'And so this way we were able to be sure that everyone and we do have a number of people with differing opinions, was able to get their voice heard so that we come up with the best preliminary recommendations.'",
        "'speaker_7': 'Now, that being said, the process obviously cannot be successful without further public input and traditionally. That's one of the things that's done is sort of by a comment period. And sometimes what happens with that is that, you know, you have the folks who have the time and the wherewithal to.'",
        "'speaker_7': 'Come in and make those public comments. And that's often people who are people of means. And these are the folks, you know, who have the loudest voices. And these are the folks who end up benefiting from polices from from from policing.'",
        "'speaker_7': 'We're hoping that in. Opening this up to the public. We can hear the voices of those people who have traditionally been policed because those are the most important voices for us to hear when it comes to reforming police policing.'",
        "'speaker_7': 'I think the police are pretty effective. The Alameda police are very, very effective at. Performing the traditional roles of police, you know, of, you know, keeping crime down, responding quickly. And what we want to focus on more is, you know, those are obviously areas that the police are undeniable experts in.'",
        "'speaker_7': 'But we want to focus more on is the interaction with the communities. As I said earlier, in focusing on this process and in moving forward, we want to make this a collaborative process. And that means in this instance, making sure the police are able to listen and able to hear the voices of the police populations.'",
        "'speaker_7': 'So what does that mean that the public process needs to look like? Well, we will be submitting, obviously, our recommendations and our tentative recommendations, these draft recommendations to the public for evaluation. And it's our expectation, actually our hope that as a result of doing that, the opportunity for public comment will result in revisions and improvements.'",
        "'speaker_7': 'In addition to that, I think it's necessary in order to institute long lasting change and to improve policing in Alameda, that we create an environment in which the police are able to have a continuing conversation between the police and the public who are on the receiving end of that policing.'",
        "'speaker_7': 'One of the big topics that's come up repeatedly for us is the idea of procedural justice. There was there's a Yale Law School professor named Tom Tyler and who wrote a book Why People Obey the Law in 1990.'",
        "'speaker_7': 'And what he determined in his research was that people don't obey the law because they fear punishment. They obey the law because they believe that the authorities have the right to tell them what to do, because they believe it's legitimate.'",
        "'speaker_7': 'And when he further found them, what and what subsequent studies have found is that what gives the law legitimacy is how people are treated. This is a quote from him. What people actually pay attention to when assessing behavior of people in legal authority is not how good they are in reducing crime or whether they get a ticket'",
        "'speaker_7': '. What people care about is how they're treated and the particular ways in which they're treated. So I think in order for our process to be successful, we have to open up a discussion between the police and the public, particularly those populations that are traditionally policed and the police themselves.'",
        "'speaker_7': 'So that, you know, we all obviously necessarily work on stereotypes, we work on generalizations. Alameda is a relatively small city and it's a city in which, you know, the residents of the city are very involved. People in Alameda know each other.'",
        "'speaker_7': 'They know what's happening in the city. And so we have an opportunity to bring these groups together, to have these groups here, each other, to create different understandings and to increase that level of respect and to concentrate on that level of respect.'",
        "'speaker_7': 'So that way, procedural justice, actual justice in the procedure, in the way that the interaction occurs regardless of the outcome. Is something that's traditionally been a concept. We can make it a reality. We have the means to make it work and we have the desire to make it work.'",
        "'speaker_7': 'And I think that's very exciting thing. I'd like to say in closing, just thank you for allowing us to begin this process. Thank you very much for including us in this process. And thank you for giving us the opportunity this evening to let you know where we are.'",
        "'speaker_7': 'And I'll return the floor to the mayor and Jolene and Cheryl and I are happy to answer any questions that you might out.'",
        "'speaker_1': 'Thank you, Mr. Mats, for your comments. And I would also say to the three of you on the steering committee who are here and to Ms.. Christine Chilcott, who couldn't join us, thank you for saying yes when the city approached you and asked you to be the steering committee.'",
        "'speaker_1': 'I think it was a huge labor of love and devotion to your community at a very, very fraught time that is still all around. Is that it? Just I am grateful, just hearing your description of what has gone on, some of your ideas for purchasing your report.'",
        "'speaker_1': 'Ms.. Right. Ms. Taylor anything you'd like to add?'",
        "'speaker_2': 'Oh, I mean, it's just been such a joy.'",
        "'speaker_5': 'Working with this group.'",
        "'speaker_6': 'I've just been super thankful.'",
        "'speaker_2': 'So I have to shout out to the steering committee and all of our subcommittees. We see you and we appreciate you. Yeah. And just to echo that, I'd also like to extend appreciation to the staff. I think there was a tremendous amount of work that they did in support of this effort that is continuing.'",
        "'speaker_2': 'It is ongoing. I think, as Al Mance mentioned, that there are a lot of questions that came up in all of the the during the Speaker series, which was very informative, very enlightening, but just a huge shout out to the staff.'",
        "'speaker_1': 'Thank you for recognizing the staff. Ms.. Taylor and I watched all three of them police those sessions in, and it was intense. And I, I commend Chief Dan and the captains who were involved in all of you for the good work and the questions that were submitted and the answers.'",
        "'speaker_1': 'And and for anyone who has had a chance to watch them look them up on YouTube, actually, you can get to them from the city's website. So with that and chief fan, is there anything you might like to say?'",
        "'speaker_1': 'Well, we've we've got you here. Here he is.'",
        "'speaker_4': 'By.'",
        "'speaker_1': 'The evening.'",
        "'speaker_4': 'Good evening. Thank you, Mayor and council and for committee members. Thank you for working.'",
        "'speaker_3': 'With us and for a process that I think has been informative for us as well. And. I personally appreciate that. It's been a very thoughtful process that we're we're doing a lot of hard work here. You're doing a lot of hard work because I think that's what's that's what's important.'",
        "'speaker_3': 'And this is a big topic, not just locally, but nationally. And that's something that we want to wade into without a lot of this type of work. So thank you.'",
        "'speaker_1': 'Thank you to your fan councilmembers. Comments. Questions of many of our guests. One sister. Oh, they're usually such a shy and retiring group. Really.'",
        "'speaker_4': 'Councilmember Odie I don't have much to add because I thought that was a very thorough update and I appreciate all of the hard work that all of our members of the community are putting in, and especially you three, for preparing for this presentation.'",
        "'speaker_4': 'You all get a chance to see what it's like to make policy. And, you know, maybe one day I'll switch places with one of you and you'll be on the dais. And, you know, I can I can be on a community committee that you guys formed.'",
        "'speaker_4': 'So I appreciate. Appreciate the update. And I'm glad to hear that that we're moving forward in a positive direction. Thank you.'",
        "'speaker_1': 'Thanks, Councilmember Odie. Did I see your hands go up and count them? Because would you like to head the council this year? Leavitt. City Manager. Mr. LEAVITT.'",
        "'speaker_5': 'Yes. And I meant to say this at the beginning, but I definitely want to say that I do appreciate everything that the steering committee has done, as well as all the committee members, all 50 plus committee members. I think they've put a lot of time, a lot of work in thus far.'",
        "'speaker_5': 'And I also appreciate what the police staff has done as far as getting information as much as we can to the committee. So I think it's been a very cooperative environment. Not everyone always agrees, like they have said on everything, but I think people have been very respectful of each other and of each other's opinions.'",
        "'speaker_5': 'And I think that that is going to take this process a long way and you will see a lot of hopefully positive results from it.'",
        "'speaker_1': 'Thank you, Mr. then Councilmember Geller.'",
        "'speaker_2': 'I just want to thank everyone for all the time that they're putting into this. And I was one of the. The views on the YouTube videos for for each of the sessions. And I learned a lot as a council member.'",
        "'speaker_2': 'And I think a lot of the questions were really, you know, it's easy to ask a lot of questions. It's hard to really kind of steer things in a direction of getting information that's going to actually be illuminating to the process.'",
        "'speaker_2': 'And so just I know it was it seemed like it was a very intense and somewhat sometimes awkward format. But I think that there was a lot of information that came through, and it was very clear just from the questions that were being asked, that there was preliminary work that had been been done to really kind of'",
        "'speaker_2': 'develop themes in terms of where it looks like each of the committees are going and what you're focusing on. And I just also want to recognize that this is such there are so many different elements of what you could be looking at.'",
        "'speaker_2': 'But it seems even though there's differing opinions, it seems like there's a commitment to really focus on a few elements. And so it's interesting to watch this process as it moves forward. And I look forward to the recommendations that you'll be making to us.'",
        "'speaker_2': 'And I feel, you know, I'm happy that we're finally going through this exercise as a community and that it is being community led. And so I just want to thank you all for it to be community led. We have to have volunteers like yourselves to put in the time.'",
        "'speaker_2': 'So thank you so much for for doing this for everybody here in Alameda.'",
        "'speaker_1': 'And I'll just echo it. My colleague said that I'm always so inspired when I start meeting and interacting with members of the community because we have so many smart, talented people and you're all extremely busy and I know you're working from home while your kids are in the next room, or maybe just down at the other end'",
        "'speaker_1': 'of the dining room table. I don't know how you all do it, but you managed to squeeze in community service on top of all that. I'm really grateful and I want to hear any other accounts of comments. And then I'm also going to ask city manager Eric Levitt and I know Assistant City Manager Jerry Bowden had a'",
        "'speaker_1': 'big part in this, too. Just tell us about next steps, what they will look like, that public process, how will how will that take shape? And then real quickly, on the police, the sessions with the police, yes. Really thoughtful, tough, hard driving questions were asked and the police answered them.'",
        "'speaker_1': 'And I don't think they had the questions ahead of time or anything. It was it just in in real time. And I think I'm pretty impressed. I'm not sure that every department would have would have done that and then that, as candidly as we all did on both sides of the equation.'",
        "'speaker_1': 'So thank you for that. Mr. LEVIN. Mr.. You want to tell us about maybe dates that you have in mind moving forward? And then I know a couple council members haven't been heard from yet.'",
        "'speaker_5': 'So I'll start and then Jerry can add he may have more detail than than I have. We are tentatively planning on having the reports back to the council, the first meeting in February timing wise, and that you could be giving direction as far as how you want to move forward on the the recommendations.'",
        "'speaker_5': 'I think we're going to be there, the the anticipation and we're actually having a meeting later this week with the steering committee as far as public input process and engagement. And so we're trying to start that off before it comes to you in February, but probably have some continuation after the February meeting.'",
        "'speaker_5': 'I don't we haven't had all the specifics yet because that meeting is actually scheduled for later this week to discuss the details. But I don't know if Jerry might be able to add anything or if Joline, Alfonzo or Cheryl have anything to add to that.'",
        "'speaker_2': 'I mean, I could certainly just talk there's some talking points of things that we've discussed as options that would be helpful. I'm just going to go down our list here. You know, we were certainly thinking about conducting more proactive public engagements, which could include, you know, surveys getting the word out through community based organizations, social service providers'",
        "'speaker_2': ', churches presenting to other relevant commissions and hosting more virtual community forums just to get some more organic, you know, feedback. I think one of the biggest things that we are really bumping up.'",
        "'speaker_4': 'Against in this is that that the communities that are most affected and that are most.'",
        "'speaker_2': 'Policed are sometimes the communities that have the least access to technology, to being able to to be on these zooms. So just really kind of thinking of how.'",
        "'speaker_4': 'We can reach people where.'",
        "'speaker_2': 'They are. I think that's something we really want to focus on.'",
        "'speaker_1': 'Thank you. Thank you for this observation. Anybody else? Steering committee, Jerry Boden and then Vice Spirit. That's what it is next.'",
        "'speaker_4': 'The only thing I would add is that we want to be cognizant and conscious of the holidays. So we're really trying to. We want that public engagement in that public input with the process. But we also wanted to make sure that we didn't drop it on folks for just a limited amount of time through the holidays.'",
        "'speaker_4': 'So you can expect that the more robust public engagement to happen in January and possibly even into February, but starting in January, that's when we'd like to to make that that stronger push. But we want the recommendations to be out in December so that folks can digest them in between in between different festivities and then and then'",
        "'speaker_4': 'engage in January. So more to come on that as city manager Leavitt said, we're meeting later this week. And so I just wanted to put that out there and let the community know that they'll be there will be opportunity, even though the recommendations are out.'",
        "'speaker_1': 'Great. Thank you for that, Mr. Burton. Bass player. Not quite.'",
        "'speaker_5': 'Great. I want to express my great thanks to Mr. Mance and Mr. Taylor and in absentia Mr. Lockhart as well for your service. I think the work that's being done in the forums that have been held have been really, really great.'",
        "'speaker_5': 'So thank you for that. I have a couple of just kind of process questions that I thought were best asked of the steering committee because, you know, I was a big supporter of the idea of this being community led.'",
        "'speaker_5': 'And I think over the last few months there have been questions that as a council member I've received about why aren't you? Why aren't you me, the council doing X or Y? And the answer is being, well, we're kind of waiting to hear from the committees and tying off of Councilmember Vella's appreciation, which, you know, of, of'",
        "'speaker_5': 'trying to really focus in on some very important key issues and dove deep on those. I'm wondering if has the steering committee considered kind of scope and time like how long you think you see this process going for you?'",
        "'speaker_5': 'Is it a is it an infinite thing that we'll address everything or more so? And I know you didn't sign up for that, but. Or is it more of a you know, hopefully in the next six months, we will come out with, you know, 15 recommendations.'",
        "'speaker_5': 'And then anything else is things other people get to work with. I'm curious if you've kind of thought about that and given any thought to, are there issues that might not focus into the the mission that the steering committee has put together that might be good for at least putting out a list for the future for or'",
        "'speaker_5': 'for another group or for the council to address more independently or anything like that. I don't know if that question answers. Hey, that was a very lie. Was written as one sentence on my computer.'",
        "'speaker_1': 'Okay. We're sorry. And Mr. Manson unmuted himself. So we're going to drop that right in your your lap.'",
        "'speaker_7': 'So, you know, it's it's in terms of the timeline, we've been, you know, one of the things we've been short on, one of the reasons we've been trying to move quickly is because we're trying to sort of tie things into when budget discussions occur because, you know, it seems like some of these things are going to definitely'",
        "'speaker_7': 'take some money. You know, we're doing it a little bit differently than some other areas because it is community led. So the education process has taken a little while for us to get up to speed and we're still never going to be subject matter experts.'",
        "'speaker_7': 'But we are thinking this is something that will. The the the. The assignment that was given will be completed in the first half of 2021. We're hoping to make recommendations to you sometime in March or April that can hopefully be addressed and implemented sooner rather than later.'",
        "'speaker_7': 'From what we've seen so far, it does seem as though this is what it would be beneficial. This is an ongoing project, not necessarily in the form of the 50 person committee, but it seems as though there should be a smaller sort of subcommittee that or commission that continues continues on because we're going to just making recommendations'",
        "'speaker_7': '. But in order to ensure that those recommendations are implemented or to encourage the council to implement those recommendations, it would be it seems to make sense to have some continuity. So I think that's I believe I'm asking the questions.'",
        "'speaker_7': 'If there are any other parts. Vice Chair please let me know.'",
        "'speaker_5': 'No, I think that's great. So it's I think yeah. What I hear you saying is your, you're, you're, you're on a kind of time limited subject, limited to try to get some things in for the budget. But there's probably also a need for retooling some form of what's happening to ensure that there's some consistency and some ongoing'",
        "'speaker_5': '. The knowledge doesn't get lost. We just start a whole new group of people in June of next year or something like that, and that's the kind of that will be a next step after those recommendations.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_4': 'That sounds fair.'",
        "'speaker_5': 'Okay. So I think the one question I'm a little curious about, just as we head towards the June meeting, is whether or not the steering committee or any of the subcommittees have looked into identifying kind of a policy document or a policy statement that really defines you have a great mission statement.'",
        "'speaker_5': 'I'm wondering if we've looked at do we have a policy statement that actually defines what the role of policing in law enforcement in Alameda is? One of the things that in some of my study that I've been I've come across is this kind of awareness that actually a lot of police departments across the country aren't actually grounded'",
        "'speaker_5': 'in any sort of real policy statement. It comes more from just a historical they do law enforcement and public safety. But what how that is defined and I'm wondering if that's a part of the work that you're doing in terms of coming forward, as is looking at that larger, you know, how what is the work that's being'",
        "'speaker_5': 'done? Where where is that getting placed in in how do you how do you take your mission statement of safety for all and turn that into kind of an actionable policy that that is adopted by the city? I'm curious, is there a place that that's happening or do you see that as something that once the recommendations come'",
        "'speaker_5': 'forward, might be a next step for a council on a policy body?'",
        "'speaker_7': 'We haven't come up with a specific policy statement for regard to that. That is an interesting idea. We our recommendations, you know, we've got the five subcommittees. One of them is unbundling, which makes some recommendations with regard to, you know, sort of addresses the issue of these are the areas we want police to concentrate on.'",
        "'speaker_7': 'These are areas that we believe can be handled by different agencies. So that. Sort of, you know, sets up a loose definition. And I think a lot of the recommendations will sort of make that clear. It might be useful for us to come up with the policy statement.'",
        "'speaker_7': 'I'm not sure we saw that as our role just because, you know, we we are not the police, but. But I think that it's something that we should look into and we'll have discussions about that because I.'",
        "'speaker_2': 'Think it's something we could center in some.'",
        "'speaker_5': 'Of these public.'",
        "'speaker_2': 'Discussions, you.'",
        "'speaker_5': 'Know, as we're meeting with the.'",
        "'speaker_4': 'Community to kind of develop what that is. Mm hmm.'",
        "'speaker_7': 'Yeah, I think that's true. I think it's part of our mission statement in terms of what's going to make people feel as though, you know, welcome and safe and protected, you know, a definition of what policing is. Goes to that end.'",
        "'speaker_1': 'As a council member, I think I would welcome whatever input the steering committee, the subcommittees bring to us. And I think probably at the end of the day, council will make that final decision. But to the extent that you all are able to work with the police, I think that that would be you could probably make a'",
        "'speaker_1': 'lot of a lot of progress towards bringing us that recommendation. I think that's a good idea. Vice Mayor. Anyway, thank.'",
        "'speaker_5': 'You. And obviously, as a non Bronek thing, I will I will let them decide how they're going to how they're going to work this together. Again, I'll just add that that was my last big question. I'm interested to hear if we have any public comment.'",
        "'speaker_5': 'But again, I just I appreciate I appreciate this much in this conversation. I know we're I knew we were in good hands before I saw it. And seeing this conversation confirms all that belief and I will just echo my colleagues.'",
        "'speaker_5': 'Great. Thanks for all the time. I know that you've put in a lot of time on this and it's probably bigger than you ever thought. And it's I mean, yeah, herculean really is not is not the wrong word for what you've been asked to do.'",
        "'speaker_5': 'And I appreciate that you have continued this long.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'She said. I don't know. I keep thinking I'm seeing your hand go up out of the corner of my eye. Did I see your hand go up?'",
        "'speaker_3': 'No. Probably cause I'm taking notes here.'",
        "'speaker_1': 'Okay. Okay. I'm a note taker with you. All right. That's good. I am. It's not easy conducting a meeting from a screen. Sometimes I get the names of my own council colleagues wrong if they're in front of me.'",
        "'speaker_1': 'But. Okay, um, Councilmember Desai, I don't think we've heard from you. Great man.'",
        "'speaker_6': 'Yes, for sure. Well, first of all, thank you very much to each and every one of you, as well as all the different individuals who are participating on the subcommittees. I know that is taking up a lot of your time, and I'm quite sure that you're having to deal with a lot of perspectives.'",
        "'speaker_6': 'So I appreciate the work that you're doing on behalf of the city of Alameda in improving our police force. I appreciate that deeply. The thing that I look forward to certainly is your findings. What are what is it that your findings and also your recommendations and to see how the two are related?'",
        "'speaker_6': 'You know, I think there's a lot of things that we can do to improve our police force. Alameda for the most part, as a as a safe city. But but, you know, we shouldn't sit on the laurels. I think this is clearly not just a national issue, but it's also a local issue in terms of improving our'",
        "'speaker_6': 'police force. And and we can certainly do our our play our role in doing that. So we appreciate you helping us in that regard, each one of each and one of you. So I look forward to, you know, your findings and your recommendations.'",
        "'speaker_6': 'I think if I have one suggestion, it would be in terms of framing your findings and recommendations, it would be helpful to for me if I could understand what are the low hanging fruit issues and items, whereas a medium hanging fruit issues and items and what are the high hanging fruit issues and items?'",
        "'speaker_6': 'So that would be kind of helpful if we understand how you believe the community would like to frame some of the findings and recommendations. So thank you very much. Appreciate that.'",
        "'speaker_1': 'Councilmember Day So anything else from anybody at City Attorney San? Did you want to chime in with anything now? Members of the steering committee. City staff. Okay. Well, I and I should ask the city clerk, do we have any public speakers on this item?'",
        "'speaker_0': 'We we still do not have anyone that has raised their hand. Oh, we have one person that just raised their hand. Jane Garfinkel.'",
        "'speaker_1': 'Okay. Good evening, Mr. Garfinkel.'",
        "'speaker_4': 'All right. Several references were made to public participation and YouTube. And it's not clear to me how we see these YouTube meetings. It isn't clear how the public is participating. I understand that there are members of the public on the committees, but it's not clear to me if the larger public is participating in this process or how'",
        "'speaker_4': 'we might go about participating in having some input before a final report is submitted to the Council, which will then have a two week public presence, after which the council will vote yay or nay or maybe or whatever.'",
        "'speaker_4': 'So I'd like a little more information on these issues. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Garfinkle. Do we have any further public comment on this item?'",
        "'speaker_0': 'We do. One more. Treasurer Spencer.'",
        "'speaker_1': 'Good evening, Spencer.'",
        "'speaker_2': 'Evening. I would also be interested in knowing where the agendas are so that we can follow along during the Zoom meetings. If there are Zoom meetings, I don't recall seeing agendas for these meetings or if in fact it's something that is just tape recorded and then we can watch it after it occurs.'",
        "'speaker_2': 'You know, all of our other subcommittees I'm sorry, committees and commissions are publicly noticed for public participation. Thank you.'",
        "'speaker_1': 'Thank you. Spencer. Any further speakers? Spencer.'",
        "'speaker_0': 'Aaron Fraser.'",
        "'speaker_1': 'Good evening, Mr. Fraser.'",
        "'speaker_3': 'Good evening. I just wanted to take slight umbrage with one thing that the steering committee said. In particular, Mr. Mance, I am very, very grateful and very, very fortunate to work with the steering committee and they are all great.'",
        "'speaker_3': 'And I am so, so thankful to be working with them and with my other committee members. The one slight disagreement I would make with what he said was that we are starting from scratch and there are no experts on this committee.'",
        "'speaker_3': 'He is underselling himself, is underselling so many of our community members. And he's wrong. You know, there are many experts on this committee, including a person who spent, I believe, her entire career at APD. So and public defenders, former prosecutors, former probation agents, people who work with community service organizations.'",
        "'speaker_3': 'We have the steering committee assembled, a group of people from this community that demonstrates the depth and expertize that make Alameda a great place to live. And so, with all due respect to Mr. Mance, I disagree with that statement, but otherwise.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'There is smart, talented in there, also humble. Anyway, further public speakers, Madam Clerk.'",
        "'speaker_0': 'Yes. They just put their hand down, so.'",
        "'speaker_2': 'No, no.'",
        "'speaker_1': 'Okay. Going once. Going twice. Okay. Well, huge. Thank you to all of you. And yes, they they are. I hope they convey that these are incredibly talented people, as are the members of the the steering committee is very lucky to have you all volunteering your time and your talent in the service of your community.'",
        "'speaker_1': 'Thank you. Yes. What?'",
        "'speaker_2': 'Yeah. I just wanted to make sure, because there was so much work that went into all of the questions. The YouTube is posted, I believe. And so if we could perhaps put have our staff put the link in the chat and get the information out there.'",
        "'speaker_2': 'There has been noticing of when the meetings were going to be posted. We posted it on our social media. We posted it in a few different places. You could watch the YouTube. Basically, the YouTube was allowing you to watch the meeting even live.'",
        "'speaker_2': 'It was there was a slight delay, I think. And so so there's different ways to watch these meetings and not all of them are. Our agenda is necessarily as we do for Brannock meetings because of the type of committee it is.'",
        "'speaker_2': 'But there have been a number of publicly noticed meetings, so I just want to make sure that that's noted.'",
        "'speaker_1': 'And there will be going forward. And I encourage all of you who haven't had a chance to view the YouTube video, go to the city's website, Alameda, S.A., type it in the the search box police YouTube videos or APD, and you will find them.'",
        "'speaker_1': 'There's three of them. And then settle into a comfortable chair because they are at least an hour. And I think the first one might have gone almost you to Mr. Barnes. Go ahead and mute yourself.'",
        "'speaker_7': 'I was just saying, I think that the first meeting is 3 hours and the other the second and third are 2 hours.'",
        "'speaker_1': 'Yeah. Yeah. A lot of time was put into it, so. All right. Well, with that, we're going to thank all of you will look forward to, you know, from here on out, we'll be hearing more about the public participation in different ways.'",
        "'speaker_1': 'And so we'll look forward to hearing more from you. But again, thank you so much to all of you. Take care. Stay safe. Bye bye, Chief. Thank you to you and your department. Okay, great. Everybody, we are okay.'",
        "'speaker_1': 'So we could call a quick break before we go to item six. Um, b b.'",
        "'speaker_4': 'Um.'",
        "'speaker_1': 'You know, let's, let's do that actually. We're going to come back at 905. Everybody quick break and we'll be back at 905. Probably want to mute while you're on. Hello, everybody. I a variety. I see. And you, Thomas?'",
        "'speaker_1': 'I feel like there is Randy Range there. Hey. Hey.'",
        "'speaker_4': 'My pleasure. Thank you.'",
        "'speaker_1': 'Thank you so much for being here.'",
        "'speaker_0': 'Would you like me to read the title? Mayor of the City?'",
        "'speaker_1': 'Yeah, that would be great. Let's just make sure. Is Councilmember Thelma. And she is. She's there. She just read it.'",
        "'speaker_0': 'Yeah, I think we got it.'",
        "'speaker_1': 'We should probably vote. Yes. Yes. Okay, so let's. Let's resume the meeting then. It is a little after break. So we at six be.'",
        "'speaker_0': 'Recommendation to review and comment on association of Bay Area Governments bags Housing Methodology Committee's proposed methodology for distributing the regional housing needs allocation RENA among Bay Area cities and counties and proposed process meeting scheduled to update the city's general plan housing element for 2023 to 2031.'",
        "'speaker_1': 'Good evening and I want to welcome our planning building and transportation director Andrew Thomas this with us and also we are very honored to have with us from the Metropolitan Transportation Commission, Mr. Randy Rentschler, who is the Director of Legislative Affairs and communications for the Metropolitan Transportation Commission, the Bay Area Toll Authority and the Bay Area Association'"
    ],
    "Recommendation to Review and Comment on Association of Bay Area Governments (ABAG) Housing Methodology Committees Proposed Methodology for Distributing the Regional Housing Needs Allocation (RHNA) among Bay Area Cities and Counties, and Staffs Proposed Process/Meeting Schedule to Update the Citys General Plan Housing Element for 2023 to 2031. (Planning, Building and Transportation 481005)": [
        "'speaker_1': 'of Governments. He is also an Alameda resident. And so I just briefly I represent our city on the Association of Bay Area Governments, also known as a big which is the Nine Bay Area counties, which comprise, Randi, 110 cities, hundred and 901, 79 counties.'",
        "'speaker_4': 'So 100 and total. You had a district, 110 entities.'",
        "'speaker_1': '101 cities. Yes. And the nine counties and I also sit on the a big regional planning committee. I represent the Alameda County Mayor Mayor's conference on the PC. And so we are here to talk about a very timely topic, housing and and more.'",
        "'speaker_1': 'And so I want to turn the item over to Andrew Thomas and you can take it from there. Thanks so much, Mr. Thomas.'",
        "'speaker_4': 'Thank you. Mary Ashcroft, members of the council, Mr. Ensler and I are going to tag team this presentation, so I'm going to get it started off and then I'm going to hand it off to Randy and then I'll wrap it up at the end.'",
        "'speaker_4': 'So we're pleased to be here. We are at the beginning of a really an 18 month process. Are you seeing multiple screens on your.'",
        "'speaker_1': 'I'm seeing.'",
        "'speaker_4': 'Several.'",
        "'speaker_1': 'Two screens.'",
        "'speaker_4': 'Maybe we could change. Laura, can we just get this single slide up? Well while Laura is trying to help us out there. So we're at the beginning of the housing element update process. This is required by state law.'",
        "'speaker_4': 'We're right at the very beginning. So we here in the city of Alameda, with the help and guidance of the city council and a lot of hard work by the planning board and staff over the next 18 months will be working on updating the city's housing element.'",
        "'speaker_4': 'So tonight, what we are hoping to do for tonight is start this conversation with the city council. We're going to make a suggestion that this not be the first and only workshop with the council, that this be the first of several over the next six months.'",
        "'speaker_4': 'And then, of course, the entire process ends with the city council in 2022 when we come to you with a final recommended general plan. So tonight, what we'd like to do is give you a little bit of an overview of the process.'",
        "'speaker_4': 'And Randy is going to help me explain to you one of the key elements of this process, which is called the RENA or the Regional Housing Needs Allocation. So next slide, please, Laura. Please. There we go. Thank you.'",
        "'speaker_4': 'So for the benefit of anybody who might be watching on the first question, might be, well, what is a housing element? Housing element is required by state law. And this is a law that goes back many years. Since 1969, state law requires that all jurisdictions like Alameda must.'",
        "'speaker_4': 'We must plan to meet the housing needs of everyone in our community. And these laws are in the government code 60 5000266499 if anybody wants to look them up. But the key, what you'll find if you do is that what these laws say is an Alameda has a responsibility to make adequate provision for housing needs for all'",
        "'speaker_4': 'segments of the community that we must adopt and implement a general plan for the for the community. And it must include a mandatory housing element and that that.'",
        "'speaker_2': 'Element.'",
        "'speaker_4': 'Must identify and make sites within our community available during the housing element planning period, which is typically eight years. And when we say available, what that means is that appropriate zoning and development standards and with the services and facilities to accommodate that portion of the city's share of the regional housing need, which Randy will explain in a'",
        "'speaker_4': 'little more detail, and that we have to do it for every income level that could not be that cannot be accommodated on our on sites that we already have identified. And if we don't have enough sites, then we must identify sites as needed to facilitate and encourage the development of a variety of housing types for all income'",
        "'speaker_4': 'levels, including multi-family rental housing. Our next slide, please. So the first step, of course, in the eight year process is to. Is to find out what our regional housing need is for the next eight years. And the eight year cycle that we're talking about is the period 2023 through 2030, so or 2031.'",
        "'speaker_4': 'So the and the process has already started at the regional level, determining the regional allocation at the state level and regional level, determining what the region's allocation and then Alamitos share of that. And with that, I'm going to turn it over to Randy to talk a little bit about how that allocation process works.'",
        "'speaker_4': 'Laura, can you take us to the next slide? Thank you, Andrew. Thank you very much. And members of city council. It's my pleasure to be here. You know, I wanted this first slide to be up here, not just for yourself, but for the public.'",
        "'speaker_4': 'This is the front cover of a document, a 100 page plus document that can be found at a bank's website that discusses all the details of the arena process. And as Andrew mentioned, any law that was signed by then Governor Reagan and has been changed and strengthened over 60 years is going to be incredibly complex and it's'",
        "'speaker_4': 'going to be process heavy. And we're going to touch on just a little bit of that process this evening. Next slide, please. So this gives you a sense of of the different steps that the Reno process goes through.'",
        "'speaker_4': 'There's public comment, and that also means city comment as well as long as as well as the general public throughout that entire process. Next slide, please. This is another look at that process. You can see it began in 2019 and it's going to end in 2023.'",
        "'speaker_4': 'So it does take a long time. There's plenty of opportunities for cities to have their voices heard, for the community to have their voices heard. Again, the law is very complex. You can see some of the major milestones on a graph to the right and written out on the left.'",
        "'speaker_4': 'And you can see that there is also plenty of time for appeals and all sorts of activities for cities and the public to be engaged in, in this very important process that, you know, there are few things more difficult than the meeting of state and local control on the subject of housing.'",
        "'speaker_4': 'Maybe water in the state of California is tougher. But this one this one is notoriously tough. Next. So there are dozens of requirements that agencies like IBAC have to take into account as they do this process. And IBAC takes this process very seriously.'",
        "'speaker_4': 'There is a large number of professionals who are seeking to meet the requirements of state law. The needs of cities throughout the Bay Area. The demands of the state, which is this is a fundamentally it is a state law requirement on local government and a bag is local governments representative in this process with the state.'",
        "'speaker_4': 'When you boil down that many dozens of requirements, they really get to really five general categories. I'm just going to read them because I think they're important enough to take a moment on is to increase the housing supply and the mix of housing types and affordability in all places in an equitable manner to promote infill development and'",
        "'speaker_4': 'socio economic equity, to promote improved jobs, housing balance. And of course, the Bay Area has been a jobs machine for the past ten years, producing jobs at a rate of seven times what we're producing housing to balanced household income distributions, meaning housing and income throughout the Bay Area and to affirmatively further fair housing for the entire community'",
        "'speaker_4': '. Next slide, please. This is just a little taste of of the process. So AIBA creates a housing methodology committee. The word methodology might be a long one, but just think of it as a formula. We're going to take a peek at it here in a little bit.'",
        "'speaker_4': 'This whole housing methodology committee has met since September of excuse me, October of 2019. It's met 12 times all in public session. Widely attended public comment throughout in publicly noticed meetings held throughout the Bay Area. Next. This is the little kind of a peek behind the curtain here of the kind of details that the Housing Methodology Committee'",
        "'speaker_4': 'has to deal with. So I'm going to cover some of these things, but not all of them in that very long report that is available on airbags website is there for people who really want to get into the details.'",
        "'speaker_4': 'But I do want to draw your attention to the number on the very top 141,176 units was given by the state to the Bay Area in order to allocate those. The state, however, details those number out and you can see in the yellow looking on the left hand part of your screen, very low, then to the right'",
        "'speaker_4': 'in green, low wound to the right moderate and moving to the right in orange above moderate. They break out these elements that have to be planned for and determined for each individual city. What the Housing Methodology Committee does, and this is the formula part is the next slide down.'",
        "'speaker_4': 'And what they seek to do is to break out these housing elements in a way across all the city jurisdictions and unincorporated areas of counties in a form that is considered equitable. And that's that is what is the discussion.'",
        "'speaker_4': 'And that discussion can be, as you can imagine, very detailed. So in the case of the very low and low portion of the housing, you can see that those formulas are going to be a little different than the formulas on the moderate and the above moderate income.'",
        "'speaker_4': 'And I'll just point one obvious one to you on the hard right, 60% of the allocation of above moderate housing was job proximity and automobile proximity. And the idea is that well-to-do people are likely to be able to afford a car, but we still want housing next to job proximity, and we're going to touch on that a'",
        "'speaker_4': 'little bit later. So the point of the slide isn't for you to all become expert in this formula, but to get a sense of the kind of detailed work that goes on behind the curtain in order to come up with a number.'",
        "'speaker_4': 'Total jurisdiction allocation, the little target on the lower right hand side of that slide. And of course, we can go back and answer any questions that any of you may have later. Next slide, please. This gives you a sense of what the Bay Area looks like if it was in the form of a honeycomb.'",
        "'speaker_4': 'So hopefully you can pick out the counties here and hopefully you can pick out the city of Alameda that has a 16%, if you can read that. Interestingly enough, the number of households growth in the Bay Area as a result of this Rena process is expected to be 16%.'",
        "'speaker_4': 'So Alameda kind of hit the number right in the middle. It just happened by happenstance. I want to be I want to be clear about that. The methodology creates a formula. That formula gives us an outcome, and then that outcome is here before you.'",
        "'speaker_4': 'What you can see, however, and this is the benefit of a regional allocation process, you can see that the county of Santa Clara with the darker numbers, as you know, the Bay Area has been a jobs machine. That jobs machine has been centered in a handful of places, one of which is San Francisco, one of which is'",
        "'speaker_4': 'Santa Clara County. And you can see that county, which represents approximately about 25% of the Bay Area's population, is taking about a third of the Bay Area's housing allocation in this particular draft of the numbers. And let's be clear, the numbers are going to change.'",
        "'speaker_4': 'There's a draft out there. There's a series of actions that a back in the Metropolitan Transportation Commission still need to take. But you can get a sense of the layout of the numbers. I will have you notice all the areas that are lighter or more basically white in color.'",
        "'speaker_4': 'You can see the scale in the middle of the slide and you can see the different colors. What you can see is. The renal process has to be consistent with the regional transportation plan. And what we're seeking to do is to put the housing where the jobs are and put the housing in the jobs where the public'",
        "'speaker_4': 'transit is and where the highway system is. So one of the objectives here of the whole planning process is to save our open space, to save our farmland, to try to put the brakes on sprawl to the best that we can within the law.'",
        "'speaker_4': 'And you can see it here in this graph about how things are working themselves out with respect to the total allocation in this particular cycle. Next slide, please. So this is where I handed back off to Andrew Thomas.'",
        "'speaker_4': 'Thank you, Randy. So once we get our arena allocation and as Randy said, it's a draft. At this point, there's still a lengthy process that will play out over the next 9 to 12 months at the regional level to finalize that number or that that methodology.'",
        "'speaker_4': 'And then hopefully by next by summer, next summer, 2021, we will know we'll get our final draft number. But the current number, as Randy said, is represents a about, you know, would result in about 16% growth for Alameda in terms of rough numbers, it's about 4900 units to be over an eight year period.'",
        "'speaker_4': 'That's a that's close to just about 1% of the total regional housing need. Alameda looks like it will be allocated about 1% of that total. Now, as Randy said, it may change. So we already as a city need to start thinking about how we're going to accommodate our new housing, where we're going to accommodate it and how'",
        "'speaker_4': 'we're going to accommodate it. And so that it's time to start thinking about that and talking about it. And we we believe we can do it. We've done it the last two cycles, and we believe we can do it again.'",
        "'speaker_4': 'But it will it will require that we get creative and we're going to, as we did in the last two cycles, we are we believe at the staff level that we're going to need to adopt general planning and zoning amendments that are in direct conflict with City Charter Article 26.'",
        "'speaker_4': 'For anybody who's watching, who's not sure what that is, that is a section of this Alameda City charter that prohibits multi-family housing in Alameda and it prohibits residential densities in Alameda, over 21 units per acre. It's the state, the Housing and Development Department for the State of California wrote us a letter in 2009 and I'll just quickly'",
        "'speaker_4': 'read this to you, was they're pretty clear about it. They said in addressing Alameda, prohibiting multifamily or limiting density is a fundamental constraint with significant impacts on the cost and supply of housing and particularly a variety of housing types.'",
        "'speaker_4': 'In addition, Measure A, which is the common name for Article 26, severely restricts promoting higher density housing and mixed use development near jobs and transit to maximize land resources and address climate change. Pursuant to government code, the city is required to make zoning available to encourage and facilitate multifamily development and address and remove constraints.'",
        "'speaker_4': 'As a result, the element must include programs to address and remove or modify this constraint, including making zoning available to allow multifamily housing. Next slide, please. So over the course of the next 18 months, the the job that we will have to accomplish is to figure out where we can put housing.'",
        "'speaker_4': 'The first step in that process will be to identify, well, what sites do we already have zoned for housing that will be available to to build housing over the next for the for the period 2023 to 2030. This is all very preliminary.'",
        "'speaker_4': 'Still, we don't know our final arena number and where we will obviously spend the next 18 months working through these numbers. But just to give you a sense of where we think we are at and what the issues are that we, the council, the staff and the planning board will need to to to work through with the'",
        "'speaker_4': 'community are the following. We think we have enough land already zoned to accommodate about 2100 units, and that's comprised of about in terms of the arena, about 551 lower income units and about 1500 above moderate those units, as you can see in the table or generally located at Alameda Point, where we think we have a capacity for'",
        "'speaker_4': 'about a thousand more units at North Housing, where we've already approved a project of about 500 units, which is 50% affordable. So we split that between the two income categories. And then we're making some assumptions here, which we'll have to confirm over the next 18 months with the state of California.'",
        "'speaker_4': 'We think we should be able to count the Boat Works project because of recent actions by this City Council to make that project feasible and resolve longstanding problems with the works project. The reason why I say it's still going to be a discussion with each CD is this is this site has been on our on our housing'",
        "'speaker_4': 'element for two cycles now and it hasn't been developed. So the first question. Is is it really available? And we're going to make the case that it is now with these changes that the city council made. There may also still be some building permits left still to issue by 2023 at Alameda Marina and some at Alameda landing'",
        "'speaker_4': '. So this table just estimates maybe 100 at each of those projects. And then due to some really good changes the council made to the second unit ordinance a few years back, we're doing about 25 to 30 second units annually here in Alameda.'",
        "'speaker_4': 'So we will if you multiply that over eight years, we anticipate another 200. So that's how we get to this 500 approximately affordable units, some 1500 above moderate units. What this table shows, though, is we if if our allocation remains relatively constant to this initial projection and as Randi said, it could very well could change.'",
        "'speaker_4': 'So these are just estimates at this point. But if it does end up being around 4800, you can see on this table that we will be short on our lower income categories by about 2300 units, and we are going to be short on the above moderate by about 500.'",
        "'speaker_4': 'So approximately 2800 units or short. So what this means for us is we're going to have to find land suitable and available for about 2800. Obviously that our number goes down, then it'll be a little bit less. If it goes up, it'll be a little bit more.'",
        "'speaker_4': 'Next slide, please. The sites that we think we will be talking about as a community. And this is not something we have to decide tonight. But I just wanted to let everybody in the community and just make sure everybody had the same basic information, the kinds of sites that we think we will be talking about to accommodate'",
        "'speaker_4': 'those additional units include sites such as and signal terminals. This is a project that has been in the housing element for two cycles now and is still vacant. It's vacant because it's infeasible to develop. We will be coming to the Council with a proposal for a Tidelands exchange in the near future.'",
        "'speaker_4': 'If the Council approves that Tidelands exchange, then we think we will be able to count enteral terminals in our housing element. If the Council does not, then we will not be able to get annual terminals into the housing element.'",
        "'speaker_4': 'It will not be accepted because it's not available. South Shore Shopping Center is another site that we've all been talking about over the last few years. This is another property owner that is interested in building housing, which means it's available and has some residential zoning already, but it could accommodate more.'",
        "'speaker_4': 'So that'll be an interesting conversation if we want to try to allocate more housing to South Shore because we're trying to get to 2800 units. You know, those two projects alone get you to a that's about 1100. So we would we still need more sites and the sites that we're talking about or the other shopping centers in'",
        "'speaker_4': 'Alameda Alameda Landing Shopping Center, Harbor Bay shopping center, marina village shopping center, blanding shopping center, as you see on the table, available availability unknown. That's because we haven't talked to the property owners for for the state. We need to show that the zoning we are putting the zoning in place.'",
        "'speaker_4': 'But we also have to show if we're talking about shopping centers and sites with active commercial uses, that they're actually available for housing. And this is done at least it has been done the last few rounds, and we've been successful when we provide evidence from the property owner essentially to the state, saying from the property owner, hey'",
        "'speaker_4': ', I'm willing and interested in building housing on my site. And if the city reasons me and puts me in the housing element, I will be building housing. So but we have not reached out to any of these these other shopping centers to inquire yet.'",
        "'speaker_4': 'The other areas that we're looking at, of course, and have been talking about over the years, Park Street, Commercial District, Webster Street, Commercial District, and then, of course, our medium density residential areas throughout the city where there is additional capacity to add housing.'",
        "'speaker_4': 'Next slide. So none of this has to be decided tonight. But we will have to start making decisions over the next 18 months. So what we're suggested in the staff report to the council is that we we'd like to set up a series of meetings with the council and then three in the next six months.'",
        "'speaker_4': 'Tonight, December 1st, really was designed to talk about educate ourselves about the regional methodology. And it's fantastic to have Randy here tonight to help answer questions about that. Then we'd like to come back in February or March, February, preferably in the next couple of months, and have another workshop with the council where we talk.'",
        "'speaker_4': 'Focus more on Alameda. Focus more on, okay, let's make some assumptions about what our arena might be. We can assume 3000. We can assume 5000. It doesn't really matter. What we would like to start talking about with the council is where do we as a community and where would you as council like to think about adding housing'",
        "'speaker_4': 'and using that sort of preliminary list as as a starting point? And then in the summer come back for a third time. We hope by summer of 2021 we will have the final draft number that Randy was talking about from back.'",
        "'speaker_4': 'That is the appeal period that he mentioned. At that point, I think the council has an opportunity to make two decisions. One is, does the city of Alameda want to appeal their number? And if so, what is our argument for appealing it?'",
        "'speaker_4': 'And secondly, provide direction to staff and the planning board on how you want to approach the housing element. UPDATE Because then the staff and the planning board need to get to work because we under state law need to be complete that work and all the public hearings and be back to you.'",
        "'speaker_4': 'City Council ideally in the summer or very early fall of 2022, so that you can have your final public hearings and adopt the. Housing element for the next round. So with that, I think that's the last slide. Laura And yes, it is.'",
        "'speaker_4': 'So that concludes the presentation. And staff as well as Mr. Chancellor from a bag MTC are here to answer any questions that you might have and any thoughts or direction you have for staff going forward.'",
        "'speaker_1': 'Thank you. Thank you, Mr. Thomas. Thank you, Mr. Rentschler. Very informative presentations. So Council we have, we've, we've read the staff report and which was kind of summarized by Mr. Thomas. So what would you like to know? I should stop and ask if you have any clarifying questions of either of our speakers, and then we'll see if'",
        "'speaker_1': 'we have public comment. And before coming back to counsel comments, any clarifying questions about anything in these presentations? Kelso. Brody.'",
        "'speaker_4': 'I just wonder if we'd be able to. I mean, I personally like to hold my questions till after public comment. Is that. Sure. Okay. Thank you.'",
        "'speaker_1': 'Okay. Anybody have any clarifying questions that they want to ask right this minute? Otherwise saying, is that okay? Councilmember de SAC, you're you're kind of off center, so I don't see the hand that was raised. But yes. Councilmember Diaz, like.'",
        "'speaker_6': 'Well, first of all, thank you very much to staff. Also, I just want to say thank you very much to Randy Rentschler for coming out and giving a presentation this evening. I think the question that I have is because there's a jobs focused of within the formula.'",
        "'speaker_6': 'Is there any possibility that if it if either the economy changes down the path and and the job projections that that we thought that we would be on are not just temporarily but but systematically altered. You know, could we then alter?'",
        "'speaker_6': 'Could any city, including the city of Alameda, then alter perhaps downwards its housing number if there are systematic changes in the larger economy with regards to jobs, but also in terms of changes with regards to jobs, not just systematic changes.'",
        "'speaker_6': 'Let's suppose a city, a jurisdiction, decides that they don't anticipate having so many jobs in the future. Could that then also trigger a reassessment at some point of of the numbers that have been allocated originally makes.'",
        "'speaker_1': 'Mr. Read So you want to take that or. Mr. Thomas Either way.'",
        "'speaker_4': 'I was looking at Randy. Yeah, no, I'm happy to.'",
        "'speaker_1': 'I was too.'",
        "'speaker_4': 'So this work, it's a really good question and like a lot of things with Reena, because it's been going on for so long and had so many participants, that question has been asked a great deal, particularly. So, you know, given this very unfortunate environment we're going through right now, I think the very best answer I can give'",
        "'speaker_4': 'you is that it's very doubtful that this administration in Sacramento will change that number that they're giving not just to the Bay Area, but to the Los Angeles Basin and to San Diego. As you as you may know, over the past number of years, the arena laws have been strengthened significantly through acts by the legislature.'",
        "'speaker_4': 'And except for KOVR, I think a fair person would have assumed that they would have been strengthened even further this year. But Kobe just took out the oxygen out of the air out of Sacramento. So I think the best way to answer that question is that in the last ten years, we, the Bay Area, has produced about'",
        "'speaker_4': 'seven times more jobs than housing. And that even under the worst economic scenario and look, a large unemployment drop in jobs is not something people usually cheer for. But even if that were to occur, that the state is so far behind in housing and the current administration, as you know, from from listening to them, talks this line'",
        "'speaker_4': 'regularly that I think it's very, very doubtful that AMAG or the L.A. Basin or anyone else will get a set of numbers different than what we're dealing with right now.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thanks. So I was going to say very much the same thing just from my policy committee with the League of California Cities, Housing, Community Economic Development. We are so under housed as a state and we we have a lot of catch up to do so.'",
        "'speaker_1': 'Yeah, I think these numbers will hold conservatives. I have another question.'",
        "'speaker_6': 'Okay. Quick question. If you if you know the answer to this, that'd be great. Suppose we go through the Rita process and the state says, you know, you have to do 4900 and that the city and everyone else buys into that.'",
        "'speaker_6': 'But suppose as we're looking for places to find housing, that we could only come up with 3700 areas. So the question is, are are we credited for the fact that we greatly we found 70% of what we should have or so and and is any penalty.'",
        "'speaker_6': 'Correspondingly calibrated. If that question if you get that question.'",
        "'speaker_1': 'I think Mr. Thomas wants to answer that. I don't.'",
        "'speaker_4': 'I, I can take the first shot at it and Randy can correct me if I misspeak. But essentially that the the way this works is and I just want to clarify, I know, you know, this counts more days.'",
        "'speaker_4': 'So I go for the public because we often hear the public, you know, criticizing a bag as like the bag numbers, a bag doesn't create the numbers. They and they don't have the luxury of reducing the regional number there.'",
        "'speaker_4': 'They have the terrible job of of trying to distribute this very big number among all the cities. So the but to answer your specific question, no, that the threshold is either you either pass the green light or you don't.'",
        "'speaker_4': 'And if you don't, what happens is we the way the process works, we submit our housing element to D before we bring it to council for final approval to find out whether they determine whether it is in compliance with state law or not.'",
        "'speaker_4': 'Meaning, did you meet your number or didn't you? They will tell us whether we have, you know, accomplished the the the target or not. 75% is not 100% right. So in that case, we should anticipate a letter from them saying, no, you haven't done it.'",
        "'speaker_4': 'And what that means is they don't certify our housing element even if the council approves it, which means we don't have a valid general plan. And if we don't have a valid general plan in the city, in the state of California, then there's all sorts of consequences for a city in California from not having a valid general'",
        "'speaker_4': 'plan, which I won't go into all the details. But and those those those consequences aren't calibrated as you are suggesting, like, hey, you can metered 70 70% so discount the penalty it's either you're either it's either black or white.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Well, and as far as the consequences of Mr. Thomas, I mean, some of the more glaring ones maybe having to do with loss of funding for.'",
        "'speaker_4': 'Yes, I can just just to give you just a just a flavor of what what that means when you don't have a valid general plan. Over the years, with the strengthening of the Rena process has also come a strengthening of the penalty process and the incentive process.'",
        "'speaker_4': 'So many state grants for open space like the the major $2 million grant we got for Jean Sweeney, part of the original construction. We only got that grant because we had a certified housing element. If we didn't have a certified housing unit, we would not have been eligible to apply more and more transportation funding.'",
        "'speaker_4': 'Open space funding, affordable housing funding is is preconditions. Like if you don't have a certified housing, you don't even bother applying. The other issue is if you don't have a valid general plan, you don't have the basis for your local land use decision making because as you know, every decision the council makes and the point where it'",
        "'speaker_4': 'makes you have to make a finding is consistent with your general plan. Well, if you don't have a valid general plan, you can't make that finding, which makes us very vulnerable to lawsuits. And in those cases, if we have that problem and go down and find ourselves in that situation where we're out of compliance and somebody challenges'",
        "'speaker_4': 'our decision making abilities, the state and the courts can take over that local decision making authority from us.'",
        "'speaker_1': 'Ex Mr. Thomas okay, conservatives have another clarifying question before my question.'",
        "'speaker_6': 'But during the years when we are out of compliance, is it correct to say that development did occur in the city of Alameda?'",
        "'speaker_4': 'Now it can continue to occur. The question is, will somebody try to stop us or take our decision making authority away from us because we don't have a valid general plan? Thank you.'",
        "'speaker_1': 'Hey, if there are no further clarifying questions for our staff and Mr. Rentschler, do we have public speakers on this item?'",
        "'speaker_0': 'We have three right now.'",
        "'speaker_1': 'Okay. So as long as there are only three and in fact, if we only go up to five, right, they can each have 3 minutes. But if it's six or more, it goes to 2 minutes.'",
        "'speaker_0': 'It's seven or.'",
        "'speaker_1': 'Seven. Okay. Okay. So let's go ahead and start with their public speakers.'",
        "'speaker_0': 'Rob Halford.'",
        "'speaker_1': 'Good evening, Mr. Alfred.'",
        "'speaker_5': 'Good evening. Can you hear me okay? Yes.'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'Great.'",
        "'speaker_5': 'Great. Good evening. Mayor and members of City Council, thanks for the opportunity to speak tonight and thanks to the guests for an informative presentation. I'm here to share my viewpoint on this item as an Alameda resident. The result of the measure measures evoked in a high turnout election stated clearly that Alameda citizens want new housing development to'",
        "'speaker_5': 'be taken up in a controlled and measured way. As part of this approach, it is logical that as a community, we should seek to ensure the allocations we are given for new housing, are optimized for our city's best interests, and take into account the more unique factors that affect us here.'",
        "'speaker_5': 'Although several important factors informed the allocation methodology, the factor of safety is particularly germane to it to our city as a highly populated item and in standard Alameda parlance, I mean that to include the entirety of Alameda. Let's not be scolded for excluding Bay Farm Island and an island that possesses few means of ingress and egress.'",
        "'speaker_5': 'As we all know, in the event of an emergency, we are particularly vulnerable to mobility issues. As such, I hope that you, as elected officials and administrators, will proactively ensure that this factor is appropriately represented in our response to challenge the air bag methodology.'",
        "'speaker_5': 'Alas, and importantly, this message from your constituents is decidedly not an attempt to diminish or devalue other criteria such as equity. Nor is it motivated by a desire to stop the development of new housing. Rather, it's a request to make every effort to ensure proper weight is given to all the factors that are relevant to Alameda in'",
        "'speaker_5': 'order to produce an equitable allocation outcome. Voters spoke by a decisive margin in November. It's time for city leaders to show us that you are listening. In Alameda, it's time to work together in good faith as a community to develop a plan that understands and reflects the reasons why 25,000 citizens voted as they did.'",
        "'speaker_5': 'Thank you for your time.'",
        "'speaker_1': 'Thank you, Mr. Halford. Our next speaker.'",
        "'speaker_0': 'Carmen Reid.'",
        "'speaker_1': 'Good evening, Mr. Reid.'",
        "'speaker_2': 'Good evening. Hello, Madam Mayor and City Council Members, thank you for this opportunity to make a public comment. I would like to address the issue of our arena allocation and I respectfully request that the City Council and staff look for a way to reduce our expected numbers.'",
        "'speaker_2': 'Other cities in the tri valley area, such as Pleasanton and Dublin, are proactively pursuing a reduction. Alameda should do the same. Alameda has a unique geography within the context of the Bay Area. We have limited egress and ingress and are prone to sea level and groundwater rise.'",
        "'speaker_2': 'Please consider the safety of our residents. Please also note that any effort to reduce Rina, as it has been mentioned by Council member Knox White, is not an attempt to reduce equity, but instead an approach for a fair solution for our population of 80,000.'",
        "'speaker_2': 'Based on the physical constraints of the city. And lastly, given that four City Council members, council member Vela, Council Member Oti Mayor Ashcraft and Vice Mayor Knox White supported Measure Z, a measure opposed by 60% majority of voters, creating some unease and concern that the City Council no longer adequately represents the city.'",
        "'speaker_2': 'The citizens of Alameda. We would appreciate a public and explicit statement from individual council members that you promise not to pursue or accept personal financial benefit from the construction of new housing. In Alameda. Is that something you could do for us?'",
        "'speaker_2': 'Please consider this request. Thank you so much for your time.'",
        "'speaker_1': 'Thank you. Ms.. Read our next speaker.'",
        "'speaker_0': 'Delores Keller.'",
        "'speaker_1': 'Good evening. Is Kelleher.'",
        "'speaker_2': 'Can you hear me? Can. Thank you. Good evening, Madam Mayor. And Council. I'm a 30 plus year Alameda resident, a member of Apes and active in the No on Z campaign. Since January's Planning Board, I've become more conversant and increasingly more concerned with the actions of the City Council and the Planning Department in regards to Article 26'",
        "'speaker_2': 'Density Limits and Preservation in Alameda. I'm also concerned with environmental and equity issues, but do not believe that one set of concerns excludes the other and that this needs to be viewed as a zero sum game. I had hope that with the defeat of measures, the Planning and Council might begin to address all of these concerns in'",
        "'speaker_2': 'a truly collaborative manner with involved citizens and civic minded groups fully engaged. However, in less than a month since the election, the majority of council appear to be doubling down on finding a way to eliminate Article 26, despite the vote rejecting Measure Z.'",
        "'speaker_2': 'In early November, I sent a comment via email, as did others, to urge the City Council to advocate for reconsideration.'",
        "'speaker_4': 'Of the.'",
        "'speaker_2': 'Option, a methodology used to determine the Rena one that would better balance opportunity and resource factors with natural hazards. Factors represented in Alameda as a small island city. I was dismayed to see that the council in a 4 to 1 vote not only did not advocate for reconsideration, but directed Mr. Thomas to send a letter in opposition'",
        "'speaker_2': 'to Tri-Valley request for change in lauding and supporting the current AB methodology. During the November 17th City Council meeting, Vice Mayor Knox White seemed to interpret, seemed to interpret without any factual basis. The defeat of Measure Z meant voters wanted the city to abandon the overlay to meet our obligations and so potentially set up a legal showdown'",
        "'speaker_2': 'with the state. This seems to me a very thinly veiled attempt to subvert.'",
        "'speaker_4': 'The will of the voters.'",
        "'speaker_2': 'Voters who are and would have been fine with the status quo, including the overlay of city council, had not put Measure Z on the ballot in the first place. In my opinion, this sort of reasoning, if turned into action, would only cause more distrust, more division and standards, failure of duty to represent the majority of elements.'",
        "'speaker_2': 'This is the very reason that Article 26 is in the Charter. I urge you reconsider any such machinations and do the work necessary to both honor the will of the voters to preserve the unique character of our city and also fulfill our community obligations.'",
        "'speaker_2': 'In my opinion, this is best done in a classic Democrat crowd, a compromise in which each side gains by winning some of what is deemed important to them, while sacrificing something to the other in order to together to serve the common good.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_1': 'Thank you, Ms.. Kelleher. Our next speaker.'",
        "'speaker_0': 'Jay Garfinkle.'",
        "'speaker_1': 'And evening, Mr. Garfinkle.'",
        "'speaker_3': 'Hi. Hi.'",
        "'speaker_4': 'You know, if the numbers that have been presented and process has been presented was correct, it might be reasonable to try to comply. However, there are internationally known experts, demographers and other and planners who have demonstrated that the 400,000 units needed is not correct.'",
        "'speaker_4': 'California's population is stagnant and is seen to probably decrease over the next several years. This will make the Air Bags Reno project totally irrelevant. In addition. I followed the Rina methodology process for a while and. Early on. Hazard, natural hazards and safety was considered one of the elements, and this might have addressed Almeida's concerns.'",
        "'speaker_4': 'Since we have a number of such issues related to sea level rise, egress, ingress. Lack of independent water supply and any number of other factors. However, for some reason, the Methodology Committee decided to ignore the natural hazard and safety issue completely.'",
        "'speaker_4': 'So Almeida's unique issues are not concern considered. The methodology that they come up with came up with is a sort of one size fits all communities. While individual communities around the bay may have a number of issues. The numbers have been the number thrown around has been around 4900.'",
        "'speaker_4': 'I believe that this is a an incorrect calculation and it may be as high as 16,000 additional units that we would have to build in order to reach the required low and very low income level units. Madam Chair, you are a bag representative and you did not push back on the methodology.'",
        "'speaker_4': 'You simply accepted it. And I think it's very clear that the methodology is faulty. If they don't consider the hazards.'",
        "'speaker_5': 'Natural.'",
        "'speaker_4': 'Hazards and safety issues, I think all of you elected officials, really, if you really want to represent the interests of the residents of our city, you absolutely have to challenge the current methodology plan. It's been proposed that there's no hurry.'",
        "'speaker_4': 'However, as at each, every few months, another step is carved into.'",
        "'speaker_1': 'Thank you, Mr. Garfinkle. Your time is up. Our next speaker.'",
        "'speaker_0': 'We now have above seven speakers, so we will shift to 2 minutes. And the next one is Rasheed Shabazz.'",
        "'speaker_1': 'Mr. Shabazz, good evening. What have we done with Mr. Chavez?'",
        "'speaker_0': 'It looks like we aren't able to put him in. So let's see if he can update his zoom and we'll call Tricia or Spencer.'",
        "'speaker_1': 'Oh, you know what, madam? Great. That's a good reminder. You might want to just show everyone.'",
        "'speaker_0': 'Everybody needs to be on the most current version of Zoom in order to be promoted to speak. So Zoom puts out a lot of updates, so it's hard to stay on top of that. Please just try and update that zoom and then you'll be able to speak.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'So much. Spencer is next for 2 minutes.'",
        "'speaker_2': 'All right. Good evening. Can you hear me?'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Wonderful. Okay, so I wanted to use this opportunity to ask a few questions, and I'm not looking for answers at this time, but I think it's something that staff and our city attorney can be thinking about. And in fact, I want to commend Mr. Rentschler for his presentation as well as Mr. Thomas.'",
        "'speaker_2': 'Mr. Renshaw had referred to the Bay Area being a jobs machine over the past and I'm not sure how many years when he, I believe it was seven times increase or something like that. But I would be interested in knowing in regards to the city of Alameda, where are we in jobs?'",
        "'speaker_2': 'Because with my understanding, we've lost car dealerships, we lost the former base. And in fact, that we have had a housing imbalance in regards to having jobs decrease over a certain amount of time. So I would be curious to know where the city of Alameda is in regards to this.'",
        "'speaker_2': 'I'd also like to know in regards to presentation second unit, does that include a use or what is the definition of second units that's being used in that chart? I've also heard that other charter cities are challenging the state's authority, is my understanding, for instance, the city of Pasadena.'",
        "'speaker_2': 'And I'd be interested in knowing our city's response to that, what they think of it. I'd also be interested in doing other reasons that other cities are challenging the numbers. For instance, are any of them an island for bridges in a tube, though elevation and, you know, other factors so that we can have all this information for'",
        "'speaker_2': 'the community when we're looking at this. So thank you very much.'",
        "'speaker_1': 'Thank you. Our next speaker.'",
        "'speaker_0': 'Um, Delores Kelleher, has raised her hand again, but perhaps somebody else using her log in plans to speak now. Oh, no. She's lowered it. Okay.'",
        "'speaker_1': 'Yeah, we just get when went through.'",
        "'speaker_0': 'I just didn't know if they were sharing. So then Kathleen Sullivan.'",
        "'speaker_1': 'All right. Good evening, Miss Sullivan.'",
        "'speaker_2': 'Yes. Hello. Can you hear me? Yes.'",
        "'speaker_1': 'Hello.'",
        "'speaker_2': 'Thank you. Hi. People have addressed the concerns of getting in and out of the island. I would like to address the concern I have of traffic within the island. I find it odd that there is going to be new units in South Shore Center when Otis and Park Street seems to be closed down to one lane in'",
        "'speaker_2': 'the in the current city plans. I don't know how fire departments are going to be able to serve the community if traffic is backed up. And it will be if you put another 800 people into South Shore and continue to squeeze the streets.'",
        "'speaker_2': 'I won't I don't have time to read it, but I would like to call attention to Article 13, Section 35 of the California Constitution, which says in part, The protection that the public safety is the first responsibility of local government and local officials have an obligation to give priority to the provisions of adequate public safety services above'",
        "'speaker_2': 'all. So I like to see that part of your obligation to protect us, to be able to get the fire department, to get to my house, to allow an ambulance to get to the hospital. That's my concern with putting more and more housing on the east side in the gold and the Bronze Coast South Shore area.'",
        "'speaker_2': 'I just don't think those numbers can be supported. Thank you.'",
        "'speaker_1': 'Thank you, Miss Sullivan. Our next speaker.'",
        "'speaker_0': 'Drew Dara Abrams.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_3': 'Hey. Hi. Mayor. Vice Mayor, council members. I already sent perhaps a bit of a novel over email, which I won't rehash here other than to comment on the topic of the arena numbers and thank the folks at a bag and city council for starting on this big, long process that I know is being repeated in many cities'",
        "'speaker_3': 'throughout the Bay Area with honestly the same unique complaints being made everywhere. So I just want to speak a bit, frankly, and say that I think these these numbers are are eminently doable. I would like to see Alameda not just.'",
        "'speaker_3': 'Well, honestly, I would like to see Almeida embrace Option 80, which a series of NGOs around the Bay Area have helped to shape and are promoting for equity for environmental concerns and economic concerns. Some council members have spoken pretty positive for positively about this before, and I think it's worth repeating that these these goals are are being'",
        "'speaker_3': 'squared. And to play a zero sum game is not just mean, but is actually running counter to some very valid environmental goals, economic goals and equity goals that the city should be pursuing, the region should be pursuing. And I'd like the city to be a part of that.'",
        "'speaker_3': 'Thank you very much for doing the hard work that's going to be spread out over a few years to make this happen.'",
        "'speaker_1': 'Thank you, Mr. Dara Abrams and our next speaker.'",
        "'speaker_0': 'Ashley Loren Lord.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_2': 'Hi. And thank you for the opportunity. I just wanted to ask for clarification. When Mr. Thomas was showing that potential opportunity areas for where we can add those numbers to make up the gap, I didn't see any discussion of the lower income versus the above moderate income, and it seems like we're on track to potentially well exceed'",
        "'speaker_2': 'the higher income housing but failed to meet the lower income portion. And I just wanted to get some clarification around how we would proceed planning with that in mind and any discussion of whether we're intending how we're intending to change that, that right down between the two.'",
        "'speaker_1': 'Thank you, Gordon. Our next speaker.'",
        "'speaker_0': 'Rasheed Shabazz.'",
        "'speaker_1': 'Mr. Chavez, there you are. Good evening. Go right ahead.'",
        "'speaker_3': 'I'm awesome. Now that I've been in power to speak.'",
        "'speaker_1': 'It gets you happy.'",
        "'speaker_3': 'Thanks for the upgrade.'",
        "'speaker_6': 'Even though I won't get an upgrade in time. All right.'",
        "'speaker_4': 'So I just wanted to first say thank you to all of the the council majority that.'",
        "'speaker_3': 'Put Measure Z on the ballot.'",
        "'speaker_4': 'Because it enabled Alameda to have a conversation that is long been stifled or suppressed by the status quo. I'm actually one to be a little weird tonight, and I want to read a portion of my undergraduate thesis where I talked about I talked about the Clayton Guyton and Madison Henderson settlement.'",
        "'speaker_4': 'And so this is from Alameda is our home. Chapter nine Pages 155 to 161.'",
        "'speaker_3': 'Available on UC Berkeley website. And it starts off with a quote from Mike.'",
        "'speaker_6': 'Rawson, the legal.'",
        "'speaker_4': 'Aid attorney who sued the city of Alameda by filing the suit. Guyton and Henderson hope.'",
        "'speaker_3': 'To eliminate all city policies that limit the ability of the city to fulfill its obligation to.'",
        "'speaker_4': 'Provide housing for low income families. They also hope to educate and go at least part.'",
        "'speaker_3': 'Of the way towards changing attitudes of some city residents who would see Alameda as the exclusive province of middle and upper income homeowners. Now, there was a tentative hearing or preliminary ruling in which the city that a judge forced the city to.'",
        "'speaker_4': 'Have any land use decisions coming towards a judge.'",
        "'speaker_3': 'So to force compliance, the plaintiffs asked the judge to enact a portion of the housing element law that would allow the court to spend the city's authority to issue.'",
        "'speaker_4': 'Building permits for single family, residents and duplexes.'",
        "'speaker_3': 'As well as subdivision maps. And so on June 5th, 1989. Judge Michael Balakian also has ruled that the land.'",
        "'speaker_5': 'Use.'",
        "'speaker_4': 'Policies discriminated against the poor, and he.'",
        "'speaker_3': 'Ordered the city to revise its.'",
        "'speaker_4': 'Housing element. And until then.'",
        "'speaker_3': 'For 120 days, the city could not accept grant applications for zoning changes, variances or subdivision map improvements. And so every.'",
        "'speaker_6': 'Request had to go to.'",
        "'speaker_3': 'Ross Rawson. So I just wanted.'",
        "'speaker_4': 'To share it and encourage you to read that.'",
        "'speaker_1': 'Online. Thank you, Mr. Chavez, and our next speaker.'",
        "'speaker_0': 'We have no additional speakers. That was the last speaker.'",
        "'speaker_1': 'With that, I'm going to close public comment and we'll come back to the council for your discussion and any questions you had of our Mr. Thomas, you're Mr. Redstone, that you deferred until after the public speakers. So, Councilmember O'Toole, do you want to start because you deferred your questions earlier?'",
        "'speaker_4': 'I appreciate that. I can wait.'",
        "'speaker_1': 'You went away. Okay. Did I try to.'",
        "'speaker_4': 'Formulate my.'",
        "'speaker_1': 'Questions? Okay, well, formulate a way, because I see Councilmember Vella stand up, so why don't you go next?'",
        "'speaker_2': 'And I want to thank both Randy and Andrew for the presentation. I was listening the whole time. I was putting my son down to sleep, so I figured people do need to see that.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'But my question is, we know that these are our allocated numbers to the region. So what happens if we go or if a bag decides to go with the alternative methodology? Right. So the units potentially decrease here in Alameda.'",
        "'speaker_2': 'But but where do they ultimately end up?'",
        "'speaker_4': 'Mm hmm. So we have done an analysis about that. In fact, that was voted on at least three times through various processes at a back, including at the executive committee. What it basically does is shift housing further into Santa Clara County is what?'",
        "'speaker_4': 'That's the tradeoff. What you see mostly, although Alameda gets caught up in the math, it mostly shifts numbers from you probably recall that honeycomb chart. So you just imagine things shifting towards Santa Clara County in southern San Mateo County and into the city of San Francisco because it's a jobs heavy formula.'",
        "'speaker_2': 'And some of the units also end up in Oakland, correct?'",
        "'speaker_4': 'Now they do. Yes.'",
        "'speaker_2': 'My next question is so it's not that they just to kind of paraphrase what you said, it's not that they they leave the region. They might leave the borders of the city, but they stay within the region. Correct.'",
        "'speaker_4': 'Correct. So instead of 25% of the population of Santa Clara taking 30 some odd plus percent of the housing. And again, this is in round numbers. You also mentioned Oakland. The formulas do lots of things because it emphasizes jobs and doesn't emphasize furthering fair housing.'",
        "'speaker_4': 'You get to see shifts in various quadrants around the Bay Area is what the numbers do.'",
        "'speaker_2': 'Okay. And my next question is in in in terms of calculating and the jobs factor, we're not taking into account work from home relative to that, correct?'",
        "'speaker_4': 'That's correct.'",
        "'speaker_2': 'And there was a study, I believe, from 2010 to 2014 that in the Bay Area grew by 350,000 people in Alameda County, grew by 100,000 during that period. And we were the fastest growing county. Is my understanding in the state, I know that that some of the questions have been about estimating population growth for growth moving forward'",
        "'speaker_2': 'or stagnation. Can you comment kind of looking back at what's happened with the population of the region in Alameda County?'",
        "'speaker_4': 'So I can't answer the Alameda County question off the top of my head. I can answer the question about the Bay Area in total. So last time we did this number, but everything's jobs driven. That's just the way life is like we like it or not, right?'",
        "'speaker_4': 'And it's about access to jobs. So even though a job isn't in, let's say, a community like Alameda because of Alameda access and we have all sorts of numbers on what that access looks like, you know, the February votes being an example provides you easy access to jobs in San Francisco.'",
        "'speaker_4': 'So it's a complex picture with 101 cities, mostly small ones. We're not there's no way you put a job in a house in that, because that's not what life is like. Life doesn't look like that. But trying to answer your question directly, the amount of job growth that took place in the Bay Area over the last, let's'",
        "'speaker_4': 'say, five or seven years outpaced the entire estimate that we had for job growth for like 25 years. That happened so rapidly. So that's how you're seeing higher Rina numbers. They're all they're making up for many lost years through changes in state laws, but they're also reflecting something that has occurred over the past decade or so.'",
        "'speaker_2': 'And you, of course, have instances like my household where my my partner works in the South Bay, his office is in the South Bay, but he works within several hours of there and might be going to job sites all over.'",
        "'speaker_2': 'And my office is in the peninsula, but I my my territory is all of northern California in Nevada. So I think what you're saying is that there's various complexities depending on who's in the household and as well as the different types of industry growth and how that's all connected.'",
        "'speaker_2': 'Is that correct?'",
        "'speaker_4': 'Yeah, it is. And look, I mean, you're identifying things and everyone identifies this because the Reno process is imperfect at best. You know, it's been widely disliked for 60 years. I think the legislature has decided to do it because.'",
        "'speaker_4': 'The real the real questions behind housing are so difficult to solve. What they've kind of tossed around on local government is kind of what's occurred. But that's common, like the legislature does this kind of stuff all the time.'",
        "'speaker_4': 'So the complexities of what you're discussing are complexities we try to capture in our processes, but it's never going to be spot on and perfect. It's just not.'",
        "'speaker_2': 'And to your point earlier in the methodology, it takes into account a number of different things. It's not looking at one factor, although it is looking at the job growth relative to demand for housing. Correct.'",
        "'speaker_4': 'And particularly this round the vote that that the bank board took, in particular this round was seeking to to find more housing where the jobs are in Santa Clara. And look, you can imagine the impact on our transportation system.'",
        "'speaker_4': 'I mean, everyone a lot of people just expect that it's normal that we seek to raise billions of dollars to build barge extensions and highways, when really the problem we have is people live far, far, far away from where their job is.'",
        "'speaker_4': 'And if we can, the way we had we meet our climate objectives, frankly, at this point is to try to get people to live closer, to work with control combustion engines. That's the answer. So part of the complexity here that is behind the arena numbers is is is all the things dealing with transportation and the investment behind'",
        "'speaker_4': 'it. And there is a ton of background noise going on that's incredibly complex.'",
        "'speaker_2': 'Thank you. That's all from me right now.'",
        "'speaker_1': 'I just want to chime in and add that you're right, Mr. Rentschler, that jobs are driving a lot of this in proximity to jobs. And that is a good thing. We need to to factor that in. It is also opportunities, opportunities to live near good schools, to live where there are resources like libraries, like parks.'",
        "'speaker_1': 'And, you know, we we had an earlier item just before this one about I subcommittees on police reform, which are really part of a larger national discussion of why some communities have been impacted so much more by things like police violence, but also like COVID 19.'",
        "'speaker_1': 'And it a lot of it has to do with where you live. So the equity component also factors into it. And then you are right that rehab, is it popular with anybody? But the reason that the State Housing and Community Development Department has to do a housing allocation for regional governments around the state is that everybody would'",
        "'speaker_1': 'say not in my backyard and the housing crisis just continues to get worse. So, you know, trying to to put it a little bit in perspective to see where we fit into the the bigger picture. Casper Rodeo tickets are going to go up just.'",
        "'speaker_4': 'Yep, thank you. And I appreciate you calling on customer viola so I can have a few more minutes to percolate time. First of all. Thanks, Mr. Bunch. There. I see you have Alameda over your shoulder. So that's going backwards.'",
        "'speaker_4': 'Andrew You know, always informative. So I'll put you guys on the spot and you can pick who's going to answer. So we've heard a lot of comments and we received a lot of emails that kind of say that we are a unique city.'",
        "'speaker_4': 'I mean. Are we the only one that makes that argument, or do other cities make that argument? I want to ask you, are we really all that unique? Of course. To you ask it in the other way. 101 cities, of course.'",
        "'speaker_4': 'They're all unique. Of course they are. But look, we're also look, we're also very much the same when you look at a town like Alameda and you have the geography that we have and the bridges that we have, it's very obvious to come to a conclusion about about restricted access.'",
        "'speaker_4': 'And it's probably less obvious if you live in Contra Costa County and you got a fight a half an hour on just one main road, Ignacio Valley Road, to get to one freeway or in Alameda, we have an entire ferry system funded by the toll payers on the Bay Bridge work.'",
        "'speaker_4': 'No one in Contra Costa County. Well, I guess Richmond does now has that, but not in central Contra Costa County. We have access to AC transit. We actually a pretty good bus service. When when you think about all this and our technical people go do the math on this and they do do the math on this, you'",
        "'speaker_4': 'come to a couple of conclusions. One Mayor Ashcroft mentioned was that Alameda County is one of those communities that can provide people with a better life. We have good schools. We have a safe community. We have a good community relative to many of our peers across the Bay Area.'",
        "'speaker_4': 'And also, technically speaking, while it's hard to grasp this, we have very good access compared to many, many of our neighbors across the Bay Area. And so this feeling that people have, that we're somehow unique, I'm sure everyone's special, but you're not that much different than everybody else when it comes to hazards.'",
        "'speaker_4': 'Hazards were discussed at great length through this process, along with access, along with equity, along with transportation, and on the hazard side. But the big hazard and there's a state law and this has to do with wildfires and this notion about trying to keep people from going off into that interface on wildfires when it comes to climate'",
        "'speaker_4': 'change discussed at great length, we have $20 billion in our plan to mitigate for climate change, which will take care of a great deal of the problem for some foreseeable part of the future. But, you know, climate change is going to probably affect I-5 more than it's going to affect many roads around here, because that water drains'",
        "'speaker_4': 'through the estuaries across the Bay Area and those, you know, Solano County, 80, that's probably the biggest, scariest place. Highway 37 going between Vallejo, but that's in big trouble. So we have a lot of company, a lot of company on the issue of hazards across the Bay Area and across the state of California.'",
        "'speaker_4': 'Oh, Andrew, I'm sorry. No, I just going to add to Randy's thing. I don't have his regional experience. I just have local experience in five different East Bay cities and every city I've worked for. We always felt we were unique and we always argued that, you know, and it was often it's always, you know, my experience was'",
        "'speaker_4': 'transient. Oakland, Berkeley, Union City, Albany. We always argued transportation. We were uniquely constrained on transportation. So, you know, as Randy said, it's we're more similar than we are different. Thank you. And I think that's the challenge when you're listening to Alameda resident say, look, we need to challenge the number.'",
        "'speaker_4': 'We need to you know, it would be crazy not to at least try and that there's no resistance to trying. What I struggle with is, okay, so what's our argument like? What is the argument that the units shouldn't be in our in our city, but they should be in a neighboring city?'",
        "'speaker_4': 'I mean, that's the argument we need to make if we're going to challenge what not just that we can't accept them, but where should they go? And that's where I, I personally am struggling. Like, how are we going to make that case and what is our argument going to be?'",
        "'speaker_4': 'And Randy just explained, like, it's going to be tough. It's going to be very tough for Alameda to make a convincing argument given the nature of the region and the nature of Alameda in that region. So just for the sake of argument, let's go down that path.'",
        "'speaker_4': 'So, I mean, first of all, this 441 176 I mean, that is a zero sum game. If you take one unit away from Alameda or Emeryville or whatever, it has to go somewhere else. You know, we're not basically saying, all right, we want to reduce this 441000 to 2 X and then we're all going to kind of'",
        "'speaker_4': 'have to do less housing. Right? Right. Right. Okay. So and then, you know, I mean, how many. How often are these allocations appealed? 101 communities think they're unique and 75 of them feel them. I mean, what's really the likelihood that it's going to change?'",
        "'speaker_4': 'So, Councilmember, look, we can provide you with the exact details of that. Off the top of my head, I know a handful of communities have appealed. There is very mixed success on this. That might win on the margins in a couple of places.'",
        "'speaker_4': 'But I think I think in this case, it'd be better for me not to wing it here and provide you with the exact information so your council can can make the decisions that you wish to make. Okay. And then I think the next one probably for next couple are for you, Andrew.'",
        "'speaker_4': 'So we had this discussion about, you know, boat works for, you know, terminals and and, you know, my recollection is those are in passing housing elements. I mean, what's the success rate of of winning that argument that even though we put these because my understanding is if it's in one element, you can't just re-use that as availability'",
        "'speaker_4': 'or reasonable capacity in the next element, because otherwise people would just keep putting it down the line. Right. So, I mean, if. Well, first, what is the chances that we're going to be able to include those? And if we don't?'",
        "'speaker_4': 'I mean, the answer is obvious, but I'd like to hear from you. I mean, what can we do about those? Um. Yeah. However many units. 700 or 161 180. Good question. The gist to the question. Yeah, it's a it's a great question, Councilmember o.T.'",
        "'speaker_4': 'The laws on this have changed since we did our last housing element. And as you said, the logic of the law makes sense. And it's I you think of it from the state's perspective. Don't tell us the site is available.'",
        "'speaker_4': 'If you told us it was available eight years ago and it didn't get developed, I mean, something must be wrong. It must clearly not be available if it sat there vacant for eight years when you said it was going to be available.'",
        "'speaker_4': 'So so no, we're not going to accept anymore. The strategy that that that I will recommend to all of you is that we embrace that concept with some like for a boat works for example it's we listed it before we acknowledge yes you are right that didn't get developed we discovered a problem and then our city council'",
        "'speaker_4': 'in 2019 or right in the beginning of COVID, whenever that was 2020. Took a whole series of decisions in cooperation with that the property owner about works to make this project basically to UN leadership to UN constrain it.'",
        "'speaker_4': 'So please pretty please accept it because we really believe we honestly believe with this change. And you know what I, what we did last year or eight years ago, I mean, in some cases, we provided actual letters from the property owner saying, yes, I am available.'",
        "'speaker_4': 'I thought if this goes forward, I will be building housing on the site in the next two years. And, you know, I'm hoping that with that kind of support, we will be able to get a site like Boat Works Counted, even though we counted before.'",
        "'speaker_4': 'If we don't if KD rejects it, it's it just makes our life a little bit harder. It's another 181 units. We need to find a home for somewhere else. Now, that being said, that 580. Right. And then Arsenal terminals is another another 580 where, you know, we have the same problem.'",
        "'speaker_4': 'We do plan to come to the council in the near future to see if this council is would be willing to reconsider the Tidelands exchange, because that's that's why that site has been remained undeveloped for the last eight years.'",
        "'speaker_4': 'It needs that tidelands exchange. Okay. And let's chat a little bit about, you know, Article 26 because basically by applying reading of it, it basically prohibits multi-family housing, right? Right. And it limits density to 21 units per acre.'",
        "'speaker_4': 'So, you know, let's just assume for the sake of argument that, you know, the state can override that with their density bonus. And let's also assume for the sake of argument that maybe a multi-family overlay may not comply with our charter.'",
        "'speaker_4': 'And, you know, to vote to put it in would be a violation of the charter. So can you explain kind of walk us through maybe mentally or visually what it would look like based on Article 26 as is written state density bonus, accepting that it's just a fact, no multifamily overlay because there's questions about whether it may'",
        "'speaker_4': 'be legal and what that would look like in Alameda to meet this 4800 unit. Requirement of Rena, the work that your question is, what does it look like if we don't do a multi-family overlay? Well, that's the assumption I'm asking.'",
        "'speaker_4': 'You know, assume that maybe a multifamily overlay may let's just assume, for instance, that it may be in violation of the charter because the charter is pretty clear. No multifamily overlay. There's no state preemption on multifamily overlay. There's state preemption on state density bonus.'",
        "'speaker_4': 'Yes, that's right. I think that the let's I don't think it's an assumption. It's pretty clear. Like state. Yeah. The the issue is. The state says you need to show us how you are going to provide for all income levels.'",
        "'speaker_4': 'So in this way, this could say this question came up from one of the speakers like, I don't get it. Like, how are we going? It seems like even if we find the land for the 2800, we're going to be short.'",
        "'speaker_4': 'Because I think what she was saying is that you only have a 15% inclusionary requirement. So how are you going to get all those affordable? The state says you need to show us how the land that you've made available is going to provide for all income groups.'",
        "'speaker_4': 'And it gives us a couple options. Option number one, give us a study and show us with empirical evidence that if you just build on those sites with the zoning that you have. And the land values you have and the cost of living that you have, the cost of housing that you have in your community.'",
        "'speaker_4': 'That when somebody builds that project under that zoning, there's units that are available that are that are affordable to all income groups. Obviously in the bay area that is just not possible to do unless you have some way since our are lower income categories is about 50% of our total arena.'",
        "'speaker_4': 'So how do you ensure that? That many units are made available to to to to those income groups. You can either say you can you show maybe you in some small town out on the Nevada border, you say, well, look, here's the market rate for these units and here's some documentation.'",
        "'speaker_4': 'See, people can afford them that that might pass muster with the state. Number two, you can find some other way. And the city tried this in 2003. Like, we'll just subsidize everything. We we were going to use redevelopment money.'",
        "'speaker_4': 'We're going to just throw a lot of money at the are affordable housing need. Our affordable housing need was much smaller in 2003 for that round than it is today. Much smaller. And then the third option is the multifamily option.'",
        "'speaker_4': 'This is the option that we utilized for the last two housing rounds. What state law says is if you. You can show us how you're going to. How your zoning works. But we will make the assumption at the state level that if your zoning is high density and it allows multifamily by right.'",
        "'speaker_4': 'And what that for a city of our size if it's 30 units or more per acre measure. Remember is only 21. So and measure says no multifamily housing at all. State law says if your zoning shows that you permit multifamily housing and it shows that you provide high density housing through a minimum 30 units the acre.'",
        "'speaker_4': 'We will accept that because we believe that that's the kind of zoning that facilitates more affordable housing. So if you don't do the multifamily overlay again in Alameda, and this is one of the decisions that we want to sort of make as a with or get direction from the council over the next few months.'",
        "'speaker_4': 'Like what direction? Which of these roads do you want to go down? If we don't do the multifamily overlay that leaves us with the two other options, I don't think we will be successful arguing that single family development in the Inner Bay Area in Alameda is affordable.'",
        "'speaker_4': 'That's not going to work. So that sort of leads to a third approach, which would be a very expensive.'",
        "'speaker_0': 'Raising, actually.'",
        "'speaker_4': 'Laura. We can hear you now. While the weather may.'",
        "'speaker_0': 'Make that surface crash and Ashley juggle two surfaces at one time and got it all fixed. So she's amazing. Sorry.'",
        "'speaker_1': 'You are amazing. I was going to text you and say sorry.'",
        "'speaker_4': 'That was. I hope I answered your question. Councilmember Oh, yeah, I almost said that was amazing. Andrew But okay, thanks. So I'll just, you know. This is my last meeting on this. So, you know, I appreciate I'd like to see going forward as a member of the community because now I get to be critical without taking accountability'",
        "'speaker_4': '. It would be kind of fun. Now what it's going to look like like are we now going to get like 100? You know, is the density going to be 100 units per acre, you know, a given lot? I mean, because that's what the state law is.'",
        "'speaker_4': 'And I would just like to see the practical implications as a member of the community on, you know, what our constraints are because there's these two immovable forces, right? There's our charter which says what we have to do in black and white.'",
        "'speaker_4': 'And then we have, you know, the arena requirements. So, you know, and I don't put a lot of faith in, you know, the state allowing us to push back. I work for the state, you know, I know where they're coming from.'",
        "'speaker_4': 'The video put out a report in 2015. Talk about why do we have an issue. Randi, you mentioned, you know, supply hasn't kept up with demand and they listed the reasons. And number one, community resistance to new housing.'",
        "'speaker_4': 'Now, if that isn't one thing that I've heard in the last six years, that's that's pretty much a lot of it. You know, the use of Sequoia to kind of delay projects, you know, local financing structures that incentivize commercial versus versus residential.'",
        "'speaker_4': 'And, you know, we have this problem here, too, you know, limited amount of vacant land. So it'll be interesting to see because we can't go this way anymore and nobody wants to go this way. But, you know, it'll be interesting to see.'",
        "'speaker_4': 'So I just want to make one point. Before I turn it over to other people. I mean, there was a lot of discussion. Today about the voters and respecting the will of the voters. And I get that. I mean, I understand that.'",
        "'speaker_4': 'But, you know, 12 years ago in our charter, we reaffirmed what's in our charter. 12 years ago, the voters of the state of California fairly overwhelmingly added something to the Constitution of the state of California. Section 7.5, Article one.'",
        "'speaker_4': 'And it basically read, quote, Only marriage between a man and a woman is valid or recognized in California, end quote. The voters did that. And if the voters got their way, I wouldn't be able to be married today.'",
        "'speaker_4': 'So just because the voters put it in there doesn't make it right. And to me, the fight for housing equity, the fight for housing justice is not over. It wasn't over in November. Just like Prop eight, the voters decided it was okay to discriminate.'",
        "'speaker_4': 'The courts came in and said, Sorry, you can't do that. And now everyone has the right to marry. So before we start harping on and going back to and basically holding, waving that flag that the voters said we should do it, the voters said, should we do it?'",
        "'speaker_4': 'You know, the voters are always right. I respect them. I respect the decision they made. I will walk away in two weeks. But, you know, the arc of of justice bends towards the arc of the moral universe, bends toward justice.'",
        "'speaker_4': 'Right. So eventually we will have housing equity. Eventually, we will provide the housing that we need to meet our demand. And it may not be this year. It may not be next year. But, you know, I'm in for the long haul and I'm proud to be on this council that is move the ball forward.'",
        "'speaker_4': 'And that's all I got to say on that.'",
        "'speaker_1': 'Thank you. Council member Odie, who would like to go next? Vice Mayor next week.'",
        "'speaker_5': 'So I have a couple of questions and then a few comments. I just wanted to just kind of clarify my understanding of I don't remember Vandy or Randy and I'm going to call you Andy and you can decide what I'm talking to handIer in Andrew or Randy.'",
        "'speaker_5': 'Andrew, this allocation, you said doesn't solve the the housing crisis. Not only does it. I just want to confirm my understanding is it doesn't it doesn't catch us up to where we need to be. Right. Like this is the first year, my understanding this is the first tranche of many very large tranches of housing allocations that are'",
        "'speaker_5': 'expected over the next multiple housing elements to catch us up to a place as a state. Is that fair?'",
        "'speaker_4': 'I think that's that's probably a fair judgment of the future then other judgments of the future. Yes. Although it's always hard to predict your.'",
        "'speaker_5': 'Okay. But even if we were to if the economy collapses, we still have a housing crisis and a need for housing. Even if jobs go away. We still have pushed people out in Detroit to live in Tracy and commute in and we should be having those folks live here with us.'",
        "'speaker_5': 'I just wanted to I think you kind of answered this, but again, just clarify what I heard, which is there is no state requirement for a city to provide a 30 unit per acre multifamily housing overlay. That's a discretionary action that a city can take.'",
        "'speaker_5': 'But there are other actions we can take to meet that same need for affordable housing. Expensive actions.'",
        "'speaker_4': 'That's right. It's one option that the cities in its discretion can use, and it's provided under state law. To illustrate how you're accommodating the lower income categories.'",
        "'speaker_5': 'And stipulating agree agreeing with your concept that they're not going to believe that just building housing is going to be affordable in the Bay Area. We're not going to make that case. That would not be a good use.'",
        "'speaker_5': 'But the other one, which is we could fund the affordable housing, which is where the 30 units the acre issue comes in, is not a violation of our charter.'",
        "'speaker_4': 'No, not that I know of. No. The charter says no. Multi-family housing? No, no. Residential tenancies over 21 years. S.A. State says if you allow multifamily and you allow 30 units, C.A. will will give you a pass on that.'",
        "'speaker_5': 'Yes. So we can meet the housing element without charter violations. And then the last question is, because we're going to thank you. You've done a great job of identifying at least the low hanging fruit. 2100 units to the acre.'",
        "'speaker_5': 'Even if we put a 30 unit to the acre multifamily overlay that still gets us somewhere near 3000 and still almost 2000 units short of our current allocation. If we start, you know, let's say we drop a 30 acre down Park Street, we're not going to be able to say that all those lots on Park Street are'",
        "'speaker_5': 'available. We might be able to say 5% of them are or something like that. And so we could drop multifamily overlays over the entire city and make that case. But but I guess my point is, like, we're not going to be we are going to be able to perfectly spot zoning unless we have actual available land.'",
        "'speaker_5': 'And the next step is going to be that we're going to have to serve zoning in very wide swaths of the island, large entire areas of residential. If we wanted to use the multifamily overlay to try to meet of 30 units the acre.'",
        "'speaker_4': 'Yeah. I think there's there's there's really two we have to be thinking about sort of two goalposts. One is the immediate one in 18 months, which is we need to get a housing element that will say, you know what, if you cross the finish line, good job, you've shown us available sites.'",
        "'speaker_4': 'And I think if you think about Park Street like rezoning Park Street for multifamily housing with multifamily overlay, great. We could do that. The question is, what is the realistic capacity? That's the second question. That city. Well, well, what's a real estate capacity?'",
        "'speaker_4': 'Because it looks fully developed to us. Like, where do you think this new housing is going to go? Why would why would truck tuckers ice cream go away? Like, what makes you think somebody's going to build housing there?'",
        "'speaker_4': 'So I think we would have to combine it with some type of legwork that we do with the Business Association and all their members, like who on this corridor is interested in building housing over the next eight years.'",
        "'speaker_4': 'Because we would like you to step up and you know, can we tell KD that your site might be available? You know, CVS is one that jumps to mind in my mind right across from city hall. That's an ideal site.'",
        "'speaker_4': 'We have some sites down on Lower Park Street, so we might have to rezone, but it still is to our benefit to rezone the whole corridor, even if. To cover properties that are not identified is available. So we tell a CD like we think we have available, we're doing the whole quarter, but we think we can get'",
        "'speaker_4': '200 units over the next eight years because these five property owners step forward. But remember, we have to we have to report to the state every year. And this is the other part of state law that's also tightened up like every year we have to report.'",
        "'speaker_4': 'So we're constantly getting adjusted and or being are tracking our progress. So if somebody comes along after the housing element is adopted and builds an extra 20 units on a site, we didn't imagine because we put an EMF.'",
        "'speaker_2': 'Overlay.'",
        "'speaker_4': 'That's going to that's going to help us in the housing element process, not necessarily at certification, but two years later. And that's going to be very important. So the idea of doing zones with EMF overlay, even if we don't, you know, as opposed to just like we did eight years ago where, you know, Ron good Toyota just'",
        "'speaker_4': 'a teeny little site, got an MF overlay for 410 units like that. We may not take that approach. Right.'",
        "'speaker_5': 'And so if we can't find enough land to put the MF overlay over and get to 4900, you know, once we've gone to an MF overlay of 30 units, we're violating the charter. There's no reason we couldn't look at just doing an MF overlay of 60 or 120 units in key places, because we might decide that actually'",
        "'speaker_5': ', you know, we've heard traffic is a major concern and it would be better to build housing on park and park and Webster Street and not build a whole bunch of single family ranch homes across all of the rest of Alameda Point, which is probably what we would have to do to be compliant with our charter and build'",
        "'speaker_5': 'the housing we have to build.'",
        "'speaker_4': 'I, I agree. I think, you know, we've been sort of in thinking about this and the shopping centers are a great example like. It would be useful to sort of just talk about the shopping centers as a group.'",
        "'speaker_4': 'Like what shopping centers do we want to sort of target? Let's pick two or three, then let's go talk to this property and then let's talk about them. How many units do you think you could actually do if you wanted to do it?'",
        "'speaker_4': 'Let's say it's a ten acre site and they say, you know, I could do a thousand units. All right. Well, that's 100 units, the acre. We need a thousand units on your site, so we'll put an MF overlay on your site that says your zoning is 100 units the acre because we're trying to get 1000 units on'",
        "'speaker_4': 'your ten acres. That's our goal. That's what we want to do. So, you know, 30 acres a unit, 30 units, the acre versus 100 units. The acre is in my book just as much of a violation. I mean, if you're.'",
        "'speaker_4': 'The charter says 21, right? 30 or 100. They're both not 21.'",
        "'speaker_5': 'And now we get to 4900 at that point. Probably does.'",
        "'speaker_4': 'Well, I think yeah. I mean, I think. Do you have the land to get to 4100? Absolutely. The question is, which land do you want to use and how dense do you want to to to build on each of those properties?'",
        "'speaker_4': 'Right.'",
        "'speaker_5': 'Okay. So so thank you for that. That was all very helpful. So for me, I just want to first off, just appreciate the the very concise and useful presentation on a very complex issue, probably one of the best presentations in terms of just concision and also really walking everybody through through how this all happens.'",
        "'speaker_5': 'Yeah, I think for me, there's two issues that we're talking about tonight. One is related to Rina and in the housing allocation, you know, and we've received a lot of letters asking why didn't we challenge our allocation to a month ago?'",
        "'speaker_5': 'And the answer is because there's no allocation to challenge at this point in time. We said we liked the methodology. We didn't necessarily say we liked the or we approved of the actual number. And, you know, for me, I think that, you know, I am I continue to be open to looking at how we might be able'",
        "'speaker_5': 'to make a case, as you laid out, that I think is defensible, whether it may not be accepted but defensible, and also honors the equity issues and things that we highlighted as a priority for housing here. And so, you know, I think as we I greatly appreciated Steph's kind of for meetings kind of over the next six'",
        "'speaker_5': 'months timeline that really does allow for this conversation to happen. And I think that we should be looking at seems from your presentation in that under Article 26, we can probably find a way to make to to accommodate 3200 units if we build on every single possible generally available form of piece of land.'",
        "'speaker_5': 'And you know, I personally, I would have liked to have seen parks and other things in some of those areas. But, you know, if we're going to honor the charter and whatnot the way that we have sworn to do, I think we need to at least look at what that looks like and that we should at least'",
        "'speaker_5': 'be open to considering that as a path for how we kind of challenge the numbers and ask for for reconsiders our appeal the numbers and ask for reconsideration. Now, I remember the original Alameda Point plan that had 3220 2200 homes or 1800 homes, a camera.'",
        "'speaker_5': 'Exactly how many was it? Had a single row of single family homes between the between the the hangars in order to be in measure a compliant housing plan. It was from a from a design standpoint, terrible. I wouldn't want to live in that neighborhood.'",
        "'speaker_5': 'But, you know, if that's the rules we follow, those are the fold, the rules we've been given. I think the second question we have is how do we certify a housing element? Because that's where we get into we have not used the multifamily overlay to accommodate a huge number of units.'",
        "'speaker_5': 'We've used it in the past because it was a way to accommodate affordable housing units. And I think that we, you know, after this vote and whatnot, it is really important for us to at least remain open to a path forward that doesn't rely on the multifamily overlay and relies on what I would say is the good'",
        "'speaker_5': 'faith arguments that we need to be prioritizing and building affordable housing. And since funding is not, that is the issue with that I think that a way for us to remain very consistent and compliant with our charter and also meet a housing element law, at least from an affordable housing standpoint, is rather than using a multifamily overlay'",
        "'speaker_5': ', which is challenging to begin with and we are using inclusionary law that doesn't as Mr. Jordan pointed out, we're going to build a lot of market rate housing in our affordable housing is going to lag behind. We should be looking at what it would take and to fund that affordable housing and make that case, I think that'",
        "'speaker_5': 'should be a part of the conversation. Again, I think, you know, I'm not driving a specific outcome, but I do think these are things we need to be talking with our community about as we move forward with deciding that.'",
        "'speaker_5': 'And then, yeah, you know, lastly, I really appreciated the idea of having the conversation considering the range. I think the bottom of that range is 3200 because that's a measure a compliant and consistent with the staff presentation up to probably the 5000.'",
        "'speaker_5': 'And you know, for right now, I think instead of making a decision, I think we should remain open to how we can have that conversation with our community, with the new council that's coming in in two weeks, etc..'",
        "'speaker_5': 'But anyway, I just wanted to thank everybody for the, for their time that that presentation was fabulous. I'm really excited to have this conversation. I think, you know, the staff report does a great job of laying out both those paths to the arena path and and allocations, but also the how to how are we going to get'",
        "'speaker_5': 'to our housing element? You know, I am doubtful that after everything I've been through on the council about charter violations and whatever else, that I'm going to be quick to jump into violating the charter in terms of how we meet our housing element arena allocations.'",
        "'speaker_5': 'But I think we're going to need to get closer to what those numbers are before I'm going to be able to make a decision on that. So thank you very much.'",
        "'speaker_1': 'Thank you very much. And that's why Councilmember Dissected. You want to go next?'",
        "'speaker_6': 'Right. Well, thank you. Leading up to November three, the residents were basically faced with a choice in Measure Z. A yes. On Measure Z meant an abandonment of the status quo regulating residential development in Alameda. On the other hand, no one measures the zimet keeping the status quo when it comes to residential development.'",
        "'speaker_6': 'And on November three, residents voted overwhelmingly. Frankly, in no uncertain terms for maintaining the status quo. At the heart of the status quo governing residential development is Alameda is growth control tool of Article 26 of the City Charter, which was adopted in 1973.'",
        "'speaker_6': 'Modified in 1991. And reaffirmed in the year 2020. At the heart of the status quo is also. To work arounds that allow in limited circumstances the types of multi-family housing supposedly not allowed by Article 26. These two workarounds, as we've discussed tonight, are the density bonus law, which we have on our on our books and the multifamily'",
        "'speaker_6': 'housing law overlay law, which we also have on our local books. Since 2012 we have in limited. Targeted and very strategic areas built multi-family housing, basically apartments and condos using the density bonus law and the multifamily housing overlay law.'",
        "'speaker_6': 'All of us on city council here have in one way or another supported this housing, these housing since 2012, even if they are counter to Article 26. The way that I see it is let us continue to fight.'",
        "'speaker_6': 'To keep our air bag housing numbers as low as possible as befitting an island like Alameda. But let us also build respecting the status quo of Article 26 growth control and a limited, targeted and strategic use of the density bonus law and the multi-family housing overlay law.'",
        "'speaker_6': 'In rejecting measure a the people in no uncertain terms said the city council must keep to the status quo approach when dealing with residential development. That approach that we've employed since 2012, we should fulfill the will of the voters.'",
        "'speaker_6': 'We should also work closely with the voters. We should take seriously the concerns raised by persons who were involved in the No Manzi efforts, as well as those who voted for them. I have no doubt that if their concerns are not seriously taken, the housing element will probably be put to a vote of the people.'",
        "'speaker_6': 'We can do that. So. People are concerned about a multi-family overlay on. Horror of landing? Well, there's not going to be a multi-family overlay on horrible landing. There's not going to be a multi-family overlay on the Horror Bay sports facility.'",
        "'speaker_6': 'And there's not going to be. There might be a multifamily. There's not going to be a multifamily overlay on South Shore Center. Those areas just are not strategic as they do not. They are not conducive to transit planning.'",
        "'speaker_6': 'So if we're gonna do multifamily overlay or density bonus in conjunction with Article 26, I think the people will definitely be looking for it to be continue to be used in a limited, targeted, strategic manner. If we have to bring the housing element to a vote of the people, well, then.'",
        "'speaker_6': 'Then, you know, we'll cross that bridge if we have to. But right now, I think in the aftermath of November three, 2020, I think the people have clearly spoken and they are encouraging you to work with the residents of Alameda in keeping our housing numbers as low as possible and continue to figure out meeting our housing needs'",
        "'speaker_6': 'within the status quo approach that we've used since 2012. Thanks.'",
        "'speaker_1': 'Thank you. And before I calling anyone and I'm not going to go back to people who have spoken before until every one of the councils had a chance to speak. But we have to do some housekeeping because it's 1055.'",
        "'speaker_1': 'So if we're going to go past 11 and we do need to. You can in there. Yes, Madam.'",
        "'speaker_2': 'Mayor, I'd like to make a motion to go to midnight. Keep it within this day as we like to do. And I'm fine. I know that we have one regular agenda item left and then the stop waste update.'",
        "'speaker_2': 'That item item nine has been moved.'",
        "'speaker_1': 'We do okay with anything. Let's end before midnight of my like it's 1155. Could we vote to go to 12 5510 1155 instead we practically vote to go to the second as it begins over. Bilbo's seconded by Councilor Woodside.'",
        "'speaker_1': 'Madam Cliff, May we have a roll call vote?'",
        "'speaker_0': 'This council member dissolved? Yes, not quite. Yes. Odie.'",
        "'speaker_4': 'Hi.'",
        "'speaker_0': 'Vella. Yes, Mayor. As the Ashcraft. Yes, that carries by five.'",
        "'speaker_1': 'Thanks, everybody. Did you finish? I guess he did because he left it. So, Councilmember Bella, I'm going to call on you next.'",
        "'speaker_2': 'Thanks, Madam Mayor. There's a lot of talk about these mandates from the voters, and I think I'm going to respectfully disagree in part. There were a lot of measures on this ballot. And one thing that we know is that people tend to vote no when they don't understand or when they're overwhelmed with kind of what's before them'",
        "'speaker_2': '. So I don't necessarily see this kind of mandate per say, existing. I also don't know how that reconciles with the fact that I was the top vote getter in the history of the city and and very pro housing and have been unabashedly so.'",
        "'speaker_2': 'And so I you know, what I do think is very clear, based off of the communications that we've received from from what I've heard from public speakers and what I've heard at various forums is that there's a lot of confusion around what people thought they were voting on.'",
        "'speaker_2': 'So I do hear that we a couple of things. One, that people don't really understand the numbers. They don't understand the housing element. They don't really understand what the charter allows us to do or not to do. They don't understand how different developments have come about or the density, how we've gotten the density, where we've gotten it'",
        "'speaker_2': '. They don't understand how affordable housing is funded. They don't understand what the process is when we actually go through approving various projects. So I think that that that what's very clear to me is that we do need to have these informational sessions.'",
        "'speaker_2': 'We do need to have a number of meetings. And we do need to bring people along and have these conversations. What I don't want to do is to talk to the ideologues who are going to create a scenario that's essentially on I just infeasible.'",
        "'speaker_2': 'And I think that there's a few issues that have been presented that I that I am concerned about. So I do think we should have a conversation, for instance, about how does affordable housing get funded. And if we if if we want to to say here, we're going to do 100% affordable, what sort of bond would we'",
        "'speaker_2': 'have to do or measure? Would we would we have to do and fund locally? And how would we go about doing that? And what is the public support for that? That might require a little polling, for instance. I think we need to have a conversation of if we follow the charter.'",
        "'speaker_2': 'And I want to be very clear that I do not intend, by any stretch of the imagination to violate the charter. But but if we follow the charter in the purest sense, what does that give us? What does the where is the density?'",
        "'speaker_2': 'What does that map look like? And if that means that we lose commercial and we lose park and we lose these other things, what does that mean? Because I think that it's very disingenuous to say, where's all of our job creation?'",
        "'speaker_2': 'But, hey, you can't have housing density. You can't do these other things. We have to talk about these things not in silos, but as they all come together and. And frankly saying that we're unique because we're an island.'",
        "'speaker_2': 'Manhattan is an island. Please, people, let's stop talking about we're unique because we're an island. San Francisco is a peninsula. They have bridge access and limitations as well. I think we are looking at safety. That is one element.'",
        "'speaker_2': 'We're looking at transit. We're looking at the environment. We're looking at a number of different things. But we have to look at them all together as a composite. This isn't a situation where we get to be climate deniers or say that science doesn't matter.'",
        "'speaker_2': 'We have to look at what we know to be true, which is that the population has grown, that the demand is here, and that regardless of what happens, the fact that we have been planning essentially through ballot box has gotten us into the hole that we are in.'",
        "'speaker_2': 'We are here because we have voted on these different things to stop. And finally, I've heard a lot about we need to represent our needs and we need to ask for these numbers to be lower. I don't just think it's about finding a way, as Andrew said, to justify the reduction.'",
        "'speaker_2': 'I think it's also about thinking about the unintended consequences. I am very concerned of this NIMBYism that is saying I am such a NIMBY that I don't want a few hundred units in my backyard. Go ahead and put them in my driveway, surround my property, put them at my front door so that I can even get out'",
        "'speaker_2': 'of my house. Because these units are not leaving the region. We are we are talking about a composite of thousands of units. Then going along the 880 corridor along in Emeryville, in Oakland, in Newark, in places that we all traverse and that we all go to.'",
        "'speaker_2': 'And there are several members of this council who work off island or who have to leave the island for work. You're talking about impacting that sort of transit, impacting those emissions. I mean, there's there's huge ripple effects there.'",
        "'speaker_2': 'So it's not a zero sum game. Yes. For Alameda, but it does create these other problems. So we can't argue regional traffic and transit issues and then say, hey, just it's just a few units because it's not it's regionally changing where these these units go and there's a huge impact to us.'",
        "'speaker_2': 'So I thank you for the presentation tonight. I look forward to continuing this conversation and trying to bring people along as we have it.'",
        "'speaker_1': 'Thank you, Councilmember Avila. I'm very well said. Council. Councilmember o.T? Yes.'",
        "'speaker_4': 'Thank you, Senator. I'll be brief. I won't use all my 3 minutes. But, you know, I think it's one thing to kind of look after an election and kind of. Have your own impression on what it means, you know, and talk about, you know, where you thought people voted and why they voted.'",
        "'speaker_4': 'But it's another thing to kind of restate the theme of the election and, you know. That we were voting on something and it was clear because it was it. I mean, I pulled up the the ballot arguments for and against.'",
        "'speaker_4': 'I didn't see anything that basically said, if you vote no, you're going to keep the status quo. And if you vote yes, it means you want to get rid of the status quo. In fact, the argument against said if it's repealed, the council by a simple majority of three votes can amend residential zoning to allow city wide'",
        "'speaker_4': 'home demolitions, increased density, greater heights and less parking, resulting in massive overdevelopment and terrible traffic. Well, that's not the status quo. Sorry. And if there's any attempt to kind of twist why people voted, you know, that's fine. But if there's an attempt to rewrite history and say, what were the arguments that were made?'",
        "'speaker_4': 'Because I got every single flier and I didn't see it wasn't an argument about status quo versus not status quo. It was an argument about keeping Measure A in the charter and not keeping measure. So one last point.'",
        "'speaker_4': 'I mean, look at the charter. I mean, it says there should be no multiple dwelling units and there are some exceptions. It doesn't say, you know, it it says the maximum density is one unit for 2000 square feet and then it list a few exceptions.'",
        "'speaker_4': 'And in those exceptions, it doesn't say unless council decides they want to pass legislation to allow multi-family overlay in violation of this charter. It doesn't say that. So I think we proceed at our own risk. If we decide or you decide in the next 18 months to pass an ordinance that basically undermines the will of the voters'",
        "'speaker_4': 'reaffirming a part of the statue that's black and white like less than two years later. I mean, basically I just pulled a random section out of the charter, three dash ten. No real property of the city shall be leased for a period in excess of one year or so, except upon the affirmative vote of four members of'"
    ],
    "Introduction of Ordinance Authorizing the City Manager to Execute Lease Amendments for Rent Relief Program with Alameda Point Beverage Group, Auctions By the Bay, Building 43 & Associates, Faction Brewing, Group Delphi, Proximo Spirits, Saildrone and USS Hornet Air & Space Museum via the Non-Profit Spirits Alley Program for Rent Relief in Response to the Covid-19 Pandemic. (Community Development 858)": [
        "'speaker_4': 'the City Council. We couldn't pass an ordinance that basically came up with some exceptions on that. That's what's in the charter. And 26 dash, 126 dash to 20 6-3 are in the charter. And you may want to rewrite why you thought people voted for it.'",
        "'speaker_4': 'You didn't want to, you know, have revisionist history and what the arguments were. But this is what you stuck with. So. That's just the way it is.'",
        "'speaker_1': 'You did?'",
        "'speaker_4': 'Oh, yes. I'm sorry.'",
        "'speaker_1': 'Okay. So thank you, everybody. And thank you, all of you. Randy. So I cut him loose, thanked him for doing a great job. Andrew Thomas. Likewise. Thank you, everyone. Our public speakers and council for your comments. I would just listen to my colleague, Councilmember Vella, who sits with me on the Statewide Policy Committee for the League of'",
        "'speaker_1': 'California Cities on Housing, Community and Economic Development. And so maybe that's why we're very aligned in our thinking. But I also would have to say that this past November, the vote and I mean from the federal, state, county, local levels, there were a lot of mixed results.'",
        "'speaker_1': 'I mean, there just were. So what I am more than willing to concede is that I think Measure C was a very confusing issue. And it is true that what people don't understand, they tend to vote no on.'",
        "'speaker_1': 'And I think now we have an opportunity to do more community education and outreach and the kind of collaboration that I think will actually be helpful. One of the things that Mr. Thomas does really well is to demonstrate what does it look like?'",
        "'speaker_1': 'Because it's just so abstract. When you think of so many units for Adra, what does that look like? But when you actually see actual photographs of actual real units, dwellings, historic buildings in our city, it's it's a lot less intimidating than threatening it.'",
        "'speaker_1': 'And even some of it, I think would be welcomed. But I do think we need to have this series of community conversations that will help educate the public and to bring the community along. Will we get 100% sitting together singing Kumbaya?'",
        "'speaker_1': 'Probably not. But will we have a better understanding of where we fit into this housing crisis and what we can do to help alleviate it? I hope so. I think it's possible. So now we have time, as was laid out in the staff report, if these public forums going forward and I really want to make sure that'",
        "'speaker_1': 'it can be as widespread and to get the word out, we'll think of different ways to to get the word and the messaging out to people kind of meet them where they are, because this is just a very important issue.'",
        "'speaker_1': 'And the thing that I fall back on is not only do we we need to to take seriously our obligation to help house people. We do need to be compliant with law, with state law. But these are not mutually exclusive propositions.'",
        "'speaker_1': 'I think there's a lot of possibilities. So I look forward to meeting with the community going forward. As has been mentioned, a lot of this will take place in the new year. So with that, let's see, we are and we were asked to review and comment on the Big Housing Methodologies Committee's proposed methodology and staff proposed process'",
        "'speaker_1': 'and being scheduled to update the city's general plan housing element for 2023 to 2031. So again, huge thanks to everyone for contributing to this very important effort, which is to be continued. Look for some public forums coming coming up in the new year.'",
        "'speaker_1': 'So thank you all with that is going to close this item and we need to move hurriedly on to item six be madam clerk for you introduce that item for us, please.'",
        "'speaker_0': 'Introduction of Ordinance Authorizing the City Manager to execute lease amendments for Rent Relief Program with Alameda Point Beverage Group Actions by the Bay Building 43 An Associate Faction Brewing Group Delphi PROXIMO Spirits Dahlgren Drone and USS Hornet Air and Space Museum via the nonprofit Spirits Alley program for rent relief in response to the COVID 19 pandemic.'",
        "'speaker_1': 'Thank you. And who's presenting on this with?'",
        "'speaker_0': 'We have.'",
        "'speaker_1': 'It was. There she is. Yes, I see. Miss Butler and Miss Mercado. Yeah.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'All right. Are you there, Mr.? Kind of.'",
        "'speaker_0': 'We're getting.'",
        "'speaker_2': 'Her. We're looking.'",
        "'speaker_1': 'Really? Give her. It is falling asleep. It's getting late. Here is Lois Butler. Hi. We're looking for Miss Mercado, but we're confident we'll find her.'",
        "'speaker_5': 'I'll see if I can locate her. Oh, here she comes.'",
        "'speaker_0': 'Yes, she's here.'",
        "'speaker_1': 'Yes, I see your name. Hi. Good evening. How are you? Sorry to keep you up past curfew. All right. So if you're ready to go, we're ready to have you. And we just have to. 1155. You need to take all the money.'",
        "'speaker_1': 'So why don't you give us a quick overview?'",
        "'speaker_2': 'Okay. Can you guys hear me?'",
        "'speaker_1': 'Yeah, just.'",
        "'speaker_2': 'Okay. It seems like a lot of people are. Hey. So I will try to keep this brief over the. I. Can you not hear me?'",
        "'speaker_1': 'No, I can hear you. I just want to mute myself. And all of a sudden I couldn't hear you. But keep talking. Okay. Okay.'",
        "'speaker_2': 'I'm. I'm here.'",
        "'speaker_1': 'Now. I can see you and hear you.'",
        "'speaker_2': 'Okay. So I will try to keep this brief. Hi.'",
        "'speaker_0': 'Is there is your livestream still on tonight?'",
        "'speaker_2': 'Perhaps it is. I'll turn it off.'",
        "'speaker_0': 'That's. They're having a problem with, I think. Yeah. There's a delay with it. So oh yeah, the livestream is like 30 seconds later. So it's very like talking over.'",
        "'speaker_2': 'Okay, I'm here. Is it better? Yes. Yes. Okay. Because I was caught in that live stream. Okay. So I'll try to keep this brief. Thank you, Mayor and city council members. I'm Ninette Marcano in the Community Development Department.'",
        "'speaker_2': 'Over the last ten months, this council has been grappling with what to do and how to bring relief to our tenants and various buildings throughout the city. We have done a 90 day deferral initially, which grew into the loan conversion program that we we approved and then refined on October 6th and further refined tonight in the on'",
        "'speaker_2': 'the consent calendar. And just briefly, that is not the program we're discussing tonight, just employee. And at that end, in that program, right now, we have about two applicants. There's one pending. And I'll just tell you, it's Saint George Spirits and Rockwall Winery so that it does not include those in the program we're discussing tonight.'",
        "'speaker_2': 'That program, just briefly, is the program where we negotiate a six. We negotiate benchmarks that would result in an abatement of rent for the tenants. The maximum of rent abatement under the loan conversion program is six months. And in October, the council allocated $1.5 million to support that program.'",
        "'speaker_2': 'I don't think we're going to come anywhere near that because a couple of the people who are interested in the loan conversion program have now said they would like to be a part of the new program that the council approved in October, which I call the nine three program.'",
        "'speaker_2': 'But it actually should be called 933 because it defers nine months of rent. It will be paid back over a three year period. And and I say the extra three because up to three months can be abated if the tenant pays back early.'",
        "'speaker_2': 'So. It's a933 program. That's what we're discussing tonight. So the council approved that program in October and said, come back to us and tell us what it's going to look like and what the numbers might look like. And so tonight, we have attached the agreement that we would enter into with each of the tenants that have been'",
        "'speaker_2': 'identified on this list. I want to tell you that they're the totals. It might be a little confusing because the bottom of the I have nonprofit spirits, Ali total and the loan conversion total because what I'm proposing to do is end in this 933 program, the council allocated up to $400,000 because you might recall it at that'",
        "'speaker_2': 'time. I did the quick math of, what, three months if all of those tenants could total and it was about $400,000. And then the loan conversion program, as I said earlier, the council allocated $1.5 million and I'm recommending that we use that 1.5 million for even the tenants who are applying for this 933 program because they were'",
        "'speaker_2': 'not I mean, they may they they go outside of the nonprofit Spirit's Alley purview. And so since we had already allocated it for this other program, we may as well use it. And it's going to be far less than the 1.5, as you'll see.'",
        "'speaker_2': 'Okay. With that said, I do I would like to ask the council to consider adding two more tenants to this list. So when you when you consider the motion that you would also consider adding these tenants. One is Pacific Pinball Museum, which is a nonprofit, and they're a three month total.'",
        "'speaker_2': 'If they were to do all three miles, it would be 34,500. And then the other one is Wonky Kitchen, which you recall is, um, Spirit's Alley. It's the commercial kitchen, which originally was the dehydrated kale, which is turned into more of a commercial kitchen for for food trucks and sort of an A they want to create sort'",
        "'speaker_2': 'of a patio at some point with different food trucks, which would be a perfect amenity for us along Spirit's Alley when the beautiful day comes when we can congregate and be together again. So I think we would like to add those two to this.'",
        "'speaker_2': 'I have added the total and in the bottom line for you so that the nonprofit Spirits Alley total would be 149 632, which is out of the $400,000 that you guys have allocated before, 160 266 would be taken out of the $1.5 million that you guys allocated for the loan conversion program, because those were the applicants who'",
        "'speaker_2': 'were originally loan conversion applicants. So you'll you know, that's why it's it's divided that way. So to complete the presentation, I would just like to go over the list of the tenants so that you would understand who's who.'",
        "'speaker_2': 'Made a point beverage group which you might know as bricks that the spirits alis tenant auctions by the day. They were a loan conversion applicant that now wants to go for the 933 program building 43 and associates that is Spirits Ali Tenant Faction Brewing Spirits Ali group Delphi.'",
        "'speaker_2': 'This was a loan conversion applicant and but and as a reminder, this is a company that completely changed their business model to adjust to the COVID, the COVID pandemic. So formally, they made the conventions, booths and spaces, and now they manufacture pre-fab things for construction of multifamily housing units.'",
        "'speaker_2': 'And they've kind of kind of generated a new business making those things. So we're very proud of them. PROXIMO Spirits Again, A Spirits Alley Tenet Sale June an original loan conversion program applicant who wants to do the 933 and then again Pacific Pinball and.'",
        "'speaker_2': 'Wonky Kitchen. Those are the two that I would like to amend this staff report for.'",
        "'speaker_1': 'You also need to include the US as Hornet.'",
        "'speaker_2': 'Oh, I'm sorry I skipped them. Yes, the USS Hornet, which is a museum.'",
        "'speaker_1': 'And I see the city manager has his hand up and so. Mr. LEVITT.'",
        "'speaker_5': 'Yeah. Yes. I think because of the way the agenda is, I would recommend that the pinball museum and the wonky kitchen maybe would need to be on a future agenda.'",
        "'speaker_1': 'Okay. Yes, that's a very good point. Thank you. I see the city attorney looking very relieved and thank you. Yes, good point. Well, you you were to bring that back.'",
        "'speaker_2': 'Yeah, it'll be the exact same staff report, but with just the new names in it. Sure. Okay.'",
        "'speaker_1': 'So did I see council hands shooting up there? I think it said Councilor or you Councilor Vela Councilor voted. Go ahead.'",
        "'speaker_4': 'I just had a quick question. I mean, yeah. Thanks for this, by the way. I think it's exactly what we asked for, the wonky kitchen, even though we're not voting on that. What was the amount.'",
        "'speaker_2': 'For three months of wonky kitchen is 7700.'",
        "'speaker_1': 'Wait, stop, stop.'",
        "'speaker_2': 'We don't talk about it.'",
        "'speaker_1': 'This is not agenda as we cannot discuss it, it will come back to us. Did you have anything that was on the agenda to ask the council member?'",
        "'speaker_4': 'Well, it just said that I was sorry.'",
        "'speaker_1': 'Either we are not going to talk about items that are on agenda.'",
        "'speaker_2': 'All right. All right. Sorry about that.'",
        "'speaker_1': 'Okay, Counselor.'",
        "'speaker_4': 'We should have stopped that earlier then.'",
        "'speaker_1': 'You're right. And stopping it now, Councilor Rebello?'",
        "'speaker_2': 'Yeah. I was just going to ask about whether or not we should be getting into a couple of the things that were discussed. But with with it, yes, but I did have a question. If you could just reiterate in terms of what's within the agenda item, what the total she's asking for or it is excuse me for'",
        "'speaker_2': 'I time as it's in the staff report. Right. It's for the nonprofit spirits Ali Total. It's $114,000, 114 132 and that's out of the 400,000 that you guys set aside. And then 460 266 and that's out of the $1.5 million that you set aside for the loan conversion program.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'I have a question and I actually emailed this to staff earlier today. I would like to add a clause to the agreement, to the ordinance, and to the effect that if a recipient of these funds is found to be in violation of an order issued by the county public health officer and I would say found by a'",
        "'speaker_1': 'code compliance officer, a police officer or a member of city staff, then they should forfeit any benefits received under this program because there have been instances in the not too distant future when people we gave them an inch and they took a mile.'",
        "'speaker_1': 'And when it comes to COVID 19 and holding risky events and exposing the public and prolonging this pandemic and increasing our COVID numbers, I am really no nonsense. So you do not you should not benefit from our largesse as a city in this generosity and at the same time be flagrantly violating a public health officer rules.'",
        "'speaker_1': 'So I would like that. And I checked with the city attorney's office who said that was doable, but that would be my request to council that we incorporate a language to this effect into the agreement. I saw that Councilmember De Soto hand Councilor Brady said.'",
        "'speaker_6': 'Just to clarify in question on that issue that you just raised. Do you mean for this to be going forward, if you're found in violation of something after this date, then you. Right. Okay.'",
        "'speaker_1': 'Right, right, right. Right. If you before we approve this tonight, let's assume we're going to approve it and go forward. People get the the these funds and then they decide to hold some large gathering, something that's in violation of the public health officer.'",
        "'speaker_1': 'And we've had a couple of instances, and I just I don't think we can afford to reward that kind of behavior that just puts us at risk. And our businesses are just.'",
        "'speaker_2': 'Hanging on by.'",
        "'speaker_1': 'A thread. So we don't we just don't want to prolong this the situation any longer. So it's just, you know, do what you're supposed to do, basically. But if you don't that. And so we've got to clarify questions.'",
        "'speaker_1': 'I should ask the city, do we have any public speakers on this item?'",
        "'speaker_0': 'We do not have any speakers.'",
        "'speaker_1': 'And usually when I ask that question, then they arise. But anyway, Councilor Odie, did your hand go back up.'",
        "'speaker_4': 'Yeah, I'm just curious on I mean, maybe the city attorney can explain how that's permissible. You know, because I wonder if there's vested rights with the lease amendment that. Well, first of all, I didn't see it in the agenda or in the alternative.'",
        "'speaker_4': 'And second of all, I wonder if that's even something legally we could do, because there'd be vested rights and we'd be asking somebody to repay. Hypothetically, it's group Delphi 180,000 without due process. Councilmember Odie I yes, the Councilmember Odie.'",
        "'speaker_4': 'I do believe that the Council could make this requirement. It would be before they signed the lease lease amendment, it would be in the lease amendment and then the businesses would sign it as part of the lease amendment.'",
        "'speaker_3': 'We're not granting an entitlement.'",
        "'speaker_4': 'We're simply negotiating a contract. And in that process, before they sign the lease.'",
        "'speaker_3': 'We can put that in as one of the provisions.'",
        "'speaker_4': 'That essentially revokes this grace from the council, so to speak, for relief if they violate the law. And I do believe that that will withstand judicial review. At least amendment exhibit one for at least amendment doesn't include that.'",
        "'speaker_4': 'So, I mean, anyone that looked at the agenda wouldn't know that we were considering putting that in unless they were on at 11:25 p.m.? No. Councilmember that that is correct. So the council regularly makes modifications to ordinances.'",
        "'speaker_3': 'And items that are.'",
        "'speaker_4': 'Fairly well agendas. And this is simply a provisional change.'",
        "'speaker_3': 'It's not, for instance, adding.'",
        "'speaker_4': 'Entirely different parties. And so I do believe that that is within the council's province to do tonight. Okay. Well, I don't disagree with the intent. I'm not quite sure it's permissible, but I'm not going to let that get in the way of me approving this.'",
        "'speaker_1': 'All right. Any further questions, comments, motion calls we were given.'",
        "'speaker_2': 'I'd like to move approval with the amendment language that the mayor has asked for to be included in in whatever whatever lease amendment we issue. And I just want to thank staff for working on this. I think this is just it's helpful to hear who's taking advantage of the different options that we have.'",
        "'speaker_2': 'And I look forward to having the conversation about how we can continue to help our businesses. Thank you.'",
        "'speaker_1': 'Thank you. Yes, I can. Some of those things if you we have a motion to move a second second member, Odie has seconded any further discussion. We're not quite.'",
        "'speaker_5': 'Quite sure. I support the intent. I guess my question is, what is the actual language that we're inserting? Since we're proving it tonight.'",
        "'speaker_1': 'And the attorney, maybe.'",
        "'speaker_4': 'If I may, is. Yes. So, Councilmember Knox, why we will draft a language that's consistent with the council's direction, not dissimilar to other.'",
        "'speaker_5': 'Direction you've.'",
        "'speaker_4': 'Given us, so that we don't have to read in specific language tonight. Well, we think that the direction is fairly narrowly tailored, so we should be able to get your language. It will be something to the effect of if the lessee is found to be in violation of health officer orders by a law enforcement or a code'",
        "'speaker_4': 'enforcement officer, then this amendment shall be a no further forces act and so on and so forth. So we will certainly get that together and then you will see it in second reading.'",
        "'speaker_5': 'And my assumption is that that that any of those code enforcement violations that were found would be similar to the very few that have been found so far. We're not going to pull somebody's loan because somebody wasn't wearing one.'",
        "'speaker_5': 'One employee wasn't wearing a mask when somebody walked in.'",
        "'speaker_1': 'No, no.'",
        "'speaker_5': 'I just want to.'",
        "'speaker_1': 'I think.'",
        "'speaker_5': 'There's a level of severity where I think, yes, I agree completely with this, but I just want to ensure that whatever language doesn't lock us into if somebody gets caught, right. Somebody filed a complaint, gets caught and they're employed and have a mask on.'",
        "'speaker_5': 'And I just.'",
        "'speaker_1': 'Know.'",
        "'speaker_5': 'Whatever that language is needs to be clear that there's a there's a threshold level of violation that needs to be.'",
        "'speaker_1': 'Great.'",
        "'speaker_4': 'Right.'",
        "'speaker_1': 'Okay. Anything further? Okay. Madam, quickly, we have a roll cover, please.'",
        "'speaker_0': 'Let's remember de sag.'",
        "'speaker_6': 'Yes.'",
        "'speaker_0': 'Not quite. I oti.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Well, I may as the Ashcroft high carries my five eyes.'",
        "'speaker_1': 'Thank you. Thank you, Staff. Good. Good work on this important item. Sorry to keep you up so late.'",
        "'speaker_2': 'Thank you. Thank you. Good night.'"
    ],
    "Stopwaste October 2020 Topic Brief: Re:Source.  (Councilmember Oddie)  [Informational only]  [Not heard November 17, 2020]": [
        "'speaker_1': 'So we're hoping for a more productive year from the legislature this this coming year. COUNCILMEMBER Oh, yeah. To consult your handout.'",
        "'speaker_4': 'Yes. Thank you. Stop. Waste. Waste Management Authority meeting December 16th. I won't be there. My alternate. Just give her a heads up. 3:00 on Zoom. But the annual awards and I know there's an Alameda business being awarded, I'm not going to say because I don't know if it's public yet, but there will be an Alameda business honored'",
        "'speaker_4': 'and then if the city clerk can pull up the link related to the topic brief. And share her screen.'",
        "'speaker_1': 'Are we really in the ten? Yeah.'",
        "'speaker_4': 'Yeah. Well.'",
        "'speaker_1': 'It's okay.'",
        "'speaker_4': 'So, I mean, I think we. I talked about this. It's on the topic. Great topic. Um, it's resource that boys dot storage. So if you are not sure what to do with something because it may be different in Alameda versus Hayward or Oakland or whatever.'",
        "'speaker_4': 'Like, say, for example, you get your ugly produce with your a carton and seven of your eggs are broken. You can type in egg. And then you see, oh, egg cartons, paper, soil. You can pick that and then type in your zip code, which will just use nine four, five one for this and you hit search and'",
        "'speaker_4': 'lo and behold, it tells you to put it in your green bin.'",
        "'speaker_1': 'I was going to say.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'So.'",
        "'speaker_4': 'You know, you can tell if you go back up to egg and, you know, you type in egg again and it's clean.'",
        "'speaker_2': 'Louis.'",
        "'speaker_4': 'It is blue. That's right. So not everyone may know as much as the mayor does about what to do with all of their different items. But, you know, there's automotive construction and all that other waste as well. So it's kind of a cool tool.'",
        "'speaker_4': 'And, you know, if you're ever confused because I'm often confused on where to put things, it's a nice hands only tool.'",
        "'speaker_1': 'So it's kind.'",
        "'speaker_4': 'Of nice to cycle and eliminate or continue to work on our diversion rates and get stuff out of landfill. Thank you.'",
        "'speaker_1': 'Yeah. Thanks for all your good work on this council member. All right. We have come to the end of the agenda and we're ahead of time. So have 435. Good work, everyone. We covered a lot. We had a hefty closed session and we had some significant topics to talk about on this one.'",
        "'speaker_1': 'So thank you all for your good work, your diligence and we will see you all in two weeks. Take care. Stay safe. Wear your mouth. All right. Thanks, staff. See you soon. Bye, everybody.'"
    ]
}