{
    "Recommendation to Accept a Report on the Appointment of a Member to the Open Government Commission.  (City Clerk 10022020)": [
        "'speaker_0': 'So if you could take that into consideration, other folks like on Haight Street, when we'd be walking in the summer and the porch concerts would be going on, they'd be asking, Can our street be a slow street? They think, That's great.'",
        "'speaker_0': 'I've been invited into someone's beautiful backyard. When I admired her flowers on the street side of. Her property. I think that it has been said by other speakers this was away during the pandemic. And, you know, the grim news is we're still in the pandemic, but it got people out and exercising and just doing things that are'",
        "'speaker_0': 'physically and psychologically healthy to get out and get some fresh air, sunshine, socialize, say hello to people, you know, keep your distance and all that, but wave and say hello to the people you you pass. It's a good thing to do.'",
        "'speaker_0': 'And so I do think it helps build community. Other streets are doing this. I am sometimes in the snowy valley in San Francisco and it's pretty cool too to see, you know, skateboarders going down some of these hill streets that are now closed off to a slow street.'",
        "'speaker_0': 'So I think that change is always hard for people to get used to, but it's actually good for us to learn and try new things. And I think Slow Streets are a good idea and I am certainly prepared to support the the proposal as staff has has recommended to us.'",
        "'speaker_0': 'So who wants to go next? Council member, Desiree.'"
    ],
    "Adoption of Resolution Continuing the Declaration of the Existence of a Local Emergency in Response to the COVID-19 Pandemic, Consistent with Government Code Section 8630(c). (City Manager 10021030)": [
        "'speaker_4': 'Well, thank you. Let me just make several points, maybe two or three. I think the first point I want to make is that we have to remember that when the Slow Street program began in February, March 2020, we were into the pandemic at a time when we were very unsure about, you know, how to negotiate that.'",
        "'speaker_4': 'Tennis courts were closed, swimming pools were closed. Our shopping areas, you know, were very limited service. So you really weren't going out there. And a lot of us at that time, for those who are lucky, were working from home.'",
        "'speaker_4': 'And so we really needed to get out of the house and to walk up and down. And I remember this because Kerry and I, you know, would do that. We'd walk down Broadway and then make a left on Shoreline Drive, walk in the direction of the post office and turn around and walk back.'",
        "'speaker_4': 'And you needed space. To kind of facilitate that that that physical activity that you needed to get out of that isolation, being kind of cooped up at home. And so that's kind of the backdrop of, you know, where this Low Street program began.'",
        "'speaker_4': 'I think the idea even was before it. But I think the pandemic, as it began, really kind of accelerated it. But over that time, we have managed to negotiate the pandemic. We have managed to come back to the tennis courts.'",
        "'speaker_4': 'We have managed to come back to swimming. We have managed to come back to our downtown areas. We have managed to, frankly, you know, socially gather, but hopefully in a socially distant manner and with face masks. And so kind of the overarching issues that required us to put in place the the Slow Street program, I think is'",
        "'speaker_4': 'is not there. Clearly, you know, we've got the American virus that is coming down the pike is a significant part of the new peop of numbers of people who are, you know, getting COVID. Without a doubt, you know, the emergency hasn't lifted.'",
        "'speaker_4': 'But, you know, in that wonderful way that Americans are able to we've kind of figure it out and are continuing to figure out, you know, how to negotiate the difficulties. So I think the backdrop that forced us to to to adopt the Slow Streets program.'",
        "'speaker_4': 'I'm not seeing it there. I think even within our Macron, you know, we can still walk down certain sidewalks and streets in a in a socially distant manner. Face masking. If we you know, for example, if I'm watering my plants and I see people walking down the sidewalk, you know, they just temporarily diverge onto the street and'",
        "'speaker_4': 'then come back onto the sidewalk. So I think, you know, I'm seeing we're in a different condition now. That is telling me that the urgency for the Slow Streets program or the reason for the Slow Street program isn't there as as much as it was there in in February, March 2020.'",
        "'speaker_4': 'So that's the first point I want to make. I think the second point I want to make is what you're seeing in the Slow Street program as it's evolving and as people are seeing it. I don't think people are seeing it as a mechanism to deal with social distancing, a mechanism to deal with, you know, the COVID'",
        "'speaker_4': 'situation. I think what people are seeing in the Slow Streets program really is basically. A quasi cul de sac, basically. And, you know, we'd all love to live in cul de sacs where we don't have traps through traffic coming into into our neighborhoods because, hey, there's no doubt if you've got, you know, if you live in a'",
        "'speaker_4': 'cul de sac or maybe if you live in in the solicitor's neighborhood, you know, you're going to love what it is because you don't have traffic. And. But that's a completely different conversation, which I think. US as local elected officials and as city staff, we have to have a different level of discussion.'",
        "'speaker_4': 'And that difficult, different level of discussion has to come down to which streets get to get to be picked in terms of getting the the slow streets lottery in which streets don't get picked in terms of the low streets lottery because it is you know, I think it's it stands on its own that, you know, the less'",
        "'speaker_4': 'amount of car is going down, you know, is is a benefit. Let's not miss that. You know, we're not going to argue against that. But I think if you're going to have that kind of a lottery, you got it.'",
        "'speaker_4': 'We as a council or we as a city staff, we should really talk about that further. And so I think what I'm not going to support the continuation of the Slow Streets program for one more year. I think the urgency with which it brought you know, we brought it up isn't there.'",
        "'speaker_4': 'But what I would encourage city staff and and our commissions and our councils is to figure out a way what is the equitable approach in terms of why does one street get a slow street program and another doesn't?'",
        "'speaker_4': 'And, you know. For those who have a fellowship program in their areas, you know, hey, great, I'm not holding it against you, obviously. You know, you want to you want to keep it. My mom has a little series program in front of her house.'",
        "'speaker_4': 'And, you know, I know that she walks her dog. I remember I thought about this 25 years ago. She walks the dog, but she doesn't walk on the street. But but, you know, it gives me some semblance of assurance that at least, you know, when she's walking down Santa Clara Avenue, there's less traffic.'"
    ],
    "Recommendation to Approve a One-Year Extension of the Slow Streets Program through December 2022. (Planning, Building and Transportation 20962740)  [Continued from December 7, 2021]": [
        "'speaker_4': 'But as policymakers, though, we need to make a tough call as to why does this street get a slow street, and why does the street not get a slow street? Why does Buena Vista Avenue not get a slow street?'",
        "'speaker_4': 'And I think that's kind of a policy discussion that we really need to kind of hash out. So I'm going to vote no on continuing the social programs for the reasons that I said. And I'm going to encourage us, though, to kind of come back and figure out, you know, you know, how it is that that that'",
        "'speaker_4': ', you know, why does one street get it get designated a slow street and another doesn't? I mean, are there issues of equity that we need to think about? I don't know about that, but, you know, we definitely need to figure that out.'",
        "'speaker_0': 'Were you asking staff to explain how these streets get chosen to be so street?'",
        "'speaker_4': 'Oh, no. Ultimately, I think as we go citywide, I think there's a process in place now that that we're going to get to it. So so I'm confident that that process is going to have that discussion. But but in a way, though, if you're asking us to continue that, I speaking from my, you know, see if I'",
        "'speaker_4': 'feel that we have to have that conversation now. But but I get that it's it's it will be underway.'",
        "'speaker_0': 'Well, perhaps just for the benefit of the listening audience, who might be curious as to whether this was just an arbitrary decision as to which states were chosen? Was Wheeler or whether this death. Do you want to touch on that briefly?'",
        "'speaker_5': 'Sure, Madam Mayor. I'm happy to. Yeah, there were a variety of reasons. We selected the streets. We did. One is that all of these streets are already bicycle routes or. And or. They were also being considered as future bicycle boulevards.'",
        "'speaker_5': 'And the active transportation plan effort, which are bike boulevards, are low speed and volume neighborhood bikeways that are shared with cars. They're also streets that already had a relatively higher number of people walking and biking on them, streets with relatively less traffic because there are two lane residential streets that could be made into those streets so that'",
        "'speaker_5': 'there would be less traffic disruption, whereas larger streets would obviously disrupt a lot of traffic. Obviously, we kept them off of bus routes as well because we didn't want to disrupt bus traffic.'",
        "'speaker_4': 'Yeah, I get it. But but people on our streets also deserve to live to to live on a street where it would.'",
        "'speaker_0': 'Seem every day to save everyday. Hello? I'm still conducting the meeting. Let me. Let us, please let us have our staff comment. Now, go right back to you. Ms.. Wheeler, please continue.'",
        "'speaker_5': 'Sure. Just two more points. We also, in our first survey, asked the community where they'd like to see slow streets. And these streets that were selected were the ones that were most frequently selected as those streets. And we were looking for having that kind of equity across the island and looking at providing that.'",
        "'speaker_5': 'So those were the reasons.'",
        "'speaker_0': 'Thank you. Councilmember Desai, back to you.'",
        "'speaker_4': 'Yeah, no, no, I. I appreciate. And every reason that you said is absolutely valid. But I think as policymakers, you know, we need to think about some of the neighborhoods and residents, even if they don't self, you know, self-select themselves as wanting slow streets.'",
        "'speaker_4': 'We need to say, hey, they're just as worthy of having a slow street. So it's I think it's, you know, it's who gets the lottery pick of full streets. And we need to kind of figure out and I am and don't get me wrong, I know you guys will do that through the process that that's coming underway'",
        "'speaker_4': '. So don't get me wrong, but I'm just saying that that should be done now for me to support extending this. Thank you.'",
        "'speaker_0': 'Thank you, Vice Mayor Vella.'",
        "'speaker_1': 'So I want to think thank you, Mr.. For clarifying the fact that our safety and calming efforts are actually not to blame for the traffic deaths. I think that that's a really critical point. I also think that there has been a lot of staff work, a lot of commission work, a lot of discussion behind the selection process'",
        "'speaker_1': 'in terms of where this bus streets are located. And I think in many ways, at least, the behavior that I've seen is that as vehicles are driving down even other streets, we're seeing the type of driver behavior we want to see, which is people are slowing down.'",
        "'speaker_1': 'That's the whole point. People are driving in a way that we would hope they drive on every street, which is cautiously keeping an eye out for others who are using the road whether or not they're in a vehicle.'",
        "'speaker_1': 'These are really key things. And I think in many ways, if we need to expand the types of traffic calming measures on some of the side streets or the streets within the vicinity of slow streets, I'm very supportive of that.'",
        "'speaker_1': 'If we need to put more resources towards those things, I think this council has been supportive that in fact we've taken steps both in our past meetings to make sure that our streets are as safe as possible and that we are prioritizing that.'",
        "'speaker_1': 'I think that I would like to see our slow streets become permanent. I would like to see an expansion of them. I would also like to see an expansion of traffic calming traffic calming measures. And I think that in many ways, making sure that we are allowing for safe routes to school, allowing for safe travel across across'",
        "'speaker_1': 'the entire city, using slow streets, I think that that's very appropriate and in line with our vision and our community's vision in terms of what we want and really opportunities, equitable mobility opportunities. So I'm it sounds like there might be the votes here tonight continue.'",
        "'speaker_1': 'It's very happy about that. I find seeing an expansion and a discussion in terms of what Councilor Knox White has put forward. I think that there's been some other comments that are helpful. You know, I think that, you know, I'm ready to move forward tonight with, at a minimum, the staff recommendations.'",
        "'speaker_1': 'I don't know. Councilmember Knox, why did you make a motion earlier? The question to the chair. I know that there were some suggestions.'",
        "'speaker_0': 'And I just want to chime in. I want to see this move forward. But my comfort level is with what the staff has recommended. I, I feel that's most respectful to the staff. They put a lot of time and effort in this into this.'",
        "'speaker_0': 'And so I'm more than happy to support the staff recommendation, and I don't believe we've had a motion yet. Councilor was adamant bossy he and needed.'",
        "'speaker_3': 'I hear that I hear the concerns about that about the expansion and won't propose that so I'll move that we continue the program extended until the implementation consistent with the upcoming AGP is complete.'",
        "'speaker_1': 'And I'll second.'",
        "'speaker_0': 'In accordance with the the staff recommendation, correct?'",
        "'speaker_3': 'Yes. With a change in the timing? Yes.'",
        "'speaker_0': 'What changed in the timing.'",
        "'speaker_3': 'So not ending in a year and coming back for further extension, but extending it until such time as the ATP is implemented. That's the planning document that's deciding what to do with these streets, whether to remove them, etc..'",
        "'speaker_0': 'So before I decide how to vote, I would like to hear from staff. So. Ms.. Wheeler. This, I believe, is your staff report. There was your recommendation or anyone else who wants to take this on. The recommendation is to.'",
        "'speaker_0': 'Continue this.'",
        "'speaker_1': 'For.'",
        "'speaker_0': 'I'm really sorry to.'",
        "'speaker_1': 'Have an.'",
        "'speaker_0': 'iPad that freezes. I'm sorry I cannot pull it up.'",
        "'speaker_1': 'Hello?'",
        "'speaker_3': 'If we can, maybe we can jump in. Yeah, I think you.'",
        "'speaker_0': 'Jump in and save the mayor.'",
        "'speaker_3': 'Things like that. Rochelle, do you want to add the recommendation?'",
        "'speaker_0': 'Thank you, Mr. Thomas.'",
        "'speaker_1': 'Yes.'",
        "'speaker_5': 'Thank you. The recommendation is and the staff reported to continue it through the end of December 2022. So a year from now, I think that we could also tie that to the adoption of the HDP, but I'm not sure that's what council member Knox White.'",
        "'speaker_5': 'Let me for.'",
        "'speaker_3': 'Let me jump in. I think.'",
        "'speaker_0': 'Mr. Thomas.'",
        "'speaker_3': 'Either thought that staff thought was extended for one more year by then we hope to have the eight the Alameda Transit, the active transportation plan done. And that's going to that's going to determine and that is the process that Councilmember De Saag was talking about, picking which streets, you know, become permanent slow streets or permanent bicycle boulevards'",
        "'speaker_3': '. I think what council member Knox. Right. Is saying is. That logic makes sense. So let's just make the council direction clear. We will extend the slow streets until such time that you get back here with the active transportation plan, because that's the plan that's going to determine the future.'",
        "'speaker_3': 'I think what Councilmember Knox White was trying to avoid was a situation where we're working through the public process where. You know, you're about ready to finish the active transportation plan. But then we hit this date of December 2022, and we're not quite done with the active transportation plan, but we're close avoiding the need for another council'",
        "'speaker_3': 'action to extend it until the time that active transportation plan is done. So from staff's perspective, tying it directly to the active transportation plan makes a lot of sense.'",
        "'speaker_0': 'Well, that's all well and good, but it sure wasn't anywhere in the staff report. So I, I do understand that. I'm not sure that I think it's so onerous to ask for another extension, and we hope that it's done.'",
        "'speaker_0': 'But I. I guess I'm one who well, I'm not a transportation professional, and I very much respect what our staff comes forward with. And I ask questions, you know, I do. And but I was satisfied with this recommendation.'",
        "'speaker_0': 'So. But what I do want is to move this plan forward. But. You know, again, I was prepared to support the staff recommendation. Okay. So. Its face mirrors that your hand up to speak.'",
        "'speaker_1': 'And I just have a chair for this comment. Is it possible to just make sure or, you know, that, you know, to have that you're saying that you think that the plan will be ready in a year? Is it perhaps that they are?'",
        "'speaker_1': 'We just have the direction to the plan come back along with this in here?'",
        "'speaker_0': 'Well, I've said that. Let me just jump in really quickly, if I might, that I would be satisfied if we had in a year's time an evaluation, a check in. Staff can look at lessons learned, information gotten over the course of the year, still moving forward towards the actual transportation plan, finalization.'",
        "'speaker_0': 'And we can it to that. But I do think we should come back for a for a review, just an update in a year's time. Mr. Thomas with that?'",
        "'speaker_3': 'Yeah, no, that's look. And that's absolutely. Staff can do this either way. It's it's if you want to see us in a year, we can absolutely be back in one year with an update on the. And at that time, if we're close to finishing the act of transportation, but not quite there yet, the council at that point'",
        "'speaker_3': 'can decide whether to extend a little longer or. Or not.'",
        "'speaker_0': 'No, I'm. I'm willing. This course is a compromise. I'm willing to go with Councilmember Nuts for its motion. However, I would like the addition of a review in a year's time of this both streets program.'",
        "'speaker_3': 'From staff perspective, that certainly works.'",
        "'speaker_0': 'Okay. Make her the mission.'",
        "'speaker_3': 'Are you asking me to add that I'm not supportive of the staff spending time doing a review of something, that we are going through a planning process and have a plan that's already going to be done. I just I'm worried that we're going to send staff off to spend dozens and dozens of hours to do a report'",
        "'speaker_3': '. They're going to come back and we're not going to do anything with the report. I just worry that we have such a small staff. We have things that we've been wanting. We have a bridge RFP that is not out there because we keep piling on for staff.'",
        "'speaker_3': 'I just worry that the review ends up not being much more than just a report back. And I think the ATP is the purview. That is the place where the planning has been done, where the conversations have been had, where staff has come in with their best recommendation based on the conversations they've had with the community and'",
        "'speaker_3': 'the.'",
        "'speaker_0': 'Well. I've heard staff offer that they're able to do this. I don't think it sounds that time consuming.'",
        "'speaker_3': 'Are you asking me to withdraw my motion? I'm happy to do so.'",
        "'speaker_0': 'Vice mayor. So to make a motion. I think I think the vice mayor. Yeah, it's probably better to go off camera because her audio has been getting a little shaky.'",
        "'speaker_1': 'Sorry my zoom is doing. And I was so I can't I can't see anyone.'",
        "'speaker_0': 'I was just saying you could actually turn your video off because I think it's impacting your audio or maybe your is just weak. And for clarification. When does staff anticipate having the actual transportation plan?'",
        "'speaker_5': 'We suggested December because we think we will have an active transportation plan to you before the end of next year. So that's why we suggested that December 2022.'",
        "'speaker_0': 'To us in December. Okay. They were saying the same thing. Okay, Vice, we're going to try it again. Okay. Tell you what I would call a break. I think everybody's audio needs a little or their connections need a little rest.'",
        "'speaker_0': 'So it is 904. We'll be back at 915.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'So.'",
        "'speaker_0': 'Okay. I am counting. This is. There's Malia. Yeah. And team. Oh, let's. No, I shouldn't have said anything.'",
        "'speaker_2': 'One of the. Oh, darn, she has gone. One of the things we talked about is maybe she if she didn't like you suggested mares leave her video offering help her bandwidth issue that we think she's having.'",
        "'speaker_0': 'Right. But she disappeared altogether.'",
        "'speaker_2': 'She's reconnecting again.'",
        "'speaker_1': 'Sorry. I'm here. No. Rebooted the wi fi.'",
        "'speaker_0': 'Yeah, but if you think it's too much to have audio and video on it once, feel free to ditch the video. All right. So whenever everyone's ready.'",
        "'speaker_2': 'I think we're ready.'",
        "'speaker_0': 'Okay. Councilmember Knox, wait.'",
        "'speaker_3': 'So I think I have an amendment to the motion on the floor that may get us where we need to be, which is that if staff has not returned in 18 months with a finalized ATP, they will they will return within 18 months with a review of the city streets for counsel, consideration and direction.'",
        "'speaker_3': 'So they get allows staff to get to the ATP on the time when they expect it without having to stop and do additional review of the Slow Streets program. But if for some reason they fall behind, they will have the ability to do that review and come back for final.'",
        "'speaker_0': 'This, Wheeler said. December was when she anticipated.'",
        "'speaker_3': 'Yes. And I'm saying if they can't get back for that bad, they come with the ATP. There's not going to need to be a discussion about those streets because the the streets for bike boulevards, etc. will be already identified in the ATP.'",
        "'speaker_3': 'Right. That that that plan supplants the the Slow Streets plan. So there's there's not Slow Streets and the ATP, it's the slow streets until the ATP, if they fall behind for some reason, hopefully they won't then then there will be a review of the slow streets.'",
        "'speaker_3': 'But we're asking them not to spend any time reviewing Slow Streets, put it into the ATP and let's just get past the Slow Streets era.'",
        "'speaker_0': 'To let it go 18 months before a review.'",
        "'speaker_3': 'Yes. If if the ATP doesn't come back, the ATP will be the review. That is where they will come back and say, here's what we want to do. We've talked to the community. Here's how we want to move forward.'",
        "'speaker_3': 'There's not an we don't need to review the streets at that time because they're going to end regardless.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_1': 'I'm fine with that. I think that I know. You know, I mean, the main thing is, is that I want to see the slow streets continue for a year and. I guess my question is to staff in terms of what they think the timeline is.'",
        "'speaker_1': 'I also just want to avoid having additional kind of items coming back to council when we have other business to discuss, if, if, if it's going to be 14 months or 12 months or something like that. I don't want to have a second agenda item, but.'",
        "'speaker_1': 'I'm open to hearing the shadow of doubt.'",
        "'speaker_3': 'But Mr. Chairman, just look, we staff can guarantee that we could get a ATP back in 12 months. But as you know, it's the the the staff work to prepare an ATP is not the tough part it's the working it through the process with the Transportation Commission and the community.'",
        "'speaker_3': 'So I think that's where we we struggle to give you a definitive date because we like to bring these plans to the council after they've kind of gone through the natural kind of public review process. So we are, as Rochelle said, we're pretty confident that we think the that process will get us back to council in in'",
        "'speaker_3': '12 months. We also do appreciate Knox Councilmember Knox White's point, though, that it was sure would be a shame to take if we're within a month or two of getting back to council with the final ATP, it would be a shame to put it on hold.'",
        "'speaker_3': 'While we do a lot of work on a update report. I would say though that if that is the situation, I would reassure the Council and Councilmember Knox Way we're not going to spend a lot of time on that annual report or that update report.'",
        "'speaker_3': 'We're going to that annual update report is going to say, hey, we're almost there. Council will be there in two months. And this is what the ATP says about the streets, because at that point it'll already have been to Transportation Commission at least.'",
        "'speaker_3': 'So the draft ATP will be out and in circulation that we can guarantee.'",
        "'speaker_0': 'Okay. Thank you. I do rely on staff recommendations. We've had a motion and it's been seconded. You seconded? Correct. Vice Mayor. All right, we have a roll call vote, please. Yes, Councilor. Responsive.'",
        "'speaker_1': 'Thank you. I'd just like to echo member de Sox comments in regards to this, that staff should be considering the equity of having these. And there have been many suggestions of rotating those streets. And I don't think I've ever heard anyone volunteer for more car traffic.'",
        "'speaker_1': 'But as we've heard, there are many people that are very happy to have less car traffic. And so I think that's a legitimate concern. And we have heard and I have heard people especially on this, to say that they have increased car traffic as a result of the Pacific Street.'",
        "'speaker_1': 'And I think that the equity issue is a valuable one and I really appreciate Member De SA raising it and I hope that staff will take that to heart. Thank you.'",
        "'speaker_0': 'Thank you, Councilor said.'",
        "'speaker_4': 'Just quickly, you know, at the end of the day, what the slow streets is about is putting barriers that prevent basically through traffic. And, you know, there are some streets who want those barriers and they should be have valid reasons to get it just as anyone else.'",
        "'speaker_0': 'And that you're out of time. Thank you. We have that roll call vote, please.'",
        "'speaker_2': 'Councilmember.'",
        "'speaker_4': 'You know.'",
        "'speaker_2': 'However, spencer.'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'Not quite. I Vela.'",
        "'speaker_1': 'I may.'",
        "'speaker_2': 'As Ashcraft say that Carrie Strait is here.'",
        "'speaker_0': 'Thank you. Okay. Now we move on to item six, B and C here. I think some of the same staff are probably. Staying for this, correct?'",
        "'speaker_2': 'Yes, I believe so. And would you like me to?'",
        "'speaker_0': 'Yes, please.'",
        "'speaker_2': 'Recommendation to advise the city manager execute a Second Amendment to the agreement with close associates to increase compensation by $270,906 for total aggregate compensation, not to exceed $345,876. To continue providing technical services related to roundabouts.'",
        "'speaker_0': 'So that we have public speakers on this item.'",
        "'speaker_2': 'We do not. Oh, we have one now.'",
        "'speaker_0': 'Okay. And so because I was going to ask counsel, if you had just clarifying questions of the staff report before we discuss, because this is an extension of a contract, but any of. Any clarifying questions from Council on me?'",
        "'speaker_0': 'Do you want a staff report? We are trying to move along and maybe even get two council referrals tonight. Kelso overheard Spencer.'",
        "'speaker_1': 'I don't have clarifying questions, but I thought I heard that there is at least one public speaker.'",
        "'speaker_0': 'And I am. But we we do clarify on questions and then we go to.'",
        "'speaker_1': 'I understand. But there was also comment, I believe I heard you say about skipping the presentation. And I do not support that. And I do support hearing from our public. Thank you.'",
        "'speaker_0': 'It was, in fact, a question if you would like a presentation. I take that as an affirmative answer. So let's go ahead and have the staff presentation and then we will go to clarifying questions from the council and then we'll go to our public speakers, however we may have.'",
        "'speaker_0': 'So, Mr. Thomas, are you introducing this item?'",
        "'speaker_3': 'I will. Mayor Thank you very much. Andrew Thomas, Planning Director. This is a contract extension. It's in this contract has been focused on the question of an evaluation of roundabouts. Roundabouts serve two purposes for the city of Alameda.'",
        "'speaker_3': 'One is they increase safety at intersections, but they also smooths and improve travel times so they are can be very effective in both achieving our vision zero goals and traffic safety goals, but also our goals to keep traffic moving.'",
        "'speaker_3': 'They also have the benefit of being in the long term much more much less expensive to maintain than traffic signals. So that's another plus. There is a downside. They're expensive to build. So what we have been doing with this contract is evaluating locations in Alameda that would be appropriate for roundabouts.'",
        "'speaker_3': 'The two then put us in the position to come to council and recommend where a roundabout really makes the most sense because a roundabout is expensive to build. We want to put the city in the best possible position to to compete for outside funding, regional and state funding and federal funding to build roundabouts.'",
        "'speaker_3': 'We put ourselves in the best possible position if we as a community have identified the location and the conceptual design ahead of time. And that can only be done through this kind of study and with community and council participation.'",
        "'speaker_3': 'So that's the goal of this of this contract amendment.'",
        "'speaker_0': 'Thank you. Clarifying questions from counsel. Counsel for her, Spencer. Thank you.'",
        "'speaker_1': 'And does this well, this work include the videos of what they think it's going to actually be.'",
        "'speaker_3': 'At this point. This is just trying to identify where roundabouts can physically and practically work. The next step would be once we've narrowed down the limited locations. They don't work everywhere. These are full scale roundabouts. They don't work everywhere.'",
        "'speaker_3': 'Once we have a have identified the locations where they work, where they could work. And we start designing conceptual designs for those specific locations. We can do graphics and videos and those kinds of things.'",
        "'speaker_1': 'Does this work include doing that? It's much more preliminary.'",
        "'speaker_3': 'It's more preliminary.'",
        "'speaker_1': 'Okay, thanks.'",
        "'speaker_0': 'Other clarifying questions, counsel and I let's see, is Mike Austin is he one of the presenters?'",
        "'speaker_3': 'I think he's Michael is part of our consultant team that he's here to help us answer questions, I believe.'",
        "'speaker_0': 'And I think I saw it. Did I see your hand go up? Mr. Austin, did you want to comment?'",
        "'speaker_3': 'Yeah. That's okay. So please offer. In addition to what?'",
        "'speaker_0': 'Yeah. Sir, can you first tell us to tell us who you are, what you do?'",
        "'speaker_3': 'Sure, absolutely. So, I'm Mike Alston. I'm with Kinsman Associates. And we've been working with staff, as you mentioned, on roundabout work throughout 2021. And what I just wanted to mention very briefly is we actually do have a task in here.'",
        "'speaker_3': 'As he mentioned, it's much further down the line if alternatives are are advanced. We do have a task force three visualizations exactly. To the council members point. So that task is and is in the proposed scope of work.'",
        "'speaker_0': 'Thank you for this amazing conservatory, Spencer.'",
        "'speaker_1': 'Thank you. So then I want to just clarify so that this additional money does, in fact, cover what you're calling this visual.'",
        "'speaker_0': 'Sexualization, I think.'",
        "'speaker_3': 'Yes, ma'am. That's correct.'",
        "'speaker_1': 'For each of the proposed round about center. What is that within the scope?'",
        "'speaker_3': 'Your choices. So as he mentioned, we do include it not for a multitude of locations, but for if alternatives are identified at certain locations where a roundabout would be viable. Once a project concept got to that point where we know enough about it to visualize it, then we do have a scope and task in that scope to'",
        "'speaker_3': 'visualize a proposed concept. So we're not going to go making a bunch of videos about roundabouts, but if we identify locations where it's viable, we then develop a design at a certain location. The point at which we bring it to transportation commissioned the public and City Council.'",
        "'speaker_3': 'We would provide a visualization. That's the purpose of that item.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. And my one clarifying question is so I have I seen the recommendation, the staff report, we're recommended to approve the next steps and they're laid out. What's the time frame like? How soon? Assuming we approve this extension tonight, how soon would you get started?'",
        "'speaker_0': 'And what's the approximate length of time you think this will take?'",
        "'speaker_3': 'Michael. Do you want to down?'",
        "'speaker_0': 'Go ahead, Mr. after thing.'",
        "'speaker_3': 'Yeah, sure thing. So, banks. We have a proposed schedule in the back of our back of our amendment that indicates that this work would happen throughout 2022. So we'll keep we'll keep staff in the loop as we progress our work.'",
        "'speaker_3': 'There's several guests in there, but we've got it all occurring in 2022.'",
        "'speaker_2': 'Mayor, you're muted.'",
        "'speaker_0': 'I was saying it was in the back of the head. I must have missed that. Okay. Good to meet you. Okay. How many public speakers do we have now?'",
        "'speaker_3': 'Just one.'",
        "'speaker_0': 'Okay. Let's hear our public speaker.'",
        "'speaker_2': 'We now have two. But the first is Zack BOLLING.'",
        "'speaker_0': 'Geddy Lee, Speaker BOLLING.'",
        "'speaker_4': 'Why they even council. I am a big fan of roundabouts. I'm always a huge advocate and from past meetings I just wanted to talk about this item specifically just around the contractors work on the First Amendment of this was some of.'",
        "'speaker_3': 'The outreach meetings they did.'",
        "'speaker_4': 'One of the things that would be great for this second amendment the additional work.'",
        "'speaker_3': 'Scoped they did some.'",
        "'speaker_4': 'Work with helping staff around doing outreach with community around the McCartney Rhode Island Drive. One of the things that kind of came out of that is I think there's some misinformed ideas of of of roundabouts that would be great to help with public education around the safety benefits and how much they can improve, especially if we're looking'",
        "'speaker_4': 'at some of the other arterials and of Alameda that they've kind of documented. They want to do a screening and and go through Alameda to find additional places for these roundabouts. If we're going to charge forward with doing more roundabouts, I think getting more education about the benefits of roundabouts and our future amendments would be great.'",
        "'speaker_4': 'But I'm a big supporter. I think there's been a lot of great work so far and that's basically all my comments. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker, Brian Kennedy. Good evening, Speaker Kennedy. Are you able to.'",
        "'speaker_1': 'Yourself, Jacob? Can you. Yes.'",
        "'speaker_0': 'Yes. Good evening.'",
        "'speaker_3': 'Everybody. Hey, I want to give a shout out and also a a no no to all of you. A good shot I saw on the city valuated Facebook page. A shout out to transgender folks who have been violently assaulted and condemning that.'",
        "'speaker_3': 'And that's a wonderful thing. So, you know, no one wants to be like that. However, you guys blew it. You blew it. The mayor, the vice chair, all you guys and all of you who I like you did not give a shout out as was requested.'",
        "'speaker_3': 'To the nationally recognized item of illegal alien.'",
        "'speaker_0': 'I am going to stop you there. This is not a this this comment is not related to.'",
        "'speaker_3': 'How kick ass it.'",
        "'speaker_0': 'Is.'",
        "'speaker_3': 'Madam illegal alien from.'",
        "'speaker_0': 'Madam Clerk, I would ask that we move on to the next speaker because this may be oral communication. It is not concerning the amendment of this contract. Do we have any other public speakers?'",
        "'speaker_2': 'We do not.'",
        "'speaker_0': 'With that I am closing public comment on item six be and I will open it up to Councilor Bloxwich.'",
        "'speaker_3': 'Move approval of the item as requested by staff.'",
        "'speaker_0': 'To have a second.'",
        "'speaker_3': 'Oh, and that other question.'",
        "'speaker_0': 'Well, we'll get a check and then we'll do a discussion or decide. That was Vice Mayor Vela, second Councilmember de sa.'",
        "'speaker_4': 'Yeah. Can you just for purposes of the public identify maybe three or four of the different places that we might want to be evaluating with the additional supplement to the contract? Three. Thanks.'",
        "'speaker_3': 'Sure. We are the Clement extension as it as it interconnects with Tilden is one of the primary locations we want to look at the we've been looking at Macartney in Harbor Bay and then we have those are the two.'",
        "'speaker_3': 'And then the other one that we've been looking at is Lincoln Avenue, Marshall and Pacific, sort of that at that and that location. And then of course, we continue to work on and evaluate the opportunities for us. It's a difficult situation at that central Sherman And you know that we've had a hearing or two about that.'",
        "'speaker_3': 'We're still working that through. This is all about setting us up as a community and the council, putting you in a position to say, yes, that location makes sense. We've seen the visualization. We like the concept staff go get money for that roundabout.'",
        "'speaker_3': 'I mean, if you're not there as a council, then we're not going to compete well for that. Grant So it's really about. Kittleson, their expertize, their skills, their knowledge, their visualization techniques, putting, having, putting us in a position to be able to communicate and educate.'",
        "'speaker_3': 'I completely agree with Speaker Beau Dowling Bowling about that. We need to educate so that the community can say, yes, we like that idea about a traffic roundabout at that particular location. You as council can say, yes, we support this, we want to make this happen.'",
        "'speaker_3': 'Staff, go get that money. If we don't have that kind of community support and council support, there's we're not going to be successful going for that, going for the grants. So that's really that's the goal of this of this contract at the end of the day.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Anything further Councilmember doesn't know. Okay. Councilmember Herrera Spencer.'",
        "'speaker_1': 'Thank you. Thank you. Staff and the public comments. I really do like the ideas visualizations and I wanted to and I don't know what these are going to look like, but I'm hoping that they will include very pedestrian.'",
        "'speaker_1': 'So I know one of at least one is near school proposed and that has a lot of. New drivers, a lot of pedestrians and a lot of bicyclists and trying to, if they can, show where all those people are going to go during drop off and pick up that.'",
        "'speaker_1': 'Exactly. And where they know where they go and where they stop and how that really what that will look like. And and and also, of course, at the other intersections. But that's something I'm looking forward to seeing. I do have concerns about putting these in, but I see this as an educational element of, you know, helping us'",
        "'speaker_1': 'try to see and to educate us as well as the community members. So I really am looking forward to the visualization part, and I agree with the Speaker in regards to education. And I would say, you know, including myself and others, have raised questions that's trying to make it clear is honesty for me where everyone goes, because'",
        "'speaker_1': 'it's my understanding the circle keeps going, the traffic keeps going. But then when you have your bicyclist, where do they go? When you have your pedestrians, where do they go without slowing it down and without honestly having people have to wait and keep hoping that a car is going to stop when there's not a signal or a'",
        "'speaker_1': 'stop sign. Thank you. Oh, I know. One more. Sorry. The money's. What is the source of the money for this contract?'",
        "'speaker_3': 'This is a measure B and B money. We have it budgeted.'",
        "'speaker_1': 'So no general fund moneys.'",
        "'speaker_3': 'That's. That's correct.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'All right. Now, quickly, we have a roll call vote with.'",
        "'speaker_2': 'I'm sorry for data.'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'However, Spencer, I knocked. Right.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Vella. Hi. Next mayor as the Ashcraft High that carries by five.'",
        "'speaker_0': 'All right. Thank you. And thank you so much to our consultants. Good to hear from you, Mr. Austin. We look forward to this project moving along. All right. Take care. Thank you, Mr. Thomas. Thank you. Thank you. Other than Mr. Steyn.'",
        "'speaker_0': 'Thank you. Okay. And now we are moving on to six B and we're going to try a really fast transition now. No, it is not just B, we just did it. This is now we're getting into the regular agenda.'",
        "'speaker_2': 'Oh, we found.'",
        "'speaker_0': 'One more thing. 368 This is what I was thinking of because I would say we need to cue the speakers on six C, please. Yeah, like. Like magic. Okay. Madam Clerk, would you please introduce item six?'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Recommendation to provide direction to staff regarding the installation and use of automated license plate readers, including fixed and mobile equipment on Alameda Police Department vehicles.'",
        "'speaker_0': 'All right. Well, good evening. I see that we have our police chief, Nishant Joshi, and from the city attorney's office we have Allan Cohen, who represents APD and of course, our city attorney. Even Chen is here. So would I be correct to assume that, Chief Joshi, you're going to lead this discussion, this item?'",
        "'speaker_3': 'Yes, that's correct. Madam Mayor, let me just put my I'm going to share my screen.'",
        "'speaker_1': 'Sure.'",
        "'speaker_3': 'And I just want to confirm you're able to see.'",
        "'speaker_1': 'That we.'",
        "'speaker_0': 'Are indeed.'",
        "'speaker_3': 'Okay. All right. All right. Give me 1/2. Just go to make a comparison. There we go. Okay. Good evening. My name is. And Shawn Joshi. I am the police chief for the Alameda Police Department. Tonight, I will be presenting on automatic automated license plate readers, and I hope to provide some insight on the benefits and the limitations'",
        "'speaker_3': 'of this technology. I'll start off with a brief overview of what a LPR technology is. In summary, LPR are cameras that read and record photos of license plates of vehicles as they pass in front of the camera. This technology is an investigative tool that assists by automating the current manual process of officers running license plates while they're'",
        "'speaker_3': 'on duty and in their cars. A highlight of the term investigative tool because I want to emphasize LPR doesn't solve cases. People saw cases. LPR is a tool that helps law enforcement develop, solve and hopefully clear a criminal case.'",
        "'speaker_3': 'Because this technology works. 24 seven. The data gained improves investigative efficiency. There are many agencies in the region and throughout the country that use LPR. Here's a visual of what a return could look like. The camera is alerted to a passing vehicle and recognizes the characters of the license plate.'",
        "'speaker_3': 'The system takes a photo and documents the make color, date and time of the vehicle even further. These systems have the ability to take a partial plate, and based on the make model, color, date and time, the system can pass out the vehicle and or similar vehicles.'",
        "'speaker_3': 'Now, similar vehicles would require additional steps of victim identification. So we would go from something as simple and vague as a victim or witness describing the vehicle as a Ford or grade sedan to every Ford, our great sedan that was in the area at the time of the crime.'",
        "'speaker_3': 'Those vehicles would then be presented to the victim for further identification. What this does is it reduces the amount of time needed to make an identification. Most importantly, we aren't stopping and investigating every gray vehicle. Instead, we're stopping the gray Toyota with license plates, such and such.'",
        "'speaker_3': 'Based on the HPR return and victim identification as a new police chief, one of my initiatives includes reducing our policing footprint. By leveraging technology that gives clear direction and focus in our investigative and enforcement actions. I want us to be an agency that's intelligence led and data driven.'",
        "'speaker_3': 'I don't want us to be a guessing agency. So data is stored in a secure system for a specific retention period. We can and will continue to require documentation of a search reason prior to accessing the system. There would be an audit trail that identifies who accessed the system and what the reasoning was.'",
        "'speaker_3': 'So the current practice requires inclusion of a police report number and a brief description on why the search is being done. The system isn't run by a human and simply detects objective data. There is end to end encryption.'",
        "'speaker_3': 'Officers would receive instant feedback on stolen vehicles, Amber Alerts, wanted persons and things of that nature. This technology does support my intelligence led initiatives. There is no facial recognition technology. It isn't used for immigration enforcement, nor would it be shared for that purpose.'",
        "'speaker_3': 'The system wouldn't be connected with a third party like DMV, nor would it provide personal identifying information or personal data. APD currently uses mobile LPR and these cameras are installed in four patrol vehicles. Of those four, two of those vehicles are not in service.'",
        "'speaker_3': 'We've had this technology since 2014 and there's existing policy that governs the use of LPR. Although the mobile apps provide some investigative benefits, they only capture data when they are in the field. Fixed al PR would capture data 24 seven.'",
        "'speaker_3': 'Our city has a very unique geography in specific entry and exit points, and I believe we could address crime by taking advantage of this environmental design. We would strategically placed these aerial powers at all entry and exit points of the city in tandem.'",
        "'speaker_3': 'Both versions would augment each other. Where fixed al PR would gather photos of vehicles entering and exiting the city and mobile, al PR would gather photos of vehicles in the city. The current policy authorizes a six month retention period.'",
        "'speaker_3': 'I am actually looking at reducing that retention period to 90 days and I'm even open to a shorter retention period. I do understand the risks and the concerns associated with this type of technology, as I mentioned before. Access and use would be limited to a case follow up and would require supervisory approval.'",
        "'speaker_3': 'The data would automatically be deleted based on the authorized retention period and it cannot be retrieved. Again, there's no facial recognition software. We would do regular audits to confirm access and use is on a need to access and use basis and that the access were authorized by a supervisor.'",
        "'speaker_3': 'Violators of the policy would be held accountable and accountability would also include the next level level of supervisor. I've reviewed the use of HPR with our Privacy Resolution 1565 with the city attorney. The resolution prohibits facial recognition and allows limited collection of personal information.'",
        "'speaker_3': 'Well, this al PR proposal will not have facial recognition technology, nor will it collect personal information. As far as a crime concern, I have watched auto theft consistently increase and it's currently up by about 40%. This trend isn't just an alarming trend.'",
        "'speaker_3': 'Other cities are seeing the same spikes. However, it's important to recognize some offenders steal cars and use them as a means of transportation to commit other, more serious crimes. I do see benefits in my staff becoming alerted every time a stolen vehicle enters our city.'",
        "'speaker_3': 'It's difficult to quantify success with Alpers because there aren't very many controlled experiments that have taken place. Solve cases. Don't always document that the case was solved because of LPR. You may recall earlier in my presentation when I said cases are solved by people in LPR as a tool that helps with that.'",
        "'speaker_3': 'I have received some qualitative input from various agencies that have LPR. All of them say that technology is invaluable and serves as a powerful resource that helps identify the actual vehicle rather than officers looking for and investigating possible or similar vehicles.'",
        "'speaker_3': 'I did come across a study called The Impacts of Large Scale License Plate Reader Deployment on Criminal Investigations. The study experienced similar challenges in that solve and or clear crimes aren't coded with language or data that says the crime was solved by ale pr.'",
        "'speaker_3': 'The study looked at clearance rates and salt rates and there's a difference between clearance rates and salt rates for a case. To be clear, there's a much higher standard. And then when a case is cleared cases. I'm sorry.'",
        "'speaker_3': 'Then when cases are solved, cases that are cleared must include arrest, the case being charged and that the case is prosecuted. Cases that are solved could be something like an officer makes an arrest of a person for auto theft and the registered owner decides against pressing charges after getting their car back.'",
        "'speaker_3': 'That case would not be cleared, but it would be solved. All in all, the study found that ale peer assisted in solving cases approximately 20% of the time. I can provide additional case studies. There was a kidnap case in Georgia.'",
        "'speaker_3': 'LPR Help locate the vehicle used and reunited the mother and child in less than 5 hours of the kidnaping. Morgan Hill PD and San Ramon PD saw an efficiency increase by at least five times cases. They said that cases were being solved in less time with LPR as compared to when they did not have LPR.'",
        "'speaker_3': 'Benicia PD recovered 11 firearms during a stop of a vehicle that was identified by LPR. Fairfield PD reported that they made arrests of two suspects with the use of LPR. San Mateo had a pretty brutal home invasion incident of an elderly victim and that case initially had no leads.'",
        "'speaker_3': 'But LPR helped identify the persons responsible. San Marino PD and their city counselor attribute their 70% reduction in burglaries to LPR. San Jose PD was able to resolve ten shooting incidents through the use of mobile app here and they were just approved expand their fixed systems.'",
        "'speaker_3': 'We've had a few recent incidents and I'm going to be vague about them because they're still open investigations. I do expect some follow on search warrants and arrests to be made. But in those cases, although we don't didn't have fixed LPA technology, this may have delayed our case development.'",
        "'speaker_3': 'We did rely on LPR from other cities to develop our cases without getting into too many details. These are significant cases that we spent a significant amount of time developing them. Knowing what I know about those cases, I'm 100% certain they would have been resolved much sooner if we had fixed ALPERS.'",
        "'speaker_3': 'In all these cases, the offenders were not from Alameda. Just to recap, a LPR recognizes license plates and vehicles, not people. The system would not provide personal identifying information. The system will delete the information as early as 30 days.'",
        "'speaker_3': 'We would require reason and supervisor approval to access and we would audit the use to ensure adherence to policy. Alpers do several things. They are one additional tool to help with case investigations. With solid oversight, we can increase investigative efficacy while protecting privacy concerns.'",
        "'speaker_3': 'Most importantly, we have an opportunity to use technology that doesn't include human bias and reduces our policing footprint by focusing on specific, specific vehicles involved in crimes. Rather than casting a wide net for similar vehicles involved in crimes.'",
        "'speaker_3': 'I recommend we move forward with the installation of fixed equipment and consider or consider expanding the mobile HPR equipment to all LAPD vehicles assigned to field duties. And that concludes my presentation.'",
        "'speaker_0': 'Good timing, Chief Joshi, with 12 seconds left over. So thank you for that. I'm sure we have some public comments on this item, but before we go to public comments, let's hear clarifying questions. Council member No sweat. I think I saw your hand.'",
        "'speaker_3': 'I have two questions, mostly procedural. There's council policy direction that when anything like this comes forward with a a I'm sorry, a personal privacy analysis report needs to be attached with the request. And I didn't see that attached.'",
        "'speaker_3': 'Is that has that evaluation been done before we consider whether to move forward with this? And Chief Joshi, I apologize. It's not really quite I don't believe it's a question for you. I believe the city manager, the.'",
        "'speaker_0': 'City attorney or the city manager who would like to meet Mr. Cohen. I see you did. Is that.'",
        "'speaker_3': 'I mean, I did review the privacy resolution, but I didn't see anything in the privacy resolution that required an analysis. Of course, if if council wanted a written analysis, we certainly could provide one. Sure, I did. I can tell you I can tell the council we did review the resolution with the ALP's policy.'",
        "'speaker_3': 'And I and it does appear to it does not appear that there are any inconsistencies between the ALP policy and Council's privacy resolution. Thank you. I'd be happy to forward you the email I sent to the same manager two weeks ago about this.'",
        "'speaker_3': 'There is actual council direction that a personal view and we've used it before. When we approached the Alpers for the ferry terminal parking forward staff did provide that. So I know the staff is aware of it. The other question I had.'",
        "'speaker_0': 'Was actually, can I just stop you for a moment? Council member Next wait. Since you referenced the city manager, Mr. Levy, did you want to add anything?'",
        "'speaker_3': 'When that was offered to me, I did for that to the chief as well as to Gerry to look into. And I think that the chief asked Alan to look at it, but look at it further.'",
        "'speaker_0': 'All right. Back to you. Councilman.'",
        "'speaker_3': 'Thank you. And then I guess the second question is, when we gave direction to bring this item back last March, part of the direction was to bring back studies that showed that there was an actual effectiveness and not just anecdotal stories.'",
        "'speaker_3': 'And again, Chief, I know you weren't here saying that these are kind of unfair questions to have to ask in this greater presentation. I appreciate it. But I did want to know I didn't see any studies that actually showed that there was actually an effective or even a drop in crime in cities.'",
        "'speaker_3': 'We have dozens of cities in the Bay Area, hundreds of cities across the Bay Area. Multiple studies have been done. But is it fair to say we have found no studies to say that they actually have an impact on crime?'",
        "'speaker_3': 'So those are the studies that we look for. It's I did attach a study from. Yes.'",
        "'speaker_0': 'Charlotte-Mecklenburg, North Carolina.'",
        "'speaker_3': 'Yes, I did attach that. That was a study that became aware of the challenge with there is a there aren't a lot of studies that specifically look at HPR because cases that are solved or that are closed or that are cleared aren't necessary.'",
        "'speaker_3': 'There's no no coding that says this case was solved or resolved or cleared because of LPR. LPR is a tool that's used. So in this particular study, what the researchers did was they search through all the narratives to look for the word or any association with a LPR, to try to drill down and see if there was'",
        "'speaker_3': 'if there was some type of connection. It would be similar to if if a video was used from, you know, a convenience store or a robbery and that robbery was solved because of follow up investigative steps that are that are taken.'",
        "'speaker_3': 'If there wouldn't be an interest and attribution to the video itself, they would be cleared, as you know, based on all the evidence. So so that those are some of the challenges that a lot of researchers have found when looking for, you know, rates or success rates associated with a LPR.'",
        "'speaker_3': 'So I did go. And so, you know, when I look at this, I look at this from a qualitative and quantitative approach. It was difficult to find quantitative data, but qualitative data, every single agency that I spoke with, they were in support of it.'",
        "'speaker_3': 'They their, you know, their their agency. A lot of the agencies are expanding the use of it. And so they do find value in the in the equipment. And then also being a, you know, a practitioner of this, I have seen value in in this technology specifically.'",
        "'speaker_3': 'One of the biggest values that I see is that we're able to identify specific vehicles rather than having a vague description, so that we can truly reduce our policing footprint and focus on specific vehicles. So that's where I see the value.'",
        "'speaker_3': 'But again, that's that's more qualitative data. So I hope I answered your question as best that I can.'",
        "'speaker_0': 'And you and other clarifying questions, counsel.'",
        "'speaker_1': 'Councilmember Harry.'",
        "'speaker_0': 'Spencer.'",
        "'speaker_1': 'Thank you. I'd like to direct this to the, I guess the city attorney's office member or not. So I just raise this issue in regards to that council requiring, if I heard correctly, some sort of written analysis of privacy.'",
        "'speaker_1': 'First of all, I'm not sure when that direction was given. If someone knows when that direction was given from counsel and that if, in fact, they think that the work that the chief has done and other staff members have done, including Attorney Cogan, if that satisfies.'",
        "'speaker_1': 'But if they if they whatever they think. I actually think it's the prior council and their direction.'",
        "'speaker_0': 'Who would like to address that?'",
        "'speaker_3': 'I mean, I can address it. I'm happy to address it. I haven't had an opportunity to review. I did just receive an email from the city manager.'",
        "'speaker_0': 'Mr. Cohen Excuse me, I mean, to interrupt and just say perhaps you could just give a brief description of what the personal privacy analysis is. For the benefit of counsel, I refer to Spencer, who wasn't on the council when this was established.'",
        "'speaker_3': 'I have what I have reviewed prior to this meeting was the resolution that the Council adopted in December of 2019, setting forth a number of principles that the Council wanted considered when. Overall, it was the overall overarching privacy principles.'",
        "'speaker_3': 'And the resolution contained three components. It contained sort of a list of general principles, a, the internal or the administrative rules that the city manager adopted with regard to privacy of information technology, which was deemed not to apply to.'",
        "'speaker_3': 'Four uses that were consistent with a legitimate law enforcement purpose. And then there was a third component of the resolution related to facial recognition technology. So I reviewed that resolution and discussed it with the chief and with the city attorney, and I did not see anything in the current iteration, the staff report or the policies that appeared'",
        "'speaker_3': 'inconsistent with Council's general direction, which was which was to allow limited retention of certain materials. So that could impact privacy so long as it was used consistent with a law enforcement purpose. And as the chief said earlier, so long as it didn't employ facial recognition technology.'",
        "'speaker_0': 'Councilmember Herb Spencer. You saw the floor. If you had something further to say.'",
        "'speaker_1': 'It, I real quick. Thank you, Mayor. So if I heard correctly that it's the city attorney's opinion that that this is appropriate to proceed.'",
        "'speaker_3': 'Based upon my review of the resolution. Yes, I know there does not appear to be an inconsistency, but certainly if council would like a more detailed, in-depth, written analysis, our office would be happy to provide that.'",
        "'speaker_0': 'Kels over her, Spencer. And then to you. All right.'",
        "'speaker_1': 'Thank you. So I appreciate your attorney, Cohan's offer, however, that really goes beyond. But I'm asking I and it sounds like the attorney's office, city attorney's office is saying that this is consistent with the former counsel's resolution.'",
        "'speaker_3': 'That is my opinion. That is our opinion, yes. Thank you.'",
        "'speaker_0': 'And then, Councilman, I could just see your hand go up.'",
        "'speaker_3': 'Yeah, I guess I'm. I just want to clarify. So when counsel gave direction to use the San Francisco data privacy policy until such time as staff returned to the city council with an Alameda specific policy, and that policy requires the creation.'",
        "'speaker_3': 'And we have staff, you know, having done this in the past, create the creation of a personal privacy impact evaluation report. I guess I'm confused given that that that report itself is not in this how staff came to the conclusion that there was consistency with staff with with the policy direction of the council.'",
        "'speaker_3': 'Prior to council member Hunter Spencer survival since you asked about the timing.'",
        "'speaker_0': 'Okay. And so you are asking that question of Mr. Cullen, are you?'",
        "'speaker_3': 'I believe so. Is he's saying that it is. I will be candid that that I was not aware of counsel's direction to perform a written analysis. What I reviewed was the December resolution. So it's not here. Which was the question I asked earlier.'",
        "'speaker_3': 'Thank.'",
        "'speaker_0': 'Okay. That's for Villa.'",
        "'speaker_1': 'I guess my concern is we've we've I mean, I was part of that previous council and I was one of the people that had a concern about the privacy analysis and also the privacy having a privacy policy. And that was supposed to be the the kind of the the fix was to to do an analysis as these'",
        "'speaker_1': 'things came to us. So, you know, is it possible to get an analysis and then have this item come back or certainly.'",
        "'speaker_0': 'Okay. The so. I think that that's something for the council to decide. Right now, we have six speakers lining up to speak. This is an item that was continued from a previous agenda. I am sorry that this wasn't clarified sooner, but I.'",
        "'speaker_0': 'It's also not clear to me that council is going to implement anything tonight. I think we might just be giving direction to come back with more information, including the privacy analysis.'",
        "'speaker_1': 'But I.'",
        "'speaker_0': 'And either of the. City attorneys who are on screen, if you want to weigh in. But I. Mr. Cohen, I think you're in the hot seat tonight.'",
        "'speaker_3': 'All I can say is, you know, to reiterate what I said, I was not aware of the direction that. Related to this, providing a written analysis. And now that, you know, I will take a look at the email that was just forwarded to me as we were speaking.'",
        "'speaker_3': 'And I will review the email and review the requirements, and I would be happy to provide an expeditious written analysis if that's the council's direction.'",
        "'speaker_0': 'So let me ask this. Okay. I am mindful of time because we have well, all of our items are important. That we.'",
        "'speaker_1': 'Do.'",
        "'speaker_0': 'Is so you need. Well, okay I would like it is my desire to move forward with our public speakers at this time and what we decide to do with this item. We can we can decide that is I would like to hear the public speakers unless there is some reason that anyone from staff thinks that that is'",
        "'speaker_0': 'not. The appropriate way to proceed. But you'll need to meet yourself and speak if you do. City attorney Cheyenne.'",
        "'speaker_3': 'Yes, Madam Mayor. While the speakers are going forward, may we ask the city clerk to look at the council directions, if possible, electronically, to sort of confirm what directions were given and not given? Because we are seeing some emails, email communications between the councilmember, Councilmember Knox White and the city manager for the first time right now.'",
        "'speaker_3': 'So it will be helpful for the city clerk to confirm what council tractions were given and not given. That will be helpful.'",
        "'speaker_0': 'Okay. I have another idea. I think that's a that's a great suggestion. Mr. Chan, I'm just wondering if under the item seven B, I'm thinking of maybe holding this one for a moment and moving forward on item seven.'",
        "'speaker_0': 'Be a better ARPA funding, but are we going to be needing the same staff involved? Not Chief Joshi, obviously, but I'm just trying to be as efficient with time as possible, noting that it's now past 10:00. This is well.'",
        "'speaker_0': 'How how long do you think you need a mr. Chen? Because we can certainly call a break.'",
        "'speaker_3': 'I think that's more of a question for the city clerk.'",
        "'speaker_0': 'Madam Clerk, where do you think?'",
        "'speaker_2': 'Can pull it up while you're doing the speakers or if you want to you know stop this item and go to it is different staff for seven be. So if you wanted to pause this item and call seven be it's your prerogative I'm I'm fine with either.'",
        "'speaker_0': 'I feel like the staff on this item should perhaps also be listening to the public speakers. But I want to keep things moving.'",
        "'speaker_2': 'There are now ten speakers just to give you an update on speakers.'",
        "'speaker_0': 'Okay. Mr. Chair.'",
        "'speaker_3': 'And Madam Chair, I think my understanding is that there is real confusion. I'm just looking at some communications between staff about whether or not a personal privacy policy was actually in the direction from the council or not. So I think it is it would be helpful at some point for the city clerk to confirm what the council'",
        "'speaker_3': 'direction really is, because that, I think will clarify the council's direction either now it or continue later today, another council meeting. But I think the city clerk's report back on what the council direction is or was will be really important.'",
        "'speaker_0': 'Agree. Madam, quick, if I were to move ahead on seven BYU for you, work that out with it. Do you have the staffing to do that?'",
        "'speaker_3': 'Yeah.'",
        "'speaker_2': 'I can. I can step away and stuff can handle. Yeah. As soon as you call the other item. Yes.'",
        "'speaker_0': 'Okay, cool. So that's what I'm going to do. I'm going to jump ahead to seven B and let's see if we can get through that and then we'll come back to to succeed. All right. All right. Madam Clerk, I don't know how you do it, but could you please introduce this item?'",
        "'speaker_0': 'And I'm going to assume that we have waiting in the wings, whoever the appropriate staff are, for this issue.'",
        "'speaker_2': 'This is the assistant city manager and also Jennifer Tout will be promoted to me is adoption resolution amending the capital budget by increasing appropriations in the 2021 American Rescue Plan Project by 1,911,000 for replacement of three portable and portables and decking at the Midway Shelter Food Bank Facility, repairs and purchase of wireless hotspots for lending.'",
        "'speaker_0': 'Thank you. And Mr. Chan, do you feel like you need a city attorney on this one? And if so, do you have someone to send us or.'",
        "'speaker_3': 'I don't need to be searching with the city clerk, so I think I'll be fine then.'",
        "'speaker_1': 'You just. If you need me.'",
        "'speaker_3': 'She can text me.'",
        "'speaker_0': 'She contracts you. Perfect. All right. So good evening, everyone. Welcome. So, Mr. Burden, this tale of who's going to lead us off on this item.'",
        "'speaker_3': 'Good evening, Mayor. As the abstract. I'll lead off. I'm not sure if city clerk here is going to be able to advance slides for us or not on this. But if not, I'll just flits through. I don't know if are.'",
        "'speaker_0': 'You able to do a screen.'",
        "'speaker_1': 'Share?'",
        "'speaker_3': 'It looks like it started for us.'",
        "'speaker_0': 'Look at that. Okay.'",
        "'speaker_1': 'All right.'",
        "'speaker_3': 'So, so good evening once again, mayor and council. It's great to be with you again. The city council's taking a really thoughtful approach to assessing our priorities relative to the American Rescue Plan Act or ARPA funds that have been provided to the city by the federal government.'",
        "'speaker_3': 'We are in the process of receiving about $28.6 million in total. We have to fully assign this just a reminder for council and for people who are tuning in for the public side, we do have to assign those funds or allocate those funds to projects by December of 2024 and then the full spend, all the funds has'",
        "'speaker_3': 'to be has to be completed by December of 2026. So in May of this year, the Council did adopt a set of guiding principles for the use of these funds and directed staff to focus on a relatively short list of topic areas.'",
        "'speaker_3': 'In July, we discussed again with kind of narrowing a focus down to housing, affordable housing in particular, as well as some technology needs to support people that have been more impacted by COVID, which is really the central purpose of the ARPA relief funding that they came from the federal government in September.'",
        "'speaker_3': 'We continue to focus on housing and wireless technologies, and I'll say next slide. All right, we got the slide up and then I play straight through with that that slide. But we'll go to slide three now, please.'",
        "'speaker_0': 'So magic.'",
        "'speaker_3': 'Yeah. Since since September, there have been a few council discussions related to ARPA funds for specific projects. The projects are listed on this slide just for the sake of time. I won't go through them, but they are worth about $8 million of the ARPA funding and so that will move to the next slide.'",
        "'speaker_3': 'I mentioned the time limits. And so that to that end, we are continuing to try to keep moving forward with projects and our ARPA spending with respect to the areas that are consistent with the criteria that were set by council.'",
        "'speaker_3': 'We just want to be moving forward in a timely fashion so that come, come the end of 2026, we've reduced every dollar that has been that's been put towards our community. So at this time, we are recommending these three projects start recommending the Midway Shelter receive $1.8 million.'",
        "'speaker_3': 'They have decking, that is between all of the different buildings and structures out there that is in need of repair, as well as three fairly essential portable buildings that need to be rebuilt. They're just at the end of their useful life.'",
        "'speaker_3': 'So that's a $1.8 million project ask at this time. Similarly, the food bank a lot less money, but the food bank facility is in need of some repairs as well. The parking lot and one of the sheds that are used for storage need about $42,000 worth of work.'",
        "'speaker_3': 'And then the last item is, is another relatively small one, but can be fairly significant. This is the lending hotspot for wireless hotspot lending program. This will put wireless services into the hands of individuals and families that need that service.'",
        "'speaker_3': 'Up to 30 families or individuals would have better Internet service through a library lending program at no cost to them. So the total cost of those three projects that I just summarized are about $1.9 million. Next slide. Thank you.'",
        "'speaker_3': 'Based on the funding that's already been appropriated, the items recommended this evening, we're we're really looking at most of the first tranche or a lot of the first tranche of our ARPA funding, which is a little over $14 million.'",
        "'speaker_3': 'And that work will be underway fairly quickly. Staff will continue to seek direction. This is not your last opportunity to talk about ARPA funding. We'll probably be back on a quarterly basis. Give or take. Budget manager Towle has been instrumental in this effort.'",
        "'speaker_3': 'She's helping us not just with helping to set up these recommendations, but also in terms of the tracking and reporting that goes with ARPA dollars. So at this time, staff is recommending that the City Council approve the spending plan and budget appropriations to fund the additional projects that have been summarized tonight.'",
        "'speaker_3': 'And we will be back in in early 2022 to continue discussing ARPA eligible projects. So that concludes our presentation this evening. But your manager, Tal and I and others on staff are available to answer any questions you might have.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And, Mr. Burton. Nice work. Let's see, do we have any from the clerk's office to tell us if we have public speakers? Let's see if we can tell if.'",
        "'speaker_3': 'There are there are about four people with their hand up.'",
        "'speaker_0': 'I did see that. Okay. And so this is a little tricky. I think I need someone from the the city attorney's office, a city attorney, city clerk's office, to to actually call on the people and bring them forward.'",
        "'speaker_0': 'Let me let me see how to do that. While we're all figuring that one out, are there any clarifying questions for staff? Coke. Hold on, everyone. So it's kind of winging it today, huh?'",
        "'speaker_2': 'Is it time to do it? Yeah, I think it magically appears.'",
        "'speaker_0': 'Yeah, basically. I think we have some public speakers.'",
        "'speaker_2': 'We do. We have five. The first is Carey Thompson.'",
        "'speaker_0': 'Good evening, Speaker Thompson. I just didn't know how to do that. Welcome. Are you able to knit yourself?'",
        "'speaker_5': 'Me?'",
        "'speaker_0': 'Yes, you are. I can hear.'",
        "'speaker_1': 'You. Oh, good, good. My name is Kerry Thompson. I am a lifelong resident of Alameda, and I am the vice president and branch manager of Poppy Bank here in town. I'm also the president of Alameda Homeless Network.'",
        "'speaker_5': 'And this hope, this.'",
        "'speaker_1': 'Nonprofit was started in 1989 by then Mayor Ralph Basato. Can we.'",
        "'speaker_0': 'Pause? Pause here time, please. If you would, madam. Click. Can you help us? We're getting an echo from Miss Thompson. Is she should do something different.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_2': 'Oh, you got it.'",
        "'speaker_1': 'Is that better?'",
        "'speaker_0': 'Yeah, that's better.'",
        "'speaker_1': 'Okay. Are you all.'",
        "'speaker_0': 'Right?'",
        "'speaker_1': 'Okay. That's okay.'",
        "'speaker_0': 'We'll start your time again.'",
        "'speaker_1': 'The nonprofit was started in 1989 by then Mayor Ralph Esposito in 2008.'",
        "'speaker_5': 'And began chose building futures to operate Midway Shelter H and continues to raise private funds all year long to keep the.'",
        "'speaker_1': 'Shelter operating on behalf of aging. I want to thank you for ensuring that the women.'",
        "'speaker_5': 'And children served at Midway have a safe, welcoming place to call home while they recover and forge positive, positive futures. I really urge you to approve this funding to make sure that the work that HHS and the Building Futures has brought to the community and to help these women and children continue productive.'",
        "'speaker_1': 'Lives and become.'",
        "'speaker_5': 'Wonderful citizens of Alameda and give back. You know, I recently met a.'",
        "'speaker_1': 'Wonderful woman who was a former resident, and she is now.'",
        "'speaker_5': 'Very happily. Productive citizen has raised her daughter.'",
        "'speaker_1': 'And now is raising grandchildren, and she is just so thankful for the work that Midway has done for her. So I.'",
        "'speaker_5': 'Just encourage you to approve.'",
        "'speaker_1': 'This funding. Thank you.'",
        "'speaker_0': 'Thank you. Ms.. Thompson, our next speaker.'",
        "'speaker_2': 'Alec Graber.'",
        "'speaker_0': 'Good evening. Speaker Graber. Are you able to? Speaker Graber. I never know what to do to help people.'",
        "'speaker_2': 'I know I hopefully she has the most recent version of the Zoom. There's a way I can ask them to unmute, and sometimes that prompts them, but it looks like she's not able to. We can call the next speaker.'",
        "'speaker_0': 'Why don't we do that?'",
        "'speaker_2': 'Okay. Brian Kennedy.'",
        "'speaker_0': 'Good evening, Speaker Kennedy.'",
        "'speaker_3': 'Good evening, everybody. Have a shutout and a question for everybody here. Several years ago, then, President Trump declared a day of remembrance. A day of remembrance for victims of illegal aliens.'",
        "'speaker_0': 'All right. I'm going to stop you there, Mr. Kennedy. This is as far as comments on our expenditure of ARPA funds. So if you'd like to comment on our expenditure of our funds, please do so at. We lost him.'",
        "'speaker_0': 'Okay, it looks.'",
        "'speaker_2': 'Like we can. He's. He's back if he wants to speak on our behalf.'",
        "'speaker_0': 'Okay. And again, this is item six C direction 30 7a7b regarding the appropriations for American rescue plan dollars. Speaker Kennedy.'",
        "'speaker_3': 'And you're skipping the topic b the feds have buried you. You should be. Okay, that's enough. And with that smirk off your face.'",
        "'speaker_0': 'All right. We'll go to our next speaker. I see Speaker Graber is possibly needed.'",
        "'speaker_2': 'Yes. Let's see if we can get her back in table.'",
        "'speaker_0': 'I know I said that in the mute comes up. Speaker Graber Are you able to mute? Think the gremlins got into the system tonight. Let's try for our next speaker, because we've got two more speakers.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Just keep trying.'",
        "'speaker_2': 'Yes. Thompson Thomas.'",
        "'speaker_0': 'Was there. Okay.'",
        "'speaker_1': 'Good evening. Made it. Now the mayor, city council.'",
        "'speaker_5': 'Members and staff. Some of you may know me as the newest, I think, retired fire captain from Alameda Fire Department. So I guess I'm used to being up at this hour on calls. This is just a different kind of call.'",
        "'speaker_5': 'But I'm trying to stay pretty active in Alameda with organizations, so I'm really happy to see a couple of the organizations I support on your list for receiving these funds.'",
        "'speaker_1': 'But for the past six.'",
        "'speaker_5': 'Years, I've served on building Futures Board of Directors as Secretary, actually with the main impetus for first joining the Midway Shelter, because it appeared that every organization I was involved with in town had something to do with Midway Shelter, big or small.'",
        "'speaker_5': 'Everyone likes to support Midway Shelter.'",
        "'speaker_1': 'So I could not refuse when they asked me to join the board.'",
        "'speaker_5': 'But the physical structure of Midway really does need some serious help. The portables are old, and more than that, they're really heavily used. They're not like my children's school.'",
        "'speaker_1': 'Portables, where they're used five days a week.'",
        "'speaker_5': '10 hours a day. They are used 24 seven, and they are really heavily used and they are worn out. So I really do think the city manager for recommending this funding to rehab.'",
        "'speaker_1': 'Midway and to the city council for hopefully approving these funds. We know the impact that Midway Shelter has. I mean, the women and children there, they get case management, they.'",
        "'speaker_5': 'Get domestic violence support, they get linkage to housing programs. But there's really also something special that they get there. And I have the opportunity to talk to staff.'",
        "'speaker_1': 'Now and then. And I once asked them, you know, what makes Midway extra special? What makes it work? And one of the staff members said.'",
        "'speaker_4': 'It's because they love.'",
        "'speaker_5': 'On their ladies and children. And that's what they.'",
        "'speaker_1': 'Said they love on their ladies and.'",
        "'speaker_5': 'Children. But for them to keep giving the love to their clients, they really need a safe and secure structure to do this in.'",
        "'speaker_1': 'And so I would really hope that.'",
        "'speaker_5': 'We consider the funding for this project because their work is truly.'",
        "'speaker_1': 'So important. So thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_2': 'Jennifer Murkowski.'",
        "'speaker_0': 'Good evening, Speaker Murkowski. Please be able to mute. Yes.'",
        "'speaker_5': 'Hello. Thank you for their.'",
        "'speaker_1': 'This important topic. I strongly support Midway Shelter and the food bank and I apologize because of the lateness of the hour. I have forgotten the third item that you are considering, but the first two are.'",
        "'speaker_3': 'Really quality.'",
        "'speaker_1': 'Programs that I value the city investing in. I just asked, this is not the last of the ARPA dollars. There is a lot of incredible needs and I encourage the city to actively engage with its community members of what are additional valued resources to use these dollars for.'",
        "'speaker_1': 'I think you've identified some excellent choices tonight, but continued community engagement so that we really invest the dollars most.'",
        "'speaker_5': 'Effectively at this critical time. Thank you.'",
        "'speaker_0': 'Thank you. Any further speakers?'",
        "'speaker_2': 'That's right.'",
        "'speaker_0': 'They're hiring. So with that, we will close public comment on item seven B and we'll take council comment. I see Councilmember Harris, but I'm going to go with Councilmember Desai just because he hasn't spoken by then. Back to you, Councilmember Spencer.'",
        "'speaker_4': 'Actually, it's just a quick question. Were we able to figure out how to get in touch with Israel Graber?'",
        "'speaker_2': 'She's still on and she lowered her hand. So I'm not sure if just, you know, is like.'",
        "'speaker_0': 'Or perhaps wants to speak on a different item because she certainly emailed us on different on some different.'",
        "'speaker_1': 'Items. But you're.'",
        "'speaker_0': 'Right. Yeah. Okay. Councilor Spencer.'",
        "'speaker_1': 'I'd like to move approval of this item in total. I really think all three of these. And I do want to thank all the speakers and everyone that we received letters from emails and staff's work on this. As we've heard, sentiment is very good work that wrote one of the smallest items is the hotspots.'",
        "'speaker_1': 'And that's one of the things that I've been hoping and I know many people have. And it goes to how do we get Internet service as quickly as possible during a pandemic? And so I'm very happy to have that be included in this.'",
        "'speaker_1': 'But the other two projects we have going on right now, the food bank work, is actually to address flooding that goes on in their facility and leakage. So I think that's absolutely critical. And of course, Midway Shelter that we heard and this I think congratulations to Gail Thomas on your retirement is great to hear her here speaking'",
        "'speaker_1': 'and sharing another speaker in support of Medway so that I'm moving that we adopt staff's recommendation. Thanks.'",
        "'speaker_0': 'Okay, I'm going. Just before I look for a second, I want to just add a little bit of staff direction that I hope that the Council will will also adopt. One of the things and I'm all for the proposals that are before us.'",
        "'speaker_0': 'I did want to note really quickly that you saw the chart of expenditures and one of them was about $26,000 that we spent of our money on the feed, our immediate program, where we actually paid our meter restaurants to prepare meals that were then taken to homeless shelters, midway, the FEMA trailers, Village of Love, and even to'",
        "'speaker_0': 'our encampment. And we actually raised another almost equal amount. So we were able to keep that program going, I think nine or ten months and every week a different once or twice a week, a different restaurant got a guaranteed income.'",
        "'speaker_0': 'We got to provide this money. But I did want to recognize that Alameda residents organizations, including our Police Officers Association and our firefighters Local 689 underwrote some of those costs. So it was, you know, we put in seed money and they matched it.'",
        "'speaker_0': 'And then the other item that I would like us to consider, and this is part of direction to staff, I would like us to consider the ability to explore, setting aside some of the money from the ARPA funds to provide a match for the A Universal Basic Income Program.'",
        "'speaker_0': 'And so we've talked about that a little at this body that's come up before. And right now in the governor's budget, Governor Newsom has allocated $35 million for a pilot program that local cities and counties can apply to.'",
        "'speaker_0': 'And but it will require some some match of some local local funding match. We don't have all the details. We've been in communication with our senator, Nancy Skinner, his office. She also chairs the Senate Budget Committee. And so they're watching for the guidelines to come out.'",
        "'speaker_0': 'But I'd like our city to have the flexibility to allocate some of our ARPA funding to be matched, to get us started with a a universal basic income program, something to explore in the coming year. So I would love to have the Council's endorsement for including this as a staff direction to explore.'",
        "'speaker_0': 'And I'd also like to name Councilmember John Max White if he would be willing to work with me on exploring this potential program, because I know we've both both expressed interest in it in the past. Okay. With you, Councilmember, if we get the endorsement of our colleagues.'",
        "'speaker_0': 'Yeah, okay. And and so and then I guess I have one question I'm all for. This is perhaps for you, Mr. Burton, that on page six of my staff report, it talks about staff as county water, wastewater and stormwater infrastructure staff for evaluating the benefit of using our defense to pay for construction of a portion of these'"
    ],
    "Recommendation to Authorize the City Manager to Execute a Second Amendment to the Agreement with Kittelson & Associates to Increase Compensation by $270,906, for a Total Aggregate Compensation Not to Exceed $345,876 to Continue Providing Technical Services Related to Roundabouts. (Transportation 20962743)  [Continued from December 7, 2021]": [
        "'speaker_0': 'items to allow the city to advance projects that are experiencing delays. Would this be funding that would then be reimbursed by a developer, went to developer, came in to those particular items into those particular areas.'",
        "'speaker_3': 'We've thought about it both ways. We thought about it as an investment in the community based on the allowed uses of ARPA dollars. And then we've also thought about it as a as a possible reimbursement, depending on how the the the project continues at Alameda Point, there's still things that are moving through our process internally.'",
        "'speaker_3': 'And so this gives us some options. But the, the eligible uses do include water and water, sewer and broadband infrastructure. So we thought we'd put it into the mix for future discussion.'",
        "'speaker_0': 'Absolutely. So it'd be fair to say that we don't have to make the election at this point in time, whether the city picks up the final tab or. Okay, that's that's fine fee. So Councilmember Harris Spencer.'",
        "'speaker_1': 'Thank you. I wanted to ask, I guess the city attorney I don't in the title of this document does not include UPI and nor is it in the list I can see in the staff's report. And so I'm wondering if that's actually part of the that was noticed.'",
        "'speaker_0': 'Hi, Mr. Chan.'",
        "'speaker_3': 'Councilmember I'm happy to answer. Generally, the Council is able to give very brief direction to staff that's related to an item in front of the council. And so in this case, the Council is being asked to spend ARPA funds, and I believe the direction that's being asked is to look into, not make any final decisions and not'",
        "'speaker_3': 'allocate any funding, but look into the other way of spending. As long as it's brief direction that does not involve a lot of discussion, it's fine because what would happen out of that brief reaction to that? I'll take a look and bring back to you a real item.'",
        "'speaker_1': 'Thank you. I think it's important to get that on the record.'",
        "'speaker_0': 'Yeah. Thank you for doing that. Okay. So we have a motion, I take it with the with the direction.'",
        "'speaker_1': 'I think I also think I need to accept the friendly amendment, so I'll accept the friendly amendments.'",
        "'speaker_0': 'Great. Thank you. Then I'm looking for a friendly second Councilmember Knox Way.'",
        "'speaker_3': 'And Lee second.'",
        "'speaker_0': 'Already we get a friendly roll call vote place.'",
        "'speaker_2': 'And somebody said yes. Cary Christiansen.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Knox Right.'",
        "'speaker_3': 'By.'",
        "'speaker_2': 'Vela. I as the Ashcroft.'",
        "'speaker_0': 'I and I probably should have included. Thank you. Go ahead and finish. I want to just say that these guys five guys, five guys and I do want and I'm sure the council agrees, we really want to send a huge shout out to our wonderful colleagues and partners at Building Futures and the amazing work they do, not'",
        "'speaker_0': 'just at our Midway shelter, they do the vital work all over this county and also the food bank. They've been doing amazing work since that well, even before the pandemic. But then they just really had to kick it into high gear with very short notice.'",
        "'speaker_0': 'And the Hotspots Lending Library is great idea. So thank you. Thank you. We're going to do a lot of good things with this money. So have we given everyone enough time to return to item fixing? Because we're going to close this item, item seven be now.'",
        "'speaker_0': 'What's what's up next? Staff and the celebrity manager.'",
        "'speaker_3': 'Yes. So we've we've looked at it. And so my recommendation is we've looked and there are different opinions whether or not the report back to council as far as how it complies with the privacy resolution and ordinance. There have been different opinions on it, however, and there was some confusion within the emails earlier before this item came'",
        "'speaker_3': 'to council. So my recommendation is I still believe that it meets the policy. It's just the report to council showing how it meets the policy. If the council wants to move forward with us bringing back Lpas and either fixed or mobile, I'd recommend we bring that privacy, that we bring the privacy analysis at that time when we'",
        "'speaker_3': 'bring that item back. That would be my recommendation at this point.'",
        "'speaker_0': 'Okay. Thank you for that. And I take it you've concurred with the attorney. Someone from the city attorney's office say you're in agreement. Yeah. Mr. Chen.'",
        "'speaker_3': 'Madam, and happy to share my thoughts, which is that we did the city clerk pull the council motion and she shared with all the staff and she can share with the council probably by sharing a screen, reading the motion.'",
        "'speaker_3': 'It is not entirely clear to me that a personal privacy policy is necessarily required. But that's just reading the one page of minutes. The city managers indicated that if the council wishes to move forward, he would have staff.'",
        "'speaker_3': 'He would have his staff prepare such a statement in any event, which would seem to satisfy the council's needs and probably obviate the need to call this question that we and we at least we we, as in me, just heard about this question in the midst of the council discussion.'",
        "'speaker_3': 'So I think the city manager solution is an elegant one response to the council's needs and allows us to move forward if the council desires.'",
        "'speaker_0': 'We like elegant solutions. All right. Um, so at this time, because there's some decisions to be made whether this move item moves forward, but if it does, then it would come back with this personal privacy policy if I get the word incorrect.'",
        "'speaker_3': 'And now the analysis.'",
        "'speaker_0': 'Analysis. Analysis. All right. So we are back on item six C. And as I recall, we had speakers, public speakers on this item, Madam Kirk.'",
        "'speaker_2': 'We did. We were at the show. Yeah, we do. They're raising their hands again, so.'",
        "'speaker_0': 'We'll.'",
        "'speaker_2': 'Win. But now.'",
        "'speaker_0': 'Would it be good to reintroduce this item since we're short?'",
        "'speaker_2': 'That's a great idea. We might.'",
        "'speaker_0': 'We might be confusing people.'",
        "'speaker_2': 'Yeah. So we're back on 60. That's the recommendation to provide direction on staff regarding installation use of automated license plate readers, including fixed mobile equipment, and now these police department vehicles. And we are back up to eight speakers.'",
        "'speaker_0': 'All right. So with that, I'm going to take the public speakers, please, Madam Clerk. So you and your right to tell them about time.'",
        "'speaker_2': 'Since there are more than six speakers, there's now nine and each speaker will get 2 minutes. And the first speaker is Bill Pye.'",
        "'speaker_0': 'All right. Good evening, speaker pie.'",
        "'speaker_3': 'Good evening. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'So thank you. My name is Bill PY and I'm President of the primary board for the Community of Harbor Ballard. We're located on Bay Farm Island and our community is comprised of 20 homeowners associations and almost 3000 homes in total.'",
        "'speaker_3': 'My thanks to all members of the City Council, the mayor and staff for your efforts on behalf of our city. Happy holidays to all. So my comments today are to make clear that the community will be. I'll supports expanding the use of automated license plate readers, all referred to them as helpers at strategic points in our city'",
        "'speaker_3': 'community. We've been doing this discussion for years and I think that the recent increases in crime and staffing constraints at the police department make this issue even more important to consider now. Now we recognize that the Alpers are not a cure all for crime by all, by any means.'",
        "'speaker_3': 'But we believe they can be a valuable asset in helping to discourage crime. To cite one location specific to our community where Bay Edge Road becomes Harbor Bay Parkway. This backdoor entrance to our community allows criminals to rapidly exit the area and be on Ron Cullen Parkway within a couple of minutes.'",
        "'speaker_3': 'There's no way law enforcement can respond quickly enough to address that kind of issue. I realize that there are privacy concerns and residents who do not wish the APD to have the information collected by Alpers. But with proper safeguards, we believe the benefits outweigh the risks given the relatively limited number of interest routes to our city.'",
        "'speaker_3': 'Automated license plate readers could have a strong impact once criminals know their plates will be photographed and recorded. The community of probably firmly supports installing automated license plate readers at appropriate points within our community and our city. Thank you.'",
        "'speaker_3': 'Thank you. And happy holidays.'",
        "'speaker_0': 'Thank you. And our next speaker.'",
        "'speaker_2': 'Sure. Kim.'",
        "'speaker_0': 'KDP Speaker Kim.'",
        "'speaker_3': 'Happy holidays, everybody. Thank you. Mayor Ashcroft and city council members for allowing me to speak. My name is Richard Kim, and I am the past president of the East Shore Homeowners Association, which consists of 142 single family homes on the east end of the main island.'",
        "'speaker_3': 'First of all, I commend all of you for the hire of Police Chief Michel and Joshi. Our association had the honor of meeting with him and hearing his vision and plans for the safety of our city. We fully support his vision and would like the Alameda Police Department to have the technology and the resources that will allow'",
        "'speaker_3': 'them to address our number one concern, which is safety. During the past two years, we have experienced robberies, vandalism, assaults and even deaths. One of our neighbors had a home invasion on Friday midday at 230 in the afternoon.'",
        "'speaker_3': 'Earlier this year, the invaders had a gun and thank God nobody was injured. This is not the Alameda that we know. A discussion on license plate readers has been an ongoing one and we hope it will be approved.'",
        "'speaker_3': 'There are three data points which we consider. One, there was a reduced headcount of sworn officers for the Alameda Police Department and they need the help of technology to the readers are an investigative tool and they do not replace officers and by themselves do not solve crimes, but act as a deterrent to crime and save people hours'",
        "'speaker_3': '. A good example of this is the city of Piedmont, which uses these readers. And lastly, there are fears about privacy and preventing access to the data that we feel that resolution proposed by the city can make this a win win proposition.'",
        "'speaker_3': 'I humbly ask this forum to approve the installation and use of the automated license plate reader. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_2': 'Denise Anderson.'",
        "'speaker_0': 'Good evening, Speaker Anderson.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_1': 'Some years ago I was pulled.'",
        "'speaker_5': 'Over and approached with.'",
        "'speaker_1': 'Guns drawn.'",
        "'speaker_5': 'Because my car was the same color as a car involved.'",
        "'speaker_1': 'In a crime.'",
        "'speaker_5': 'Not even the same car, just similar and.'",
        "'speaker_1': 'The same color. It was extremely traumatizing. But there isn't any evidence that Alpers would prevent mistakes like this.'",
        "'speaker_5': 'If these devices truly, really, truly assisted in.'",
        "'speaker_1': 'Significantly increasing clearance rates. There is no way these departments wouldn't be tracking that to justify these and other cities. A quick search of any social media platform, and you'll find dozens upon dozens of stories of people with stolen license plates.'",
        "'speaker_1': 'While this is just anecdotal evidence that is just as valid as the anecdotal evidence presented by Chief Joshi. We are.'",
        "'speaker_2': 'Quickly experience a crime wave instigated by very.'",
        "'speaker_1': 'Organized criminals. But now I'm supposed to believe that these sophisticated masterminds can't figure out how to unscrew license plates and keep a stash on hand or print counterfeit dealer plates. There's a lot of money to devote to more surveillance.'",
        "'speaker_1': 'It hasn't proven to be an effective and reducing crime or helping to clear a significant amount of crimes committed. Thank you.'",
        "'speaker_0': 'Thank you. My next speaker.'",
        "'speaker_2': 'Zak Bailey.'",
        "'speaker_0': 'Good evening. Speaker bowling.'",
        "'speaker_3': 'Hi there, counsel. Yeah, I see how the department can see.'",
        "'speaker_4': 'The importance of this.'",
        "'speaker_3': 'Tool, but I do have concerns about.'",
        "'speaker_4': 'Privacy. I'm concerned about secret subpoenas, rogue actors, misuse. I'm an engineer, but for 20 years, I've been working on implementing systems that are private.'",
        "'speaker_3': 'Secure, secure by design.'",
        "'speaker_4': 'In ways that can't be reversed. And as an engineer, I seriously want to look in depth at these different vendors, exactly how they implement their data storage. In that vein, I would urge an in-depth analysis of any solution from any vendor, because Googling and looking at most of the products that I've found, I'm concerned just on reading'",
        "'speaker_4': 'product data sheets because these don't look like they were written.'",
        "'speaker_3': 'By security engineers. It's my understanding that the.'",
        "'speaker_4': 'Mobile.'",
        "'speaker_3': 'License plate reader.'",
        "'speaker_4': 'Systems are more real time. They don't store and review for later, so there's not as much of a storage component with it as there would be with a fix system.'",
        "'speaker_3': 'So concerned about the cross-referencing that these devices.'",
        "'speaker_4': 'Do, I'm concerned about the incremental data collection more than just license plate readers and timestamps, but just the full images and what could be accidentally cotton. Those concerned about the.'",
        "'speaker_3': 'The fact that there is a bit in one of the presentations that shows if they're a resident or not and I don't know if that's just informational, but that kind of information shouldn't be automatic.'",
        "'speaker_4': 'That it should be more investigation, should be should be for that. So I'm not against the idea of automatic license plate readers, but I'm very concerned about how they're implemented currently by any vendor that exists. And it terrifies me that a subpoena or somebody could come along and collect this data.'",
        "'speaker_3': 'Or.'",
        "'speaker_4': 'Some other entity could collect this data without anybody following our policies that we set. And that's my concern. So I'll leave it at that.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_2': 'Elk Irvine.'",
        "'speaker_0': 'Good evening, Speaker Garbine.'",
        "'speaker_3': 'Good evening, council members and Mayor Ashcraft, thank you for permitting me to remark on this. I'm a bit frustrated and confused by the by the mechanism that this agenda item has been heard and then not heard and then deferred.'",
        "'speaker_3': 'However, as a resident of the Fern Side Marina neighborhood, where we have quite a bit of crime, I'm speaking as an individual, but I am definitely speaking in favor of the installation and use of fixed and mobile automated license plate readers by the Alameda Police Department.'",
        "'speaker_3': 'I believe it is this council's primary responsibility to provide for the safety and security of city residents. And while there may be adjunct concerns in this, I trust Chief Joshi to do the right thing and follow council direction.'",
        "'speaker_3': 'And I want you, though, to give him and his department the chance, because these things appear to be a valuable crime fighting, an investigatory tool that will primarily serve the strong interest. And I believe your primary duty, the primary interests of the community in public safety and security.'"
    ],
    "Recommendation to Provide Direction to Staff Regarding the Installation and Use of Automated License Plate Readers (ALPR), including Fixed and Mobile Equipment on Alameda Police Department Vehicles. (Police 10031110) [Continued from December 7, 2021]": [
        "'speaker_3': 'Therefore, I very respectfully ask that you go ahead and permit APD to acquire a fixed and mobile automated license plate readers. I thank you very much for listening to my remarks.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_2': 'Marilyn Roffman.'",
        "'speaker_0': 'Good evening, Speaker Rothman.'",
        "'speaker_1': 'Hello again.'",
        "'speaker_5': 'I tapped into the same thing a previous.'",
        "'speaker_1': 'Speaker noticed in the first screen of the presentation. Why would.'",
        "'speaker_5': 'Anybody need to know whether some car.'",
        "'speaker_1': 'Hat was a resident.'",
        "'speaker_5': 'Or not? That has nothing to.'",
        "'speaker_1': 'Do with crime. Nothing. I find that the.'",
        "'speaker_3': 'These.'",
        "'speaker_5': 'Readers are totally.'",
        "'speaker_1': 'Detrimental to public privacy and will actually increase the police imprint, which I am against. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_2': 'Michael Robert Long.'",
        "'speaker_0': 'Good evening. Speaker one This one.'",
        "'speaker_3': 'And you hear me?'",
        "'speaker_0': 'Yes, we can. Hi.'",
        "'speaker_3': 'Thank you, Mayor and council members. This past October, the presidents of 50 of our highways across Alameda met with this police chief. We asked him to address the unease that many in our nearly 7000 homeowner households felt about the crime happening all around our island community.'",
        "'speaker_3': 'Given that you have capped the storm ranks at 50 and 88 excuse me, more than a few presidents support the idea that to keep Alameda safe, the use of the technologies such as license plate readers is crucial. With some homeowners talking about moving to a safer city, we are at a tipping point.'",
        "'speaker_3': 'This is especially true here in Bay Farm, where increased auto steps have directly affected the number of our neighbors. With the support of my Board of Directors and as President of the 201 households in the Costa Brava Highway, I support implementing the Chief's plan to deploy Alpers with the caveat that the shelf life of that data collected'",
        "'speaker_3': 'and its access are strictly controlled, as he has discussed. Thank you very much.'",
        "'speaker_0': 'Thank you. Let's see, we have yes, we have 12 minutes left. Okay. Let's get to our public speakers and then council. We need to take a housekeeping vote. And I want to commend all the public figures you're doing brilliantly at staying within your time limit.'",
        "'speaker_0': 'So thank you. Who's next?'",
        "'speaker_2': 'In a hurry.'",
        "'speaker_0': 'Koski welcomes Speaker Rakowski.'",
        "'speaker_1': 'I thank you. I am concerned. Yes, we are an island, and that is a strategic point. But we are not at war with our neighbors. And setting up license plate readers at the entrances and exits to the island give off a message of unwelcome that could have a negative impact on our residents and our businesses and our'",
        "'speaker_1': 'community and our values. This is an expensive proposal with questionable value, and I am also concerned that while it is being pitched to.'",
        "'speaker_3': 'Us to be able to solve.'",
        "'speaker_1': 'Dramatic missing persons and strong robberies, things of that sort that in fact caught up in the license plate, readers will be struggling folks with unpaid parking tickets or with their vehicle registration behind in these hard times. And I'm not seeing protections built into the policy that the goal is that this is being.'",
        "'speaker_3': 'Sold.'",
        "'speaker_1': 'For our community towards actually going to be how this program would be utilized, especially given sort of recent experiences with the mobile license plate readers. So a lot of questions and I am looking forward to a more complete analysis on privacy coming back to council.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_2': 'Melody Montgomery.'",
        "'speaker_1': 'Hey.'",
        "'speaker_0': 'Good evening. Speaker Montgomery.'",
        "'speaker_1': 'Good evening. Thank you for having me. First of all, thank you for Jennifer. To Jennifer, for all her words, she just spoke. I agree with everything she just said. A Alpers don't stop crime. They're not a they're not anything that stop crimes.'",
        "'speaker_1': 'And as you'll see the analysis, look more and look deeper into it, you'll find the same numbers that we found. They make it makes citizens feel like they're watching. Like are we living in an oral society where Big Brother is just going to.'",
        "'speaker_4': 'Have eyes on all the time? We're leaving the island. We're coming back to the island. We're leaving the island or coming back to the island.'",
        "'speaker_3': 'It's not a comfortable feeling, and it's not.'",
        "'speaker_1': 'Some place that you makes you feel like home. Typically, these things have also been placed in targeted neighborhoods where we'll be placed the east side, the west side. I think you already know. Citizens. Alameda do not need to be monitored like that.'",
        "'speaker_1': 'I'm going to respond to something, things that the chief said about knowing when stolen.'",
        "'speaker_3': 'Vehicles are on our island.'",
        "'speaker_1': 'But then he said that we wouldn't they wouldn't be using the information unless a crime was done first. So there was confusion just in his presentation about how the data will be used and where it would be used.'",
        "'speaker_1': 'Yeah. So I think we need a deeper policy and we need to know.'",
        "'speaker_3': 'More about that.'",
        "'speaker_1': 'That it's already confusing. So once again, these do not prevent crime. And so I'm asking you just to say no.'",
        "'speaker_3': 'Just say no to a alpers. Thank you.'",
        "'speaker_0': 'Thank your next speaker.'",
        "'speaker_2': 'Laura. Katrina.'",
        "'speaker_0': 'Did you speak to Katrina?'",
        "'speaker_2': 'Then I couldn't find the mute button.'",
        "'speaker_0': 'You found it?'",
        "'speaker_2': 'I found it. I also want to encourage a on the Alpers. I know in the past there was an article that came out last year that APD was surveilling our community, using facial recognition, disregarding counsel's direction, and that was with the Clearview technology.'",
        "'speaker_2': 'And the article broke through like a national news cycle. And that's not something that I think the Alameda needs to be known for. Right. So I, I have doubts about the use of the use. And I could see there being poor judgment and misuse of this really sensitive information.'",
        "'speaker_2': 'Additionally, the Electronic Frontier Foundation says that this data and it makes sense campaign in an intimate picture of the driver's life. And so it can be used to target drivers who visit sensitive places like health centers, immigration clinics, funerals, protests, etc., etc., religious houses of worship.'",
        "'speaker_2': 'And so, again, I want to also understand what is this going to be used for? I think that they're what I've heard in other speakers, like there's fears about crime and there's this people are revealing they're experiencing more crime to the point that other speakers have made.'",
        "'speaker_2': 'Like, I don't believe that this is going to change the clearance rate of what APD is able to solve. And it's a reactive measure. It's not a proactive measure. And so I would recommend that we spend the money, the 500 to $700000, to reduce the root causes of what maybe some of these crimes are.'",
        "'speaker_2': 'Instead of using that money to surveil the community and create a state where we're being watched, because, again, to the point that I think Miss Montgomery made it, it doesn't feel like a place that I want to be.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. At this time, I know we've got one more public speaker, Madam Clerk. However, it's 1055, and we do need to take that vote. So could we please. So, Counsel, we have to be able to consider any new items after 11 p.m..'",
        "'speaker_0': 'We have to have a motion councilor and that's why it's got his hand up.'",
        "'speaker_3': 'I'm mean here, all the remaining items up until midnight and take another vote of midnight if we want to go for that.'",
        "'speaker_0': 'And this takes four votes to pass. Do we have a second to that? Councilmember de SAG. Going to midnight is your. Okay. You said it. Okay, madam, quickly. We have a real cover.'",
        "'speaker_2': 'Please disappear everyday.'",
        "'speaker_3': 'Shall I?'",
        "'speaker_2': 'Not quite. Sorry. Her expense account?'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'You moved on my screen. Not right. Hi, Vela. I may, as Ashcroft know, that motion fails to do.'",
        "'speaker_0': 'Do we have a motion to perhaps.'",
        "'speaker_1': 'Get through.'",
        "'speaker_0': 'The regular calendar? Or anything else. Councilmember Harry Spencer.'",
        "'speaker_1': 'I'd like to finish this item.'",
        "'speaker_0': 'Well, we will finish this item. This is about whether we take another item after 11. So we don't have a motion to take another item after 11. Councilmember de SAC.'",
        "'speaker_4': 'Well, you know, seven A is a police matter. I'd love to take seven A as well. So that's my emotion.'",
        "'speaker_0': 'Okay to finish seven? Yeah. Okay. Anyone want to second Councilmember Jason's motion? Seeing no hands up and then no further motions. Madam Clerk, this means that we will complete this item. Correct. Subtract 660 and then. And we'll hear nothing further that requires vote.'",
        "'speaker_2': 'Correct. So you would just you've already heard same in their communications would be just sections nine and 11 that you would hear.'",
        "'speaker_0': 'Correct. All right. Okay. So back to our public speakers. Madam Clerk, I think, is even stranger. Yes.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'And and Speaker Graber has reappeared. So let's try and get her to we will welcome Speaker Estrela.'",
        "'speaker_3': 'Yes. Some of the speakers were figuring that maybe the PR was going to be at some fixed jail locations like at bridges. And this agenda item is just putting a L PR on police vehicles. So just to clarify that.'",
        "'speaker_3': 'But that's that's what you folks said earlier. The regarding the local resident box that eight years ago at 530 in the morning I was on my bicycle riding past a car that was broken into. So I called the Almeda Police and gave them the license plate.'",
        "'speaker_3': 'And about an hour later, they showed up and said, Oh, it was for a local resident and it was for that address. So they were able to contact the the owner of the residents there about the the car being broken into.'",
        "'speaker_3': 'So I just saying that that may be a way that the local resident box is used. I have no idea. But it sounds like that's more in the case filing the portion rather than an immediate return on an inquiry on the license plate.'",
        "'speaker_3': 'That's my $0.02. Thank you.'",
        "'speaker_0': 'Thank you. It just so as not to confuse the public. I do want to note that this is this item is a recommendation to provide directly to staff regarding the installation use of automated license plate readers, including fixed and mobile equipment on Alameda Police Department.'",
        "'speaker_0': 'Vehicles in the staff report lists out the actual fix the proposed fixed locations. Okay. Our next speaker is.'",
        "'speaker_2': 'Are you like her neighbor?'",
        "'speaker_0': 'She just disappeared. How does that happen? No. She's back. She's not. There you are. Welcome. Yay! You're unmuted.'",
        "'speaker_1': 'Hi. Good evening. I just want to say that I'm I'm really disappointed that it appears the council's not going to be taking action on this tonight. I think this has been going on for over three years. The council needs to face up and make a decision on this.'",
        "'speaker_1': 'I hope once you get this report from Mr. Cohen about allaying the privacy concerns that the council will move ahead and vote for this. It's not. I'm going to get the bad feeling that there are certain people on the council that just are philosophically against this, regardless of the benefits.'",
        "'speaker_5': 'That they may provide.'",
        "'speaker_1': 'To our citizenry. We really need to be thinking of protecting. The residents.'",
        "'speaker_5': 'Alameda residents, first of all.'",
        "'speaker_1': 'And I believe that there was a.'",
        "'speaker_5': 'What do you call it, a survey.'",
        "'speaker_1': 'On next door. And the survey.'",
        "'speaker_5': 'You've probably heard about it or seen it. The survey was 84% of the people want the readers.'",
        "'speaker_1': 'Only 16 are against it. Now, I know tonight the speakers.'",
        "'speaker_5': 'Were more like 5050, but that does not portray. The general residents of Alameda.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'That's my take on it. Thank you very much.'",
        "'speaker_0': 'Thank you. All right. And we finished our public speakers have smoker, correct? All right. So with that, I will close public comment on item six C and we'll take it back to the.'",
        "'speaker_1': 'To.'",
        "'speaker_0': 'The Council.'",
        "'speaker_1': 'For.'",
        "'speaker_0': 'Discussion direction. So again, this is we're being asked to provide direction to staff regarding the installation and use of a as Vice Mayor de.'",
        "'speaker_1': 'I have a couple of concerns. One is I thought that we gave pretty clear direction in the December 2019 meeting about the privacy issue, making sure that we had a privacy policy in place and that we would be following the San Francisco public privacy policy in the interim.'",
        "'speaker_1': 'And so I just I'm a little worried that we're we're undoing an act of the council. And I thought that that was pretty clear direction that was given. And if our meeting minutes don't reflect the the audio, I mean, I'll go back and pull the audio clips if need be.'",
        "'speaker_1': 'But I'm just I'm concerned that we're undoing an act of council relative to that. The second thing is, and I'll make this very clear, I've made this clear in pretty much every meeting that we've had on Alpers. And I feel like this is maybe the third or fourth time this has come back while I've been on council'",
        "'speaker_1': ', that this has nothing to do with whether or not I trust our current chief. I trust our current chief. I like our current Chief. I will continue to trust until I have reason to not. That said, I am philosophically opposed to Alpers and philosophically opposed to them because the data shows that they are not efficient or effective'",
        "'speaker_1': 'against crime fighting. And in fact, I think what we do see is that they cost a lot of money. And I you know, I do worry about the kind of placebo effect of spending money on technology that is not going to be as effective as we say it is.'",
        "'speaker_1': 'I do think that we have given money to our police officers. I've certainly been supportive in that regard of making sure that our police department has funding to fill vacancies and that we are doing everything that we can to not only fill vacancies, but to fill them with quality officers and to give them training and all of'",
        "'speaker_1': 'the things that we need to to to have a good police force. So I just my concern remains the same, which is that I think that this sort of technology creates a lot of opportunities for abuse of power that I that I do not want to support and I cannot support.'",
        "'speaker_1': 'And I don't really understand that there is really no data to show that they are a deterrent other than kind of the anecdotal things that we hear. So I am just, you know, my position hasn't changed. I've waited for for data and studies that really show otherwise.'",
        "'speaker_1': 'My privacy concerns, my concerns about privacy remain. I do want to see staff movement on those policies. I understand that there were issues even relative to our existing mobile. ALPERS There were some with the previous privacy policy that had been proposed and staff was going to work through those issues.'",
        "'speaker_1': 'And I look forward to that policy coming back and being finalized that we're not kind of stuck in this limbo of using the San Francisco policy in the interim. But that's where I'm at. This is nothing. This is not a statement on whether or not I trust our police chief.'",
        "'speaker_1': 'I just really do not support this. I think this is a large expenditure and I don't know that we're going to get our money's worth, and I don't know that we're going to see the deterrents that we expect.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. I consider her a Spencer.'",
        "'speaker_1': 'Thank you, Mayor. First of all, I want to thank all the public comments and all of the emails. And I know this is a controversial issue. I want to thank our chief for all of his work. And I want to thank our former chief, Paul Larry, who brought this while I was mayor.'",
        "'speaker_1': 'And at that time, yeah, well, I wanted to I wanted to quote him to make sure I have it here. So back in looking at an article from February seven, 2018 online, and what he said then is, quote, This is chief power.'",
        "'speaker_1': 'Larry, if there are people in the room who are concerned that the police department is racially profiling folks, here is the tool that does not do that. It doesn't care what Larry said. It doesn't have the ability to racially profile.'",
        "'speaker_1': 'And I remember him saying it at the time, and I and I've heard similar comments. You know what what these things can and cannot do. And I do support the chief's recommendation. My understanding, Chief, is your first and even as listed on the staff.'",
        "'speaker_1': 'Alternative one. I understand that. That's actually your right. Your first ask is direct staff to move forward with the next step in implementation of fixed airports and revamping and expanding the Mobile Dale PR program. So in your professional opinion, is that your primary ask of counsel tonight?'",
        "'speaker_3': 'Yes, that's correct.'",
        "'speaker_1': 'Right. So I would that would be my motion to move forward in that. And Chief, could you explain so in regards to what does that actually look like to move forward? You mean would you all be coming back?'",
        "'speaker_1': 'Would you be coming back at some point in the near future? What does your timeline look like?'",
        "'speaker_0': 'Good achieve Joshi.'",
        "'speaker_3': 'Sir, I was trying to get off it so I would take guided direction from from council on on next steps. But what I my my recommendation is that we move forward with being able to install the equipment, the camera, the clippers at the at the fixed locations that are that are designated and in the staff report.'",
        "'speaker_1': 'May I?'",
        "'speaker_0': 'You may continue. Cancer. Cancer. Thank you.'",
        "'speaker_1': 'And so do you need additional funding and approval? Because I know back in the day we approved, I believe, 500,000. When Chief Larry was here.'",
        "'speaker_3': 'So I think that cost with sickness it would would be significantly less. As I've done more recent research, I think I don't have exact dollar amount, but I think it would be somewhere. There are 13 locations where we want to where we would install the cameras.'",
        "'speaker_3': 'And each camera is $2,750 a year for the first year, and then it drops down to $2,500 a year per camera. So if we have 13 locations and we installed one at each location, it's I think it's around 35 or $36,000.'",
        "'speaker_1': 'And then regards you.'",
        "'speaker_0': 'Have this work ahead.'",
        "'speaker_1': 'Thank you. And in regards to the mobile units.'",
        "'speaker_3': 'So the mobile units, they are a about $200 per vehicle per month.'",
        "'speaker_1': 'All right. Thank you very much, Chief. So I have made a motion there was discussion regarding this privacy program or just I'm not really sure what a privacy impact report that the prior counsel had requested, I believe I'm not really sure, but it looks like I've heard from attorneys saying that they think it's the work that's already'",
        "'speaker_1': 'been discussed satisfies it. However, I am happy to someone that as part of the A friendly amendment, I'm happy to entertain what that looks like. I'm not really sure what it is so far, but I did make a motion to move his first request.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'We can have a fifth. There's a second for that and then we'll have discussion. I will let you know that I'm not supporting that motion and I'm guessing that you don't have three votes. I could be wrong. But Councilmember Desai, did you want to speak at this time or should I.'",
        "'speaker_4': 'Be more than happy to speak? The necessity of license plate readers has been expressed by various councils and and police chiefs and and residents over a long period of time. I recall attending a meeting with Council member Lina Tam.'",
        "'speaker_4': 'I believe it was in 2013. It could have been 2014 and and Chief Noonan could have been the police chief at the time. I can't quite remember if it was 2014 or 2013. And it was a meeting held at Bayport in the west end of town.'",
        "'speaker_4': 'And, you know, mentioned was made up of the the use of license plate readers. And as a result, you know, we did have a discussion about that in city council. And over the years, certainly when and that was when Mary Gilmer was mayor and then certainly when Trish.'",
        "'speaker_4': 'Councilmember Herrera Spencer was mayor. We certainly had that conversation then as well. I think the time of license plate readers, whether there are fixed or placed on on mobile vehicles. I think the time has come in the period of time between 2013, 2014 and today, the way in which crime is occurring.'",
        "'speaker_4': 'Throughout, you know, the United States, but but including here in the Bay Area, including here in Alameda, is so vastly different and more sophisticated, especially in the turn in the use of social media. I mean, work up until recently, we were at our wit's end, you know, trying to deter or stop capture, you know, people who were'",
        "'speaker_4': 'doing these wild drag races over at Alameda Point. And clearly, certainly in parts of east end of town, there is crime that's going on and it's crime of a sophisticated nature. Just only recently, there was like, I don't know what you call it, bum mass of people who had broken into a medical marijuana place on the east'",
        "'speaker_4': 'end of town. And then they coordinated it to break it on the west end of town. And the very same night and on the very same night that they broke in on the west end of town, they came back one hour later and I heard them breaking into.'",
        "'speaker_4': 'And I think we're at a point in time where we not only have to, you know, finally fulfill the vacated position, unfilled positions in our police department that we're beginning to fill. And there was a great event last week, by the way, in the hiring of three new police officers.'",
        "'speaker_4': 'But we not only need to fill those unfilled positions and provide the officers with the proper training, but we also need to give them the tools. And that's all. LPR Cars are automated license plate readers. They're just tools to help our police.'"
    ],
    "Adoption of Resolution Amending the Capital Budget by Increasing Appropriations in the 2021 American Rescue Plan Project (C99300) by $1,911,000 for Replacement of Three Portables and Decking at the Midway Shelter, Food Bank Facility Repairs, and Purchase of Wireless Hotspots for Lending. (City Manager 10021030/Finance 10024051)": [
        "'speaker_4': 'You know, improve the way in which they either deter crime or if crime happens, capture the people who perpetrate crimes. They're not perfect tools. And I don't think we're at a point where we can wait seven more years in hopes of finding the perfect tool, to be sure.'",
        "'speaker_4': 'You know, these are expensive. They're expensive in 2014 and they're expensive in 2021. But. We here in City Hall, we've got to amp up our game in terms of deterring crime and solving crime. And this is one tool that that I'm looking at that that I think can help us.'",
        "'speaker_4': 'You know, it's not the perfect tool, but I don't want to wait another seven years for the perfect tool. I think the issues of privacy are absolutely important. They're absolutely critical. But, you know, I have confidence in our city attorney's staff and I have confidence in our city Manor's staff, and I have confidence in our in our'",
        "'speaker_4': 'police staff and in our police chief that, you know, we will be very mindful of concerns with regard to privacy. So I think we need to move forward now, not just because, you know, we've got Easton homeowners associations concerned, but, you know, we've got West End homeowner's associations and and whether or even renters who are concerned about'",
        "'speaker_4': 'about crime. And we need to give them a signal that we're going to give our police a fighting chance in order to enable to to deter crime and to solve crime. And I think in LPR, I think that's what that that's what we're giving them.'",
        "'speaker_0': 'Thanks, Councilmember Desai. So here are my comments. I am very mindful of the comments that I heard from residents tonight concerned about increasing crime and also those concerned about privacy and other issues. But certainly anyone who follows the news knows that we are seeing some changes in the way that crime is taking place.'",
        "'speaker_0': 'Our attorney general, Rob Bonta, who happens to be a former member of this body and Alameda resident, has been on the news lately talking about the need to get tougher on some of these criminals. I think our technology can be a valuable tool.'",
        "'speaker_0': 'But based on what is in front of us today, this particular staff report, I'm not ready to move forward approving the use of this technology. I would like to give staff direction to come back to us. So this is this is what I would propose.'",
        "'speaker_0': 'And I will add that I did have a lengthy phone conversation with Chief Joshi this this morning or this afternoon sometime today, because I have a lot of questions about the staff for it now. We've heard some information presented tonight.'",
        "'speaker_0': 'It's not in this staff report. And I would like when if if when this item comes back to us, I'd like some of that fleshed out more because the as far as the cost of these of this technology, the amount that was given in the staff report was actually between 500 and $700,000.'",
        "'speaker_0': 'That's a lot more expensive. This is on page four in the staff report that had a fix. Our PR system is preliminary, preliminarily thought to cost 500 to $700000. Now we're hearing that it's under 3000 per unit. So I'd like some explanation of that.'",
        "'speaker_0': 'And also, there's there's the the cost of installing the cameras if if that is approved, if there's a majority to approve that. But then there's the cost of of maintenance. So what would that be? But we've heard many references to privacy concerns.'",
        "'speaker_0': 'And so I do want to know what specifically is the retention policy that's being proposed. We heard Chief Joshi and I also have huge regard, and I'm so glad he's our chief and other local resident, too. But he said that he would be willing to reduce the retention time that needs to be in a policy where we're'",
        "'speaker_0': 'just hearing, again, more anecdotal evidence. I would want to see that there's been talk about fix security cameras and also continuing mobile cameras. I'd like some more discussion about which actually might have the more chilling effect on residents.'",
        "'speaker_0': 'There's always that balancing act that when Chief and I talked today, I use the example of, you know, the the mobile unit with the camera that goes past the mosque at prayer time. So just some considerations I'd like to see fixed versus mobile or do we do both?'",
        "'speaker_0': 'And so the other question I'd like explored is the city of Berkeley, you may have heard recently approved the use of security cameras. Berkeley is also experience increase in crime. Berkeley's about as progressive as they get in Alameda County, and I have huge regard for their mayor.'",
        "'speaker_0': 'My friend Jesse Archean, we communicated about this Berkeley City Council, approved the use of security cameras in various locations throughout the city. And there are, again, tells me that the city manager I'm I'm guessing in concert with the city attorney is currently drafting the use policy for these fixed security cameras.'",
        "'speaker_0': 'I would like our staff to look into to communicate with Berkeley. What are they doing? What is their policy say? Might that be a way that we go about making our residents safer and and helping the police solve crime?'",
        "'speaker_0': 'And I do very much understand the need to free up our officers to do the kinds of patrolling and and covering our neighborhoods and business districts to make us safe. We need to do more with less. And then the other thing that I want addressed when if when this item comes back to us is how do you'",
        "'speaker_0': 'handle vehicles without license plates? Because in some of these mass retail thefts that we've heard about, these cars can be. And they don't have license plates. So how does what is an LPR do it appear to do in that in that instance?'",
        "'speaker_0': 'And then data retention and storage, where does it go? Who's storing it? What are the you know, what are the possible uses of it? And I do think we need to have some explanation of that Clearview snafu that occurred a year or two ago.'",
        "'speaker_0': 'Whatever happened to the folks who without authorization, were trying out this new software? I think that that's a fair question for the for the council and the public to know about. And finally, I want to encourage our city council to get behind supporting a b550.'",
        "'speaker_0': 'This was authored by Assembly member David Chu when he was still on the Assembly before he became a city attorney of the county of San Francisco. But it's now been picked up by Assembly member Friedman, who is the chair of the Transportation Commission, which is a good thing.'",
        "'speaker_0': 'But this is automated speed cameras and as you would expect of an assembly member, David Chiu, it's very thoughtfully designed so that, yes, if you're caught going over a certain speed, you do get the other citation. But there's a process for appeal for folks with low incomes to not have to pay that fine.'",
        "'speaker_0': 'But it is part of what is viewed as part of Vision Zero. So I want our city to join a big MTC, the League of California Cities and others. I understand that it got hung up in appropriations because the California Highway Patrol sees some threat to maybe their territory.'",
        "'speaker_0': 'But I think that's an important tool for for law enforcement and to help our cities remain a little safer. But anyway, at this point in time, I am willing to support giving a staff direction to come back in the manner I've laid out, but not to support the motion that's been made.'",
        "'speaker_0': 'Council days have been. Council are not.'",
        "'speaker_1': 'Swayed.'",
        "'speaker_4': 'Well, I'm just going to second Councilmember Patricia Spencer's motion. And with a yeah, I'm just going to second it.'",
        "'speaker_0': 'Okay. And, Kelso, we're not sweating. So you to go up.'",
        "'speaker_3': 'Yeah, thank you. I know I talked a lot earlier, but I haven't actually given my comments. We already support 8550. And actually, we were one of the few cities to send a letter when it was before we did.'",
        "'speaker_3': 'So it's good. And I appreciated the the lead him because I was going to say I'm not against cameras. I just think that if we're going to tell our community that we're going to install them, we need to have confidence that they're going to actually have an impact on the things that we're telling them.'",
        "'speaker_3': 'And we heard a lot of a lot of statements today, and I've read a lot of threads on next door in the past that make a lot of claims about what cameras are going to do. And I haven't heard one that actually accurately describes the outcome of putting these cameras in place.'",
        "'speaker_3': 'I think we you know, we have through many different and I want to say, I understand that our community has concerns about safety and crime. And I think we need to be doing as much as we possibly can.'",
        "'speaker_3': 'And I would be supporting these cameras if I thought they were actually a tool that was going to do that. And I want to thank our staff and our and appreciate the work they're doing. I also had a chance to speak with Qureshi.'",
        "'speaker_3': 'He knows I. He has my support. I greatly, greatly appreciate him. And I think this is just an issue that we're going to we're going to disagree. There is a reason that there are no studies that show that these do not deter or change crime.'",
        "'speaker_3': 'And the reason is because they don't. And there's a reason why we have to listen to anecdotal stories of one issue that happens in one city and one issue that happens in another city. And it's because nobody says that they have never solved a crime.'",
        "'speaker_3': 'It's that when you install cameras, they do not change what happens with crime in that city. In the years after Piedmont put in cameras. Assault went up twice as fast as it went up in Alameda with no cameras.'",
        "'speaker_3': 'Violent crime went up 104%. Alameda was dropped 4%. Robbery went up 20%. Alameda has dropped 4%. Firearm robberies went up 17%. Alameda is dropped 30. Aggravated assault went up 210%. Alameda has dropped. Burglary dropped 23 and a half percent in Piedmont, 33% in Alameda.'",
        "'speaker_3': 'We are overpromising if we move forward with this program that somehow putting these cameras in are going to have an impact on the crime outcomes in our city. And it's not going to. A 2018 study of Vallejo's use of these found that 37% of the license plate hit were wrong.'",
        "'speaker_3': 'That's 37% of the hits that our police officers chase down are going to be after. Things that are not are not crimes. People who are not involved in things, it ends up wasting time. One of the reasons why I'm concerned about this is that we are actually short of officers, and rather than using this to leverage the'",
        "'speaker_3': 'officers, we have to do more and better work. We're actually going to be taking away from the time they are spending on the streets doing the work that we need them to do. I appreciate it, Mayor. As the Ashcraft mentioned of the Clearview issue, I don't know how we move forward with with a new camera program until'",
        "'speaker_3': 'we've addressed the issues that that we still that are still out there about Clearview and our police force writing about how they know we don't like these cameras and yet still continuing to use them. And I do know that a lot of people didn't use it, and I appreciate that as well.'",
        "'speaker_3': 'But I would like to finish up that before we move forward. So, you know, for me, I'm not going to be supporting this because I think that it actually ends up being just security theater. We're going to spend $700,000 for trying to put things up on the bridge.'",
        "'speaker_3': 'We're going to actually pull away the resources that we have. And we're at the end of the day, a year, two years, three years after this, we are going to have nothing to show for it. But the companies that we have spent this, hundreds of thousands of dollars are going to have pocketed that money and are going'",
        "'speaker_3': 'to be on to selling us the next technological fix. Dozens of agencies in this Bay Area and in the country use these things and there is not one study that can show they have impact on crime. For me.'",
        "'speaker_3': 'That's all I need to hear. So I'm absolutely now I'm moving forward with this. I don't think we need to spend any time even asking staff to come back with more information. I think at such time that we can say to our community, hey, look, this has been used in hundreds of cities, and here's the data that'",
        "'speaker_3': 'shows us that actually it's effective. I will be there with you saying, let's put these in. But until then, I'm not ready to move forward. Thank you.'",
        "'speaker_0': 'Councilor Daisuke.'",
        "'speaker_4': 'You know, I just in my brief amount of time left, I just want to say, you know, we have had two, maybe three police chiefs who have been supportive of things like LPR. I think that that has got to amount to something.'",
        "'speaker_4': 'And, you know, the fact that, hey, there are other police forces employing it, I think that's got to amount to something. I you know, hey, you know, whatever a university professor in some ivory tower has to say, you know, great.'",
        "'speaker_4': 'You know, wonderful. But I'm going to have to balance that with what the men and women, you know, dressed in blue are telling us. I don't think they're just, you know, whipping out loopers for because they've got nothing better to do.'",
        "'speaker_4': 'I think if they're telling us that this is a tool that can help them in deterring and improving solving crimes, then and I think we owe it not just to our police force, but we owe it to our residents.'",
        "'speaker_4': 'So I don't know what more to say because it sounds like we're going to be waiting another seven years. And it was seven years when we first started this conversation. Now we're going to wait another seven years to find that perfect magic tool.'",
        "'speaker_0': 'Councilmember Desai I'm willing to consider moving forward, but after the questions I posed or answered.'",
        "'speaker_4': 'I think it was. I second it. Councilmember.'",
        "'speaker_0': 'So you did councilmember knox way.'",
        "'speaker_3': 'I guess what I would say and I and I didn't read it off my list but I think Alameda is actually police force has let us know what you know how overly useful these are we have four of them and two of them have been in the shop because we didn't take care of them and we haven't'",
        "'speaker_3': 'met and maintain them and they are out of commission and they were not deemed so important that we needed to, you know, prioritize fixing them and getting them back on the street. So again, I'm not looking for the perfect bullet.'",
        "'speaker_3': 'I'm looking for something that says that where you can where we can find where there's data that shows us, because there is so much data about crime fighting out there that shows us this can be impactful. Speed cameras is exists.'",
        "'speaker_3': 'There are reams of studies that show you this time. Speed cameras, slow speeds down, reduce crashes, make places safer, but not for these. So anyway. But we can just disagree.'",
        "'speaker_0': 'We have counsel for her, Spencer.'",
        "'speaker_1': 'Thank you, Mayor. I'd like to give the Chiefs the opportunity to respond to some of these comments. And there have been many made. So, for instance, just last councilmembers spoke in regards to the developers that have been working.'",
        "'speaker_1': 'But I believe I read in the report that part of the reason that you had to bring it back was that you want to hear from council what to do. But if you could address that, that concern, as well as the best use of the officers that we have.'",
        "'speaker_1': 'That was another issue that was raised.'",
        "'speaker_0': 'Actually. Councilmember Harry Spencer, I think it's time for a vote on your motion. I have asked for direction to have staff which would include the chief, come back with answers to questions. But I think it's time to take a vote now.'",
        "'speaker_2': 'If you want me to take a roll call vote. I mean.'",
        "'speaker_0': 'I do. I yeah.'",
        "'speaker_2': 'Okay. Councilmember Desai.'",
        "'speaker_4': 'Well, just a point of order. I mean, I think if the councilmember is asking a question that she would like our staff to answer, I think that's her prerogative.'",
        "'speaker_0': 'It is okay. And I'm going to need a vote to have more time.'",
        "'speaker_3': 'One minute.'",
        "'speaker_1': 'Actually, I think the question gets answered. Point of order. You can't just call the question without doing emotion. And you tried to do that. But I did have a question to the chief, and it's extremely disrespectful to not allow him to speak.'",
        "'speaker_1': 'However, I do have time. You do have a point of order.'",
        "'speaker_0': 'Yeah. I heard you. We had a staff presentation. The questions you were asking. The information was in the staff report. Council member Harry Spencer. So I'm not sure the value of hearing it from the chief again. But we can we can let him speak.'",
        "'speaker_0': 'But if you want to move this item forward, it's going to have to be from a different direction. But. Yes. What question would you you asked him about the unused IPR powers. Is that it?'",
        "'speaker_1': 'I'm sorry. You've been extremely disrespectful to myself as well as the chief. I've already asked the questions and I'm pretty confident he can answer them. You might not be able to remember, but I bet he can.'",
        "'speaker_0': 'And Councilmember Harry Spencer, I apologize if you think that I've been disrespectful to you. I am trying to run a meeting and I'm trying to also move this item forward, actually. So I will just remind all of us that we don't speak disparagingly to each other.'",
        "'speaker_0': 'I do know that we get a little frustrated at times. We don't see eye to eye, but we all have the city's best interests at heart. Chief Joshi, perhaps you could restate the question so I make sure we all understand what it is you were asked.'",
        "'speaker_3': 'I think the question was regarding the the Alps that are in the vehicles that are not in use as I think that's okay. So there were. So back in 2014 is when the department had the four cameras installed.'",
        "'speaker_3': 'Two of the vehicles are actually it's not that equipment is out of commission. The actual vehicles are out of commission. And in order to move the equipment from those out of commission vehicles into in commission vehicles would require.'",
        "'speaker_3': 'Go initiating another contract with this current vendor. And I just think that there are other vendors that we can we can work with. And I just I just that that's why it has not been done. So the two cars are out of commission and that's why they're not being they're not out there as much.'",
        "'speaker_1': 'May I continue?'",
        "'speaker_0': 'Council Member Harris Spencer.'",
        "'speaker_1': 'Thank you, I my chief, thank you for that comprehensive answer. My second question went to your professional opinion of the best use of the officers, our officers, and the use of this equipment to do your to do your job.'",
        "'speaker_3': 'I think there's value in in this. But I do want to say it's a tool. And so these crimes are solved by people. And so if there's a tool out there that I think can help, I think there's value in that.'",
        "'speaker_0': 'Councilmember Harry Spencer.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. That's all.'",
        "'speaker_1': 'At this time.'",
        "'speaker_3': 'It's.'",
        "'speaker_0': 'Well, we're about to take a vote. Did you want to ask anything else?'",
        "'speaker_1': 'Not at this.'",
        "'speaker_0': 'Time. At this time. Okay. Any further comments by Samir Vella?'",
        "'speaker_1': 'You know, I think and this has been said before, I think it's not whether and I understand what Councilmember Herrera Spencer was trying to get at, but it's not whether or not a tool can be useful. It's whether or not it's effective and how effective.'",
        "'speaker_1': 'And I think one of the things that several of us have raised are creating relative to also creating not only looking at efficacy and efficient use of public resources, but also creating limitations to protect members of the public as well and to not have a chilling effect.'",
        "'speaker_1': 'And so I think part of our job as policymakers is to evaluate all of those things. I guess we can listen to the recommendations of staff and but but ultimately, we need to make those policy decisions. And I think one of my concerns is that I feel as though we have made some of the related policy decisions'",
        "'speaker_1': ', certainly around parameters relative to privacy. And I appreciate that staff is going to to do that analysis. But I also think that certain things need to be codified rather than just kind of, you know, decided after the fact or.'",
        "'speaker_1': 'Responded to after the fact. So that's all.'",
        "'speaker_3': 'Well.'",
        "'speaker_0': 'So anything further? Okay. Are we ready for a vote? I think we're ready for a vote in America.'",
        "'speaker_2': 'Councilmember de fag.'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'Sir. Spencer. I Naxalite. So Vela.'",
        "'speaker_1': 'No mayor.'",
        "'speaker_2': 'As you.'",
        "'speaker_0': 'Know.'",
        "'speaker_2': 'That motion fails to two three.'",
        "'speaker_0': 'I would love to have the time to make another motion that perhaps could move forward, but I would need some time to do so. Councilmember Harry Spencer.'",
        "'speaker_1': 'Thank you. I'd like to make a motion. I'm not going to ask. Well, I can ask the clerk, but I don't think it's necessary. I, as the mayor, had asked for multiple things that she'd like to have this staff to come back with.'",
        "'speaker_1': 'And first of all, my question to the staff would be how much time do they think that they need to to address all of her concerns and questions?'",
        "'speaker_0': 'That would be Chief Joshi, I think, or maybe Chief Joshi and city attorney, whoever I'd like to answer.'",
        "'speaker_3': 'Okay. I think the question was on cost. Madame Mayor, and I think that you also asked looking at looking at cameras similar to what's being proposed in Berkeley. And I just wanted to cover whether whether other items I apologize.'",
        "'speaker_0': 'And there is no. And Madam Kirk, do you want to be the one to read that back?'",
        "'speaker_2': 'I wish I had an alternate.'",
        "'speaker_0': 'I've got I've got it in my notes. Okay. So the it is the cost, the delta between the 500 to 700000 in the staff report and the amount less than 3000 per unit that you told us this evening would like to have staff look at the security cameras.'",
        "'speaker_0': 'The city of Berkeley just approved and the the use policy. The city manager there is is drafting. Also, there was a statement from the chief that he would be willing to retain data for less than six months, 90 days or even less than 90 days.'",
        "'speaker_0': 'I think that's of great interest to us. And also on how to how Alpers would deal with vehicles without license plates and where the data goes and where it's both stored and stored, retained and other possible uses that could be made of it, as in sharing with other agencies.'",
        "'speaker_0': 'And I also want an explanation of what happened around the the consequences for members of APD who used the Clearview Software without authorization of the chief of the department. Those were the requests they made. Let's let the chief halcyon days of this year head and let's let the chief answer Councilmember Harry Spencer's question of him, which was'",
        "'speaker_0': 'how much time does it need? Would you need to provide that information?'",
        "'speaker_3': 'Yeah, all those questions are I could get to pretty quickly. I would admit the only longest item would be looking at the looking at Berkeley's proposal. And then yes, I, I don't, I could be ready pretty, pretty quickly at maybe at our next at our next meeting.'",
        "'speaker_3': 'I could be ready, but I would have to go with.'",
        "'speaker_0': 'The city managers at the next meeting.'",
        "'speaker_3': 'Okay. Yeah.'",
        "'speaker_0': 'The meeting is tomorrow. Oh, yeah. Okay. Hold that thought. Councilmember Desai, then City Attorney Councilmember Desai.'",
        "'speaker_4': 'So just a point of clarification. If there is to be a motion, is Councilmember Herrera Spencer going to make a motion based upon the items that mayor, as he Ashcraft had enumerated? So because he's out of time. And so just kind of clarifying what she said minutes ago.'",
        "'speaker_0': 'Yes. So through the chair. But wait whole if you would just wait whenever the city attorney puts his hand up, I feel I should call on him. Mr. Sharon. Yes.'",
        "'speaker_3': 'I just want to caution on the last request, which involves what happened to police officers, violations of policy. That's confidential personnel information that the police should not share with you in open session and entirely within the city manager's administrative control.'",
        "'speaker_3': 'And so I just.'",
        "'speaker_0': 'Very good to.'",
        "'speaker_3': 'Respectfully request that that item be that request, not be included in the report back.'",
        "'speaker_0': 'Okay, I will withdraw that request, but I would say that counsel might still be interested if there's some other way to say anyway, I will. We will leave that and I will leave that discretion. City Attorney Councilmember Desai, back to you.'",
        "'speaker_4': 'I think the question was, was Councilmember Herrera Spencer going to move?'",
        "'speaker_0': 'Right.'",
        "'speaker_4': 'Move those items.'",
        "'speaker_0': 'And I was I got to ask you through the chair, but I felt I needed to. And I'm glad I called on the city attorney, Councilmember Harry Spencer.'",
        "'speaker_1': 'Member de SAC. If you wanted to make a motion, I'm more than okay then I'm happy to make that motion. But with the. So I want to get back to the city manager. Then for me, time is of the essence.'",
        "'speaker_1': 'I agree with member de SAC. Seven years is seven years. Too many is what I'm going to say. Actually, as far as I know, Chief Joshi is the only one on the screen that is actually in law enforcement or has not any formal training in law enforcement.'",
        "'speaker_1': 'So with all due respect to the chief, so I do respect his opinion. And I'm not just saying that I am happy to have him. I'm actually going to listen to what he says. So city manager Eric Levitt, when you think this could come back.'",
        "'speaker_3': 'So based on some based on the request in my emails.'",
        "'speaker_0': 'Yes, please. Mr. Lovett. Yes. Yes.'",
        "'speaker_3': 'Based on the request, the privacy policy, bringing that report back to the Council. I remember, Andrew, it took a few days for him to put that together. Andrew Thomas Mr. Thomas, the planning director, it took him a few days to put that together when we brought back the last report.'",
        "'speaker_3': 'So there would be some of that. The 18th would be absolutely early if you could bring it back. But I'd have to rely on Chief Joshi, because there's. About five things. He couldn't bring it back on the January 4th meeting.'",
        "'speaker_3': 'And because that would be due tomorrow for him to bring back on January 4th, he would have to have everything done and complete review tomorrow. But January 18th is a possibility. Probably the first meeting in February would be a more likely scenario.'",
        "'speaker_1': 'So so I'm happy to move that the mayors requests the information. And I would say, you know, my preference is, of course, the 18th, because I do believe time is of the essence. And I actually that's what I hear from our chief also about it staff.'",
        "'speaker_1': 'The staff thinks they need to do it on, you know, whenever you can get to it within my motion.'",
        "'speaker_0': 'Okay. We had a motion by Councilmember Herb Spencer, Councilmember de SAC seconding. Okay. Any further discussion? May we have a roll call vote, please?'",
        "'speaker_2': 'I'll remember station.'",
        "'speaker_3': 'Guy.'",
        "'speaker_2': 'I, however. Spencer, I knocked. Right. Oh, well. No mayor as yet. I that motion carries 3 to 2.'",
        "'speaker_0': 'All right. I want to thank everyone for all your comments. This is not an easy issue. There are different a lot of different perspectives to consider. I am convinced that we can bring forward some more information, maybe more and better, and especially now that there's an understanding of some of the concerns that were raised tonight.'",
        "'speaker_0': 'So thank you, everyone. Staff council members, members of the public. Thank you. And we will get to this early in the new year. So with that, we finished all of our items that we would vote on. We have already heard.'",
        "'speaker_0': 'So, Madam Clerk, help me out here. Item seven eight Julie moved that to be item six on our next agenda.'",
        "'speaker_2': 'If, if, if the council wants to take a vote to continue it, otherwise staff can just place it back on under the regular item two. It's up to the Council's discretion.'",
        "'speaker_0': 'Okay. Member That's what. Have any thoughts about that one?'",
        "'speaker_3': 'Yeah. I don't know what else is on the agenda, but it seems like a good one to write like that. I mean, we just finished the one item we deprioritized in the conversation about police reform. And so I think maybe we should prioritize the things we actually prioritized for the beginning of our next meeting.'",
        "'speaker_0': 'Yeah. So if we do an item six and it gets up to the top of the agenda.'",
        "'speaker_3': 'I move to move item 7 to 6 A at the top of the next item agenda.'",
        "'speaker_0': 'Okay. And we do need a vote on that, right? Yes, please. Yes. So as vice mayor, I think you're reaching into a section. If we have a roll call, vote, please.'",
        "'speaker_2': 'That's a rotation.'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'Her Spencer. I right. I avella i as Ashcraft. Right. That carries by five.'",
        "'speaker_0': 'All right. Thank you so much. And then finally, we go to item nine for all communication on agenda items. Do we have any public speakers on this?'",
        "'speaker_2': 'And we did one Jim Australia.'",
        "'speaker_0': 'Yes. Oh, do you know what? No. We did get back to. And this just drove on. Lawyers. Never mind. So welcome back, Australia.'",
        "'speaker_3': 'Yes, sir. I am commenting on Alameda Avenue between Park Street and Oak Street. I learned the other day that additional garbage cans there on Alameda Avenue attract flies and rats. Does the city have a plan to better manage the garbage situation on that part of Alameda Avenue?'",
        "'speaker_3': 'Also, at the last council meeting when you had seven Bays Signalized intersection, it was full of motions and superseding motions when even the city clerk had trouble reading back what the motion was. So the general public, at least I would like a clarification about what actually passed.'",
        "'speaker_3': 'What was AC Transit's reply to the pedestrian priority over transit priority and when will the City Council place a follow up agenda item to clarify? Lastly, they on the AB 550 actually has been silenced or is no longer in.'",
        "'speaker_3': 'It is not. There's no longer an active AB session. It said that traffic enforcement disproportionately punishes those who can least afford it and that's why they stopped AB 550. Thank you.'",
        "'speaker_0': 'Thank you. Any further public speakers? An oral communication?'",
        "'speaker_2': 'There are none.'",
        "'speaker_0': 'All right. With that, we will close item nine and we can go to Council Communications. Item 11 Councilmember notes wait.'",
        "'speaker_3': 'Thanks. Last week I came, I guess it was Thursday night I attended the supervisor named Miley, had a community workshop with 700 people to discuss removing the truck ban on Interstate 580. This is a project that is going to go through years of study with the air district and the Caltrans in order to identify that.'",
        "'speaker_3': 'Yes, indeed. It turns out putting all the trucks in the area where all the black and brown people live has a disparate impact on those neighborhoods. They are going to be engaging, I think the city managers and information afterwards they're going to be engaging with with San Leandro and Oakland.'",
        "'speaker_3': 'When you look at the air quality maps, the northern side of Alameda has significant noise and health issues as well related to I mean, you could just watch it travel along 80. I think this is an issue that the city of Alameda has to have some engagement with and can get involved with the committee.'",
        "'speaker_3': 'So I want to just use my time to say that it was a good meeting. I really appreciate the supervisor putting it forward. Everybody is being very careful to say we're going to study it before we make any decisions.'",
        "'speaker_3': 'But it's an issue that that Alameda can both lend our voice in support of our East Oakland and San Leandro neighbors with as well as look out for our residents as well at the same time stay on that I'm just going to say it's it's the end of another year.'",
        "'speaker_3': 'This is supposed to be the year that we're supposed to be in the part of the year where everything was going to be really exciting and we're reopening and everything's back to normal and we're at Christmas parties and whatnot and it seems like we didn't make it.'",
        "'speaker_3': 'So I'm going to go really low key on my wishes for 2022, which is I hope it's a good one for everybody, but I'm not making any promises because I don't want to. I've got to mitigate expectations for after this after this one.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_0': 'Manage expectations always a good thing. Thank you for remarks by Vice Mayor Vella. Anything to report.'",
        "'speaker_1': 'Last week I attended the LED Abatement Board meeting. We had it a week early just to make sure that everyone could attend a few things. There are still issues with a number of different products that are kind of common products, especially different spices that are healthy homes, department staff thinks is is causing some of the lead poisoning'",
        "'speaker_1': 'cases. And so, you know, we we had a presentation on that and just trying to find out if there's some way to either get some sort of labeling or requirement testing requirement for spice folks in the in the spice business.'",
        "'speaker_1': 'One of the issues is that they source them from all over the world and some farmers have used lead to actually make the weight of their crops heavier and then lead gets in the food. And this is very common, I guess, with turmeric farmers from some other countries.'",
        "'speaker_1': 'So there's heavy, heavy metals in the soil and it's it's a common practice. And so there's remediation issues and some other things. And if you don't track and trace where the actual original produce comes from, it can contaminate a number of different batches.'",
        "'speaker_1': 'So this is something that we're we're looking at. There may be some legislation attached. We're not sure. There's there's several different recommendations. Additionally, we're hoping to get an update. We're really encouraging the county and the city of Oakland to get together and finalize the agreement relative to the lead paint settlement so that those dollars can go back'",
        "'speaker_1': 'to the communities that have been disproportionately impacted. So that's from the lead paint litigation. There was a fairly large settlement and we know that there's communities, especially in the Fruitvale and West Oakland, that that really need those dollars to help alleviate and prevent lead poisoning, especially in homes and daycare facilities for for many of our kids.'",
        "'speaker_1': 'The other thing that we covered, again, is just there's going to be there's there may be legislation again around mandating. Or requiring universal led testing for all one year olds. It's something that comes up fairly regularly. We also know that there's a number of children who have not been tested because it's an optional test.'",
        "'speaker_1': 'And during COVID, a lot of parents didn't want to bring their children in to get those tests. So we know that they have learning impacts is something we'll be watching. Additionally, the state of California I know is CBH has distributed a number of COVID tests, millions of COVID tests and made them available to our school districts to'",
        "'speaker_1': 'send home with with students. I think Alameda Unified was one of the districts that if they went through the CDP program or on their own, that set them home. So hopefully there will be more tests distributed ahead of our kids going back to school in January.'",
        "'speaker_0': 'Thank you. Thank you. Who else? Anything to report? Councilmember Harris Spencer.'",
        "'speaker_1': 'Thank you. I actually want to thank our city manager for his initial comments regarding the new care program. The care team with Alameda Fire Department and the Family Services. I'm very happy to hear that that this had a good first week.'",
        "'speaker_1': 'And I want to thank the fire department for stepping up on that program. I remember when they applied back there, it was them in Belton that applied. And I really trusted their program and them to step up and lead.'",
        "'speaker_1': 'And then my was very hopeful that our family services would be interested in supporting them. And and we all know that they did. And I want to also thank their director, Kathleen Schwartz, for all of her efforts to couple with the fire department and now bring this to realization.'",
        "'speaker_1': 'And I know our department has I think I think working with staff to thank our staff to be able to get the 5150 approval that they can do that. And so, honestly, I see this as a very big lift from our city.'",
        "'speaker_1': 'I think it's something that we can all be proud of, and I'm very much looking forward to continued updates from the city manager. How is working to thank you so much.'",
        "'speaker_0': 'Thank you. Councilor Bridges, like anything from you.'",
        "'speaker_4': 'Just quickly, like I said earlier, it was a privilege attending the hiring ceremony of three new police officers, along with the mayor as he Ashcraft and Councilmember Tricia Spencer. I guess on a somber note, you know, attended the memorial for the late supervisor Wilma Chan over at the Oakland Museum.'",
        "'speaker_4': 'And I guess, you know, one thing that I for those who are still watching and listening, I would certainly encourage Alameda is to come to city hall at night time to check out the beautiful tree. The holiday tree is very beautiful.'",
        "'speaker_4': 'Come and check it out.'",
        "'speaker_0': 'Thank you, Councilmember. I did so again. So I. And since we last met, I have attended a big regional planning committee meeting where we went over our legislative policy agenda proposals for the coming year I on Saturday, December 11th.'",
        "'speaker_0': 'And actually Councilmember Spencer was at both of these events. I had the privilege of doing the ribbon cutting for a great art installation. You are should check it out. It's called polymer, which is the Spanish word for squid.'",
        "'speaker_0': 'You've never seen a more adorable squid or probably a larger one, but it's an amazing metal sculpture. You know where it is? It's right. It's along the Bay Trail where the the lawn next to the Wheeler facility. So ride your bike out there to go check out the calamari.'",
        "'speaker_0': 'And then that evening, I got to do the ribbon cutting at the little ice rink, which is out in Alameda Point. Now, it's as I told Chris Seibold, who is generously underwriting this, we are trading street racing and donuts for ice skating because this is out almost to where dash sellers and urban legend wineries are.'",
        "'speaker_0': 'And it's in a big airplane hangar that had just been used for storage for BRICS beverages. But now it's an indoor ice skating rink, but very airy, high ceilings. There's a couple of great art installations out there, and there's a little courtyard as you enter with food trucks.'",
        "'speaker_0': 'So and there's some food you can get inside, too. But it's adorable to see the kids and families and teens and just everybody lining up to skate out there. It will be open until January 17th, I believe. And then on Monday, seven December 13th, there was a joint meeting of the Allegheny County Board of Supervisors and all'",
        "'speaker_0': 'of the mayors in Alameda County, because we are trying to come to some agreement and to work out funding arrangements to fund our homelessness programs. And so the money comes through the counties to the cities. Cities want to make sure that we're getting the money we need and that we're able to direct these moneys that are coming'",
        "'speaker_0': 'from the state to the counties and to the county and ultimately to us. So, you know, we've got to keep working at addressing homelessness. And then this past Friday, I was invited to see the distribution of gift cards.'",
        "'speaker_0': 'These were gift cards that our firefighters. Local 689. I for 69, I didn't know to their fundraising or whatnot. They came up with target gift cards, $35 apiece for families in Alameda Housing Authority, Headstart families, 1100 children altogether.'",
        "'speaker_0': 'Any family with kids got a $35 target gift card for each of the kids. So that was pretty sweet to see that parents out there, too, can pick up those gift cards and have a little merrier holiday season.'",
        "'speaker_0': 'So we are just about to the end of this day. But it was the winter solstice, December 21st, shortest day of the year. That means that every day after this, it's just going to get days. The day is going to get a little longer.'",
        "'speaker_0': 'There'll be a little more light. We can all use more light in our lives. Thank you for all the good work, the hard work, all of you staff, we appreciate you and council members. Thank you so much for your hard work on behalf of the city.'",
        "'speaker_0': 'I hope you have a restful, relaxing, enjoyable holiday season. I'm a crime is real, so just be super careful and wear a really good mask. Social distance. Just be smart about it. Test if you've traveled or been to a large gathering and we'll see you safe, sound and healthy in the new year by everyone.'",
        "'speaker_0': 'Good night.'",
        "'speaker_1': 'I wanted to add real quickly, I'm sorry, I forgot to mention and I didn't hear anyone else mention it. The Western Arts District did a very large mural on Webster and Pacific. I was able to go to their grand opening of it, and I really encourage people to go by.'",
        "'speaker_1': 'And I want to thank the muralist also Dave Young Kim, who worked with students to do it. But if you see it, you might not really understand what it is. So I encourage you to go super close and then pull back.'",
        "'speaker_1': 'And I'm not going to tell you that there's a lot to be seen there. So I wanted to share that also.'",
        "'speaker_0': 'Thank you. All right. With that, everyone, good night or good morning. Happy holidays. Happy New Year. We'll see it in the new year.'",
        "'speaker_1': 'Bye bye.'"
    ]
}