{
    "Proclamation Declaring April 8 through April 12, 2019 at National Boys and Girls Club Week.  (City Manager 2110)": [
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'Next is a proclamation declaring April eight through 12 as National Boys and Girls Club Week.'",
        "'speaker_0': 'All right. This is always a big observation. So do we have. I thought I saw some young people out in the hall. Anybody from Boys and Girls Club here. Come on up here where there's shirts. Come on up and then.'",
        "'speaker_0': 'Yeah, we like to see. Yeah. The more the merrier.'",
        "'speaker_2': 'Hi, everybody.'",
        "'speaker_0': 'Hi. You want to go to the mic and tell us your name and introduce these lovely young people?'",
        "'speaker_2': 'My name's Nathan. Yeah, I'm athletic director.'",
        "'speaker_0': 'All right, come on up and tell us your names, everybody.'",
        "'speaker_1': 'My name's Eric. Hi.'",
        "'speaker_2': 'My name's Davis.'",
        "'speaker_9': 'Hello.'",
        "'speaker_2': 'My name's Isaiah.'",
        "'speaker_0': 'Hi there.'",
        "'speaker_1': 'My name is the. Hi, my name is Salem.'",
        "'speaker_0': 'Nice to meet.'",
        "'speaker_1': 'You. My name's Issa, and I'm the arts and crafts coordinator.'",
        "'speaker_0': 'Very nice. Well, here's a proclamation that I'm going to present to you. So for more than a century, they don't look that old, do they? For more than a century, boys and Girls clubs have helped put young people on the path to great futures.'",
        "'speaker_0': 'Over 4000 clubs served some 4.1 million young people through membership and outreach. And over 4200 of these youth are Alameda residents. Both the Alameda Boys Club, Boys and Girls Club offers programs and services to promote and enhance the development of boys and girls by instilling instilling a sense of competence, usefulness, belonging and influence.'",
        "'speaker_0': 'And. Whereas, the Alameda Boys and Girls Clubs doors are open to all youth from all schools and backgrounds every day and evening after school, on weekends and during school vacations, being the only facility in Alameda that provides this service.'",
        "'speaker_0': 'And. Whereas, the Alameda Boys and Girls Club mission is to enable all young people to reach their full potential as productive, caring, responsible citizens which they facilitate.'",
        "'speaker_1': 'With their high.'",
        "'speaker_0': 'Tech computer labs, world class, commercial kitchen, edible garden and State of the Art Youth Development Center. In addition to afterschool homework help and tutoring, the Alameda Boys and Girls Club offers free dental vision and medical screenings from local medical professionals and assists with access to follow up care.'",
        "'speaker_0': 'The Alameda Boys and Girls Club is at the forefront of efforts to provide education and career development. Vocational skills, character and leadership skills. Health and life skills. STEM and technology skills. Fine and performing arts and sports. Fitness and sports.'",
        "'speaker_0': 'Fitness and recreation programs. And. Whereas, the Alameda Boys and Girls Club ensures that youth are offered a safe and supportive home away from home, providing quality support services and recreational programs. Now, therefore, it be resolved that I Maryland as he Ashcraft, mayor of Alameda, do hereby proclaim April eight through April 12, 2019, as National Boys and Girls'",
        "'speaker_0': 'Club Week in the city of Alameda and proudly call upon the residents of Alameda to join me in recognizing and commending the Alameda Boys and Girls Club for such beneficial and important services for the youth in our community.'",
        "'speaker_0': 'So with that, would one of you like to say a few words about what you are doing at the Boys and Girls Club?'",
        "'speaker_1': 'Come on up.'",
        "'speaker_2': 'Well, there's a lot of different projects that are going on right now that I'm I'm involved with the athletic program. So we have a lot of teams, basketball program after school. My offer for leagues to grades three through fifth grade and does numerous things.'",
        "'speaker_2': 'And then I could probably tell you more about the arts and crafts and things like that.'",
        "'speaker_0': 'So my mother used to tell us a little bit about you. Do I appreciate? Just a minute.'",
        "'speaker_1': 'I just recently moved up to the arts room, so I'm just kind of trying to learn what the.'",
        "'speaker_4': 'Kids like to do. Have them, like explore.'",
        "'speaker_1': 'Be able to work with all the things that we give them and see what they can make with them.'",
        "'speaker_0': 'All right. Well, thank you very much. And here is your proclamation.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'For.'",
        "'speaker_1': 'Love. Wait a minute. I can't hear what you.'",
        "'speaker_0': 'No. You can't go in the back.'",
        "'speaker_1': 'I'll be back. How we are, we should hold the proclamation. Oh. Okay.'",
        "'speaker_2': 'All right. Coming back.'",
        "'speaker_5': 'It can be a little bit like eating all of.'",
        "'speaker_0': 'Your weight. Very, very nice to meet you. Thanks, face.'",
        "'speaker_3': 'We have three speakers under all communications. Okay.'"
    ],
    "Continued Public Hearing (of Item 6-E on the March 19, 2019 City Council Agenda) to Consider Adoption of Resolution Denying the Appeal and Remanding the Design Review for a 96-Room Hotel with 62 Parking Spaces at 1825 Park Street (PLN17-0538) for Further Consideration by the Planning Board (for Reasons Independently Considered by the City Council that Were Not Raised in the Appeal). (Planning, Building & Transportation 481005)  [Please note: Public Comment was closed on March 19, 2019]": [
        "'speaker_0': 'Owe you an I. Okay. All right. It is unanimous as items continued to move to me. Seven. Let's give me a yes. Okay. We then move to item. Thank you, everybody. Okay, we're then going to move to item five G.'",
        "'speaker_3': 'And that this is the resolution that's coming back from the continued public hearing. That was item five on the March 19th meeting. So basically staff just prepared the resolution to bring back for council to take action.'",
        "'speaker_8': 'There's no speaker's correct.'",
        "'speaker_3': 'No. You close the public hearing at that meeting.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'Okay. So I'm going to move approval of item five G.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'I can do I have their promotion a second on favor, question and discussion, Mr. Councilmember Desai.'",
        "'speaker_5': 'So I voted to deny the appeal vote again. That's still my concern. So you vote against the case and I would vote against this, correct?'",
        "'speaker_7': 'Correct. That's correct.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Okay. All right. It's been moved in, seconded. All in favor. I opposed.'",
        "'speaker_10': 'Nay.'",
        "'speaker_3': 'Oh.'",
        "'speaker_0': 'Okay. So it's a 3 to 2. Okay. Is this a motion approved passes 3 to 2. But the the project goes forward with the instructions back to the planning board to improve the design. And speaking of improved design, I did attend the grand opening this week of an affordable housing complex, and that's just off of Park Street'",
        "'speaker_0': 'in a lovely example of design that fits well with the neighborhood. Okay. So now we are on to the let's see. We're going to continue. Madam Clerk, help me out. What are we going to do here?'",
        "'speaker_3': 'So I think you're reconvening to a on that you need to finish deliberation on a decision about taking action on that policy. And then you also want to consider the ordinance, enacting the process. And we do have a speaker on 68.'",
        "'speaker_3': 'Now.'",
        "'speaker_0': 'I'm 60, but we're not on six right now. We're this is a continuation of to a. Right. Okay. And in fairness to Councilmember De Saag, I think he had maybe one minute left, 35, 35 seconds. Okay. But he's counting and he.'",
        "'speaker_1': 'Good.'",
        "'speaker_2': 'Okay. Actually, yeah.'",
        "'speaker_0': 'Some every day.'"
    ],
    "Recommendation to Provide Direction to Staff Regarding Various Amendments to the Citys Rent Review, Rent Stabilization, and Limitations on Evictions Ordinance (No. 3148) Which May Include Amending Various Sections of Article XV of Chapter VI Concerning Review of Rent Increases, Limitations on Evictions, Eliminating the Sunset Clause, and Making Clarifying Amendments; and\n\nPublic Hearing to Consider an Ellis Act Policy and Adoption of Resolution Adopting a Policy Concerning the Requirements, Procedures, Restrictions and Mitigations Concerning the Withdrawal of Residential Rental Units From Rent or Lease (Ellis Act Policy). (Housing 265)": [
        "'speaker_5': 'Here, go. I would like for staff to work with a technical working group consisting of property, landlord and renters, particularly to deal with exhibit two b2 d one eye to eye for i5i9i 1516, 17. Exhibit three, one, two and five.'",
        "'speaker_5': 'And to get input from the different stakeholders and to relay the summary of those input on those items to council. Thank you.'",
        "'speaker_0': 'Thank you. Okay, now who was. I know. Yep. Right. But Councilmember Vela and Vice Mayor de san. Excuse me, Vice Mayor Knox White. It's not even that late. Had comments he wanted to make council. Who's going first? He made us thank you and vice mayor actually had.'",
        "'speaker_10': 'I will I will. I want to make two points. I want to make a point about the data that Councilmember de SAC presented. He is right that, ah, a certain blog did present some information. They presented it completely, incorrectly and unfortunate it was reiterated again tonight.'",
        "'speaker_10': 'But the No Cause eviction data that was shown up on the screen here actually shows. And since we have passed our rent control rent stabilization. 3148 no cause evictions have gone up the the blog that was cited didn't understand setting an annual rate of no cause and therefore it just used the numbers.'",
        "'speaker_10': 'And I think it's really important that people leave here understanding that we have seen an increase in no cause evictions. The other point I just wanted to make, since I have the floor and then I'll let it go really quickly, was that I think we heard a lot of stories of people who cannot afford their rent when'",
        "'speaker_10': 'it goes up. And I think that we can look at as much data as we want that shows that most people are getting no rent increases. But the fact of the matter is that we're actually trying to protect the people who are getting kicked out of their homes, not just saying 42% didn't have a rent increase.'",
        "'speaker_10': 'So it's not a real big deal for those who are getting done. And I and I really I just I want to data says a lot of things, but at a certain point in time, the data point for this for me that I am looking at is how many people are getting rent increases that are on affordable'",
        "'speaker_10': 'and unsustainable and about forcing them to leave town. And so I just want to not let that go. Thank you.'",
        "'speaker_0': 'Thank you. Vice Mayor Councilmember Avella.'",
        "'speaker_8': 'And in fact, I think it's just our no cause evictions have gone up over 16% I think is what the the actual stats are. And I think that there's something to be said. We've talked about having staff with regards to a rent cap.'",
        "'speaker_8': 'Two of my colleagues mentioned having staff come back with recommendations. I would just add a little asterisks on that, which is those recommendations, at least in my opinion, should not be based off of a blog post. They should be based off of the data that we have and an actual analysis of what surrounding communities are doing, because'",
        "'speaker_8': 'I think we're part of a larger metropolitan area. I think it's worth looking at what's happening in the larger metropolitan area. That said, I think that, you know, there are clearly a number of big issues that that we are asking staff to look into.'",
        "'speaker_8': 'I think they're important ones, too. The vice mayor's point means 58% of people in Alameda have experienced a rent increase. And I would like to know out of that 58%, how many have been displaced as a result? I do think that there were unintended consequences, essentially, of kind of how our ordinance was put together and what it'",
        "'speaker_8': 'did and where different holes and loopholes existed. I think that, you know, if we're going to look at just cause I agree, it should come back sooner rather than later. And I think it needs to come back along with an Airbnb regulation because we don't have one.'",
        "'speaker_8': 'And we need to understand what's happening with the Airbnbs that are operating in Alameda because that's taking rental units off the market. And frankly, I don't think saying 90 days is enough because when you can rent those out at a very high rate per night.'",
        "'speaker_8': 'And frankly, I'm a little concerned based off of the issues that we've had this past week, where there was something that came to light, where somebody was kind of illegally posting Airbnbs potentially in other people's properties and things like that.'",
        "'speaker_8': 'So I just, I think we need to step in and we need to regulate that and it should come back when we look at just cause and if we're looking at an Ellis act that needs to be a part of the analysis that I would like to see.'",
        "'speaker_8': 'Certainly I'd be more inclined to support a 30 day or 45 day cap. I think the smaller the amount of nights or the fewer the amount of nights that people can put their unit out on Airbnb, the less of an incentive we have for people to pull market pull units off the market.'",
        "'speaker_8': 'I would also like us to look at, you know, and since we are coming up on budget time, what are the budget costs to this and include that in the report back from staff when we're looking at what's the cost of administering these new changes to the program?'",
        "'speaker_8': 'Because I don't want to be having to make changes to the budget right after we enacted. I think we should be considering it as part of it. I'm supportive of of having staff come back with a rent cap.'",
        "'speaker_8': 'I think finding a way to streamline the system. I think there's a lot of issues with Rack. I think it's a very cost effective way of doing things. And I think to my colleague's point, it creates a very, you know, adversarial process that I think pits people, pits tenants against landlords.'",
        "'speaker_8': 'And in it, it muddies the relationship. So I think that we're going to have a cap. Let's have a cap. But I would like to, in my opinion, do away with the rack. If we're going to have a hearing.'",
        "'speaker_8': 'Officer, that's fine. But let's figure out what those boundaries are. I think the the registry that needs to happen, but I think it's also a lot of work. And I think we need to get on the same page about what's included in that and how you're going to go about getting that data.'",
        "'speaker_8': 'I think ultimately a lot of the that I also like the change proposed by Councilmember Odie that for Costa Hawkins exempt units that where there's essentially a construction constructive eviction that we require an option of a relocation payment.'",
        "'speaker_8': 'Essentially what that amount is, again, I would want staff to come back with recommendations that are based off of data and analysis and not just pull a number out of thin air. You know, I think that. I think there's still a lot of conversation that needs to happen.'",
        "'speaker_8': 'I actually don't believe in having a subcommittee work on this because I think that that's a very selective and biased way of kind of doing the analysis. I'm happy to have staff speak with different people. I think that's part of the process.'",
        "'speaker_8': 'But I would like to continue to have this as a as an open and fluid conversation with the public. I think we owe it to people to do it that way. And I also think that when we make these decisions, we need to keep in mind that we don't have a housing policy as a country.'",
        "'speaker_8': 'We have a system that is based on property ownership and the principles that support property ownership. And so if you look at how we spend our money, including tax deductions and everything else, the vast amount of money goes towards protecting property owner rights.'",
        "'speaker_8': 'And there was a period in time where the only people that got a say in what happened in government and what our laws looked like and are how our system was constructed was based off of the principle of property ownership.'",
        "'speaker_8': 'And that was at a time that other human beings were considered property. And I just find that to be not the principle that I want to be guided by when we're making these decisions. I actually think we need to be guided by principles of compassion and community, and at least trying to empathize with people who have experienced'",
        "'speaker_8': 'housing insecurity. And a vast majority of those people are people who look like me. They're people that are or were not allowed to vote or have a voice in government for many, many years in this country. And I think that part of that conversation, we're not going to correct it all overnight.'",
        "'speaker_8': 'I'm not asking us to. But I do think we have to at least keep that lens in mind when we're making these decisions. And I also think that this goes hand in hand with, you know, we're going to have to build more units.'",
        "'speaker_8': 'I'm not saying that this is a system that we put in place forever. It's why it's an ordinance. Hopefully we'll see some change. We'll see some units come on the market. And together the combination of these things can help improve the stability of our community.'",
        "'speaker_8': 'And I think that that's what we need to be focused on. That's what I'm focused on. I'm supportive of the proposals put forward by Councilmember Ody and Vice Mayor Knox White. And I'd like to. See what we can put together on that and then make a decision.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Okay, so I'm going to start adding quote from some data that I think you'll find reliable unless Thursday, Councilmember Avella and I spent the day in Orange County, actually in a conference room that we were where members of a statewide policy committee of the League of California Cities and Housing Community and Economic Development.'",
        "'speaker_0': 'And so this is from some of the materials we reviewed, lots of legislation aimed at building more housing in California, addressing our homelessness crisis. So according to the state legislative analyst office, the average California rent is approximately 50% higher than the rest of the country.'",
        "'speaker_0': 'And even California's least expensive housing markets are more expensive than the national average. In California, there are almost 6 million renter households, and of those, more than 3 million of the renter households pay more than 30% of their income toward rent, and nearly 30% of those 6 million pay, 1.7 million households pay more than 50% of their'",
        "'speaker_0': 'income toward rent. So that and this is a finding there from the California Department of Housing, Community Housing and Community Development that an unexpected financial hardship can lead to homelessness for many residents. And in fact, California's homeless population rose 16% from 2015 to 2017, with many people becoming homeless for the first time.'",
        "'speaker_0': 'Once a tenant loses their home, the cycle of homelessness can be difficult and expensive to break, according to a 2019 study by the Economic Roundtable, providing services and emergency response to homeless individuals can cost taxpayers nearly $35,000 per person per year.'",
        "'speaker_0': 'So an upfront investment in keeping families housed could save the state billions of dollars. But we're not just doing this about economic dollars and cents. We we fit into the larger picture of what's going on at the state level.'",
        "'speaker_0': 'Every city has to do its part. I was reading the staff material and the rack was originated in 1971, in Alameda in 1970 or in the 1970s. It was a different time. That's when measure that limited density on our island to no more than a duplex went into effect and has been in effect ever since.'",
        "'speaker_0': 'I sometimes speculate about what this whole situation that we're dealing with would look like. How would it be different if we had more multifamily units, if we had smaller homes where people, empty nesters, could downsize and open their properties up to families moving in?'",
        "'speaker_0': 'If there were those smaller units that first time renters or buyers could get into. But we deal with the hand were dealt. So in no particular order, just kind of the way it came up in conversation. The rent cap.'",
        "'speaker_0': 'Yes, I was on the council when we enacted the 5% and it was a placeholder, if you will. Yeah, the landlords wanted 10%. And at the other end of the spectrum, I think the renters wanted no percent and we settled on 5%.'",
        "'speaker_0': 'But it always was meant to be a a placeholder that we would have more time to consider the impacts of the ordinance that we enacted. And of course, a referendum happened. And, you know, life happens in between. But I do think it's reasonable to look at the CPI.'",
        "'speaker_0': 'Someone said it can be manipulated. I, I, I kind of like my hard data and the CPI is something and it's been mentioned before, we do need to be fair to both landlords and tenants, Allen said. Yes, we need to do it.'",
        "'speaker_0': 'The five year I think is actually find that two year. It's not that, oh, if you do two years, you could do to you know, you could even get punitive damages from both the the renter and the city.'",
        "'speaker_0': 'So it's a deep incentive, but that's a discussion item. Relocation. Yes. Eventually we do need to follow the had model. It shouldn't be your relocation. Should it be based on what you're currently paying? Because you might be paying way under market and then you have to go and find another place on the rack.'",
        "'speaker_0': 'I'm with my colleague, Councilmember Vella. I think that our money towards rent programs would be better spent by getting hiring officers, more staff to deal with the tenants one on one. And I just throw in I'm really uncomfortable at the personal nature of information that tenants are asked to provide in the rack appeal that was pulled because'",
        "'speaker_0': 'the landlord withdrew the increase. These tenants had to say what they were earning in Social Security and in the course of their medical really in a public document. That's that's not right on just cause. Okay. I was the first one to come out and say we need to get rid of just cause.'",
        "'speaker_0': 'And I haven't changed my position. And if anything, I'm even firmer in my conviction to get rid of no cause. I mean, it's euphemistically called just cause. But when I was running for office and going door to door and talking to two renters, more than one told me, you know, I have a good landlord, but I'm not'",
        "'speaker_0': 'going to tell him about these repairs that are needed because I'm just afraid I could be evicted for no reason. And then I don't know where I would go because my rent's pretty reasonable in the rack up here that we didn't hear.'",
        "'speaker_0': 'The property manager said something like, Oh, well, you know, they never raised the needed repairs until they go to the rack, until they appear rent increase and the staff person and I appreciated that said that's because renters are concerned I mean it was one of the back panel said that's because renters are concerned that if they were'",
        "'speaker_0': 'to bring up a needed repair, they'll get a rent increase. And in this case, the property manager of a three story building with senior citizens said, I always take the stairs. I didn't know the elevator wasn't working and she was the property manager and her remedy for the cockroaches was to put them through sticks.'",
        "'speaker_0': 'Many anyway, just cause it has so many unintended consequences and buyouts. Constructive evictions. Yes. Good points, Miss Potter. Let's bring in that. I want to also talk about this idea of assistance for mom and pop landlords.'",
        "'speaker_1': 'Yeah, let's go for it.'",
        "'speaker_0': 'But I'd turn that equation around. Why don't we let the landlords go ahead and put together a fund? They can contribute to it. And then if there's someone who says, I'm a small time landlord and I can't afford this relocation expense, they can go to the landlords who put this together and make their case.'",
        "'speaker_0': 'They can do a promissory note. It can be a lean against the property when it's sold. So I think that's a way of achieving some balance if indeed mom and pop landlords, whatever that means, because it's really hard to determine with trust and everything who owns how much and what.'",
        "'speaker_0': 'And then, yes, we do need to also be building more housing and more affordable housing. It's easier said than done. There's lovely 20 affordable units available to people making between 20 and 60% of the area median income. Those 20 beautiful, sustainable units cost $18 million to build.'",
        "'speaker_0': 'So we're building where this is the housing authority. We're cobbling together income sources. We need to do all this and more, but definitely let's keep people in our house, in their housing. And I think I've covered it. I'm the I'm splitting the fee, the program fee.'",
        "'speaker_0': 'I would be okay with that, except that it shouldn't be that 50%. It could be borne by the tenant should it be counted toward the cost of the rent, because then that's with the 5% or five of the rent increases based on the original cost of the rent.'",
        "'speaker_0': 'Okay, that's me. So, Councilmember Daza.'",
        "'speaker_5': '20 seconds left. I this is. I just want to say this. I believe that there the hard data shows that the rent ordinance 3148 is working and that we should work within that regime, modify it in conjunction with tenants working with small mom and pop landlords.'",
        "'speaker_5': 'Yes, but not to replace it altogether with a Berkeley style rent control that has hard caps on rents. And just cause the data is does not show that we need to go that route. The data shows that we need to keep with 3148 and modify it if necessary.'",
        "'speaker_0': 'Okay, so we have given out and Rotella.'",
        "'speaker_6': 'Since I still.'",
        "'speaker_2': 'You quickly before.'",
        "'speaker_6': 'Seven. I appreciate your comments, Madam Mayor, especially recalling the process that we went through and if I was there until the bitter, bitter cold in the middle of the night and.'",
        "'speaker_2': 'It was, you know.'",
        "'speaker_6': 'Our intention on on two of those one was our intention was that the 5% would be a cap and now it's turned out to be the floor. So it didn't turn out the way that we intended. So I just want to make sure that that's clear.'",
        "'speaker_6': 'And on the eviction side, you know, we thought we had put in a formula that would prevent buildings from being mass evicted. And that didn't turn out to be right either, because we all saw what happened to 470 Central.'",
        "'speaker_6': 'So I think what we've talked about today and I appreciate the comment or complimentary, but I think Debbie came up with the idea about the constructive eviction rent increase. So I just want to give credit where credit's due.'",
        "'speaker_6': 'I think this is Alameda style rent control. I mean, I think this is uniquely Alameda. You know, it's been crafted by our history. It's been crafted by our experience with it. And what changes we make are crafted by the needs that we heard from our citizens.'",
        "'speaker_6': 'So I'm going to call it Alameda style rent control because I mean nothing against Berkeley, but I think it's something that we came up with and it's better yet Berkeley.'",
        "'speaker_0': 'We don't get into any rivalry. Okay. So any further comments before we send Ms.. Potter away with all of our input? Do you have any questions, Miss Potter?'",
        "'speaker_4': 'I thought it might be helpful for staff if we could recap some of what we heard from council this evening so that we are working on the kind of focused on the right issues. It sounded like there was a priority to come back with a just cause of action ordinance in the staff report.'",
        "'speaker_4': 'Staff recommended that it be a stand alone ordinance and so agreed. I would want to confirm that what we would work on would be a standalone ordinance for the just cause of action.'",
        "'speaker_2': 'Yes.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Yes. Referenda approve it.'",
        "'speaker_4': 'Yes or no. And then it's per me and and quickly we do it. Is there a consensus from the council that at now that we've received direction that it would be useful for staff to reach out to the to the community to get feedback on council direction that may inform some of what staff recommends and perhaps it's'",
        "'speaker_4': 'less relevant on the just cause, but it may be more relevant on the maximum allowable rent increase. There are more options.'",
        "'speaker_0': 'So I'll chime in and say I'm fine with reaching out to the community. I agree with Council member Vella that I don't think you need to convene a subcommittee, but I think you know how to make your rounds of the different constituencies.'",
        "'speaker_0': 'Do you have a hint? It kills me.'",
        "'speaker_6': 'I would kind of concur with the mayor. I mean, I'm always happy to hear from the public, but I don't think we should let that drag down the process or slow it down at all. So, I mean, there doesn't need to be a consensus and like we tried three or four years ago that drag the whole thing'",
        "'speaker_6': 'out another year.'",
        "'speaker_4': 'Right. The intent. I think that the goal on the just cause eviction ordinance and perhaps the maximum bailout, maximum allowable rent increase would be that the second meeting in May to be back for the second meeting in May.'",
        "'speaker_4': 'That's probably much more doable depending on once we began that kind of analysis and researching the options. Just given the lead time that we need for council reports, the maximum allowable rent increase may come back for council consideration in June, but the goal would be to bring the just cause eviction ordinance back the second meeting in May'",
        "'speaker_4': 'for council action.'",
        "'speaker_6': 'Yeah. Just notice it properly, please.'",
        "'speaker_10': 'I think if we're going to do our outreach on the on the cap, trying to be a little broader, I think we tend to go to the same well over and over again. And I think we had landlords here earlier who felt they didn't even know anything was happening, despite the fact that there were meetings.'",
        "'speaker_10': 'And so if we can find a way to to try to ensure that if we're asking renters for input, that renters have a real chance to get that input of asking landlords to give input, that landlords that not just in certain specific organizations and groups have that opportunity somehow.'",
        "'speaker_4': 'And then relative to the Airbnb issue, staff will regroup and take a look at what we think would be our time frame to come back on the Airbnb issue and will endeavor to have a track. It may not be as quick, so I guess partly it would be useful to know for us, is there a desire to'",
        "'speaker_4': 'see the Airbnb and the just cars come back together that could potentially delay the the just cause?'",
        "'speaker_0': 'QUESTION Councilmember Villa.'",
        "'speaker_8': 'When are you planning to come back to us with the Ellis Act portion of it?'",
        "'speaker_1': 'Well.'",
        "'speaker_4': 'A staff was going to recommend that the Council Act this evening on the Ellis Act policy, which is before you there's been a publicly notice public hearing and the hearing has been conducted. So there could be I'm happy to answer any questions regarding, you know, the council, if the council has the ability to amend the policy that'",
        "'speaker_4': 'is presented as a draft policy. Okay.'",
        "'speaker_8': 'So regarding the Airbnb, I'm I mean, I'm the one that that has kind of raised it. I know Councilmember Odie raised it as well. I, I would be fine with it coming back this summer afterwards. But I do think it's been lingering out there for some time and I think having it come back in like July or'",
        "'speaker_8': 'something like that gives our new city attorney time to look at it. And that would be when I would want it to come back. I don't want to wait too long, but I understand you can set limits on staff time.'",
        "'speaker_4': 'That's helpful direction.'",
        "'speaker_1': 'Thank you. No, no argument.'",
        "'speaker_0': 'I'm sorry.'",
        "'speaker_2': 'No argument.'",
        "'speaker_0': 'With that. No argument. Yeah. Okay, that's fine. I do think that the just cause should take priority.'",
        "'speaker_4': 'Yes. That that is the direction that I heard. And so we will be looking at the second meeting in May for the just cause ordinance that we will also move forward. We would recommend that the maximum allowable rent increase, whatever the council we will come with recommendations about, you know, that rent increase banking the role of the'",
        "'speaker_4': 'rack versus hearing officer what the maximum. Perhaps should be what that might do in terms of impacts on the budget for the rent program. All of those things would be addressed in the report that would come back to council.'",
        "'speaker_4': 'We would also recommend for that issue that it be a standalone ordinance and so we would handle that is the way it would come back to council. Um.'",
        "'speaker_0': 'That, that sounds, that sounds reasonable to me. Is that good with the rest of you? I see. Nodding heads. I'll take that as a yes. Okay. So as far as the Ellis act, you want to say if you think it was.'",
        "'speaker_4': 'Before, maybe before the discussion on the other side, because we are requesting action this evening for the two other, we had two other kinds of rounds of amendments that we are still recommending that the Council act on. I would because we have direction on the exhibit three amendments, sort of the new amendments that were before you this'",
        "'speaker_4': 'evening. And the issue of that, the constructive evictions really came from rent program staff as they saw what's been happening on the ground, but that we would combine both sets of amendments and bring them back in one ordinance for the council's consideration.'",
        "'speaker_4': 'And I noted all of Councilmember de Suggs points or proposed amendments that he would like more discussion on. Happy to take those back out to the community and have that discussion with the community. We will also evaluate all of the proposed amendments and see whether they are still needed given that we, the Council, has given direction.'",
        "'speaker_8': 'In the interest.'",
        "'speaker_0': 'Of Councilmember Gillis.'",
        "'speaker_8': 'Sorry, in the interest of transparency, I understand that he rattled off a number of different items that are there. I would like to know what items he specifically said he would like direction on, but I'm also a little concerned that there's direction being given by one member of the council as opposed to I mean, I thought we'",
        "'speaker_8': 'were supposed to give direction as a body.'",
        "'speaker_0': 'Yeah, I think if you could list the the concerns because I don't think I caught them all either. And then let's see if we have at least a majority of the council mind to pursue. And you and Councilmember Vice Mayor Rex White.'",
        "'speaker_10': 'Well, I just I know that Councilmember Odie mentioned that he was comfortable with essentially that what became the 3180. Right. So I want to be really clear that are we saying that we're comfortable with everything and now we're going to discuss certain ones that Councilmember de SAG has that let's have some more discussion around that because I'",
        "'speaker_10': 'guess I seconded my informally. Mr. Otis thoughts I'm 3180 I want to make sure that that my feelings about that we should just move forward with these right now I.'",
        "'speaker_5': 'Particular.'",
        "'speaker_0': 'Councilmember day so.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Should like to.'",
        "'speaker_5': 'Speak is to make sure to get stakeholder input on those items. That's my goal is to get so that people clearly understand from stakeholder particularly landlords perspective on the range of items that I had laid out. And because there were so many, I couldn't go into detail except give their gave their a number.'",
        "'speaker_4': 'Two and all all of these amendments, proposed amendments were vetted when the process was underway in the spring of 2017 because the ordinance was actually adopted. So what's reflected in exhibit two is what was adopted by the Council prior to the repeal.'",
        "'speaker_4': 'My suggestion, but clearly it's dependent on council direction, was that if the council desired a a review of these because it's been a couple of years in the community, staff is happy to facilitate that discussion. But that's clearly what the council, you know, what the council desires is what staff will execute.'",
        "'speaker_0': 'So I will note that, first of all, all of the items that Councilmember de SAC listed were on exhibit two. So not the 3180, because I circled them in red. As you're reading them, my inclination is to leave them and move forward.'",
        "'speaker_0': 'I mean, I do feel that I said my part about what I feel about publicly making public this personal information from tenants and proceedings. I would like that considered, but I feel that the program staff, you and your staff have had now that much more time.'",
        "'speaker_0': 'It's been three years since we enacted the ordinance and it's had that much time to be tested. So I don't know that we I don't see a pressing need to go back and open these up because again, we just held them.'",
        "'speaker_0': 'We just set them aside because we had to go through the whole measure k election and you know, the public spoke resoundingly about the outcome. So I but but what does the rest of you think? That's my thought.'",
        "'speaker_6': 'Brody Trotter. I mean I mean, I kind of agree with the mayor. I do think the particular issue I asked about the passing of the 50% of the rental fee, that's something I wanted changed. If we were going to change, at a minimum, the requirement that there's proof of payment before you're allowed to pass it on.'",
        "'speaker_6': 'I think the my colleague Ms.. Vela talked about not including that in the rent increase. And I think what the vice mayor agreed with my comment.'",
        "'speaker_4': 'So I believe the way was well, I believe what was what's been recommended is that the the portion of the rent fee that's passed on to the tenant would not be part of that. The rent cap is the way the ordinance in exhibit two, that's what 3180 had included, was that it's not part of the rent the'",
        "'speaker_4': 'rent cap. It's in addition to.'",
        "'speaker_6': 'I don't think that it should be passed on the tents at all, but I don't know if there's three votes for that.'",
        "'speaker_4': 'Okay. So it's. Is there possibly interest in revisiting the the amendments that are contained in Exhibit two? One of the things that we could do is that that list and go through that list and determine which of these amendments might be moot based on the direction we receive tonight and come back with a scaled back, you know'",
        "'speaker_4': ', a scaled back list of amendments. And we would combined exhibit two and exhibit three, and perhaps there's an opportunity for the council to revisit if they desire.'",
        "'speaker_0': 'So you're saying you would do them at staff level? Correct. Yeah. Because if, for instance, I did note on page to paragraph D excuse me, C when is revised the formula for the percentage of rental units for which a no cause termination of tenancy could be utilized?'",
        "'speaker_0': 'Well, if we're possibly getting rid of no cause terminations, then we don't need to revisit formulas. But that's housekeeping, I think. Right. Staff can do. Okay. Councilmember Vela, then vice mayor.'",
        "'speaker_8': 'And that's why I think the direction from the majority of the council is essentially to have that staff analysis done and then come back to us. My position would be I don't want that to hold up or get in the way of the just cause or the the rent cap conversation that that these things should be ongoing'",
        "'speaker_8': 'and standalone.'",
        "'speaker_4': 'But I think that what makes the most sense from staff's perspective would be to have the council take action on the just cause eviction protections and on the maximum allowable rent increase. Then we know what those ordinances require and we will go back and then tackle the essentially the amendments that are currently in exhibit three and Exhibit'",
        "'speaker_4': 'two based on the feedback we heard. And we'll, we'll that that list and we'll eliminate things that no longer required based on a future ordinance that has not yet been adopted. So it'll probably lag the just cause and the maximum allowable rent increase by a month or two as we do that staff work.'",
        "'speaker_0': 'That's great. Are you saying you want us to take action just cause tonight?'",
        "'speaker_4': 'No, no, no, no.'",
        "'speaker_0': 'Oh, yeah. We can't even. It's okay. Okay. And even counts.'",
        "'speaker_10': 'I'm you to clear because you know 3180. I spoke to a lot of landlord groups because I got to run for office last year and over and over and over again, what they said was just cause that's why we put M.K. Measure K on the ballot.'",
        "'speaker_10': 'They didn't actually they liked a lot of the changes that were in 3180 besides the just cause which they felt right there wrongly came out of in their minds nowhere. And you know, yeah. So I don't want to spend too much time.'",
        "'speaker_10': 'That's I guess my point is, is they seem to be aware of what was in here. And I never once heard somebody say I didn't like that stuff. I'm sure there are people who don't, but they just don't want to drag it too long.'",
        "'speaker_10': 'And let's let's put this on so we can do Airbnb and get other things right.'",
        "'speaker_4': 'From staff's perspective, these were primarily housekeeping, but it probably makes sense if there are new ordinances that we check the amendments against the new policy and make sure we're we're consistent and we're taking care of changes that are relevant.'",
        "'speaker_4': 'So that I believe that takes.'",
        "'speaker_6': 'I'm sorry, one more Councilmember Ody. I mean, I'm not going to support changes to those sections, but given that one of our colleagues is actually asked about sections, it would be good if staff is prepared to answer any questions on them and when when the time comes for that presentation.'",
        "'speaker_0': 'Yes, sure. And go ahead and finish, Miss Potter.'",
        "'speaker_4': 'And then I what I perhaps there was less clear direction about what how the council wanted to proceed relative to relocation, anything, any kind of changes to the to the the way that the relocation benefit formula is. So I some I'm fine tuning of that could be helpful.'",
        "'speaker_0': 'So I'll jump in that you and I have discussed this and I know that in September we will get our next annual report on the rent program. And I think it might be the right time to, to consider that then um, I think it sounds like we're biting off quite a bit right now and okay, fine.'",
        "'speaker_4': 'So, well, yeah, so will incorporate that into the discussion come September. And then lastly, what we are asking for relative to action by the council tonight is to adopt the Ellis Act policy that is included as Exhibit One of the staff report, and I am happy to answer any questions relative to the draft policy.'",
        "'speaker_0': 'Any questions, Council? This. Mary, I.'",
        "'speaker_10': 'Have a quick, quick question. There was a concern that was raised about who is going to track. So when somebody pulls something off the off the market and says up off the market. Who's tracking? I mean, how how how do we know?'",
        "'speaker_10': 'So my problem with the all the data that we talk about is we're only getting self-reported people. We don't know who is actually doing no cause evictions. We just know people who are telling us they're doing no cause evictions, etc..'",
        "'speaker_10': 'How do we know that? Because I think I could be comfortable with the two year if I had confidence that we were going to track and that there were going there was going to be real strong prosecution of the fines by the city.'",
        "'speaker_10': 'But if we're kind of like, well, we're going to do our best, then I'd rather go with the five years and the longer that other cities have.'",
        "'speaker_4': 'So the one of the biggest changes by adopting a policy is that there will be a requirement that you record against the title of the property that you have done in Ellis Act termination, and you will provide the contact information for the in place tenant.'",
        "'speaker_4': 'And right now we are essentially complaint based or we track it and we try to phone and calls so we will know with an exact policy. We are recorded against the property and it doesn't get more sort of official or with certitude than to record against title.'",
        "'speaker_7': 'And we've also have drafted a number of forms that we can that we're going to provide to both landlords and tenants that will track what is in the policy so that both landlords and tenants have documents so that landlords know what to provide to tenants.'",
        "'speaker_7': 'Tenants know what they need to provide back to the landlords so they can be tracked if they, the unit should come back on the market. So we're thinking that while it's obviously not bulletproof, we think we do have procedures and forms in place that will help.'",
        "'speaker_7': 'But where right now we really don't have anything to.'",
        "'speaker_4': 'It's an improvement in terms of data.'",
        "'speaker_10': 'Yeah, I'd like to hear what my other colleagues think.'",
        "'speaker_0': 'About any other thoughts. Council members Okay. Carlson, Brody, thank you.'",
        "'speaker_6': 'It's just that I still prefer the five and ten and you'll have to come back and amend 3.8.1, right. If we change the course, that one talks about the 5% increase. So you'd have to come back and change that if we do other changes.'",
        "'speaker_4': 'I, I don't know that we would have to change that. I believe that that penalty is independent of the maximum allowable rent increase. We're saying that if the unit is re rented within five years, they can only charge a rent that's 5% higher than the employer.'",
        "'speaker_4': 'Okay.'",
        "'speaker_6': 'All right.'",
        "'speaker_0': 'Councilmember Avila.'",
        "'speaker_8': 'I would propose that we adopt it tonight if there are changes that need to happen to it afterwards, after we adopt the just cause and some of the other things I think that we can do the closer look, perhaps if we can agenda is that with the just cause because right now we don't have that aspect of'",
        "'speaker_8': 'it. That's so I would, I would say the motion. Yeah. So I'll make a motion that we, we go ahead and approve it right now as written so that we aren't delaying it, but that we asked the direct staff to have it agendas when just cause comes back.'",
        "'speaker_4': 'So because this is a resolution that will be effective this evening I understand then so.'",
        "'speaker_8': 'But we can agenda is it when we agenda.'",
        "'speaker_4': 'Is just an opportunity to talk about it that.'",
        "'speaker_8': 'We can talk about it in that way. If there is a proposal from Councilmember o.T or others to make amendments to it, we can do it at that time. Sure.'",
        "'speaker_0': 'I understand. Like a plan does that a second?'",
        "'speaker_6': 'Sure.'",
        "'speaker_0': 'All right. I have a motion in a second. Arm twisting, whatever you want to call it. All in favor.'",
        "'speaker_1': 'I i.'",
        "'speaker_0': 'Any opposed abstain. That was unanimous.'",
        "'speaker_4': 'Thank you very.'",
        "'speaker_0': 'Much. You and I just want to say a big thank you to Miss Potter for staff, housing authority and staff. You've been doing really heroic work pulling all this together and you are helping protect our tenants. We can do more.'"
    ],
    "Introduction of Ordinance Amending the Alameda Municipal Code by Eliminating the Sunset Clause (December 31, 2019) from Ordinance No. 3148 (City of Alameda Rent Review, Rent Stabilization, and Limitations on Evictions Ordinance). (Rent Stabilization 265)": [
        "'speaker_0': 'I think we will, but we're off to a good start. So thank you so much for your hard work, okay? Yeah. Fuck up. Okay. Now we are going to really quickly do this. I'm six eight. This is introduction of ordinance amending the amended municipal code by eliminating the sunset clause, which would take effect December 31.'",
        "'speaker_0': 'Ms.. Weisinger, do you want to do this? You do this better than I do you.'",
        "'speaker_3': 'Introduction Ordinance Amending Hourly Dismissal Code by eliminating Sunset Clause December 31st, 2019 from Ordinance 3148 City of Alameda Review Rent Stabilization and Limitations on Evictions Ordinance. And we do have a speaker now on this item.'",
        "'speaker_0': 'She's good, isn't she? Okay, so, um, is there a presentation with me and our speaker?'",
        "'speaker_4': 'I'm prepared to give a brief staff report if council would like one.'",
        "'speaker_0': 'I think council might want to just hear the speaker and decide, okay, our speaker then please.'",
        "'speaker_3': 'Lester. Carol.'",
        "'speaker_0': 'Okay. Yes, she did. Did you do?'",
        "'speaker_2': 'Good evening, Madam Mayor. City Council Leicester Commercial property owner Almeida not in favor of eliminating the sunset clause in 3148. They say, well, why, why? Why shouldn't we eliminate it? You know? Well, reason is 31, 48 is not done.'",
        "'speaker_2': 'You know, we've still got a long way to go. You've been in a meeting here for about 3 hours tonight, at least going over all the all the things that haven't been done. What I believe is you need to extend 31, 48.'",
        "'speaker_2': 'There should be a sunset clause. That way it makes things happen. Otherwise it won't. It'll just drag on and get pushed aside. So like I said, I believe council here should vote this down, come up with a more reasonable type of sunset, say with reviews in a little more stipulation in there.'",
        "'speaker_2': 'Let's look at it and then. That would definitely help both the landlord and tenant. This thing is a very costly program, as you well know, and it's not getting cheaper by the day. And you wonder why rents go up.'",
        "'speaker_2': 'Well, here it is. You know, so like I say, we need to we need to work a lot harder on this to get this straight. I heard a lot of talk here tonight about rent caps and all these other little goodies on there.'",
        "'speaker_2': 'And unless you own rental property, you really don't know those numbers. Housing authority doesn't know those numbers. You know, and but they're seeing these numbers because RAC is coming out with these numbers on a on a monthly basis.'",
        "'speaker_2': 'Now, you can see some people are renting high. Some people are renting low. You know, so you got to be fair all the way across the board. And that's something that hasn't been done. And I believe it should be.'",
        "'speaker_2': 'Landlord needs a better shake, otherwise we're not going to invest in Alameda. You know it's going to happen. And you wouldn't do that. You wonder why we don't have additional railing units in Alameda because of all of this.'",
        "'speaker_2': 'So it's something we all need to look at and address. Thank you.'",
        "'speaker_3': 'We you know.'",
        "'speaker_0': 'We have a guest speaker.'",
        "'speaker_3': 'Katherine Pauline.'",
        "'speaker_0': 'Ms.. Pauline.'",
        "'speaker_4': 'I'd like to speak in favor of eliminating the sunset. The housing crisis, as the statistics of have been presented both at the earlier meeting and today. Housing crisis has actually worsened. It looks to be impossible to actually build.'",
        "'speaker_1': 'Out of it within some of our lifetimes. I would.'",
        "'speaker_4': 'Also say that in terms of landlords talking about.'",
        "'speaker_1': 'The what has been happening in the housing market, their equity has doubled in the last.'",
        "'speaker_4': 'Six years, according to a Zillow economist. This is the best time in 30 years for the mom and pop, mom and pop landlord operations to own property. And even with in the Bay Area, when there have been different drops and rises, there's no question that to own.'",
        "'speaker_1': 'Property.'",
        "'speaker_8': 'In the Bay.'",
        "'speaker_4': 'Area, however it was acquired, the trajectory continues to go up. This is a very sound investment. Renting homes to US renters is a business.'",
        "'speaker_1': 'And I hope they do well. I would say they've made a very good investment.'",
        "'speaker_4': 'And they are doing well. But the housing crisis, for most of us who are trying to stay, has simply gotten worse, as represented by the continuing increase, the dramatic increase, the amount of mayor I indicated from an increase of homelessness of 16% in just two years time.'",
        "'speaker_4': 'So I strongly urge that you remove this sunset. It's the only ordinance in the city that has one, and we are half the population of the city. Thank you.'",
        "'speaker_0': 'Thank you. And that was our last public speaker. Okay. Is there any discussion or do we have a motion?'",
        "'speaker_4': 'Mayor.'",
        "'speaker_8': 'I'd like to move. A move to remove the sunset.'",
        "'speaker_0': 'Okay, so. So you move approval of this ordinance. Second, I have a second and motion second to have discussion. Council member decide.'",
        "'speaker_5': 'I'm going to vote for the removal of the sunset, largely because I support 3148 as it is now. And but I think what's coming down the pike is 31, 48 will be altogether changed dramatically. So this is my way of supporting the 3148 from 2016.'",
        "'speaker_5': 'But you know what happens later this year? I will say one thing. I don't like to make predictions, but, you know, with the passage of the impending passage of the classic in Alameda, one of my predictions is I really wonder about single family rentals and duplexes.'",
        "'speaker_5': 'I think you're going to see there are 24 or 25% of the rental stock. And I think people are going to do the you know, do their calculations and think that, you know, it's better just to to get out of it if you're a single family rentals or duplexes.'",
        "'speaker_5': 'And I think, you know, what you're putting down the path is for people to really you're incentivizing them to get out of there. So I think the regime that's being put in place is too harsh. And I prefer the 3148 end of 2016, but I will vote for the sunset.'",
        "'speaker_0': 'All right. We've had him. Thank you. We've had emotions taken all in favor, I. All in favor. So that's unanimous. All right. Thanks, everybody. Right now we are going on to where we going, Madam Clerk.'",
        "'speaker_3': 'And it's a long one, so.'",
        "'speaker_1': 'I'll.'",
        "'speaker_3': 'Be reading for a moment.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_3': 'So this is considering four cannabis related ordinances and providing direction on phasing of cannabis per unit permits. Two of the ordinance repealed existing regulations and then following a public hearing, council will consider adopting the same regulations. I'll just start.'",
        "'speaker_3': 'Introduction of ordinance to repeal in its entirety. Ordinance 3227 concerning cannabis regulations and Aluminum in full code. Article 16 Cannabis Businesses of Chapter six, businesses, occupations and Industries that, among other things, establishes the number of retail cannabis dispensaries to be open to the public, including delivery, disperses their operations, creates a buffer zone from sensitive uses and permits'",
        "'speaker_3': 'the sale of non medicinal cannabis. Introduction of an ordinance to repeal in its entirety. Ordinance number 30 to 28 concerning land use requirements in the Zoning Ordinance of Aluminum Municipal Code Section three Dash ten cannabis that, among other things, permits retail cannabis dispensaries in certain zoning districts subject to a conditional use permit and permits the sale of'",
        "'speaker_3': 'numerous full cannabis and certain zoning districts. Then a public hearing to consider introduction of an ordinance concerning Kansas regulations an element of permissible code. Article 16 Cannabis Businesses of Chapter six Business Occupations Industries that, among other things, establishes the number of retail cannabis dispensaries to be open to the public, including delivery, disperses their operations, creates a buffer'",
        "'speaker_3': 'zone from sensitive uses and permits the sale of non medicinal cannabis and introduction of ordinance concerning land use requirements in the Zoning Ordinance of Aluminum Possible Code Section 30, Dash ten cannabis that, among other things, permits retail, cannabis dispensaries and certain zoning districts subject to a conditional use permit and permits the sale of non medicinal cannabis in'"
    ],
    "SUMMARY: Consider Four Cannabis Related Ordinances (as directed by the City Council on February 19, 2019) and Provide Direction on Phasing Cannabis Permits as Follows: Two Ordinances (A and B) to Repeal the Existing Cannabis Regulations; following a Public Hearing, Two Ordinances (C and D) to Adopt the Same or Similar Regulations; and Consider Phasing the Number of Dispensary/Delivery Permits through the Request for Proposals Process\n\nRecommendation to Consider (A) Introduction of Ordinance to Repeal in Its Entirety Ordinance No. 3227 Concerning Cannabis Regulations in Alameda Municipal Code Article XVI (Cannabis Businesses) of Chapter VI (Businesses, Occupations and Industries) that, Among Other Things, Establishes the Number of Retail Cannabis Dispensaries to be Open to the Public (including Delivery), Disperses Their Operations, Creates a Buffer Zone from Sensitive Uses, and Permits the Sale of Non-Medicinal Cannabis;\n\n(B) Introduction of Ordinance to Repeal in Its Entirety Ordinance No. 3228 Concerning Land Use Requirements in the Zoning Ordinance of Alameda Municipal Code Sectio": [
        "'speaker_3': 'certain zoning districts and consider phasing the number of dispensary delivery permits through the request for proposal process.'",
        "'speaker_0': 'Thank you. All right. Councilmember Desai.'",
        "'speaker_5': 'Madam Mayor, as I've done in the past, I will recuse myself for this matter, for the reasons stated before. Oh, I guess I have to say more than that, because my house is close to a place that is specifically benefiting from any changes and in my opinion, is not a public generally issue.'",
        "'speaker_5': 'It's a very narrow issue. And so as a result, I have to recuse myself.'",
        "'speaker_0': 'Thank you. All right. Thank you. Oh, okay.'",
        "'speaker_7': 'Briefly. Yes, very quick.'",
        "'speaker_0': 'You know, city manager Mike Brooks.'",
        "'speaker_7': 'Because council is is well versed in this whole issue. In November, the council adopted two ordinances, 32, 27 and 3228 concerning regulating cannabis businesses in the city. A complaint was filed under the city's Sunshine Ordinance that the agenda title for these ordinances, when the council first considered their introduction, did not reflect certain provisions in the ordinance that'",
        "'speaker_7': 'was introduced on October 16th and adopted on November 7th. The Open Government Commission conducted a hearing on the complaint, sustained it and as as a remedy held that the ordinances were deemed null and void, and that the Council may consider re noticing the ordinances following a public hearing on February 19th of this year.'",
        "'speaker_7': 'Council directed staff to notice a public hearing concerning the repeal of the two ordinances and consideration of the replacement of such ordinances with the same or similar provisions. Those items are before you tonight in the four ordinances that the city clerk has read.'",
        "'speaker_7': 'The city and the Council may also choose to consider phasing the number of cannabis related dispensary permits through the request for proposal process if it so chooses. I'd be glad to answer any questions concerning this item.'",
        "'speaker_0': 'Any clarifying questions. If none of the no questions now, do we have speakers lips?'",
        "'speaker_3': 'Yes, we have six speakers.'",
        "'speaker_0': 'Six speakers. Okay. So if it's six, then in 3.'",
        "'speaker_3': 'Minutes.'",
        "'speaker_0': 'They should get 3 minutes. Okay.'",
        "'speaker_3': 'If we have one more submitted.'",
        "'speaker_1': 'Gets to.'",
        "'speaker_0': 'Two. Yeah. What comes in the next people go in. Did you get that?'",
        "'speaker_3': 'The first one is Anita Lou and then Johanna Lao. And then I'll read.'",
        "'speaker_1': 'Good evening. My name is Anita Eng. I'm a long term longtime Webster Street business owner located near the proposed dispensary. I understand that the city has spent a great deal of time of bringing this industry into town. But I would like to ask that you provide as much consideration to the business that I have been here as'",
        "'speaker_1': 'well. Our opinions and voices have not been heard until now. What are the concrete way that the city will enforce our existing no smoking laws on Webster's? People currently sit on benches and smoke, Anderson, and the smoke rose into our business.'",
        "'speaker_1': 'Murder is dispenser attract more smoking as well. I want to know, how can you make sure no one will buy and step out the store to consume pot in the business district or around the neighborhood? Stay low, banned, consuming marijuana in property and sit up.'",
        "'speaker_1': 'Alameda banned smoking on Webster Street. But how can we increase compliance with the law? Call the police every time I see or smell something. How soon were the police response? They probably leave before the police come. So how do we know if someone consumed pot on the street inside a car and start to drive home?'",
        "'speaker_1': 'Is this safe to drive under influence? Wilson is a very busy district and Webster is the main street leading to the tunnel. We have so many cars every day. Do we have extra police officer to enforce the law?'",
        "'speaker_1': 'Please consider our existing business.'",
        "'speaker_6': 'Residents.'",
        "'speaker_1': 'And pub owners concerned and arise. We want to see Webster Street private businesses and service that are compatible with the children, family and seniors who live there. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker, Madam Square.'",
        "'speaker_3': 'Oh. Looks like we have one more speaker slip, so we'll lower.'",
        "'speaker_0': 'Okay, so we just went from 3 minutes to 2 minutes per speaker. Yes.'",
        "'speaker_3': 'So the next speaker is Joanna Lao John.'",
        "'speaker_0': 'Hello. Sorry.'",
        "'speaker_1': 'Evening. My name is Joanna. I our person, myself and also international cheating should do. First, I want to qualify that there is a 600 feet buffer zone for all the children in a center. And the second, I would like to ask, is there any way to fulfill the what the requirement of good labor policy?'",
        "'speaker_1': 'What did the city do to fulfill this kind of requirement? And how can the city fulfill this kind of requirement as well? And number three, the city wants to allow up to two cannabis retailers out of an impact street and also a Webster Street.'",
        "'speaker_1': 'My simple question is, if we want to serve more people in Alameda, why is only on two grand streets in alameda. Is up to two though often. Why is not. Fairly lay in different location and number four in the city mentioned there is a formula to support that alameda needs 2 to 4 retail stores in Alameda.'",
        "'speaker_1': 'And my question is this is a business model calculation. What is the credibility and this where does this formula come from? What is it based on? And the fifth item, do we have a budget for regulation or enforcement?'",
        "'speaker_1': 'And also the costs of immigration, the costs of drug prevention, education. If we don't have a budget gets why we are in was to give out the permits if there is a budget. We are asking for transparency yet.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Then Phil read Don Sharrett and Rich Moskowitz.'",
        "'speaker_2': 'So you forgot the best options. We can go with no ordinance and use the state minimum standard and issue permits on a case by case approval. We can treat marijuana like alcohol and marry alcohol or marijuana on a safer ordinance and treat them both equally as we should.'",
        "'speaker_2': 'I can go to a dozen businesses around Alameda High School for Girls. I can get beer at the local coffee shop, a popular student hangout and pipe our kids in for many of you, less than 350 feet from the school.'",
        "'speaker_2': 'And to me, that's crazy. I say screw the friends of the dojo. We are the friends of the dojo. We declare war.'",
        "'speaker_1': 'On the Syrian army and their fake outrage. All the alcohol retailers and only retailers were scared and rallying behind her. They don't want to see her.'",
        "'speaker_2': 'Alcohol permitted go. And I doubt.'",
        "'speaker_1': 'You do too.'",
        "'speaker_2': 'This proves it's not about kid safety, so stop pretending I'm trying. I'm tired of the bias and phobic NIMBY jerks trying to tell me how to live in this town. My cannabis.'",
        "'speaker_1': 'Gardeners is the.'",
        "'speaker_2': 'Best time to plant.'",
        "'speaker_1': 'Outdoors.'",
        "'speaker_2': 'If you would like in advance, you can find me on Facebook. I need a politically incorrect or YouTube's opinion in greens. Cannabis is in the bag for the 2020 election and any step backwards will be a waste of time because we're inverted and we'll go right back to petitioning for.'",
        "'speaker_1': 'Cannabis through the 2020 election events. And you all.'",
        "'speaker_2': 'Know that.'",
        "'speaker_1': 'Don't tread on.'",
        "'speaker_2': 'Me. I will scoff the cannabis laws if I.'",
        "'speaker_1': 'Think they're unjust. I would like to address the mayor once a probation.'",
        "'speaker_2': 'Officer, and I would like to know, have you ever drove any.'",
        "'speaker_1': 'People for cannabis use in the.'",
        "'speaker_2': 'Past, legal or not? How do you feel about that today? Have you ever.'",
        "'speaker_1': 'Commented on your experiences with cannabis.'",
        "'speaker_2': 'Law enforcement as a probation officer?'",
        "'speaker_1': 'During my first gig.'",
        "'speaker_2': 'At City Hall, you said.'",
        "'speaker_1': 'To me, Stop what I'm doing.'",
        "'speaker_2': 'It's illegal. I get in trouble and I want you to.'",
        "'speaker_1': 'Be holding back and you admit that your piece was lives. And I never thought that you can do anything about it.'",
        "'speaker_2': 'What's your views on this? I was a probation officer. I was. I'm still here with my bag of mystery. How many points like you walked up?'",
        "'speaker_0': 'How many stones like.'",
        "'speaker_1': 'You.'",
        "'speaker_2': 'Try to take away from their families? How many dopers like me did you make pee in a cup?'",
        "'speaker_0': 'And what? How do you feel? About 3 to 10.'",
        "'speaker_2': 'Using the word opium to describe the cannabis use.'",
        "'speaker_0': 'So I was actually going to stop you when you verbally attack Serena Chen. You should be able to make your remarks without including ad hominem attacks. This is this. Okay. And. And so anyway, this is it. This is an example not to be followed by other speakers, but I'm pleased to say that most people don't.'",
        "'speaker_0': 'Anyway, we do avoid personal attacks and my colleagues wanted to.'",
        "'speaker_6': 'That's what we.'",
        "'speaker_8': 'Did. That was what I was like.'",
        "'speaker_0': 'That's all they wanted to say. Point of order. Thank you. Yeah, I am again in Alameda. We should be able to discuss anything, but we should be able to do it with civility. And to the extent that one is not able to do that speaks more to the strength or weakness of your argument rather than whoever you'",
        "'speaker_0': 'might be attacking. So with that, we have. Mr..'",
        "'speaker_3': 'Okay. Moskowitz then Serena Chen and Ryan Agaba.'",
        "'speaker_0': 'Okay. All right.'",
        "'speaker_2': 'I give my equal time.'",
        "'speaker_0': 'You do?'",
        "'speaker_2': 'You're lucky I have a head call tonight, so I'm not going to take much time. Mayor Ashcraft, member of the City Council. We've had an interesting trip down here with the cannabis issue. We've had two council members who are sitting up here now supported all the way from day one.'",
        "'speaker_2': 'And we have an ex mayor who supported it. So the votes were always three two. The acting city manager looked like he worked for the cannabis industry. He probably has some interests someplace.'",
        "'speaker_0': 'Somewhere, and once again, the same window. I like to.'",
        "'speaker_2': 'Say that attack free speech and have a right to sue.'",
        "'speaker_0': 'You do.'",
        "'speaker_2': 'But I'll get down to the facts tonight. You have tonight on your agenda something you should just discard and say no to and move on and call time out and get some things corrected before you try to move forward.'",
        "'speaker_2': 'You know, you double the number of storefronts. No, you drop the medical only requirements. That's what we were pushing before. A couple of council members were. We want the medical. Medical is good. The dispensaries are good. If they're in the right location, increase the you know, the areas where stores can locate.'",
        "'speaker_2': 'You gerrymandered this last one in, you put the dispensary right next to the Juno. The, you know, art, the, the, the place that was Juno. And I got another problem, too, talking to my good friend Nick Cabral the other day.'",
        "'speaker_2': 'He's you know, you're he's in charge of the west end of town. It was for that way. And he looks at Tony De Saag here, who's a council member who excuses himself from this issue. Mr. De Saag was elected by everybody.'",
        "'speaker_2': 'He should stand up, at least make his opinion. Two of you have made your opinion very clear and it's appreciated. I don't mind to disagree, but I don't like the fact and he does neck and he'll do something about it that he bows out on every issue.'",
        "'speaker_0': 'Thank you, Mr. Chair. Mr. Moskowitz. His next.'",
        "'speaker_2': 'Mayor Council members, thank you for the opportunity. We've been doing this for a little over two years. For the record tonight, I'd like to state a few things. I'm a Alameddine for 14 and a half years, like the member of my club.'",
        "'speaker_2': 'We spoke earlier tonight. I will be leaving in a pine box at some point. I'm a founding member of Alameda. Ask of the group. Ask who you've heard from for the last two years. I'm the founder of Alameda Citizens Task Force.'",
        "'speaker_2': 'Excuse me. I do that all the time. I'm a little nervous. I'm the founder of Alameda Cannabis Times. It's an online action group with over 300 interested individuals. And I'm the author of the 2018 Alameda Citizens Responsible Adult Use Cannabis Act, which was in the signature gathering phase one of six that have ever been done throughout the'",
        "'speaker_2': 'history of our city. And as Ms.. Butler can tell you, within 60 days of that, we immediately received over two thirds of the signatures necessary, and we suspended that because the city council specifically sought to follow the state and add responsible adult use cannabis into the discussion.'",
        "'speaker_2': 'I'm here tonight to thank you, not for the past. I'm here tonight to thank you. Unlike what you've heard earlier, for the opportunity to meet my neighbors. I've never been involved in city council stuff before and quite honestly, it's been quite a big pleasure to meet Ms..'",
        "'speaker_2': 'Chan, to meet Mr. Jarrett and certainly to meet many people who agree with me. But nevertheless, that is an Alameda value to meet my neighbors and to have the opportunity to have public discourse no matter where we fall on this.'",
        "'speaker_2': 'So tonight I'm here to remind you of this and to also point out something that's not been discussed in the extensive discussions we had about the the pin point of this issue, sales of public sales. One of the things that's been missed in this constant delay is not only the employment opportunities, but the revenue opportunities from the'",
        "'speaker_2': 'manufacturers. I understand certainly what's in the public eye is the storefront.'",
        "'speaker_0': 'Thank you, Mr. Moskowitz. Our next speaker is that I missed him.'",
        "'speaker_1': 'Good evening, Mayor Ashcraft, members of the council. You all know that I come from a public health background and I brought with me 25 years of experience in pushing back big tobacco. And I want to say that the city of Alameda is going to be entering into a grand experiment.'",
        "'speaker_1': 'We're looking at allowing cannabis into this town. And all I can say is I know what I know from tobacco. I know what I know from two years of doing research in everything cannabis. And what I have to say is just to quote the public health officer in Los Angeles County who just has these four points for'",
        "'speaker_1': 'all city officials to consider as they go down this road. Number one, in October, the American Journal of Psychiatry found that marijuana may pose a greater risk to teenagers brains than alcohol. In terms of memory learning and higher level thinking, marijuana is addictive.'",
        "'speaker_1': '9% of adults we use marijuana may become addicted 17% of teens. However, these numbers are based on a marijuana THC content of 2 to 4%. The current marijuana on the market is at 15 to 20%. Number three, childhood infant exposure.'",
        "'speaker_1': 'They have found that it has a lasting impact on memory and executive functions and IQ. I'm just citing the public health officer in the county of Los Angeles and drug driving. There's an increase in the number of drivers who were fatally injured in accidents who tested positive for cannabis.'",
        "'speaker_1': 'That does not mean causal. It just means there's a correlation. And this is in all the states that have legalized marijuana over the course of this, I've come to realize from talking to my neighbors is there is a need for city staff to improve communications with the impacted communities.'",
        "'speaker_1': 'And I just want to say I'm happy to move forward and work with Joel and work with my Kurzman. I'm trying to put the best organic.'",
        "'speaker_0': 'Chemistry in our next speaker.'",
        "'speaker_1': 'Ryan Acaba.'",
        "'speaker_0': 'Mr. Acaba.'",
        "'speaker_2': 'Hello. Council members, Mayor Ashcraft, appreciate you letting me speak tonight. Just want to just make this real brief. We've been all of us. Well, you know, two or three of up there. We've been seeing this same same item coming up for over ten.'",
        "'speaker_2': 'Feels like 20 meetings at least. You know, we've done a number of town halls, special meetings and workshops. And so those who are opposed to it had their opportunity to speak out. And you know that the public has already spoken.'",
        "'speaker_2': 'You know, the majority of the public has already spoken. And so I just urge you all to pay respect to the work that we've done the last two years, getting this to where it is and to if we are to get a first reading to keep it as close, to actually just keep it the same way it'",
        "'speaker_2': 'is, it is. Don't use this as an opportunity to change anything. Just keep it the way it is. Because we've everyone, including two members of this city council who are sitting right now, you know, we all did a bunch of work and let's just respect that and, you know, just keep this the way it is.'",
        "'speaker_2': 'And that's it. Thank you.'",
        "'speaker_0': 'Thank you. Do we have another speaker? Was it. That was our last speaker. Okay. Mr. Rausch, can you go over procedure with us?'",
        "'speaker_7': 'Well before you tonight are four ordinances to would repeal 30 to 27 and 30 to 28. And then the other two would reintroduce 30 to 27 and 30 to 28. As drafted, they would parallel or they would be the same as the repealed ordinances.'",
        "'speaker_7': 'So those are the the options that the council has in front of it. And then also, we have on the agenda, if the council decides to move ahead with the with the ordinances that you could have a discussion about whether you want to phase the retail dispensary permits in some respects.'",
        "'speaker_7': 'So those are the items that are before you tonight.'",
        "'speaker_0': 'QUESTION Councilman, really?'",
        "'speaker_6': 'Thank you. We can do.'",
        "'speaker_2': 'All of that in one motion.'",
        "'speaker_7': 'I think I think it would be better to consider the ordinances separately, because I think there may be some there may be some issue about trying to put them all together. I think the council's policy typically has has had consideration of ordinances on a on a one by one basis.'",
        "'speaker_6': 'But we did the budget two weeks ago with one one motion. I think there were multiple.'",
        "'speaker_0': 'Well, okay. So. Okay, so you're asking if the budget is parallel to or comparable to repealing and reenacting ordinances?'",
        "'speaker_6': 'Well, I'm just wondering why we would want to do it inconsistently.'",
        "'speaker_0': 'Okay. Do you want to respond to that before I go on to the next question?'",
        "'speaker_7': 'My advice would be to consider them separately. The council has a discretion if it wants to do it that way. I'm not going to say you can't do it that way, but I would not recommend it.'",
        "'speaker_0': 'Councilmember Vela.'",
        "'speaker_8': 'You said there's two separate ordinances. So you mean 32, 27 and 32, 28. So hypothetically, we could do one motion to repeal and reinstate 30 to 27 and then we could do a separate motion to repeal and reinstate 30 to 28.'",
        "'speaker_8': 'Or are you saying that we have to do those separately? So it would be four motions.'",
        "'speaker_7': 'Ideally, it would be for emotions. If there's a desire to, you could, you know, you could split it up and, you know, emotion to repeal both or you could split it up and do repeal 3227 and reintroduce it.'",
        "'speaker_7': 'And another motion to repeal 30 to 28 and reintroduce it. You could mix and match, I suppose, if you want to if you don't want to do four separate introductions.'",
        "'speaker_0': 'Okay. And then the vice mayor.'",
        "'speaker_10': 'I just want to clarify what I heard you, which is it would be cleaner if we did four different votes, but there's nothing that actually precludes us from just doing a single. I think that there's some reasons why people might want to just do things as one vote.'",
        "'speaker_10': 'And I just want to make sure that if that if that's the case, there's no reason not to do it. It just leads to the potential for confusion later.'",
        "'speaker_7': 'Correct. Because what will happen, even if you do it that way, the clerk is going to give a separate number to each of those ordinances regardless of how you get there. Right. If assuming that the motion contains all four.'",
        "'speaker_0': 'Advice. Mary subsequent.'",
        "'speaker_1': 'Okay.'",
        "'speaker_10': 'I just I have a couple of comments if that's not the case. And so for me, as a as I think I said, maybe not as clearly as I would have liked at the first or second meeting in January regarding this.'",
        "'speaker_10': 'I think that we've heard a lot of speakers, we've heard a lot of discussion about all the work that went in. At the end of the day, our Open Government Commission found that one piece of. One of these ordinance was mis titled on the agenda and therefore violated the Sunshine Ordinance.'",
        "'speaker_10': 'And for that reason we are now here in April still talking about something that could have been finished in November. You know, I had a conversation with a number of people who reminded me along that four years ago when we had a changing of the mayor, etc., the Del Monte building was approved and an incoming new member'",
        "'speaker_10': 'of the council tried to change everything. It ultimately failed and I was not impressed at that time. And so even in January, I came forward with the idea that there was a lot of work that was done on this that I'm not going to try to undo.'",
        "'speaker_10': 'Because while it is true that the ordinance was not noticed correctly, there was only one small thing there. During the discussions I've heard I have heard conversations we heard tonight about the concern of doubling the number of cannabis dispensaries.'",
        "'speaker_10': 'But I also believe that, as I as I said in January and said again in February and now here we are in April, a lot of people have spent a lot of money and time waiting around to get this thing moving forward.'",
        "'speaker_10': 'In January, I proposed the idea of approving the ordinances in this case, repealing and replacing with the exact same ordinances with no changes, and giving staff some direction about moving forward with three and then a fourth permit. There was some confusion around what that meant, how that would look, etc. And talking to staff, I've talked to them'",
        "'speaker_10': 'about the idea of basically setting a delay between when the fourth permit, not necessarily the fourth person on the RFP, but the fourth the fourth person across the across the line can open said basically to the opening, I would say six months after the opening of the first cannabis dispensary in town to give us some time to'",
        "'speaker_10': 'make some adjustments before we necessarily get to four cannabis dispensaries. Personally, I think that the timing of all this, we're not going to see four dispensaries open very quickly. But I do think that it's a way for us to show those in our community who are not a small minority, the voice that we're hearing and that we'",
        "'speaker_10': 'are trying to take the concerns that are being raised about what could be what some people perceived to be the impact of these forward. And so I would like to propose and, you know, I guess I can wait, but I'd be happy to make a motion also.'",
        "'speaker_10': 'I would like to propose that we replace repeal and replace the the ordinances as written and give staff in the same motion direction to work with you delay the issuing of the fourth. Okay to open the store to six months after the first opened or the July 1st of 2020, whichever comes first.'",
        "'speaker_0': 'I think I'd like to hear a little more discussion, but I mean, if they hear a little, you can make it in motion, but there might be a friendly amendment, so maybe we like to hear a little more discussion.'",
        "'speaker_0': 'Councilmember Odie.'",
        "'speaker_6': 'Start with me.'",
        "'speaker_0': 'Well, do you want to? I think you're looking.'",
        "'speaker_6': 'I didn't make eye contact, but I.'",
        "'speaker_0': 'I can go now, sir. I can go next.'",
        "'speaker_6': 'I mean, we have.'",
        "'speaker_0': 'One or she can go next, I think. Okay, go ahead. Councilmember Bell.'",
        "'speaker_8': 'I've heard a lot of people say we didn't know about this, we didn't know about this. But we you know, we appealed it. We didn't know about this. But we we brought people out to speak at the planning board to oppose it.'",
        "'speaker_8': 'I find a lot of kind of I would find it more. I just feel like the finish line keeps moving and I would find it more genuine if a concern was being raised about consumption, if the same people in the same groups weren't opposing on site consumption.'",
        "'speaker_8': 'The reason that we have talked about on site consumption is because essentially you can't if you're a renter, by the way, it means now that you if you smoke and you're taking your medicine in a multifamily building, you're technically in violation.'",
        "'speaker_8': 'If you are on the street, you're technically in violation. And that's part of why we originally proposed the on site consumption. And the proposal isn't that people then consume and get in their cars and leave. We also have bars where people consume alcohol and the what they're supposed to do is they're supposed to find a safe way'",
        "'speaker_8': 'to get home. And part of what we were talking about with onsite consumption and this was happening when we were having these conversations, was essentially that, you know, part of what we're looking at from the business owner perspective is, you know, is there going to be you know, are you going to be working with different ways to'",
        "'speaker_8': 'make sure that people are actually safely leaving the building? But I am not of the mindset that we criminal we we pass this and we create these dispensaries and then we find ways to criminalize it again or to punish people for consuming.'",
        "'speaker_8': 'What is this, in essence, medicine. So that's that was the conversation around consumption. Those meetings were agendas. Nobody appealed the title or the process at that point. There was a lot of public feedback. We had workshops on this, we've had numerous meetings on this, and I think that there's been a lot of public comment.'",
        "'speaker_8': 'I'm frankly, I feel like with the delays coming from the state and by the way, this is an issue where you have to get you have to go through the city process. You also have to go through the state licensing board.'",
        "'speaker_8': 'You actually have to do a lot more here than you do just to get your liquor license, to be honest with you. And I find compelling. Yes, there's evidence coming out in terms of the impact on minors. These dispensaries are not selling to minors.'",
        "'speaker_8': 'That's not what's happening here. So I think that, you know, I would like to focus on on what's being proposed and what we passed. And that's about adult use, which is much more regulated than alcohol and everything else.'",
        "'speaker_8': 'And the the buffer zones that we've talked about in the sensitive uses, which we agenda is we've had multiple meetings on. In terms of this delay, I, I would like to I mean, I'm frankly, I'm not really in support of it.'",
        "'speaker_8': 'I think it's kind of an optics thing. And I would like to know how staff proposes to actually administer that because it seems very arbitrary. And frankly, as as you noted, vice mayor, there is going to be a delay.'",
        "'speaker_8': 'I think, you know, if we have that earlier date of July one, 2020, I think it's more more likely than not, frankly, that. Just the overall process. Once we go through the RFP and we issue the RFP and then you got to go through the state licensing board.'",
        "'speaker_8': 'So I guess my my question be why? Why do we have that? Is that kind of a security blanket to make people feel good? But I don't I, I just I think it's an optics thing. If that's what you need to have this passed, fine.'",
        "'speaker_8': 'But I really I just I just don't understand what the purpose of it is.'",
        "'speaker_0': 'Through the chair if you care to respond or you don't need to.'",
        "'speaker_8': 'And I would want to hear more from staff about how they they plan on even administering that. How do you decide who the fourth one is.'",
        "'speaker_2': 'And go.'",
        "'speaker_8': 'And and what is this minimum of July one, 2020? I mean, does that mean that at that point we just issue the fourth RFP or the fourth permit? And what does that mean for the delay for them?'",
        "'speaker_4': 'So the idea is that if there is a desire on the part of the Council to require that the forth permit would be issued no sooner than six months after the first dispensary opens, or an outside date of July one, 2020, because staff felt it was important that there be an outside date.'",
        "'speaker_4': 'The idea would be that we would issue the RFP once the council completes its first and second reading of the re-introduced ordinances. If that's the way it goes. Then we would issue the RFP, we would issue the RFP.'",
        "'speaker_4': 'There will then be three three additional permits that are available to be issued. Those applicants are ranked. That's the standard process under our RFP and they get a score. And the the top three highest scoring applications would then be awarded the right to apply for a cannabis business operator's permit, the lowest score.'",
        "'speaker_4': 'So the third ranking proposal would be told it would be in the RFP that if you are the third ranking proposer, that you would not be able to open your business six months any sooner than six months after the first dispensary is open or July 1st, 2020, whichever happens first.'",
        "'speaker_8': 'Does that include the one that's already going through the OR gone through the RFP process?'",
        "'speaker_4': 'That's correct, because that's the first one. We've awarded one one business, the right to apply for permits. That process is underway. They have submitted for their their operators permit. And we have three more. Three more permits under the cap.'",
        "'speaker_0': 'Okay. Councilmember Odie.'",
        "'speaker_6': 'Okay, thanks. First of all, we've had a lot of meetings on this, so I'm not going to go into. I will trust the folks who said this was a notice issue and not a second bite at the apple or third bite at the apple to kind of reopen and relitigate the intricacies of the ordinance.'",
        "'speaker_6': 'So. Way I understood the idea was that the occupancy permit would be.'",
        "'speaker_2': 'No matter who finished.'",
        "'speaker_6': 'First, second or third in the RFP that whoever got to the door first to get a occupancy permit, that would be where would be keyed off of. And then whoever's last whether it could even be the one that's in process now whoever's last get in their occupancy permit has to wait a certain period of time.'",
        "'speaker_6': 'And I'd prefer something shorter, like three months if we were going to go with this before they get their occupancy permit. So it's not dependent. The number four in the queue of RFP scoring is not dependent on waiting until somebody else opens that they all could open.'",
        "'speaker_6': 'And whoever gets there first, the first three get to open whatever, and then the fourth one has to wait, you know, six months under the original motion, three months is my preference, but or to July 1st. So it was keen on the occupancy permit, not on scoring.'",
        "'speaker_6': 'I mean, that's kind of an idea that I could live with.'",
        "'speaker_4': 'Right? So we think that the combination of a date that is no sooner than six months after the first businesses open and an outside date of July 4th, we're proposing July one of 2020 that with that outside date, it is the most straightforward to rank the applications that come in under the RFP, which is how we handled'",
        "'speaker_4': 'the first RFP, and that we would notify as part of the RFP that the third ranking applicant, the condition of your right to pursue a permit would also include the condition that you couldn't open any sooner than six months after the first businesses open or July 1st of 2020.'",
        "'speaker_4': 'Because that is that brings certainty that outside date provides certainty so that even if applicants two and, you know, one and two that were ranked higher, it doesn't matter how far along there they are in the process because the the outside date provides certainty that that would be the latest point at which you would be allowed to'",
        "'speaker_4': 'open your business. So it that seemed to staff the most straightforward way to handle it.'",
        "'speaker_6': 'Well, that's not how I described it. So I prefer something longer along the lines of how I described it, that it doesn't really matter how you rank, it matters how you get who gets the occupancy permit first, because otherwise you're going to have one business who supposedly meets all the requirements of the RFP dependent on somebody else'",
        "'speaker_6': 'before they can open. And to me, the fair way is let everyone go as fast as they can. And then, you know, the fourth one who's like behind whatever, maybe they don't get in line fast enough, maybe they get delayed at the state or whatever.'",
        "'speaker_6': 'They get their occupancy permit last even if they're already in the process.'",
        "'speaker_4': 'But with an outside date, you are not tied to the first.'",
        "'speaker_6': 'I understand that, but I'm not buying into the proposal that, you know, it's number four and, you know, you wait on somebody else. So this is the idea.'",
        "'speaker_0': 'You just wait. Let him finish. Let him finish. And then I.'",
        "'speaker_6': 'Mean, this is kind of how I understood the discussion. So all right. So maybe the vice mayor can clarify what he means by staging.'",
        "'speaker_0': 'Okay. Here's the chair. Would you like to respond, Mr. Vice Mayor?'",
        "'speaker_10': 'What Councilmember Ortiz said is what I proposed.'",
        "'speaker_2': 'Okay.'",
        "'speaker_4': 'So and and so there.'",
        "'speaker_10': 'Is a backstop for July 1st, 2020. Right. Right. But all four move forward. The in once the first first store opens, there is a ticking clock. The next two can open at any point after that part. And if it's within if it for my six months, if it's within six months that the fourth permit, the first person'",
        "'speaker_10': 'you've gotten a permit can open until that six month clock is finished. Unless in July four. Unless July 1st comes faster. So. Which is what I heard you describe.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_0': 'Okay. My turn. So I'm thinking just listening to the two of you. Councilmember Odean, Vice Mayor Knox. Why? That maybe there is some semantic. Semantic confusion there because I think. Vice Mayor, when you said you could have delay in issuing that RFP six months after the third one approved, you didn't necessarily mean the third ranking in the'",
        "'speaker_0': 'RFP order. Just the third one to get to the point of.'",
        "'speaker_10': 'Once the RFP is done and the top three people are because there's already one in the markets the next three. So that's where the number three is coming from. It's assuming one's already. So I'm looking Jim questioning those three would move start moving forward through the process to the planning board, get the city permits, go into the'",
        "'speaker_10': 'state process and then the first two to open would have no constraints. And the third of that one, the fourth permit that has been issued by the city, would possibly wait.'",
        "'speaker_0': 'Okay. Okay.'",
        "'speaker_6': 'And so well or it could be the one that's already in progress. They may encounter some delay that we don't know about.'",
        "'speaker_0': 'And whoever gets her first.'",
        "'speaker_6': 'Could get a jump ahead of them if they're really good. And they were mis scored somehow.'",
        "'speaker_2': 'Yes. Okay.'",
        "'speaker_0': 'Okay, Major. So I like the idea of that that delay that lag time. Just because what we've talked about all along since we began talking about this topic is you do want to give staff and public safety and everyone else involved in administering this ordinance and this very new business model in Alameda.'",
        "'speaker_0': 'Time to just get the details right in there. You know, there's bound to be some things that weren't anticipated. And so I think a little more time sounds reasonable. I I'm willing to compromise on some of this. I would have preferred going back to what came before this council previously and then kind of morphed and led to'",
        "'speaker_0': 'some problems with the Open Government Commission that we were going to add delivery only dispensaries. But you know, they that morphed into four that would also require delivery. But I do just want to be mindful of the impact on city staff and just, you know, the finance department and all the different entities that will touch this.'",
        "'speaker_0': 'The one area where I would really like to see the council make a modification, not for the the business that has been approved and in fact, has come to the planning board. And by the way, that's the one on Webster at hate in the planning board in there their conditions of approval did not allow them to have'",
        "'speaker_0': 'an actual onsite lounge so they won't be using on site. What troubles me about that is the disparity in the definition of a sensitive use.'",
        "'speaker_1': 'Use.'",
        "'speaker_0': 'Of sensitive use, and what constitutes a youth center. Because LAPD runs very much the same sorts of programs in its facilities, they don't have to have 100% youth students, but the majority and that is from everything you understand, the situation of the martial arts facility on Webster.'",
        "'speaker_0': 'I can't go back and unring that bell that that process is moving forward to the purchaser about the building. They've gone through the planning board process. However, I think that for the sake of consistency and just being respectful of our private operators as well as our, you know, public schools and in LAPD facilities, that we should include'",
        "'speaker_0': 'martial arts centers that that satisfy the definition. And we talked about this months ago that you could say that a certain percentage of the enrollment has to be shown to be at a certain age range. But I really feel that we should do this moving forward.'",
        "'speaker_0': 'And, you know, I, I understand the argument and I certainly, you know, have spoken to staff about this, that, you know, Maryland, it's just so hard to find a place to site a cannabis business if you if you do that.'",
        "'speaker_0': 'But that also speaks to the fact that we are a family friendly city and we have lots of facilities for youth. So I would ask that we make a modification to include private, private enterprises like like a martial arts school that have a certain whatever the requisite percentages.'",
        "'speaker_0': 'That they be considered just as sensitive users and have the 600 foot buffer. It would not apply to the the business on Webster Street because that's, you know, that's moving forward. But I would like to see that added to the ordinance.'",
        "'speaker_0': 'And then I think what I just want to make sure that people know is that we we also abide by state laws. So we're beyond that. Just allowing medicinal. It is going to be medicinal. It's going to be recreational adult use.'",
        "'speaker_0': 'And those are those are my thoughts. And that's how I and I very much appreciate the the suggestion that the vice mayor made of of how procedurally you would move forward with the applicants. So so do you want to see you have a motion for it?'",
        "'speaker_0': 'You want to just restate it? So we're.'",
        "'speaker_10': 'Clear. So my motion is that we repeal. Let me say this really officially repeal ordinance 3227, repeal ordinance 3228, reintroduce ordinance 30, 3227 and reintroduce Ordinance 3228 and give direction to staff to limit or to issue the RFP for three additional permits for a total of four with an expectation that that fourth permit would and I will'",
        "'speaker_10': 'compromise a little bit. How about if we could save, you know, five months, four and a half months within four and a half months of the the first one? I understand. I do want to acknowledge I understand that Councilmember Vela doesn't see value in that, but I do.'",
        "'speaker_10': 'And so I guess since you don't think it's meaningful, I'm hoping you'll support it. Four and a half months after the opening of the first one, or by January 1st of 2020, I hope that is clear.'",
        "'speaker_8': 'So if it's by January 1st of 2020, then that's different.'",
        "'speaker_10': 'I was there July, July 1st of 24, 2022.'",
        "'speaker_6': 'So occupancy permit, I think that that word should be added.'",
        "'speaker_10': 'So I did speak to. Do you want a second? And then we can have a conversation and we can just technically work and somebody.'",
        "'speaker_0': 'And I'd actually I'd actually like to ask if you will consider my friendly amendment.'",
        "'speaker_10': 'I, I'm willing to consider it, but I don't know that we have the votes. And so I'd prefer to move this forward and then have a conversation and see if there are three votes to move that forward.'",
        "'speaker_0': 'To move what for.'",
        "'speaker_1': 'It.'",
        "'speaker_10': 'To that that friendly amendment forward like to have that conversation. So here I'll work with well withdraw my money and we can discuss some stuff more.'",
        "'speaker_0': 'Okay. I'll just, you know, in the interests of transparency and for the public. If you are willing to support that, my friend, the amendment, then it you know, it's still going to need three votes for to move anything forward.'",
        "'speaker_10': 'For for me, I'm more than happy at another date to talk about youth centers. When I did my own thinking about that, it was on my list of things I would like to do as a part of my kind of trying to compromise and move this thing forward.'",
        "'speaker_10': 'I decided to not push for it in this round. As I said in January, I don't think just adding martial arts back in actually makes it a better ordinance. I just think it makes it complicated and convoluted in a different way.'",
        "'speaker_10': 'And if we were going to look at how we're going to define youth centers, I would like to look at it significantly differently than than just the martial arts issue.'",
        "'speaker_0': 'And I will just say that I believe there was a time when they were included in in fact, the martial arts centers were specifically removed. Is that not correct? Ms. POTTER.'",
        "'speaker_2': 'It is.'",
        "'speaker_4': 'The ordinance never characterized martial arts studios as a youth center.'",
        "'speaker_0': 'Well, but it talked about activities and classes and about.'",
        "'speaker_4': 'Right. Social and recreational.'",
        "'speaker_0': 'Right. And where the majority of the students were youth of a certain age range.'",
        "'speaker_4': 'Yeah, that's correct.'",
        "'speaker_0': 'Okay. And that same use in an LAPD facility would be deemed a sensitive use.'",
        "'speaker_4': 'A youth center? That's correct. And that was a carve out that the from the prior discussion about this. That was a carve out that the council had suggested and voted on. And when you had asked for kind of reciprocity, the support from the council wasn't there.'",
        "'speaker_4': 'So it wasn't changed at the time. There weren't three votes. You were looking for that reciprocal language and it wasn't approved. And that's why the RPG language is still in in the ordinance.'",
        "'speaker_0': 'Right. Well, I just think we're sending a message to the community. And I think that we should treat private enterprises that serve majority use the same way we treat those run by LAPD or girls. Think so. But APD is a better analogy because they would offer programing for both adults and children.'",
        "'speaker_0': 'Anyway, I've stated my position with that amendment. I could support.'",
        "'speaker_6': 'This.'",
        "'speaker_0': 'So Councilmember Odie.'",
        "'speaker_6': 'My concern about that, I mean, I wasn't prepared to discuss that because it wasn't agenda as and if we would do that, I think we could open up the whole well, I'm probably not Sabrina, but somebody else could open up the whole Sunshine Ordinance and kind of undo everything we're trying to do today.'",
        "'speaker_7': 'So I was going to chime in that if there's council support for the mayor's amendment, my recommendation would be that we would re notice. We would we would not introduce that ordinance tonight. We would bring that back as a a first reading.'",
        "'speaker_6': 'Well, there's no support here, with all due respect. So on the you know, if the vice mayor is willing to go with was it four and a half months? Yes. You know, maybe we can go four and a half months in April 1st.'",
        "'speaker_6': 'And that kind of is in the middle of everybody. And maybe that's a that's a compromise we could live with. I want to make sure my powder you're clear that it's the occupancy permit. It's not that.'",
        "'speaker_10': 'Let's not say occupancy permit, because that actually is a different point in the process. It's actually the opening their doors. So there's won't be there is no it's when they open their doors. Right. Mr. Potter, we're.'",
        "'speaker_4': 'Talking about a certificate of occupancy is not required for it's not there. There could be a cannabis business that can open and a CFO. A certificate of occupancy is not issued for that business because you're moving into a retail facility.'",
        "'speaker_4': 'So I think the better the better metric is for open for business.'",
        "'speaker_6': 'And you're clear on that versus the original idea that was talked about maybe a half hour ago.'",
        "'speaker_4': 'Yeah. Yes, I okay. I understand that we will be. Yes, okay. Okay.'",
        "'speaker_0': 'Okay. So you've got a motion in the second.'",
        "'speaker_10': 'I know.'",
        "'speaker_0': 'I think owe you is true.'",
        "'speaker_10': 'So let me just ask the question, because like I said, I am happy to I believe two weeks ago or four weeks ago when we directed for this to come back, actually, the idea of talking about looking at youth came up and that was actually the direction of the majority of the of the council that we were'",
        "'speaker_10': 'not going to tonight. Look at that item that that was specifically stated. And so I would be a little uncomfortable doing that. I also am not confident that there are three votes to move that forward. But I'm open to hearing from Councilmembers Vela or Odie that they would be open.'",
        "'speaker_10': 'And we can, you know.'",
        "'speaker_6': 'Like I said, know already.'",
        "'speaker_10': 'Okay. I'm just I'm just saying I.'",
        "'speaker_8': 'Know that hasn't.'",
        "'speaker_2': 'Changed. Okay.'",
        "'speaker_0': 'So my question to you, Mr. Vice Mayor, is, are you implying that you would be you would contemplate considering it at another time?'",
        "'speaker_10': 'I have let everybody in this process know that I've been able to talk to because of the Brown Act, know that I have that I wish that youth centers were the definition of youth center was significantly different than the way that we have done it here.'",
        "'speaker_10': 'I feel that it has been a little ad hoc with people throwing things like PD youth centers in and it got very convoluted very quickly. And instead of being based on outcomes and and the protections we're interested in, it's become a list of things.'",
        "'speaker_10': 'And what we ended up doing was changing that list and upsetting somebody on that list. So I would like to have if we were going to open it, I would be more than happy at some point. But I'm going to also point out that we're about to issue an RFP and I don't want to delay the RFP'",
        "'speaker_10': '. And so the first these first four people are going to go through with the current definition. And then we can talk about changing youth youth center definitions for future, for any future. I would be happy to have that conversation for after the RFP, any future people have to meet a different definition of youth center.'",
        "'speaker_10': 'But I feel, you know, I've been partially responsible for delaying this as long as it has been delayed. And the last one was on me, I you know, so I do feel that we kind of owe it to moving this thing forward at this point in time.'",
        "'speaker_0': 'And I understand your viewpoint. I would also point out that I think it's a bit dangerous to decide that we want to see where businesses want to locate, and then we'll go back and look at what might constitute a sensitive use.'",
        "'speaker_0': 'And we certainly have some definition now. But I, I mean, I think you raise a good point that perhaps a more comprehensive discussion needs to take place. I'm just wondering when that might be or how it might take place.'",
        "'speaker_10': 'I, I.'",
        "'speaker_0': 'Think the chair. Go ahead. Yeah.'",
        "'speaker_10': 'I mean, I worry a little bit that we're going to we're getting into just having circular conversations that never end. I would really I tonight I would like to regard this what we do about youth centers. I would like to move this forward as I proposed tonight.'",
        "'speaker_10': 'If we can get three votes. If we don't get three votes, then per my conversation with the city of. 32, 27 and 32, 28 have been null and void. From the Open Government Commission until such time the Council takes to take action to uphold or are push back on that which was the result of our conversation on'",
        "'speaker_10': 'Friday.'",
        "'speaker_0': 'Mr. Abbott?'",
        "'speaker_7': 'Well, I think that what I what I tried to communicate to the Vice Mayor was that it wasn't critical from my point of view that the Council actually take action to repeal those two ordinances. That, in other words, if the Council didn't want to feel because the the ordinance concerning the Open Government Commission is on the books'",
        "'speaker_7': 'and it does provide that remedy rather than trying to have the council sort of go against that. If the Council simply wanted to reintroduce the two ordinances without repealing the 32, 27 and 30, 28, I thought that was an acceptable way to go for the reasons I think that I have stated previously.'",
        "'speaker_7': 'I, you know, I don't feel that the commission had the legal authority to set it aside. But in the in the interest of trying to move this process along, I don't think it's necessary to for the council to have to repeal those ordinances.'",
        "'speaker_7': 'But just to go ahead and reintroduce them in order to put into place something that applicants can can then deal with. So I'll answer the question that way.'",
        "'speaker_0': 'Okay. Councilmember Vella, did you want to add something?'",
        "'speaker_8': 'Yeah, I just feel I feel like this whole conversation about when we're going to discuss youth centers and youth centers, frankly, is not agenda. And I feel that that's a Brown Act issue and subject to the Open Government Committee, and I'm getting really uncomfortable with the conversation along those lines.'",
        "'speaker_8': 'So I'm going to raise that now. And frankly, I would like us to drop that that topic at this point in terms of this status and whether or not it's null and void, I think, you know, we've gotten several different answers.'",
        "'speaker_8': 'Frankly, you know, I think the responsible thing is I just want to clean this up. If we want to repeal and replace, that's fine. I think it should be done in the same motion in terms of these deadlines.'",
        "'speaker_8': 'I think they're arbitrary. I think it over complicate something that's very simple. I'm not going to I don't think that four and a half months is meeting halfway. I think six months came out of nowhere. So I you know, we're starting at zero.'",
        "'speaker_8': 'You want to add something? Four and a half months to a year and halfway. But I also think that the I wouldn't mind the proposal being put forward by Councilmember Oti of an outside date of April one, 2020.'",
        "'speaker_8': 'So if your proposal is for four and a half months and April one, 2020, I'll support that. I think that was the friendly amendment being put forward. But I also just think that we need to put this to a close and I'm frankly a little insulted that we're talking about how we're going to change this relative to'",
        "'speaker_8': 'a definition, because the definition was also discussed relative to different buffer zones. And frankly, this isn't something where we said you can locate this anywhere. And part of why we were looking at those definitions and what the impact was was that you were narrowing it, narrowing it.'",
        "'speaker_8': 'And I've heard public speakers say, well, why is it only being located in the two business districts? Well, because we had people come out and advocate and say it should only be located in the two business districts. We don't want it located anywhere else.'",
        "'speaker_8': 'So again, the finish line keeps moving. We keep having these different conversations. I think it's inappropriate for us to say, let's pass this tonight, but then let's make plans in the future. That's not the message I really want to send to the business community.'",
        "'speaker_8': 'It's part of why earlier I was saying, why are we having this enterprise zone meeting when we're, you know, being asked to pass something else? Let's just be consistent. So that's what I'll vote for, is Councilmember Otis Friendly Amendment, and I'd like to put this to bed.'",
        "'speaker_0': 'Okay. All right. Do you have Madam Kirk, do you have the.'",
        "'speaker_10': 'I will accept your friendly amendment for April 1st.'",
        "'speaker_6': 'So are you going to make the motion April? Because it is a year from now. I mean, a year from today, basically. So. Okay. That should be more than enough time. You're going to make the motion.'",
        "'speaker_10': 'Will make the motion. If that so if everybody's okay.'",
        "'speaker_0': 'I'm going to make sure the clerk is clear that.'",
        "'speaker_10': 'We are going to repeal Ordinance 3227, repeal 3228, replace with 30 to 27 as written, replace with 32, 28 as written and give direction to staff to issue three permits for a total of four, with the fourth operator not being allowed to open until four and a half months after the first operator is opened or April 1st'",
        "'speaker_10': ', 2020, whichever comes first.'",
        "'speaker_3': 'That's the same motion just with April.'",
        "'speaker_0': 'And do we have a second.'",
        "'speaker_6': 'Answer, contact.'",
        "'speaker_0': 'And brief discussion. As far as Brannick violations, I don't think it's a BRANNICK violation to ask staff to to consider something that is very much in the purview of this ordinance and that we heard from speakers tonight. So I'm I'm cognizant of the brannick, too.'",
        "'speaker_0': 'Okay. We have a motion in the second hour in favor. I posed no to the motion case. 3 to 1. Somebody went to retrieve Councilmember Day.'",
        "'speaker_6': 'So just to be clear, though, we didn't give direction to come back with any further discussion on anything.'",
        "'speaker_0': 'No, but it wouldn't have been a breather.'",
        "'speaker_6': 'Okay, well. Well.'",
        "'speaker_10': 'Actually, I just want to point out, we re noticed this and it is noticed properly and it says we're going to be talking about these ordinances and we could have changed anything in these ordinances and it would have been perfectly noticed.'",
        "'speaker_10': 'Well, and that was that was what this whole issue was about. And I just want to say thank you. STAFF Yeah, I feel very good about the way this was, but if we'd wanted to go there, I also felt that we had already said we weren't going to talk about this.'",
        "'speaker_6': 'And I think because there's things I'd like to work out.'",
        "'speaker_4': 'Relative to the RFP, from staff, from staff perspective, based on the direction given tomorrow, I will issue the RFP after the second reading of these ordinances, which will happen on April 16th. So on or about the 22nd of April, we anticipate that the RFP will be issued and we won't be coming back to council because we've received'",
        "'speaker_4': 'our direction this evening.'",
        "'speaker_0': 'And for the record, I also discussed this with the interim city manager, a city attorney before this. So I didn't just raise this issue without any consideration of the legal implications. Okay. We are moving on to item six de Main Kirk.'",
        "'speaker_3': 'Recommendation to Approve Agreement Appointing Eric J. Levitt as City Manager Effective April 10th, 2019. And as part of this.'",
        "'speaker_0': 'Do you want to explain this right?'",
        "'speaker_3': 'In accordance with, I'm going to read a brief statement that's required in accordance with government code.'",
        "'speaker_0': 'Hold on one minute. Could everyone please take their conversations outside so we can continue the city business? Thank you. Okay.'",
        "'speaker_3': 'In accordance with government code section 5495333, a summary of the city manager salary and benefits is reported as follows The yearly salary for the city manager will be 259,000. The city manager will also receive a monthly transportation allowance of $500 in annual contributions, a deferred compensation of $12,000 and the first year of employment.'",
        "'speaker_3': 'And in lieu of the monthly contribution to deferred comp of 1000 per month, the city manager may elect to receive as reimbursement 3000 per month for no more than two months for his housing in Alameda. Regardless of the reimbursement, the maximum in your contribution will be $12,000.'",
        "'speaker_3': 'The city manager will also receive a relocation allowance of $16,000, consistent with other executive management employees of the city of Alameda. The city manager is eligible for health benefits, which include vision, dental and comprehensive vertical insurance. Other benefits include life dependent life and disability insurance as well as workers compensation.'",
        "'speaker_3': 'Paid time off includes 13.5 holidays, 64 hours of administrative leave, which can be cashed out if not used in an annual accrual of 200 hours of vacation. Further benefits include pet repairs, member retiree benefits and a tax deferred savings plan.'",
        "'speaker_3': 'These benefits are set forth in the contract attached to the staff report and Ms..'",
        "'speaker_0': 'Do you want to just explain briefly why we needed to do this? Because we already did vote on Mr. Levitt's contract, correct?'",
        "'speaker_3': 'We you actually this is back because he's going to come two days earlier. So that's part of the good thing. And then this and reading out of this statement is just a overly cautious way of making sure we're.'",
        "'speaker_1': 'We're following the government.'",
        "'speaker_0': 'Right. Because this isn't a special meeting. It's a regular meeting now. Okay. So any comments, questions or should we just entertain a motion to approve this contract?'",
        "'speaker_8': 'Madam Mayor.'",
        "'speaker_0': 'Councilmember Vella may.'",
        "'speaker_8': 'Move approval.'",
        "'speaker_0': 'Please. All in favor. I proposed abstain. Here. We pass it unanimously again.'",
        "'speaker_1': 'All right.'",
        "'speaker_0': 'Okay. Yeah. Okay. City Manager Communications is over it.'"
    ],
    "February 2019 Topic Brief on Climate Action and Embodied Emissions. [Informational Only]  (Councilmember Oddie)  [Continued from March 19, 2019 to April 2, 2019]": [
        "'speaker_8': '. And I would I would I would like to put out there that I think that that we made a marked difference in the overall outcome of that committee in support of making sure that that there's more equitable housing available and that the league takes a stance that supports, you know, reasonable policies coming through to allow for everybody'",
        "'speaker_8': 'to help us out address the housing crisis. So.'",
        "'speaker_0': 'Thank you, Councilman Brody.'",
        "'speaker_6': 'Thank you, Madam Mayor. Just referencing item ten scene that I put on the agenda is informational only that was our topic brief from February's Stop Waste meeting. I thought it was timely, given that our Climate Action Plan will soon be coming in front of us.'",
        "'speaker_6': 'And it talks about the support of stop waste for localities drafting climate action plans and also talking about the focus on embodied emissions, which basically is the emissions of an entire product from the time it's created to the time it's used in focusing on the whole life cycle.'",
        "'speaker_6': 'So I thought it's interesting topic brief. I wanted to make sure I shared it with people.'",
        "'speaker_0': 'Thank you, Vice Mayor.'",
        "'speaker_10': 'So. Let's see. I attended the alternate, the Alameda CTC meeting last week. There were a number of things that came up there that I wanted to share. We had a presentation on the Valley Link Project, which is the replacement for Bart Livermore.'"
    ],
    "Review and Discuss Charter Amendment Timeline and Issues Proposed by the Council Subcommittee.  [Continued from March 19, 2019 to April 2, 2019]": [
        "'speaker_10': 'As I as I said, there's one or two things on here that Tony was interested in. This includes things that I will say I have heard from the community or Tony and I have heard from the community. But again, most that most of this is mine or from other council members during the election, etc. This is a'",
        "'speaker_10': 'proposed potential list of things we could say yes or no to. So it isn't we are not necessarily proposing we run forward with all of this. But Tony and I really wanted to come back to this body and say, hey, before we spend any time working on this stuff, what do we want to work on it?'",
        "'speaker_10': 'So I thought it would be helpful because I think there's only one or maybe two things on here that are my own personal like things that I threw on here of going through and kind of talking about where where these things came from so that there's a little bit more understanding that it's not.'",
        "'speaker_10': 'John just going completely wild districts and ranked choice voting have come up districts came up at a community meeting that Tony and I attended in I believe it was December the Alameda Citizens Task Force meeting ranked choice voting is something that has come from a variety of Alameda progressives, the element, Green Party, etc. The different groups there'",
        "'speaker_10': 'have talked about that direct elect the mayor is something I've been talking about for about a year and a half or so, which is the idea that we changed at one point in time from what what some cities have, which is we elect city council and then the city council, like the school board, adopts or appoints a'",
        "'speaker_10': 'mayor. And oftentimes that mayor rotates once a once a year. So I think that there are some benefits to that, especially with the way we do boards and commissions, etc.. So if there was interest, we could look at that.'",
        "'speaker_10': 'Term limits, definitely. Something has come up both in the community and I've heard members of this body talk about that with everything that's been going on lately, whether it's Measure K or Measures B or yeah, the Sun Cow Initiative and whatever else, this idea of charter charter ballot initiatives and paid signature gatherers and looking at what we'",
        "'speaker_10': 'know. First question, is the charter the right place for any of this? But is there something we could do in the charter that might require not just spending a lot of money to tell people something they want to hear, even though they don't understand what they're being asked to sign necessarily.'",
        "'speaker_10': 'Campaign finance reform is definitely something that came up in it through the campaign for me, but has been coming up for at least ten years in conversations I've had. Removing housing restrictions, measure a and moving that language to the municipal code.'",
        "'speaker_10': 'That was both a staff recommendation and things. I've heard members of this body say that they were interested in discussing and looking at board and commission appointments. There was discussion at one point in time, actually at the city council about four years ago about possibly changing it.'",
        "'speaker_10': 'It didn't get three votes to move forward, but I figured I would throw that out there. And then the question is, are all the right boards and commissions in this? Tony is proposed finance commission and whatever else the Open Government Commission is, that's something that should be in the charter.'",
        "'speaker_10': 'Are these the right ones? I just wanted to, since we're having this conversation, say now would be a great time to consider this. And then lastly, and this is I'm going to say we have we heard slightly two different takes on what this could mean.'",
        "'speaker_10': 'And that's why it was written the way it was clarifying county council interference. And Tony, I think has some interest in this item, so I'll let you talk about that one. But we also the city received an independent report that suggested that we look at changing the charter language to clarify what interference is as well, looking at'",
        "'speaker_10': 'the removal of the auditor and treasurer. So we made changes in 2008. We've made some changes through the years of what the auditor and the Treasurer is. You know, I've definitely heard many multiple people suggest that and I have also been one of those people suggest that they don't need to be elected officials.'",
        "'speaker_10': 'They do very, very little work actually. They spend a lot of time. But the actual their actual jobs are just a few hours a year for the most part. It's not clear why. It's clear why they used to exist, because they used to actually have a whole workload.'",
        "'speaker_10': 'But we now have a professional staff that does most of the work and they basically just sign off on most of it. So the question is, why are we electing these two positions and what are they bringing? Council pay has definitely been something that's not just me, definitely something that that former council people have talked about for'",
        "'speaker_10': 'many years. If we want to have a broad breadth of people who run for and tried to be on the city council, we can't assume that everybody can afford to give up 20 hours a week for $100 every two weeks.'",
        "'speaker_10': 'No, sorry. A month. Sorry. I just almost doubled our hour. And this is in the charter. We have to talk about it. So I think that's one. And then right now the council rules are suggest that if one were to give birth and live in their home in Alameda, they couldn't call into a meeting.'",
        "'speaker_10': 'And that just beyond that just seems beyond discriminatory. And I think we should ignore that one and let somebody sue us if we have to. But I also think we should change it so that we acknowledge that we live in a modern world where not just men sit on city councils.'",
        "'speaker_10': 'So that's my list where they came from. No harm, no foul. I'll let Tony the one and.'",
        "'speaker_0': 'Then let's hear from Councilmember Desai.'",
        "'speaker_5': 'Oh, great. Well, thank you. I came into this with the opinion that we should, you know, cast the net widely in an effort to get as much input as to what people think they want to have the public further discuss.'",
        "'speaker_5': 'It didn't necessarily mean that agree with everything, but but I think we should at least have a conversation. And I also, in addition to what I would call cases in that widely in an effort to get, you know, as much ideas to to mull over, I, I also kind of imposed on myself what I think are reasons'",
        "'speaker_5': 'why certain issues might rise higher than other issues. And it was in an effort to, at least for myself, provide some kind of internal control as to, you know, what constitutes an issue worthy of consideration. For myself, recognizing again, that I said, you know, let's throw out everything that we can.'",
        "'speaker_5': 'So one of the things I was definitely interested in is there had to be a sense of political legitimacy to to the matter that there was that we are responding to or anticipating a problem that that we all commonly understand to be the case how we approach the problem from what angles.'",
        "'speaker_5': 'And you know what we come out of it, you know, it, it will be what it is. But we do understand that it is a problem. So one of the areas where I do believe that falls within my kind of the way that I filtered issues is certainly has to do with clarifying the council interference language.'",
        "'speaker_5': 'I think that's a discussion that we would have with that we should have largely because of the issues that had happened in 2018 and also because of we had the follow up report. Doesn't necessarily mean that I agree with the recommendations from the.'",
        "'speaker_5': 'From the report. But it is a conversation that we have to have, because my take away was that from the report and from what happened in 2018 was that nothing happened, even though there there there is pretty stark language in terms of council members interference in matters regarding employment that's stipulated in the in the charter.'",
        "'speaker_5': 'So we have to have that conversation on how to tighten that. Or not. I would I would ere on the side of tightening in the same vein when I talk about clarifying council interference. I'm certainly interested in a porous part of.'",
        "'speaker_5': 'A part of the charter that has to do with last time I call it to dash for it was actually to dash 11 and two. Dash 11 said that kind of separates the involvement of federal, state and county officials and why they can't participate in legislative bodies within the city council or or appointed by the city council'",
        "'speaker_5': '. I would expand that and again, I would expand that in light of what happened in 2000, 2018. Now, another area that I do think falls within what I call, you know, a common problem. But instead of looking back, it's looking forward.'",
        "'speaker_5': 'I think clearly many cities across California are being forced to go into districts. So rather than being forced through a lawsuit, perhaps we are the city might take this opportunity to to come up with a way to to, you know, place the districts and in the charter as to how we go about, you know, what are the'",
        "'speaker_5': 'elements as to what's a good district or what's not a good district. So something that we I think we should address proactively because I think it will be a common problem because so many cities are being forced illegally to to go into the districts.'",
        "'speaker_5': 'There are some issues where I believe that that to me, in my opinion, I don't see it. It doesn't easily go through the filter with which I observe matters. Honestly, I don't look at the removal of the auditor or the Treasurer as something that people suddenly, you know, I don't see that community suddenly clamoring for that.'",
        "'speaker_5': 'I think there is a role for an independent auditor, independent treasurer or to a voted by the people of Alameda to review the work of of City Hall. I think there are other items also that I don't think they might be issues or interesting issues, but they don't necessarily rise to the level of of significance.'",
        "'speaker_5': 'For me, that is so I don't want to go into every of the details. But my main thing is certainly very narrow based upon the way in which I filter the issues. And it has to do, for example, with clarifying the council pay.'",
        "'speaker_5': 'I mean, I cannot council interference language. A district voting and excluding certain items that I believe don't necessarily have. There isn't necessarily a common agreement that this is a problem. On a final note, one of the things that I would encourage is if we are truly interested in changing the charter, and I think we will need to'",
        "'speaker_5': 'be strategic in how we go about doing it. Frankly speaking, I wouldn't approach undoing Measure eight from the city charter that was put in by the people of Alameda. And if people want to remove Measure eight from the charter, then the people, I believe, have to generate the signatures and remove it.'",
        "'speaker_5': 'Because I don't think that's a common problem that that that, you know, suddenly a lot of people are clamoring for. But that's my take on it. So I think this was very helpful. And I do think that we do need to improve to modify our charter.'",
        "'speaker_5': 'But I think we need to be very selective and strategic in how we go about doing it. I mean. For example, if you move forward on something that everyone agrees with, but then you also move forward on something that, you know, there's deep community division over, then I think you risk both of them not going forward because'",
        "'speaker_5': 'you won't get the votes for it. So. Thank you. And it's been very helpful. I appreciate it. John's assistance through this. It was a very good process.'",
        "'speaker_0': 'Councilmember Vela So can I just ask a clarifying question, though? So this item is titled Review and Discuss Charter Amendment, Timeline and issues proposed by the Council Subcommittee. I have heard you both describe the issues. What's the timeline?'",
        "'speaker_10': 'I think we can talk about the timeline separately or we.'",
        "'speaker_2': 'Can talk about it.'",
        "'speaker_0': 'You want me to. So that's this the meeting plan? Is that okay?'",
        "'speaker_10': 'And I think that.'",
        "'speaker_0': 'Yeah, let's just because everything's on the agenda and then we'll take council communication through the session.'",
        "'speaker_10': 'There was a little confusion, so we were proposing. But there was. Councilmember de SAC made the very wise and compassionate identification that every two years some of us are running for election. And it would be unfair to put ballot changes on that could that people could feel we're going to impact their race.'",
        "'speaker_10': 'So I guess the question we would have is I thought that because there was a primary election, we would actually already have covered the cost of having something on the ballot. So there's only about like $20,000 costs, but it turns out we have nothing on the primary ballot at this point in time.'",
        "'speaker_10': 'So we would have to actually.'",
        "'speaker_0': 'Make two or.'",
        "'speaker_10': '$300,000 to put it on. So that would be a cost question. But we so this is a very tight timeline. If we were going to try to get something to March 2020 and basically ignoring the actual dates, the idea was like this meeting, come to the council, talk to people, what do we want to work on?'",
        "'speaker_10': 'Go out and have a community meeting, come back to the council and talk about what we got from that community meeting and how to move that forward. And so it'd just be kind of bouncing back and forth with the council basically checking in long before anything is written or direction is given.'",
        "'speaker_0': 'And have you had any communications with the League of Women Voters because had heard from.'",
        "'speaker_10': 'Yes, they are very interested in working on some of these issues. If we were to decide to move.'",
        "'speaker_0': 'Forward, that's what I'd heard. Okay. All right. Did you want to add anything to that timeline process so you could pace?'",
        "'speaker_3': 'And just to piggyback just on what Vice Mayor Mike was saying is there's also prohibitions that are not allowed as part of the March 2020 and council pay happens to be one of those that would have to go to November and the auditor and treasurer issue.'",
        "'speaker_4': 'So those.'",
        "'speaker_3': 'Offices that would be those offices that would be.'",
        "'speaker_1': 'Up would be going in March.'",
        "'speaker_0': 'And that makes sense.'",
        "'speaker_3': 'So yeah, they'd have to go November.'",
        "'speaker_0': 'Okay. Well, so you but you're working with the city clerk to to I take it to. Yes, yes, yes.'",
        "'speaker_10': 'And the city attorney.'",
        "'speaker_0': 'Okay, perfect. So Councilmember Vela.'",
        "'speaker_8': 'So. I guess I'll respond to kind of substantively and then the the timeline. So section two, Dash nine is the one that says that if if a council member is absent from the city for 30 days or more consecutively without the permission of city council, your office is considered vacant.'",
        "'speaker_0': 'We can give you permission.'",
        "'speaker_8': 'So I think this this comes up in two different ways. One is I've known several people who were actually do right around my due date who were put into the hospital on bed rest. We are alameda hospital does not have the capacity.'",
        "'speaker_8': 'We don't have and have.'",
        "'speaker_0': 'Labor and.'",
        "'speaker_1': 'Delivery.'",
        "'speaker_8': 'We don't have labor and delivery anymore. And so if you are a member of council who happens to be pregnant and you do have an issue relative to your pregnancy, you will be removed from the city of Alameda and that will not be a choice of yours.'",
        "'speaker_8': 'And it would you know, I think that the process of getting council approval, to be honest with you, is a little bit demeaning in that instance. And so I think that that that language doesn't really contemplate that. It also doesn't subject the the the auditor or treasurer to the exact same standards that we as a councilor are'",
        "'speaker_8': 'held to. I think that's a little bit concerning. Additionally, if I were to say take maternity leave and not be in the city of Alameda for for 30 consecutive days, I would have to come here and get permission as well, which is currently what I'm going to have to do this summer.'",
        "'speaker_8': 'So I, I especially where we have an audit in August, break from council where we there's a period of time it's actually closer to six weeks from our second meeting in July until we reconvene in September. I think that that language is a little bit outdated.'",
        "'speaker_8': 'Again, Section two, Dash 14, why does this not apply to the auditor and treasurer? Again, it concerns me that we're holding the city council as elected officials to one standard and not the auditor and treasurer to the same standard.'",
        "'speaker_8': 'And again, that has to do with if you missed so many meetings or if you are vacant from the city again for 30 days, it's it doesn't apply to them. There was the mention of of Section seven, Dash three, which was mentioned in the Jenkins report.'",
        "'speaker_8': 'I certainly think that that's something that we we should be having a community conversation on articles four and five, which deal with the auditor and treasurer. I think whether or not those positions continue to exist is, is certainly one conversation.'",
        "'speaker_8': 'Also, the benefits that they receive and again, the, the standards that apply to them that that or that apply to the Council rather and don't apply to them are concerning because technically under the Jenkins language, they can have a conversation with the city manager that would be considered interference so they could bribe, let's say, the city manager'",
        "'speaker_8': ', or they could do something like that relative to that. But the council is held to a different standard. I think that that's just maybe it was overlooked, but I think that it's bizarre. Section eight, dash one. We recently went through a recruitment for the city attorney.'",
        "'speaker_8': 'One of the things that I found when I was looking through the charter was that our city attorney, in order for them to get the appointment, must have must have admittance to the California Bar for at least five years preceding their appointment.'",
        "'speaker_8': 'And that was something that didn't really come up while we were having that conversation. But it's concerning to me because it means that essentially the person must be bar licensed with an active bar license in California for five years preceding what if we had wanted somebody that had been practicing outside of California but had previously been practicing'",
        "'speaker_8': 'in California, but hadn't practiced here for five consecutive years? It kind of limits the search. I just would want to have a conversation about that. I thought that was kind of interesting and I caught that when we were doing that recruitment.'",
        "'speaker_8': 'More out of just going through and seeing. Is there something that we're missing? As for the timeline, I don't have a pricing. There has been kind of public conversation. It's been a while since we've done a real charter review, and I think there are a lot of issues that people have been asking questions about.'",
        "'speaker_8': 'I don't mind having those conversations. I would just ask that we kind of bifurcate things. So there are the kind of substantive things that we've we've been tasked with that deal with specific issues in the charter. And then there seem to be kind of good governance questions about district elections, ranked choice voting, those sorts of questions, campaign'",
        "'speaker_8': 'finance that seem to be a separate track. It's not that they're not part of the charter conversation, but I think that it's a more robust conversation that's needed where we need to kind of think about the big picture and what we want Alameda elections to look like and what we want the elected body to look like.'",
        "'speaker_8': 'So I would just ask, because it seems like a lot to tackle in one meeting that we may be bifurcate those two things. And I think the interest is going to be different. The different community groups that are going to want to be involved or have a say might be different.'",
        "'speaker_8': 'And so perhaps if we bifurcate that with some guidance from the city clerk's office about different campaign requirements, about having it on certain elections, that sort of thing, and what the deadlines are, when when would the charter language have to be put in or when would the proposals have to be submitted?'",
        "'speaker_8': 'What's the process for notification and transparency on all of those things? And so that we can actually work from that timeline and people can understand is part of the conversation, you know, what that looks like and then what the whole package looks like.'",
        "'speaker_8': 'Because I think when we talk about district elections or ranked choice voting or the role of different positions, that's really a conversation where I want to have a conversation about what what's the overall package and rather than kind of picking them off one by one.'",
        "'speaker_8': 'So that's, that's my feedback. And I, I think the subcommittee for their work, I think our charter is a lot there's a lot to it. And, and it is an organic document. It's not a dead document. It's something that has been amended multiple times over the years.'",
        "'speaker_8': 'We continue to look at it. It's a living document. And I think part of this is it's pretty apt that we're having this conversation and I think timely. So thank you.'",
        "'speaker_0': 'Councilman Brody.'",
        "'speaker_6': 'Sure. I don't have too much more to add. That hasn't been said. I mean, I appreciate that the committee is looking at everything in addition to some of the stuff that I thought we were mandated to do. I do agree with customary values comments.'",
        "'speaker_6': 'Some of these can be compared compartmentalized into like buckets. And, you know, those buckets should kind of be looked at together. But, you know, I'm interested to hear the conversation on all of the ideas that are coming forward.'",
        "'speaker_0': 'And I'll just wrap up and say thank you very much for your your work on this. And I really do want to encourage you to live up to the League of Women Voters in because we don't need to reinvent the wheel.'",
        "'speaker_0': 'And they've done a lot of work and their organization, not just, you know, the Almeida League, which is phenomenal, but statewide, Des has done the deep dove into some of these. So, you know, again, no need to reinvent the wheel.'",
        "'speaker_0': 'I and I would like to know, can we do something about paid signature gatherers? Because I always get a little nervous when you're treading near First Amendment and other. So do you want.'",
        "'speaker_3': 'To I mean, I think we'd have to look into the specifics of what is requested. But the way that the since we are a charter city, we if we have things in the in our charter that trump the elections code, we follow our charter.'",
        "'speaker_10': 'Okay. I don't believe.'",
        "'speaker_0': 'That we council member I mean, first, Mayor Knox.'",
        "'speaker_10': 'I don't believe we can say that. For me, what I would say is the first question is, is this something that should be in the charter or is that just something we should do by ordinance? I think there are restrictions that we can do, but it we can't stop it.'",
        "'speaker_0': 'Yeah. So that might even be a step. Okay. That and some cities have gotten into trouble, I believe, too. Yeah. But I think maybe the threshold question is what belongs in a charter revision and what belongs in, you know, the separate, the buckets or whatever we're calling them these days.'",
        "'speaker_0': 'I think this is good timing on a number of fronts. We are getting a new city manager and a new city attorney, and we're still a relatively new city council. So it's kind of a good time to to tackle all this.'",
        "'speaker_0': 'And I think we can always learn from other communities and, you know, maybe other experiences they've had, by the way, and the five years of bar membership by membership in California. I could probably argue that one both ways, because I don't really want your experience with Nebraska law, but, you know, it's I think it's something to be'",
        "'speaker_0': 'something to be looked at. I, I think Councilmember De Sugg raised an interesting point about measure a the density limiting measure A that it was placed on it got into the charter through a citizens petition signature gathering initiative.'",
        "'speaker_0': 'And that's the way if it's to be amended or removed, it should happen again. But I just might anticipate that there might be organizations who have gotten pretty good at going out and pounding pavement who might be willing to do that.'",
        "'speaker_0': 'So maybe those are some other side conversations. I think it's a fair point, though, that you raise, because we never want to look like we're usurping the the the actions of the people by a vote of a five person body.'",
        "'speaker_0': 'So good point. I mean, you're raising good points. The I think that it is worth looking at the removal of the auditor and treasurer, probably not the most significant issue we face. But as we go through our budget and there's never enough money to do what we want to do these I'm not sure the return on the'",
        "'speaker_0': 'investment is there because I'm not entirely sure what they do that isn't redundant. Does something that an outside professional already does for us. But I, you know, I will contemplate that. But the very at the very.'",
        "'speaker_8': 'End, they don't have term limits.'",
        "'speaker_0': 'Councilmember vote. Yes, I was about to say that. I was going to say that at the very least, if if council in it has term limits, shouldn't they as well? But I don't know enough about the history of how those positions even came to be.'",
        "'speaker_0': 'I had no idea about them being away and remote meeting rules and to accommodate New Parenthood, clearly we need to update the charter there. The only problem is can't do it in time for this baby. But. Well.'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'There you go. I granted it. And then I would just say, I think you probably need to revisit your scheduling because, you know, doing anything by April is just about here. So but yeah, please come back to us with more refinement.'",
        "'speaker_0': 'But and I do think the point that that was councilmember so well all three of you have read you have made about our accountability to the public. We do need to do something about the issue that was raised in Mr. Jenkins report and at least make sure that the language is unambiguous and in.'",
        "'speaker_0': 'Some thought and discussion got to do it, but that's part of a public process. So with that, think.'",
        "'speaker_6': 'More of us agreeing with that.'",
        "'speaker_0': 'Okay. Thank you all for for your hard work on this. And we look forward to your next report.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_10': 'Sorry, I just I heard a few things. Are you here to public comment on this?'",
        "'speaker_0': 'Do we have a speaker slip?'",
        "'speaker_2': 'I'm actually I didn't know how to get in line until tonight.'",
        "'speaker_0': 'All right. Well, tell you what.'",
        "'speaker_2': 'And I just want to do one or two sentences.'",
        "'speaker_0': 'Oh, okay. Well, why don't you see the assistant clerk here, and she will help you with the process?'",
        "'speaker_10': 'Is that about this, what we're talking about right now?'",
        "'speaker_2': 'Okay, no comment. Great.'",
        "'speaker_0': 'All right. Mrs. Ms.. Is going to get you a speaker slip that you just fill out, so I just bring it to you. Oh, ouch. Okay, so face to face, Mayor, there's.'",
        "'speaker_3': 'There's no opportunity left tonight.'",
        "'speaker_0': 'For no apology. You know, I think we might reopen oral communications because this gentleman has been sitting here and it seems a bit cruel, unusual. And so. Yeah, but he's got it.'",
        "'speaker_3': 'I just want him to understand something. Okay.'",
        "'speaker_10': 'If I can just summarize some, because there are a couple of places that I'm not clear on. So it sounds like working with the League of Women Voters, elections districts, ranked choice, voting, direct conversation. See what comes up.'",
        "'speaker_10': 'Come back with.'",
        "'speaker_2': 'Okay.'",
        "'speaker_10': 'Something, even if it's nobody's interested. Right, but. But not you. I guess what I'm saying is nobody's saying don't talk about that.'",
        "'speaker_0': 'So I would just say, no, I wouldn't tell you not to talk about anything. I will say on the issue of district elections, it's certainly come up at the League of California Cities because that's happened to some cities.'",
        "'speaker_0': 'Usually it's been in areas where they were a larger cities. There were more distinct neighborhoods like a particular ethnic group, lived in one area and definitely didn't have representation in the councilors. I mean, I, I mean, we certainly can look at it, but doing it to preempt the legal challenge might not be my idea of the best'",
        "'speaker_0': 'reason to bring it forward. But I think anything's on the table. It's just where in the table you put it. Um.'",
        "'speaker_10': 'So I guess what I know nobody wants to limit things that people can talk about, but at the end of the hand, it's a big there's a big lift.'",
        "'speaker_0': 'I did tell you to triage it, remember?'",
        "'speaker_10': 'Well, yeah, but I guess I'm looking for help. On if there are things where people are like, Yeah, let's not go there right now. We can do that. We can put that in our second bucket.'",
        "'speaker_5': 'Yeah, I really like the way Councilmember decide. I like the way Councilmember Vela and Councilmember Odie framed it by calling it either bifurcating and or bucket lists. And because that's a framework and how to deal with issues without picking and choosing which issues.'",
        "'speaker_5': 'So I think as we go to the League of Women Voters or whomever, that we can at least say that that's one of the directions coming out of here. Help us choose what goes into what bucket.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'So serious bucket in minor league bucket.'",
        "'speaker_10': 'Okay. The major issue, because I've actually heard some people say one thing one time and another thing tonight. Are we going to move forward with that? Are we saying that some groups should deal with that and.'",
        "'speaker_0': 'I would put that at the top of a discussion to be determined, because I think I mean, how can we talk about all the issues we grapple with homelessness, affordable housing availability, the cost of housing? Without looking at this one instrument that has kept us from building anything more dense than a duplex since 1973.'",
        "'speaker_0': 'It's not to say we haven't done multifamily with, you know, multifamily overlay, zoning districts and density bonus and all that. But, you know, maybe it's time to come in the front door. But who brings that forward? I think that's a fair question.'",
        "'speaker_0': 'But I I would put that I mean, I just think that housing is so important to us that that should be up near the top. My idea.'",
        "'speaker_10': 'Of things for us to discuss, we might come back and say we think somebody else should move.'",
        "'speaker_0': 'Forward. That's my that's my thought, I hear.'",
        "'speaker_10': 'Okay. Okay.'",
        "'speaker_6': 'Sorry. We couldn't overrule that. Yeah, we. If we decided to tackle it, it would be putting it on the ballot, letting the voters decide.'",
        "'speaker_0': 'Correct. Matter of how it gets to just make.'",
        "'speaker_6': 'Sure people don't understand. Don't misconstrue that. You know, we're plotting to do all this stuff.'",
        "'speaker_10': 'About boards and commission appointments. I didn't hear one person mention that. I'm going to just strike that on the list of. I didn't hear anybody say that. It could be interesting.'",
        "'speaker_2': 'Okay.'",
        "'speaker_6': 'I'm going to strike anything from, you know, just to be clear.'",
        "'speaker_2': 'But I'm asking for you to.'",
        "'speaker_10': 'I'm asking for some for some clarity there. Council pay. I saw a lot of nodding heads. I didn't necessarily. But I think I think that stays there.'",
        "'speaker_0': 'I think it stays.'",
        "'speaker_10': 'Everything else seemed to well, I think move paid signature gatherers to somewhere else, not the charter. And I didn't hear anybody talk about charter initiatives and, you know, to to your point and to just disagree.'",
        "'speaker_1': 'Councilmember Thank you.'",
        "'speaker_10': 'Shaking his head, I'm like, Yeah, I think I can get away. Let's get rid of that one as well. Because, you know, it is the it is the document of the people. So try and just suggest that the people should say and the people can't change that.'",
        "'speaker_10': 'The charters.'",
        "'speaker_2': 'A little. I don't think we can. Okay. Okay.'",
        "'speaker_10': 'Okay. I think. I think, therefore, we got that where we.'",
        "'speaker_2': 'Go.'",
        "'speaker_10': 'In terms of the timeline, I guess ignoring the dates, is everybody okay with the general flow whereby we're coming back and checking in and not writing anything? With that, you guys seemed bullet pointed in either direction.'",
        "'speaker_0': 'And can can we direct you, though, to check in with the League of Women Voters and maybe set up some time between now and next time you report?'",
        "'speaker_10': 'I already have. I mean, I've already met with them specifically on this.'",
        "'speaker_0': 'Okay.'",
        "'speaker_10': 'Councilmember Disorganized. In our first meeting, we were like the League of Women Voters. They already had that meeting.'",
        "'speaker_0': 'But maybe a framework of what you're going to do with them. Okay. Councilmember has got her hand up and then we'll go to Councilmember Ody. And I would just talk all you want, but it's almost 11:00.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_8': 'So regarding the the timeline and the process, one thing that I would I would like is if we could schedule or if there is a joint meeting with the League of Women Voters, perhaps that we agenda set as a work session, a public work session so that the entire council can attend.'",
        "'speaker_8': 'I think that that would be helpful. In terms of the paid signature gather issue, perhaps we can have a staff presentation at a later meeting about what other cities have done relative to regulating that. It's similar to kind of time, place and manner restrictions because it's a First Amendment right.'",
        "'speaker_8': 'You essentially can't you can't say no, you can't spend money in elections, but you can regulate how it's sunshine to the public and what the requirements might be. Then the names of the the names of the organizations, what's required, and then in the name of the of the pack or whatever that's behind it, whether or not we'",
        "'speaker_8': 'have additional disclosures that are required that have to be included in like a petition that they circulate at the bottom of it said that says, you know, paid for by with their top donors or something like that. So I know that there's things like that.'",
        "'speaker_8': 'And if we could maybe get a staff report back on that, I'm not saying anytime soon I would want to give staff time to put that together. That might be helpful. And then we could report back to the League of Women Voters or to the public who've raised these concerns to say we're at least looking at it'",
        "'speaker_6': '. Councilmember Odie thinks that was pretty much what I was going to say. If we do have a meeting with the League of Women Voters, it would be good to be noticed in a way that all of us could participate, not just attend.'",
        "'speaker_0': 'You okay? Yeah, yeah, yeah. Now, that's what the vice mayor. Are you okay? Physically okay?'",
        "'speaker_2': 'Yeah.'",
        "'speaker_4': 'Sorry.'",
        "'speaker_0': 'We can. We can be. Yeah. Okay.'",
        "'speaker_6': 'And then so, you know, because like the subcommittee, we, we wouldn't come to them. We couldn't speak at a meeting of the subcommittee, apparently. And then to your other point, would it be I think that's a good thing for our new city attorney to kind of bring back, you know, what we're allowed to do, what we're not'",
        "'speaker_6': 'allowed to do. And, you know, if we can regulate how someone is paid, whether it's piecemeal or or hourly, you know, what our options are.'",
        "'speaker_8': 'In our city.'",
        "'speaker_6': 'Clerk Okay.'",
        "'speaker_0': 'Okay. Is that enough on this graph there on this? Okay. So we've got we have ten C, are we doing that today or should we hear a public speaker.'",
        "'speaker_6': 'Just kind of oh.'",
        "'speaker_0': 'You sort of said that. Okay. So then we do have a public speaker. You can come on up if and one minute is exactly what I'm offering you. Okay? Yes, I'm okay.'"
    ]
}