{
    "Recommendation to Accept the Document Outlining the Approach to Attracting Development to the Enterprise District at Alameda Point and a Six-Month Status Update. (Base Reuse 819099)": [
        "'speaker_2': 'Recommendation to accept the document outlining the approach to attracting development to the Enterprise District at Alameda Point in a six month status update.'",
        "'speaker_0': 'And I think at least three council members were interested in pulling this item.'",
        "'speaker_1': 'You know. All right.'",
        "'speaker_8': 'Good evening, Madam Mayor and city council members. I'm Michelle Giles, redevelopment project manager for the Base Reuse Department. This report presents the six month update to the Enterprise District approach to development. But she approved last year and it's as of June of last of this year because we kept getting moved.'",
        "'speaker_8': 'So tonight we are recommending that you accept the six month update and continue the strategy without any changes to the current plan. Last year you approved the approach to development, which included using the existing leasing agreement with Cushman Wakefield to market the site linking our marketing strategy and the phasing of it to the progress of site development'",
        "'speaker_8': '. US staff to return every six months to give a status update and to evaluate progress to make any necessary changes. You also asked us to memorialize the strategy by putting it into a document that would formalize the approach, and that's included in your report as exhibit three.'",
        "'speaker_8': 'The Enterprise District was created with the 2014 zoning amendment.'",
        "'speaker_0': 'Sorry about that.'",
        "'speaker_8': 'With the singular focus on creating jobs by attracting catalytic commercial use. This to replace the 18,000 jobs that were lost when the base was closed. The new approach is a change from focusing on just a limited number of developers who might want to hold the land for years and instead cast the wider net to a larger audience'",
        "'speaker_8': 'of potential users whose interests might be piqued by the progress of the site. The approach is cost efficient because we are using our existing listing. Agent Cushman Wakefield, who has experience with building and infrastructure issues at Alameda Point and is also experienced with large scale developments.'",
        "'speaker_8': 'The new approach also leverages our robust, robust leasing program in the adaptive reuse district, where we are entering into longer term leases and lease purchase options and are attracting high quality tenants. And there's a few of those that are there on the base right now.'",
        "'speaker_8': 'The map right now shows the clusters of industries that are currently at Alameda Point. And those we also want to attract to the enterprise district. So the approach that was approved, we in the first phase of that approach was, which is the awareness phase.'",
        "'speaker_8': 'It is the time period before infrastructure construction begins and prior to the close of the phase one off site. We're during this program. There isn't a lot happening that anyone can really identify. And from an outsider's view, there's still uncertainty about unknowns, about infrastructure.'",
        "'speaker_8': 'This phase lasts about six or 9 to 14 months. The second phase, the connection phase, is the time period after phase one infrastructure begins and things are usually changing on the site. At this point, it's certain that the infrastructure will be available and can be connected to and there will be more buzz in marketing during this time'",
        "'speaker_8': '. The final phase, which is the delivery phase. It begins when the construction of Phase one infrastructure is complete or near complete. There is more certainty about the timing of the delivery of the land, and marketing efforts are even more intensified.'",
        "'speaker_8': 'The city's role in this approach is basically to communicate with Cushman Wakefield on a monthly basis and offer and more often when there is activity, we are involved in key meetings and give direction regarding any negotiations. And you, the City Council has the ability to make any changes on the approach.'",
        "'speaker_8': 'Cushman Wakefield is responsible for executing the strategy. And they are the point of contact and participate or advise the city on direction. Cushman Wakefield is responsible for deliverables and the metrics you see on this slide. They were to produce a new marketing piece, produce an article and original press.'",
        "'speaker_8': 'They were to have to at least two specific broker blasts per month, presentations to regional brokerage houses, weekly target mailers to regional tenants, and to keep updated websites, real estate websites, and to track inquiries. And their accomplishments in this last well, the period between January and June were they did produce a marketing brochure which is included in'",
        "'speaker_8': 'exhibit five in your pocket. They did a broker glass to a tenant list of 1600. It made seven presentations to seven different brokerage houses and 257 mailers to regional tenants in 175 follow up calls. If updated the website on a consistent basis and responded to about 100 inquiries.'",
        "'speaker_8': 'Some of the comments that they've had are listed here. People are attracted to the availability of the land and possibilities for expansion. They're interested in the timing of the ferry terminal seen as a major plus. And they do have concerns about infrastructure and the associated risks with the timing and then concerns about access.'",
        "'speaker_8': 'And, of course, they're excited about what's going on with the site. So we did also take this report to the mayor's economic development panel July 21st. And they were encouraged about hearing the process and the progress that was going on, but they had no specific comments to add.'",
        "'speaker_8': 'So we are asking or let's see. So the next steps, we're going to go ahead and continue the awareness phase. That's the recommendation, which includes more articles, broker blasts, presentations and mailers. And we intend to report back to you in six months, which at this point would be in December.'",
        "'speaker_8': 'I'd be happy to answer any questions. We do have Ted Andersen with Cushman Wakefield here to answer any questions you might have.'",
        "'speaker_0': 'Right. Council member Ashcroft. Sure. Thank you for that report. And the staff I had and that was a really good staff report and all the exhibits. And I want to just raise a couple of thoughts that occurred to me.'",
        "'speaker_0': 'When I was going through the. So there's the different phases. And I do I do agree with this new approach to getting the enterprise zone. It's good not to call it site B because it did kind of take that it, you know, took a second place or a back seat to to other, you know, just site or'",
        "'speaker_0': 'something superior. But I I'm and now I'm looking at exhibit two, which is the Enterprise District Report. And if my colleagues want to look along, I'm in this. Page six, which is kind of a nifty chart of the three different phases with clever graphics to go with them.'",
        "'speaker_0': 'And so what I want to just recommend is there is in the so the three phases for anybody who's not following along are the awareness phase that we're in now, the connection phase after the site, a infrastructure work begins and then the delivery phase once that is completed in the delivery phase, it's suggested maybe a tenant barbecue'",
        "'speaker_0': 'to get all the different tenants at Alameda Point together. I would actually strongly encourage staff to consider connecting our tenants that. Now, I've been out to Alameda Point a few times in the last couple of months. We have some fascinating tenants out there made the front page of the New York Times last month, one of them sail'",
        "'speaker_0': 'drone. And yet it is not surprising these folks are doing some amazing things, but they're so busy doing their work that they don't look up from their, you know, their workplace to see who else is out there. And I will say, oh, did you know about such and such?'",
        "'speaker_0': 'They're doing that. No, we're really we're. And so the reason it's not just because it's nice for people who live work out there to get to know each other. But there's also some pretty exciting potential connections you might make.'",
        "'speaker_0': 'And also it can help us market the site because everybody knows somebody. And it's fascinating to see where these people came from, how they found Alameda point. And it's often one of those word of mouth. I knew someone I was in graduate school with someone you know, this one I, you know, had worked with in the Silicon'",
        "'speaker_0': 'Valley and we couldn't afford the real estate. So I would just say, for our sake, don't put off connecting our tenants. I it really occurred to me that they would appreciate something like, you know, the fourth Thursday, the month wine and cheese and fitness news.'",
        "'speaker_0': 'We have plenty of choices for wine added Alameda point. But anyway because I think you could create some valuable affiliations and and the other thing of course we always want to make sure that we're treating our existing tenants well, responding promptly to their phone calls and concerns and inquiries because good service is another good selling point.'",
        "'speaker_0': 'And then exhibit four of this. This report is the draft meeting minutes for the July 20th Economic Development Advisory Panel. And I just wanted to add, it's a really nice group of of business representatives from our different business sectors around the island.'",
        "'speaker_0': 'And I just wanted to highlight really quickly some of the comments because it's nice for someone who's an elected official, we're all so used to working in our local government, but to see how others perceive as, you know, from the outside looking in.'",
        "'speaker_0': 'And so one of the comments that stood out, people were talking about, you know, what would draw people to this area, to this region. And one of the members said, well, you know, Alameda is a very bikeable community.'",
        "'speaker_0': 'It just put in a beautiful bike path down by the beach. That's the shoreline cycle track. Another representative from Power Engineering who I think was elected, the chair, said, we may be going back to a time where people lived near where they worked.'",
        "'speaker_0': 'We need to address the balance of employment in residential. And then another representative from Jamestown Properties, who owns the South Shore Center, echoed the need to address the jobs housing balance. We talk about that a lot, but these business leaders see how important it is.'",
        "'speaker_0': 'And this I thought was a novel idea and might have some possibility of becoming a reality. The idea of putting a small artist's community at Alameda Points such as turning the bachelor's enlisted quarters. I'm not speaking for any property because, you know, some some of these are already owned, but into live work artist space, that would create'",
        "'speaker_0': 'a unique experience. And then just a good point that Jennifer Otter, chief operating officer at it Alameda point raised is that Alameda Point's infrastructure costs are approximately $600 million or the selling price of $1 million per acre because that includes anyone who's buying land out there is going to help us rebuild the infrastructure.'",
        "'speaker_0': 'We're not giving it away. And Ms.. I emphasize that we do not want low intensity development. We want jobs or catalyst benefit, which I thought was a really good point. Which brings me to my last point, which is that I think it was in the introduction to one of these reports, there was a paragraph about attracting jobs'",
        "'speaker_0': 'to Alameda Point, resulting in the incremental replacement of the thousands of jobs and economic base that was lost when the Navy decommissioned. The former Naval Air Station is one of the top priorities of the entire community planning documents that have been previously prepared for this property.'",
        "'speaker_0': 'And my only caution when we're looking at leases, whether for the enterprise zone or even in the areas that we're releasing now, is that I want to make sure that we are actually leasing to businesses who are going to use that property now and not just land back to plan for future expansion.'",
        "'speaker_0': 'I know it's exciting when we get a big name maybe from the Silicon Valley and we can say, oh, we've got X, Y, Z Company out here, but it's not exciting if they're just holding on to a space that is vacant because maybe they'll grow or maybe they want to keep their competition from growing in our area'",
        "'speaker_0': '. That isn't what our enterprise zone should be set up to do. So it's also incumbent, not just upon staff, but on the city council when we approve these raises to make sure that we're not letting entities just scoop up leases to hold space they don't intend to occupy or not for a long time and keep others from'",
        "'speaker_0': 'expanding. But anyway, thank you for bringing this to us. It's very exciting potential for our next phase of Alameda point, which I think we'll actually start developing alongside site a soon. So thank you very much.'",
        "'speaker_6': 'Member Thank you, Madam Marin. I was one of the three that I think pulled this item and I thought it was important that this not be buried in, in the consent calendar, that the public have an opportunity to hear what's going on.'",
        "'speaker_6': 'And I said a couple of quick questions. So the connection phase. I mean, there's a timeline on there. But given that we're a little behind in reporting back, I need to be back in December. I mean, when do we anticipate I mean, do we have a hard data where we're going to start moving to phase two of'",
        "'speaker_6': 'this marketing process?'",
        "'speaker_8': 'We don't have a hard date. It's generally sort of after the fact that once the infrastructure begins for site, that's kind of the trigger. And then whenever that happens, that's when the marketing efforts will intensify.'",
        "'speaker_6': 'I mean, do we know when the groundbreaking and we're going to start seeing shovels in the ground over there now?'",
        "'speaker_8': 'It's scheduled for October 28th, I believe.'",
        "'speaker_6': 'No, that was for. That was for 20 on March. 24th of October. Right. Okay. So I hope that we can keep moving forward and these inquiries that I know you can't share specific names, but, you know, are are these like genuine leads or are they, you know, just casual inquiries?'",
        "'speaker_6': 'And are people looking at, you know, the whole space, the volume as a campus or, you know, piecemeal? I'm just curious what what the interest is out there.'",
        "'speaker_8': 'And I have Ted Anderson with Cushman Wakefield.'",
        "'speaker_1': 'Address that question.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Good evening, Madam Mayor. Members of council. It runs the gamut. I mean, I'm pretty enthusiastic about the response that we've had so far. I mean, we've had a lot of Eureka conversations that lead to pointed questions. And those pointed.'",
        "'speaker_6': 'Questions usually revolve.'",
        "'speaker_5': 'Around, you know, when are we going to have infrastructure that we can plug into where we can really start to make meaningful plans at the Enterprise District, which we're not quite there yet. And then also, you know, concerns about transportation and what are our plans.'",
        "'speaker_5': 'And we talk.'",
        "'speaker_6': 'About the.'",
        "'speaker_5': 'Ferry and the BART shuttle, the service that's going to be beginning when Saturday comes online. So it really does run the gamut. And we're.'",
        "'speaker_6': 'Talking to some really big players in the world of biotech tech.'",
        "'speaker_5': 'Clean tech. So I think we've got a lot to be excited about as a community, and it's.'",
        "'speaker_6': 'A very, very unique opportunity.'",
        "'speaker_5': 'You know, one that's really has no equal in the Interior Bay area. So as soon as we're in a position to start.'",
        "'speaker_6': 'Delivering.'",
        "'speaker_5': 'On on those real, you know, monetary concerns, I think we stand to have.'",
        "'speaker_6': 'A lot of success out there. I don't know if that answers the question sufficiently. It kind of does. I just want to encourage you, you know, to be aggressive on this, you know, and this is a priority of ours as well.'",
        "'speaker_6': 'The enterprise zone, in addition to the housing on site A and the sooner we could get to the connection phase and delivery phase, I think I don't want to speak for my my colleagues up here, but I think we all would be pleased if that if you guys kept aggressive on your timeline.'",
        "'speaker_6': 'You bet you have our. We will.'",
        "'speaker_0': 'I swear.'",
        "'speaker_3': 'And I think the 100 inquiries that were put in the presentation are more than just for me. Just curious is what's going on. I think what I would like to see is the actual analysis short of disclosing who people are of what the inquiries are, because that's our only real measurement of how well the strategy is doing'",
        "'speaker_3': '. If there's if there are players that have that have interest and it doesn't fit our current approach, I'd like to know that so that if those start piling up, we make adjustments as needed. I'm talking a majority of the council, not an offhand discussion to you or or to the city manager.'",
        "'speaker_3': 'I think that. That is actually the most critical piece of where we are now. And to have it just a line item in the in the PowerPoint presentation, I think doesn't allow that to us at six months intervals to see if our strategy is working.'",
        "'speaker_3': 'So I'd like to see some some real analysis be put in on what the nature of the inquiry is, is that some we had to turn away. Is it someone who was just asking a question, like you said, because that also gives us some some key points of interest that will bring people here.'",
        "'speaker_3': 'But we won't know unless it unless it's analyzed and tabular ice and put in a report and presented to us because of six months interval should be points where we're allowed to make adjustments and at the direction of a majority of the council either shift or say yeah keep heading on.'",
        "'speaker_3': 'So that's my comment on this.'",
        "'speaker_0': 'And Birdsong.'",
        "'speaker_5': 'Agreed. Well, thank you very much for your presentation for the residents who are here, as well as those who are watching on television, kind of the 5000 feet overview as to why we're discussing the strategy basically comes down to this.'",
        "'speaker_5': 'Several years ago, we pursued a process where we are trying to identify a developer for the 80 acres or so that is referred to as the enterprise. The Enterprise District also site B. So in the developer model, you would have we would have selected one person to do everything much in the way that we selected a developer'",
        "'speaker_5': 'or site A But through that process, what we found was that the developers, the type of interest that they expressed was that basically they were going to hold on to their the property for quite some time. Land banking being the term.'",
        "'speaker_5': 'So rather than going through with the developer process that we did, we decided to retool. And that's why that's the strategy that we're implementing right now, i.e. working with Cushman Wakefield, looking instead of working with one developer for all of 80 acres, working with Cushman Wakefield to identify prospects for this or that or this part of the'",
        "'speaker_5': '80 acre site. B That's that's why we're talking about this strategy. There are costs and benefits to both. But I believe that the strategy that we're pursuing right now is the right one. It does seem to be that that there is genuine interest in Alameda Point.'",
        "'speaker_5': 'There are incredible businesses out there and there are new opportunities that we can leverage to attract the type of businesses that we want at site B. So for that reason or tonight, my feeling is that I certainly concur with staff's recommendation.'",
        "'speaker_0': 'First of all, I would request that the presentation be added to the agenda items so that people can have it online. Thank you. And then I was another council member that wanted this item pulled. And a concern of mine is that I know that we have businesses that are growing in town that need larger space or businesses'",
        "'speaker_0': 'that are being displaced for other reasons. And I'm concerned that because if if they don't fit exactly right, that they may not be considered for this space. And I actually do want to support our local businesses that may need a larger space.'",
        "'speaker_0': 'And and I hope that they're not eliminated because they're not a certain type of business. And I would like, uh, when Vice Mayor brought up more, sharing more feedback with us, I would like that because I think it is important that we be aware of trying to meet the needs of our community.'",
        "'speaker_0': 'And and I really do want to accommodate our local businesses.'",
        "'speaker_6': 'Thank you. If I can just add to that. So you have maybe three and I agree with the suggestion from the vice mayor also that the mayor agreed with that. You know, we have a little bit more complete reporting now to the council so we can kind of gauge and maybe hopefully December is good because it's, what'",
        "'speaker_6': ', two, two months from now? But I think that's a good little bit. Yeah, you know, nobody wants to know. Maybe it's a little late, but I think we need to know whether we're on the right track sooner rather than later.'",
        "'speaker_6': 'To the vice mayor's point. I mean, we do keep a running log of of, you know, who what why were shared with us in some way.'",
        "'speaker_5': 'And staffs always.'",
        "'speaker_6': 'Got access, but we can certainly.'",
        "'speaker_5': 'Accommodate them.'",
        "'speaker_0': 'And could I just add that I to, you know, share the concern for keeping local business local where we can better serve the public or any businesses out there listening realize this is still years away the enterprise zone.'",
        "'speaker_0': 'So anyone that has like immediate needs for relocation, we wouldn't want them to, you know, rely on this as their expansion space. If they can wait a few years out, that's something. But it's it's not immediate, but.'",
        "'speaker_1': 'Hence the term awareness.'",
        "'speaker_6': 'I mean, we're not quite ready for action.'",
        "'speaker_5': 'But but it's.'",
        "'speaker_6': 'Important. It's important part of building.'",
        "'speaker_5': 'You know, a campaign is ensuring that everybody's.'",
        "'speaker_6': 'Aware of the opportunity.'",
        "'speaker_0': 'Including those tenants. Right. So that's wonderful. Thank you very much.'",
        "'speaker_1': 'Thank you. Any other questions?'",
        "'speaker_0': 'Good. Thank you so much.'",
        "'speaker_3': 'I'd like to move acceptance of five C.'",
        "'speaker_0': 'All those in favor. I wish it carries unanimously. Thank you. And now we move to six e.'",
        "'speaker_2': 'Introduction of ordinance amending the Alameda Municipal Code by amending subsection 33 Dash 70.5, the establishment of the Community Facilities District to finance certain services of Section three Dash 70 Special Tax Financing Improvement Code of Division one General Provisions of Article four, Special Tax Financing of Chapter three, Finance and Taxation to allow the financing of additional services, including'",
        "'speaker_2': 'transportation services and programs.'"
    ],
    "Consider Directing Staff to Renegotiate the Terms of the Friends of the Alameda Animal Shelter (FAAS) Lease and Relocate/Modernize the Shelter Facility, including Addressing Funding.  (Mayor Spencer)  [Not heard on July 19, 2016 or September 6 or 20, 2016]": [
        "'speaker_6': 'I don't think that's a value we all share. But, you know, it's something, you know, we should be presented with with what that means, you know, financially, what does that mean? And so I think that the words of the referral, I think are a little bit too prescriptive, and I would like to see it a little more'",
        "'speaker_6': 'open ended. And, you know, I also want to hear about, you know, what options we have for replacement shelter. I mean, should we consider, you know, floating a bond? Should we consider going to the voters and asking for a parcel tax, you know, things like that?'",
        "'speaker_6': 'If if this is a value of our community and we all stand behind it, you know, let's hear what those options are. And maybe sooner rather than later, you know, we go to the voters and say, this is important to us, this is important to you.'",
        "'speaker_6': 'Are you willing to pay for it? I mean, I think those are important things. And, you know, the M1 the M1 is also a potential $4.3 million hit next year. So, I mean, I don't know if we have the money right now for this year and the K one, if that doesn't pass, that's another, you know, for'",
        "'speaker_6': 'some million dollars. So we're talking at $10 million, you know. Vice mayor made it pretty clear we don't have $10 million.'",
        "'speaker_3': 'Even before.'",
        "'speaker_6': 'Me, even before even before this. So, you know, now we add another 1.3 to that. I mean, there's going to have to be some serious discussions in this community if if we have that big hole in our budget and, you know, we're going to have to prioritize some stuff.'",
        "'speaker_6': 'So that's kind of where I stand on the referral. I mean, I really want to hear more information. And sooner rather than later, because there is this alleged March, March impending deadline, you know, but to say, renegotiate the contract or to say we need to build a new facility now without that information, you know, I want that'",
        "'speaker_6': 'information.'",
        "'speaker_0': 'Remember days ago?'",
        "'speaker_5': 'Well, thank you very much. I think the key phrase that was other uttered here was that perhaps the mayors.'",
        "'speaker_1': 'Referral.'",
        "'speaker_5': 'Referral is the key phrase is prescriptive. In my opinion, by necessity, it is prescriptive. While I would not say that Rome is burning, the matches certainly being struck and so now is not the time to be fiddling. So by necessity, I do think that we need a prescriptive referral as as what you see here.'",
        "'speaker_5': 'I mean, just to be clear, the way that I would pursue this referral to deal with the issues regarding relocating and modernizing the shelter facility, maybe those are higher hanging fruits that we're not yet ready to grab at.'",
        "'speaker_5': 'But that does not mean that today, on October 4th or tomorrow and October 5th, we can't begin to strategize in terms of generating the revenues needed to preserve the animal shelter in the way that is operating now. Even if that strategizing results in reload, looking at how we relocate or modernize, looking at that as a as a'",
        "'speaker_5': 'medium to higher hanging fruit. So the way that I would pursue this is I would say, you know, I would take the mayor's referral, add some language. So I would say consider directing staff to renegotiate the terms of the Friends of Alameda Animal Shelter Lease commensurate with the business models and values now in place, including reporting on'",
        "'speaker_5': 'relocating slash. Modernizing the shelter facility, including addressing funding. Final comma with due diligence, review of expenses and revenues and the final phrases to to address the points raised by Mrs. Rickles. So. I think by by necessity, we need to get jump into negotiating because you don't want to wait until February if you know that something is going'",
        "'speaker_5': 'to close in March. If you could begin to act in October. It's just like, you know, when I was like it in my first go around and council, you know, way back in December 2003, I said, look at I'm looking at the spreadsheet here for the 80 Alameda Municipal.'",
        "'speaker_5': 'The AT&T Telecom's revenue projections. And I said, you know what? I don't have to wait around in until 26 or 27 to know that something is going to go wrong. And so because the data is speaking to you clearly back then in December 2003.'",
        "'speaker_5': 'I'm just referring to that as an example of why we don't have to wait. We all know that things didn't go well with aluminum power and telecom. Likewise, we don't have to wait around until February or March to know that we need to act now.'",
        "'speaker_0': 'Can. I'm going to take that as a friendly amendment, and I would accept that as a friendly amendment to them. That would be my motion. Then I'll circle back. But then would you be sickening that with someone? Then I have a motion and a second.'",
        "'speaker_0': 'And I want to go to City Manager. Acting city manager is warmer than me.'",
        "'speaker_7': 'Thank you, Madam Mayor. I would just respectfully request the caveat on the friendly amendment about to negotiate to the current standard. And with all due respect, I mean, I think the standard is quite high, and I understand that the community likes that standard.'",
        "'speaker_7': 'The question is whether or not we can afford that standard. And I'm not saying that we wanted to go.'",
        "'speaker_8': 'Back to the way it was.'",
        "'speaker_5': 'That's my point, though. That's where you start with what you want. And then and that's the negotiating point. And as part of your reporting back to council, your contingency planning will be that, you know, we can only do the standard relative to what our budget is.'",
        "'speaker_5': 'And so, you know, hopefully things go well in November eight, but you got to go into it with a certain value, in my opinion.'",
        "'speaker_0': 'And then I'm sorry, let me let me let me thank you for shade. It is warmer than that. You want to add anything else?'",
        "'speaker_8': 'So.'",
        "'speaker_7': 'Yes, I am not suggesting that we are going to go back to the standard that we had in 2011 when we operated the shelter. But I think we need as staff, I mean, we feel a responsibility to look at, okay, what is that actually?'",
        "'speaker_7': 'What are those standards? What is that costing us? And if you set that bar that high, I'm just saying that that ties our hands so personally.'",
        "'speaker_0': 'That was the motion I made the motion that was a friendly amendment. I do want to set the bar high. I think it's critical. That is my position. That is my referral. So I accept the friendly amendment.'",
        "'speaker_1': 'And I think as.'",
        "'speaker_0': 'Our community has stepped up. We've heard you. We've seen your work. So this is my. So I just want to get back to you, okay? This was my referral. I accepted the friendly amendments. There's a motion and a second, and then any other discussion at this time.'",
        "'speaker_0': 'Okay. I'm going to go ahead and call the question. All those in favor. I. All those opposed.'",
        "'speaker_3': 'No, no.'",
        "'speaker_0': 'No.'",
        "'speaker_3': 'Madam Mayor. Vice Mayor, I'd like to make an alternate motion. I'd like to move that. We direct staff to renegotiate the terms of the lease of the friends of the Alameda Animal Shelter, including the city's allocation and support of us.'",
        "'speaker_3': 'I'd like to include in that motion the requirement to have a third party expert provide the evaluation, as suggested by both FOSS and the city. To review the line items and to identify the target to which we are going to hit.'",
        "'speaker_3': 'And I'd also like the direction to include an analysis of the relocation and modernization of the animal shelter. And options for alternative. Funding sources including but not limited to the items listed here. Development fee and other user fees.'",
        "'speaker_6': 'Second.'",
        "'speaker_0': 'And I and and does that also include the idea of expanding the shelter to bring in more revenue?'",
        "'speaker_1': 'Yes. Okay.'",
        "'speaker_0': 'I like that. And could you clarify so in regards to the level of care, what was your language.'",
        "'speaker_3': 'Is to have the independent consultant help us identify the standard to which we are targeting. Because right now.'",
        "'speaker_0': 'So can you tell me what that means is at a low level. I'm sorry. I get to speak right now. Appreciate it. Thank you. So we're going to bring in someone from outside to tell us what our target is.'",
        "'speaker_1': 'Or know.'",
        "'speaker_3': 'To tell us what the standard is, because.'",
        "'speaker_0': 'The standard varies from shelter to shelter.'",
        "'speaker_3': 'Well, then it's not a standard. Those are outputs of standard is what would a target rate for a good shelter is. That's a standard. So we have a measure. Can I finish my statement, please? A standard is a standard.'",
        "'speaker_3': 'That's a target for people to measure their performance against. Our performance is at 90, 95. I heard then I heard 96 and then there was qualifications. I want to know, is there is there how do we fit with everybody else?'",
        "'speaker_3': 'And then I want to know and I think Steph wants to know which one of these line items goes to keeping that that level of service where we are, because it's different from the standard and how do we stay above the standard?'",
        "'speaker_3': 'That's what I'm interested. I'm interested in real measurements so that when so that when we get to the point where we're looking at a $3 million deficit, if that holds true, that we know how to make decisions so that we don't damage.'",
        "'speaker_3': 'The performance that we've put in place. That's what I want to know. This is a long term. And again, I can't help I can't help but go back to last year's transmittal letter where we had the downward curve, where even if everything passes in the in the fall election and fundraising continues and the city is going to'",
        "'speaker_3': 'pick up, the city has to pick up the burden from everything that people have said. The city has to pick up the burden. But the pie from which that burden is picked is projected to get smaller and smaller and smaller.'",
        "'speaker_3': 'That's the projections we were given last year. Am I right in that? That's correct. That's correct. So if we're talking sustainable, sustainable doesn't mean next year, doesn't mean the following year, it means going out. So that's why I'm in.'",
        "'speaker_3': 'I made the motion the way I did.'",
        "'speaker_0': 'So in regard to second. So in regards to your motion, could you clarify when they come back with the standard of care? If they come back with I'm going to say and I don't know if you mean in regards to comparing to other cities or how they develop, but their standard of care is.'",
        "'speaker_0': 'But if it's 75% live to kill rate, is that something then that they'll come back and get feedback from us in regards to are we willing to accept that standard or does our community desire a higher standard? I make.'",
        "'speaker_0': 'And I wanted to. Well, let.'",
        "'speaker_3': 'Me my my answer to that. As we get that standard, we get the cost of it and we get the costs of the high at the high end. If it's above or if it hits the target, we're good to go when we get that information back, then we can have that discussion.'",
        "'speaker_3': 'Right now we have again, when I look at the annual report, I don't see the word stand. I see what the live release rates are, but I don't see the word standard any anywhere. And I don't have a reference to that standard.'",
        "'speaker_3': 'I don't have the information. So. We'll have that discussion when staff comes back with their report.'",
        "'speaker_0': 'Remember Africa? Thank you, Mary. I would like to offer a friendly amendment. Actually, I don't want to support anything that would create a kill rate. You know, I would modify what I think was his done an admirable job.'",
        "'speaker_0': 'I am looking for ways that we can make this budget sustainable, but that's not where I want to want to cut it. I don't want to save money by killing more animals. So I, I would ask I like the I'm giving staff a little more flexibility, directing them to renegotiate the terms of the forest lease the third'",
        "'speaker_0': 'party expert and how we're going to. Make this budget work. And but I don't I don't want to play around with the budgeting.'",
        "'speaker_1': 'I don't think that's what is right.'",
        "'speaker_0': 'Can I give give you some wording to change it?'",
        "'speaker_6': 'I don't think you were asked yes or no.'",
        "'speaker_0': 'Well, when you when you said you could just make it. So. So. Vice Mayor just to make sure I'm not misrepresenting what you're saying when you said identify the target we're going to hit. Is that a financial target rather than can we just leave the.'",
        "'speaker_0': 'I just. There's some things I do want to keep in place in the live release rate I think is is a good one. When I looked at the budget and I don't pretend to be a financial analyst, but, you know, there may be some areas to trim, but not there.'",
        "'speaker_0': 'But I want staff to go over that. I don't I think the standard has been achieved, which is impressive, this this live release rate. And I, I really feel that the parties on both sides negotiating in good faith can.'",
        "'speaker_0': 'Keep that where it is and find other ways to make our beds, make this budget work again. Also, you know, knowing and with all due respect to Councilmember SAC, sure we need contingency planning, but the general fund is going to take a huge hit if the UMA doesn't pass in November.'",
        "'speaker_0': 'And and I just I can't even go into that because I think it's disingenuous to be throwing out this need for more funding while at the same time trying to cut it away. But anyway, did I help you?'",
        "'speaker_0': 'And probably not with the.'",
        "'speaker_1': 'I think I.'",
        "'speaker_0': 'Actually I want to interrupt you real quick. I'm going to ask our attorney. It's my understanding that we're not allowed to advocate for a position, only educate on a matter that's already been put on the ballot. So I don't think it's appropriate.'",
        "'speaker_0': 'Oh, I was advocating I was just talking about what the outcome would be. People that it's your opinion. It was actually contrary to what Steph's presentation was. Okay. So I'm done with that position. With that line of reasoning, maybe Councilman Brody will clarify this for us.'",
        "'speaker_0': 'I'd like to stick to the issue at hand.'",
        "'speaker_6': 'I don't want to speak for the vice mayor, but I think what he's kind of aiming for is, you know, we've and maybe piggybacking on Councilmember De Sykes comments, you know, we have a certain service level here at the animal shelter and we could have a different service level.'",
        "'speaker_6': 'We could have a the service level we had before. We could have be the standard for this type of model that we have and these numbers. And then what's the delta? I mean, if we want the numbers that we're achieving today, you know, what is that costing us?'",
        "'speaker_6': 'Is that costing us $50,000? Is that costing us 70 or whatever it turns out to be? And then that way we can make a decision, say that's our value. So we as a city are willing, you know, to pitch in and pay for that extra cost.'",
        "'speaker_6': 'But we don't we haven't quantified yet. Is that kind of.'",
        "'speaker_1': 'Could we do it?'",
        "'speaker_6': 'Because I don't think you were saying let's lower.'",
        "'speaker_3': 'No, no mind. And maybe my motion was a poor motion because now we have I have to explain how to explain it. And I think that helps. We have if we're going to meet a standard, that's one thing.'",
        "'speaker_3': 'If we're going to maintain the level of, I think, as you said, maintain the current level of service, I think you put it very well. What is that going to cost? And if it's going to cost $50,000 more, that's a no brainer.'",
        "'speaker_3': 'If it's going to cost $1,000,000 more and I'm just throwing these numbers as points of reference, then there has to be a hard decision that's made. But I think we're way in front of that. And I think to to give the motion an additional direction, I would add that our starting point is and should be to maintain'",
        "'speaker_3': 'the level, maintain and improve the level of service we have now. But we have to. Be ready to to face up to the numbers. And that's.'",
        "'speaker_0': 'So I.'",
        "'speaker_9': 'Don't see how that's any different than what I just.'",
        "'speaker_8': 'Said.'",
        "'speaker_0': 'So I think that was the motion we had. That was the most voted down.'",
        "'speaker_7': 'That was the whole my whole.'",
        "'speaker_1': 'Point about.'",
        "'speaker_5': 'You aim high and, you know, let's all hope that, you know.'",
        "'speaker_0': 'November.'",
        "'speaker_1': 'Inflation is the way that we want.'",
        "'speaker_5': 'Like then if there's contingency planning, then you contingency plan, but you aim high. So I got I didn't understand.'",
        "'speaker_0': 'I thought.'",
        "'speaker_6': 'That.'",
        "'speaker_0': 'But I actually I thought that we were trying to give staff a little more latitude to not have to address the. Relocating or modernizing the shelter facility?'",
        "'speaker_5': 'Exactly. I didn't say that. I said including reporting. I didn't say that they were.'",
        "'speaker_1': 'That was that was.'",
        "'speaker_0': 'It was also part of the vice mayor's.'",
        "'speaker_1': 'Motion.'",
        "'speaker_8': 'So let me just let me just.'",
        "'speaker_5': 'Try to summarize what I think the situation.'",
        "'speaker_0': 'Is.'",
        "'speaker_5': 'The situation is that. One, we aim high with the 95% value. The business model that we all like. In the short term. If this is discussion, this isn't the most in the short term. If things don't go the way that we like in November than as part of as part of the negotiations, staff is prepared to just'",
        "'speaker_5': 'say, what are our follow up steps? So the follow up steps in that short term might be for the 18 months. This is how we're going to deal with it. But beyond 18 months, then we're going to do another thing.'",
        "'speaker_5': 'We're going to do a sales tax increase or whatever. The point is, you can do a lot of contingency planning. While still maintaining the values that you have. I don't think this is that complicated, in my opinion.'",
        "'speaker_3': 'I think it's.'",
        "'speaker_0': 'So I think with your modifications, it's a motion we already had.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_0': 'And then what happens? Well, so I want to repeat it because I know. So let's go ahead and see what you're offering. I wrote as.'",
        "'speaker_2': 'Fast as I could.'",
        "'speaker_0': 'And I had.'",
        "'speaker_2': 'Okay. So it's giving staff direction to negotiate the terms of the lease, including the city allocation, requiring that there be a third party expert provided to provide evaluation and review the. Okay I missed that word items and identify a target and in including an analysis of relocation and options for alternate funding sources, including development fees and other'",
        "'speaker_2': 'user fees.'",
        "'speaker_3': 'And I think the missing word is standard.'",
        "'speaker_2': 'Oh. Review the OC that was.'",
        "'speaker_0': 'And then the written variant. And then is there a friendly amendment to have the level.'",
        "'speaker_5': 'The standard that we're talking about is the standard that that we want. And like I said, it's if we have to continue the plan down the road and we continuously plan on the road, they know that.'",
        "'speaker_3': 'Well as part of the discussion. I believe that we have a performance. We don't have a standard. I haven't seen a standard identified. I just know what our performance is. And I maybe I use the word standard a little bit too precisely, but I'm looking for that.'",
        "'speaker_3': 'That latitude between what is generally accepted is standard versus what our performance is and what does it cost to maintain our performance if it's above the standard or to bring it up? If it's below the standard, because it works both ways.'",
        "'speaker_0': 'And I think when you clarify it like that, I think that it is.'",
        "'speaker_1': 'I think we.'",
        "'speaker_3': 'Added having a third party as a.'",
        "'speaker_7': 'Step as.'",
        "'speaker_0': 'A friend. I could have been a friendly amendment.'",
        "'speaker_6': 'Well, call the question, please.'",
        "'speaker_0': 'So you have a notion and I'll say.'",
        "'speaker_6': 'Well, I think in secondary.'",
        "'speaker_5': 'I think we definitely want to hammer out the motion because we've had motions in the past which weren't followed up. So for now, we definitely want to hammer out the motions.'",
        "'speaker_0': 'So I do want.'",
        "'speaker_3': 'To just read the motion that was seconded by Council member Odie.'",
        "'speaker_6': 'Him as good.'",
        "'speaker_0': 'So then I thought that there was a friendly amendment to your mind.'",
        "'speaker_3': 'I didn't hear what.'",
        "'speaker_6': 'I think I called the question, isn't that a priority?'",
        "'speaker_0': 'Actually, I think in order to call the question, then we have to now call for a vote, calling the question that correct. So then there would be a motion to call the question.'",
        "'speaker_1': 'That's I think that's what you would make.'",
        "'speaker_0': 'The motion to call the question so we can get people out the same evening. All those in favor I Bush and.'",
        "'speaker_5': 'Kerry's I opposed. I don't think. I don't think it's clear on the 95% threshold.'",
        "'speaker_0': 'That's a motion to call the question, which, as I understand it, is a separate question. And then the motion on the merits of the motion, the motion on question three. And I'm going to oppose them. And all those opposed oppose.'",
        "'speaker_1': 'The call the question Yeah.'",
        "'speaker_5': 'Yeah, I oppose it because I think we should still talk about hammer out the language of the motion.'",
        "'speaker_0': 'So that the motion.'",
        "'speaker_4': 'Has the motion to call the question passed.'",
        "'speaker_0': 'Now I will call the question.'",
        "'speaker_1': 'All those and all those in favor.'",
        "'speaker_0': 'I agree with all.'",
        "'speaker_6': 'Those in favor.'",
        "'speaker_0': 'Before that was.'",
        "'speaker_6': 'Called, the question cuts the discussion.'",
        "'speaker_0': 'So. Okay. Well, I would have preferred not calling the question. I think I actually think it was clear about the 95%. I think that is this. We're not allowed to have a conversation. So we did the all I'm not having conversation, I'm clarifying.'",
        "'speaker_0': 'So I do think that's what staff. That's not allowed. All those in favor. I suppose I oppose motion carries 3 to 2. All right. The motion. My understanding of the motion was that it could be a lower level of care.'",
        "'speaker_0': 'You know, so.'",
        "'speaker_3': 'Can I ask, do we have the emotion again? They just passed.'",
        "'speaker_6': 'For the.'",
        "'speaker_3': 'Matter.'",
        "'speaker_0': 'Yes, I can. I can ask.'",
        "'speaker_3': 'Her. Yeah. Can I. I'm asking.'",
        "'speaker_1': 'Yes. Yes.'",
        "'speaker_0': 'I have repeat. Yes. Actually, we've moved on from that agenda item, but I'm happy to have her then repeat the question. So it was.'",
        "'speaker_2': 'Directions is to staff to negotiate the terms of the lease, including the city's allocation and requiring having a third party expert provide evaluation and review the standard and identify a target with an analysis of relocation options and alternate funding sources, including development fees and other user fees.'",
        "'speaker_5': 'There is operative term as review the standard. There is no standard to review. We know what the standard.'",
        "'speaker_0': 'So that was the difference in the two emotions. One of them had a higher level of care. So moving on, I'm going to check on some of the other misstatement when I go ahead and recess. Thank you. That was the difference between the two emotions.'",
        "'speaker_0': 'Well, we all have bigger problems to deal.'",
        "'speaker_10': 'Then they get.'",
        "'speaker_0': 'Back to our regular meeting if you all wanted to go out into the hallway or whatever, because we're going to have other items. Thank you very much for coming.'",
        "'speaker_1': 'You know, it's funny because.'",
        "'speaker_0': 'She made it. Go ahead. Sorry. Go back on it for me.'",
        "'speaker_1': 'What is the there?'",
        "'speaker_0': 'We're going to resume our meeting. So if everyone could either take your seat or go out into the hallway, I'd appreciate it. Thank you very much. So now because it's approaching 1030, it's like 10:28 p.m.. At 1030, we need a motion to consider the remaining items.'",
        "'speaker_0': 'And the remaining items.'",
        "'speaker_1': 'Are.'",
        "'speaker_0': 'At six B, which is the art we have. It's my understanding ten speakers on that item. I'm sorry I couldn't hear you. I don't know if they're all still here, though. Okay. At this point, we have ten speaker slips on six B, 66 D.'",
        "'speaker_0': 'And on the time that I was 60, it says 45 minutes. Is that accurate? 45 minutes on 66. How will the housing element? No, no. But that was staff's estimate. That's the we can change the 45 minute estimate.'",
        "'speaker_3': 'Madam Mayor, I think the housing element is extremely important, and I don't want to squeeze it into a five minute slot, a quick presentation. One of the issues we've talked about here on this is is how we approach our housing.'",
        "'speaker_3': 'I think that one deserves more time.'",
        "'speaker_0': 'All right. So that was 60. That is streamlining improvements to existing residential property, things like that, to modify the code. And that staff's estimate is 15 minutes on that one. Is that accurate? 15 minutes for that one. And we don't have any speakers tips on that one.'",
        "'speaker_0': 'Could I ask staff, is there a reason? Thank you, Madam Chair. Is there a reason that couldn't come back to us on the consent as a consent calendar item? It's just the I'm not exhibit six D, it's just the clean up of the order.'",
        "'speaker_0': 'It's an ordinance. Sorry. All right, so then those are the remaining items and of course, the referrals. So at this point and I have another question, is there are there any of these that need to be heard tonight by staff?'",
        "'speaker_0': 'Staff. All right. So then do we have them? And we have ten speakers on six P. Question. Yes. And maybe it's a question to staff as well. What if we we've had a lot of communication from the public on the of this public art fence ordinance.'",
        "'speaker_0': 'Could we start it, take speakers and then continue it to another time? Or does that make it just more complicated? In city clerk, you can just go to.'",
        "'speaker_2': 'And do it.'",
        "'speaker_4': 'You can do that if you want to continue into a date certain, but you have to.'",
        "'speaker_1': 'Pick.'",
        "'speaker_0': 'A date certain. And then how does the 18th look for a date certain?'",
        "'speaker_2': 'You've got other things you probably won't get to that night.'",
        "'speaker_0': 'They'd have to come back because here here's my feeling just really quickly, is we've got people who have been in this audience. From seven and seven.'",
        "'speaker_4': 'We have a very crowded agenda for the eight here. Very crowded. Very crowded.'",
        "'speaker_0': 'All right. So our issue is that if we go past 11:00 tonight, then we have to have at an additional meeting, one additional meeting. If those meetings isn't more than one hour, what is the Sunshine Act?'",
        "'speaker_2': 'It says meeting the word mediator. It does work by a number.'",
        "'speaker_0': 'Oh, all right. All right. So the issue is trying to be done before 11 so we don't have to add meetings. It's also for the public's benefit because they don't you know, people don't follow us after 11:00 at night.'",
        "'speaker_0': 'We've heard that a lot that, you know, they'd like us to. I do want to make a motion.'",
        "'speaker_3': 'I'd like to move that. We hear item six D first and then we go to six C and then make the vote at 11:00 whether to continue or proceed.'",
        "'speaker_0': 'But at that time, we can't add more items, could we, at 11:00? No, no, that's correct. Yes. So then your motion would be just to do 60 and.'",
        "'speaker_3': '66 D first and then six C and continue 60 if needed.'",
        "'speaker_0': 'So my preference would have been to hear the art because that's why people are here.'",
        "'speaker_6': 'I'll second the vice mayor's motion.'",
        "'speaker_0': 'So there's a motion on his second to hear those items. All those in favor.'",
        "'speaker_6': 'I. I.'",
        "'speaker_0': 'I oppose. All right, so I'd like to make a motion here. Six, three, four.'",
        "'speaker_6': 'It doesn't matter.'",
        "'speaker_2': 'You've seen.'",
        "'speaker_0': 'No, I just couldn't figure it out. Right. Like you were. You were. I'm voting already called. The question I want to go back to now. You have a time idea, so nothing happens. I'm sorry. I'm trying to recall a question that I'm going to make another motion.'",
        "'speaker_0': 'That's what happens at this point. The motion did not pass it. I haven't voted yet. I was. That article was in favor. All those opposed. You could take us right to 11:00 doing that. So I'd appreciate it if you vote when I call the question.'",
        "'speaker_0': 'Well, let's move on on with at this point, I'd like to make a motion that we hear six B, which is the public art fund item. And if it goes over, it goes over. And then we set new meetings, but we have people here to hear it.'",
        "'speaker_0': 'So I'm fine going. If it goes past 11th Soviet but I move that we adopt that we proceed with 60.'",
        "'speaker_1': 'Their second is their second.'",
        "'speaker_0': 'His second did it. All those in favor. I. All right. So we're going to proceed with a poll where we have three in favor. You need for only four. I'm sorry. You're right. So we had three. So I was just off checking with the city clerk about what the first meeting in November looked like.'",
        "'speaker_0': 'And I think you said that.'",
        "'speaker_2': 'You have that potentially phase zero Main Street plan and homeless.'",
        "'speaker_0': 'Encampment. I wanted to finish up the motion, so I had all those in favor. We had three. All those opposed?'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'I'll vote for it. Love it with you. All right. So then we do have four. All right, so then we will proceed with six B at this time.'",
        "'speaker_2': 'Introduction of ordinance, amending the Indivisible Code by many Chapter 13 Zoning Ordinance to facilitate the City's ability to disburse public art funds and amend the Fiscal Year 20 1617 Public Art Fund budget by 200,000 and Capital Improvement Project Fund budget by 100,000.'"
    ]
}