{
    "Recommendation to Authorize the City Manager to Negotiate and Execute a Purchase Agreement, or in the Alternative a Lease Agreement, and Service Provider Agreement with Sun Ridge Systems Inc. for the Acquisition, Support, and Maintenance of a Computer Aided Dispatch, Report Management Systems in an Amount Not to Exceed $1,137,825 for Five Years, including a First Year Purchase Price of $820,905 and Annual Support Cost of $79,230 per Year for Four Additional Years.  (Police 3121)": [
        "'speaker_0': 'Okay. Vice Mayor. Item five. See? And do you want to. Do you want to explain why? And do we see whose this is? Do you want to start? Okay. Oh, this is on the. Do you? Okay. Why don't you come on back?'",
        "'speaker_6': 'Sure. I'm happy to ask a couple of questions, and the city manager can have whoever he likes answer it. So this is. This is a purchase agreement for a computer aided dispatch reporting monitoring management system. And so I have two questions.'",
        "'speaker_6': 'I'm not overly concerned about this. I think it's actually a good idea. And the first question is, we are currently having some issues with our current CAD system polling data as it relates to everything, almost everything. Right. And so we are confident that this new system will actually fix that quickly.'",
        "'speaker_8': 'Yes. Based on based on the tutorials that we've received. Yes.'",
        "'speaker_6': 'Excellent. Okay. The second question is great, and I apologize that I didn't have a chance to look this up during the budget conversation. We talked about some of the money that's in the budget for these systems and the impact of possibly putting this money here and not towards license plate readers.'",
        "'speaker_6': 'And we have had a lot of interest in the community around license plate readers. I believe it was last year, but the last time it came forward, which is a year and a half ago.'",
        "'speaker_8': 'Almost to February of 18.'",
        "'speaker_6': 'Yeah, almost two years ago it was going to come back for for council discussion. I know that there were some privacy issues. We have some things coming forward in the next month and a half on that issue. How does our decision here approving this system impact our ability to move forward with that other piece?'",
        "'speaker_8': 'So that's a good question. My personal opinion is it shouldn't have. It doesn't need to have an effect on it at all. Um, I, when I first approached the city manager about this particular cat, our project, um, I was aware that, you know, this was kind of a last minute request as we were heading into the budget'",
        "'speaker_8': '. And I knew that the $500,000 that the Council had set aside for the technology, uh, could have been used for license plate readers or some other technology. So it really just out of an effort to try to keep us from having to spend new money.'",
        "'speaker_8': 'I just basically referred because the city manager wasn't on board when that discussion happened. So I alerted in to the fact that the $500,000 was there and that because at the time the license plate reader discussion was kind of dormant, for lack of a better term.'",
        "'speaker_8': 'And so I thought, well, let's just use that money and then we'll reappropriate some other money in our budget if if we go ahead and if you go ahead and approve this, we still have, unfortunately, salary savings because of our vacancies.'",
        "'speaker_8': 'I still think that there's enough money there that we could proceed with the license plate reader under a separate as a separate project standalone. Okay.'",
        "'speaker_0': 'And the city manager, Mr. Leavitt.'",
        "'speaker_5': 'Thinks to expand on that. So we would have to evaluate I think we had a million set aside for for this project based on that discussion in the budget. There's about 200,000, so we'd have to look at that in combination with other funds potentially would have to have a new appropriation from other funds.'",
        "'speaker_6': 'Is there a plan to bring the license? I mean, if we approve this, is there a plan to bring the license plate reader?'",
        "'speaker_0': 'So I'm just going to have to stop you right there, because we do need to stick to I think that's probably why the city attorney was grabbing his microphone. But yes, Mr.. Mr.. Chin, why don't you take it from here?'",
        "'speaker_6': 'Yeah. So my advice to the council is that because license plate readers are not in front of the council, I recommend that we do not have that conversation as part of this item. Right. I was just going to ask if that issue would be coming back so that we know if in approving this, we can there's a'",
        "'speaker_6': 'there's a financial trade off and we're going to find that money. So just trying to make sure I know what we're voting on tonight and what we can what we're going to be funded in the future. But if you're saying we can't even clarify whether that issue might come forward, I think if the city manager.'",
        "'speaker_0': 'I would say I think the issue is the least is the question I heard you ask is would there be any impact on the city's ability to get the license plate readers in the fixed locations if the council were to approve this CAT upgrade tonight and I heard the answer from the chief to be no.'",
        "'speaker_5': 'Well, I want to definitely.'",
        "'speaker_0': 'Okay.'",
        "'speaker_5': 'I want to. Yeah. If I could.'",
        "'speaker_0': 'Clarify, city man, you.'",
        "'speaker_5': 'Would have to appropriate new money. I mean, there's 200,000 and you out appropriate new money. So it's not there isn't money there other than the 200,000. So I just want to make sure that's clear because I don't want to come back and have the council think, please misrepresent that.'",
        "'speaker_8': 'I don't get to make the decision. I was just saying that it wasn't didn't have to be, in my opinion, an either or proposition.'",
        "'speaker_0': 'But. Understood. Okay. Any further questions for the chief or any of the staff? Okay. Oh, I'm sorry. I can't somebody.'",
        "'speaker_7': 'I just want to move approval of the item.'",
        "'speaker_0': 'Okay. I have a motion to have a second. I have a motion by Councilmember Ody, seconded by Vice Mayor Knox White. All in favor. I okay. That was unanimous. Thank you. Thank you, everyone. Okay. Thanks. Okay. So we have approved the consent calendar and we've approved item five C.'",
        "'speaker_0': 'So now we are going to move to item six D for those of you who might have come in afterwards, the council voted to bring that to the top of the agenda, because I know we have some little people in the room for this one.'",
        "'speaker_0': 'So who's presenting that item?'",
        "'speaker_2': 'I am.'",
        "'speaker_0': 'Okay. This is our assistant city manager, Jerry Bowden. I think we can still say new, but.'",
        "'speaker_8': 'Yes, a few months venue.'",
        "'speaker_0': 'Yeah, me too. Standard. Welcome.'",
        "'speaker_8': 'Good evening, Mayor. As he Ashcraft, Vice Mayor Knox White and members of the City Council. I am Jerry Bowden, serve as the assistant city manager with the city. I'm here making the presentation this evening. It's obviously a really complex and possibly broad topic.'",
        "'speaker_8': 'So also the chief of police who you've already heard from this evening is here on this topic, city attorney's office planning, building and transportation. If we were to look at land use alternatives, so we're able to basically support the discussion with a number of different areas this evening.'",
        "'speaker_8': 'Obviously, I want to make one other note. There's obviously a lot of members of the community here as well. And so that does offer opportunities for new ideas and for partnerships going through and looking at the options here this evening.'",
        "'speaker_8': 'So I'll start with the recommendation. We are recommending that the Council provide direction regarding potential next steps for the local gun safety measures following the gun safety townhall that was held at the Alameda Theater just a little over a month ago.'",
        "'speaker_8': 'You're all well aware of this, but I'll just state it for for the presentation this evening. The city is committed to the health, safety and welfare of all residents, employees and visitors. You're also aware that firearm related deaths are at an epidemic level in our country.'",
        "'speaker_8': 'There are over 40,000 lives lost every year in the United States. In 2018, we saw approximately 3000 deaths in California. And so far in 2019, at least 21 mass shootings have occurred in our state, leaving over 124 people dead.'",
        "'speaker_8': 'And those incidents just continue to happen. As recently as this this past week. So the city of Alameda, again, is committed to being part of the solution to address this this situation. On June 4th of 2018, Christ Episcopal Church hosted an event with city participation.'",
        "'speaker_8': 'Councilmember Vela was on the panel that day, as well as mayor as he Ashcraft was also present. We had our police chief there, high school students, and there were gun advocates and other members of the community there. Over 120 people attended that event this past summer.'",
        "'speaker_8': 'Mayor, as he Ashcraft, also sent a letter to the U.S. Senate calling for legislative action to be proactive regarding gun violence. And finally, I'd like to just note that the mayor and council have supported numerous state and federal bills aimed at better regulating firearms.'",
        "'speaker_8': 'And over the last year or so. In September, Vice Mayor Knox White and Councilmember Oteh brought forward a council referral to convene a community conversation regarding gun violence. Council did unanimously support the referral, and that led to the Gun Safety Townhall, which was hosted at the Alameda Theater on October 14th.'",
        "'speaker_8': 'The meeting was facilitated by Vice Mayor Knox White. Councilmember O.D. also facilitated. And the there was a an impressive panel there that that evening covering legal perspectives, public safety, personal impacts associated with gun violence speakers for and against local gun control were there and a lot of different community perspectives were shared.'",
        "'speaker_8': 'There were about 65 members of the public in attendance. And again, just a wide range of options and concepts were discussed. Obviously, it's a multifaceted process. Our topic following the town hall meeting, we were looking for ways to group these these ideas into broad categories.'",
        "'speaker_8': 'Four of them were are put forward here this evening there. There are likely other ways to categorize these things. I just want to acknowledge that. But we looked at safety, safety training, reducing the potential for public violence or violence in public places.'",
        "'speaker_8': 'Now, ownership and storage and then responsibility and documentation. And again, there's there's a lot of breadth to this. We fully expect there to be other ideas or ways to correct ways to categorize things. But hopefully this helps get the conversation going this evening.'",
        "'speaker_8': 'I'm going to go through these pretty quickly. These are the same items that were listed in the staff report. The first category is safety training. There's just one option on the slide. We're looking at the possibility of certifying firearm training, requiring certified firearms training for registered gun owners in the city and proposed a timeline of every five'",
        "'speaker_8': 'years. Obviously, this is just a concept and putting things forward for four for discussion here this evening. The second is reducing the potential for violence in public. Three suggestions here all around. Limiting the the ability to either carry firearms in public places or carry less ammunition.'",
        "'speaker_8': 'So and also possibly limiting carrying firearms at public protests and other public spaces. The third broad category is ownership and storage. And again, requiring additional insurance, safe storage in your home. Safe storage and unattended vehicles could all be options that we could consider here at the local level.'",
        "'speaker_8': 'Yeah. All right. I missed. I just want to make sure that I. I'm on the right slide here. Fourth category in the staff report is responsibility and documentation or eight options on the slide focusing on gun sellers, taxation options, better education in the in in the community and different ways to educate.'",
        "'speaker_8': 'How are all things that are included on on this slide as options under the fourth and final category that we have for you this evening? So once again, our recommendation is to provide direction to staff regarding potential next steps following the gun safety townhall that might involve selecting from the list of items provided this evening.'",
        "'speaker_8': 'We fully expect to hear new ideas here this evening and then directing staff. And there's also the possibility of just directing staff to seek additional input coming out of this evening. If a specific direction isn't identified, if specific ideas do come forward from this evening, we would want the opportunity to assess the viability.'",
        "'speaker_8': 'Also look at the potential staff staffing and resource impacts associated with it, and then have the possibility of evaluating that and presenting it to council before any formal or informal actions are taken with respect to the items that are discussed this evening.'",
        "'speaker_8': 'So with that, I'll conclude staff's presentation and be available for any questions.'",
        "'speaker_0': 'Thank you. This is the time where if the Council has any clarifying questions to ask of the staff, we can do so at this time. And if you do, let's go ahead and ask them. If not, we'll go to our public speakers.'",
        "'speaker_0': 'Any clarifying questions on the presentation? Okay. Hearing none. Now, if you would like to speak tonight, just fill out a speaker slip or come up and speak and fill it out afterwards if we have some.'",
        "'speaker_1': 'Okay. We only have three speakers.'",
        "'speaker_0': 'Okay. We have three speakers. Okay. Did so. Only three people wanted to speak because I'm trying to put anybody who has children or is a child first. So the and but, you know, no one's compelled to speak. But I just I will offer that that opportunity.'",
        "'speaker_0': 'Um, so in the meantime, I. And then I'll just go over the ground rules that will help us move the meeting along and get everyone out. The same night we started the meeting, which is we don't do any applause, we don't do cheers, we don't do the waiver boo or jeer.'",
        "'speaker_0': 'We just listen respectfully and everybody's got something worthwhile to say. So with that, the city.'",
        "'speaker_1': 'Cllr, we now have seven speakers. Okay?'",
        "'speaker_0': 'So when we have more than six speakers, you get 2 minutes to speak. But 2 minutes is really quite a good long time. And so just be prepared. 2 minutes, there's a clock that will be moving along and I going to call our first speaker, in fact, maybe call the first three so you can be ready to'",
        "'speaker_0': 'slide out of your seat when it's time for you to speak.'",
        "'speaker_1': 'Sherry Johansen, Jonathan So Glenn and Eleanor Wiley.'",
        "'speaker_0': 'Okay, Mr. Hanson.'",
        "'speaker_2': 'It's a long time since I've been a child, but it's nice to see so many kids in the audience I'm speaking. This is Shane Johansen and I'm on the steering committee for the Alamy Progressive Zone. I'm actually speaking for them tonight.'",
        "'speaker_2': 'So we have a statement. Basically, the alimony progressives are in support of the proposals to decrease gun violence in Alameda and to add protection for our children. In addition, we believe there's a wide support in the community. And that's kind of what I wanted to speak to you tonight.'",
        "'speaker_2': 'In 2018, the Alameda progressives were asked by the Reverend Stephen Mikhail at the Christ Episcopal Church in Alameda to join their efforts to ask Big Five Sports to remove their assault style style tactical weapons and to promote safety in their schools and against gun violence.'",
        "'speaker_2': 'The Alameda Progressives hosted a rally in protest in March of 2018. More than 500 people showed up for that march for our lives, including some people on this panel. And that was Saturday, March 24th. And we started at Park Street and Santa Clara, and we actually marched to Big Five and shopping center in Alameda showing their support'",
        "'speaker_2': 'for the children and expressing their wishes to see an end of gun violence in schools as well as to empower Big Five to remove their weapons. Two students addressed the crowd about their fears of going to school and being shot.'",
        "'speaker_2': 'The students from the Alameda High Schools had joined the national walkout to protest school violence. They staged a walkout the previous Wednesday. Students in Alameda joined students across the country to walk out of classes for 17 minutes at that time, one minute to honor each of the 7017 people killed in Florida.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Very much.'",
        "'speaker_0': 'And our next speaker is.'",
        "'speaker_1': 'Jonathan, Mr..'",
        "'speaker_0': 'Coughlin.'",
        "'speaker_8': 'Good evening. Thank you, Madam Mayor and council members Jonathan Coughlin. I'm a 20 year resident of Alameda. Another 20 years and I'll be able to claim a long term resident.'",
        "'speaker_0': 'You're a resident. That's all that you know.'",
        "'speaker_8': 'I'm here to urge you to adopt the recommendation and and refer the matter to staff to consider the measures that were on the on the slide show and also the additional measures put to you by by safe all made a lot of really good, important safety measures to be considered there.'",
        "'speaker_8': 'Safety measures do work. We have a really good example of them. In 2016, there was a gentleman in Southern California who had a couple of DUIs, mental health issues. He was had a mental health evaluation. His guns were seized and they were destroyed.'",
        "'speaker_8': 'These systems do work in that sense and do save lives. However, that gentleman's son we know last week shot several classmates and himself. There were three deaths. So it's not enough. These measures are not enough. You have to do more.'",
        "'speaker_8': 'And we know that I'm going to throw some numbers out there. There are 120 guns per person in the United States. There are 220 gun thefts in Alameda alone. Thefts and loss in the last ten years. And. Another number that's really important.'",
        "'speaker_8': 'Californians can register a firearm, a handgun every 30 days. That's more than his constitution required and more that's necessary. So what I urge you to do, in addition to these measures, to make sure your referral includes two specific things.'",
        "'speaker_8': 'One, eliminate all ownership of assault weapons. And in Alameda, they are not all banned. There are exceptions and also limit individuals to one handgun per home and no grandfather clause. We need to do that. We need to get rid of and reduce the number of guns.'",
        "'speaker_0': 'Thank you, Mr. Sandlin. And our next and if any young people have turned in their.'",
        "'speaker_1': 'Clips, received one from a young lady.'",
        "'speaker_0': 'Gabby, are you a young person? Come on. That young.'",
        "'speaker_2': 'People.'",
        "'speaker_0': 'Will bump up to the head of the line here.'",
        "'speaker_2': 'He just gave it. Hi.'",
        "'speaker_0': 'Folks. And just make sure you pulled that microphone down to where we can hear you and we'd love to hear from you. Hi.'",
        "'speaker_2': 'Hello. Board members today. We just want to stand in front of you as high school students. We are in support of the policies that were introduced today, and we'll continue to advocate for common sense gun reform locally as well as on a national level.'",
        "'speaker_2': 'And we believe it's time that our generation is heard for. We're the children that are going to school in the midst of this situation.'",
        "'speaker_0': 'Thank you. Yeah, you sure can.'",
        "'speaker_2': 'I've been a couple rules high, so.'",
        "'speaker_3': 'We're both internal high school students.'",
        "'speaker_1': 'And something that I've been.'",
        "'speaker_3': 'Noticing on our school campus and I'm sure.'",
        "'speaker_4': 'At the other high schools in Alameda.'",
        "'speaker_3': 'Is just a growing anxiety around.'",
        "'speaker_4': 'These these.'",
        "'speaker_3': 'Issues. So I would urge you guys to also consider like support groups and really directly talking to students who are affected by what they're seeing in the media and.'",
        "'speaker_2': 'Yeah, yeah.'",
        "'speaker_3': 'Sorry, not prepared. But I would I would.'",
        "'speaker_0': 'Urge just fine.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you for the suggestions. All right. Are you seniors? What grade are you right? No, no, no.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'Um.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Who's next? Eleanor Wylie, then Krystal Lo, Pilotto and Kelly Cope.'",
        "'speaker_2': 'Eleanor Whaley, 60 year resident of Alameda. And I've spoken many times in this council chamber, not necessarily to this council. And I want to urge the council to, yes, study what we need to do to get guns out of our community.'",
        "'speaker_2': 'I mean, I am just so heartened with these kids, and I think it's just disgusting that they have to come here and ask for mental health support because they're so afraid of what's going on in the world. But as you're looking at things, start with something.'",
        "'speaker_2': 'Don't study it to death. There's many good suggestions. And do it. Don't just talk about it.'",
        "'speaker_0': 'Thank your next speaker is.'",
        "'speaker_1': 'Krystal Lo Pilotto and Kelly Cope.'",
        "'speaker_2': 'Hello. Hi.'",
        "'speaker_3': 'Good evening, council members. My name is Krystal Lobato. I'm a parent here in Alameda and a volunteer leader with Moms Demand Action for Gun Sense and a member of the newly formed group Save Alameda. Sorry, I'm a little sick.'",
        "'speaker_3': 'I'm here tonight to thank you for making gun violence prevention a priority and to encourage you to devote all necessary resources to continue identifying proactive steps that the city can take to keep the community safe. And as you can see, there's a lot of parents here.'",
        "'speaker_3': 'It matters to so many of us on on deep, deep levels, and in particular here in strong support of the city drafting and passing a local safe storage ordinance through my legislative advocacy work with Moms Demand Action. I'm happy to confirm that the list of cities that are passing these safe storage ordinances, it's growing week by week'",
        "'speaker_3': '. But Alameda can do that and more and should do more. And I'm glad that you're considering a wide variety of.'",
        "'speaker_9': 'Policies.'",
        "'speaker_3': 'And I hope that you will adopt the recommendation for the city staff to look at and consider all of those as you're doing this work. You will inevitably hear that no single law is going to completely eliminate the risk of gun violence in our city.'",
        "'speaker_3': 'But I hope that you can all agree that that doesn't mean that we don't have a moral duty to try everything we can to reduce that risk in every way we can. So thank you again for putting this topic on the agenda, and I hope you'll.'",
        "'speaker_9': 'Treat the issue with the.'",
        "'speaker_3': 'Seriousness that it deserves. Our families and our friends are depending on you to take this action.'",
        "'speaker_0': 'Thank you. Well said. Thank you. Our next speaker is Kelly Koop and Ms.. Coats and then Louise.'",
        "'speaker_2': 'Okay. Hi. Hi.'",
        "'speaker_3': 'My name is Kelly Cope.'",
        "'speaker_9': 'I'm a resident over here.'",
        "'speaker_0': 'Oh, friend. I said you're not a.'",
        "'speaker_3': 'Resident of Alameda and leader of Safe Alameda. And I'm thankful that you guys have brought this up to city council. I'm urging you to.'",
        "'speaker_2': 'Move forward.'",
        "'speaker_3': 'With these recommendations that are council members have had. I also want to note that we should have funds for education, for safe storage and other measures. And also we need to reach out to the community so they know if there is somebody who is having thoughts of lying to hurt somebody else or others who they can speak'",
        "'speaker_3': 'to about that if they don't meet the criteria.'",
        "'speaker_2': 'For 5150 but need.'",
        "'speaker_3': 'Additional support.'",
        "'speaker_2': 'Especially.'",
        "'speaker_3': 'People who are younger.'",
        "'speaker_2': 'We need to get them before it gets to a point where they're coming into school with a gun.'",
        "'speaker_3': 'Or if they're using guns in their own home. We've already had four deaths of children, at least four deaths of children.'",
        "'speaker_2': 'Or a parent because.'",
        "'speaker_3': 'Of firearms that were gotten to the hands of children. And I also urge you to address the underlying causes of.'",
        "'speaker_2': 'This violence, as well.'",
        "'speaker_8': 'As.'",
        "'speaker_3': 'Family, domestic violence and also suicidal.'",
        "'speaker_2': 'Thoughts. Thank you.'",
        "'speaker_0': 'Thank you. And then you said.'",
        "'speaker_1': 'And then Daniel Miller. Miller.'",
        "'speaker_2': 'Good evening, counsel. My name is Louise Reed. I am a 20 year resident of Alameda and I am a volunteer leader of Moms Demand Action, the East Bay Local Group. So we cover Alameda as well and we.'",
        "'speaker_3': 'Are just thrilled that you guys are.'",
        "'speaker_2': 'Taking this health epidemic seriously and really looking into the things that we can do to keep our communities safer through gun violence prevention ordinances. Thank you very much. I really just wanted to reiterate what everyone has said here tonight, so I won't take too much of your time.'",
        "'speaker_2': 'And I really.'",
        "'speaker_4': 'Appreciate your understanding.'",
        "'speaker_2': 'The seriousness of this and understanding that our children really need our help. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Danielle Miller, then Danielle Huizar.'",
        "'speaker_2': 'Good evening. My name is Danielle. I have four one and four year old boys and we choose to live raise our kids in Alameda because it's a safe, caring and gated community. But with the prospect as they begin to enter the public schools, the prospect of them being exposed to gun violence is is horrifying and very anxiety'",
        "'speaker_2': 'provoking for me, which is not the feeling that I want to have as they enter kindergarten. So I want to thank the Council for their leadership on this issue and really encourage you to address all of these issues.'",
        "'speaker_2': 'There is everyone has said there are these and so many more issues that we can take. And I understand, you know, for practical purposes, we may need to prioritize a few.'",
        "'speaker_3': 'To start now and then.'",
        "'speaker_2': 'I encourage you, once those are done to do the next ones and the next ones and the next ones until we can really address this epidemic. And this may also require partnerships at the state level and at the state and federal level, as I know you are already doing.'",
        "'speaker_2': 'So I just wanted to encourage you and also to consider not just gun safety measures, but really we do need to reduce the number of guns in homes in this community. I worry about those who face domestic violence.'",
        "'speaker_2': 'The prospect of having a gun in the home reduces the or increases the risk of a woman being killed by five times. It's extremely dangerous. And we know that, you know, many families have guns in the home and they may be kept unsafely, which is very dangerous for the for the children living in the home if they'",
        "'speaker_2': 'come across those those guns. So I just want to encourage you with as strongly as I can to to continue to move forward and to do as much as you can. Thank you.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_1': 'Speaker to then John Platt.'",
        "'speaker_0': 'Hey. We have a twofer.'",
        "'speaker_2': 'Hello.'",
        "'speaker_3': 'Good evening. Thank you so much for supporting.'",
        "'speaker_4': 'These measures.'",
        "'speaker_3': 'Thus far and the work that you have all put in just to get us here today. My name is Daniel Tesla. I am an Alameda mom property owner. I have a two year old and a five year old who recently started kindergarten at the Ruby Bridges Elementary School.'",
        "'speaker_3': 'We love the community. I've joined the PTA. I'm also a county of Alameda employee. So we're really invested here in our community and we just really want our children to be safe and all children to be safe. And I think the big three biggest priorities, you know, as I.'",
        "'speaker_2': 'See them, would be safe.'",
        "'speaker_3': 'Storage, reduction of guns and mental health services, which I know wasn't quite on sort of the four prongs there. But I think it's really important for our young people, especially.'",
        "'speaker_4': 'As some of the young people who have been here.'",
        "'speaker_3': 'Tonight have talked about. And so I just really want to thank you again. I'm also a member of Safe Alameda, so thank you again.'",
        "'speaker_2': 'And please continue this work.'",
        "'speaker_3': 'Don't let it fall. We won't let you. Okay.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_2': 'Bye bye.'",
        "'speaker_0': 'Q Hi, John.'",
        "'speaker_1': 'Platt Yes, I'm back.'",
        "'speaker_8': 'Hi, I'm John Platt. And first off, I'd like to apologize to Vice Mayor Knox White and Jim Giamatti because I questioned the value of your meeting at the theater. Obviously was fantastic and the measures you've got here are great.'",
        "'speaker_8': 'I just have one small suggestion and I'd be willing to contribute to it. Why don't we have a gun buyback program here in Alameda where we pay cash and get some guns off the street? Thank you.'",
        "'speaker_1': 'Thank you. Yeah. Olivia Petty.'",
        "'speaker_0': 'Olivia Petty. There you are. Hi.'",
        "'speaker_1': 'Hi. I'm Olivia Petty, and I'm a sophomore at Alameda.'",
        "'speaker_3': 'High, and.'",
        "'speaker_4': 'I'm not sure.'",
        "'speaker_1': 'If you remember me, but, uh, last two years ago now.'",
        "'speaker_3': 'I actually did a walk out, and I met you at a luncheon over on the.'",
        "'speaker_2': 'Beach. Yeah, yeah, yeah. I do remember you.'",
        "'speaker_0': 'You're a sophomore now. So you were a yes, I do remember that, yes.'",
        "'speaker_1': 'But I just wanted to reiterate that.'",
        "'speaker_3': 'I know we're talking a lot about, you know, the. The stigma around mass shootings in schools.'",
        "'speaker_4': 'And I do.'",
        "'speaker_3': 'Just want to remind that.'",
        "'speaker_1': '90% of gun deaths in America are suicide. And just last year, we at Alameda High had a suicide. Jesse Lopez And out of respect, I don't want.'",
        "'speaker_3': 'To give details or we don't know details about how it happened, but.'",
        "'speaker_1': 'The presence of a gun in a home makes.'",
        "'speaker_2': 'Someone who.'",
        "'speaker_1': 'Is contemplating suicide five times more.'",
        "'speaker_3': 'Likely to go through with it. And I just want to put out there that, yes. What people have been saying, that we need more mental health focus in schools and better education around the subject. And just a better I know we have a school based health center, but more resources, I think, just for students and for adults'",
        "'speaker_3': 'and anyone. So thank you.'",
        "'speaker_0': 'Thank you so much, Olivia. All right. All right. Thank you. Thank you all for speaking. This is a very important topic. And if we didn't know that to begin with. Oh, my God. The week we had last week, it just, you know, you can't make this stuff up, but let's let's start a discussion.'",
        "'speaker_0': 'I'm going to open it on the council, but I'm going to open it first to our vice mayor, Knox White and Councilmember Odie, because you did initiate the town hall that has led to this agenda item. Who wants to go first?'",
        "'speaker_6': 'Me, me.'",
        "'speaker_0': 'Me. Okay. You're both me. But this is me. Okay, Vice Mayor.'",
        "'speaker_6': 'Thank you very much. So thank you all for coming out. And I want to thank my council colleagues as well for, you know, really joining joining. I feel through this process, we've all joined together to show that we're very serious about this.'",
        "'speaker_6': 'I think that, you know, through a variety of different actions and activities that people have participated in, I think everybody up here has shown for the last few years that they are they take this seriously and they want to see this move forward.'",
        "'speaker_6': 'I just wanted to think before we go forward now, aside from staff agreeing to bring this forward as a regular agenda item so that we can have a not late at night conversation. You know, we got some great ideas when this was here in September, we reached out to the Christchurch folks who had organized the first panel'",
        "'speaker_6': 'hearing a year and a half ago and talked to them about their experience and where they saw things moving forward. And I feel we've we've helped to bring those forward as well. We've worked really closely with the Safe Alameda Group, with Moms Demand Action, with every Everytown USA and with the Giffords Law Center.'",
        "'speaker_6': 'And after all those conversations, which were many and will hopefully be continuing. We also worked with our city attorney's office who could really help give us some guidance on ideas that we feel can have some some impact and whatnot.'",
        "'speaker_6': 'We've brought forward these 20 because of the things that we heard from the community. We didn't want to keep adding every day before before we came forward. I think for me it was well, we brought these forward after after because we kind of made a commitment to the groups that we were working with, that we were going'",
        "'speaker_6': 'to do things that could have impact in our community, that showed leadership in our community, that could actually, in a few places take some steps forward that other communities have yet to do in the idea that if all communities start to work together and follow in each other, that there are benefits across the region.'",
        "'speaker_6': 'So I'm excited to be here and look forward to the conversation. Thank you.'",
        "'speaker_0': 'Councilmember Odie.'",
        "'speaker_7': 'Thank you, Madam Mayor. I also want to thank everyone for coming out today. We always have a lot of council referrals. And my my former colleague, Mr. Matarese, would always say a referral may start with one or two council members, but if it's passed by the council, then the whole council owns it.'",
        "'speaker_7': 'So I mean, that's my message today is that, you know, whatever comes out of today, whatever we put forward, you know, it's this entire council that will be doing that, working together. We have we have worked collaboratively together on many things in the past, you know, nine, ten, 11 months, things that people thought were unsolvable.'",
        "'speaker_7': 'So this is an issue that one of the speakers correctly said, you know, there's not, you know, one root cause of the problem. There's not one solution. But I'm looking forward to this conversation. I think we can all we've all shown an ability to work together.'",
        "'speaker_7': 'And I'm pretty confident we'll be able to do that today and bring forth, you know, an agenda that I think will help keep our citizens and our residents safe. It's multifaceted. There's things on here that came up in the town hall.'",
        "'speaker_7': 'There's items that came, you know, from other folks. You know, Johno brought up some. Mr. Coughlin. Sorry. So I'm having an open mind and I'd like to, you know, listen to any and all perspectives and hope. We will put together a good package of directions to our staff to come back.'",
        "'speaker_7': 'And, you know, then we can look these youngsters in the eye that, you know, interrupt meetings so we can hear them. They shouldn't have to do that and tell them, we've listened to you and all five of us are working together to keep you safe.'",
        "'speaker_7': 'And we're working together to respond to you. And we're working together, you know, to answer your call.'",
        "'speaker_0': 'Thank you. Who wants to go next? Councilmember Vela, a young mom herself.'",
        "'speaker_2': 'I'm a I'm a mom now.'",
        "'speaker_0': 'So the of a young child, I should say she is.'",
        "'speaker_3': 'But, you know, I think we started this conversation before I was mom. And it's not to say that my feelings have changed at all. I think that if anything, I feel like whatever more we can do, especially for those who really have, you know, no ability to to care for themselves, then we really do need to do'",
        "'speaker_3': 'it. You know, I was in high school when Columbine happened, and I still remember where I was when it happened. I still remember, you know, everything about that day, partially because my cousins all went to Columbine and it was right behind my my their their home.'",
        "'speaker_3': 'The high school is literally around the corner from their house. And the fact that we're still seeing school shootings and they're, they're frankly, um, are very few people that I know who haven't been impacted by gun violence of some sort tells me that we we can and should do more.'",
        "'speaker_3': 'And I think that this is a public health issue. I think it's a public health crisis. I think that we need to address it as such. And I think that we've addressed a number of different things. Similarly, sometimes the NRA likes to compare or say, you know, cars kill more people than guns and and we regulate cars'",
        "'speaker_3': '. Right. And we do things in order to limit access to them and to regulate them. And we've been very successful, not 100% successful, but we're taking steps even on this council to try to make it more safe with, you know, the use of vehicles around town and regulate that.'",
        "'speaker_3': 'And I think we need to do the same for gun control. And I shouldn't say gun control, but gun safety, because that's really what this is about. It's not about control. It's about safety. I, I really think that the safe I like all of the suggestions.'",
        "'speaker_3': 'The only one that I'm really have would wonder what the process would be is the tax that's proposed. There's a proposed tax on the sale of guns and what that would be spent for. I think that's something very involved.'",
        "'speaker_3': 'There's we would have to put it on the ballot. So it's not something that could just we could just direct staff to do and have it go into place. I do really think that we need to like I said, I like all of the suggestions.'",
        "'speaker_3': 'In fact, I'm willing to say let's try to see if we can do all of them and prioritize them in different orders. But I definitely think that the safe storage ordinance is something that we have to do. I am very concerned about the mental health services, in particular with our youth.'",
        "'speaker_3': 'We're also seeing we saw the report from our school district. I would like us to have a conversation and to work with our school board on that issue more. I know that we've given it just to the audience knows we've given money to the school district specifically for mental health services because we saw because we saw an'",
        "'speaker_3': 'increase in depression, suicidal thoughts, anxiety. And a lot of it is also I, I would I think is very much tied to the overall environment that our students are exposed to. I was with a colleague of mine whose children are in Alameda schools and he says, you know, I was with him when we heard about the Santa'",
        "'speaker_3': 'Clarita shooting. And he said, you know, our students in Alameda, including his seven year old son, do active shooter drills. And that the fact that we are doing these sorts of things in order to prepare our students for this is just.'",
        "'speaker_3': 'Speaks volumes about where we are as a society, and it's not a good thing. So that's where I'm at. I'm happy to continue the conversation with my colleagues, but like I said, I'm happy to find some way to prioritize the list and and see what we can do.'",
        "'speaker_0': 'Thank you, Councilmember Desai.'",
        "'speaker_10': 'Well, great. Well, thank you very much. Thank you very much for bringing this item before us to Councilmember Odie and Vice Mayor Knox White. And also thank you very much to Mayor as he Ashcraft and Councilmember Vela for their and their participation in the meeting over at the Christ Episcopal earlier this year.'",
        "'speaker_10': 'I think for me, I think we're I think our efforts should be focused on is something as tangible as trying to reduce the amount of guns in our community. And I say that I come to that topic by referencing what Dick's, the national retailer, had done in deciding not to sell military assault style weapons at their stores'",
        "'speaker_10': 'and.'",
        "'speaker_0': 'Then destroying.'",
        "'speaker_10': 'Them and destroying them. I believe they still sell shotguns or other hunting type of weaponry, but they don't sell military style assault and assault weapons. And I think in Alameda, we need to encourage retailers if they're selling weaponry that they don't sell military and assault style weapons.'",
        "'speaker_10': 'And I think we need to encourage that through an ordinance, perhaps one way that we can get at that, because clearly federal rules trump how states and localities can regulate gun armament. Perhaps one way that we can get at that is by.'",
        "'speaker_10': 'So required something that if. If stores don't adopt stores that sell military and assault style weaponry, if they don't adopt the the approach that Dick's had had implemented, then they'll have to sell their weaponry in separate parts of the stores, or they'll have to sell their their weaponry in ways that kind of discourage sales of weaponry, much'",
        "'speaker_10': 'in the same way that we have in ordnance, you know, where there are certain types of certain types of published materials that if they're sold at at grocery stores or they're they're sold at convenience stores on the corner, that they have to be behind certain covering, so to speak.'",
        "'speaker_10': 'So we have ordinances in our books that discourage types of retail. And so we might want to contemplate that and apply that to to the sale of weaponry in retail in Alameda as a as a as is one way of trying to reduce.'",
        "'speaker_10': 'The number of weapons in the city of Alameda.'",
        "'speaker_0': 'Thank you, Councilmember Desai. So and again, just great comments by all our speakers and the council members this weekend. I had a houseguest. She was actually a college friend of mine. She's now a pediatrician. She's the director of an amazing clinic for underserved children and their families in Southern California.'",
        "'speaker_0': 'She was up here because on Monday she was in a meeting of a committee that our did you know the state has a surgeon general, Dr. Nadine Burke Harris, who's pretty amazing pediatrician. If you've never heard her or heard about her, heard her speak.'",
        "'speaker_0': 'But one of the things my friend was saying, because she's from southern California in the south, this shooting had just happened and she was saying this kid had all the addition of just a problem waiting to happen. He lived in a home with guns.'",
        "'speaker_0': 'They were his father's guns. His father had passed away the year before. Maybe his parents were divorced. His mom was a domestic violence survivor. One of the troubling aspects of the guns he used, at least something I've read, is that they were what's called ghost guns, which means they were put together from stolen parts and so they'",
        "'speaker_0': 'didn't even have a serial number. But someone said, and it's such a good point, just because there's no one law that will solve all your problems or, you know, we can't solve all problems of one man doesn't mean you don't do anything we do.'",
        "'speaker_0': 'But the point my friend was making is that there needs to be not only the screening, because apparently pediatricians today my kids are now 28. It's been a while since I've been at a pediatrician, but even then, my pediatrician used to tell me, you need to ask Marilyn.'",
        "'speaker_0': 'When your friends, your kids want to go to a friend's home, you need to ask that parent ahead of time, are there guns in your home? And then you have the child come to your house to play. But but they now ask or they're supposed to ask about all these different mental health indicators.'",
        "'speaker_0': 'My pediatrician, friends, frustration is, okay, great. We ask, we find out they have these markers. But if you don't have the services to to provide the mental health services, what what do we do? So we do need to focus on mental health.'",
        "'speaker_0': 'And as Councilmember Vela noted, this city put in money to the school district to help augment their mental health programs because there just isn't enough. And we'll continue to look at that situation. And I also want to be respectful of the school district.'",
        "'speaker_0': 'The city and the schools are separate entities, and we do not tell the school district what to do. But I would assume that all of you advocates are also speaking to the school board. But we will do what we can as as city elected officials.'",
        "'speaker_0': 'The laws are really important. There are certain things we can do at a local level. Other things bump up to the state level. We've got great state representation with Assemblymember Bonta State Senator Nadine and I as Nancy Skinner.'",
        "'speaker_0': 'I will say that I continue to be just frustrated and flabbergasted by the U.S. Senate that, for crying out loud, can't even agree to universal background checks that the majority of the United States population would agree to. But I don't control everything.'",
        "'speaker_0': 'I control very little, in fact. But what what struck me when I spoke at the ribbon cutting of the newly renovated Alameda High School, because that's my alma mater, and I said this in my remarks, that the school is beautiful and state of the art science labs.'",
        "'speaker_0': 'It never looked this good when we were going there. But at the same time, these kids going to school today are participating in active shooter drills. And that's just it just shouldn't be. So what can we do at the local level?'",
        "'speaker_0': 'I, I definitely like the idea of safe storage. If there's a way we can implement that, I would when we, I think, refer this back to our city staff to work with both the city attorney and also the police department and the police chief.'",
        "'speaker_0': 'They can they will let us know what what can and can't be done, practices that are advisable, that have had good results. I know Mr. Platt said, why don't we do a gun buyback that actually has been controversial, as I understand, because sometimes people use the money from selling the old gun to go buy a new one'",
        "'speaker_0': '. But again, this is where I don't pretend to have all the answers, but I defer to folks who study this. What I do want you all to know, although I know in California we've had way too many shootings, but we do have some of the toughest laws in the in the country.'",
        "'speaker_0': 'And this is from the Giffords Law Center, a paper that they did so we in. California. You know, the term open carry in California. California law prohibits a person from carrying a loaded firearm, open or concealed on his or her person or in a motor vehicle in any public place or on any public street in an incorporated'",
        "'speaker_0': 'city. And we're in incorporated city. Now, that assumes that people follow the law. Right. But there's also and there's an exception if you have a concealed weapon permit. But for instance, California law stops you, prohibits you from carrying an exposed and unloaded handgun in a public place or on a public street again in an incorporated city.'",
        "'speaker_0': 'You generally can't carry or possess a firearm in a state or local public building or at any public meeting. And the California state parks system, the state capital, a polling place. But again, those are the laws that have been on the books.'",
        "'speaker_0': 'And still these kinds of tragedies are happening. I, I agree with my colleagues that I would just like to see fewer guns, period. I think that gun safety training is important. But I what I really want is to focus on those people who would use the gun in the wrong way.'",
        "'speaker_0': 'And fortunately, the young man in Saugus seemed to know just how to operate that gun. But inspecting again so that we make sure there's trigger locks and that sort of thing that, you know, that makes sense so that we prevent those accidental shooting.'",
        "'speaker_0': 'So again, it will go back to staff and I presume it will come back to the council to say here are the things that can be done and here's what it takes, because everything takes a certain level of staffing and resources.'",
        "'speaker_0': 'And we don't just want to have laws on the books, we want them to be effective. So will someone make because I think what we're being asked to do is to provide direction to city staff. So does someone and I.'",
        "'speaker_0': 'And again, I would start with Councilmember Odie or Vice Mayor Knox White. But do you want to take a at first past that or something else?'",
        "'speaker_7': 'Sure.'",
        "'speaker_0': 'I mean, councilman.'",
        "'speaker_7': 'I mean, my earlier comments, I just wanted to level set and hear what everyone else had to say before, you know, speaking so substantively. So. John. You want me to go over? Do you want to? Okay. So, I mean, a lot of this, there's not a need to reinvent the wheel.'",
        "'speaker_7': 'So depending on what type of direction we give you, I think Sunnyvale has a safe storage ordinance that survived courts and court scrutiny. I think San Francisco has some type of possession ordinance that that's survived courts through a court scrutiny.'",
        "'speaker_7': 'Councilmember De talked about, well, you know, you can't put a porn magazine right in front where kids are buying in a in a in a grocery store. Well, you said some things that the First Amendment protects, but I'll carry that one step forward.'",
        "'speaker_7': 'So, I mean, why do we have guns right there in Big Five where kids could see them? So I think the mayor brought up a good point about, you know, asking people how, you know, if there's if there's guns in your house.'",
        "'speaker_7': 'You know, the last thing we want besides a mass shooting is for some kid to go to somebody's house, pick up a gun that's not safely stored, and then they're dead. So how do you have that conversation? You know, I don't know how I would have that conversation, but I know there's groups out there that, you know'",
        "'speaker_7': ', have literature that have educational pamphlets that have done this in other cities. I think Seattle is one of them where there's been some success. So we can we don't have to start from scratch. We have to reinvent the wheel.'",
        "'speaker_7': 'But just getting back to that safe storage thing, I mean, like people could need some guidance on how to have that conversation and then maybe you know how to talk to your children about it. I think the mayor brought this up, too.'",
        "'speaker_7': 'I mean, some of this stuff shouldn't be the new normal. When I was in the doctor's office a couple of weeks ago. I'm waiting for my my appointment. I'm reading you know, this is I think it was Forbes or one of those magazines, you know, stocks that you can, you know, make money in.'",
        "'speaker_7': 'And the first one was like. This this active shooter training class. Our company is like really, you know, we've come to a point where, you know, in our society where one of the biggest moneymaking companies and fastest growing companies in this country is is one that sells training for active shooters.'",
        "'speaker_7': 'To me, something's wrong in our country. I don't begrudge anyone the chance to make money, but, you know, our value system is pretty messed up if if that's a fast growing company and, you know, parents that are told, well, get your kid a bulletproof backpack, I don't have to think about that.'",
        "'speaker_7': 'When I was a kid, I don't think about that when my kids were growing up. And it's like this shouldn't be the new norm. So I hope that as you go forward, you can. I know. I'm sorry. I'm kind of rambling here, but, you know, San Jose is thinking about the strict liability.'",
        "'speaker_7': 'So, I mean, there's someplace that's actually done a lot of research I'm not it is took liability the liability insurance. So as we prioritize I hope that we can use some of the resources and I just want to add.'",
        "'speaker_7': 'I'm going to try to add. You know this story, I think, you know, the suicide thing is super critical. Mental health, completely underfunded. We all know that. No one's going to argue. You know, we as a council decided to step up.'",
        "'speaker_7': 'It was not in our area to assist the school. And we did. I think there's so much more we could do as a state, as a country, as a county. And, you know, I applaud my colleagues for supporting that.'",
        "'speaker_7': 'And some of that stuff is preventable, I think I don't know if it was one of the councilmembers and one of the speakers said, you know, when you have someone who is at risk, we should do whatever we can to make sure that person doesn't have access to a gun, because that's the leading the leading tool of'",
        "'speaker_7': 'suicide. I must try to spit this out. You know, I think we all have, you know, instances where we've been touched by by this situation. And, you know, when I was growing up, we moved when I was in fifth grade or sixth grade.'",
        "'speaker_7': 'Sorry. And, you know, adjusting to a new school at that age is not an easy thing. And, you know, I was able to meet a friend and, you know, a really good friend. And, you know, we stayed best friends for a long time.'",
        "'speaker_7': 'You know, we went to different junior high schools and we still were friends and played pickup baseball, you know, every day in the summer. And we had a different high schools still were best friends, you know, hung out all the time, chatted, did all that stuff.'",
        "'speaker_7': 'We, you know, I went to college. He went to the Navy. But still, you know, my first vacation I went to, you know, D.C. and, you know, not with my friend Joe. And, you know, a second vacation went to Hawaii because he was stationed at Pearl Harbor and.'",
        "'speaker_7': 'You know, we used to joke because we were born like 13 days apart from each other. And first time I got married, you know, we were married like two weeks apart from each other. And we joke that, well, we'll probably die two weeks apart from each other.'",
        "'speaker_7': 'So one of us thought the survivor should be careful, but that was not to be. Because, you know, ten years ago, his mom called me and said that on Christmas morning, he walked out of a mental facility, mental health facility in Virginia and then a bullet through his head.'",
        "'speaker_7': 'So he had mental health issues through serving in the military and PTSD and all the stuff he saw that I'll never see or never even understand or hope to see. So. From that day on. You know, I can't control military.'",
        "'speaker_7': 'I can't control PTSD. I you know, I made a vow to do whatever I can. And this is just a small thing I think that I can do to keep guns out of people who are who are thinking of committing suicide.'",
        "'speaker_7': 'And it could be as simple as, you know, sending out emails through the school channels or sending out a mail piece that, you know, talks about what to look for or putting a sign up at Big Five that says if you're suicidal, here's a help debt or here's some resources, anything, something to help.'",
        "'speaker_7': 'But, you know, I think that's something we should, you know, prioritize and work on. And I kind of had a conclusion, but I lost it right now. So, uh. Oh, yeah. No, that's the last thing I wanted to say.'",
        "'speaker_7': 'I mean. I remember working on this when we worked in the state, and we would we would go visit schools in Oakland and second and third grade. We would ask the students, how many of you been affected by gun violence and expecting to have a few hands raised, you know, in the upper grades, it's every hand.'",
        "'speaker_7': 'Every hand goes up. And in the lower grades, it's almost every hand. To me, that's not acceptable. And I applaud this council. I applaud this community. I applaud all of the volunteer workers, the staff, Alameda, the people that are, you know, taking a stand, the kids that are doing things that I would have never expected to do'",
        "'speaker_7': 'when I was your age. I just applaud all that. And we're listening to you. So keep holding us accountable.'",
        "'speaker_0': 'Thank you, Councilman Rudy. Vice Mayor. Not quite so.'",
        "'speaker_6': 'I. Thanks for sharing that.'",
        "'speaker_7': 'I haven't before. So sorry.'",
        "'speaker_6': 'I'm in my in my list of people that we worked with that I just forgot one person. We worked we had a number of conversations in meetings with the police chief as well. And I just wanted to that was I apologize for for leaving that off my mental list.'",
        "'speaker_6': 'Thank you. I'm ready. Thank you.'",
        "'speaker_0': 'Maybe repeat what I said.'",
        "'speaker_6': 'We worked very closely with the police chief as well, and I wanted to acknowledge that. And I was apologizing for leaving them off. So and I will try to work better at being be better at microphones. You know, I if if and when we get ready for emotion, I think, you know, what I'm hearing is support for'",
        "'speaker_6': 'moving forward with going through the list. I think we've had some new ideas that have been put forward that I that I would look to add to those, which is includes council member Dave Suggs, kind of what I call sold separately.'",
        "'speaker_6': 'You know, if guns are going to be sold, they need to be sold separately. They need to be sold out of sight, not at the front desk, etc.. You know, I think we talked a lot about it, but we didn't put it on the list with the funds for, say, for education around safe, safe storage and GV'",
        "'speaker_6': 'Pro Education. And I would include in that mental health services as well. And then lastly, I think Mr. Coughlin's ban on grandfathered assault weapons, I think would be a very interesting thing for us to consider as well. For me, I think it sounds like there's a lot of interest on the Council for moving forward with prioritizing a'",
        "'speaker_6': 'safe some safe storage, the safe storage portion of this. And I know Giffords and a number of cities have done this. You know, that strikes me, as, you know, slightly low hanging fruit. And so I would like to see that be prioritized.'",
        "'speaker_6': 'I would like to see the training for gun ownership. If you're going to own a gun, you should be going through required recurring training. In our discussions with some of the groups that look into these things, they feel that that is something that can be there that probably would survive challenge if done properly.'",
        "'speaker_6': 'And that would be something that that nobody is doing right now. But again, we know that guns are we cannot get rid of guns right now. That is not within our city's purview. But what we can do is make sure that if you have a gun, you are doing everything you can to show that you are up'",
        "'speaker_6': 'to date on the law. As you're up to date on how to store it, you are up to date on what is required of you as a upstanding member of society in holding these holding these guns in our community.'",
        "'speaker_6': 'And then lastly, you know, we continue to hear concerns about Big Five. And I would like to I feel that there is some work we can do borrowing from other communities to make sure that as they are selling guns, they are legally allowed to do that we are videotaping them that they are keeping, you know, that they'",
        "'speaker_6': 'are open for audit and we can make sure that the sales that are happening are being done legally, etc.. That's under the fourth, fourth item. I'd like to see those three along with the funds for safe storage, which I don't think is something that goes to the Legal Council, but that goes probably to the city manager's office'",
        "'speaker_6': 'for consideration on how we might come back during the budget revised with with something like that. I will say that I have spoken to a number of the school board members to a number of their staff. I think we have very strong partners who are looking for partnership there.'",
        "'speaker_6': 'And the education that we're doing that that we would probably look to do would be done very done in partnership with that. So anyway, I'd, I'd like to make that a motion, but I'd like to see what people think about the prioritization before I do.'",
        "'speaker_0': 'Okay. Councilmember Avella.'",
        "'speaker_3': 'And so I.'",
        "'speaker_2': 'Have.'",
        "'speaker_3': 'I'm in complete agreement. I would say it's not geared at Big Five, it's geared at anybody who would even apply to sell guns here. That that is a just a general rule, but certainly Big Five is operating right now.'",
        "'speaker_3': 'And I think the video recording, seeing if we can separate out or somehow address the display of the weapons, that sort of thing. Um, I do want to add on the, on the safe training. Not all training is the same.'",
        "'speaker_3': 'And there has been a lot of studies about what is addressed during training. And I want to be very clear that the training that I would like to see would include or should include and covered the risk of guns and alcohol.'",
        "'speaker_3': 'The risks of abuse with suicide and domestic violence and the need for safe storage. Because these things go hand in hand and not all trainings cover that. In fact, I've gone through several trainings back when I was in law school and working interning at the district attorney's office and none of our trainings and this was at a'",
        "'speaker_3': 'district attorney's office covered any of those items. And I'm in the legal profession, as are several of my colleagues. We have to get training regularly about substance abuse and the risks associated with it as it connects with our profession.'",
        "'speaker_3': 'And I think having something connected to the licensing around the potential for abuse because studies show that it is higher. I also have a concern and it's not I do want training to be a requirement, by the way.'",
        "'speaker_3': 'I want that to be very clear and regular training. And not just that they own it, but but actual proof that they've gone through it. But there was a study that was done that showed that like something like 90% of the trainings conducted that were conducted, actually, the trainers advocated for gun carrying and gun ownership and encouraged'",
        "'speaker_3': 'it. And so if there's some way that we can address that to, you know, in terms of. Not including that in the training, at least the trainings that are offered if there are trainings offered in Alameda. Or that the city puts on.'",
        "'speaker_3': 'And then I do think that there's we are not doing enough for mental health. We are not doing enough in terms of letting people know what resources are out there and tracking that. And I do think that we need to have more information available about what folks can do if they need help.'",
        "'speaker_3': 'And I think having that information available at any vendor for anybody who's selling guns in the city is very important.'",
        "'speaker_0': 'Thank you. If I could just ask a clarifying question, Councilmember Villa.'",
        "'speaker_2': 'Who?'",
        "'speaker_0': 'I mean, this is to everyone who suggested.'",
        "'speaker_2': 'Who do.'",
        "'speaker_0': 'You contemplate conducting the training?'",
        "'speaker_3': 'I'm not asking that our police conduct the training, but I do think that if there's a way for us to kind of if there's a list of like these are. You know, approved places for training or places that we can refer people to.'",
        "'speaker_3': 'I think if we're requiring training, we're going to need to provide people with places that they can actually go get trained. And I would like to vet what that training includes because like I said, I think that training that doesn't include the first three things is not going to be helpful for our purposes.'",
        "'speaker_0': 'Okay. And so perhaps before I call on the vice mayor, perhaps that something the police chief I'm also not asking the department, but the police chief might be able to direct staff to. I mean, I don't know. But who who does that sort of training.'",
        "'speaker_0': 'But they'd be in a better. Do you want to come up and speak? Come on. It. What might be too strong a verb, but.'",
        "'speaker_2': 'I.'",
        "'speaker_8': 'Feel like I should have my name up there with 9 minutes because I've been up here so much. Um, so just briefly, we the training, I appreciate you saying not the police department, because I nodded my head. No.'",
        "'speaker_8': 'The training that we receive is is all geared towards law enforcement specific training. And I don't think that's what we're talking about here. And to your point, Mayor, there are lots of private entities that do it, some better than others.'",
        "'speaker_8': 'And as Councilmember pointed out, there are different levels of training. Some people think that gun safety involves being able to have good marksmanship, other people at safe storage, children, alcohol, mental health and whatnot. So, I mean, I'd be happy to try to support, um, you know, vetting maybe some trainers administratively.'",
        "'speaker_8': 'But I don't think that, that, that responsibility would really best lie with the police department. I think it would be somewhere else. Yeah. And then, um, and there's other things, you know, just briefly to, to consider. I mean, they're two former members of this council who sat at that day.'",
        "'speaker_8': 'Your dais in my career took their lives with guns. Mm hmm. Right. I mean, this is. This is an everybody problem. Um. Mental health, terminal illness. Criminal intent, domestic violence. It's it's an everybody problem. And most of the people in this room don't remember.'",
        "'speaker_8': 'But I do because I was here we actually had a shooting at Alameda High School when I was in the eighth grade. And fortunately, nobody was killed or seriously injured. But, um, it can happen anywhere. So, uh, I.'",
        "'speaker_8': 'We're happy to support that any way we can. I think the safe storage stuff I've met with Safe Alameda a few times and I'm happy to support that in every way we can. And, um, but I do think we will have to do some expectation setting because the enforcement of that piece would only really come to our'",
        "'speaker_8': 'attention after there was a problem. We can't just go into people's homes and make sure that they're storing their guns safely or even ask them if they have guns. Um, so there's, there's some issues there that we'd have to work out depending on which direction this all goes.'",
        "'speaker_8': 'So that's it.'",
        "'speaker_0': 'Thank you. Thank you, Chief. I'm Vice Mayor.'",
        "'speaker_6': 'So from from my standpoint, I've talked a little bit with with staff about this. So there are there are trainings currently that you must have in order to buy a gun. It's a fairly low bar. It's good for five years.'",
        "'speaker_6': 'And when you're done with it, you don't need to need to have it updated. My, my my assumption would be that in sending this back to staff, that they would identify a way for us to identify what is a meaningful training.'",
        "'speaker_6': 'I think we would give some I appreciate the guidance Councilmember Vela has spelled out specifically. I think that that's all very good. And also, I you know, I don't think we're going to be going in at least at the beginning.'",
        "'speaker_6': 'Who knows where we are 20 years from now. But I don't think we're going to go knocking on doors and asking people for that. I agree. It's probably at the end of the day after the fact, but there might be additional liability or something like that that's done.'",
        "'speaker_6': 'And I would expect that that would be kind of the in bringing something back that would be the job of staff to help us understand how to do it.'",
        "'speaker_0': 'Okay. Um, no, I'm sorry. I've closed public comment. I'm no, I'm sorry, I've closed public comment. Now the council is is deliberating. Councilmember Odie.'",
        "'speaker_7': 'I know my time is up, but can I just add a few more comments? So. I concur with pretty much everything that was said up here. You know, we did add that tax idea has as a as an option like an excise tax on anything sold here.'",
        "'speaker_7': 'I mean, granted, if people if they stop selling in Alameda, we won't have that that source of revenue. But, you know, that's something to think about as a funding source, whether we, you know, have staff members do it or bring in some outside person to do whatever any of these enforcement things.'",
        "'speaker_7': 'And I think there was a discussion about, you know, some type of nominal fee. So, I mean, those are things that, you know, I don't know if they're how legal they are. I don't know how feasible they are.'",
        "'speaker_7': 'I don't know how much money they would raise. But, you know, in an analysis, that would be something to come back with. And then to the other point, if some of these things turn out that were preempted, you know, like maybe some of these ideas about possession, you know, it would, I think, prioritizing, you know, lobbying the'",
        "'speaker_7': 'folks that can change the law that we're preempted from changing, you know, would also be something that I would like to see prioritize. If it's something we can't do and we all feel that there's a need for additional regulation in those areas.'",
        "'speaker_0': 'So my and I do want to hear the motion fashioned. I, I would favor what we can do to focus strongly on the mental health aspect of letting people know. And it could be youth and adults that, you know, these are the resources that are out there.'",
        "'speaker_0': 'Don't use a gun. I think we have to we have to be pretty frank about discussing that. But again, I'm not sure what how how you would start that then the excise tax. And that's certainly a way to generate revenue.'",
        "'speaker_0': 'It would require a ballot measure because it's a tax and it would require a two thirds majority. And I'd say you wouldn't get it, but it's not instantaneous. But okay.'",
        "'speaker_2': 'Who?'",
        "'speaker_0': 'I feel like vice mayor and Councilmember Vela had sort of the the outlines of a motion. And so do you want to just articulate.'",
        "'speaker_6': 'If you're okay, I'll I'll try to take notes while you were talking. So I would I would move that. We ask staff to begin work on bringing back actions for the council to adopt on the entire list that was presented to us tonight and and actions can be we recommend you don't do this because but but you'",
        "'speaker_6': 'know we need to but let's let's start working our way through this list that we add to the retail aspect of this the including a sold separately condition. If you're going to sell guns in here, you're going to you're going to sell them in a I don't want to call it family friendly, but less family threatening manner'",
        "'speaker_6': '. You know, funds for identifying, funds for safe storage, grow education and mental health services.'",
        "'speaker_0': 'Tell me again what the acronym stands for.'",
        "'speaker_6': 'Gun Violence Restraining Order Words. Yes, I'm just going to so so making sure that people know what tools we have available and also doing the outreach to to help folks that we prioritize the strict liability insurance issue, but that we actually follow San Jose's lead because they are doing a lot of work.'",
        "'speaker_6': 'So we might be in touch with them and be ready to act when they are ready to act. But we don't need to duplicate efforts that are being done by a.'",
        "'speaker_0': 'Question question under strict liability. Explain what that's meant to accomplish. I'm sure there are strict liability in life that they're doing two different things. Yeah. Are you talking about. I did. San Jose, I think San Jose.'",
        "'speaker_7': 'They want to impose a rule that if you own a gun, you have to have additional liability insurance. So that's kind of kind of cutting edge. Cutting edge. I think the strict liability was that if a gun is later used in a crime and it was lost or stolen and the person that owned it didn't like reported'",
        "'speaker_7': 'within the required time frame, then they would be liable for damages. And if they you know, if they did report it like they're supposed to and a lot of people do, then, you know, they don't have that, you know, liability.'",
        "'speaker_0': 'So on the liability insurance that San Jose is doing, what is that meant to prevent.'",
        "'speaker_2': 'Or.'",
        "'speaker_0': 'Is it maybe someone buying a gun to begin with? You know what the intent is. Oh.'",
        "'speaker_7': 'This would be my speculation, but I would think if you think you're going to be on the hook for a financial penalty, you might be more responsible with, you know, your storage or ownership.'",
        "'speaker_0': 'I mean, even if you were going to use that gun to end your own life. I mean, I have high regard for the city of San Jose. They're tackling a lot of challenging issues. I just want to make sure we're a smaller city, definitely a smaller staff.'",
        "'speaker_0': 'So but I guess staff can tell us where in the hierarchy that might fall.'",
        "'speaker_7': 'Councilor Rudy, I'm sorry to interrupt, but to your point, I mean, that's why I think we were hoping to, you know, not really go out in front of San Jose, but just kind of see what what they do and protest.'",
        "'speaker_2': 'Yeah, yeah. Yeah, exactly.'",
        "'speaker_6': 'And then adding also for for staff, consider consideration the banning of grandfathered assault weapons. And then in terms of prioritizing, it would be prioritizing safe storage, prioritizing the training for and this would be in the order I would go in.'",
        "'speaker_6': 'Right. So I think there's kind of three legal ones and one funding and education, one which I see being done in different places. But of course, staff will break it out the way they like. Number two would be training for gun ownership recurring every five years.'",
        "'speaker_6': 'That includes the risk of guns and alcohol, the risk of guns related to suicide and domestic violence, and how you know, what the requirements are for safe storage and training on how to use those things so that people understand that.'",
        "'speaker_6': 'Lastly, would be the retailer sales component and then that the funding and education program as outlined. So my motion would be to move on those.'",
        "'speaker_0': 'Councilmember Ody.'",
        "'speaker_7': 'And I would add, you know, reaching out to the school district for potential partnership opportunities because there may be an opportunity for, you know, hypothetically for the city to, you know, pay for the production of some type of graphic.'",
        "'speaker_7': 'But the school district that has a distribution system electronically, too, it doesn't cost anything, you know, to be to assist with distributing that.'",
        "'speaker_6': 'So that's I meant that is inferred, but yes, absolutely.'",
        "'speaker_0': 'And my.'",
        "'speaker_2': 'Motion.'",
        "'speaker_0': 'Artist had a thought that on training that, you know, there's such a thing as webinars and videos and that I mean, it could we could run a whole gamut of possibilities, but that can be looked into. Councilmember Vela, anything to add?'",
        "'speaker_0': 'Okay. Councilmember de SAG.'",
        "'speaker_10': 'I appreciate the comment that our Chief of police, Paul Woolery, in referencing the passing of former colleagues on council. And I think for that reason, I think there's a special imperative for the city of Alameda to pursue mental health matters as well.'",
        "'speaker_10': 'It was sad, for sure.'",
        "'speaker_0': 'Thank you. So we have a motion by Vice Mayor Knox Waite, seconded by Councilmember Odie Flanagan. Okay. Okay. That's good to sign.'",
        "'speaker_7': 'Off on this.'",
        "'speaker_0': 'All right. Councilmember Vela, seconded. All in favor. I. Okay. Well, then, everyone, thank you all for coming and for your time. No, please. We respect our rule. We're going to try and move. We moved you all to the top of the agenda.'",
        "'speaker_0': 'But now I've got a few other items. But thank you all for coming. And this discussion is ongoing. You keep up your good work, too. Thank you, students, for coming. Okay, everybody, we are now going on to is the museum item ready?'",
        "'speaker_0': 'Do we have a speaker? Thank you, Amy. Okay. All right. We are going to. Thanks, everybody. We're going to move now to item six, a.'",
        "'speaker_1': 'Recommendation to receive an annual report on the Alameda Museum archival on behalf of the city.'"
    ],
    "Recommendation to Receive an Annual Report on the Alameda Museum Archival Activities on Behalf of the City. (Recreation and Parks 280)": [
        "'speaker_0': 'Okay. Archival activities. Yes. Okay. And I believe that's being presented by Recreation and Parks director Amy Baldridge.'",
        "'speaker_4': 'Good evening, Mayor and Council. Amy Wooldridge. Record the museum first rate.'",
        "'speaker_0': 'Oh yeah. Is it same person but different. Different presentation.'",
        "'speaker_2': 'You could do that. Which I'm so.'",
        "'speaker_1': 'Sorry.'",
        "'speaker_2': 'Jumping ahead.'",
        "'speaker_4': 'This is the Alameda Museum presentation. I am actually deferring to the president of the board of the Alameda Museum, Valerie Turpin.'",
        "'speaker_0': 'Oh, yeah.'",
        "'speaker_4': 'There she is.'",
        "'speaker_0': 'All right, come on at Ms.. Turpin. I think I last saw you at the home tour.'",
        "'speaker_9': 'Yes. Oh, right, right. See? So see if I can see if I know how to use this.'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'All right.'",
        "'speaker_9': 'Good evening, Council and mayor. I'm Valerie Turpin. I am currently president of the Alameda Museum, which I took that position earlier this year. I had previously served on the board as secretary and been involved for several years. So I wanted to tell you.'",
        "'speaker_0': 'A brief.'",
        "'speaker_9': 'History of the museum, but mostly about what we were doing at the museum. The Alameda Museum was started as the Alameda Historical Society in 1948 by Frank Kroll, longtime city assessor in 1951, with help from Yes, 1951, with help from the city and the library board, the museum was first housed in the basement of the Carnegie Library'",
        "'speaker_9': '. The museum then moved to the former auto body shop at Alameda High School, where it remained until 1991. The museum moved to a larger space at the Masonic Lodge building on Alameda Avenue in 1991. Then this is where we reside today.'",
        "'speaker_9': 'The museum holds city records that the public can research. We have exhibits covering a variety of topics and people that lived here. We have a gift shop which features books and videos about Alameda and donated items that the public donate to our shop.'",
        "'speaker_9': 'And we use that as a fundraising effort. We manage the historic Maya's house and garden. Our exhibits shown in two halls and the archives we accept must be relevant to the city of Alameda. Our history begins with artifacts of the Allen Tribe, our first inhabitants, and proceed with displays on city departments, city schools, our industrial history factories'",
        "'speaker_9': 'and maritime transportation, and the famed Neptune Beach, as well as personal histories. Of course, we feature our city founders and leaders, but we also feature the stories of residents such as Harold Gonzalez, who was awarded the Medal of Honor in World War Two.'",
        "'speaker_9': 'Ida Clinton, an early African-American resident who attended Alameda High School. We have the tools of woodworker John Unkovic, who built furniture to fund his emigration to the U.S. and settle in Alameda. And we even have the history of a local mom whose name was Phyllis Diller.'",
        "'speaker_9': 'She lived in Alameda when she started her comedy career. She donated some of her personal items a few years ago to the museum. And I recently discovered that our museum display is featured on her Wikipedia page. That was a surprise.'",
        "'speaker_9': 'Many items are visible in displays, but what the public sees during a visit is only part of what is available. Our searchable records are in the warehouse at the back of the building. When an archive is received, a form is filled out explaining its history.'",
        "'speaker_9': 'Its physical description is cataloged with the number and it is stored in a protected manner. The museum also has artifacts restored in the case of the portrait of RR Thompson, who built our water system shown here. Mold had started to grow on the edge of the.'",
        "'speaker_9': 'Photo. And this is being professionally treated as commonplace.'",
        "'speaker_2': 'Water because.'",
        "'speaker_9': 'In the warehouse we have shelving and drawers specifically made for maps and large leather bound books. City Assessor Records Date from 1852. Our collection of leather bound newspapers date from MM first newspaper The Post started in 1869. These books are reaching 150 years in age, so they are starting to crumble.'",
        "'speaker_9': 'The bindings are starting to come apart from much use. So we're going to look into this restoration of those many physical objects in our collection are stored in acid free boxes as the fraternal sash shown here. Research is available in the warehouse on Saturdays from 11 to 4.'",
        "'speaker_9': 'Curator George Gunn or another volunteer assist in retrieving records of interest. We offer a space to look at documents and ask that you use a pencil only that we usually provide to write with. Local authors frequently visit the museum for information.'",
        "'speaker_9': 'Shown here are books produced from that research. The most popular books requested by visitors are those of our Victorian and Edwardian residences. Anyone interested in the history of their home starts here at the museum, which is something I immediately did when I bought my home here in 1998.'",
        "'speaker_9': 'I heard, Go to the museum. Look at these books. It will tell you all those secrets of your house. The museum receives numerous phone calls and emails each year from people doing research. I personally have responded to inquiries from Britain, Canada, other states and of course, our own town.'",
        "'speaker_9': 'I recently provided an image of the gas station which sat on Phillip NEARY School's garden site to the instructor there. Also, I have sent a list of city monuments to a local Montessori schoolteacher so she could take her kids on a tour.'",
        "'speaker_9': 'The museum's photographic archives are a major resource of visual history. Many of us have seen images of Park Street, Webster Street and Neptune Beach, but in our archives also are images of people, buildings and our museum. Quarterly features never before images of Alameda.'",
        "'speaker_9': 'Shown here is the high street water wells where Thompson Avenue is today and refugees after the 1906 earthquake. Living in tents at the Elks Camp on their property, it is our goal to fill the newsletter with interesting stories of local people, events and neighborhoods in hopes that our readers are always learning something new about the city they'",
        "'speaker_9': 'live in. The Myers House and Garden was the family home of noted Bay Area architect Henry Miers. The grounds contain the family home, a garage, architecture studio and the carriage house. His three daughters were successful women in their own right, and they lived at the home throughout their lives.'",
        "'speaker_9': 'Janette was the manager of the Dry Creek Ranch. Mildred was an architect, and Edith, a physician who had a hand in starting Girls Inc here in the city. The museum maintains the house and the grounds, and volunteers offer tours monthly.'",
        "'speaker_9': 'At the main museum, we offer tours for schools. Our past president, Dennis Evans, has continued to provide guidance for visiting classes. Groups have included retirement communities and museum groups from other cities. And we we've had various tours over the years for all of these.'",
        "'speaker_9': 'The museum has a lecture series which I've provided a hand out also for you to look at tonight. This year the Transcontinental Railroad was included, which is celebrating the 150th anniversary of its completion. Black military history and the Port Chicago tragedy was covered.'",
        "'speaker_9': 'Led by an NHS veteran who leads a black military reenactment group, Alamy, two sports legends focused on players from the Japanese Baseball League here in Alameda. We had a large turnout by the Japanese community, who had a really great time reminiscing, telling stories of their family and sharing memorabilia.'",
        "'speaker_9': 'The Museum and the Architectural Preservation Society hold the Legacy Home Tour in September. The event staffed by 140 volunteers of both organizations this year and the general public, raises awareness of Almeida's architectural heritage and promotes preservation efforts among homeowners.'",
        "'speaker_9': 'Over 800 people attended this year. And thank you, Mayor, for being a docent in the General Electric House. For the past three years, the museum has staffed a booth at San Francisco History Del. Days held at the old Mint.'",
        "'speaker_9': 'This has been a terrific opportunity to not only promote our museum, but the five museums we have here in town which are listed here. On this slide, we talk about Alameda. In general, people have lots of questions. It used to be, where's Alameda?'",
        "'speaker_9': 'But it has turned to. Yes, I've been there. I visited a certain location. We have a wonderful portable display and we pass out walking tour maps of the city, which we also have available at the museum for free.'",
        "'speaker_9': 'Patrons are donated, donating significant items to our collection lately. We've acquired a coastal scene by Hugo Melville Fisher, whose artistic family settled here in 1886. His works are held in the Oakland Museum and the DeYoung We've gained another piece by artist Edwin Siegfried, which included these Canadian geese shown here.'",
        "'speaker_9': 'And this just proves to me that they were at home here in the 1800s just as much as they are today. We received original portraits of the Cohens from their great granddaughter shown here. And dinnerware. That was from the Fern site estate, which had ended up in New Zealand.'",
        "'speaker_9': 'And this was returned to the museum. In 2019, our board retained longtime members and acquired new members with experience in historical research, internship programs and technology. We are currently in the process of electing five new board members for 2020.'",
        "'speaker_9': 'I was very excited to see the response we had from our ad in the Alameda Sun and on Facebook. We had really strong interest from the public and everyone we interviewed had great ideas and really strong candidates. It was hard to pick only five.'",
        "'speaker_9': 'So on our agenda for the future, we're hoping to create a rotating exhibit space to keep new exhibits happening for people to visit. Address Almeida's diverse population with topics showcasing cultures that contribute to our city history. Our photo archives have been scanned by a student from the College of Alameda, but we don't have a searchable database for'",
        "'speaker_9': 'that currently, and we also don't have a searchable database for our archive catalog. So that's something we're actually talking to someone about programs this week. We'd like to continue recording oral histories from the community and strengthen our internship program.'",
        "'speaker_9': 'We've had interns from the high school, the college and people doing master thesis, and we'd like to organize that more and continue with that. The Imelda Merlin book shown here, Alameda A Geographical History is out of print. This book was sold by the museum for many years and is carried in the reference section at the library.'",
        "'speaker_9': 'Although it was written in 1964 and is outdated in many ways, it still contains substantial historic content about the development of Alameda. We are almost finished with an e-book version and I'm guessing that may be up in the next couple of weeks on our website where we plan to post that.'",
        "'speaker_9': 'Our future plans are substantial and they are time consuming and will require funding. The museum has one paid employee, our curator George Glenn, and the museum mostly relies on many volunteers who devote their time to community outreach and making the museum an educational place to visit.'",
        "'speaker_9': 'The Alameda Museum has been preserving the past for the future since 1948. Tonight, I hope the City Council will continue to support us in making our history accessible to the public and sharing what has made Alameda a unique city in the Bay Area with others.'",
        "'speaker_9': 'So thank you.'",
        "'speaker_0': 'Thank you for your presentation. Does anyone have any questions for Mr. Pyne? This man asked.'",
        "'speaker_6': 'Me, so thank you. I want to thank Ms.. Turpin. She and I met yesterday morning and discussed a few things. I'm curious. I know we talked about this yesterday, but if you were able to get any more information about kind of accessing the archive and how many people are doing that every year.'",
        "'speaker_9': 'Okay. And I do have our curator here with us. Do you have a number?'",
        "'speaker_0': 'He can come on up to the microphone.'",
        "'speaker_9': 'So, yes, generally Saturdays, because we like to have someone overseeing the work being done and be with the person in the archives and we get out the items for them. Some of them are they're heavy, they're on big rollers shelves.'",
        "'speaker_9': 'And so we don't expect people to just look around and find it themselves.'",
        "'speaker_0': 'Come on, Mr. Guy, we just have a little more time for this item.'",
        "'speaker_9': 'Do you have a number of people, do you think that come?'",
        "'speaker_2': 'We have a lot of.'",
        "'speaker_0': 'If you could speak into the microphone and everyone can hear you.'",
        "'speaker_8': 'We have a lot of people that come in about their.'",
        "'speaker_2': 'Homes and.'",
        "'speaker_8': 'They want to restore them. They want to know the history behind it, which. Took me 15 years to produce a book chronicling these houses because we didn't have permits in Alameda until May of 1909. Before 1909, you just built, there was no rules.'",
        "'speaker_8': 'And when they did finally produce a building codes, they took up two pages in the newspaper.'",
        "'speaker_0': 'So not to rush you, because it is always fascinating to listen to you. But the question the vice mayor posed was, I believe, do you know how many people at least approximately access the museum's archives each year to see the city's archives in the museum?'",
        "'speaker_8': 'We have them sign a guestbook. So maybe we should start with the guestbook notating.'",
        "'speaker_2': 'That's.'",
        "'speaker_8': 'What they the purpose that they came to the museum for. The museum is the first introduction to Alameda history visually. And there's so much that we can cover in such a small area. But I'm always amazed at the things that are given.'",
        "'speaker_8': 'And again, as our president says, we don't accept things that don't have a connection to aluminum.'",
        "'speaker_0': 'And just to thank you. Vice Mayor, anything further?'",
        "'speaker_6': 'Well, I just want I want to thank you all for the work that you do. But at the same time, and I raise this concern yesterday, we live in one of the most diverse communities in the East Bay.'",
        "'speaker_6': 'And, you know, I would really like as as the city is 20 on funding, 25% of the budget of the museum on an annual basis. You know, and I believe this is the only community group that we are providing funding for.'",
        "'speaker_6': 'That's not a nonprofit that's providing direct services and whatever else. My hope is that as we do these annual things, we'll be able to start seeing kind of some change in our. You know, I'd like to see, you know, kind of how are we doing outreach to the communities of Alameda.'",
        "'speaker_6': 'We're 36% Asian American in Alameda. And I notice, you know, I appreciate the lecture series, but there is one out of the 17 lectures that have been given in the last three years that has somewhat of a focus on, you know, that part of our history, the history in Alameda of the way in which Japanese Americans were'",
        "'speaker_6': 'you know, I know you've had special.'",
        "'speaker_8': 'Presentation.'",
        "'speaker_6': 'Special presentations, etc., on those. But I worry because you're right, they are. I mean, a museum is the place where people get their introduction to Alameda. And I really do. I am I'm a little concerned that there's a good chunk and an important chunk of our of our history that is missing.'",
        "'speaker_8': 'You're talking to somebody that agrees with you thoroughly. Great. But you cannot depict any subject if you don't have items in which to illustrate it.'",
        "'speaker_0': 'I let him finish. And then.'",
        "'speaker_2': 'This is what we're.'",
        "'speaker_8': 'Trying to do. The average person my age don't think that they have a history and we're trying to train them to give things of their period rather than the 1800s, you know, the 19th century. Early 20th century. Yes.'",
        "'speaker_8': 'And when we get these items, we're we will display them. But it's training the public that the period in which they lived, lived is important. We do have two displays on this African-American family that came here in 1889, and they were allowed to buy property with no problem.'",
        "'speaker_8': 'And then we have a young man that was killed in in the war. Yeah. And what was it? About a week.'",
        "'speaker_2': 'Before the war.'",
        "'speaker_0': 'So and we appreciate that. And I just want to make sure I hear from our council members before we need to move on to the next item. Councilmember Vela, I want to hear from Heather.'",
        "'speaker_3': 'So I am to echo the vice mayors point or to add on to it, I do know that there are a couple places in Alameda that do have a robust collection of items related to the Japanese-American internment. And I would love to make sure that you get connected with them.'",
        "'speaker_3': 'Reverend Yoshi at the United Methodist Church has facilitated the collection, and there's a number of members of his congregation who. You grew up in Alameda and were interned and who whose stories they have started to collect. And I think that would be a nice partnership.'",
        "'speaker_3': 'I would also recommend connecting with the Buddhist temple of Alameda. They also have a display and items. And I and I know that there are a number of families I've gone to see presentations there by folks. And I think it would be nice to, you know, find some way to partner together.'",
        "'speaker_3': 'I know that they both both places have a number of items that have been donated and both oral and written stories and histories from Alameda.'",
        "'speaker_8': 'And we I have been talking to the the board and members of the Masonic Lodge because there is a building behind us that is now empty that they own, but they want $7,000 a month rent and it only take several hundred thousand dollars to improve the property.'",
        "'speaker_0': 'But see, when that is actually not before us tonight, we're just accepting.'",
        "'speaker_8': 'But I'm just telling you that we have we are trying to expand.'",
        "'speaker_0': 'So you'd like more space.'",
        "'speaker_2': 'Too, you know, and because we have.'",
        "'speaker_8': 'Again, so many items.'",
        "'speaker_2': 'Great.'",
        "'speaker_0': 'So I want to hear from any councilmember. Is it still want to speak? Okay. Back to you, Vice Mayor.'",
        "'speaker_6': 'So I wanted to thank you. I do understand, especially as a curator, you can only curate the things that you have. And I did want to just point out, though, I know you have a new board you have new board members coming in all the time.'",
        "'speaker_6': 'If you're going to, I think, build trust with the community to encourage them to bring the bring items in, making sure that members of those community are part of the leadership and a major part of the leadership is an extremely important thing.'",
        "'speaker_6': 'And I guess as we move forward, I would love to hear a little bit more about the proactive steps, not just ads in the paper or ads on Facebook with Proctor Steps going out and building that trust and communication.'",
        "'speaker_6': 'It would be would be very important because I think that, you know, the museum should tell the story of Alameda. The story of Alameda is very broad and very deep. And I think, you know, as I look at that, that great photos of the kids in the presentation, I don't see what is being presented to them as'",
        "'speaker_6': 'the Alameda history is reflecting the actual history of the kids that are in that in that thing. So it's just a comment. I'm not asking you to do anything, but. But I will be.'",
        "'speaker_8': 'No, you know, I appreciate.'",
        "'speaker_6': 'Thank you for your.'",
        "'speaker_8': 'Observations. We need to know that.'",
        "'speaker_0': 'And I'll just add that when I'm appointing members to the city's boards and commissions, I've tried to make sure as best I can. I mean, you can't always just handpick who you want, but I've had pretty good success making our boards and commissions look like our city.'",
        "'speaker_0': 'So we're not an all white city, and we are certainly a different city now than we were in the past. But I think to the vice mayor's point that I'm not trying to put words in his mouth. It would be nice going forward if you could make a point of reaching out.'",
        "'speaker_8': 'If we can if we can.'",
        "'speaker_2': 'Illustrate magic.'",
        "'speaker_0': 'Yeah, well, even getting a more of an access, I shouldn't say that I don't know about your board, but you know what, everyone, I've got people in the audience waiting for a couple more agenda items. And we really appreciate your time.'",
        "'speaker_0': 'I encourage everyone to visit the museum. It's fascinating. What we're being asked to do is to accept the to receive the annual report on the museum activities on behalf of the city. Do we want a motion or is that just direction?'",
        "'speaker_0': 'No emotion. Okay. And so I. Okay, I do have come it.'",
        "'speaker_2': 'Cause.'",
        "'speaker_8': 'Me I've been I been the curator for 47 years.'",
        "'speaker_2': 'Yeah. So I'm.'",
        "'speaker_8': 'I'm not a beginner.'",
        "'speaker_0': 'Okay. I have a motion from Councilmember de SAG to accept the report.'",
        "'speaker_7': 'I'll second and I'll make an appointment.'",
        "'speaker_0': 'And that's been seconded by Councilmember o.T. Any further discussion? All in favor. I opposed abstain and the report is accepted unanimously. Thank you so much for coming tonight.'",
        "'speaker_8': 'Sure.'",
        "'speaker_9': 'Thank you so much for letting us present. And thank you for your motion. And we are listening. We are listening, Mr. White. Absolutely.'",
        "'speaker_0': 'I am sure you are. Thank you. Okay, counsel. Important decision to make. Do you want a quick break now or should we hear the study first? Because I do think we have a number of speakers in the audience, but I will defer to my colleagues.'",
        "'speaker_3': 'I'm happy to continue.'",
        "'speaker_0': 'Okay. Take this item and then do break. Okay. Okay. Come on back, Mr. Aldridge. Okay. So now, Madam Kirk, can you introduce the next item.'",
        "'speaker_1': 'Please? Yes. A public hearing for me to consider adoption of resolution amending Master P resolution number 12191 to add and revise recreation and park fees.'",
        "'speaker_0': 'So what we do is we'll hear the staff report first and then I believe we have public speakers and we'll hear public speakers and then the council will deliberate and take a vote. So this work, I guess yourself.'",
        "'speaker_4': 'Thank you, Mayor. Amy Aldridge, Recreation and Parks Director. So tonight you have before you the to the 2020 recreational park user fee schedule. This comes before you on a separate rotation from the rest of your citywide fees. They implement the fees implement for January 1st, 2020 except for fee for rentals, facility rentals generally be it picnics, club'"
    ],
    "Public Hearing to Consider Adoption of Resolution Amending Master Fee Resolution No. 12191 to Add and Revise Recreation and Park Fees. (Recreation and Parks 280)": [
        "'speaker_4': 'gym fields that are already reserved. So they implement throughout the year as as new bookings come up. So this recommendation comes before you. It was everything you see before you was recommended by the Recreation and Parks Commission. It was put together after looking at other comparable recreation programs in nearby cities, as well as, in some cases, local'",
        "'speaker_4': 'comparisons in Alameda. And it's also really considering the balance between budgets and attempting to keep affordability as well for a community. So for some quick background, some high level challenges that we're always often facing regarding that impact fees, as you know, the aluminum minimum wage increase from two $15 on July 1st 20 or will increase to 15'",
        "'speaker_4': 'on July 2020. It's currently 1315 hour thanks to council. The budget includes an increase to the general fund transfer into the rec fund in part to offset some of those minimum wage increase impacts. The assumption, though, was that it was a partial subsidies subsidizing and that the rest of the difference would be made up an increase of'",
        "'speaker_4': 'fees. LAPD has over 150 part time staff, which is more than 90% of the city's part time workforce. So the minimum wage and fee, the minimum wage and impacted are our budget. And generally that is primarily in the programs of youth, teens and aquatics, which are all heavy in part time staff.'",
        "'speaker_4': 'We also have overall increasing staff costs and facilities and direct costs, janitorial and other contractual. We also have increasing overhead costs that now exceeds well over 25%, which is administrative staff office, as well as our cost allocation and our internal service fund fees, which are what are that we pay for other city services, whether it's facility improvements'",
        "'speaker_4': ', facility maintenance, other city internal services? And are those internal fund charges increased for us last year from 860,000 to this year, 1.4 million. So that's a really big difference that we're trying to work with to then find ways to have a balanced recreation fund.'",
        "'speaker_4': 'So as I mentioned, we compare with neighboring cities. It's included in your packet that comparison cities like San Leandro, Emeryville, Fremont, Union City. We also do local comparisons, for example, with Girls Inc for our afterschool programs and then also with some of the large rental facilities with the auto club.'",
        "'speaker_4': 'And there's also some gym comparisons. We also have we always make sure and that was a focus this year is that nonresidents are paying at least 15 to 20% higher fees. We feel that it's important to really value our residents and ensure they're paying significantly lower fees.'",
        "'speaker_4': 'We do our fees based on a what I call the LAPD cost recovery model. What this triangle represents is really the top of the triangle is the higher cost, the higher fee programs that are expected to have a net profit that really are individual benefit things that people have a choice to do.'",
        "'speaker_4': 'People can choose to sign up for adult softball or adult volleyball or specialty camps, or to rent the old club or a large picnic area for a birthday party. The group benefit in the middle is generally covering its cost or making a small net profit.'",
        "'speaker_4': 'Those are things that are kind of our core recreation services in terms of summer camps, afterschool programs, tiny tots, things that benefit quite a few people, and we want to keep them affordable. And then there's the high community benefit at the bottom, which are all of our free or low cost programs.'",
        "'speaker_4': 'We have free parks and playgrounds, free summer baseball, free and low cost programs at Mastic. I'm proud to say that Empties really is one of the few remaining recreation departments. It offers absolutely free programing to elementary school age youth at six parks every day after school in five parks all day in the summer.'",
        "'speaker_4': 'We are offering free drop in. Anybody can come hang out with us and hang out with the leader for an activity at no cost in these days. It's really unique and unusual. I think something special that really happens because of the support of the community in this council last year, five years.'",
        "'speaker_4': 'We've also had the Free Park Baseball program with over 250 kids participating annually thanks to the sport of the Elks. And then we also have scholarships for all of our youth programs. Also, we have ensured that every single park where there's picnic rentals, there's we hold one aside as non-removable.'",
        "'speaker_4': 'So there's always at least one free first come, first serve picnic area. So overall what this triangles representing that we do have some fees that are higher for those high benefit and the net profit of those helps offset the high community benefit for the programs that are free or low cost.'",
        "'speaker_4': 'In reverse in regards to the fees that are being revised increased for 2020. We're increasing the field for Alameda youth organizations to $6 an hour. It's been going up and up a dollar an hour a year for the past several years after a significant fee restructuring in 2013.'",
        "'speaker_4': 'We're increasing recommending increasing the Alameda Point gym for Alameda organizations and schools to four practices to $35 an hour for games to $40 an hour and for tournaments for $45 an hour. We've not increased the gym fees since 2013, but since then, staff costs, admin costs, contractual costs, janitorial.'",
        "'speaker_4': 'Everything I've mentioned earlier has been increasing. We separated this year. The game and the tournament costs from a fee cost structure from the from the practice, because there is a higher impact, there's higher number of people coming, which is a larger impact on the facility, higher janitorial costs, more toilet paper, that kind of thing.'",
        "'speaker_4': 'It's also not uncommon. It's quite common actually for cities, including our own school district in their rental structures when there's a revenue generating activity to have a higher fee structure for that activity. So for example, the Alameda Unified School District, our high schools charge $40 an hour for their high school gym use, plus custodial costs, and it's'",
        "'speaker_4': '$90 an hour plus custodial costs if you are doing a revenue generating activity like a tournament. We also want to make sure practices and games stayed lower because really that's the core of youth sports in our opinion. Really, the value is to make sure kids are playing and we see tournaments as more of an optional activity.'",
        "'speaker_4': 'I also have heard recently a lot of comparison in terms of the gym versus the field fees because on first flush it looks very different. So I want to give you a quick breakdown. So when if an organization like the soccer club decides to do a tournament at one of our fields, there are a dish or even'",
        "'speaker_4': 'a game. There are additional fees. So it's not just the $6 an hour. There's also $25 an hour for lights. There's $40 an hour for game prep. So our staff is going out and lining and prepping the field.'",
        "'speaker_4': 'It's $40 a game for that. Sometimes they'll even have us come out twice a day to line it in the middle of a tournament, and then it's $250 per day for a tournament. So if, again, a group like Alameda Soccer comes out and decides to do a one day tournament, we'll call it an eight hour tournament at'",
        "'speaker_4': 'a field. If you take those costs of $6 an hour, plus the game prep, $40 game prep plus the $250, it actually I amortize it out to about to $42.25 per hour. So it's just a different type of fee structure.'",
        "'speaker_4': 'And yeah, so it's just different how the fee is structured. We also have increased our rentals specifically in our focus really this year was on nonresident rates, so we increased nonresident rates for our picnics and for our club.'",
        "'speaker_4': 'We also added a Saturday 15% surcharge. So what that is, is it's essentially our Saturdays. The club are booked out for a year. We're currently booked out to September 20, 2020, but we really are going to be trying to encourage people to try a Friday night, try Sunday afternoon, and that really maximizes our capacity and rental ability'",
        "'speaker_4': 'at the club. We also added set up fees for the garden because people want to have their wedding out in the garden. We didn't have a setup fee for that and we made some changes such as deleting. We used to say setup fee was only for 150 people or more, but people found the loophole and said, Well'",
        "'speaker_4': ', it's actually our events, 140 people and now I don't have to pay the fee. And they actually had 150 plus at the event. Right. So we just started really looking at some of those details like that. I want to be clear that on rentals we kept the Alameda resident for Picnic and Club the same.'",
        "'speaker_4': 'We also increased our youth program fees for afterschool summer camp day camp. And again, this is to help us offset really to offset our part time minimum wage costs. We had a higher increase for our group swim lessons and that really was because we have waitlists that are teed up on those.'",
        "'speaker_4': 'And it we're trying to add more, but we're also trying to build a new city aquatic center, which would help a lot with that demand, but with our current facilities were very limited. However, we also again looked at other comparables and our costs, even with the new rate, is half that of Aqua Aquatic and still a good'",
        "'speaker_4': '$10 per lesson under even Harbor Bay Club. So we really looked at local compare and comparisons for that. In terms of new fees for 2020. There's two rooms at the gym ones. They're about 750 ish square feet. And we recently cleaned them out.'",
        "'speaker_4': 'They used to be exercise rooms for the Navy. They've been sitting vacant, unused for four years. And so we cleaned them out. We're looking to give them a fresh coat of paint, some flooring, and then we can use that not only for if someone wants to use it for a tournament as an add on, as a side'",
        "'speaker_4': 'space, but more specifically also for our PD classes. But also we've had interest from martial arts groups, dance groups, because there's mirrors on all the walls to potentially do long term rentals as well. For that, we also are adding an electricity use for inflatables for picnics.'",
        "'speaker_4': 'This actually I feel like falls under the Carp Climate Action Resiliency Plan because if I want to go rent Sweeney Park, say, and bring a jumper. What I currently do is pay $85 to the jumper company for a rental that's a gas powered rental, and now it's spewing gas out, fumes out and and and the subsequent pollution'",
        "'speaker_4': '. So what we're trying to do is to be piloted at Franklin Park. We created a lockbox with an electrical outlet that we then can open for people so they can instead plug in their inflatable. They pay us $20 to help us recoup the electrical costs they're still saving money from.'",
        "'speaker_4': 'Normally they would have to pay for the generator, which they now don't have to. And it's a cleaner way to run this program. So we piloted it at Franklin and we're looking at it at a number of other parks, and then we have some other things, such as adding a security deposit for equipment.'",
        "'speaker_4': 'We have PaaS tables, chairs, things like that, that sometimes local Alameda nonprofits want to borrow. And so this is simply a security deposit. We're still doing it at no charge to the local organizations. We only do it for Alameda nonprofits.'",
        "'speaker_4': 'But we just want to make sure if it gets damaged, we have a way to to offset that. We're also adding marketing discounts, which we haven't done before, and we just want to have the flexibility to be able to implement these.'",
        "'speaker_4': 'So whether it's a Earlybird, 10% off, say we're advertising for camp, that helps us know our numbers and know how to staff if we know better what our registration is earlier in the season or bring a friend, vouchers, things like that to really encourage more registration.'",
        "'speaker_4': 'So with that, I'm open to any questions.'",
        "'speaker_0': 'I counsel any questions about the staff report. Councilman Brody.'",
        "'speaker_7': 'Thank you. Just a few. Maybe we can go back to page four. So on the gym, what do we charge now?'",
        "'speaker_2': 'Oops.'",
        "'speaker_4': 'Too far. It's currently $30 per hour.'",
        "'speaker_7': '$30. Okay. So. I mean, if you have a tournament, you pretty much have to book the whole gym, right? I mean, all four courts.'",
        "'speaker_4': 'That's what they do. Yeah. If someone holds a camp or something like that, we used to have an all facility fee. Now we're doing it per court. So provides more flexibility for us to maximize the space. So someone could rent two courts or three courts instead of the whole facility, and then we could rent out the other'",
        "'speaker_4': 'court.'",
        "'speaker_7': 'Okay. So that 15 that's going up from 30 to 45, which is like a 50% increase, right?'",
        "'speaker_4': 'Yeah, right.'",
        "'speaker_7': 'Okay. So and then if you're doing an all you have to do all four courts, that's going from 120 to 180. Right. So that that's $60, right? Correct. Okay. So and then on the. I appreciate the explanation on the soccer field.'",
        "'speaker_7': 'So you said that was an average of 40 to 25 an hour. Right.'",
        "'speaker_4': 'For a tournament.'",
        "'speaker_7': 'And how much is that going up? It's just a dollar.'",
        "'speaker_4': 'Right. Okay.'",
        "'speaker_7': 'All right. So we're they've.'",
        "'speaker_4': 'Been doing incremental increases, which we haven't done on the gym.'",
        "'speaker_7': 'Okay. And do you know where they were on the soccer fields like six years ago, where.'",
        "'speaker_4': 'When I started in 2012, they were at $500 per season for as much time as they wanted.'",
        "'speaker_7': 'Okay.'",
        "'speaker_4': 'And now and now it's a set fee of $6 per hour. So the problem with the structure before not only in being way too low, it also meant that someone, an organization like soccer club, that you could use a ton of fields and so they would amortize out.'",
        "'speaker_4': 'I did the math back in the time this was seven years ago to like $0.50 an hour. But then you had a group like lacrosse that that only used a little bit of field, and so they were like $20 an hour.'",
        "'speaker_4': 'So it was really unfair system in that way.'",
        "'speaker_7': 'So do we really use a lot more toilet paper at a tournament to justify a 50% increase? I mean.'",
        "'speaker_4': 'Well, it's certainly not just toilet paper. It's also the all of the overhead increasing costs of our budget.'",
        "'speaker_7': 'So, I mean, what additional services do we provide at tournaments that we don't provide, say, at games when someone's renting out the whole gym? Or practice.'",
        "'speaker_4': 'Yeah. It's just a heavier use of the facility.'",
        "'speaker_7': 'But we don't have any additional like personnel cost or.'",
        "'speaker_4': 'No, we're not.'",
        "'speaker_7': 'Adding security car or any of that stuff. Okay. And do we know, like the breakdown of the youth basketball between like boys and girls?'",
        "'speaker_4': 'I don't have that information directly in front of me. We abide by the Fair Play Act. And so the way we schedule, we schedule to ensure all of the girls are scheduled first. So we have up to 50% girls.'",
        "'speaker_4': 'If we don't reach 50% girls because we didn't have enough requests for it, then we'll start filling in the rest.'",
        "'speaker_7': 'And if suddenly we lost like all of those some of these nonprofits that provide an opportunity for young girls to play basketball, I mean, you think they would have an opportunity to play or what do you think would happen?'",
        "'speaker_7': 'I know that's kind of hypothetical speculation, but would they just not play where they go to Oakland? I mean, what would happen?'",
        "'speaker_4': 'I don't know. They could play at the high schools. They. That's so hypothetical. It's a bit hard for me to answer.'",
        "'speaker_7': 'But we don't really have organized basketball until you get to high school. I think that's my understanding. Right.'",
        "'speaker_4': 'There's the Alameda Education Foundation does a middle school basketball as well.'",
        "'speaker_7': 'Okay. Okay. Thanks.'",
        "'speaker_0': 'Any other questions about the staff report before we go to public comment? Councilmember Vela.'",
        "'speaker_3': 'Um, Director, you had mentioned in your presentation that there's plans for updates to the Alameda Point Gym. Can you comment on when those updates are are going to be happening?'",
        "'speaker_4': 'Yes, I've been working with public works on the restroom, adding a restroom that's a pre-fabricated restroom on the exterior of the gym with three of each gender and additional toilets on the other side for the skate park in public.'",
        "'speaker_4': 'We're in the middle of design now and I just met with them today. So hoping to move that forward as quickly as possible and keep.'",
        "'speaker_3': 'We talking about like a year from now.'",
        "'speaker_4': 'I hope not. I'd like it to be sooner than that with us within the year. Absolutely.'",
        "'speaker_3': 'In terms of getting a plan approved or.'",
        "'speaker_4': 'No, in terms of construction, we're we're in the middle of design.'",
        "'speaker_3': 'And in terms of the floors.'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_3': 'On the courts. Do we have any plans for improving or, you know, fixing those?'",
        "'speaker_4': 'We actually been starting to get quotes a couple of years ago. They were as low as 65,000 and they've been inching up. So we are currently trying to find ways to to fund that. The recreation fund doesn't have the capacity to fund capital projects like that.'",
        "'speaker_4': 'That's really operating. You know, these are operating costs versus the capital costs. So we're trying to find a way to fund that. We recognize the need for the flooring redo.'",
        "'speaker_3': 'Okay. And what's the what do we it's you said it's gone up.'",
        "'speaker_4': 'So it's gone up to it's getting closer to 100,000.'",
        "'speaker_3': 'But it's none of that is none of those capital improvements are funded by these proposed fee increases.'",
        "'speaker_4': 'They're not. These are for operational costs. Okay.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Anyone else? Okay. Thanks. Director Woolsey. Let's go to our public speakers. How many do we have?'",
        "'speaker_1': 'We have two speakers. Okay.'",
        "'speaker_0': 'Sorry. Speakers. When you're called, you'll each have up to 3 minutes to speak.'",
        "'speaker_1': 'Marion Carter and Tracy Jensen.'",
        "'speaker_0': 'Okay, Miss Carter, you're up first. And if I could ask you to please not approach the Council, but to go to the city clerk and she will distribute whatever whatever materials you got there. Thank you.'",
        "'speaker_8': 'I probably wasn't.'",
        "'speaker_2': 'Going to put it on the other. Thank you. Thank you, Madam Mayor, and all the council people. My name is Marianne Carter, reside at 408 Fairhaven Road. I've been a resident of Alameda for over 19 years. I love this town.'",
        "'speaker_2': 'I love living here. I also love.'",
        "'speaker_8': 'Helping youth do sports here.'",
        "'speaker_2': 'I've been a part of the Alameda Youth Basketball Board for 12 years. I've been a coach and a referee for that group. I've been a part of the Alameda Vipers Basketball Club for ten years. I'm on the board.'",
        "'speaker_2': 'I've been a coach and I'm now director of the entire operation. Those are both nonprofit organizations.'",
        "'speaker_7': 'I'm here today to speak.'",
        "'speaker_8': 'About the proposed gym rental fees for Alameda Point.'",
        "'speaker_2': 'I love Alameda Point.'",
        "'speaker_7': 'As do many of my.'",
        "'speaker_8': 'Coaches and players. We're very invested in it. We spend a.'",
        "'speaker_2': 'Lot of time there. I've never seen Director Amy at the gym in the ten years that I've been there. She may be there, but not during the evening for practices, and I haven't seen.'",
        "'speaker_7': 'Her at a tournament.'",
        "'speaker_2': 'It's it's an asset, but it's starting to be in really bad shape. I have pictures on my phone.'",
        "'speaker_10': 'From this weekend's.'",
        "'speaker_2': 'Restrooms that were not tended to, and I'm happy to show those to you.'",
        "'speaker_10': 'But that's really ugly in the water and the urine was draining.'",
        "'speaker_2': 'Down the drain. So those are not the responsibility of the people who are running the gym. Allow me to.'",
        "'speaker_7': 'Vipers.'",
        "'speaker_2': 'Before Alameda Vipers.'",
        "'speaker_8': 'No one played basketball from a public school off the island.'",
        "'speaker_2': 'Until they were in high school. So part of.'",
        "'speaker_10': 'The reason we formed it is I'm from.'",
        "'speaker_2': 'Indiana. I love basketball, I want people to play it. And we gave kids an opportunity who wanted to play basketball.'",
        "'speaker_10': 'To get on a team and go play in Oakland, go across the bridge, toughen up and come back as.'",
        "'speaker_8': 'A result of that. I think indirectly, at least.'",
        "'speaker_11': 'Alameda High School men's.'",
        "'speaker_8': 'Basketball.'",
        "'speaker_2': 'Team won the NorCal championship.'",
        "'speaker_8': 'With 66%.'",
        "'speaker_2': 'Of the team.'",
        "'speaker_8': 'Having played for the Alameda Vipers.'",
        "'speaker_2': 'And three of the starters on the Alameda Vipers. In addition to that, every high school here now has some Alameda Viper players.'",
        "'speaker_10': 'And they are in demand. Three girls from.'",
        "'speaker_2': 'Saint Joe were on the cover of a magazine recently. Those three girls came through the Alameda Viper program before they went to high school. I'm not here to say don't increase the fees, but I am here to say let's.'",
        "'speaker_10': 'Be reasonable about the increase in the.'",
        "'speaker_2': 'Fees. These fees are going to hit the Alameda Vipers program very hard. Now we are talking about tournaments, but the Alameda Viper program.'",
        "'speaker_8': 'Produces a lot of other things. Let me get to this.'",
        "'speaker_4': 'The tournament income.'",
        "'speaker_10': 'That we receive is in.'",
        "'speaker_2': 'Your thing. It's on page five. We make 300 to $400 a tournament. That's it.'",
        "'speaker_8': 'That's all we make. We put that to scholarships. Without that, we will not be able to fund 20 to 30% of our kids to be on scholarship.'",
        "'speaker_2': 'The other thing is the comparisons are incorrect and those are also on page six.'",
        "'speaker_7': 'And I.'",
        "'speaker_2': 'Apologize, I had some other.'",
        "'speaker_8': 'Points, but I'm out of time. Thank you.'",
        "'speaker_0': 'You had 25 seconds.'",
        "'speaker_2': 'But I did. Yeah. Oh, I thought I keep talking. Okay, 24 seconds. I'll get back to this. I just ask that the fees not be increased that much. They can be increased over time.'",
        "'speaker_8': 'It's just a big burden to hit us all at once with that fees.'",
        "'speaker_2': 'We like I said, we'll go from making a little bit on the tournaments. And yes, I know money comes in, but guess what? We pay referees the most of anybody. We pay Alameda minimum wage. Some people who put on those tournaments, they don't pay that.'",
        "'speaker_2': 'And we want to keep coach card.'",
        "'speaker_0': 'Thank you. Our next speaker is Traci Jensen.'",
        "'speaker_2': 'To the evening.'",
        "'speaker_11': 'Mayors Ashcroft and members of the council. My name is Tracy Johnson. And like Coach Carter, I consider myself an advocate for our youth in Alameda, although with much less patience. And I'm not a coach, but I am also on the board of the Omni Youth Basketball Association.'",
        "'speaker_11': 'And what I wanted to point out to you is I read the resolution and part of the resolution and one of the where I says the Alameda Recreation and Park District strives to offer high quality recreation programing. That is recreation programing.'",
        "'speaker_11': 'And that is certainly my experience here in Alameda that programs allow me to parks and rec have benefited myself and my family and many families in alameda. I i alameda has it's also true and it's not in the resolution.'",
        "'speaker_11': 'But allow me to have as as Coach Carter mentioned, a tremendous, often overlooked resource, which is our nonprofit youth sports organization, that majority of these youth sports organizations, including lacrosse, is represented here. Soccer club that that I see someone from the soccer club here as well.'",
        "'speaker_11': 'There are these flag football across country, including the soccer club and AYP have been founded in the last 30 years and up until the 1980s, most field and court activities were provided for to kids in Alameda for free at through Alameda Parks and Rec Department.'",
        "'speaker_11': 'So that's something to be considered. And I and I wanted you to know and I think you all do know that historically and a councilmember district of the city news sports organizations have worked in partnership as in 2009, when the city worked with the Army, the soccer club, to address the inequity in allocation of soccer fields to'",
        "'speaker_11': 'non Alameda organizations. And John, our vice mayor worked closely on on that initiative. So these partnerships, in my opinion, are what makes me the best place in the world to raise a family. And what I would say is, rather than instead of considering nonprofit volunteer youth leagues to be fee generators, as is provided in the staff report'",
        "'speaker_11': ', that you maintain the fees or at least increase them just slightly in order to avoid the increased cost to youth and families. As Coach Carter mentioned that many, many families have the opportunity to see the variety of parks and gyms in Alameda only when their child plays in youth league.'",
        "'speaker_11': 'Those parents and their children will grow up to love our open space, as I did when I played softball at Lincoln Cruzi or in other fields through PD. And finally, I want to also address another subject, but I want to commend the Council for your adoption of the Vision Zero Policy to address pedestrian and bicycle safety.'",
        "'speaker_11': 'And when I was 16, a few years ago, I survived a skull fracture after being hit by a truck on Island Drive in Alameda. I survived thanks to the immediate response from FDA paramedics and the excellent care I received at Army Hospital.'",
        "'speaker_11': 'Seeing the recent number of traffic versus bicycle incidents brings back that experience to me, and I applaud your commitment to appropriate traffic solutions. Our community will recognize the hard work on this road to ensure they remain bikeable and.'",
        "'speaker_0': 'Make you happy. All right. I'm no further public speakers, no further. So I'm closing public comment and opening it up to council discussion. Who's going first?'",
        "'speaker_2': 'I'll go.'",
        "'speaker_7': 'Councilmember Ody So thank you, Madam Mayor, and thanks, Coach Carter, and thanks, Tracy, for coming out. I did have a chance to meet with Coach Carter yesterday. Right. So. I'm okay with this except for the issue of the gym fees.'",
        "'speaker_7': 'And I am concerned because I think it does impact our non-profits really significantly when you bump a fee up for a tournament by 50%. So I would propose that we, you know, keep them all the same or at least keep the tournament.'",
        "'speaker_7': 'What is it now, like, around $40 an hour or $35 an hour instead of bumping it all the way up to $45 an hour. And the reason is this, you know, these these nonprofits operate on a very thin margin.'",
        "'speaker_7': 'And they Coach Carter said, especially for the Vipers, if they make any money at all, it goes to scholarships. And what a scholarships do. They help people, kids that may not otherwise be able to play play basketball. So I realize not everyone's going to be I'm going to date myself here, Sheryl Miller.'",
        "'speaker_7': 'But, you know, we probably have some girl that's growing up that wouldn't be able to play if she didn't get a scholarship, you know, or she wouldn't be able to play if, you know, because her family can't afford it.'",
        "'speaker_7': 'So and if groups like the Vipers go away, then she'll have no option to play. So those are the things that worry me. And I think that it was telling to see the impact of the fee on the financial statements of the tournament.'",
        "'speaker_7': 'And those things just won't happen then. So that's the thing that concerns me and that for, you know, what to me is a small amount to the city is a big amount to some of these non-profits. And there's a whole list of them in here.'",
        "'speaker_7': 'I mean, you could you could go through them. And I'm glad we heard from two more. And there was another email we got earlier today from another gentleman who let me just try to from Max Langford, you know, and he puts on a camp and it's pretty low cost camp.'",
        "'speaker_7': 'He doesn't charge that much. And, you know, it it helps out youth Alameda youth and you know this type of of increase would make his camp almost cost prohibitive would put it at the range of you know, 4 to $500, which is what the Warriors charge, according to him.'",
        "'speaker_7': 'So his he's not competing with the gold standard of basketball camps and the Golden State Warriors. He's trying to provide opportunity to kids that might not otherwise have an opportunity. So I think we can do better for our nonprofits.'",
        "'speaker_7': 'We can do better for our young people, you know, better for our girls who want to play basketball by, you know, minimizing these fees, not reducing them so high. You know, my personal preference is, you know, we keep the gym fee at 140 for the total gym, which is, what, 75, 70, 35.'",
        "'speaker_7': 'But if any of my colleagues would prefer something more gradual, I mean, I'd be open to that. But, you know, I just think it's a big chunk to bite off for our nonprofits.'",
        "'speaker_0': 'So we got in line. Councilman Rudy, so.'",
        "'speaker_10': 'Well, thank you very much for the presentation. It seems as though perhaps this year, more than ever since we've been having these presentations, there seems to be a heightened discussion around them, largely because I think to use the phrase, you know, frankly, the economic and financial chickens are coming home to roost.'",
        "'speaker_10': 'And what I mean by that is when you increase the minimum wage to $15, uh, a were the responsibility that cities ought to do when you increase the minimum wage to $15, when you have a large amount of your general fund budget going towards public safety and not as much that leaves so little room for services like'",
        "'speaker_10': 'Alameda Parks and RECs. So what that means is. Our Parks and Rec Department has to deal with these increasing costs on the one hand and dwindling amount of money available to it. On the other hand. And so how do you make that up?'",
        "'speaker_10': 'Unfortunately, you make it up by, you know, these user fees. And I think if we're going to have a discussion about the Alameda Point gym, I think we need to look at this systematically because we won't be we wouldn't be addressing the underlying issue as to why we're here in the first place.'",
        "'speaker_10': 'Because we're here in the first place. That economic chicken is coming home to roost because there is there are these larger financial policy discussions that are kind of the backdrop against which this whole issue about the fees perhaps being too high for Alameda Point, Jim, are occurring.'",
        "'speaker_10': 'So I would recommend that we continue with that. We support the recommendation put forward by our director because believe you me, it's not like she wants to raise fees. You know, if she had if she had her druthers, she wouldn't do that or her staff wouldn't do that.'",
        "'speaker_10': 'That's not what they're here for. But unfortunately. Some people are feeling the brunt of these fee increases. So I would recommend that we go move forward with the recommendation from staff with regard to the fees. And if we want to have a larger conversation about, you know, how we deal with cost increases as a result of policy'",
        "'speaker_10': 'decisions or how we distribute our expenses, general fund expenses, again, as a result of policy decisions. That's a decision that's a discussion that we ought to have, because out of that discussion, we can then say, how much more are we to be funding APD?'",
        "'speaker_10': 'You know, at the end of the day, I would love to have APD funded bet. Like, you know, back in the days when Tracy Jensen and I were a part of our PDS in the seventies and the eighties, but every year, you know, whether it's Mayor, Bizzaro Mayor or Beverly Johnson or Mayor Mary Gilmore or Spenser or'",
        "'speaker_10': 'or now Mayor Maryland as the Ashcraft, you know, we're forced to make these kinds of tough decisions as to where do we find the money to provide for these great, you know, neighborhood park services. And unfortunately, in this day and age, you know, directors like Amy Woolridge are forced to look at look look out for increased fees'",
        "'speaker_0': '. Thank you. Councilmember de SA Just going down the line if I may. Vice Mayor Not quite.'",
        "'speaker_6': 'So I have a couple of questions. I don't think they'll be surprising, but I wanted to wait until we had the speakers before I asked them. I did want to thank Director Aldridge from for taking some time to talk to me about this issue.'",
        "'speaker_6': 'Also, I just, uh, I listened to the Rec and park commission meeting and I just wanted to give them kudos as well. It was a good conversation. I think they they actually found some came to some compromises already for us on this.'",
        "'speaker_6': 'But I appreciated not just the recommendation that they made, but actually some of the direction they gave for future consideration. So, uh, you know, I well, one question is, and it almost gets a little bit too Councilmember de SACS point, but do we have a policy for how we determine what we're charging for a facility in terms'",
        "'speaker_6': 'of. Cost to maintain it versus what we know, how much we're trying to capture back through fees, etc., at this point in time.'",
        "'speaker_4': 'Right. I mean, we're generally generally trying. It depends on the facility. If it's picnic or club, then we're trying to actually back to the triangle make a profit to then offset the free parks and playgrounds programs for these facilities.'",
        "'speaker_4': 'We're trying more to break even. There might be a small net profit, but really it's to help offset. Not just our direct costs for the facility attendant who's there and the janitorial costs, but the staff who are doing the scheduling, the staff who are overseeing the projects, the every you know, the office, the fees we have to'",
        "'speaker_4': 'transfer the departments, all of that. So it's really all of the admin. And so our goal is to get to 100% cost recovery on these types of.'",
        "'speaker_6': 'Programs and all programs, whether it be soccer or.'",
        "'speaker_4': 'These titles. Yeah, thank you. In terms of fields and gym rentals.'",
        "'speaker_6': 'And I think that could actually be an interesting conversation at some point in time to bring back to to us, because there may be places where we want to toy around with that a little bit in terms of providing direction to the to the Commission for the Future discussion.'",
        "'speaker_6': 'When we talked, I had suggested maybe we look at what what might a more smooth ride. So so you know, what I've heard is not don't raise anything what I've heard is the one year jump is is killing us.'",
        "'speaker_6': 'And I know that we've gone through some issues whereby we had to rescind our bar fees a few years ago, etc.. So I know I know that that, you know, there were six years or so where we didn't actually increase our gym fees and that that's a problem we had.'",
        "'speaker_6': 'We had that conversation around rent control, right? Sometimes if you're not ever and then you go to a big one, it has an impact on on folks. So I was curious, you know, Councilmember Ortiz suggested that we just kind of keep it where it is and whatever else.'",
        "'speaker_6': 'What would the for for staff, what would the cost in making that decision? But my my question really is, is there a way for us to smooth out this current proposal, 44 knowing that you had asked for, I think 60% so, so smooth out the 44% and kind of identify how we're going to move forward so that'",
        "'speaker_6': 'we catch up to where we want to be. But also, don't, you know, maybe go up quite so fast in the first year, right.'",
        "'speaker_4': 'Understood. So I think there's a couple options. One is to bring the tournament fee down to the same as the gave game fee to practices at 35, you know, games and tournaments at 40. Another is to do what you're indicating Vice Mayor Knox White is to amortize across several years.'",
        "'speaker_4': 'I looked at options for that. We could, for example, we could, but I would tend to do them with both get practice and games tournaments and just again, keep game tournament on the same fee structure. And in 2022 practices at 35 game tournaments at 38, 21 to 37, at practice 44 game tournament, 22 to 38 for practice'",
        "'speaker_4': 'and 45 for game tournament. So that's a way to more slowly ramp up.'",
        "'speaker_8': 'Right.'",
        "'speaker_6': 'Okay. And from the from a budget standpoint, would there be a concern about, you know, obviously that means you gonna have a hole at some point in time. Do is that mean we're going to you know we have we this year we expanded how much money we're giving for parks.'",
        "'speaker_6': 'Right. We dipped into the general fund and were giving maintenance funds for the first time ever, etc.. Right. Just so people know, we're we're not starving parks, but they're always looking for money. Right. Would that are we going to start eating into that maintenance fund?'",
        "'speaker_4': 'Are we going to know the maintenance fund is a cap? So it's a totally different fund. And that maintenance fund is for more of the capital projects. Capital maintenance projects it will potentially eat into. And I'll just be being I'll just end up being creative with the budget and we're always very careful in how we expend our'",
        "'speaker_4': 'funds. So really being careful in that the rec fund is already in a net deficit for this year, almost $100,000. So it's something we're already looking at this year, all of our staff and trying to see what we can do to make that net zero by the end of the year instead by not by reducing our expenditures'",
        "'speaker_4': '. So and really that net deficit is due to this really significant increase we experienced in our transfer out to other funds. So it's it's a it's a balancing act that we're trying to find. But so it's it's hard to say the exact dollar amount that it will put us behind, but I think that this could be a'",
        "'speaker_4': 'good way to go.'",
        "'speaker_6': 'Okay. And then just lastly, and I know we can't go there tonight exactly. But at the rec and park, there was a conversation around partnerships. So some organizations are called rec partners and they get a lower fee, etc., you know, and nobody's asked me to ask you this, right?'",
        "'speaker_6': 'So Miriam might be like, don't do that. But we have a lot. But it does seem that the Vipers actually provide some junior basketball time, etc., that is not available anywhere else. Right. They're the only ones who are really doing that.'",
        "'speaker_6': 'And there might be some opportunities for us to look at making them partners for some of those projects that would allow them to drop some of their costs, other places to kind of offset some of the increases that we're going to be asking them to make over the years for the tournament and whatever else.'",
        "'speaker_6': 'You know, not everything they do has to be a partnership. I'm not sure how we determine partners, but I just I think if we can be creative with that as well, I think it would be a worthwhile thing.'",
        "'speaker_6': 'Yeah.'",
        "'speaker_4': 'Understood. Thank you.'",
        "'speaker_0': 'Has Mirabella.'",
        "'speaker_3': 'I think I heard one of my colleagues say that he opposes the minimum wage or that the minimum wage is somehow causing all of this. And I think that there's a number of factors that went into it that were not necessarily related to the minimum wage.'",
        "'speaker_3': 'Namely, the fact that we didn't increase for many, many years and now we're trying to play catch up all of a sudden. I do think, you know, it's a it's a big increase to two level levy at one time.'",
        "'speaker_3': 'I do think ramping up as Director Aldridge proposed makes sense. But I also think that increasing the costs to use the facility without improving the facility is problematic. And I you know, my husband plays, you know, and has played in the league out there.'",
        "'speaker_3': 'And I was out there when I was pregnant and I literally had to get in my car and drive somewhere else to go pee. As pregnant women have to go to the restroom quite often because the restrooms were out of order and frankly, I didn't want to have to wade through what was there in order to even'",
        "'speaker_3': 'see if there was something that was working and that that's just not acceptable. And I know that we have problems out there, but I think that we need to as we have the fees increasing, we need to lay out a plan for making sure that the facility is as nice as our fields, as nice as are other'",
        "'speaker_3': 'facilities. And I think the Council needs to be working on that with our parks director to make sure it goes hand in hand. I like the vice mayors, I suppose. Well, I guess you could say about finding a way to partner.'",
        "'speaker_3': 'I was going to say, I know Mike, my colleague, referenced a different female basketball player. I was going to say not every girl is going to grow up to be Lisa Leslie or Sue Bird. But but I certainly think that we have a lot of talent here on Island, and that talent will continue to grow if we'",
        "'speaker_3': 'nurture it. And part of nurturing it is making sure that we're partnering and making sure things our programs are accessible and also making sure that our facilities are usable. The other thing that I think could be helpful out there is there is no real concessions area.'",
        "'speaker_3': 'And that is something if we are thinking of increasing the fees, having some sort of concession area, whether it be outside of the facility and then we limit, we can still say you can't bring food in or something like that.'",
        "'speaker_3': 'And when we're looking at some of these exterior updates to the building that we also try to see if we can build in ways for our partners to fundraise at the facility. And I think we could also find ways to use that in our in our favor, and that might help us bridge the gap.'",
        "'speaker_3': 'So I'm willing to move forward on this tonight, with the exception of I think there was a proposal put out or supposedly put out there about ramping up, and I would be in favor of that.'",
        "'speaker_0': 'In the merits to like to speak. Thanks, everyone, for your comments. And, you know, my colleagues have said a lot of what I was thinking. Some things that stand out to me is that part of the problem we have with the steep increase in the gym fee is the fees, as has been stated, haven't been increased since'",
        "'speaker_0': '2013. So I would be extremely reluctant to support not doing any fee increase this year. I do think council member Vella makes a good point that and I do know the condition of the gym a little bit. It's amazing my kids now 28, but my daughter used to play actually in the United Methodist Church basketball team and'",
        "'speaker_0': 'they had their practices in their games and a lot of their tournaments there. And yeah, the restrooms weren't too great back then and I'm sure they haven't improved with time. So I'm glad to hear about these plans to do the ones outside.'",
        "'speaker_0': 'But I, I just don't think we we can't kid ourselves in saying that we want to do all these things but not increase the fees. And I also I appreciate that the vice mayor actually listened to the recreation part commission meeting.'",
        "'speaker_0': 'I didn't. I know our Recreation and Park Commission. They're a really competent, thoughtful group. And they unanimously approved this and, you know, with some some modifications. So I always like to respect and give great deference to the recommendations of our boards and commissions because they put a lot of thought and time and effort into it before they'",
        "'speaker_0': 'come to us. I a and I don't know. Accounts Director Wooldridge, if you even know what the impact, I mean, it troubles me to hear that the recreation fund is already $100,000 in in arrears. Know it has a deficit of $800,000.'",
        "'speaker_0': 'So that's certainly going to grow. I could. And then the other thing I just want to throw out is I think and I think, you know, the Vipers are doing a great job. I think youth sports are so important.'",
        "'speaker_0': 'And I think in some ways they're even more important for girls just because historically girls have had fewer opportunities. And it's just such great preparation for going out into life and trying to level the playing field literally and figuratively as you move into the working world.'",
        "'speaker_0': 'So we want to encourage that, but we also have needs to meet as a city. But I do think there may be possibilities to help the Vipers with some scholarship opportunities and not seen from the city. But just as I sit here, I'm kind of formulating some ideas about people.'",
        "'speaker_0': 'I'd like to talk to you. I will connect with you later, Coach Carter. So the I really like the recommendations that have come to us. I would be willing to entertain the idea of ramping up a little more slowly, but not to have no increase in the the gym fees.'",
        "'speaker_0': 'And again, the there also is a comparison of other facilities around the area. So what I'm sorry, I'm just pulling my notes back up again that I think. Vice Mayor, you were saying.'",
        "'speaker_2': 'Uh hmm.'",
        "'speaker_0': 'What? So, are you saying a smaller incremental raise?'",
        "'speaker_6': 'Yeah. So from my standpoint, we could either we could have direct or Reuters. I couldn't I couldn't.'",
        "'speaker_2': 'Come up with.'",
        "'speaker_6': 'Quote, your proposed up. The other thing would be we we approve all the fees except this one and ask her to bring back the the the phased proposal on consent at our next meeting. I you know, we could just kind of continue that that way everybody would have a chance to look at it.'",
        "'speaker_5': 'And you could do the phase if you wanted to. You could do the phase now. Right.'",
        "'speaker_0': 'Can you speak more into your microphone?'",
        "'speaker_5': 'So can you, if you wanted to, you could do the phase two.'",
        "'speaker_6': 'Now, if Director Woolridge has won that she's come.'",
        "'speaker_0': 'To do you. So so let me just get a sense of if we were to, to, uh, propose that, would we have a majority that I guess you want to see what the specific phasing is, but. Okay. I think so.'",
        "'speaker_0': 'So. So then yeah. Can you take a minute and tell us what that might look like or do you need.'",
        "'speaker_4': 'Absolutely. I'll tell you my proposal, then you can tweak it from there. So I'll start with the practice fee, 20, 20, 35, which is what was already proposed 21, 37 and 2238.'",
        "'speaker_0': 'About can you do that again? You were doing years, right?'",
        "'speaker_4': 'Sorry, 20, 20.'",
        "'speaker_0': '20, 2035.'",
        "'speaker_4': 'Which is what's.'",
        "'speaker_2': 'Proposed.'",
        "'speaker_0': '35 for games. Right.'",
        "'speaker_2': 'In general. Practice.'",
        "'speaker_0': 'Practice. Sorry. For a practice OC 2020 137.'",
        "'speaker_4': '2022, $38. Four games tournaments. 2020. $38. 2021 $40 and 2020 245. And again, I'm open to any suggestions.'",
        "'speaker_0': 'What do you think, counsel?'",
        "'speaker_2': 'Can I.'",
        "'speaker_0': 'Counselor? Rudy.'",
        "'speaker_7': 'So I thank you for for that quick math. So right now we're just thinking of 2020 and the practice is going to 35, right?'",
        "'speaker_4': 'So correct. I mean, today we would only be approving I assume you would only be approving 2020 fees. So but I would take this as guidance to next year's fees.'",
        "'speaker_7': 'Okay. And then your proposal is to sink the league in the tournament at the same number, correct. And do 38, 40, 45. I mean, I think that works for me. I just want to add one quick comment, and I think my colleague, Ms..'",
        "'speaker_7': 'Isabella talked about it as well. I mean, nobody here was against raising the fees. I think that even the Vipers agreed that there was some need to raise the fees and, you know, the 32, 35 and we did do the minimum wage funding through the budget.'",
        "'speaker_7': 'So the difference, there was no minimum wage impact of making the tournament fee 45 versus the practice 35. So to say that that difference was due to minimum wage I think is not quite accurate. So that's why I make sure that I clear the record on that one.'",
        "'speaker_0': 'Okay. Any other comments? Oh, the city attorney would like to comment. We're always happy to hear from you.'",
        "'speaker_6': 'The city the city manager and I have been talking a bit about this. So because the fees tonight, our agenda this is 2020 fees as Director Wooldridge have said, any fees beyond 2020 we would have to take as direction instead of adoption.'",
        "'speaker_8': 'As fees beyond 2020.'",
        "'speaker_0': 'Yes, always. Always good when our titles match, right. Yes. Understood. So we can we can vote on the 2020 fee schedule and you can take it as direction going forward to come back to us at, you know, in the future.'",
        "'speaker_0': 'But this would at least get you through what you what you need to get your fees set up so you can start doing your summer programing and all that.'",
        "'speaker_4': 'Yeah. And it gives a clear path for the community and sets expectations.'",
        "'speaker_2': 'Okay. Can I make a motion?'",
        "'speaker_0': 'Okay. Yes, I'll entertain a motion.'",
        "'speaker_7': 'So I'll move to approve the item. With the adjustments for 2020 that director Woolverton spelled.'",
        "'speaker_0': 'Out just for the gym fees. Correct.'",
        "'speaker_7': 'For the for the fees. And just remind us that we gave you direction for the future. If we balk at it next year.'",
        "'speaker_0': 'Let's get it seconded and then we'll have discussions. Okay. Seconded by Councilmember. Right.'",
        "'speaker_6': 'Where did you have it? Well, I'm not sure why we can't just do all the fees. Plus this.'",
        "'speaker_7': 'Yeah, we.'",
        "'speaker_2': 'Did. We did.'",
        "'speaker_6': 'Just.'",
        "'speaker_7': 'That with the exception of.'",
        "'speaker_2': 'The.'",
        "'speaker_7': 'Placement, whatever. Substitution.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Adjusting the 2022.'",
        "'speaker_0': 'All right. Very good. All right. We've had a motion. We have a second. All in favor. That sounds unanimous to me. Right? Okay. Thank you, everyone. Counsel, we are going to take an eight minute break. Can you be back at ten?'",
        "'speaker_0': 'Ten because we have a couple more items still to cover. But you doing really well and I appreciate it. Thank you. Are you ready for us? I missed you, city manager. You wanted to join the party?'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'We're. We're going to get started because it is 1030. Remind me how many items to work with.'",
        "'speaker_1': 'Two more regular items. And then two or four.'",
        "'speaker_0': 'Yeah, yeah, yeah. Okay. So now we are moving on to where are we?'",
        "'speaker_1': 'Madam Clerk, which is introduction of ordinance authorizing the city manager or his designee to execute an amendment to the lease with Pacific shops for the Tidelands property located along Clements Street between Aluminum Marina Drive and William Street, generally known as Alameda Marina.'",
        "'speaker_0': 'Right.'",
        "'speaker_9': 'City. Me Mayor and City Council member.'",
        "'speaker_0': 'Wait a minute. Yes.'",
        "'speaker_2': 'Councilor.'",
        "'speaker_5': 'Yes. As it was craft, since this item would require four votes, do you want to flip the two items? Since Councilmember Vela will be coming back.'",
        "'speaker_2': 'I think we.'",
        "'speaker_0': 'We could we could do that. She will be coming back, but she might want to hear the discussion. I'm sorry, Miss Makana. Sorry. Don't go far. All right. Yeah, that's a good point. All right, so then. Matt. Matt and clear?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Introduction of ordinance. Amending the municipal code by amending various provisions of section three, dash 61 transient occupancy tax of does Division nine, taxes of Article two, taxation of Chapter two, Finance and taxation clarifying and restating hosting platforms. Responsibility to collect and remit transient occupancy taxes.'"
    ],
    "Introduction of Ordinance Amending the Alameda Municipal Code by Amending Various Provisions of Section 3-61 (Transient Occupancy Tax) of Division IX (Taxes) of Article II (Taxation) of Chapter II (Finance and Taxation), Clarifying and Restating Hosting Platforms Responsibility to Collect and Remit Transient Occupancy Taxes.  (City Attorney 2310)": [
        "'speaker_0': 'Thank you. Okay. And who is presenting that? That's the city attorney, right?'",
        "'speaker_6': 'Mayor, I have a very short report for you this year.'",
        "'speaker_0': 'Favorite kind.'",
        "'speaker_6': 'Yes, Madam Mayor, members of the.'",
        "'speaker_0': 'Council this year.'",
        "'speaker_6': 'The this ordinance before you is a very limited surgical ordinance that essentially does one thing. It restates and reinforces existing law. It does not create new law. It makes clear that hosting platforms who host online transactions for short term rentals are required to remit transient occupancy taxes to the city just like any other operator of a hotel'",
        "'speaker_8': '. We believe that existing law.'",
        "'speaker_6': 'Already achieves this.'",
        "'speaker_8': 'Purpose.'",
        "'speaker_6': 'And the finance director already receives total taxes for short term rental transactions. However, in the excess of caution and in conversations with short term rental.'",
        "'speaker_5': 'Operators.'",
        "'speaker_6': 'And in light of our review of recent judicial decisions on short term rental local regulations, we're bringing this to you to reinforce, clarify and restate existing law.'",
        "'speaker_0': 'Thank you. Any questions on the staff report? For those who aren't eating. Yeah. And do we have any speakers on this?'",
        "'speaker_1': 'But we do have seven speakers on the other item, just so that will take some time on another item.'",
        "'speaker_0': 'Yeah. No, that's fine. Oh, Councilor. Vice Mayor.'",
        "'speaker_6': 'If we have no speakers, I'll move.'",
        "'speaker_0': 'Well, actually, I had a few things, too. I had a couple of things I wanted to say. Thank you for the staff report. I am looking at the email I sent to the city manager or the, uh, city attorney earlier today.'",
        "'speaker_0': 'So I am happy to note in this staff report you mentioned that the, and the whole issue of short term rentals, as they're called, these Airbnb vacation bay rentals will in the near future. Planning the Planning Department Building and transportation staff anticipate working on a forthcoming ordinance to more comprehensively regulate units offered up as short term rentals'",
        "'speaker_0': 'or home sharing. And this is important to me because of all the work I do at the local, regional and state level on our housing crisis and homelessness. And one of the concerns, well, that I have and I, I articulated to the city attorney is, first of all, I don't think we really have a good idea as'",
        "'speaker_0': 'we sit here today, how many residents in Alameda are used as short term rentals? It isn't the same as you'd know when you've got a hotel or a motel that that particular address should be remitting. They're transient occupancy taxes.'",
        "'speaker_0': 'So, you know, that's that's something that will be addressed. And then the so but but now I mean they do exist. They're here. And so we want to make sure that the city is collecting the revenue that they're due.'",
        "'speaker_0': 'But when we were a number of us for at the League of Californians these annual conference in Long Beach and maybe in September, October this year, and I know the city attorney, city manager and I attended an excellent session on short term rentals.'",
        "'speaker_0': 'And so I do want this to come back to us and to to even look at things that other cities are looking at, like limiting the number of those. There's rentals in the city, but that's not.'",
        "'speaker_2': 'What we're.'",
        "'speaker_0': 'We're here to do today.'",
        "'speaker_2': 'And so.'",
        "'speaker_0': 'Uh, yeah, with that, I think. Does anyone else want to comment?'",
        "'speaker_10': 'Councilmember Jason Well, great. Yeah, I'm very elated to see this being adopted. Back in 2015, I had brought forward a council referral on getting the TOTY from these entities at the time. My interpretation, my reading of the ordinance was that if you read the ordinance, it seems to capture Airbnbs, which is odd because this I don't even'",
        "'speaker_10': 'think the ordinance was written at a time when that was even it just, just the plain, simple interpretation of it. So to memorialize this officially, I think it's a long time coming. But so I certainly appreciate this. And I will second this.'",
        "'speaker_0': 'Did we did we have a guest? Was that a motion you made?'",
        "'speaker_10': 'No, I think yes. Yes.'",
        "'speaker_2': 'Okay. All right. Well, they're.'",
        "'speaker_0': 'Quick as ever. Okay. So we have had let's see, we what this is is a motion to adopt the proposed amendments. And so we've had a motion we've had a second all in favor of discussion. We have a.'",
        "'speaker_7': 'This is just this is not the end of this. This is just the beginning. Right? There's more to come.'",
        "'speaker_6': 'That's okay.'",
        "'speaker_0': 'To be continued. All right. All in favor, I. Okay. That passes unanimously. Four to nothing. Um, we now move on to our next item, and we'll just, you know, do our best. And I think our council colleague.'",
        "'speaker_2': 'Will be back.'"
    ],
    "Introduction of Ordinance Authorizing the City Manager or His Designee to Execute an Amendment to the Lease with Pacific Shops, Inc. for the Tidelands Property Located along Clement Street between Alameda Marina Drive and Willow Street, Generally Known as Alameda Marina.  (Community Development 216)": [
        "'speaker_1': 'Okay, this one is six. The introduction of ordinance authorizing the city manager or designee to execute an amendment to the lease with Pacific shops for the Tidelands property located along Clement Street between Alameda Marine Drive and Willow Street, generally known as Alameda Marina.'",
        "'speaker_0': 'Deja vu all over again.'",
        "'speaker_2': 'I got a.'",
        "'speaker_9': 'Groundhog's.'",
        "'speaker_2': 'Day. Yeah, right.'",
        "'speaker_9': 'Good evening, mayor and city council members. I'm Nanette Mchunu in the Community Development Department. So in May of 2012, the city entered into a lease with Pacific.'",
        "'speaker_2': 'Shops.'",
        "'speaker_9': 'And the structure of the lease was for 66 years total. The first portion was a 25 year option and with three conditions precedent. One satisfied the the tenant would be able to exercise its option for 41 years and thus have the total 66 year lease.'",
        "'speaker_9': 'The three conditions precedent of the three that applicant has satisfied. Two. The third one has not been satisfied from. No. No. Not because of them, but because of extraneous circumstances with outside agencies. The tenant and the lease provides that if they do not meet the the the conditions precedent that the lease would automatically terminate.'",
        "'speaker_9': 'Instead, the tenant has asked that we would give them an extension to meet as a third condition. And and we have tonight the staff is recommending that you do give them a one year option, an extension with a six month extension administratively offered.'",
        "'speaker_9': 'If they if they're still holed up from the outside agencies, if the city manager could offer them for a total of an 18 month extension. And and then if if in that 18 months, they do not meet those the three conditions or that third condition, the lease again could automatically terminate in exchange for the extension.'",
        "'speaker_9': 'The amendment to the lease staff has negotiated a few things. One is related to the Boatyard Project and there has been a lot of work done on the boatyard and RFP and interviews with with boatyard operators and under the direction of the council.'",
        "'speaker_9': 'We've said try again, try again, harder. And working with our planning department, there will be another RFP process with a third party managing it and try it with a goal of getting a great boatyard operator in place. So that was a negotiated as and in exchange for the the extension of the amendment.'",
        "'speaker_9': 'The other thing that we negotiated was related to compliance with our Climate Action and resiliency plan. We are requiring the tenant to to to offer charging stations in in the public lot. And in addition, they will not have gas gas appliances in in their in their residences.'",
        "'speaker_9': 'There will be some ancillary gas activities or options related in the residential, but it won't be inside of the units. We think that this is a good exchange for the extension, this 18 month extension, and we hope that you'll consider it tonight.'",
        "'speaker_9': 'The one thing that I would like to call your attention to is there the agreement and the staff report and audience were not in agreement, and we noticed it this morning. And so the agreement refers to a two year extension and council gave staff the direction for one year with that six month option.'",
        "'speaker_9': 'It has been we've edited it and there are copies outside for people. The second reading will include the revised version, but the version will reflect what the staff report is recommending.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'So just read us the correct language.'",
        "'speaker_2': 'Sure.'",
        "'speaker_9': 'It's okay. It's in section 23.4 is hereby added to the lease as follows Land Use Entitlements Tenant hereby covenants to obtain all other permits, approvals and land use entitlements required by all governmental agencies exercising jurisdiction over the development project collectively regulatory permits on or before the end of this year.'",
        "'speaker_9': 'Nine. Formally it said ten for avoidance of for avoidance of doubt and end of leave. Year nine is December 31st, 2020, the regulatory permits deadline. If tenant fails to obtain the regulatory permits by the end of year lease year nine, subject to any extension of tenants performance due to a period of delay caused by force majeure event'",
        "'speaker_9': 'as provided in section 2521. Landlord should have the right to revoke tenant's option notice by providing written notice to the tenant, and this lease shall expire on the expiration of the initial term. Notwithstanding the foregoing, tenant may request in writing from landlord a six month extension of the regulatory permits deadline, which may be granted by landlord in'",
        "'speaker_9': 'the sole discretion of the city manager.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_2': 'Sure.'",
        "'speaker_0': 'Okay. So, counsel, any questions about the staff report?'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Question Councilmember de SAC.'",
        "'speaker_10': 'Is it correct that at some point in time, Bishop in York was interested as being the operator of that ship area, but they just couldn't come to reach some kind of a negotiated discussion, negotiation with Pacific shops.'",
        "'speaker_9': 'So Bishop China bought us a portion of the Swenson's operations, which included the boatyard, but they decided to to combine the boatyard operations with their Richmond boatyard because they felt that the space at the Swenson's location was small and not viable for what they wanted to do.'",
        "'speaker_9': 'And and I can provide you with a letter from Allen Cameron where he talks about the fact that there's diminishing shipyards and that there was it was a better option for them to combine with their with their operations in Richmond.'",
        "'speaker_9': 'So that I mean, I had seen your question earlier from later today. But that's exactly that's what happened. So they should have not considered it, but instead they combined it and they moved some of the operations of suspensions to their main street operations.'",
        "'speaker_9': 'But the the sentiment of the correspondence from patient and that was that there is a diminishing number of boatyards in the in the region. And it's better to have a larger space because there's a lot of environmental concerns with boatyards and things.'",
        "'speaker_9': 'And it could be better served in a larger a larger space with more units or more occupants within. And so that was their decision.'",
        "'speaker_10': 'Okay. So what was conveyed to me was that there was some difficulty in in the discussions. Negotiations, I don't know what between bishop in yachts and Pacific Marine's and as a result that's why bay shipping out left for Richmond.'",
        "'speaker_10': 'So it was more they were discouraged away. So what?'",
        "'speaker_9': 'So what I can tell you is this I actually wasn't too much involved in the whole boatyard discussion. However, when Alan Cameron was writing the correspondence to the city, he actually called me and he said, You know, we really feel like it's better that we do this set up where we move our operations to Richmond.'",
        "'speaker_9': 'But I don't want to cause any waves with anybody. What do you think I should do? And I recommended it. He tell his truth to the council because we're not experts in boatyard operations. So just tell us what the real story is.'",
        "'speaker_9': 'And so that is what his email and correspondence says, is that, you know, they thought about it. They thought it was best to combine their operations with their Richmond operations. I actually have a copy of that correspondence with me right now, if you'd like to see it.'",
        "'speaker_9': 'I think I have five so I can give it to the council to look at. But that's what happened.'",
        "'speaker_10': 'And was that correspondence sent this afternoon?'",
        "'speaker_9': 'No, no. It was a long time ago. It was. And it was real time when that was happening. Okay.'",
        "'speaker_0': 'Thank you. Any other questions for Miss Mchunu before we hear speakers? Councilor Rody, just briefly.'",
        "'speaker_7': 'Thank you, Madam Mayor. So we're kind of doing a do over on the, um, on the on the boatyard, right? As I understand.'",
        "'speaker_9': 'It, we're going to do a do over and hopefully we'll get an operator available. Operator. If they, if that's not possible, then they're going to look to the, the, the plan the and go back to the planning board, I believe, and figure out what their other options could be for the use of that area.'",
        "'speaker_7': 'But our planning staff and our our planning department will be working on trying to. So hopefully the effort will be stronger than the effort that was last year.'",
        "'speaker_5': 'I would.'",
        "'speaker_2': 'I would think and I know.'",
        "'speaker_7': 'Your offense, the developer.'",
        "'speaker_9': 'Right. I believe that the staff we. We're involved a little bit in that process. I attended a focus a little a couple of meetings to talk about boatyards, because we do have experience of having a boatyard as a tenant before you all remember Nelson Marine, which cost the city over $1,000,000 to clean up.'",
        "'speaker_9': 'And so we don't want that to happen to us again. And so we were we we talked a lot about that.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_0': 'Um. Did I see your hand? No optical illusions. Okay, so then.'",
        "'speaker_2': 'What?'",
        "'speaker_0': 'I have another question from Councilmember De. So why don't you give Ms.. Marcano just a moment to get back to the podium?'",
        "'speaker_10': 'Now there's. From the outset, there's always been community concerns of preserving maritime industry in the area. And I think the way that this whole process has unfolded, I think there has been an effort by the owners to do just that.'",
        "'speaker_10': 'But at the same time, there's some concern that from what I'm hearing and my talks with residents, there are some concerns that that we still might be at risk of losing maritime businesses, especially if two things occur or don't occur.'",
        "'speaker_10': 'One is that we make a concerted effort, particularly with regard to Building 19, I think, where Dore was making a concerted effort to attract some of the maritime businesses that are there right now but located elsewhere and potentially have them locate relocate to Building 19.'",
        "'speaker_10': 'So the thought that I want to kind of raise is, you know, what what consideration has been given to prioritizing Building 19 for commercial uses generally, but prioritizing the redevelopment of that ahead of of other parts because there are certainly some parts of the of this project where, you know, they were apartments want to be built, but'",
        "'speaker_10': 'there's also building 19. So what consideration has been given to prioritizing, you know, commercial development? Ahead of you residential development.'",
        "'speaker_9': 'So I'm just I'm going to answer part of this, but then I might turn I might turn over to the planning director, Andrew Thomas, a little bit of this. But what I can assure you that if a property is in our tidelands, it must be a maritime use.'",
        "'speaker_9': 'And so you always have that guarantee that on the land that is ours, you will have a maritime use. But as you.'",
        "'speaker_10': 'Know, the commercial.'",
        "'speaker_2': 'Will have to have a.'",
        "'speaker_9': 'To be maritime first. It's Highland. So, I mean, you could do a short term, less than five year nonconforming use. But that's I mean, you have to I mean, that has to be maritime use. So you will be guaranteed that.'",
        "'speaker_9': 'So related to the the the parcels that are not ours that are on feet title of the of the tenant. Andrew Thomas Guinness.'",
        "'speaker_0': 'Wanted to make it worth your while to be here.'",
        "'speaker_8': 'Oh, it's been fascinating.'",
        "'speaker_2': 'Oh, I hope. Yeah.'",
        "'speaker_8': 'The the entire commercial core, which includes Building 19, the entire commercial area on the land portion is in phase one of the project and the master plan has phasing requirements. You can't move to phase two to finish phase one.'",
        "'speaker_8': 'So that was our way back a year ago when we got down to the master plan to make sure that the commercial portion of the project got built early. I think right now and for the next couple of years is going to be the toughest time for the commercial because from a development perspective, you know, they're putting'",
        "'speaker_8': 'in all new infrastructure for not just the housing, but also for the commercial core. So there's this going to be this tough transition period where existing businesses in older buildings are going to have to move out. The good news is we're so that they can take those buildings down, put in new infrastructure.'",
        "'speaker_8': 'The good news is the main building, Building 19 is in the commercial core. The commercial core is as part of phase one and approximately half of Building 19 is in the Tidelands property that that that was talking about.'",
        "'speaker_8': 'And a good portion of the commercial core as well is in the, you know, overlaps the Tidelands property. So we think there is a future for maritime uses at Alameda Marina. Obviously, the 530 boat slips are not going anywhere.'",
        "'speaker_8': 'I think we all believe there will always be some boat services, you know, rigging services, navigation services, people around who can help work on your boat. The key issue with the boatyard, that is still the question that's still sort of out for discussion.'",
        "'speaker_8': 'Is there is there an operator who wants to come in and who can run a profitable business for the part of the work that the on your boat that has to occur on land, the scraping of the hull, the repainting, that also is the type of work that generates the hazardous materials and a lot of the regulatory'",
        "'speaker_8': 'hurdles that any future operator is going to have to to jump over. I think in terms of this this next second try at the RFP, the RFQ, the first one was not successful is the introduction of this third party to help us evaluate what is really going on out there in the market.'",
        "'speaker_8': 'Why did was the first effort so unsuccessful? And what can we do or adjust in the second effort to try to be successful? And if we're not, we come back to the council at the end and we explain to the council, here's why we believe we are still unsuccessful and here's what we think is the path forward'",
        "'speaker_8': 'that does it. And if we're unsuccessful on the boatyard, it doesn't mean the commercial core goes away. The land for commercial that's devoted to commercial for maritime purposes stays. The question is, if it's not a boat yard, what?'",
        "'speaker_8': 'Where, where does Pacific shops think we should go? You know where it is, where the city staff think we should go from here.'",
        "'speaker_0': 'Okay. Thanks. Any further questions before we go to public comment? Let's go to Pepper Summit. And how many do we have?'",
        "'speaker_1': 'We have seven.'",
        "'speaker_0': 'Okay, so with seven speakers, you each get 2 minutes. Okay. Listen for your name and come on up.'",
        "'speaker_1': 'Dorothy Freeman, then Chris Nicholas, then Nancy Hurd.'",
        "'speaker_2': 'Good. And good evening. I'm Dorothy Freeman, a member of SOAR. And this is what you did to my speech.'",
        "'speaker_0': 'When the city of Alameda placed the Alameda Marina.'",
        "'speaker_2': 'On the.'",
        "'speaker_0': 'Housing element in 2012.'",
        "'speaker_2': 'It did not envision a loss of the maritime industry to Alameda and the entire.'",
        "'speaker_0': 'Bay Area boating community, both recreation.'",
        "'speaker_2': 'And commercial. Several of the main businesses are already gone.'",
        "'speaker_0': 'Presently, many of the remaining.'",
        "'speaker_2': 'Businesses are being forced into a smaller, inconvenient space where.'",
        "'speaker_0': 'They thought they would be able to move into a renovated building. 19. Several of the remaining.'",
        "'speaker_2': 'Businesses are choosing not to.'",
        "'speaker_0': 'Have their business.'",
        "'speaker_2': 'Disrupted by small spaces.'",
        "'speaker_0': 'Two Relocations and a future future at Alameda Marina.'",
        "'speaker_2': 'That is not very predictive.'",
        "'speaker_0': 'So many of them are now leasing leaving town. Another issue with the marina.'",
        "'speaker_2': 'Development is.'",
        "'speaker_0': 'The efforts to retain the operator for the.'",
        "'speaker_2': 'Very much needed boatyard. So understands that two prospective boatyard operators have shown interest in managing a boatyard at the marina. Unfortunately, their interact interactions with Pacific shops was very discouraging. Bay West and Pacific Shops.'",
        "'speaker_0': 'Has been reminded evidently.'",
        "'speaker_2': 'About how important the boatyard return of a boatyard to the city of Alameda is.'",
        "'speaker_0': 'To the boating community and to the Greater Bay Area.'",
        "'speaker_2': 'I'm pleased to hear that there is increased effort for the boatyard. Sau is also asking for the City Council to make maritime tenant retention a priority by completing the commercial space at the marina so the remaining businesses can move into more permanent business locations.'",
        "'speaker_2': 'So understands the time element for the start of construction and what it means for the bulkhead improvements. But Alameda Maritime Business is also an important asset to Alameda. What's going on.'",
        "'speaker_0': 'In the next speaker is.'",
        "'speaker_1': 'Chris Nicholas and Nancy heard.'",
        "'speaker_0': 'Mr. Nicholas and then misheard.'",
        "'speaker_12': 'Tell me when.'",
        "'speaker_6': 'Hi, my name is Chris Nicholas. I am Commodore at Island Yacht Club.'",
        "'speaker_8': 'I've said it before and I'll.'",
        "'speaker_6': 'Say it again. The guy, I'm a 33 year resident of Alameda, the guy who taught me to sail.'",
        "'speaker_8': 'Second wave in Normandy.'",
        "'speaker_6': 'Said An honest job in sailing after work is what we won the war for. We're going to have 500 we have 500 slips there. Island Yacht Club is going to be celebrating its 50th anniversary there. And we've been running races there as an all volunteer organization since our inception.'",
        "'speaker_8': 'It's more than just a sterile.'",
        "'speaker_6': 'Scenic environment. It's a integral part of the fabric of this community going back to the beginning of recreational boating. When you see all the sailboats out there as part.'",
        "'speaker_8': 'Of the picture, that's us and our community and. Our challenge is we are in building 14, which, as per the Historical Board has been deemed unsalvageable.'",
        "'speaker_6': 'So our challenge and we are in dialog with Marine is to find a workable transition plan.'",
        "'speaker_8': 'We understand the realities of. Real estate in the Bay Area. But Alameda marina has will have a unique asset in the boat hoist and.'",
        "'speaker_6': 'The small boat program.'",
        "'speaker_8': 'Which is a result which was not in the original plan. So as of asset that has come through these dialogs. What we're asking you is to ensure that there is a workable.'",
        "'speaker_6': 'Transition plan and.'",
        "'speaker_8': 'No gaps so that we will continue into the future.'",
        "'speaker_0': 'Perfect timing. Thank you. I Nancy heard.'",
        "'speaker_2': 'Good evening. I'm Nancy Hurd and I'm representing save Alameda is working waterfront or. I was pleased to hear that there is some movement and having a third party come in to do the RFP for for the boatyard. I'm going to sort of throw out the mike speech that he's going to say and try and speak.'",
        "'speaker_2': 'My main focus right now is then saving the maritime businesses that are there now when and I think the way to do that is that when they need to move a business because they need to to do whatever they need to do to to go in and build what they need to build.'",
        "'speaker_2': 'They cannot be moving these businesses into unworkable spaces and telling them that they can't that they aren't going to have these spaces for potentially a couple months. These these businesses need to have the assurance that they're going to be there for, you know, long term and they're going to have the space that they need.'",
        "'speaker_2': 'So I would really like to see Bay Building 19 get developed sooner rather than later, sooner than the apartment building, even though they're both in phase one. I'd like to see Building Number 19 done before the apartment building so that the businesses can stay there.'",
        "'speaker_2': 'We are in the process of of potentially losing some of these businesses. And once they lose the island and moved to someplace like Vallejo or Mer Islands, we're not going to see them again. And it's not going to be that easy to get other businesses to move in there.'",
        "'speaker_2': 'So I really want everybody to be thinking in terms of say, you know, keeping retaining our maritime businesses here in Alameda Marina. And that means having space and and preferably the permanent space, because this is very disruptive to a business to have to move two or three times because of the at the convenience of the developer.'",
        "'speaker_2': 'That needs to be more to the convenience of.'",
        "'speaker_0': 'The next company.'",
        "'speaker_1': 'Janet Franco, then Jamie Camacho, then Paul Mueller.'",
        "'speaker_0': 'Or any of the speakers. We've driven them away. Okay.'",
        "'speaker_1': 'So Jamie.'",
        "'speaker_0': 'And the next one is.'",
        "'speaker_1': 'Paul Miller. Okay.'",
        "'speaker_8': 'Hi. Hello. My name is Jaime Camacho. I am the vice commander of Island Yacht Club. I'm here to remind you that we are a little bit scared of our future. It's under threat. We serve the community at large, including the Marine community.'",
        "'speaker_6': 'We have been.'",
        "'speaker_8': 'Sponsoring a Sea Scout troop, Sea Fox, for 28 years now. That. Ah. We're very proud of them. They're considered the ranked second best in the nation. And six months ago, they saved a drowning man in the middle of the bay.'",
        "'speaker_8': 'They received that training at Building 14 OC. We serve the community and we need your protection for our continuation there. And we need to, of course, talk with the developers. But I am concerned and I'm worried and I do have a mandate of my membership for the continuation of Island Yacht Club.'",
        "'speaker_8': 'So I would appreciate the consideration of this board at sea to secure the businesses and marine operations that still exist at the marina to continue and not be under threat like they are currently. It's it's tough. It's tough over there.'",
        "'speaker_8': 'It's hurting the club because our pool for people to join the club has been just hammered. It's empty. Okay. How can your club survive if we don't have a community there? If we don't have boats, if we don't have activities, it's basically pretty well closed down right now.'",
        "'speaker_8': 'And it's hurting our ability to bring members into the club to to make the club strong, to continue. So we're kind of weak right now because of this. So this development is seriously affecting us. And let alone that our club 14, our building is going to go.'",
        "'speaker_6': 'Be torn down.'",
        "'speaker_8': 'So we need a future. Help us. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Parties don't want to speak. So the next one is Trevor Yamamoto and then Sean Murphy.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Mr. Yamamoto.'",
        "'speaker_5': 'Good evening. My name is Trevor Yamamoto. I'm also a member of Island Yacht Club. I've been the Treasurer there for several years now and everybody who's spoken so far from the city planner on to the members of the community have said basically the same thing, that from a business perspective, the uncertainty as well as the the need'",
        "'speaker_5': 'for a workable transition plan to establish continuity for the businesses, the maritime businesses that have been there, like in our case for 50 years, can go on. We need to have something workable because we understand the exigencies of business that permits get delayed, financing gets delayed.'",
        "'speaker_5': 'That's just part of development and development will go on. However, the businesses there need the assurances from with the working with the developer, working with the council here that we can have something that's workable, not just conceptual, a workable plan going forward to ensure that the businesses can survive there during the transition.'",
        "'speaker_5': 'If it involves a move that such a move is practical, it's economically feasible that the businesses remain viable. So that's essentially what I think what the speakers here have been talking about and what we are asking for tonight is that rather than just conceptually, that we have a clear plan that establishes a workable continuity and workable transition'",
        "'speaker_5': 'for the maritime businesses that I think we're an asset to the community of Alameda as well as the Greater Bay Area, especially in terms of both in terms of the business, the yacht club, the boatyard, etc.. So that's why we asked you for that tonight.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. And do we have a.'",
        "'speaker_1': 'Murphy.'",
        "'speaker_0': 'Question? Murphy. Okay.'",
        "'speaker_8': 'Thank you. Good evening, Madam Mayor. Fellow City Council member Sean Murphy, Aluminum Marine Civic Shops. So we're excited to have this important tightly and lease item in front of you tonight. Just a brief recap. In September, we got units approval from a third meeting from the historic advisory board, which is that commercial maritime core.'",
        "'speaker_8': 'We've been working very diligently on every aspect of this project, and last month we had, you know, approval on the first residential project, 360 units from planning board. So there's we've been working on this project for essentially eight years.'",
        "'speaker_8': 'We're very committed to this boatyard, and we look forward to working with the city and third party EPS to push that boatyard, RFQ, through again so that we can find a qualified operator. Electrification, absolutely. A big component of the Karp plan is implemented with this master plan and then the regulatory approvals.'",
        "'speaker_8': 'We've been working diligently since last summer with all of the agencies, Army Corps Bccdc, and we're making great progress there. And then really the most important component here is the tidal lease, because it allows for us to finance this project.'",
        "'speaker_8': 'This project, the the real focus of this project is our sea level rise that we must deal with. And there are failing sea wall. And it's with this lease extension that allows us to amortize that, to then pay for this massive infrastructure costs.'",
        "'speaker_8': 'And so this project is an important one for us. It's an important one for the city as our partner, because it really addresses a number of issues. Yes. The critical housing shortage. Yes. The job creation that we have for that maritime core.'",
        "'speaker_0': 'Okay. And this is the applicant, is it? Well, actually, I am. I might call you back because I have a few questions and I am going to start first. Thank you, everybody, Miss Mercado, for your presentation. There you are.'",
        "'speaker_0': 'And all the speakers. Um, I would like to know and staff Mr. Thomas or Ms.. Mercado, if you can answer this. Otherwise I'll look to the Pacific Marina folks. But, um, so we've heard some concerns about the existing maritime businesses that are at the Alameda Marina now.'",
        "'speaker_0': 'We've heard from the Island Yacht Club concerned about their future. I'm aware of that Sea Scout troop. I was just helping with scouting for food this past Saturday, and they came in to the the church. That was one of the collection points.'",
        "'speaker_0': 'And somebody said, hey, that says he's got a group and there's some of the fellows who are on that rescue were there. So that was kind of cool to see them. But anyway, what, what, if anything, is is the city doing can the city do to see that these existing maritime uses have this?'",
        "'speaker_0': 'I think it was I think Mr. Yamamoto phrased it quite well. He said they want a clear plan that establishes a workable continuity and a workable transition. Anybody want to take a stab at that.'",
        "'speaker_8': 'Under the terms? I mean, this is a project, this redevelopment project, two thirds of the land is privately owned by Pacific shops. The Tidelands is obviously leased to them. There's no provisions in that lease or the master plan for their property that basically inserts the city into their leasing decisions.'",
        "'speaker_8': 'They're obviously limited by the Tidelands lease in terms of the types of businesses, the maritime issues we were talking about with Councilmember Desai, but we are not involved in their conversations with their tenants.'",
        "'speaker_0': 'Okay. So then I will ask Mr. Murphy to come back. Please. I'll give you a summary. So I understand from Mr. Thomas that the city doesn't have a role in. In relocating businesses or finding new locations. But, um, can you tell us what you are doing to make the transition smooth?'",
        "'speaker_0': 'If you're doing anything to make the transition smooth for folks who are out there now, especially the maritime uses? Because we very much I think we understand the idea that this is the maritime based side. And so we want maritime businesses out there.'",
        "'speaker_0': 'But what what are you doing for the folks say that we've heard from tonight.'",
        "'speaker_8': 'Happy to discuss. So for instance in that first phase, really executing on the city council's approved master plan, it does focus on the maritime core and then the housing component. And so for the first phase of tenants that were maritime, those are accommodated in the balance of the property in phase two.'",
        "'speaker_8': 'And so we have transitioned those tenants over to the eastern part of the property with this project. Building 19 is a is a it's a great building that sits in the center. We need to be reminding ourselves that a project like this has to deal with sea level rise.'",
        "'speaker_8': 'We have to bring the whole portion of that project three and a half feet up in sea level rise. And so there is absolutely a transition with the renovation of those buildings. We're making the maritime core a priority.'",
        "'speaker_8': 'As I mentioned, three separate historic advisory boards, which then in September got unanimous approval, which allows us to then start working with staff and the building department to start implementing the renovations of those buildings to the Secretary of Interior Standard, because three of them, and principally Building 19, is a historic structure.'",
        "'speaker_8': 'And so there's absolutely a transition for existing maritime tenancy. Uh, and, but there, you know, these are big projects to take on and three and a half feet of sea level rise will not be able to happen overnight.'",
        "'speaker_8': 'And so the seawall, construction, all of the agency work that we've been doing it, it does take a tremendous amount of work and capital. So.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Um, okay. So you're you're saying I think if I understand you correctly, that you are moving some of these tenants to phase two phase two areas in the eastern part of the project. But then you're tackling this core that includes 19 and that's going to take some time and a lot of money.'",
        "'speaker_8': 'It is. I mean, one of our major elements beyond the sea level rise is the environmental remediation. We have a very dirty site related to the boat repair. We want to get a new clean boat repair operator. It's part of this, you know, this rescue effort, 2.0.'",
        "'speaker_8': 'But we must remediate from prior actions. And so we cannot fill the site until we clean the site. And there's absolutely activities that we're embarking on with the county, with here the city to start remediating those 50 years of.'",
        "'speaker_8': 'You know, environmental contamination. And frankly, a lot of it is on the city property. And it's it's important that we understand, you know, the complications and timeline that are associated with that history. And so we're embarking on it right now.'",
        "'speaker_0': 'Okay. Thank you for the questions. Councilmember De.'",
        "'speaker_10': 'Thanks for answering questions. So a comment was raised that possibly. Building 19 and whatever uses happened there. While in phase one comment was raised by a resident having that prioritized above the apartment that were to occur were the family that to occur in phase one or as a demonstration of that, you're aggressively going to, you know, create'",
        "'speaker_10': 'the space to save the businesses, some of the businesses that are being moved to the eastern side. What was your response to that? If we can prioritize building 19.'",
        "'speaker_0': 'I'm sure you'll excuse the interruption. I have a housekeeping item. It is. I don't know how I got to be this late, but it is 1057 and we have to make a motion and pass. It was for affirmative votes to consider remaining items past 11 p.m..'",
        "'speaker_0': 'So we have two council referrals after item one is on the code enforcement. We have three speakers and the other is on diaper changing stations. So Council, what's your pleasure?'",
        "'speaker_6': 'I move that we extend the meeting to 1130. I think those two items go pretty fast.'",
        "'speaker_0': 'Okay. What do you think we have second.'",
        "'speaker_3': 'I'll second that.'",
        "'speaker_0': 'Okay. We have a motion to extend the meeting to 1130 and and presumably to fit in as to council referrals. So moved and seconded any discussion.'",
        "'speaker_7': 'Councilmember Odie if we're at 1125 and we're not there yet, can we extend it longer?'",
        "'speaker_0': 'We'll cross that bridge him to.'",
        "'speaker_2': 'Make sure we're an island.'",
        "'speaker_3': 'Yes, we can.'",
        "'speaker_7': 'Are we allowed to consider that?'",
        "'speaker_0': 'Yeah, we can consider it even. Yeah. Okay. It's been moved. It's been seconded out in favor. I, I was there about five guys. Yeah, look at that. Okay, please continue. Strive for Delta.'",
        "'speaker_8': 'Member de sog to try and be concise because you still have action here. And so since ah you announced approval, the master plan with the city council, which we took place in in July of last year, our first effort was that maritime core in in so much as that we went to historic advisory board three times and'",
        "'speaker_8': 'just in September we got units approval for those buildings as proposed by our architecture team. That was the first approval that we sought. And then last month, yes, the apartments absolutely. The apartments really are the financial mechanism to pay for this 20 plus million dollars seawall.'",
        "'speaker_8': 'But the apartments were our second unit has approval that we achieved last month. So the maritime core is it is a critical focus for us and I think that we have a track record of going through these approvals with that focus.'",
        "'speaker_10': 'So last question. Would you have a problem if we prioritized pulling building permits or whatever for Building 19 when it gets all finished, that ahead of allowing for building permits being pulled for the residential.'",
        "'speaker_8': 'I yeah.'",
        "'speaker_0': 'I know what I'm going to choose to ask the city attorney to offer some advice or opinion or anything we should be mindful of at this point.'",
        "'speaker_6': 'Obviously, we want to stay on the agenda items that's before you, members of the council. And so to the extent possible, the matter before you is the lease extension. So I would advise that we as much as possible, stay on that point.'",
        "'speaker_10': 'We'll take in.'",
        "'speaker_0': 'Okay. Was that your last question? Okay. Um, does anyone else want to ask Mr. Murphy? Anything?'",
        "'speaker_10': 'Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Okay. Okay, counsel. So, um. Right, we've. We've heard this side and we've heard our speakers. We have a decision to make. Who wants to lead the discussion or make a motion?'",
        "'speaker_6': 'I'm happy to do both.'",
        "'speaker_0': 'We multitask. Take it.'",
        "'speaker_6': 'Away. Yeah. So I just want to. I want to thank a members of SA who met with me. I did follow up on the questions. I got a lot of you know, but the staff report clearly laid out that we have we have an RFP.'",
        "'speaker_6': 'So I think those concerns around the in a process to to make it as effective as is humanly possible which I appreciate staff working really diligently on that. So that's good. And I do believe we have a transition plan that is going to work to the best possible.'",
        "'speaker_6': 'We have proved a master plan that to me that the key thing is here. It saves the city $20 million that we don't have to come up with on the seawall and whatnot. I don't want to get into dickering around trying to renegotiate the master plan in the phase in at this point in time, we need to'",
        "'speaker_6': 'move this thing forward. My hope is that that the Pacific shops have heard from us for now, almost two years, that the Maritime Corps is very important to us and our our local community organizations are also very important to us.'",
        "'speaker_6': 'And I have strong confidence that we will move forward with that and in great haste. I'm not moving forward. This lease stops the entire thing. It stops the Maritime Corps. It does not save anybody anything. It just causes risk to the city.'",
        "'speaker_6': 'So with that, I would like to move that. We approved the staff recommendation as written.'",
        "'speaker_0': 'Let's get a second. Think we can have discussions.'",
        "'speaker_9': 'Going to.'",
        "'speaker_0': 'Second Councilmember Vela and Councilmember Vela.'",
        "'speaker_3': 'So I and I'm going to be supporting this and I do want to say a few things. First, there is a substantial benefit to the city and it's directly related to our goals, related to addressing climate change and sea level rise, which is a priority of this Council.'",
        "'speaker_3': 'I am not interested in increasing any more costs to that than are necessary because I think the cost is already substantial. I would also add that we have also stated that another priority of this council is housing. And so I am very troubled to hear that, you know, I don't want to lose sight of that.'",
        "'speaker_3': 'And I think that putting forward, you know, subsidizing for profit businesses when there's a, you know, a plan in place to try to work with them while also addressing our need for that seawall and getting the housing that we need.'",
        "'speaker_3': 'I think that's really important. And frankly, I just I don't like the direction that. I want to make sure that that's not a direction that people think we're open to because.'",
        "'speaker_0': 'Not before.'",
        "'speaker_3': 'It's not before us today. And I think it also undermines what our priorities are as a council. You know, we just heard an agenda item where we were talking about the number of our meetings when we were talking about fees.'",
        "'speaker_3': 'And one of the things, the number of meetings that were actually using the facility and I think the scouting scouting program is great. But I also think that when we're looking at some of these things, we're looking at how many Alameda those are going to be impacted and and that sort of thing.'",
        "'speaker_3': 'And and what is the cost to them? And I do not want to increase the cost of housing any further. I appreciate the electrification and all of that. Again, we're getting a lot of things that are in line with our goals, and I think we need to be supportive of that.'",
        "'speaker_0': 'Thank you. Any other comments, Councilmember?'",
        "'speaker_7': 'Thank you. Just real brief. I will associate like with the comments made by my two colleagues. I mean, we get a second bite at the apple at the boatyard, so that's good. Gives us a chance. And, you know, whatever complaints somebody may had about the last process, you know, we're having a third party.'",
        "'speaker_7': 'We're having our staff. So I'm hopeful that we'll have a more positive outcome. You know, electrification, that's kind of exciting, too, because now for the first time since we passed our our climate action plan, we have an opportunity to implement it.'",
        "'speaker_7': 'So, yeah, you know, I was catching up with Madeleine from the chamber today and you know, she mentioned they had a maritime some type of forum or event where they were talking about attracting maritime business. So I think that remains a priority of of this council of of our staff, of our chamber.'",
        "'speaker_7': 'I mean, if there's some issue I mean, I'm not going to I can't really dictate from up here. But if there's some concerns from some tenants that it's not a workable transition plan, I would encourage everyone to keep talking and see if you can figure out something that that meets that definition for those that are impacted.'",
        "'speaker_7': 'But I mean, I'm ready to to vote in favor of this at this point.'",
        "'speaker_0': 'Mr.. JASON So did you want to add this?'",
        "'speaker_10': 'Well, thank you very much. We're here tonight because, uh, Pacific shops would like to get a one year extension in order to make sure they get its approvals as well as they would like to exercise the, the 41 year trigger.'",
        "'speaker_10': 'So. But in pursuing these items, they had not satisfactorily fulfilled at least one of the three items. So to me, that gives me an an opportunity, frankly, to pursue the concerns raised that I'm hearing from constituents in my discussions with constituents.'",
        "'speaker_10': 'I know we all represent different constituents, which is the way that each and each of us on city council represent our different truth. And but we do our best to to speak our truth. And what I'm seeing, frankly, when I'm hearing from the residents, even tonight, is that the effort to save the maritime businesses needs to be'",
        "'speaker_10': '. Better than what we're seeing. And so I'm just not seeing that. And when I hear that we have to go to a second RFP and I'm glad that we're going to a second half, but better than not going not doing that.'",
        "'speaker_10': 'But it kind of makes you wonder, you know, why was the first one so bad? There's something in the air, I believe, that is being discouraging of maritime businesses, comments provided notwithstanding. And so what I'm seeking to do is basically pursue the second bullet points on the alternatives section, which is basically the second bullet points was to'",
        "'speaker_10': 'direct staff to renegotiate specific lease terms.'",
        "'speaker_0': 'So. Mr. Day, so I appreciate your comments. It's 1107 and we have a motion in a second.'",
        "'speaker_10': 'But it.'",
        "'speaker_0': 'Is, of course.'",
        "'speaker_10': 'So that's what I'm trying to pursue. And I obviously I don't have enough votes for that tonight, but I would say it will be a sad day, though, if we begin to lose a lot of the maritime businesses, not just the people who showed up tonight, but some of the people who are there operating right now.'",
        "'speaker_10': 'It'd be a sad day. I mean, because these are the businesses that help give the city of Alameda an island, its identity. I mean, at the end of the day, let's not forget that, you know, our flag, the symbol of the flag, is an anchor, you know, obviously reflective of of of our maritime tradition and history.'",
        "'speaker_10': 'And honestly, I just don't see I see a rush to build more housing. And even there, you know, I mean, the housing is needed, but sometimes there's just too much housing. And so I think, you know, we need to give a better effort.'",
        "'speaker_10': 'And I hope to have seen a better effort at saving the maritime industry, which I don't see tonight.'",
        "'speaker_0': 'Thank you, Mr. de seismic. My comments brief. Well, as far as housing, I don't think we can build it fast enough. And there are a lot of things that keep me up at night. I don't like the thought of losing maritime businesses, but there are also it's always a balancing act.'",
        "'speaker_0': 'I'm also mindful of the cost to maintain and restore the seawall and shoreline to make them adequate to address the anticipated sea level rise would cost between 15 and $17 million, and 80% of that needed work is on city property.'",
        "'speaker_0': 'And as far as the boatyard operator, I like the approach the way that it is being done this time around. I will also share that I think it was maybe two weeks ago, a few of us were at the Wheat Board meeting, the Water Emergency Transit Authority, because we were supporting the New Sea Plan, the ferry terminal'",
        "'speaker_0': 'and one service. But when the executive director was giving her report, she mentioned that one of the things because we did water transit around the Bay Area is expanding, which is wonderful. We're on the water. We should use that water transit.'",
        "'speaker_0': 'But she mentioned that they are finding it increasingly difficult to find maintenance facilities to maintain their boats. Now, granted, these are ferries, so they're bigger than sailboats. But the the gist of what she was saying was that this is just one of those fields where there are fewer and fewer people doing these jobs, which means you get'",
        "'speaker_0': 'creative about the way you do it, and sometimes you bring the workers to them. But be that as it may, I think this is a very important measure for our city and I am prepared to support it too.'",
        "'speaker_0': 'So we've had a motion, we've had a second all in favor. I opposed abstained. Those opposed. Okay. So that motion passes with four affirmative votes and one in opposition. Thank you. Okay. Now we are going to rush on to the next item.'"
    ],
    "Consider Directing Staff to Create an Autonomous Code Enforcement Division to Enforce All Building Code and Health and Safety Laws.  (Councilmember Vella)": [
        "'speaker_1': 'Consider directing staff to create an autonomous code enforcement to. Isn't to enforce all building code and health and safety laws. This item was placed on the agenda at the request of Councilmember Vela.'",
        "'speaker_0': 'So go ahead. Councilmember development. You take this one.'",
        "'speaker_3': 'I'll keep it short. So we've heard from constituents on a number of different issues, whether it's smoking in public concerns about after hours, construction issues related to other health and safety issues. And oftentimes, we're referring them to code enforcement.'",
        "'speaker_3': 'And then code enforcement is saying, you know, that's not something that we do. And so really, this is just about seeing collectively and we've talked about this tangentially related to other issues, but it often comes up relative to tenants issues where where we've heard from folks saying that they were reporting things.'",
        "'speaker_3': 'There was nobody to report them to or there was no record of it. Or our own building staff basically saying, you know, we focus on building inspections and not not we're not capable or trained in in the general breadth of code enforcement.'",
        "'speaker_3': 'And so several other cities were part of the LED abatement. JPA and several other cities are also in the taking steps to create their own autonomous code enforcement units. Oakland has one. Berkeley has one that they are making a little more robust.'",
        "'speaker_3': 'Emeryville will be putting or is considering a special ballot measure to fund a new code enforcement division. So I'm asking that council give direction to staff to put a proposal together about what that would look like. And also, I was told that there was some sort of past policy that we were not enforcing commercial.'",
        "'speaker_3': 'Commercial construction violations. The way that we were residential, that there was some sort of council policy to be a little not that we weren't enforcing them, but to be more lax. And so if that's the case, if there's some sort of existing policy that that come back to council for consideration.'",
        "'speaker_0': 'Um. Thank you. I actually would like to just ask Mr. Thomas to address that last the reference to. Or do.'",
        "'speaker_5': 'You. Yeah. If Andrew wants to address the last reference and then I can address the rest of the.'",
        "'speaker_0': 'Okay. And just if you could, is.'",
        "'speaker_8': 'There there is an existing council policy about code enforcement priorities for planning and building, and we will definitely bring that back when we bring it back. Eric will talk a little bit about that. It does not prioritize residential over commercial, but it does set priorities of some things over others.'",
        "'speaker_8': 'But that will be part of our report.'",
        "'speaker_0': 'Okay, thanks. Any other council comments before we hear from the city manager or should we hear from the city manager? Why don't we hear from the city manager? Mr. Levitt, I don't see its time.'",
        "'speaker_5': 'I have no idea why that went on. It was not on purpose. But Mayor Maras, Craft and City Council Andrew Thomas and myself are working on a report to come back to council. First quarter of 2020. And in that one is to go through the history and tell you what the priorities are.'",
        "'speaker_5': 'I think those priorities were set, as I understand it, 10 to 15 years ago. So to at least lay out what the priorities are and then also bring forward a plan of how we can move forward, how we could prioritize in a budget, a potential budget that would go with that.'",
        "'speaker_0': 'Sounds good in city attorney Did you want to add anything about code enforcement?'",
        "'speaker_6': 'I certainly echo my colleague's view that it is, you know, and I'm looking forward to working with both of my colleagues, both the city manager and the planning director on bringing back to the council a robust report. And I as I've indicated to the council previously, laws that are not in force are not laws that are effective'",
        "'speaker_6': 'and effectual. And so I look forward to working with the Council and my colleagues to ensure that we have adequate enforcement of our laws.'",
        "'speaker_0': 'Thank you. Any other clarifying questions or should we hear from our speakers? Councilmember Rudy.'",
        "'speaker_7': 'I'll wait till.'",
        "'speaker_0': 'After your time. Thank you. Okay. How many do we have?'",
        "'speaker_1': 'Three speakers.'",
        "'speaker_0': 'Okay, so three speakers. You can each have 3 minutes.'",
        "'speaker_1': 'Toni Grim, Nelson, Lag and Holly Lim.'",
        "'speaker_0': 'Eric. Okay. Graham.'",
        "'speaker_2': 'Good evening. I'm here to ask the council to approve this referral. I'm speaking as a member of an advocacy group, a well-known advocacy group.'",
        "'speaker_9': 'The seniors and disabled renters.'",
        "'speaker_2': 'And we have noticed an increasing problem of habitability lately. This is not surprising because we have.'",
        "'speaker_9': 'So many older buildings in our.'",
        "'speaker_0': 'City.'",
        "'speaker_2': 'But I also like to speak to the quality of life problems that all residents have in all buildings, whether they be commercial or residential. When codes are not enforced, it's not just problems of smoking and noise codes that are being violated, but also accessibility problems, which especially does impact seniors and disabled people.'",
        "'speaker_2': 'So I ask the Council to approve this referral. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Graham. Next in.'",
        "'speaker_1': 'Line.'",
        "'speaker_0': 'Hello.'",
        "'speaker_8': 'Hello. Good evening, Mayor and and council members. My name is Nelson League. I'm the Alameda resident and I'm also the president of the board of directors of Filipino Advocates for Justice, also known as FHA, as a representative of an organization serving Alameda Communities for the past several years, I'm speaking to express our support for Council members vela's'",
        "'speaker_8': 'Council referral to strengthen core code enforcement. FHA has been supporting Alameda residents through a multitude of housing issues since the attempted mass eviction and for some of the Central Avenue when tenants landlords ordered construction during illegal hours as a harassment tactic.'",
        "'speaker_8': 'When we surveyed Alameda renters recently in a large scale research project earlier this year, we observed that it was actually not uncommon to see renters lived through shockingly poor living conditions ranging from burnt out parts of their buildings to falling plasters to holes in the floor enough to see the downstairs unit.'",
        "'speaker_8': 'Well, we have always advised tenants to report these problems through through the usual means. Many of the community members have expressed discouragement due to in part of their what seemingly is a lack of response from code enforcement and other agencies.'",
        "'speaker_8': 'The recent complaint was made by the residents near and above the clubhouse bar and spinning bones reflect the types of concerns we've seen from vulnerable community members living in uninhabitable conditions. In Alameda, Councilmember Member Vela's proposal to transition building inspections into a new unit for universal code enforcement will significantly increase the city's ability to enforce existing laws'",
        "'speaker_8': 'in a timely and effective manner. I am confident that it will also have an outstanding impact on Alameda, tenants health, living conditions and overall well-being. Our organization applauds and supports this council applauds the support this council has demonstrated for renters this year, and we hope that will continue through.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Holly.'",
        "'speaker_0': 'Lynn Holley them. Okay. Good evening.'",
        "'speaker_1': 'My name is Holly, and I'm an Alameda and living in a mixed use building on Park Street. I've talked to many of you about.'",
        "'speaker_9': 'The.'",
        "'speaker_2': 'Situation.'",
        "'speaker_1': 'That my neighbors and I.'",
        "'speaker_3': 'Have been going through for the past year.'",
        "'speaker_1': 'I'd like to offer my support for the council referral.'",
        "'speaker_3': 'To create an autonomous code enforcement division. There have been.'",
        "'speaker_2': 'Multiple times.'",
        "'speaker_1': 'Throughout this year.'",
        "'speaker_3': 'When the construction downstairs for an upcoming restaurant has really affected the health.'",
        "'speaker_1': 'And just the.'",
        "'speaker_3': 'Quality of life and well-being of.'",
        "'speaker_1': 'Myself and my neighbors.'",
        "'speaker_3': 'Especially when the construction went after hours. So I just kind of.'",
        "'speaker_2': 'If you can. Oh, shoot.'",
        "'speaker_3': 'I was going to play something.'",
        "'speaker_1': 'For you that happened on a Sunday from 9 a.m. to 10.'",
        "'speaker_3': 'P.m.. This was what? The noises. All day on a Sunday. My neighbors, I had filed five code enforcement.'",
        "'speaker_2': 'Complaints about.'",
        "'speaker_3': 'After hours construction at another a neighbor next door who filed code enforcement complaints. Nothing was really done, except we'll just talk to the owners. And so we felt like we were not only experiencing construction noise six days a week, nearly nine months, but we were also, you know, when the time was for us.'",
        "'speaker_1': 'To rest, we couldn't rest. And not only that, over the past decade.'",
        "'speaker_3': 'Residential tenants in my area.'",
        "'speaker_1': 'Have made numerous attempts.'",
        "'speaker_3': 'To report code violations related to the noise, nuisance, unsafe behavior and illegal actions of our commercial neighbors, particularly from the clubhouse bar, from smoking to noise nuisances like disposing of glass bottles loudly during their closing at 2 a.m..'",
        "'speaker_3': 'Unfortunately, all of our reports have not been given the responsiveness needed to enforce the laws.'",
        "'speaker_2': 'As such, residents.'",
        "'speaker_3': 'Help right to quiet enjoyment and quality of life have been impacted. Most currently I'm impacted by the restaurant noise. The noise cleaning goes till 12 sometimes. They woke me up at midnight.'",
        "'speaker_2': 'Last night and at.'",
        "'speaker_3': 'Times the noise wakes me up at 530. So through the last month I've been kind of on very little sleep. And so because of the situation with the construction, I just feel like it kind of landed nowhere. So why should I even talk to people about anymore?'",
        "'speaker_3': 'Being raised without remedy. I think a lot of the residents feel like.'",
        "'speaker_2': 'We're headed to a place of partial, constructive eviction.'",
        "'speaker_3': 'In our near future. Many of us can't live like this.'",
        "'speaker_2': 'Lack of sleep. Just all.'",
        "'speaker_3': 'Of this stuff isn't really healthy.'",
        "'speaker_1': 'For a.'",
        "'speaker_2': 'Lot of us.'",
        "'speaker_3': 'And it's been going almost a year now. So please.'",
        "'speaker_2': 'Support this.'",
        "'speaker_3': 'Council referral. For me personally, my health depends on it, and we'd like to keep Alameda residents like me and my neighbors safely in our homes. Thank you.'",
        "'speaker_0': 'Thank you. Okay. That's the last of our speakers. Yeah. Okay. So, um, council, we've heard from the city manager and the city attorney. What direction do you want to give?'",
        "'speaker_7': 'Can I say my question.'",
        "'speaker_2': 'That you may not share to the.'",
        "'speaker_7': 'Author? So I think I heard the city manager and the I've got to get this title right. Planning, building and transportation, direct your proposal. I mean, is that an acceptable. Or is there something more you want besides that?'",
        "'speaker_7': 'Or is that acceptable?'",
        "'speaker_8': 'Or.'",
        "'speaker_3': 'Well, I'd like a proposal to come back about specifically addressing the creation of the separate unit and also to hear back on this specific policy of council priorities. And then with that proposal, funding mechanisms, because if we just hear about here's a proposal and we don't have the cost estimates and funding with it, it's going to just'",
        "'speaker_3': 'delay implementation.'",
        "'speaker_7': 'And again, through the chair, I mean, is that something that you guys.'",
        "'speaker_5': 'That's consistent with what we're planning for?'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'And Councilmember de SAC.'",
        "'speaker_10': 'Yeah, I'm not quite understanding the need for a completely new part.'",
        "'speaker_5': 'I can't, can I? I mean.'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'That makes a lot of sense. So what we're talking about, we haven't decided this for sure, is that it would be a separate division of planning, building and transportation. There were reports specifically to Andrew that that's my concept that I'm that we've been working on even before this referral.'",
        "'speaker_5': 'I tend to have in other organizations had code enforcement separate. So it's not through a building official, it's through actually their own supervisor that would report to Andrew. They would take on a lot of the complaints and then the the code enforcement officials would report through that individual to Andrew, I see that as autonomous.'",
        "'speaker_10': 'I don't know. I just think that if there's something broken with the current regime, then we fix it. If they need more funding for more staff to to respond to all the concerns, if there is a order of magnitude increase, and then we fix that.'",
        "'speaker_10': 'But that's a separate question from performance. Performance means how did we respond to problems as they arose and did we satisfactorily. And even there, I'm not convinced that. I mean, you know, it's your professional judgment. The thing that I'm concerned, though, is I don't want to see an entity whose.'",
        "'speaker_10': 'Whose reason for existence is to go after small mom and pop landlords. I don't want to see that. I want to see I want to make sure that tenants are treated fairly as well as landlords. But the tenure that I'm hearing here is, is that they're seeing this as something to go after those guys.'",
        "'speaker_10': 'So that's a concern of mine.'",
        "'speaker_0': 'Okay, so hold that thought. I actually like. That's fine. But I still need to make a motion because it is now 1126 and we voted to go to 1130. We've got the rest of this and one more council referral to go.'",
        "'speaker_0': 'Who wants to make a motion?'",
        "'speaker_6': 'I move again. Sorry.'",
        "'speaker_7': '1158 I was going to say 1145.'",
        "'speaker_0': 'I think 11 4511.'",
        "'speaker_3': '1145 yeah.'",
        "'speaker_7': 'That's my motion.'",
        "'speaker_0': 'Okay. Secondly, okay. Motion second four 1145 all in favor, I. Okay, five. Let's go quickly. So, Mr. Thomas, I mean, can you just talk briefly, briefly about I'm are we going after mom and pop landlords with.'",
        "'speaker_2': 'This.'",
        "'speaker_0': 'Permit.'",
        "'speaker_3': 'But the response because it's my referral.'",
        "'speaker_0': 'Uh, it is your referral. I would go to him, but sure you can.'",
        "'speaker_2': 'Okay, go ahead.'",
        "'speaker_3': 'So the intent of this is not to go after mom and pop landlords. The intent is to make sure that there is that there are habitable units and that when there are habitability issues or health and safety issues, that there is a mechanism for addressing it.'",
        "'speaker_3': 'Right now, we have we're under the old model where we have a building official who is trained in very specific things. That does not necessarily extend to all of the health and safety issues that may exist. And right now, it means that we're directing people to call the police department when it's not necessarily under their purview, and'",
        "'speaker_3': 'that might not be their best use or we're directing them to building inspections. Who where our inspectors do not feel that they are properly trained or in a position to address this. And most cities have therefore created an independent and separate unit that also trains staff to do this.'",
        "'speaker_3': 'And Mr. Thomas, you can chime in, but that's what I'm looking for.'",
        "'speaker_8': 'I first of all, I think this is we we've been talking about this report before your referral came. From my perspective, I'm relatively new to this role with this big long title, but my feeling being in this role for this last year is we have a code enforcement division in the planning building and transportation division, which was'",
        "'speaker_8': 'designed, shaped and funded, and the funding is key 15 to 20 years ago. You are adopting new laws. We are being asked to do different kinds of code enforcement. It 15 years ago it was very much designed as a small little unit that deals basically with building code violations.'",
        "'speaker_8': 'What I'm sensing is this council is saying, hey, we've got more than just building code violations. We have other kinds of violations. We have to rethink how we how we design our code enforcement unit, how we fund it.'",
        "'speaker_8': 'And that's, I think, where we want to kind of come back with is some some ideas, some thoughts, some adjustments. I kind of agree with you, Councilmember de Salgado, though, I think there is a question like I mean, every we just dealt with two code enforcement issues just today where we enforce code and immediately the call went'",
        "'speaker_8': 'to the mayor and, you know.'",
        "'speaker_0': 'To fix it, spent.'",
        "'speaker_8': 'A bunch of time on the phone. I mean, the more code enforcement we do, the more complaints and issues. I mean, yes, some people are going to be happy. Other people are not going to be happy. So it's a delicate balance.'",
        "'speaker_0': 'Yeah. Vice Mayor Nuts. Right.'",
        "'speaker_6': 'Okay. So I would like to thank Councilmember Vella for bringing this forward. My understanding from talking to staff is actually just something that I think everybody's been talking about with staff. On some level, I am uncomfortable with the council directing the the form that this takes.'",
        "'speaker_6': 'I would I think it and maybe this aligns a little bit with Councilmember de SAC. It sounds like there's a conversation around the policy that exists about what we do, code enforcement, and then we should have a we have a direct report whose job it is is to structure the city and be accountable for making sure that'",
        "'speaker_6': 'they're following through on the on the on the and on the implementation of that policy. It clearly it's not being implemented, right? Well, it may be implemented right. It may be that we just have a terrible policy or a policy that's not right for today.'",
        "'speaker_6': 'My proposal would be would be that we ask for that policy to come back. And then once the policy is adopted, that the city manager, you know, just come back with a report on how he is going to ensure that that policy is implemented in the way that the majority of the council is asking for it to'",
        "'speaker_6': 'be enforced.'",
        "'speaker_2': 'So. Yes.'",
        "'speaker_0': 'Yeah. Yeah. Councilmember Valley, did you have some of that? Well.'",
        "'speaker_3': 'I think that that just delays what's already been worked on. And it sounds like staff already has something that.'",
        "'speaker_0': 'They're working.'",
        "'speaker_3': 'On in line with what the proposal is. So I don't want to add an extra step or an extra council meeting when we don't have to.'",
        "'speaker_7': 'Councilman Brody, thank you. I guess maybe I heard a different discussion than my colleague here, because I think when Mrs. Vela presented the item, I think her concern was I mean, later, Andrew, you talked about it was that commercial was was not getting enforced and residential was so it to me if residential was then we would already'",
        "'speaker_7': 'have enforcement against quote unquote small mom and pop landlords. And what I think we did with our tenant protection in our just cause is kind of remove the fear that tenants have to actually speak to their landlord about it.'",
        "'speaker_7': 'So in my mind, that would kind of reduces code enforcement because instead of being afraid of being evicted for complaining about a broken window, you're not going to code enforcement. You are actually not having the fear to talk to your landlord.'",
        "'speaker_7': 'And I think the story we heard from Holly was a commercial landlord that was doing construction or a commercial tenant doing construction, not a mom and pop small property owner. So I'm not sure I got the same, you know, the same reaction.'",
        "'speaker_7': 'I mean, I think that given that the author of the referral is okay with the direction or the, the, the, the proposal that staff has put together on how to respond to this, I would be willing to to move forward the the referral based on the expectation of the report that our planning director and our city manager'",
        "'speaker_7': 'said they would provide.'",
        "'speaker_0': 'So let me jump in here, if I might.'",
        "'speaker_7': 'That's okay with the.'",
        "'speaker_0': 'So so we've heard from the city manager that he and planning director and all the other titles are working on a report with the city manager, city attorney to come back to the council in the first quarter of 2020.'",
        "'speaker_0': 'That will look at the history of code enforcement and bring forward a plan in the budget to be able to to revamp it, to bring it up to the needs of today's residents and businesses.'",
        "'speaker_3': 'And I think, Madam Mayor, also making sure that whatever we do, that there's consideration given to the city attorney to make sure that whatever what what's being structured is, in fact, going to make us better at enforcement, especially with the creation of the new prosecutorial.'",
        "'speaker_0': 'Because he also mentioned that having a code that of course it is.'",
        "'speaker_5': 'Disagree with that.'",
        "'speaker_0': 'Disagree.'",
        "'speaker_5': 'Yeah. I'm a strong believer that the enforcement arm and you you work together but there should be a separation between prosecute.'",
        "'speaker_0': 'Well we're we're waiting for the report to come forward. Let's not let's not get too much. I want to say one thing, though, and I've met with Mr. Muslim and her neighbors. I think something that we have to be careful of is achieving that balance.'",
        "'speaker_0': 'When you're talking about a mixed use building, that is a mixed use and there is a zoning and it allows restaurant. And we've also if you've been on social media lately, you've seen a lot of talk about businesses that are going out of business on Park Street.'",
        "'speaker_0': 'And we and we heard about the need for small businesses and supporting mom and pop and independently owned businesses locally. So let's make sure we achieve that balance. And I want to make sure that we also hear from the business owner, because I have met with the owner of Spinning Bones and and this is a new restaurant'",
        "'speaker_0': 'and it deserves a chance and shouldn't have to pay for the transgressions of the clubhouse bar. That sounds like it should have been dealt with more effectively with code enforcement. But I just want to make sure that we don't this isn't all or nothing.'",
        "'speaker_0': 'And, you know, no side has the corner on the market of of truth and justice. We need if we truly want a vibrant community and a downtown district and walkable, you know, homes and businesses and all that, we've got to we've got to address that and not just say, you know, businesses bad anyway.'",
        "'speaker_0': 'But I like I like what's been brought forward. I think there's a good plan in place. I thank my colleague for bringing this to our attention. So have we got that motion to do? You made that? Yes. Okay.'",
        "'speaker_0': 'So that was you who moved, right? Councilmember is the move by Councilmember Odie? What is the motion, Madam Clerk?'",
        "'speaker_2': 'I said.'",
        "'speaker_0': 'That's okay. It is to essentially adopt what the city manager had put forward and with the assurance that.'",
        "'speaker_3': 'Yes. The council prioritization.'",
        "'speaker_0': 'Yes.'",
        "'speaker_8': 'Move the move the move the referral.'",
        "'speaker_7': 'With the plan that the director of transportation building and.'",
        "'speaker_0': 'Whatever. Yes, let me.'",
        "'speaker_7': 'Right, Andrew. I'll call you. Andrew had 1135.'",
        "'speaker_0': 'And your name.'",
        "'speaker_7': 'Is manager together with.'",
        "'speaker_3': 'Along with the city.'",
        "'speaker_7': 'With city with Councilmember Vela's addition at the end after I asked her the question.'",
        "'speaker_0': 'Okay. So it's been moved. It's been seconded. Any discussion? Hearing none. All in favor. I opposed. Abstained. Okay. So that passes with four affirmative in one abstention. Okay. Now we are moving on to council referral nine be.'"
    ],
    "Consider Requiring New Construction or Renovation of Publicly Accessible Buildings with at Least One Public Restroom to Provide at Least One Safe, Sanitary, Convenient and Publicly Accessible Baby Diaper Changing Station.  (Councilmember Vella)": [
        "'speaker_1': 'Consider requiring new construction or renovation of publicly accessible buildings with at least one public restroom to provide at least one safe, sanitary, convenient and publicly accessible baby diaper changing station. This item was placed on the agenda at the request of Councilmember Phillips.'",
        "'speaker_2': 'Um.'",
        "'speaker_0': 'So, um, I, um. But Councilmember Val, this is your referral. Um, I might suggest that we pursue option number two, but it's your referral. Take it away.'",
        "'speaker_3': 'Well, so currently the government code. The government code requires this only for government owned buildings where restrooms are publicly accessible. And so the ask is, is that when we have new, publicly accessible buildings in. Privately owned, publicly accessible buildings.'",
        "'speaker_3': 'We. But the same requirement that.'",
        "'speaker_0': 'I enjoyed today and I read the referral and I'm just thinking that it probably takes a little bit of staff looking into and the city attorney and planning director and all that. And so to come back to us.'",
        "'speaker_2': 'Yes. Okay. Yes. All right.'",
        "'speaker_0': 'Can I even make a motion done that for a long time? Okay. I would move that with regard to this council referral that the council will pursue option number two, to refer this matter to staff to schedule as a future city council agenda item.'",
        "'speaker_3': 'And I did say this was not urgent but important.'",
        "'speaker_2': 'Exactly. Yeah.'",
        "'speaker_0': 'Okay. I can second any discussion.'",
        "'speaker_3': 'I would just say that there's a lot of moms and dads out there who I have heard from and this is something that has come up quite often. And so thank you for supporting it.'",
        "'speaker_0': 'Okay. So well, so there's a motion, there's a second all in favor of that action. I oppose. Abstain. Abstain. Okay. That passes for affirmative votes. One abstention. And then we have 7 minutes and council communication in any council communications.'"
    ]
}