{
    "Recommendation to Provide Direction on the Selection of an Executive Search Firm for the City Manager Recruitment Process. (Human Resources 2510)": [
        "'speaker_0': 'Recruitment and staff is here today to hear your recommendation. I have a question. Could we. How does the an internal if we have candidates that are from within the organization, can we have an internal process that goes to them first or or the separate from this?'",
        "'speaker_0': 'Is there a separate process?'",
        "'speaker_4': 'Because this is this is one of the positions.'",
        "'speaker_0': 'That you get to pick.'",
        "'speaker_4': 'Whoever you like. So if you want to do an internal recruitment.'",
        "'speaker_0': 'You may do, though. Remember, Audie.'",
        "'speaker_5': 'QUESTION Does staff have a preference? I mean, not on internal but on on whether Avery versus Mr. Murray.'",
        "'speaker_0': 'Staff picked a.'",
        "'speaker_4': 'Number of firms to show you their brochures.'",
        "'speaker_0': 'Because they were very.'",
        "'speaker_4': 'Experienced and frankly.'",
        "'speaker_7': 'We would be happy working with any of them. And so it really is up.'",
        "'speaker_4': 'To your.'",
        "'speaker_7': 'It's a matter of fit, we think.'",
        "'speaker_0': 'And so I really.'",
        "'speaker_4': 'Look to your judgment on who.'",
        "'speaker_7': 'You think you.'",
        "'speaker_0': 'Would like to work with. Vice mayor. But we have a speaker actually from a non agenda item that yes, we want to continue this first if you want me to call the speaker. Real quick.'",
        "'speaker_3': 'Yeah. Maybe start before we start the deliberation. It's an off agenda item, right? No, that's not it.'",
        "'speaker_0': 'Right.'",
        "'speaker_6': 'Okay. That's right. That man, Mayor?'",
        "'speaker_0': 'Yes.'",
        "'speaker_6': 'Vice, continue. Thank you for clearing that up. I.'",
        "'speaker_3': 'I think.'",
        "'speaker_7': 'After.'",
        "'speaker_3': 'That we were going to hear this when? Public Speaker.'",
        "'speaker_6': 'After I thought it was after.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_4': 'Okay.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'Mm hmm. I smell.'",
        "'speaker_6': 'I don't hear. So I do. I'm going to say that both firms, I think, are top notch, but I lean toward Bob Maureen, Associates. Associates, Associates. For two reasons. One is that. He flagged that he worked with a city that was known to be difficult on city managers.'",
        "'speaker_6': 'And not saying that meat is difficult on city managers, but I think in looking at our history. I think someone else doesn't know aluminum. I think. I think that and I. Understand is the reason he said that. And.'",
        "'speaker_6': 'I think it speaks to his favor or his firm's favor in the second, and it's a small item. But even he flagged that he knew the difference between Park Street and Webster. So I think he did his homework.'",
        "'speaker_6': 'Again, I'm looking for differences between two top firms. And that just pushes me there. There are fees. There costs. The total costs are virtually the same. So my vote is for or my of. Yeah, my vote is for Bob Marine.'",
        "'speaker_0': 'And my understanding is that the ones that presented second. I'm sorry. They're the ones that presented second. Yes.'",
        "'speaker_5': 'Yes, correct.'",
        "'speaker_0': 'Their comments. And Brody.'",
        "'speaker_5': 'Thank you, Madam Mayor. No. I kind of echo part of what the vice mayor said. You know, I kind of felt that both were were very qualified and that both would do a fine job. I felt a stronger comfort level with Mr. Chmura from Avery.'",
        "'speaker_5': 'I don't know what it was about it, but, you know, we're going to be spending a lot of time with with the individual that. That manages the process. And I just felt this is more of a gut level, comfort level with Mr. Cameron.'",
        "'speaker_5': 'And, you know, I probably put him a little bit ahead of Mr. Murray, but I thought both of them were very well qualified. I like the fact that not to be too parochial about this, but you know, I liked having Avery being from the Bay Area.'",
        "'speaker_5': 'I think we have unique challenges here that are different than than city managers, say, in the valley or in Southern California or even in in the Sacramento area.'",
        "'speaker_0': 'Remember they suck.'",
        "'speaker_1': 'A thank you. First off, thank you very much to stephanie grant sierra. For bringing two exceptionally qualified firms. So I really appreciate that. And, you know, in the big picture of things, at roughly $25,000, I mean, I think even for them, this probably isn't a big contract, but but it is nonetheless important.'",
        "'speaker_1': 'The thing that really stuck, I'm looking at my notes from the meeting and the thing that really stuck strikes me is I thought Mr. Kimura gave a little more. A discussion that had more depth when it came to community involvement.'",
        "'speaker_1': 'My notes just seem to be more about that. So I think on that, that's to me, that's a tie breaker in the direction of Mr. Kimura. So either way it will be a good selection.'",
        "'speaker_0': 'Amber Ashcraft.'",
        "'speaker_3': 'Thank you. Mary Spencer I'm just going to pull up my notes from when we interviewed the two candidates on April the 29th. And as my iPad cooperates. Okay. So I also thank Stephanie for Miss Grant Sierra for bringing us these two qualified firms.'",
        "'speaker_3': 'And I enjoyed hearing from both of them. I do find myself leaning toward Mr. Chmura in his firm for a couple of reasons. One is that his firm is the only Bay Area based recruitment firm, and he emphasized that they have an extensive record of selecting city managers, so they have a strong database.'",
        "'speaker_3': 'And he also I like the the the use of behavioral interviewing wanting to have input from the community as the city council, of course, will direct and with Mr.. But that said, I would also want to make sure if this is the the firm that we choose, that it is specified in the contract that it is indeed'",
        "'speaker_3': '. Mr. Chmura, we're working with the Vice Mayor, and I have had a little history and experience selecting consulting firms. And you, you know, you interview a principal and you get the feel and that's the, you know, the direction you want to go.'",
        "'speaker_3': 'So then you want to make sure when all is said and done, that's who you're working for. So I would look to staff to take care of that for us. And then with regard to Mr. Murray.'",
        "'speaker_7': 'He well.'",
        "'speaker_3': 'I, he does work in a lot of different places, including other states. He's based in Southern California, I think.'",
        "'speaker_4': 'Roseville.'",
        "'speaker_3': 'Roseville. Okay. But he does work in all over the state. But also he talked about Arizona and Dallas and Phenix and Tucson. And I, I think I like someone with a lot of focus in California. And the one thing that gave me pause was when he he called Alameda one of California California's jewels.'",
        "'speaker_3': 'That didn't give me pause. I like that. But he also chose Coronado, California, as the most similar city to to Alameda. And that was because of the strong military presence. Well, Coronado is lovely and an island and all those good things, but the military presence would be San Diego that does still have a functioning naval base.'",
        "'speaker_3': 'We haven't for quite some time. I mean, to say that we have a strong military presence is is a bit outdated. So, again, I think that we had two great candidates for the reasons that I stated. I leaned toward Mr. Kimura as our selection.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'I personally would prefer if we start with an internal search and not hire a firm at this point. The estimated costs are approximately $25,000. I think we have a good possibility of hiring someone internally for this position. All right.'",
        "'speaker_0': 'I guess I should be clear.'",
        "'speaker_6': 'Conducting the search internally or hiring a person who currently works here internally. I'm not understanding which her.'",
        "'speaker_0': 'I would prefer that we go through an internal process first and determine whether or not we have any candidate from within that we would send an offer to before we commit to hiring a firm for $25,000, approximately. I just went through this process recently with the school district level and.'",
        "'speaker_0': 'We did end up hiring someone from within. And I just didn't start there. Yes.'",
        "'speaker_3': 'And I think that there is nothing to preclude an internal candidate from applying through the the system that we would employ if we hire an independent search firm. And I think that for a number of reasons, this is a very important position at a very important juncture in our city's existence.'",
        "'speaker_3': 'And I think that we should not limit ourselves. I think time is of the essence, and I think we can accomplish the goals that you that the mayor is is speaking of with a search firm, with a with a professionally conducted search.'",
        "'speaker_3': 'And I just wouldn't want to limit our options. And it may well be that we ended up choosing someone internally, but at least we would know that we made a well informed decision and exercised all of our options.'",
        "'speaker_3': 'Thanks.'",
        "'speaker_0': 'Everyday sound.'",
        "'speaker_1': 'Yes, I am ready to move forward. I think for several weeks now we've been kind of honing it down this track. I appreciate what you're saying, Madumere, but we have been honing down this track and I do see that if there is an internal person who is interested in this, that having either Mr. Chmura or Mr. from'",
        "'speaker_1': 'the other organization Murray as the person facilitating the process is a benefit and and benefit or vetting. On our behalf, either an internal candidate or vetting on our behalf, you know, someone from the outside. I think it's practical to do it all at once.'",
        "'speaker_0': 'Well, your emotion.'",
        "'speaker_1': 'Sure. I'm ready to move forward. I'll move forward. I'm going to move a recommendation with that. Well, actually, I think that council member, as he Ashcraft said it well, in terms of Mr. Chmura, so if you have a motion to make.'",
        "'speaker_3': 'I'll make the motion. I move that council select Paul Chmura as our professional search firm to conduct the city manager search.'",
        "'speaker_5': 'A second.'",
        "'speaker_0': 'All those or any discussion.'",
        "'speaker_6': 'Although it was be with the assumption that his.'",
        "'speaker_3': 'With the specification.'",
        "'speaker_6': 'Specification.'",
        "'speaker_3': 'Yes. That he indeed be they the principle that we deal with. Okay. And there was a second.'",
        "'speaker_7': 'Energy.'",
        "'speaker_0': 'Tony. And all those in favor. I oppose.'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'Oppose. Motion passes, 3 to 2. Terrific. Thank you. W are right now are we have a speaker, chris anderson. You may approach this. Please proceed.'",
        "'speaker_5': 'I apologize in advance. This is a little bit verbose. It's about a minute and a half over 3 minutes without me.'",
        "'speaker_0': 'Well, if you could try to do it as close to three as possible.'",
        "'speaker_5': 'I'll try. Thank you. We have till six. I wanted to get a lot of detail.'",
        "'speaker_0': 'You know, I don't. If you heard member o d he said we have till six. Go ahead.'",
        "'speaker_5': 'Good evening. Mayor Spencer, vice mayor of Matariki B Manager. I'd like to address the council tonight regarding a small waterfront businesses caught in the bureaucracy of the city. My name is Chris Anderson. I represent the Anderson family ownership in Grand Marina.'",
        "'speaker_5': 'Anderson family developed the Graham Ring in 1985, restoring an unknown, usable, toxic site at the foot of Grand Street. The toxic material in the water and land was removed by the Anderson family, so the public now enjoys the waterfront, access and landscaping.'",
        "'speaker_5': 'Currently, the Grand Marina is considered among the nicest in Alameda. Several new residential neighborhoods have been developed to enjoy landscaping and public pathways installed and maintained by the Grand Marina. Prior to Grand Marina from 67 to 85, the Anderson family owned and operated the Alameda Yacht Harbor, which is now known as Fortman Marina.'",
        "'speaker_5': 'Both marinas utilize tidal and submerged lease land to operate their maritime operations. Anderson Family has never missed a rent payment, nor has created any problems for the city in the 48 years of history. Beginning in 2005 and foreseeing a necessary necessity to make substantial maintenance repairs to the city owned structures, the Grand Marina leases.'",
        "'speaker_5': 'Graham GREENE approached the city to renew its tidelands lease. The current lease will expire in 2029, but Graham Marina wanted to secure a long term lease so that conventional financing would be available to make improvements to the property's buildings and wharfs.'",
        "'speaker_5': 'Because the city has been unwilling to prioritize these efforts for a new lease, the wharfs and buildings have deteriorated exponentially. The cost of repairs turned into cost of replacement in the current lease. The responsibility of major construction is not that of the lessee, but in good faith and what was thought to be in good standing with the'",
        "'speaker_5': 'city. The marina was willing to rebuild, retrofit failing structures using its own assets if long term financing were achievable. Over many years, Graham Arena has met with the changing administrations of economic development, community development, city management, city attorney and the third party consultants such as PM Realty and now Cushman Wakefield.'",
        "'speaker_5': 'With each new administration, the interpretation of a new lease would contradict the previous and create new requirements for Graham Arena. The latest proposed by the city would increase our yearly rent by more than 20 times. Graham Arena certainly understands rent will increase with a new lease.'",
        "'speaker_5': 'But it should be economically reasonable and reasonable. By ignoring Graham Ring in around 2005, the city has potentially lost hundreds of thousands of dollars in rent. The marina has 14 years left on its current lease. This could be potentially a loss to the city of nearly $2 million.'",
        "'speaker_5': 'As a resident of Alameda and knowing the tough economic times that we've been through and may face in the near future, I question the basic understanding of economics and the city staff. I wonder how many other leases or assets are being ignored?'",
        "'speaker_5': 'As an.'",
        "'speaker_0': 'Its continue.'",
        "'speaker_5': 'As an officer of this corporation, I've fiduciary duty to the shareholders to protect assets and revenues. Graham Arena has been given the runaround from the city for so long and I would have to suppose that the city does not have any interest to renew the lease and that the Graham Marina should start planning for such an event'",
        "'speaker_5': '. The time has come to realize that the city owned structures are failing and almost beyond reasonable repair. If there isn't something done to retrofit or reconstruct the buildings, there have become an unreasonable asset for the city quickly turning into a liability.'",
        "'speaker_5': 'Graham Arena does not own all the land, but owns many of the shoreline parcels and fee as well as the floating docks. Theoretic Theory. Ethically, if a favorable lease cannot be negotiated with the Graham Marina, it's possible to relocate to a more business friendly environment.'",
        "'speaker_5': 'Because of the Bccdc Bay feel restrictions, the city or a private developer would not be able to rebuild another marina in the same location. Waterfront landscaping and pathways would no longer be maintained, nor would the two public restrooms.'",
        "'speaker_5': 'The city would be left with 24,000 square feet of aging building and no parking or access. A condemned and condemned 10,000 square foot wharf with no marina, no commerce from the 400 marina tenants, not only with the city not realizing an increase in rent, but potentially no rent at all.'",
        "'speaker_5': 'I hope that this information would urge the Council to urge the staff to take the lease negotiations more seriously with Graham Marina. Thank you.'",
        "'speaker_0': 'Thank you. And staff look into that it shouldn't have. Dr. Council, thank you so much. All right. So we'll be taking a short recess. Our budget item supposed to begin at 6:00. Thank you. Thank you.'",
        "'speaker_3': 'Keep your sandwiches. Oh.'",
        "'speaker_5': 'Oh.'",
        "'speaker_4': 'Well, we're.'",
        "'speaker_0': 'We're going to read. Thank you, everyone. We're going to resume with the budget.'",
        "'speaker_5': 'Item.'",
        "'speaker_0': 'Three B.'",
        "'speaker_2': 'Receive presentations from non-German, French departments and programs on the proposed budget for.'",
        "'speaker_3': 'Fiscal year.'",
        "'speaker_4': '2015, 16 and 1617.'"
    ],
    "Receive Presentations from Non-General Fund Departments and Programs on the Proposed Budget for Fiscal Years 2015-16 and 2016-17. (Finance 2410)": [
        "'speaker_7': 'Whether you're going to call.'",
        "'speaker_0': 'The speaker and we have one more speaker, I'm going to call first, Rob Prado.'",
        "'speaker_6': 'At that point. Ira Pardo, executive director of Park Street Business Association. And I'd like to thank the mayor and the rest of the council for letting me go first this evening, because if you didn't, we'd be in for a Rob Rando snore fest later in the evening, and that's never any fun.'",
        "'speaker_6': 'I just want to I just have a few brief comments. I actually did read all of the presentations by all the departments online this afternoon, and no, I didn't fall asleep. I was it was very interesting. And I really like the new way it's being done.'",
        "'speaker_6': 'Last week and this week, two things caught my eye. You know, they're all great departments. We love them all. But the two things that caught my eye was as a. X Air or and as an x cruzi call.'",
        "'speaker_6': 'And I wish Mr. Kearney was here because Mr. Kearney and I, back in 1967 were members of the Midget League Championship Team from Cruzi from Cruzi Park. And I see that the new rec center at Crazy Park is in this budget.'",
        "'speaker_6': 'And trust me, that building needed to be replaced back in 1967. So I proved.'",
        "'speaker_3': 'More so after you and Kevin. Yeah.'",
        "'speaker_6': 'Oh, absolutely. Absolutely. So I certainly hope that that goes forward. And of course, I threatened all of you a number of weeks ago that every time you talked about the community development budget, that I would come here and speak in favor of the facade grant program, which again is the best program this city has had in a'",
        "'speaker_6': 'long time for small businesses in this town. And as a matter of fact, I happened to talk to the staff person who used to administer it. Her name is Sue Russell. Some of you know her. She's alive and well and living in Asheville, North Carolina.'",
        "'speaker_6': 'And when I talked to her this morning and I said I was coming here tonight, she said, well, you tell them I'm all in favor of putting that program back together also. So I certainly hope you will give it all the consideration it deserves.'",
        "'speaker_6': 'And we'll move forward and we'll get some better looking facades on Park Street and Webster Street and any other place that is going to be included in the new program. And, of course, my organization and myself are happy to work with staff to put it back together in any way that the city believes it should be.'",
        "'speaker_6': 'And we'll just move forward and help those small businesses improve their facades. And I'd love to stick around for kids, but I'm leaving behind.'",
        "'speaker_0': 'Thank you. All right. Now we'll proceed with the presentation.'",
        "'speaker_2': 'Okay. Just a quick introduction, Madam Mayor and council members tonight, you have the fifth of six budget budget presentations tonight. We are conducting what we call the majority other funds. So that means the funds, the departments that are not funded by the general fund primarily.'",
        "'speaker_2': 'So some of the departments, for example, Rec and Park and Library do get some general fund funding. But but mostly it's folks that the departments that have other sources of funding. And so that's sort of how we characterize these last two.'",
        "'speaker_2': 'This one and the one before budget session. So again, this is the fifth of six meetings. And with that, I'll turn it over to Ms. Wooldridge, who's going to take on her hat, put on her hat as the rec and park director.'",
        "'speaker_4': 'Good evening, Mayor and Council Amy Wooldridge, Recreation and Park Director. And. Here to overview the budget for you for recreation and parks. So to start with what we do, it's kind of an overwhelming and impressive list. We have basically three divisions.'",
        "'speaker_4': 'One is park maintenance. Our overall mission in park maintenance clearly is to maintain clean and safe parks, facilities and fields. I'm not going to list all of them, but you see before you the sheer volume of facilities and this doesn't even list quite all of them, but we have 19 overall 19 parks and 14 additional facilities.'",
        "'speaker_4': 'So we maintain all of those. We are all just put aside, not working hard with the drought to meet to and you'll hear more about that at upcoming meetings. But with those parks comes a big responsibility right now to to make sure we're being water efficient.'",
        "'speaker_4': 'Our second division. Well, actually, let me back up. So in Park Maintenance, staffing wise, we have one park manager and we have ten park maintenance workers and 12 part time staff in our recreation services division. With that, we provide recreation activities and programs for all ages, all families, all you know, we're we serve all residents with that'",
        "'speaker_4': '. We provide classes, camps, aquatic programs at the swim centers, sports community wide events. Also under there's park monitors, which is a new program that was added last year. And they are out in force on in parks on the weekends to root to do everything from helping, make sure trash is empty from one picnic rental to the next'",
        "'speaker_4': 'to also checking and answering questions. Just being a friendly face in the park, checking permits, things like that. It's really been a huge help and we've gotten a lot of positive feedback on that program. Within that division, we have one recreation manager, three recreation specialists and 187 currently fluctuates anywhere between 150 to 250 part time stuff.'",
        "'speaker_4': 'Our third main division is Mastic Senior Center and we provide services and activities for adults 50 and over a does include boomers now. And so that includes we have we have a lot at mastec with you know you heard a presentation last week we have about 3500 members trips, classes, meals, a lot of different support services.'",
        "'speaker_4': 'And there's fundraising that the board does to help support those services. With that program, we have one recreation manager, one recreation specialist and 11 part time staff. So as you can see, we manage a very large part time staff and have for the size of our programs are pretty small, full time staff complement.'",
        "'speaker_4': 'Then we have it's not a separate division, but I wanted to call it out because we have our general administration for our PD and so that myself we have an account TEC. We have as one senior clerk and one office assistance assistant.'",
        "'speaker_4': 'And so that's doing all of the personnel management, all the financial management grant, administration seeking grants and other types of funding project management. And that's all under our administration. We've a couple of new initiatives that are in this budget.'",
        "'speaker_4': 'One is to create a project manager for our parks. You'll see at the end of my presentation I'll get into what some of our upcoming projects are you're probably familiar with. Most, if not all of them. This is a new position that would be housed under public works within their project manager division.'",
        "'speaker_4': 'However, Parks would we would fund 75% of it for the next two year budget cycle. Public works would fund some 25%. Therefore, we get 75% of their time. Many of the large projects in particular Jean Sweeney, Open Space Park and Estuary Park.'",
        "'speaker_4': 'I got the ball rolling in the last few years for those projects, but now we're at a point where it really takes a full time project manager to manage all of the details of the design. The construction management and the way that would work is I would still recreation and parks would essentially still be the user.'",
        "'speaker_4': 'And so we'd I'd be working very closely in tandem with that project manager, but they'd be managing all the daily details on those types of projects. And so the cost for that 1516 is 160,000 172,016 17. It's fully funded by the projects.'",
        "'speaker_4': 'And so there is no impact on the general fund. Another new initiative is we are looking to restructure our park maintenance staffing program. Basically right now, as I mentioned, we have one parks manager, we have ten park maintenance workers.'",
        "'speaker_4': 'One of those technically is an equipment operator classification. We're hiring that out right now. And over time, due to cuts, our staffing for that division has become very flat. So we have a park manager up here with that skill set.'",
        "'speaker_4': 'And then we have the park maintenance workers who do all of the daily work at the parks. So we're missing a we're missing an element of skill set in between. And there's no room for growth within the department.'",
        "'speaker_4': 'So we know we have, for example, retirements coming up in the next few years. And if we're going to bring in younger people, there's nowhere for them to there's no enticement for them to grow within the division. We've had two full time staff vacancies in that division since December.'",
        "'speaker_4': 'As I mentioned, we're working. Fill one of them right now. The next one is coming down the pike. What we did in this. In this budget is are proposing to take one of our park, one of those vacant park maintenance workers, and turn it into a four person position so that we'd have then a park manager, a'",
        "'speaker_4': 'four person. And, you know, as we can start stretching the organization, create a more dynamic staffing complement. So and I'll give you a couple quick examples. Irrigation, there's there's times a couple months ago, my park manager, you know, who's paid at a high level, high skill level to manage projects, that's where he should staffing.'",
        "'speaker_4': 'That's where he should be. Yet had to spend 4 hours out in the field on his knees helping us teach his staff how to how to fix an irrigation problem and that or managing smaller going out and talking to neighbors about tree issues or fence issues.'",
        "'speaker_4': 'Those should be managed by a four person or someone on a little bit of a lower level than our parks manager. So that's what we're trying to bring back is is those levels.'",
        "'speaker_0': 'Before you move on. And can you can you confirm that you would not have to let a current park maintenance worker go? In order to do this, you would just through attrition, essentially, or you have a vacancy? We have.'",
        "'speaker_4': 'A vacancy. We we have a vacancy in a park maintenance worker position. And we are taking that vacancy and turning it into a four person position. We would recruit if we received this, we would recruit as a four person position classification next year, next fiscal year.'",
        "'speaker_0': 'And are there trainings that a current park maintenance worker or current employee could participate in in order to be eligible for this or person? Or do you anticipate having to hire from outside?'",
        "'speaker_4': 'It would be an open recruitment. I can't really anticipate one way or the other who would actually get hired, but we have been putting our current staff through trainings. They were all required just recently, a couple of months ago to go through the stop waste, very friendly landscape training, for example.'",
        "'speaker_4': 'We've sent several of them to specific irrigation trainings. We've been actually really pushing training in the last year or so.'",
        "'speaker_0': 'Wonderful. Thank you. You're welcome. Comments before she moves on. Nebraska.'",
        "'speaker_3': 'I was just going to do some overall comments at the end of her presentation. So we let her go. Yeah, but thank you.'",
        "'speaker_4': 'All right. Thanks. So some previous cuts, a ten year history of cuts to LAPD, Alameda Recreation and park department you have before you contractual service, park maintenance, contractual services and part time staff overall was reduced by 130,000. Mainly what that was is a lot of our passive parks.'",
        "'speaker_4': 'And by passive parks we mean parks like Jackson Park, where there's not actually athletic fields and playgrounds, but really it's just more where people are walking around and hanging out. Those used to be contracted out to kind of mow and blow services, so to speak.'",
        "'speaker_4': 'And at one point that was cut and that was put as an additional burden on our existing staff at the time. We did eliminated a total of six full time staff, three in park maintenance and four in rec services.'",
        "'speaker_4': 'And in fact, this is where I'm trying to get back to the structure. We used to have two of the park, two of the three you see in parks used to be lead persons. And that is similar to the four person that we're we're requesting to bring back.'",
        "'speaker_4': 'We had a number of community events that were eliminated, several we have replaced. And so they do still continue. The scramble is still around, for example, but we've had to go out and replace them with outside funding from Rotary and East Bay regional and organizations like that.'",
        "'speaker_4': 'Back in, I believe, 1112, we transferred four or 15,000 of costs from the general fund to the rec fund. So what that did is it? We took that burden off and now put it under our expenses in the rec fund and use our fees for service to try and help and to to start covering that.'",
        "'speaker_4': 'We also reduced our free parks and playground sites from 10 to 5 a number of years, ten sites to five sites a number of years ago. This is our overall expenditure budget. You can see our. Yes, I'm.'",
        "'speaker_3': 'Sorry. And this will just going to take you back to that last slide, the last bullet reducing free parks and playground sites from 10 to 5. What does that mean?'",
        "'speaker_4': 'We used to offer ten parks. We had free parks and playgrounds and we now offered at five parks.'",
        "'speaker_3': 'Is there a program? Parks and playgrounds.'",
        "'speaker_4': 'I'm sorry. Yes, I'm sorry. Parks and playground.'",
        "'speaker_3': 'Translate have.'",
        "'speaker_4': 'You? Right. Let me try and thank you for the clarification. So we offer two types of afterschool and summer programs for kids. One is our rap, which is recreation after school. That's a paid program. We walk the kids from school to our sites and then wow is our standard world of wonder during the summer, our summer camp'",
        "'speaker_4': '. For those who may not be able to afford it, we are actually one of the actually the only city that I know of in at least Alameda Contra Costa plus area of of cities that still offer free programs such as this.'",
        "'speaker_4': 'So we now we still offer at five sites after school care every day after school until five and then all day in summer. And then we've complemented that last year with our free parks, baseball summer baseball league and brought that back as well.'",
        "'speaker_2': 'And Mayor, if you mind, I mean, could you clarify the transfer costs from general fund to the rec fund with that? Did that go with the revenue as well or was it just the cost?'",
        "'speaker_4': 'I believe it was just the cost, but I would need to go back and double check that. That was just the cost because then that was just the cost, the revenue that was prior to when we consolidated everything into the rec fund and that's when the revenue came over.'",
        "'speaker_4': 'So as you can see, our park maintenance budget is is just over $2 million. That continues. That goes up each fiscal year a little bit. Really primarily due to staffing costs and. Primarily due to staffing costs. The recreation fund is going up as well.'",
        "'speaker_4': 'Primarily due to personnel. You will see that it dips down slightly from 1516 to 1617. And the reason is, is because and I'll get into this a little bit more in a minute is the the Mastic Senior Center Advisory Board.'",
        "'speaker_4': 'A little over a year ago was brought in under the IRA as a sub fund, under the recreation fund. And over the next two fiscal years, they're doing some capital, some maintenance improvement projects, and they're drawing down their fund balance, which is over 500,000.'",
        "'speaker_4': 'And so that's within this. And and so that's what brings it down. Not that we're spending less on services, but because of those improvement costs.'",
        "'speaker_0': 'Can you clarify the funds from Mastic? Are they kept separate? So they have to keep those funds separate even though they're falling under this recreation fund?'",
        "'speaker_4': 'Well, Mastic, there's a couple of places where mastic is mastic is accounted for as a division within the recreation fund. So there's the recreation fund as a whole. Under the rec fund, there's a couple sub funds. One is the golf fund.'",
        "'speaker_4': 'One is the Mastic Senior Center Advisory Board. So that's just the advisory board there, fundraising activities and programs. And then there's mastic donations, which is donations that that and because that come to the center.'",
        "'speaker_0': 'But when people make those donations or they raise their funds, they're kept. Keep track of that money separately. Have received a couple of concerns. Oh, absolutely.'",
        "'speaker_4': 'We have. That's the bequeath. So that we have amassed six donations. Sub Fund. Yes. Mm hmm. Absolutely. And it lives within the wrecks on the golf. And I'll get into details on that in a minute. And then we have some other funds, such as the hard ball field, which is the College of Amino hard ball field are'",
        "'speaker_4': 'the maintenance we do at the swim centers. The ALMA Unified School District swim centers. And we have a couple of parks that are assessment districts at Marina Cove and Bayport. This is more detail on our park maintenance. As you can see, we're a little over half staff costs.'",
        "'speaker_4': 'The remaining really is contractual services. So that would be things that our staff really can't do, such as tree trimming and significant bush trimming and pathway repairs, fencing, repairs, things like that. We also have a cost allocation of almost 10%.'",
        "'speaker_4': 'The other maintenance funds. So we do maintenance at Alamo Unified School District and Arsenal Swim Center and the Hudson Swim Center. So it's the cost of that. The hardball field is going down over the next few years. Because of that, we've entered into a contract with Alameda, Babe Ruth's baseball, and they are now fully maintaining that field'",
        "'speaker_4': '. But to help them with the transition, it's a five year contract that is declining in the amounts that we pay them each year. So this year was 40,000. What's budgeted for the next two years? Next year's 30,016. 17, it's 20,000.'",
        "'speaker_4': 'And then Marine and Bayport are both parks that we maintain but are funded through assessment districts. So the recreation fund itself, as you can see, it's mostly through fees for service. And those those that user fee schedule comes before you as a body every November.'",
        "'speaker_4': 'With those fees change, any changes in fees start January 1st because that's what works better for our programing. We really are careful to. Ensure that fees are raised incrementally and very thoughtfully with the approach of balancing keeping. Programs affordable for the residents, but also making sure we're keeping track of rising costs.'",
        "'speaker_4': 'So we're a little over 60% right now in terms of cost recovery for our recreation programs. So within this are you you've heard me mentioned before the mastic senior center advisory boards doing some projects are doing things like painting the exterior of the building, putting in fitness equipment on the interior, adding benches, adding tables.'",
        "'speaker_4': 'They're doing a new landscape plan, that's all. Be friendly, drought tolerant, drip. So with those. That those total costs for those projects are 230,000 in 1516 and 115,000, 16, 17. So what I am proud to say is that given that the rec fund is now at a slight surplus of 44,000 in 1516 and 47,000 1617, it's the'",
        "'speaker_4': 'first time that that's happened in a number of years. So we finally were able to balance our fees and bring down the expenditures over the last few years so that we're able to get it from when I came in, from $500,000 in the red to now at at a healthy budget.'",
        "'speaker_4': 'The other thing you'll notice is the cost allocation. It's at 13% and it increased significantly from 1415 to 1516. The reason is that really it was just trued up to what it should have been. And in order to compensate for that large jump, the general fund transfer, which the rec fund gets a set amount, that's a general'",
        "'speaker_4': 'fund transfer each year that was increased the exact same amount to compensate for the increase in the cost allocation to truist. In addition, in this budget cycle, we built in a to 2% cost of CPI increase. That now will increase the general fund transfer each year with the theory that that general fund transfer was was for programs'",
        "'speaker_4': 'that used to live in the general fund. So for example, Mastec used to have half their program budget in the general fund and half their program in the REC Fund. So we had staff that were in the general fund.'",
        "'speaker_4': 'So it made sense that the general fund transfer would continue to slowly increase by the cost of living each year because that was a burden we took off the general fund in terms of staffing, but we're having to maintain those increasing staff costs.'",
        "'speaker_4': 'Oh, let me back up one more thing. Leases, we have 4% leases and those least revenues are generated primarily from cell towers. We have a cell tower at mastic. When it Lydecker won it, cruising into it, the golf course, all of those fee revenues remain in the recreation fund and they're all used for one time maintenance items'",
        "'speaker_4': '. You'll see projects when the CIP comes up. But it's it's things like light EC or tennis court lights, replacement, complete resurfacing of the Washington basketball courts, pathway lighting and a couple of parks those types of and for emergencies.'",
        "'speaker_4': 'So the golf fund is revenue is 100% leases. Most of that is Greenway Golf. Part of it is also gyms on the course food and beverage service. The expenditures. Particularly in services and supplies really vary in this in this upcoming budget.'",
        "'speaker_4': 'And the reason is, is that we currently cities currently in negotiations with gyms on the course we anticipate to bring those lease changes to you by this fall the end of this calendar year. And in the current lease, the city pays all utilities for that restaurant.'",
        "'speaker_4': 'And we anticipate that will take that burden off the city and that the the lessee would then take on utility costs. And there would be other ways to balance that, to make sure it's equitable. But in anticipation of that, we took out the utility costs in this budget.'",
        "'speaker_0': 'Regarding leases, can you explain the increase fiscal year 1617?'",
        "'speaker_4': 'Yes, absolutely. Thank you. That was my next Segway. So the difference, 1617 is that we're in a long term lease with Greenway Golf. The first four years, they had a set revenue payment of $75,000 a year with the theory that with the thought that they're doing significant capital improvements right now, they're renovating the entire south course.'",
        "'speaker_4': 'It's currently closed, anticipated to open end of 2016. A lot of capital money. So therefore we gave them that rent offset starting in 1617. That's when the formula changes per the lease and they and it goes to 5% of gross revenue with a minimum of $300,000.'",
        "'speaker_4': 'So we know at minimum we'll go from 75 to 300000, and that's reflected in this. In this budget. And just to point out to because I get this question sometimes that all golf revenues that come in do remain in the recreation fund.'",
        "'speaker_4': 'And they are all dedicated to capital projects at the golf course and at parks. Or will be when we have some.'",
        "'speaker_0': 'And I'd like to add that I'm hearing good, good comments about how the rates are being maintained at the golf course.'",
        "'speaker_4': 'Great. Thank you. Yes, I've gotten great feedback as well. People are very happy with the Greens out there. This shows you for 15, 16 doesn't change a whole lot for 1617, our breakdown of revenues and expenditures. The General fund is it says general fund transfer, but really is general fund.'",
        "'speaker_4': 'So the 4.23 million. That's all of the park maintenance, that's the general fund transfer. And that you saw previously. The two and a half million is what our fee what we generate from fees for service in the recreation fund.'",
        "'speaker_4': 'As these charts combine all of the funds you saw previously and then on the expenditure side showing that the recreation fund really is the bulk of our expenditures, followed closely by followed by park maintenance. And this is 16.'",
        "'speaker_4': '17, which is. Fairly similar. So major capital projects coming up. We have the Jean Sweeney Open Space Park. We're anticipating it's a very rough number still, but we're anticipating it to cost roughly $10 million. We currently have $4.52 million, and that is through the $2 million from the developer's agreement with tuneless communities.'",
        "'speaker_4': 'And the remainder is through the active transportation program, which is state and federal funds. I have another pending grant of $2 million as well with the Land and Water Conservation Fund. One thing that I want to make sure is clear to the community is the and the council has the estimated annual maintenance costs.'",
        "'speaker_4': 'Those are being considered as we're building these parks. It's a critical component as we're building and renovating parks. So Jean Sweeney, Open Space Park in particular, it's 22 acres. It'll our largest park currently is Washington Park, which is 14 acres.'",
        "'speaker_4': 'So this is by far our largest park. So we anticipate it will cost an estimated $250,000 to maintain. Staff is working through concepts on how and we'll bring that back to Council on options on how to fund that.'",
        "'speaker_4': 'But that is something that that we should all be aware of as we're building this new park.'",
        "'speaker_0': 'Nebraska.'",
        "'speaker_3': 'Was that an annual number? The two, yes. Okay. I'll catch my breath in just a minute. Thank you.'",
        "'speaker_4': 'Well, for 22 acres, it's about two full time staff. So I don't know if I've said it in this body, but one of my favorite statistics is at Upper Washington Park alone. That's only Upper Washington. We have 57 trash cans to empty daily, and in the summer we empty them twice daily.'",
        "'speaker_4': 'So that takes staff and that's only upper Washington. So four times that number of trashcans for Sweeny Park. Asbury Park, we're estimated at 6.2 million. We're almost done with the detailed design and construction documents on that. We currently have two and a half million funds of those funds identified through a housing related parks grant.'",
        "'speaker_4': 'That was 201,000. We received a $1 million grant from the Housing Authority. We have $400,000 grant from Catullus or donation from Catullus. Several of our youth sports organizations have stepped up and are helping to assist. We have 400 500,000 for Measure, WW, East Bay Regional Park District and some remaining dwelling unit tax proceeds to close out that'",
        "'speaker_4': 'fund that we anticipate will cost roughly 100,000 to maintain. However, I'm quite confident in doing the numbers on that, that it'll be fully funded by our field rental fees because that will be a premium field as a lighted synthetic field.'",
        "'speaker_4': 'And so we can charge currently only charge $2 an hour, which is extremely low and we'll be able to charge significantly more than that. And I've talked to all the user groups that are aware of that, and they're fine with it.'",
        "'speaker_4': 'It's really more of a premier player, high end, you know, player games at that kind of facility and.'",
        "'speaker_5': 'BRODY Which is going to which you're finished to. What is the estimated completion on the estuary park?'",
        "'speaker_4': 'Well, we're not going to start it until we have the full funding for phase one and that funding. Right. Now, I'll get the engineer's estimate quite soon, but we're anticipating to be 3.7 million. So the remainder will be funded by development impact fees.'",
        "'speaker_4': 'So I expect to start construction in about a year.'",
        "'speaker_5': 'Okay. And then how long before it gets? I guess the bottom line is, when are we going to see our all-weather field?'",
        "'speaker_4': 'When do we get to run around and play on it? Construction would be about 9 to 12 months.'",
        "'speaker_5': 'About two years from now. Yeah. Okay.'",
        "'speaker_2': 'You talk a little bit about the development impact phase and how that works.'",
        "'speaker_4': 'Sure. The development impact fees. Whenever housing. Whenever any type. Whenever housing is built, there's a formula for single family units, multi-family units, and there's a component of those development. So they pay development impact fees to offset costs for streets, for sewers, for police, for fire, for library, and also for parks.'",
        "'speaker_4': 'And so there's. So whether it's single family, there's one formula number and multifamily, there's a different formula number. And so for each unit that goes into a fund that's held specifically to build parks, new parks, and there's an approved list of projects of which these are all on.'",
        "'speaker_4': 'Also internal boat ramp redesign. We received a grant from the Department of Boating and Waterways under the California Department of Parks and Rec, and it was a $300,000 grant. We're funding the $83,000, which is for the project manager out of the recreation fund.'",
        "'speaker_4': 'This is only to design will then be going back to boating and waterways for construction funds. And Rob's favorite projects, the Crazy Park Recreation Center. It's been a long time coming and it's fully funded by Measure WW East Bay Regional Park District, and we're completely redesigning that as a prefabricated building and anticipate bringing that forward to council'",
        "'speaker_4': 'within the next six months or so.'",
        "'speaker_0': 'And that's on that one, the 25,000 funded by rentals and program fees. Are there are those current program fees or will those be new fees?'",
        "'speaker_4': 'There are current fees in our fee structure. So we have a set fee already for to rent any of our recreation centers such as Bayport, Washington. Lydecker. So the Harrison Center, those are the ones we currently rent out.'",
        "'speaker_4': 'We expect this will be, you know, of a level, it'll have a kitchen, and so we'll be able to rent it as well. But the cost will be the same.'",
        "'speaker_0': 'Thank you. Welcome.'",
        "'speaker_4': 'One thing I wanted to add just briefly is we also under under capital projects have a number of park maintenance projects. And one that I'm excited about is is our animal annual playground replacement project. So in this next step will be replacing the playgrounds at Godfrey Park and at Woodstock Parks.'",
        "'speaker_4': 'And actually, within the next month, we're replacing the playground at Longfellow Park.'",
        "'speaker_0': 'Nebraska.'",
        "'speaker_3': 'Thank you. Thank you for that nice report. Ms. WOOLDRIDGE. And I just want to say, in looking over this budget, I feel that this is money well spent because it helps us create a healthy community to have good parks and recreation facilities.'",
        "'speaker_3': 'And it also there's there's kind of a tough to define an account for benefit of providing constructive activities for for all ages really. But we often hear that there's that the most dangerous time of the day is between three and 5 p.m. or three and 6 p.m. when the kids are out of school and you know, might'",
        "'speaker_3': 'be it at loose ends, but it's great to have these programs in the parks and abilities for young people and actually people of all ages to engage in healthy activities and stay fit. And we also are providing a lot of employment opportunities for especially for young people.'",
        "'speaker_3': 'When I think of your part timers and a long, long time ago, I was one of them. And I, you know, I worked at the day camps. I worked as a park director. And it was just an exciting opportunity to get training, great training, meet other young people from across the city and show up at City Hall'",
        "'speaker_3': 'twice a month to pick up my paycheck. And I want to commend Ms. Wooldridge, who has been really a grant application and receiving machine. We are, you know, very fortunate can do more with the grant revenue that we've received.'",
        "'speaker_3': 'So thank you. And the last point I just want to bring up, and I made note of this in a number of the reports, is that we all know we're in a drought and we've been asked by the governor and it's been said who supplies our water to conserve.'",
        "'speaker_3': 'So is there a plan underway with recreation department that to say replace toilets with some of the newer models that have? You can choose how much water you're going to flush and that sort of thing, at least as toilets need to be replaced.'",
        "'speaker_4': 'We have not yet identified funding for toilets. We have to be honest. So many of them, we've really focused our funding on on on actual irrigation systems and planting and replacing turf areas and passive use areas with drought tolerant plants and irrigation.'",
        "'speaker_4': 'And in our active areas, buying irrigation controllers, which then we can, you know, be more sophisticated and up to date on how we manage our water.'",
        "'speaker_3': 'So would it be possible to consider at least when a toilet needs, you know, maybe when you come to the choice between a repair that might be costly and just replacing it and, you know, saving substantial money and water at the same time.'",
        "'speaker_4': 'Yes. I will say that the our office building, we were just certified as a green business. And so we did replace the toilets there with the low flow toilets. So, yes, as we replace toilets, we intend to replace it with low flow.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'In other comments. Vice Mayor.'",
        "'speaker_6': 'I just had a question on this project manager at that is say you view that as. Driven by Sweeney Park and Estuary Park.'",
        "'speaker_4': 'Primarily. It's primarily driven by three projects Asbury Park, Sweeney, Open Space Park and the internal boat ramp redesign.'",
        "'speaker_6': 'Is there any consideration to making this a either a contract position or a temporary position and evaluating the need for a project manager once those projects are delivered?'",
        "'speaker_4': 'We we looked at a contract position. We can certainly look at that some more. I did quite a bit of research, and it's really difficult to find contract project managers that have the expertize in parks. That's something that we can find more in in a staffed project manager, and that's what we were looking at.'",
        "'speaker_0': 'I remember de.'",
        "'speaker_1': 'Sac on that for. You envision the this position also working on the recreation facility outfit as planned for Alameda point.'",
        "'speaker_4': 'What I envision this position is is budgeting it for these two years and really will be working with public works. We're going to need it for more than two years. Yes. I mean, we have a number of projects out at Alameda Point.'",
        "'speaker_4': 'Sweeney Park is going to take more than two years. Estuary Park is going to take more than two years. And. So what we can do is work with public works to adjust that percentage of how we're funding it, how we're each using it.'",
        "'speaker_4': 'Over the next, probably 5 to 10 years, we're going to have park projects that need park manager. A project manager.'",
        "'speaker_0': 'Brody.'",
        "'speaker_5': 'Thank you for the presentation. Just a couple of quick questions. I was going back to the the capital budget, the exhibit two of our packet today. So. The Sweeney Park is estimated to be completed by 2021. According to that plan, right?'",
        "'speaker_4': 'Yes. As an estimate.'",
        "'speaker_5': 'It looked like it was about was it close to half? Where do you anticipate finding the additional funds for both the Sweeney Park and the Estuary Park?'",
        "'speaker_4': 'Estuary Park? I expect to be funded the remainder funded by a combination of development impact fees and and grants. There's the Land Water Conservation Fund that I've mentioned. It's through the department, California Department of Parks and Rec. They're very excited about both Sweeney Open Space Park and Estuary Park.'",
        "'speaker_4': 'So it didn't it wasn't a good fit for the athletic field side, but for the community park side, it is. So once we're under a plan to go out for construction for that, I'll be applying for grants with them.'",
        "'speaker_4': 'We're positioned well for a grant with them for Jean Sweeney, Open Space Park. We'll actually hear about that in the next couple of months. But they're the same agency that recommended us as the top two projects to the National Park Service for a grant.'",
        "'speaker_4': 'So they do have eyes on on the Sweeney Park Project. The remainder of Sweeney Park will be through development impact fees and grants.'",
        "'speaker_5': 'Then the other question I saw that there's a a dog park at Bay Farm Island that will be to construct it. And I mean, how far along is that? Do we know where that's going to be?'",
        "'speaker_4': 'We're still looking to identify locations.'",
        "'speaker_5': 'Okay. Because that's something that a lot of people ask me about is that they don't have one out there.'",
        "'speaker_6': 'Mm hmm.'",
        "'speaker_4': 'And actually, that brings up another point. Estuary Park. We're also planning on putting a dog park on the community side.'",
        "'speaker_0': 'Four days.'",
        "'speaker_1': 'Two points. Two and a half points. The first point is, members, since I play tennis regularly, members who are participating in the competition, I guess there's teams I don't play on a team but but they pay a fee and all that.'",
        "'speaker_1': 'So one of the members asked me to to ask about the whether their fees that they pay are put into a specified budget account that then helps pay for tennis specific issues like for example, the lights if a light goes out, I mean, how does that work?'",
        "'speaker_4': 'It's not drilled down to that specific, no. So those tennis fees would be considered program fees. And so those go into the recreation services side of the budget, those fees for services of two and a half million. If a light goes out that comes out of the park maintenance budget or other cell tower revenues or those types'",
        "'speaker_4': 'of funding streams. Yeah.'",
        "'speaker_1': 'Okay. Now, the other issue is so you've got the general fund portion of the Parks and Rec, mainly recreation, but then there's also some general fund transfers that go to like recreation fund and and that's like $1.6 million projected for 1516.'",
        "'speaker_1': 'And $155,000 for the other maintenance funds. So that's roughly 1.6 million, $1.7 million. So I think this is more of a legal question in the legal question and something to think about and not necessarily have a definitive thing.'",
        "'speaker_1': 'But, you know, we've talked about increasing possibly the UUT is it ever possible to increase revenue center like a UUT at first to pay for X capital costs like closing whatever gap or the Jean Sweeney and then keep keep them.'",
        "'speaker_1': 'But once that's closed then. Of that same source of revenue, then pay for operations. I mean, that's a legal question. I don't know if you know, but because that way we can then perhaps then backfill the general fund dollars that are going on top of the usual general fund, but backfill the.'",
        "'speaker_1': 'Other general fund other maintenance fund backfill that with possibly that and then free that up to help pay for. I mean, it's I know that would work.'",
        "'speaker_2': 'It really depends on how you met Amir. It depends on how you specify the language in the ballot. Right. So if you if you if it's a general tax, which it is currently, then you can use it however you want.'",
        "'speaker_2': 'But if you specify it, then and you know that that takes a two thirds, if you specify how the money is going to be used, then you can't you have no you have no ability to change how you're going to use it in the future.'",
        "'speaker_4': 'And to clarify, because you were pointing out 155,000 in the transfer that separate those are for for for operational costs which is separate from the capital cost for the for Sweeney Park, for example.'",
        "'speaker_1': 'Okay. Great. Thank you.'",
        "'speaker_0': 'I have a question in regards to the skate park. I've been asked to look into having lights there. You hear that there aren't any activities for young adults and people that use that and there is security out there currently.'",
        "'speaker_0': 'So we could consider getting some lights. I think that that would expand the opportunities.'",
        "'speaker_2': 'I'd like to ask Miss Ott, who I know is probably wasn't listening, but lights at the skatepark. Is that a least tern issue?'",
        "'speaker_4': 'No, we've. They scared me to answer that.'",
        "'speaker_2': 'The light.'",
        "'speaker_4': 'We've looked into the Eastern issue in lighting because the skate park is where the sports complex would go. And so we've already looked into lighting because we would expect a sports complex and fields to be lighted. So we've we've done that lighting analysis.'",
        "'speaker_7': 'Jennifer Short Chief Operating Officer There are restrictions in that area, as Amy said, that are all in very specific about what kind of lighting there can be, how tall the poles can be. In some areas, they're actually restricted for having nighttime lighting at all.'",
        "'speaker_7': 'So it's something we could look into, but we'd have it would be unless you know for sure that we couldn't do it, but it'd be difficult. We'd have to follow all the biological restrictions related to that.'",
        "'speaker_0': 'So maybe they could be low. But I do know, you know, we have a very active community. In fact, all ages are out there. And if there is a way to add lighting and since we have security out there anywhere.'",
        "'speaker_2': 'We can.'",
        "'speaker_0': 'Take a look at look into it. That lovely.'",
        "'speaker_4': 'Yes, we can look into it. Regarding the lease terms we've done with with Jen's Jennifer's lighting expert, you know, we've looked at the the lumens and how lights now are athletic. Lights are pretty targeted. So we can really focus it where we need it.'",
        "'speaker_4': 'Part of my goal with the sports complex is to is to expand on that skate park and also add BMX behind it. And so so that is a long term goal. And so the lighting may be part of that.'",
        "'speaker_1': 'On the topic of targeting lighting for sure that that's true because that and I mean this in a humorous way at the group I was playing on the tennis cruisy park tennis courts last week on Thursday, and it was an evening.'",
        "'speaker_1': 'And we noticed that because there are three courts, the lights are on each side, so they're not in the front and the back but on each side. So a light goes from one or goes to the second and third court, but it doesn't hit the first court.'",
        "'speaker_1': 'It was going.'",
        "'speaker_8': 'Why is this court so dark?'",
        "'speaker_1': 'And we we looked up, we realized, oh, the lights. So anyways.'",
        "'speaker_4': 'So that's good feedback. The point.'",
        "'speaker_1': 'Is that lights are targeted as well.'",
        "'speaker_4': 'Indicated. Right. And another good point on that just briefly, is that part of the cell tower revenues were we're adding pathway lighting. There's currently no pathway lighting at Cruisy Park. So if you're playing tennis, you're in the lights until 10:00 and then you have to walk in the dark to your car.'",
        "'speaker_4': 'So we're adding pathway lighting to make it more safe for residents.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Which will be low. Right.'",
        "'speaker_4': 'They'll be just like all the other pathway lighting. Correct.'",
        "'speaker_0': 'Any other question, vice mayor.'",
        "'speaker_6': 'What happens if you don't get your position? You're asking for.'",
        "'speaker_4': 'The the project manager specifically.'",
        "'speaker_6': 'And both of them.'",
        "'speaker_4': 'The other piece is the for the park for person position. We would then be hiring as a park park maintenance worker instead, which is our existing structure. And what's the impact of that?'",
        "'speaker_6': 'Yes.'",
        "'speaker_4': 'The impact of that is so our parks are our parks are old. You know, Jackson Park was built in 1903. We have very old infrastructure. That's the wonderful thing about our parks is the history. And but for us from a maintenance side, it's also the challenge of our parks.'",
        "'speaker_4': 'Little John is a fantastic example we struggle with. It took us. We had a leak there last summer, a water break. And in the irrigation, it took us almost four weeks to find it because it's 3 to 4 or five feet deep, because we keep adding soil on top of it as we keep fixing the dirt and'",
        "'speaker_4': 'fixing this the lawn. And we don't have plans for a lot of our parks because things were built before plans got lost or it's just so old and there's such deferred maintenance. So what would happen is we we've struggled this past year to especially with our two vacant positions, we've backfilled with a lot of part time work'",
        "'speaker_4': '. So we would aim to maintain where we're at. But if we keep maintaining work, we're quickly getting past the point of being able to to keep the parks at that level without doing some some deferred maintenance to really get it up.'",
        "'speaker_4': 'So if we get a four person, they can start doing projects and have bring in an expertize, for example, on irrigation, which a lot of our current guys don't have. And if we bring in a four person, we can get irrigation more efficient, we can get it more up to speed of of where we're currently at with'",
        "'speaker_4': 'the technology and we're so far behind it.'",
        "'speaker_0': 'Staff looking for direction on kind of item. I think like feedback from yes.'",
        "'speaker_2': 'We would and I think you know we're presenting these the budget to you and and we'll listen to your feedback and then we'll be bring we'll bring back the final next on Januar on June 2nd. So if you do have comments, we'd like to hear them tonight in my speech.'",
        "'speaker_6': 'And the purpose of my question is not to tell you how to. How to do it is more of a what. What happens if we approve a budget but said no new positions? They where we are.'",
        "'speaker_4': 'In the parks you would start if we start lose if we can't fill our existing classifications that are vacant. You will.'",
        "'speaker_6': 'See that's a different I'm talking well.'",
        "'speaker_0': 'That's before person.'",
        "'speaker_4': 'Is not a new it's not.'",
        "'speaker_6': 'It's it's.'",
        "'speaker_4': 'Not a new body.'",
        "'speaker_6': 'It's an it's a it's it's same position. But you've upgraded it, right?'",
        "'speaker_4': 'It's a different classification.'",
        "'speaker_6': 'It's an understand.'",
        "'speaker_4': 'Right, right. It's a different class. It's a it's a bumped up classification.'",
        "'speaker_6': 'And I think you gave a reasonable explanation of what happens if we don't. And that's that's all I'm looking for. I'm not looking for a solution. That's your job. Right. But the idea is to if we've got a position, it's like the project manager position.'",
        "'speaker_6': 'What happens if you don't hire the project manager?'",
        "'speaker_4': 'We and we consult. We get consultants and we do it. And what it means is it's more on my plate in terms of of what I'm trying to balance with running a department and managing projects. So, for example, with Cruzi Park, I have a consultant on board a project, manage that and it's been pulling teeth.'",
        "'speaker_4': 'It's taken a lot of my time, even just a project manager, because she has other priorities. We're not necessarily her priority. This project isn't her priority.'",
        "'speaker_6': 'Thank you, Madam Chair.'",
        "'speaker_2': 'I also would like to say something about the project managers. I think we're going to hear again in public works about the project managers in the last three years. I have noticed, particularly in the capital improvement program, which is this document that you that you have in your packet, we have had projects on our books for a'",
        "'speaker_2': 'long time that we have not been able to get to. And frankly, one of the one of my comments was, why would we give you money if you can't do the projects that, you know, we we give you money, but you can't complete the project.'",
        "'speaker_2': 'And I think what you're seeing now from both recreation as well as public works, is an attempt to actually get those projects done. We have a lot of things that we need to get done. We just didn't have the manpower to do it.'",
        "'speaker_2': 'And so this is our opportunity to actually get those bodies here to actually finish some of those projects. And I think this is an example of that.'",
        "'speaker_4': 'And a tag off of that. One more very concrete example is Cruisy Park Recreation Center. So we, my predecessor, chose to manage that project himself. He didn't and I don't have the skill set to do that. So what happened is we spent $250,000 of measure WW developing those plans.'",
        "'speaker_4': 'We went out to bid it was 40% overbid because it was not realistic, because it wasn't managed by a person who knew what they were doing. I can't really manage something like Sweeney Park to the level of the way it needs to be managed and really do it properly because I don't have the skill set.'",
        "'speaker_4': 'So that's a very real example of of why you need the right people managing projects.'",
        "'speaker_0': 'You want to finish, vice mayor?'",
        "'speaker_6': 'There was. I just have a follow on. Is that. And this is maybe a topic for. Kind of the wrap up, the overall on the high level are things that are transient, that are one time, because once the recreation center is built, I'm sure there's other projects, but there's a certain amount of work that no longer has'",
        "'speaker_6': 'to be done because it's built. There's another type of work that happens. So and then for deferred maintenance, it's the same thing that there there are certain projects that are basically rebuilds, but once it's done, then it's operations.'",
        "'speaker_6': 'So. I don't expect us to figure that out tonight, but I'm just trying to make sure I keep in my mind what are what each of those buckets are.'",
        "'speaker_2': 'Right. And I think also, Madam Vice Vice Mayor, the public works director, is also going to be showing bringing to you tonight. We are they actually contracted with a firm to look at all of our deferred maintenance of all of our buildings.'",
        "'speaker_2': 'And it's a pretty extent well, it's not done yet. I'll come back to you in the fall, but it's going to be a pretty extensive list. So I think they're going to be plenty of projects in the future for us to to work on.'",
        "'speaker_3': 'Member Ashcraft Thank you, Madam Mayor. I think the question the Vice Mayor asks is a good one, and I would appreciate every department here that's presenting to always look at that. For instance, we talked about it and the question came up, do you outsource i.t.'",
        "'speaker_3': 'I've talked to a number of people from other organizations since we had that meeting about the pitfalls of excuse me outsourcing i.t. But we're not talking about that tonight, but it's good to at least consider the question and give us the reasons.'",
        "'speaker_3': 'As I always tell you, make your case. And I think we all look to you for the expertize and the guidance, but we do need to ask those questions when we come to considering adding extra bodies at the same time in recreation, we are adding some new recreational facilities and it's really exciting.'",
        "'speaker_3': 'But Jean Sweeney in Estuary Park, the install boat ramp and eventually we'll have Alameda point on line two. So I think it would be unrealistic to think that we can stay the same size as our staff, especially a staff that has already experienced attrition and yet effectively manage these resources.'",
        "'speaker_3': 'And it's not unlike managing your own house. I live in one that was built in 1881 and there's always a project and if you leave them go for too long. We all know that you end up paying and you probably end up paying more.'",
        "'speaker_3': 'So I really appreciate the the analysis you've done. And, and I will look to you for guidance and to keep those grant applications coming. Thank you.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_5': 'Thank you, Madam Mayor. So. Looking at the list of the CFP projects like the Sweeney Open Space is supposed to be finished in 2021, right? So I guess I'm still also a little unclear. Now, after we've done Estuary Park, Jeanne Sweeney, it's another boat ramp.'",
        "'speaker_5': 'Some of these public works projects that, you know, in the next five years, you know, what is the project manager going to be responsible for after that?'",
        "'speaker_4': 'A couple of things. One is we still have Enterprise Park out at a later point. We still have a sports complex. But the discussion with public works has also been that they also have a strong in. You'll hear about the need for public for project managers so we can start shifting that maybe it becomes 25% parks and'",
        "'speaker_4': '75% public works. We can shift the funding and shift the priorities of the types of projects they're working on. It doesn't have to always be parks.'",
        "'speaker_5': 'Is that? I kind of share the vice players concern. Interested in hearing if that's alleviated or he still has those concerns.'",
        "'speaker_0': 'I'd like to. You mind if we continue? Okay.'",
        "'speaker_4': 'I just.'",
        "'speaker_5': 'I'm still not quite, quite there yet.'",
        "'speaker_6': 'Later, I think, when we finish the presentations tonight, I. I have also some homework, which is along the same lines from the last meeting. And I wanted to talk about our general fund reserve. $30 million and how it might apply to some of the things that are being presented now.'",
        "'speaker_6': 'Some of those things that are. Again, I'm trying to shift in my mind what is the short term activity and what's an operational activity one time in short term or relative terms? Because you just listed a series of projects like five or six years and in the end we have the employee.'",
        "'speaker_6': 'And are there going to be other projects at some at some point? That that's either going to end or continue on and. That, I think. Well, when we talk about a project manager. Again. That's why I ask the question does it make sense to do that with a contract that goes with the project and maybe get the'",
        "'speaker_6': 'right person? Or does it make sense to hire an individual who's a project manager who has expertize in parks but now is going to be working for public works eventually? We?'",
        "'speaker_0': 'Mr. Honest.'",
        "'speaker_6': 'Yeah. My name is Bob Haun, Public Works Director. The assumption was, is the project manager that has been kind of allocated towards Parks and Recreation would be absorbed by the public works department at the end of the two year budget cycle and less still needed by the parks.'",
        "'speaker_6': 'Again, we can titrate that might be 5050 or something like that. I think you're going to see, especially when we bring the list of facility improvements back in the fall, that there's a significant amount of work to do.'",
        "'speaker_6': 'I'm starting off the project management group at a very slow pace. Okay. So we're we have a project manager three now we're asking for a two in our budget and a one in our budget to kind of get the full range.'",
        "'speaker_6': 'And the assumption was, is in a couple of years when this too has completed the parks projects, they would be reabsorbed into the public works department. I would be comfortable with the skill set. I mean, any project manager is going to have a project management skill set that I'm really looking for as opposed to a specific expertize'",
        "'speaker_6': '. And well, I only do parks or I only do buildings or something like that. There's a component of project management that they're going to manage a project and their job is to get it done as quickly as possible, as cheaply as possible, and move on to the next project and get that going.'",
        "'speaker_6': 'And I think this is what I'm trying to build within public works, is this ability to get these projects done quickly and move on to the next one. And so the assumption was and part of the reason we are keeping 25% of this individual in public works is a there's an educational component in public works.'",
        "'speaker_6': 'They're going to be I mean, they're going to be educated about project management. They're going to be educated about contract issues, general condition issues. As state law changes, we have to incorporate that into the project management group. And so.'",
        "'speaker_6': 'They're going to be kind of working for public works 25% now. So they're going to get a flavor of public works. I don't think you're going to find somebody that exclusively parks because they're just not out there. There isn't a project manager that just does parks.'",
        "'speaker_6': 'We could certainly in part of the recruitment process, we're going to be asking the question, listing your project management experience. And one of those questions will be parks experience. And we're using that as kind of a way to zero in that particular individual.'",
        "'speaker_0': 'Thank you. Member day.'",
        "'speaker_1': 'So thank you. I hear the concern being raised about positions that have specific tasks and that their positions then continue even after the tasks finish. In listening to the presentation and I think what helps me is the fact that the particular position that we're talking about, the project manager position that we know for sure in this coming'",
        "'speaker_1': 'fiscal year and the next fiscal year, that it's that it's not general funded, it's not part of the general fund. There's no impact on the general fund. And I suspect that the nature of the work. Immediately beyond 16.'",
        "'speaker_1': '17 is not dramatically different than what is contemplated for 1516 and 1617 that it is still going to be dealing with these large park projects or anything similar to it. Meaning that perhaps in 1718 it will still not be part of the general fund and maybe even a.'",
        "'speaker_1': 'Into 18, 19, I mean. Well, certainly that might be a realm of speculation for sure. We know that in the 15, 16 and 16, 17, the project manager position being discussed is not subject to the general fund. It says so right there in the presentation.'",
        "'speaker_1': 'So that that's the saving grace.'",
        "'speaker_0': 'And we're. Oh.'",
        "'speaker_5': 'I'm sorry. So I didn't really give an idea and direction I'm willing to give half right now. So I think the the four person position is important to do. And, you know, I'd like to again wait to the end before we talk about the project manager, before I can give an opinion on that one.'",
        "'speaker_3': 'Nebraska is a clarification question regarding Councilmember de SACS comment about no impact to the general fund. I understand that this would come out of recreation budget and somewhat shared by public works, but what about the cost of benefits and retirement, that sort of thing?'",
        "'speaker_4': 'That's all included.'",
        "'speaker_3': 'Or included in and none of that touches the general fund.'",
        "'speaker_4': 'And correct me if I'm wrong. Even public public works most of that's not just most of public works is not funded by general fund. So project managers are funded by the the project.'",
        "'speaker_0': 'And Ingrid?'",
        "'speaker_6': 'Yes. As you are well aware, most of our projects are funded by outside sources. Okay. Very few of the public works projects, the traditional street sewers, stormwater is completely funded from outside sources. Okay. We don't expect the only impact that we would have on the general fund.'",
        "'speaker_6': 'Eventually, if you decide to go there is this facilities assessment that we will be completing and bringing back to you in the fall. It's going to be up to you because that's a general fund item and it'll be up to you to decide what level.'",
        "'speaker_6': 'You want to address on those facilities, but we're kind of getting involved in the works right now. An American.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_6': 'Just a reality check here. We've run through one department, 705.'",
        "'speaker_7': 'So I'd like to be able to comment.'",
        "'speaker_6': 'I just wanted to, too. And I wasn't targeting you with that, but I just want to.'",
        "'speaker_3': 'Pick up the pace.'",
        "'speaker_6': 'And pick up the pace. Sorry.'",
        "'speaker_0': 'Thank you. And on that note, I'd like to say that I actually fully support both of these positions. One of your slides showed significant previous cuts in the last ten years to our parks. I think Rec and parks is extremely important to Alamitos.'",
        "'speaker_0': 'I think we take great pride in them and we want them maintained. And I think you're doing a terrific job, especially with all these cuts that have included six full time staff in the past ten years. Unfortunate, I think, what I've seen from the presentations last week.'",
        "'speaker_0': 'Was that some departments were able to access over time. Others access consultants, others access part time employees. Some overextend salaried employees to address the situation of these vacancies. I personally would rather fill the vacancies. I fully support your suggestion of replacing a park maintenance worker with a four person position.'",
        "'speaker_0': 'I like training from within so that they are qualified to promote from within, if at all possible. But I, I think that at the end of a term that was used last time was phantom savings in some departments and fairness and equity to all of our departments and providing what's important and not overextending our staff.'",
        "'speaker_0': 'I think I personally will support these vacancies probably.'",
        "'speaker_7': 'All.'",
        "'speaker_0': 'Throughout the budget. Whatever you guys recommend. My summary.'",
        "'speaker_3': 'Yeah. And I want to see the analysis looking at it from both directions, but.'",
        "'speaker_0': 'Well heard. Yeah. Yeah. Thank you. All right, so let's finish up this presentation. Thank you very much. And we'll move on to the next one. Thank you. Next is library. Is that correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_7': 'It evening, Mayor Spencer and members of the City Council. I'm Jen Psaki, library director. And I'm pleased to be here this evening to tell you about our library and present our recommendation for the budget. Okay. How does this thing work?'",
        "'speaker_7': 'Forward and back. But what if I pointed at.'",
        "'speaker_2': 'Something.'",
        "'speaker_7': 'Technology. You got to love it or not. Right now. All right. Who we are. We are a relatively small organization. We have a main library and two neighborhood libraries. We have five divisions within our library system. Technical Services is kind of an old school term in libraries for the ordering and cataloging of the materials.'",
        "'speaker_7': 'And over the last probably 12 years or so, it's also the division that has taken on the information technology, the computers and things like that. Children's Services is really the meat and potatoes of any library system. They are the most well attended program and the hardest working division within the library.'",
        "'speaker_7': 'I think circulation is very straightforward. It's the check in, check out maintenance of the collection, getting things back on the shelves after it's been returned. Adult services includes teen services, and our supervisor of adult services also manages the two branch libraries.'",
        "'speaker_7': 'So that's why you've got the little tree under that supervising librarian. She oversees both branch libraries, as well as the adult services division at the main library. You know, the one thing I forgot to say about that is when we moved into the new main library in 2006, we moved into a facility three times the size of'",
        "'speaker_7': 'the interim facility without adding any full time staff members at the time. The thought was, well, you can manage with what you have. And we did. We made do with what we have, but we can only do so much with that number.'",
        "'speaker_7': 'Our fire, our four divisions, our library administration, which handles personnel and accounts payable, and all the things you see on the list. Administration consists of one library director, myself, an executive assistant, a full time custodian, and 1.1 part time maintenance assistant.'",
        "'speaker_7': 'Library operations is the meat and potatoes. Most of our money goes into that division. Almost all of our employees are in that division. That's the division that does the programs that the public attends. It's the division that maintains all the hardware that's in our building.'",
        "'speaker_7': 'It's the division that purchases, catalogs, processes all the materials that are in the collection and does all those special programs that you see the library out there with. There's four supervisors, one for each of those main divisions from the previous slide.'",
        "'speaker_7': 'Three senior librarians. One at the main, one at each neighborhood library. One librarian. He's our teen librarian. And then seven library technicians that are spread among the divisions. Then we have approximately 40 part time employees. We could not operate without our part time employees.'",
        "'speaker_7': 'Even the hours that we have at only the main library could not be done with just the full time component that we have. When the library is asked to reduce the budget, it always means cutting hours, which always means cutting part time people.'",
        "'speaker_7': 'Our theory has always been we'd rather keep the body and cut the number of hours they work and they like the work environment so much. Most of the part timers agree to working fewer hours so that they can have a job, so that if the good times come back, they can have the job and add their hours'",
        "'speaker_7': 'back. But that hasn't happened.'",
        "'speaker_0': 'Hey, before you move on, we have 40 part time employees and that is because you don't have the funds to extend the hours or that those used to be.'",
        "'speaker_7': 'They were never full time.'",
        "'speaker_0': 'So do any of them receive benefits?'",
        "'speaker_7': 'No.'",
        "'speaker_0': 'So is this one of our departments that are high on the part time employees that don't receive benefits?'",
        "'speaker_7': 'Yes. I believe we're right behind recreation with having a lot of part time employees and none of ours are seasonal.'",
        "'speaker_0': 'Some of these I'm sorry to interrupt, but I think that is a difference. It's rec and parks, seasonal because they have programs during the summer, for instance.'",
        "'speaker_2': 'I think some of the maybe Miss Wooldridge can answer this, but I think some of the rec are year round. But there are a good number of seasonal. We're talking about part time employees. Do you have year round, part time employees or just seasonal?'",
        "'speaker_4': 'We have both because we have folks, for example, who may work in our after school program from 3 to 5 roughly, and then also may choose to work in our summer program.'",
        "'speaker_0': 'So this is an issue for me in regards to having part time employees that we don't pay benefits to. That seems to be a practice to limit costs. And I bring this up because there has been discussion from this council in regards to investing in Wal Mart whether or not we're having our funds be invested somehow in'",
        "'speaker_0': 'Wal-Mart. Whereas to me, the issue is much closer to home. I would like to look at. The savings are how we do business in regards to having how close are they being 30 hours a week or what is the cutoff?'",
        "'speaker_0': 'What type of employer is this? Is the city. So I would like staff to report back on that.'",
        "'speaker_7': 'Okay. None of our part time employees work more than 27 hours. We do have employees who work two Sundays a month, so they may only work 10 hours a month. And then we have some that work the full 20, 27 hours a week.'",
        "'speaker_7': 'And so it varies. Almost all of my part time employees work other jobs, so their availability isn't exactly what we need from one individual. So that's why we have so many.'",
        "'speaker_0': 'And I appreciate that. My concern is whether or not we are. The type of employer that we don't want to be. Thank you. Yes. Member Ashcroft.'",
        "'speaker_3': 'So just changed his tune on a larger issue because, of course, we don't want to favor one department over the other. Are you suggesting we should maybe do away with part time employment?'",
        "'speaker_0': 'I don't believe I said that. What I said was that I'd like to look at part time employees. In fact, I would actually want to look at them across all of our departments. I am very concerned when we sit up here and we talk about not investing in Wal-Mart because they keep their employees supposedly under a certain'",
        "'speaker_0': 'mark and don't pay benefits. I don't want us to be in that position.'",
        "'speaker_3': 'All right.'",
        "'speaker_0': 'It doesn't speak to employees that want to work only Sundays and whatnot. But if we have a practice of keeping employees below whatever that number is and don't is at 28, is that when do we pay benefits or 30?'",
        "'speaker_0': 'When does the city.'",
        "'speaker_7': 'Well, I don't know about the city, but we always run with 27, so it just kind of works with the way our scheduling works.'",
        "'speaker_0': 'So rather so for me personally, I'm not as concerned about investing in Wal Mart as an investment. I'm much more concerned about how we treat our employees as a practice.'",
        "'speaker_3': 'So I would just make a distinction. There was Wal Mart. I think their profit margin is probably greater than the city's. But, you know, we're going to go through these budget discussions and we know there's only so much money to go around.'",
        "'speaker_3': 'So but that's a fair question to consider.'",
        "'speaker_5': 'And I don't think we're we're intentionally keeping people under a certain limit to deprive them of benefits either. I hope that that was not the accusation that came from the middle chair.'",
        "'speaker_0': 'What I'm saying is I'd like to look at that if, in fact, we have if we pay if the city pays benefits at 28 hours and we have quite a few employees at 27, I don't think that number is just arbitrary.'",
        "'speaker_2': 'The number is actually 30.'",
        "'speaker_0': 'All right. So whatever the number is. But I actually want to look, we can.'",
        "'speaker_2': 'Take a look at that. I think the other thing is.'",
        "'speaker_0': 'You know, I actually don't think it's necessary to suggest that that's not an issue to be looked at. I think it is important. And I'd rather just proceed with the question and have staff respond to it. Thank you.'",
        "'speaker_0': 'Is there any at this point? Let's continue. Thank you.'",
        "'speaker_7': 'Thank you. And our other two divisions in the budget is adult literacy. Adult literacy is two part time employees and about 30 or 40 volunteers monthly. It's our program with the State Library to train people to be tutors for low, low level reading skills.'",
        "'speaker_7': 'Although our program MM Reads has far exceeded just teaching reading, they teach life skill classes, public speaking, writing. They hope next year, with their 35th anniversary of existence, to publish a book of some of their learners writings. So they do a lot.'",
        "'speaker_7': 'And it's all funded by the State Library, except for the two part time employees. That's the part that comes from the city, and they're housed in the veterans building. So that's part of our match back to the State Library.'",
        "'speaker_7': 'That funding was cut out of the state budget. We're hoping Thursday with the May revised from the governor that he put the literacy funding back in. That was the big push from the libraries across the state this year.'",
        "'speaker_7': 'The memorial fund is really a fund that receives monetary donations to the library from individuals, organizations or as support groups. It's very straightforward. We don't pay personnel out of that fund because it ebbs and flows. Some years we receive more donations than others, and some years we don't receive.'",
        "'speaker_7': 'At all. So. That's how that fund works. We have three library support groups. The library board is a chartered board. There are five volunteer citizens appointed by the mayor. It's four year terms. They can be reappointed for an additional four year term.'",
        "'speaker_7': 'They act as stewards for the library. They advise on matters of policy. They go over any new policy that the library has. They had their big work in the last few years in working with the library building team, in building the new main library and the renovations of the two branch libraries.'",
        "'speaker_7': 'And now they've had a chance to go over our strategic plan and do an update on the strategic plan. And we're going to have two new members coming up. You'll see an appointment coming your way, Madam Mayor. And so they meet every other month on the odd number of months.'",
        "'speaker_7': 'The Library Foundation was formed in 1998. They provide support for both long and short term needs. They have established an endowment. They receive donations from individuals. They solicit donations from larger organizations, corporations. And they sponsor events at the library of a cultural nature.'",
        "'speaker_7': 'Educational programs. The Friends of the Library was formed in 1973. They originally formed to try and get a new main library built. They're there to increase public awareness of libraries. They support the library by fundraising for all our special programs.'",
        "'speaker_7': 'They have the twice a year book sale at the club, and thanks to the rec department, the cost of using that space is very low. They also run Dewey's cafe that you see pictured there. It's all volunteer run.'",
        "'speaker_7': 'We set it up with the construction of the library and they handle all their staffing, all their purchasing, all their banking. And it's been great. Originally I was told that would work for two years and the volunteers would all walk away.'",
        "'speaker_7': 'And here we are coming up on nine years and they're still going strong. It's one of the most beloved corners of our building. Over the years, over the last five years. The friends have donated about $180,000 to the library.'",
        "'speaker_7': 'That money is primarily for the special programs. The puppet shows the printing of fliers, paying for refreshments for various programs that you attend. Without the friends, we wouldn't have any of those special programs. The foundation has given the library about 145,000, almost 146,000, including the 50,000 for our materials collection that we received last December.'",
        "'speaker_7': 'And the two organizations are currently in talks to possibly merge into one. That's not finalized. We'll get a report on that later this week to the library board. So it's a possibility we'll have one support group, but both are highly valued by the staff and they have done great work for us.'",
        "'speaker_0': 'Or move on. If anyone is interested in serving on the library board, please submit your application to our city clerk. Yes. Thank you.'",
        "'speaker_7': 'We're a fun group for a library group. Some people think libraries are boring.'",
        "'speaker_0': 'But we don't.'",
        "'speaker_7': 'Well, good, because I don't think libraries are boring either. We have a couple of large initiatives coming up. We are looking to purchase a new integrated library system. It's the software that manages everything the library does from check out cash handling or online catalog ordering.'",
        "'speaker_7': 'It does everything for us until we actually pick something we don't have. Across the ballpark would be 250,000. If we were to pick something that's open source, but that would require a lot more care and feeding on our end and people with the expertize to manage it to possibly 500,000.'",
        "'speaker_7': 'But we do have the funds in the remaining measure o account or fund measure. So was the money used to help construct the new main library and do the renovations on the two neighborhood libraries? We're using it for capital expenditures and the previous finance director, Fred Marsh, confirmed that the purchase of an ELC would qualify as a'",
        "'speaker_7': 'capital purchase and certainly the release of the RFP and the selection of the car to us. What's the word? Bringing the contract would come to the Council for approval. The other really big initiative for us is the state library's high speed broadband initiative that they call lighting up libraries.'",
        "'speaker_7': 'At the last budget session. Our IT division reported that the library has upgraded our wireless, which is true. We completed that project about three months ago and we have upgraded our thin clients. So that it would work a little bit better.'",
        "'speaker_7': 'Currently, the speed of our system is 18 megs, which is faster than you would have at home. But it's not very fast, especially when you have that many users on. With this project, we would have one gigabyte of speed at each library location.'",
        "'speaker_7': 'So we'd go from 18 to 1000, so 20 times as fast as we are now. This is made possible through the State Library, through an organization called Scenic. Scenic is the Corporation for Education Network Initiatives in California. They currently have most schools and universities in California on their high speed backbone, and it was only with a lot'",
        "'speaker_7': 'of work from libraries for us to say, hey, public libraries should be on this too. And so the state decided to put a couple million dollars into the budget for the State Library to work with. We did get in on the first round.'",
        "'speaker_7': 'It cost approximately 30,000 to start up, but we received 24,000 from the State Library as grant funding to help with that startup cost. We hope by the end of the calendar year that we will have that up and running.'",
        "'speaker_7': 'There was also a comment that memory sticks don't work in the thin clients and they do. The project was completed in January. We have not had a complaint that was logged by staff that a memory stick has not worked in the thin clients and it's hard to know that it's a new thin client because we didn't replace'",
        "'speaker_7': 'the screen. We just replaced the client that attaches to the back of the screen. We're also working on our lead certification. Our current building is LEED Silver for new construction, and here we are several years down the road.'",
        "'speaker_7': 'So we're looking at our lead classification again and we're currently submitting our application for LEED for existing buildings. We've submitted the application wants to go for LEED Gold and we're currently working on the response to the credits that were not approved.'",
        "'speaker_7': 'We hope to have the lead project completed by June, so we'll see how that goes. Our consultant that we have through Stop Waste is very optimistic that we will achieve gold status. Having a lead building is very expensive as we went through this process, part of it parallel but separate.'",
        "'speaker_7': 'We two became an Alameda County Green business. We've changed all the aerators on all our sinks and we've adjusted the flush rates on our toilets. But buying toilet paper that is LEED approved buying hand soap that is green certified is very expensive.'",
        "'speaker_7': 'We went from like $50 for four gallons of pink hand soap to $100 for four gallons of yellow hand soap. But it's LEED approved. And so if you want to have a lead building, you have to be prepared to spend more money on it.'",
        "'speaker_0': 'Thank you for clarifying that, because it's not just the construction, it's the clean supplies and everything else.'",
        "'speaker_7': 'You have to maintain your building. You can't just have it and continue to say your lead because things change over time. The mechanicals may not function to the level they were when you first opened and things like that.'",
        "'speaker_7': 'Continue on. Our other two big initiatives is our words on we'll library book bike. That's what it looks like. It's a handmade Hailie tricycle. They're made in Philadelphia and they open up to have shelves. We are going to have a wireless hotspot with it.'",
        "'speaker_7': 'The rider will also have an iPad or some sort of tablet that will come back through our aisles system and be able to offer library cards, answer reference questions, checkout materials. So we're envisioning this not to just write in the 4th of July parade, but on a sunny day, maybe go down to the beach and offer a'",
        "'speaker_7': 'beach reading at the Earth Day Festival. Go go down to the festival with books on Green Living. We would use it to go to the head starts that we already go to during the summer, out to the parks for our teddy bear and teddy bear picnic readings.'",
        "'speaker_7': 'We're really looking forward to having it. And our big plan is we're going to write it into the council chambers when it gets here. We've been informed that it was.'",
        "'speaker_2': 'Supposed to be a surprise.'",
        "'speaker_7': 'It will be because it hasn't arrived yet. They finished construction. They put the last coat of paint on it, so they should get it on a train to us soon. Shipping by train was less expensive. It was purchased with grants from Target and the Rotary Club, including all the safety equipment and the collection.'",
        "'speaker_7': 'So we're really looking forward to having it. If there was ever a town that should have a library on wheels, it should be Alameda. And then we're doing a thousand books for kindergarten. It was a pilot program about a year and a half ago, and now it's a full blown program that we run.'",
        "'speaker_7': 'Parents sign their children up before they're in kindergarten and they see how long it takes them to get to having read a thousand books to them. It preps them for kindergarten. These are two of our graduates, our first two, as a matter of fact, of our thousand books before kindergarten program.'",
        "'speaker_7': 'And I think we have about a half dozen kids that have finished. They receive a book bag and a little magnet picture frame, but it's been a lot of fun to see them. The kids have a good time picking out their books when they come.'",
        "'speaker_7': 'Then other things the library does without going into a whole lot of detail. We have a school resource services program as part of our children's department. We have one part time person who is a liaison back to the schools she visits, the schools she put together.'",
        "'speaker_7': 'She puts together boxes of materials for a teacher's request on a subject so that they can come pick up the one box and it'll have books and websites and other things that they could use for whatever topic they're working on.'",
        "'speaker_7': 'Storywalk is going to be a program we're doing in cooperation with parks. We will be blowing up picture books, stories on large signs that will go on, signs similar to the realtor signs, and they'll be placed along walkways in the park so that you walk the trail and you read a page from the book and you walk'",
        "'speaker_7': 'the trail a little further and you get a little more. See, it helps the community get out and exercise a little bit and read a story along the way and hopefully they get through the whole thing and we will change the books out periodically.'",
        "'speaker_7': 'So during the summer we're hoping to launch that. We have a teen advisory board put together by our teen librarian. And the picture up on top is a mural that the teens there on the board requested from the library board to be able to paint in the teen room.'",
        "'speaker_7': 'They made their presentation to the library board. They got all their own supplies. They found a mentor to work them through the project. And with Mat's assistance, they got the mural painted and I believe they made a presentation to council about their project.'",
        "'speaker_7': 'They also put together the programs that are offered for teenagers in our library, and they've been a very big help to that. Library Outdoors is a new program that we're just applying for a state library pitcher grant. We have a pilot backpack right now available from the main library that has trail maps.'",
        "'speaker_7': 'A small first aid kit, binoculars, a ranger drawing books and stuff. And someone can check it out and go out to a park and have their trail maps and be able to look at things and it'll help them with their walk out again.'",
        "'speaker_7': 'Another thing to get the community outdoors, because at Ratliff, our adult services supervisor has met with East Bay Regional, California Parks, and she's meeting with National Parks next week. And they're all on board with putting together their materials to give to the library at no cost to include in the backpacks.'",
        "'speaker_7': 'When this grant comes through because pitch grant, you make a phone call to the State Library and if they like it, they invite you to do full application. And we were invited to continue. We'll have three backpacks at each library, one for each level of park, the local parks, the state parks and the national parks, so that'",
        "'speaker_7': 'people can check them out and see how that goes. Made in Alameda is a design thinking project. It's already morphed a couple different times from what it started out, but made in Alameda. Two of my part time librarians are working on this pilot project, things that are made in Alameda.'",
        "'speaker_7': 'They're going to try and get the word out about them. Everything from beverages on spirit alley to. Pineapple sales. Who does those sales? And if you tour their facility, you see that they use the foxholes in the ground so they don't have to drag the heavy sail material up on top of a sewing table.'",
        "'speaker_7': 'Everything stays at ground level and they stand in the foxhole. All kinds of things that are made in Alameda. They've been meeting with several people out in the community to find out if this would be a great project.'",
        "'speaker_7': 'We were looking for something to bring the thirties and forties somethings in to make the library their third place. And this seems to have hit on something that everybody's excited about. And naturally the library has book discussion groups for all ages.'",
        "'speaker_7': 'We have beginning intermediate and advanced for children. We have a team book group, we have two adult book groups and we have an LGBTQ book group as well. And our biggie is the summer reading programs which will start right after school lets out.'",
        "'speaker_7': 'We have summer reading programs for children, teens and adults. Children's. When I started in Alameda, we were lucky if we got about 150 kids to sign up for summer reading. Now we have well over 2000, so it's a really big program.'",
        "'speaker_7': 'So those are some of the other things that we do and we do a lot more than that. Over the years, mostly over the last nine years, we've had a reduction in our library materials budget from about 370000 to 177000.'",
        "'speaker_7': 'The materials budget is kind of the easy pickings when asked to reduce. We had already reduced office supplies and cut training out of the budget and travel reimbursement and that kind of stuff has all been cut long ago.'",
        "'speaker_7': 'So you either cut hours or you cut materials, and it's usually a combination of both. As far as service hours goes, we have 146 service hours that we used to have across the three libraries, and now we're down to 112 per week and that's at all three locations.'",
        "'speaker_7': 'We've had the same number of service hours for the last four years and though we would appreciate having more hours, the cost to open more hours is not just keeping the doors open, but also have the funding for the activities that happen inside the building.'",
        "'speaker_7': 'And just to make the building function, because it's not just the cost of the part time people who work there, it's also the cost of the utilities, the janitorial supplies. And then, as I said, the activities that occur, the materials budget is a little bit more important to us because it is shrinking so much.'",
        "'speaker_7': 'When you don't purchase something and it goes out of print, it's very hard to catch up your collection. And yes, print still exists in many, many homes and in many, many hands. It's not all the Internet and it's not all e-books, although that's an important component of what we have.'",
        "'speaker_7': 'This is what our budget looks like. And because everybody at the library works everywhere, it's kind of hard to pigeonhole it as administration operations. Literacy is easy and memorial fund. So rather than look too close at this particular slide, it's better to look at it this way.'",
        "'speaker_7': 'We do have a general fund transfer. It's about 51% of our budget and it's fairly stable in that it's been 51% over the last several years. We receive a small portion of property tax. It's 46% of our budget and then about 2% are from other sources, other sources being the memorial fund and grant projects and things like'",
        "'speaker_7': 'that. Personnel services, you can see, is at close 61, 62% of our budget over the next two years. The increase is primarily the rise in the minimum wage because we do have a handful of minimum women, a handful, we have a lot of minimum wage people, and that's going to increase in the coming fiscal years.'",
        "'speaker_7': 'Supplies and services, we have a bump up because last year the council was gracious enough to give us $100,000. One time. What was it called? Revenue. Surplus and we haven't spent it all. So we're asking for it to be reappropriated to us so we can still spend it.'",
        "'speaker_7': 'Cost allocation is that magic number that appears. I don't really know what the increases are for that other than the increased costs.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_5': 'Thanks, Matt. So just a quick question. So are you proposing any increase in service hours or any increase in materials?'",
        "'speaker_7': 'No, I'm not proposing an increase in either. I'm proposing we hold the line. When we reduced our hours, we didn't actually reduce services per say. We didn't cut anything out. I guess that's the way to say it. We just did everything a little bit less.'",
        "'speaker_7': 'So we still do class visits. This is a good example, but we don't do as many of them because we're only open to weekday mornings when the kids are in school and people don't really want to come with their class on a Friday.'",
        "'speaker_7': 'If we were open Monday, Tuesday, Wednesday mornings, we would do more classes. But we were very strategic when we cut the hours in the first place because we had more groups that needed to use the library in the evening.'",
        "'speaker_7': 'So that's why we have three evenings and then we have the rest days and closed in the evening and materials.'",
        "'speaker_5': 'Are you asking for an increase of materials?'",
        "'speaker_7': 'Yeah, it would be nice.'",
        "'speaker_5': 'But it's not in these numbers.'",
        "'speaker_7': 'No, it's not in these numbers. Um. Yeah.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_6': 'And how does the materials budget coincide with the 28,000 that we heard about last session?'",
        "'speaker_2': 'That was just if she was being asked to reduce by the 1.4, that was the $28,000 in materials. Yes. So that was a reduction. That was if we were going to ask all the departments to cut across the board.'",
        "'speaker_0': 'Amber Ashcraft.'",
        "'speaker_3': 'Thank you and thank you for that presentation. Couple of questions. I we hear from time to time about the limited hours of the computer lab. But I also think I've heard you mentioned that that's a different funding source.'",
        "'speaker_3': 'No, no.'",
        "'speaker_7': 'The computer lab is 21 computers. They are full computers, not thin clients. And yes, we do not like to have it open unattended because we've had gum and disk drives because it has a disk drive, the mouse balls disappear, they unscrew them and then you're in there to work and you don't have a mouse ball in your'",
        "'speaker_7': 'mouse. And we're not going to put wireless mice in the lab. The lab actually hosts about 22 classes a month. We do offer Open Lab on Mondays and Wednesdays, as was stated oftentimes in conjunction with the class where it's not disruptive for it to also be open lab.'",
        "'speaker_7': 'But some classes, it's very difficult. Have people come in and use the lab when the instructor is teaching specifically when are Alameda? Reed's learners are in there. They need everything to go a little bit more slowly for them to be able to follow what's going on.'",
        "'speaker_7': 'And it's very difficult when they have other people in there using the lab. So it's not open as much as open labs could be, but the lab is getting used. I mean, 22 uses in one month is quite a bit.'",
        "'speaker_3': 'Yeah. And that adult literacy program is wonderful by the way, as are all your programs. And then ah how much funding are we getting from the State Library these days?'",
        "'speaker_7': 'Zero.'",
        "'speaker_0': 'Thanks.'",
        "'speaker_3': 'I think that for.'",
        "'speaker_7': 'E he the governor had put library funding back in the budget and we got a smidge for the literacy programs. We received 15,000 last year for literacy. And then he took it out. So unless something changes when the May revise is released, we are not expecting to receive any funding from the State Library.'",
        "'speaker_7': 'The State Library can offer grants to us because the state is required to have the federal funds available to us, and they're the ones who filter that back down to the individual libraries.'",
        "'speaker_3': 'Thank you. That's. That's disappointing to hear.'",
        "'speaker_0': 'Up.'",
        "'speaker_7': 'Yeah, quickly. These are the graphical presentations of the previous slide that just show how much is our property tax and how much is the general fund and the other sources and then the expenditures of the same.'",
        "'speaker_0': 'Thank you. Any other comments? Questions. And, Brody.'",
        "'speaker_5': 'I'd just like to see if we could find more. It doesn't have to be, you know, huge sums of money. But to increase the materials budget modestly.'",
        "'speaker_7': 'We would appreciate that. Thank you.'",
        "'speaker_0': 'Any other member comments? QUESTION Thank you. Thank you very much. Oh, yes. And you have one speaker, Carol Goldstein.'",
        "'speaker_8': 'Hello everyone. Carol Gladstone, Alameda resident and frequent user of the libraries on the West End of the main. Thanks for the great presentation. I have to give gold stars to all the library staff and the director. They're very responsive to any issues we raise or any questions we ask.'",
        "'speaker_8': 'There are a lot of improvements. We now get 2 hours to work on the library terminals instead of just one a few years ago. One problem, actually, I really appreciate the explanation about the thin client stuff because I now think I know the difference between a thin client and I guess Wikipedia calls them fat clients.'",
        "'speaker_8': 'The boxes in the computer lab room don't ever get rid of all the fat clients because those are the only place we have CD ROM Access and people still walk in to the library and ask, where can I stick my desk?'",
        "'speaker_8': 'And unless that room is open, there's no place to put it that I know of. I know if you order your medical chart now, sometimes you get just a disk in the mail and that's the only way you can look at it.'",
        "'speaker_8': 'So they're still going to be useful in the future? I'm still not entirely clear why. Like the West End. Well, there's only four terminals there for the adults, and every time I go in, ones out of order, I want yesterday and I counted 15 to 20 seconds between the time that I click on the mouse and the'",
        "'speaker_8': 'time something happens on the screen. And they have thin clients stuck on the back of them. I don't know what the relationship of that is to performance and. It's still true that on Tuesdays and Thursdays and many and Saturdays that computer lab is locked up.'",
        "'speaker_8': 'Nobody's using it. Not for a private class. Not that I have seen. And those computers, they're just wonderful. And anybody who's used both types of computers in the same library has to be wondering, well, why isn't everything working as fast as the computers in the lab room?'",
        "'speaker_8': 'They even have the old boxes, and they're still lightning fast compared to all the ones on the thin client side of the library and all the computers at Mastic, I would say they're all better than the general, thin, quiet, used ones are much faster and they do not ever lose your data or or stop working altogether.'",
        "'speaker_8': 'And and the computer lab room is just a hair better than the rest, but the math are outstanding anyway. Thank you.'",
        "'speaker_0': 'Thank you. A follow up question. Can can staff share how many terminals are at the different libraries?'",
        "'speaker_7': 'We have.'",
        "'speaker_0': 'How many are available all the time. When someone walks in. They can use.'",
        "'speaker_7': 'We have 43 at the main library and. Eight at the West End Library and four at the Bay Farm Library. And then there are catalog computers that are not Internet accessible. There are 21 computers in the computer lab.'",
        "'speaker_0': 'And that's at the main library.'",
        "'speaker_7': 'And that's at the main library only. Speed is an issue at the two branch libraries. Comcast hasn't been able to get the speed up as fast as we would like. It is not a function of the hardware. It's a function of the Internet connection that things don't come up as quickly as we would like it.'",
        "'speaker_7': 'We would hope that would be corrected when we get on this broadband backbone. As far as disk drives go, I've asked staff to have one of the portable disk drives available at the reference desk that can be plugged into the thin client unit if someone needs to read a disk.'",
        "'speaker_0': 'In the slot at each library.'",
        "'speaker_7': 'Right now it's just at the main because we'd have to buy additional portable disk drives. We don't have many floating around our building. We have one for staff to use, but that's going to go out to the desk.'",
        "'speaker_0': 'So then I would request that we obtain a portable disk drive for each of our libraries. We can.'",
        "'speaker_7': 'Do that.'",
        "'speaker_0': 'Now because I'm sure we all know the these computers are the only computers that are available to many, so many of our residents, they don't have access at home.'",
        "'speaker_7': 'We'll also have to find out if the appropriate software is on because you may be able to read something, but if someone puts in a movie, there may not be a movie player attached. So we'd have to make sure we have the right software.'",
        "'speaker_7': 'So it may not appear like tomorrow, but we'll see what we can do about getting it at all three locations.'",
        "'speaker_0': 'Thank you so much. Other comments? All right, then. That's the end of that presentation. And now we're on to public works.'",
        "'speaker_5': 'Madam Mayor, members of the City Council. Good evening. I am Liam Garland with the Public Works Department. I have three goals for tonight. One is to provide an overview of the department and some context for the work it does.'",
        "'speaker_5': 'The second is to walk through our operating budget. And the third is to discuss our capital budget. And the capital budget was one of the attachments to tonight's agenda. And these slides are covering both the operating budget and the capital budget.'",
        "'speaker_5': 'So without further ado, there is a streetscape in front of us. This is an imaginary street in Alameda. And we are going to walk through different parts of the public infrastructure and describe a bit about what public works does.'",
        "'speaker_5': 'So first, not surprisingly, streets are involved in what we maintain. There's about 125 miles of street. I'm going to talk a little bit about the resurfacing program for that street and some of the potholes we we fill related to our streets.'",
        "'speaker_5': 'We also maintain 87 signalized intersections throughout the city. We maintain about 211, 211 sewer and storm drains. And my my colleagues behind me just cringe that I combine those two because they're actually separate systems. But it's about 211, 211 total miles of of sewer and storm drains.'",
        "'speaker_5': 'Tonight, we're going to talk a little bit more about the storm drains. The sewers get a lot of attention. I have received a lot of attention. And tonight, hopefully by the end of it, you'll hear more about storm drains.'",
        "'speaker_5': 'The other part of the public infrastructure we maintain is sidewalks. About 260 miles of sidewalk. You've heard me talk with you about the. Oh, I'm sorry. I missed one. That last arrow went to these city, street, street trees.'",
        "'speaker_5': 'That's more than 19,000 street trees. There's a reason Alameda is called Alameda. It's a lot of trees to be maintained. And then the contract. Oh, am I missing an arrow? I apologize. So the of the contract we have with Alameda County Industries to essentially make sure all the garbage and recycling collected at local businesses and residents gets'",
        "'speaker_5': 'to the right place. That's about 3 million pickups per year. The largest contract that the city has entered into. And finally, there's what we hear less about, and that's an arrow pointing toward City Hall West, where public works is headquartered.'",
        "'speaker_5': 'And there what folks maybe don't know as much is that there's 5000 maintenance requests per year that come into public works. About 2000 of those requests are from members of the public, and another 3000 of those requests are from client departments.'",
        "'speaker_5': 'And so that's a lot of requests coming in to one department. The other part that that building represents is our facility maintenance. There's 35 city buildings to maintain. And then finally, there's a city fleet. Not pictured here is a city garage where we maintain about 300 vehicles and various pieces of equipment.'",
        "'speaker_5': 'So that gives an overall perspective on the different assets we maintain. Now we're going to talk a little bit about the headwinds that this department, like other departments in the city, has faced over the past few years, and that's primarily around staffing.'",
        "'speaker_5': 'We'll see if this works.'",
        "'speaker_4': 'Oh.'",
        "'speaker_5': '45,001 service requests.'",
        "'speaker_3': 'What will add that to the budget?'",
        "'speaker_5': 'Yes.'",
        "'speaker_6': 'Here we go.'",
        "'speaker_5': 'Back to what this what this bar graph shows is over the last 15 years, the reduction in positions at public works going from about 92 to 72. So that's 20 positions reduced. Those have come primarily from our maintenance division and our engineering division.'",
        "'speaker_5': 'They've equally shared in the burden of those cuts. The next few slides are about public works, his operating budget. And before we go into the slide, I just want to explain the context, which is we're going to see the generally funded portions of our operation budget and then we're going to see the non generally funded portions.'",
        "'speaker_5': 'And let me just get to the bottom line. Much more of our work is non generally funded about four times as much of our operations budget comes from non general funds. And of course I missed that. So let me actually come back to the new operating initiatives on that operating budget for the General Fund for fiscal year'",
        "'speaker_5': '1516, it's about $4 million in general. Funds are coming into public works for our various work. That is going to a few places. If you focus on this these sub totals here for just a moment and I want you to focus right there.'",
        "'speaker_5': 'That's one almost $1.5 million that's coming through. Our general administrative costs are maintenance of street trees and medians and then our streets and sidewalks. And these are primarily funding positions and they total about $1.5 million. Next, if you look down there at that, 2.5 to $6 million are just roughly 2.5 million for five, 15, 16.'",
        "'speaker_5': 'This is how much general funding is coming in for our facilities and our fleet maintenance. To sum those numbers up and you get that $4 million figure for total general funds coming into our operating budget, very similar number, 4.1 million for fiscal year 1617.'",
        "'speaker_5': 'Now I want to show you the next slide which is from the non generally funded amounts. And remember $4 million versus nine general funds is a little bit over 16 million. So quadruple the amount of funds coming from non general funds.'",
        "'speaker_5': 'And here there's a laundry list of programs and I'm not going to go through each one, but I'm just going to hit a few to explain. So if you look at the top, that's the the program that takes in the or through which we incur the most expense, and that is the sewer program.'",
        "'speaker_5': 'So in fiscal year 1516, we're looking at about $4.7 million on sewer maintenance and operations. This funds a staff of about 11. It funds obviously, a portion of this is cost allocation. A significant portion also funds a purchase of some pumps and equipment related to the sewer program.'",
        "'speaker_5': 'If you look to the next line, the engineering line, this is an interesting one because this and it's relevant to the discussion of project managers. The project management unit would be within this engineering program, and the engineering program builds to projects.'",
        "'speaker_5': 'And so this is this program really receives revenue from that building and then the expense and staff salaries hits it. So it's, I believe, 95% in personnel. And the key point there is all of that personnel cost or most of it is coming through the building to projects that are mostly non generally funded.'",
        "'speaker_5': 'I we'll talk a little bit more about that when we get to the Special District Budget. You'll see the next three programs have a little star next to them. And that's because we're proposing to add a maintenance worker position shared between these three programs.'",
        "'speaker_5': 'And the main reason is actually about new responsibilities and new revenues. We've got new maintenance districts that are coming at Alameda Landing. Actually, that one just founded. Also Marina Cove two, also known as Marina Shores, may have one coming from Del Monte.'",
        "'speaker_5': 'Those are special districts that are founded in which property owners pay those enhanced maintenance costs through a yearly assessment. We now assume as public works that maintenance responsibility. And so with that revenue, that's additional work, the additional responsibility that a portion of that maintenance worker position will help offset that new responsibility.'",
        "'speaker_5': 'It'll also come with that new revenue coming from the new special districts on storm drain. Here, we're facing increased regulation. So the water board is requiring that by 2022, we'll essentially eliminate trash from our storm drain storm drain system.'",
        "'speaker_5': 'And that's a that's going to be a big challenge for us. It means we're installing these things called full trash capture devices. Within our storm drain system. They require maintenance. There is no way to get around the fact that we need to get the trash that's collected and those devices out.'",
        "'speaker_5': 'Otherwise, we might face flooding or other other problems with the stormwater not flowing through that storm drain system. An integrated waste. We're facing more and more reliance on our staff to go to city and city events where recycling and composting are provided.'",
        "'speaker_5': 'And, you know, there's those what I would consider attractive composting and recycling containers that actually takes work to both stage that get all those get all the material together stage and then out to these various events. And so we're proposing that that maintenance worker position be shared among those programs.'",
        "'speaker_5': 'With that. I'm actually going to go back a few slides and talk about those new operating initiatives. And so this is going to sound slightly internal, and I apologize for that in advance. It's just something we're pretty excited about and taking very seriously.'",
        "'speaker_5': 'One of the things we're going to accomplish in the next 2 to 3 years is gaining the American Public Works Associations Agency accreditation. Essentially, this is a top to bottom review of our organization by professionals from across the country.'",
        "'speaker_5': 'This is about those professionals coming in to check. We have check that we have policies, practices and procedures and numerous categories and ensuring that we are operating at a really high level. About 100 public works departments today across the country have this accreditation and we want to be in the next ten or 20 over the next 2'",
        "'speaker_5': 'to 3 years. This is a little bit like a Good Housekeeping seal of approval on the work that we are doing. The second operating initiative is around our staff, which is getting three quarters of our staff on track to gain the highest training or credit credentialing in the field.'",
        "'speaker_5': 'Again, a lot of our work goes out of public view and so it'll help folks sitting in your seats and others to know that the public works professionals that are serving the public here. They're all on track to gain the highest training and credentialing in the field.'",
        "'speaker_5': 'The American Public Works Association provide some of this credentialing, as do other agencies. For example, with traffic signals, you can get a traffic signal, level one, level two, level three, level four. So part of that work is lining up all of those trainings and making sure our staff are working through them.'",
        "'speaker_5': 'The third operating initiative is around our Project Management Management Unit. I'll just add one note on that that hasn't been covered yet is part of the reason for project managers is also to free up our current engineers. What engineers really do well and I'm not sure if this is a fence or not.'",
        "'speaker_5': 'Engineers is they design well. And so part of the purpose of the project management management unit is to take the projects after that design. And that way the engineers don't have to think about them. They can know that once that project designed that, our project manager would take it all the way through to construction in the field'",
        "'speaker_5': '. Now I'm going to get back on track and move on to the capital budget.'",
        "'speaker_0': 'Before you move on, I actually want to commend you for these initiatives. I actually I think that that's wonderful. You're taking that on. And personally, when you're encouraging your staff to gain the highest training and or credentialing that field, that can only benefit our meetings.'",
        "'speaker_0': 'And I appreciate your staff taking that on. That's extra work.'",
        "'speaker_5': 'Thank you. So here we're looking at the capital budget. We've moved away from operations. Operations is mostly about funding positions and people, and now we're looking at bigger expenses into the capital and infrastructure. The total capital budget proposed for the next two years is $55 million.'",
        "'speaker_5': 'If you look to your left, you'll see a pie chart there that breaks down where that $55 million is going. It's about $29 million into rehabilitation projects. And I'll explain a little bit more about what those are in a moment.'",
        "'speaker_5': '$7 million into parks and then $19 million in transportation. I'll obviously be focusing most of what guys I report on tonight in rehabilitation and transportation. This capital budget reflects a lot of input from a lot of staff members starting back in November of 2014, all the way through to the last few weeks.'",
        "'speaker_5': 'It also has been approved by the Transportation Commission. It's been approved by the Recreation and Parks Commission. It has been approved by the Planning Board. I'm sorry, determined. Consistent with a general plan by the planning board. This is a requirement of state law.'",
        "'speaker_5': 'And as a reminder, this is where the project manager positions come into play. Because of the $55 million in this capital budget, these project managers are the ones finally responsible for getting the projects completed on time and under budget.'",
        "'speaker_5': 'One quick clarification, given the discussion earlier is that that one project manager two position that is at in in concert with an elimination of a currently vacant position. So the budget we're likely to bring back on June 2nd will be one brand new one.'",
        "'speaker_5': 'One additional headcount in terms of a project manager with the cooperation of Parks and Rec and Public Works. And then one project manager position, which is through that the elimination of a currently vacant position. Now we're going to get into the nuts and bolts of the rehab projects in the in the capital budget.'",
        "'speaker_5': 'This is a page from the capital budget itself. That's why it looks a little a little stretched out on the middle to left are are the assets that I talked about at the beginning of this presentation. I'd like to focus actually on the right hand column, because this is what we're hoping to do in the next two'",
        "'speaker_5': 'years. We want to make 1600 sidewalk repairs. We want to rehabilitate six miles of sanitary sewer pipe, along with nine sanitary sewer pump stations. We want to trim almost 7000 trees throughout Alameda. I want to make dozens of critical improvements to the city's facilities.'",
        "'speaker_5': 'And I mentioned we might be talking about stormwater. We want to finalize stormwater master plans, replace six storm drain outfalls, rehabilitate culverts at four intersections and install 50 more of those full trash capture devices I I spoke about earlier on on that note, here's a list of the rehabilitation projects and the total approximate cost of those or'",
        "'speaker_5': 'a project budget for those. And I'd like to focus in on that storm drain line in there, about $5.4 million in funds for that. Most of that is going toward an Arbor Street pump station which needs replacement. We also have a plan to return to you within two years or sooner where we're able to take the master'",
        "'speaker_5': 'planning that we want to do around stormwater, take the new requirements we're getting from the water board in regards to pulling trash out of the storm drain system and then look at how we fund that plan. Right now we've got a stormwater fee that it's about $50 per residence and it's been flat, meaning no increases whatsoever in'",
        "'speaker_5': '12 or 13 years. And so there may be an opportunity within the next couple of years for public works to come back to present how that that fee might be increased, to be able to adjust as in order to fund that storm drain plan.'",
        "'speaker_5': 'And as we spoke about, I think about six weeks ago, start making a dent into the approximate $45 million in deferred maintenance around our storm drains. I want to hit on two more projects here. The very bottom is city building.'",
        "'speaker_5': 'And you see it's a little bit above $1.5 million over the two year period. Again, as my venerable boss has said, we are due in the middle of a facility condition assessment. Right now, we're actually coming back to council on May 19th to request an amendment to our current contract so that we can do the rest of'",
        "'speaker_5': 'the city's buildings and then come back to the council with a full facilities condition assessment in the fall or winter that we again we match to the funding we have, which is currently it's about $750,000 per year and figure out what that current level of funding, what our buildings will look like five or ten years down the'",
        "'speaker_5': 'line, or if we might want to make adjustments to that that funding. The third. The third area I'd like to cover right now is around sidewalks.'",
        "'speaker_0': 'So I saw you move on. Domestic donation on here. Is that does that go to the Mastic Center?'",
        "'speaker_5': 'It does. I believe it's for painting of mastic. Is that correct?'",
        "'speaker_0': 'Right. Thank you.'",
        "'speaker_5': 'So with sidewalks, we've got a backlog of sidewalk repairs throughout the city. A couple notes about this. On the lower right hand side, you see a tree that through its roots is probably lifting that sidewalk. These are only repairs that are attributable to a city maintained tree.'",
        "'speaker_5': 'So of this 7000 that universe. Is it attributable to a city maintained tree? Note that property owners, the adjacent property owners, they're responsible both under state law and our municipal code for maintenance and repair of those sidewalks. However, the city's practice has been where that city maintained tree is causing a lift that we will make the repair'",
        "'speaker_5': '. If you look at the left side of that screen, you see the history of sidewalk repair spending. I'd estimate that it would take about $750,000 per year for us to be able to make the repairs that we already know we're going to come up every year.'",
        "'speaker_5': 'In other words, to start making a dent in the backlog, you have to spend more than $750,000 per year. You can see in 2014 and in this current fiscal year, we're doing that. So the good news is we're starting to make a dent and we will continue to do that in this proposed budget with about $1.5 million'",
        "'speaker_5': 'each year in sidewalk repairs. I'm going to shift now to transportation projects.'",
        "'speaker_1': 'Oh, you know, but before you go there, I just want to say, I mean, I think it's a great idea. I think there's roughly in the visual, you have roughly 1.2, $1.3 million program for sidewalk repair in 2015, and $1 million was programed for 2014 in FY 2014.'",
        "'speaker_1': 'I think the great news was that relative to previous years, I mean, that's a significant increase. And I think these are the type of things that residents definitely want, want to, you know, track, be able to see because it's literally right in front of their house or home.'",
        "'speaker_1': 'Oh, thank you.'",
        "'speaker_5': 'Right.'",
        "'speaker_0': 'It's a safety issue.'",
        "'speaker_1': 'That, too.'",
        "'speaker_5': 'So now we're going to the transportation chunk of about $19 million. And like I discussed before, this is about streets, about those signalized intersections in other parts of the transportation infrastructure. Here are the list of transportation projects. I am going to briefly describe each one in some of the kind of high level points about them.'",
        "'speaker_5': 'The Pavement Management Project is really our street resurfacing program. And what we're proposing is nine miles resurfaced over the next two years. That's quite a bump over the last several years. And I'll talk about the impacts on our pavement condition index on that in just a minute.'",
        "'speaker_5': 'Also, our complete STS CIP. And this is about maintaining about five miles of bike lanes and bike paths, completing two complete streets proposals, updating the bicycle, the master bicycle plan and updating the master pedestrian plan, the signals striping and system CIP, that is.'",
        "'speaker_5': 'There are two new signalized intersections we want to construct. One is at Central Taylor and third. Another is at Harbor Bay Parkway, where it intersects with the North and South Loop. And then the next two are the cross Alameda Trail portion.'",
        "'speaker_5': 'So that's about 1.5 miles of the cross Alameda Trail. That's quite a chunk of to be constructed over the next couple of years or at least part of this CIP budget approval. The McCartney Rhode Island Drive Intersection Improvements.'",
        "'speaker_5': 'We're looking to improve an update on that intersection. And then finally, the parking slip, this CIP. Again, this might sound familiar in the context of the the single spaced smart parking meters that the council voted to approve to go citywide.'",
        "'speaker_5': 'The the next question it begs is what we do about the current kiosks on Park Street. And so that'll be something that'll be tackled to this. C I see. I P And my money is programed into to make those replacements if that is what the stakeholders do recommend and what this Council authorizes.'",
        "'speaker_5': 'In addition, in the Civic Center parking structure, we have some outdated kiosks just on the first floor and we want to add some kiosks up the floor. And with that, that gets us to the total of a little over $19 million in transportation projects.'",
        "'speaker_5': 'And I will end and open it up for questions. Oh, no, I apologize. Let me just walk through this chart, because this shows the significant difference that Measure B has made. What you're looking at is the pavement condition index for the city of Alameda and the blue line, while it doesn't look like it represents great news, is'",
        "'speaker_5': 'really great news. That shows our pavement condition index at 67 or 68 for the next ten years. That's assuming that what we're proposing for the next two years, we can keep up for ten, which I think is a safe assumption.'",
        "'speaker_5': 'And what that means is that according to the Metropolitan Transportation Commission, that our our streets will be in fair condition, the upper level of fair condition. If you look on the lower left part of that chart, you see that compares pretty favorably with some of our neighbors and the the purplish darker line that's heading downwards.'",
        "'speaker_5': 'That's what would have happened without Measure B, we would have ended up in 2025 with streets out a pavement condition index of 53. Those are at risk. It costs even more money in order to to rehabilitate streets at that point.'",
        "'speaker_5': 'And here, unless you have questions, I won't cover the parks projects. I believe we discussed each of these through Amy's presentation. I'm happy to answer any questions that might come up. And here's a map that is imperfect but is a start.'",
        "'speaker_5': 'This has been requested several times from public works, and it maps out some it maps out not 100%, but many of the projects that we seek to accomplish in the next two years. There are some. Full disclosure and disclosure.'",
        "'speaker_5': 'There are some errors in this map. They're going to be corrected by the June 2nd submission. And with that. Happy to answer any questions you may have. We also have some public works staff here in case those questions are beyond my expertize.'",
        "'speaker_0': 'Ashcraft.'",
        "'speaker_3': 'Thank you. Thank you for that nice report, Mr. Garland. And thank you to whoever. And I imagine it was more than one individual put together exhibit to the capital improvement plan. But it was that you?'",
        "'speaker_5': 'I played a large role. The public work staff played a large role, and we had the support of a designer as well. So, yes, well, I.'",
        "'speaker_3': 'I was especially impressed by how well-written but user friendly for someone who is a layperson. But you you set out some pretty sophisticated information. Love the table of contents. Love the wording. And the title might have caused an English teacher to cringe that dangling participle.'",
        "'speaker_3': 'No, just kidding. It was so well written and illustrated in city staff. I would love you to take a page from Public Works Playbook here, and it's a great way to present information to counsel and I think our other residents.'",
        "'speaker_3': 'And so there were a couple of things that I didn't hear you touch on, and I just wanted to ask specifically that specifically on the this is on page 19 of the CFPB budget and the title of that page is.'",
        "'speaker_3': 'Well, I don't know. We're talking about traffic signals and improving intersections. So there is by the way, there is a reference to replacing the pavement lights at certain intersections with these rectangular rapid flash beacons. I think those are terrific.'",
        "'speaker_3': 'The one I'm familiar with is in the vicinity of Otis School, Crissy Park on Otis Drive there. But they're on the other column that talks about traffic signals that are being the following. Intersections are proposed to have their signalization updated before 2025.'",
        "'speaker_3': 'And I'm wondering if you could tell us what is updating Signalization mean.'",
        "'speaker_5': 'So for unfortunately, our transportation engineer is not here tonight. What I understand this to mean is that oh four Oak and Clement and Park and Pacific, those would be new signals constructed at those intersections. And I believe that for the rest, that is about essentially swapping out the existing equipment for more updated equipment.'",
        "'speaker_5': 'That's how I understand that.'",
        "'speaker_3': 'So the one thank you for that. And the one that caught my eye was the intersection at Otis and Grand. In addition to updating updated Signalization, and I understand that you're saying the engineer in charge isn't here but is public works looking at ways to make that intersection safer for pedestrians and bicyclists.'",
        "'speaker_3': 'I think those of you who are familiar with it right there by Riddler Park, it's a very wide intersection. It's a bus route. Speeds are sometimes fast. And unfortunately, there there was a fatality last year in December. And I know I've had more than one resident contact me and say I was crossing that street in broad daylight'",
        "'speaker_3': 'and almost got hit by a car making a left turn. And I you know, I'm not a traffic engineer and I'm not sure why it is. But even from for me, I ride my bike and I walk that intersection and drive at it.'",
        "'speaker_3': 'Just when you're walking or on a bike, it does feel kind of vulnerable and and exposed.'",
        "'speaker_5': 'So I can I can share an answer back with you.'",
        "'speaker_3': 'I appreciate and I'm sure the council would like to hear that, too. And then I will bring up what I brought up in regard to the parks and recreation facilities in our city owned buildings. And by the way, I love the graphic.'",
        "'speaker_3': 'We have 35 city owned buildings and they were 35 little city halls. And given the water shortage, are we contemplating replacing toilets? And I don't mean just to replace fixtures, just to be replacing, but when they come to the end of their useful life, to be replacing them with low flow and regulated flow toilets.'",
        "'speaker_5': 'The short answer is yes and the like. And two things are going on. One is, in the last mid-cycle update of the budget, a capital project was approved to replace toilets with low flow toilets. And that's all in support of reducing water.'",
        "'speaker_5': 'It's also in support of green certifying every city department. We're not there yet, but we want to get there within the next year or so.'",
        "'speaker_3': 'Right. Thank you. And then and quickly, because I know we want to move through this quickly. Oh, okay. So the on page 20, which is the larger transportation projects likely to be funded by a combination of grants, Measure B and development impact fee.'",
        "'speaker_3': 'There is on the right hand column the long term projects ranging or taking place from 2021 to 2025. The third one there is the Fruitvale or Miller's Sweeney Bridge. Lifeline City Match would be $10 Million Emergency Lifeline for Alameda to ensure that it functions after a major earthquake.'",
        "'speaker_3': 'And my question on this is, given the importance of that lifeline for Alameda, is there any way this project could be moved up to a faster project date than 2021 to 2025?'",
        "'speaker_6': 'Mr. HAHN Bob Hahn, Public Works Director The county is contributing $20 million for that project. We're contributing $10 million to that project, and the balance is on funding. It's about a $60,000 project. The county is applying for 60 million.'",
        "'speaker_6': '60 million.'",
        "'speaker_3': 'Yes. If we get to the 60,000 tonight.'",
        "'speaker_6': '60 million. Yeah. And so the county is actively applying for a grant for that additional 30 million. Additionally, kind of by luck, I was able to provide a tour to FEMA staff from the state of California. And so they're aware now that we are an island.'",
        "'speaker_6': 'They weren't aware of that before. And so that's also moved up. So we will be gaining a letter of support from FEMA on that bridge, but we're working very actively to make that a lifeline bridge.'",
        "'speaker_3': 'Okay. Very good to look forward to hearing back more from you on that. All right. Great. And see your wrapping up. Okay. Two things. The on page 25 of this lovely report at the bottom of the page that is talking about environmental benefits of a lot of things that are being done with this money is a little'",
        "'speaker_3': 'box with a great photograph of our Plowshares nursery out at the Army two point collaborative. And I just want to share for those who are watching, did you know that more than 90% of almeida's new tree plantings come from Plowshares, a local nonprofit providing job training for low income and formerly homeless residents?'",
        "'speaker_3': 'And it's a really attractive, wonderful nursery. Obviously, they're growing plants and trees and whatnot that are appropriate for this growing zone. I've got a fig tree in my backyard that's doing really well from that came from plowshares. So good work city staff for for using plowshares.'",
        "'speaker_3': 'It's a really very nice partnership. And finally on page. Page 36. This is just wrapping up. It's talking about the rehabilitation projects and the brief project description is to maintain and improve Alameda City buildings and facilities by completing necessary improvements.'",
        "'speaker_3': 'The the little box in the lower right hand corner notes that the city's buildings have years of deferred maintenance, which leads to the need for more building repairs. These facility investment start to cut into that deferred maintenance, but not by much.'",
        "'speaker_3': 'With a more significant investment, building conditions could improve and the city would save money on having to make fewer repairs. So my question is. How much more would it take to improve the conditions of these buildings? Address the deferred maintenance to save the city money in the long run?'",
        "'speaker_3': 'And I think you may tell me at the council that that answer depends on the study that's being conducted or something else.'",
        "'speaker_5': 'That's exactly right. So the the the study is being conducted is by third party experts in these facility condition assessments. And they'll be able to share with this body exactly what the cost benefit of those investments versus the return on those investments through reduced repairs.'",
        "'speaker_3': 'Thank you very much. Thank you, Madam Mayor.'",
        "'speaker_0': 'Ben Brody.'",
        "'speaker_5': 'Thank you and thank you for the presentation. Not too often do we have presentations that are page turners and and the CIPA budget to me was also a page turner. Maybe that's a little nerdy, but that is the way it is.'",
        "'speaker_5': 'I guess. So I just I first want to, you know, thank public works for including, you know, on page 41, the McCartney and the Island Drive Intersection Improvements and the Belmont crosswalk traffic calming. So I appreciate that that those are in there and that we're we're paying some attention to our residents and our pedestrians and bicyclists over'",
        "'speaker_5': 'on Bay Farm. So I wanted to focus you back on on page 19 that my colleague, Councilmember Ashcraft was was talking about, just has a few quick questions. So the first item under short term is the opposite of Parkway Multimodal and Bus Rapid Transit.'",
        "'speaker_5': 'That is that $10 million that the entire cost of that. I'm going to defer to Gail Payne, our transportation coordinator on that. Oh. Who exactly in the.'",
        "'speaker_3': 'Pitch.'",
        "'speaker_5': '1919. The one you you'll remember earlier.'",
        "'speaker_7': 'Our chief operating officer on point. So I'm working closely with Gail and staff to prepare a tiger grant. This this particular piece of this is actually funded through measure B b, okay. And so we have had we're talking about dedicated lanes between Webster and Main Street that would be funded through Measure B, B, and then the developer'",
        "'speaker_7': 'side would be funded all the way to Periphery Point. But yes, we are. That's our current estimate. We think because it's dedicated lanes where I reconfiguring that entire street, it's going to be expensive. If we if it doesn't use all that money, then we'll be able to use that elsewhere to help facilitate access to BART.'",
        "'speaker_7': 'But the measure B B is access to BART.'",
        "'speaker_5': 'And the council has given has has made it as our stated policy that we want to seek this 10 million from Measure B to finance the bus rapid transit on opposite, is that correct?'",
        "'speaker_7': 'The measure the measure B B talks about BRT to to BART or to Fruitvale BART. And this would be the initial from I mean, from a growth from Alameda point. And so that is this is the kind of first leg and most importantly of that.'",
        "'speaker_7': 'And so this is implementing an access study that was done and and that was what was in the description for the Measure B funding.'",
        "'speaker_5': 'So but it's so it stated a city policy to be supportive of this project.'",
        "'speaker_7': 'When, when the Council took a policy, a resolution to support the measure b b funds, that was the description that was in there was essentially improvement BRT improvements to Fruitvale, BART Okay.'",
        "'speaker_5': 'And the Stargell Avenue Q jump lanes and class one trail that bus quarter what's that's a $4.75 million at the top of the second column there. Right what's the source funding on that one.'",
        "'speaker_7': 'So that would that'll be the target. So the measure B B funds would be used as a match for the Tiger grant, the Federal Transportation Grant. And that we're submitting in June, you know, June of this I mean, next month.'",
        "'speaker_7': 'So if we're successful, it'll be the tiger. If we're not successful, then it's unfunded.'",
        "'speaker_5': 'So it's also stated council policy to be supportive of the Stargell Avenue jump lanes in class one.'",
        "'speaker_7': 'Is included as part of the Environmental Impact Report for Alameda Point. It was part of the master infrastructure plan. Offsite requirements for element point would be to to to make these improvements.'",
        "'speaker_3': 'May I just ask a clarifying question?'",
        "'speaker_0': 'Yes, please.'",
        "'speaker_3': 'Thank you. So the Tiger grants MRT, that's federal funding. And do we apply for those through or with the assistance of the Alameda County Transportation Commission?'",
        "'speaker_7': 'Only in that the match is essentially the measure b b funds. So we have coordinated very closely with them in providing sufficient evidence that the Measure B B funds are available as matched. In order to demonstrate readiness, we need to have their cooperation.'",
        "'speaker_3': 'So coordinating with the Alameda County Transportation Commission to get this application to the to the feds. Thank you.'",
        "'speaker_5': 'And they're the coordinating agency that distributes these funds. Is that the.'",
        "'speaker_7': 'Sector that would get this the Tiger Fund.'",
        "'speaker_5': 'Or the the measure b b.'",
        "'speaker_7': 'Yes.'",
        "'speaker_5': 'Right. So administer.'",
        "'speaker_7': 'Those funds.'",
        "'speaker_5': 'Okay. Thank you. And then the last item, I just want to focus on the fourth one on the list of long term projects, the AT&T, Broadway, Jackson Multi-Modal Transportation and Circulation Improvements 75 million.'",
        "'speaker_7': 'Going to defer to public works on that.'",
        "'speaker_5': 'So. Just a couple of questions on that. You know, what's the status of that, that project?'",
        "'speaker_6': 'The status of that project is my understanding that the city of Oakland is still doing the Broadway transportation study within Oakland. That's part of their thing. So. As you may know, that we have a negotiated agreement with A.C.T. and the city of Oakland, and we will be looking very closely at that agreement within the next three years'",
        "'speaker_6': 'or the next two years and taking appropriate action if, in fact, we do not have an environmental impact report ready by the end of those three years for the Broadway Jackson interchange.'",
        "'speaker_5': 'And what's the ultimate goal of these improvements?'",
        "'speaker_6': 'The ultimate goal of those improvements is to increase the flow of the traffic through the tubes.'",
        "'speaker_5': 'So basically decreased traffic time and reduced the backup of traffic that's.'",
        "'speaker_6': 'Going through the traffic. Essentially, as we all know, the drive through the tube, a lot of the impediment in getting through the tube is the right turn with the red light right there where you come out of the turn.'",
        "'speaker_6': 'And it's very evident and it's a continual problem. It's a continual problem on the and, you know, the antiques fair once a month to the issue there. And we've been trying to work very diligently with Oakland on that.'",
        "'speaker_6': 'But the issue there, if you have a pad standing there, you have a yellow light, you have a conscientious driver, they're going to stop for that pad. The pads already push the button. They cross the street on the yellow light because you have another conscientious driver next to them.'",
        "'speaker_6': 'The pad crossed the intersection. Light turns red after the pad crosses the intersection. So now you have additional conscientious drivers. There's the sign Turn on red and they're stopping there for no reason whatsoever. Then the light cycles through and the traffic moves.'",
        "'speaker_6': 'That's the largest impediment right there. That's small issue. But the further it's a large project at Broadway Junction, incorporating a lot of players, including, you know, the Warehouse District of Oakland. There's a lot of people involved in that.'",
        "'speaker_6': 'But we do have a negotiated settlement or a three year timeline. You get an environmental impact report for that intersection.'",
        "'speaker_5': 'And the $75 million which the source of that $75 million.'",
        "'speaker_6': '$75 million, I believe, just off the top of my head, it's, you know, some combination of measure B, B money and some state funding. I'm not exactly sure.'",
        "'speaker_5': 'And it's the stated policy of this council to be supportive of the 880 Broadway Jackson Multi-Modal Transportation and Circulation Improvement Project.'",
        "'speaker_6': 'Absolutely, 100%.'",
        "'speaker_5': 'So, you know, I have one more question. I'll kind of preface it with a little background. In my day job, I'm professional, public servant, like all of you. So I interact with with a number of people. And I had a conversation with a high level executive staffer over at the ICTSI, and it was conveyed to me that'",
        "'speaker_5': 'our representative to the act said that she didn't want the bus rapid transit and didn't want the Broadway Jackson. Is that communication to the person that acts contrary to stated council policy?'",
        "'speaker_6': 'Appears to be.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_0': 'Okay. So I think it's appropriate for me to respond. I think the actually it appropriate for you to have I'm the representative. I don't know what conversation you're referring to. However, I really would encourage that in the future if you want to have that conversation that we start off.'",
        "'speaker_0': 'I personally don't believe that this has been a topic other than this. This topic does come up at AC transit meetings, of which I believe I've actually been supportive of. All right. I mean, of course, if you want to do business this way, that's what your choices.'",
        "'speaker_0': 'But I think is very inappropriate. So at this point, I'd like to call on other members.'",
        "'speaker_5': 'Oh.'",
        "'speaker_0': 'Member de SAC.'",
        "'speaker_1': 'Thank you, Madam Chair. Now, you know, this has always been a longstanding concern, but Cyprus, particularly in the past several months, westend resident, good advocate on a whole host of issues. Steve Grizzle, I'm sure, has reminded not just myself, but other council members and staff persons to try to get data on a geographic level.'",
        "'speaker_1': 'So one of the things I certainly want to do is if if we can prepare, I don't I don't really need a whole slew of data just but particularly for streets and sidewalks to kind of break it down in terms of the upcoming upcoming budget.'",
        "'speaker_1': 'Break it down by, you know, program projects that are being contemplated for the two fiscal years ahead of us that are west of Grand Street or or whatever geographic areas you think are fit. But the three that come to mind is west of Grand Street, east of Grand Street, and the third being Hervey Bay, four mile.'",
        "'speaker_1': 'If you could just get kind of, you know, what are the street sips that are here as well as sidewalks? The apps. I recognize, by the way, that staff has also pointed out that different areas have different needs based upon, you know, age, etc..'",
        "'speaker_1': 'So certainly make sure to caveat whatever information data that you put together that would be very helpful.'",
        "'speaker_6': 'One clarification on the streets again. We do a variety of pavement repairs on the streets. We do a slurry seal. We do so. Do you look are you looking for street resurfacing as the classic? You go in and take the whole thing out?'",
        "'speaker_1': 'Oh, actually, that's a good point. Maybe on the streets, if you could just exactly divide it by I mean, is there slurry seals versus, you know, redoing the whole streets? And maybe if you can divide the street, work by those, what is it, three or four type of treatments that you guys have?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_6': 'Okay. We'll divide that up. Yes.'",
        "'speaker_1': 'Okay. Appreciate that.'",
        "'speaker_3': 'Member Ashcroft, just before you leave, Mr. Hyde, just to clarify and question when you're going through and doing the triage list or whatever it is you do have, you know, the streets and sidewalks to be repaired. Is there a geographical consideration given?'",
        "'speaker_3': 'Do you try to go?'",
        "'speaker_6': 'There's really not geographical considerations. This is how the considerations are given. Number one consideration for street is the street pavement. The pavement condition index, the PCI, we're driven by the PCI is we monitor those all the time. And so that's really the primary driver for streets.'",
        "'speaker_6': 'In addition to that, we're also looking at sewer replacement. As you know, we have a large program of sewer replacement. So we're trying to coordinate the sewer replacement, work with the streets that need to be resurfaced.'",
        "'speaker_3': 'Third item I was just going to say on the sewer replacement, that was a really smart point that was brought out in the report that the city public works is looking to see where these sewer replacements and repairs have already been done because the last thing you want to do is a nice resurface or repair of a'",
        "'speaker_3': 'street and then have another agency. So you're coordinating across other agencies.'",
        "'speaker_6': 'Involved with that because I believe we have a whole video now. But we finally and this is very exciting for Aaron Smith and myself that we finally have a full video of all of our sewers. This is the first time we ever had that.'",
        "'speaker_3': 'Sort of slow Saturday night.'",
        "'speaker_6': 'Oh, no, this is this is exciting. The smell sewer, not copy. What it does is it gives us the ability to have to look at the inside of those pipes and figure out what needs to be replaced.'",
        "'speaker_3': 'Great technology.'",
        "'speaker_6': 'It's very evidently. So this is a program you've seen all those trucks around town, all you know, for the past couple of months, and that's what they were doing. And that's going to be a valuable asset for us because that's all geotagged now.'",
        "'speaker_6': 'So we can look at that video, hit a button and find out exactly where that that defect is in the sewer. So that's part of the larger thing of all the asset surveys. We're trying to we're surveying the buildings.'",
        "'speaker_6': 'We're going to do the same thing with the storm drains. We're trying to get a solid, reliable, accurate picture of what needs to be done and a program to get it done. But first, we have to identify what needs to be done.'",
        "'speaker_6': 'Previously, there's just kind of been a number pulled out of the air regarding the amount four streets or something like that. We're really trying to categorize those. And on buildings, on the facilities, we're also looking at giving you a long range projection.'",
        "'speaker_6': 'One is the roof on the library need to be replaced. One, does the roof on the city hall need to be replaced. So you council will have the benefit of looking well in 2042. We need to budget this inflated number for replacing the roof on whatever facility we're looking at.'",
        "'speaker_6': 'And that gives you kind of a long range, you know, multiyear outlook about what's going.'",
        "'speaker_1': 'Anymore.'",
        "'speaker_0': 'I swear.'",
        "'speaker_6': 'Yes. And along those lines, I'm hoping that when this prioritization comes back, we look at the projected fund balance that are necessary to do this, because I see a large amount of cash there. And I know in the past there's been either reluctance or inability to spend that cash.'",
        "'speaker_6': 'To. Take a project from start to finish to avoid repairing the street versus replacing the street, etc.. So that's what I look forward to in the future. I think the budget makes sense. I'd like to get whatever was referenced in this measure.'",
        "'speaker_6': 'B Broadway. Jackson I'd like to get that resolved so that we. Pursue Broadway. JACKSON At least don't hold it up from our heart, because that has been a long, long standing open item. And I'd also like to look at approving this budget with a timeline that keeps us in compliance with the consent decree as far as the'",
        "'speaker_6': 'sewers go. And if there's a way we can get ahead of the curve, save some money on that, because I know there's a mandated schedule. If there is a way that we can relieve that schedule with putting money expenditures upfront.'",
        "'speaker_6': 'I'd like us to do it. That's one of the things on on that album is that we're doing three miles per year. We're only required to do 2.6 miles per year. So we have a little bit of a float every year and it's a three year rolling average.'",
        "'speaker_6': 'Okay. On, on, you know, so we wanted that flexibility. And in case we have a hiccup, we open up the street. Something was radically wrong. We didn't expect it's going to take us longer to do that, if we certainly can.'",
        "'speaker_6': 'Part of the problem is just managing the crews out there and, you know, you have sewer crews, I mean, sewer replacement crews all over. So we can't have more than one crew working on the island at one time.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'So in regards to the Army, the County Transportation Commission, they have staff that creates lists of projects that are county wide and they prioritize based upon understanding is. What they think is most urgent, as well as what projects have been submitted and everything that they've been able to research and allocate funds for that way.'",
        "'speaker_0': 'But they do have a county perspective and another issue in regards to Broadway Jackson. It's not simply pushing cars through the tube as quickly as possible. It's also protecting the pedestrians on the Oakland side. And there has been injuries and my understanding is at least one fatality.'",
        "'speaker_0': 'So being good partners with neighboring cities is is is a consideration for the commission in its entirety. Every day.'",
        "'speaker_1': 'So I thank you. Actually, I just have one more point to add a quick comment. One additional point is, you know, in going over the budget that's prepared by the city manager's staff, a council is fulfilling among a variety of charter responsibilities.'",
        "'speaker_1': 'Two specific ones, one particular related to positions, because that's a specific responsibility enumerated 3-7 within the charter. Another responsibility within the charter that's intimately tied to the budget process is the organization of departments. It's spelled out that the council.'",
        "'speaker_1': 'One of the things that we I love to have your thoughts on, if not tonight, you know, spelled out perhaps, you know, it's a memo or email is the thought about a specific transportation traffic transit department or however because it just seemed like such a big, big part of our life right now.'",
        "'speaker_1': 'And a lot of it is certainly within the public works department, whether it's almost or at a point it sounds like seems like where, you know, the residents themselves would like to be able to have some kind of structure in place where they not only see the different solutions in place, but have some kind of organization.'",
        "'speaker_1': 'I don't know. But if if staff can give some thought to that, maybe, maybe we can't have a transportation, maybe that's not the best idea. But, you know, whatever thoughts and suggestions you have.'",
        "'speaker_6': 'My recommendation would be to go with the transportation study, look at that transportation study when we receive that, and then look at implementation and see what the study. That's one question that we will put in the transportation study about recommendations for additional staffing.'",
        "'speaker_6': 'And it you know, if we if it comes back, then I think that's the appropriate time. We're going to have a fresh study. We're all going to look at that, say, okay, how do we carry this forward? And I think that's the appropriate time to just start talking about that position on November.'",
        "'speaker_3': 'Ashcraft Actually, Mr. Horn took the words out of my mouth and actually said that much more eloquently than I would. But I think when we get the results of that study that we approved back, we will be in a better position to take the next steps.'",
        "'speaker_6': 'Thank you. Thank you.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'So I want to say one thing real quickly. It is good note. Several weeks ago, residents had come up to me at my office hours, you know, concerned about the Lincoln Avenue between Webster Street and Grand Street. It's great to see now that it's nicely smooth and paved.'",
        "'speaker_1': 'So I know the residents will be happy when they drive down that street. Thank you.'",
        "'speaker_6': 'One more comment on that. I'm done is we're going to a great effort to make sure that everything gets in the street before we repave the street. Okay. So we again, with these long range plans that we are developing, we're sharing those with PGE, with and with everybody with the East Bay mud and telling them to jump'",
        "'speaker_6': 'into the pool. I may be back before you in a couple of years to make that a little bit more enforceable in that if somebody didn't take that opportunity and it's not an emergency repair, they may have to spend ten, $10 a square foot to open up that street to give them a little bit more serious consideration'",
        "'speaker_6': 'about opening up our streets. That's a good.'",
        "'speaker_0': 'Thank you. All right. Now we're going to move on to community development. Debbie Potter.'",
        "'speaker_4': 'Good evening. I'm Debbie Potter, the city's community development director. I'm actually going to be presenting on three departments this evening. So in the interest of time, I am if it works for the council, I can run through all three of the presentations and then I can take questions on whichever department you want to ask about.'",
        "'speaker_4': 'So if that works, that's the way I'll set that up. Okay. So who is the Community Development Department? A I'm going to have the same problem. Do your dance over here. All right. It's this one. Oh, wait, wait, wait back.'",
        "'speaker_4': 'Okay. Okay. All right. Oh. Oh. Okay. I'd like to trigger happier. Okay. Okay. So who. Who is Community Development Department? We are building and code enforcement planning. Economic development, real estate, property management. And the Social Service. Human Relations Board.'",
        "'speaker_4': 'And the Alameda Collaborative for Children. Youth and Their Families. What do we do? So code enforcement ensures a structurally sound, safe and accessible community through effective permit processing, inspection and code enforcement activities. In 2014, the fiscal year, we are on track to issue 4500 permits.'",
        "'speaker_4': 'Typically, we do between 22 and 25,000 inspections a year and we resolve between 250 and 300 code enforcement cases each year. This is an interesting graph that shows you over the last 12 years our permit history in terms of the number of permits issued and permit valuation.'",
        "'speaker_4': 'You can see between 2005 and 2007, those were our highest volume years. That was primarily due to the Bayport project. Bayport was pretty much built out during that time frame. And at that time, during this time, we had the building community development at this time was a building and planning department, and then we had a development services'",
        "'speaker_4': 'department and in 2012, those two departments were merged into one. We'll talk a little bit more about that as we go forward. But at the time, the building and Planning Department had 38 staff people. Today in 2014, between the planning and code enforcement and building, we have about 20 employees dedicated to to our permitting, our permit center'",
        "'speaker_4': ', our code enforcement and our inspection activity. We are on track probably in 2015. We are projecting that we will probably issue permits valued at over $100 million. So you can see clearly when the recession hit and when in 2012, we started to come back up out of the recession and given staffing levels, we are crazy busy at'",
        "'speaker_4': 'the permit center and we expect that to continue in. And then if just to kind of shed a light on who our customers are, we serve as primarily homeowners and their contractors. 60% of the people coming into the permit counter are really affiliated with remodels for existing homeowners, and another 16% are existing business owners.'",
        "'speaker_4': 'So taken together, about 75% of our customers are existing homeowners and businesses in the city of Alameda. It's a little snapshot about what we do at the permit center. So what is planning? Do planning assist you as the city council in managing our the growth and development of the city and the framework documents that we rely on'",
        "'speaker_4': 'for supporting the Council in those key decisions about our built environment are the city's general plan. The housing element is clearly a key element of our general plan and our zoning ordinance. We also support several other boards and commissions a planning board, the Historical Advisor Advisory Board and the Public Art Commission.'",
        "'speaker_4': 'We process development applications and planning as well as applicant building permits, which the building department division does. So on the planning side, in this current fiscal year, we have issued over 750 planning permits. We have assisted over 2400 people who walk into the permit center, and we have served over 1600 people who call in to City Hall'",
        "'speaker_4': '. Economic development you received last month a pretty comprehensive presentation on our economic development division. But just to highlight that, I mean, the key task of economic development is to provide business retention, expansion and recruitment services with the goal of really growing the city's tax base so we can fund those essential services you heard about earlier today, Parks'",
        "'speaker_4': 'and Recreation, the library, what you heard about last week, police and fire. So that's really the focus of economic development. And then we have a workforce component where we are really working to support the residents of Alameda in terms of employment and meeting the needs of employers.'",
        "'speaker_4': 'And it's really part of our larger mission about improving the city's jobs housing balance here in Alameda. In the last 16 months, the economic development staff met with over 300 businesses and business associations. Some of the key businesses who were attracted to Alameda in the last year include Selah Nanotechnologies, right Speed Maguire and Hester is coming this'",
        "'speaker_4': 'upcoming year. And Concrete Works is a new use that has moved into the allied manufacturing site at the foot of Park Street. We have assisted major employers out at the Harbor Bay Business Park with their expansions in the past year Penumbra VF Outdoor and AB Optical.'",
        "'speaker_4': 'And you'll see both with the new businesses we've attracted and those that we have help retain. These are really in growth industries of green technologies, the biomedical field. These are high wage, high skilled jobs. And we that's really a target of a lot of what we work on.'",
        "'speaker_4': 'And then we placed 21 separate ads in local, regional and national publications promoting Alameda as a great place to do business as well as visit and live. We have a real estate and property management initiative in this in the department where we provide leasing and property management services for city owned commercial properties.'",
        "'speaker_4': 'We manage over 75 leases with over $2 million in annual revenue, and that is outside of Alameda Point. So this is for mostly our tidelands properties and some of the other city owned assets that we have. And then I talked earlier about the Social Services Human Relations Board is a city chartered board, and its mission is to'",
        "'speaker_4': 'foster mutual understanding, respect and equality among people. And the Alameda Collaborative for Children, Youth and Their Families really works with our nonprofit community and the school district to promote Alameda as a great place for children and families. And some of their some of the accomplishments of these two.'",
        "'speaker_4': 'Efforts or initiatives. We last year the associate RB be did its first homeless count. They had 60 volunteers who participated in that count. And the purpose of the camp was to identify homeless in Alameda and identify some of the services in needs that they might have and how we can help to meet some of those needs.'",
        "'speaker_4': 'We had over 600 community members who participated in the 2014 Harvey Milk Day events. We had 14 schools that participated in the 2014 season of nonviolence. The daily readings, which the City Council also participated in, and Youth Collaborative worked with the Alameda Education Foundation and some other nonprofits to see that for the last school year, this current'",
        "'speaker_4': 'school year, over 1000 low income kids in the Alameda Unified School District received free backpacks with school supplies. That's a major initiative that the Youth Collaborative participated. What are some of the new initiatives that we have going in the building division?'",
        "'speaker_4': 'This is this first bullet is really a fancy way to say that we want to continue to enhance our customer service and we are looking to do how to brochures. We really want people to know if I want to remodel my kitchen, if I want to redo my bathroom, what are my permits, what are my processes?'",
        "'speaker_4': 'What are my requirements to do some of the most common kinds of things that homeowners in Alameda undertake by way of renovations? We want to bring back the building official advice columns that used to run in the papers.'",
        "'speaker_4': 'Those were very popular. The realtors really liked those. They found those articles to be very helpful for selling and buying property. And we always look for ways to enhance making the website as user friendly as possible. And then we are looking to both building and planning are looking to really utilize new technology to the maximum extent feasible'",
        "'speaker_4': '. So we're looking at a new software program that we're hoping to unveil in the next couple of months that will allow the public to access a permit history so that if you're wondering if the guy building down the street has a building permit, you'll be able to access this information online and figure out, do they have a'",
        "'speaker_4': 'permit, what's going on? And it should allow people to have a lot more access to information that you currently need to come in and ask about, and it should be more streamlined. Planning is looking. We have two priority development areas here in Alameda and Alameda, which is Alameda Point and Alameda landing and the northern waterfront.'",
        "'speaker_4': 'And the planning will be focusing on entitlements for projects that are within our two priority development areas. A planning staff also wants to update our zoning ordinance to really reflect current community priorities. So some of some examples of that are to look at updating our historic preservation ordinance to streamline that and make that work a little more'",
        "'speaker_4': 'efficiently. Universal design has been a big issue over the last year or so, so we want to have a universal design ordinance that we bring to the council and our public art ordinance. We've been actively working to update that.'",
        "'speaker_4': 'As I mentioned, planning is just as interested as building and code enforcement in really taking advantage of new technology. So we actually have a one of our planners is pursuing I bet you didn't know this. You can get a master's degree in GIs and he is pursuing a master's degree and he's been our kind of go to'",
        "'speaker_4': 'guy for really a great in our desire system. We're looking at doing more and more online permitting just to make it easier for people and hopefully may take us into the second year of the budget. But electronic plan check is on everyone's wish list.'",
        "'speaker_4': 'The engineers at AMP, the engineers at Public Works that plan checkers in our department. It would really make things a lot more efficient.'",
        "'speaker_0': 'And we're Ashcraft.'",
        "'speaker_3': 'I am sorry to take you back, Miss Potter, but I did have a couple of questions I realize you're going quickly through, which is great, like the pace, but I just want to ask a couple of questions. On the building division, we often hear that there is a need for more building inspectors.'",
        "'speaker_3': 'I think maybe I saw that in the budget.'",
        "'speaker_4': 'Right? When I get to the new staffing slide, you'll hear us talk about the upkeep.'",
        "'speaker_3': 'Good. And then you mentioned how two brochures for, uh, are being contemplated or prepared. Will these be available online as well?'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_3': 'Okay. Because we do have a concern about how much paper we use. And also, I think more and more people are getting their information electronically. I think there's a I heard about an initiative or an idea that's being tested in building, which is a a mobile app for routine inspections out in the field that is actually on'",
        "'speaker_3': 'the contractors cell phone. And. Right.'",
        "'speaker_4': 'So that is one of our initiatives regarding taking maximum advantage of technology, which is to allow our inspectors to do remote inspections. So we are piloting that program right now with some with a handful of contractors that we've been do a lot of business in the city media.'",
        "'speaker_4': 'And when we're done with the kind of the beta testing, we will be rolling that out. But that is that is an initiative that will be in the upcoming fiscal year. Okay.'",
        "'speaker_3': 'Thank you. Thank you.'",
        "'speaker_4': 'And then economic development. You've heard Mr. Rato talk a lot about bringing back the facade program and council member Oti is a big fan of that too. So we have budgeted $125,000 a year to reestablish the facade program.'",
        "'speaker_4': 'And we also talked last month when we presented on the Economic Development Division about preparing a new economic development strategic plan. The last economic development strategy was updated in 2008. So we think it's time to update the strategic plan.'",
        "'speaker_4': 'And then we are looking to fund workforce development initiatives. Some of you might be familiar with the working waterfront cohort that is underway with College of Alameda and some of our maritime employers. And we want to be able to help out with some of those workforce development initiatives.'",
        "'speaker_4': 'And then we want to formalize our business branding campaign. We really we've kind of been working with that tagline, Choose Alameda, and we want to kind of build on that that branding campaign. And then for the real estate property management, we have a major study underway looking at how to improve our maritime facilities, the piers and some'",
        "'speaker_4': 'of the other resources that we have at the public marinas, that kind of thing. And there's been a lot of discussion of late about cell towers. And so we're anticipating that we might be looking at a policy for cell towers on city owned property.'",
        "'speaker_0': 'That was actually suggested at the planning board.'",
        "'speaker_4': 'SSA Tabi and the Youth Collaborative. SSA Tabi would like to conduct a second homeless count. They are also planning on updating their community needs survey, which they do periodically and they would like to do a second annual community service awards program.'",
        "'speaker_4': 'And the Youth Collaborative is working very closely with the school district and with the Economic Development Division on career pathways and looking for ways to move kids into high school, to community college, into training programs to really make sure that we're training our youth of the future for our high wage, high demand jobs of the future.'",
        "'speaker_4': 'And I think this was something that might have been done 10 to 15 years ago. But a youth report card about the health of of the youth, you know, graduation rates, health data, child care. So that's another initiative that the Youth Collaborative is looking at doing in 2015.'",
        "'speaker_0': 'In regards to the career pathways, we're always looking for companies that would like to join the school district in the city and internships and training programs.'",
        "'speaker_4': 'Absolutely. So we do have some new staffing that we're proposing and that is in the budget. The first position would be an economic development management analyst. We if we are going to take on the facade program, we need staff to implement it.'",
        "'speaker_4': 'So it's kind of a package deal, staff, person and fund essentially the capital funding for the facade improvement program. If we are going to stick to or achieve our performance measure benchmark of inspections within 48 hours of a request for an inspection.'",
        "'speaker_4': 'We need a new supe. We need a supervising building inspector. We are. We are not meeting our 48 hour turnaround and we need to really get there. We're going to need a new supervising building inspector to manage them, the inspectors.'",
        "'speaker_4': 'We are also proposing an assistant community development director for planning and building and an an executive assistant. Both of those positions are really being proposed to better align the job duties and responsibilities within building and planning and then economic development.'",
        "'speaker_4': 'And so those are. Those aren't brand new bodies, but those are going to be looking at re characterizing some existing positions. Just I talked earlier about how there used to be a building in the planning department and there used to be a development services department.'",
        "'speaker_4': 'And when you combine what is today community development, when you look at building and planning and development services, those two at their peak were 67 employees. And today we are 30 employees. And I will note that we don't have redevelopment.'",
        "'speaker_4': 'And I did make a little footnote here in 2011, which was the last year of redevelopment. The city in one year received $15 million in redevelopment funding, 3 million of which for just that year went for housing and 12 million of which was available for economic development activities.'",
        "'speaker_4': 'So no more redevelopment. And then housing, which I'll talk about next is we the city contracts with the housing authority for its housing the administration of its housing programs. So just caveat in that in 0405, the 67 employees were also working on redevelopment and housing.'",
        "'speaker_4': 'But still we have been severely reduced in terms of what we're doing today versus what we were doing ten years ago.'",
        "'speaker_0': 'Question Member Authority Thank.'",
        "'speaker_5': 'You, Madam Chair. So of the the reduction from oh 5 to 15 from 67 to 30, how many of those positions would you attribute to the loss or redevelopment?'",
        "'speaker_4': 'I'm.'",
        "'speaker_5': 'Maybe don't have it yet.'",
        "'speaker_4': 'Over time, probably five positions. Over over time, you know, because we started when we started probably laying off in 2009 and by 2011, between oh nine and 11, it was probably five people.'",
        "'speaker_5': 'That's it.'",
        "'speaker_4': 'For redevelopment.'",
        "'speaker_5': 'So the other 32, 32, 32 were.'",
        "'speaker_4': 'I would say, between housing and redevelopment that probably represented. 8 to 10 staff people.'",
        "'speaker_5': 'Okay. So the other was just, you know, regular budget cut. Reductions.'",
        "'speaker_4': 'Well, that and we'll talk about this with housing. The federal government has also been cutting back the block grant program in the home funding. So some of the cutbacks really started tied to the feds and then just, you know, redevelopment activity, because a lot of I mean, I'm not going to a lot of the redevelopment funding goes'",
        "'speaker_4': 'for debt service. So, you know, after that, you know, so that staffing levels were starting to decline in 0809.'",
        "'speaker_5': 'I guess what I'm trying to see is, you know, what's the what's the apples to apples comparison? I mean, it's not 67 because housing and redevelopment are not in there.'",
        "'speaker_4': 'But, you know, so. 3557. I'm I would say if you took out redevelopment and housing, it was probably 57 employees and down to 30. So it's.'",
        "'speaker_5': 'Still a.'",
        "'speaker_4': 'Substantial reduction of staff over the last ten years.'",
        "'speaker_5': 'Okay.'",
        "'speaker_4': 'Thank you. Lately.'",
        "'speaker_2': 'I think some of that also was backfilled with consultants. Right.'",
        "'speaker_4': 'And base for use. Right. When you don't have staff, you're you're cobbling together part time people. You're cobbling together staff. You know, we yeah. You use part time planners, part time staff, consultants. That's kind of how you piece it all together.'",
        "'speaker_0': 'So we thank you for clarifying that.'",
        "'speaker_4': 'Oh, sorry, we budget. Okay. So our total budget is about $5.4 million and we are projecting budgets of 7.3 and 7.4 million in the upcoming fiscal years. And you might be wondering, that's about a $2 million. That's a huge jump.'",
        "'speaker_4': 'But I just want to point out that the reason it was 5.4 million in this current year, we have a lot of salary savings. Unfortunately, not only is it super busy, but it's very hard to recruit. We're down to permit tax.'",
        "'speaker_4': 'We're down a code enforcement officer, a planner. And it's not just Alameda that has challenges recruiting for these kinds of positions. It's cities throughout the Bay Area. We have staff constantly sitting on all boards in other cities, and it's just tough to fill these positions.'",
        "'speaker_4': 'So the bulk of the difference in the total department revenue is really from salary savings for this year. And the upcoming two budgets reflect us fully, fully staffed and fully funded. And then just to quickly go through our different divisions, I just the most important thing, two important things to point out here.'",
        "'speaker_4': 'One is that building and code enforcement and you'll see the same as for planning. Both of those divisions are 100% funded fee for service. So revenue comes in we budget the staff that we need to meet the needs of the customers who come in and pay.'",
        "'speaker_4': 'So that's an important thing for a. The community to know about how we find ourselves in building and planning.'",
        "'speaker_2': 'And that's not an easy task for me. That's not an easy task.'",
        "'speaker_4': 'And and then you might see that we're projecting revenues that are a little bit more than total expenditures. And I just wanted to highlight that when the council approved the fee schedule and the fee study in 2013, we asked for the ability to collect enough in fees to pay to a reserve that would equal 90 days of'",
        "'speaker_4': 'staffing for the department. So in the event of a natural disaster or something where building just, you know, it's went down, but we were actively needing to be out there dealing with a result of a natural disaster. We would have at least a 90 day reserve.'",
        "'speaker_4': 'It'll take us five years, we project to get there. But that's what you're seeing here, is as we start to build that 90 day reserve, and that is for building and code enforcement as well as planning. So here you can see planning.'",
        "'speaker_4': 'They're there, they're showing a little bit less of a reserve, but the money actually goes into one fund for for both those divisions. And once again, it's a 100% fee for service funded division. So economic development is a little bit more creatively funded.'",
        "'speaker_4': 'We, the other sources, which is that 87% of this division's budget is and there's a little footnote at the bottom that says fiscal ISA revenue and our Commercial Revitalization Fund, which is also least revenue that comes in from economic development initiatives like theater and some of the other redevelopment initiatives.'",
        "'speaker_4': 'That is the primary source of funding for economic development. And then when council approved the Economic Development Division Manager, it also approved funding that position from the general fund. So what's reflected here is the general fund funding is for the Economic Development Division Manager.'",
        "'speaker_4': 'That's the. The General Fund contribution to economic development.'",
        "'speaker_0': 'Member de SAC, I think.'",
        "'speaker_1': 'Just a quick question on the FISC lease revenues now where we approved the CFD for the Catalyst project. And isn't that particularly where the FISC revenues are? So at what point is that going to.'",
        "'speaker_4': 'That is an excellent point because this is not a sustainable source of funding for the Economic Development Division. Although I promised Liz that we would come with a budget that would would work for the two year budget cycle that we're entering.'",
        "'speaker_4': 'But that's right. When Catullus us undertakes its Phase two development, the lease revenue won't be ours and some of it will go away. And we will be coming back to the council, most likely at that time with an analysis of what the general fund is gaining by the demise of redevelopment.'",
        "'speaker_4': 'And we will be talking to the council, most likely about earmarking some of that that money for economic development initiatives at that time. But at this point, we are confident that the revenue is here for the upcoming budget cycle.'",
        "'speaker_1': 'Duly noted. Thank you.'",
        "'speaker_6': 'I swear then to me it doesn't make any sense to add a staff person. Economic Development Manager Analyst is a full time additional position if we've only got sustainability for two years.'",
        "'speaker_4': 'Well that we will we will mostly we have an in for two years and the we the nice part about lease revenue and other kind of dedicated funds is that you have a fund balance. Whether that fund balance, how far that fund balance takes us then into the next two year budget cycle, we will have a better'",
        "'speaker_4': 'sense of that in the next cycle. But that that will be a decision by the Council if it if the Council wants to bring back the facade program and make that happen.'",
        "'speaker_6': 'So if we have a contract person who can take a two year contract for the life of this, I'd be okay with that too to manage the the saga, however. But if we can't sustain it, I don't see bringing an employee in benefiting them and then having let them go in two years and being faced with that'",
        "'speaker_6': 'decision, that's not sustainable. So I think we need to look at that very carefully. And if we've got, again, transient work and that is transient against a transient budget, then we have to make that tough decision everyday.'",
        "'speaker_1': 'So I think that's a that's a valid point. My take on it though is that you bring in the staff that you need and the challenge for that staff person and him or her is to generate the economic development and the revenue so that they become self-sustaining.'",
        "'speaker_1': 'In the meantime, in our fiscal and the two fiscal years we get the services that that we want out of them, as well as the services that we want through the facade grant, the facade improvement. So it's whomever we hire, should we go down that path.'",
        "'speaker_1': 'I think they'll be on notice that, you know, you got to make your own revenue.'",
        "'speaker_0': 'Is warmer than.'",
        "'speaker_2': 'Right. Thank you, Madam Mayor. I think you know this I'm hearing a recurring theme, and I think this came up with the project managers in Mrs. Aldridge's presentation, as well as Mr. Mahone and Mr. Garland. Now, our staffing is fluid.'",
        "'speaker_2': 'It's not it's not because this person is here today. We expect them to be here in five years or ten years. I think, you know, we have the ability to flex our staffing. And if the and if the revenue is there, then we keep them.'",
        "'speaker_2': 'It's not we have you know, we have people retiring all the time. And so we can flex our staffing. And I think also, as Councilmember De Saag said, you know, that is one of the efforts that this individual is going to be doing is in the economic development division is to be generating more sales tax, you know'",
        "'speaker_2': ', property tax and those in those types of things. And she's correct that as the redevelopment agency, you know, as it winds down, it's its work, more of that revenue gets flowed into the general fund. So it's not a you know, I know it's it's attractive to say this is a discrete thing that this person starts here and'",
        "'speaker_2': 'we know that they're going to be here in perpetuity. But that is not exactly how it works. So I just wanted to sort of give you that that perspective, at least our perspective when we hire these folks.'",
        "'speaker_0': 'Yeah. So will you be asking for direction on that? Because I do support your recommendation.'",
        "'speaker_2': 'Absolutely. I mean, at the end of tonight, I think we're going to want direction on these on these positions.'",
        "'speaker_0': 'Are you keeping a short list? Yes, thank you.'",
        "'speaker_4': 'And then on the real estate property management, that budget is 100% funded from the Tidelands. The lease revenues that we receive from our Tidelands leases. And by law, we are required to reinvest those revenues into tidelands related activities.'",
        "'speaker_4': 'So this is a pretty straightforward. And then I guess SSA Tabi and Youth Collaborative would be the other general fund funded initiative that we have. But you can see it's a very minor amount and on the special funds, the 22%.'",
        "'speaker_4': 'So Alameda is very lucky. We have a very generous county supervisor and supervisor Wilma Chan gives to the city $15,000 a year as a contribution to the youth collaborative so that that helps fund that initiative. So that is the budget for and this is a they're so small that this is a combined budget for those two initiatives'",
        "'speaker_0': '. And I'd like to share that even though it's a relatively small budget, but it's there are many community service organizations that participate, many volunteers and provides amazing service to.'",
        "'speaker_4': 'All of you know, Jim Franz is an amazing person who you would never know that there was one guy behind all this in terms of what he does for the community. And then this this is just a graphic, as some as I think Jane said, it's just a graphic depiction of what we just ran through and about'",
        "'speaker_4': 'revenues. And we have a very small sliver of general fund funding, but the vast majority of the department is funded by fee for service, the other dedicated funds and it looks pretty much the same for 1617. And then with that.'",
        "'speaker_4': 'Oops, can you do that? Yeah. Okay. I'll do the housing one and I'm. And we, as I mentioned, the city contracts with the housing authority to implement the city's housing programs. And we do that arrangement is. Captured in a staffing services agreement.'",
        "'speaker_4': 'And we will on the June 2nd council meeting, we will be bringing the Staffing Services Agreement for the upcoming two year budget cycle to the Council at the same time as the budgets presented.'",
        "'speaker_0': 'So this is the Affordable Housing Week and November. Ashcraft and I were at an event yesterday for the reopening of the Diamond Center and then this Friday. So Friday afternoon, there's also a public event.'",
        "'speaker_3': 'And I attended the the kickoff of affordable housing week on Friday night this past Friday night in Oakland. Very well attended.'",
        "'speaker_0': 'You. Okay.'",
        "'speaker_4': 'Okay. You don't want me to sing or anything? Oh, the assistant manager, right? Yeah. No. Oh, yeah, that. Okay. Okay. So what I do as the community development director is I'm the I administer the staffing services agreement on behalf of the city.'",
        "'speaker_4': 'So I work closely with the Housing Authority staff as they do their work to do housing for Alameda. So a housing authority, their their division, their housing and development division, they have a few key goals. One is that they develop new affordable rental housing and they have some projects coming up.'",
        "'speaker_4': 'Stargell Commons, which is going to be located on Stargell Avenue, just west of Fifth Street. And so it'll be between Fifth Street and Shinsei Gardens. We are expecting any day now that we are going to hear that we got our tax credit funding for that project.'",
        "'speaker_4': 'So if that is the case, construction will be underway by December of this year. 2437 Eagle Avenue, which is 22 units, is scheduled for a planning board design review on June 8th. And the Del Monte Project, this is the affordable this stand alone affordable project is scheduled for planning board action on May 26.'",
        "'speaker_4': 'So they are moving forward with a number of affordable housing projects and their focus is on what their new development is on very low and low income housing. They also administer the city's inclusionary program, which is the below market rate units.'",
        "'speaker_4': 'So Cadence, the 16 units, that's the fancy name for the inclusionary units at Alameda landing the Tri Point Project. And they a couple of weeks ago, they did the lottery for the first four units and they had several hundred people participating in that lottery.'",
        "'speaker_4': 'And then we have 16 inclusionary units that are going to be made available in the Marina Shores project. So they're working on that. And then they also administer the city's down payment assistance loan program. It is tough to make silent seconds or second trustee loans in this kind of hot market when it's so expensive.'",
        "'speaker_4': 'It's just very challenging for moderate income people and very low and low income people to qualify, even with the support of a of a second trustee. But they we offer the program. They do first time homebuyer sessions, too.'",
        "'speaker_4': 'And the staff administers the Community Development BLOCK Grant Program Council voted on the five year plan and the upcoming annual plan at its last meeting. Residential rehab is a huge component of the CDBG program. Staff does residential rehab for owner occupied or rental housing, and they completed six projects in the 2014 calendar year.'",
        "'speaker_4': 'We also do lead paint hazard abatement. Although that program is going to be winding down for staff, city staff, and it's going to be run by the county directly, so that that will be a change next fiscal year.'",
        "'speaker_4': 'And we do an accessibility modification program and that's grab bars, ramps, lifts, that kind of thing. So 46 projects received grants for accessibility modifications in 2014. And of course, we've had a lot of discussion about the Rent Review Advisory Committee, which housing authority staff staff, that committees and there have been 30 cases to date in this fiscal'",
        "'speaker_4': 'year that have gone before the RAC and the home program. They have expended 100 and almost 136,000 on the start of Common's project. So this budget is this current year, the projection is at $1.8 million and the budget is projected to be closer to 1.76 million in the next two years.'",
        "'speaker_4': 'And that is really a function of the federal funding being decreased for CDBG and the home program. We are affordable housing. Finally, is that the affordable housing unit fee? So it's the fee that commercial developers pay to offset the impact of new employees in the city on our housing stock.'",
        "'speaker_4': 'So we're projecting a little more money in the upcoming years because of commercial activity in the city. And then just a quick on the previous cuts over the last ten years, you can see that cumulatively the CDBG programs have been cut over 30%.'",
        "'speaker_4': 'The home program over 40%. And once again, we've been talking about redevelopment. You can see in 2025, we got in one year, one, almost $1.8 million. In 2015 zero. It's a 100% reduction in redevelopment funding. So statewide, the number one source of housing, affordable housing funding was eliminated when redevelopment was eliminated.'",
        "'speaker_4': 'So it's really kind of illustrates that. I do. Okay. That's it for housing. And then successor agency is last. So in keeping with the theme of redevelopment and the elimination of redevelopment debt. So we have this new entity that was created when redevelopment went away, which is called the successor agency to the Community Improvement Commission, and we'",
        "'speaker_4': 'usually refer to it as the FAA. What we do, we unwind the affairs of the former CIC and we're really the successor agency is charged with meeting all of the enforceable obligations, completing redevelopment projects and disposing of assets, which is really land that was owned by the CIC.'",
        "'speaker_4': 'We staff a seven member oversight board and that oversight board, the members of the oversight board are prescribed by state law and they they they are primarily the taxing entities who benefit from the property taxes. So under the state law, the oversight board will be going away July one of 2016, and all of the oversight boards will'",
        "'speaker_4': 'be subsumed by one county oversight board. And in the governor's revi. The Governor's budget bill is tasked the county auditor comptroller's office to be in charge of the county successor agencies and the oversight boards. So it's a little I think they might have been caught a little bit off guard about their new responsibilities.'",
        "'speaker_4': 'So it's a little uncertain about what's going to happen after July one of 2016. But that is kind of the long term plan, is that our oversight board will go away, will be part of a county oversight board, and the Auditor Comptroller's Office will will staff all that.'",
        "'speaker_4': 'We prepare a ROPS twice a year and that really is just a listing of all of our enforceable obligations and our payments in those six month periods. And the, the the big redevelopment project that we have left here in Alameda is Alameda Landing.'",
        "'speaker_4': 'I'm wrapping up the DDA on that project. So in the next upcoming budget cycle, implementing phase two. Most of you know that phase one is well underway and is almost completed. So phase two, which is the area from Mitchell Street north to the waterfront, it's about 40 acres.'",
        "'speaker_4': 'That's the last that's phase two of Alameda landing. And then we have one parcel that is owned by the CIC or is now owned by the successor agency that we refer to as the bottle parcel. And it was a remnant piece out at Bay Port.'",
        "'speaker_4': 'It's kind of a funky looking. It's kind of skinny. It really looks like a bottle. And it's between Fifth Street and the College of Alameda, and it's not even a couple acres probably. And so we will be disposing.'",
        "'speaker_4': 'We our long range property management plan has been approved by DOF and our strategy for disposing of this was to put it on the market and sell it, you know, at the appraised value. And so that'll be that's an initiative that we'll be undertaking.'",
        "'speaker_1': 'It could possibly counsel if you've already given a staff report on that to previous councils, if you could recirculate that again or generate a new one, that would be interesting. I'd like to find out more about that.'",
        "'speaker_4': 'Are you talking about just kind of the bottle? Yeah, I'll do the one sheet from the property management plan which which you have all seen. I'll get that out to everyone. So we will be looking to dispose of that parcel to.'",
        "'speaker_4': 'So our what we get from from the county is what are enforceable obligations are. So it's really dictated by what we say our obligations are. That's the amount of tax, property tax that's remitted to the successor agency. Whatever is left is then is kind of a waterfall.'",
        "'speaker_4': 'Whatever is left then is distributed to all of the taxing entities, which is why the city has been seeing an increase in property taxes, because the city is a taxing entity. And we're actually lucky because we are a high property tax dollar city.'",
        "'speaker_4': 'And so based on the formula, we get $0.32 of every property tax dollar, which is we are very fortunate. There are some cities $0.11, $0.17. So we're really in a good position. But based on our cash flow analysis, this is what we're looking.'",
        "'speaker_4': 'Relative to our enforceable obligations. What? What the budget's going to look like in the upcoming budget cycle. And you can see that 98.6% of our money is the redevelopment property tax trust fund moneys. And then there was Kyle Conner.'",
        "'speaker_4': 'The Alameda Theater was one of our last redevelopment projects, and he had a $1.4 million loan from the agency. He's been he started repaying that loan a couple of years ago. That now is revenue for the successor agency.'",
        "'speaker_4': 'It's an asset. The note is an asset of the successor agency. So that money gets plowed right back into. To be used for payment of our enforceable obligations. So that's that's our revenue. And see that by far and away, 99.2% of the funds are spent on meeting our enforceable obligations.'",
        "'speaker_4': 'Think that's. Oh, sorry. Those are. That's it.'",
        "'speaker_0': 'Questions, comments on to the next one. All right.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Base for years. Now we're going to take a short recess. Five minute recess. Thank you, Richard. It. Thank you. That's all. Ready to go?'",
        "'speaker_7': 'I didn't actually do anything, so.'",
        "'speaker_2': 'Oh.'",
        "'speaker_7': 'Good. Good evening, Mayor Councilmembers. My name's Jennifer Ott, chief operating officer with Alameda Point. I'm here to talk about the base for use department budget. And before I go into too much detail here, I just want to step back because this does have implications for a little bit of what we're doing on our budget is that base'",
        "'speaker_7': 'reuse. And you heard Ms.. Potter talk about the Development Services Department. At one point, the base reuse was a division under Development Services. It was it had a separate legal entity called Aluminum Reuse and Redevelopment Authority for a number of reasons, including, you know, mainly related to the demise of redevelopment.'",
        "'speaker_7': 'The city ultimately took over all the assets related to the base, and we created a separate base reuse department. And then economic development was part of the Development Services Department that went under community development. And so we were kind of divided these different functions among two different departments.'",
        "'speaker_7': 'And as a result of that, and this is why I'm telling you this is there was a lot of shared staff between the two departments, and that's that's fine. We all cooperate and work well together. But over time it is we found that it's much easier to have separate staff, at least for some core functions.'",
        "'speaker_7': 'And there's still some sharing going on, which is, which is fine, but to to start to try to figure out a way to have each each of these divisions kind of have their own staff and to be able to it was hard for staff in a lot of ways to kind of have multiple priorities from different departments'",
        "'speaker_7': 'and different department heads. And so part of what you'll hear tonight from me is a little bit of trying to to kind of over time transition the two departments to be to be separate. And so we'll talk a little bit about that later.'",
        "'speaker_7': 'But I wanted to give that broader understanding of the base reuse department. But what do we do? There's three primary functions. And that leasing in property management is this is the first that's really the day to day. We manage all the existing facilities on an 880 acre site.'",
        "'speaker_7': 'We recruit new tenants, we retain the existing tenants, we negotiate new leases. We have 66 commercial and 68 residential leases, and we generate over $11 million annually in lease and license revenue. We have two private partners that help us do all of that, and they're representatives of both.'",
        "'speaker_7': 'Those partners are here tonight on the property management side. That's Premium Realty on the leasing side, that's Cushman Wakefield. And you are going to hear later too, at the end of my presentation, there's been some questions about how we set market runs out there.'",
        "'speaker_7': 'So we have a short presentation on that as well after this. The second function and that's that's really done that leasing property management is overseen through the base reuse department. The staff person that directly oversees as private partners is that we'll talk about this in a second is shared by both community developments the assistant community director and'",
        "'speaker_7': 'community development. That is kind of the final shared piece that will meet and maintain will maintain that sharing between the community owned department, the base reuse, and then there's maintenance and operations that's really run through the public works department.'",
        "'speaker_7': 'It's about $2 million annually to execute repairs of existing facilities, sewers and water. And we'll talk a little about the water in a second because of some of the impacts to expenditures. But Public Works maintains this about 3.4 staff people in those different functions.'",
        "'speaker_7': 'And then the final is redevelopment. And that's really obviously through the base for your staff implementing the communities plans surrounding the points, overseeing the Navy's environmental cleanup and conveyance, all the things that, you know, solicit developer interest, negotiating transactions, pursue grants and other things.'",
        "'speaker_7': 'So those are really kind of our main three primary functions. That's how our budget is divided. In terms of new initiatives, major new leases, ones that you've probably heard of that have been executed recently, as you know, about over about 120,000 feet square feet, four with Google Bricks, Beverage, a kind of organic soda beverage company.'",
        "'speaker_7': 'Right. Speed technologies in building 41, about 120,000 square feet. Another clean tech green tech company, proximo spirits. And then we do ongoing marketing and negotiations with with new potential tenants and things that well, we've got a number of leases that are pending and under negotiation, one for building, five for a food and beverage kind of incubator or'",
        "'speaker_7': 'building nine, I'm sorry for food and beverage incubator, building 23. One of the one of the hangars on Hangar Row that will be coming up for potential lease building 167, which is a building down in kind of the southern area near in state lands, tidelands area, near where the Marriott ships are.'",
        "'speaker_7': 'So we'll be working on a number of key leases that will be coming to the council over the next year or so.'",
        "'speaker_1': 'A miss. Yeah. On bricks. I just want you to know that on their website, they have they are touting the Alameda point craft soda.'",
        "'speaker_7': 'Oh, cool. That's great. We're getting some free publicity. That's good. And then the phase two conveyance, we as many of the council members know, we received our Phase one conveyance in June of 2013 for a 510 uplands acres and will be we are working very closely with the Navy right now to facilitate a second phase of conveyance'",
        "'speaker_7': ', which is currently slated for February of 2016. It'll be smaller, but it'll be some of, you know, a lot of the pieces of the conveyance phase that were done before. It was, you know, 510 acres, a significant piece.'",
        "'speaker_7': 'But there were some important pieces kind of in our gateway and other parts that will be kind of filling in the Swiss cheese of the conveyance. And so we are working very hard for to meet that February deadline of next year.'",
        "'speaker_7': 'And then the site development. We don't have to talk about that tonight. Main Street neighborhood specific plan, which was a contract consulting contract that the council approved in April. We'll be moving that forward over the next 10 to 12 months.'",
        "'speaker_7': 'A $10 million tiger grant that came up already tonight. So we talked about that, really looking at leveraging those measure B B funds to try to attract additional federal funds to build transit infrastructure in West Alameda. We have this was part of kind of your general fund really looking at previous cuts, budget budget, previous cuts and budget'",
        "'speaker_7': 'demands. We don't fit perfectly into this. I think what you were doing with some of the other departments, but just things to give a little bit of history. We have had a number of operational budget cuts and other kind of major expenditures over our lifetime, a long time.'",
        "'speaker_7': 'And so in 1999, there were actual funds that the Navy were spending in caretaker funds that ended. And because of that, that was actually really when we started being much more aggressive about lease revenues to compensate for the loss of some of the Navy funds.'",
        "'speaker_7': 'We actually privatized for a period of time the leasing with our first master developer ultimately took that back under our our hat. But those resulted in different changes and things to our budget. For 2013 and 2015. We've been paying over time a $4.2 million Sun Suncor settlement.'",
        "'speaker_7': 'The last of that payment was made this year and and then because we had a pretty major eviction I guess, I don't know if that's the right eviction in Building 167 for Nelson's Marine. And there was a significant expenditure that over time we're hoping to get back some of that money over time.'",
        "'speaker_7': 'But it was pretty big expenditure that occurred. And so these are some of the budget demands and previous cuts that we've experienced over over a period of time. I think what's important and what we've been trying to do, because there have been different approaches to the the base reuse budget over time.'",
        "'speaker_7': 'We with kind of the impending master developers that we've had on two different occasions, there has been an and there was a pretty big surplus that had developed early on and in our budget. And because of that and we had expenditures and we and because there was we were always kind of on the verge of having a'",
        "'speaker_7': 'master developer take over all the obligations, the master developer for the entire I don't mean to point property and take over a lot of those obligations related to property management. We were essentially drawing down over time on our fund balance when it came clear after the second master developer didn't work out.'",
        "'speaker_7': 'Staff has really tried to shift our budget approach to needing to be much more sustainable and having certain kind of an approach that I wanted to share with the Council as to how we approach our budgeting, really moving away from this, you know, this idea that a master developer on a, you know, is going to come in'",
        "'speaker_7': 'and save the day, you know, for the entire property is we really need to take a long term sustainable approach to our budget. And that has resulted in a number of changes that we've made over time and cuts honestly, and things that we've had to do to try to make that happen.'",
        "'speaker_7': 'It was made a little harder with the sun cow settlement, but we are now with that payment being made, really focusing in last year we were able to succeed with this is generating more revenues and expenditures. It seems like an important approach to this where we're not drawing down on our fund balance any longer and then maintaining'",
        "'speaker_7': 'a minimum of unrestricted $2 million surplus for emergencies and contingencies with the infrastructure the way it is there. If there were a fire in a vacant building or something like that, we believe we want to kind of try to meet both of these these kind of baseline, you know, approaches with having, you know, make it every year'",
        "'speaker_7': ', generating more than we expend and maintaining a $2 million minimum of a $2 million surplus. We also set aside additional funds for pier replacement and we'll talk a little bit about that because we actually have before you on May 19th an expenditure to draw down on our fund balance for the pier replacement, which I'll talk about in'",
        "'speaker_7': 'a second and you'll see that reflected in the budget. So usually in general, we generate about $11.8 million in revenue and we we pretty much expend know we want, you know, maintaining that $2 million fund balance. We want to we do expend pretty much most of our revenues assuming we have that $2 million, mainly because there is'",
        "'speaker_7': 'a lot of deferred maintenance and other things. So we try to get really close. So you see it getting close to that mark. But we always we're very conservative about budgeting on revenues and we're also pretty conservative on budgeting our expenses.'",
        "'speaker_7': 'So it's very common that we come in pretty under on our expenditures. Last year, for instance, we were budgeting a deficit. We came in $660,000 over, you know, in in terms of in the black on our budget. So we try to be conservative with these these approaches.'",
        "'speaker_7': 'The reason you see this this deficit this year is because we're drawing we had budgeted for this year $1.8 million fund balance for this pier replacement reserve. And so we're essentially with a $1.3 million contract that's before the council on May 19th.'",
        "'speaker_7': 'We're asking you to appropriate the use of the $1.3 million from that reserve fund that's dedicated for pier replacement for this very purpose to fix some sewer repairs and other things related to Pier two. And so that's why you see this deficit here.'",
        "'speaker_7': 'But you don't see, as you see the beginning fund balance or the ending fund balance stays the same. So we're we're not that is not a that's not a structural issue. It's more of a one time issue because we're drawing down on the pier replacement reserves, assuming the council approves the contract on May 19th.'",
        "'speaker_7': 'So 11.8, we have a little bump here, mainly because we are we just counted as revenue the grant funds for the Main Street neighborhood. But we also we we kind of net those out. So there's essentially a wash, but that's why you see a little bit of bump in the revenue.'",
        "'speaker_7': 'And then over time what I want to show. So we have these are the revenues. We've got expenditures and transfers out. Essentially what you see here, you know, accepting this issue with the replacement allocation, we're essentially break even in our budget.'",
        "'speaker_7': 'And we've maintained over as you'll see over these this two year period, we're maintaining, including the pier replacement budget, you know, an Indian fund balance about $2.7 million. So we've met in this budget where we've met our, you know, our approach to making sure that we're being sustainable over time.'",
        "'speaker_7': 'How this breaks down. We've got 100% lease revenue is the exception is that 12 million this includes about $200,000 of those grant funds. But in pretty much 100% lease revenues, personal accounts are about 12%. 12% of our budget.'",
        "'speaker_7': 'I wanted to mention, as we were saying, that we do have some personnel changes this year where we're going to be. Last year we had about 4.4 full time equivalents, but that only include one full time staff in the base reuse department.'",
        "'speaker_7': 'And that was me. So everyone else was shared with community development. And so what we're trying to do going forward is have 4.6 full time equivalent. So adding 2.6 full time equivalent, but having three of those three of those FTE is actually be full time folks that are dedicated to base view so that we're minimizing that sharing'",
        "'speaker_7': 'between community development and base reuse, adding slightly as personnel. And that's why you see some of the increase in our personnel budget. I mean, obviously some of the increase is just due to increases just like you have in the general fund.'",
        "'speaker_7': 'But some of it is due to this additions of the point six FTE. But really and so that includes a project manager, a remote project manager that would report directly to me to essentially assist me in the project management of, of the base reuse department and then an executive assistant.'",
        "'speaker_7': 'Whereas now I have kind of 5050 of two different administrative staff who would be consolidating that into one administrative staff with the just that would support me and the department moving forward. So I wanted to discuss those. Personnel changes.'",
        "'speaker_7': 'Services or supplies? That's really what that means. Those are legal services. All environmental consultant that looks over the Navy shoulder, making sure that they're doing, you know, what they're supposed to do and analyzing all those reports. It includes all of our property management fees and expenses and staffing, both on the residential and commercial side.'",
        "'speaker_7': 'It includes our port manager that helps us manage our contract with Myriad. So that's really the bulk of our expense expenditures. And then the fixed charges are really a essentially transfers out to the general fund to cover eligible expenses for for providing services to to the base.'",
        "'speaker_7': 'This just goes quickly through how that breaks out. There's a very simple chart here. Same. This is just a graphic breakdown of those different budget categories. They don't change significantly at all between the two years, and I'm here to answer questions.'",
        "'speaker_7': 'I could also want everyone to answer question on the budget and then have John McMahon as our lead team member of Cushman Wakefield, our leasing agent, do the market, kind of talk a little bit about how we set market rents or I can answer question.'",
        "'speaker_7': 'I think it probably better answer questions about the budget and then I could have him come up and give a little presentation on how we set our market rents.'",
        "'speaker_0': 'Member De Daisuke.'",
        "'speaker_1': 'Just a quick question on the fixed charges on the expenditures of 3.175. Is that like the police officers who happened to be working there or the fire department personnel who might be there at their time? Is is that is that what that is for the most?'",
        "'speaker_7': 'It's it's eligible expenses for kind of offsetting. Services that are provided from.'",
        "'speaker_1': 'The finance.'",
        "'speaker_7': 'Department.'",
        "'speaker_4': 'Good evening. Actually, the $3.2 million and I'm rounding it covers a variety of.'",
        "'speaker_2': 'Expenses, which includes the administrative.'",
        "'speaker_4': 'Costs of services provided by Finance, our city manager. And on top of that, it includes the component for public safety as well.'",
        "'speaker_1': 'Wonderful.'",
        "'speaker_4': 'Actually, it's probably a larger component just because it costs so much.'",
        "'speaker_1': 'Understood. Thank you. Appreciate it.'",
        "'speaker_0': 'Remember.'",
        "'speaker_5': 'Thank you. Have a nice presentation as usual. Thank you. You're probably more for full time equivalents in one, but we won't we won't make you do that. Just a quick question. Can you clarify just for the public that peer to peer that is or.'",
        "'speaker_7': 'You appear to is is related to where those big ships are in the maritime ships. Right. Those married ships that are there. So it's down in the south, kind of. I guess kind of the southwestern part of the base where you have those big ships where this picture is right here.'",
        "'speaker_5': 'Where they need the sewage, where they have a sewage problem. Yes, there's.'",
        "'speaker_7': 'A sewage problem. Right. And so we are there's a couple contracts, one that we're funding the 1.3 million that we're funding through the actual available fund balance for pure replacement. And then another war funding through our up, what we're able to kind of capture through our operating budget, we had funds available in a fund.'",
        "'speaker_7': 'So it's only the $1.3 million contract that we're asking you to appropriate funds from that fund balance, which was designated exactly for this purpose.'",
        "'speaker_5': 'Thanks. I guess we'll talk more about that next week. Ask.'",
        "'speaker_0': 'I remember comments like this one. So I also want to add it was a great, great presentation and again, I support your recommendations. Regards to staffing.'",
        "'speaker_7': 'Great. Thank you so much.'",
        "'speaker_0': 'Next base, reduce market rent determination.'",
        "'speaker_6': 'Good evening. I'm John McManus. I'm with Cushman Wakefield. We are your leasing team at Alameda Point. And I've been asked to take a couple of minutes tonight to talk about how we set lease rates and then to answer any questions that you may have on that.'",
        "'speaker_6': 'I think the first thing to emphasize and often gets lost when we have discussions with tenants is that we look at Alameda Point regionally as part of the roughly 132 million square foot East Bay industrial market, because primarily we have industrial product that's ready to lease and ready to go or what would fall into that classification.'",
        "'speaker_6': 'And so we're looking at buildings that are offered for lease from Richmond all the way to Union City and making comparisons to what we have available at Alameda Point to what the alternatives, the principle of substitution is what an appraiser would call it.'",
        "'speaker_6': 'If you wanted to go get something else, what would that be? And so I want to make sure that we do this in a regional context as we talk about rental increases from 2010 and the trough to where we are today, we will go out and inspect the buildings.'",
        "'speaker_6': 'We will look at their condition. One of the challenges and one of the things that we talked about when we were in the process of being engaged was how can we get more leasing activity when we leave it to the tenants to do their own capital repairs and improvements because we don't provide any tenant improvement money?'",
        "'speaker_6': 'And so one of the things that that comes up is, well, we'll give you a year of free rent to pay for that. That tenant may not be able to write us a check for 12 months of rent or write a check to a contractor, even though we're giving them the free rent.'",
        "'speaker_6': 'And so the condition of the building may necessarily dictate what happens in a lease negotiation. You may not have as many people. There's also this notion of scarcity. At two years ago, when we started two years ago, September, October, there was less demand in the market.'",
        "'speaker_6': 'Today we're putting buildings out and we're getting multiple users on the building. And that allows us to be more aggressive with with the asking rates. And finally, the direction of the market comes into play. If a tenant comes to us today and says, we'd like to renew our lease and our lease expires in June of 2016, we're'",
        "'speaker_6': 'going to look directionally at the market. And it's not today's rate that we're trying to anticipate what's going to happen in 2016 when that lease rolls over. Can we go to the next slide with this? The speed of the arrow.'",
        "'speaker_6': 'Do it for me. Or just the green button?'",
        "'speaker_4': 'No.'",
        "'speaker_6': 'A laser or.'",
        "'speaker_3': 'Not?'",
        "'speaker_6': 'Is it locked?'",
        "'speaker_4': 'Do it.'",
        "'speaker_6': 'And I'm sure it's operator error all night.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_4': 'It's frozen.'",
        "'speaker_0': 'But she's doing that. Can you tell me, how long have you been the leasing team?'",
        "'speaker_6': 'We were engaged, I think, in September of 2014. Yeah. I think it's September 2014. No. Excuse me, September of 2013. This is 2015. So it was it was almost two years ago.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_6': 'So. We've got this slide up here because this is this is really the important directional slide. These are asking rates. They're not necessarily taking rates. And so we compile the average asking rates for all industrial product types, which you can't say, well, today it's $0.63.'",
        "'speaker_6': 'Today it's it's you know, it was 45, but this is directional. And so from 2010, when the the market basket was at $0.44 to today at 63, that is a 44% increase in in the market overall. And this has been not just to allow me to point, but everywhere a real hardship for tenants.'",
        "'speaker_6': 'I'm working with folks now that did, you know, three, four or five year leases that are looking at at 50% rent increases. And this is in San Leandro, Hayward everywhere. It's a big issue. It's a big issue. And, you know, they become policy decisions for or cities and landlords and how far they want to push on rents'",
        "'speaker_6': '. But there certainly and we do run into circumstances where people will say, well, I've got this lease right here that you did in 2011 or 2012, and I want that rate. I want that, you know, directionally, that's not where the market is right now.'",
        "'speaker_6': 'And I think it's important to keep in mind, as we as we have that regional discussion. And just to further illustrate and again these these are averages by market we statistically. Track Alameda as part of the Oakland submarket.'",
        "'speaker_6': 'And you can see what what the average asking rates are in each market. And I apologize. It looks like some of the the Category C, which is the warehouse distribution, has slipped from market to market. But you can look in, for example, as you might expect, Berkeley and Emeryville are the high numbers.'",
        "'speaker_6': 'Oakland and Alameda actually do pretty well. We continue to see rates be a little bit lower in Hayward in Union City. We saw in 2001 and again in 2007 that flipped over and inverted with the impact from Silicon Valley.'",
        "'speaker_6': 'I expect that will be the case again. And then you'll start to see more migration from south to north, which will put further pressure on us here.'",
        "'speaker_0': 'ASHCROFT.'",
        "'speaker_3': 'Thank you. Mr. McManus, can you just tell us in the this slide in the boxes is Berkeley, Emeryville under category a high tech? Why does it seem we.'",
        "'speaker_6': 'Don't track high tech so high tech as we categorize these buildings? I'm trying to think of what a good if you drive through Fremont and you're right on 8080 kind of south of the Tesla plant, you see a lot of buildings that are characterized by a lot of glass front.'",
        "'speaker_6': 'They might be built to support 30, 40, 50% of office space. They don't have a lot of docked or so. It's a it's a building classification that would have certain elements because. Yeah, and you don't have that business park, you know, Berkeley, Emeryville isn't real business park and the things that have been torn down have been replaced'",
        "'speaker_6': 'with Office and Life Science Building. So there, there isn't enough of that product that it constitutes its own statistical category.'",
        "'speaker_3': 'Okay. And I'm a little surprised, but I guess I understand what you're saying. What what's category C again? W slash D warehouse distribution.'",
        "'speaker_6': 'And what doesn't appear here is office class-A office or buildings like where? Um, development bills in Emeryville. There are those five and six story brick buildings that are sort of stair stepped, that are built specifically for laboratory. Those would not be tracked.'",
        "'speaker_6': 'That would be a separate slide that would be office oriented.'",
        "'speaker_0': 'Any other member questions or comments? I, I had actually asked for this presentation, but I meant regards to the tenants that are out their differences between their leases because that's where I've heard some feedback that that. Trying to make sense of why one tenant gets one right and why another tenant gets another rate or.'",
        "'speaker_0': 'And also in regards to rent, when you're speaking about renegotiating leases and. And does someone report to council of how that's progressing so that we're part of that conversation? Because I would think that if we have a tenant that's been out there and or I don't know if you're coming back and saying a 50% increase from what'",
        "'speaker_0': 'you were saying, I wasn't sure. But if there's anything like that happening, I would appreciate if you would inform council of that.'",
        "'speaker_2': 'Address that again about sort of historically what?'",
        "'speaker_6': 'Well, I, I don't know. We we haven't asked anyone for 50% increase nor nor do we have anything that's under discussion at that point.'",
        "'speaker_7': 'Yes. I mean, that's not I mean, we're we are experiencing multiple offers on and buildings now where we're seeing, you know, a lot more interest. And so we are having some, you know, even, you know.'",
        "'speaker_0': 'Like an emergence, huh? That's new tenants. Well, no, not.'",
        "'speaker_7': 'All I was going to say is even a renewal, for instance, for existing tenants where the lease may say, let's bring you up to market for your renewal. And there's a discussion with us and with them about what's market.'",
        "'speaker_7': 'And there's a, you know, the lease may have a process outline as to how you determine that in some fashion, but it's usually it's legal to get comps and things like that. And we are having, you know, not a not difficult.'",
        "'speaker_4': 'But just just in-depth conversation with folks about because they may say, well, six months ago you executed a Lisa was this is like.'",
        "'speaker_7': 'Well six months ago even said six months ago that's changed. And so are some of those conversations going on. But nothing like where you're talking about displacing tenants because of 50% increase in rents and things like that. We just haven't had that kind of impact at Aluminum Point yet.'",
        "'speaker_0': 'But are we displacing tenants? Are we not able to make a deal when we have someone that does want to renew?'",
        "'speaker_7': 'No, no. I mean, I haven't heard anything. Yeah, we don't have any.'",
        "'speaker_3': 'You need to talk into the microphone, so we'll get it on the record.'",
        "'speaker_6': 'No, I'm not aware of any tenants that have been displaced.'",
        "'speaker_0': 'So in regards to negotiations, that's something that if we reach a point like that or where it seems like it's difficult, I would appreciate it if we could discuss that clause among council members.'",
        "'speaker_7': 'I think I think we are you we're coming to you with a closed session, in fact, on Tuesday where you know things because of this new situation that. Yeah. Which is honestly I mean, it's on one hand it's it's a good situation because it means we're getting a lot of interest, a lot of demand for our buildings'",
        "'speaker_7': ', a lot of demand for looking out there and potentially higher rents and purchase prices and things like that, which on one hand is good. On the other hand, you know, doesn't. Not everyone gets what they want. And in it it does create some complications in this particular case, because those complications will be coming to you in closed'",
        "'speaker_7': 'session and seeking your direction on things that are much less controversial, much more consistent with the way we've done. Business will continue to kind of facilitate in the same way that we've done that before. But we absolutely agree that if there's something controversial, honestly, especially we're negotiating a lease, we don't it takes a long time.'",
        "'speaker_7': 'It takes a lot of effort to negotiate a lease. And we do not want to, you know, have that controversy. You know, we spent all that time on a transaction and come to you and there's controversy or you're not on the same page.'",
        "'speaker_7': 'So we agree with you. We want to try to get your upfront feedback on that. Really appreciate on those more potential controversial issues.'",
        "'speaker_0': 'Thank you very much.'",
        "'speaker_1': 'Member every quick question since you're here for Mr. McManus. So in the in the East Bay Quarter that you're looking at within in the Oakland Alameda suburbs market, you have manufacturing at roughly $0.71 a square foot. So. The win for Alameda point though.'",
        "'speaker_1': 'What would be the order of magnitude? Typical order of magnitude kind of write down that that would.'",
        "'speaker_6': 'I that manufacturing is a is a definition. I think that our buildings while we we don't look to lease them for warehouse distribution because there's too much truck traffic that goes on, it's not a favored use they probably resemble the most because of the limited office improvements and things that they have on a rental basis.'",
        "'speaker_6': 'That's probably where they fit the both the best. If we had a building like Building 530, which some people call the Safeway building, the if that were in pristine condition, that would be more of a manufacturing type building.'",
        "'speaker_1': 'And what I was getting at was per square foot live rent the monthly per square foot.'",
        "'speaker_6': 'I don't think there's so much a discount. I think we're really looking at that is what's most comparable because if I were setting up an operation, a brewery and I wanted to look at alternatives and I wanted an empty box to work in, which is really what we're offering in most cases.'",
        "'speaker_6': 'I'd be looking at similar buildings that were were classified as warehouse distribution on on on San Leandro, for example. And so that's where I think our best comparison is in. Is there a discount? There's a discount on condition, but there's no discount for the views.'",
        "'speaker_6': 'And there's certainly going to be a premium for the clustering and the customers are already coming. So all these things are coming into play as interest as we set the rates. Okay.'",
        "'speaker_1': 'Thank you. Appreciate that.'",
        "'speaker_0': 'Thank you. Right. So that's. End of presentations, I believe. All right.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_0': 'Council communications or the. Well, I. I'm sorry, city.'",
        "'speaker_2': 'Manager, actually, we were hoping that we can have some discussion and get some direction from.'",
        "'speaker_0': 'You. Yes. So do you want to leave that or.'",
        "'speaker_2': 'Well, I think you've heard from the what I call the other than general fund categories. Really. I think what we need direction from you is on positions that that our folks are asking. Just to summarize, we have we are asking for 4.6 new bodies.'",
        "'speaker_2': 'And that point six comes from Ms.. Ott and we're asking for three upgrades. So it's a total of really four, four and a half new new bodies, I guess you could say, and and three positions that there are currently people in it, but they're going to be upgraded.'",
        "'speaker_2': 'Um, so that really is kind of what we're looking for is direction on those, on those positions.'",
        "'speaker_0': 'All right. Council members.'",
        "'speaker_3': 'Ashira I was just going to ask is minute, would you just list those for us and just it's been a while since the beginning of this occupation.'",
        "'speaker_2': 'So and I'll do it by department. So in recreation we are upgrading one position. It's a park maintenance worker, we're upgrading it to a four person. And then we're also asking for a parks program manager. That's a new body, but that would be shared with public works.'",
        "'speaker_2': 'They say.'",
        "'speaker_0': 'Program manager.'",
        "'speaker_2': 'Project manager. Right. Okay.'",
        "'speaker_0': 'I'm not sure if you want to respond per position or if you have a general idea of where you want to go.'",
        "'speaker_3': 'I just wanted the listing so we had so we had a friend of us all go through specific.'",
        "'speaker_2': 'So the in public works. We're looking for a project manager too. That's a new body. In economic development. We're looking for an economic development management analyst, a senior building code enforcement officer, write code compliance. Supervising Inspector. Sorry. Supervising Inspector.'",
        "'speaker_3': 'Building inspector.'",
        "'speaker_2': 'Building Inspector? That's correct. So that's economic development management analyst. A supervising building inspector. That's plus two, right? And then two upgrades. One is from city planner to assistant director and from an office assistant to an executive assistant. So that's just those are two same bodies, but just upgrading those positions.'",
        "'speaker_2': 'So economic development is two new bodies. And then base reuse, as we heard from is that is adding essentially a 0.6 body. So she's combining a bunch of positions, but the funding is additional of 1.6. She's taking some part time people and consolidating.'",
        "'speaker_0': 'Right. Member de SAC.'",
        "'speaker_1': 'Well, thank you very much. I think the 5000 feet view of, of things when it comes to the, uh, managements requests for new positions and upgrading all previous positions. I think the 5000 view of things is, for the most part that, you know, these are not the general fund and that a lot of it is funded by'",
        "'speaker_1': 'revenue streams that are specific to the purposes of of these various departments. And having said that, you know, whomever is hired, they understand the risks. And to the extent that they, you know, are entrepreneurial, generate revenues for the city and they help their positions as well.'",
        "'speaker_1': 'So from my vantage point. I support, you know, staff recommendation and I support in particularly bolstering our economic development department. Recognize that, you know, we've got certain things coming down the pike with regard to the fiscal revenue because on the the same source, that's from which we're generating the least revenue is possibly going to be redeveloped for'",
        "'speaker_1': 'other uses. But, you know, that's the. That I think will prod a spirit of enterprise on the part of that person should this council support the management analyst or economic development? And we will also have to fill the economic development position to write the staff person position.'",
        "'speaker_1': 'So I look forward to staff's. Comments on that in terms of the recreations, just quickly. What an outstanding job that department has done. And made you know it. So I think we can continue to it's good work. And again, I think as indicated earlier, the sources of that are not general fund.'",
        "'speaker_1': 'And if at some point in time it does become general fund, then, you know, then let us know. So without I don't think there's much more that I can say. Well, one final point. I appreciate the presentations by everybody.'",
        "'speaker_1': 'I thought they were they were a very nice public works presentation. Was very nice. So thank.'",
        "'speaker_0': 'You, Nebraska.'",
        "'speaker_3': 'Thank you. Just a couple clarifying questions and then a comment. So when Mithat was talking about her department and I understand there's some sharing between her department and community development. Right. But I thought at least I put in my notes.'",
        "'speaker_3': 'But I could be wrong that she's asking for one FTE full time equivalent in this budget and one administrative staff to support her.'",
        "'speaker_2': 'Jenny, want to clarify that. My understanding, and I heard you say an additional point six.'",
        "'speaker_3': 'Is that you knew all this off the top of your head.'",
        "'speaker_7': 'I think what the city manager woman am saying is that the net new FTEs point six, but because of the consolidation instead of four or this year for instance, I'm the only full time staff that's actually assigned to the base views.'",
        "'speaker_7': 'And then I'm kind of a cobbling a little half of this person, half that person. And we share sharing with the new development department. What I'm asking for, for the next two years would be three full time staff dedicated to base reuse, an executive assistant and a project a redevelopment project manager in addition to my full time'",
        "'speaker_7': '. Position.'",
        "'speaker_3': 'Okay. So help me understand how three full time staff equals point 6%.'",
        "'speaker_2': 'Because she's combining it's the funding equivalent. She's combining part time staff that she is sharing. So she's taking that money and and bringing it over and combining that.'",
        "'speaker_3': 'So some of those part times your are shared people you're creating into full time.'",
        "'speaker_7': 'Where you actually, for instance, one of them a development manager and community development. I share what community element that person's going to be full time in community development right now we as share to part we share to administrative staff people kind of half and half.'",
        "'speaker_7': 'So instead we're each going to get one, you know, here it's just, you know, so there is a little bit of an increase in my case of point six. But we're both carried out mainly in the Economic Development Department, our Division of Human About, you know, we're kind of bumping up a little bit, but we're doing it'",
        "'speaker_7': 'in a way so that we can then have our own full time staff. It was it's been difficult for staff to have competing priorities with different department heads and things to trying to consolidate. So I know it's a little confusing, but.'",
        "'speaker_3': 'As I was trying to sort of see a mental picture, I think those clever graphics that we saw in the CFP better we could have used here that, you know.'",
        "'speaker_7': 'Yeah, I should have just a slide and we will the actual budget will have a detailed kind of position by position of how that all adds up to be able to see it a little more clearly. And I'm sorry I didn't have that.'",
        "'speaker_7': 'Yes.'",
        "'speaker_3': 'No, no, that's fine. And so so my comment. Thank you, Ms.. And then Ms. for Madame. So someone Councilmember de SAC, I think mentioned we do have that vacancy now in the economic development.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_3': 'Director. So where, where in the budget does that fall?'",
        "'speaker_2': 'That's, that's actually a general fund position and we are assuming that it will be filled. So it's already factored in the general funds.'",
        "'speaker_3': 'Budget already budgeted for. Okay. So I do take to heart Councilmember de Suggs admonition, a reminder to us that these positions we're talking about, these requests are not coming through the general fund. They, for the most part, come from funding that is actually generated in part by the work of these departments.'",
        "'speaker_3': 'And these folks are hired with the caveat that they could be terminated if the funding runs out or the the use is no longer there. So I, I feel that we have good, strong department heads. I feel they've been doing good, hard work.'",
        "'speaker_3': 'We've asked them for a number of years to do more with less. And they have and we still expect everyone to be thrifty and tighten belts. But we I don't want to see us handicapping our departments, especially as we move forward on some really substantial, meaty items that are, you know, for the benefit of our entire city'",
        "'speaker_3': '. So I am in favor of giving people the tools that they need. And I'm not going to try to micromanage if I assume that by the time they came before us, they put a lot of hard analysis and thought into these requests and I'm supportive.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Member Brody Thank you, Madam Mayor. And I want to echo the comments that have already been in spoken and some of the concerns that were raised earlier. I. Understand that these are funded by, you know, other funds and other sources of revenue.'",
        "'speaker_5': 'But for instance, the economic development position where we already know that that revenue stream is going to stop. You know, I am a little concerned about, you know, bringing that on as a as a full time permanent position.'",
        "'speaker_5': 'And I think there was a concern raised raised earlier on that by one of my colleagues. And, you know, I echo that concern. I kind of had a little concern about, you know, the project manager. But, you know, I think after thinking about it and hearing all the work that Public works and Parks and Rec need to'",
        "'speaker_5': 'do that, I think that that that position will will be able to be sustained long term with enough work. And I think that will help us be more efficient as we as we implement a lot of these project.'",
        "'speaker_5': 'So a little bit, you know, probably in the minority here on the economic development, but you know, that one I'd like to see us, you know, think about a consultant for two years. But on the flip side, you know, the facade grants, you know, the workforce development, all of the good work that we want to get out'",
        "'speaker_5': 'of economic development. I think those are important. And I think those those programs are not only, you know, popular in the minds of Councilmember Ashcraft and myself, but, you know, my other colleagues on the council have also expressed strong support, especially those that have been here before and that were able to see the successes of the facade'",
        "'speaker_5': 'grant. I'd like to see you know, as I said earlier, the library, if there's a way we could find more funding for materials that may be, you know, another small, you know, stipend or one time allocation from the general fund.'",
        "'speaker_5': 'I'm not sure. There was no increase in hours and no increase in headcount this time. Two years from now, if we're sitting here, I mean, that might be something I think we might want to consider. The community has been asking for, you know, some of the cuts in hours for both city hall.'",
        "'speaker_5': 'That's not for today's discussion, but and the library to be restored. So I think that's something we can we can explore in depth, you know, either when we come back in a year and revisit the budget or next year, you know, all of the other, you know, projects.'",
        "'speaker_5': 'I really appreciate all the hard work and how we've all now done a lot more with a lot less. And, you know, all of the effort that that staff has put in. So I'm fine with all the other proposed new hires that have been been suggested.'",
        "'speaker_5': 'I'm just a little concerned about economic development and that we're going to have a long term funding source for that. That's kind of my my comments.'",
        "'speaker_0': 'I swear.'",
        "'speaker_6': 'I'm. Thank you. I. I agree that in park and Rec. And public works. I think that we have that revenue stream to support the the positions. I am concerned about the economic development as a as a finite or unsustainable revenue stream that I think that one.'",
        "'speaker_6': 'Should be a project basis entourage. I also I favor, but it's up to the department head. I favor project managers as part of the project. Embedded in that project and they deliver it. But I can I can go with this recommendation, assuming that we're going to evaluate it mid-year and at the end of the year, see what'",
        "'speaker_6': 'the progress is or what the future looks like when we come out of two years. So I would support the recommendations of staff. And provide that we go forward. I do have a question. This is our last workshop before the budget's presented.'",
        "'speaker_6': 'Correct. Okay. So I'll have a comment after. After this is.'",
        "'speaker_0': 'All right. So I see this as a realignment of funds more than anything some departments have access to over time. Others don't. Some use consultants. Others don't. Some hire part time employees. And some. Actually, I would submit overextend their employees that are salaried.'",
        "'speaker_0': 'And I see this as a correction. We did speak at the last meeting about what was referred to as phantom savings. And when you're paying overtime as opposed to hiring or filling a vacant position. Overall, I think you're working certain employees too much and we're not really doing the best work that we can to meet the needs'",
        "'speaker_0': 'of our community as well as our employees. So I fully support these recommendations and I'm confident that at the end it's money well spent. So thank you. All right. Vice Mayor And.'",
        "'speaker_6': 'I'd like to bring up something that I thought about after we went through the last session. And I think it came up when one of the speakers talked about $30 million or $30.8 million in our general fund balance.'",
        "'speaker_6': 'And. That there were a variety of ways how that was built up. But I would like to see us. I'd like this council to consider asking the budget to come to us with that fund balance. Grim down to the 20%, approximately $16 million, and the Delta or 10 million or so be allocated to some of our.'",
        "'speaker_6': 'Unfunded liabilities, such as, for example, OPEB for retired currently retired employees. Or deferred maintenance. And the question came up is, well, if we had a little bit more money, we could save some money by making investments, some of our infrastructure.'",
        "'speaker_6': 'So. A chunk of money to that. And then to look at some of those. Some of those trust funds that we have, whether it's that leg trust fund or the library trust fund that are cut constantly. I'm like I say, being confronted but are constantly being looked at for trim because I'm looking at the meta, the library'",
        "'speaker_6': ', the deliverable, the library public is materials, you know, on some level. And that's where the cuts usually come. So I would like this council to direct. City management to present us with a budget that has a 20% fund balance in the general fund and that proposes an allocation to those unfunded liabilities or the deferred maintenance as the'",
        "'speaker_6': 'top two categories. To allocate the Delta two of that $30 million so that we don't have this pile of cash sitting there on top of the general fund for the next few years, but actually put it to work, particularly in the unfunded liability that remains with OPEB, because that's another step we can take.'",
        "'speaker_6': 'We could also consider PERS Trust Fund or whatever the city manager can make a case for that says We're starting to address an unfunded liability that we haven't addressed in the past. So that's my request of my colleagues to consider giving that direction.'",
        "'speaker_6': 'All right.'",
        "'speaker_0': 'Member Ashcroft.'",
        "'speaker_3': 'Well, as I say, I think that's intriguing. And I'd like to hear if that's something we can do.'",
        "'speaker_2': 'So I think what I would like and I think it's an excellent suggestion. We have a week to publish this budget, so it may be difficult for us to get exactly, you know, where we're going to put it, because I want to get some input, obviously, from the departments.'",
        "'speaker_2': 'I mean, Elaine, if you want to come on up and you can weigh in on this. But what I'd like to suggest is, you know, your that surplus is going to stay there and we can come back to you within, you know, six weeks or, you know, a couple of months with where we want where we suggest'",
        "'speaker_2': 'that money goes. I just worry that we don't have enough time between now and next week when this thing has to actually get published, to be able to really give it some some good thought about where we'd like to put that money.'",
        "'speaker_2': 'So I think it's a great idea. I just would like a little bit more time to think about it.'",
        "'speaker_6': 'And, and my, my point is not so much where we allocated I gave those as examples, but the fact is having that but general fund balance is, is like a a temptation to live beyond our means because it is in the general fund.'",
        "'speaker_6': 'And I'd like to see it go back to that 20%. Reserve that we have to do whether the downturns. And put the other money, restrict the other money, basically take it out of that, put it in another fund balance, and you can take the time to figure out where to recommend we allocate that for these unfunded liabilities'",
        "'speaker_6': '. But don't leave that temptation for us to live beyond our means in our general fund sitting there. That's what I'd like to see.'",
        "'speaker_1': 'Member De Matt Amir I mean, this is a new idea, which I don't know, I think. I think amounts to $14 million discussion. That sounds like it's being discussed on the fly. Personally, I don't want to. I don't want to see us make a decision as a council in this budget session to basically decimate the $38,000,030 million'",
        "'speaker_1': '. Reserve that we have just whatever amount that represents, 20%, 20% would be I mean, that's $20 million is if our budget is $8 million and eight 8% represents 10% or 16% represents those $16 million. You want to go from $30 million, $30 million to $16 million because $60 million equals 20% of the budget.'",
        "'speaker_1': 'In this budget cycle. We want to make that kind of a decision. I and I think and putting it into items like OPEB for which we garner no lasting asset in return, i. I think I think we should probably park this discussion and just move forward with the budget discussion at hand because I think the implications move'",
        "'speaker_1': 'this profoundly.'",
        "'speaker_0': 'Negative member Ashcraft.'",
        "'speaker_3': 'So I think I favor what our city manager suggested, that we can come back at a later date to decide. I'm still I'm intrigued by this idea, but, you know, bear in mind, the public also should have the right to weigh in with the as you said, the time is short for preparing the report.'",
        "'speaker_3': 'And I don't know, but I think it's a it's a good idea to consider. And but I also see the points raised by Councilmember de SAC. I think we need a little more time to for all of us to absorb this and and then hear from staff the different implications.'",
        "'speaker_3': 'But definitely something to keep in mind and kind of a good problem to to have, you know, for a change. But the vice mayor did mention the the library and that the deliverables were it's a tough one to say this late at night.'",
        "'speaker_3': 'The deliverables are the materials. But, you know, the deliverables are also the amount of time that the libraries are open for the patrons. And so I would like when we come back for final consideration for a look to be taken it how we could add back some of those hours that Mr. Serkis is still in the room'",
        "'speaker_3': 'have had shown in the slides have been cut over the years because I you know that that's something we've got a great library in to you know recently renovated branches that you you want them to be open to the people who need them are a residents and already.'",
        "'speaker_5': 'Thank you, Madam Mayor. I think that's a great idea. You know that the vice mayor came up with? You know, we have I talked about this last last meeting, you know, that we were philosophically we were talking about, you know, cutting when the period of austerity is over and we should start talking about restoring where we were'",
        "'speaker_5': 'not spending wildly, you know, not adding, you know, hundreds of people to the to the payroll, to the headcount, but addressing some of the issues, you know, that we have left addressed for for too long, unaddressed for too long, you know, the unfunded liabilities, the deferred maintenance, you know, the hours at the library, you know, things like'",
        "'speaker_5': 'that, that. You know. I too don't want to see have this 30.8 or it's going to be 30.7 or whatever it is in two years sitting there and tempting us to do something that we shouldn't do. And I think the sooner that we that we we restore some of these these these cuts that we've made and deal'",
        "'speaker_5': 'with some of these, you know, I call them all unfunded infrastructure problems. I think the better off will be. And, you know, I I'm fully supportive of the vice mayor's idea.'",
        "'speaker_2': 'As an American. I should also make a quick clarification regarding the library. Just I just want to remind folks that library hours are ongoing. That's going to be it's going to add to our deficit materials as can be a one time thing.'",
        "'speaker_2': 'So I just want to be clear that you understand that, right? So if you're adding hours, that means that your delta that we're trying to get rid of, which was the 1.4, is now going to raise by whatever gain, you know, comes up with.'",
        "'speaker_2': 'But I just want to make that clear, as opposed to the materials where we can make those is one time contributions. You can take that out of your reserves.'",
        "'speaker_3': 'Right. I understand that. I do. But I also think it's time to take a look at maybe not cutting as deeply in some departments to allow that. And I do realize that it's ongoing. But I think this is a year when we should be considering that, given our finances it.'",
        "'speaker_0': 'So I feel like we have just talked about bringing back quite a few positions and realigning funds. I think that's a good first step. I'd like to see the numbers come back after we do what we've already given recommendations to do.'",
        "'speaker_0': 'And then I support the city manager in regards to taking our time. I don't want to send the message to staff. We want you to come back within six weeks or eight weeks. We have plenty of time to do this.'",
        "'speaker_0': 'I don't think we have to hurry to touch the reserves. In fact, I don't feel like we are tempted to spend it because it's there. I think that's why it's been able to accumulate. So I think we are protective of the funds and for me a good first step is but we've our that we've just spent the'",
        "'speaker_0': 'last two meetings saying, okay, add this back, then we can revisit the numbers and take our time to best serve the community across the board. So I think that there were three of us that were fine with taking.'",
        "'speaker_3': 'Well, I think I mean this is it's direction right that they're going to staff will take back and put into the mix so it's not that they have to do either or.'",
        "'speaker_7': 'Um.'",
        "'speaker_2': 'Yeah, we have direction.'",
        "'speaker_0': 'Thank you. Thank you. We have two. All right, so that was City Manager Communications. Did you want to.'",
        "'speaker_2': 'Yes, I think that's all I have.'",
        "'speaker_0': 'Thank you. All right. Next.'",
        "'speaker_2': 'All right. We might have to. Oh, right.'",
        "'speaker_0': 'Yes, Mr..'",
        "'speaker_2': 'Horn. That's right. He gave me a note.'"
    ]
}