{
    "Adoption of Resolution Declaring November 11 through 17 United Against Hate Week in the City of Alameda, in Conjunction with the Alameda Unified School Board and other Bay Area Cities. (City Manager 2110)": [
        "'speaker_1': 'Adoption of resolution declaring November 11 through 17 United Against Hate Week in the City of Alameda in conjunction with the Alameda Unified School Board and other Bay Area cities.'",
        "'speaker_0': 'We have speakers.'",
        "'speaker_4': 'On that yet.'",
        "'speaker_0': 'I have the. For the survivors.'",
        "'speaker_2': 'I'm.'",
        "'speaker_9': 'Well, I sound like him. Good evening. Shalom. My name is Rashid Shabazz. It's good to see you all. I want to express my gratitude to the staff and you all for considering this resolution. And I think you're intent in doing so.'",
        "'speaker_9': 'I think in an era of alternative truth. Fake news, truth and lies. I think it's important to distinguish between the situation and our aspiration, the tales we have, the stories we tell, and our stories and true history. I wanted to address this resolution because I think there is a few there were a few myths that were in'",
        "'speaker_9': 'the material. The resolution in the background. And I know there's some consideration to this, but I wanted to share some of that. First, the resolution initially began saying the United States is a nation of immigrants. And so while that may be true for some people, that's not the story of my ancestors, for my African ancestors did not'",
        "'speaker_9': 'immigrate here on the Mayflower. They were kidnaped and stolen and brought to the shores of Georgia, Louisiana, Florida and a bunch of other places I can't even name, because they weren't even counted in official records for my indigenous ancestors.'",
        "'speaker_9': 'They were already here when the settlers and colonists came. And so I bring this up because the narrative a city saloon, the narrative a city tells about itself is very important, particularly as it relates to public policy. In the agenda item, there's also some background that states that Alameda has a century long tradition of embracing diversity and'",
        "'speaker_9': 'respecting civil and human rights of its residents. Back in July, I gave a presentation at the. Am I going to get all that 3 minutes?'",
        "'speaker_4': 'Sorry.'",
        "'speaker_9': 'Okay. I don't want no showdown tonight. At the Democratic Club, I gave a presentation where I talked about history, memory, and the legacy of white supremacy and how that informs public policy, and particularly here in the city of Alameda.'",
        "'speaker_9': 'Some of the things. I'll get to some of the things I share, but I just want to rename something I just said. I talked about white supremacy and this is a historically based system of exploitation and oppression. And it occurs to people of color, whole nations, entire continents have been oppressed.'",
        "'speaker_9': 'And it's in order to defend a system that privileges some and maintains power and wealth for them as well. And I wanted to define that as a system, because oftentimes it's not called out. We may talk about hate, but we won't call and condemn white supremacy.'",
        "'speaker_9': 'And so when I think of what happened a few years ago to the congregants of Mother Emanuel, when I think of what just recently happened to those folks, those worshipers at the Tree of Life, we can call out hate.'",
        "'speaker_9': 'And I also think it's important to call out white supremacy as an ideology. And so just to quickly share a few suggestions, I sent some correspondence that talks more about the history. And for those that have been so kind to share your time and come to my public presentations on history in Alameda, you're familiar with some of'",
        "'speaker_9': 'the stuff, but that's all in the correspondence as well as a link to the PowerPoint presentation I gave at the Democratic Club that talks about history and memory. One of the ways I think that this history can be addressed is first by learning and understanding it, but then to address the inequalities and move towards inclusivity.'",
        "'speaker_9': 'I think it's important to understand what the current state of Alameda is, and one of the ways we can do that is by proper collection and analysis of data. And sometimes that does not happen. And so I want to give three actually I think I got four.'",
        "'speaker_9': 'Yeah. Not three examples of of how this can occur. First is examining the ranks of the staff for the city of Alameda. Each department looking at race and gender by department. Rank and file as well as those in supervisory and managerial roles.'",
        "'speaker_9': 'Examining the pedestrian and traffic stop data that the Alameda Police Department has been collecting for a long time, and also examining current housing programs and including race as a variable. So that didn't happen in the housing element of 2014 or in that 2015 study that the Bay Economic, whatever that group did.'",
        "'speaker_9': 'And so anyway, I just share that. And lastly, next week, hopefully the students of elementary school will be uniting against hate in choosing a new school name. Thank you.'",
        "'speaker_0': 'Thank you. So I have a question on the proclamation. I didn't see where it refers to 100 year history. Supporting God O OC is not in the proclamation itself. So we are voting on the resolution itself this evening.'",
        "'speaker_0': 'So that language was not included here. There is the language. The first paragraph speaks to is a nation of immigrants whose strength comes from its diversity. And that was an issue that was raised a step. Would counsel like to strike that?'",
        "'speaker_0': 'We could strike that first line. Vice Mayor.'",
        "'speaker_6': 'Yeah, I'd be open to that. I think the intent here is really there has been a lot of attacks in recent weeks on immigrants and refugees that are coming to this country. And I think, you know, the intent was to address that and to address the diversity.'",
        "'speaker_6': 'But I also understand Rashid's point regarding both African-Americans who have been descendants from slaves and also from indigenous populations. So I think in light of that, in light of, you know, the other resolutions that we were proposing to do tonight, I think it's.'",
        "'speaker_0': 'It's fine if there's a concern. And this is not language that we wrote. I want to make sure this is we share this with other cities. It comes to us. We get requests to do this. We try to be cooperative and go along with it.'",
        "'speaker_0': 'If someone has, I'm fine backing it, but it does. The intent is, in fact to focus on being a nation of immigrants. Member matter, S.E..'",
        "'speaker_5': 'I think it's important. I think it's worth striking that first line because it makes the fact that we have a constitution that is directed toward equality for all individuals, regardless.'",
        "'speaker_0': 'Then that's the sense it would lead with.'",
        "'speaker_5': 'I would I would like it. I think it reads better with that.'",
        "'speaker_0': 'So then the first sentence would be, whereas the Constitution enshrines equality on all individuals, regardless of race, gender orientation, religion or political views. And we're already.'",
        "'speaker_7': 'I'm fine with that. I also wonder if we could attach the presentation that Rasheed talked about as a correspondence item on the agenda item. So it's preserved in our archives.'",
        "'speaker_2': 'Mm hmm.'",
        "'speaker_0': 'Were there other was there other correspondents on the side of. Okay. And so then do we have a motion with those without change?'",
        "'speaker_6': 'I'll make the motion. I just want to say, I think what we're what we're really striving to do with this is to say that we are we are working towards these goals and. And trying to achieve better acceptance of diversity.'",
        "'speaker_6': 'And everyone in our community. So with that, I will make a motion to accept.'",
        "'speaker_0': 'All this in favor. I motion carries unanimously. Thank you. Then we go to five l.'",
        "'speaker_1': 'Final passage of ordinance amending the Alameda Municipal Code by amending Section 30 Dash ten cannabis to add cannabis retail businesses as conditionally permitted uses in the C one neighborhood business and CM commercial manufacturing zoning districts, and amend certain portions of the zoning code to enable cannabis retail businesses to dispense non-medical medicinal or adult.'",
        "'speaker_1': 'Use cannabis and amend certain portions of the zoning.'",
        "'speaker_4': 'Code to remove the expression requirement.'",
        "'speaker_0': 'Do you have any speakers? Two speakers. All right. And staff. Could you give us an update in regards to our city attorney? I should actually say, in regards to wasn't there a complaint of some form filed on this item?'"
    ],
    "Final Passage of Ordinance Amending the Alameda Municipal Code by Amending Section 30-10 (Cannabis) to (1) Add Cannabis Retail Businesses as Conditionally Permitted Uses in the C-1, Neighborhood Business, and C-M, Commercial-Manufacturing Zoning Districts, (2) Amend Certain Portions of the Zoning Code to Enable Cannabis Retail Businesses to Dispense Non-medicinal or Adult Use Cannabis, and (3) Amend Certain Portions of the Zoning Code to Remove the Dispersion Requirement. (Economic Development)": [
        "'speaker_10': 'There was a there has been sorry there has been a complaint filed with the Open Government Commission related to this, contending that the Council's deviation from the specifics of the agenda title violates our Sunshine Ordinance. We've already opined at the previous meeting that we think the agenda was clear and specific enough to embrace the action that the'",
        "'speaker_10': 'Council took. And our opinion is and will be that that the Council can consider this item on second reading and adopt the ordinance.'",
        "'speaker_0': 'Thank you. So we have two public speakers, Don, share it. And then Mark Hersman, if you want to speak on this item, please submit your CIP. Mr. Sharrett.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_8': 'Mayor Spencer and members of the City Council. You pulled the consent item, which means tonight is the time to react to that consent item. Is that the process?'",
        "'speaker_0': 'Correct. We pulled it so that we could take.'",
        "'speaker_8': 'Yeah, that opened it up for discussion for tonight. And we will be voting on it tonight.'",
        "'speaker_0': 'More than likely.'",
        "'speaker_8': 'Okay. That changed my whole speech. Yeah.'",
        "'speaker_2': 'All right. I'll go ahead.'",
        "'speaker_8': 'Don Shaw, longtime resident in Alameda, a retired educator. The hat I'm wearing tonight is an antique cannabis. Operations around kids. I'm dead set against that. I don't believe that they should open up dispensaries by any school. And the thousand foot limit that was put on that before has just been there for six months.'",
        "'speaker_8': 'Then three of you turned it around and want to come back and look at something different. Want to lower that distance? I still have a problem with child care centers having cannabis around that. And it's just to me, it just doesn't fit.'",
        "'speaker_8': 'But I'll go ahead here. You pulled it. Thank you. Congratulations for those who were elected in yesterday's elections. And congratulations for those who were not elected because you put your hat in the ring. I think it's commendable that we had choices in Alameda and I'm glad the election process went forward.'",
        "'speaker_8': 'We are basically charged and you are charged with doing what's right for all citizens. That's little kids. And not to listen to someone tell you from an industry or someone tell you from another group someplace else on what to do.'",
        "'speaker_8': 'You are independent thinkers. Hopefully you stay independent that way and can make up your own mind on a lot of these decisions. This is one of them. Why change something that's only been on the books for about. Six months.'",
        "'speaker_8': 'Why not let it play out for a while and see what happens? Look at other cities that have had similar audiences. San Leandro is a good example. And where do these cannabis places end up? Not by kids, not around daycare centers, not around someone's house who has kids there.'",
        "'speaker_8': 'So I'm definitely opposed to that. Don't cave in to the cannabis industry. Since day one. You hired a. Cannabis, what I believe a cannabis boilerplate consultant who came into this city and put together what was going to be the ordinances for the cannabis.'",
        "'speaker_8': 'Take a look at what that was. It was a boilerplate from the industry, as far as I'm concerned. You want to move forward. So why the rush? Why is the fast momentum to change this ordinance? Again, are there some violations, some of the Brown Act?'",
        "'speaker_8': 'Who is pushing the agenda? And again, thank you for pulling it from the consent. Real fast story was out of Peter Pan the other day and at the Halloween parade, and one of our good citizens was smoking his grass out the window of his house right by that where all the kids are.'",
        "'speaker_8': 'Thank you for that. Second is, I hope that you really know what you're doing as you move forward with us. And I trust the fact that you'll listen to people and consider your own mind. Thank you.'",
        "'speaker_0': 'Thank you, Mark Hersman. And then if there's anyone else that wants to speak on this item, please submit your stuff now.'",
        "'speaker_8': 'Thank you, Mayor Spencer and Council. I sent you a letter this afternoon and I would like to read that into the record now, if I may. Dear City Leaders, as we approach final passage of the updated cannabis ordinances, it's come to our attention that a handful of local anti cannabis citizens have made a last minute appeal to'",
        "'speaker_8': 'broaden the definition of sensitive use sites, which require a 600 foot buffer zone around a retail cannabis dispensary in order to protect children from exposure to cannabis. As you consider this last minute appeal, we ask that you also consider the following facts.'",
        "'speaker_8': 'It has been two years since Councilmember Odie first submitted the referral to consider cannabis cannabis business presence on the island. We cannabis business operators have been waiting patiently and there clearly has been enough time for public comment on this issue.'",
        "'speaker_8': 'Retail cannabis dispensaries must comply with the following safeguards in an effort to keep cannabis out of the hands of children. Exterior windows must be opaque, with no cannabis products visible from the street. Signage must be minimal and approved by the planning department and must conform with community standards.'",
        "'speaker_8': 'IDs are checked at the door by a licensed security guard. Then, upon entry to the dispensary, that idea is then scanned into the customer or patient profile in the computer and recorded as having visited the dispensary. This is a state tax track and trace requirement.'",
        "'speaker_8': 'All cannabis products are to be tested for purity and potency and label as such, and all cannabis products must be sold in child resistant packaging. Also, the application for a conditional use permit allows neighbors and businesses within 300 feet of operation to weigh in on the establishment of a retail dispensary.'",
        "'speaker_8': 'As long term Alameda residents and parents of children ourselves, we at Portland Enterprises share these concerns regarding keeping cannabis out of the hands of children. Anecdotal evidence. Com coupled with scientific studies, show that cannabis has real therapeutic benefits for adult patients and a wide array with a wide array of ailments and new uses and discoveries with therapeutic'",
        "'speaker_8': 'use of cannabis are happening in real time. We are committed to providing cannabis and cannabis information that promotes medicinal wellness and responsible use by our patients and customers. In conclusion, we believe the safeguards noted above provide the best possible balance between safe access for adults who should be free to make choices about how they treat their own'",
        "'speaker_8': 'ailments and the protection of children. Prohibition has clearly failed, and we are striving to advance a solution that will replace illegal street dealers, many of whom have no reservations about supplying cannabis to our children with regulated and responsible businesses.'",
        "'speaker_8': 'We thank you for your thoughtful and constructive approach to this issue, and we sincerely ask that you not backtrack on progress at this final hour. Thank you. Thank you.'",
        "'speaker_0': 'Member, Odie.'",
        "'speaker_7': 'Thank you, madam. I just had a quick question from staff. Who's doing this, John or Debbie? John, you're doing this. So I think there was a comment from a resident about a thousand foot radius. I'm looking at staff report, page 22.'",
        "'speaker_7': 'It does say no cannabis business. Engaging in dispensary, retail or dispensary delivery shall locate within a 1000 foot radius of a public or private school. So we didn't change that, even though the state law says 600. And the school district requested a thousand and we kept that.'",
        "'speaker_7': 'Isn't that correct?'",
        "'speaker_9': 'And John Lane, assistant city attorney, that's my recollection. I think we did change.'",
        "'speaker_2': 'I think we went to a two tier system. Right.'",
        "'speaker_7': 'But the comment was made that we somehow we got rid of the thousand foot buffer between, you know, the thousands to make sure that the never changed risk was not what we did.'",
        "'speaker_9': 'That's correct. We've always had that thousand foot buffer for schools and see the as a U.S. resolution. That's correct.'",
        "'speaker_3': 'And that would be for public as well as private schools. So all schools have a 1000 foot buffer or around schools for the location of the retail dispensaries.'",
        "'speaker_0': 'And can you go over what's this, the footage for the daycare centers, licensed daycare centers.'",
        "'speaker_3': 'Licensed daycare centers, 600 feet, as well as all other sensitive uses, have a 600 foot buffer zone.'",
        "'speaker_0': 'And the 600 feet is actually the same as with the state law.'",
        "'speaker_3': 'Is that correct? Well, the state law is 600 feet in the absence of a jurisdiction.'",
        "'speaker_4': 'Having any buffer zone.'",
        "'speaker_3': 'Of its own. So if if the city did not have a buffer zone around sensitive uses, it would be 600 feet by default. But the city has proactively established a two tier buffer system. That's what's reflected in the ordinance, actually.'",
        "'speaker_3': 'Five M, not five L The ordinance that's being contemplated as item five M would establish that two tier buffer system. And that's the second reading this evening.'",
        "'speaker_0': 'And the two tiers is that for K through 12 schools, public and private, it's 1000.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_0': 'Which is more than the 600 feet of what the state requires.'",
        "'speaker_3': 'That's correct.'",
        "'speaker_0': 'And then the 600 feet is for the licensed daycare centers and youth centers as defined in our ordinance.'",
        "'speaker_3': 'That's correct. And I would like to point out that there has been some correspondence that the council has received regarding whether or not martial arts studios should be considered. Youth centers and staff does believe that there is some ambiguity around that issue.'",
        "'speaker_3': 'And what we would propose is to come back to council at its November 27th meeting with a discussion about that definition and with some suggested language and a draft ordinance at that time. But staff believes, as the attorney office reported out, that council can move forward this evening with the second read for the land use ordinance, as'",
        "'speaker_3': 'well as the regulatory ordinance. And then we would come back with an opportunity on the 27th for a robust discussion around clearing up any kind of ambiguities around the definition of youth centers. That's in our existing ordinance.'",
        "'speaker_0': 'All right. Thank you. Remember?'",
        "'speaker_7': 'Is that an appropriate motion to give through? Four, five, 5 a.m.. I mean just.'",
        "'speaker_3': 'It's really it's really covered in five the M the regulatory ordinance as opposed to five L the land use ordinance.'",
        "'speaker_0': 'So in regards to five L, it stuff's a city attorney's legal opinion that we can proceed with the final passage of the ordinance.'",
        "'speaker_8': 'Yes.'",
        "'speaker_0': 'Any other questions from council members?'",
        "'speaker_6': 'Just want to make sure that since there was a sorry there was a letter sent in and an open government complaint filed that there aren't any other speakers. Before we make a decision on this, just.'",
        "'speaker_0': 'Do we have any other speakers on this item? Not on the Senate, but on the next item. All right. All right.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Do we have a motion to proceed with this?'",
        "'speaker_7': 'So moved.'",
        "'speaker_6': 'Second.'",
        "'speaker_0': 'All those in favor. I. I. All those opposed. No. Motion carries 3 to 2. I am.'",
        "'speaker_1': 'Final passage of ordinance amending the Alameda Municipal Code by amending Article 16 cannabis businesses of Chapter six businesses, occupations and industry to eliminate the cap on testing laboratories allow for two additional cannabis businesses to operate as dispensary delivery delivery required within the zoning district for cannabis retail.'",
        "'speaker_1': 'Amend the disposition requirement to require no more than two cannabis retail businesses to operate on either side of Grand Street. Create a two tier buffer zone from sensitive uses for cannabis businesses. Amend certain portions of the regulatory ordinance to enable cannabis retail businesses to dispense non medicinal and adult, use cannabis and modify requirements for off island delivery'",
        "'speaker_1': 'and make other clarifying.'",
        "'speaker_4': 'Or conforming amendments thereto. Speakers like.'"
    ],
    "Final Passage of Ordinance Amending the Alameda Municipal Code by Amending Article XVI (Cannabis Businesses) of Chapter VI (Businesses, Occupations and Industry) to (1) Eliminate the Cap on Testing Laboratories, (2) Allow for Two Additional Cannabis Businesses to Operate as Dispensary/Delivery (Delivery Required) Within the Zoning Districts for Cannabis Retail, (3) Amend the Dispersion Requirement to Require No More Than Two Cannabis Retail Businesses to Operate on Either Side of Grand Street, (4) Create a Two-Tier Buffer Zone from Sensitive Uses for Cannabis Businesses, (4) Amend Certain Portions of the Regulatory Ordinance to Enable Cannabis Retail Businesses to Dispense Non-medicinal or Adult Use Cannabis, (5) Modify Requirements for Off-Island Delivery, and (6) Make Other Clarifying or Conforming Amendments thereto. (Economic Development)": [
        "'speaker_0': 'And I just want to clarify. From a city attorney or staff in regards to this proceeding, with this item.'",
        "'speaker_10': 'This is appropriate as well. We did receive an open government complaint, but once again, as I stated previously, it's appropriate for counsel to consider this now on second reading.'",
        "'speaker_0': 'Thank you. And we have six speakers as my understanding. So then each speaker gets up to 3 minutes. Just so you all know, if we had seventh and it's 2 minutes each, but we're at six, so it's still 3 minutes each.'",
        "'speaker_0': 'So our speakers are Sarina chan and Don share it. Enrich Moscow with the Ryan cabal. Philip Read and then Andrew Huntoon. If you want to speak on asylum, please submit your slip.'",
        "'speaker_3': 'Good evening, Mayor Spencer, members of the council. My name is Sabrina Chan. I've lived here for over 20 years and moved here so that my son could attend Alameda Public Schools, which he did and did quite well. I'm here because I spent the past 30 years in public health trying to protect youth and trying to protect the'",
        "'speaker_3': 'public health of everyone through tobacco control laws. So when this cannabis law came forward, I said, Why don't we apply everything we've learned about public health to cannabis so that we get it right from the start and not just rush into it.'",
        "'speaker_3': 'So when I saw that the vote was coming up on October 16th, I read with great interest what was on the agenda and what was on the agenda. Said that you would be adding a delivery only to delivery only dispensaries conditionally permit delivery only dispensaries closed to the public in the sea zone.'",
        "'speaker_3': 'So when I looked at that, I said, Well, if they're delivery only and they're in a m zone, I didn't have any particular question about it, although now I do have to. But to me, that's a delivery only location where it's kind of a company where they just get cannabis and deliver it and they do not have'",
        "'speaker_3': 'public access. So I was in Iowa that day and when I came back I was too tired to come to the council meeting. But had I known this was going to magically change on the agenda, I would have come the during the after public comment was closed off, this council decided to change the permit delivery only dispensaries'",
        "'speaker_3': 'which were closed to the public into two full service cannabis dispensaries in which the public would be welcome to come. So that would be doubling the number of permitted recreational cannabis dispensaries in this city. And in my humble experience, as someone who fights for public health policy, I've often been told whenever you have a substantive change in'",
        "'speaker_3': 'an ordinance, you need to start over again, come back with the proper language, and then reintroduce it so the public has a chance to comment on it. So that's why I really felt that it was a violation of our Sunshine Ordinance, which warns people in advance as to what's going to happen.'",
        "'speaker_3': 'And my, in my opinion, a delivery only dispensary that's stipulated close to the public is not the same as a full service recreational marijuana dispensary. So adding those to that night without public comment, I felt was a violation of the Sunshine Ordinance.'",
        "'speaker_3': 'And then just as a matter of information. All of you felt that the Ruby tablet tumbling was a youth center in which very young children tumble. So in my estimation, a martial arts center, a martial arts clinic, is a place where a lot of youth attend.'",
        "'speaker_3': 'So that's a definition I think we really need to look at.'",
        "'speaker_0': 'Thank you. Thank you. Don't share it. And then Rich Moskowitz.'",
        "'speaker_8': 'Welcome again. I get my 3 minutes. Yes, you heard a lot of reasons why on that first part. But the second part that I have in this ordinance. You're looking at changing some things that were in the original.'",
        "'speaker_8': 'Again, the original order that was passed and there's a lot of gaps in here that I totally don't understand. I wish we had more time to debate them. I hope that no one on your staff has cannabis interests and no one from the city manager on down, as ever been involved with cannabis industry because it looks like'",
        "'speaker_8': 'again, here we go, let's work work it out so those people can get what they want and do what they want in the city of Alameda. You know, you look at this thing, eliminate the cap on testing laboratories.'",
        "'speaker_8': 'What's that mean to go on to 20 ad to delivery only dispensaries? I can understand that one. Dispensaries again and delivery allow adult use. Fine. Adult use is legal. That's okay. Create a two tier buffer zone from sensitive uses for dispensaries and cultivation businesses.'",
        "'speaker_8': 'What's a two tier? Buffer zone. Two blocks. Thousand feet. 200 feet. What does that mean? I don't know who wrote this, but I think they'd better start. Explain it a little bit better to the public, or at least give the public a chance to look at it and maybe get a chance to react to it if that's'",
        "'speaker_8': 'your business. Better start doing a clearer. Okay. That's it for me. I don't like it. I'm speaking against it. And I hope it's more than a32 vote again. Thank you.'",
        "'speaker_0': 'Thank you, Rich Moskowitz.'",
        "'speaker_10': 'Mayor. Vice mayor. City Council members, thank you for this opportunity. My name is Rich Moskowitz. I've been in Alameda for 14 years and for the last year and a half, two years or so, it's been my privilege to be involved in this issue.'",
        "'speaker_10': 'My first exposure to Alameda politics and quite honestly, separate from the cannabis issue, I started to learn a lot about our government. I've attended a lot of these meetings and it's been an interesting but wonderful experience. Also as primary founder, one of the founding members of ASCO, the group that worked on medical law last year and the'",
        "'speaker_10': 'founding member of Alameda Cannabis Times to work on the recreational issue this year. And also the author of the ballot measure that we're trying to put to bed tonight. So I want to address one of the things I've heard tonight.'",
        "'speaker_10': 'Just to be very clear, I believe all of you are very clear on this. We've worked hard together to establish a very sensitive ordinance that has exceeded the state requirements when it comes to schools by 40%. And additionally, we've added a list of sensitive sites that's not good for the schools.'",
        "'speaker_10': 'Before you, tonight is the culmination of a lot of hard work on both sides. And I also want to address what I've just heard is I was personally involved last year at the Mastic Center in putting on an education program for the city.'",
        "'speaker_10': 'And back in July. Just one other thing to address. I heard tonight I'm not sure who is from that. One of the speakers felt that you up the dispensary's and you did it without them realizing it. But to bring everyone's attention back to the July meeting, your group passed four dispensaries and two additional deliveries.'",
        "'speaker_10': 'When we came back, the city staff had changed that to consider deliveries dispensaries. I was at that planning board meeting and the logic behind that was discussed there and summarily somewhat rejected without time assured. I won't keep doing.'",
        "'speaker_10': 'I won't go down that road. We can all look at those tapes. I'm here tonight to urge you to pass the ordinance. As it stands, the issue I'm very aware of that has come up is a clarifying issue.'",
        "'speaker_10': 'I appreciate the staff's position that this would be a second reading and the clarifying issue would be part of a rigorous debate, as it should be on 1127. And quite honestly, if there's something I've learned in the last two years is we as comedians are really great at a vigorous debate.'",
        "'speaker_10': 'So I urge you tonight to pass this ordinance and finish the work that we've all been doing here in 2018. And we've really all started this two years ago. This is not to do anything but to provide a benefit for Alameda.'",
        "'speaker_10': 'And as Mark Herdsman said earlier, we are very concerned that we want this to be safe. We want this to be off our streets, and we want this to be accessible to everyone. Thank you.'",
        "'speaker_0': 'Thank you. Ryan Agbal and then Philip read.'",
        "'speaker_9': 'Hello, Mr. Mayor, Vice Mayor, Council members, thank you for joining us tonight. My name is Ryan Agbo. I was born and raised here in Alameda, so that's 34 years. And you know, just what I'm bringing it to everybody's attention that, you know, Kansas has been cannabis has been here on the island this whole time and there's been'",
        "'speaker_9': 'no dispensaries. And like my cousin said, you know, the dealers that are on the street, they don't check for it. So the safest way to keep cannabis out of the hands of youngsters is to have dispensaries, because dispensaries tend to dispel dealers because, you know, people don't want to go deal with some some some guy out of'",
        "'speaker_9': 'their apartment. They want to go to an establishment and they want to they want to be, you know, treated with respect. So, you know, just dispelling that that whole argument that it's opening a dispensaries is going to put it in the hands of kids that just don't seem to make sense.'",
        "'speaker_9': 'No one goes to a dispensary and and accept. No, no one go. No kids aren't allowed in surgery. So that's yeah. That's just a a pointless argument going to the the other the other point of trying to equate cannabis to Cigarets.'",
        "'speaker_9': 'That's another argument that doesn't make any sense at all because, you know, there's no no kind of evidence, no kind of amendment, no kind of proof that tobacco has any kind of benefit, medicinal benefit to to anyone. All it does is harm people.'",
        "'speaker_9': 'So to equate cannabis and cigarets just because you're smoking something, I think that speaker should rethink that because cannabis is proven to to help a number of of individuals, whether it's cancer or, you know, even something as small as sleep issues.'",
        "'speaker_9': 'And so, you know, we we're so we're so quick to judge people who who use a certain medicine, but yet, you know, we're okay with going to CVS and going see a pharmacist or going to a liquor store and grabbing a bottle.'",
        "'speaker_9': 'And, you know, for some reason, cannabis has a stigma around it. So tonight, I mean, I'm up here to urge the city council to proceed with the second with the second reading. And also, I mean, if it's possible to maybe get the clarifying language tonight, you know, it's as simple as limiting these youth centers to businesses that'",
        "'speaker_9': 'cater 100% to youth. If it's something like a karate studio where, you know, for example, there's one on Webster Street, it's a taichi qigong institute. I would not consider that a youth center. I don't see kids trying to take qigong or tai chi.'",
        "'speaker_9': 'I mean, it's usually for adults. So, you know, there's that. Does it make any sense to try to make that a youth center when it's not primarily used for or catered to to the youth? So that's all I I've got to say.'",
        "'speaker_9': 'Again, I encourage you to move forward with with this reading. Thank you.'",
        "'speaker_0': 'Thank you, Philip Read and then Andrew Hunter. If you want to speak on the side and please submit your.'",
        "'speaker_8': 'Hi. My name is Phillip Red and I'm a local cannabis activist. I agree.'",
        "'speaker_0': 'With apologies. I have to interrupt, but we just received another slip, which means from this point forward we have had seventh and now the time amount changes reduce us to 2 minutes and we will start your clock at the two.'",
        "'speaker_0': 'And I apologize that that that's the policy.'",
        "'speaker_2': 'Okay.'",
        "'speaker_8': 'I agree with everything the second speaker said. We've been dealing with this for far too long, and we've covered this exact issue in the past. We've already agreed on this, and there's no reason to change course at this point.'",
        "'speaker_8': 'Just to let you know a story about a city I was in for a while, Spokane, where some rich guy decided to use arcades as a way to block the Green Zone in his town. He could afford property and he just started sprinkling garbage arcades all over town.'",
        "'speaker_8': 'Now, city ordinance eventually kicked in and decided to make that no longer a protected use. But what it was, was one person's opening their wallet and closing the whole green zone for the city. So be careful of that happening.'",
        "'speaker_8': 'I don't think any Ruby tumblers are going to be going into the cannabis stores and they'll be passing a lot of bars on the way there so they get their IDs checked on the bar. Don't know really what you're worried about.'",
        "'speaker_8': 'I think the first speaker is kind of misinformed. There's no winners or losers declared in these races yet, and we're still 10,000 votes away from declaring a winner. He was also misinformed about the dangers dispensaries pose to kids.'",
        "'speaker_8': 'There are dispensaries are here to protect kids and the stores are provide many safeguards for that. And that proves that marijuana is safer than alcohol. Once again, they can go into any store in shoplift or a marijuana store or they can't even go inside the building.'",
        "'speaker_8': 'I personally have my own agenda in cannabis. I think that I want to see access for everybody and I have unlimited access to cannabis personally, and I've been giving away free cannabis all over town at certain fairs and events.'",
        "'speaker_8': 'The Beer and Wine Festival I've been in concert at The Cove. Kids are present handing out free weed. Nobody can stop me. So why don't you guys give safe access and I'll knock off the free access. All right?'",
        "'speaker_8': 'Otherwise, somebody else might do exactly what I do, but they'll use it as a gateway to sell harder drugs. And believe me, it's not that hard.'",
        "'speaker_0': 'Thank you, Andrew. And Andrew Hunter and then Roslyn Moya. Andrew, and go ahead. Sorry. If you are sorry, you got can be quiet so we can appreciate those speakers. Thanks so much.'",
        "'speaker_5': 'My name is Andy Huntoon. I'm essentially a 70 year Alameda resident. And I think that we need to recognize that there's a big difference between regulating a legal industry or nit picking a legal industry out of existence. They were confined to an island.'",
        "'speaker_5': 'And if the intent is that we were to have two dispensaries, one on either end of town, putting a yardstick on it and finding that they intersect by by even eighth of a mile in the middle of town is a ridiculous restriction.'",
        "'speaker_5': 'We're handcuffing ourselves and punishing our citizens by dragging our feet on this issue. I urge you to pit past this, and if any other regulation needs to be made, talk it over and come up with a respectful answer that accommodates the citizens of Alameda.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_11': 'Thank you. Roslyn lawyer.'",
        "'speaker_1': 'Hi. Sorry for my Late Edition there. I didn't know that this was on the agenda that we were changing or increasing from, um, deliveries to dispensaries. So I just wanted to mention my being against that, mainly because I've passed by dispensaries and they look very scary.'",
        "'speaker_1': 'They have an armed guard person in the front with a gun and they have barred windows. It's just not something I want to see in my neighborhood. I also I grew up with people who used marijuana regularly and it just is not good for public health.'",
        "'speaker_1': 'We don't need that in Alameda. I think that the delivery systems can get to the people that need it, but we don't need dispensaries.'",
        "'speaker_0': 'Thank you. Thank you very much. All right. That completes our public comment on this item Council. Do you have any mayor, Mr. Vice Mayor, in the circle back? Remember Ashcroft. Okay. Thank you. Just from the top, I'm going to vote to oppose this only because I have said all along that I wanted us to go slow and'",
        "'speaker_0': 'start small on our marijuana businesses, because it's what I learned from attending a number of seminars and educating myself. And I was concerned about the impact that the opening up to all the different businesses would have on staff, time, regulation, enforcement.'",
        "'speaker_0': 'But I do want to go back to something that the first speaker said that I took exception to, and that was an inference that on our staff we might have people who are involved in cannabis businesses that might have some underhanded reason for the regulation.'",
        "'speaker_0': 'I think there was also an inference that we had I can't quite remember the reference to the the consultant we used, a cookie cutter consultant or something like that. I attended an all day seminar in Santa Clara and it's probably a couple of years ago now put on by that consultant.'",
        "'speaker_0': 'It was extremely impressive. They're very knowledgeable. They have experience all over the state. I did not feel that they were advocates, but I know city staff even better and I can impeach for I can vouch for their integrity.'",
        "'speaker_0': 'And so while I don't agree with everything that has been proposed and I will say to Mr. Cohen, I am concerned that I do think we made a significant change in the ordinance by adding the adult use dispensaries that weren't noticed.'",
        "'speaker_0': 'But I you know, I'm not the city attorney, so I'll I'll defer to you on that one. But I would never suggest that someone had a less than honorable reason. Our staff are professionals and I just wanted to make that public.'",
        "'speaker_0': 'Thank you. Thank you, Vice Mayor.'",
        "'speaker_6': 'So I think part of the fix is that we've pulled the item tonight. We've heard from everybody on this topic. I've read the correspondence. I think it's our intent to address the questions that have been raised relative to defining what is a youth center.'",
        "'speaker_6': 'And I will say that that to me saying, well, Ruby's tumbling is similar to a martial arts studio. Pretty sure that at Ruby's tumbling, it's marketed to people like my niece who are toddlers and doing tumbling classes. And yet, yes, there are parents that go there.'",
        "'speaker_6': 'They go there to watch their kids participate in classes. It's certainly not marketed to adults. And part of our intent is really to make sure that there are businesses, there are spaces that businesses can locate. I've gone to a number of meetings on this.'",
        "'speaker_6': 'I've been working on this issue since 2011 when I was working for the state of California. I visited a number of different facilities. I think that there are correct ways and safe ways to do this and there are best practices, and I certainly think we're working towards those.'",
        "'speaker_6': 'But we've also not we've also limited where dispensaries and different cannabis businesses can locate. And when we do that, we can't then say and now we're going to put in all these other things that limit the distances, such that there's no place that you can locate.'",
        "'speaker_6': 'Because effectively that's what we tried the first time we did the RFP. And what we found was there weren't a lot of applicants and in certain cases we had zero applicants. And what we were getting feedback from, from folks that were originally interested in locating here was that they could not find space.'",
        "'speaker_6': 'And when they started doing the measurements, they would be a couple of feet within the 600 feet or a couple of feet within the thousand feet, or they would be within so many feet of another potential location. And so that was the intent, at least my intent, behind the changes that we gave that I gave directing staff'",
        "'speaker_6': 'last time. I also think that at least again, my reasoning, the number of delivery only we had proposed to that was something that we had talked about before. My mother had breast cancer this year. She did not want to take opiates because of addiction issues and everything else.'",
        "'speaker_6': 'She went through several rounds of chemotherapy. I went to every session with her and sat there and watched her get chemo. I took care of her after chemo for several nights. The only thing that got her through it.'",
        "'speaker_6': 'Was cannabis. It helped her keep food down. It helped her. And. And part of it. She was so weak by the end, she couldn't go and pick up the cannabis that she was taking. And my mother's. Absolutely. Anyone who's met my mother, she's an SNL alum, never done drugs in her life.'",
        "'speaker_6': 'One of the cleanest cut people you've ever met. Absolutely hate smoking. Totally opposes it. Did not smoke any cannabis. She consumed it, but she went to a dispensary. Prior to starting chemo, she did a consultation with a couple of people at a couple different dispensaries.'",
        "'speaker_6': 'She tried to be as educated as she could. She talked to her pharmacist. She talked to her doctor, tried to figure out dosage. And she she went with edibles and topicals. And unfortunately, not all dispensaries provide the same products.'",
        "'speaker_6': 'They all it's kind of like a, you know, a boutique shop. They carry certain products. So we had to go to a couple of different places to get her medicine. And she got so weak that she couldn't go, I would have to go.'",
        "'speaker_6': 'And not all of those dispensaries even offered delivery. And through the delivery only services there were really limited. And she couldn't go and get that consultation and that retail experience that she could at a dispensary. And what happened between when we first started discussing this issue and when we made the decision at the last meeting, was that'",
        "'speaker_6': 'the state started treating delivery only operations similarly to retail dispensaries. So the state started saying retail delivery only. You have to have all you have to meet all the benchmarks of a retail shop. So you have to have all the security provisions.'",
        "'speaker_6': 'You have to go through all of these different steps, but you're only limited to delivery only. And so for that reason, what I what I said was, rather than having four dispensaries or, you know, two dispensaries here and not having that equity, let's go ahead and have four dispensaries total.'",
        "'speaker_6': 'Two of them have to offer delivery. And so in my mind, it was kind of merging what we were originally talking about rather than adding to it. And I take the security provisions very seriously. It's I don't want some place that a kid could walk into.'",
        "'speaker_6': 'There should be a security check. I don't know about an armed guard outside, but there should be a security check. I don't want advertising outside. I want to make sure that track and trace is followed to a tee so that we know what's being sold and to who and when.'",
        "'speaker_6': 'That's very important. The state has has made this one of the most regulated substances out there. That's a good thing. And I think we do have cannabis and we have a cannabis black market right now. Certainly when I was going to school, the easiest place to get it was at school.'",
        "'speaker_6': 'And I don't think that that's how it should be. I think we need to get rid of that and I hope that this will address it and this will do it in a regulated way. But I do want to make sure that we we have that robust conversation relative to what is a youth center and that we'",
        "'speaker_6': 'follow staff's recommendation to separate that out and have that meeting on the 27th. And we can have that continued conversation then. But I plan to move forward tonight with with the other changes.'",
        "'speaker_0': 'And.'",
        "'speaker_7': 'BRODY Thank you, Madam Chair. I would agree with pretty much everything my colleague said. I do want to have that discussion on youth centers because in the email that we received was, you know, how is staff going to interpret that?'",
        "'speaker_7': 'So I think the more guidance we can give our staff, the better. But I didn't want to just touch on a point that my colleague Councilmember Ashcraft mentioned. And maybe, Alan, you can help with that. I mean, staff members certain staff members have to provide like form 700 ethics disclosures, right.'",
        "'speaker_7': 'So if they did, can you kind of just for the public's purpose, if there was anyone who had any material financial interest in a cannabis industry or business, you know, talk about how that is disclosed. And just kind of briefly.'",
        "'speaker_10': 'I mean, if if a person did have an ownership interest or had a significant investment in a local cannabis business, they would have to publicly disclose it on their form 700. And they if it were a member of the body, the member of the body would have to recuse themselves.'",
        "'speaker_10': 'If it were a member of the body, the member of the body would have to recuse themselves. And once again, this this would all be available in the in the publicly available form seven hundreds.'",
        "'speaker_7': 'We have those on our websites for high level staff that would be making these types of decisions.'",
        "'speaker_10': 'I don't know if we have them available on our website.'",
        "'speaker_7': 'But we're at the clerk's office. There's a clerk so that if anyone had any questions or any concerns, they could look. And all the reportable staff have these things filed.'",
        "'speaker_10': 'Yes, that's absolutely correct. Thank you.'",
        "'speaker_0': 'Did any other council members want to speak on this item? I want to speak on this item. I'm actually glad that we have so many youth here in our audience today. I believe our council has been extremely responsible and trying to come up with a policy that it is as safe as possible.'",
        "'speaker_0': 'I've raised four children in this town. Cannabis is available in Alameda. I am. I am very concerned that we have people come and speak and suggest that it's not and that somehow we're doing something that is not safe for our students.'",
        "'speaker_0': 'Why? Because we actually are trying to make it safe, as safe as possible for those that use those that consume in any manner whatsoever, those that are concerned because of stigma, other reasons. And what I have in fact.'",
        "'speaker_0': 'So one of my girls came home from either Lincoln around me to high risk not too many years ago because my youngest graduated 2012. But a student showed up late to school who had been pistol whipped after a a deal with cannabis going wrong something about.'",
        "'speaker_0': 'So so I have heard stories. I have also during the time that two years I don't I don't think two years is moving fast. I think, honestly, many people, many districts, many cities have addressed this issue in significantly less than two years.'",
        "'speaker_0': 'We've been looking at this issue for two years in regards to so in regards to safety, we are trying to make it safe. We're trying to have it lab tested. I was going to add that during the time during the two years, I've had several people come to me and tell me that when they thought that they'",
        "'speaker_0': 'were buying marijuana, in fact, they bought something that was mixed and they ended up in county with in a coma. Each of them had similar stories of approximately like three days and not knowing part of their life. So there are serious consequences sometimes for which is, you know, for buying anything, anything on in the black market.'",
        "'speaker_0': 'So that's exactly why we're trying to make sure that anything that's consumed is lab tested so that people know it has, in fact, been lab tested. And we're trying to also have access to dispensaries, as other council members have said, so that people are able to go and and you have to be 21 or over or you'",
        "'speaker_0': 'have to have a doctor, a permit from a doctor, a note from a doctor or something like that. So that this is very high. There's lots of safeguards here. I am also a 11 year breast cancer now. I myself did eight treatments of chemo.'",
        "'speaker_0': 'I currently do treatments that are a result of that chemo. I am one of those people that am very concerned about any of opiate drugs that are prescribed. So I don't do them. And honestly, I think if we really want to tackle issues.'",
        "'speaker_0': 'Cannabis is not the problem. It's opiate addiction.'",
        "'speaker_11': 'And. And. And and I'm going.'",
        "'speaker_0': 'To say it's all of you. That's why I'm happy to have so many youth here. We're going to have to figure out a better way than prescribing opiates because we know what's happening with that. And this is your counsel stepping up and trying to be responsible.'",
        "'speaker_0': 'And honestly, it's not the six. And also, we did have a veteran Marine here that served in Vietnam and he has come to multiple meetings and shared his. Horrible stories of going through that whole journey, the pain and and on why he's now an advocate for cannabis.'",
        "'speaker_0': 'We know we have many veterans, the fastest growing demographic for this. It is actually senior citizens as they age. They have many, many health issues and they're trying to figure out a way to age gracefully and not become addicted to opiates and have to die young and have someone else take care of them.'",
        "'speaker_0': 'Honestly, it's trying to figure out a lifestyle to move forward and to think that people can drive into Oakland or drive to San Francisco, and that's okay that our city shouldn't be having any dispensaries here. Let me tell you, if you're doing chemo and I was doing chemo and many of you know, people that have done chemo'",
        "'speaker_0': ', you know, a lot of times now we can't we can't drive to Oakland. We can't drive. We are totally dependent upon our community and for helping us that that's the reality. So distance does matter. And sometimes, you know, there's a lot of things that are available that you're not smoking.'",
        "'speaker_0': 'There's a lot of different things. And it is something that I that I am I am an advocate for this. And another serious problem is reducing the stigma, because, unfortunately, you have people and I've seen this and you can go to the cancer center, you can see people unfortunately, they're in very, very compromised health situations and they'",
        "'speaker_0': 'aren't eating. They have nausea and they won't try cannabis because of the stigma attached to it. It's really, really sad. We have to figure out a better way to move forward. I will be supporting this. I want to commend my council members.'",
        "'speaker_0': 'Member Odie and Vice Mayor Molly Avella are really moving forward with this journey. I also want to commend our community activists that have gone to these meetings for the last two years and we are moving forward as a community.'",
        "'speaker_0': 'I also want to say we did have many business people try to open businesses on the east end of town and on the farm. And I had I have heard stories of of not of the business of the seller refusing to move forward once they hear it's about a cannabis business.'",
        "'speaker_0': 'So we did respond at the council level and we said, okay, on the west end of town, they do seem more open to trying to help us meet this need and move forward responsibly. So we did agree that we could have two on the West End and not wait one and then one because we have to respond'",
        "'speaker_0': '. And to those businesses that think that, you know, we're just going to say no and we're going to somehow keep cannabis off the island. It is here. It's been here. And we want to move forward responsibly. And I ask all of you to join us and move forward responsibly.'",
        "'speaker_0': 'So we have a motion. You don't want to mention it.'",
        "'speaker_4': 'Really? Yes.'",
        "'speaker_6': 'The other thing is, relative to neighboring businesses, one thing that is out there that I believe staff is considering and looking at is the San Francisco good neighbor policy and that that policy went into effect. And it deals with things like smoking outside of the business, posting signs that says no smoking, no loitering, things like that, making'",
        "'speaker_6': 'sure cars aren't double parked. Things that could relate to how safe and operational the businesses. So if if we if we were to give staff direction tonight in terms of looking on the 27th at the definition of youth centers and other things that could be considered as part of the later process and conditional use permitting, those are'",
        "'speaker_6': 'the types of things that we could be looking at to make sure that when something is permitted, there are operational things that we can look at to make sure that they are they continue best practices once a permit is there.'",
        "'speaker_6': 'And if they don't comply with what those best practices are, that we can actually take action.'",
        "'speaker_0': 'I also want to share real quick in regards to what the appearance looks like outside of these dispensaries. Some of you have seen them. You go down to Carmel. You're going to see cannabis animals. It looks honestly like an art gallery.'",
        "'speaker_0': 'There are no armed guards. It's actually very, very nice. And there is a way to have these businesses in our community where they don't stand out there just like any other business. And they are responsible owners. Member.'",
        "'speaker_7': 'Thank you, Mr. Mayor. Like to move approval of the item with additional direction to staff to come back with a discussion on youth centers and how that's going to be interpreted.'",
        "'speaker_0': 'Second, all those in favor i.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'I suppose those. Motion carries 3 to 2.'",
        "'speaker_11': 'And we're going to take.'",
        "'speaker_0': 'A short recess at this time.'",
        "'speaker_10': '830.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_11': 'Everybody. If everybody could, please take your seat. We're going to resume our meeting.'",
        "'speaker_0': 'Oh, I should really dim the lights.'",
        "'speaker_2': 'Here we go.'",
        "'speaker_0': 'All right. Thank you so much. That was actually great. We're going to resume our meeting. We are now on item six A.'",
        "'speaker_1': 'The introduction of ordinance amending a lease amendment with the maximum three year extension of the lease with CSI mini storage. The California Limited Liability Company for Building 338 608 and 60883c located at 50 and 51 West Hornet Avenue at Alameda Point.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Good evening, mayor and council members. I'm Ninette mercado. In the.'",
        "'speaker_0': 'Base.'",
        "'speaker_2': 'We use.'",
        "'speaker_4': 'Community development department. What you have before you is a renewal of a lease.'",
        "'speaker_0': 'With an.'"
    ]
}