{
    "Recommendation to Develop a Work Plan, including Community Dialogue, to Address the Following: 1. Unbundling Services Currently Delivered by the Police Department; 2. Systemic Racism; 3. a Review of Police Department Policies and Practices; 4. Police Department Accountability and Oversight; 5. a Review of Laws that Criminalize Survival; and 6. Other Matters which may be Pertinent, including Vacancies. (City Manager 2110)": [
        "'speaker_2': 'Our recommendation tonight is to continue to develop a work plan, including the community participation components for the topic areas around the police department policies that we've been discussing. Also review other systemic issues that the Council has identified to date as a starting point for tonight's discussion.'",
        "'speaker_2': 'Staff is suggesting that we might move forward with two rounds or tranches of work. The first grouping would be our review of police policies and reimagining our police department and related services all in one bundle of the topics that have been identified by the City Council for consideration to date.'",
        "'speaker_2': 'We see the following topics possibly fitting into this first tranche of work. So first, it would be the review of use of force policies where the public participation and review of options could be implemented as soon as later this year and possibly into next year.'",
        "'speaker_2': 'And this really does tie back to the mayor's pledge, where we committed to review, engage, report and reform with respect to those use of force policies. Simultaneously. We believe that we can be working on a second topic, which is review police accountability and oversight options, where we see the possibility of working with the City Council and the'",
        "'speaker_2': 'community in the coming months to identify and consider options with a target to implement those changes with the 2020 122 budget, if not sooner. And the third police related item is considering unbundling police services where we would explore options in the coming months, make possible near-term changes in connection with our budget as soon as this October, when'",
        "'speaker_2': 'we do our first first quarter review, which is what we've committed to do as part of the budget process, and then we'd be able to fully link those service changes as we develop the 2021 and 22 budget process.'",
        "'speaker_2': 'So with that, with that work fully underway, staff is suggesting that we might see a second round of work that would follow in early 2021, where we would review laws that criminalize survival, which is another topic area that that was brought forward.'",
        "'speaker_2': 'We would envision making any changes to those local laws as appropriate. And there's a strong possibility that we'll see we'll gain insights from our our work on bundling police services and possibly some of the other police related work that we would be doing.'",
        "'speaker_2': 'And then advocating for state and federal legislative changes with cities 2021 and 22 legislative platform. There are obviously a lot of different ways that we might move forward with that work, so we put that forward as one possibility for Council's consideration.'",
        "'speaker_2': 'We have not incorporated an approach to addressing systemic racism for the organization or the broader community at this time, or any other topic that council may wish to incorporate going forward. So we we are looking for additional direction in those areas tonight.'",
        "'speaker_2': 'And to get this work done, we'd be looking for council input and direction on our approach to the public participation process, including our process for convening and engaging with the community on an ongoing basis for these for these various topic areas.'",
        "'speaker_2': 'There are a number of options here as well. I'll suggest a few possibilities that might be appropriate to apply to five or six of the topic areas or to the two broad groupings that I just outlined for the for the presentation this evening.'",
        "'speaker_2': 'There is the possibility of creating multiple council led committees with support from staff for each of those committees. Council might ask the mayor to appoint a subcommittee to oversee and guide the public process for various topics. Council could create a task force or possibly two to work through these various topic areas.'",
        "'speaker_2': 'Or council may have other ideas for us to approach the public engagement component of this work and to develop the various options under each topic area. So with that, I'll conclude staff's presentation this evening and make make us available for any questions that you may have.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Bowden, for that report. So, Councilor, at this time, do we have any clarifying questions of Mr. Bowden before we get to our public comment? Mr. Rowley, I see your hand up.'",
        "'speaker_2': 'Thank you, Mr. Mayor. Thanks. Assistant City Manager. Um, this is partly a question. Um. I guess when we talk about systemic racism, uh, are we looking at this as a broader society, you know, maybe a citywide issue and not focusing specifically on, you know, accusing the police department or officers in our police department of, you know, being'",
        "'speaker_2': 'racist. I just want to be clear on what it is that we're looking at. Yeah, I think so far. And I'll defer to the city manager if I if I if I don't hit the nail right on the head.'",
        "'speaker_2': 'We've heard it to be a conversation about either organizationally or with the community. This this has not been that particular component of the work program has not been directed toward the police department. It has been a kind of a level up organizationally as the city of Alameda and then as the broader community.'",
        "'speaker_2': 'And that's really why it's not embedded in the the work plan this evening is to further discuss that. Okay. So do you think it would be helpful in the future? You know, that would be kind of bifurcate that from an agenda that talks about, you know, for lack of a better word, police reform.'",
        "'speaker_2': 'So there's not a confusion that we're just focusing on one particular department. Yeah. I think that the work plan could do that going forward. Okay. Thank you.'",
        "'speaker_0': 'Hey, is that it for you even study?'",
        "'speaker_2': 'Oh, yes. I'm sorry, I forgot.'",
        "'speaker_0': 'Yeah, I suppose we'll get the hand signal. Dad? Yeah? Sorry to pitch the pitcher to the catcher. All those things. Yeah. Okay. All right. Um, any other hands up before we get to our public comment? I'm not seeing any.'",
        "'speaker_0': 'So, Madam Clerk, how many. How many public comments have you received so far?'",
        "'speaker_1': 'We have received ten. And we have one. Okay. About five people waiting to speak. Oh, I'm sorry. Ten.'",
        "'speaker_0': 'Okay. So ten written comments and another ten waiting to speak.'",
        "'speaker_1': 'That is correct.'",
        "'speaker_0': 'Okay. So that's 20 speakers. So then our rule of 10 minutes per speaker applies. So with that, we will take are you going to take the live speakers first? How are you doing this?'",
        "'speaker_1': 'Yes, we will take the live speakers first.'",
        "'speaker_0': 'Thank you. I mean, they're all life, but. Yes, but the ones who are waiting to speak in person. Thank you.'",
        "'speaker_1': 'Okay. And I announced that the most current version of Zoom is needed to be able to speak. So any attendees wishing to speak, you can raise your hands now. And the first speaker is Ben Kaleka.'",
        "'speaker_2': 'Hello.'",
        "'speaker_0': 'Morning, Ms.. Is it Kaleka?'",
        "'speaker_2': 'Kaleka?'",
        "'speaker_0': 'Yes, I.'",
        "'speaker_2': 'Got it right after the Holocaust. So there's a lot of debate about about how we end up solving these particular sorts of problems. And obviously, if we're trying to put into place something that lasts for, you know, another couple hundred years, hopefully we want to take that time to do it properly.'",
        "'speaker_2': 'But I think that there are some things that we could codify now in terms of what the goals and the measurements are or whatever the thing is in the next over the next time. And those are those the things that we could all agree on.'",
        "'speaker_2': 'So, you know, just to go through it specifically, things like, you know, making sure the acceptable behavior stops, which means defining what that is and saying that, you know, by this time next year, you know, there are, you know, more than X number of incidents.'",
        "'speaker_2': 'You know, that that there is, you know, whatever that entity is, you know, we're not we're the victim within a certain number of incidents when there are incidents that are means to to go through those. Number two is and really stating it out, both in terms of the specifics and in terms of the philosophy that must be'",
        "'speaker_2': ', you know, that we expect from the people that are representing us, too, is the notion of there being a protocol transparency. So setting up a requirement for whatever entities, including the ones we have now that treats the gun the in the way that other government or government agencies are treated so that things are allowed to be publicly'",
        "'speaker_2': 'accessible unless there is a very real reason not to be in. That reason is enforced by somebody that is a third party. That also includes making sure that all officers have body cams and those that, you know, if they're on duty, they have body cams.'",
        "'speaker_2': 'And if not, it's assumed that whatever time you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_1': 'Lauren Salima.'",
        "'speaker_0': 'Welcome. It's Salem, actually. Hi. So I am Salem. Yes, yes, yes. It's just like the town where the witch trials. Um. Um. Okay, so I don't have any specific comments about how to go about the process of doing that, but I just wanted to speak to the importance and the urgency with which we need to do this'",
        "'speaker_0': 'work, and specifically with the unbundling of police services and police accountability. I was very troubled by the recent article in the Chronicle about the settlement reached with Shelby and his mother after he was killed by the Army at a police department in December of 2018.'",
        "'speaker_0': 'Um, Mr. Gordon, he was not black, but I think it does really highlight the serious problems that we have with using our police.'",
        "'speaker_2': 'To.'",
        "'speaker_0': 'Help with mentally ill people in our community. And it's a very real need. We have to unbundle those services and find a new way of dealing with the mentally ill and other people in our community who need help but unfortunately criminal.'",
        "'speaker_0': 'Um, I wrote an article recently in Life magazine that said that mentally ill people are 16 times more likely to be killed by police officers, and one in four people killed by police in 2015 had a serious mental illness.'",
        "'speaker_0': 'So I just want to make sure we all know the urgency of this work that we're doing. Thank you so much for your time. Thank you, Mr. Taylor. Our next speaker.'",
        "'speaker_1': 'Jason Horvath.'",
        "'speaker_0': 'Hello.'",
        "'speaker_2': 'Hi, counsel. My name is Jason Horvath, and I'm one of your police officers. I'd like to address the decision that was made recently to force us to get rid of our emergency response armored vehicle. I'd like to talk a little bit about what that vehicle is.'",
        "'speaker_2': 'The purpose behind it and why it's a valuable lifesaving tool that we should absolutely keeping our toolbox. Despite uninformed opinions, I've heard voiced in recent council meetings the emergency response vehicle, or for short, as we call it, is not a tank.'",
        "'speaker_2': 'It has no offensive capabilities and is essentially an armored ambulance in the event of a school shooting or other active shooter event. It is a way officers can respond to the scene with a little bit of extra protection to keep people safe in the event civilians or officers have been shot and the shooter is still active.'",
        "'speaker_2': 'The Earth can be positioned between the shooter and the victim to allow a slightly safer rescue. Our regular patrol cars do not provide anywhere near the level of protection the Earth does when responding to critical incidents. It seems to me this decision was made purely on emotion.'",
        "'speaker_2': 'Well, casting logic, reason and facts to the wind when creating public policy that is terrifying. The only reason I can think of that inspired getting rid of it is it looked scary and any perceived militarization of police. Again, the vehicle has no offensive capabilities and exists to get people safely into and out of dangerous situations.'",
        "'speaker_2': 'It's already paid for. So what legitimate, logical reason is there to take it away and make my job more dangerous? We are the ones who run into gunfire to save lives when other when others run away. Don't take away a shield that makes it a little safer for us to do that, because it might be your child'",
        "'speaker_2': 'or your loved one or you that we are unable to rescue. Thank you.'",
        "'speaker_0': 'Thank you, sir Horvath. Our next speaker.'",
        "'speaker_1': 'Janice Anderson.'",
        "'speaker_0': 'Welcome. Tennis, maybe? Yes, to me. Hi. Thank you. Um, thank you for hearing our concerns. I am hopeful that you will take our suggestions and feedback seriously as we move forward to change policing in our community. First, I wholeheartedly support the call from ACLU.'",
        "'speaker_0': 'People Power to defund the police budget by 50%. Despite publicity attempts to emphasize a few recent incidents of crime, we would have in a relatively safe city and do not require the militarized force that our tax dollars currently pay for and the interest of current and future budgetary concerns.'",
        "'speaker_0': 'I also support the funding the pay of officers involved in the detainment of Mr. Watkins pending independent review. I also would like to see action taken towards a more thorough investigation of the death of the Forgotten Me in 2018, which resulted in a six figure settlement.'",
        "'speaker_0': 'Perhaps further dismissals of officers involved in that would offer budgetary saving as details are worked out and finalized and creating oversight. I have several concerns. Primarily about this process itself. My hope is that we set clear dates and benchmarks to support a process of valuable change instead of making commitments to make plans to make change.'",
        "'speaker_0': 'I also have concerns about the makeup of such an oversight committee, figuring it would end up being establishment members who are resistant to new community leadership and ideas. I also. Very.'",
        "'speaker_2': 'Very.'",
        "'speaker_0': 'Serious concerns about what kind of power such an oversight committee would have to implement change in a police department that seems accustomed to a level of autonomy few departments have. For example, if we a civilian for civilian committee can't oversee things like use of force, what coin is there and having one?'",
        "'speaker_0': 'I look forward to continuing to see a commitment from all of you dedicated to making important changes.'",
        "'speaker_2': 'In this community.'",
        "'speaker_0': 'Thank you. Thank you, Ms.. Anderson. Our next speaker.'",
        "'speaker_1': 'Cherrie Johansen.'",
        "'speaker_0': 'Hello, Mr. Hansen. I am. Oh, counseling. And there I am delighted that you are listening to us again. And I'm hoping that we will have come to some really solid, progressive actions from from all of the comments. I, too, was taken aback by the story in the Chronicle about Mr. Dutton.'",
        "'speaker_0': 'BE And what disturbs me the most is that that was a fairly recent incident and I really feel like if we're going to move forward, we have to have information on what's happened before. And I would like to know if this was a.'",
        "'speaker_0': 'How many of these incidences have happened where we've had to pay out for.'",
        "'speaker_2': 'Civil.'",
        "'speaker_0': 'Rights? That's what we paid the mother $250,000.'",
        "'speaker_2': 'For.'",
        "'speaker_0': 'Violation of.'",
        "'speaker_2': 'Her son's civil.'",
        "'speaker_0': 'Rights. And also that brings to mind about what kinds of procedures happened after that event. If we paid out the money, what happened to the officers? Was there a discipline? Are they still in the force? Um. Did we do training?'",
        "'speaker_0': 'What procedures were put in place? And, um, I also was wondering if an EMT is called automatically on these kinds of calls. Um, so I know that, um, the chief is very proud of the fact that there hasn't been a shooting death, which I think is, is admirable.'",
        "'speaker_2': 'But, um.'",
        "'speaker_0': 'George Floyd wasn't shot. He wasn't shot. And, quite frankly, Mr. Watkins wasn't shot. And we're still talking about the police abuse of power. So I'm hoping going forward that will have some real teeth where we can have accountability and transparency.'",
        "'speaker_0': 'Thank you. Thank. Thank you, Mr. Hanson. Our next speaker is Laura Cutrone. Welcome. Hi. Hi. Hello, Mayor and City Council. I want to meet a resident. I applaud your intentional approach to enact needed change that will ensure the safety of our black and brown neighbors.'",
        "'speaker_0': 'As you create a work plan. I implore you to proceed with these things in mind to build trust and to make lasting, impactful change. One listen to act. And three, be accountable. Listen, Vice Mayor Knox White's plan outlines the steering committee selection and community participation.'",
        "'speaker_0': 'Systemic racism perpetuates distrust in a system that was designed to keep community members of color down. So there needs to be time and attention spent building trust. The community needs to hear you, to hear what they need and how they have been impacted by past actions.'",
        "'speaker_0': 'Please, please, please trust their experience and don't question it. Even if it's hard to hear. Act. Shifting from talk to action is absolutely critical. Without action and change, this work plan becomes a meaningless performance. A commitment to reduce APD budget by a specific percentage will set the precedent that the steering committee's recommendations will be taken seriously.'",
        "'speaker_0': 'Be accountable. Give the steering committee leverage so that their recommendations can be enacted. That's also the foundation for change and increase accountability to the community. I also question City Council's objectivity as council members take donations or are affiliated with public safety unions, not accepting donations will build the community's trust.'",
        "'speaker_0': 'Thank you so much for your continued, difficult and necessary work to make the city, our city, a place that we are so proud to live in. Thank you for your comments. And our next speaker is Jonas Coughlin. Mr. Coughlin.'",
        "'speaker_2': 'Thank you, Madam Chair and council members, I appreciate the opportunity to address you this evening. There's a some dots to connect tonight going from just recent thoughts of the killing, the tragic killing of George Floyd, the unjustified detention of Molly Watkins and her own streets, the racist graffiti this weekend, which was just, just stunning and upsetting.'",
        "'speaker_2': 'And then the other tragedy happening right now in San Quentin, one quarter of the prison population that's gone and the population is having people killed. It's distressing. And what we know now through our COVID experience is significant. Change can happen.'",
        "'speaker_2': 'It can be done. And I'm so glad that you've got this on your agenda and you're keeping it moving forward. I have a couple of specific points to address. I fully agree that the review of laws that criminalize survival can be put off.'",
        "'speaker_2': 'Most of those laws are state laws. That's not something the council can change anyway in the short term. More importantly, in terms of community participation in a committee, yes, we are a robust process, inclusive, fact based. I would urge against a council led commission or committee maybe something that is community led, citizen led.'",
        "'speaker_2': 'In terms of inclusivity, we need obviously a significant presence of people of color who have that life experience. I would also suggest you might look for individuals who are formerly incarcerated and have that experience of having been through that system.'",
        "'speaker_2': 'And then in terms of unbundling, and that's maybe the biggest, biggest question I want to address tonight. I fully support blowing up the system, looking at the community needs, and then creating what you would do if you were to start from scratch in terms of how you deliver services.'",
        "'speaker_2': 'Build it from scratch and then implement it. You can't do that overnight, but you could at least tonight.'",
        "'speaker_0': 'Thank you, Mr. Silence. Our next speaker.'",
        "'speaker_1': 'James Bergquist.'",
        "'speaker_0': 'Hello, Mr. Bergquist. Hi. I'm sorry. This is actually just like a chat. Oh, hello. Welcome. Hi. My name's Lester Urrutia. I'm a ten year resident and I live here with my family. I hear a lot of people say that they need police, that it's not possible to defund or unbundle.'",
        "'speaker_0': 'But I think we need to take a moment to realize what this means and to recognize the history. Policing as an institution was built on racist ideals and principles. To assume that these are no longer relevant or inaction is simply naive and privileged.'",
        "'speaker_0': 'Black and brown people on this island have countless stories of racist encounters with the police, some of which were shared at previous meetings. The problem isn't only the police, but we all note the racist citizens that also call the police.'",
        "'speaker_0': 'We don't need so much money in our budget going towards police. And previously Councilmember O.D. talked at length about how maybe training would be useful. But I disagree. And there are countless stories and data about how trainings actually do not.'",
        "'speaker_2': 'Fix.'",
        "'speaker_0': 'These situations and they just waste money. Anyone can Google what it means to defund the police and what redirecting that money would go toward. And I'm very concerned about the previous officer's statements a few minutes ago. I highly doubt the herb was being used in Oakland riots as a shield to help people.'",
        "'speaker_0': 'And that same problematic rhetoric is what put cops in schools and Columbine. However, cops have yet to stop a school shooting and instead have basically funneled the school to prison pipeline. So I reject his argument and commend the decision to act on removing that grossly expensive and unnecessary vehicle.'",
        "'speaker_0': 'We must unbundle services and reroute the massive amounts of money currently going toward Alameda Police Department. And I also agree with the previous speaker that we need to really be including community members involved in this future planning that's being discussed.'",
        "'speaker_0': 'Thank you for your time. Thank you for. Thank you for your comments. Our next speaker.'",
        "'speaker_1': 'Leon Dillon.'",
        "'speaker_0': 'Hello. Right.'",
        "'speaker_2': 'Thank you, major american city council. I organize this alameda use for BLM. I'm not sure how many staff members support the assistant city manager. You don't seem. I'm not really sure the structure or if it's the or they receive adequate funding or maybe it's the time from the last city council meeting.'",
        "'speaker_2': 'But the suggestion for the work fund is so, so, so underwhelming. What have you done in these past few weeks that you shared the basic talking points? We are in a political moment where people cannot wait anymore. We have tons of resources, examples from all over the nation and from the world.'",
        "'speaker_2': 'We have scholars, but most importantly, we have experts here in the community, people who have faced police harassment and racism. So really, please, let's use those resources and coming up with our work plan. My question is, how do we input into your research all your suggested policies?'",
        "'speaker_2': 'Is the work plan accessible in writing before your city council presentation? A lot of the youth that I work with are currently in middle school and high school and it's for their first time engaging in city politics. And so we're figuring out ways to increase public participation.'",
        "'speaker_2': 'And so if there's any way we can then put in these before the meetings or see what you're going to present, I think it'd be really, really helpful. And since these past two weeks, hate crimes have been taking place in that city.'",
        "'speaker_2': 'We had a vigil as well to see how in city hall. And slowly we started seeing people taking it down. We are seeing white supremacists put QR codes on top of our posters all over the island. We have heard about bikes being stolen that had BLM friends and most literally over the weekend we had some vandalism happening'",
        "'speaker_2': 'to cars and property for a black family. And so the more time you take in meeting the and the more time you take in meeting the youth demands, it's just ways that we feel like you are falling. And so as a reminder, I'm going to reread our demands, and one is to release the names of the officers'",
        "'speaker_2': 'and the rest of.'",
        "'speaker_0': 'This is, of course, public comment, not Q&A. But I do want to just clarify a point that was raised, because I don't want the listening audience to be confused about what we're doing. We did not ask Mr. Bowden, our assistant city manager, to come back to us with a work plan.'",
        "'speaker_0': 'What we asked for was to come back with the framework of five items and possibly more that a couple of council members presented to us at our last meeting on July 7th, June 17th, and. And then to recommend to staff to give them our direction as counsel for the work plan that we want to see adopted.'",
        "'speaker_0': 'And that will include a timeline and all kinds of things that this Council will, when we finished listening to input from the public, get to work on this very evening. But the assistant city manager did as we asked and set up a framework.'",
        "'speaker_0': 'And I think that if we ask him during our discussion, he'll tell you about some more input. He's gathered from talking to various different city and city leaders in other cities that are doing or have done similar things to what we're looking into doing.'",
        "'speaker_0': 'Okay. So our next public speaker.'",
        "'speaker_1': 'Seth May been Marvin.'",
        "'speaker_0': 'Sorry to Seth. Marvin. Mr. Marvin, good evening.'",
        "'speaker_2': 'Good evening. I'd like to actually request to be put at the end of the line and for you to center black and brown voices. I think what we're seeing here is a great example of equal but not equitable and so impacted.'",
        "'speaker_2': 'Community members who don't have a way to get in line as easily as I did aren't able to share their voices here. So I would encourage you in both public comments to center black and brown voices. I've got other things to say, but I'll wait until the end of the line.'",
        "'speaker_0': 'Okay. That might have been part of your time, but let's see. So I'm certainly amenable to any such any suggestions. And I'm just wondering, um. Madam Clerk, um. What would you. What would you suggest? I mean, councilmembers. Are you.'",
        "'speaker_0': 'I gather this is something, but I shouldn't read your minds. But this is something that the vice mayor did on his Zoom town hall, which I thought works well and was very respectful. So we give it a try here.'",
        "'speaker_0': 'If our assistant city clerk and I see a thumbs up from Councilmember Vela, vice mayor, two thumbs from scowls, everybody. And I can't see your thumbs. Councilmember de Third.'",
        "'speaker_2': 'Just a quick question. So are you asking, are you going to ask persons of color.'",
        "'speaker_0': 'If I get to go and I will take the next step.'",
        "'speaker_2': 'To. Oh, I see.'",
        "'speaker_0': 'Well, I'll tell you what. I've got a majority because I would vote. So let's. Let's give it a try. Bear with me. Um, I have. I have huge faith in the city clerk's office. She's probably turning pale as I speak, but, um.'",
        "'speaker_0': 'Madam, could we ask anyone who identifies as a person of color, um. Black, brown person of color, um, to raise their hand. Are you using the raise hand function on Zoom? Is that how we're doing it?'",
        "'speaker_1': 'Um, yes. Hold on 1/2, Mayor. Um, we're trying to determine a process.'",
        "'speaker_0': 'Sorry. Bless you. I and I will just take this opportunity to tell the public how amazing our city clerk's office has been, because literally overnight they had to transition from doing live meetings. I mean, we always streamed our meetings and you could watch it online, but this is just totally different.'",
        "'speaker_0': 'And from the time when we first started, I guess in March until now, we've used a number of different platforms because some have been more successful than others. When we do closed session, we started on the WebEx because that provides a secure platform.'",
        "'speaker_0': 'And then we add that meeting and we switch over to Zoom and they manage to do troubleshooting and all kinds of things behind the scenes that make us here on camera, on the screen look good. So and then the mayor tosses them a curveball from time to time.'",
        "'speaker_0': 'So I'm concerned about. Go ahead and unmute yourself. Yeah, I was just going to suggest that perhaps to the process we ask everybody to lower their hands and then for people that identify as a person of color to raise their hands and that might expedite this and then we can call for other speakers after that.'",
        "'speaker_0': 'It's just how does that work. Yeah.'",
        "'speaker_1': 'What we because they are in order already of how they raised their hands. What we were going to recommend was that at the start of their speaking or at the start of their comment, they can ask or let us know whether they would like to go to the end and then we will start their time at that'",
        "'speaker_1': 'point.'",
        "'speaker_0': 'And that might keep the meeting moving along more quickly rather than ask everybody it can send but up again. Okay, that sounds like a reasonable way to do it. Okay. I'm seeing heads nodding. So. Okay. So what we're going to do is ask you when your name is called, if you are not a person of color, it'",
        "'speaker_0': 'would be appreciated if you would defer. We will get you right back into the queue. But to hear from our voices of of people of color first, let's give it a try. Thank you. Okay.'",
        "'speaker_1': 'So the next speaker is Keesha.'",
        "'speaker_0': 'Good evening. I can you hear me? I can. I can subtract. DISPATCHER High confidence. Oh, do we? I keep hearing about, you know, the community change, things like that going forward. I'm old school. I like people to put their money where their mouth is.'",
        "'speaker_0': 'Councilman O.D. actually came to the police department. He sat with me for 3 hours to see how it feels to be a dispatcher. The calls that come in, watch calls that we can filter through, or which calls that needed to go out right away, things of that nature.'",
        "'speaker_0': 'He got a feel for how things work. Instead of just criticizing and pointing fingers and what I keep hearing a lot from the community, I actually I don't live in Alameda, but. I consider myself part of the community because I've been a civil servant to Alameda for almost eight years.'",
        "'speaker_0': 'And yes, I work for a police department. Yes, there are bad cops out in the world, but for Alameda, there are none. They're a mixed race of officers. We have Asian descent. We have Polynesian descent. We have Hispanic.'",
        "'speaker_0': 'There are all kinds and there are some who are actually married to black women or, you know, Hispanic, white and Asian. It doesn't matter. I just don't understand why people that can't close their eyes take a breath and just put yourself in their shoes for just 1/2 of your day and realize the decisions that they have to'",
        "'speaker_0': 'make are to save someone's life or to. Look in another direction and help someone who's been a mental crisis or potentially go help an animal that people call and they're upset because it's not breathing. Just think about those people.'",
        "'speaker_0': 'Something needs to.'",
        "'speaker_2': 'Change.'",
        "'speaker_1': 'That's time.'",
        "'speaker_0': 'Thank you, Keisha. And our next speaker, Tenney. And if. Okay. So, um, Tony, you have the option of, um, I giving your place in line next to a person of color or. Passages. Mr. Green. Oh, you're muted.'",
        "'speaker_1': 'Miscreant think you are my leader?'",
        "'speaker_0': 'She said to give up her place. Thank you, Ms.. Graham.'",
        "'speaker_1': 'Next speaker, Dr. Jeff Lewis.'",
        "'speaker_0': 'It's true. This.'",
        "'speaker_2': 'I'll give up my place later.'",
        "'speaker_0': 'Thank you, Mr. Lewis. Next speaker.'",
        "'speaker_1': 'Amos White.'",
        "'speaker_0': 'He must wait. Good evening.'",
        "'speaker_2': 'Hi. Good evening Matt American evening council and thank you and I represent Alameda people power Asia. Excuse me show your people power and just the deployment process. I just don't understand how city council. As others have pointed out can.'",
        "'speaker_2': 'It's kind of like asking the police to police or investigate the police. I don't know how council can actually run its own process where the community is actually asking for or demanding that leadership and what is basically an issue of systemic racism and having to deal with the systemic issues of which council is actually a part of'",
        "'speaker_2': '. And to say that we cannot hold a community process until there is first accountability, as the young member said a couple of people ago, it kind of just seems like talking points and processes being thrown up in front of the public as opposed to actually demanding accountability of the chief or even of council.'",
        "'speaker_2': 'This is an asymmetrical comment to council and we have no open dialog in exchange that would ensure accountability of our elected officials and our public officials. All meetings right now are controlled by council, council driven, and this is an open and it doesn't ensure accountability of our officials who they themselves are moving a process along.'",
        "'speaker_2': 'This isn't exactly the democracy that I think the thousands of people that showed up on the rallies to actually demand and ask for we to believe that do systemic racism here in our city and in particular with an opinion that an independent citizen oversight commission should be formed.'",
        "'speaker_2': 'However, before that can be done again, we must act immediately in one of two ways either to provide for the public health and safety and general welfare for black community members in all. Alameda by first abolishing AP, APD and reallocating those funds to community support programs and services or enacting an immediate 50% reduction in their budget as'",
        "'speaker_2': 'as nationwide, over 54% of all crimes are either health care or mental health care related, diverting the public in a process like this.'",
        "'speaker_0': 'Thank you, Mr. White. Our next speaker.'",
        "'speaker_1': 'Quinn Weaver.'",
        "'speaker_0': 'Hello.'",
        "'speaker_2': 'So, yeah, if there are people behind me, I'd like to yield for different voices.'",
        "'speaker_0': 'Thank you, Mr. Weaver. Our next speaker, then.'",
        "'speaker_1': 'Rasheed Shabazz.'",
        "'speaker_0': 'Rasheed Shabazz. Good evening.'",
        "'speaker_2': 'Great to be with you. My name is Rosie Shabbat, and I'm an Alameda resident.'",
        "'speaker_0': 'For alaikum salaam.'",
        "'speaker_2': 'I attempted to close my eyes and imagine what it would be like to be in the shoes of those who were employed by the city of Alameda, with the army, the police force. And when I close my eyes, I remember when I was seven years old and I found a bike at Woodstock Park and I brought it'",
        "'speaker_2': 'back to my mom and she told me I had to turn it in. When we called the police department and a female officer came and she told me and my mother she was going to take me to jail because I was in possession of stolen property.'",
        "'speaker_2': 'My mom wasn't having that, fortunately, and I didn't have to experience the criminal justice system at that time. Unfortunately, I had to experience policing in Alameda for a very long time. And so I'm going to some of that personal history today or some of the histories that I've shared with you on multiple occasions, speaking publicly or my'",
        "'speaker_2': 'correspondence. But what I do want to suggest a framework overarching on this whole process is truth and reconciliation. As it was mentioned earlier, you can't have accountability without having a history and a truthful examination. And so I urge this council and the city to engage in a truth and reconciliation process that can engage those who have been'",
        "'speaker_2': 'targeted by not only police, but victimized by other public and private institutions in Alameda to be able to come forward and speak our truth until you have that history and face that, there can be no justice. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Abbas. Our next speaker.'",
        "'speaker_1': 'Annie. Marie.'",
        "'speaker_0': 'Ms.. Murray. I can go at the end if there's any more people. Thank you. Thank you. I really do appreciate all of you speakers who are doing this so graciously and respectfully. Next speaker, then Walter Ian. Mr. John.'",
        "'speaker_0': 'Mr. Young, you're still, you know, aunt.'",
        "'speaker_2': 'Hello? Can you hear me?'",
        "'speaker_0': 'I can.'",
        "'speaker_2': 'And first of all, I'd like to thank Councilmember Bello for responding my to my letter that I sent to the city manager and to all of you. And I'd like to emphasize that I think it's important for any of these changes, a consideration of these changes, to be successful, that the police department needs to change its leadership'",
        "'speaker_2': 'under a Chief Guillory and Captain McMullen, both who've been in the department for over 20 years. They are the creators and the leaders of the current culture in the PD. And I find it extraordinary that every PD member that has bothered to show up in public comments is not indicated that there is a single problem with race'",
        "'speaker_2': '. It must be living in a different world. And perhaps if the.'",
        "'speaker_0': 'PD.'",
        "'speaker_2': 'In Alameda has magically avoided any of the problems the whole nation is grappling with. So I'd encourage the city manager to consider that and consider I'd ask that all of you consider that as well, too. And I'm still looking forward to a truly independent review of the recent May 23rd incident or any previous incidents.'",
        "'speaker_2': 'I don't believe the PD's in a position to examine itself, and I guess it will become an ongoing tradition for a police officer to show up in public comments and tell a scary story about why they need an armored vehicle.'",
        "'speaker_2': 'Or to say that none of them are are affected by race or racism. But those are my comments. Thank you.'",
        "'speaker_0': 'Thank you, Mr. John. Our next speaker.'",
        "'speaker_1': 'Thomas Merry Addison.'",
        "'speaker_0': 'Good evening.'",
        "'speaker_2': 'Hi. Um, so I'm a civil rights attorney practicing for more than a decade on issues of criminalization with a focus on policing. And I'm a ten year resident and a person of color and actually someone that lives very close to where Mr. Watkins was assaulted by a police officer here in Alameda.'",
        "'speaker_2': 'I just want to say that, you know, to councilman, at this point, to credibly address systemic racism, quintessentially means acknowledging that policing as a system in America, including in the city of Alameda, was designed to uphold white supremacy.'",
        "'speaker_2': 'This would be the controlling and violent oppression of black people. And there's a ton of literature on it. And there's the lived experience of black and brown people, both here in Alameda and across the country, to evidence that reality and many allegations that I've seen in my two years here, including represent the future of the city, are'",
        "'speaker_2': 'actively engaging and being better civically educated on that issue. And as residents, we should expect that the city council to become better educated, to truly represent our interests. Interests. And as Mr. Famous Whitey alluded to, I don't think there are many elements who are not interested in regurgitated talking points about reform.'",
        "'speaker_2': 'And I'm grateful personally for the work of politicians like the future. Boss has been a voice as both a community member and researcher on Alameda. The Simple Story of racism here on the island. I'm not clear what unbundling means, and I'm especially wary, given the miserable track record that reformers strategies have had on police departments big and'",
        "'speaker_2': 'small across the nation, as another speaker rightly noted. And again, there's considerable literature on that as well. Most importantly, and finally, I agree with the speaker from Alameda, BLM, there's an urgency to deal with these issues and for a work plan to be worthwhile.'",
        "'speaker_2': 'It must be community led. Police, like government, only execute good public officers at our consent, at the governance consent and the use of force and violence in particular is not something that public consent to willingly. There are other ways to manifest public safety that require, first, a reckoning of the community's racial history and current realities and the'",
        "'speaker_2': 'common sense that real safety is derived from meeting community needs for food, shelter, education and care. I thank you, but.'",
        "'speaker_0': 'I thank you for your comments, sir. Our next speaker.'",
        "'speaker_1': 'Cheryl Taylor.'",
        "'speaker_0': 'Ms.. Taylor. Hi. Am I unmuted? You are indeed. Hi. Thank you very much. Mayor Ashcroft, council members and city staff. My name is Cheryl Taylor. I am an African-American. Let me see. 13 year resident of Alameda. I vote in every election.'",
        "'speaker_0': 'I'm a taxpayer. So I just want to say, I appreciate your attention to this for.'",
        "'speaker_2': 'Your continued attention to.'",
        "'speaker_0': 'These.'",
        "'speaker_2': 'Issues. While I've been fortunate in Alameda never to have had an issue with police.'",
        "'speaker_0': 'I stand by those who have had.'",
        "'speaker_2': 'Issues with.'",
        "'speaker_0': 'Police, as well as some of our neighbors who may need some help.'",
        "'speaker_2': 'Understanding that black lives.'",
        "'speaker_0': 'Do matter. So one thing I would like to say about police, maybe in the interim.'",
        "'speaker_2': 'I'm on your way to sort.'",
        "'speaker_0': 'Of reevaluating the role of police in Alameda is to really look at the union and the union agreement. My sense is that changing the police chief will do very little, but it really is the union agreement that kind of binds.'",
        "'speaker_2': 'You, unfortunately.'",
        "'speaker_0': 'To some of.'",
        "'speaker_2': 'The practices that endanger our lives in town.'",
        "'speaker_0': 'So I just, again, want to thank you very much for for your attention to this issue and your sustained attention.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Ms.. Taylor. And our next speaker.'",
        "'speaker_1': 'James Bergquist.'",
        "'speaker_2': 'Yes. Yes. Hi. Firstly, Officer Harbach called one or more of the speakers from the last town hall uninformed. One that's disparaging and unnecessary. The officer could have made his comments without disparaging others. One of the speakers I called is Hank was a middle school student, and I think they were quite informed for their age.'",
        "'speaker_2': 'We all know it's not a literal tank. Secondly, while unbundling police services, I'd like to know how many times the armored vehicles been fired upon in Alameda. I didn't hear this data addressed in order to determine how necessary it really is.'",
        "'speaker_2': 'Just because schools may have crime doesn't mean we need police in schools. It's a faulty argument. And just because people have guns doesn't mean we need an armored vehicle. I believe the value of the vehicle would be better used to protect people of color with enhanced social services in our community.'",
        "'speaker_2': 'Thirdly, I'd like to suggest to all community members to talk to at least five friends each and suggest to them that they pay close attention to which side of these issues their council members are taking so that we can elect council members that represent us, the people.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Bergquist. Our next speaker.'",
        "'speaker_1': 'Wesley Swed Lowe.'",
        "'speaker_0': 'Good evening. You just need to go.'",
        "'speaker_2': 'I yield my time to any speakers of color.'",
        "'speaker_0': 'Hold their four minute. Madam Clerk, did we get Barry back in the rotation or.'",
        "'speaker_1': 'Yeah, he's the last one.'",
        "'speaker_0': 'You are the last speaker.'",
        "'speaker_2': 'Okay, great. Hey. Yeah, I just a few points. The first one is a comment in the beginning about systematic racism, and I just sort of like to clarify that it has nothing to do with intention and it's really about outcomes.'",
        "'speaker_2': 'So systematic racism is really about unequal outcomes. And I'm hoping that that what happens will take on a deliberately anti-racist approach to kind of create equity with those outcomes. Secondly, I'd like to just kind of bring up something that's been mentioned, which is the school to prison pipeline.'",
        "'speaker_2': 'I see that. I mean, it has sorrows. And these are definitely the the literature is out there. This is definitely tied into the school to prison pipeline. And also for students of color, it's generally considered kind of increased sense of psychological risk as well as physical.'",
        "'speaker_2': 'I agree with 50% of the funding. The police the police departments has been pointed out, has a long history of racism. And the bloat in police departments is a function of the war on crime, which itself was a directly racist sort of creation in the late sixties.'",
        "'speaker_2': 'Training is not the way to go. Minneapolis and other places went through years of training. We saw the outcome there. And also anti-bias training has actually been shown to have negative consequences for people of color. I think we need to go in other ways.'",
        "'speaker_2': 'Last point. The main ways I would suggest is what's also been recommended community led organizations that have their own kind of intervention approaches, as well as the authority that's separate from the council. Thank you.'",
        "'speaker_0': 'Thank you, Mrs. Butler. And just briefly, if we could touch on the issue of the SRO, is that school resource officers? Either the assistant city manager or the police chief is on the call with one of you. Just bring everyone on who's listening to the meeting up to date on the status of police officers in Alameda schools'",
        "'speaker_0': '. Go ahead, Mr. Burton.'",
        "'speaker_2': 'Actually kind of chief for Larry.'",
        "'speaker_0': 'That's amazing. Okay. I think she for Larry, welcome.'",
        "'speaker_2': 'I I informed city manager several weeks ago and the school superintendent about a month before that that I intended to pull the school resource officers out of the schools. It was primarily a staffing issue at the time. The one of the school resource officers had promoted to sergeant the high school SRO.'",
        "'speaker_2': 'And so she was not going to be returning to that position. And with our our reduced staffing were 16 vacancies today and the fact that school was not in session since March 16. And as we're having this conversation now, there's no plan for regular classroom learning.'",
        "'speaker_2': 'It just made no sense to try to continue the program. So it's been temporarily suspended and I believe that was one item that the council voted to approve. And so that's where we are. There's no sorrows in the school right now.'",
        "'speaker_0': 'Thank you for that clarification. Okay. So then those for all our spoken comments for people speaking live and then if I understand correctly, we have another one.'",
        "'speaker_1': 'Actually, Mayor, we can start back with the speakers who decided to go to the end.'",
        "'speaker_0': 'Right. Thank you. Of course. Yes. Thank you. For all those who graciously stated your time, you will now be called upon to speak. Thank you.'",
        "'speaker_1': 'Seth Marvin.'",
        "'speaker_0': 'Thank you, Mr. Marvin.'",
        "'speaker_2': 'Thank you. Thanks for taking the suggestion and centering black and brown voices. I encourage you to think about creative ways to do that in the future that don't rely on the the the good intentions of white people, because that is structural racism.'",
        "'speaker_2': 'Essentially, if it's all white people or people or there aren't any people of color making those decisions about how long people get to talk, who gets the talk and what order they get to talking. I'm not saying anything you don't know, but I think it's important to name it.'",
        "'speaker_2': 'I think it's also important to name that there aren't any people that I know of who identify as black on the city council. And no matter how well-intentioned you are and no matter how well-intentioned we are as a community, we don't have that lived experience.'",
        "'speaker_2': 'So it's one thing to say, Oh, we can never defund the police, it'll make us less safe. It's another to say to think about every time you leave your house. If what you experience is that any interaction with the police makes you feel less safe than it is, then it will only be a benefit to actually reduce'",
        "'speaker_2': 'the number of police officers. Reduce the funds to the police. That's all I have to say for today. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Marvin. Okay. Next we hear.'",
        "'speaker_1': 'Tony Grimm.'",
        "'speaker_0': 'Ms.. Cram, welcome back. This. Grandma, you there? Yes, sir. Your. Just mute. It just. There you go. Okay. Thank you. Thank you. I just wanted to say that I was watching television, the local news coverage, I think it was Channel seven on June 11 about the Molly Watkins situation.'",
        "'speaker_0': 'I saw Chief O'Leary appear and he made a statement that the next day the city of Alameda was no longer going to be answering noncriminal calls. I thought that was, wow, that's pretty, pretty, you know, drastic situation. And I didn't know until later on that that that that decision had been put on hold by the city manager'",
        "'speaker_0': '. I went around thinking myself for a long while that the city was not answering those calls. And I also heard from in a previous council meeting they had police dispatchers spoke and he said those were the majority of the calls that were coming in.'",
        "'speaker_0': 'So I would so this was kind of upsetting to me because I thought that this was our policy for a while. And other people also mentioned that to me even from other cities. They said, well, what's happening in Alameda?'",
        "'speaker_0': 'So I would like to know, basically, it begs the question, who is setting policy on on withdrawing city services? Is it the police chief? Does he have the authority to do that or is it the city manager? Because what happened in this particular incident didn't make our city look very well organized.'",
        "'speaker_0': 'And I would like to ask that we have a clear decision making process and so that we can have accountability and not. No, he said he said and people aren't confuse. I didn't I never had to call in myself for a police for police help thank goodness.'",
        "'speaker_0': 'But I can't help but wonder how many people during that time may have wanted to call in, and they didn't because they thought the police weren't going to be answering it. So I would just like to have a better a better clear decision making policy on the subject of withdrawing city services.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Graham. And our next speaker.'",
        "'speaker_1': 'Jeff Lewis.'",
        "'speaker_0': 'Mr. Lewis? Yes.'",
        "'speaker_2': 'Thank you. I'm glad to see you moving forward with this over the time. The timeline that I see things taking until 2022 to establish a police accountability review board or or to do significant changes in the budget seems like a very long time time period to enact these things are things that we see police doing, such as'",
        "'speaker_2': 'the events on May 23rd seem like a very clear cause for firing someone. And I I'm disappointed that we needed to have an accountability board that would help to fight the police in order to achieve something like this.'",
        "'speaker_2': 'So I would like to see that. And also in terms of budget changes, I'm seeing some municipalities in the area starting to announce reductions in police budgets, preliminary to reprioritizing and unbundling services. And I think it would be good to see the city of Alameda do something similar to that, as well as kind of a demonstration of'",
        "'speaker_2': 'where we're moving in this process. And I think you.'",
        "'speaker_0': 'Thank you, Mr. Lewis. Our next speaker.'",
        "'speaker_1': 'Quinn Weaver.'",
        "'speaker_0': 'Hello.'",
        "'speaker_2': 'Hello. So a number of other people have touched on the issues they want to talk about and really address them more eloquently than I can. Mr. JUST. Mr. Rasheed. Mr. WHITE. Mr.. Henderson But I just want to underscore this point that most of this national conversation has been about the use of deadly force, and the reasons for'",
        "'speaker_2': 'that are are quite obvious, and it's an appropriate thing to worry about. But there are deeper underlying issues of sort of cultural racism in police departments. Structural racism in the system itself that perhaps most members of that system are one.'",
        "'speaker_2': 'And I think it's really reflected in these lower level cases, like the recent cases of people being arrested for dancing while black, you know, exercising while black and like playing outside of home, you know, and handcuffed for 2 hours while the police came the third degree.'",
        "'speaker_2': 'And don't listen to his neighbors. That's just massively. Inappropriate. And I can only imagine that that's being driven by. A culture or perception of one's role within the police department, that sort of thing. You know, this is the thing to do.'",
        "'speaker_2': 'You're going to be a tough person and you're going to be, you know, really use force and demand submission. And I think that in itself is a very legitimate reason to unbundle services from the police. I think that deliberative approach, a community based approach, when, you know, there's some desire here in this undesirable but non-criminal assessment is'",
        "'speaker_2': 'reported, is much better. And and these conversations we had by mental health workers or simply by neighbors or people who are willing to engage in plate conversations without bringing out the handcuffs. So I would urge you to consider that as well as critical cases like mental illness and you're put in front of somebody.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Weaver. And our next speaker.'",
        "'speaker_1': 'Annie Murray.'",
        "'speaker_0': 'Ms.. Murray. Hi. Hi. I have been a lifelong Alameda resident. I was born and raised here and I studied criminal justice over at San Jose State. So I'm pretty well informed of our community as well as the criminal justice system.'",
        "'speaker_0': 'On a scale of a nationwide scale, and I learned very early on, I think it was my first angel class that they told me a lot of your peers want to join this major to become cops, but probably about 5% of you will actually become cops because once you realize how unjust, implicitly biased and just racist the'",
        "'speaker_0': 'system is, you don't want to be a part of that because there's not a point where you can fix it from the inside, really. So we're definitely going to need to defund the police. 50% is a good.'",
        "'speaker_2': 'Start, but it's.'",
        "'speaker_0': 'Definitely going to need to be more. And the Citizen's Oversight Committee about something. I have no idea why we haven't already implemented that. I don't know why it's taking so long, but something that needs to be implemented immediately and needs to.'",
        "'speaker_2': 'Have.'",
        "'speaker_0': 'Oversight on the policies as well as individual police officers. There needs to be some type of oversight committee where people can make complaints about police officers and someone oversees that oversees the investigation. I think that should be a community oversight committee on something that's not affiliated with any police officers.'",
        "'speaker_0': 'And I think that's all I have to do. Thank you, Miss Murray. Our next figure.'",
        "'speaker_1': 'In the Casey.'",
        "'speaker_0': 'Hello. Hi there. Hi. Thank you for.'",
        "'speaker_2': 'Taking my call. I'm a resident of Alameda, and I appreciate that you're holding a special meeting to hear from students and also appreciate your responsiveness to immediately changing your public speaking order in order to prioritize students of color.'",
        "'speaker_2': 'And I just want to say that's an excellent example of the kind of quick responsiveness that the public is asking for in light of the current concerns surrounding police and policing in Alameda. So you've already shown you can do it.'",
        "'speaker_2': 'And I just encourage you to have that kind of creative mindset as we continue. I'm a local educator who works with teachers, especially other white educators, around the ways that systemic racism impacts our teaching and young people. And I've been personally moved by the efforts of local young people demanding that the city undergo critical self-reflection on its'",
        "'speaker_2': 'funding priorities and become a model for transforming the role of police and policing in our community. And I agree with past speakers that I'd like to see a community led process involving people of color, especially young people of color, to feature committees, to make recommendations from bundling police services, as well as serving on community oversight committees.'",
        "'speaker_2': 'I think that focusing on reducing police funding, specifically addressing systemic racism, since police has, as mentioned before, historically been used to uphold white supremacy and protect white and affluent community members to the detriment of communities of color, especially black communities.'",
        "'speaker_2': 'And this has been documented with Michelle Alexander's The New Jim Crow. And this apartheid system is effectively upheld by local funding. And so it's our ability to, like, think creatively and make some changes. One last change I'd like to make.'",
        "'speaker_2': 'I have a friend of mine who's a firefighter, and she told me recently a story about having to support a man who had been accused of rape but was complaining of chest pains while being questioned by police. She felt disgusted that she had to provide care for him, but that was ultimately her job to provide care.'",
        "'speaker_2': 'And I would like more people like her and mental health practitioners to be the first responders to a mental health crisis or any other violent call. These are unarmed folks with training and.'",
        "'speaker_0': 'Thank you for your comments, Mr. McAfee. Our next speaker.'",
        "'speaker_1': 'Melody Montgomery.'",
        "'speaker_0': 'Miss Montgomery. Hi. Hi. Thank you for letting me speak. I appreciate the time. I want to talk about accountability and oversight. Mayor Ashcroft, you did speak a while ago about the chief sitting down with a young group of people and how emotional he was about it.'",
        "'speaker_0': 'I understand that. But that didn't that didn't change the fact that when he looked at the case of Mr. Mallory, he looked the other way. Showing emotion to a group.'",
        "'speaker_2': 'Of.'",
        "'speaker_0': 'Children or young people is not the same as taking.'",
        "'speaker_2': 'Action for your.'",
        "'speaker_0': 'Community. Please let us not get distracted by his.'",
        "'speaker_2': 'Emotional response to one group.'",
        "'speaker_0': 'Meeting and remember that he did look the other way over the Mr. Mallory. We need better oversight. We need better accountability. We actually need to get.'",
        "'speaker_2': 'The.'",
        "'speaker_0': 'Community.'",
        "'speaker_2': 'People, the community.'",
        "'speaker_0': 'Citizens involved in this oversight committee immediately, because you guys are out there making decisions for us and we're not in the process. We're going, What did they do today? What have they decided today? Where are we today? Where are we going to be tomorrow?'",
        "'speaker_0': 'In 2022 is just too far away for us black and brown people to be scared.'",
        "'speaker_2': 'To drive across our island where we live.'",
        "'speaker_0': 'Every time I get in the car, since these meetings have started, I go off island as quick as I can because I don't want to be driving around in Alameda.'",
        "'speaker_2': 'I feel like I'm a target because.'",
        "'speaker_0': 'I've spoken out. I feel like probably a lot of.'",
        "'speaker_2': 'Black and brown people.'",
        "'speaker_0': 'Might feel.'",
        "'speaker_2': 'More uncomfortable having spoken out. And so please.'",
        "'speaker_0': 'Let's take action sooner rather than later because.'",
        "'speaker_2': 'We're still being targeted.'",
        "'speaker_0': 'Thank you. Thank you, Ms.. Montgomery. Our next speaker.'",
        "'speaker_1': 'Michelle Elson.'",
        "'speaker_0': 'Good evening, Ms.. Good evening, Mayor and Council Members, and thank so much for giving me the time to speak today. Um, I wanted to thank you for putting together what I think will be a fairly thoughtful process for how we can maybe reimagine policing in this community.'",
        "'speaker_0': 'And I urge you to kind of take a look at that from a 30,000 foot level. I think we really need to be thinking about what do we need, um, what do we want and what can we achieve?'",
        "'speaker_0': 'Um, I think, you know, it's probably fairly clear to everybody that tugging at the edges of this has not been effective in any community. Um, and that systemic change is needed. Um, and I appreciate that you all are trying to be thoughtful about doing that.'",
        "'speaker_0': 'Um, I, obviously, this is a really awful time, but I think that there's also a lot of opportunity here, um, to do something good and real and build a system that works for everyone that we can all have faith in, maybe even be proud of.'",
        "'speaker_0': 'Um, that's part of the community and it's not in some of them. Um, it's not a, a system that, you know, people will think twice about accessing. But I guess that's all I can say. So thanks for your time.'",
        "'speaker_0': 'Thank you. Next speaker.'",
        "'speaker_1': 'Our next or final live speaker is Jeanette NG.'",
        "'speaker_0': 'Good evening was saying. Good evening, Madam Mayor and council members. Thank you for taking the time to listen to us in the community. See, this past weekend, as you know, an African-American family had their car vandalized by white supremacists.'",
        "'speaker_0': 'And city hall needs to take a very public stand against.'",
        "'speaker_2': 'This.'",
        "'speaker_0': 'Incident and use it as a teaching moment for the racists that we know lived here among us. It was sickening and cowardly and a crime. I would hope that the police are investigating this because vandalism is a crime.'",
        "'speaker_0': 'And I know that people of color and that family in particular would feel less safe. I know I would if someone had done that to my car. So I hope that the police are doing something about this, and I hope that they take this as a chance to stand against racism.'",
        "'speaker_0': 'I also hope that the Citizens Oversight Board includes people of color who are specifically been hurt by racism and also people of color who specifically had negative experiences with the police. I feel like those voices need to be included in any kind of oversight board.'",
        "'speaker_0': 'Thank you. Thank you. Missing. And one more thing before we go on, though, I just want to highlight the incident, the missing reference. This did happen yesterday. It has been covered, I know, in the East Bay Times. I posted a message on the city's Facebook page on my mayor's Facebook page, which has been shared many times.'",
        "'speaker_0': 'But indeed, the city responded immediately. Police came to investigate. Three members of the city council and our assistant city manager, Mr. Bowden, were all present and witness the amazing outpouring of community support from not only neighbors, of people who happened to just be driving by, biking by, read about it on social media, who came immediately to offer'",
        "'speaker_0': 'their support. Good wishes, clean. Once the car had been in a photograph from evidence actually two cars because the family's car and the mother in law's car were both parked out front. And but members of the community, including vice mayor, was there with a rag in his hand, cleaned the cars, spoke with the the residents.'",
        "'speaker_0': 'So, yes, this case is being investigated by police. And I, I hope you'll take a look at the message that I put out and, uh, and I hope we catch the people who did it. And so we I think it's good.'",
        "'speaker_0': 'And you were saying we have one more loudspeaker. Yes, but let's have it. Doris Roberts. Good evening.'",
        "'speaker_2': 'Hi there. Hi, everybody. Number one, I'm Bobby Deutsch, and I'm a long term resident of Alameda. I'm a physician at the hospital. Number one, I appreciate the city council in a timely fashion addressing this very important issue. I think that being proactive and hear what the community has to say really shows your commitment to really doing right'",
        "'speaker_2': 'by your community. I endorse the comments that have been made, I think unanimously that we need to relook at policing nationally, of course, but including in our community. And I also endorse strongly the idea of looking at whether we do need officers with weapons to respond to many of the issues that arise on a daily basis.'",
        "'speaker_2': 'So I think the envision and how we look at policing, which which really has not done in the past, I think is a great opportunity and maybe it's a window that won't happen again. So I hope that you folks will kind of seize the moment and recognize what important time this is and think about how we can'",
        "'speaker_2': 'make our community more responsive to the needs of our citizenry and a more compassionate community. I think that serves so well. And thank you so much. One specific issue, I think I emailed it, but I guess the city council looked at whether the police departments received any military equipment under the Obama program and I guess continued by'",
        "'speaker_2': 'Trump. And I would like to make sure that your least aware, if they have military equipment and also take a look at that as well, make sure if that's necessary in our community. But again, thank you so much for this important issue that you'll be addressing.'",
        "'speaker_2': 'Thanks again.'",
        "'speaker_0': 'And Dr. Deutch, stay there for a minute, if you would. So Dr. George is a pulmonologist at Alma Mater Hospital. I've known him since I served on the board of directors there, and I'm sure he would amplify the message that I've been trying to carry about protecting ourselves from COVID 19.'",
        "'speaker_0': 'Do you have anything quickly you want to say on this topic, Dr. Deutch? It's rare for him to be speechless. But you have to ask yourself.'",
        "'speaker_2': 'Okay. Yeah. We are seeing increased cases at Alameda Hospital, Highland Hospital, Alameda Health System in the Bay Area. And I would say the things that we've done so far have been helpful and have avoided what's happened perhaps in Houston and some of the community.'",
        "'speaker_2': 'So I would say the message that you sent out repeatedly, Marilyn, is for all of us to do the right thing and remind people that the masking does protect you to some extent, but more importantly, it protects the people around you, your community, your loved ones, your family.'",
        "'speaker_2': 'And it's a reminder to everybody that we're all in this together and that if we all do the right thing, we're not going to get out of this, you know, without any damage. But perhaps we can minimize the damage to everybody.'",
        "'speaker_2': 'Please continue to not let our guard down and, you know, do this until we get vaccines and medications and we can do a better job and minimize, if not eliminate this this scourge to us. Thank you.'",
        "'speaker_0': 'Thank you so much, Dr. Deutch, for sharing that. So you heard it straight from a doctor whose life work this is. Take his good word for it and follow it. Thank you so much. Good. And do we have more live speakers or do I really transition to the written remarks?'",
        "'speaker_1': 'Now we can transition to the written remarks and we do have 19 written comments.'",
        "'speaker_0': 'Okay. And they get the same 2 minutes. All right, everyone get comfortable. Thank you.'",
        "'speaker_1': 'The first one is Molly Montgomery.'",
        "'speaker_3': 'My name is Molly and I am an Alameda resident. First of all, I want to thank you for your commitment to exploring ways to make Alameda safer for all of its residents by directing more resources towards community programs that support mental health and public safety that are alternatives to giving the police the responsibility of being our social'",
        "'speaker_3': 'safety net. I think your proposal to set up committees to gain input into this process is commendable. However, I have a few comments and questions about this proposal. First of all, while these committees are a good idea, you first need to commit to a concrete goal of reducing the police budget while investing that money into community programs'",
        "'speaker_3': '. I am concerned that this committee process will take a long time and during the mean time, black and brown elements will continue to be disproportionately affected by the current system of policing, which by its nature is targeting them.'",
        "'speaker_3': 'I urge you to commit to defunding the APD by 50% in the long term. In the short term. We need an immediate, concrete commitment of reducing the police budget by 10% at the very least, and redirecting those funds to alternatives to policing.'",
        "'speaker_3': 'Our neighbor city, San Leandro, has already committed to reducing its police budget by $1.5 million, approximately 4% of its police budget. And the city of Los Angeles has committed to redirecting $150 million, around 8% from its police budget to other services.'",
        "'speaker_3': 'As a forward thinking city. Surely we can commit to do just as much, if not more, than Los Angeles and San Leandro, considering we also have lower rates of crime. Second of all, I am glad that you are proposing that the committees you are creating highlight the voices of black residents and black youth in Alameda.'",
        "'speaker_3': 'Please make sure you are not being exclusive when using the term from Alameda. Everyone who is currently living in Alameda, no matter how long they have been living here, deserves to be considered in this process. The fact is that Alameda has grown more diverse in recent decades.'",
        "'speaker_3': 'So many of the people of color who are most impacted by policing in Alameda might not have grown up here since birth. Yet they still are.'",
        "'speaker_1': 'That it's time. The next speaker is. I'm sorry. The next comment is Marilyn grabbing a.'",
        "'speaker_3': 'Questions posed to the Alameda City Council to answer one. Mr. Watkins, May 23rd Dancing in the Street did not comply, answering officer questions. This was a law and order issue. You do not dismiss an officer by not responding to police questions.'",
        "'speaker_3': 'Mr. Watkins was arrested for physically resisting. City council members made the say race issue, which council members names wanted called for the officers to be fired upon viewing the first person on video. Now hiring of new officers to APD has been frozen by the city council.'",
        "'speaker_3': 'What qualifications does the council have to run the APD? Where do they rewrite their experience on police matters? Whom have been in drive alongs with officers to see why they put their lives on the line daily in the city and assisting other cities too.'",
        "'speaker_3': 'Why is the City Council not supporting the APD Chief of police? These officers put their lives on the line daily for this entire community, treating everyone equally. I've lived here long enough to make that statement. HIV. Can this community trust this city council to keep our city safe when they clearly exhibit no support for the APD?'",
        "'speaker_3': 'This council has deaf ears to the majority of voices. W.H.O. want independent APD run by qualified professionals independent of city council politics. ADP does not need to be defunded. What they need is not to have to respond to the mental health issue calls they receive, picking up dead animal carcasses, making teens go to school, etc..'",
        "'speaker_1': 'Next commenter Savannah Cheer.'",
        "'speaker_3': 'Good evening. Thank you for holding this special meeting tonight. While you're considering how to move forward on this critical work that needs to be done here in Alameda, I would like you to keep a few things in mind.'",
        "'speaker_3': 'First, you need to make an actual commitment to defund the Alameda Police Department. I support the ACLU. People powers demand of a 50% reduction of NYPD's budget. In order to achieve immediate accountability for the harm APD has caused our community.'",
        "'speaker_3': 'Council must definitively commit to reducing the policing footprint in our city. There are many national examples of how to move forward on this. Please take time to study the man. Reach out to other cities next. While it's great to see council members Vela and Knox White providing some framework for a process moving forward, I have some concerns'",
        "'speaker_3': 'with how these proposals came about and what the next steps will be. As you've heard or we'll hear from others tonight, the involvement of the community needs to be centered around individuals and groups that have a focus on dismantling white supremacy in Alameda.'",
        "'speaker_3': 'Moving forward, this process should center black voices and the voices of those who have experienced harm from policing. What we do not need is a convoluted process with committee upon committee that slows progress down. Excludes those most crucial to success and stalls activity, thereby deflating the energy that community has around this work.'",
        "'speaker_3': 'Lastly, every council member needs to make a commitment to not take any public safety union nor lobbyists money at this time. Alabamians cannot trust your commitment to real systemic change if you're working on behalf of a special interest.'",
        "'speaker_3': 'The only way to prove you're not is to refuse these types of contributions. Please accept that the outline that council is currently working with might need to be changed based on the feedback from the public. I would ask that each of you remain flexible and nimble moving forward.'",
        "'speaker_3': 'Your flexibility should arise naturally as you normalize being wrong and needing to unlearn past racist ideas. Our city will not be able to holistically address reducing policing and reimagining public health and safety if there are not clear, actionable goals to begin with.'",
        "'speaker_1': 'Time. Next commenter, Aaron Frazer.'",
        "'speaker_3': 'Dear City Council. I am an Alameda resident and I am pleased that the City Council is holding this meeting. This meeting is a first step in listening to your constituents overwhelming support for radically transforming the Alameda Police Department.'",
        "'speaker_3': 'Tonight, I ask you to do three things. One Pledge to return all campaign or lobbying funds received from public sector unions or stakeholders. While this process is ongoing, the citizens of Alameda are your constituents. The police union and the fire union are not constituents.'",
        "'speaker_3': 'They are special interest groups that have interests which do not always align with the citizens of Alameda specifically. I call on mayor as he Ashcraft Council member Vela and Council member Artie to make this pledge. All three of you received directly or indirectly funds from public sector unions in the last election.'",
        "'speaker_3': 'It is important that we, the citizens of Alameda, can trust that you work for us and not for the police and fire unions. That funded your campaigns too, because the city council did not take the opportunity to defund the police at the June 16th mid budget meeting.'",
        "'speaker_3': 'The best you can do now is make a commitment about what you will do in October and beyond. I urge you to commit to defunding APD by 50% in long term, more meaningfully. I urge you to instruct staff to prepare the upcoming changes to the budget to take into account a 50% reduction in the budget of APD'",
        "'speaker_3': '. Finally, with regard to the proposed measures posted by Councilmember Knox White to Facebook, I think you should clarify some things. I think we need clarity on what you mean by the phrases community interest groups and from Alameda specifically.'",
        "'speaker_3': 'I hope that the police or their proxy are a community interest group and I hope that from Alameda is not a dog whistle to the anti progressive special interest groups, but rather a poor word choice for resident in Alameda because length of residency is irrelevant to these discussions.'",
        "'speaker_3': 'We are talking about the future, not the past. And especially given the hate crime in our city at the weekend, it is important that black and brown elements have several prominent roles in the committees and book.'",
        "'speaker_1': 'Time. Next commenter initials D and.'",
        "'speaker_3': 'Dear City Council, thank you for your efforts so far in establishing a work plan as you decide on the final process tonight. I ask that you continue to make every possible effort to significantly decrease the APD budget. I support the call from others to cut the budget by 50%.'",
        "'speaker_3': 'We are asking for commitment on this as you decide on the work plan. I have some suggestions that I ask you to consider. First, please change committee one titled Unbundling Services, currently delivered by the police department to something that is more focused on reducing police budget and increasing budget for community programs.'",
        "'speaker_3': 'We need to ensure that we focus on diverting funds to the community, not just rearranging the management of different existing services. Several cities across the nation have already made commitments to divert police funding. Alameda has the opportunity to be a leader on this as well.'",
        "'speaker_3': 'Second, please be precise and rigorous in the committee selection process in a way that ensures that the steering committees are made up of a range of people committed to ending white supremacy in Alameda. For example, Councilmember Knox White's proposal names three members representing community interest groups and to representing the business community.'",
        "'speaker_3': 'The proposal overall is a great start, but I ask that we sharpen these parameters to focus on selecting members that are committed to directly addressing the various inequalities that we see in our city, especially racial inequality. Next, please empower the steering committees with true agency and truly let them steer final decisions.'",
        "'speaker_3': 'Also, please centralize the voices of black people and those most impacted by the harms of policing. This would involve going the extra distance to include those who would otherwise not be able to afford to be on a committee.'",
        "'speaker_3': 'Finally, please make a commitment to not take any public safety union nor lobbyists money at this time. This is a matter not to be influenced by monetary power. Thank you.'",
        "'speaker_1': 'Next commenter, Robert K.'",
        "'speaker_3': 'As a senior citizen and 50 year resident of Alameda, I thought it was about time to speak up. I typically don't write letters post on social media or address the city council. However, I do watch and read a great deal to stay informed.'",
        "'speaker_3': 'Lately there has been a lot of hateful and negative media written about our police. Last council meeting, for example, featured individuals that were not even members of our community and all in favor of defunding our police department. That's not the way all of us feel.'",
        "'speaker_3': 'Rather than listening to a small, angry vocal group, it's more important to get an individual sampling of how local residents feel. Take time to visit the Mastic Center and talk to people in front of one of the local grocery stores, or possibly visit individuals living in Section eight housing.'",
        "'speaker_3': 'Of course, I understand all communities evolve and revisiting their policies are a good idea. But cutting or defunding our police is something I'm not in favor of. This would disproportionately affect the low income residents as the more affluent citizens can pay for private security to patrol in their neighborhoods.'",
        "'speaker_3': 'Stop for a moment and consider who would arrive when your security alarm goes off or your child doesn't come home from school or someone has just dropped you in your garage? No one. Police are the ones who are first on the scene when there's a suicide domestic abuse call.'",
        "'speaker_3': 'Not to mention the numerous robberies and car thefts. As long as I have lived in Alameda, the police have been courteous, committed and diligent in protecting us. Now is the time to stand up and support our police. The motto in our community is Alameda stands against hate.'",
        "'speaker_3': 'And that includes the hate shown towards our wonderful police.'",
        "'speaker_1': 'Next commenter Mikayla be.'",
        "'speaker_3': 'My name is Michael Hall. I am a lifelong black resident and I am concerned about recent the direction this Council has taken on behalf of the city, me and my family living across the nation and here locally. We have heard from thousands, including advocacy groups, who are seeking equality, evaluations of police policies and for minimal police interactions'",
        "'speaker_3': 'for non-criminal offenses. I think we can all agree that this is an important and overdue conversation. And without hesitation, APD took swift self-initiated action in reviewing policies, removing officers from the schools and minimizing unnecessary contacts for non-criminal offenses.'",
        "'speaker_3': 'While this is a large topic to tackle, these actions provided the community with an initial course of action from the PD. However, through a motion put forth by this council, the same council that has sat and sympathized with protesters demanded change.'",
        "'speaker_3': 'And we have facilitated a slew of town hall meetings. APD was forced to continue business as usual, was placed on a hiring freeze and forced to give up a vital safety equipment, despite CPD's desires to initiate long term community policing.'",
        "'speaker_3': 'Last week, the city saw several violent crimes a shooting, a number of assaults with deadly weapons, kidnaping, sexual assault, a home invasion and multiple robberies just to name a few. Yet, as directed by council, APD is to continue business as usual and must do so with less staffing, less life saving and protective equipment, and must respond to'",
        "'speaker_3': 'our calls for service, including these non-criminal calls. From June 22nd, a child refusing to do chores. A tenant refusing to pay rent. A person collecting recyclables. An unknown person walking in a neighborhood by an anonymous caller. And a neighbor who threw egg shells over a fence.'",
        "'speaker_3': 'If you're okay with APD going to calls about eggshells as opposed to people being held up at gunpoint while walking down the street, that is blood on your hands and is not a reflection of the majority of residents.'",
        "'speaker_3': 'Peeps does not speak for our island. My.'",
        "'speaker_1': 'Next commenter Anna s.'",
        "'speaker_3': 'The last meeting, a fellow alum had mentioned the name Miko, the 15 year old girl who was shot in the back in Washington Park in 2008. Iko actually sat next to me in math class. Her death was senseless and an atrocity to the community.'",
        "'speaker_3': 'Thanks to Alameda Police Department's investigation, her murder and his accomplices were brought to justice. This is just one of the many incredible things are alameda police officers do on a daily basis. Alameda is population is growing and so is the crime.'",
        "'speaker_3': 'Look at the police blotter. I've personally been a victim of assault, robbery and attempt to steal my car. Our police department is extremely understaffed and overworked. No wonder they can't keep up with the crime on social media. I've never seen as much hate towards another human being as I've seen towards these cops.'",
        "'speaker_3': 'Why would anyone want to work for a community that hates you and a local government that won't have your back? How are you going to defund a department who doesn't have enough cops as it is? Who's going to protect us?'",
        "'speaker_3': 'I think it's questionable that our vice mayor, John Knox White and Councilmember Giamatti, show up for racially charged graffiti on a car, but not for a victim who was shot at this week on the island. This further proves that our city council care more about political persona than the actual well-being of all of our citizens.'",
        "'speaker_3': 'I wonder if they even know the name of the victim who was shot at. Do they even care what race they are? Where's their social media post about that? Two of our council's key priorities are to one protect core services and to support enhanced livability and quality of life.'",
        "'speaker_3': 'This Council fails to support the entire community as a whole and is pushing policies that put our families in danger. I honestly believe that more funding, more training and support of our police department is the only way to keep our community safe.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Next commenter, Amy. Dismissed.'",
        "'speaker_3': 'I am emailing to demand serious and swift reallocation of money from Almeida's budget, from the police department to community services, mental health, education, health care, homeless services. And let me be clear I'm not calling for reform, implicit bias trainings or independent investigations.'",
        "'speaker_3': 'Those tired solutions have only resulted in the continued brutalization and murder of black Americans. It is time for a different strategy, and you have the power to enact that change now. We need to defund the police and reinvest in our community, especially communities of color.'",
        "'speaker_3': 'We need to follow in Oakland school districts footsteps and cut ties between Alameda police and Alameda schools. We need mental health counselors, not police in our schools. We need more senior and low income housing, not increased police budgets.'",
        "'speaker_3': 'We need to follow in Minneapolis footsteps and pledge to defund the police. We need to show other cities and governments that Alameda cares about its citizens lives more than its police badges. It has been too long, too many black people harassed, profiled, brutalized, too many black lives lost to state sanctioned, city sanctioned violence.'",
        "'speaker_3': 'Alameda hasn't seen a black resident killed by its police force yet, but it has seen a black man arrested for dancing in front of his street. And it could so easily become the next Minneapolis. Ferguson. Louisville. What will you do to ensure it doesn't?'",
        "'speaker_3': 'What will you do to actually protect your citizens of color? Will you stand up in the face of racism, police brutality and injustice with action and change? Will you honor and fight for the black lives lost to police violence as if it were your own child?'",
        "'speaker_3': 'Husband, father? I hope so.'",
        "'speaker_1': 'Next commenter, Maria Gutierrez.'",
        "'speaker_3': 'I have been a citizen in Alameda for over 15 years now. I wanted to express my support for the police department. I have some concerns with the changes that you are proposing to make. I have always felt safe here and I believe we depend on our police department to keep all of the citizens safe.'",
        "'speaker_3': 'I feel like cutting the budget or having a hiring freeze will put the citizens in danger. We live next to a city that is always on top of the list as most dangerous or most homicides in the United States.'",
        "'speaker_3': 'I do not want Alameda to turn into Oakland. We need all of these officers to keep crime down and continue to make the citizens feel safe. The last meeting hosted by this council discussed the possibility of selling the police department's armored vehicle.'",
        "'speaker_3': 'Is this a joke? Can you explain the reason why we are thinking about getting rid of a safety tool that could potentially save lives? If you mistakenly decide to do that, I suggest you call this move the Vela NOx white move.'",
        "'speaker_3': 'So if we lose a life in the future due to not having a bulletproof vehicle, we can say we lost a life because of the Vela NOx white move. I feel sorry. We are so misrepresented in this city.'",
        "'speaker_3': 'Thank you for letting my opinion be heard.'",
        "'speaker_1': 'Next commenter is Paul Foreman.'",
        "'speaker_3': 'I strongly oppose those who call for an immediate for defunding of the police or an immediate large budget reduction. We clearly need to reallocate funding to other agencies for services that can be performed without police intervention. But until we go through the process of determining what service is to transfer the cost thereof and the funding necessary to'",
        "'speaker_3': 'provide for police response to serious crime, we cannot strip them of their current funding. To do an immediate, full or partial defunding at this time would place the entire community at risk. Council has acted prudently in temporarily freezing the hiring of new police officers until we work through the allocation process.'",
        "'speaker_0': 'And do we have more?'",
        "'speaker_1': 'Um, yes. I'm sorry. There were two mentors. April Madison.'",
        "'speaker_3': 'I am concerned that Councilmember Ortiz seems more concerned about accusing the police of being racist than he is about the conduct of the police department. The issue of systemic racism within the Alameda Police Department is the concern we are here to address.'",
        "'speaker_3': 'To be sure, there is work to do in our larger society. But the reality is that only the police department has a badge, a gun, and apparently a license to kill. Let's start.'",
        "'speaker_1': 'There. Next commenter is Tiffany Jackson.'",
        "'speaker_3': 'Hello. My name is Tiffany Jackson. And for several council meetings I have listened to teens recite lines from the latest season of Netflix's 13 Reasons Why, in some cases verbatim, as to why police officers make them feel a particular way.'",
        "'speaker_3': 'Adults who recount, embellished, inaccurate or one sided stories of something they saw online as to why APD is not needed or why they are so bad. But as a black woman, I feel nothing but respect and safety from our APD, a resident for over 35 years, I have been pulled over once, one time not for being black'",
        "'speaker_3': ', but because I was pushing 55 down McCartney. The officer was polite, unthreatening, and I even learned about his favorite baseball team. Alameda is in the heart of the bay, surrounded by San Francisco with 55,000 reported crimes last year.'",
        "'speaker_3': 'Oakland with 28,000 reports. Berkeley 6000. San Leandro 4000. Hayward 5000. And Richmond 12,000. Despite all of our surrounding city's crime rates, Alameda has been blessed with 2300 reports. This is not by luck, but because of the work our PD has put in.'",
        "'speaker_3': 'Livermore has 90,000 residents and 90 police officers with only 1800 crimes reported. They have more residents, more officers and less crime. And yet we are trying to take away the lifeline to our safety. Black lives do matter. Having a fair judicial system is absolutely necessary.'",
        "'speaker_3': 'Racism on this island is not OC, and I applauded APD for taking self-initiated steps in addressing these matters. They removed officers from schools before anyone asked, addressed policies to enhance safety on the street, and even tried to have officers respond to criminal matters to address the Karen calls and minimize non-criminal contact.'",
        "'speaker_3': 'But council told them they must must continue business as normal and even imposed a hiring freeze. Council two of you in particular. With all due respect, you have no experience in public safety and you are putting our island and the lives of people of color in jeopardy.'",
        "'speaker_3': 'Despite all.'",
        "'speaker_1': 'Next commenter is received from an anonymous text.'",
        "'speaker_2': 'Hmm.'",
        "'speaker_3': 'Hello, counsel. I have a few follow up questions and new inquiries about the way we're handling our system of policing in Alameda. One Why have you delayed a response to the list of demands written and publicized by the youth activist group in regards to Amara Watkins arrest and our path to police abolition?'",
        "'speaker_3': 'Two Mayor Ashcraft has shared her comments regarding the hate crimes that took place in Alameda recently targeting and vandalizing the only black family on their block. I understand that APD will investigate this as a hate crime. However, knowing that your police officers wear blue lives matter facemasks, how do we know that the investigation will be thorough and'",
        "'speaker_3': 'non-biased? Three. Upon revising and redistributing Alameda Police's budget. How will you ensure that you listen to black, indigenous and other people of color about where the funds are directed? How do you guarantee your city that black residents, families and youth are safe in Alameda?'",
        "'speaker_3': 'Four. Why has the City Council and Alameda Police Department not yet issued a public statement regarding the militarization and brutality present in neighboring police forces such as S.F. PD or Oakland Police Department, as they terrorize protesters, particularly black and brown protesters.'",
        "'speaker_3': 'What are you so afraid of? Your silence shows that Alameda can sense to the police officers responsible for violent injuries, sometimes deaths of protesters. I expect you all to speak out now. You represent us and you need to use your privilege for good.'",
        "'speaker_3': 'When I serve on a city council, if you choose not to care about the lives of black residents.'",
        "'speaker_1': 'Next commenter is Melissa Scott.'",
        "'speaker_3': 'Melissa Scott I am sharing a link here from the Web site showing up for racial justice or that outlines how white supremacy manifests in organizational culture. This page outlines common problematic characteristics and dynamics that emerge in particularly white led institutions, as well as constructive actions to take in order to change organizational culture.'",
        "'speaker_3': 'I call on the City Council to thoroughly read this piece and take into consideration its suggestions when making institutional reforms.'",
        "'speaker_1': 'Next commenter is Anthony Russell.'",
        "'speaker_3': 'Dear Council members, I am writing to express my support of the police and distress over recent proposals to defund and alter the current leadership structure. I understand that what you may want is a fair and just system, but I fear that the policies you are enacting are rooted in ignorance, fear and lack historical foresight.'",
        "'speaker_3': 'The national debate over defunding the police has ideological and philosophical connections to Marx, as a man, historically, has been the first step in fascist regimes. For those who think this claim is alarmist, please look up Hitler's rise to power in Nazi Germany.'",
        "'speaker_3': 'The first step the Nazi Party took was the defund the police and install a community operated platform, much similar to what this council is proposing. Secondly, what our police need is more support and funding from this council, not less.'",
        "'speaker_3': 'Our police force is already understaffed and underrepresented in this community. Serving our community takes a team skilled professionals. If the goal is to have a quality police force, then vacancies must be felt over time shortened, leave taken, and training improved.'",
        "'speaker_3': 'All of these require more funding and more candidates, not less. Please look into these issues and educate yourselves on the actual problems. I assure you it won't be a problem of too many police officers.'",
        "'speaker_1': 'Next commenter Carlos Williams.'",
        "'speaker_3': 'Morris Morales Dear Alameda City Council and Mayor. Police budgets grow because the prison industrial complex grows. As long as we have prisons, then police will feed demand for prison labor by arresting predominantly black people and also poor people because their society has attached to profit motive to jailing.'",
        "'speaker_3': 'We must decrease contact between oppressed people and police in order to make a meaningful change. Police are looking for people to arrest. They will always target the most vulnerable in our society because we measure their effectiveness and how many arrests they make.'",
        "'speaker_3': 'That metric is commonly mistaken for how many crimes they've prevented. When we say police violence is systemic. That is to say that violent targeting of oppressed people is built into the institution of policing. Body cameras will not help.'",
        "'speaker_3': 'Banning chokeholds will not help. There are many jokes and officers will learn new ones. What will help is policy that diminishes policing. And if we're going to do that, we might as well cut the budget as well. By the way, where is the police chief tonight?'",
        "'speaker_3': 'Did he get sick of us? Also, for the police dispatchers who repeatedly call in and try to trivialize this issue by individualizing the crimes of officers. This is an institutional problem. It doesn't matter if a cop is a good person because the badge turns them into an oppressor.'",
        "'speaker_0': 'Next concert be before before the next come in is ready just for the listening public that might not be aware. Police Chief Popolare has been present at this meeting since it started at 530. Thank you. And go ahead, Ms..'",
        "'speaker_0': 'Quittin.'",
        "'speaker_1': 'The next commenter is anonymous.'",
        "'speaker_3': 'If you honestly believe that defunding the police is going to make us a safer community, then we deserve what comes next. We deserve the consequences of a 50% deduction of funds to our police department. This will not make us a safer community.'",
        "'speaker_3': 'I implore everyone in this community to do a ride along with our police officers to see what a day is really like in their shoes, to see what each interaction is really like.'",
        "'speaker_1': 'Next commenter is Debra mendoza.'",
        "'speaker_3': 'Tonight, I would like to address the mayor and council. I would like the council to make an amendment to the city charter and create a citizen led oversight committee. And two members represent system impact at people appointed by the council, not the mayor.'",
        "'speaker_3': 'I am concerned that the plan presented by Vela and NOx White will have no power. We need oversight and power with accountability, not suggestions or recommendations that will not be followed ultimately. Lastly, what are you going to do with the $150,000 that was earmarked for the 4th of July parade?'",
        "'speaker_3': 'I would suggest you distribute that money to the black residents of Alameda as a beginning gesture and action towards reparations.'",
        "'speaker_1': 'Next commenter is Zack BOLLING.'",
        "'speaker_3': 'Hello, members of the council, thank you for quickly bringing this issue forward. Most of you know where I stand and my issues with the current Alameda police policy and some of the reforms I think we need to make from my past emails and discussions with many of you to speak quickly on the steering committee plan.'",
        "'speaker_3': 'I think the plan put forward by John Knox White and Malia Vella is a good starting point. One point I am concerned with is the need to give every council member a subcommittee in this plan. I understand it's structured this way to give each member a chance to contribute, given Brown Act issues, but the layering may be'",
        "'speaker_3': 'adding a bit of excess complexity. I would ask. We are on the side of moving quickly by reducing some of the complexity the five subcommittees create, given a great amount of overlap with the topics to be discussed. Thank you.'",
        "'speaker_1': 'Next commenter is Roland Wing.'",
        "'speaker_3': 'Roland Wing is being Asian a person of color. Alameda resident for over 30 years. One on June 8th, 2020. I was offended by what Vice Mayor Knox White said. I was appalled to see that body camera footage released on Friday.'",
        "'speaker_3': 'Police wasn't fully transparent about what initially happened. In my opinion, Mollie escalated the situation by not listening to the police and resisting. He was in violation of a pedestrian being in a bike lane. 21,966 CVC 21,955 PED not in a crosswalk and 21,950 bcbc ped leaving the curb too.'",
        "'speaker_3': 'I would like to keep our armored vehicle because it's a depreciating asset. If you get rid of it, the city will never make the budget to purchase one one needed. If there is a citizen hurt, I needed to be rescued.'",
        "'speaker_3': 'This would be a life saving tool for the police. It would also be invaluable for protecting our police in an active shooter situation. Three mental health cases are not arrest. It's a detainment called a 5150 when I possible up to 72 hours or longer if necessary.'",
        "'speaker_3': 'Four. How does anyone on the city council or government criticize police for their use of force protocols without the training? Until you go hands on with a resistor, I don't really think you could experience how difficult it is to arrest a resistor without using more force to overcome the resistance of a resistor.'",
        "'speaker_3': 'Governor Newsom was correct in banning the chokehold. However, he should not have taken away the carotid restraint, which is a very useful tool to be used with resistors to minimize injury to both parties, suspect and police. Five. I think the police in Alameda do an excellent professional job given the resources that they have.'",
        "'speaker_3': 'Six. I request that you do not defund the police. There are certain training requirements by the CIA. Post Police Officers Standards training. Seven. I think the police would be open to the idea of having the city assign professional social workers for mental health and homeless issues.'",
        "'speaker_3': 'Is this what unbundling services mean? If not, what does it.'",
        "'speaker_1': 'That is time. And that was our last submitted written comment.'",
        "'speaker_0': 'All right. Thank you very much for and so council and audience we have now been here to sell it ours and listen to lots of comments I'm going to call a 15 minute break and so it is almost 730.'",
        "'speaker_0': 'So I will say that we will return here at 745. So see you back here. 745 everyone. Thank you. And you probably want to mute your microphones for your and maybe close your cameras while you're away. Thank you.'",
        "'speaker_1': 'Q okay. Going live now.'",
        "'speaker_0': 'Thank you. Hello, everyone, and welcome back to this special city council meeting. This is Monday, June the 29th, 2020. And we are here to, um, uh, to continue the discussion we began in a previous special meeting about developing a work plan, including community dialog, to address a number of items.'",
        "'speaker_0': 'And we've heard from many public speakers. Um, the. I, um. So, um, I want to first suggest that counsel make a motion that we've done before when we've discussed substantive, substantive matters, which is to waive our nine minute speaking time.'",
        "'speaker_0': 'Because I think sometimes the things we need to discuss at these times cannot be contained in nine minute segments. I see. Okay. Um, counselor, I just made the motion. I see. Vice mayor, not content or piece. Um, and so then maybe we have a roll call vote, please.'",
        "'speaker_1': 'Councilmember Jason.'",
        "'speaker_0': 'Can't decide.'",
        "'speaker_2': 'Yeah. Sorry.'",
        "'speaker_0': 'Yes, I think you did. I thought you. Yes.'",
        "'speaker_1': 'Council member Vella. By Council member OTI.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Vice Mayor Knox White.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Mayor SC Ashcroft.'",
        "'speaker_0': 'Hi. Thank you. Thank you, counsel. So we will begin. And of course, we are respectful of the time and we have lots to a lot to address tonight. I am just going to start out with a few brief thoughts and I've thought a lot about this topic since the last time we met.'",
        "'speaker_0': 'This process, all of the topics that are before us tonight is about finding solutions to serious long standing issues in our community. The process should not be about further dividing our community or increasing mistrust. We need to direct all of our energies to achieving these important objectives.'",
        "'speaker_0': 'I feel that it's important to know what problems we are trying to solve, and I'd like to see a discussion of that this evening, because I believe you always need to start with the end in mind. If we don't know what the different problems are we are trying to solve or address and we won't be as successful'",
        "'speaker_0': 'in the outcomes and we want to look at the the most effective ways to accomplish our goals. There is something. There are a lot of topics and I'll I'll touch on each of them when I speak, which will be when I've listened to all of you.'",
        "'speaker_0': 'But I've thought a lot about the topic of systemic racism. That was among the topics brought to us by the Vice Mayor and Council member. Vela And systemic racism is is a topic we hear a lot, especially now.'",
        "'speaker_0': 'It's very appropriate that we're discussing this in. But what do we mean when we say systemic racism? One definition or discussion point that I saw was from Derek Johnson, who's the president of the NAACP, who defines systemic racism or structural racism or institutional racism as systems or structures that have procedures or processes that disadvantage African Americans.'",
        "'speaker_0': 'And this can include schools. It does include schools, workplaces, the court systems, police departments, housing policies, medical care, medical system and more. I believe it's extremely important to just to address systemic racism, but I think we all would also acknowledge that racism exists outside of our institutions in the community.'",
        "'speaker_0': 'And while we may not be able to, to legislate to address some, uh, racism that occurs in the community or all racism that occurs in the community, I feel that it's something that needs to be a part of the discussion.'",
        "'speaker_0': 'So I'd like you to keep that in mind, and then I'm just going to raise something that is of concern to me because I believe that this is such an important topic. These topics taken together are so important that we need the input from all five of the city council members.'",
        "'speaker_0': 'We we work as a team on this and we will do our best work if we work together. So I was somewhat taken aback when two council members, my colleagues, the Vice Mayor and council member Vela, came to us with a proposal ready made and presented it to us for a vote and the way we voted to'",
        "'speaker_0': 'to move forward. And and with this as a framework, I always like a discussion that actually is a little more organic and starts with us all starting at the same place rather than going from something that was brought to us.'",
        "'speaker_0': 'Um, I also am mindful of transparency and bringing the public along. And so, you know, an occasional statement to be included is, is probably fine. And I will always defer to the city attorney's office on this. But I was concerned or a little confused, I should say, when I heard a number of speakers refer to the vice'",
        "'speaker_0': 'mayor's proposal and the vice mayor's proposal. And I, I take notes on everything people say, at least until my iPod freezes. But it was pretty good. And there was detail that was shared about the vice mayor's proposal. And I was scratching my head metaphorically because that wasn't included in the the proposal that the vice mayor and Councilman'",
        "'speaker_0': 'Ravello brought to us at the last meeting. It certainly was in the staff report, so it wasn't out there for the public. What I did realize when I did a little searching on our break is that it was opposed.'",
        "'speaker_0': 'From the vice mayor's Facebook page, I think maybe on Saturday of this or maybe even yesterday or on the weekend, and it's a rather detailed outline. I was seeing it for the first time, and I would imagine there's a lot of people that haven't seen it.'",
        "'speaker_0': 'And I'm just concerned because I really envision this as an opportunity for all of us to sit down, to listen to staff and some suggestions they have, because after all, it is staff who's going to do a lot of this work, but we're going to direct them.'",
        "'speaker_0': 'And I was anticipating that we were all coming at this. Starting fresh today. I know we've all been thinking about these topics since we last met, but I I'm just I'm concerned. I'm a little thrown off. And I, I would have preferred that say the proposals the suggested for part of this staff report or an attachment that'",
        "'speaker_0': 'we could all be on the same page. Um, and, you know, I've referenced your, um, your proposal, which unfortunately I'm reading on my little bitty phone screen and I'm, I'm having a hard time enlarging it enough to really get a sense of it.'",
        "'speaker_0': 'But, um. Vice Mayor, help me out here. How can we how can we, how can we, um, how can we have a full and, um, participatory discussion?'",
        "'speaker_2': 'Sure. So, you know, it was not my intent to, uh, to drop this and say, I want you to support this. But I, you know, as you know, I like to get a lot of community input on things.'",
        "'speaker_2': 'So, uh, working along with Councilmember Vela as a, as a partner, we started thinking about what would one way for us to go forward look like, what would be important in that? How would we design it? How would make sure that it was, you know, kind of fair, that it centered black voices, that it centered youth voices'",
        "'speaker_2': ', that it really brought to the table people and members of our community who are not often led. And so yeah, I posted it on Facebook and ask people for their feedback. Um, I didn't encourage. No, I'm sorry if I could.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'I was going to ask if you could share it with us so we could be looking at it in real terms.'",
        "'speaker_2': 'Like to send it to the council. The city clerk has a copy of it. I did send it because at some point after we had all had a chance to speak, I was going to say, Hey, I've been thinking about this and here is one way we can go forward for consideration.'",
        "'speaker_2': 'The reason you haven't seen it is because I wanted to make sure that there was space for everybody to have their say before we started diving into something that has bullet points, etc. So while it's true I was way I probably should have, but I wasn't expecting people to say I support a specific proposal.'",
        "'speaker_2': 'What I would say is I think that, you know, try to find something that outlined what the way I think would be a way for us to consider going. If you'd like, I'd be happy to talk about actually my thoughts instead of defending why I thought engaging the community before the meeting was a worthwhile thing.'",
        "'speaker_0': 'So I want to hear your thoughts first, Mayor. And I also believe in engaging the community. My concern is simply that it's a limited community, although maybe you shared it other than with people who might follow you on Facebook.'",
        "'speaker_0': 'But I want to have I want to have a full and robust discussion. And I want to hear yours and Councilmember Vella's thoughts. But I also want to hear my other colleagues and also from from staff. This is going to definitely be a team effort.'",
        "'speaker_0': 'That's okay. So should we wait a moment until or maybe has it been sent to us?'",
        "'speaker_2': 'I see it in the email now, which is popped up on my screen.'",
        "'speaker_0': 'Okay. Um, as the council member already has his hand up.'",
        "'speaker_2': 'Next question, Madam Mayor, since I think you suggested this, it might be wise to first, in my opinion, to hear your thoughts before we get into a specific plan of action. Because when I glanced at that proposal and it has a couple of things I wanted to chat about it, I really haven't thought about it in depth'",
        "'speaker_2': '. So yeah, that was that was that was my idea actually, that we would not talk about a specific proposal, but actually I'll talk about what our, what we had to say.'",
        "'speaker_0': 'Okay. Hi. Um, that sounds good. So, um. So shall we start with you? Councilmember Odie.'",
        "'speaker_2': 'Oh, okay. Sure. So I thank you. I appreciate your comments of of being includes what's the word inclusionary for all of our council members. And I think I mean some of this may be. Repetitive to folks. But no, our job as the city council, as the elected representatives of our 80,000 residents, give or take, is to set'",
        "'speaker_2': 'policy. You know, our city manager's job is to take that policy direction and implemented. And those who work for him, you know, report up to him. So if I can just ask staff a couple of questions before I get into my comments.'",
        "'speaker_2': 'So there was an allegation that, uh, uh, our officers were wearing blue lives matter face masks. Is that true? Can somebody answer that?'",
        "'speaker_0': 'Who wants to take that that question? Just go ahead and unmute yourself. Uh. I see. City Manager Levitt.'",
        "'speaker_2': 'Sure. I'll answer it. Although I can't answer it. Well, I'm not aware of it, but I was going to check on that tomorrow. At this point, the chief might have better information on it. I heard it for the first time tonight as well as you did.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'As I did. I, um.'",
        "'speaker_2': 'And I guess I'm sorry if that's true. Do you really think that that's conducive to us all coming together and working together? Because we heard pretty divergent views today. Maybe. Mr. City Manager. I do. I understand how some people have taken that.'",
        "'speaker_2': 'And so that's why it's going to look into it tomorrow. And then there was a lot of talk that a lot of commentary in the public comment about the fate of the officers involved with Mr. Watkins. I mean, can you kind of update us on what you can say and what you can't say and what we can'",
        "'speaker_2': 'say and what we can't say? And, you know, if if hypothetically, we told you today we wanted you to fire these guys. That's against the charter, right? I mean, we can't do that.'",
        "'speaker_0': 'And so you're this is a question either for I am you know, whichever of these two city managers would like to answer, please do that. Or the city attorney for the sake of the audience listening. And I appreciate that, um, Councilmember Rudy is going back on some of these points that were raised because as I stated earlier'",
        "'speaker_0': ', public comment is just that it is not question and answer and I did on a couple of occasions clarify something in real time, but I see the city attorney unmuted. So, um. Mr. Chan, please.'",
        "'speaker_2': 'Yes, Madam Mayor. Members of the Council, I'm happy to clarify for the members of the public. The first question Councilmember City inquired about was could council members ask the city manager or the police chief to take any kind of disciplinary or terminating action against any of the officers?'",
        "'speaker_2': 'No, that would be a violation of the charter. Councilmember Ody also asked what, if any, information could be made public and very, very little state law makes clear that any information related to an investigation of a police officer are considered confidential peace officer files.'",
        "'speaker_2': 'And so therefore, the city could not invite, for example, public participation in the interview and office of the Officer, or allow the public to review any investigators findings or conclusions about the officer. And the city could confirm the employment status of the officer when asked.'",
        "'speaker_2': 'So, for example, the city could say, officer, you know, Joe is employed with the city of Alameda or as a state officer Joe is not. The amount of information that could be shared is quite limited.'",
        "'speaker_0': 'Okay, Mr. Shinn.'",
        "'speaker_2': 'And then correct me if I'm wrong, because I read our our contract with our our police union that's not contained in the state law. The police officer civil rights, not in our our our contract. That's right. That is covered by state law, but the council does not.'",
        "'speaker_2': 'The confidentiality provisions are all covered by state law. So the council would not have the ability to either adopt ordinances or contracts to change those confidentiality provisions. Okay. So I just want to make clear that, you know, there's a lot of people that are asking, you know, as to make statements this way or that way and, you'",
        "'speaker_2': 'know, call for this this type of action or other type of action. And, you know, we're not doing it because we're being idle or being incompetent or we're being ignorant of the public's outcry. We're doing it because this is what the state law guarantees for these officers, whether you agree with it or not, you know, that's up'",
        "'speaker_2': 'to you to talk to your state representatives about. And as far as the investigation process is going, I mean, there's a limited amount of things that we could say, except that there's one that is going to be initiated or is initiated or whatever, whatever stage it is in.'",
        "'speaker_2': 'So I want people to just you know, they're now kind of transitioned to my my thoughts. I mean, this is like coming up on six years here and. I don't think I've had an issue that has been so emotional and so raw, and there's just such a dichotomy of viewpoints on one side or the other.'",
        "'speaker_2': 'Ranch was kind of that way, but I don't remember it being this vitriolic and some of the words that are being used. And, you know, I'm used to being called a lot of stuff. You know, we we kind of let it roll off our backs.'",
        "'speaker_2': 'But, you know, I think we've been called, um, you know, insensitive, racist, reactionary, too slow, corrupt, um, you know, complicit, you know, all, you know, a wide gamut of things and you know, the cannot be true. Um, but what was missing from the conversation, which was disappointing to me, was, except for maybe a few people, I think'",
        "'speaker_2': '. Mr. Sondland and, you know, maybe Mr. Forman kind of had a little more of a moderating, um, comments, but, you know, it was either an, either or. And, you know, policymaking is not an either or. And you know, I the first to admit, you know, I have never walked in the shoes of a African American teenager who'",
        "'speaker_2': ', you know, was walking to his car or walking to school and, you know, worries or his mother worries whether he's going to come home alive that night. You know, one of my first experiences here in Alameda when I got involved with the Democratic side is Tony.'",
        "'speaker_2': 'You remember Wilbert Wilbert Crane. You know, he was one of the officers and he was an FBI agent, lived on the West End. And, you know, I drove him home one day and he just talked to me about how he'd even get routinely stopped from the police walking from his car parked on the street in his apartment'",
        "'speaker_2': 'building. And this is an FBI agent. So, you know, I don't know if that makes him any special or any any better than anyone else. But, you know, there seemed to be 20 years ago, law enforcement didn't even know who other law enforcement was living in their town.'",
        "'speaker_2': 'So. And, you know, I'll I'll never know the experience of, you know, a Central American immigrant that has a tail light out and, you know, worries about getting pulled over and, you know, could be deported because their tail light is burned out.'",
        "'speaker_2': 'You know, I do know what it's like to walk down the street with the person you love and worry about getting your head bashed in. But, you know, I don't think that that's, um, anywhere near what what some of our young African-American youth, um, experience.'",
        "'speaker_2': 'But, you know, there is somebody who I think is that has known those experiences and that and experiences of being an elected official. And she was actually one of my new heroes since she was elected mayor of Chicago.'",
        "'speaker_2': 'And that's Lori Lightfoot, woman of color, progressive LGBT community member. And, you know, she basically said last week, and I know the mayor quoted somebody, so I'm going and I'll quote somebody, um, she says, Defund the police. It's a nice hashtag, but it ignores how reform works and it hurts the diversity of the force.'",
        "'speaker_2': 'And, you know, I'm not going to make policy by hashtag. You know, I'm just not going to do that. And, you know, whether it's, you know, defund the police or abolish the police or, you know, cut 50% or, you know, any of this stuff, you know, it's just it's just not the best way to make policy.'",
        "'speaker_2': 'Know it sounds good when you write about it, you know, but you know, it is it's not it's not going to work. And then, you know, Mayor Lightfoot went on and she talked about how if you literally defund the police, it puts the newer recruits the city needs at risk because they lack seniority.'",
        "'speaker_2': 'So what you have is the most young, the most diverse, the most well trained officers. No offense to those in our force who have been here many years, but I think you'll agree, if you look at the hiring, that we have done a good job or at least a better job than we have in the past of'",
        "'speaker_2': 'of adding diversity. And, you know, with that diversity comes better training. And then you lose that if you just say a 2% cut or whatever. But she did say and this is what I completely agree with, the status quo has failed.'",
        "'speaker_2': 'So, um, you know, that's not an indictment. That's not to say that every single police officer in the country is a racist. That's not to say that every police officer in Alameda is is a racist. I have not met one, but I know other people in town have had experiences.'",
        "'speaker_2': 'Like I said, I can't live with I mean, I can't understand or walk in their shoes. But I think we have to be cognizant of that. And then, you know, Mayor likes it also talked about, um, um. You know, you can't just snap your fingers and make these changes.'",
        "'speaker_2': 'She says. And this is what I think we need to do here. And the vice mayor's idea and others, I think, are going to help with that. We're talking about building authentic, authentic, lasting relationships. And in some instances you're starting to see some partnership.'",
        "'speaker_2': 'In some other instances, you're starting with nothing. That's hard work, but it's necessary work, and we've got to take that time that is necessary to build those relationships. So to me, what that means is everyone that spoke today and everyone else and this council, we have to put in the time and the hard work to kind of'",
        "'speaker_2': 'build partnerships. And you start, in my opinion, doing that with having a little empathy and trying to understand, you know, what it's like to be in the other person's shoes. That's why Keesha invited me to sit in on this batch and, you know, to see that people are calling the police because their kids are doing their chores'",
        "'speaker_2': '. And I think there's a there's a numbers on that. And to hear, you know, that it's, you know, there's an animal problem or eggshells. And, you know, it's just we've asked a lot of our police departments. So the onus is on changing.'",
        "'speaker_2': 'It has to be on us. So I do want to talk a little bit. So I think that empathy is important. And, you know, people may look at us council members and say, oh, you know, their elected officials, they're really not people.'",
        "'speaker_2': 'They're like names on a wall or their pictures on a wall. They're people that sit on the dais. But you know what? You know, we're everyday human beings. You know, I see the mayor walking with her husband, you know, every couple of days around the neighborhood.'",
        "'speaker_2': 'I see the vice mayor riding his bike. You know, I see Councilmember Bella with her baby going around town. You know, I see Councilmember Desai sitting out of the of the maybe not now, but before at the farmer's market in front of his house.'",
        "'speaker_2': 'And people think we have no emotion, but it's not true. You know, we're real people. And the same goes for, you know, just because somebody puts on a blue uniform and wears a badge that doesn't make them a robot.'",
        "'speaker_2': 'It doesn't make them a totally unfeeling human being. You know, we have, you know, officers that are are very diverse. I mean, when I was with Keisha, she showed me the list of the names. You know, there's names on there that, you know, are not your basic white American names.'",
        "'speaker_2': 'So and, you know, we have they have families who are interracial families. And I think we have to put ourselves in those shoes before we start hating on them. Are there bad cops in the country? Yes, other racist cops in the country, yes.'",
        "'speaker_2': 'But you know, does that mean we have to paint a broad brush on every single police officer that works in the city of Alameda? I don't think so. And does that mean we have to paint a broad brush on every single councilmember that, you know, work hard every day to make sure we we keep Alameda a great'",
        "'speaker_2': 'place to live? I don't think so. But, you know, on the flip side, you know, our officers, I think, need to do a better job of of empathizing with what it means to be a young African-American child. You know what it means to see when you've been traumatized by police, you know?'",
        "'speaker_2': 'But she talked about his seven year old experience. You know, if that had happened two or three times and that individual child, whether it's received or someone else, sees a police officer in their school every day in school uniform, you know, that's trauma and that's terror to them.'",
        "'speaker_2': 'And we have to understand that and we have to empathize with that. And, you know, that's why I think it's important that we when we think about community policing and we think about cops in schools, you know, that that we we think about, you know, that person's frame of reference.'",
        "'speaker_2': 'So cross empathy, I think, is super important. And that has to.'",
        "'speaker_0': 'Be.'",
        "'speaker_2': 'In my opinion, a willingness to change. So, I mean, if you're responding to a call with a Blue Lives Matter mask and it's a it's a hate crime where somebody put a alarm on African-American person's car, that to me does not indicate that there's a willingness to change culture.'",
        "'speaker_2': 'You know, some of the emails I got today from employees of the city that were criticizing the council took in your pocket, take any criticism. But what it showed me was there's a culture that's resistant, and I know that everyone is is that way, because I've talked to a few police officers.'",
        "'speaker_2': 'I met with many of them last Thursday when I spent the morning there. And they want to be part of the solution. They don't want to be painted with the broad brush. They want to be at the table.'",
        "'speaker_2': 'They want to be proud of their department. They want to be proud of their city, and they want to be proud to wear the badge and they want their city to be proud of them. So I just want to, you know, two last things before I give get off my soapbox.'",
        "'speaker_2': 'You know, it's just ironic that there's. So people that want to talk about race and how ugly it is and it is, but then they use the word Karen calls. And, you know, a lot of women don't like that.'",
        "'speaker_2': 'It's misogynistic. So I think we need to be careful about the words we choose. And if you want to say a fragile white person, be my guest. Go ahead. But you need to understand that, you know, Karen is offensive to a lot of women.'",
        "'speaker_2': 'And I think we need to worry about that lasting, you know, systemic. This is why I brought this up, because there's a lot of systemic race issues in this country, in this city. You know, look at our schools.'",
        "'speaker_2': 'My kids were at Bay Farm. We raised $64,000 for the PTA. But yet Peyton, you know, barely scratched 10% of that. And nobody on the Bay Farm side wanted to share their PTA money with those people. And Peyton and I'm not on the school board.'",
        "'speaker_2': 'I'm on the PTA. But something seems wrong there. You know, we have new schools on one side of town, and we had crumbling schools years ago. On the other side of town. You know, we have constant battles over taking care of homeless and ballot initiatives to fight, helping out the homeless.'",
        "'speaker_2': 'And the battle cry that we hear is, well, we don't want homeless people from Oakland coming into Alameda. Well, sorry, stopped with a dog whistle. We all know what that means. Okay. So these are this is an ingrained city thing that these attitudes need to change.'",
        "'speaker_2': 'You know, we have zoning issues. Now. We're going to have this discussion next week. I'm not going to talk too much about it, but we have something in our charter, whether it had a racial intent or not. It sure as hell has a racial impact.'",
        "'speaker_2': 'And, you know, those are things like statues of Robert de Lee that need to start coming down. We had restrictive covenants. You know, I bought a house with my spouse here in Alameda. We couldn't have done that in France like 50 years ago because he's Asian.'",
        "'speaker_2': 'Mr. Chen is here. He couldn't have bought a house here in Alameda 50 years ago. And for inside that, there's still people that think that way. You know, we have other departments that, you know, I don't think there's racism there.'",
        "'speaker_2': 'But let's look at public works. Let's look at parks. You know, we have a transportation system that values wealthy people driving cars and not public transit. That helps those that can't afford cars to get to and from their jobs, which we make them cheap during the pandemic and don't even want to give them protection.'",
        "'speaker_2': 'And then I you even get into it because it's not our jurisdiction, but the entire criminal justice system outside the police department. You know, we wouldn't even get into that because we all know that that needs a lot of reform.'",
        "'speaker_2': 'So I think I've said enough. Yeah. Thanks.'",
        "'speaker_0': 'Thank you. Councilmember Odie, who would like to go next. Um. Okay. Councilmember Desai, I. She is being forward.'",
        "'speaker_2': 'Yeah, sure. I'd be happy to. Um. Well, thank you very much.'",
        "'speaker_0': 'Person. See any other hands up? That's first and.'",
        "'speaker_2': 'Foremost. Just want to say thank you very much to all the residents who had emailed us and participated in this evening's, um, uh, meeting, uh, directly or also indirectly through emailing our city clerk. Um, I think this is an indication that, you know, of democracy clearly at work.'",
        "'speaker_2': 'Um, I just want to, uh, start off by talking further about the experiences that I have had with the Alameda Police Force. I think the last time we met, I spoke about having grown up and, and having known as a youth of a, of the police forces, at least individual members involvement in in various parts of of'",
        "'speaker_2': 'of Alameda, whether as coaches of the football team, the Porter team or me directly. Having met officer bonded on the way back in 1984 when he was a member not only of the police department but also a member of the Veterans American Legion.'",
        "'speaker_2': 'Of course, unfortunately, the officer bonded on a passed away many years ago. Um, but I think more than the, my experience of growing up with the Alameda police force and getting to know them and be involved with them through different strands of our of our community as a youth, first and foremost, the police department is here because'",
        "'speaker_2': 'they serve they serve the residents. You know, we remember that old line on Adam 12 on on the car. To protect and to serve. And so let me tell you a story about March 2016 when I was on city council at that time in March of 2016.'",
        "'speaker_2': 'On a Wednesday night, I went over to my significant other, Carrie. She, by the way, provides all the flowers you see behind me. So I went to Carrie's place on Wednesday night because I need to move her car because Thursday is a street cleaning day and she was away in Arizona.'",
        "'speaker_2': 'And so this was on a Wednesday night. I go into her house over there on the in the Broadway area. And as I go there, I enter in the house. One of the things I notice is why are all the drawers open in the kitchen?'",
        "'speaker_2': 'And I'm going because she's not around open drawers and no one's around open drawers. And I'm looking further around in the first floor and I'm and I'm realizing, oh, my goodness, there was a break in. It had just occurred.'",
        "'speaker_2': 'And I call Carrie and say, you know, I think there was a break in. And then I go ahead and call the police department. And as I'm calling the Alameda Police Department, I could have sworn I kind of heard something upstairs.'",
        "'speaker_2': 'At which point, you know, I left the house, the front door, as I was leaving the house from the front door. So there were already two separate police cars there, one on one end coming in from one end of Broadway and the other one coming on the other.'",
        "'speaker_2': 'And as I was, you know, kind of told the situation and by the way, I didn't tell people, oh, I'm Tony Harris or city council member. I don't think they knew. I don't think they cared, although I believe I saw off as America there.'",
        "'speaker_2': 'So. So she might have known me. Um, but the thing that I. That I was impressed by was, you know, within minutes of standing outside, you know, policemen suddenly lined up and they went into the house with their guns drawn and they went in.'",
        "'speaker_2': 'And a group, you know, I don't know what the technique of police is, but I was kind of amazed the fact that, you know, on a moment's notice, these men and women, they put their lives at risk in order to protect and serve all of us.'",
        "'speaker_2': 'And I will never forget that. I will never forget how on a moment's notice those guys just went and they didn't ask, you know, should we wait? You know, they went in and apparently the there was a someone who did go in.'",
        "'speaker_2': 'And our thinking was that when I was in the house that indeed the person was upstairs because lo and behold, upstairs we found a cash, a wad of cash on the floor, which meant that, you know, he heard someone.'",
        "'speaker_2': 'A man. And then so he screamed whoever that was. So I just want to recount that story with regard to my personal interaction with our police force in a time of emergency and crisis. And I think it's not because, you know, as a council member at the time March 2016, I don't think they knew me, but they'",
        "'speaker_2': 'just go in there and they put their lives on the line. Now we can recount these stories of heroism by the men and women in blue. But as, uh, Rasheed Shabazz had earlier said, that we also have to face up to what had happened in the past.'",
        "'speaker_2': 'So when I look at reforming the police, you know, I see this as an opportunity to institutionalize new ways of doing things in light of what happened in 1991, but as well as what happened in just recently in May 23rd.'",
        "'speaker_2': 'And and so I look forward to this conversation of improving our Alameda police force. And it is my opinion that in improving the way in which we deliver our service, it is my opinion that there is that there is no need to to frame this discussion in a rhetoric from which there is no you know, there is'",
        "'speaker_2': 'no reconciliation. There is no middle ground. Um, when I look at the Alameda police force know, I look at people who are going to put their lives on the line for you at a time of emergency. And you also look at a police force that has always been there as a vital part of our social fabric, whether'",
        "'speaker_2': 'it has coaches of a Pop Warner football team or coaches of the baseball teams or or persons who are there as a member of the whether they're members of Rotary Clubs or members of the American Legion. So that is the lens with which I see the police force.'",
        "'speaker_2': 'But that doesn't stop me from from from realizing that, yes, we should seize this opportunity to improve our police force here in Alameda. So let me talk about the ways that I want to change the police force. But when I talk about the ways that I want to change the police force, also, let me be clear to'",
        "'speaker_2': 'the residents of Alameda about. What I am for and what I am not for. So in terms of the latter, I clearly I am not in favor of a 50% defunding of the police department. Earlier, I had indicated that I wasn't in favor of 40% defunding of the police department.'",
        "'speaker_2': 'So and my sense is that this is a city council that won't defund the police department by 50%. But that is not to say, though, that this is a city council that won't look at ways to generate some efficiencies, to provide the new level and types of services that we think is needed.'",
        "'speaker_2': 'So that's what I'm not in favor of. I'm not in favor of defunding the police by 50%. Let me also talk about one other thing that I'm not in favor of. And this might not be a popular position because as I counted, I think 97% of the vote of the persons who spoke on the subject matters that'",
        "'speaker_2': 'do away with the armored vehicle. Well, you know, I.'",
        "'speaker_0': 'I asked.'",
        "'speaker_2': 'The city clerk if she can show some pictures of the armor of our armored vehicle. If we can just if you can indulge me just for 10 seconds, if we can look at those pictures, that'd be great. Is a.'",
        "'speaker_0': 'City clerk able to put that on.'",
        "'speaker_2': 'Right now? I think there are two or three. Okay, great.'",
        "'speaker_1': 'So we'll share the screen.'",
        "'speaker_2': 'All right. This is the inside of the armored vehicle. It almost looks like Kari's Honda SUV, a Honda van. So another picture. And one more.'",
        "'speaker_0': 'Are we seeing different pictures? It just looks like the inside console.'",
        "'speaker_2': 'Yeah, this is the inside console. Um, and if there's another picture, I think there's two more. Is the other one up? I don't see. Oh, here we go. Oops. This is the armor. And this is the inside of.'",
        "'speaker_2': 'So it's basically kind of the seats that you see inside the armored vehicle. This is another one. Great. So you can kind of see how it looks like. So it's basically a transport material vehicle and this is the armored vehicle from the outside.'",
        "'speaker_2': 'So I think we all agree it's certainly not a tank, but to me it seems like it could provide a useful service in time of an emergency. So I would encourage my colleagues on the city council to reconsider doing away with this armored vehicle, because I think the chief of police is right.'",
        "'speaker_2': 'Or even the even the Officer Horvath is right. Is that in times of emergency, this is a type of civilian vehicle that you might need. Okay, that's enough about the armored vehicle. I know that's not a popular position because I do agree with all of you that that we need to not militarize our police and that that'",
        "'speaker_2': 'does appear to be a national trend to militarized the police. Because when you look at the police as a military or paramilitary force, the lens with which they do their job is looking at this basically shoot to kill.'",
        "'speaker_2': 'And that's not the lens with which we want our police to operate. The lens which we want our police to operate is as a civilian force whose job is to protect and to serve. Okay. So let me talk about what I am for.'",
        "'speaker_2': 'So let me close by talking. There are three things that I like that's on the staff report. I certainly like unbundling services currently delivered by the police force. My only problem with that is it's a little too amorphous in my opinion.'",
        "'speaker_2': 'I think we should just be more direct and say something like, you know, going after some kind of service, sort of like the cahoots that mayor, as he Ashcroft had, I believe, is in Eugene, Oregon. The summary, if you look at on the website, say cahoots.'",
        "'speaker_2': 'Eugene, Oregon, is just that seems to be the answer that we're all looking for in terms of changing the way in which our police force might deal with mental health issues. And so and budget budget wise, it seems as though we can scale it to the size of the city of Alameda and it seems like something can'",
        "'speaker_2': 'work. The second thing I do want to work on is systemic racism, but I want to come back to number two in the staff report. Systemic racism stands as an isolated item. But to me, in and of itself, it's like, you know, systemic racism, whatever.'",
        "'speaker_2': 'I took classes with Professor Litvack and all the other professors at Cal about race relations. So systematic. No, no. I think the power of dealing with the systemic racism occurs when we we now see that with item number four, police department accountability and oversight.'",
        "'speaker_2': 'So I am of the opinion that if we are going to pursue a police commission or police advisory board, that we need to be upfront and say one of the reasons why we're creating this is because we want to deal with longstanding issues of race that had been a part of our police force.'",
        "'speaker_2': 'For example, looking back in 1991, whether a May 23rd is as part of that longstanding history. It is nonetheless, an issue that that that that that forces us to take action along with what's been going on in Minneapolis recently.'",
        "'speaker_2': 'But but it has always been going on across the United States. So I would want to marry systemic racism along with police accountability and oversight. Again, in my particular take on this is to have a commission or advisory board or whatever.'",
        "'speaker_2': 'I'm open to hearing what Vice Mayor Knox White and Councilmember Vella have to say, but making sure that that they understand that there is an intentional lens with regard to dealing with issues of race. But what does that mean in terms of practice and programs?'",
        "'speaker_2': 'Well, I don't know. Maybe it means that you strengthen our policies and our manual with regard to training, with regard to racial profiling. I mean, so that might be one particular task that would come out of a police commission with an intentional lens of looking at systemic racism and solving that within our institution.'",
        "'speaker_2': 'And the third item that I do want to look at is reviewing police department policies and practices. You know, my my I raised two things previously, and I will continue to push them. One is looking at how we deal with crowd control issues, largely because that's what I'm hearing from Facebook, from people who are communicating with me'",
        "'speaker_2': 'saying tear gas. You know, the thing that I think going on in Oakland is awful and and we need to understand. You know, how are we going to be involved in those kinds of crowd control situations? And what are our policies with regard to use of peer groups or any other kind of.'",
        "'speaker_2': 'Things like rubber bullets, etc.. So, um, so I certainly would want to move forward on reviewing police policies and practices with regard to crowd control situations. Part of that is also looking at training with regard to racial profiling, etc..'",
        "'speaker_2': 'So those are the three things that that that, you know, I want to move forward on concretely when I look at the staff report. Um, uh, I see this whole issue about criminalizing survival. I get that. Um, but I think someone clearly said earlier that, that, you know, that a lot of that is addressed at the state'",
        "'speaker_2': 'level. Okay. So let me just conclude by saying, you know, I want to thank everybody who have taken part. And the reality is that as a council member and I'm speaking just for myself, we can't we have to try our best to speak the truth as we see it.'",
        "'speaker_2': 'And sometimes, you know, that might not coincide with with the way that you see the world. But my responsibility to you is as best as possible to articulate what's on my mind and what I think are the best policies for the city of Alameda going forward.'",
        "'speaker_2': 'And I'm in a unique position in that, you know, I happen to have grown up in the city of Alameda. And as a result, you know, I've been able to see this our police force with a certain lens on that that maybe others don't, you know, maybe others are just so affected by and rightfully so affected by'",
        "'speaker_2': 'what's been going on nationally, whether it was the George Floyd issue or maybe all the other issues that that had occurred. But and I respect that. But the lens with which I approach this issue is the history that I've had with our police force and our individuals there who had been a vital part of our social fabric'",
        "'speaker_2': 'and the particular crises in which they responded in such a heroic fashion. And so I hear what you're saying, and I hope that we as a community can move forward around concrete issues that have been put forward. And and I think this is at the end of the day, we're going to come out the better for it'",
        "'speaker_2': '. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember de side for your remarks. Okay. Who wants to go next? Councilmember Val, I see your handout. Until I feel so. You know, I want to just start with kind of addressing the process of speakers. Essentially what we did, in my opinion, was allowed white or non people of color speakers to essentially center themselves in'",
        "'speaker_0': 'that space by basically saying, you know, I'm going to go ahead and cede my time. And I just which actually ended up taking, I think, more time. So I just in the future, I feel like if we could if we if we want to move forward by saying, you know, we're going to give a particular space or'",
        "'speaker_0': 'priority to a certain group, I think.'",
        "'speaker_2': 'It's.'",
        "'speaker_0': 'Just clear the hands down and reset. And I don't think it'll take that much time to do that. And then it's not about each person kind of waving the flag of, hey, look, I'm going to go ahead and cede my time.'",
        "'speaker_0': 'The second thing is, you know, the the I guess this is perhaps a conversation for another time, but the the robotic voices are really hard to follow. And and I guess I also want to understand the and that's just what the inflections are.'",
        "'speaker_0': 'And what's getting highlighted is sometimes disconcerting. And anyways, I want to put that out there. I also am curious about how how speakers get lined up into that, because some of them seem to be emails from like earlier in the afternoon and then some of them seem to be from 530 or on.'",
        "'speaker_0': 'It just seems odd to me. And then we had some anonymous text messages that were like seemed to be a continuation of speakers and getting around the time limit as like additional thoughts. So I just anyways, I feel like we need to kind of figure out what that process looks like a little more and perhaps even go'",
        "'speaker_0': 'back to having somebody read the, the emails because it's just, I don't know if it's just me, but it's, it's very, it's, it's hard to follow for a long period of time when we have a lot of those.'",
        "'speaker_0': 'I. You know, I want to talk about and I'm glad we've heard from a number of different members of our community. We certainly gotten a lot of emails and.'",
        "'speaker_2': 'Phone.'",
        "'speaker_0': 'Calls messages, but I'm still trying to reply to everybody. I and I'm glad to hear some members of our community and talk about how safe and secure they feel in Alameda. I think it's my goal and the goal of my fellow council members to make sure that that's the experience of everybody in Alameda and not something that'",
        "'speaker_0': 'occurs at the fact that some members of our community feel safe and secure at the expense of others feeling that way. And so, you know, I want to acknowledge that. And I think it's really important that we hear people when they say they do not feel safe and secure.'",
        "'speaker_0': 'They do not feel comfortable that they feel unsafe moving around in our community. I think that that is something that we all need to take heed of, listen to process and find a way to respond to. Because I think we can have both.'",
        "'speaker_0': 'We can move towards a community that really provides safety and security for all. And I know that those are loaded words. We've heard about Secure Communities. That's loaded in a way that I certainly am not aiming towards. But I think part of redefining how our community services are structured is about redefining what those words mean and making'",
        "'speaker_0': 'sure that there is space for everybody in our community, regardless of race, gender, creed, ethnicity, you know, status, to feel those things. And I think, you know. Yes. Our police or residents are our every city department serves residents.'",
        "'speaker_0': 'None of our departments are independent, autonomous wings of government. We are all accountable. I like to think I have 80,000 plus bosses. We all do because we represent the community and we are not. We don't represent districts. We don't represent segments of the community.'",
        "'speaker_0': 'We represent the entire community. And so when there are people that say that they don't feel like they are being served, you know, that concerns me. And I want to think about how we can improve that. And I think that that's a value and a virtue that's shared by my colleagues.'",
        "'speaker_0': 'You know, we can hear anecdotes about good responses. What I know is that when you have a bad response, the trauma from that is life changing. I'm going to share an anecdote, not because I think that it's part of data or anything like that, and it's not a mark on our department, but I think it's reflective of'",
        "'speaker_0': 'kind of a bigger thing that that we we need to keep in mind. I am a woman of color. I serve on city council. I was heavily pregnant when several members of APD were called to my house and banged on my door in the middle of the night trying to come in for a mental health call.'",
        "'speaker_0': 'And they were ready to go. My concern is and they were ready to to come inside. They had been called by somebody who was a criminal stalker, who was literally trying to force out somebody that they had been stalking.'",
        "'speaker_0': 'It was a woman who called in for somebody that my husband and I are friends with. And she had been doing this to any friend she thought he was staying with. He was a domestic violence victim, and she was doing this to make him feel unsafe wherever she thought he might be seeking refuge.'",
        "'speaker_0': 'I use this anecdote for several reasons. One, because I think the commentary and the discussion on anti-racism is beyond. And I want to make this very clear. It is beyond the four walls of the police department. Yes, it should be inherently part of our review of policies within LAPD.'",
        "'speaker_0': 'It also needs to be part of our larger conversation throughout the city, through our hiring processes, through our policies for our practices, through the outcomes that we are seeing in terms of a number of different things. And I think it's beyond just anti-racism.'",
        "'speaker_0': 'I think it's just the need to have a concerted conversation about that continuum. But I think it's beyond that. It's about diversity in all and not a mayor. I know that. But you have been a stalwart in terms of making sure that there's gender diversity, that there's different types of diversity throughout.'",
        "'speaker_0': 'And I think that that is also part of that conversation citywide. How do we get a city that is reflective of the diverse community that we have? I also raise the anecdote because there is also a bigger problem of the community and people weaponizing the police force and that experience.'",
        "'speaker_0': 'And it was it was it was terrifying. It was the middle of the night. People were banging on our door. But the fact that we have community members and people that feel confident and comfortable enough to call in to misused police authority that way.'",
        "'speaker_0': 'That is also, and I think inherently needs to be part of the overall anti-racism conversation that we have. It's not just about systemic racism, it's about anti-racism. It's about misuse of different different types of governmental or structural or institutional power.'",
        "'speaker_0': 'So I think that that that's all part of it. I. I also think that this is about. More than just law enforcement. And I want to make it very clear that this conversation, while there will be certain aspects of it that should be law enforcement centered, particularly a review of policing policies that absolutely needs to happen.'",
        "'speaker_0': 'And I stand by the direction that we unanimously gave as a council to do that. But it's about so much more it's about the overall reimagining of services. And I think if we give this the title and the heading law enforcement, law enforcement reform, we are going to continue to get law enforcement responses.'",
        "'speaker_0': 'And I think we want to transcend that. We want to move beyond that. We want to think about how do we provide services that are responsive to what people need. Now, that call that was made to my house was for somebody who was supposedly a threat to himself or committing suicide.'",
        "'speaker_0': 'And that's concerning. I want people that are prepared and ready to handle that. I think we we do not do a service to our officers. We do not do a service to members of the public. When we send a team of armed officers to respond in that scenario, I think we can do better.'",
        "'speaker_0': 'I know we can do better. We've done better. We certainly have models for that. We know of models for that. I think we have an ability as a city to to shift how we reimagine services. I also want us to focus on the process.'",
        "'speaker_0': 'I think to me tonight, what I really want to do is I want to talk about what is that end goal that we're trying to get at. I want to think, you know, I think it's very difficult being on council in that we can't because of the Brown Act, we can't deliberate kind of beyond just this meeting'",
        "'speaker_0': '. And I want to have a transparent conversation about that. So I kind of want to explain my thought process behind what was put together in the document by the Vice Mayor, at least in terms of goals and objectives.'",
        "'speaker_0': 'And by the way, I'm not married to what the subcommittees look like or don't look like in terms of these are the five categories. I think that there are five categories of things to talk about. Whether we combine them is a separate issue.'",
        "'speaker_0': 'I think there will inherently be some overlap that is okay. But I also think that some of these issues require a deep dove. Like I said, beyond APD and require are going to require more than that. So where there may be some overlap, I think it also will be good to have one group focus specifically on one'",
        "'speaker_0': 'lens of things, and that needs to help inform policy and practices moving forward, going back to the goals and objectives. The other thing I want to put out there is yes, this is that this is I think whenever you talk about racism, systemic racism, anti-racism or power structures, there will be attention.'",
        "'speaker_0': 'Tension is okay. This is not an either or conversation. Sometimes it's going to be uncomfortable. Madam Mayor, when you had your roundtable, that was one of the points that came up was that tension that existed. We have to acknowledge it.'",
        "'speaker_0': 'I think sometimes that tension helps lead to a better conversation and a better work product. We need to be deliberative and thoughtful. We also need to create a safe space for people. And and by that, I mean not inviting people to the table who are not usually part of the conversation.'",
        "'speaker_0': 'By that I mean creating space and letting people lead us. And and sometimes that takes, you know, outlining goals and a process. And so for me, you know, and this is just kind of generally is how are we going to create safety and security for all all people in Alameda?'",
        "'speaker_0': 'And I think that that schematically is something that we've been talking about. Or general, good welfare. That's really what we're talking about. I want us to spend time and we can talk about steering committees, ad hoc committees, all these different things.'",
        "'speaker_0': 'I think there are a bigger question who selects these individuals? What is the process for assembling? What type of commitment are we asking from these individuals when we ask them to serve? Madam Chair, you made a fantastic point at the other meeting about states, and it's it's kind of ironic because we're going to have all these special'",
        "'speaker_0': 'meetings and as council members and I'm going to just put it out there, we don't get paid for all those who think we're making big bucks. We're not getting paid and getting paid for an act for tonight's meeting, and that's fine.'",
        "'speaker_0': 'But if we're going to go out and ask our members of the public for their time, we need to be thoughtful and inclusive. And that may include stipends to cover things like transportation or childcare or purchasing dinner for the family.'",
        "'speaker_0': 'Because you don't have time to cook that day because you have, you are going to be a part of a larger conversation. I think the other the other thing is, I think including a variety of voices finding a way to do that in the long term, you know, that that means diversity on a number of different levels'",
        "'speaker_0': '. It also means trying to find individuals not just because they have a title next to their name, but trying to find individuals who are members of the community. And I don't care how long they've been members of the community, but that are members of the community that are going to want to be a part of this and'",
        "'speaker_0': 'that have a unique experience. Who can speak from that perspective. I also you know, I'm also just going to put out there, you know, I feel very strongly that whatever we do, we need to create space in the short term so that we can start working on this, understanding that there is going to be a long and'",
        "'speaker_0': 'a short term process. And finally, I just want to put out there again and I'm not married to the number of people on it, on the steering committees or committee. I think it's going to be difficult to have too many people because getting everybody to set aside time and have a facilitated, you know, productive conversation with too'",
        "'speaker_0': 'many voices can be very difficult. But I also don't want to have too few seats that we are not including people. And then I also want to put out there that I think it would be perfectly appropriate for the mayor and to be a part of the overarching process conversation.'",
        "'speaker_0': 'She is the mayor. And so at least in my kind of vision of this, Madam Chair, you would be part of it if we did have kind of a two person committee to lay out this whole process. I think you should be a part of it.'",
        "'speaker_0': 'So I would have loved to been able to have this conversation with you and with the vice mayor. We're having it now. That's the purpose of this meeting. But that's at least my thoughts and where I'm coming from.'",
        "'speaker_0': 'And I think we need to create the process. The people will tell us what they want and within the finer lines, and then we can work with staff and there will certainly be space for staff to weigh in.'",
        "'speaker_0': 'And I think also part of having ad hoc council members involved or ex-officio members is to kind of remind people of the confines of of both the city charter and what rests within council authority as well as where we might be overreaching or in an area of state law, that sort of thing.'",
        "'speaker_0': 'So I think, you know, I think that the you know, I'm certainly biased and that I and I support kind of the overall structure of the process laid out that the vice mayor and I put together. But I also think and want to put out there that I really tried to hear my colleagues in terms of the'",
        "'speaker_0': 'things that you had said that you wanted to include and to include those things. Because I also think that everyone made some really valuable and everybody contributed and made great points. And so I just want it to be a process that we can all stand by so that we can get to an end product that that is'",
        "'speaker_0': 'going to really be transformative. Thank you. Thank you, Councilmember Vela, and I appreciate it. I appreciate everyone's comments as far. And before I call on the vice mayor to go next. My preference would be that we all throw out some ideas and suggestions for the way we would like to see this move forward.'",
        "'speaker_0': 'I, I actually don't want to work from the attachment. I know the assistant city clerk sent it to us, but I'm not a good multitasker and I can't vote to read a document while I'm running a meeting. So I think that's something that can certainly be sent on to staff and we can ask them to factor into'",
        "'speaker_0': 'the mix and I'll I'll amplify further on my thoughts, but I am going to go last. And so that leads us to Vice Mayor. That's right.'",
        "'speaker_2': 'Thank you. I won't deliver the point, but I will acknowledge being a little taken aback at being called out for talking to the people we represent about ideas. You know, I thought it was great when you called some residents and met with the police chief and had a conversation and learned and heard from the community, etc..'",
        "'speaker_2': 'And I think actually all of us have a reason to do that. So while I appreciate that you were surprised to learn that I had talked to people and that they had liked an idea. I'm not going to I don't feel chastised for having engaged my community in doing that.'",
        "'speaker_2': 'So I will also just quickly point out the confusion. City Manager Levitt, I have forwarded you the email that we received from the Salem police chief. Larry, the mayor and I all received an email. It was about two and a half weeks ago.'",
        "'speaker_2': 'The chief responded about our officers wearing blue Lives Matter face masks at that time. The chief explained why, you know, it's not really a big deal, but that we now have a policy that says they can't do that.'",
        "'speaker_2': 'And yeah, I raised that because I was very concerned by the comments of my my colleague, Councilmember Odie, who I consider a friend and I respect. But it was very difficult to listen to nearly 10 minutes of of tone policing, of people of color and them expressing their feelings about their interactions with the police and whatnot, and'",
        "'speaker_2': 'basically telling them that they need to step back and and accept. And equivocate that everybody's experience is the same. Everybody's experience is not the same. I am very lucky. This white male, middle aged. You know, I am. I try to keep myself centered and remember how entitled and privileged I am.'",
        "'speaker_2': 'We, you know, I. I just I can't sit here and listen to the idea that, you know, I agree. Our officers, our people, they do a difficult job. I have a lot of respect for them. I have done ride alongs and I have talked about the impact those ride alongs have had on me.'",
        "'speaker_2': 'I do not discount any of that. But the impact of them hearing the community complain about the racist system that we live in is not equivalent to the impact on people and the speakers that we have heard and the people who are speaking up for the people over here.'",
        "'speaker_2': 'And I just I have to say that we can move on. I look forward to having many conversations about this because I think we need to keep talking about it. Racism is not an individual action. It is a system.'",
        "'speaker_2': 'Making it into an individual action allows us to feel that we are somehow morally superior to people that we label as racists. So while I am very I really wish it didn't land this way that when we talk about the racism and the outcomes that we saw on May 23rd, that that lands as if we are complaining'",
        "'speaker_2': '. We are we are indicting specific people as being immoral. That is not what is happening. And if anybody listens, the way that I have spoken about this, I have never once talked about the specific actions of any given person involved in that incident, because at the end of the day, it was a system and it's a system'",
        "'speaker_2': 'that we as the council perpetuate and when we tell people to calm down and step back on that. We are perpetuating that system. That is exactly what how that how this works. So I'm going to start. I appreciate Councilmember Vela's comments.'",
        "'speaker_2': 'I echo them all. We spoke at length about this, about how we weren't going to try to just float something out and say approve this, but that we wanted to hear from people and that we wanted to make sure that there was a conversation before we talked about it.'",
        "'speaker_2': 'I think almost everything that Councilmember Vela said we discussed and are in agreement on. I'm a little disappointed. The Council adopted and asked to have a specific conversation come forward, and it was not a conversation about enforcement. We actually wrote the language and we adopted the language for this item, and it was regarding the city provision of'",
        "'speaker_2': 'community services responses and law enforcement, including policy reviews of existing policies. And it was intentional because we did not want to get into this. Are the cops good or bad argument? Because at the end of the day, at least from my perspective, we are going to have law enforcement in this town to provide crime prevention and violence'",
        "'speaker_2': 'prevention. When I talk to our APD staff at all levels, they talk about all sorts of the mental health issue responses, all sorts of responses. When our dispatchers call, they talk about the silly calls that they get, that they are, because the council has asked them to be responsible for responding to when the police department's TIO writes'",
        "'speaker_2': 'in and chastises says Having no idea what we're talking about. We are supporting the chief is at the same time literally proposing the types of things we are saying we should be talking to our community about. All we have done is say that we need to have plans and programs in place to be responsive, that we cannot'",
        "'speaker_2': 'on one day say that the police are no longer responding to 5150 calls and that the fire department can do it and not talking to the fire department about it. And not talking to the city manager about it.'",
        "'speaker_2': 'So my idea, which I was hoping was going to we would be able to talk about without the drama. And what I hear from a lot of our speakers is that I think we need a community led process, not a staff led process.'",
        "'speaker_2': 'I mean, we need to bring the community in and we need to trust them to tell us which direction we need to go. We need them to help us identify our goals and our objectives. And that was what we proposed tonight, was to actually identify a couple of council members who could work to find 79 people, to'",
        "'speaker_2': 'fill it, to fill a steering committee, bring back those names. We can even continue tonight's meeting so those names could come back for a Final Four for approval by the council next Tuesday. And and to hold some town halls this month to get community feedback and propose for the full council the objectives and goals that we are'",
        "'speaker_2': 'looking for as a community. I don't think that those seven or nine people or 11 people or whatever the right number is, should be of all like minds. I think that they should represent a diverse, diverse range of voices, because when I talk to people that we are getting emails from about what they want.'",
        "'speaker_2': 'What I find is as we as we converse, most, not all are going to agree with everybody. Most actually agree with what we're trying to talk about, providing safety and security for everybody. People are under the idea because of this conversation, which is perpetuated by city staff and is extremely problematic to me, that we are somehow suggesting'",
        "'speaker_2': 'the police are not going to come if somebody is attacking you, that the police is not going to come if your house is broken into and things are robbed. Nobody has proposed that. So what I would propose tonight, just as a general idea, is that we have a community led process that kicks off tonight.'",
        "'speaker_2': 'We're a month into this. Next week will be a month since the video came out. We need to take we need to start moving forward that we identify a couple of council members. I do not need to be one of them unless this body decided that they would want me to be so to serve as ex-officio non-voting'",
        "'speaker_2': 'members of a steering committee that they identify the people and that they bring back for just input and ratification from this document. And that additionally, we have requested our city staff start looking at Chief Hillary's June 10th policy direction to his staff and identify ways to put things into action and come back for discussion so that when'",
        "'speaker_2': 'we tell our community we're not we're not going to respond to non crime calls. We're going to also be able to tell them what that means and how we're how we're responding to their concerns or let them know that we're not going to provide that input in that conversation for our community before we before we move forward'",
        "'speaker_2': '. I won't walk through the entire process, but for me, what is important is that we get going and that by the end of the month we have a goals and objectives that we have agreed to and we can start moving forward.'",
        "'speaker_2': 'When we talk about anti-racism. It's not systemic racism. Systemic racism is the thing that we are trying to overcome. But what we want to talk about is the anti-racism. How can our city start acting as anti-racist? How can we take actions that are working against racism?'",
        "'speaker_2': 'It imbues everything we do. I can sit here and I will sit here and is uncomfortable. And it is I have benefited from racist racism. I have participated in racism. I am a part of a racist system. And every time I don't speak up and take action, I am perpetuating that.'",
        "'speaker_2': 'So I absolutely reject the idea that we can talk about law enforcement, community services, planning anything without talking about racism. What we need to do is work with our, I guess, in this case, our law enforcement staff and help them understand that we can talk about racism and racist outcomes without impugning people's moral goodness or badness, because'",
        "'speaker_2': 'that is a false dichotomy. So I appreciate like I said, I one of the first things I did when I got elected was take a ride along with Officer Schmidt. I had one of the scariest experiences I've had.'",
        "'speaker_2': 'On that ride along, pulling over somebody who just had dark tinted windows. I have talked about this a lot. It informed me heavily about what people who are doing policing are going through and why they respond the way they do.'",
        "'speaker_2': 'I can understand that and also think that we need to do better and that we do not have to set up this, this, this, this dichotomy where if if we're not, you know, cheering on the police as saviors and patriots, that somehow we are anti the people in the job that they are doing.'",
        "'speaker_2': 'And so I would say to the people that carry guns. Every year we meet with you outside the police station and we honor the officers who have been shot and killed in Alameda. Anytime somebody is hurt, we are there.'",
        "'speaker_2': 'When you do great things, we honor you at the city council meeting. This conversation is not about us people. We appreciate you as people. I appreciate Mr. Horvath coming and speaking out and being open. We may disagree on the ballistic armored tactical transport, but I appreciate that he at least comes out, acknowledges who he is, speaks his'",
        "'speaker_2': 'truth, and engages in the conversation. And I hope he will continue to do so. But at the end of the day, I am also here to represent the people that voted our community. I don't want to get into a conversation about law enforcement, good or bad.'",
        "'speaker_2': 'I want to talk about what we want and who we want to be as our as and as a community. And then I want to talk about how we get the outcomes that we that we say we want.'",
        "'speaker_2': 'And somewhere in there is absolutely going to be law enforcement. And somewhere in there, we're going to have to talk about oversight. We're going to have to talk about policies and all this other stuff. But I don't want to start there.'",
        "'speaker_2': 'I want to start about what do we want? Who do we want to be and how do we know? What is the road to get there? And it's going to be long. And I understand the frustration that we are dragging our feet and we haven't just cut the budget and whatever else we can cut the budget tomorrow'",
        "'speaker_2': '. We have nowhere to put that money. We're not going to fire half the people who work for the city police department overnight. I don't think we're going to fire half the police department, but that might be right. It's on the table.'",
        "'speaker_2': 'Everything is. So anyway, tonight, I you know, I think we need to identify a process. We have to approve it. I hope it will be community led and not staff led. I appreciate that staff gave some thought to this.'",
        "'speaker_2': 'I do not want to put more on their plate right now. They will obviously be engaged and involved. Our law enforcement experts, who are the people who police in our city, will be able to participate as expert voices, providing their perspective.'",
        "'speaker_2': 'But we also need to be hearing from the people who don't get to generally sit at the table, and we need to put them front and center. So those are my comments for tonight. For now. Thank you.'",
        "'speaker_0': 'Thank you both. Mayor and now Councilor Odie wanted to have the floor again. So Councilmember Odie.'",
        "'speaker_2': 'Yeah. I mean, I also respected vice mayor a lot too. And, you know, I've enjoyed working with him, but, you know, recently passed a code of conduct that basically said that, you know, we're not really supposed to attack the integrity and impugn our colleagues.'",
        "'speaker_2': 'And, you know, I've tried to live up to that code of conduct. And, you know, I, I, I, I'm not sure that, you know, those, those remarks lived up to that. And I think a lot of what I said was, was the point was missed.'",
        "'speaker_2': 'And I, I also don't think you can be called a racist just because you want folks to see the human side of somebody behind a badge, because ultimately those are human beings. And I also think that we as leaders, when we say things, whether we think we're, you know, important or not, they mean they mean things.'",
        "'speaker_2': 'And people react to those. And we're leaders. And when we get up in public or go on Facebook and accuse people of things, whether they're true or not, it's going to incite hardening of feelings. And what I saw earlier was a hardening of feelings on one side, you know, one group that won't even utter the phrase Black'",
        "'speaker_2': 'Lives Matter. And another group that basically wants to abolish the police department. And neither one of those are feasible alternatives. And in trying to ask people to calm down the rhetoric, you know, I'm being criticized in violation of our code of conduct for asking for, you know, a rational approach to solving a major problem.'",
        "'speaker_2': 'And, you know, I agree with a lot of what everyone said, and I do think we can probably set goals today. And I think Councilman Vella talked about what those goals are. You know, if we center it around Black Lives Matter and everyone, regardless of age, race, gender, you know, we all have to feel secure and be'",
        "'speaker_2': 'secure. Then everything else can fall into place. And however we want to do the process, you know, I'm open to anything. I like the ideas you guys mentioned in your column. You're taking a community centered, um, and, you know, led by, by us, the council and not staff telling us what they can do or what we should'",
        "'speaker_2': 'do. But, you know, at some point, we as leaders have a responsibility to chill the rhetoric a little bit and, you know, act like leaders and not like insiders. And not that I think anyone is doing that. But, you know, that's what people are looking for us to do right now.'",
        "'speaker_2': 'And, you know, when you go against the code of conduct and, you know, attack another council member by name, I don't think it does that. As much as I respect you and have a high opinion of you, I don't think it's helpful to to to a solution.'",
        "'speaker_2': 'And, you know, like but John, you did say, you know, we need to envision where we want to be. And then we build. To that. So, I mean, that's what I want to do. And I hopefully we spend the rest of of today talking about where it is we want to be and then figure out how we'",
        "'speaker_2': 'get there. Thank you, Madam Chair.'",
        "'speaker_0': 'Thank you, Councilmember Odie and I. And Vice Mayor. If you want to say something else, I'll give you the floor. But I want to just say something first. Um, I want to acknowledge all the hard work that this council is doing, has done, will do in the future.'",
        "'speaker_0': 'We, um, we have had, I think, more tough issues in a short period of time or even a long period of time than any council that I can think of. And I mean, I you're chuckling. You know what I mean?'",
        "'speaker_0': 'It is 24 seven, and it started with the COVID 19 pandemic. And I have been so worried and, you know, waking up at three in the morning, I'm not doing that anymore. But but I was just worrying about this this pandemic.'",
        "'speaker_0': 'And then we have the the second crisis within a crisis. And it is not easy. And a number of you have said this, that we are all humans with feelings and we're caring people. We chose to get involved.'",
        "'speaker_0': 'Some people, you know, ask me, were you crazy when you wanted to run for mayor? And, uh, but no, we're not. We're just we're committed. We're passionate. We are also impacted by all that swirling around us and and the impact of hearing public speakers.'",
        "'speaker_0': 'And some of them are very one sided, which is absolutely their First Amendment right. But it is our responsibility to somehow rise above the fray and understand that we may realize that there is more to an issue than meets the eye, or it simply isn't possible to do some of the things that people are calling for us'",
        "'speaker_0': 'to do. And of course, we want to please people. We want to make everyone happy and say yes all the time. It's not possible. So what I'm what I'm just my my advice and ask of you is take a moment or several for yourselves.'",
        "'speaker_0': 'Take a few deep breaths. I hope you're engaging in some form of self-care, because these are tough times to be a leader, trust me, and and you know it as well as I do. And so what we don't want to do is be seeming to attack each other.'",
        "'speaker_0': 'And I'll just hasten to say, Vice Mayor, I was not chastising you at all, but I was sharing my feelings and my concerns about the way your proposal was put forward. And I was just, you know, trying to keep up with speakers and going, wait, did I miss something?'",
        "'speaker_0': 'But the staff report wasn't even that long, so I couldn't have missed something. And my fervent desire for us to do our best work collectively and you and I have discussed between ourselves the frustrations of dealing within the Brown Act.'",
        "'speaker_0': 'I get that. And so, but I, um, I also have a right to express and share my views. Um, but I didn't mean it to be a chastisement because you, of course have every right to do what you do.'",
        "'speaker_0': 'But going forward and tonight and I will speak well, there's a couple a couple of speakers that are going to get interjected now. But, um, again, let's, let's take it a little easier on ourselves. We've, we've been working really hard on really tough issues that are not just local.'",
        "'speaker_0': 'They are national, they're even world wide. But as I remind myself every day, this is not the White House. And we don't have to be divisive and we don't have to try to, you know, create as against them.'",
        "'speaker_0': 'And we're always going to stick to the truth. But, um, but anyway, Vice Mayor, if you'd like to say something, fine, if not fine to. Okay.'",
        "'speaker_2': 'I just I know I says I respect Mr. Oni. I think calling out certain behaviors is not an attack on a person's character, though I understand it can land that way. And as I said, I look forward to talking more about this offline.'",
        "'speaker_0': 'Good. Thank you. Okay. And now the police chief would like to just address some of the concerns that were raised about policy changes coming from the police department.'",
        "'speaker_2': 'So I can ask a point of order.'",
        "'speaker_0': 'You may.'",
        "'speaker_2': 'Sorry, are we going to start a back and forth between staff and.'",
        "'speaker_0': 'I was going to go for a clarification of some things that were raised. And actually, I believe I even noted that you would like some explanation. And I think that's a very fair point. And I often times like to do things so that the public that's listening at the time can get the answer rather than, you know'",
        "'speaker_0': ', if we have the people here to do it. So and briefly because it is I don't know what time it is, but it's 920, 920. Thank you. Okay. So way past his bedtime. But look at him. He's one of the most alert with spring fever, Larry.'",
        "'speaker_0': 'So I hate to compete with babies, but key for Larry. Can you give us some clarifications of the the policy changes we heard referenced?'",
        "'speaker_2': 'Thank you, Madam Chair. Council members, I, I appreciate everything that was said tonight. Um, I, uh, I agree with Councilmember Velez when she said that tension is good in conversation. I totally agree with that. And we don't really move forward without them.'",
        "'speaker_2': 'So I'm happy to be part of any of those tense, tension filled conversations. So it's kind of a regular part of what what I do in my office. I also appreciate the fact that we can call out behaviors without calling out people.'",
        "'speaker_2': 'But I'd like to point out this to the vice mayor, that some of the comments that I think you're hearing from members of the police department have to do with maybe not the toned down rhetoric that we're hearing tonight, but some of the things that were happening early on after the videos of the March 23rd incident or'",
        "'speaker_2': 'May 23rd incident came out. I think I think some of that dialog has been dialed back a little bit. But I think that the people have been feeling a little hurt and attacked personally. And then I would also add that even from members of the council, that, you know, that that has happened with me, which has caused'",
        "'speaker_2': 'some a lack of confidence, I think, in some members of the public who are listening to some of the things that were said on the news or, you know, theories that I somehow was looking the other way, as the caller mentioned tonight, or was engaged in some kind of a cover up, which is absolutely false.'",
        "'speaker_2': 'So as far as the policy things go. Back on April 3rd. And I think most of the council knows this city manager certainly knows this. We had dialed back a lot of our self-initiated enforcement because of coldness, not because of anything that happened.'",
        "'speaker_2': 'This was a good month and a half before the incident on Central Avenue occurred. That was based on me trying to protect the officers from COVID and doing our part to try to protect the public from COVID. We I dialed back a bunch of our self-initiated activity for that reason, and I reported that out to my boss'",
        "'speaker_2': '. And I think all of you have since been made aware of that. So when I made my comments on June 10th in the interview, to me I was not making a drastic departure from what we'd already been doing.'",
        "'speaker_2': 'As I've also mentioned to some of you, the the statement about not going to a mental health course was I was edited. I went on to say that I had hoped that we would start a conversation at City Hall, which we now have, about how we approach mental health calls.'",
        "'speaker_2': 'And unfortunately, all of that was not included in the television report. And I regret that. And I apologize to the city manager. I think I could have been done in a better way. But to the public and to the council, just so that we're clear, the policy direction, which was more of a procedural thing in terms of'",
        "'speaker_2': 'what we respond to, was already in place on April 3rd and it was 100% COVID related. So again, did not mean to cause any consternation in community or with anybody in city hall. And I just want to be clear that that was the primary goal.'",
        "'speaker_2': 'And I was trying to also respond to the reporters questions about what could I say to the community to make them feel safer at Alameda and to let them know that, you know, I was being responsive. And that's that's how I answered.'",
        "'speaker_2': 'So I just thought that that would be important for everybody to hear that. Thank you.'",
        "'speaker_0': 'Thank you. Thank you for that. I appreciate that. Okay. With that, I'm going to make my comments and then let's talk about our next steps going forward. So. Great comments by all my colleagues. Thank you. And thank you to all the public speakers who talked as well.'",
        "'speaker_0': 'Couple of things that I think I just reiterate because they've been raised, but I think they bear repeating and this is where I like to say it's possible for more than one thing to be true at a time.'",
        "'speaker_0': 'So while I appreciate hearing from residents who who say I've never had a bad experience with the police, I, I also understand and I hope other people can, too. And that's where I mean, walking in someone's shoes or imagining what it must be like to walk in someone's shoes becomes a useful attribute because it, it is I'",
        "'speaker_0': ', I don't need to be told yet another time of the horrendous experiences that people of color have had just being stopped by police, just having to factor more time into getting from point A to point B because they might get stopped by the police and received hours.'",
        "'speaker_0': 'If you're still listening, what you talked about as being this little kid who, you know, found this bike and brought it home and your mom, you know, told you to do the right thing and you did. And what an awful experience and one that has stuck with you from the time you were seven until I don't know'",
        "'speaker_0': 'how old you are, but older than seven. And and it's similar to what I heard when I met with the young people and in the vice mayor referenced that conversation that I put up and put together. I was wanting two groups to hear from each other.'",
        "'speaker_0': 'I wasn't, you know, soliciting people's responses. I was being informed just by listening to it. But I it was a very valuable conversation and listening to these kids, I there's no reason to believe them. And I will just say that there was one commenter who said, Oh, we've heard teen after teen quote from a Netflix series.'",
        "'speaker_0': 'I'm not going to go blank on which one it was, but that I, I believe the kids. I believe the kids. And and we can do better. And that's partly what this is all about. Um, yesterday I went over to the home of this African-American family who we've mentioned their cars were vandalized with spray paint and racist'",
        "'speaker_0': 'messages. And I was talking to the husband and he looked me in the eye and said, what is the city going to do about this? And I said, about about the racism that exists in our community. And he said, Yeah, what, what is the city doing?'",
        "'speaker_0': 'And I said, Well, you know, we've started a process beginning with the arrest of Mr. Watkins on May 23rd. We have had two meetings that that talks about these issues. And in fact, we're meeting tomorrow. And I said in my hope and I'm just one of five councilmembers, but what I would like to see is some community'",
        "'speaker_0': 'task forces with members of our communities of color who have had these these experiences. And I said, I would love you to be involved. And he said, I would love to be involved. And so I gave him my business card and and he posted on the city's Facebook page in response to the the post that I put'",
        "'speaker_0': 'out, we put up yesterday about the incident, and he's a marine who served his country for many years. And this time he talked about the oath that he took as a marine to serve and protect anyone. He said not to ask what their race was or what their creed was before I protected them, but just to serve'",
        "'speaker_0': 'them. And so he said, that's, you know, that's the way I expect things to work and we can do better and we will and we are starting to. And so I'm going through, um, I talked earlier about starting with the end in mind and Councilmember Vela and others have talked about that too with the issue of unbundling'",
        "'speaker_0': 'the services currently delivered by police. That is something that I think has some pretty exciting possibilities. I have reached out to cahoots the the program in Eugene, Oregon. It is community assistance helping out on the streets, I believe.'",
        "'speaker_0': 'Um, and um, if, um, if all the planets are aligned on Friday, the, um, the coordinator of the Cahoots Program, he works with an outfit called the White Bird Clinic in Eugene, Oregon, and works closely with Eugene Police Department.'",
        "'speaker_0': 'And he's hoping I'm hoping he'll be my guest this Friday at noon on my mayor's town hall. So what's the city's website? So we'll get more information up there. And he is even going to reach out and see if someone from the Eugene.'",
        "'speaker_0': 'Police Department who they work with could also be on the town hall because it would just be great to hear their experiences and people can ask them questions. And speaking about the Eugene Police Department, I happen to know that our police chief has reached out to the police department to get information about how that the cahoots program'",
        "'speaker_0': 'interfaces with the police department and how they set it up, the structure and the contract and all that. And there and as far as other ways to deliver police services, I know that our assistant city manager, Jerry Boden, reached out to the county.'",
        "'speaker_0': 'In fact, I think Councilmember O.D. actually raised the fact that there are county services that are available. And so I email introduced Mr. Boden to Dr. Karen Tribble, who is the director of the Alameda County Behavioral Health Services Health Department.'",
        "'speaker_0': 'And, um, and she was great. She was she was in earlier in April. She was one of my guests on my, my town hall. And I know, I know they've connected and they're going to talk about, you know, how the city might be able to work with the county to do some of these these kinds of services'",
        "'speaker_0': '. So so things are happening. They're happening as we speak. I do believe that anything we do needs to be fact based and data driven. And I mean, the vice mayor said this, that that we could, you know, cut the budget of the police department tomorrow.'",
        "'speaker_0': 'But where is where is the money going? And what I would like to know more of and this is actually I'm not going to take credit, but the city of Oakland, by the way, the city of Oakland is also in talks with the folks at Cahoots and the Eugene Police Department because a good idea is a good'",
        "'speaker_0': 'idea. And I think it's kind of exciting that it may be trickling down to the Bay Area, but one of the things that their Department of Violence Prevention has a fairly new department or maybe it's like a a task force, but they it's a community council led effort.'",
        "'speaker_0': 'They have started to look at the collect and analyze data on the number and types of calls that come in to the dispatchers at APD. And I commend Councilmember Odie for sitting down with a dispatcher for 3 hours and just, you know, gaining that experience.'",
        "'speaker_0': 'Good for you. But but the point was made from Oakland, because I was reading the abstract of their effort that the way their data is collected isn't as useful as it might be. So they're looking to collect dispatch data a different way.'",
        "'speaker_0': 'I have no idea what that would look like for Alameda, but I do think it's important in deciding how we might reimagine the delivery of police services and how things like mental health cause and substance abuse and homelessness issues might be handled differently.'",
        "'speaker_0': 'Let's find out how many calls. I mean, I get that it's a large percentage, but let's let's look at a year's worth of data and let's, you know, based are some of what we're doing. Well, all of what we're doing should be based on reality.'",
        "'speaker_0': 'But I think we'll just be better informed about what kinds of services we need and where we might get them if we have those that information. The one thing I want to just throw in and Mr. Boden and I talked a little bit about this yesterday, is that the codes program is unique in its own right because'",
        "'speaker_0': 'they are connected to this white bird clinic that is a 30 year old institution in I think it started in Eugene, Oregon. And I think they were able to buy a house. And now there is also maybe in Springfield, which I think is a neighboring city, there is like a clinic, a dental and health care and substance'",
        "'speaker_0': 'abuse treatment clinic. So when they go out instead of the police or on the rare occasion when they find someone who is seems to be a danger to themselves or others, they can call for police assistance, but they're able to then and again it's a voluntary transport.'",
        "'speaker_0': 'But if someone is willing to avail themselves of their assistance, they can take them to the clinic. They can take them to these different treatment facilities. It's not to say we have nothing in the county. We we have some things I've done, George, but I just you know, that's something that that we're going to have to think'",
        "'speaker_0': 'about to counsel that when we, you know, we can have different means of response. But then what what's the next step? Where do those people go? So just, you know, keep that and keep that in mind. Then the something that Paul actually let Mr. Bowden tell us about, that is an implicit bias training.'",
        "'speaker_0': 'It was done. I think the city of Berkeley did this a couple of years ago for its police department, but also for its city council. And so we just might think of and then apparently there's a of renowned facilitator that we might consider for ourselves at some point.'",
        "'speaker_0': 'The, um, uh. Other things that I do think it's important is we need to have stakeholders at our tables, whatever tables these are as we discuss these different areas and in whatever form that takes. And sometimes we need to have police at that table, too.'",
        "'speaker_0': 'And this is where I don't want this to be an us against them because when we're talking about police policies and practices, I, I do think it's appropriate to have someone from the police department there and to be able to say, well, you know, don't you might want to consider this and here's how we would do that'",
        "'speaker_0': '. And, and just to listen and to hear and. Then. I do want to come back to something that I raised at the previous meeting, which came out of the facilitated forum with the youth, and that is the Youth Advisory Commission.'",
        "'speaker_0': 'And I will tell you that some of the teens in that group are very interested in that idea. And so I told them, Well, why don't you do a little research and get some information? And man, did they.'",
        "'speaker_0': 'And so I've got a lot of information from them about what Oakland does, but I have no idea how we would go about doing that here. But I would hope that it's something that council would consider because I think it's and by the way, I do hope that we have some youth of color on some of these'",
        "'speaker_0': 'if we decide to do subcommittees or task forces or what have you. But I that what I like about the Youth Advisory Commission is it gives youth a voice in real time to talk about issues they're facing and to raise things that, you know, I hope it wouldn't take until they become adults to say, you know, this'",
        "'speaker_0': 'happened to me, but it's not just about policing their experiences, but there's a there's a lot of things that are part of our community. So I hope we can think of a way that we might we might be able to work there to incorporate their concerns.'",
        "'speaker_0': 'So the what I would like to just direct to the next part of the discussion to Ward is so I think it's a reasonable statement that we probably can't do everything that we've set forward at once, notwithstanding the public's desire that we move quickly.'",
        "'speaker_0': 'I think we will move with all deliberate speed, but we also need to do this right. I would suggest that the the one that could maybe be set aside or or referred to elsewhere might be the laws that criminalize survival for reasons that were already discussed.'",
        "'speaker_0': 'But I think that some of some of these might some of these topics might be the subjects of task forces. I think we do need to talk about the size of the task force, the mission. It's given the expectation objectives.'",
        "'speaker_0': 'And I also was mindful that not only did a number of speakers say that this should be a community led process, and I agree, they said the city council shouldn't be part of it either. And I think I also agree there.'",
        "'speaker_0': 'I think that I because and here's why. I think that to have a city member, council member or to sit in on task forces.'",
        "'speaker_2': 'Just.'",
        "'speaker_0': 'Takes it in a little different direction. It is not simply members of the community. I think that members of the community and I would say meeting with a staff person who is, you know, tasked with. Carry out whatever we've directed them to do might be the preferable way to do it.'",
        "'speaker_0': 'And I also had a talk with the city attorney this afternoon, and he and I'll let him speak for himself. But there is some concern about Brown Act issues that come into play when you have different sets of council members on different subcommittees that are all items that are kind of going to come back to the council'",
        "'speaker_0': '. Um, I would be happy to work with another council member to, um, to take a look at how, how we should work with staff to move forward on this. I think I'd like to see if we can give staff some direction because what I'd also like to have come out of tonight is a work plan and a'",
        "'speaker_0': 'timeline. But I think that it would be useful to have a council subcommittee to advise on that. And I want to obviously hear from all of you. Um, my suggestion, just listening and, uh, television I am thinking about it is that I would be happy to work with Councilmember Vela if I haven't assigned you too many, too'",
        "'speaker_0': 'many to ask lately. Um, if you felt you had the time and the inclination and obviously subject to the approval of our colleagues, that I would I would put that out there as this as a possibility. Okay. That's all for me for now.'",
        "'speaker_0': 'That's me. I see your hand up. Yes. Yeah.'",
        "'speaker_2': 'I would absolutely support some kind of collaboration with you and vice mayor. With former Vice Mayor Vela. I still can't drop it.'",
        "'speaker_0': 'We're off. We're off. Former vice.'",
        "'speaker_2': 'President once.'",
        "'speaker_0': 'The vice mayor.'",
        "'speaker_2': 'I guess that's it. Yeah. Um, I wanted to call on a different time, so for me, I am less interested in task forces whereby you pick people and they make decisions. For me, I use the term steering committee because the steering committee wasn't actually making decisions, it was developing the process and figuring out how to bring the'",
        "'speaker_2': 'community in. And, you know, I would really encourage us not to in the you know, not to. Well, first off, I really hope we can just kind of move forward tonight, not just on the subcommittee, but with some actual, you know, when we're going to have things back.'",
        "'speaker_2': 'Because I my concern about the subcommittee is the subcommittee goes, it meets, but it's not a public. The public is not there. So no decisions are being made without the community and less subcommittee members are choosing who they want to listen to.'",
        "'speaker_2': 'So I think that there might be a model where the subcommittee really is just an ex-officio non-voting committee that comes back with a proposed process and goals and objectives by the end of the month, which I think is kind of you know, I mean, there's lots of ways to get there, but that we actually identify some people'",
        "'speaker_2': 'who who really help figure out what that looks like rather than deciding tonight, it's a task force. It's nine people, here are the voices, etc.. So that would be my one comment.'",
        "'speaker_0': 'Yeah. Um, and I agree with you. I didn't want to get into number or individuals. I wanted to, um. Send the that decision for a policy or for a proposal to bring back to the council, to the subcommittee, if it were to be Councilmember Val and I sitting down with staff looking at the proposal that you came'",
        "'speaker_0': 'up with and and other considerations from everything that has been and will be said tonight. But I agree with you that we we don't want to take an inordinate amount of time. I just want to take enough time to think it through.'",
        "'speaker_0': 'As far as other, you know, size and and and then the yes, the the issue of meetings and some meetings probably would be not in public, but others others would be would be opened up. This is just my thought.'",
        "'speaker_0': 'And again, these are meetings in the time of COVID. So I think we probably have to think that they're going to look somewhat like this is for Councilmember Otis had that person and council member Vela back to you.'",
        "'speaker_2': 'That a mayor I mean one thing I remember the council did I maybe it was nine years ago eight years ago was an ad hoc committee for the America's Cup and I think there was a council member on it.'",
        "'speaker_2': 'But it did meet it had public meetings and public agendas. So, I mean, I like the idea of you and Councilmember Vela working together. I think that to bring a bring a big picture view of what needs to be done and maybe we don't like, say, individual folks or people, but, you know, the the basic categories and'",
        "'speaker_2': 'goals, geographic diversity, gender diversity, members of the black community, community interest groups, business high impact, you know, centering black and youth voices. You know, I think those those could be your guiding principles as you as you go forward.'",
        "'speaker_2': 'I mean, the thing about must being from Alameda, there's a lot of great social justice groups, you know, just over the estuary, you know, that, you know, well, we're not as blessed as as Oakland is with the great social justice groups.'",
        "'speaker_2': 'So in some areas, it may be necessary to, you know, look elsewhere for, you know, some type of expertize. But, you know, I think the proposal, as long as it comes back quickly and it's open and the community can be a part of it, you know, I think it's going to be a good thing.'",
        "'speaker_2': 'I do think we can come up with at least what, like you said, the goals and objectives that the vice mayor said. You know, by the end of the month, we know what we're doing. But if we decide we want well, I guess that's phase two.'",
        "'speaker_2': 'So let me just I'll. Gosh. We'll talk about that later. But I like the idea, but I don't think we can waste time. The only other thing I would ask a question of, I mean, there was a lot of discussion today about accountability and a possible citizens board.'",
        "'speaker_2': 'I mean, I don't think we fleshed that out so much. But, you know, if I believe if that was something the community wanted to go in the direction of, we'd have to put that on the ballot. So I don't know if, you know, maybe having a different subcommittee that could work on, you know, what ballot language might'",
        "'speaker_2': 'be possible. That leaves us with enough leeway. I don't know, just because that has to be done by like the beginning of August, right?'",
        "'speaker_0': 'Um, so I would say, um, and maybe we'll call on the city attorney and I think to put people on the spot. But we actually had a little bit of a discussion about whether or not that actually does require a ballot measure.'",
        "'speaker_0': 'And the other thing about our city attorney even is besides that he's a talented attorney, is he came from the city of Santa monica, where they had done a number of citizens. I don't know whether they were called task forces or subcommittees, but around some media topics.'",
        "'speaker_0': 'And so that that just, you know, helped inform my understanding of how these things might look. But, um. City Attorney If you could just. Mr. Chan, if you could just talk a little bit about the accountability piece, Citizen Oversight Board, what, what might that look like?'",
        "'speaker_0': 'And as far as that, how it could be formed.'",
        "'speaker_2': 'So on that issue, I think the Council has wide ranging discretion on how you'd like to ultimately form a committee and what that function of that committee is. And depending upon the function that you assign that committee, there may or may not need to be ballot action.'",
        "'speaker_2': 'So, for example, the charter assigned the administrative function to the city manager and the policymaking duties to the council. So if you assign enough duties, a decision making authority is, let's say to this body, it is possible that that body begins to infringe upon the city manager's authority to administer the police department.'",
        "'speaker_2': 'At that point, we will need to ask the voters for their consent to organize. On the other hand, if you were establishing a committee that, for example, gives the council and the city manager recommendations about policy changes, that clearly does not need a ballot approval because you are establishing an advisory committee to advise the decision makers, which'",
        "'speaker_2': 'is the council, the city manager and the police chief on operations of the police department. So, you know, and there will certainly be some gray it depending upon where the council wants to go. You know, the more authority and decision making that you ratchet up to this body, the more likely and at some point infringe upon the'",
        "'speaker_2': 'city manager or the council's authority to run the city on a policy or administrative basis. I hope that answers that specific question.'",
        "'speaker_0': 'Yes, I think it gives council something to think about going forward and as it did for me. Okay. Did you want to. Councilman Brody, did you want to?'",
        "'speaker_2': 'I mean, I.'",
        "'speaker_0': 'Did.'",
        "'speaker_2': 'Not. Not yet. So I guess people need to understand then if if the ultimate outcome is that we have a civilian body with more authority, then less so that, you know, it's going to take going to the ballot.'",
        "'speaker_2': 'And, you know, we're almost up to the deadline for this year. So we have to wait for the next election or we have a special election, you know, and that's another, you know, 90 days plus before we can schedule that.'",
        "'speaker_2': 'So, you know, that's not something that's going to be able to be implemented as quickly as people want it to be. So I don't know where we're going to fall on that. But I, I guess in the process, one, we're going to identify, you know, some type of of path forward on how we're going to decide that'",
        "'speaker_2': '. Sorry.'",
        "'speaker_0': 'Finishes Alpha. You get the sign. Okay. Councilmember Vela, you're next. The city attorney had his hand up. Oh, I'm sorry. I had to say something. Thank you, city attorney.'",
        "'speaker_2': 'Thank you very much. I just want to add one more point about process, which is that the council could not modify the charter by special meeting. So you would have to do that either at a general and primary election or a general election.'",
        "'speaker_2': 'So that's middle. If not this year, the middle of 2022 or end of 2022. I just want to share that one more fact. Thank you very much. Election that special Guinea.'",
        "'speaker_0': 'Special election is.'",
        "'speaker_2': 'What did I say? Special meeting?'",
        "'speaker_0': 'Yes.'",
        "'speaker_2': 'That's all I can utilize. The charter amendments. My apologies. My phone is beeping at me that says it's dying. So I'm going to turn off the works and.'",
        "'speaker_0': 'Plug it in.'",
        "'speaker_2': 'My, my, my apologies to turn around and flourish.'",
        "'speaker_0': 'But you also cannot modify the charter at a special meeting, so just remove that.'",
        "'speaker_2': 'Right.'",
        "'speaker_0': 'All in favor. Oh, no, just kidding. Okay. Um, so it can't remember. You said you were finished. And, Councilmember Vella, you are next. Yeah, so I just kind of. I want to kind of. Reiterate what I think I've heard from people in terms of where I hear consensus.'",
        "'speaker_0': 'So I think that we have consensus in that there will be a perhaps a steering committee of some kind to help lay out the process to move forward and that there will be a council subcommittee member. I'd be happy to serve with you.'",
        "'speaker_0': 'I think we've worked together well in the past and it would be you be happy to to work on it. I think what there's a couple of things. So one, I think what I would like to hear from my colleagues on is do we have agreement on what kind of the general scope of consideration is or the'",
        "'speaker_0': 'aim of where we're going? I think there's lots of great ideas and I think we can hear from the specifics about implementing and how we respond to it. But I think I guess what I'm looking for is are we looking towards just an effective safety and security for all our needs?'",
        "'speaker_0': 'Is there a different way we want to work that, but what's the kind of proposed overarching goal? I think we can all agree it's beyond just the term law enforcement. But but what is it we're looking to achieve?'",
        "'speaker_0': 'And I think that's that's one thing that I would like to hear hear from my colleagues on. The other thing that I would put out there is, well, I think that many of the laws that criminalize survival are state laws, where we prioritize our response and how we actually respond to enforcement of them.'",
        "'speaker_0': 'We get a lot of calls for people who are unhoused, and I think that that is going to be a larger part of our conversation about our policing policies and practices. And I want to get away from just talking about policies because of both of the practices and then the the outcomes that we continue to get.'",
        "'speaker_0': 'Are we getting disparate outcomes, what we're looking at all of those things. So this isn't just about policies. I think we're all aware of that, but I wanted to highlight that. So I think there is going to be a place for that conversation.'",
        "'speaker_0': 'I don't want it to necessarily go away. I think it just maybe gets brought under the umbrella of some of these other conversations. And it also, I think, will go part into the unbundling conversation as well as we look at how we can be proactive about providing services.'",
        "'speaker_0': 'I also want to just get a sense of kind of meeting dates from my colleagues. I think it's all well and good for a subcommittee to kind of say, okay, this is when we're going to start scheduling things.'",
        "'speaker_0': 'I think if we could get a sense of is there a mixture of weekends, dates, times that that people could be amenable to and what is the overall timeline? Are we I mean, I think the goal is to get this done by senior set this month till June.'",
        "'speaker_0': 'I'm hoping he means July. I think he means July. Yeah. So that's one day. Yeah. And then, you know, I, I hear the community and the calls for oversight and accountability. I think that there's this was brought up before the council before and I had questions is what's the process and does it go in the charter?'",
        "'speaker_0': 'I think it depends on how we define oversight and accountability, and I think that's going to be part of the community led process. I think it's all good and fine to be like, Look, let's get something on the ballot, but let's vote.'",
        "'speaker_0': 'I think if we did that right now, all I have that I could go off of is something general along the lines of the community authorizes council to create some sort of oversight committee. I don't I wouldn't know what the bounds of that are because I think people have different definitions of what oversight and accountability are.'",
        "'speaker_0': 'We have some people calling for literally a review of police officers in the civil service process. We have other individuals calling for oversight of policies, and then we have other groups that want data and a review of practices.'",
        "'speaker_0': 'I think part of this is, yes, I want to get change. I think we all do. But I think in order for it to be the transformative change that we all want, it might not mean rushing to get something on the ballot right now.'",
        "'speaker_0': 'As much as I'd like to be able to say, yes, I'm for oversight, accountability. I think those are big words that mean a lot of different things to a lot of different people. And I don't want to be disingenuous about, yes, we're doing something when it may not be the thing that people think that it is.'",
        "'speaker_0': 'So and I know I'm not accusing any of my colleagues of trying to do that. I certainly have gone back and forth on does this belong on this ballot or a later ballot? But I think that this is where I at least personally want to take a step back and say, let's listen to the community.'",
        "'speaker_0': 'That's why we're going to have these subcommittees. This is part of what I want. To work on, go through what are the best practices? What do they want? What has been effective in communities the size of Alameda, that sort of thing.'",
        "'speaker_0': 'Or charter cities. And I think that that's going to be a robust conversation that I'm really looking forward to listening to. And also, you know, I think part of leadership in this area is, like I said, going to be outlining the process and then empowering people to tell us what they want.'",
        "'speaker_0': 'And I think that's what I'm really excited about through this. And I think that we can all get by in and where we're going to be able to say this was community led and we can stand by this.'",
        "'speaker_0': 'And there were multiple opportunities for people to weigh in and that we went to people. The last thing I want to put out there is because I think a lot of these meetings are going to be via Zoom.'",
        "'speaker_0': 'The other thing is just recognizing that and I want to put this out there to people who would be.'",
        "'speaker_2': 'Potential.'",
        "'speaker_0': 'Steering committee members. I don't want the digital divide to be an issue. And so if that means that the city needs to come up with like a my or, you know, an iPad or something that we get to steering committee.'",
        "'speaker_2': 'Members for the purposes of.'",
        "'speaker_0': 'Digital meetings, that's also something I think we need to figure out and work into all of this. Good points. And I just want to touch on a couple of things. You mentioned Councilmember Vella. When we talk about out outcomes, I would like somewhere in this process to build in to what we're creating a way to measure outcomes'",
        "'speaker_0': '. And we can you know, we can decide among ourselves the these groups of community members can help us with that. Um, another reason Councilmember Vella is a particularly good choice for this subcommittee. Is she in her day job which probably seeps in tonight is is a labor lawyer and does represent union employees, including public safety.'",
        "'speaker_0': 'I'm not in this city but in other places. And so it's just good to have that understanding also of policy. And so I think that she know as far as time, I just want to get your I mean, one minute Councilmember Day.'",
        "'speaker_0': 'So I had a timeline and next meetings I think we want to ask staff because we are going to be asking them to work with us to help pull some of these things together. And so and I do think that they understand that the urgency that and the community's desire.'",
        "'speaker_0': 'So it is both our availability when we then need to call a special meeting to um, to discuss things that have, you know, developments and to keep things moving on track. So, um. Assistant City Manager Bowden, could you talk to us a little bit?'",
        "'speaker_0': 'I know you've put some thought into how to get more than 24 hours in a day, I think to get all this done expeditiously, that the floor is yours. Please.'",
        "'speaker_2': 'Yeah. I just I appreciate the conversation tonight. I think I've. I've heard a lot more. Um, just to be able to develop the work plan, the way that the council has tonight helps. I think that we can take the month of July and, and work through what it's going to look like.'",
        "'speaker_2': 'And, and using the the subcommittee and steering committee concept works. Well, I just I need to sit down with you all and really look at a calendar and lay out a plan that helps us do this. I I'd love to be able to give you dates tonight, but I just don't think that, um, we're there right now'",
        "'speaker_2': '. But we can be in during the month of July. I think that's realistic.'",
        "'speaker_0': 'Okay. But during, during the month of July. So, um, I don't go anywhere in the month of July. People just kidding. We'll get some specific dates, but I, I can commit and I'm sure Councilmember Villa, who might have just disappeared, that probably for good reason.'",
        "'speaker_0': 'Hi. Um, that, um. I think we can, as early as tomorrow, we can coordinate our schedules with Mr. Boden's to to sit down and start moving some of these, um, these ideas forward as soon as possible. Um. So thank you.'",
        "'speaker_0': 'Um. So I, um. So. Yeah. Councilmember Gates. I'm sorry. Sorry.'",
        "'speaker_2': 'Just just quickly. Is the idea of having a steering committee, a subcommittee or whatever community input process to look at one, two, three and four? Or are we going to look at one separately and kind of bundle together several others so that there would be a steering committee or whatever committee input process for the unbundling services and'",
        "'speaker_2': 'one separately for the other. And the reason why I'm kind of framing it that way is because it seems to me that the you know, the specifics of quote unquote, unbundling services currently delivered by the police, I think we have in mind a good example.'",
        "'speaker_2': 'It might not be the perfect example and there might be some specifics that are only true in the Eugene Springfield area. But nonetheless, there are some things out there that perhaps if there was a committee that was able to evaluate that and say this is why it works and this is why it could work even better in'",
        "'speaker_2': 'Alameda. And maybe that same task force might, you know, pick up some lessons learned from, I don't know, maybe something Hayward is doing something or maybe something that Oakland is doing. And the reason I'm kind of framing it that way is because it seems to me that if there's a task force that's going to be looking at'",
        "'speaker_2': 'issues regarding two, three and four, I think there are some deeper. Issues there that are about, you know, history and that I don't think are intractable. But I do think that that that they require kind of, in my opinion, a separate community input process.'",
        "'speaker_2': 'I'm just going to throw it out there like that, because at the end of the day, let me just end by saying this. At the end of the day, I think the reason why we're here. One of the big reasons why we're here is because persons that our community was concerned about the way in which Molly Watkins'",
        "'speaker_2': 'was treated on Central Avenue. And that out of that came a concern to kind of, you know, look at different ways of having our police doing things. And I think, one, your idea of the cahoots model is such a touch it feel, it's the kind of thing that people, you know, are attracted to with.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. And I. I think. Okay. Well, I'll. But I think I saw Vice Mayor then Councilman Brody. So in that order, please.'",
        "'speaker_2': 'Thank you. So I want to make sure. Well, from my standpoint, I'm not ready to move forward with any specifics tonight. I tell you, that's putting the cart before the community. As I said at the beginning, we are a month out.'",
        "'speaker_2': 'And we are. I am going. I am not going to be able to support a subcommittee to come up with a process tonight that doesn't have dates and does not commit to coming back with finalized recommended goals and objectives by the end of the month.'",
        "'speaker_2': 'And I'm not going to be able to support if we don't have milestones. I hear that you're proposing a subcommittee that's going to work with staff and that that is going to slow things down because that is the process.'",
        "'speaker_2': 'And that's fine. I just I just want to be clear. I we I want I think our community kind of expects it deserves some action so that we're not telling them to wait another month because that's how long it's going to take.'",
        "'speaker_2': 'If we have a subcommittee that's going, you know, we're bringing things back, trying to bring things back. We only have two meetings in July. So I would like to if we're going to move forward with some model, I'd like to know when they're when we're coming back with who's on the steering committee within the process so that'",
        "'speaker_2': 'we have the objectives and goals by the end of the month, because I don't want to wait another month.'",
        "'speaker_0': 'I mean, okay. So I agree that I heard Mr. Bowden say that this can be done in the month of July. And so we have two council meetings regularly scheduled in the month of July. I believe I indicated this may take a special meeting or two and what I am intending working with Councilmember Vela is to very'",
        "'speaker_0': 'quickly come up with proposals that we can bring back to Council for Finalization. But I, um. I want to see. For. Specified plans and timeline and measurables and how we're going to how we're going to decide outcomes and so and yeah and a better idea of who will who will inform us and in what shape that body'",
        "'speaker_0': 'takes. I do see this as being very community community driven. So month of July is a busy working month. Um, I think some of us have talked about there may be some things we need to do in August to if everyone's, you know, not leaving town or around some of the time.'",
        "'speaker_0': 'Councilmember Val's got her hand up. Oh, no, I'm sorry. You know, it counts. Everybody had his hand. Up next, you will be after that. Councilmember Vella. Sorry.'",
        "'speaker_2': 'Um. I mean, they were not going anywhere. So, I mean, I'm here in August. Then he went to dispose of. I mean, I agree with the vice mayor. I mean, there has to be a definitive date. And that was one of the beauties of this proposal, is that it had a fixed schedule that was fairly rapid.'",
        "'speaker_2': 'So to the extent it includes that, I would need that to support it as well. But it's interesting. I mean, the two comments about the unbundling, I think there's kind of unanimity about unbundling. Um, um, I heard Councilmember de some say, well, you know, we have to figure out what that looks like.'",
        "'speaker_2': 'And then I heard the vice mayor say, well, we don't want a preordained solution. So, I mean, what are we are we just expecting that in a month this is a come back and say unbundling is one of the things we need to focus on or I mean, are we giving them direction that, you know, um, we've'",
        "'speaker_2': 'decided we want to do some type of unbundling, you know, tell us how, how we do that. I mean, I don't know. I mean, I don't have an opinion one way or the other because they both made valid points.'",
        "'speaker_2': 'But I mean, if we've already decided that's what we want to do, do we just let them ratify that or do we start the work on it? So I don't know.'",
        "'speaker_0': 'So if my interpretation and we're going to you next, Councilmember Vella, is that I think there is agreement across the board that you all can start me or you chime in if if you're not there that we do need to and bender police services that currently sending police out on every call is not working not for police'",
        "'speaker_0': 'the community and there's better ways of delivering service now what those resources are out there to help divert those some of those calls. I have a general sense I have an aspirational goal of what I'd like it to look like.'",
        "'speaker_0': 'But as I said earlier, among other things, I think we need to analyze some data to to know, you know, we need this many social workers, you know, nurses, paramedics, what have you. I don't want to speculate, but I, I think the the unbundling is not do we do it or not?'",
        "'speaker_0': 'I think it's I think I'm hearing, yes, we do it model what's the right model. And, um, and then how do we get there in terms of, um, shifting funding and things.'",
        "'speaker_2': 'But so my question to the Vice Mayor, yes, if we give that direction is, is that qualify under his definition and I'm sorry, customer development does that part by definition of, you know, a predetermined outcome or because I want this to be successful?'",
        "'speaker_2': 'So. We look, I from from my standpoint, there are people who know this stuff. I am not that person. Right. So my proposal was that we take the police chiefs list of I think there were five different policies to include not doing traffic enforcement, not responding to five 5152, etc. And we give staff direction to have staff'",
        "'speaker_2': 'and the experts on our staff who know how to do these different things, to come up with a model and come back to us with a recommendation, they can look at cahoots and they can say, This is great, or we recommend doing something that's similar but in a different way.'",
        "'speaker_2': 'Again, whatever, whatever it is, what I'm saying is I don't want to pick. Cahoots is the thing. Let's go figure out how to do that. I want to figure out what is the you know what I would drive it again from the from the from that would be kind of the more outcome based which is the police'",
        "'speaker_2': 'saying here are some things that are not crime and violence reduction activities that we think we could find a different way to do this. But to have our staff go off and see how they can figure that out and come back and hopefully they can come back in August or September with a with a framework.'",
        "'speaker_2': 'That's what I meant by by choosing I don't want to choose like it's it's it's an X, Y and Z. It's more, you know, unbundling can be an ongoing conversation because it isn't a thing. It means looking and taking.'",
        "'speaker_2': 'And we might it it can be iterative even through the chair ways. So, I mean, what what do you envision and the steering committee deliverable on a monthly. I mean, if from my standpoint, they would come back by the end of the month with a community derived goals and objectives, definition and also a process for having a'",
        "'speaker_2': 'conversation with the community to identify what Lay looks like and what is the important things to unbundle and sets, you know. And then it comes to the council for decisions. So we're not right. This is that tension. I know some people want the community to actually decide and do it and we were elected to be that voice'",
        "'speaker_2': '. Are we are actually the civil the civilian community voice in this process? It's okay. I mean, I'm good with that if everyone else is. I just want to be clear.'",
        "'speaker_0': 'Yep. What he said. I agree. Okay. Anything else, Councilor Brody?'",
        "'speaker_2': 'No, actually, I'm good with it, no matter what anyone else says already.'",
        "'speaker_0': 'Councilmember Vella, you've been waiting patiently. So I think the other the other kind of action items here that I just I think that we have agreement on is that that we would come back by the end of July.'",
        "'speaker_0': 'So that last week of July, there would be.'",
        "'speaker_2': 'Kind of.'",
        "'speaker_0': 'I think.'",
        "'speaker_2': 'We would we would.'",
        "'speaker_0': 'Schedule some sort of special council meeting to actually get concurrence with the with these proposals. And I think that we can we can agree on that. I think there will also be and I think I heard this there will also be a number of town hall opportunities at different times in different days.'",
        "'speaker_0': 'We are going to coordinate with staff on that, also recognizing that there's other committees and groups that are meeting outside of.'",
        "'speaker_2': 'Us that.'",
        "'speaker_0': 'That we have to coordinate all that with. And then, you know, finally, I think the only other thing is just talking about. You know, and making sure that we have agreement on whether or not we want a consistent membership within the subcommittees.'",
        "'speaker_0': 'I personally think that that's important for for these conversations. I think that there's going to be a lot of kind of items that are going to need a lot of discussion around what they entail and what people's intentions around it.'",
        "'speaker_0': 'So I would like to get some sort of guidance from from our colleagues, because I think we need that as the subcommittee to go when we're we're thinking about how to who's going to be on the steering committees, what sort of commitments we're asking from people.'",
        "'speaker_0': 'Are we asking them for a month? Are we asking them for to carve out time for a longer duration? And obviously, I'll come back to the full council for approval. But I think that we have to know that now before we go out and.'",
        "'speaker_2': 'Recruit people for this.'",
        "'speaker_0': 'Yeah, I would say good point and I would be interested to know what people envision as I think somebody raised that earlier. One of you did. But what what period of time are we looking at to to have this community engagement?'",
        "'speaker_0': 'Because, you know, people need to know that. And it is my hope as I lecture everyone about COVID safety measures that more parts of our economy will open up in the not too distant future so people can get back to earning their livelihood and all that.'",
        "'speaker_0': 'So in some some regards, we've we've got kind of a captive audience right now, but I'm hoping that it won't always be for that reason. But what what time frame? Give me some some thoughts, folks. Council member Vice Mayor Knox White Council member.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_2': 'Yes, um.'",
        "'speaker_0': 'Honorable doctor. I don't.'",
        "'speaker_2': 'Know. I'm going to start with I don't know the answer to your question. I struggled a lot with this. We have five subcommittees. I think we had some some members of our community say, you're going to disperse way too much.'",
        "'speaker_2': 'And I think that there's a lot of validity to that. I think anti-racism and unbundling are long term projects and probably need you know, I have a personal interest in engaging with the anti-racism work and how that looks even at a city level and a city government level is a whole nother issue.'",
        "'speaker_2': 'But those two conversations, I think we need to kind of think about it by the end of the month. I think that the steering committee should say, here's how those things should look. I think the other ones could probably be much more time like know policy review and and oversight, which are more, you know, kind of tightening'",
        "'speaker_2': 'up things, looking at policies. You know, you could at least start spinning off things that could be acted on pretty quickly and may have different people coming in with different viewpoints. Right. But might not anyway. I would leave it up to the steering committee, but I think that looking at maybe having two or three tracks that don't'",
        "'speaker_2': 'hold the other tracks up would help. So we don't have to solve racism and then we can talk about oversight. Right. We should we should do that because that's an ongoing, lifelong discussion. Yeah, right. That's my focus. But I'm not sure if that's helpful or not, but that that's kind of how I would look at it.'",
        "'speaker_2': 'I don't know what the timeline is, and I trust the steering committee to make some work.'",
        "'speaker_0': 'Think we can probably dig deeper into that and figure out more precisely timelines, but the good and good input and I agree with that, that some of those are definitely longer term and others are shorter term and I definitely sense this community interest in participating.'",
        "'speaker_0': 'Council voted. Did I see your hand go back up?'",
        "'speaker_2': 'Yeah, I saw it. Mr. DeSantis, too. But I'll be quick. I mean, I think I would trust that council. I mean, the the the subcommittee to kind of make that decision, because for some people, it may be a month and then they're done, but for some, just let them know.'",
        "'speaker_2': 'I mean, if you if you have an interest in something that we want to keep in the steering committee, you know, it could be longer. So just, you know, give people that expectation. And but I trust you. You will be able to communicate that and determine that.'",
        "'speaker_0': 'Thank you. Councilmember Daza, you had your hand up.'",
        "'speaker_2': 'Well, in terms of the my response to your question is what kind of time frame might be looking at? I'd be looking at at the end of July, if not early August. And I say that because two things.'",
        "'speaker_2': 'One is, you know, our neighbors like San Leandro, they've made some major decisions with regards to defunding police. Now you know how they defund police. It certainly isn't aligned with the way that defunding has been defined nationally. But but it was an important decision that they've made.'",
        "'speaker_2': 'And so they've made it fairly rapidly. I've got to believe that that we can make a decision, a good decision, on a similar timeframe. But the second reason why I think late July, if not early August, is because I still believe that the unbundling services idea is looking at cahoots as a model.'",
        "'speaker_2': 'It gives us a start. I'm not saying we have to automatically adopt cahoots, but it certainly is such a great idea and it gives us a touch to see it, touch it, feel it kind of vantage point from which that we can begin to make some, some, some, some good decisions.'",
        "'speaker_2': 'And it seems as though staff is looking into this. Parts of it might not work. I think you mentioned something that the mental health or social service provider as a key part. And then and is that kind of a thing available here in the East Bay?'",
        "'speaker_2': 'We don't know. Um, but I think because we've got such a model, that's something that, that we can then have art committee members or task force members, whatever you want to call them, you know, look into it in addition to the range of other issues that Vice Mayor White had raised, you know, with regard to.'",
        "'speaker_2': 'Okay, what other how how in what other ways do you want to look at unbundling services? But my point is just simply, I think, you know, we can do a piece, baby, by the end of the month, if not early August, because I think if San Leandro can make some quick decisions, important decisions about defunding police, because'",
        "'speaker_2': 'this is how I'm defining defunding police is is unbundling services. So when people say, well, what did you do but defunding police? Well, I didn't do 50%. But but we did look at something like this, whatever came out of the unbundling services.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'I happen to think we're doing a lot. Um, but that's just me. Okay, we have heard great suggestions. We. I think we have two orders of business. One is we need to approve the subcommittee that I've proposed to move forward to bring you back these proposals as quickly as possible.'",
        "'speaker_0': 'And. Second, can we agree that we are just sending giving staff direction on the discussion and ask? I guess I should ask staff if they feel that they have. Has got sufficient direction from us. So why don't I start with, you know, we haven't heard from our city manager, Mr. Levitt, much, if at all, tonight.'",
        "'speaker_0': 'So. Mr. Levitt.'",
        "'speaker_2': 'No, I think we have some good direction. And if that subcommittee of Marisa Ashcroft and company Revelle get put together to set up the steering committee format, I'll be getting in contact with the office tomorrow morning and having them set that up for the end of the week so that hopefully by probably wouldn't be able to be'",
        "'speaker_2': 'July 7th, but by July 21st, we can at a minimum come back with a status report to the council.'",
        "'speaker_0': 'Okay. Um. Uh. Okay. And I might be looking for a little more than a status report, but.'",
        "'speaker_2': 'Well, yeah, I mean, but at a minimum, we'd be. I'll come back from the subcommittee with a status report, if not a final report by twice.'",
        "'speaker_0': 'Okay. And cancer O.D..'",
        "'speaker_2': 'I'd like to at least make a motion on the first one to authorize the creation of a steering committee to develop discussions with the council member Vela and Mayor Ashcraft and subcommittee with the membership based on, and based on the document from, uh, Councilman Vela and Vice Mayor Knox White with a deadline to report back.'",
        "'speaker_2': 'Um, let's just say July 31st. And then you could. I'm open to a different date. That's either a day earlier or a day later.'",
        "'speaker_0': 'Okay. Okay. And I would just ask that we base our work on both the policy document that the vice mayor and councilman rebels have come up with in addition to this entire discussion that the full council has had.'",
        "'speaker_0': 'Yeah, we would modify. Okay. Okay. Vice Mayor, I see your handout.'",
        "'speaker_2': 'And I think I'll second I just want to be clear. Reporting back by the 31st means with it with the proposal and the definition. I just want to be clear that reporting back could just be like, we're not ready yet.'",
        "'speaker_2': 'No, no, I want to I would like to change if we can change that language. To really clarify, we'll bring back a final recommendation for goals, objectives and a work plan. I am 100% on the support to the status of the Special Counsel meeting by July 31st.'",
        "'speaker_0': 'Thank you. That that's my understanding. Okay. We have a motion. And Councilmember Vela, you're nodding. That was your understanding as well. And staff does that doesn't give you too much. Well, let's talk about that later. I probably all.'",
        "'speaker_0': 'Okay. We're gonna move with all deliberate speed, but we want to make sure we're okay.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'All right. So we had a motion by Councilmember Ody, was seconded by Vice Mayor Knox White. Madam, quick, may we please have a roll call vote?'",
        "'speaker_1': 'Councilmember Dysart.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Councilmember Obie.'",
        "'speaker_2': 'Odie.'",
        "'speaker_0': 'I had a new member who killed herself.'",
        "'speaker_1': 'Councilmember Vela.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Vice Mayor Knox White.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Mayor. As he Ashcraft.'",
        "'speaker_0': 'I know. Just because you're sick. Thank you. Just because you're from Chicago. We only vote once.'",
        "'speaker_2': 'I'm still getting.'",
        "'speaker_0': 'That. Yes. So do you want to talk about stimulus payments to get people in that? We don't want to do that. So. Okay. We have established a steering committee and we will get going. As the city manager indicated, I'll be talking to folks in the morning.'",
        "'speaker_0': 'We'll get and we will get going. And so do we have a direction that has been given? Is the staff require anything further before we adjourn this meeting? Vice Mayor Not quite.'",
        "'speaker_2': 'Which button to mute. I want to just clarify with with Councilmember Odie that your recommendation included the request staff to review the the Chief of Police June 10th policies and bring forward ideas to help implement them. Um, if not, I will make that, make that a separate motion.'",
        "'speaker_2': 'Was that was that in your proposed process one month? Yes, it was. It was the fourth bullet under Monday action. And I just wanted to make sure it was clear it's actually incorporated. Okay. I don't know that I won't move it.'",
        "'speaker_0': 'Okay. All right. Um. Okay. This, um. You guys are amazing. This has been 5 hours. Um, and, um. And there's going to be more, but maybe not always. 5 hours. But, again, I. I just want to emphasize what I said before.'",
        "'speaker_0': 'You were doing really tough work. We don't have a lot of roadmap for doing this, but it's long overdue. And I'm I'm proud of us for tackling it. And so, um, let's just keep on doing what we're doing and get some rest because there's more work to be done.'",
        "'speaker_0': 'Um, and with that, if any note has anything else to add, I will send you say you um, yes, you may.'",
        "'speaker_2': 'I just want to say, regardless of tensions and whatever else which are going to happen, I appreciate working with all of you. Thank you.'",
        "'speaker_0': 'Thank you. I would I would second that. Everyone's nodding yes. Good. Good work, everyone. And thank you to staff. Thank you so much to the clerk's office for for making this happen. And we appreciate you and take care.'",
        "'speaker_0': 'Stay safe. Wear your masks. Be really careful out there on the 4th of July, please. No large crowds. All right. Take care. We'll see you all soon by everybody. Bye bye. Good work.'"
    ]
}