{
    "Proclamation Declaring October 2019 as Lesbian, Gay, Bisexual, Transgender, Queer History Month. (City Manager 2110)": [
        "'speaker_0': 'Thank you. Agenda changes. Do we have any agenda changes? Anyone for quick hearing? None. We will move to proclamations and special orders of the day. We have two proclamations today. The the first one is a proclamation recognizing lesbian, gay, bisexual, transgender, queer and questioning History Month.'",
        "'speaker_0': 'Whereas since 1994, the month of October has been dedicated to the celebration of the important role lesbian, gay, bisexual, transgender and queer questioning individuals have played in creating social, legal and political history around the world. And. Whereas, two historically significant days also occurred in October, the first March on Washington for lesbian and gay rights in 1979 and'",
        "'speaker_0': 'National Coming Out Day. And. WHEREAS, LGBTQ History Month sends an important message to the nation's educators, community leaders and youth about the vital importance of recognizing and exploring the role of LGBTQ people in American history. And. Whereas, in Alameda, LGBTQ History Month is a call to action for residents to work together to fight prejudice, bigotry, intolerance, hate'",
        "'speaker_0': 'and discrimination. To know and understand LGBTQ history. And support all individuals and families in the pursuit of equality and respect. Now, therefore, be it resolved that I, Marilyn, as he Ashcraft, mayor of the city of Alameda, do hereby proclaim October 2019 as Lesbian, Gay, Bisexual, Transgender, Transgender and Queer Questioning History Month in the city of Alameda and'",
        "'speaker_0': 'call on all residents to join me and record in recognizing the lasting and continuing contributions of the LGBTQ community to our community and our country. Thank you so much for listening. And does anyone on the council wish to make a comment at this time?'",
        "'speaker_3': 'Councilman two And then I wasn't. Now I will.'",
        "'speaker_0': 'So are you back on track? Councilman Brody Sure.'",
        "'speaker_3': 'I just want to appreciate the mayor for this proclamation. I mean, this proclamation means a lot more to me than it used to in the past coming out. And, you know, there's still a lot of work left to be done.'"
    ],
    "Adoption of Resolution Approving a Workforce Change in the City Attorneys Office to Create a New Classification, Chief Assistant City Attorney; Add One Position, Chief Assistant City Attorney; and Amend the Executive Management (EXME) Salary Schedule to Add the Classification of Chief Assistant City Attorney, Effective October 13, 2019. (Human Resources 2510).": [
        "'speaker_2': 'Adoption of resolution approving a workforce change in the city attorney's office to create a new classification. Chief Assistant City Attorney and one position. Chief Assistant City Attorney and amend amending executive management salary schedule to add the classification of Chief Assistant City Attorney effective October 13, 2018.'",
        "'speaker_0': 'Okay. And should we hear our speakers first so we hear what their concerns are. Okay, who's there? Who are speakers?'",
        "'speaker_2': 'Steve Lawson and Ken Peterson.'",
        "'speaker_0': 'Okay. So, Mr. Slauson, I heard your name first. Why don't you come first and then I see Mr. Peterson. You'll be next. Okay.'",
        "'speaker_4': 'Good evening, mayor. Old Growth Council members. I'm Steve Johnson live on Otis Drive. I respectfully request you table this resolution at this time. There has been no economic justification for adding this position to the city of Alameda. The public is in the dark.'",
        "'speaker_4': 'The public has a right to know exactly why we need an extra city attorney, what their duties might be. And I think it's a reasonable request. So respectfully, request again, table of the resolution this time and present that information to the public.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Mr. Sloss and Mr. Peterson.'",
        "'speaker_4': 'Good evening, Madam Mayor. Council staff. Nice to see you again. This reminds me the city attorney when Janet Curran first arrived and I was noticing that the city attorney's staff was increasing to, I think, seven employees. It reminded me of the time when Carter Chase Stroud was city attorney and he operated the city attorney's office and all'",
        "'speaker_4': 'the business by himself with assistant oh one quirk. We now proposed to have a city attorney staff of 11, including seven full time attorneys. This reminds me of the of the question of the budget. I just happened to look this evening, and I noticed that within the next couple of years, the cash reserves for this city will'",
        "'speaker_4': 'be down below $1 million. That is a drop from over $30 million in just a few years ago and a great deal lower than the level which the council had decided be the minimum cash reserve necessary to keep this city going.'",
        "'speaker_4': 'And so we should. I'm not going to blame this, Mr. Shad. He just arrived, you know. But you. You're following a long history of of ballooning costs with the city attorney's office and in other areas of city staff as well.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. So we've heard from public speakers. I'd like to ask the city attorney, even Sharon, if he could speak to this particular request.'",
        "'speaker_8': 'Of course, Madam Mayor, members of the council, I'm happy to provide an explanation to the public. This request to the council is actually probably will save the city significant costs in the short run and the long run, though, the city attorney's office is currently staff with the number of people that are indicated in the staff report.'",
        "'speaker_8': 'One of the attorneys happens to be a very long time contract attorney with the city of Alameda and at one point served as the city's interim city attorney. And over time, he has been invaluable to the office of the city attorney.'",
        "'speaker_8': 'However, as a contract attorney, the hourly rates that the city must pay is quite extensive. It is over $200 an hour, even though that is actually quite reasonable for outside counsel. General outside council rates are well in excess of that.'",
        "'speaker_8': 'If we brought this position in-house, we could probably achieve either budget neutral or budget savings immediately and over the long run. And therefore, this request does not seek to add additional staff but reorganize the city attorney's office in a way that achieves budget neutral or budget savings in the immediate run, in the long run.'",
        "'speaker_8': 'And I'm happy to answer any questions.'",
        "'speaker_0': 'And thank you, Mr. Chan. And could I ask the city manager to just discuss or just touch on the budget implications of this request? So and he does that really well because I didn't give him any heads up, but he knows this stuff in his sleep.'",
        "'speaker_4': 'So as I understand with this particular position, as as even as has said, this position has been a contract position. And so as it's currently structured, I think it's halftime. So about what it's going to be.'",
        "'speaker_8': 'I think probably, though, Mr. Walsh's hours have fluctuated over time. It's not. Our office intends to at least while Mr. Walsh is present, fill it under, fill the position that the council authorizes at a half time level.'",
        "'speaker_4': 'So so with that, based on what is currently being paid on the contract basis, there will be a savings at least in the near term or at least in the next year. I can't speak towards the future, but definitely in the near term, in the next year.'",
        "'speaker_4': 'As far as the 1 million, I'm not sure where that number comes from. We have in our next two years, we shall balance budgets in the next two years for the general fund in particular. And there are some future financial projections we're looking at that a lot of that has to do with things such as the pensions'",
        "'speaker_4': 'and other driving costs towards the city. So I'll relook at that. I don't remember that million dollars, but it might be in a future forecast over a five year projection.'",
        "'speaker_0': 'Thank you. Thank you both. So what we have before us is a resolution. We're being asked to adopt a resolution approving a workforce change in city attorney's office to create this new classification. As the city clerk, which was earlier, do I have a motion to adopt this resolution?'",
        "'speaker_7': 'Madam Mayor.'",
        "'speaker_0': 'Madam? Yes, I remember Vella and I didn't ask for council comment. Okay.'",
        "'speaker_7': 'I'm prepared to make a motion, but I also wanted to state that this. Was a regular agenda item. We didn't just add this to our consent calendar. This was a regularly agenda item that was subject to council discussion and deliberation here in open session at a previous meeting.'",
        "'speaker_7': 'So whenever we make these decisions, that's that's typically the structure. And as part of that, the public is able to weigh in at that time when it's agenda ized and it was published. I don't think there was any Sunshine Ordinance issues with it or Brown Act issue.'",
        "'speaker_7': 'So it was it was publicly available for comment.'",
        "'speaker_0': 'Well, and there's there's also a staff report here that that explains the the changes and the the financial implications.'",
        "'speaker_7': 'And so with that, I'll make a motion. Madam Mayor.'",
        "'speaker_0': 'Okay. Any other council comments? I have a motion to have a second. Have a motion is second all in favor? I any opposed you abstain. The motion passes unanimously. Thank you. Okay. With that, we move to the regular agenda.'"
    ],
    "Adoption of Resolution Appointing Adam Elsesser, Brock Grunt, Tim Karos, David Mik, Remy Moteko, Mike Rose, Madlen Saddik, and Debbie Stebbins as Members of the Mayors Economic Development Advisory Panel.": [
        "'speaker_2': 'Item six Adoption of resolutions appointing Adam Assessor, Tim Karas, David MC, Remy Motueka, Mike Rose, Lynn Fettig and Deb Severns as members of the Economic Development Advisory Panel.'",
        "'speaker_0': 'And so any of those individuals who. Well, I guess we have to first vote on that, don't we? Okay. Sorry. Okay. So council this is these are my appointees that you heard at the last meeting to the Mayor's Economic Development Advisory Panel to have a motion to adopt this resolution.'",
        "'speaker_0': 'Madam Mayor.'",
        "'speaker_3': 'I would like to move approval of it and just say that I think that's a stellar group that you put together. And I look forward to what they what.'",
        "'speaker_0': 'Could impressive president they thank you and and for all.'",
        "'speaker_3': 'Your.'",
        "'speaker_0': 'Appointment. Thank you. But as with all of our appointments, we do so appreciate you going the extra mile because everyone is a busy working person and you represent a particular sector and you give more. You go above and beyond to give your time to help advise the city on economic matters.'",
        "'speaker_0': 'And we very much appreciate that. So I have a motion to have a second.'",
        "'speaker_7': 'To.'",
        "'speaker_0': 'Have a motion and a second all in favor. I any abstentions or a position that was unanimous. Yes. Is realized. Okay.'",
        "'speaker_2': 'So three here, maybe four. So I'll come up.'",
        "'speaker_0': 'I see.'",
        "'speaker_1': 'Look, we weren't sure about later.'",
        "'speaker_0': 'Yeah, I see. I Debbie Stebbins from Alameda Hospital. Madeline Sadek from Chamber of Commerce. Tim Karras, president of College of Alameda. They'll represent the whole group.'",
        "'speaker_2': 'Do you solemnly swear to uphold the Constitution, the United States Constitution, the state of California? And the quality?'",
        "'speaker_1': 'Take a look.'",
        "'speaker_6': 'Yeah. That's good. And then I think, Oh, yeah.'",
        "'speaker_2': 'Because it didn't.'",
        "'speaker_6': 'Even have my head high.'",
        "'speaker_1': 'You're too good to see. Yeah, well.'",
        "'speaker_0': 'Okay. We are moving on to item six B.'"
    ],
    "Public Hearing to Consider the Proposed 2019 Water Quality and Flood Protection Initiative;  Adoption of Resolution Finding that a Majority Protest Does [Not] Exist, Directing a Property Owner Ballot Proceeding for the Citys 2019 Water Quality and Flood Protection Fee and Directing the City Manager to Vote Yes for City Owned Parcels; and  Introduction of Ordinance Amending the Alameda Municipal Code by Adding Article IV to Chapter 18 to Establish the Water Quality and Flood Protection Fee. (Public Works 351)": [
        "'speaker_2': 'Okay. It's a public hearing to consider the proposed 2019 Water Quality and Flood Protection Initiative, adoption of a resolution finding that majority protest does not exist. Directing a property owner ballot, proceeding for the city's 2019 water quality and flood protection fee, and directing the city manager to vote yes for the city owned parcels and introduction of ordinance'",
        "'speaker_2': '. Amending the Algerian Civil Code by adding Article four to Chapter 18 to establish the water quality and flood protection fee.'",
        "'speaker_0': 'Thank you. And I think I start first. Okay. So to the audience that thinks this might seem scripted, it is there is a legal procedure and language. And I'm I'm not going to be too spontaneous here, but we will have a chance to hear from anyone interested.'",
        "'speaker_0': 'So good evening, ladies and gentlemen. I thank you for being here. The public hearing this evening is the conclusion of the notice and protest period for the 2019 water quality and flood protection fee process. Notices of this public hearing were sent out on August 14, which began the notice and protest period.'",
        "'speaker_0': 'This public hearing gives property owners and residents another opportunity to obtain additional information about the proposed fees and services and to provide any additional input or comments to the city and to lodge a written protest against the proposed fee.'",
        "'speaker_0': 'After the end of the public comment portion of this hearing hearing the protest period will close. The procedure for today's public hearing will be as follows. Number one, first, we will hear reports from city staff and consultants about the city's need for stormwater services and the proposed fees, ordinance and ballot proceeding.'",
        "'speaker_0': 'Two Next, we will open the public hearing so that the public can speak about this measure and ask questions. Three At the conclusion of the public comment period, there will be a final call for written protest to be submitted, and then the public hearing will be closed.'",
        "'speaker_0': 'The clerk will then tabulate and announce the total number of protests submitted and whether a majority protest exists. If there is no majority protest, the Council may adopt the resolution finding that there is no majority protest. Consider introduction of a stormwater fee ordinance and direct the city clerk to proceed with the balloting process.'",
        "'speaker_0': 'All protests must be in writing and must be submitted prior to the close of the public hearing written protest, which must contain your name, the address or parcel number of your property and a signature should be submitted to the city clerk.'",
        "'speaker_0': 'So as that you so Miss Zorba. And, um. And so now will the staff and the consultant now make their presentation?'",
        "'speaker_12': 'Good evening, Madam Mayor. Members of the City Council. I am Liam Garland, Public Works Director and happy to be here tonight talking about one of the most significant items in my time here in the city of Alameda. Tonight, we're discussing the potential for Alameda to decide whether to adopt a water quality and flood protection fee.'",
        "'speaker_12': 'Tonight, what I'd like to do is walk through a slide that basically shows where we've been and looking at this issue where we are today and where we might be in the near term. And then talk a little bit about the scenario of moving forward versus not and finally, talk about the immediate steps in front of us'",
        "'speaker_12': 'tonight. If you look at the left side of this slide, you'll see the bottom part is cut off. Sorry about that. You'll see that the discussion about the mismatch between our existing stormwater fee, which has been flat for 15 years and the stormwater systems need for revenue.'",
        "'speaker_12': 'We first really started discussing that back in 2015. Since then, we've had two adopted capital budgets that highlighted the issue of that mismatch between our the revenue we're getting from our existing existing fee and those stormwater needs. We had a discussion in early 2018 in which we talked about city wide infrastructure needs, and these stormwater needs were'",
        "'speaker_12': 'part of that discussion. We came back in, I believe it was April of 2019, to approve a contract to get Jerry Bradshaw and SSCI started on the underlying fee study. It was at that of that council meeting, that council directed staff to explore two potential approaches for a stormwater fee.'",
        "'speaker_12': 'That all culminates on July 16th, 2019. So not too long ago, where council approved moving forward with a property related stormwater fee. Interestingly, on that same night of council had its first chance to really engage with the Climate Action and Resiliency Plan.'",
        "'speaker_12': 'And one of the most important near-term actions recommended in that Climate Action and Resiliency Plan, particularly on the adaptation side, was to fix the mismatch between the revenue, the existing revenue for our stormwater system and its needs. Out of that meeting per council's direction, we initiated the first step of a two step process to consider for Alameda'",
        "'speaker_12': 'to consider whether to adopt a new stormwater fee. That first step started with mailed notices to all property owners in the city of Alameda as of August 14th. That essentially opened up the process that we're closing today, and that is to have a written protest submitted.'",
        "'speaker_12': 'And if those written protest, a majority of property owners submit a written protest, then the city council cannot move forward on a ballot. Let me stop for a moment and just go back in time again, which is to talk about the remainder of August and September, where staff engaged with local community organizations to let folks know that'",
        "'speaker_12': 'this process was going on. Held two community meetings to further inform the public of posted online and in various social media about various aspects of the stormwater system. And now coming back to you tonight to hold the public hearing, should council decide to move forward with the balloting process for the second step of this process?'",
        "'speaker_12': 'Those ballots would go out on or about October 10th. So not too far from now they would be out and have to be delivered back to our city clerk by November 25th. Then they would be tabulated and the majority vote of those votes cast would win.'",
        "'speaker_12': 'So if there are more yes votes than no votes cast, then yes would win and vice versa. Those results would come back to City Council at the second meeting in December. And if Alameda did approve the fee, the that would be on Alameda property tax bill in November 2020.'",
        "'speaker_12': 'And that was a lot in terms of timeline. But it shares a little bit about where we've been, where we are and where we might be headed. If if Allen means do have the opportunity to to weigh in on the fee and the fee is successful.'",
        "'speaker_12': 'There are three main community outcomes. First, we're going to be able to continue a lot of the significant work we're doing to protect the Bay by removing trash and pollution from getting into the stormwater system and into the bay.'",
        "'speaker_12': 'So this is 200 inspections we do every year of construction sites and various businesses to make sure that they're implementing the best stormwater management practices possible. It's installing over 250 trash capture devices over the past several years that also require four times visits per year to clean those devices, to make sure that we're getting that trash out'",
        "'speaker_12': 'of the system and that they're not leading to flooding. It also, if Allen means you have the chance to support the fee and indeed do, it also means a more sustainable storm drain system where we have help to solve the mismatch between the existing revenue and those stormwater needs.'",
        "'speaker_12': 'It also means that public works can continue. It's 24 seven emergency response with our storm drain maintenance workers out before, during and after storms even in the middle of the night to make sure that storm drains are clear and that the 11 pump stations 126 miles of storm drain and 96 acres of lagoon are operating properly.'",
        "'speaker_12': 'And finally, our Allen means if if they do get the opportunity to support the fee, they'll be helping to protect property from flooding, especially given that the fee includes revenue dedicated to capital projects. And we know from the adoption of the last capital budget that $0 in stormwater funds went to stormwater capital projects.'",
        "'speaker_12': 'We also know that there's more than $30 million in high priority needs in our stormwater system and that it's especially important to be addressing those capital needs given sea level rise and climate change. What happens if Allen Medians don't have the opportunity to take action or have the opportunity and there's a majority of no votes?'",
        "'speaker_12': 'We don't know exactly what would happen in that instance, but we know there'll be some mixture of measures. Overall, the fund will be depleted. Our levels of service will be reduced. We'll have a more reactive program with longer response times.'",
        "'speaker_12': 'We'll be reducing our storm drain maintenance both before, during and after storms. There will be less street sweeping, and we'll continue the status quo of not having stormwater funds available for capital projects. You put all that together and that increases the risk of a catastrophic failure in our stormwater system.'",
        "'speaker_12': 'It also means that the city is less prepared to adapt to climate change and sea level rise. Finally, the next steps for tonight are obviously to hold the public hearing on the water quality and flood protection fee. Adopt a resolution to either of a majority protest or not.'",
        "'speaker_12': 'Further, I'm going to spend a minute on the third ball in bullet point here, which is to direct a property owner ballot proceeding and to direct the city manager to vote yes for city owned parcels as detailed in the staff report.'",
        "'speaker_12': 'There's about 111 parcels out at Alameda Point for which the fee free of charge would be around $320,000. We think about half of those fees will be passed on to our lessees out at Alameda Point. And then there's another 138 parcels in the rest of the city with total charges of about 50, almost $56,000.'",
        "'speaker_12': 'You might be wondering why it is that government parcels are charging a fee, and this is because it's a prop proposition to 18 compliant fee. There are no exemptions under the fee and those charges have to be have to be charged for government owned parcels versus private property owners.'",
        "'speaker_12': 'Finally, the last action considered for tonight and recommended by staff is to introduce the ordinance underlying the water quality and flood protection fee. This ordinance summarizes the administrative procedures for staff and this Council to, on a yearly basis, make sure we set the right fee, that we get it to council and then to the county to make'",
        "'speaker_12': 'it on the property rolls. With that, my report is finished. I'm happy to answer any questions you may have.'",
        "'speaker_0': 'So, Councilor, at this time you can ask questions. Who's got a question?'",
        "'speaker_9': 'Councilmember Desai The CPI adjustment factor is set at 3%. A CPI adjustment factor for the fee is set at 3%. I'm wondering, is there any reason why we should differ from what the Prop 13 allowable 2% increase? I mean, what's the argument there?'",
        "'speaker_12': 'Well, first, I want to make sure I get clear information out to the public, which is that there is a cap on the annual adjustment of 3%. If the I think it's the San Francisco Bay Area Consumer Price Index is less than that.'",
        "'speaker_12': 'That is what that annual cost increase would be, but it's capped out at 3%. I'll just add that if you look at construction costs, they're escalating from year to year, well above the cost of the CPI. So it's important that we at least get up to that that 3% level.'",
        "'speaker_0': 'And the other questions, Council member Odie.'",
        "'speaker_3': 'Thank you. Thank you for your presentation. Just a couple quick questions. So you alluded to this in the staff report. The this is all going into the stormwater fund, right?'",
        "'speaker_12': 'You will there'll be a new closely related fund called the Clean Water and Flood Protection Fund. And all of these all the revenue and expenses will be tracked to that one fund.'",
        "'speaker_3': 'And then can you just remind us what the purpose of that fund is and why it's underfunded today? And you know what what we're going to see kind of going forward if this is approved.'",
        "'speaker_12': 'Sure. So the existing stormwater fee has been flat for more than 15 years because there was no cost escalator or no CPI increase that could be applied. So that's challenged, number one, with the fee. And then the other challenges with the fee was that fee was never designed to capture all of the capital improvements required of the'",
        "'speaker_12': 'stormwater system. And it's certainly given it was back in the early nineties when that fee was first contemplated, was not thinking about climate change and sea level rise, which we know are urgent issues.'",
        "'speaker_3': 'Thank you. And then two other quick questions. There was I read through the protests, and I think if you protest, does that mean you don't get to pay the fee? I think I know the answer, but I want to hear you say no.'",
        "'speaker_3': 'Okay. And then lastly, I heard you mentioned that we as the city are going to pass on some of that fee to tenants. If if that was a discussion we wanted to have as a council for property owners, we could do that.'",
        "'speaker_3': 'Right. You could not today. But we could have that discussion.'",
        "'speaker_12': 'You could? Yes, that's true. Let me make sure that I'm being as clear as I can, which is there's some confusion with the word pass on out. So I'm going to say back in a slightly different way, which is that what we've looked at is that a fee as applied to an apartment building would result on an'",
        "'speaker_12': 'average sized apartment building with an average number of units here in Alameda. And if that fee went from the landlord and was covered through rent increases, it would be 1/10 of 1% of an increase. That is well within the annual general adjustment that is provided for under the municipal code.'",
        "'speaker_12': 'Does that does that answer the question?'",
        "'speaker_3': 'Yes. Thank you.'",
        "'speaker_0': 'As other questions. Council members. I have a couple, Mr. Garland, and thank you for your presentation. I to read all the letters that the protest letters that were attached. There were a few letters in support, I will say.'",
        "'speaker_0': 'But of the the protest letters and I also attended part of the presentation you and staff did at Lydecker Park, which was as that very informative. So what is the continuing themes in a lot of the letters I read is was the question of why only property owners but not renters pay this fees since everyone will benefit'",
        "'speaker_0': 'from clean storm drains and protection from flooding and sea level rise. So can you answer that?'",
        "'speaker_12': 'So with a property related fees such as this, the way proposition to 18, it requires that property owners only be balloted to decide whether that fee can be applied to property owners.'",
        "'speaker_0': 'So it's by law that this form of fee can only be borne by property owners. Okay. And then the the fees that are collected, assuming this is approved, will go into a special fund. Can the city divert revenue from that fund for other other uses, say, to backfill the general fund if it gets low?'",
        "'speaker_12': 'No. So by law, all of the revenue and expense related to this proposed fee has to stay within that clean water and flood protection fund. It can't be moved by staff to another fund. It can't be moved by the council.'",
        "'speaker_12': 'Nor can the state or county or federal government appropriate those funds for a different purpose.'",
        "'speaker_0': 'Thank you. And finally, there's no sunset clause in this measure. Do you want to speak to that or would you please speak to that?'",
        "'speaker_12': 'Sure. So when we looked at the stormwater systems needs and we looked into the future, we didn't see the needs in the stormwater system diminishing over time. In fact, with sea level rise and climate change, the needs in the stormwater system are only going to grow.'",
        "'speaker_12': 'And so that is why there is not a sunset provision there. There is a protection, however, for property owners paying the fee, and that is because of Proposition 218. The Council is bound to only set the fee to recover revenue for the stormwater systems needs.'",
        "'speaker_12': 'So let's assume for a moment that I, your public works director, am wrong and that sea level rise and climate change are not going to be issues in decades to come. Well, then future councils will have the opportunity to lower the fee, which is permissible under proposition to 18, to make sure that that fee is lowered to'",
        "'speaker_12': 'the amount of needs that are within the system. So if the needs diminished, then the fee diminishes over time. I don't see that future, but that that is a possibility.'",
        "'speaker_0': 'Thank you, Mr. Grant. Other questions? Councilmember Vela.'",
        "'speaker_7': 'Mr. GARLAND. There have been in some of the protest filed, there was a reference to the requirement that the program fee expenses are fairly distributed among property owners. And a question about, um, you know, the definitions for multi-family residential.'",
        "'speaker_7': 'Could you speak? Sure. A little bit.'",
        "'speaker_12': 'Let me start dancer and I'm going to ask Jerry Bradshaw.'",
        "'speaker_7': 'And I think how those categorizations occur in and what happens if there's a question about whether or not it was properly categorized. Great.'",
        "'speaker_12': 'I'm going to start the answer, and then I'm gonna have Jerry Bradshaw come up and finish or amend the answer. So. Oh. Essentially, what the fee proposes is to take all of the stormwater systems revenue needs and then fairly apportion them out to property owners per their contribution to the stormwater system, meaning their properties are of rain'",
        "'speaker_12': 'runoff that enters into the stormwater system that essentially looks at different land uses and grouping up of those parcels to make certain assumptions about impervious surfaces, remember driveways, roofs, things like that that do not catch runoff and keep it on site, but instead tend to push it off into the stormwater system.'",
        "'speaker_12': 'That means that the calculus behind the fee is really looking at how to fairly apportion that across those different uses. It doesn't require that it's perfect. And in terms of looking at any particular parcel to make sure that the percent of impervious area for that parcel fits in with the land use, just that it be relatively close'",
        "'speaker_12': 'and not necessarily perfect. And with that, there's also another built in mechanism in case staff and our consultants get something wrong, which we don't think happened in this instance. But in case we do, there's a way to essentially protest your fees on an annual basis and have the substance of that protest.'",
        "'speaker_12': 'It's called the disputed fees provision. It's within the ordinance that's in front of you tonight so that we've got to look at the substance of that fee as applied to the parcel and can make changes if they're warranted.'",
        "'speaker_12': 'Jerry, would you like to add anything to that?'",
        "'speaker_0': 'Sure. Good evening to you. Introduce yourself and speak right into the microphone, please.'",
        "'speaker_4': 'Jerry Bracha with SCA Consulting Group. I am the engineer on this that design the fee study for you and thanks for having me up here in general. The the as Liam said, the the the the apportionment of this fee across the different parcels that based on the contribution to the system, unlike your water system, we can't measure'",
        "'speaker_4': 'how much water comes off. It's much like your garbage rates and your sewer rates. You have to model how much contribution the different properties make. And in doing that, we have to look at the data that's available to build this model, a way to administer it reasonably, so you don't have to redo it every year.'",
        "'speaker_4': 'So the typical way, in a pretty fair way, time tested, is to create different categories. And that's what you have in before you as the different categories of land use as we close to them on land uses because apartment buildings, commercial properties, offices, schools, those groups tend to have similar characteristics.'",
        "'speaker_4': 'There's obviously variations within a group, but we have to create some sort of group of buckets to put people in. So within each bucket, you may have some parcels that are up at the high end of impervious and some at the low end.'",
        "'speaker_4': 'Yet they all pay the same rate. So there's it's not perfect, but there is no perfect system. Even if you drill down on an individual parcel basis, there's going to be flaws and you just have to go back to a reasonableness argument on that.'",
        "'speaker_4': 'So based on that, that's sort of the basis of how we do this fee, just like you do your sewer fees and your garbage fees.'",
        "'speaker_0': 'Thank you very much. Any questions? Okay. Any for the council questions? Both Mary Knox White. Mr. Becerra. Mr. Garland.'",
        "'speaker_11': 'Mr. Garland. Just a clarification, because you started to say that that there's a protection built in to Prop 218 that says if you don't need the money, you can't collect it, essentially, correct? Yes. Okay. You then said that council future councils have the option if they want to reduce the.'",
        "'speaker_11': 'But if the end of the day, I think the protection you meant is I just for clarity sake, the protection you meant to put out there was that if the money is not needed, we can't collect it in the future.'",
        "'speaker_12': 'Yeah, that's true. In other words, if there's stormwater, the needs of that stormwater system for whatever reason, decline over time or diminished, then the revenue and the fee have got to diminish with it legally required.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_0': 'Councilmember Desai.'",
        "'speaker_9': 'Question So what thought was given to doing basically a door tax approach? Because a concern that I have has to do with, say, you have a three story multifamily apartment, maybe 500 unit 400 unit, multifamily apartment, used to be called Harbor Isle Summerhill.'",
        "'speaker_9': 'So what consideration was given to a door tax approach as opposed to this impervious surface approach?'",
        "'speaker_0': 'Looks like Mr. Bradshaw.'",
        "'speaker_4': 'I didn't quite catch you. You said the vortex or.'",
        "'speaker_0': 'Door tax.'",
        "'speaker_4': 'On rain falls down and it falls on whatever down there on the ground. So if you look down the way the rain hits it, it doesn't matter. For buildings, one story tall or ten stories tall is the amount of impervious surface that projects up to the sky.'",
        "'speaker_4': 'So you can have apartment building with ten units that can sit on the same sized parcel with the same basic footprint as one that has 200 units that might be 15 stories tall. So based on that, if they're on the same half acre parcel, for instance, or three quarter of an acre parcel, they would pay the same'",
        "'speaker_4': 'fee. And usually it works out pretty, pretty fair, I think, within a class.'",
        "'speaker_9': 'So what you're saying then is on a per square foot basis, regardless of use, land use type, single family home or a multi-family home on a per square foot basis, per square foot of impervious surface basis, it should be relatively the same.'",
        "'speaker_4': 'Yeah. And actually, if, if you calculate this for the center point or the average point of each class and work it backwards, it comes out to two and three quarters cents per square foot. Guard loss of class. Now, we don't put that in the study because that's not the rate recharging.'",
        "'speaker_4': 'We're charging on a per parcel or per acre basis for convenience sake and for the sake of having these categories. But it does work out the same across all classes.'",
        "'speaker_9': 'It's just that the Summerhill Summer House apartments are just a larger impervious surface. So on a discrete basis, they're going to obviously pay much more than I will pay.'",
        "'speaker_4': 'Right?'",
        "'speaker_0': 'Okay. Any further questions before we go to public comment? Okay. So I now open the public hearing for the proposed stormwater fee. If you wish to speak, please fill out a speaker card and give it to the city clerk.'",
        "'speaker_0': 'Please be ready to speak as soon as the person before you has finished. You may only speak once during this hearing. All comments are limited to I believe it's going to be 3 minutes, because right now we have just five speakers.'",
        "'speaker_0': 'So listen for your name. Be ready to be on deck if you're the next speaker. And let's get started. That wasn't in the script.'",
        "'speaker_2': 'Allen Teague and Edward Payne are the first three.'",
        "'speaker_4': 'Good evening, Madam Mayor. Council members and staff, particularly Liam and his team. Messenger Last January, I expressed my hope that the city would set a bold course to protect Alameda from both the near and longer term effects of sea level rise.'",
        "'speaker_4': 'I am pleased to acknowledge that a great deal of progress has in fact been made. The resolution before you tonight will give us all a very real chance to be prepared for the near-term effects. Absent absent a majority protest, I urge you to vote for the resolution, and I thank you in advance for doing so.'",
        "'speaker_4': 'As for the longer term effects of sea level rise, please continue to work at the regional level and state level to ensure that the Bay Area has a plan and the ability to carry it out. Thank you very much.'",
        "'speaker_0': 'Thank you, Mr. Medved. Our next speaker, Mr. T.'",
        "'speaker_1': 'I can help.'",
        "'speaker_0': 'And please give your anything to the clerk, not to individual council members. Oh, I'm sorry. Did I? Who is their next speaker?'",
        "'speaker_1': 'Oh, it was excellent.'",
        "'speaker_0': 'Oh, sir, you must be the one after Mr. Teague.'",
        "'speaker_4': 'First off, thank you so much for passing the proclamation and LGBTQ Heritage Month. Well, History Month. As I grew up gay did not exist, which makes it very difficult for you to determine who you are. Thank you. First off, I want to thank Gerry Bradshaw and Liam Garland for answering my many questions.'",
        "'speaker_4': 'Unfortunately, they didn't ask one, which was what were the alternative rate calculations that we could do? According to the California Constitution, the local government bears the burden of proving by preponderance of evidence that the cost of governmental activity are allocated on a parcel in a fair and reasonable relationship to the parcels burden on their activity.'",
        "'speaker_4': 'In this case, a parcels impact on the stormwater management system. Preponderance basically means based on convincing evidence and is probable truth or accuracy, not on the amount of evidence quality over quantity. We have two neighboring pilot parcels. One is a lot filled with a 30 plus unit apartment building, and the other is a large single family home'",
        "'speaker_4': ', which was converted to five units. Both lots are just under half an acre. The apartment building has almost 100% imperviousness and drains most of its rainfall into the storm drains. The five unit property has a property, approximately 55% imperviousness, and the vast majority of the rainfall is absorbed into the ground as the imperviousness is separated by pervious'",
        "'speaker_4': 'material between the back and the front. Both of these parcels will pay the same. Under this parcel, this property proposition. The only difference between the five unit and a single family home, which would be two, three or two or four units, is that it was converted the carriage house into two units, making it five.'",
        "'speaker_4': 'So the footprints of the buildings are the same as it was in 1900. This is a single piece of evidence that exhibits an unfair and unreasonable, unreasonable relationship of the impact of one parcel on the stormwater system. What I gave you was showing you that 10% of the parcels is supposedly representing 58% of the costs of the'",
        "'speaker_4': 'stormwater system. 10% of the parcels of Alameda. 10% paying. 58%. On the surface, that does not sound like the actual impact. So I am in favor of funding this project. I want to pay my fair share. I am not asking for my property be excluded or changed specifically.'",
        "'speaker_4': 'I am looking for fair and reasonable allocation of the costs. I don't see how this Council can make that finding with the current distribution. I do want to fund this project, but I would like to do it in a fair and reasonable way.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Next be.'",
        "'speaker_2': 'Here. Edward Payne. Then Ken Peterson. Then Ruth Abbe.'",
        "'speaker_0': 'Mr. Payne.'",
        "'speaker_4': 'Good evening. My name is Ed Payne. I was raised here in Alameda. I'm here speaking on behalf of six homeowners and members of the Waterfront Homeowners Association. The purpose of me being here tonight is to inform the council members of the hundreds or thousands of tons of debris that is dumped on our properties every year for years'",
        "'speaker_4': 'from a storm drain. I've got pictures here showing the damage to our property from this from the debris and sediment and rubbish and trash and pollutants that it keeps get dumped on to our property every year. Two surveys showed that in a period of 20 months, 252 tons of debris and trash has accumulated on our properties.'",
        "'speaker_4': 'Now, in all fairness, I've met with the director of Public Works yesterday morning and we discussed this. We showed them that one of the problems we have is a broken storm drain. Now, the reason I'm here tonight is just to simply inform the council members.'",
        "'speaker_4': 'And I my hope is, is that a solution can be obtained to stop this dumping of debris from this storm drain onto our properties. Where, you know, we're our properties are being destroyed and these are properties which we pay taxes on.'",
        "'speaker_4': 'And, you know, we have a right to we've paid a premium for our properties. And I think that it's fair that a solution be found. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Payne. And I, I I'm happy to hear you talking with the public works director and staff certainly has heard your comments that thank you and staff will follow up with you. Our next speaker, Ken Peterson.'",
        "'speaker_0': 'Mr. Peterson.'",
        "'speaker_4': 'I think that's me. My hearing isn't very good.'",
        "'speaker_2': 'So Ken Peterson.'",
        "'speaker_4': 'Thank you. I'm Ken Peterson. The problem with the stormwater and the effluent is certainly is a serious problem. One of the great concerns currently with the environment has to do with plastics and the amount of plastics that are going into the waterways, the oceans and so forth, and the effect on the life of these small particles that'",
        "'speaker_4': 'can be ingested and get into the food chain. I was surprised to note that the containment filters that are in the system as proposed use plastic, plastic which can break down and go on into the oceans just exactly what we don't want to happen.'",
        "'speaker_4': 'And so I'm wondering why they choose a plastic where they can use an organic alternative such as Excelsior or Raffia or some other material which can break down and can be digested by the wildlife.'",
        "'speaker_0': 'Thank you, Mr. Peterson. Miss Abby.'",
        "'speaker_1': 'Good evening, Madam Mayor. Members of the City Council. I was a participant in the city's stakeholder process for the Climate Action and Resiliency Plan, and I attended all of the meetings of that plan. I also attended all of the meetings of the proposed stormwater fee and the infrastructure proposal for that's before the city council tonight.'",
        "'speaker_1': 'This is really an essential part of the city's infrastructure to protect the city from the impacts of sea level rise. And I would urge the council to move forward with this ballot, to put this on to the property owners tonight.'",
        "'speaker_1': 'And we would look forward to a partnership with the city and getting the word out about the essential nature of this fee. It is so very important that our storm water system be able to carry away the the waters that come from the storm surge, from storms from into our storm drains and out to the bay.'",
        "'speaker_1': 'And and this will protect the city for years to come. If we want to ask state and regional agencies to support the city in our future, protecting ourselves from this lot sea level rise. We need to ensure that we are doing our fair share, that our residents, ratepayers, our property owners are paying for the systems that we'",
        "'speaker_1': 'need to maintain to protect our city. We can't expect state, regional or federal. Agencies to fund our problems if we are not ready to fund them ourselves. So I very much encourage the City Council to put this issue before the property owners and to support the passage of this ballot.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. And Mr. Ashby was our last speaker. Okay. So are there any other people who would like to speak on this issue? Are there any written communications to be read into the record? Are there any other communications the public wishes to make?'",
        "'speaker_0': 'At this time, I am issuing the last call for written protests for the proposed 2019 water quality and flood protection fee. Please turn in any written protest that you wish to have counted. Protests received after the close of the public hearing will not be counted.'",
        "'speaker_0': 'So do we have any protests that have been turned in in the course of the meeting? No. Okay. The public hearing is now closed. City council members. Are there any final questions you'd ask of staff before the city clerk tells us whether there has been a majority protest?'",
        "'speaker_1': 'Madam Mayor.'",
        "'speaker_0': 'Councilmember Bella into the microphone, there.'",
        "'speaker_7': 'Were some questions raised.'",
        "'speaker_1': 'About the public speakers.'",
        "'speaker_0': 'And did you wish Mr. Galan, Mr. Bradshaw, to go back to the microphone?'",
        "'speaker_7': 'Yes.'",
        "'speaker_0': 'Did you delegate Mr. Galan okay?'",
        "'speaker_4': 'Yeah, I didn't.'",
        "'speaker_0': 'Just be surprised to.'",
        "'speaker_4': 'Hear it. Thank you. Mr. T brought up some interesting points and handed out some materials. He mentioned that 10% of the parcels, the nonresidential portion of the city would pay about 58% of the revenue. And that's true. But what he didn't have he didn't have how many acres were in the nonresidential, because this is more of a'",
        "'speaker_4': 'per acre type of fee than a number of parcels. Obviously, the nonresidential parcels are oftentimes much larger. 49% of the acreage in town is nonresidential and they pay that 58%. So they do pay a little more than their fair share per acre.'",
        "'speaker_4': 'But as you might guess, apartments, shopping centers, things like that are much more covered in impervious surface than our residential parcels. So that kind of fits and that makes sense.'",
        "'speaker_0': 'What was that percentage again?'",
        "'speaker_4': '49% of the acres in town are in that category of nonresidential, and that's what fuels that 58% of the revenues. I also did a quick calculation. I mentioned earlier that the the core element is a two and three quarter cents per square foot of impervious surface that that is universal across all classes.'",
        "'speaker_4': 'We don't apply that to individual parcels because it's just unworkable to have a system where you do all 20,000 parcels and drill down on each one year after year, keep track of changes to the add their driveway, all these things, it's just unworkable.'",
        "'speaker_4': 'That's why we do it. A statistical approach that is more durable. But if you were to take that two and three quarter, since we calculate the 55% impervious area on his particular parcel would come out to a fee of about $316.'",
        "'speaker_4': 'Now he's being levied 436 So yeah, he's at the lower end, but it's much closer to the 436 that he's been levied within the $85 a year he would want to be in as a single family residence on a large parcel.'",
        "'speaker_4': 'I did a quick one for the parcel next door, which is paved over 34 units and he would pay under that drill down number about 546. Instead of the 436, he'd be in charge. So you see, there's there's, you know, pluses and minuses within each group.'",
        "'speaker_4': 'But those are both much closer to the $436 that they're each being charged than to the residential rate of $85, which is what it is for a large residential parcel.'",
        "'speaker_0': 'All right, thank you. And city attorney Mr. Shen.'",
        "'speaker_8': 'I just want to ask Mr. Bradshaw a question and possibly to correct the record. Mr. Bradshaw, you mentioned, as you were explaining to the council, the fair share calculation you have. I heard you say something to the effect of they do pay more than their fair share.'",
        "'speaker_8': 'I'm assuming that's a misstatement. I think what you meant to say. So they do pay their fair share no more, no less. Consistent with your calculations?'",
        "'speaker_4': 'Yes. That is based on the statistical approach that we take for the entire rate structure.'",
        "'speaker_0': 'Thank you. Okay, Miss Vella, were your questions answered? Okay. Thank you. Anyone else? Vice Mayor Knox. What?'",
        "'speaker_11': 'I think this is a question for Director Garland. My memory is that when we talked about the climate action and resiliency plan, that the stormwater system and I don't remember, but I believe the stormwater system is kind of the first system in this.'",
        "'speaker_11': 'City that is going to be impacted and that we do not have the funding for this. That's right. So beyond just taking care of maintaining and running the existing system. This fee is going to be needed in order to address that issue and and others.'",
        "'speaker_12': 'That's right. And so there's two components to that. One is, with climate change, we're going to see more frequent and more intense storms. And that means our stormwater system in its capacity is just going to have to increase.'",
        "'speaker_12': 'And the second portion is that our perimeter is going to have to deal with sea level rise and those for those perimeter improvements. This proposed fee is a funding source.'",
        "'speaker_11': 'Okay. Thank you. And then my second question is more of a leading question. There's 20,500 spots. There is there is a talking point out there that somehow that we have used property the city has chosen to 18 method because the city gets to vote on its parcels and somehow that's going to have a huge impact on the'",
        "'speaker_11': 'outcome of this. But I believe the staff report says there are 138 parcels that the city controls that we will be discussing tonight, but that there's 20,590 or 20,600 total parcels. So it's that's less than a half percent.'",
        "'speaker_4': 'So I think that's correct.'",
        "'speaker_0': 'Looking for a yes.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Question and Councilmember de SAC.'",
        "'speaker_9': 'So my understanding is that part of this will will help cover the costs of fixing the lagoons. Isn't that a cost that's borne by the homeowners on the south side of the lagoons right now?'",
        "'speaker_12': 'Let me explain. So the for both our South Shore lagoons and for the lagoons out on Bay Farm Island, there are maintenance agreements that involve both the affected homeowners associations and the city. And those maintenance agreements delineate difference maintenance responsibilities that get into a level of detail of, hey, if you're doing X maintenance, the city pays 30%'",
        "'speaker_12': '. Homeowner's association plays 70%. And with different maintenance activities, there's different percentages that apply. And what not everybody knows is that those systems, those lagoons are a part of our stormwater system. That is where stormwater often goes, settles before it gets to the bay.'",
        "'speaker_12': 'And so the answer is yes that that this proposed fee could help fund some of that maintenance and capital work around the lagoons and that those adjacent homeowner's associations would still be responsible for their portion under those maintenance agreements.'",
        "'speaker_9': 'But the city is also kicking in as a whole, so it's lessening the south side of the lagoons. The residents who live on the south end of the lagoons, they're going to have to. They're going to. There's contribution will could potentially lessen because the city, if this passes, would be kicking in more.'",
        "'speaker_12': 'No, I'm not aware of that that the whether this fee is approved by Alameda INS or not will not change the portion which that the adjacent homeowners association is responsible under the current maintenance agreement.'",
        "'speaker_9': 'Okay. Okay.'",
        "'speaker_0': 'Okay. Any further questions by council? All right. Um. So, um. Okay. So we've asked our final questions. Can the clerk tell us the total number of protests and whether there is a majority protest?'",
        "'speaker_2': 'There are 20,578 parcels affected by the proposed stormwater fee. Therefore, to achieve a majority protest, we would need to have 10,290 protests after considering the protest submitted prior to a public hearing. And there were none submitted tonight. There are a total of 64 protests.'",
        "'speaker_2': 'Therefore, there is not a majority in the Council. May consider the resolution and fee ordinance.'",
        "'speaker_0': 'Thank you. Is there a motion to approve the resolution stating that a majority protest does not exist? Directing a property related ballot, proceeding for the city's 2019 water quality and flood protection fee, and directing the city manager to vote yes for city owned parcels and to introduce the ordinance establishing the water quality and flood protection fee.'",
        "'speaker_3': 'So moved.'",
        "'speaker_7': 'Back and.'",
        "'speaker_0': 'I have a motion and a second all in favor. I opposed abstained. The motion passes all of the motions passed unanimously. Thank you very much, everyone, for being here. And I would like to just call a quick ten minute break before we go into our next item.'",
        "'speaker_0': 'So it is almost 835. We will start again at 845. We're moving along really well. So everybody be back on time. I'll see you then. Thank you.'",
        "'speaker_4': 'Morning.'",
        "'speaker_9': 'I a.'",
        "'speaker_2': 'Call. There's brownies and cookies back.'",
        "'speaker_9': 'Okay.'",
        "'speaker_1': 'Si.'",
        "'speaker_9': 'Si, si. Okay. Okay. Okay.'",
        "'speaker_11': 'Now, are you driving?'",
        "'speaker_4': 'Like I said.'",
        "'speaker_1': 'We are ready to go.'",
        "'speaker_0': 'All right. If I could ask everyone to take your places, please. Um, could I ask everyone to be seated or to take your conversation out to the hall? Those in the aisle? Could I ask you to sit down?'"
    ],
    "Recommendation to Approve the Design Concepts for Up to Six Public Access Pathways Along Fernside Boulevard and Eastshore Drive.  (Recreation and Parks 280)": [
        "'speaker_0': 'Thank you. Okay. We said we'd start at 845. It's 845. We are moving on to item six C.'",
        "'speaker_2': 'Recommendation to improve the design concepts for up to six public access pathways along Front Side Boulevard in Eastridge Drive.'",
        "'speaker_10': 'Thank you. Good evening, Mayor and Council. I'm Amy Wooldridge, Recreation and Parks Director. So to give you a little bit of background as part of the title Canal Transfer Project in 2016, six public access pathways were identified along three on fern side and three on East Shore Drive, and they were identified as needing further community discussion and'",
        "'speaker_10': 'staff was directed to do a feasibility study of the recreational opportunities at those pathways. With that, we conducted an extensive public input process. We in September and October of 2018, we had 44 people attend two community meetings and and 494 people complete an online survey.'",
        "'speaker_10': 'We also did more detailed analysis and learned that all of these six pathways are not owned by the city, but in fact, we have a public access easement over the ownership of these pathways. However, the one at Myers, the last one at Myers, and I'm sure the city neither has ownership nor is it subject to an easement'",
        "'speaker_10': 'as part of during these community input meetings. There was community request for the police department to look more into security aspects of these pathways. So subsequently, the Alameda Police Department staff who are certified in what's called crime prevention through environmental design, affectionately known as Supt, had conducted a thorough assessment of all six pathways using the September criteria'",
        "'speaker_10': 'and issued report that's included in your packet. This information helped inform our recommendation in response, also in questions at the meeting of the City Attorney's Office after the public input process concluded, conducted further title analysis to clarify boundaries, ownership and other property rights, and also did further analysis by the risk manager.'",
        "'speaker_10': 'So all of this information also with meetings with the public information officer, planning and building and Transportation Department, City Attorney's Department, Risk Managers, department, police department, all of those staff in these aspects informed this recommendation before you tonight.'",
        "'speaker_10': 'In addition, the Recreation and Parks Commission supported the staff recommendation at its June 13th meeting, as it appears to as presented to you tonight. So jumping into the recommendations before you, this is just the overview of all six pathways that have been analyzed on pathway A the first pathway.'",
        "'speaker_10': 'It's on fern side near High Street. It is the recommendation is to leave it open as a viewing area to the water in its current condition with minimal improvements in the short term. If you've walked it, this is a very narrow and winding path, very decorative, very easy to walk by if you don't really know it's there'",
        "'speaker_10': '. It's not in compliance with the American Disabilities Act, ADA Due to its grade and its width, it's fairly steep. It goes up and then down and ends you on essentially the back deck of the house there. The feasibility study consultants concluded there would be at least $750,000 to do improvements to get it to ADA compliance.'",
        "'speaker_10': 'And really it's a high number because it requires significant grading, significant amounts of retaining walls and earthwork, especially because the houses on either side have access to two, two front and side doors directly from the pathway. So what the recommendation is, again, is to leave it as a viewing area to the water in the short term to'",
        "'speaker_10': 'install a fencing that's 35 feet wide at the water's edge in a cone or funnel shape back to the ten foot easement to also add safety, lighting and address to the landscape there for safety. The September guidelines for landscape is that you trim bushes up.'",
        "'speaker_10': 'So the I'm sorry, trim trees up. So there's a three foot view clearance and trim bushes down to three feet. So you can see over them. It's essentially creating sightlines for as people walk down the path, they can see what's toward the end.'",
        "'speaker_10': 'And as police are driving by, they can have a better view corridor down. So longer term, we would include this pathway in the design work of the overall pathway design project and we would seek funding through grants, but it would be the last priority for funding overall for this project.'",
        "'speaker_10': 'Pathway B is located at four inside below. Art and Mona Vista Avenue. This also is recommended to be improved as a viewing area to the water with the 30 foot 435 foot wide at water's edge. You can see it in the blue lines here with the cone shaped back.'",
        "'speaker_10': 'It's about 30 feet back to the ten foot wide public easement and each of these 30 foot wide cones. The intention really is to create landscaping on each side. I kind of think of it as defensible landscape. And actually, I think that's a I think that's a term the police chief came up with.'",
        "'speaker_10': 'Be it thorny bushes, things like that. So you sort of have it because with residential so close, you want to create something that softens the edge there. So creates a more pleasant viewing area, but also discourages people from heading the direction they're not supposed to go toward residential.'",
        "'speaker_10': 'It would also include, you know, benches, trash and recycling and other potential amenities that would be designed for a water public viewing area. Pathway C is recommended to be vacated to vacate the easement. There are significant safety concerns that staff has for this pathway.'",
        "'speaker_10': 'I'm going to show you photos in just a second. But essentially the risk manager went down here and had had significant liability concerns because you're having the pathway open, encourages pedestrians with a blind walk up to where cars are backing out in a tight location.'",
        "'speaker_10': 'And what I'm going to do, skip ahead for a second, because what I did here is took this is as if you're walking down the pathway. So starting on top left is basically at street side and then you start walking closer and you have this tall hedge to the side which is on private property.'",
        "'speaker_10': 'So that's the owner's right to have that heads. There's nothing we can do about it. If you keep walking closer, top left again to top, right, bottom right and bottom right is where you just start seeing the driveways to your right.'",
        "'speaker_10': 'So if you can imagine, you have, you know, a kid on a school bike, whatever, and you're encouraging them to come down this pathway. It takes a while because of the blindness of this hedge before you can actually even see the cars that might already be pulling out of the driveway.'",
        "'speaker_10': 'And it's not until you're at this point where you actually see the cars coming out of the driveway or the parking garage. Plus you can see the driveway on the other side. It's been this pathway has been compared to, well, what about in park parking lots or what about in long driveways?'",
        "'speaker_10': 'And I really see the difference is when you're, say, the Lincoln Park driveway, if you're a pedestrian walking down the driveway, first of all, you know you're in a driveway. Secondly, you're walking parallel to where the cars are coming versus walking straight down a pathway and a cars coming out perpendicular to you unexpectedly.'",
        "'speaker_10': 'So one option, though, that I wanted to offer up that's not in the staff report because it just came to my attention a couple of days ago. We had an onsite meeting with Bccdc as well as some other staff.'",
        "'speaker_10': 'One option would be for a deed in vacating the easement to create a restriction so that there is the owners have to maintain a view corridor and that could look a lot of different ways. But essentially it would be mean that the owners could put up a gate, for example, but maybe it is only a three foot'",
        "'speaker_10': 'gate so that you still from street side can have a view corridor out to the the water. So that was something that could be considered. Pathway D This is a short drive and liberty. It's already a very well used public pathway.'",
        "'speaker_10': 'The recommendation is to improve it as a water viewing area and remove existing encroachments where you see the dotted line there on the on the on the photo is where there's an existing tall hedge and then a fence.'",
        "'speaker_10': 'And the recommendation is to remove those, put a fence that's pulled back closer to the edge of the existing public easement and open up that area for the public, which makes it approximately about a 40 foot, 45 foot wide public access area.'",
        "'speaker_10': 'We also recommend installing benches, rocks and logs for decorative seating, trash recycling. Also there you can kind of see it on this photo. There's a real rough lee poured concrete out at water's edge. Some folks think that some contractor years back just dumped some extra concrete out there like that's it looks that bad.'",
        "'speaker_10': 'So we would recommend removing that concrete, making it a better entry way to the water. We'd have to work with an architect in regards to sea level rise and all of that for all of these projects. But in this case, I think there's opportunities to make it in an informal access to the water for kayakers, canoes.'",
        "'speaker_10': 'Stand up paddleboarders. They're already using this point to access the water, and I think we can make it just an easier access for them. And without putting in a formal kayak launch, I'm recommending as part of this and the idea came up actually at the community meetings that the formal kayak launch and by formal I mean actual'",
        "'speaker_10': 'where there's parking and there's accessibility and there's actually a gangway to a kayak dock that kind of a more built up amenity. I'm recommending that be it to Water Park, which is at the base of the bay from Bridge.'",
        "'speaker_10': 'It's an existing park. There's existing parking. Rather than trying to squeeze a formal kayak launch into a local neighborhood, because a formal kayak launch really is going to draw people from all over the island. Whereas I think an informal kayak launch is something that the local neighbors can walk to and use, but then we can use an'",
        "'speaker_10': 'existing park for something that'll draw bigger crowds. In addition, just want to mention I did consult a local kayak operator as to where some of the best spots were on the island to launch. And he actually said to Water Park was one of his favorite spots to to launch.'",
        "'speaker_10': 'And I think that's an important point because he knows these waters. And also it's important to note that water park is closer to deep water. You can even see in this photo all of the mudflat there. So you'd have to if you're going to do a formal launch, you'd have to really get it out there pretty far'",
        "'speaker_10': '. It's about 80 feet to deep water. Lastly, almost lastly, we have the pathway at East Shore Drive in Central Avenue. There's a pump station here as well. It's already pretty wide open. It's nicely landscaped. And so there really are no significant encroachments over the public access easement for the city to work through on this one.'",
        "'speaker_10': 'It's a really well-used pathway. And so we would recommend to keep it as public access to view the water and improve it with similar public amenities I've mentioned before. And then pathway F is it mires and as we've talked about, there's no city ownership and no city easement.'",
        "'speaker_10': 'So this will remain closed to the public. So next steps are that we would adjust the boundaries for next steps. One is to adjust the boundaries and we would survey the modified pathway boundaries to create new legal descriptions, sell the unused easement areas to the owners that are to the owners that are the underlying owners of the'",
        "'speaker_10': 'area. In the case of the fern side, those three pathways we would also sell the submerged land. There was submerged land that was put around people's docks as part of the tidal canal transfer. And these six owners have been waiting for this process before they could purchase their submerged land.'",
        "'speaker_10': 'So that would be bundled together. With this, we are will be recommending to keep the submerged land that extends out from the city easement under city easement, but allow existing docks to remain. But we can certainly put caveats that there's no future docks that can be built and added in that area.'",
        "'speaker_10': 'We also be recording easements with clear legal descriptions and clear statements of obligations such as city obligations to maintain these areas in an appropriate way. Lastly, we'll be implementing supported staff safety measures like fencing, lighting, landscape improvements and possibly surveillance cameras.'",
        "'speaker_10': 'So that's the boundary issue. And then we'll also be working on concurrently is engaging an architect to design all five pathways. Once we have a design, we'll need to submit for regional permits. As you know, we'll need to submit for the the Bccdc Army Corps and Regional Water Quality Control Board.'",
        "'speaker_10': 'And so that permitting process for the public's knowledge takes generally at least a year. And then we would start construction once we have permits. And I just want to be clear that, you know, we have a little bit less than $1,000,000.'",
        "'speaker_10': 'Money goes fast. So what we'll have to do is prioritize funding based on uncertain improvements with the goal to get grants and other funding to eventually do all of the improvements. But as I mentioned before, that we'd be prioritizing on pathways B, D and E, so, you know, A, the one that's small and winding would be the'",
        "'speaker_10': 'last priority of the bunch. And that. My report, I'm happy to answer any questions.'",
        "'speaker_0': 'Do we have any clarifying questions from the Council before we go to public comment?'",
        "'speaker_3': 'Councilmember Brody. Thank you, Madam Mayor. Thanks for the presentation. So you mentioned existing docs, which would remain, but no new docs. What about maintenance? Because that was kind of a big issue with the whole tidal canal. Like, if somebody's doc needs to be repaired, are we going to allow them to repair that or.'",
        "'speaker_10': 'Yeah, absolutely. I mean, we we haven't worked out all the details of the submerged land, but the goal really is to to to just like the other owners had, give them ownership of the land around the sorry around their existing docks.'",
        "'speaker_10': 'And once they have ownership of the submerged land around their existing docks, then then they can go do get the permits through the city for improvements.'",
        "'speaker_3': 'We didn't put any any restrictions on those property owners on, you know, adding a dock or anything. Like I said, I just want to make sure we don't have any issue. If somebody says, well, I'm repairing it, well, maybe they want to extend it two feet or, you know, replace every single plank with, you know, something recyclable'",
        "'speaker_3': 'instead of wood or whatever. I mean, I just wonder how we draw the line between what we consider new or improved versus what's considered repair and maintenance.'",
        "'speaker_10': 'Sure. The intention is not, and the details aren't all worked out, but the intention certainly is not to impede, repair and maintenance. The intention was that you have these viewing areas. We want to maintain views of the water.'",
        "'speaker_10': 'So certainly. So the restrictions would be more on if you have a dock that ends here, you can't extend it another ten feet this way that now impedes that now is in the city. So the easement of submerged land.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Thank you. If you further maturity.'",
        "'speaker_3': 'I mean, I'll have something later.'",
        "'speaker_0': 'Okay. This mayor, this may not sway.'",
        "'speaker_11': 'Yeah, sir. Thank you very much. Very helpful staff report. Really happy to see us get to this point. So thank you for all the work you've done. Just two questions. So I know that the recommendation is to to release the easement on on pathway C, but what are the other options the city has beyond giving up public'",
        "'speaker_11': 'access to the waterfront in that location?'",
        "'speaker_10': 'The only other option staff has come up with. We can certainly do signage. Signage has limited capacity in terms of people actually looking at it. We see that in parks all the time. It does have some capacity in terms of kind of more legal coverage.'",
        "'speaker_10': 'There's also the option I mentioned in terms of putting a restriction on. So there's a view corridor. You know, we would have to look I haven't looked honestly in significant depth at other potential, you know, in terms of public works and May has knowledge about street safety and things like that, like ways to warn pedestrians.'",
        "'speaker_10': 'We'd have to come up with some pretty creative ways, given the blind view of how to warn pedestrians that a car is coming out.'",
        "'speaker_11': 'So I guess I'm wondering if there's possibly if that's not where the council wanted to go today. Is there a way for us to maintain our easement without actively improving it or actually encouraging the use of it at this point in time?'",
        "'speaker_10': 'I did my initial conversations with with legal counsel was that we could if we were going to maintain it but not do anything to it, we really should close it off and then simply maintain it. Because if we're not taking care of it, then that creates other issues.'",
        "'speaker_11': 'Okay. But within that case, we were essentially the property owner or whoever could use it. Well, while the city is not using the easement in a future time, the city decided to come back and say there's an easement there that we would like to use.'",
        "'speaker_11': 'That could be a did, I guess. I'm sorry, I don't to look at you and even. But I'm looking back and forth between you.'",
        "'speaker_10': 'And me, right? Yeah, absolutely. That would be. Yes, I believe so. That that would be an option. What we'd probably would need to do is put a gate beyond the driveways so they can easily access. But that's something we would need to work through with the neighbors.'",
        "'speaker_10': 'Okay.'",
        "'speaker_11': 'And then you mentioned the fact that we may not have enough money in the money from the sale of the properties to. Fix up the water park idea really hasn't nothing here. You're just saying we should do a doc or something?'",
        "'speaker_10': 'Right. I wouldn't fund it out of this. There's actually a a great funding source specifically for not for KAYAK launches through division of boating and waterways through the California Parks and Rec. And I've spoken to staff there and they actually don't get enough applications to even spend the money they have.'",
        "'speaker_10': 'So I'm happy to spend it. So I think there's other funding options for that. I'm offering it up because I know when we started this process there was a lot of interest and drive and energy behind a kayak dock and a kayak launch.'",
        "'speaker_10': 'And I'm offering this as an alternative for a more here's a better place, I think, to put a more formalized kayak launch. Right.'",
        "'speaker_11': 'And so for the folks who live, because there are a lot of people who live in this neighborhood who do have paddleboards, kayaks, canoes for somebody who wanted to get on the water. Right now, you can't go out at low tide because the mud is, you know, my texture.'",
        "'speaker_11': 'And it's kind of dangerous to walk there. I mean, you can actually get stuck. So in the current proposal, we would not you would still have that you can use. You can if you time it with the tide, you can use it.'",
        "'speaker_11': 'But if not, then kind of what's being called the informal access to the water.'",
        "'speaker_10': 'That's correct. It would still have to be timed at the tide. Okay.'",
        "'speaker_11': 'So but tonight we could decide to say we'd like to see something. I'm going to call it more formal, not necessarily designed, you know, in the in future plans, knowing that there's no money to do that today.'",
        "'speaker_10': 'Yeah, that's absolutely in your purview.'",
        "'speaker_0': 'But you know, did you ever hear that when you go first, I'll go back.'",
        "'speaker_9': 'But let me ask this question, though. We as a city weren't do we contemplating affirmatively encouraging activity like paddle boarding starting at the end of any one of these pathways? And I raise that because. I mean, are we going to like put notices that says paddle boarding is allowed or whatever?'",
        "'speaker_9': 'Yeah. I mean, well, so what it what's the and I'm actually raising that question because just if we're like potentially setting us up for some liability issues, I mean, I mean, there is a lot of mud out there when the when the tide is far away.'",
        "'speaker_9': 'And there, unfortunately, was several years ago a kid who got stuck in the mud and I think passed away. Granted, not on that side, but near the bird sanctuary. So I guess the question is, do our do are we contemplating actually affirmatively encouraging some kinds of active uses there or are we is it best to remain silent'",
        "'speaker_9': 'on that matter?'",
        "'speaker_10': 'So the intention was to essentially leave his existing condition, but make it just a little more appealing location and easier, slightly easier access, but not to put a big sign saying kayak launch, not to advertise it as a kayak launch, but there's informal kayak launch locations all over the island here that were places where people launch their'",
        "'speaker_10': 'kayaks and paddleboards that don't have a dock. It's all over the place.'",
        "'speaker_9': 'At their own risk, though.'",
        "'speaker_0': 'Yeah. Yeah. And just to tag on to that. Have you talked to the city attorney's office about the legal implications of doing it, too, at a park? Or if if we were to do a formal kayak launch?'",
        "'speaker_10': 'I don't see any legal implications with putting in a formalized kayak launch. I mean, we're putting in a kayak launch yet and small boat launch facility right now. So as long as you are.'",
        "'speaker_0': 'See, I didn't mean kayak. I meant paddle boarding. But, you know, maybe it's the same concept.'",
        "'speaker_10': 'But you're talking about it to water the more formal one. Mm hmm. Yeah. If you're putting in the formalized launch, it's got. It's it's has to conform and go through bccdc. And all of the regulatory permits has to be, you know, accessible.'",
        "'speaker_10': 'So at that point, it suffices to all of the safety and other standards that that we would need as a city.'",
        "'speaker_0': 'I know the city attorney's office has been working on this. I mean, certainly on the lease, in the easement aspect of it. Is there anything you'd like to add, Mr. Shen?'",
        "'speaker_8': 'Sure. I think the way that, um, our community recreation staff is proposing to improve these park these pathways will likely reduce liability to the city because the city currently owns these easements. And to the extent that we can make them ADA accessible, remove hazards that will probably produce a positive benefit with respect to liability to the city'",
        "'speaker_8': 'in the long run.'",
        "'speaker_0': 'Okay. Thank you. I have just a couple of questions. And so to Ms. Wooldridge, if you know, what are the approximate sales costs of the remaining portions of the ball boats and submerged lands?'",
        "'speaker_10': 'So we haven't determined the final costs. However, we'll be basing them on the cost of the submerged land for the other parcels, which was $10,000 per parcel. And then it will be an additional fairly nominal cost for the land side for the vacating of the of the easement.'",
        "'speaker_10': 'It's considered non developable land and that's a pretty nominal cost.'",
        "'speaker_0': 'Okay. But some some revenue will be realized.'",
        "'speaker_10': 'Yes. And it will all go back into this project just as the sale of the other submerged lands did.'",
        "'speaker_0': 'You may have anticipated that next question, but I also emailed that earlier today. But what happens if, say, a property owner doesn't want to buy the submerged lands around their property?'",
        "'speaker_10': 'Well, for the submerged lands.'",
        "'speaker_0': 'Or the additional.'",
        "'speaker_10': 'Rights from.'",
        "'speaker_0': 'The bob out.'",
        "'speaker_10': 'Right. I think there's pretty high incentive for homeowners to purchase the submerged land because that's where their docks are and they're needing to to to do maintenance, to councilmember out his point regarding if they're not interested in the additional nominal fee for the vacating the easement on, say, those small areas on each side.'",
        "'speaker_10': 'I've talked it through with staff and really we think our best option at that point would be to put up a fence around what's the full city easement, but not open that whole area to the public. Still only open to the public.'",
        "'speaker_10': 'The area that we're proposing. For safety reasons.'",
        "'speaker_0': 'Okay. And then I think I heard you say that the city may install security cameras. This was certainly one of the recommendations excuse me, of the OC community policing.'",
        "'speaker_10': 'Crime prevention through environmental.'",
        "'speaker_0': 'Through environmental design, that one. So why wouldn't we just decide to do that? Because it's such a good deterrent.'",
        "'speaker_10': 'Yeah, I think it's certainly something that that can and should be done. Sometimes there's a sensitivity to putting in security cameras, but they would be something that would be on a 24, 48 hour loop and kind of similar to your nest cameras that people often have at home and in their front porches and would be targeted very'",
        "'speaker_10': 'specifically into the pathway and not near any neighborhoods. So I agree it's a good idea.'",
        "'speaker_0': 'Okay. Councilmember de SAC.'",
        "'speaker_9': 'So the idea is ten feet wide path. And then when you get to the water, kind of. Go out to 35 feet wide, which implies ten feet plus 12 and a half feet. 12 and a half feet. So what does the addition of 12 and a half feet to the right or 12 and a half feet to'",
        "'speaker_9': 'the left? What does the addition of that? Give to the ten feet with respect to the person. I mean, what's the theory behind? I mean, why not just leave it at ten feet? Because it seems to me not many people seem to actually partake in these areas.'",
        "'speaker_9': 'So if you just leave it at ten feet, it's still an area that person is going to enjoy. In the same way. I mean, they're just they're looking at the water and absorbing it. So I don't know. Is there a theory behind why 12 in this way, 12 and a half feet that way?'",
        "'speaker_10': 'Not to the specific amount, but the theory is to to see when you are at the water's edge, you don't feel quite so much in a tunnel. And it's just a more pleasant experience, especially if you put landscape on either side that it just feels a little more open once you get out to the water's edge and'",
        "'speaker_10': 'a little more pleasant. Sitting there rather than ten feet is pretty narrow. Once once you put in a bench that's six feet wide, you know, there's not much room to work within. So it was just to create a little bit more space.'",
        "'speaker_10': 'So you have room to put in a trashcan and a a bench and have and have a little bit of room for a nicer experience.'",
        "'speaker_0': 'Thank you. And Councilmember Vela.'",
        "'speaker_7': 'Um, so I was listening in and I think the mayor asked a few of the questions, a few of the questions that I had had about the legal liabilities around this, and also the decisions about what to have public access to versus decisions maybe to have take ownership or have the easement, but not grant access.'",
        "'speaker_7': 'Um, my, I know there was a lot that we looked into in terms of visibility and natural surveillance. How much was that aspect of, of, uh, the natural surveillance and the kind of the design of the built environment?'",
        "'speaker_7': 'How much was that factored in to staff recommendations in terms of what was put before us?'",
        "'speaker_10': 'Sorry, I'm not quite following that question there.'",
        "'speaker_7': 'There was in the in the staff report, one of the things that gets looked at or that was considered in terms of how we were creating access and and what was recommended was visibility. And one of the factors that was looked at was natural surveillance.'",
        "'speaker_7': 'So the design of the built environment that that allows for bidirectional visibility.'",
        "'speaker_10': 'Right. So the I mean, in regards to September guidelines and the existing built environment, it depends pathway to pathway, but it's really making sure that the landscape there's a visible corridor of above three feet above shrubs and, you know, three feet below trees.'",
        "'speaker_10': 'In terms of built environment. On Fern's side, there's much less vehicles visibility than you have at the two pathways on shore because you have this ten foot wide corridor. So in terms of that built environment, it is less, you know, police car stopping at the end is going to have less visibility all the way to the end'",
        "'speaker_10': 'than you would with a pathway that's 40 feet wide, 45 feet wide. That's where our goal is to, you know, put in things like surveillance cameras and lighting to hopefully help with the security at the end of those pathways.'",
        "'speaker_10': 'So to answer your question.'",
        "'speaker_7': 'Yes. And in terms of the the cameras and the lighting, obviously, that will will capture some of it. But I think that there's been some concerns about, you know, what to do when something's in progress as opposed to after the fact or investigating after the fact.'",
        "'speaker_7': 'Do we have a plan for how to actually make sure that enforcement occurs in real time so that we're not waiting for people to. He victims of a crime.'",
        "'speaker_10': 'You know, where police have this on their mental radar and as once we build it out more, that they'll still need to be driving by and walking it whenever possible. But it's similar to our parks. People shouldn't be well, you know, should not be there after dusk.'",
        "'speaker_10': 'It'll have similar hours. So we discourage people to be there after after dark or before dawn in terms of during daylight hours. You know, we encourage people to report, but it's it's similar to parks where we can't be everywhere.'",
        "'speaker_10': 'All the police can't be everywhere all at once. And so they do their best to to respond to calls when things are in progress.'",
        "'speaker_0': 'Anything further before we take public. Mr. Modi.'",
        "'speaker_3': 'Sorry, thank you. My colleagues comment. So I heard you say we can't be everywhere, anywhere. But I mean. Well, first of all, how many people do we know use these? Do we have some estimate on those on that number?'",
        "'speaker_10': 'I don't. I haven't we'd have to hire someone to be a counter to come out.'",
        "'speaker_3': 'And say and I guess, you know, if you if you're looking at a path and then it bulb's out 12 and a half feet, as my colleague mentioned, on each side. I mean, you really can't see what's going on in those 12 and a half feet.'",
        "'speaker_3': 'So I just wonder, you know, how much consideration we gave to keeping it at ten or some other number on what was it, B or A, you know, some other number that's less than 35, but not quite.'",
        "'speaker_10': 'Well, certainly the council can choose any width it would like. If you'd like to keep it at ten, we can absolutely do that. I agree that that's a more clear visual corridor. If it's just ten feet all the way to the water.'",
        "'speaker_10': 'Staff goal was to try and come up with a compromise really that that addressed the interest of quite a number of people that we saw in the surveys in the meeting who wanted us to open every single square foot of what's under the public easement and then the concerns of neighbors and others regarding safety.'",
        "'speaker_10': 'And so the recommendation is aimed to be a compromise, really, of the two.'",
        "'speaker_3': 'Because not I mean, not all of us live there and have to put up with some of the activity that goes on at the end of these parks. After hours, even though you're not supposed to be there, people are still there doing stuff that, you know, I wouldn't want my kid to see.'",
        "'speaker_0': 'Okay. So is that all the council comments for now? Then we have five public speakers and so we have five public speakers. So you can take up to 3 minutes. Don't feel you have to, but you have up to 3 minutes for Speaker.'",
        "'speaker_2': 'Bob Shannon, then Kevin Pad Wei, then Jeff Wasserman.'",
        "'speaker_4': 'Madam Mayor. Council members. I'm vice president of the.'",
        "'speaker_0': 'Will you be sure to speak into the microphone so everyone can hear you?'",
        "'speaker_4': 'My name is Bob Shannon, and I'm vice president of the Issuers Homeowners Association. I was also an active member on on Carp, going to all the task force meetings, talking about title rise as well as FEMA and other things that would affect the issuer neighborhood.'",
        "'speaker_4': 'And out of those conversations and doing all the studies, the issuer neighborhood is the number one neighborhood in Alameda that is supposed to be addressed for title rise out of the whole city. And our park, I think happens to be number four.'",
        "'speaker_4': 'And the reason I'm here is because the work that Amy did was was excellent. What their staff came up with was excellent. However, it was short sighted in the the embankments on on site D and E, site D is is going pretty park and river.'",
        "'speaker_4': 'And if you if I'm sorry you don't have the FEMA maps, but on the FEMA map, which would be the same access for water as title rise and whenever that happens. In fact, the theme of what could happen before or after title rise, it's a one in 100 year event.'",
        "'speaker_4': 'So it could happen this winter. But what happens is the water has access through those parks and the land on liberty, the house to the left and the three houses to the right allow water into the neighborhoods that affect 300 homes.'",
        "'speaker_4': 'And Lincoln Park has been reaching out to Central Avenue. So any work on that seawall is going to have to include what William's idea is, which is part of flood prevention and tidal rise. And the idea of spending any money on a seawall that should be done in conjunction with public works so as not to waste taxpayers'",
        "'speaker_4': 'money is critical in these projects. Access to the water is also important not to happen because it's only maybe 8 hours a day that there's even the availability of excuse me, ability to even touch the water because it's an estuary.'",
        "'speaker_4': 'The water goes out, comes back on a king tide and there's no mud there for hours. Even the Coast Guard has been stuck out there, out there in the rowboats and which our fire department had to come in and go out and rescue them.'",
        "'speaker_4': 'It's important to realize that even a little bit of access off of liberty or central will cause liabilities, lawsuits, danger to kids who don't understand the tide, the tides, how they come and go, how fast the water comes and goes, because that water actually comes in from the right side or the east or the south side to'",
        "'speaker_4': 'the north side. So it's important to realize that even on Central Avenue, the house to the left and central, the park on central will allow water into the neighborhoods. So we need to make sure that before anything is done to those seawalls that there that the rec department is working directly with the Williams team in public works'",
        "'speaker_4': 'to properly design a seawall that goes across the homes and the parks at both locations.'",
        "'speaker_0': 'Thank you, Mr. Shannon. Our next speaker.'",
        "'speaker_2': 'Is Kevin Pettway, then Jeff Wasserman, then Rob.'",
        "'speaker_1': 'Burke.'",
        "'speaker_0': 'Hello, you two. I wouldn't have recognized you. My children went to preschool with these gentlemen a long time ago. You're all grown up.'",
        "'speaker_4': 'Good evening, counsel. My name is Kevin Padua. I grew up in Alameda, and I'm a homeowner here in town. My brother Scott and I appear before you today in lieu of our mother ly Duleep Radway, whom this council spoke about in January.'",
        "'speaker_4': 'My mom was a resident of Alameda for 40 plus years in Love Island. She fundraised for the building of the new Alameda Library, volunteered in Alameda schools and other organizations within the city and would always pick up trash.'",
        "'speaker_4': 'She found when she was out and about in town, she genuinely cared for our island and the individuals in the community. One of my mom's favorite things about the island was the parks and open spaces that are accessible to nearby residents.'",
        "'speaker_4': 'She frequented a Jersey Park, Linkin Park and Crab Cove and was thrilled to see more open space being made available to the public. With the creation of Gene Sweeney, so much so that she kept newspaper clippings on her fridge of the progress of that park.'",
        "'speaker_4': 'Tragically, my mom was killed by an impaired driver this past Thanksgiving and her presence is missed every day. For the last two plus years of her life, my mom dedicated time to the shoreline access, as we're discussing here today, meeting with fellow residents and city officials.'",
        "'speaker_4': 'She felt very passionate about creating additional space for the public to enjoy Alameda Parks for something that brought joy to her life as she would frequently meditate, send positive vibes and just enjoy such a space so close to her home.'",
        "'speaker_4': 'She knew that Parks created joy in other people's lives, too, which led her to advocate for these forgotten rights of way to be used to their full public benefit as quiet, small and peaceful parts. When these front side accesses were finally open to the public and there was this condition, she visited them often and enjoyed the view'",
        "'speaker_4': '. I've also visited Jackson's accesses many times and luckily I was able to share some visits there with my mom. Now, while I visit alone, I feel the calmness that these accesses bring in a breath of fresh air, bringing a style of parks to our neighborhood that is different from Lincoln and cruisy.'",
        "'speaker_4': 'So as I've shared with the Parks and Rec Commission, my brother, family, friends and myself, we'd like to donate three benches, one for each of the front side accesses so the public has a place to sit and enjoy.'",
        "'speaker_4': 'Just as my mom had always hoped. My brother and I recognize that the plans for these parks have not been finalized and we hope that these benches can be accommodated. On a quick side note, I know there was a lot of talk about pathway, see?'",
        "'speaker_4': 'We hope that the city doesn't vacate those easements. I imagine would be quite difficult to ever get future access to the shorefront and just wish that it's to the highest and best use for the public.'",
        "'speaker_0': 'Thank you. Thank you for sharing that. Jeff, thank you. Our next speaker is Mr. Wasserman. Come on up.'",
        "'speaker_4': 'Hi. Good evening, counsel. My name's Jeff Wasserman. I live on a short drive between Meyers and Anthony. All. Regrettably, the public access that used to existed and tonight was given back by the city to the homeowner years ago.'",
        "'speaker_4': 'So that doesn't exist. Now, unfortunately, we're learning that the one closer to me on Meyers is also doesn't belong to the city, has no legal right away and can't use and the public won't be able to access in the future, which I think is unfortunate, but that may well be the reality.'",
        "'speaker_4': 'That said, I'd like to advocate for as much as possible for keeping all of the other waterfront access as they were. They were designed and implemented for a purpose. The people that live along the water and I'm one of them, are very fortunate that we get to have waterfront access.'",
        "'speaker_4': 'But our neighbors, our friends and neighbors will live across the street on the other side of the shore, drive the other side of our inside. Those who live on Hanson and Central and Tunnel and a block or two away from the water have no access at all if this water, public waterfront access isn't protected.'",
        "'speaker_4': 'I've heard a lot tonight and sort of inferences by some of the council members. I know a number of the people who are going to speak after me because I've watched them in previous meetings raise this amazing specters of gloom and doom and crime and homeless encampments and zombie apocalypses.'",
        "'speaker_4': 'If we leave these waterfront access it open. And I can tell you, I've lived in an issue for 13 years. I walk my dog there regularly, I kayak and paddleboard regularly on the water side, and nothing could be further from the truth.'",
        "'speaker_4': 'I mean, not to make it the make it more obvious and is, but it is the short drive. And four inside are the whitest and richest neighborhoods in Alameda. And there is no crime where we are. There's very, very little crime and certainly no more crime than we have anywhere else in the city.'",
        "'speaker_4': 'And I think the other people that are going to speak tonight are going to keep raising the specter of this of this crime wave and this homeless encampment, the threat that's going to that's going to crash upon our community if we open up and leave these parks open for the public that they were designed for.'",
        "'speaker_4': 'There's a reason that these parks were designed and and should be left open. I do agree that the the kayak area could be at the nearby park in part because on East Short Drive, it's very tidal. And you'd have to make a very long excuse me, a very long dock out into the water to get past the'",
        "'speaker_4': 'mud and on unfurled side. It's not it's not as tidal because it's a because of the canal but because of some of the ADA concerns. There would be a fair amount of engineering that might need to be made in order to create waterfront access.'",
        "'speaker_4': 'So I like that idea. But I think unlike what Amy is suggesting, I think most of her suggestions are very, very good. Let's open up central. Let's open up liberty to the public, the people that use them. Moms, dads, kids go there on bikes.'",
        "'speaker_4': 'Parents take their kids in strollers. It's good people.'",
        "'speaker_0': 'That need to master.'",
        "'speaker_4': 'There.'",
        "'speaker_0': 'Before we go on to our next speaker, I would just note that we are all here to speak for yourself or maybe, you know, like two brothers get up together. We don't need to preview what we think other people will say.'",
        "'speaker_0': 'I'm just here to hear your own comments. So who's there next?'",
        "'speaker_2': 'Speaker from Ferguson, Dana Fisher.'",
        "'speaker_0': 'Mr. Barracks and the Ms.. Fisher.'",
        "'speaker_4': 'Hey. How you guys doing? Uh, so it's been, I think, three years and three different councils that we've been talking about this. So a few of you have seen a bunch of towns, some new. I'm not really going to address the past silliness.'",
        "'speaker_4': 'I have a lot to say about it. You guys know that I send you emails. I got receipts for the, you know, various things that happened there so that that stuff is real. But, you know, we've never been in favor of closing the walkway that we live adjacent to.'",
        "'speaker_4': 'We just want to make sure that is developed in a way that doesn't become a public nuisance, attract more so in the recommendation, uh, the 35 foot my ah one objective is that 35 foot is the 35 foot.'",
        "'speaker_4': 'I sent you guys an email, you know, whatever the number is, less than 35 feet. We're looking for something that has gives us a little more visibility down the walkway for the police officers, for people to come and check it out, not build in hiding spaces behind our houses for stuff to happen.'",
        "'speaker_4': 'If that's done with thorny bushes softening the edges, what director Wilbur is talking about, those kind of things. Yeah, we can talk about that stuff. So in general, the recommendation we're we're okay with it, but we just want to make sure that what we're putting in there doesn't cause more of an issue than what we already experience'",
        "'speaker_4': '. In the last couple of things I want to say, our public information officer, Sir Henry is kick ass. Director Wooldridge is awesome and go is.'",
        "'speaker_0': 'Duly noted and Ms. Fisher.'",
        "'speaker_10': 'Good evening Counsel. I'm Donna Fisher. Full disclosure, I am on pathway C. Not at the moment. I wasn't planning to speak tonight, but I'm really only speaking not in totality, but to address a few of the council questions.'",
        "'speaker_10': 'And I thought this would be my opportunity. First one is on the liability and insurance issue that Amy brought up, and we have consulted with insurance advisors. Amy and Lisa are aware of that. And like the city's risk managers, we were informed that the city cannot cover us for a public park.'",
        "'speaker_10': 'It makes sense. And we have also then asked the city, please indemnify us via the same.'",
        "'speaker_1': 'Form that you would.'",
        "'speaker_10': 'Have us indemnify you if the tables were turned. Basically, I believe the answer is, and you guys can correct me if I'm wrong, but the city self-insured and will cover you. But to us that's not indemnification. I want to point out we're the ones with the three garages we also have on our property in front of one'",
        "'speaker_10': 'of the garages that shows in Amy's picture a parking space slash driveway separate from the path parallel. So you could not possibly fence it off. Meaning on either side of the ten foot wide pathway, you could not put a fence to block off our parking space and garage because we wouldn't be able to get in at all'",
        "'speaker_10': '. I mean, there's no way to fence off our property. I leave for work at four and I live to go rowing actually at four in the morning. Sorry, I'm retired now. I leave at four and five in the morning.'",
        "'speaker_10': 'I get up at four and I always now have to open the garage, slip out and make sure one of the late night party goers we're not talking homeless people. We're talking actually people you said you weren't doing things you wouldn't want your kids to do, but to make sure nobody is blocking it.'",
        "'speaker_10': 'I don't like walking out there alone in the dark. I like to get in my car, lock the doors and then open the garage. I've stopped doing that at five in the morning. So I do want to tell you the liability issue is real for us.'",
        "'speaker_10': 'It's parties. At the end of the dock we did or at the end of the pathway we did put in motion sensitive floodlights back there. We also have them at the garage, but we put them at the end.'",
        "'speaker_10': 'They go on several times a night. It's in my bedroom windows. I don't mind that it wakes me so much. I mind that someone's back there. It scares me. But one other thing I want to point out, because this has been the subject of some prior meetings, is about encroachments.'",
        "'speaker_10': 'I will tell you, in our case, it's important to note that all of the improvements have final, unconditional approved permits. They were all done before we actually purchased the property. And none of these are encroachment permits. They're total building permits, swimming pool permits, deck permits, gate permits, swimming pool requirements.'",
        "'speaker_10': 'So I want to end this with saying we have come a long ways. We all of us since 2016, when this first reappeared, after two prior times going back about 65 years. It's time now to bring it to closure.'",
        "'speaker_10': 'Thank you for listening. We hope to get good resolution.'",
        "'speaker_0': 'Thank you, Ms.. Fisher. It was our last public school year. Okay, so I will close public comment now and we will deliberate as a council. So who wants to go first? Councilmember Odie, I think I see your hands, which.'",
        "'speaker_3': 'I will go second.'",
        "'speaker_4': 'Okay.'",
        "'speaker_9': 'Well, I just wanted to quickly band on my comments about the 12 and a half feet to the right. 12 and a half feet to the left, and the ten feet in the middle. To me, it seems as though that whatever is at the wings should be less than ten feet.'",
        "'speaker_9': 'I don't know what the number is, nine feet or eight feet, because it's the center that is the place of attention, so to speak, of the person who's experiencing that area and whatever as to the left or whatever to the right is just an opportunity to kind of like.'",
        "'speaker_9': 'You know, move this way or that way. Whereas if you make it 12 and a half feet this way or 12 and a half feet this way, you're basically saying that that is a place of enjoyment that is equally to that or if not more so than the center.'",
        "'speaker_9': 'So. So to me. The edges can't be greater than the center width of ten feet. You know what? What the number is? Nine feet, eight feet, whatever. I don't know. So that's just kind of my observation. I think the most important observation for me is I see this as basically a neighborhood passive park where people are, you'",
        "'speaker_9': 'know, go there to enjoy the serenity that this has to offer. So we are not and I don't think we are, by the way, but we ought not to put any expectation that this will then trigger, you know, more of the city enjoyment of these areas.'",
        "'speaker_9': 'If people of the city, citizens of Alameda want to enjoy our waterfront, we've got many areas to enjoy our waterfront. But I think this is really for the residents who live out there. And I think actually the data bears that out.'",
        "'speaker_9': 'The data shows that, you know, there were those pie charts in the pie chart shows that, you know, people who responded online. On average, you know, they only went to the place one time a year. Well, it's not average.'",
        "'speaker_9': 'The median, the 5050 percentile person. If you calculate, if you do the math, you know, they would only go there one time a year. Now, the people who attended the workshops, you know, of course, they're going to you know, they're more active.'",
        "'speaker_9': 'And maybe there are residents who live closer by. They. Access any one of those parks no more than 1.9 or two times a year. So two times out of 365 days. So to me, that's kind of like quantitative expression that this is truly a neighborhood kind of place for and, you know, passive enjoyment.'",
        "'speaker_9': 'So so to me, when you add that observation with the first observation as to why the edges have to be less than the middle ten feet. Well, it's compliments that always supplements or whatever. So those are my two observations.'",
        "'speaker_9': 'The Passive Neighborhood Park and the edges should be subordinate to the middle. Ten feet.'",
        "'speaker_0': 'Thank you, Mr. De SAG, Mr. Councilman. Rudy.'",
        "'speaker_3': 'Thank you, Madam Mayor. And thanks to the speakers who came out and everyone who worked hard on this. I think Donna mentioned we have come a long way on this. I mean, I remember back when we started there was you know, we were all the city was all righteous in their belief that we owned the property and'",
        "'speaker_3': 'people were going to start tearing stuff down. And I thought that was a little excessive and a little punitive. And I suggested that we take each of these individual parcels on a case by case basis. And I'm glad that that was done because we see, you know, that each of them will have a different solution.'",
        "'speaker_3': 'There's no cookie cutter one size fits all solution. So I appreciate all of the staff work that was done to get to that point. And Amy and Lisa, I think you also did a lot of work on that, too.'",
        "'speaker_3': 'I understand. So just quickly going through this, I mean, and path a, I mean, I, I think that's a good recommendation. You know, I'd like to see us get grants sooner rather than later if those are possible. That's kind of a winding hilling one.'",
        "'speaker_3': 'So whether the con is 35 or 30 or ten or eight or whatever, you really can't see it. So I mean, I'm pretty comfortable with a staff recommendation on that one. And B, you know, I do think we should cut it down from 35 feet to, you know, my colleagues said ten and now I think he's saying'",
        "'speaker_3': 'eight. But, you know, I'd be fine with ten. Could be convinced of some other number that's less than 35 on C it's kind of hard to tell based on the the drawing if you know some type of gate is is feasible like a wrought iron gate that still preserves the view.'",
        "'speaker_3': 'So I don't know if that's feasible, if it is. It'd be something to think about. But if it's not feasible based on the way the driveways are, then it's just not feasible. So. And then d any, you know, minor improvements that I think will enhance those.'",
        "'speaker_3': 'I spent a lot of time on that end of town last fall and I found these little areas very refreshing and a nice place to stop and take a break while I was meeting all the neighbors that lived out there.'",
        "'speaker_3': 'So I'd like to make sure they're still there next time I do that. So I am concerned. No, the whole reason they started was because people had deteriorating docks and there was an issue that they're built with permits without permit, bccdc blah, blah blah.'",
        "'speaker_3': 'So we decided to resolve it so people could upgrade and fix their facility. So I just want to make sure that we don't impede that by putting any undue restrictions on this, because we still want to make sure that, you know, those those structures are safe.'",
        "'speaker_3': 'So those are my comments. I'm supportive of pretty much everything I'd like to see B B, smaller, you know, perhaps back to ten feet. And I would like to see if feasible a gate on on C whose name.'",
        "'speaker_3': 'I'm sorry, just a view gate. Not like a entering and out gate like, like on Lincoln Park when we have that, that beautiful fence.'",
        "'speaker_0': 'And now Councilmember I mean Vice Mayor Knox way.'",
        "'speaker_11': 'Thank you. Can I ask a quick question? We're not voting or giving direction tonight on the on the water side parcels, correct? I mean, I know that that came up, but it's not noticed and that'll come back at another time, correct?'",
        "'speaker_11': 'Yeah.'",
        "'speaker_8': 'That's correct. Councilmember.'",
        "'speaker_11': 'I will I will save my comments on that later. So I would like to thank staff, you know, that this this this discussion started at the planning board when I was there. And I'm pleased to say I think we're ending up almost exactly where the planning board in that first meeting where we discussed these parcels, suggested it'",
        "'speaker_11': 'should not for the most part. You know, I think there have been I appreciate all the all the all the speakers, Kevin and Scott. You know, I met your mom through this process. She it turned out she'd been swimming with my mom, with my wife for years.'",
        "'speaker_11': 'And somehow they got talking about this and realized that there was this connection. So I'm really glad to see you here. And I've been thinking about a lot about her as well. You know, I. I think I agree that we can talk about the 35 feet and bring it down.'",
        "'speaker_11': 'But I think that the goal here is we have people paying $10,000 to access the water, to protect the access that they have to their water, at their house, at their houses. And for me, I come at this from a different I have what I think is a slightly different perspective, which is, you know, we have the'",
        "'speaker_11': 'opportunity to provide people in this neighborhood is, as Mr. Desai mentioned, as Councilmember de SAC mentioned, access to the water as well. People who don't who don't live on the water, I don't think it has to be called a gold plated and whatnot.'",
        "'speaker_11': 'I think benches and just a nice places is enough. But I think sitting on a bench that is one foot from a six foot fence and one foot on the other side from a six foot fence is not a very compelling place.'",
        "'speaker_11': 'And so, you know, I very much appreciate Director Orange's presentation and description of what she's thinking, whereby there are these wings, but they're actually planted so that they create kind of a sense of space, but they are also planted with thorny bushes and whatever else.'",
        "'speaker_11': 'You don't have people inhabiting that space. So whether that's, you know, a 30 foot wing or 25 foot wing or something like that, I think what we want is a space where just like at the end of Central and just like at the end of Lincoln Liberty, people feel like at certain times they would like to go'",
        "'speaker_11': 'and just spend some time and feel like it's a place where it really is a respite and whatever else. So I would encourage us not definitely not to go less than ten feet, but I think that we will be very disappointed with ourselves if we if we if we go down to ten feet, we're going to find'",
        "'speaker_11': 'out when that space opens that we've created an inhospitable space that was supposed to be a rest of it. You know, I personally believe that we should protect our public access to the water. We don't know what's going to happen in the future.'",
        "'speaker_11': 'I don't necessarily mean that we have to build it and what not. But I think that we are making a mistake that a decade from now or 15 years from now we will regret in giving up the easements, these easements along here.'",
        "'speaker_11': 'I mean, we're already talking about one that, you know, one that's disappeared down on East Shore, another one that everybody thought existed. It didn't. Right. And there's some disappointment around that. I think we should protect protect the easement.'",
        "'speaker_11': 'And I'm happy to say that that can be one of the last ones we look at, whether or not we want to do something, commit if we need to, that we're not going to do anything with it for a while.'",
        "'speaker_11': 'I would also like, you know, I hear about I hear the mudflats, but the water boat launches near the place where people have had problems in the mudflats. I mean, I, we live on an island and I think creating places for people who don't live on the water to access the water from their homes is a good'",
        "'speaker_11': 'thing. And I think we should not foreclose that idea at the at the Liberty spot. Again, I don't know that we have we don't have the funding to build something there. But I definitely think that we should keep open the idea that someday we might put in a boat launch so that we don't have to worry about'",
        "'speaker_11': 'the tide in that area. For people who want to walk down there with a big plastic kayak or a paddle board or whatever else. So I would encourage us to to to keep that open. And I'm not sure, again, if the water plan is actually on the council.'",
        "'speaker_11': 'I know it's a recommendation in here related to Pathway A, but it wasn't you know, I'm happy to support that as a recommendation as well as a separate one. But beyond that, I really I think the staff recommendations are great and I'm looking forward to supporting this moving forward.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_0': 'Councilmember Vella.'",
        "'speaker_7': 'So I think that I want to thank staff and the community for all of the work on this. I think this has been a very much an evolving project and process and I think where everyone's learning more and more as we go through this exercise.'",
        "'speaker_7': 'That said, I want to make sure that what we do is done in a in a thoughtful way. And I think that there was a little more given in the presentation than I think was reflected necessarily in the in the staff report.'",
        "'speaker_7': 'And so I want to make sure that that's captured some way so that it's not just there was a comment made at council that this is what it's going to look like. I think we need to make sure that it's a little more clear in terms of what we're going to do relative to the landscaping and things'",
        "'speaker_7': 'like that, to make sure that that these are usable spaces. Because I think that that's ultimately the goal is to have a functional, usable, safe spaces for the public to enjoy. So I think that we maybe need to come up with kind of more clear direction about the landscaping to make it safer, that sort of thing.'",
        "'speaker_7': 'Or even just I think I think we've all we all appreciated Amy's comments on that. I think there's a way to capture that a little more in the direction that would be helpful, I think the other. Thing is that, you know, the the the bigger areas that we want to give water access.'",
        "'speaker_7': 'I do think to the vice mayor's point, we do want to preserve these. But I also think that we need to caution people who are using this. I, I grew up rowing on the estuary. I've seen people get stuck out there.'",
        "'speaker_7': 'I also think that some of these issues can be addressed with good signage that lets people know this is tidal. Be careful, enter at your own risk, that sort of thing. And that we design it in a way that's adaptive.'",
        "'speaker_7': 'So we are doing a lot of work on our on our seawalls. I'm sure Amy can work with Liam to address, you know, sea level rise in terms of pathway B, I think narrowing it, it seems like that's part of the plan as far as what Amy's.'",
        "'speaker_7': 'In terms of the usable space, I want to make sure that that we don't have kind of these areas that are hidden or places that just aren't going to be safe. I also go out for a lot of walks over the four month old at home.'",
        "'speaker_7': 'He's been making us walk about 5 to 6 miles a day. He likes to be outside. So we've been exploring the shoreline all over town. And I one of the things that I I've noticed, even with myself, is there's certain areas where where I'm not as comfortable going down just because once I get down there, I realize'",
        "'speaker_7': ', oh, wait, there's, you know, somebody over here, one of, you know, doing different things that maybe make it feel a little less welcoming after that one time. I don't want somebody to have that experience where they go down one of these pathways and they go, I don't ever want to go back there again.'",
        "'speaker_7': 'I want these pathways to be inviting. And so I think we really need to hone in on the design for pathway, be a little more. I think that there's a way to kind of deal with that space a little more uniquely so that it's not just kind of 35 feet and whatever happens.'",
        "'speaker_7': 'I don't I don't necessarily want to narrow to ten feet. I don't think that that makes sense. That might be a little claustrophobic. And I think that there's a way to to design and landscape it so that it's not just kind of these open wings.'",
        "'speaker_7': 'Some of the comments that we've gotten from from folks in previous meetings were more around, you know, 18 feet, 20 feet of usable space and kind of making sure that the landscaping is a little tighter around those ends.'",
        "'speaker_7': 'So I think if we can do that for Pathway B, I'll feel a lot better about that. And then I want to make sure that we keep our options open for, for liberty and and make sure that we have plans that are going to allow for us to adaptively reuse on the water side if we need to'",
        "'speaker_7': 'in the future.'",
        "'speaker_0': 'Okay. So I thank you public and colleagues and city staff for all of the input. This is an item, an issue that we have looked at a number of times over the years. And it is another opportunity.'",
        "'speaker_1': 'Where or a.'",
        "'speaker_0': 'Situation where the council is called upon to achieve a balance of a lot of different competing interests. I will say that I am pleasantly surprised to hear neighbors who held some very strong views and come around to realizing that a compromise can be achieved.'",
        "'speaker_0': 'And I and I do just want to say to the Padre brothers that, of course, I knew your mom from the time we were you kids were all in preschool, and she was one of my stalwart volunteers when I co-chaired the library campaign.'",
        "'speaker_0': 'And you might or might not remember, she actually designed our float in the 4th of July parade one year. It was a bookworm and it was really cute and a lot of work. But anyway, so I and I, you know, I'm certain that we will find a place for those three benches that you all want to donate'",
        "'speaker_0': 'in her memory. I think that's just fitting. So I, I, I think so. The competing interests that we, we need to address are that these are public paths in public easements and rights of way. And we do need to keep our waterfront open to the public.'",
        "'speaker_0': 'We're an island. It shouldn't be a well-kept secret, and.'",
        "'speaker_1': 'We.'",
        "'speaker_0': 'Really try hard not to put one end of town against another. These do happen to be in the east end of town. But anyone you know, hopefully you get in your bike or hop in a bus and go explore different parts of town.'",
        "'speaker_0': 'But we also want to be respectful of the safety of the neighbors, safety of pass users. But I think that staff has done a really good job of striking that balance. And I tend to agree with the city manager's recommendation in the staff report where he says that he concurs with the recreation parks directors recommendations.'",
        "'speaker_0': 'I believe this is a difficult issue to work through and that the recreation parks director and others worked through to come back with the best possible solution solutions that meet the competing values facing the City Council. So I am prepared to support the and again, these are, as I understand it, design concepts.'",
        "'speaker_0': 'The next steps, as I understand, are that an architect would be brought in to actually design the paths. And I think that might be the time when the finer grained details like landscaping come into play and does this.'",
        "'speaker_0': 'Well, these plans go back to the planning board. What are what are the different steps in the approval process?'",
        "'speaker_10': 'Yeah, thanks for asking. I wanted to clarify that. So what we've done in past projects, what I've done in past projects is so that we're currently at the very high level, 30,000, 35,000 foot level. We would do what we call schematic design, developmental design with the architect first, where they come up with some, some design options for'",
        "'speaker_10': 'each of the different pathways that would go before the Recreation and Parks Commission and then would come to you before as council for final approval on the general design concepts. After that, we'd get into the the detailed designing and construction drawings.'",
        "'speaker_10': 'So you would have a chance to look at those details of landscape and exact width at water's edge and all of that before it's finalized.'",
        "'speaker_0': 'And not back to the planning board.'",
        "'speaker_10': 'I certainly can. It's not generally in the purview of the planning board. Not all park projects go to the planning board, but I'm more than happy to bring it.'",
        "'speaker_0': 'Okay. So yeah, I don't want to hold up the process unnecessarily, but I think for council there's there've been some differing opinions for instance about the width of the ball about I'm one who supports not narrowing them, but Vice Mayor, you want to chime in?'",
        "'speaker_11': 'I'd like to make a motion.'",
        "'speaker_0': 'Could I finish my sentence? Yeah. You have the first opportunity. Okay, so I. And maybe you will cover this, but again, I am I think a lot of time has been spent not only by staff, but also. With public outreach and we are never going to find that project that everybody is on board 100%.'",
        "'speaker_0': 'But hopefully we find that solution where we've listened to everybody and come to the best possible compromises. So with that. Vice Mayor.'",
        "'speaker_11': 'Sure. So I'd like to make a motion in its six parts. The first part is that we recommend that any wings in future designs. So the part that's beyond ten feet be planted with, I believe the term was defensive plants, but to keep people out of them.'",
        "'speaker_11': 'Right. So the idea is that the ten foot area is the place for people. Site A, we approve, site B, we approve, but shrink the cone from 35 to 24 feet. The idea being that at the end of the cone there's six feet for planting, but that allows for some space for planting as the cone narrows, as'",
        "'speaker_11': 'it gets back up to the ten foot length. So you're essentially of six feet on either side and then a ten foot lane site C that we maintain but not actively pursue the use of the easement site D that we approve the staff for.'",
        "'speaker_11': 'Can you repeat sorry? Yes. C would be to maintain, not to give up the easement. Not not to vacate. Okay.'",
        "'speaker_0': 'To go back to your second and third ones, I was saying I wasn't expecting quite so much detail. So go slow. The number two.'",
        "'speaker_11': 'Side approve as as as proposed by staff.'",
        "'speaker_0': 'Okay.'",
        "'speaker_11': 'Three site B approved as a as proposed, but with a 24 foot.'",
        "'speaker_1': 'Cohen That'd be ten.'",
        "'speaker_11': '12. So six, six, ten, six. So you'd have a six foot planting at the end? Ten sixes. 22 sorry. 77 so we could we could call it 22. Sorry. Yes, math clearly not working at this time of night sight.'",
        "'speaker_11': 'C would be maintaining the easement but not actively pursuing its use. Site D would be approved the staff recommendation but also identify the site for future onsite on water access. So just not for closing. This is on water access and site e would be approved the staff recommendation.'",
        "'speaker_0': 'I would ask staff a question and I appreciate the um, what was number six. Did you get that.'",
        "'speaker_11': 'You.'",
        "'speaker_0': 'Approve, say you approve. Okay. So my only concern about being quite specific about this specific footage in this area is going to be planted with defensive defensible plants or defensive plants, whatever they are before the architect has even had a chance to consider.'",
        "'speaker_0': 'I just I don't want to tie the hands of I think I understand the concept you're trying to get at. You want to make sure that it will only be put words in your mouth. I think what you're saying is that you want to make sure that areas that are out of direct sightline from the street are'",
        "'speaker_0': 'going to not be used.'",
        "'speaker_1': 'For.'",
        "'speaker_0': 'Ulterior purposes. So that's why you input things like defensive plants in know but I'm just wondering whether that's whether maybe the concept rather than the actual footage is specified.'",
        "'speaker_11': 'Well, the footage is specified in the staff recommendation. We're just changing 35 to 22. And I guess I was trying to find a place between eight feet and 35 feet that seemed to, you know, to just seem to come up with a space that probably is, you know, nice.'",
        "'speaker_11': 'I heard no no support for 35 and on the other side of you.'",
        "'speaker_0': 'So yeah. And I, I don't have architectural training, but I do think that you go out and look at a site and then do your design, but does anyone else want to? Yeah. Sorry. Yeah. So sorry.'",
        "'speaker_3': 'I mean, I could support almost all of this motion. I think if we're going to. If ten is too narrow, then I mean, 18, I'd be comfortable with voting on four for B C, I guess that kind of keeps it in limbo.'",
        "'speaker_3': 'I mean, my my whole thing is I think we need to get the title on these properties resolved, so we need to pick a number. I kind of agree with the mayor. I'm not sure if we need to design what pushes go where from this dais at this point.'",
        "'speaker_3': 'But you know, there can be a suggestion. I like the idea of keeping our options open on DH, so I appreciated that part of the motion also. I mean, see if we're keeping it closed. I mean, I'm not sure why we wouldn't just vacate it, but I mean, I could go either way on that one as long'",
        "'speaker_3': 'as we keep the view available for people. That's all I care about on that. Nancy.'",
        "'speaker_0': 'Thank you. Three other comments. Yeah. Councilmember de SAC.'",
        "'speaker_9': 'You know, in terms of. Pathway B, I'm in favor of having four, ten, four. In other words, eight. Now, I'm not altogether opposed to 24 because that was my my. Actually, that was the first thing I penned down, which 24 would be seven, ten, seven.'",
        "'speaker_9': 'But the reason why I support for ten four, which is 18 feet, is because. At the end of the day, we had a member of the voice of Alameda, a citizen, you know, bothers to not only email us that this is what he'd like, this is what do you think his family would like when he also attended'",
        "'speaker_9': 'the meeting? And, you know, there's something to be said for showing up. So for me, I'm okay with four, two and four. Frankly speaking, I think that for purposes of elegance, which is a word I will use one more time.'",
        "'speaker_9': 'I do believe if we're going to do four, ten four on pathway B, then we've got to do 410 four on pathway. That's just that's just my $0.02. Finally, I think in terms of Pathway C, um, you know, we just, we just have to vacate it.'",
        "'speaker_9': 'I think it's time to move on. I think there's been given plenty of reasons why we, we need to vacate it. Um, so I will accept staff's recommendation on that as well as on staff's recommendation as well as on pathway D and F.'",
        "'speaker_0': 'Um, so I. I don't think you were intending that as a substitute motion. I don't think you were taking it as such. Is that correct?'",
        "'speaker_11': 'I'd be happy to try for 20 feet, but I know that I am.'",
        "'speaker_0': 'Okay. So. And I'm just wondering whether we should be going through this pathway by pathway and if the city manager wants to chime in with any thoughts? No, he doesn't. But I just I'm hearing such different things from different people, and we've got to give our staff direction.'",
        "'speaker_0': 'And but again, remember that the schematic design will come back to us. But I mean, I guess we need to tell the architects. Okay. I'll wait for the conversation to end.'",
        "'speaker_1': 'Go ahead.'",
        "'speaker_0': 'If someone wants to speak, please do.'",
        "'speaker_11': 'I was just asking you a question.'",
        "'speaker_0': 'Okay. Councilmember Vela.'",
        "'speaker_7': 'I'm just wondering, it does seem like we have an agreement on several of these. If we could maybe move that portion of the motion and then continue deliberation on the.'",
        "'speaker_0': 'Okay, to my point. Let's start one by one and just go over and I think that we might be able to set aside the ones that we need to come back to. Okay. Okay. So starting with, uh, pathway.'",
        "'speaker_0': 'Well, actually, there's a table that helps us with that.'",
        "'speaker_11': 'I'll start by withdrawing my motion.'",
        "'speaker_0': 'Okay. I'll start fresh. Stand by. You might make a substitute one, but the summary report. Okay, everyone. Pathway A, this is the one that is not ADA compliant. Approximately $750,000 to make it ADA compliant. Recommendation is keeping it open to allow public viewing, but it would be our last priority for funding their agreement with that.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Yeah. Okay.'",
        "'speaker_11': 'If we move approval and e because I think everybody said they approved.'",
        "'speaker_0': 'Gosh, do you mind if I just go through this? Just hear me. I don't want to jump around too much. I want to get through this list. Okay. Is there agreement on on pathway A, because we'll vote on it.'",
        "'speaker_0': 'But go ahead, Councilmember decide.'",
        "'speaker_9': 'My only concern is I don't think it should be 35 feet. I think if we're going to do something that's pathway B is something much south of that, then for purposes of elegance, you know, we should be the same.'",
        "'speaker_9': 'But, you know, people can vote the way they wish.'",
        "'speaker_3': 'So like a motion.'",
        "'speaker_0': 'Okay, let's can I have a motion and. Oh, yeah. And everyone, be sure you're speaking into your microphones. Okay. Do I have a motion on approving pathway, a per staff recommendation move.'",
        "'speaker_11': 'Approval pathway per the staff recommendation.'",
        "'speaker_0': 'I'm sorry I didn't finish what you're saying.'",
        "'speaker_11': 'It's it's a wholly different thing. It doesn't have the visibility issues, the pathway B has because of the Hill, etc.. I think we should maintain access to the water.'",
        "'speaker_0': 'Hey, do have a second?'",
        "'speaker_1': 'Second.'",
        "'speaker_0': 'All in favor. I that's three in favor I oppose. That's four in favor I oppose. Abstain. Okay. Pathway A is approved is recommended. That's a 4 to 1 vote. Okay. Pathway. Um. Okay. Pathway B this one. Uh, improve pathway is viewing area of the water modified bulb out to be cone shaped extends approximately 30 to 35 feet'",
        "'speaker_0': 'wide. It's what is engineering 210 at the pathway at viewing amenities such as benches, trash, recycle receptacles, uh, create safer configuration, improved visitor experience at safety improvements council. Vice Mayor, you had, you said of this one.'",
        "'speaker_11': 'I would move approval of site B as per recommended by staff with the one change of 35 feet to 20 feet.'",
        "'speaker_0': 'Okay. All right. And thoughts about that. That's actually a motion. So 35 to 25 feet, you're saying 2020. Okay. Councilmember de so given.'",
        "'speaker_9': 'Yeah, I'd like to offer an alternative motion simply again, just to honor the fact that the resident bothered to show up and, and email us and contact us to and just make it for 10th floor. Although I'm sure the resident would love they would be satisfied with five, ten, five or ten four is what we got in'",
        "'speaker_9': 'the email.'",
        "'speaker_0': 'Okay. Is there a second for that substitute motion?'",
        "'speaker_1': 'Sure.'",
        "'speaker_0': 'Okay. All in favor of councilmember deserves to understand what it is, but say it again.'",
        "'speaker_9': 'Recommendation except at the width. Making it for ten, four.'",
        "'speaker_3': 'Or 18 feet.'",
        "'speaker_0': '18 feet total. Okay. Okay. Um, we have a motion. A second. All in favor.'",
        "'speaker_7': 'I ah, vote in favor, I.'",
        "'speaker_0': 'Okay. Well, that's 3 to 2, so. Okay. So pathway B is narrowed from 35 feet wide to 80. 80. Where is it? 18 or 20? 18?'",
        "'speaker_4': '18.'",
        "'speaker_1': 'Right.'",
        "'speaker_0': 'Okay. Um. Okay. Pathway. See?'",
        "'speaker_1': 'Um.'",
        "'speaker_0': 'So, uh, this recommendation is to vacate the easement via a recorded document. Sell the vacated easement area to adjacent property owners. This is the site that has the driveways on either side. Counsel Uh, Councilmember Vela.'",
        "'speaker_7': 'Madam Mayor, I believe the Vice Mayor had previously made a motion which I was prepared to second, which would be to maintain and not vacate. I do hear what Councilmember Ody has said. I think that there's an opportunity for us to, um, do exactly what he's proposing, which is to allow for that, that public viewing of the'",
        "'speaker_7': 'area. But I also think that doing that doesn't necessitate that we vacate. And so I think that this allows us to, um, you know, adapt in the future should the need arise. Uh, and, and for that reason, I'd be willing to make the motion.'",
        "'speaker_0': 'Okay. So so that motion again is that the set to be maintained by the city but not vacated and notwithstanding the concerns about pedestrians and cars backing out?'",
        "'speaker_7': 'Well, I think we can we can work on those issues. I think I think exactly what we're I just don't want to. I think that we can address those issues while still maintaining these.'",
        "'speaker_11': 'How I'll second the motion so we can discuss it.'",
        "'speaker_0': 'Okay. Thank you. Ever motion a second? So can you can you amplify how you would how you would address those conflicts?'",
        "'speaker_11': 'So I'll say. I mean, she's looking at me. I'm not interrupting her. I got, you know, in my 43 seconds, we have places all around the city in which driveways back, garages back out directly over sidewalks, etc., that have very low visibility.'",
        "'speaker_11': 'I'm not compelled by the safety concern that is raised in this. At the end of the day, these things have existed for years and there have not been collisions that have happened. And I think that we can put some safety and safety things in there to make it easier.'",
        "'speaker_11': 'But I don't think the safety issue is, you know, we have people driving and walking through parking garages all the time. Like, I just I don't think the safety issue is is as great as has been raised.'",
        "'speaker_0': 'Okay. Other comments, Councilor?'",
        "'speaker_3': 'I guess my comment is if we're if we're not vacating the easement and there might be three votes for that, I would like to narrow the the cone on that one also, because we're narrowing the cone on the other one.'",
        "'speaker_3': 'We should narrow the cone on this one down to 18 off.'",
        "'speaker_7': 'So and I don't I don't have a problem with that.'",
        "'speaker_0': 'Okay. So that's an amended motion.'",
        "'speaker_11': 'And as the second day. Well, I will second that amendment.'",
        "'speaker_0': 'Okay. Uh, any other comments? Okay. Hearing no further comments. All in favor.'",
        "'speaker_11': 'I. I.'",
        "'speaker_0': 'Opposed. I oppose any others.'",
        "'speaker_3': 'Oppose. I'll vote yes.'",
        "'speaker_0': 'Okay. So the motion carries three to what do you. Where are you, Mr. Tantrum?'",
        "'speaker_9': 'A basic recommendation of vacating.'",
        "'speaker_0': 'Opposed, oppose. Okay, so the motion carries 3 to 2. Okay. Pathway D, this is the East Shore Drive at liberty. Uh, recommend expand with the public path. Make improvements for viewing the water stress, existing encroachments complete pathway fencing.'",
        "'speaker_0': 'Just existing fencing is needed currently use public pathways.'",
        "'speaker_10': 'Um.'",
        "'speaker_0': 'Expand width of pathway on southwestern side. You all have read this. Um.'",
        "'speaker_11': 'I'm of approval of the staff recommendation with the one addition that we identify this site for future on water access.'",
        "'speaker_3': 'I'll second that.'",
        "'speaker_0': 'Okay. There has been a motion in the second as as noted, amended and just amending the staff's recommendation all in favor.'",
        "'speaker_7': 'I.'",
        "'speaker_0': 'I was that unanimous? Yeah. Okay, that one passes five. Oh, okay. Pathway E, this is East Shore Drive at Central Avenue. Recommend improved public viewing area with amenities adjust fencing if needed. It's already well-used. Public pathway to the water include increased public amenities such as benches, picnic tables, trash, recycle receptacles.'",
        "'speaker_7': 'Motion move approval the staff recommendation for city.'",
        "'speaker_0': 'As is.'",
        "'speaker_7': 'Right as it's okay.'",
        "'speaker_0': 'Do have a second?'",
        "'speaker_3': 'Sure second.'",
        "'speaker_0': 'I was motion is second in discussion all in favor I any oppose abstain measure e passes unanimously.'",
        "'speaker_3': 'At a mayor.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'I'd like to have reconsideration of the the C just because I wanted to hear more what you your thoughts on it.'",
        "'speaker_0': 'Oh, um.'",
        "'speaker_3': 'And I think as.'",
        "'speaker_0': 'Opposed to you put in the majority so you can okay. B you need someone else to, um, don't you?'",
        "'speaker_3': 'Well, yeah. And you need three votes to reconsider. Yeah.'",
        "'speaker_0': 'Okay. Okay. Okay. I'll vote for that too. Okay. Um, you want to hear more from.'",
        "'speaker_3': 'Oh, I mean, I thought you were gonna vote yes, so I was just curious on. Oh, I didn't really hear your your not.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'She wanted a chance to convince me.'",
        "'speaker_0': 'Um.'",
        "'speaker_3': 'I, I'm kind of on the fence on this one, so.'",
        "'speaker_0': 'Okay, well, um, I would. I would go with the staff's recommendation on this. I have walked that path and I know that area. And, um, I respectfully disagree that it's analogous to walking across a driveway or walking through a parking garage because this is an area where and I think the photos were pretty clear that you could'",
        "'speaker_0': 'be walking along way up. Maybe you're a little kid. You didn't even realize that a car is about to come out. Um, it's just there, and there's driveways on both sides. And I. I do think that we should be opening up as much of the waterfront and these public access paths as we can.'",
        "'speaker_0': 'But I'm also a realist, and I just don't see a scenario. I mean, maybe, God forbid, an earthquake, you know, makes the houses tumble or something, but I don't want to see that. But those houses and those driveways and those garages are going to continue to be there.'",
        "'speaker_0': 'And they're very close to the pathways. And so and I listen to Councilmember Vella and I'm picturing her pushing her stroller or, you know, having that cute little baby in the snugly. And I want her to be safe just like anybody else who uses it.'",
        "'speaker_0': 'So that's why I mean, I love that we're doing this, but I just don't think this one is our best candidate, because I also am concerned with the safety of pedestrians or kids on tricycles or, you know, moms with babies, dads with babies, what have you.'",
        "'speaker_0': 'So that's my thought. Okay. Anybody wants to make another motion, I would entertain it or not.'",
        "'speaker_3': 'I would like to keep some type of view access. So I'll try a motion. Try a motion. I will motion to approve the staff recommendation but pursue somehow maintaining the view if feasible.'",
        "'speaker_0': 'Um. Yeah. Um. This, uh, council. Ms. Wooldridge, did you want to, uh. Um. Well, the city has an access easement. Do you want to. Do you have any thoughts about maintaining a view corridor or anyone or what city attorney's office want to come?'",
        "'speaker_10': 'I connected earlier with with Miss Maxwell and she looked it up today and it confirmed that we we can vacate the easement. So then we don't have liability and other issues, but put a restriction on so that we're still requiring a view corridor.'",
        "'speaker_10': 'Think of it as kind of air rights. Right. Like capture that correctly.'",
        "'speaker_0': 'This is Lisa maxwell from the city attorney's office back there.'",
        "'speaker_7': 'Okay. Can we please hear from Lisa.'",
        "'speaker_0': 'Coming up later? Yeah. Ms.. Maxwell. Sorry.'",
        "'speaker_1': 'I did. A little quick.'",
        "'speaker_0': 'Reset. Please talk right into the microphone.'",
        "'speaker_1': 'Sure. I did some research just that this afternoon.'",
        "'speaker_0': 'This microphone that. Yeah.'",
        "'speaker_1': 'Maybe introduce the concept and it is comparable to a covenant or a recorded easement.'",
        "'speaker_4': 'He would just record.'",
        "'speaker_9': 'A documentation, a.'",
        "'speaker_1': 'Document that basically covered the property that allowed us to limit folks from putting up a very tall fence or trees that block the view corridor or just prescribe some parameters so people could see straight down. So it doesn't sound too complicated.'",
        "'speaker_0': 'Thank you. Questions for Ms.. Maxwell. Does that does that satisfy you? Yes. Okay. So your motion again is.'",
        "'speaker_3': 'To approve the staff recommendation with that extra instruction to maintain the.'",
        "'speaker_0': 'Into the microphone.'",
        "'speaker_3': 'So I'm sorry.'",
        "'speaker_0': 'If I forgot. I know to.'",
        "'speaker_3': 'Just remember what it was. Yeah.'",
        "'speaker_2': 'What you just said to prove the staff recommendation with instructions to maintain the view. The Oak View corridor if you want to. Yeah.'",
        "'speaker_9': 'I'll second.'",
        "'speaker_2': 'This.'",
        "'speaker_0': 'Councilmember Vela, the motion has been moved and second in discussion. Councilmember Vela.'",
        "'speaker_7': 'Well, it's not. I just want to make clear that the staff recommendation is to completely vacate. And so what Ms.. Maxwell talked about was, you know, adopting a covenant. So I just want to be clear that it doesn't seem like we're completely vacating.'",
        "'speaker_7': 'We're actually still putting some sort of restrictions on the land.'",
        "'speaker_1': 'So my thinking would be we vacate the existing easement because it accomplishes different things than what we're now trying to accomplish and instead work with adjacent property owners to record against the property a easement that accomplishes the purposes we're currently discussing, which are to maintain the view.'",
        "'speaker_0': 'Okay, I get that. And Mr. Lovett.'",
        "'speaker_4': 'I'd recommend, if we do that, that we negotiate this alternative view corridor easement before you start the fire.'",
        "'speaker_0': 'Oh, yes. Good, good sequencing.'",
        "'speaker_1': 'Yes, exactly. It would be a condition. Yes.'",
        "'speaker_0': 'Okay. Okay. All right. Thank you for your both. Thank you. Thank you. So I believe I had a motion in a second. Okay. So any further discussion? May I have 0 seconds?'",
        "'speaker_11': 'Can I have you? May I'm just I'm not going to be supporting this because I don't think giving away public easements to what the water is the right thing. But also, I just want to call out, there's not much of a view here, so I don't think this is a very long, narrow tunnel.'",
        "'speaker_11': 'I just want to be careful that we're not really adding huge value. The view is when you get out to the end and we're removing that ability.'",
        "'speaker_0': 'Thank you. Okay. We have a motion. We have a second. All in favor. I write the motion on pathway C passes three to I was at 3 to 2. It was okay. And now we are on pathway f, which should be easy.'",
        "'speaker_0': 'I think the city has no rights to this pathway. The recommendation, no legal interest, no ownership, no easement. The recommendation is that pathway f remain closed.'",
        "'speaker_4': 'As a recommendation, so.'",
        "'speaker_11': 'We have to take action.'",
        "'speaker_0': 'Um.'",
        "'speaker_11': 'I think, I think the point was.'",
        "'speaker_1': 'Take us to.'",
        "'speaker_4': 'Do.'",
        "'speaker_0': 'Okay. Well, but we do we agree with. Okay. We're not going to get past it. So is that sufficient for.'",
        "'speaker_8': 'It might be helpful for the Council to just affirm staff's recommendation?'",
        "'speaker_0': 'I think.'",
        "'speaker_3': 'The move affirmation of steps recommendation on pathway.'",
        "'speaker_0': 'F. Okay. I have a motion to have a second.'",
        "'speaker_11': 'And sorry. Now I'm not understanding a.'",
        "'speaker_7': 'Second.'",
        "'speaker_0': 'Mr. Chen said. He said it would be helpful to have affirmation of staff's recommendation. So that's what we're voting on. But if I if we don't have legal.'",
        "'speaker_7': 'It's an affirmation that we don't have the ability to take action.'",
        "'speaker_0': 'Yeah. Okay. So we have a motion. We have a second. All in favor. I oppose abstain.'",
        "'speaker_11': 'I'm going to abstain.'",
        "'speaker_0': 'Okay. That was approved for a yes and one abstention. Okay. I think we have. Oh, you know, I have one question for Ms. Wooldridge before we close this one up. Are we going to need an increase in recreation Parks Department budget to cover additional maintenance?'",
        "'speaker_0': 'Because we're taking on maintenance of these pathways, as I understand it.'",
        "'speaker_10': 'That's correct. And I can't express how much I appreciate you think about maintenance. Well, we worry.'",
        "'speaker_0': 'About a lot of things.'",
        "'speaker_10': 'Right? I've preached it enough. We'll be bringing something back in the midyear. Thank you.'",
        "'speaker_0': 'All right. Okay. I think we've covered it right. Okay, everyone. Thank you. That was not easy, but thank you for getting through that. Item six C is close. We move on to six D.'"
    ],
    "Introduction of Ordinance Amending the Alameda Municipal Code by Adding Section 13-12 Use and Occupancy of Damaged Buildings and Structures/Use of Placard or Signs to Chapter XIII Article I. (Fire 3205)": [
        "'speaker_2': 'Introduction of ordinance amending the Elimination of Civil Code by adding Section 13 Dash 12 use and occupancy of damaged buildings and structures. Use of placard or signs to Chapter 13, Article one.'",
        "'speaker_0': 'And I think that we have Sharon Oliver. Thank you, neighbors, for coming out. Thank you. Okay. Come on up. Captain Oliver, tell us. Right, Deputy Chief. What's the correct way? Well, I'm a captain. Captain? Captain Sharon Oliver with the fire department.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Mayor and.'",
        "'speaker_10': 'Council members. I sort of apologize. This might have been something that should have been on consent and evidently didn't get submitted that way. But we will make it quick. So this is essentially a housekeeping item.'",
        "'speaker_0': 'What might even be quicker if anybody wants to make a motion?'",
        "'speaker_7': 'To make a.'",
        "'speaker_0': 'Motion. Oh, well, let's do a motion second discussion. Or do you.'",
        "'speaker_11': 'Want to ask a quick question?'",
        "'speaker_1': 'Okay. Sure.'",
        "'speaker_11': 'Are we approving the actual signs?'",
        "'speaker_0': 'I know the the signs are already in use and they're part of the safety assessment program.'",
        "'speaker_10': 'The only change.'",
        "'speaker_0': 'To the signs themselves.'",
        "'speaker_10': 'Is adding the seal of the city, the address and the new ordinance number. I've just got.'",
        "'speaker_11': 'To point out, demolition is spelled wrong.'",
        "'speaker_1': 'Oh.'",
        "'speaker_10': 'It it's a it it's a draft.'",
        "'speaker_11': 'Sign as long as we're not approving.'",
        "'speaker_1': 'It. No, you're not.'",
        "'speaker_10': 'The signs are in place. We were trying to put together an example of what it would look like. Probably my dyslexic fingers typing.'",
        "'speaker_0': 'So we have an ordinance, and I've had a motion, I believe, to approve this ordinance. To have a second second. I have a second with, of course, the requisite spelling changes and all in favor. I any abstain, any knows the motion passes.'",
        "'speaker_0': 'Thank you. Unanimously. Thank you. Right. Okay. That was quick. And then, um. Okay, so we're getting there, folks. It is item six e.'",
        "'speaker_2': 'Introduction of ordinance authorizing the city manager or his designee to execute a 66 month lease with one option to extend the term for six months with Park Street Wine Cellars, Inc for the premises at 2315 Central Avenue, Suite 1122 Historic Alameda Theater Building.'",
        "'speaker_2': 'The sign in Murfreesboro.'",
        "'speaker_0': 'All right. Hello.'"
    ],
    "Introduction of Ordinance Authorizing the City Manager or His Designee to Execute a 66-Month Lease with One Option to Extend the Term for 60 Months with Park Street Wine Cellars, Inc. for the Premises at 2315 Central Avenue, Suite 122 (Historic Alameda Theatre Building). [Requires Four Affirmative Votes] (Commercial Revitalization 227)": [
        "'speaker_1': 'Good evening, mayor and city council members. I'm Ninette Mercado in the Community Development Department. So as described, we are presenting a 66 year lease for 466. No.'",
        "'speaker_0': 'Just now.'",
        "'speaker_1': 'That's another 166 month lease. That was so for it in 66 month lease.'",
        "'speaker_0': 'Are you paying.'",
        "'speaker_1': 'With an option to extend for another five, four, five years for 23, 15 Central Avenue that is formerly was in wine bar and we're transforming it into a wine retail facility. And it's more than just that. And yesterday, the mayor sent some questions over because she's super detail oriented and about what and what the operations would look'",
        "'speaker_1': 'like in the wine facility. Her concern was that it was just a run of the mill retail shop and that she wanted really something special in that location. So I thought I would give you a few little bullet points that we sent to 202 mailers out for that.'",
        "'speaker_1': 'For that space, we received 90 inquiries and that some in response to the mailer and just people driving or walking by. We had 35 showings of the of the building of the space. And we received four offers. Of those offers, two couldn't provide us with adequate financials, and we went forward with negotiating with two.'",
        "'speaker_1': 'And then we countered both of them with the same offer, and one dropped out. And so we moved forward with the Park Street wine cellars. And actually wine cellars is not going to be your run of the mill retail shop.'",
        "'speaker_1': 'It's going to be a destination. The people who run the facility have a great history and doing and doing just that, running these facilities or running a wine a wine retail shop. They're going to specialize in primarily European wines from Italy, France and Spain, and they're going to have very high end California wines that the idea of'",
        "'speaker_1': 'their operations is focused around creating a destination rather than being dependent upon foot traffic. They their program will include educational wine seminars, wine and food pairing seminars and Wine of the Month club. They are going to be hosted in their facility and they're going to allow the patrons the opportunity to taste and explore the latest arrivals that'",
        "'speaker_1': 'come into the shop. And their staff will discuss the wines and give background on each of the wines that are being offered there, and every wine will be able to be sampled in their facility. They are definitely focusing on having the personal touch.'",
        "'speaker_1': 'One thing of note is Mr. Massy is he won't be dependent on wholesalers coming in and telling in trying to tell him which wines to buy because he himself is a wholesaler. So he'll be able to be very specific in the types of wines that they offer in that shop.'",
        "'speaker_1': 'Recently I asked to. Mr.. Mr. Massie, how are you different from the shops that are in your look in in the vicinity. And he said that because he is a wholesaler, he can make sure that his wines are of the highest quality and also the fact that they are really going to be a personalized focus on the'",
        "'speaker_1': 'client, the clients who come in and offer like different sorts of educational opportunities for people to feel like they are wine experts themselves after they leave. The last thing that I like to talk about, I know first of all, the mayor asked about the operating hours and Mr. Massy is proposing to be closed on Sundays and Monday'",
        "'speaker_1': 'through Thursday, be open from 10 to 7 and Friday and Saturday, 10 to 9. And then finally, finally, Mr. Massy, their marketing program. And then they are asked because they they do have a wine, a website up already.'",
        "'speaker_1': 'And there was concern about, you know, putting the cart before the horse. And the masses are really trying to create a social media marketing plan they are dependent on. They want to create a a buzz about their app or their coming and then make people want to come and visit and have that experience of wine learning about'",
        "'speaker_1': 'wine pairing so different wines from different regions. So they really want to create and they have a history of doing this, a space that people will want to come to. So it we believe that it fits in with what's happening on that street, with that with the theater and then our new burger shop, that it's something where'",
        "'speaker_1': 'people will want to come and spend time and then meander around Park Street. So we think it's a really good tenant opportunity for us. Thank you.'",
        "'speaker_0': 'Thank you. And I'll just make a quick comment because it's true. I sent Ms.. McCann, I bet she's used to my lengthy emails with questions. And my primary concern was the staff report was pretty sparse. And I just wanted to know who are these folks and why do they think they can make a go of a wine'",
        "'speaker_0': 'shop in this area? And going forward, when we're considering a lease, I'd love to know more than the monthly amount of rent and the the length of the lease and the names of the lessees. Because. Not only for my own.'",
        "'speaker_0': 'Purposes in order to make an informed decision. But in this case, we're considering city owned property, and we need to also inform the public. And so I did a little Googling and I found this website, and I was a little surprised that it was out there.'",
        "'speaker_0': 'But it was it's very nice and it's very informative. And so I know that for more than ten years, Mr. Massy operated a wine business outside somewhere in the Houston, Texas area. And I believe that in 2011, he and his wife and family came to Alameda.'",
        "'speaker_0': 'And I think that's great. I just feel like I probably shouldn't have to do quite so much sleuth work. But you know me, I will. I will. And so, I mean, I'm I'm excited about this prospect, but let's hear from other council members.'",
        "'speaker_0': 'Council questions, comments, motion. Um.'",
        "'speaker_3': 'I'll make a quick comment.'",
        "'speaker_0': 'Yeah. So there's a time.'",
        "'speaker_3': 'I mean, I don't want to micromanage, but there are other parts of the world that produce great wines. South Africa produces great wines Lebanon, South Korea, Australia. So anyway, and I've tried Sugar-Free wines, which are actually quite interesting.'",
        "'speaker_3': 'So just this just I'm trying to cut back on sugar, but I'm of approval of the item.'",
        "'speaker_0': 'Oh, okay. So, so we have a second in discussion or. Okay, yeah.'",
        "'speaker_7': 'I'll, I'll go ahead and second.'",
        "'speaker_0': 'Okay. And then Councilmember Vela.'",
        "'speaker_7': 'Yeah, I think to the mayor's point, I think a little background is sometimes helpful. Just to give us context about, you know, one of my concerns is always going to be, you know, how is this going to be viable?'",
        "'speaker_7': 'Are we going to be back at the table, you know, relatively quickly? Are there going to be issues that come up? And I think having that context is always helpful. I know that staff in the past has offered prospective tenants the ability to write us a letter or something like that.'",
        "'speaker_7': 'I think those sorts of things can be helpful just so that we have some a little more context because we're not at the bargaining table with you. Right. And I think really what we're looking for is how is this going to kind of envisioning what the what the business is going to be like?'",
        "'speaker_7': 'And, you know, hopefully that the lease that we're negotiating is something that's going to be successful for everyone.'",
        "'speaker_0': 'And I see that we have the applicant in the audience and I see his hand is up. Perhaps that means you'd like to increase because. So is that all right?'",
        "'speaker_1': 'Just before he comes up, I would just say I apologize that that the staff report was not as thorough as it should have been. And now I know that the council really wants a lot more context and details.'",
        "'speaker_1': 'And so in the future, you're going to get what you ask for it. Yeah. Thank you.'",
        "'speaker_0': 'Okay. So, Mr. Massie, come on up.'",
        "'speaker_4': 'Good evening. Evening. My name is Christopher Massey. And I'll just start by saying that I've been in the wine industry for 35 years and I'm a certified Somalia, trained in Burgundy. And that's why the focus on the European wines I trained there in 1989 and 1990, and my focus has always been on European wines.'",
        "'speaker_4': 'And I do realize, of course, that there are other places in the world and you will see a smattering of just about everything in the store, from South Africa to Lebanese wines to Finger Lakes wines to just about anything you can imagine is going to be in the store.'",
        "'speaker_4': 'It's only 700 square feet, though, so we've got to have a focus. And my wife and I will run this the same way that we ran our stores in Houston, and that's with great care and attention to detail and with a customer centric focus.'",
        "'speaker_4': 'And that's why we launched the the website was just to get the information that were coming and it's just kind of a marketing and it's all we're real, we're very marketing oriented sales and marketing kind of oriented. And so that's, that's why we launched.'",
        "'speaker_4': 'It's just, it's just an informative piece. If you look at it, it's really here's all about Christopher. If you read the website that's yeah.'",
        "'speaker_0': 'I got that an opening for 2019. No it was, it was very nice again. That is how I learned about it.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_0': 'About you and your experience.'",
        "'speaker_4': 'It's, it was more that than anything else. And so I can assure you that this this endeavor will completely fly. We've been chomping at the bit since we put in our letter of intent and, uh, May 17th this when we put in our letter of intent.'",
        "'speaker_4': 'So we are ready to go.'",
        "'speaker_0': 'I think if you feel like you've said enough, I think there's a motion about to be voted on. Excellent. But perhaps the vice mayor has a question.'",
        "'speaker_4': 'Any questions?'",
        "'speaker_11': 'I don't have a question. Okay. I just want to say, I've sat through a few of these meetings and I would like to restart and say I'm really I don't drink wine. You probably won't see me in your in your I don't drink at all.'",
        "'speaker_11': 'So you won't see me in your store likely. And I say just go there with my wife, who does. But I'm excited and I'm wishing you well. Thank you for supporting this. Thank you. I just want to make sure that we we launch out of this vote in a positive way.'",
        "'speaker_11': 'And thank you. Thank you. You hear nice.'",
        "'speaker_4': 'Things. Thank you very much. I appreciate it.'",
        "'speaker_0': 'And I, for one, am excited about a locally owned business. So thank you. And Councilmember Vela made the motion. Someone seconded it. Yeah. Nice to meet you. Me? Okay. All right, so we have a motion. We have a second.'",
        "'speaker_0': 'All in favor. I All right, that was unanimous. So congratulations. Welcome and good work. Council. Okay, let's see. Where are we? We've got item seven City Manager Communications.'"
    ]
}