{
    "Proclamation Declaring June 2019 as Lesbian, Gay, Bisexual, Transgender, and Queer Pride Month. (City Manager 2110)": [
        "'speaker_1': 'So whereas Alameda is proud to recognize the contributions of our community members who are lesbian, gay, bisexual, transgender, queer and or questioning to the arts, local businesses, schools, government, community organizations and religious institutions. And. WHEREAS, the Alameda Unified School District's LGBTQ roundtable fosters an inclusive, safe and welcoming environment for all students, faculty and staff.'",
        "'speaker_1': 'And. Whereas, Alameda and stand united under the motto Everyone belongs here to reduce bullying and harassment and teach respect for everyone, regardless of age, disability, ethnicity, faith, gender, sexual orientation or any differences perceived or real. And. Whereas, on January 17, 2017, the Alameda City Council adopted a resolution affirming Alameda its commitment as a sanctuary city to the'",
        "'speaker_1': 'values of dignity, inclusivity and respect for all individuals, regardless of ethnic or national origin, gender, race, religious affiliation, sexual orientation, or immigration status. And. Whereas, the city of Alameda affirms the dignity, value, and right to equal treatment of all community members.'",
        "'speaker_1': 'Now, therefore, be it resolved that I, Maryland, as the Ashcraft mayor of the city of Alameda, do hereby proclaim the month of June 2019 as LGBTQ Pride Month in the City of Alameda and encourage our meetings to learn more about the history and rich contribution of our LGBTQ community.'",
        "'speaker_1': 'And with that, and before we get into present the proclamations, would each of you like to speak briefly and to the to the audience into the microphone?'",
        "'speaker_0': 'Sure. Okay.'",
        "'speaker_5': 'Well, I had prepared something because I was told to. But if you don't want me to read it, I don't have to.'",
        "'speaker_1': 'You were you didn't prepare.'",
        "'speaker_0': 'You did. I did.'",
        "'speaker_1': 'I did. As long as it's not single spaced for three pages.'",
        "'speaker_5': 'Sure, sir. No problem. I just wanted to say that we are Jeremy and Andrew and to Houston. In May of 2010, we met in Los Angeles, where we began our relationship together. We and Steve instantly fell in love and decided to make plans for an eternal future together after vacation to San Francisco Bay Area.'",
        "'speaker_5': 'We were amazed at how much we loved it here and put plans in motion. After careful consideration of the cost of living, we decided to move back to the Midwest, where we both are from to save money with a three year game plan.'",
        "'speaker_5': 'Our plans consisted of getting married, building our careers, then relocating to the Bay Area of California, where all are welcome, eventually creating a family. We were married in 2014 and started City, Iowa, where same sex marriage was legal at the time and close to where we were living during our time in the Midwest, I was able to'",
        "'speaker_5': 'complete a cosmetology degree as well. After getting married, we knew we had to leave right away due to not being married legally in our home states. Our adventure to the Bay Area began in September of 2014. We were first looking in San Francisco but didn't feel it was right fit for us in our future plans.'",
        "'speaker_5': 'After weeks of looking elsewhere but still being close to the city, someone had mentioned Alameda. They had said it was an island city and a hidden gem in the Bay Area. The minute we drove over the Park Street Bridge, we were amazed.'",
        "'speaker_5': 'It reminded us of home in so many ways. Our mothers agree. We were not settled until we found a place to live in Alameda. Knowing that we were someday going to have a family, we started doing our research.'",
        "'speaker_5': 'We saw that Alameda was so safe and clean with good schools, great people, and a fabulous community. When. So much support. We have now been in Alameda for nearly five years and as a general manager of the Park Street, Starbucks in Alameda and I'm a hairstylist in Alameda because of our love for Alameda.'",
        "'speaker_5': 'We quickly got involved. As many of you may know, we are very big in supporting our community for which we love, including the Kiwanis Club of Alameda, which I'm the president and adds are on the board, the Elks Lodge of Alameda, in which we are in charge of two events every year and the Oakland East Bay, Cayman's'",
        "'speaker_5': 'chorus. In addition, we have also been very involved with many community charity events, raising thousands of dollars so that those less fortunate can do and have things that may seem out of reach, such as college food, clothing, health and a clean city.'",
        "'speaker_5': 'Our latest adventure is to have a baby. We are actually in step two of three right now in our IVF surrogacy process, hoping to have a baby by fall of 2020. The cost of this is very expensive and timely.'",
        "'speaker_5': 'We applied for a grant through a third party nonprofit organization and were awarded half the cost where we were so grateful to them as we never thought we could afford this. Also, we are big advocates for fighting for equal rights for everyone.'",
        "'speaker_5': 'Lately, more issues have been arising that are we are unwilling to stand by and let happen. One of these is fair IVF surrogacy health insurance laws for everyone, including same sex partners in which we have made some good process.'",
        "'speaker_5': 'We have been working on this for two years now and have gotten so much support and advice from our friends and community. Hopefully it will make it easier and less costly for same sex partners to have a baby via surrogacy.'",
        "'speaker_5': 'All these things would not be possible if not for living in a non non-judgmental and non prejudiced place. We have no plans of ever leaving Alameda as we feel it deserves the same support from us as it gives back to us.'",
        "'speaker_5': 'We love you, alameda, and thank you for being so diverse and accepting so that we can walk the street holding hands, build a family, build a career, be successful, and most of all be heard because of your open hearts to diversity and intolerance for discrimination based on sexual orientation.'",
        "'speaker_5': 'Happy pride. Thank you.'",
        "'speaker_1': 'Thank you. Who's next? Okay. Come on up. Robbie. Robbie and Lala. Come on.'",
        "'speaker_0': 'Okay.'",
        "'speaker_8': 'Hello, guys. My name is Robbie Wilson, and I am a proud Alameda. Hello, you guys. And this is Lala Turner. And she actually is she actually want to say you still want to say something.'",
        "'speaker_1': 'To just really bring the microphone into your level? We'd love to hear from you. So how old are you? How old are you? For starters.'",
        "'speaker_0': 'Nine now. Nine. Nine years old.'",
        "'speaker_1': 'Nine. What grade?'",
        "'speaker_0': 'Third. Wow. Going into fourth. Okay. Yeah. You wouldn't say anything else? No.'",
        "'speaker_8': 'Okay. Well, she was elbowed before. Intimidated, but. Yeah, we moved here. Oh, it's been 22 years. Two in Alameda. I do a lot of service for Alameda. A lot of you guys. And part of what I love, I'm so honored today and just being up here once again here and the fact that Alameda acknowledges this.'",
        "'speaker_8': 'And I remember the first year when I was driving by when turned the corner right there and the flag was flying down. And it was the first time in all these years I live there, here. And I saw that and I had to pull over because there was a moment.'",
        "'speaker_8': 'And so I'm definitely proud to receive this. And you want to see anything now? Okay. Next time.'",
        "'speaker_0': 'All right.'",
        "'speaker_8': 'Thank you guys so much for all you guys do.'",
        "'speaker_1': 'Who's next? Deborah and Alison, come on up.'",
        "'speaker_0': 'I am just thrilled to live in a town.'",
        "'speaker_1': 'I realize I've been.'",
        "'speaker_3': 'Here eight years, eight.'",
        "'speaker_0': 'Years. And I found.'",
        "'speaker_3': 'Alameda because Deborah was here already.'",
        "'speaker_1': 'And just that.'",
        "'speaker_0': 'Our diversity and welcoming ness just keeps growing. And I'm proud to be here and.'",
        "'speaker_3': 'Really grateful that.'",
        "'speaker_1': 'You know, we're standing before a.'",
        "'speaker_0': 'City council who's.'",
        "'speaker_1': 'Like, so.'",
        "'speaker_0': 'Genuinely happy and embracing, celebrating this month and giving the proclamation. Thank you, Madam Mayor and council people.'",
        "'speaker_1': 'Thank you for being here. It. I wasn't prepared. You were here. That's all right. Well, well, thank you for being here and welcome to you. Okay. With that, Jim and I are going to present proclamations.'",
        "'speaker_0': 'With all the political risks to the party, is there any hope for you? Oh, yeah. Yeah. Thank you. Hey, hey, hey, hey. Who are we to believe? All right. Yes, please. Thank you. Thank you. Thank you. Yes, sir.'",
        "'speaker_0': 'If you want to. Okay. Hey, everybody, to the paparazzi. Let's turn this way, way, way down. All the way down. Do we need an additional marathon? Streep. Yeah.'",
        "'speaker_1': 'Okay. So. Thank you, everyone. Yeah. Sonic, give us your address for the proclamation. Thank you. Okay. Our next item is oral communications, where anyone can speak on an item, not on the agenda. There's 15 minutes allocated at this time for public comment.'",
        "'speaker_1': 'Do we have any speak?'",
        "'speaker_3': 'We have no speakers.'",
        "'speaker_1': 'We have no speakers left.'"
    ],
    "Adoption of Resolutions Appointing Ron Carlson, Claire Loud and Peter Pizzino as Members of the Golf Commission.": [
        "'speaker_1': 'So that takes care of the the consent calendar. So then we move on to item six A and six A is adoption of resolutions, appointing Ron Carlson, Claire Loud and Peter Pacino as members of the Golf Commission. And I think we can do it as one motion.'",
        "'speaker_1': 'Yes, yes.'",
        "'speaker_7': 'So I move approval second.'",
        "'speaker_1': 'So I will defer to the new mom. Okay. So it's been moved by Councilman Rivera, seconded by councilmember, dissolved all in favor.'",
        "'speaker_0': 'Of a roll call.'",
        "'speaker_1': 'Vote. In favor of a roll call?'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Kels already said.'",
        "'speaker_0': 'Yes. Not right. I Odie i i.'",
        "'speaker_3': 'Mayor as the Ashcraft.'",
        "'speaker_1': 'Apparently a slow learner.'",
        "'speaker_3': 'I carries by five eyes and I believe we have them here. Did it feel.'",
        "'speaker_1': 'Great?'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'So if our new commissioners would come on down. Carolyn again.'",
        "'speaker_0': 'Excuse me.'",
        "'speaker_1': 'Claire. I would forget my daughter's name. Clear, loud. Peter Pacino and Mr. Carlson.'",
        "'speaker_0': 'Not here. Okay. All right. Okay.'",
        "'speaker_3': 'If you raise your right hand, you sound like sort of.'",
        "'speaker_7': 'Just one at a time.'",
        "'speaker_0': 'No, no, no. Hello.'",
        "'speaker_1': 'Together? Yeah.'",
        "'speaker_3': 'Do you solemnly sort of call the Constitution, the United State for the Constitution of the State of California, and that you'll.'",
        "'speaker_0': 'Well, faithfully discharge the duties? Probably. You're about to enter. I do. I do. Thank you.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'And in Walla Walla, new golf commissioners are signing their their certificates. I just want to thank them for volunteering their time. Each of them brings a wealth of knowledge and experience to the golf commission. And these are folks who haven't previously served on a board or commission, which just really makes me happy.'",
        "'speaker_1': 'So thank you both for your your future service. And we welcome you. All right. So then we move right into item six B.'"
    ],
    "Recommendation to Approve Otis Drive Traffic Calming and Safety Improvement Project Design Concept Recommendations. (Planning, Building & Transportation 4226287)": [
        "'speaker_3': 'Recommendation to approve Otis Drive, Traffic Calming and Safety Improvement Project Design Concept Recommendations.'",
        "'speaker_1': 'All right. So we have. Who do we have here?'",
        "'speaker_10': 'Good evening, Madam Mayor. Members of the council. My name is Scott Wickstrom, the city engineer. Tonight, along with David Parisi from Parisi Consultants, we will be presenting the Otis Drive Traffic Calming and Safety Improvements Project. As council member, I'll know the slide projectors not in service.'",
        "'speaker_10': 'And so our one, we have the best slide presentation that the public will never see. That said, I'm going to go through and really try to hit the highlights of the entirety of the presentation staff report as well.'",
        "'speaker_10': 'Written should be very thoroughly and will certainly be available for questions at the end.'",
        "'speaker_1': 'And I will just add that the staff report is available online and the presentation is excellent. So if you're really interested, you can take a look at it online.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_10': 'So I'm going to I'm going to jump ahead and I'll kind of let you know the title of the sheet. I'm on the third slide, which is the project goal, and it's singular. I was very specific about that.'",
        "'speaker_10': 'It's to improve safety for all users. It's really reducing driving speeds. That's one major component about it. It's also improving safety for pedestrians at crossings. It's providing for bicycle safety that doesn't really exist in terms of a dedicated bike facility on the street right now, improving bus stops, operations and then, where possible, doing green infrastructure.'",
        "'speaker_10': 'Next slide this will be a phased approach project. Two years ago, with the capital budget, the city council authorized or appropriated $500,000 to study this, to reach out to the public through public workshops and then bring back forward ideas.'",
        "'speaker_10': 'And what we are proposing to do is a two phased approach. The initial phase will be short term, relatively inexpensive, predominantly paint type based improvements that with a request that has been before you already with the 1921 capital budget, an additional $500,000, we believe we could implement final design this fall and actually construct in spring of 2020'",
        "'speaker_10': 'should the Council approve our initial approach tonight? There's also some long term improvements that are proposed with this project that depend on the full menu of potential improvements may cost several million dollars and we would be soliciting grant funding for such a project.'",
        "'speaker_10': 'We are not asking council for final approval of those long term improvements at this time. We're really focusing on looking for approval of the short term recommendations project schedule. We've had a survey that went out last fall. We've held two community workshops.'",
        "'speaker_10': 'We've been to the Transportation Commission twice, most recently on May 22nd, in which case the Transportation Commission voted 4 to 1 to support the project. And I would say that all five commissioners were in general support of the project.'",
        "'speaker_10': 'There was one the one dissenting vote was more of a concern about the treatment of the bike facility adjacent to Rattler Park, which we'll be talking about a little more in the future here in this presentation. So as I mentioned before, if approved by council tonight, we're looking to finalize design this fall and go into construction in'",
        "'speaker_10': '2022. Jump ahead a couple of slides to where we talk about vehicular speeds. It is a concern. Everyone who's driven out at unnoticed drive can pretty freely attest to that. I'm sure the residents can speak to it pretty, pretty freely.'",
        "'speaker_10': 'And they have regularly told us during during our workshops, a couple of notes, you know, the average speed depending on where you are in the quarter, somewhere between 28 and 30 miles an hour. The 85th percentile, which is really what the police can enforce at, is 33 miles an hour.'",
        "'speaker_10': 'And during a single day, when we recorded speeds in a single afternoon in February, the max speed recorded was 75 miles an hour down the stretch. And the police department has assured me that that is not unusual to see excessively high speeds because of the straightness, the with the lack of stops or other traffic calming devices on'",
        "'speaker_10': 'the street. Next slide is really types of collisions, and they're kind of clustered at a lot of the intersections. I want to call just one thing to do for which is there's a variety of types of different types of collisions that are tracked.'",
        "'speaker_10': 'But for the vehicle, bicycle vehicle pedestrian it at this point comprises 19% of. The collisions. And as you would run to the very next slide, you look at the injuries and fatalities over that same four year or five year period.'",
        "'speaker_10': 'Those 19% of incidents comprise 54% of injuries. And there was one fatality not too long ago at one of the intersections on the street. Moving to next slide, which is traffic volumes, I spend a little bit of time here because it's kind of important to what we're really ultimately proposing to do here.'",
        "'speaker_10': 'Otis Drive is two lanes each direction. Generally speaking, a simple way of thinking about a lane is its operating capacity as a thousand cars per hour per lane. So you can have 2000 cars per hour going in each direction on Otis Drive.'",
        "'speaker_10': 'As part of our study, and there's been a very robust collection of data or series of data that have been collected over the last four years. We have 92 separate data points collecting data along here. We generally find that the traffic volumes west of Grand Street are on the order of 4 to 500 vehicles per hour during'",
        "'speaker_10': 'the pump peak. And Eastern grand to traffic is a little bit heavier, but it's on the order of about 600 vehicles per hour. So it's well less than the current nominal capacity of 2000 cars per per lane or 2000 cars per hour for a two lane street, and still a significant amount of excess capacity, as you would'",
        "'speaker_10': 'look at a potential lane reduction or a road diet to a two or three lane configuration. So that's a very important point to factor. And we did work with AC Transit very significantly about their bus stops. They we have basically incorporated not only recommendations for improving safety and maintaining their access and use along this quarter.'",
        "'speaker_10': 'So it's been a good partnership with them. And then I want to jump a little bit into the community survey and the first workshop and I'm going to there's a whole series of slides with some nice pictures, but there's a community workshop, number one, that has key issues affecting Otis Drive.'",
        "'speaker_10': 'And really the top four items on here are good to take note of speeding. Number one concern, lack of pedestrian crossings, particularly between Grand and West Lane and lack of bicycle facilities. And the fourth one is Safety Grand and Otis and lack of protective left turn.'",
        "'speaker_10': 'So those comprise the top four issues brought up part of the as part of the workshop. I would be remiss to say that we also did the survey earlier in the year and one of the concerns that came up, or at least a couple of concerns that came up during the initial surveys, were concern that Otis Drive'",
        "'speaker_10': 'would would be developed in a similar way to Shoreline Drive. There's some concern about that. And I want to say that there are two very different streets, and it's not really appropriate to compare them directly. My personal opinion that the treatment for Otis or sorry for Shoreline Drive is appropriate for Shoreline Drive.'",
        "'speaker_10': 'Otis Drive demands a different type of a treatment so that fundamentally they're very different streets and have different sorts of approaches about how we would do traffic calming and improve safety for all the users. Secondly, there is also a very significant concern about enforcement and a lot of survey results and general public concern that if there is'",
        "'speaker_10': 'just better enforcement, the speeds would go down. And Sergeant Foster has been and he's here tonight, has been at all of the committee meetings, and he spoke at length about that. And basically and I'm going to paraphrase a little bit, but what is more correct statement was but we can't really enforce our way out of this issue'",
        "'speaker_10': '. The road is just basically too wide. It encourages speeding by its design. So moving ahead to the next sheet, which is, I'll say, measures to implement and I'll spend just a brief time looking at the first six cities.'",
        "'speaker_10': 'Number one survey result was a center left turn lane going from a four lane road to a three lane road. A road diet. Number two were the addition of bike lanes or bike facilities, depending on how you want to take that landscaping came in there, read curves at corners for visibility.'",
        "'speaker_10': 'That's a pedestrian improvement, pedestrian safety. And then the last two roundabouts and protected left turn a grande are two different ways of approaching that challenging intersection at Otis and Grand. And and Mr. Parisi will speak a little more directly about what the two different alternatives potentially could be there are and what our what our recommended one is'",
        "'speaker_10': 'at this point for a potential long term solution. So with that, I'm going to turn over the mic to to David and let him kind of talk through the our toolbox.'",
        "'speaker_1': 'Thank thank you.'",
        "'speaker_11': 'Thank you, Scott. Madam Chair, City Council members, my name is David Preece in the Civil and traffic engineer with Prezi Transportation Consulting. And I had a great opportunity, the pleasure of working with your staff and the community on this project.'",
        "'speaker_11': 'And it's been very enjoyable and we've learned a lot. And the first thing we did is. Worked with the community at that first open house to really understand existing issues up and down. Otis Drive the segment, Otis Drive that we are looking at between West Line and Willow is 1.1 miles in length.'",
        "'speaker_11': 'And as Scott mentioned, there's many, many issues going on with the street. We spent quite a bit of time not just looking at the issues, but also collecting data, looking at traffic volumes, crashes, the infrastructure on the street.'",
        "'speaker_11': 'And after the first community workshop, we then went back and started developing a toolbox of potential short term and long term measures that could potentially be implemented along Otis Drive. There's a slide that's called traffic calming and safety tools, and there's a bunch of them that were considered.'",
        "'speaker_11': 'The intent of the project is to provide some measures to improve safety, to encourage more reasonable travel speeds. Scott mentioned there are some speeds that are incredibly excessive, improve the visibility and safety for pedestrians not only crossing the street but walking along the street as well, and to increase bicycle comfort and safety.'",
        "'speaker_11': 'Next slide is titled Advantages of a Three Lane Street. I'm going to spend a few moments here. Otis Drive a 64 feet wide between the curbs. There's a lot of space. And as Scott mentioned, there's more space than is needed for the traffic volumes that we see today and expect in the future.'",
        "'speaker_11': 'So we are proposing what is called a road diet and that is reduce the number of thru lanes from 4 to 1 in each direction, plus a continuous left turn lane in the middle of the street to facilitate left turns in and out of side streets as well as driveways.'",
        "'speaker_11': 'This provides some additional room to not only retain the on street parking along the curves, but to install a bike lane that has a buffered strip between the travel lane and the bike lane. According to FHB Way, who has reviewed lots of road diets that have been developed throughout throughout the United States over the last decade or'",
        "'speaker_11': 'so. Roadways can reduce collisions substantially by about 19%. Definitely see speed reduction. Average speed reduction about three miles an hour. But what's probably most important is the excessive speeds coming way down. So those those 70 mile an hour speeds or 45 mile an hour speeds being reduced, collision reduction.'",
        "'speaker_11': 'Obviously, for pedestrians, there be fewer lanes to cross, better visibility, more space for cyclists, particularly if bicycle lanes are provided and the ability to have smoother traffic flow. In other words, speeds that are pretty consistent across the board.'",
        "'speaker_11': 'Next few slides show some of the tools that are being proposed. They do include the installation of buffered bicycle lanes and some red curb striping at intersection corners and in front of the crosswalks. These certainly would provide better visibility between pedestrians and motorists and vice versa, but also could can provide better visibility for motorists coming out from'",
        "'speaker_11': 'the side streets as they look to the right or to the left before they enter the traffic stream. We are also proposing not only creating high visibility crosswalks at the locations that already have crosswalks, but installing four new ones along the 1.1 mile long roadway.'",
        "'speaker_11': 'Certainly at some places there are not left turn lanes, such as at Grand and Otis. We're looking at installing left turn lanes dedicated just for left turns for east west traffic on Otis as well as at Grand. And in the future, when there's money available to dedicate to traffic signal upgrades, providing left turn arrows as well.'",
        "'speaker_11': 'The short term and long range improvements do include the consideration of curb bulbs in the short term, using paint and and bollards to provide more bouts that can reduce crossing distances, increase sightlines, and also help reduce speeds in the long term.'",
        "'speaker_11': 'Transitioning those into curbs that are sticking out about six feet into the street, which is slightly less than park cars do. There's a slide titled Modern Roundabouts as a long term solution. We have proposed and we got good feedback from the community.'",
        "'speaker_11': 'The installation of a modern roundabout at Otis and Grand Modern Roundabouts have been proven to reduce speeds through intersections, reduce the potential for many different types of conflicts, including left turn conflicts and broadside collisions. And also they provide splitter islands for pedestrians can cross a traffic stream one lane at a time and really just to provide a'",
        "'speaker_11': 'balanced solution for all users traveling through an intersection. There will be street trees. There are a lot there are many streets, trees on the on the streets. Some are in good health, some are not. And actually, there's 21 vacant street tree wells that would be planted with trees as part of the short term improvements.'",
        "'speaker_11': 'The types of trees will be worked out with your arborist in with the neighbors. There is some. There's a slide called a community workshop, too. And that is where we came back and shared with the community some of the ideas for short term as well as long range improvements, and spent time work with the community at five'",
        "'speaker_11': 'different tables talking about some of these and getting a further additional input. There is a giant plan that is called Otis Drive Traffic Calming, a safety improvement project that shows in two strips the short term recommendations and then in inset boxes each of the potential long term remedies that can be pursued individually or as a packages in'",
        "'speaker_11': 'the future as funding becomes available. And I will turn your attention also to a slide called four lane to three lane converge. And this shows what the street would look like with the conversion between intersections. There's plenty of capacity to provide this retain really good traffic operations between intersections with this lane conversion, and it's important to pay'",
        "'speaker_11': 'attention to how the intersections operate. And so there would be some slight changes at the interchange intersections with left turn lanes in signal phasing or a roundabout. There is also some images here that show grand a photograph of Missouri Otis looking at looking at Otis West of Grant.'",
        "'speaker_11': 'Under existing conditions, you can see how wide the street is. In some cases, there's some empty walls on the south side of the street in this photo. The next photo is a simulation that, ah, that we prepared that shows what the street conceptually would look like in the future with three lanes, which is inclusive of a continuous'",
        "'speaker_11': 'to a left turn lane buffered bike lanes and the retention of parking. The last image shows some trees that have matured over time as a short term plans becomes a longer term plan. These are again, the street tree types are to be determined, but certainly trees and canopies can provide traffic calming experience along a roadway such as'",
        "'speaker_11': 'Otis. I'm not going to go through all the rest of the dozen plus images, but I will just quickly highlight what those show they do. Start from the West at Otis in West Line. In each of these shows, existing conditions followed by short term and then a long range solution.'",
        "'speaker_11': 'So at Willow, at West Line, the intent is to provide some striping improvements, some areas to protect the cyclists that are crossing this four legged intersection and also moving the bus stop, the westbound bus stop around the corner.'",
        "'speaker_11': 'Bus stop improvements are part of the overall project. There's currently ten bus stops. Two of the bus stops would be removed. Other bus stops will be relocated to far side locations instead of near side. That is a preference of AC transit as well as the provision of the pavement behind the curb to provide areas for the lifts'",
        "'speaker_11': 'for the busses. So to make the bus stops in compliance with Americans with Disabilities Act at West Sign, a long term improvement looks similar to the short term but has more protection for cyclists and is you'll if you look closely, you'll see curbs and curb extensions for, you know, long term improvements at the intersection.'",
        "'speaker_11': 'There's a sample of Larchmont. Larchmont is a popular intersection today where many people cross the street. There is not a crosswalk there, not a marked crosswalk. This is a location where we would install a crosswalk initially in the short term conditions with high visibility markings signing, as well as temporary curb bulbs and a long range condition.'",
        "'speaker_11': 'This would be converted into permanent curb bulbs. There are three other locations that are also do not have crosswalks currently. Those are Torrington Isle, Arlington Isle and Glenwood Isle. Each of those three additional locations would also be provided with crosswalks similar to Larchmont and the existing crosswalk at Waterview and San Creek will be upgraded to provide again'",
        "'speaker_11': 'high visibility crossings, plus the rectangular rapid flashing beacon assembly. Next, you will see, I believe Otis and Grand is a intersection. We spent quite a bit of time at not only our bus stop, the bus stops being proposed to be relocated, but in the short term, the turn lanes for Grand and for Otis left turn lanes would'",
        "'speaker_11': 'be provided, the crosswalks would be enhanced, red curb striping would occur just before and after the intersection. To open up the sightlines, temporary curb bulbs would be installed and there'd be. Areas for cyclists who chose to use that either as a through cyclist or as a turning cyclist behind within as a painted curb bulbs.'",
        "'speaker_11': 'The longer term solution is a modern roundabout. Cost actually would be very similar to upgrading the signal and providing curb bulbs. So the cost difference is actually very is very is about zero compared to what a long term solution would be if we upgraded the signal and provided complete curveballs at the intersection.'",
        "'speaker_11': 'But over time, the maintenance costs are considerably lower because in electricity and I've previously mentioned some of the safety considerations with a modern roundabout. We also spent quite a bit of time looking at how to treat cyclists or a bicycle facility in front of Rider Park, particularly in the eastbound direction.'",
        "'speaker_11': 'One of the options is to provide what's called a buffered class two bike lane, where the bike lane where there's parking against a curb followed by a bike lane, and then the buffer lane, which is the proposal for the entire corridor.'",
        "'speaker_11': 'And then the option that was reviewed was to provide what's called a parking protected bike lane, where the bike lane is against the curb, then there's a buffer and then there is parking in that area. This is a spot where you're doing this would not require removal of a lot of parking spaces, maybe one or two for'",
        "'speaker_11': 'this option. And it's it's a feasible option. The Transportation Commission, there was one member who was in favor of this. Four were in favor of retaining taining the proposed class. Two buffer bike lane. And last but not least, there would be a transition at Willow.'",
        "'speaker_11': 'Willow has two streets that are offset, and we have determined there's some ways to do some signal timing adjustments there to make it work a little bit better. But by the time eastbound traffic gets to, well, those can be necessary to restore two traffic lanes at the Western intersection, and that can be done while also retaining a'",
        "'speaker_11': 'bike lane. There are some treatments, including bike lane, striping and sure lane users through the intersection that are being that will be pursued as well at that location. And similar to other spots where there are bus stops, bus stops would be relocated and we've worked with AC Transit on some better locations than the existing locations for the'",
        "'speaker_11': 'bus stops. That is. That's it in a nutshell. Those are the proposed improvements, short term and long range. And tonight we're looking for your input on the short range or approval of short range improvements and input on some of the longer range ideas as well.'",
        "'speaker_1': 'Thank thank you, Mr. Parisi. And before we go to public comment, I assume we have some speakers slips. We I want to see if council members have any clarifying questions they want to either ask of our city engineer, Mr. Wikstrm, or of the consultant Mr. Parisi, and he clarifying questions.'",
        "'speaker_1': 'Counsel Let's start with the Vice Mayor.'",
        "'speaker_9': 'Thank you. I guess this is a question for for Mr. Wickstrom in terms of the process tonight. These are not final drawings. These are just kind of initial conceptual concepts, I mean, somewhat fleshed out. But in terms of my interest, just to be clear, is if whatever we approve that we are able to move forward tonight and'",
        "'speaker_9': 'not come back in six months with new revised drawings. In terms of the ability to discuss additional things here, how does this process accommodate the ability to kind of consider additional tweaks, changes, significant changes?'",
        "'speaker_10': 'We can certainly take those under advisement. I think I'd probably start by saying what we're really seeking from council tonight is approval of the concept, the primary components of the concept, which is the reduction of a four lane road to a three lane road.'",
        "'speaker_10': 'Whether that is acceptable, whether you know, whether how it's structured with a buffer bike lane along the bulk of it, we are certainly throwing up an alternative in front of Riddler Park. So that's something that we want to get feedback from council on in some direction about how to move forward, some of the finer level details in'",
        "'speaker_10': 'terms of the ball buyouts and potentially our RFP locations. Those are all fine level things that we can certainly take input from council. But without without the expectation, at least my expectation that we would need to come back to this body.'",
        "'speaker_10': 'I think the big question we're asking for is primarily the four lane to three lane reduction and the improvement of this type and nature of improvements. And if there's some detail comments, that's something we can certainly work through at a later time.'",
        "'speaker_9': 'Great. Thank you very much.'",
        "'speaker_1': 'Okay, Councilmember Odie.'",
        "'speaker_4': 'Thanks. My question and I because I received a constituent inquiry about this today, I know it's once a year, but our 4th of July parade comes down Otis and turns on two grand. And I guess the concern was that we'd still be able to have enough clearance for, you know, the larger trucks and floats and everything to'",
        "'speaker_4': 'do that under under the long term solution. Can you? I think that was discussed at the Transportation Commission, but maybe you can remind everybody here tonight.'",
        "'speaker_10': 'Yes, that was that was an issue that was brought up prior to the Transportation Commission. And we did look at the type of vehicles that are used in the parade and also kind of modern roundabouts are designed to handle large vehicles, to handle trucks, to handle fire trucks, to handle that kind of stuff.'",
        "'speaker_10': 'So while we haven't also studied every potential alternative or say, float size and stripe, there is an expectation that we should be able to accommodate the 4th of July parade through this intersection with the roundabout. And again, that's not a decision we're asking council to make tonight, but certainly if there's a support for it, it would be'",
        "'speaker_10': 'something that we would absolutely consider as that would go for a grant application or any future potential final design.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Councilmember Daza Oh, great.'",
        "'speaker_7': 'Just a set of questions in a letter to a resident resident named Kline on the second page of the letter. Staff wrote the following The US Federal Highway Administration provides guidance on traffic volume threshold levels for four lane roadways that might be candidates for road diets, Staff continued.'",
        "'speaker_7': 'Their research indicates that current and projected traffic volumes on Otis Drive are below the threshold for impacts to roadway operations. Because I didn't quite see the specific numbers. What are the FH A's traffic volume numeric thresholds? What are the actual numbers and how does the Otis drive numbers that we see compare to those?'",
        "'speaker_7': 'Are we significantly, you know, is it is there a significant difference or is it less than 60 this difference less than significant?'",
        "'speaker_11': 'That's a great question. So according to have a typically when a roadway has less than 20,000 vehicles per day, it's a good candidate for a road diet. Otis West Grand carries less than 10,000 cars a day. Or does these two grand carries less than 15?'",
        "'speaker_11': 'Thousand vehicles a day. So at those levels, great candidate for road diet. The issue is really not the street between intersections itself. It's it's really how the intersections, particularly the signals, the controlled intersections are treated and how they operate.'",
        "'speaker_11': 'So we spend considerable time making sure that the signal timing, the lanes and the configuration would accommodate the traffic volumes existing and future at an acceptable level of service during peak peak periods.'",
        "'speaker_7': 'Okay. Second follow up question. The number 19% reduction was quoted that the FH says that there. I suppose research of research. I don't know if they actually did it themselves, but their research of research shows that there was a 19% reduction.'",
        "'speaker_7': 'So are we saying that the 38 collisions over a five year period would drop down to roughly 30, I guess would be the number which would be I think 30 is roughly 81% of of 38. Is that what we're looking at?'",
        "'speaker_11': 'I'm not making a prediction about exactly what will happen with the types of collisions that the FAA researches. Across all the road diets combined, it's a weighted average. I think there's a potential for even larger reductions with Otis Drive.'",
        "'speaker_11': 'We've spent quite a bit of time looking at the crashes. The crash types went over those, not only at the intersections, but at the Mid-Block locations and many of the treatments that we're proposing. We believe the crash potential not only be reduced, but the severity index would be as reduced as well.'",
        "'speaker_11': 'So we think that would provide great potential for that.'",
        "'speaker_7': 'Great. Thank you. Two more questions. Does the state of California, much in the way that we used, was threshold numbers for the state of California have numbers that that are also used when determining whether or not road diets are appropriate.'",
        "'speaker_11': 'You know, I'm not familiar if the state has some, but many of the case studies in the FHA freeway analysis came from California. So and certainly California has been a leader in providing road diets on four lane streets.'",
        "'speaker_7': 'Okay. Well, state of California met Caltrans. I mean, because oftentimes we turn to Caltrans, I think for a lot of road changes, whether or not they meet what are called state warrants.'",
        "'speaker_11': 'Yeah. Caltrans has also adopted a complete streets policy and they are very much in favor of measures such as road diets and modern roundabouts because both have been proven to reduce or to improve safety and reduce collision potential.'",
        "'speaker_7': 'And final question once again, on the typical speed on Otis Drive. Right now, the speed limit is 25. I know we've heard outliers of 75 miles per hour. But what's what's the typical speed that people are actually traveling?'",
        "'speaker_7': 'Was it 32 miles per hour that I hear?'",
        "'speaker_10': 'Yeah, the average is between 28 and 30, depending on what section. I think a little bit west of Grand, they averages is about 30. So the average is in excess of 25. Yeah.'",
        "'speaker_7': 'Okay, great. Thank you very much.'",
        "'speaker_1': 'Thank you. Councilmember Villa, do you have any questions on the staff report? Okay. Thank you. And I don't either at this time. Okay. And so we do have public speakers.'",
        "'speaker_0': 'We have.'",
        "'speaker_1': 'Four. And, you know, my caveat, if any speaker happens to have a child with them, they go first.'",
        "'speaker_0': 'Oh, is that.'",
        "'speaker_3': 'Mr. Kaiser? Oh.'",
        "'speaker_0': 'Yeah. You know.'",
        "'speaker_1': 'I believe there is a gentleman with a cute little blond daughter. I'm guessing a daughter brought a child so he could go first or.'",
        "'speaker_0': 'I don't know.'",
        "'speaker_1': 'You're telling us your name, sir?'",
        "'speaker_5': 'My name is Mrs..'",
        "'speaker_10': 'Morgan Belanger, Mrs. Leona. And we ride two miles to preschool every morning. Thank you for having us.'",
        "'speaker_0': 'Right. We. That's the city council.'",
        "'speaker_10': 'Oh, I'm. I'm speaking in memory to shift the mood. A little bit of teeth rusting. I didn't know Ms.. Rothstein, but I rode past her body on Howard Street in San Francisco about three months ago. She was riding in a class two bike lane until a driver opened a door into her pathway.'",
        "'speaker_10': 'She swerved and was struck by a passing truck. I came upon the scene about 3 minutes after the collision. It stuck with me pretty well. Open doors are far from the only obstacles present in bike lanes not protected by parking rights.'",
        "'speaker_10': 'Her vehicles are ubiquitous and I'm sure you've all driven through school zones in Alameda in the morning. It's kind of a disaster when parents drop kids off in the bike lane. Nine year olds on bikes have to swerve around by mixing with traffic.'",
        "'speaker_10': 'That's an unprotected bike lane. This is our chance to fix this problem cheaply with a little paint and good design. The city we share a border with Move Fast. Howard now has a Class four protected bike lane on the stretch in question.'",
        "'speaker_10': 'Who knows how many lives been saved in three months? Who knows how many will be saved in future decades? San Francisco has even set a precedent with a very recent protected lane in a school zone on Valencia in front of Friends School.'",
        "'speaker_10': 'And we we now have an opportunity to get a design right in the first place. I urge you to approve the road, Diane, with the class four parking protected bike lane to keep us and our children safe. I'm sorry to bring the mood down a little bit.'",
        "'speaker_0': 'Yeah, thank.'",
        "'speaker_1': 'You. That was important. Thank you.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'The next speaker is Joe Kaiser, then Pat Potter and Jim's trailer.'",
        "'speaker_5': 'Big evening. I am a Otis Drive resident and I am here in support of the project. I believe I actually spoke with Mayor Ashcraft a number of years ago about this project or the concept of it.'",
        "'speaker_1': 'Rome wasn't built in a day here.'",
        "'speaker_5': 'But it's very exciting to have it reach this point. I have two young children, both of whom are attending Wood Middle School currently, and I look forward to when one of them will move on to high school. But I look forward to both of them being able to more safely ride their bikes, walk on the streets, to'",
        "'speaker_5': 'drive them to and from school and other events without having to worry about people speeding past in the second lane, going upwards of 50, 60, 70 miles an hour. At times, I had the opportunity to work with other residents, to be trained by police, to operate radar guns on the street.'",
        "'speaker_5': 'And I can tell you that just anecdotally, from standing out there for ten or 15 minutes at a time, we would often record people going 40, 50 miles an hour pretty regularly, certainly well in excess of 35 miles an hour.'",
        "'speaker_5': 'We would write write down a number of license plates within a ten, 15 minute period. And some people actually the police would reach out to them with a notice. You know, residents recorded you going a certain speed and some people wrote back and were very kind of shocked at their own behavior, glad that they had been notified'",
        "'speaker_5': 'that they had been, you know, engaging in unsafe driving practices. I think that residents would appreciate having the opportunity to drive on a road that does not encourage those kinds of speeds. I also wanted to reflect to the the council that the city staff, the Privacy and Associates consulting firm, has been very responsive to community, a lot'",
        "'speaker_5': 'of community input. They've received that input. They've included that input in their plans. I've been very impressed with the level of detail that they have gone into discussing these plans with the community. So I think that, you know, the proposal that's being made to the council has been very thoroughly vetted and researched.'",
        "'speaker_5': 'I also wanted to put in the note for a video that I believe you all received from Jennie Gong with the two children. She assures me that they actually prepared the entire script for that video. They spent apparently a number of hours putting it together over the course of about a month, maybe more than a month.'",
        "'speaker_5': 'So if you haven't watched it yet, please watch it. They really poured themselves in the. That project. And they wish they could have been here tonight, but hopefully the video suffices. So thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'Thank you, Mr. Kaiser. I next be.'",
        "'speaker_3': 'Here. Pat Potter, then James trailer.'",
        "'speaker_1': 'Pat Potter and then Jim. Okay. Hello.'",
        "'speaker_12': 'Hello. I'm Pat Potter. I'm part of the city's transportation awareness committee. I'm also the chair of Kansas Transportation Committee and also now president of Bike Walk Alameda. And I'm a little choked up from what that gentleman told us because that's exactly what I came here to talk about.'",
        "'speaker_12': 'I'm not quite sure how we can put safety in the title of this, given that we're not getting a protected bike lane down the entire Otis. However, I do realize there's budget constraints, so I just want to look at a protected class for Bike Lane in front of Riddler.'",
        "'speaker_12': 'And the reason is, is because that is an area where parents park their cars right along sorry, right along the sidewalk to get into the park for their kids to play sports. So what happens is when they come out and they get in their cars and they take off and they don't look, if we don't have that'",
        "'speaker_12': 'protected bike lane, we're going to have a bicyclist squeeze between that car that hasn't looked and the car that's coming down the street that has only one lane because now we've put in the center lane. So what happens?'",
        "'speaker_12': 'The car pulls out, bam, the bicycle get hit, gets hit. Then there's a second thing that can happen. So the car pulls out, doesn't look. The bicyclist sees the car, he swerves so he doesn't get hit and bam, he gets hit by the car that's coming down the street.'",
        "'speaker_12': 'Car can't go anywhere but right into him. And there's a third. So the the parent is late to the game. The bicycle is riding down. The parent swerves in front of him to get into that parking spot, nix his front wheel.'",
        "'speaker_12': 'The bicyclist goes flying. Where is the safety in that? So I strongly, strongly urge you, beg you put in the protected bike lane so you have the sidewalk, the bike lane, the barrier, the cars park and then the traffic.'",
        "'speaker_12': 'Thanks very much.'",
        "'speaker_1': 'Thank you, Mr. Taylor.'",
        "'speaker_6': 'The building. Madam Mayor. Council Members and Citizens Council. One block away is simply a very satisfactory route as Shoreline Drive obviating the need for all of this and, you know, work on all of this. The big thing is, is Otis Drive is an emergency master emergency safety route.'",
        "'speaker_6': 'Once you road diet, you're not going to get that lane back. So you are making decisions that affect the safety of the island for a long time. If you must have a bike lane, please. Class two and not class four for the following reasons.'",
        "'speaker_6': 'Because class four puts bikes on the passenger side of the cars that will be parking along Otis Drive. Currently one vehicle parks on Otis Drive. You have the car and you got a curb. Stepped right out. There's nothing in between.'",
        "'speaker_6': 'But when you have a lane in between now the passengers exiting a car now have to look. Not only the driver has to look on the left, the passengers now have to look on the right side. So it's dangerous.'",
        "'speaker_6': 'Now, look at the exception that they made for Whitner Park. It's Woodland Park, not Litter Park. People said, please do not have a class for near Rattler Park. They, the kids leave their vehicles quickly, etc.. So right now they are already proposing that you have class four over here driving.'",
        "'speaker_6': 'Then they want to switch over at Riddler Park and then switch back again under their current proposal, because they see that there is a reason not to have a Class four at Riddler Park. My argument is that same argument, the entire length of the project.'",
        "'speaker_6': 'It doesn't mix well in transportation. The lanes are supposed to be from center to curb. Fast, fast as fast, slower, slow. And then, you know, off to the curb. With class four, you've got fast, you've got zero when you've got cars parked and another fast lane because you've got bicyclists now going 12 miles an hour.'",
        "'speaker_6': 'But oh my God, the thing that I run into most is the damn scooters that are going a 20 miles an hour and they will use the bike lane. So you will have 25 mile an hour zero for the park cars and 20 miles an hour on the passenger side when you if you pass class four.'",
        "'speaker_6': 'So I am totally against class four. The proposed diet is similar to Front Side Boulevard, west of High Street, and Public Works has always mentioned a desire to further road diet for Inside Boulevard. They're not going to do it now, but they're proposing that it's law enforcement that will make the difference on speed.'",
        "'speaker_1': 'Just that. Do we have any further public comment? Okay. With that, I'm going to close public comment and we will move into council discussion. Who would like to lead off? Councilmember Daisuke.'",
        "'speaker_7': 'Well, thank you very much. I I will pick up where the last public speaker talked on the on the topic of law enforcement. You know, having grown up in Alameda in the seventies and in the eighties, I think everyone in town always knew that Otis Drive was a speed trap.'",
        "'speaker_7': 'And this was the case in sixties when I talk with people who grew up here and then and it was a speed trap because you would have cops who would literally stay at at any of the intersections where there was the intersection by Cruzi Park in Otis or the intersection, they would hang out at the intersection.'",
        "'speaker_7': 'It might have been the same court, by the way, just shifting from one part of Otis Drive to the next. But it was a law, and I think that everyone knew it. And I think what we what we don't have is we don't have that level of of of attention from our police force.'",
        "'speaker_7': 'I think that's the part that that we need to focus on is enforcement. Because when we get back that culture, people always talk, yeah, you know, don't don't spit on Otis. Don't spit on Otis. Just like we did back in the seventies.'",
        "'speaker_7': 'In the eighties. And when I look at the data that's presented here, while staff had indicated for leading issues, the one issue that just pops out automatically is speed, whether it was at the workshops or I'm sure through the online.'",
        "'speaker_7': 'And just, you know, by your experience, I hear that the maybe the typical speed is 33 miles per hour, but I don't think so. I think the speed is certainly hovering above that. So speed, I think, is an issue.'",
        "'speaker_7': 'And I think the remedy is is enforcement like we used to do. I at the end of the day, Otis Drive still needs to handle a vehicular var a volume of vehicular traffic that allows people to go from one part of the island to, say, shop at South Shore and back, or even allows people who live around'",
        "'speaker_7': 'South Shore to get to work in a orderly, safe manner. And right now, obviously, it's a speed trap. But but I think the remedy that's being promoted here is a bit too excessive. I would I would support enhanced enforcement by the police back in the way that we used to do it.'",
        "'speaker_7': 'I'm intrigued by the the discussion about the bike lanes, whether it's class four or class two. I'm open to the class four, like bike lanes of, you know, sidewalk bike lanes and and parking stalls. I'm open to that.'",
        "'speaker_7': 'But in terms of like redoing the streets from four streets to streets one way, going this way and one going that way, I'm just not there and honest. I just don't think the data supports it. I don't think it supports that as the remedy.'",
        "'speaker_7': 'It's tragic. You know, what had happened several years ago at Grand Street and Otis Drive in terms of Mr. Sauce. And we certainly want to do everything to prevent that. But by the same token, to me, I think the answer is enforcement.'",
        "'speaker_7': 'I mean, that's what we used to talk about, the three E's enforcement and engineering. And so it's I think what's missing here is the enforcement part.'",
        "'speaker_1': 'Thank you. Councilmember De So who's going next? And I should ask Councilmember Vela. Do you want to go next?'",
        "'speaker_0': 'Sharon. I'm not going to go there.'",
        "'speaker_1': 'Okay. I thought maybe if Theo let you, you could go now.'",
        "'speaker_0': 'Yeah. Um, so I think. And, you know, I think that this is a good start. I think that there are the recommendations that are being put forward. I think I'm going to address a lot of the issues that we have.'",
        "'speaker_0': 'Certainly visibility and things like that are, you know, we need to make those improvements. And I do think that, you know, to Councilmember Point, there may be some additional things that need to come or become a part of this.'",
        "'speaker_0': 'And I wouldn't I just don't want to fold it up. And if there are other suggestions from from other council members or change that as we move forward that we're looking at, it will be added. I would want to make sure that the fact is integrated in a way that doesn't delays that I'm getting implemented in terms'",
        "'speaker_0': 'of the enforcement aspect of it. I think enforcement is important, but I also think that it's not everything you want for me to be enforcement action. Yeah, you can catch people in some days, but you know, that doesn't necessarily overall change the behavior.'",
        "'speaker_0': 'And a lot of what we need to do is just make the road more visible and and multimodal friendly. Because I think what we're trying to do with a lot of the recommendations that are being made by staff.'",
        "'speaker_0': 'So I'm looking forward to supporting them, thinking that I wouldn't put this number of different issues in ways that other thoroughfares don't. Mainly because it is such a provide a fine artery of the artery of travel. And so I think that it's going to be evolving.'",
        "'speaker_0': 'And as you definitely implement things along the way and found that some of the more people in the world but I think the people to learn from that. So I'm I'm prepared to do that.'",
        "'speaker_1': 'Thanks. Councilmember Vela, vice mayor. And that's why I would like to go next.'",
        "'speaker_9': 'Thank you. So I want to thank staff. I know that this has been a long and well engaged process to get us here, and I think it's exciting. I feel the need, I guess, to to address a couple of points that have come out.'",
        "'speaker_9': 'I mean, we already have a really good example of protected class for bikeways that handle a lot of people getting out on the passenger side and kids not getting hit. And that's the first side by Lincoln Middle School.'",
        "'speaker_9': 'Unfortunately, there's no projector tonight, so I can't show some of the video I feel I shot about three months after it opened, but it's quite amazing to watch. Middle school kids probably the least aware children in the entire spectrum of age get out of a car, look to their right, wait for the bicyclists and go, or the'",
        "'speaker_9': 'bicycle slowing down to let the people cross. I will say along Riddler Park, I think the Transportation Commission got it 100% wrong. The statement that they made was, Let's put in class two and if it's a problem, we'll go to Class four.'",
        "'speaker_9': 'And it was because a single speaker raised a concern of kids going to soccer games, getting out of their cars and crossing the bike lane, being a safety problem, thereby putting all the kids on bikes in the lane next to the cars and the busses and everything else that drove drive by that.'",
        "'speaker_9': 'We have a lot of data that suggests that parking protected bike lanes not only are safer, but that they increase biking among populations who are interested in biking but don't feel that they can do so. And it would be my hope that in looking at the two alternatives, we've not heard a reason why not to do a'",
        "'speaker_9': 'Class four along Riddler. We haven't actually heard a reason why we should do Class two along Riddler. I also wanted to just talk about I would like us to consider whether or not we needed to a turn. Lane On Otis we have streets like High Street, like Fern side, like parts of Broadway that carry 2 to 3'",
        "'speaker_9': 'times as much traffic as this section of Otis. And they don't have to wait turn lanes if it's needed in order to create some sort of a median in the middle of the in the middle of the street.'",
        "'speaker_9': 'That's perfectly acceptable. But the amount of traffic on this street does not warrant three, let alone four, four lanes. And so I would like to encourage us to look at how we can use that that space a little bit better, even if it's bigger buffers, etc..'",
        "'speaker_9': 'I would also I don't want to hold this project up, but I would like us to I some staff, some questions ahead of the meeting I would like us to look at. I have the privilege of working with coordination nation leading by.'",
        "'speaker_9': 'Facility designers at my job in San Francisco. And I did talk a little bit with them about this. And I think some of the assumptions that went into whether or not we could do a class for along the length of Otis were not quite right for the facts of Otis and the facts being that we have two'",
        "'speaker_9': 'car garages. These driveways are not driveways like in, in and out or something with high volume. These are these are driveways that are probably used 2 to 3 times a day. The bike way would be one way. We probably don't need to create visible 20 foot visibility zones on either end of the bike of the thing.'",
        "'speaker_9': 'We could probably get away with something closer to ten or 15 on the near side and going down on Otis the other day, I think we would only lose 1 to 2 parking spaces. I know that there's some issues around per block.'",
        "'speaker_9': 'Sorry for block face. Yeah, sorry. I can see the city engineer giving the you're nuts look. So to clarify that, I know that there are some issues around bus design and whatever else, but I think that we have a climate plan that is coming forward that says we need to make mode shift real.'",
        "'speaker_9': 'We have city surveys of our residents that say that something like 75 or 80% want to see better bike facilities in. Less than half of them are concerned about taking lane. So, you know, we know that the the larger voice out there is supportive of this road diet.'",
        "'speaker_9': 'I mean, in fact, a group during the last election ran a weekly ad in the paper saying that my biggest flaw was that I might support road diets on four lane roads and I won. So apparently that's not a not a reason not to vote for people.'",
        "'speaker_9': 'So I would like us to go a little bit bigger. I would like us to I don't want this to slow down, but I definitely do not. I would like us to look at how busy answered the question.'",
        "'speaker_9': 'How could we? What would it take to get a class for along Otis as opposed to the are there problems? And therefore let's put in class two. I would like to look at the I really appreciate the the the neck down at Grand in Otis.'",
        "'speaker_9': 'I think that there are some additional parking protected or sorry, protecting the intersection designs that could be included into the short term design, using posts that go out into the middle of the intersection and actually carrying the bulb about further, that the bikes would come around.'",
        "'speaker_9': 'And I'd be happy to, to, to share some photos of what that would look like, what San Jose and other cities have done. Regard regarding that. I would like to look I would also like to make sure that we look a little bit more at the merge at Willow.'",
        "'speaker_9': 'I am as somebody who when I biked down Central Avenue in the bike lanes and at High Street in the bike lane is to the right. And then we all have to merge into a lane on the other side of High Street.'",
        "'speaker_9': 'It's a very uncomfortable thing to do, and I'd like to see if we can find a way to design where the the second lane that pops up along the curb actually is a shared lane with a bike box at that intersection, so that the folks who are going through the intersection are already merged and not trying to'",
        "'speaker_9': 'merge as they're as you have. Right turn lane. Right turning traffic. I also just wanted to call out the mayor and I had the opportunity to go to the AC TSI all day retreat last week and the county presented its new high injury network of streets, which are the 14% of streets in the county that are responsible'",
        "'speaker_9': 'for 72% of all collisions. And this this street is one of them. So if we're going to address safety, these are the this is this is the right. And I've been asked a lot, why are you doing this street?'",
        "'speaker_9': 'This street is out of the entire county, one of the 14% most dangerous or not most dangerous, but most collision prone streets. So, again, I think that there's been a lot of great work here. I think we have a decent project.'",
        "'speaker_9': 'I just ask I want to ask the question, how could we go a little bit further and what would that look like? We designed this this neighborhood is designed like a lot of suburban neighborhoods that don't even allow street parking.'",
        "'speaker_9': 'If every house has two cars, every house has a two car driveway and you can park four cars off the street without ever needing to park on the street. So I'm not as worried about losing a couple of spots here and there.'",
        "'speaker_9': 'There are some design issues with big gaps and whatever else that will be challenging. I'm not saying it's easy or a slam dunk, but if we could just look at how we could go a little bit further, I think that would be fantastic.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Odie.'",
        "'speaker_4': 'Thank you. All the good points have been taken already.'",
        "'speaker_1': 'Okay.'",
        "'speaker_4': 'No, I will. I do have a few to add. So I mean, I agree with a lot of what the vice mayor said. I mean, road diets, to me, that's not a flaw. To me, that's you know, that's a positive trait and and a positive value and a positive policy we want to make.'",
        "'speaker_4': 'I do agree with a lot of what he said. I think we can do better in some areas. So first of all on the the area I think class for I think. That's what we need to do. You know, what we have to start doing, I think, is shifting our our perspective.'",
        "'speaker_4': 'Now we look at this and this is all about safety, but it's also about encouraging more bicyclists, encouraging safer pedestrian access, encouraging more bus. So this whole multimodal thing, that's what we want people to do. So as if we're going to focus on that, then we can't prioritize parking as something we consider in these designs.'",
        "'speaker_4': 'You know, we have to start prioritizing that because what we want to do is encourage people to drive less and park less and, you know, have fewer cars in the city. So I think that's going forward. I hope we can have a better focus and not think parking, you know, is the the issue that kind of stops'",
        "'speaker_4': 'our progress as far as some of these multi-modal projects are. I do agree with the vice mayor also. I do think we should consider some type of class for all the way down. Otis I don't know why we wouldn't want to do that.'",
        "'speaker_4': 'I look at the West Line Drive and, you know, I'm not an engineer, so I don't really know. But a lot of that looks like paint from like short term to long term. So, you know, if we do it, just having people come into the middle, you know, maybe that's something people could take a look at and'",
        "'speaker_4': 'maybe move more towards that long term. Because I think on the long term, the bike lane stays on the right hand side and doesn't you're not making bicyclists cut across traffic and go into a center lane because if we're going to encourage more people to commute than I imagine most people are going to be turning down the'",
        "'speaker_4': 'West Line and not going into the park like they probably are today. I do agree that the Willow intersection is a little bit messed up, so I'm going to go through there many times a day. But, you know, I'll leave that for the engineers.'",
        "'speaker_4': 'I do like the idea of the traffic circle. I think this is something, you know, I forget where I think it was in Kauai. I saw it last and it you know, they work there all over Europe. They seem to work as an interesting spot.'",
        "'speaker_4': 'For one, I think there are other places in Alameda. There was some blog post this morning about some ideas. And, you know, I think putting traffic circles in is long overdue. And I didn't realize until today when I heard the presentation that the actual long term cost of that is less than maintaining street light or traffic signal'",
        "'speaker_4': '. So I think that's something we need to do more of, especially at some of those those more problematic intersections. There was one other thing I wanted to say, but I kind of lost lost it because I didn't write it down.'",
        "'speaker_4': 'But, you know, I think this is a good a good first step. I do think we can do better. I support moving forward with the the short term fixes, with the with the class for and just as as we look more for for traffic circles, let's just make sure, though, you know, our parade is sacred to Alameda'",
        "'speaker_4': ', so let's just make sure we're not impacting that in any negative way. And the last thing on the safety and we were here a couple of weeks ago with the budget and we heard, you know, we're down, it's 8 to 10 police officers.'",
        "'speaker_4': 'So I don't know if that's a problem that's going to be long, long term or whether we're going to be able to solve that. There are challenges hiring police officers. Our police chief went through a very eloquent presentation talking about it.'",
        "'speaker_4': 'So to put all our eggs in the enforcement basket, you know, I don't know if that's the solution. So let's just keep that in mind, too, as we go forward. You know, eventually we're going to want to have more modes of transportation, like Councilmember Vella said.'",
        "'speaker_4': 'So I'm supportive this excited by it, and I hope that it comes in sooner rather than later.'",
        "'speaker_1': 'Okay. Well, I will do my remarks last. And first, I want to thank staff for all your good work and also the consultant. I was able to attend one of the public workshops and I and I told Mr. Parisi afterward that he really has a gift.'",
        "'speaker_1': 'Not only is he very knowledgeable about his subject matter, he's really good with a crowd and a crowd with tough questions, and he fielded them all well and didn't get ruffled. And and also, I think Sergeant Brian Foster, APD back there in the room, his presence was really useful because he could step in and answer traffic and'",
        "'speaker_1': 'enforcement related questions. So I think I'm going to start with what I consider a big item, which is the Class four projected bike lane along the stretch of Otis Drive in front of Riddler Park. And I support Class four over Class two.'",
        "'speaker_1': 'And here's why. In reading the consultant's memo, which is Exhibit six to the staff report on page three, there's an explanation of something called level of traffic stress alerts. So an Altius one is a roadway by. Physical facility bike lane that's considered suitable for children.'",
        "'speaker_1': 'And at the other end of the spectrum is an LTC for suitable for experienced adult cyclists who are comfortable sharing the road with automobiles traveling at 35 miles per hour or more. So the important thing to know is that under existing conditions, Otis Drive is considered and ELTs for I'm an adult, has been riding a bike most'",
        "'speaker_1': 'of my life and I live near the intersection of Grant and Otis and I purposefully avoid either walking because I've almost been hit too many times in broad daylight by people making that left turn and certainly riding my bike.'",
        "'speaker_1': 'I have other ways to get to South Shore on my bike, but if so, LTC two is what a class two treatment would would give us. And that is considered that represents a level of traffic stress that is comfortable for most adults.'",
        "'speaker_1': 'Well, it might be comfortable for most adults, but it's not good enough for me. I want my city to be as bicycle friendly as possible. And when you think of the location there adjacent to Riddler Park, where as was noted by Miss Potter, lots of sports events take place from Little League to soccer to, you know, school'",
        "'speaker_1': 'functions. We we want people, families with their children to use these bike facilities. So let's give them the safety to do that. Not only will we reduce accidents, we will also reduce the number of people jumping in their cars to get from place to place.'",
        "'speaker_1': 'B It's also Riddler Park is also in the very close vicinity of Wood Middle School, and I spend most of the bike to school days at Wood Middle School, and I know that a lot of students ride their bikes.'",
        "'speaker_1': 'So and they come from I would just drive both ways. So let's make it as safe as possible for them. And as far as the concern about, you know, passengers getting out of a car and stepping across a bike lane, well, you don't walk across the street without looking left and right.'",
        "'speaker_1': 'So I'm I'm hoping that people will, you know, keep their common sense with them when they get out of the car. And it runs both ways. Bicyclists also, we when we're on our bikes, we need to be cognizant of others around us.'",
        "'speaker_1': 'I always say use your best biking manners. Set a good example. Don't you know, give us a bad name as as cyclists. So I'm all for class four. The other concern that I have about this plan is, and I think it was touched on in the staff report, but a question that I would just want answered and'",
        "'speaker_1': 'actually maybe. Mr. WIKSTRM You can do it now if or. Mr. Parisi So the intersection at Otis in West Lyon. So you're going westbound on and Western. When I go to Crab Cove this Saturday, I'll be judging the Sandcastle contest.'",
        "'speaker_1': 'Y'all come out. It's a great event. I will ride down Otis Drive to go into Crab Cove. But the intersection there is really frustrating for a bicyclist. You got to get over and press the button. So is that is that going to be addressed in the in the new treatment?'",
        "'speaker_1': 'I know they're tossing the coin and whoever loses has to come up and answer my question.'",
        "'speaker_11': 'So it is at West Line. Yes, there is no bike lane now through that area. So under the short term solutions, we are showing a bike lane transition into what's called a bike box. So you'd be in front of traffic when light is read and you can elect to go straight across or take a left turn.'",
        "'speaker_11': 'And in the long and that won't require any curb work but a long term solution. We are showing a protected intersection where you can stay to the right and take advantage of a bike signal.'",
        "'speaker_1': 'Okay. But what if you wanted to go straight ahead into Crab.'",
        "'speaker_0': 'Cove.'",
        "'speaker_1': 'Because. Right. Right now, is there there's not a a well there. Yeah, there's not a you you cross over and one leg of the crosswalk on the south south side of Otis is what you use if you try if you want to go straight through in the auto lane, you've got to hope to get behind an automobile'",
        "'speaker_1': 'because there's nothing about my bicycle that will trigger the signal to go to green. So is that going to be addressed?'",
        "'speaker_11': 'Yes. In the short term solutions with the bike box, the detector will sense that you're there and you can go ahead in front of traffic.'",
        "'speaker_1': 'Perfect. Okay. That sounds good. As far as the the modern roundabout. So call that at Grand. And Otis, I, I am told that that's the way to go, that the data shows that it increases safety. So for that reason, I'm for it.'",
        "'speaker_1': 'This morning I did, or this afternoon I emailed both of our public safety chiefs, police and fire and asked, would you have any concerns? Our fire chief just asked that when you get to that point in designing it, that he be consulted to make sure that whatever vehicles need to may need to traverse that roundabout can do'",
        "'speaker_1': 'so safely. And I yes, the vice mayor noted that friends friends I drive is an excellent example of a very successful class for Bike Lane. And as it is right now, it does transition from a class two to a class following back to a class two.'",
        "'speaker_1': 'And it's still a great lane and I'd love to see more class fours, but it works as it is. And I do think that.'",
        "'speaker_0': 'The big.'",
        "'speaker_1': 'Picture we have to keep in mind is that the name of the game now is Complete Streets. That means we're no longer auto centric, we no longer plan for the automobile and everyone else gets the crumbs. We are trying to get people out of their automobiles.'",
        "'speaker_1': 'And so we have to make it safe and feasible for people to use other modes of transportation. And I'm impressed every day when I'm out and about seeing Alameda EMS, getting their children around, hauling their groceries, pulling those carts, doing a lot more than I do, just riding my self around on a bike.'",
        "'speaker_1': 'They they are doing that now and even more will join them if we give them the the safe bicycle facilities to do that. And enforcement, while it's always important and is was noted by Councilmember Ody, the reality is we have a finite number of police officers.'",
        "'speaker_1': 'We try to increase that number. And as we add to that number, others retire. And so we'll rely on enforcement, but not solely. We have to make smart choices with the design of our road. So with all of that, if there's no further comment, I see we should do this is a recommendation to approve the traffic calming'",
        "'speaker_1': 'recommendations. The Vice Mayor seems like he'd like to say something. Both Mayor, I.'",
        "'speaker_9': 'Have a proposed motion.'",
        "'speaker_1': 'I am willing to hear it.'",
        "'speaker_9': 'Okay. So understanding that small tweaks and things like that don't need to be in this.'",
        "'speaker_1': 'I remember it. Small tweak. Yeah, it's about a.'",
        "'speaker_9': 'Meeting that's engineering speak. I would like to move that. We approve the plan and specifically calling out support for a reduction to two lanes of travel, one lane and each way in each direction that we would like to see a class for along Riddler, that we would like staff and the consultant to give class for the full'",
        "'speaker_9': 'length of Otis. Another look.'",
        "'speaker_1': 'May I just interrupt you for a minute? So when you say the full length of is, you are.'",
        "'speaker_0': 'In the.'",
        "'speaker_9': 'Project.'",
        "'speaker_1': 'This project. Okay.'",
        "'speaker_9': 'From Willow to Westlake. Thank you. Yes. And and in terms of the long term, I know you're not looking for it, but support for the roundabout as a long term solution, I think at least the other things I've talked about, I feel are following the tweak category.'",
        "'speaker_1': 'That was the notion. Okay, so we have a motion. Do I have a second?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay. Well, that well, that the new mom is second. Okay. So it's been moved by the vice mayor, seconded by Councilmember Vela. We're going to take a voice vote.'",
        "'speaker_3': 'Has that Councilmember De said?'",
        "'speaker_0': 'Nope.'",
        "'speaker_3': 'Next fight.'",
        "'speaker_9': 'I.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Vela. Yes. Mayor. As the Ashcraft. Yes. That passes for to one motion passes.'",
        "'speaker_1': 'Four, two, one. Thank you, everyone, for all your time and effort. And now before we move into item six C, I'm going to actually. Yeah, I'm sorry.'",
        "'speaker_12': 'I later understand a Yelp incident in your corner. What what was the vote? Because are you saying you want three lanes or are you saying did you all just vote on three lanes or did you all just vote on two lanes?'",
        "'speaker_12': 'I just want to make sure.'",
        "'speaker_9': 'We're down to traveling, distracted, not get into the two way turn lane. We are giving staff the flexibility to look at and make the right engineering decision about how to address giving travel lane in each direction.'",
        "'speaker_1': 'Is that sufficient for you? Okay. That's a that's a yes from city engineer. Okay. All right. So I was trying to say thank you, everyone. And then before we move on to our next item, we're going to take a ten minute break.'",
        "'speaker_1': 'So we will see you back in 10 minutes. It's 833. I'll see you back at 843. Thank you.'",
        "'speaker_0': 'There's a couple of recesses on the team just saying that we haven't had a break.'",
        "'speaker_1': 'Since we went into closed session.'",
        "'speaker_0': '20. Hey. Oh, no, it's okay.'",
        "'speaker_1': 'It is. We like to see our council members sprint. It is 843. True to our word, we are back for item six. See? Madam Clerk, will you introduce this item?'"
    ],
    "Public Hearing to Consider Adoption of Resolution Confirming the Ballot Results to Determine Whether a Majority Protest Exists in the Proceedings to Increase Assessments in Island City Landscape and Lighting District 84-2, Zone 4 (Park Street); and Adoption of Resolution Confirming the Ballot Results and Providing for No Majority Protest and the Levy of an Annual Assessment in Island City Landscape and Lighting District 84-2, Zone 4 (Park Street). (Public Works 275)": [
        "'speaker_3': 'Yes. Public hearing to consider adoption resolution confirming the ballot results to determine whether majority parties exist in the proceedings. To increase assessment in island city landscaping and lighting. District 84 to Zone four, Park Street District a resolution confirming the ballot results and providing for no majority protests and will have even annual assessment in island city landscaping and'",
        "'speaker_3': 'lighting. District 84 attached to Zone four Park Street.'",
        "'speaker_1': 'All right. And if this seems highly scripted, it is. So this is kind of like going through a pageant. We're going to see if we all get our lines right. But we should because they're right in front of us.'",
        "'speaker_1': 'Am I on?'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Mayor, I am the man. This is the time and place fixed for the public hearing related to the modification of and proposed increases to the levy of assessments within the island city. Landscaping and lighting maintenance district number eight for dash to the zone for Park Street to fund ongoing maintenance and servicing of landscaping improvements in the Park'",
        "'speaker_1': 'Street Business District area. I would now ask the City Clerk to report on the notice of this public hearing.'",
        "'speaker_3': 'Notice of the public hearing and distribution of the assessment ballots has been completed in the manner and form as required by law.'",
        "'speaker_1': 'Before proceeding further with the public hearing. I would like to ask the City Clerk to provide both the City Council and the audience with a summary of the proceedings that will take place both during and after the close of this public hearing.'",
        "'speaker_3': 'So the process that will follow for the assessment ballot procedure and tabulation is that after the staff report is provided to the council, the mayor will open the public hearing a step one. Step two will be to take comments from the public.'",
        "'speaker_3': 'Step three request any additional ballots be submitted to the city clerk. Step four, close the public hearing. And step five, audit the tabulation of ballots once the ballots have been tabulated. The city clerk will announce the results of the tabulation.'",
        "'speaker_1': 'I would now ask Liz Acord from the Public Works Department to provide the staff report.'",
        "'speaker_13': 'Good evening, Madam Mayor and members of the City Council. I'm Liz Accord, Public Works Coordinator. As you know, assessments in the Park Street Zone of the city's landscaping lighting district have been flat for over two decades since the mid 1990s.'",
        "'speaker_13': 'These assessments primarily fund enhanced maintenance, including sidewalk cleaning, tree trimming and litter and graffiti removal. As a consequence of the flawed assessments, levels of service have decreased over the years. Beginning in 2013, Public Works has been working with the downtown Alameda Business Association to develop a proposal to increase assessments and thus restore or improve services.'",
        "'speaker_13': 'And this year, a proposal to more than double assessments in the coming year was approved by the Downtown Association Board. And then the City Council took the necessary steps to initiate the ballot proceedings in April of this year.'",
        "'speaker_13': 'As you are well aware of, votes to increase assessments are difficult. No one wants to pay more, especially when assessments have been flat for more than two decades. Yet the Downtown Association Board has endorsed the raise assessments, even though there's always a risk of a failed balloting, as occurred when the zone did its last balloting in 2015'",
        "'speaker_13': '. However, let us now turn our attention to finding out whether this balloting effort was successful or not. And following the public hearing and the tabulation of ballots, I'll be back before you to discuss the outcome. That completes my report, and I'm available for any questions you may have.'",
        "'speaker_1': 'Thank you. Counsel, do we have any questions for Miss Acord, a council member? Vella. Do you have any questions for Mr. Corey? Okay. And I don't see any other indications. All right. And do we have any public speakers?'",
        "'speaker_3': 'We do not have any.'",
        "'speaker_1': 'We do not. Well, going through my script, the city council will hear from any interested person who desires to address the City Council on this matter. So can I safely assume because no one's getting out, that no one is interested?'",
        "'speaker_1': 'All right. Seeing no one else who wishes to be heard or no one who wishes to be heard. Do any members of the city council have any questions for these city staff or consultants now?'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'I would like to remind everyone that all assessment ballots and replacement assessment ballots must be received by the city clerk before this public hearing is closed. Assessment ballots or replacement assessment ballots received after the close of this public hearing will not be tabulated.'",
        "'speaker_1': 'Are there any owners who have not submitted their assessment ballots and need additional time to submit their assessment ballots? Or are there any owners who have submitted their assessment ballots but now wish to submit a replacement assessment ballot?'",
        "'speaker_1': 'I see no motion from the audience. If so, the City Council will take a five minute recess before closing the public hearing to allow for the submission of such assessment ballots. I am going to proceed on the assumption that no, no one is moving, that we do not need to recess for 5 minutes.'",
        "'speaker_1': 'So the public hearing will now be closed. The public hearing is now closed. Assessment ballots and replacement assessment ballots received by the city clerk after this time shall not be tabulated. The city clerk shall now recess. While the city clerk tabulates the assessment ballots and replacement ballots received by the city clerk prior to the close of the'",
        "'speaker_1': 'public hearing. Any interested persons are invited to view the unsealing and tabulation of the ballots in Conference Room 391. So then, Madam Clerk, so you and your.'",
        "'speaker_3': 'Consultant from NBC. Okay. Yeah. Staff will open the ballots. Anybody can watch and will be right in 391. So we have to recess.'",
        "'speaker_0': 'To do this quickly.'",
        "'speaker_1': 'So we're now in recess to for the tabulation of the ballots. And we think that might take about.'",
        "'speaker_3': '10 minutes at.'",
        "'speaker_1': 'The most. 10 minutes or so. Don't go too far.'",
        "'speaker_0': 'Um.'",
        "'speaker_1': 'Well. And the council can watch to correct.'",
        "'speaker_0': 'And if we.'",
        "'speaker_1': 'Why are you sit here?'",
        "'speaker_0': 'We'll be.'",
        "'speaker_5': 'Looking.'",
        "'speaker_0': 'All right. Okay.'",
        "'speaker_1': 'So. So Council is now in recess. I'm going to say about 10 minutes. It's 850. We'll see you at nine or I'll check back in with you at 9:00, let you know.'",
        "'speaker_2': 'Where we are. All right.'",
        "'speaker_1': 'We went in place. Okay. We are going to resume. Madam Clerk.'",
        "'speaker_3': 'Okay. 219 assessment ballots were mailed to the owners of property within the boundaries of the assessment district. And 91 of those assessment ballots were received prior to the close of the public hearing. 48 assessment ballots representing $35,204.86 of assessments were submitted in support of the levy of the proposed assessments within the Assessment District.'",
        "'speaker_3': '42 assessment ballots representing $35,038.79 of assessments were submitted in opposition to the levy of the proposed assessments within the Assessment District. Since a majority protest to the levy of assessment has not been filed. The Council may proceed to impose the amendments, and you can consider the resolution confirming the ballots results and providing for no majority.'",
        "'speaker_3': 'Protest exists in the proceedings to increase assessments and the levy of annual assessment for island city landscaping and lighting. District number 84 to Zone four Park Street.'",
        "'speaker_1': 'So the city clerk has notified the city council that she has completed the tabulation of the assessments ballots. Will the city clerk please report the results of the tabulation? And so what you just did.'",
        "'speaker_3': 'I did well ahead of your part. I'm so sorry.'",
        "'speaker_1': 'That's okay. Okay. Yeah, you're right. So let's go on. Liz Corey, there.'",
        "'speaker_0': 'Is.'",
        "'speaker_13': 'So obviously this is really great news for the zone and it's especially important given the over 20 years of flat assessments and the decrease in service and what this positive result of the balloting means is next fiscal year, an immediate increase in service to better, clean and maintain the district, including sidewalk washing.'",
        "'speaker_13': 'And that ultimately creates an even better park street for residents, visitors and shoppers. The Downtown Association, including Steve Bucy, Donna Labor and Ron Mooney, Rich Creek's Kyle Conner and Janet Mckelvie deserve a ton of credit for tonight's results.'",
        "'speaker_13': 'These folks did a lot of outreach to their members and property owners to make this happen. And so with that, I'd like to invite Donna Leyburn with the Downtown Association up now to share a few words.'",
        "'speaker_1': 'Thank you, Mr. Card.'",
        "'speaker_12': 'Miss Leyburn City Council Mayor. I do a wahoo if that was okay.'",
        "'speaker_0': 'But we all.'",
        "'speaker_12': 'Want to do it. So we're here on behalf of the Downtown Business Association. Our merchant members.'",
        "'speaker_1': 'Speak, rent a microphone. We want to capture this, have them be a little more centered on the microphone there. They want to speak right into the microphone. Oh, closer. Okay.'",
        "'speaker_12': 'Everybody that was involved, we're thrilled that we'll be able to enhance the maintenance of the district. And we'd also like to thank the association's landscaping lighting committee. And you've got the names, but they're all here tonight because we were all we've put in a lot of hours working on this Steve Bussey, Brian Mooney, Rich, Chris Kyle Conner'",
        "'speaker_12': 'and Janet Maccabee diligence and hard work. And I just have to say that the L.A. doesn't just stand for landscaping, lighting. It stands for Liz and Liam, and we just can't thank them enough for being part of this incredible process.'",
        "'speaker_12': 'And we're so glad it's over. Thank you.'",
        "'speaker_1': 'Thank you so much. And so now council, we're not done. We need to adopt a resolution confirming the ballot results to determine whether a majority process exists in the proceedings. Do we need to do that, Madam Clerk?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Okay. To determine whether a majority protest exists in the proceedings to increase assessments in Island City lld8 for Dash two zone for Park Street and adoption, a resolution confirming the ballot results and providing for no majority protest in the levy of an annual assessment in Island City.'",
        "'speaker_1': 'LG eight for dash two zone for Park Street.'",
        "'speaker_4': 'So moved.'",
        "'speaker_1': 'Is there a second? Second. Okay. It has been moved and seconded. A move by Councilmember O'Toole, seconded by Vice Mayor Knox White will not take a voice vote.'",
        "'speaker_3': 'Councilmember De Sang.'",
        "'speaker_7': 'Yes.'",
        "'speaker_3': 'Knox White.'",
        "'speaker_9': 'Yes.'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'Vella. Yes. Mayor as the.'",
        "'speaker_1': 'Ashcraft. Yes.'",
        "'speaker_3': 'That carries by five.'",
        "'speaker_1': 'This and the resolution passes unanimously. Congratulations to all involved. I know a lot of hard work and effort went into that. Well done. Okay, so we now move on to item six, c, d, d I know it says that rent frenemy.'",
        "'speaker_0': 'I'm.'",
        "'speaker_1': '60 man quick.'",
        "'speaker_3': 'Public hearing to consider adoption resolution establishing integrated waste collection ceiling rates and service fees for Alameda County Industries for rate period 18th July 2019 to June 2020.'",
        "'speaker_0': 'Welcome back.'",
        "'speaker_13': 'Good evening, Madam Mayor. Members of the City Council. I'm Liz Acord, public works coordinator. The idea before you right now asks council to set integrated waste rates for the coming fiscal year or rate period. This public hearing is part of the annual rate setting process that is set forth in the city's franchise agreement with Alameda County Industries'"
    ],
    "Public Hearing to Consider Adoption of Resolution Establishing Integrated Waste Collection Ceiling Rates and Service Fees for Alameda County Industries, Inc. for Rate Period 18 (July 2019 to June 2020). (Public Works 0274)": [
        "'speaker_13': 'or ASI. And I'm going to turn it over to Marva Sheehan with H.f. and each to walk you through that process and the results. And at the end of Marv's presentation, Marva Staff Ken, Kenny, Criswell, Busa and the team will be available for any questions that you may have.'",
        "'speaker_1': 'Thank you. Hello there.'",
        "'speaker_2': 'Good evening. At a mayor and council, Marva Sheehan partnered nature consultants. And I've been here for several years now. So every year or just first, we start with RCI, which provides your recycling solid waste and organics collection in the city for your residents, residences, businesses.'",
        "'speaker_2': 'And part of that agreement that is with the city is a rate setting process. And there are two methods that we use the index best method, which is every two years and then every third year is a detailed cost review.'",
        "'speaker_2': 'And this year was the year that we did the detailed cost review and we look at their actual cost and then come up with what we feel that are tied in with the requirements per the agreement and then compare that with estimated revenues and come up with the estimated or with the projected rate adjustment.'",
        "'speaker_2': 'At the conclusion of our report this year and after our work week came, that is a 7.31% increase. After discussions with staff and with RCI, we ended up deciding to use part of the Rate Stabilization Fund, which you had been accumulating each year, as well as funds from their bouncing account, which had our recycling revenues have been'",
        "'speaker_2': 'going into that fund. So this was a time to start using that. And then also in discussions with RCI on adjusting some of the cost in order to get to the number that we ended up with, that it ends up that the rates are going would be going up 4.21%, which is about what CPI had been.'",
        "'speaker_2': 'So it kind of ties in with that as well. With with that, there's a quarterly impact to the 32 gallon rate, which is the majority of your ratepayers of about $5, $20 for the year. So pretty insignificant when you think in terms of the amount of services and what your residents and businesses are receiving here.'",
        "'speaker_2': 'And as far as in comparison with the county, we had a rate survey that was part of your packet and you're still in a really good position again considering the level of service that you are receiving. And with that, I'll answer any questions that you have.'",
        "'speaker_1': 'So Counsel, do we have any questions? Councilmember Odie.'",
        "'speaker_0': 'I.'",
        "'speaker_4': 'Have a couple of. Thank you. So who did the heavy lifting on the negotiation? Do we know what that was?'",
        "'speaker_9': 'Who did you know.'",
        "'speaker_4': 'Who did the heavy lifting on on saving us from 7.3 to 4.3.'",
        "'speaker_5': 'Liam in our office worked with a C.I. on that. On that.'",
        "'speaker_4': 'Okay. So kudos to that person or persons. I just have a question. I'm just a little quick prefix. Preface, preface. Sorry, it's getting late. I'm on the Stop Waste Board and there was some discussion here in the staff report on Operation National Sword, and I know that's putting a lot of pressure on recycling and recycling rates.'",
        "'speaker_4': 'And I think there's some new regulation that came down, you know, from the state. Can we can somebody just talk a little bit about.'",
        "'speaker_2': 'Sure, I'll talk a bit on the recycling, then I'll let Kent talk, give you a little more from the company's perspective. Our our firm has been working with a lot different agencies dealing with National Sword and.'",
        "'speaker_1': 'Just audience members who may be listening. Do you want to explain that?'",
        "'speaker_4': 'That's kind of what I was hoping that we can.'",
        "'speaker_2': 'You know, because absolutely, you know, those of.'",
        "'speaker_4': 'Us in Stop Waste hear it. And by the way, Maria's here, she stuffs that with me and very excellent. So I just give a quick shout out to Maria.'",
        "'speaker_2': 'Great. So China back really at the end of 2017 put out basically that they were going to restrict the the types of materials that were they were going to be taking in part of China's efforts on clean air environment issues.'",
        "'speaker_2': 'So they implemented what we called National Sword. That's kind of the U.S. term for it. That went into effect March of 2018. That limited the types of materials they take. The probably more importantly is they set a standard for contamination and that it goes down to the point 5%, which is very, very small as far as contamination'",
        "'speaker_2': 'levels. Most I'm not sure there's a Merv that can really meet that level. So what happened is, as a result, material didn't go to China and therefore they had to find alternative markets. Last year when we were here, we were just right.'",
        "'speaker_2': 'Really in the early brinks of it, there was concerns about even finding places for the materials to go. And there was a thought of if people were going to have to landfill, what was going to happen to especially this is all predominately mixed paper and also in mixed paper.'",
        "'speaker_2': 'It only has a certain shelf life before it starts disintegrating. So there was lots of issues last spring and summer. Through that time they've kind of worked through, for the most part, materials. Being able to be moved is just that.'",
        "'speaker_2': 'The price where at one point they were getting over $100 a ton for it is now and I think can you can talk to it it's break even or having to pay a month ago I think they were paying $11 or so attempting to move it.'",
        "'speaker_2': 'It's going now to places like Pakistan and Vietnam and other sources, but they weren't set up for the amount of material to get there. And then part of the issue was, well, which was one that I hadn't thought of.'",
        "'speaker_2': 'There was we have a lot of ships coming this way from China with material. And so back hauling to China, getting load that way was fairly easy going to these other countries. We didn't have the same level of ship.'",
        "'speaker_2': 'So there was you might have a purchase order to get there, but you didn't you couldn't get containers in or ship to be able to get it there. So there was a lot that's been going on with that.'",
        "'speaker_2': 'But the biggest thing is the fact that the pricing on paper and cardboard has dropped dramatically. And so the and for you, your commodity revenue share went into this balancing account. So it hasn't impacted the rates as much at this point.'",
        "'speaker_2': 'But for a lot of agencies where they netted the revenues against the cost to process, it's coming back quite a bit. You want to give the companies perspective, okay.'",
        "'speaker_4': 'What's important? Let people know this because we're recycling more and more. And I think we should understand that, you know, there's some pressures, but we still want to keep doing it.'",
        "'speaker_10': 'Mayor Council My name is Ken Kenny. I'm the controller with HCI. The recycling market's really I'd sum up as spot market prices are very, very depressed. It's going to take a long time for them to recover. Again, as Marva said, the markets are shifting dramatically and it's just not the same as when China was taking the material'",
        "'speaker_10': '. You know, again, $150 a ton for makes paper.'",
        "'speaker_11': 'Which was the.'",
        "'speaker_10': 'Bulk of the recycling that was being moved. Now we're at times paying to to move the material. The good news is we are moving material. We've not had to landfill anything. And we believe. We will continue to move material and it will just take a long time for the markets to mature and get back.'",
        "'speaker_10': 'The contamination issues mean we have to do more work to clean up the quality, to make the material marketable. And with that, that's really what it is, a spot market day to day, and it's going to take a long time to recover from that thing.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_10': 'Thanks. Okay.'",
        "'speaker_1': 'Counsel, ready? Any further questions?'",
        "'speaker_4': 'I mean, is there any, you know, any long term policy implications of all of this that we need to consider as we go forward in our in our contracts? And I remember Oakland just, you know, sent out a bit maybe two or three years ago and there was a big sticker shock.'",
        "'speaker_4': 'Right. So I mean.'",
        "'speaker_2': 'Well, I think, you know, new contracts, what we're seeing now were for there were years ago contracts you got there's kind of a net revenue back to the city in a revenue share. It might be 20 or $25 a ton would come back to the city.'",
        "'speaker_2': 'That's obviously is gone. And then the contracts kind of went to a net zero where it said, okay, holla processor, you better risk reward, it's all yours. Now really what we're seeing is establishing a processing fee and looking at the revenue kind of separate and having kind of parameters and ways of how you're calculating at which you'",
        "'speaker_2': 'got your contract is kind of like that. You have a processing fee and you have a revenue share, so you're really kind of set ahead of the game from a lot of contracts. But that's really I think the key is, if I could stress anything to the residents is, you know, clean, keeping your materials clean that you'll'",
        "'speaker_2': 'get those those containers that clean and dry and then not keeping garbage out of the recycling is probably the best message that we could send in order to, because no matter what, the material's going to be clean.'",
        "'speaker_1': 'Thank you. Good advice. Okay. Councilmember Daisuke.'",
        "'speaker_7': 'Hi. Thank you for the report. By the way, I always like reading it. It's so very detailed and transparent, the way in which information is packaged and conveyed. The question that I have tonight is several days ago we council received an email about a resident concerned about theft of from blue bins, the recycling bins.'",
        "'speaker_7': 'So the question I have is, has RCI or the city quantified the amount of dollars we lose when recyclables are taken out of the blue bins by what I shall call street recycling entrepreneurs? So do we cause for?'",
        "'speaker_7': 'With regard to the impacts of changes in policy by the People's Republic of China, you seem to have quantified that impact on a something on the order of $25 a ton resulting from from China's change in policy. But when it comes to theft the is from from the blue bins do we know.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_2': 'I'll have to defer to ECI and staff on that. I know from my background it's a very difficult number to capture because it's kind of you don't know what you don't know, but I'll defer to them.'",
        "'speaker_7': 'Okay.'",
        "'speaker_10': 'Good evening, Madam Mayor. Members of the Council. Chris Melville, General Manager of ECI. Councilmember Desai. Specifically, we haven't done our quantitative analysis to understand the specific amount of revenue loss from these items, but they're typically the more valuable items the petty, the aluminum things that can be turned into the redemption centers for money.'",
        "'speaker_10': 'So it is a direct offset in revenue. That would be interesting to understand what the impact is on rates.'",
        "'speaker_7': 'Thank you. I just wanted to make sure to ask that question.'",
        "'speaker_10': 'Okay. I would like to also circle back real quick to Councilmember Ortiz question about contract elements that could have an impact on long term recycling costs and so forth. And one of the things to keep in mind right now is that recycling capacity is quite a valuable element, and you have three years or so left on this'",
        "'speaker_10': 'franchise agreement. And so as communities contemplate what's happening long term, it's important to consider if you want to have discussions about ramping up recycling capacity on a longer basis of something could be done now. It could impact or could have the effect of a rate smoothing effect.'",
        "'speaker_10': 'So you're not seeing these large jumps in future years.'",
        "'speaker_1': 'Thank you. Any further questions.'",
        "'speaker_0': 'For the controller? Yeah. I'm sorry.'",
        "'speaker_1': 'Jim. Mr. Judy.'",
        "'speaker_4': 'Sorry. I'm sorry. That's okay. I think there were I also had a question about I think there were two bills that passed in Sacramento. I mean, just so the public is informed on what those are. Maybe you could just touch on those briefly, the impact.'",
        "'speaker_10': 'Sure. There are actually several, maybe 32, maybe 341. The most recent coming into full effect right now is HB 1383, which passed. It's actually a climate pollutant bill of greenhouse gas reductions, but has a significant element on, um, composting and food scraps.'",
        "'speaker_10': 'Recycling and things like that, has a tremendous amount of regulation attached to it that will have cost impacts associated with service. But again, we're happy to talk to the city and work through those things to lessen those impacts as much as possible.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Okay. Thank you. Do we have any public comment?'",
        "'speaker_0': 'We do not have any speakers.'",
        "'speaker_1': 'Okay. Any further discussion?'",
        "'speaker_7': 'One more question.'",
        "'speaker_1': 'Councilmember de Desai.'",
        "'speaker_7': 'In the HFA report on page 14, at the very top there is a discussion there about profits and it reads as follows We found that ECI correctly calculated the allowable profit by applying a 90% operating ratio, i.e. approximately a 10% profit to its allowable operating cost.'",
        "'speaker_7': 'However, due to the calculated adjustments described above, we recommend an $88,800 decrease to Acres profit. So was that recommendation is that built into the the the the profit? I mean, the rate changes that we're contemplating?'",
        "'speaker_2': 'Absolutely. Okay. It's all it's basically a mathematical the first part, because we take their operating costs and calculate the profit, because we reduce their costs, that associated profit gets subtracted as well. So it ends up netting out. Yes.'",
        "'speaker_2': 'Okay.'",
        "'speaker_7': 'So it's okay. I was just responding to the word recommend. So I was wondering if it was not only recommended, but.'",
        "'speaker_2': 'It's included in the in the recommended way to just.'",
        "'speaker_0': 'Make you question.'",
        "'speaker_1': 'Any further counsel comments or questions. Okay. So what we're looking for is an adoption of a resolution establishing integrated waste collection ceiling rates and service fees for Alameda County Industries for period 18, which is July 2019 to June 2020.'",
        "'speaker_1': 'Do I have a motion to adopt this resolution?'",
        "'speaker_9': 'So moved.'",
        "'speaker_1': 'I have a motion to have a second. It's been moved by Vice Mayor Knox. Right. Seconded by Councilmember de Sung. May we have a voice vote, please?'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'Councilman DeSantis? Yes. Knox White.'",
        "'speaker_0': 'Yes. Yes. Yes.'",
        "'speaker_3': 'Mayor.'",
        "'speaker_1': 'As Ashcraft. Yes.'",
        "'speaker_3': 'Okay.'",
        "'speaker_1': 'That carries the motion passes unanimously. The resolution is adopted. Thank you, everyone. All right. Moving on down the agenda. We are on agenda item six e.'"
    ],
    "Public Hearing to Consider Adoption of Resolution Approving the Engineer's Report, Confirming Diagram and Assessment, and Ordering the Levy of Assessments, Island City Landscaping and Lighting District 84-2, All Zones (Various Locations throughout the City). (Public Works 275)": [
        "'speaker_3': 'Public hearing to consider adoption of resolution approving the engineer's report, confirming diagraming assessment and awarding the levee of assessments. Island city landscaping and lighting district 84 attached to all zones, various locations throughout the city.'",
        "'speaker_13': 'There's one more after this, so just bear with me. Good evening, Mr. Mayor. Members of the city council. I'm Liz Acord, public works coordinator.'",
        "'speaker_1': 'And if I could just interrupt you briefly. Do we have any public speakers on this item?'",
        "'speaker_0': 'We do not.'",
        "'speaker_1': 'Council. Do you have any questions or comments for Ms.. Accord?'",
        "'speaker_9': 'Great report.'",
        "'speaker_1': 'Great report. Did you want to say that to the microphone?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Tony. Okay. I'm sorry to. Why don't we start with that?'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'With the question, if I may.'",
        "'speaker_7': 'I believe that one of the items is in close proximity to my residence, so I'll recuse myself.'",
        "'speaker_1': 'From this one. Okay. That wasn't really a question, was it?'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'So do any other council members have any questions or comments is valid?'",
        "'speaker_0': 'Can I get that question?'",
        "'speaker_1': 'Okay. So. Would anyone like to entertain. A motion to adopt the resolution approving engineer's report, confirming diagram and assessment and ordering the levy of assessments. Island city landscaping and lighting. District 84 dash to all zones approved. I have a motion second.'",
        "'speaker_1': 'I have a second. Moved by Councilmember Vela, seconded by Councilmember Ody. All in favor with a voice vote.'",
        "'speaker_0': 'I say I Odie. Yes.'",
        "'speaker_3': 'I Mayor as Ashcraft.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'And that carries by four eyes with Councilmember Dave, I guess.'",
        "'speaker_1': 'Okay. So that resolution is approved on a unanimous excuse me of.'",
        "'speaker_0': '44.'",
        "'speaker_1': 'Vote approval. And then we move on to item six f.'",
        "'speaker_0': 'The.'"
    ],
    "Public Hearing to Consider Adoption of Resolution Approving the Engineer's Report, Confirming Diagram and Assessment, and Ordering the Levy of Assessments, Maintenance Assessment District 01-1 (Marina Cove). (Public Works 276)": [
        "'speaker_3': 'Public hearing to consider adoption resolution approving the engineer's report confirming diagramed assessment or levy of assessment maintenance assessment district a1-1 marina cove.'",
        "'speaker_1': 'So I'm going to ask the same question of the council. Does anyone have an and I take it no public comment because I don't see the public out there to comment. Do the councilmembers have any questions or comments for Miss Acord?'",
        "'speaker_1': 'Another great report.'",
        "'speaker_0': 'Or.'",
        "'speaker_9': 'Another great report.'",
        "'speaker_10': 'Move approval.'",
        "'speaker_1': 'Okay. I have a motion to approve adopting a resolution approving the engineers report, confirming diagram and assessment and ordering levy of assessment maintenance district 01-1 marina co to have a second second. It's been moved and seconded and maybe have a voice vote, please.'",
        "'speaker_3': 'Council member Dave said yes. Not quite.'",
        "'speaker_0': 'Yes. Yes. Vella.'",
        "'speaker_3': 'Yes. Mayor, as the Ashcroft.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'That also carries my five.'",
        "'speaker_1': 'Great work honor roll, Ms..'",
        "'speaker_0': 'Acree.'",
        "'speaker_1': 'Okay. So with that, we move to item seven City Manager Communications, Mr. Leavitt.'"
    ],
    "Consideration of Mayors Nominations for Appointment to the Civil Service Board, Housing Authority Board of Commissioners, Library Board, Public Utilities Board and Social Service Human Relations Board.": [
        "'speaker_1': 'Nolan, who is the current incumbent but eligible to serve another term for the library board. And there are two seats open and I am at the request of our library director, Jane Sasaki, and I think I explained the reasons last time she would like the incumbents are reappointed because they're in the middle of doing their strategic master'",
        "'speaker_1': 'plan and have her well versed in it. So it's not the time to change horses in the middle of the stream. And so those two incumbents are Kathleen Kearney and Joyce McClanahan on the Social Service Human Relations Board.'",
        "'speaker_1': 'There are four seats. I've made nominations now. I'm about to announce nominations for three of those seats we're still interviewing. So when I come back, next time, I'll I'll have that last name. But for two full, these are both full four year terms.'",
        "'speaker_1': 'I am appointing Sarah Lewis and also Joanna Payette Gravel and then for the three year term that's available, Mustafa Ali and these are all remarkably talented folks. And I will just say that Mustafa Ali is a native of Alexandria, Egypt.'",
        "'speaker_1': 'He is extremely talented and just ready to go on this board. Joanna Payette Growl is amazing. She's a social worker who works with very at risk teens and she's trilingual has worked in other countries. Sarah Lewis I read her bio and saw that she graduated from college the same year as my 27 year old.'",
        "'speaker_1': 'But she has a very impressive background, has done a lot and is just so excited to be here in Alameda and bringing her talent that you can read her application of resume and bring her talent to this board and.'",
        "'speaker_1': 'That's all, isn't it? Yeah. Yes. So those are those are my nominations. Okay. And then our last order of business then is to adjourn. And tonight I'm asking that we adjourn our meeting in memory of the 12 victims of yet another senseless shooting at the Virginia Beach Municipal Building last week.'",
        "'speaker_1': 'And if you've driven around town, you see that the flags are at half mast. I see the flags are at half mast and our hearts are heavy to remember the victims of, again, another senseless tragedy. So if we could please rise for a moment of silence and then we will be adjourned.'",
        "'speaker_1': 'Thank you, everyone. This meeting is now adjourned. Thank you very much.'",
        "'speaker_0': 'Yeah. The you. We have to.'",
        "'speaker_3': 'Call in to her.'",
        "'speaker_0': 'By the way, by.'",
        "'speaker_1': 'The night of Goodnight.'",
        "'speaker_0': 'Moon. Maybe I'll get to that. Have a good evening. We're going to have a lot.'"
    ]
}