{
    "Recommendation to Award a Contract for the Publication of Legal Notices to the Alameda Journal for Fiscal Year 2018-19. (City Clerk 2210)": [
        "'speaker_0': 'Motion carries unanimously. Thank you. Now five s.'",
        "'speaker_1': 'Recommendation to award contract for the publication of legal notices to the Alameda Journal for Fiscal Year 2018 19. And I don't know if you want a brief report or if you want to hear from the speaker first. I did like a brief.'",
        "'speaker_0': 'Short, brief report and then your speaker.'",
        "'speaker_1': 'Right. So every year the charter requires that the council award a contract annually for the publication of legal notices. This past year was the first year we did it with the Sun, and we've had two bidders, again, both the Sun and the Journal.'",
        "'speaker_1': 'And the costs for the sun are higher again. And the costs didn't show up through the last fiscal year to be higher as we anticipated by choosing them. And so I my recommendation is to go with the journal.'",
        "'speaker_1': 'There have also been a few instances of issues with publication from the Sun and in notes. It's not making it any more than they said it would. And so I understand the representative from the Sun is here to address that, if there's any questions on that, too.'",
        "'speaker_1': 'And both submitted letters.'",
        "'speaker_0': 'All right, so then I'll go ahead of the public speaker. So I don't know. I have once that. Julie I'm going to guess but log us l ogi with the alameda journal.'",
        "'speaker_4': 'Good evening, City Council Mayor. Thank you for meeting with me tonight.'",
        "'speaker_5': 'You want to be a little closer to the microphone?'",
        "'speaker_4': 'I'm sure. I just wanted to thank you very much for the opportunity to bet on the legal business. I've enjoyed working with the city of Alameda for a long time and hope to continue to do that. I do have a letter that I included in your packet.'",
        "'speaker_2': 'In.'",
        "'speaker_4': 'Response to a letter that was.'",
        "'speaker_2': 'Written by the publisher.'",
        "'speaker_4': 'Of The Sun. So I don't feel the need to have to read it or or say it, but I just wanted to make myself available tonight. If you had questions.'",
        "'speaker_2': 'Or concerns that I can answer them for you.'",
        "'speaker_4': 'And again, just wanted to say thank you for your consideration.'",
        "'speaker_2': 'Thank you. Thank you.'",
        "'speaker_0': 'Council. He's a member of Parliament. So it's my understanding there's a recommendation by staff to use the Journal this year. Okay, Castle. I'm happy. Go ahead.'",
        "'speaker_7': 'I'll make a statement. Way. I think we live in a time where factual reporting is really important. And perhaps I'm a little sensitive to this because reporters from the Bay Area News Group not only Ms. quoted me, but they actually never even reached out for comment and then publish saying that they had.'",
        "'speaker_7': 'To their credit, one of them did reach out, and eventually the other one did. But I find it a bit ironic that we would contract for legal advertising with a paper that at best engages in sloppy or UN researched or unverified reporting.'",
        "'speaker_7': 'I also find it interesting. I'm happy that the editor lives here in Alameda. It would also be nice if you're going to have an editorial board that your editor who lives in Alameda might sit on that board rather than just having a single reporter who doesn't live in the city of Alameda.'",
        "'speaker_7': 'You know. For those reasons. I have a problem with spending public dollars with the Bay Area newsgroup. But I would also say that it's a bit disconcerting that we only had to to people put in bids. I do know that there's other newspapers that do circulate, but I also know that the Sun has been doing this for'",
        "'speaker_7': 'us or has put in bids for this as well. And they're another local paper. They're headquartered here. A number of their employees work here more than just the editor. So it's something I would consider.'",
        "'speaker_0': 'And Brody.'",
        "'speaker_2': 'I mean, I will echo my colleague's comments. I mean, the the staff report says the Alameda Journal is the lowest responsible bidder. I don't think there's anything responsible at all about the Bay Area News Group. I mean, if you consider, you know, what they published last fall and the fact that they published an editorial and then share'",
        "'speaker_2': 'that editorial as news and that they did just like the vice mayor said, it happened to me, too. They posted an article that said, I declined to comment and I wasn't even contacted. Until like seven or 8 hours later.'",
        "'speaker_2': 'And to me, that's not responsible. And I also know that last time we did this, when we evaluated what we considered the best bid, we considered other factors like the son's place in our community, the fact that they are a community newspaper, that their own their operated here in Alameda, that a lot of their employees work here'",
        "'speaker_2': 'and they have a long history here. And, you know, I would much rather have our public money go to what I consider a real responsible newspaper and not an irresponsible newspaper.'",
        "'speaker_0': 'Member matter.'",
        "'speaker_6': 'I'd like to make a motion to award the bid to the Alameda Sun, because as part of the my definition of the best, it is the locally operated and locally established institution rather than a large media network.'",
        "'speaker_5': 'Second discussion.'",
        "'speaker_0': 'Any other comments?'",
        "'speaker_5': 'Member Ashcraft If I could just hear from the the city clerk about you mentioned, I believe there were a couple of instances when, when something went to the sender for publication but didn't get in. Can you tell us a little bit more about that?'",
        "'speaker_1': 'There have been some publication errors and most recently the example was an HB notice that they said would go in the paper. They printed.'",
        "'speaker_5': 'Ten HB it would be.'",
        "'speaker_1': 'The Historical Advisory Board notice. Is it a printing? That one they printed the council one twice in error. So just the little system issues that they're working out. And I've been told by their staff that it's a staffing issue and they're redoing staffing and that they're going to, you know, get it nailed down.'",
        "'speaker_1': 'So they have said that, but they are here if you want them to be responsive.'",
        "'speaker_5': 'And that a mayor I know we have a motion in a second, but I do see a mr. Aronofsky from the Sun. Would you permit him to speak?'",
        "'speaker_0': 'Did you want to respond at all like that?'",
        "'speaker_5': 'I assume that was why he.'",
        "'speaker_0': 'Might identify yourself and then.'",
        "'speaker_6': 'I full and out of my pocket there. And for the record, Dennis, I would ask him, I purposely allowed me to sign with Eric cos and I do want to apologize for the mistakes we made first of all.'",
        "'speaker_6': 'And, but I do want to point out we did 132 ads. And by our calculation, there were three mistakes out of 132 ads. So I'm not saying we're perfect and I'm saying we're going to be perfect in the future.'",
        "'speaker_6': 'But when the ads when all the city ads come before us, from now on, there's going to be a we have to we have to set a buy rule. Two sets of eyes goes on. Everything. As the publisher I know have instituted a three set of rules for the city ad.'",
        "'speaker_6': 'So what I'm saying is I will I will either have someone on my staff read the ad, double check the ad for the third time, or I will do it myself. So I promise I can't promise a mistake for a year, but I can certainly promise a little more care in place in your ads.'",
        "'speaker_6': 'Thank you. Thank you.'",
        "'speaker_5': 'And then to the secret. Can you tell us the difference in the two price bids?'",
        "'speaker_1': 'Sure. Basically, there's the sun's is almost.'",
        "'speaker_5': 'And and dollar wise, what is that come out to.'",
        "'speaker_1': 'Yeah. It worked out this year to be about. Well, the, the main focus that we usually focus on general fund money, but the main focus was there was like $40,000. Whereas in the past it. Over.'",
        "'speaker_7': 'Oh.'",
        "'speaker_5': 'Okay. So. And then just to finish my comments, I am willing to go along with the majority to give the local paper. A chance to rectify after the first year of doing the the work for us, the legal publications.'"
    ],
    "Adoption of Resolutions: (1) Approving and Adopting the City of Alameda Operating and Capital Budget Mid-Cycle Update for Fiscal Year (FY) 2018-19; (2) Approving and Adopting the Successor Agency to the Community Improvement Commission (SACIC) Budget for FY 2018-19; and (3) Approving Workforce Changes in the Community Development Department, Base Reuse and Transportation Planning Department, Fire Department and Information Technology Department, (4) Amending the City of Alameda City Employees Association (ACEA) Salary Schedule and the Salary Schedule of the Executive Management (EXME) Compensation Plan. (Finance 2410)": [
        "'speaker_1': 'Its adoption resolution resolutions approving it adopting the city of Alameda Operating and Capital Mid-Cycle update for fiscal year 2018 19 and the successor agency to the Community Improvement Commission budget approving workforce changes and community development based for use in transportation, planning, fire and information technology and amending the Alameda City Employees Association.'",
        "'speaker_1': 'Salary Schedule and the Salary Schedule of Executive Management Compensation.'",
        "'speaker_4': 'Thank you, Madam Chair. I'm going to I'm going to start, if you don't mind. Yes. So tonight we have before you the second year of our two year budget. As you know, we adopt a two year budget, and this is the second year of that.'",
        "'speaker_4': 'And if you noticed in your packet we took this year, since this is the second year, we took the opportunity to refresh our budget document. And I'm going to show it to folks at home on the dias and at home.'",
        "'speaker_4': 'This is not the typical doorstop that we normally produce. This is actually a storybook about our budget. It has a lot of good information in it, and I really encourage folks to take a look at it. It's not.'",
        "'speaker_4': 'It's actually pretty interesting. I mean, as interesting as a budget can be. But it's it's good.'",
        "'speaker_0': 'That's our acting city manager, Liz Warmer. Dan telling us that this is an interesting document.'",
        "'speaker_4': 'It really is. It's as good as our city in the past. I know that. It just it's it's a graphic presentation, really, of our budget. And it really does a good job of explaining where all of our money goes, where our challenges are.'",
        "'speaker_4': 'Some of our programs, things that are that we're going to be looking at into the next year. So it's really a great document. I encourage everybody to take a look. And thank you to our our finance staff. And you all met Susan Mayor, who helped us put it together.'",
        "'speaker_4': 'So the other thing, I just I just want to give you a quick overview. This is a refresher for the council, but maybe for the first time for people in the public. This budget document essentially tells us how we're going to end the fiscal year.'",
        "'speaker_4': 'So fiscal year 1718, which is what we're in right now, it'll end June 30 and we're actually in fairly decent shape in this fiscal year. We'll end with 4.5 million above what our it's actually a surplus and that's primarily as a result of our transfer tax and our property tax and transfer tax for those of you who'",
        "'speaker_4': 'don't know is when a property sells, we get a portion of those sales. That's one time we're in a very strong economic cycle. And so our transfer tax is doing very well as a result this year. We're actually looking pretty good.'",
        "'speaker_4': 'Next year into 1819. We anticipated we actually anticipated when we did this to your budget that we would be in a deficit position of 2.8 million. And as it turns out, we're looking at actually having a balanced budget in fiscal year 1819.'",
        "'speaker_4': 'So that's a that's a and that also includes the few asks that the department had over this past year. So we're in good shape for 1819. In the out years as council is aware, we do have deficits starting with about a half a million in fiscal year 1920 and and it'll go out into five years, roughly around'",
        "'speaker_4': 'four and a half million dollars in a deficit. But as you know, and as council hopefully will recall, we always are working to eliminate deficits. We have conservative spending, we pay down our unfunded liabilities. And we're continuing to look at ways to increase revenue, including cost recovery.'",
        "'speaker_4': 'And later at the next council meeting, we'll be talking to you about the revenue potential revenue measure for sales tax on July 10th. So all of this is essentially with an eye of keeping us healthy and ensuring that we have our reserve of essentially a adopted policy of 25%.'",
        "'speaker_4': 'So that's kind of the overview. I just wanted to provide sort of the backdrop, and then I'm going to hand it over to Miss Adair.'",
        "'speaker_8': 'Good evening, Madumere. Members of the council, Elaina Dare finance director and I actually do want a second acting city manager about the this particular document. It was a big undertaking and a huge thank you to the entire finance team, and especially Edwin Gotto and Susan Mayer, who is a consultant that assisted with moving this document forward and'",
        "'speaker_8': 'making sure it gets done. So they were all able to do it while I was gone, and I am very grateful for that.'",
        "'speaker_3': 'Okay.'",
        "'speaker_8': 'There's a few items that we're going to go through, a lot of the slides you will find familiar, and we went through them in great detail during the May 18th workshop. So unless you have specific questions, we're probably going to go through them fairly quickly.'",
        "'speaker_8': 'We one of the things we will discuss is talk a little bit about overall citywide budget and expenditures. We'll talk a little bit about general fund and some other funds. We'll look at the five year forecast and of course, the next steps.'",
        "'speaker_8': 'So this particular graph represents operating budget for the city. And as you will see, the top departments, the largest departments are police, fire and public works. As I mentioned, this is operating budget. This does not include capital. Capital usually fluctuates.'",
        "'speaker_8': 'But for your knowledge, this year's 1819 new money budgeted was about $31 million for the capital projects. In terms of general fund and what's the current status? As I mentioned, we're kind of went through the details of this at May 19th meeting.'",
        "'speaker_8': 'There were a couple of items that were added since then that had to be addressed. There were some adjustments, various adjustments to revenues such as our first responder advanced life support revenues. We do know now that 1718 revenue will be will be recognized this year.'",
        "'speaker_8': 'So we did adjust that and that was about $200,000. The other large item was we did include, as we mentioned to you, the employment settlement agreement. So those items are now included and are reflected in the numbers that you will see on the next page, on the next slide.'",
        "'speaker_8': 'So this is the representation. This is what, as of right now, we believe how we will end the current fiscal year for just a visual. We did break it down between baseline revenues and expenditures as well as took out some of the large one time items.'",
        "'speaker_8': 'In this particular case, it was the transfer tax and then of course the pension and OPEB reserves or the payments that we've made that were more on a one time basis. Even though we have a policy, we don't necessarily make the same payment every year and therefore they are taken out in the separate line.'",
        "'speaker_8': 'So if we just look at the baseline operations with a couple of the items included that I just mentioned earlier, we expect we will be about $100,000. Our revenues a little shorter than our expenditures. Again, if you take out particularly that one time payment or expenditure, we would have been in a positive, but with that particular item'",
        "'speaker_8': 'with threw us into a deficit for the year. With the taxes, however, with the large tax that we have, it would have put us in a positive. And the large tax was from three particular parcels that happened that amounted to $4.6 million.'",
        "'speaker_8': 'Again, transfer tax is a volatile revenue source and was really dependent on real estate sales. So it's really difficult to say, well, what does it really mean? Unless you really compare it to something and say, well, is it better or is it worse?'",
        "'speaker_8': 'And so as a comparative. Five years ago in May, this particular slide was presented to then city council members and the picture was that we May and 1718 with $8.3 million deficit. So what does that really mean? In our case, if we do nothing, just like it says on the slide.'",
        "'speaker_8': 'This is where we may have ended up, but we don't do nothing. We address whether expenditures or revenues, and we have to have a balanced budget and we try to bring it and work on it every year to bring the balanced budget to council for approval.'",
        "'speaker_8': 'So that's what we are doing now. So this is as a comparative.'",
        "'speaker_0': 'Okay. I'm sorry. Before you move on. The increase in the transfer taxes, how much of an impact or what do you think? How much of an impact did they have on these numbers?'",
        "'speaker_8': 'I just want to make sure I understand you're asking for an increase between back then.'",
        "'speaker_0': 'Versus difference of. But right you have. We thought that the forecasts have been a bigger deficit numbers than what we currently have. And some of that is, I think, attributed to the increase the moneys that we received from these transfer taxes, sales of buildings.'",
        "'speaker_0': 'Right, other more revenue and things like that than we had been able to forecast.'",
        "'speaker_8': 'Correct. So the revenues in general are higher. If you see in here, if you just look at the baseline, excluding large one time items, currently overall revenues would have been at $95 million. If you actually look what we thought we might have back five years ago, we thought we're going to have about $78 million.'",
        "'speaker_8': 'So overall, taxes went up. Largely, it's probably attributed to a property tax because back then that's when the recession hit. So it's more likely that the property taxes actually went up significantly higher, plus the new development that happened within the city, which brings it up higher with the new homes that were put on the market.'",
        "'speaker_8': 'And that's part of it. Of course, transfer tax is one of them because as it grows with the assessed value, your transfer tax grows as well. Unfortunately, I don't have right now numbers to say specifically which tax went up and how much between what was and now.'",
        "'speaker_8': 'But overall, you can tell the difference is almost $20 million swing.'",
        "'speaker_0': 'So I just so I want to point that out, though, because. Right. So you're looking at growth in property taxes, that because of the increase in equity, I mean, not equity, but the cost, right? The home home values increase in phrase values and sale values, which we cannot necessarily assume will continue at that level.'",
        "'speaker_0': 'So we've been able to bring in additional moneys because of that. Right. That may not many people think we can't continue to have that same trend. So so I want to just drill down a little bit on that.'",
        "'speaker_0': 'So the audience is aware of why, you know, the biggest contributor of us having been in such good shape financially right now compared to where we thought we were going to be. Thank you.'",
        "'speaker_8': 'So now that we looked at 17, 18 and did the comparison, let's look at the 1819 and we'll start with our revenues. As we just talked, property taxes are the biggest component of the revenues within general funds, over 30%.'",
        "'speaker_8': 'Then the next one follows in 1718, particular because of some of the one time receipts that we had, it was a number two source. As you can see in 1819, we increased it even though we don't expect certain wants to come in again that high, it's fluctuates between second and the third revenue source in the city and'",
        "'speaker_8': 'it's usually competes with the sales tax. Now one of the things that we have done is with sales tax. We consult with Diehl and their consultant and they helped us project where we may think we may end up with the sales tax and their projections showing that we should be remaining flat going forward in like the next'",
        "'speaker_8': 'five year period. Those are the largest top three largest revenue sources. There's one cost allocation that's changed a little bit that looks a little odd. We have talked about it during the workshop and reality is it didn't just go away.'",
        "'speaker_8': 'It just offsets the expenditures within the fund. So for exactly that same amount. Okay. Overall, $4 million swing between adopted budget that was adopted a year ago versus now. And it's about half a million dollar difference between what we've presented at midyear in March versus now.'",
        "'speaker_8': 'Again, the two largest contributors were actually one is transfer tax. As we look closer to it and see what it will be. That's majority of that, half a million. And then there's a slight increase for CPI for the transfer from Alameda Municipal Power.'",
        "'speaker_8': 'All the rest of the taxes are expected to be the same, and we've talked about it in detail. So unless you have questions, I'm going to move on. Expenditures have not changed since the last time we've done the presentation and during the workshop again it's the same thing.'",
        "'speaker_8': 'Our salaries went up by about half a million dollars. However, because of your policy that you adopted for pension and OPEB and setting funds aside with pay down, it actually to date saved us and we're projecting that it's saving us about $1,000,000.'",
        "'speaker_8': 'So the offset actually ended up making it and then did change negative reduction in expenditures by about half a million. So this is a presentation for you in a chart form. The during the workshop as you know we've come to you and departments requested certain augmentations to the budget that you already approved a year ago.'",
        "'speaker_8': 'That $1 million is representative of those requests. And we'll go into detail a little more to talk about them. But one of the things that I wanted to present to you and just kind of point out City Council's available fund balance reserve is 25% and that currently is represented in the Midcycle projection column of about $22.8 million'",
        "'speaker_8': '. What you will see in the other bucket where it says 50% of surplus, about 25% target. So that shows a split which we currently project for 1819, if everything is going to be as we've predicted, or at least as good as we've predicted.'",
        "'speaker_8': 'We believe that based on the policy that we currently have for pension and OPEB funding, we may be able to set aside close to $4 million at the end of the year. We do not appropriate those funds, as you may remember.'",
        "'speaker_8': 'We wait till we actually finish the fiscal year and then we come to you and ask to appropriate the money based on the policy. But this is the our current estimate as to what we may be able to put in.'",
        "'speaker_0': 'Okay. Before you move on by voting for this budget, does that include setting aside any money to pay down the reserves.'",
        "'speaker_8': 'At this point?'",
        "'speaker_3': 'Oops.'",
        "'speaker_1': 'I'm going to show Patricia.'",
        "'speaker_3': 'Know. Uh huh.'",
        "'speaker_8': 'Um. Sorry.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_8': 'So that the $3.9 million or almost $4 million is not budgeted. So when you approve it, we expect that number to be that number. But it's only a reserve in the general fund. It's not actually appropriated. Because we don't we can't actually do it.'",
        "'speaker_8': 'We could, but because we truly don't know what the picture is going to be at the end of the year if something happens better or worse, this is a best estimate. Budget is an art, so this is our artistic way to represent what that number will be.'",
        "'speaker_8': 'And then once we know, once the fiscal year closed 1819. So at some point after June 30th. Usually happens in the fall of, in this case, 19 year fiscal year 2019. We'll come back to you and say we've closed the books.'",
        "'speaker_8': 'Now, this is the real number appropriated based on the policy and it's always looking backwards.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_8': 'So this particular slide gives you a summary for just the general fund. We've talked extensively in detail about which departments had which augmentation requests. So this is just a summary representing what each department within General Fund has requested.'",
        "'speaker_8': 'And we'll go through a little bit of a detail, but it's about $1,000,000. For the fire department. There were two things that council did not support during the workshop, and they were removed in that training captain and also a fire marshal.'",
        "'speaker_8': 'Those would have been ongoing costs. What's left at this point here mostly are costs that are a onetime in nature. There are some minor ongoing operating costs, but not significant. For a police department and the rest of the department.'",
        "'speaker_8': 'There's nothing really new, with the exception of one of the items that council requested to put in is for a three year period. Legal Aid Fund. We have talked to the community development director and city attorney's office and based on when the RFP might come out for these type of services, it was appropriate at this time to'",
        "'speaker_8': 'appropriate $100,000. And once we have that program going forward, we still have an additional 400,000, half a million in total that will be set aside for this specific purpose. However, the Community Development Director wanted to clarify some of the items related to the legal aid, and it's specifically related asking counsel if this was meant to be for'",
        "'speaker_8': 'renters or renters and landlords. And I'm going to ask her to speak to that.'",
        "'speaker_4': 'Good evening and good evening to mayor and council members. We are in at the workshop in May we had understood the direction to staff from council was to set up a three year pilot program. $500,000 for legal aid for low income renters.'",
        "'speaker_4': 'And then we affirmed what we had understood the direction from council to be at the June 5th meeting when we were discussing the rent program fee. However, there have been some subsequent questions about whether or not this program was intended to include services, legal services for low income landlords.'",
        "'speaker_4': 'And so we just wanted to take this opportunity to confirm the direction that we had understood, which was a legal aid program for low income renters.'",
        "'speaker_0': 'Amber Ashcraft.'",
        "'speaker_5': 'Well, I think I may have brought this up at the Budget Workshop that if there was a way we could do means testing and that there.'",
        "'speaker_3': 'Were.'",
        "'speaker_5': 'You know, individual landlords maybe limited by, you know, how you would set it up. But I'll bet you have some ideas, number of units in their income and assets that might be appropriate because I know in speaking with the housing authority there.'",
        "'speaker_5': 'Well, and I think your staff as well often gets questions from landlords wanted to make sure they're abiding by the ordinance.'",
        "'speaker_0': 'That was my understanding, though, that they would still be able to in regards to abiding by the ordinances that you want to address those comments.'",
        "'speaker_4': 'I'm sorry, could you repeat call?'",
        "'speaker_0': 'Could you could you respond to member Ashcroft's comments in regards to how the landlords do they need counsel and an attorney to get direction of how to abide by the ordinance? Is that something that is available to them or do they utilize outside attorneys also?'",
        "'speaker_4': 'Well, program administrator staff gives direction to landlords about what their requirements are pursuant to our ordinance. So for example, you often hear that noticing requirements that if a landlord has incorrectly noticed a landlord and they call staff will point the landlord to the language in the ordinance and clarify what the notice needs to say to be compliant'",
        "'speaker_4': 'with our ordinance. So they definitely step definitely and they do the same for for tenants. So staff does that work. But staff does not provide individual legal advice for landlords based on kind of facts, specific questions that they might have our attorneys interpret and defend our ordinance, but not the individual not individual landlord or tenant cases.'",
        "'speaker_0': 'Of life where.'",
        "'speaker_7': 'I mean, one of the things that we've consistently heard is essentially and what you just said to translate it is that if you are a landlord, you can go to the Housing Authority, who is our administrator, and get clarification about how you would go about evicting somebody in line with Ordinance 3148 or how you would go about'",
        "'speaker_7': 'implementing a rent increase without violating the ordinance. Is that correct?'",
        "'speaker_4': 'Yes. That they are instructed on how to comply with the ordinance.'",
        "'speaker_7': 'Okay. And I think, you know, at least from my my intent with this in terms of the pilot program, is that we've heard from many of our constituents on the tenant side that because essentially one group is going to the administrator getting clarification that it would be helpful to have a separate office, basically advising them of what'",
        "'speaker_7': 'their rights may be or what their protections may be under the ordinance. And so, at least from my perspective, I think the ask was that it be bifurcated that way is, you know, in looking at the other programs that exist where legal services are provided as part of the RFP, for instance, or as part of the contract'",
        "'speaker_7': 'for service, do some of these providers look at their personal declarations of income level in terms of taking a case?'",
        "'speaker_4': 'I don't know how I don't know how the means testing is done. But we can say that when we looked at other jurisdictions that offer the legal services, those jurisdictions offer the services for low income tenants only. They don't offer this the comparable services to landlords.'",
        "'speaker_4': 'And we don't know if we were to means test the landlords. And clearly they have assets, right, because they're renting, they have investment property. We don't know how that that means testing would be undertaken and we don't know if I don't we don't believe that the legal services attorneys would take the landlord cases.'",
        "'speaker_4': 'So if the direction of the council was intended to be to provide services to both low income tenants and landlords, we would recommend that we do a little more research about how that would work on the landlords side and that we move forward with the tenant side at this time.'",
        "'speaker_5': 'Where can I go back to my statement?'",
        "'speaker_2': 'So next in line, I think.'",
        "'speaker_0': 'We can take turns, right? I'm going to go to but we're going to come back here.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'So I'm actually going to modify what I just I.'",
        "'speaker_2': 'I don't remember any question about landlords getting legal assistance, so I don't remember that discussion at all. I remember any direction. I know I didn't say it, so I don't know where that idea came from. So to me, the direction is clear that we wanted to assist tenants.'",
        "'speaker_2': 'And as you just said, you know, landlords have assets. You know, sometimes they say it's their retirement, but they actually own property. So I don't understand why we would be want to give free legal service to people that could easily go.'",
        "'speaker_2': 'Or maybe not easily, but at least have the capacity to borrow on their property. Which tenants don't have that capacity? You know, a lot of them are living month to month. So I don't know where that idea came from.'",
        "'speaker_2': 'And, you know, I thought we were doing 500,000. I'm so not clear why we're doing only 100. You know, it seems like we gave clear direction to give 500,000 as seed money for legal aid for renters, and now it's down to 100 and be now we're talking about giving it to tenants or landlords.'",
        "'speaker_2': 'So I'm totally like clueless on how we got to this point. I thought our direction was clear.'",
        "'speaker_0': 'It was warmer than yes.'",
        "'speaker_4': 'Thank you. Absolutely. The direction was clear about the 500,000. So that money is set aside. What we're budgeting is this year only. So that 500,000 is without a doubt it is set aside, it is restricted. So it's a restricted fund balance.'",
        "'speaker_4': 'We wanted to we wanted an estimate of how much we thought we would be spending this year. So if we spend more than 100,000 this year, then we can come back. The money is still there. There has been discussion and it may not have been on the 18th, but there has been discussion in the past about landlord'",
        "'speaker_4': 'and tenant and that's where that's that came up. And we just wanted to get clarification.'",
        "'speaker_0': 'So I do recall the issue being raised, I believe, at the workshop at the library, and I'm not quite sure why we're talking about the program to this degree during the budget meeting because honestly, I would like to look at both.'",
        "'speaker_0': 'I'm agree I am willing to look at low income landlords and tenants. I would like to know the types of services we would be entertaining for, for all of it, because you could have different scenarios that may or may not be appropriate.'",
        "'speaker_0': 'But I'd like to have more time too. And now we have a speaker set if as possible. I think we've agreed to allocate the money and then maybe we could come back and actually have a better discussion.'",
        "'speaker_5': 'On it if I were asked. Thank you. And so actually the topic was raised and it's certainly valid to consider. However, after hearing Ms.. Potter tell us that the programs that you've looked at are all directed towards serving low income tenants, I think that makes perfect sense, and I'm willing to withdraw the suggestion.'",
        "'speaker_5': 'And the other thing I believe is that landlords have access, whether they're a small landlord or a large landlord. There are associations, professional associations of apartment owners and whatnot who can provide those sorts of legal services. So given that we never have enough resources to stretch as far as we would like, I think we probably should focus'",
        "'speaker_5': 'among tenants.'",
        "'speaker_4': 'So with confirmation of the direction, we then will be issuing the RFP and will be back to council in October is our schedule with a contract to award for the services. So we appreciate the confirmation of the direction.'",
        "'speaker_0': 'So then would we look at the types of services, legal services, whether it would be authorized for? At that time. When that comes back, will it come back to council for us to look at it any more?'",
        "'speaker_4': 'The reason that the reason staff was asking for confirmation of direction this evening was so that we could move forward with the RFP timely and be back to council in October. So what I'm hearing is that there there are three members of the council who have confirmed the directions for this step.'",
        "'speaker_0': 'I want to follow it. Okay. We have not really had a real exhaustive discussion on this issue. So I'm asking when you come back, are we going to talk about what services will be available to tenants.'",
        "'speaker_4': 'Will be coming back?'",
        "'speaker_0': 'Are we going to. Is this going to be something that now staff is off goes and does this and doesn't? I mean, honestly, we're in the middle of a budget meeting.'",
        "'speaker_4': 'We're going to come back with a proposed contract. Is is the plan. If council would prefer that we come back with the RFP, with the scope of services and then put out the RFP, we can't come back with the work scope till September.'",
        "'speaker_4': 'Otherwise the intent was to issue the RFP based on the direction we received and then come with the contract to award in October.'",
        "'speaker_0': 'So I personally would like to I'm at some point I think council should have the opportunity to weigh in on the types of legal services that are offered. And I don't know when we get that, when we get to see that because we have barely talked about this member matter.'",
        "'speaker_6': 'SC Um, first thing I want to say is that I understood that we were trying to do something to level the playing field, and it's already been spoken there. And I think we'll have that opportunity to have that discussion when you bring the contract back because the RFP, you've heard the nuances and know people will provide you'",
        "'speaker_6': 'with the services that they can provide us, and you're going to present a contract based on that. We can say, no, we don't like it or we can say Add this or take away that at that time. This is a budget meeting.'",
        "'speaker_6': 'I agree with the mayor that we need to we've got $500,000. You're going to anticipate spending 100,000 this year. So let's move the ball. Otherwise, we're going to be talking about this another six months down the road.'",
        "'speaker_0': 'I'm ready for now. So we have a speaker on this item. But this, I think, would go at the end of the item, right?'",
        "'speaker_5': 'I mean, well, I think we've given direction to staff before.'",
        "'speaker_4': 'Okay. Thank you very much. Thank you.'",
        "'speaker_0': 'Thank you. So are we going to be hearing from other items like that where we're going to have staff come up because we need to be able to get through the budget? We have other items, right?'",
        "'speaker_4': 'We do have other items. Madam Mayor. Um, this is an item I think that was a priority for the council. So staff felt like this was an appropriate time to, to discuss it as part of the budget. So there aren't that many other things that I think we need clarification on.'",
        "'speaker_4': 'But in also, if you do clarification from us, we're happy to provide that as well.'",
        "'speaker_5': 'We can take the public.'",
        "'speaker_0': 'Records, ask questions you have. Do you want to continue?'",
        "'speaker_3': 'Yes. I don't think it's appropriate.'",
        "'speaker_8': 'So I'm going to move on to the next slide.'",
        "'speaker_0': 'The Council for direction. I have a public speaker on the. Rent the tenant legal. Do we want to allow that speaker to come up at this time? You may want to interrupt the meeting and take a.'",
        "'speaker_4': 'We actually don't have that. How many more slides do you have, Lena? Um, I don't think we have that many.'",
        "'speaker_8': 'We'll go through the accounts.'",
        "'speaker_7': 'We're halfway through.'",
        "'speaker_4': 'I think you might have other speakers on other items so you can wait and take the DNA.'",
        "'speaker_0': 'So we're going to wait in the speakers at the end of the presentation. Thank you.'",
        "'speaker_3': 'Okay.'",
        "'speaker_8': 'So moving on again, you have seen this particular items already. The only to that I would like to point out for you is the save for grant and community paramedic. And Grant one ends in October of 2018, one ends in November of 2018.'",
        "'speaker_8': 'So the staff will have to come back to council and for further direction and figure out if we do have an additional funding at the time and if not, what steps we'll need to take. But that's one of those to just bring up to your attention.'",
        "'speaker_8': 'All of these items are the same and there was no changes since we talked in during the workshop. On this particular slide, the highlighted two highlighted items are new. They have not been presented to you during the workshop.'",
        "'speaker_8': 'However, the staff felt that we really wanted to include it because this will assist us with closing out and moving on the projects. There's two Seaplane Lagoon $2 million, and that additional $2 million will be paid equally 1 million from base reuse, 1 million from Tidelands.'",
        "'speaker_8': 'And you will see it actually going to increase the overall Seaplane Lagoon Ferry Terminal Project to nine and a half million dollars. And then just when you park an additional $223,000 will come from the recreation fund. Actually, it will be shared.'",
        "'speaker_8': '$39 million comes from this new Park Foundation, from donations, and the remainder is from the recreation fund. And this is to finish up the project and completed for the construction. If you have any questions, we do have staff representatives here who can get more details.'",
        "'speaker_0': 'So these are new items, right? So it hasn't come to us before. So do you want to speak to what's the balance on all of those funds that you'd be taking this money from? Because we don't have a real report.'",
        "'speaker_3': 'Sure.'",
        "'speaker_4': 'I'm actually a staff report.'",
        "'speaker_3': 'Happy to summarize us here for the Seaplane Lagoon. The balance for the Base Trust Fund will now be 5.8 million and of 6.8 and 2.8 instead of.'",
        "'speaker_2': 'Earth.'",
        "'speaker_3': 'I think 2.4 instead of 3.4 for Thailand. So there's still pretty substantial fund balances in both those funds, which is why we made that recommendation.'",
        "'speaker_4': 'You all right?'",
        "'speaker_8': 'And this was called out as a separate slide. During the workshop, however, all of these have been included in the augmentations that are requested by the department. So everything you looked at already included these items, and we just thought it would be good to have a summarized version of the workforce changes that are proposed with the work'",
        "'speaker_8': 'budget.'",
        "'speaker_0': 'Sorry.'",
        "'speaker_2': 'Whenever I slide I have a question.'",
        "'speaker_8': 'Of course. So just to make it a little clear, if you have questions, I guess you can ask now, but there's only a re class for fire department and the difference between the two positions is very insignificant. It was about $5,000, I believe, maybe less.'",
        "'speaker_8': 'And the only other items included that are larger are obviously the fire department. And again, I mentioned just earlier that staff will come back to council once we know more, if the additional grant funding has been approved or if there are any directions that we'll need to take after October and November dates for those grants.'",
        "'speaker_2': 'Thank you. My question was for our deputy chief. So he could walk up without my time running?'",
        "'speaker_3': 'No.'",
        "'speaker_2': 'Sorry. I guess I missed that. Rick's on back. Deputy Chief Mayor and council. So quick question. We discussed the fire marshal position because right now we have the fire chief doing two jobs, two high level full time jobs with one body.'",
        "'speaker_2': 'And there was a discussion that we were going to try to do a cost analysis, a Nexus study, so we could build the cost of that position, as well as all of the salary and benefits and OPEB and all that stuff into that cost structure.'",
        "'speaker_2': 'So can you just lay out the process real quick for me and how we would go about doing that? I mean, what are the requirements in order to get that in the cost study? Well, first of all, we have done a Nexus study to determine our cost for various for our services.'",
        "'speaker_2': 'But we cannot include something like the fire marshals position in that state because frankly, we don't have that position. So it would not be appropriate to. Factor that in the study included our cost for personnel, equipment, response, response and the amount of time that it takes for each of these various activities that we undertake.'",
        "'speaker_2': 'So I can remember we wanted to bring that back when we were able to have cost recovery. So how do we bring that back if we can't do cost recovery, do a study on it without the position of it's like a chicken and egg things.'",
        "'speaker_2': 'I'm a little confused.'",
        "'speaker_4': 'If I can jump in. So we are doing a we're updating the master fee schedule and that's going to include the public works department committee development and Fire and that and that's coming back to you in September and we can take a look at that.'",
        "'speaker_2': 'I'm still curious, though, how we can. How we can get cost recovery in the study if we don't have the position yet, we don't want to do the position until we have cost recovery. So. Well, that's true. I don't have an answer for you.'",
        "'speaker_2': 'Frankly, I we can't include that in the study because, frankly, we don't have the position. So it can't legally and morally, ethically, it couldn't be included in the study. And we'll never really be able to get cost recovery on it until we actually authorize the position.'",
        "'speaker_2': 'I mean, that's the way I would read that statement. And that's true.'",
        "'speaker_4': 'And yeah, I'm not certain that that's true. I mean, I'm thinking about, for example, the the rent program. Right. We didn't have the rent program up and running. We had an idea of how the rent program was going to run.'",
        "'speaker_4': 'And therefore, we we built the case study around that. So I don't know if Miss Potter remembers what came first, but I believe that we were able to develop that fee, even knowing that we were knowing that we were going to have future.'",
        "'speaker_2': 'Costs to people, to me, to different things. So I don't know who to believe. Well, I will say that when we go through the cost study, which we'll be doing this fall, we we won't include that in there because the position won't be we won't include it yet.'",
        "'speaker_2': 'We won't. Well, we can't as far as I know, unless somebody tells me or us otherwise. It's not something that's a position that we have. So it can't be factored in to that particular part of our costs, which be in the fire prevention division.'",
        "'speaker_4': 'We'll take a look at it.'",
        "'speaker_2': 'Yeah, that's all I can tell you.'",
        "'speaker_4': 'Can you give us an understanding of what your what your concern is?'",
        "'speaker_0': 'And maybe you're also wanted to.'",
        "'speaker_4': 'Make a comment?'",
        "'speaker_2': 'My concern is that, you know, the direction that was given by a majority, not not me, was that we wanted to find cost recovery for this position before we added it. Yet the way I understand it, as Deputy Chief John back explained it to me, we can't get cost recovery until we create the position.'",
        "'speaker_2': 'So it's a chicken and egg thing. So. It's never going to happen if unless we do one thing or the other. So this is where I'm confused. Well, let's let us.'",
        "'speaker_4': 'Come back and answer that for you.'",
        "'speaker_2': 'Okay.'",
        "'speaker_4': 'Okay. Because I don't think we we don't obviously we don't have any advice for.'",
        "'speaker_0': 'You would like to speak before you conclude your comments. He wants to weigh in.'",
        "'speaker_7': 'Vice mayor. So is it is it possible? Hearing from my colleague and I also had concerns just about the because of the scope of work being performed currently at site and the potential development coming up and things that we're looking at, making sure that we're we have the staff in that position and the oversight.'",
        "'speaker_7': 'And I do I did hear the chief's concern about being pulled in a number of different directions and also wanting to be sure that he could actually engage in cost recovery if we could have staff, at least look at that and come back to us.'",
        "'speaker_7': 'You know, I would like to see us work on that to find the funds to fund that position, the funds or the fees to cover that position. If we're if there isn't support from the rest of the council to to put it in the existing budget, which I at that meeting there was not.'",
        "'speaker_0': 'Member Ashcraft.'",
        "'speaker_5': 'Thank you, Mary Spencer. I will disclose that I met with Deputy Chief Sam Beck this week and we went over some of these exact points and I didn't bring my notes. But there is an impressive list of measures and programs that the fire department is looking at doing, starting some of them starting at the beginning of this'",
        "'speaker_5': 'next fiscal year, which starts July 1st. And and in my communication at the time, is that it would be extremely helpful to come back maybe in six months time and see how that all materialized rather than and I said this at the budget workshop rather than basing an expenditure on projected revenue increases, and I think it's very'",
        "'speaker_5': 'impressive and ambitious all the the things that this new chief and Deputy Chief Zubik are doing. They're a great team. But it I mean, speaking of chickens and eggs, these you know, I don't want to count our chickens before they hatch.'",
        "'speaker_5': 'I went to Davis. And then when we talk about, say, day, it's true. A lot of exciting things about to happen there. But we've also had some discussions about the the fiscal neutrality policy that exists out there. But I think, you know, my feeling was not at this time.'",
        "'speaker_5': 'But that's not saying a hard stop. No, but I just need more more information that we don't have the benefit of having yet. Thank you, Mayor.'",
        "'speaker_0': 'Vice Mayor and the member Odie. So, guys, I'm sorry, I didn't know who wanted to go first.'",
        "'speaker_7': 'So is it, you know, is it possible? I mean, I guess my question to the acting city manager is if we could essentially do we need to approve the position but not fund it in order to do the fee study and the recovery study, the cost recovery plan?'",
        "'speaker_4': 'I'd like to actually just defer that question because we needed to do the research. My my, my gut is that if you have the work, you know, you have the work, then you can charge the fee. Okay. But I want to make sure I think we need to talk to legal.'",
        "'speaker_4': 'I think we need to have a conversation with the finance director and just understand what has to come. First, you have to have the position and does it have to be filled in order to charge the fee or if you know, the work is coming and you set your fee and then charge it knowing that you're going'",
        "'speaker_4': 'to have the position. So I don't have the answer to that tonight, but we will certainly come back and and and let you know.'",
        "'speaker_2': 'And my question was, do we have to approve this tonight? The budget? Yes.'",
        "'speaker_4': 'Yes. I mean, your budget needs to be adopted by June 30.'",
        "'speaker_2': 'And if we don't do it, then. Then what?'",
        "'speaker_4': 'I mean, you could do a continuing resolution. Leonard, do you want to answer the question if we don't adopt the budget tonight?'",
        "'speaker_8': 'My recommendation would be to adopt a budget and request to bring it back for that particular item. So I need to actually clarify the fees. My understanding the way it works in order to determine the fee. Currently the fire chief is performing that work and that time can be applied to the fee and therefore it's not just'",
        "'speaker_8': 'going away. So that amount of time that fire chief spent as a fire marshal would be calculated towards the cost of two words, determining the amount of the fee. So it's not just going away. And so once you start collecting it, that revenue is going to come in and you can actually look at it from that standpoint'",
        "'speaker_8': 'once the revenue is collected as well.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'So can you speak to how we did this when we had a fire chief long? How did. How did we handle this?'",
        "'speaker_4': 'How did we handle the inspection issue? As a fire marshal, maybe. Deputy Chief Sam. That can answer that.'",
        "'speaker_2': 'Okay. I'm sorry. Can you repeat the question?'",
        "'speaker_0': 'We used to have a fire chief long. Right. And we didn't have it this way that you were being asked under this new chief to change the way we've been doing it, right? That's what it sounds like. So why do we why is this an issue?'",
        "'speaker_2': 'Well, it's an issue, frankly, because of the increase in volume and in the work in the division. As you well know, back in 2009, we went through a massive recession and frankly, we didn't have much work in the fire prevention division at some levels.'",
        "'speaker_2': 'Now, we certainly always had inspections that we had to undertake. Unfortunately, there was quite a cut back in city services in that era because of the downturn in the economy, the fire department took a fairly substantial hit of a fire station, a number of staff members to managers, what we called division chiefs in the fire department.'",
        "'speaker_2': 'So there was quite a downturn in a number of positions in the fire department. So we're we're working our way back and we're we're working to try and keep up. But frankly, the work is increasing faster than, you know, the staff, per se, to keep up with that work.'",
        "'speaker_0': 'Okay. So I appreciate that answer. So in regards to we had some inspections. We looked at having non sworn people do that, maybe we can look at that again then if the fire department is having a hard time keeping up.'",
        "'speaker_4': 'I think we need. Sure. Yeah, we'd like to get if. We would need direction on that.'",
        "'speaker_0': 'Right. But so I'm going to suggest that that item come back, as I believe we heard earlier as a suggestion. Right. But that I'd like to look at in regards to how how do we best utilize our sworn firefighters to efficiently and effectively do their serve serve our community?'",
        "'speaker_0': 'So I would like to look at the issue of the not because that came to us. It was a split vote in regards to having a non sworn to considering non sworn people to do the inspections as opposed to using sworn.'",
        "'speaker_0': 'And the council ended up supporting using sworn. But now I'm hearing, well, we have so much work for our firefighters and my preference is to have firefighters focused on fighting fires and not necessarily doing inspections. So if we're going to consider adding a position or somehow making this move that is expensive, I think I would like us'",
        "'speaker_0': 'to also look at relook at, reconsider or not just the sworn versus non sworn inspections, but what else we can do to effectively, um, efficiently and effectively utilize our firefighters. A member.'",
        "'speaker_2': 'Thank you, Madam Chair. I just want to just refresh everyone's memory. That Chief Long, when he was here, did ask for a fire marshal position, and that was turned down. So that was part of his original plan. And there was a big expos in the I think it was the Mercury News, including Oakland, our neighbor, which had'",
        "'speaker_2': 'the ghost ship. You know, and they're they're doing this with non sworn and they're just not getting the job done. So all of their residents are at risk. So I'm not willing to take that risk with the safety of the residents of Alameda.'",
        "'speaker_2': 'But like Oakland did. But, you know, that's kind of a history lesson.'",
        "'speaker_0': 'Member matters.'",
        "'speaker_6': 'I do think it's worth having this come back. And I'd also like to know this is the first time I've spoken and I'm down to 8 minutes.'",
        "'speaker_2': 'How does someone got my time?'",
        "'speaker_6': 'But I think I think this is an important enough issue to. Have I and I agree with Ms.. Adair, approve the budget and have it come back when we have some real numbers on what's happening and then what the consequences of not having this and what the other options are.'",
        "'speaker_0': 'Did you want to know?'",
        "'speaker_5': 'Okay. I'll hold mine for nothing.'",
        "'speaker_4': 'Well, I just want to, if you don't mind, Madam Chair, if we could just. I just want to make sure that we have content, that we have three, that. That want us to come back and do that. That is going to be a fair amount of work and we're happy to do it.'",
        "'speaker_4': 'I just want to make sure that that's a consensus that I can also.'",
        "'speaker_5': 'What is the that that we're.'",
        "'speaker_4': 'Well, I think that that we're coming back to look at other ways to pay for the fire marshal and then also the non sworn issue that mayor.'",
        "'speaker_6': 'I thought that was the direction out of the workshop because the chief presented just an ass with a promise that there would be money behind it and that was insufficient.'",
        "'speaker_4': 'Okay. And and then the nonsupport issue.'",
        "'speaker_6': 'Well well, I think I think that we leave to the chief's imagination it's cheaper. And if you've got a budget that's this big and you need to squeeze your work into that budget, come back to us with something that's cheaper, that fits in.'",
        "'speaker_2': 'I don't support that, though.'",
        "'speaker_0': 'Remember, I.'",
        "'speaker_5': 'Said the point I was making was indeed following up with the chief on the impressive list of projected revenue sources starting as early as July 1st. Because the representation that's been made to me is that this position, including the PERS aspect of it, would be funded into perpetuity by these revenue sources.'",
        "'speaker_5': 'So that's why I need to see I need to see some real, real numbers and we just don't have those yet. And with regard to the sworn non sworn you're right, whoever said it, that is it becomes a union issue.'",
        "'speaker_5': 'It's up to the chief and his his staff to to decide how to allocate their resources. But this position, as I understand it is, would be to supervise that fire prevention bureau that we created. But as I also explained, there's a lot of importance and value in having a balanced budget right now.'",
        "'speaker_5': 'And it's just a matter of let's see those numbers if if you can show us that that indeed that position is is funded by by the by these revenue increases, then, you know, I'm ready to support it, but it's just premature at this time.'",
        "'speaker_4': 'Okay. I think that's that's sufficient. Thank you.'",
        "'speaker_0': 'Okay. Thank you. They continue.'",
        "'speaker_3': 'Their key.'",
        "'speaker_8': 'So once we go back to the slide, I was ready to move on, but I'm open if you have any additional questions about it.'",
        "'speaker_0': 'Any questions? All right. So they continue.'",
        "'speaker_8': 'All right. Moving on. So here's a snapshot for the Midcycle projection one more time. And our expectation, again, projection. And the expectation is that we will and the baseline operations or the operations in this case, which includes the requests that you just seen, and this is general funds specifically, it will give us an annual deficit of $8,000'",
        "'speaker_8': '. And to be perfectly honest, this could have been a rounding and you could probably say that we're breaking even, but that's how the numbers fell out. So this is our best guess, best estimate on the budget, and that's where we expect to be at this point.'",
        "'speaker_8': 'We're still meeting projecting to meet 25% operating reserve. And we still have, as we mentioned before, the surplus to set aside funds for the pension and OPEB under the policy. So this is just a snapshot in the graph form as to where we will be.'",
        "'speaker_8': 'Instead of looking at the numbers and the lines for us, the revenue and expenditures meet and that's a positive thing. And to go back a little bit, just to confirm, to show you really the comparison, originally a year ago when you adopted the budget, we were thinking we were going to be $2.9 million in a deficit for'",
        "'speaker_8': 'the year. We actually had a swing of almost $3 million and it actually got us to a -$8,000. So I think that's a big takeaway from here.'",
        "'speaker_0': 'Can you go back to the page, the page that had the deficit or actually maybe it's up here.'",
        "'speaker_3': 'Here.'",
        "'speaker_0': 'Actually, I don't think it was I think it was 24.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Maybe.'",
        "'speaker_8': 'I'm not sure if we move on for the general fund forecast. So I'm anticipating the question is going to be there. Here's the representation of how we're going to look five years down the road. And if we continue at the current spending level, in the current projection of the revenues in by fiscal year 2122, we're expecting to'",
        "'speaker_8': 'have an annual gap of $4.7 million, and that does include the requests that have been made by staff to include in the 1819 budget. Same thing, same presentation, but in a number of format or table format that shows that our net annual activity by the year of fiscal fiscal year 2122 is $4.7 million.'",
        "'speaker_8': 'As you see, we start drawing down on our available balance in 1920 by about half a million dollars, but it actually doesn't bring us below our 25% level. It actually happens in fiscal year 21 and 22 is when we actually starting drawing down on the available reserves.'",
        "'speaker_8': 'That said, by policy at 25%.'",
        "'speaker_0': 'Okay. Before you move on, remember matter. I see.'",
        "'speaker_6': 'And this project projection is based on doing nothing.'",
        "'speaker_8': 'This projection assumes nothing other than what we currently have. Yes.'",
        "'speaker_6': 'No corrections.'",
        "'speaker_8': 'No, no, no adjustments.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Okay. I was on page 20. That's where you first showed the -8000. All right. And that's after our mid-cycle. Everything. Our new request. This is new program requests. Correct. Okay. So that means that our annual activity, our expenses year for the one year are higher than our projected revenues.'",
        "'speaker_8': 'By.'",
        "'speaker_0': '8000 $8,000. Correct. Okay. And then on page 24, we continue doing that, right? Showing our. Expenses expenditures on a yearly basis being higher and our projected revenues.'",
        "'speaker_8': 'Yes, our expenditures continue to grow. There are certain factors that unfortunately are out of city's control. We do have revenues that are growing as well. They're just not growing at the same pace.'",
        "'speaker_0': 'Okay. And so in regards to this year and that's back on that page 20, we're actually going to start using as of this year our reserves to cover that 8000 and recover that 8000.'",
        "'speaker_8': 'This estimate is $8,000. So assuming we're going to come in exactly as we projected. Yes, we will drawdown $8,000.'",
        "'speaker_0': 'Okay. And then when you go back to page 24. The prior year, we did not have that. We ended up positive by quite a bit, right? Correct. Then at this point, your best estimate then is that we're approximately 8000 negative and then it actually grows projecting year after year starting this year.'",
        "'speaker_0': 'You're that based on this this budget has us use our reserves as our projects.'",
        "'speaker_4': 'That's correct. But don't forget your. So, for example, that net annual activity in 1718 is close to $5 million. So you don't lose that $5 million that goes to your bottom line. So that -$8,000 is just the difference between your revenues and expenditures.'",
        "'speaker_4': 'It's not as impact your reserves. You're still your reserves are still there.'",
        "'speaker_0': 'Correct. I want to underscore that our projected budget has our expenses this year more than our projected revenues.'",
        "'speaker_4': 'Management, with all due respect, $8,000 is not even nine.'",
        "'speaker_0': 'I appreciate that.'",
        "'speaker_4': 'I just want to be aware what we call budget doesn't really in a almost $100 million budget. $8,000 is next to nothing. And it's really.'",
        "'speaker_0': 'Where the trend continues based on these projections of our annual if we do ventures exceeding our projected annual revenues.'",
        "'speaker_4': 'Correct. If we do nothing and as we have mentioned before, this does this budget does not include any future development at sight. It doesn't include any future development on the northern waterfront. It's conservative. There are many things that we can do to make sure that by 2021, we do not have a deficit of $5 million.'",
        "'speaker_4': 'This is if we do nothing. So it is a planning document. So your point is well taken. It is a planning document. And we do need to be continue to be conservative and figure out what are we going to do.'",
        "'speaker_0': 'But this is also if we accept these mid-cycle budget requests or we don't cut somewhere else. Correct.'",
        "'speaker_4': 'Yes, we do have mid-cycle budget requests of $1,000,000. And with that request, we essentially what we would consider and I think I'm not going to put any words in midair is work mouth. But we have a balanced budget this year.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Okay.'",
        "'speaker_8': 'To move on. Revenue assumptions haven't changed. We still have the same revenue assumptions as we did when we presented it to you at the workshop. Same thing for the expenditure assumptions we still have cost of living adjustment medical in.'",
        "'speaker_8': 'The biggest one of course is CalPERS growth per year of about 15%. So all of those are the same factors as we presented it to you in May. A similar graph as the mayor actually was showing on her state of the city.'",
        "'speaker_8': 'CalPERS. This is the unfunded liability. And I do want to point out on this one as again, with the policy that council adopted and which I think everyone would commend you on the fact that we've put aside funding and we already saved about $1,000,000 on CalPERS payments.'",
        "'speaker_8': 'It's huge. And every time we put in $1,000,000, we will save $100,000 for every $1 million. I know it sounds like a lot, but when we have to shave off that curve to preserve our services, I think that's a huge deal when we actually do have an opportunity to do that.'",
        "'speaker_8': 'And that's completely because you've approved a policy that helps.'",
        "'speaker_3': 'Us do that. Remember, Audie.'",
        "'speaker_2': 'Just quickly on that, you know, many times during the month, I get approached by other council members from other cities commending us on that and saying, we're just starting to look at that. And I know they're using this as a model on how they could they could attack their issues as well.'",
        "'speaker_2': 'So thank you for that.'",
        "'speaker_8': 'That concludes my presentation. And really the next steps are the staff finance approval requests to request council to approve four resolutions. Obviously one is workforce changes and then with the workforce changes that are happening, there is a salary schedule amendments that are in compensation plan, amendments that are requested again done by a resolution.'",
        "'speaker_8': 'We also ask you to approve the city budget resolution. And because we do have a successor agency to the Community Improvement Commission, that's a separate resolution that needs to be approved as well.'",
        "'speaker_0': 'And we do have one public speaker. So Council, if that's all right, I'm going to go ahead and call Speaker Eric Strimling. And he's the only speaker. If you want to speak on this item, please submit your slip.'",
        "'speaker_2': 'Thank you. I rise today. You have to help me to run this coalition to applaud. And thank you for providing legal assistance to tenants. The lawyers that we have looked up, the pro-bono ones are completely booked for four months and the ones for pay start at $200 an hour and go to 400 pretty quickly.'",
        "'speaker_2': 'A tenant who is already paying 40 to 60% of their income in rent simply doesn't have anything like that kind of money. They have no equity lines drawn. They have no ability to deal. So I really mostly just wanted to get up and say thank you very, very much.'",
        "'speaker_2': 'We understand that there are some income requirements being asked to push for very low and low end to consider if it's possible to get into moderate and have to look at the budget numbers for that. And I don't understand that 100,000 to start.'",
        "'speaker_2': 'It's a three year program with $500,000 and startup costs are usually higher. So you think it would be a little bit front end? There may be very good reasons for that. I just I don't know them well. Thank you very much.'",
        "'speaker_2': 'That's mostly what I'm here to say.'",
        "'speaker_0': 'Thank you. Member matter.'",
        "'speaker_6': 'I'd like to make a motion to approve and adopt the SES operating budget mid-cycle to approve and adopt the successor agency budget. To approve the resolution for workforce changes and to approve the resolution amending the city of Almaty, ACA salary schedule.'",
        "'speaker_6': 'That goes with it.'",
        "'speaker_5': 'And I would.'",
        "'speaker_0': 'Request that we bifurcate them and do them one at a time. Of doing them all at once.'",
        "'speaker_6': 'Okay. I'll start off with the first one. Approve and adopt the City Operating Capital Improvement and Capital Budget Mid-Cycle update.'",
        "'speaker_0': 'Member.'",
        "'speaker_5': 'Yes, I'll second.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Any Council discussions.'",
        "'speaker_2': 'I mean. Well, just to raise the point that I raised earlier, but this chicken and egg thing, I think we need to improve the position. I'm okay with not funding the position for the fire marshal, but I think we have to approve the position.'",
        "'speaker_2': 'So, you know, without that position in there at least so we can get this ball rolling to actually fund it and have it fully paid for. You know, I'm not ready to support any of these budget motions at this time.'",
        "'speaker_5': 'This evolution is.'",
        "'speaker_0': 'Any other comments on this? A. So Miss the dare. Maybe it's not even appropriate to call you back up at this time. I'll just wait. I'll go ahead and call the question. All those in favor.'",
        "'speaker_3': 'I. I.'",
        "'speaker_0': 'Others post. So the budget. Right. That was the motion. Mm hmm. I oppose.'",
        "'speaker_2': 'I oppose.'",
        "'speaker_3': 'Three.'",
        "'speaker_0': 'Okay, so, uh, motion carries right through to two.'",
        "'speaker_6': 'I move. Approving and adopting the successor agency and Community Improvement Commission budget fiscal year 1819.'",
        "'speaker_0': 'Others is their second.'",
        "'speaker_5': 'A second.'",
        "'speaker_0': 'All those in favor. I.'",
        "'speaker_3': 'I.'",
        "'speaker_0': 'I. All this pose.'",
        "'speaker_2': 'God, I actually on that one.'",
        "'speaker_0': 'So that one carries unanimously.'",
        "'speaker_6': 'I'd like to prove that I make a motion to approve the Workforce Change Resolution for a Community Development Department based Resource and Transportation Planning Department. Fire Department. Information Technology.'",
        "'speaker_3': 'Part Council.'",
        "'speaker_0': 'Comments. Vice Mayor.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'That's right. Let me get a second.'",
        "'speaker_5': 'For a second.'",
        "'speaker_0': 'A rush to a vice mayor.'",
        "'speaker_7': 'I think one of the things that we should be looking at and it was raised tonight with all of the changes that are happening to the city as we look at our workforce and the and the continuing changes, changing needs of our community.'",
        "'speaker_7': 'Certainly the changes that we have talked about and discussed at the workshop are necessitated by the work and needs of our community. And I think one of those is fire safety and fire prevention, especially with the development that's coming forward.'",
        "'speaker_7': 'So I look forward to the work being done by staff and having it brought back to us.'",
        "'speaker_0': 'So there's a motion and a second. All those in favor. I. Oppose. I oppose.'",
        "'speaker_2': 'Abstain.'",
        "'speaker_6': 'So in the last three sorry.'",
        "'speaker_0': 'Three in favor, one opposed, one abstain. And I don't know if you caught that. Thank you. Okay. So I opposed and member ody abstained and the rest support it.'",
        "'speaker_6': 'Okay. I would like to move the amendment to the ACA salary schedule and the salary schedule for me in the compensation plan associated with it.'",
        "'speaker_7': 'Second.'",
        "'speaker_0': 'Any comments? All those in favor? I suppose so. Four in favor. One opposed. That completes the agenda item. And now we will take a five minute recess. Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'We're getting ready to resume. Thank you. And now we're going to be back on Earth. Which one is it? Six feet, six C. All right, we're on six C.'",
        "'speaker_1': 'It's a public hearing to consider adoption of a resolution amending Master P, resolution number 1 to 1 nine one to add and revise B, including a rent stabilization program, late fee. And the finance director is returning right now to begin speaking about the master fee, I believe.'"
    ],
    "Consider Directing Staff to Provide Background Information on the Crab Cove Property Prior to Any Council Actions on the Property.  (Mayor Spencer)  [Not heard on May 15, 2018 or June 5, 2018]": [
        "'speaker_0': 'Wonderful. Do we have any or communications on agenda at this time? No, that's eight. Number nine, Council referrals. Nine. Eight.'",
        "'speaker_1': 'Consider directing staff to provide background information on the property prior to any council actions on the property. This item was placed on the agenda at the request of Mayor Spencer.'",
        "'speaker_0': 'Right. And it's just my understanding at some point we're going to have a be asked to take action. And my preference is always to try to get especially legal background information in advance so that we're prepared as much as possible in regards to how to make an informed decision.'",
        "'speaker_0': 'So that's what that goes to. Without getting into too much detail. Right. Member Ashcroft?'",
        "'speaker_5': 'Well, I and I appreciate you bringing the staff report. I also note that we received a very nice summary of the history of this property and the legal aspects of it, I think, from our assistant city attorney or deputy city attorney Selina Chen.'",
        "'speaker_5': 'And I see that. But the settlement agreement with the East Bay Regional Parks Department and the federal government is included. And then I know in my mail I received a copy of the letter from Robert Doyle, general manager of the Regional Parks District, to the Mayor and the council members, stating the park district's position on the property'",
        "'speaker_5': '. So I feel that I have the information I need to make whatever decision comes before us in the future, and there will be a staff report attached to that when it does.'",
        "'speaker_0': 'So I actually didn't think it was comprehensive in regards to the when was it one parcel, when was it two parcels, when in regards to when the people voted or what dates it changed from 1 to 2 parcels.'",
        "'speaker_0': 'And I don't think that was really addressed, which is just a part of my referral of Vice Mayor.'",
        "'speaker_7': 'Madam Mayor, I'm just trying to understand the request. There have been questions that have been raised, I think, by various groups. And so is your request that those questions be answered in supporting or supporting information be provided?'",
        "'speaker_0': 'Yes. And especially in regards to a timeline going back, when was it one person, one was to the subject property? When did it become two parcels? How does that relate to when there was a vote for WW and any other action that was taken?'",
        "'speaker_0': 'But I'm really looking for a comprehensive timeline so that when it comes to us and I think it will be at some point that we have or that we've already had the opportunity, I wouldn't want to I'm hoping not to slow down the ask when it comes to us, but already have our legal department trying to figure'",
        "'speaker_0': 'out the timeline of when it was one parcel to parcels the vote and whatnot.'",
        "'speaker_4': 'So I have.'",
        "'speaker_7': 'A question for staff. So we have our city attorney here. And I know that there's been preliminary work done on this by your office. Do you care to weigh in at all in terms of. Where things are at or what.'",
        "'speaker_3': 'Selina Chen, the assistant city attorney, has been working on this project. Selina Chen City Attorney's Office. We have done some preliminary research and answered some preliminary questions. My understanding of this referral is to do some additional.'",
        "'speaker_4': 'Research to confirm or verify.'",
        "'speaker_3': 'Some of the. Facts, I think, are facts that have been raised by some other groups related to the timing of the personalization of the Navy owned parcels. I think those things can be researched and we can look into that further.'",
        "'speaker_3': 'Did you I was wondering if you had specific questions.'",
        "'speaker_7': 'I think that was just my general question. Some of the questions it looks like that have been raised aren't necessarily things that we can consider as a body. So I'm just wondering whether or not these questions are also being posed to other bodies who would have authority or jurisdiction?'",
        "'speaker_3': 'You're correct. These. A lot of these. I guess this is more it seems like for background purposes. It seems like the mayor wants to have a complete picture of of what's happened to date some of the things we don't know.'",
        "'speaker_4': 'For example, when the Navy's personals were.'",
        "'speaker_3': 'Separated, you know, that's not subject to the state law or the subdivision map act. So we would actually have to ask the Navy to confirm that date. That's not something that we would have, but we can look into it.'",
        "'speaker_6': 'We're talking about rep. McCain not just USDA.'",
        "'speaker_2': 'Right.'",
        "'speaker_6': 'USA. I don't think it's navias.'",
        "'speaker_4': 'Oh, I'm sorry. Excuse me. You're correct. I was just referring to the federal government.'",
        "'speaker_6': 'North. Yes, I was.'",
        "'speaker_4': 'I think I was confusing the two. So you're correct. But when the federal government's parcels were separated.'",
        "'speaker_3': 'I'm not. I mean, we can do as much research and try to track down information as the council directs us. It sounds to me like this is more of an informational piece. I mean, we will be bringing back information when we're coming forward with any kind of application on behalf of the the person who ends up with'",
        "'speaker_3': 'the property and how they want to develop it. And we can have as much information as we can gather. Obviously, we listen to all of your requests for information and try to resolve them. If you're asking us to try to do more research than we've already done and contact the GSA and others and try to figure out'",
        "'speaker_3': 'if they'll even get back to us in a timely fashion when they might have done personalization, and then just bring it to council or send it to you on an off off agenda memo or something like that. We can certainly do that.'",
        "'speaker_3': 'I think what what Miss Chen is advising is that there is a lot of a lot of work that's going to have to be done. And we can't control the responses for everybody. But we respect the mayor's request for wanting these kinds of things.'",
        "'speaker_3': 'And of course, we will move forward if that's what council wants us to do.'",
        "'speaker_0': 'Member madrassa member.'",
        "'speaker_6': 'Ashcroft we already have up on the city website. I think if you can, I think it's still there. Frequently asked questions. And I think from the input that I've had, it's important for the public to know what actions are taken by whom in a timeline.'",
        "'speaker_6': 'And I think that's what I think that can be posted on the website, and that doesn't involve GSA asking them for additional information. It's just what is the timing and who has authority over what action. And then I'm assuming the rest is going to be in the staff report on whatever action that we have to take and'",
        "'speaker_6': '. You've heard input on what should be in the staff report. I don't see the need to do anything more than that.'",
        "'speaker_0': 'So what's my answer in regards to that? My interest. So I think you do. I would like staff to reach out to the federal government or whomever and find out when the parcels went from one parcel to two parcels.'",
        "'speaker_0': 'And that's not enough for me. So they can request it and try to complete the timeline, not just currently. What's happened historically, especially in regards to when that WW was in 2008, what the property looked like at that time.'",
        "'speaker_0': 'So that's what I'm trying to get to. And then that. And then I think I'd be fine to have it, and I think it'd be a great idea to add it to the ethic used in the information that I would like staff to go farther back.'",
        "'speaker_0': 'And that was preliminarily given to us. And you may they may have done it regardless. I just wanted to bring it as a referral because I'm always I don't know. You know, it's good to have counsel when a member Ashcraft and.'",
        "'speaker_5': 'I certainly respect the mayor or any council members. Right. To bring a council referral. I cannot support this one, though, because I look at the information sought and I ask, what's the relevance and to what end? And I agree that there is information up on the city's website.'",
        "'speaker_5': 'That was a very comprehensive memo that Mischin provided the council a month or maybe two ago. And to the extent that there are opponents of the proposal to do a homeless accommodation as not only allowed but required to be some right exercise for surplus for federal government property, I don't know that we have an obligation to do'",
        "'speaker_5': 'the homework for the opponents. I mean, they can they can do research, too. But I just with everything else we throw at our legal staff and, you know, they haven't gotten any bigger. I just don't see that this one needs to be addressed because as has already been stated, this will come back to us in the form'",
        "'speaker_5': 'of a staff report at such time as an application comes before this body.'",
        "'speaker_7': 'I swear I actually see this referral a little differently and I may be wrong, but I do think that it's been helpful in terms of at least giving staff, having being able to have a conversation about the types of information that various council members are hoping to have for when this item comes back.'",
        "'speaker_7': 'I. I do not want to create unnecessary work, but at the same time I do think we have a need that's been demonstrated through the various reports that come through to provide services for homeless and for homeless veterans.'",
        "'speaker_7': 'That's been something that's been demonstrated through our various reports. So I also see the request for information in the light of if there are going to be different challenges, we need to have the answers for them. And I do trust that that information is being looked at by our staff.'",
        "'speaker_7': 'I think to the extent that we are getting things, I think it's helpful to clarify and the facts have been very helpful, I think, for a number of people. I think to the extent that we're reliant on information from other agencies or jurisdictions, letting people know that we've requested the information, but we haven't heard back.'",
        "'speaker_7': 'That to me is it is being as transparent as we can be. We've requested it, we've asked for it. We can't. There's no other function that we can or process by which we can actually obtain it right where we're requesting it.'",
        "'speaker_7': 'If you would like this information, you can request it as well. So, you know, I do want to be cognizant of where our jurisdiction lies on this issue, but I do want to be responsive. And I think that that that direction has been given to staff and been made very clear.'",
        "'speaker_0': 'Everybody.'",
        "'speaker_2': 'Thank you. So my quick comments, somebody could correct me if I'm wrong, but I think my memory is that when this referral came out on April 24th, you know, we did not know that the G overlay removal proposal was going to be done in December.'",
        "'speaker_2': 'I thought I thought there was some concern in the community from those opposed to the homeless project that it would be quicker. So I do think there's a lot of time now because of all the hoops that they have to go through, that all of the pertinent questions could be answered.'",
        "'speaker_2': 'So I just want to also remind folks that, you know, when we had our priority setting workshop a year ago or two years ago, I can't remember exactly. And then we reaffirmed it this year. You know, homeless was still the number one thing.'",
        "'speaker_2': 'I mean, everyone put that is the number one thing. So now we have an opportunity to approve a project. You know, granted, it hasn't gone through all of the steps yet that actually meet that need. So, you know, I'd like to make sure that we're able to do that.'",
        "'speaker_2': 'You know, one thing that I see every day in my job is connecting homeless people with services is probably the most helpful thing we can do. So with that said, I mean, I'm a little disappointed that like a councilmember can't get an answer to her question and has to do referral to get an answer.'",
        "'speaker_2': 'So, I mean, I hope that when we ask questions that we get those answers.'",
        "'speaker_0': 'So I just really want to make sure that there was it sounds like maybe at least three of you are agreeable to reaching out to these different agencies to confirm it. Other entities are saying if if we don't get a response, then so be it.'",
        "'speaker_0': 'But I think it is appropriate for us to for our legal staff to try to confirm what other organizations are saying.'",
        "'speaker_2': 'I know if I said.'",
        "'speaker_0': 'So and maybe you did it so maybe I misunderstood then, but I think.'",
        "'speaker_2': 'You should have got an answer to your question when you ask.'",
        "'speaker_0': 'But I would require the referral to it. Okay. So this is why this is. It's hard to know. Can. So, you know, is it appropriate for me and I don't know what all of you are asking for additional data.'",
        "'speaker_0': 'I would there are a lot of statements that are being made, and I would hope that our legal department would try to reach out to the agencies for confirmation. So we have a complete timeline. And I just try to be transparent, which is why I brought it.'",
        "'speaker_0': 'Maybe I don't need to bring it. I don't remember matters.'",
        "'speaker_6': 'And I'm glad. Councilman Brody brought up that the homeless. Situation that we're in is number one of on our list of the council work plan. And this is the this is truly the first tangible remedy that were being offered.'",
        "'speaker_6': 'We took a step ourselves in contracting with Operation Dignity to do field outreach. And this is. Hopefully the a place where people can get the medical knee service they need. That being said, there's a lot of churn out in the community and I think it's very helpful to have it.'",
        "'speaker_6': 'So I want to make a motion that we refer this matter to staff. To start gathering the information that has been mentioned. In this referral as well as to post as soon as practicable a timeline that includes the.'",
        "'speaker_6': 'Decision points that are made and who makes those decisions. So that's posted on the website and. This is in preparation for a staff report that will accompany city council action or actions. That are going to be related to this this partial.'",
        "'speaker_7': 'I just.'",
        "'speaker_4': 'Think you. Madam Vice Mayor, I just want to make a comment about staff providing the information. And I think just in defense of the city attorney's office, they provided a lot of information. They did a lot of research.'",
        "'speaker_4': 'And and I think there was additional research that was requested. And I think staff just wanted to make sure that all the counsel was okay with us doing that additional resources or spending the time to do that and to give you that information.'",
        "'speaker_4': 'So I just want to acknowledge that her staff actually did a lot of work on this matter already. And this is really in recognition of Councilmember Otis comment that, you know, that you're sad to hear that when a council member asks for information that you have to bring a referral to get that information.'",
        "'speaker_4': 'That's really not true. So the attorney staff did a lot of work and this is just ask you to do some additional work. And I think, you know.'",
        "'speaker_0': 'The timeline, how much it had done.'",
        "'speaker_3': 'If I if I may just add one thing, and I appreciate the acting city manager saying that about this office when we got this when this project came up, the city attorney's office working hard with city staff, the community development department, it wasn't just us work very hard at trying to put together what would happen, what going'",
        "'speaker_3': 'forward, I mean, what the situation was and then what approvals things would have to happen going forward. What we're being asked for now and primarily by the mayor, which is her prerogative and I'm not objecting to that, is to go all the way back to historically.'",
        "'speaker_3': 'How did this property come about being put up, which all was the federal government, which is entirely the GSA, the Department of Agriculture, and how they did it. That's what we're saying. We don't have that information. So we're happy to go back and to however historically you want us to.'",
        "'speaker_3': 'But I don't I appreciate the fact what the acting city manager said. It wasn't that we weren't being responsive. We're getting additional requests for information. And we will provide we will do our best to gather that information and provide it.'",
        "'speaker_0': 'And I just want to add this referral I wrote a long time ago. I actually probably wrote it before we had information from the attorney's office. If you look at the date that I and regards how much history actually in going back to 2008, which isn't that far back back when WW was voted on, I want to'",
        "'speaker_0': 'know then, was it one or two parcels? That's my my. Oh, I'm sorry. Okay. And then I do need to have a motion, apparently, to consider remaining items 99 C and ten A is this 1030? We have a motion to consider the additional items.'",
        "'speaker_1': 'The last meeting will have to do that.'",
        "'speaker_5': 'But second.'",
        "'speaker_0': 'All those in favor. I, i, i know. I guess we need for votes for this.'",
        "'speaker_2': 'Sure.'",
        "'speaker_3': 'Hopefully we can go through it.'",
        "'speaker_7': 'So just really quickly, it looks like a lot of the information that was requested has been provided and was being worked on at the time that the request went in. Councilmember Morrissey My one question for you is when you talk about the timeline and that sort of thing, are you are you literally talking about a timeline of'",
        "'speaker_7': 'as we get the information and if we get it and, you know, who can or are you looking like how robust is the information that you're looking for?'",
        "'speaker_6': 'I'm looking for. We're here right now. The GSA took some action. There were applications. What's the projected timeline? What are the steps that have to happen to the point where a project comes before? First of all, geo overlay comes before the city council.'",
        "'speaker_6': 'And I'm not asking this mainly going forward. Going forward. Yes. For us, it's for the public to know what's happening.'",
        "'speaker_5': 'Not going back.'",
        "'speaker_6': 'I don't see the need to go back except in the staff report and that's going to be published before we take the action.'",
        "'speaker_3': 'So we have provided, I believe, the timeline that you just described. That was my point. We did the go forward. What has to happen now? And now we're going to we will go back and we will try to find, you know, what is more historic.'",
        "'speaker_3': 'And I understand Mayor 2008, but it's still historic from this point forward. We do, but we're happy to do that.'",
        "'speaker_2': 'I remember. I mean, only thing I'll say is, you know. You have. It'll probably come up in December. Oh, I don't know if it's something I would tell you to do now, but I'm sure the question will be asked.'",
        "'speaker_2': 'So you can you can decide what you want to do based on knowing that the question will be asked.'",
        "'speaker_4': 'And. Yeah. It's on.'",
        "'speaker_2': 'I'm sure it'll be on. And for December it'll be asked if it's not in the staff report. So take that for.'",
        "'speaker_4': 'Right.'",
        "'speaker_2': 'So I'm not telling you when.'",
        "'speaker_3': 'We hear you and we don't.'",
        "'speaker_5': 'Want you to take a vote on this.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_5': 'Let's take a look. I don't think we have a second.'",
        "'speaker_0': 'So my referral goes to wanting to know the history of the ownership of the property back in 2008 when the people voted on w w and it sounds like it may require writing letters and requesting it from other jurisdictions, and we may or may not get a response, but I think it's important for us to have that'",
        "'speaker_0': 'information. If we can get a response, that'll be great. If not, you know, we tried, but I want to confirm this information. And so that sounds like that's not going to make I don't know if that was included in member mattresses motion or not.'",
        "'speaker_7': 'I'm supportive of I'll second member Matt Ross's motion.'",
        "'speaker_0': 'But his motion is not to have the history. It's actually sounds like it's not it doesn't include my referral.'",
        "'speaker_6': 'My assumption is that that's going to be in the staff report when this comes to us for action. And I stated that at least twice.'",
        "'speaker_7': 'And I think that there's been sufficient direction in this conversation that the city attorney's office knows that there's expectation that the information that you've requested will be included. And that's what I was saying earlier. I think that we've we've we've collectively let them know that this is the type of information that we think is going to come'",
        "'speaker_7': 'up as part and has come up and that we would like them to include it in the staff report in December.'",
        "'speaker_0': 'Okay. So can that be a friendly amendment to your motion? I think it's more clearly articulated.'",
        "'speaker_2': 'What you said. Yes.'",
        "'speaker_0': 'Yes. Okay. All right. So then there's a motion and then a second, then all those in favor I oppose.'",
        "'speaker_5': 'No.'",
        "'speaker_0': 'The motion carries 40 oh oh.'",
        "'speaker_2': 'An abstain.'",
        "'speaker_3': 'Oh that.'",
        "'speaker_2': 'I think, I think.'",
        "'speaker_0': 'Okay so we.'",
        "'speaker_2': 'Got it's.'"
    ],
    "Consider Directing Staff to Prioritize Efforts to Increase Safety and Reduce Crime.  (Mayor Spencer) [Not heard on May 15, 2018 or June 5, 2018]": [
        "'speaker_0': 'One one it sounds like. Okay, okay. The next motion. I'm sorry. The next item nine be.'",
        "'speaker_1': 'Considered directing staff to prioritize efforts to increase safety and reduce crime and to do the same as place on agenda at the request of mayor.'",
        "'speaker_0': 'This is another one that I had placed on that I had submitted quite a while ago. Um.'",
        "'speaker_6': 'So who's going to vote against prioritizing safety and reducing crime?'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'So then so that a motion.'",
        "'speaker_0': 'Okay, their motion for my.'",
        "'speaker_3': 'Yes.'",
        "'speaker_4': 'Well, hang on a second before you do that, because I want to make sure that's I just want to make sure that the referral I want to see what the action is in the referral before we.'",
        "'speaker_6': 'That's more my reaction to.'",
        "'speaker_5': 'I think it was a moot point maybe.'",
        "'speaker_6': 'I think they're doing that for the. There's any I just haven't seen any thing to tell me that we're not doing that and the chief's not doing that, and the department's not doing that.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Yes, very.'",
        "'speaker_2': 'Sorry. I mean, I would agree with my colleague, Mr. Martin. I mean, I don't I don't see anything that our, you know, police department is not doing to either solve crimes that happen or prevent crimes from happening. But I did want to point out that I think there was some discussion offline about Prop 47 in a study'",
        "'speaker_2': 'that came out by the PC. And, you know, the. The headline. You know, one is that violent crime has not increased in California due to Proposition 14 or Proposition 47. And the other headline, even though some people are touting this on the right, that some of these property crimes have increased, it's important to note that, you know'",
        "'speaker_2': ', they've increased. They went from the lowest on record and the increase was to the second lowest on record. So even though there may have been a slight increase, which you may or may not attribute to Prop 47, we are still in a really good period when it comes to property crimes, especially when you compare it to the'",
        "'speaker_2': 'rates back from the seventies and eighties. So I just want people to, you know, not get caught up in the in the data because Mike McMahon used to tell me there's lies, damned lies and statistics. So I just want to make sure we don't rely on statistics to prove some point.'",
        "'speaker_2': 'And I don't know, one on this council did. So I'm not saying anything about anyone on this council, but there was some offline communication that I received from some of the outside the council.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_7': 'I of course, support reducing crime, but I draw the line at Fourth Amendment protections and civil rights. And if this is a resolution to push forward or somehow bolster support for expediting the cameras, I'm not going to be in support of this because I think that that's a conversation that we still need to have and it's already'",
        "'speaker_7': 'on the agenda. And certainly one thing that we did hear from our chief at our budget workshop was that it looks like we're going to be at full staffing and that we have new recruits coming in. Right. And I think that that's a significant step forward, because we do know that community policing, having trained officers who are'",
        "'speaker_7': 'out in the community, is is the most effective thing that we can do. And also working with our citizens to make sure that, you know, that that they know what to look for and what to report and how to engage or, you know, to to improve their safety is another thing.'",
        "'speaker_7': 'And so I don't I also don't want this to be kind of a. Read as a comment against our department and the work that they've done. To get up to staffing and to go out and actually do the do the good work that they're doing.'",
        "'speaker_0': 'Hey. Well, I brought I actually don't know when I submitted this. I know it was a while ago, but I do want to I think it is important that we prioritize efforts to increase our safety and reduce crime.'",
        "'speaker_0': 'And that's why I brought the referral to get it to have it come back. And my understanding was at some point this can come back like in December or something. And I think maybe it was moved up in one of our meetings.'",
        "'speaker_0': 'I'm not really.'",
        "'speaker_3': 'Sure.'",
        "'speaker_4': 'So I mean, I think the general idea of supporting, you know, to prioritize efforts to increase safety and reduce crime, I mean, we I think we can get behind that. I'm not sure what we would bring back. We are, um, you know, on the uppers.'",
        "'speaker_4': 'We had discussed that on the 18th. We plan on bringing back the policy as well as, um, if there's a RFP. So I think we're clear on that. So I don't think any of it we wouldn't be planning on bringing anything back on this.'",
        "'speaker_0': 'And when a staff planning to bring that back at this time, that.'",
        "'speaker_4': 'Is coming back in, I believe, in September.'",
        "'speaker_2': 'At a nice handed engagement.'",
        "'speaker_3': 'They.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_0': 'Yeah. So personally, I don't know if it's possible to move that up, but if it works out that it works where he has the twenty-fourths and sooner and my preference would be to have it come to this, you know, whenever, as soon as possible.'",
        "'speaker_0': 'So but I think the referral honestly was written quite a while ago. This has been.'",
        "'speaker_4': 'You can tell. Yeah. So it sounds like it's coming back on September 4th. That's about as quick as your as we're going to get.'",
        "'speaker_0': 'Great. Okay. So September 4th sounds good. I know it had been later date at some point and we moved it up, so I appreciate that. Okay.'"
    ],
    "Consider Directing Staff to Draft an Ordinance Banning the Use of Gas-Powered Leaf Blowers. (Mayor Spencer)": [
        "'speaker_1': 'Nine C visitor directing staff to draft an ordinance banning the use of gas powered.'",
        "'speaker_0': 'Okay. So I brought this referral because actually other cities have interchanges that ban gas powered leaf blowers. And nowadays there's many electric alternatives, battery operated alternatives. And I would like to see us join other cities that have banned the use of gas powered leaf blowers or two of these entertain the referral questions.'",
        "'speaker_0': 'That's why I brought the referral. Yes member matter SC.'",
        "'speaker_6': 'I move this referral item number to refer matters after schedule. The Future Council meeting agenda.'",
        "'speaker_5': 'Could I have a comment?'",
        "'speaker_2': 'Yes, sir.'",
        "'speaker_7': 'I'm so following a second.'",
        "'speaker_6': 'Please follow following our rule. Yes, it's appropriate to provide a a motion to help focus the conversation.'",
        "'speaker_7': 'Okay. And I seconded it.'",
        "'speaker_0': 'Vice Mayor, second motion. And so my staff is.'",
        "'speaker_5': 'I appreciate you giving it a low priority because as compared to other things where we're dealing with. That's appropriate. And also, I would just the flier is not exactly instructive because it's just a picture and some words and it doesn't talk to me about how you do the enforcement piece.'",
        "'speaker_5': 'And so that's, you know, an ordinance is only as good as its enforcement. I'm not saying not to do it. Those things annoy me, too. But, you know, you stop and think about do we want to take police off the streets to pursue leaf blowers?'",
        "'speaker_5': 'Or maybe we need a little more information about what other cities do.'",
        "'speaker_0': 'Or may remember already. I'm not sure what's to go next.'",
        "'speaker_7': 'So I think we have a staff member here who was going to make a statement. And then I also have a question at some point.'",
        "'speaker_2': 'Madam Mayor, members of the City Council, I am Liam Garland, Public Works Director. And after seeing this referral, we convened our crack in-house team, community development director, recreation and Parks Director and Chief Building Official to talk through the referral and I think be helpful just to share a little bit of context.'",
        "'speaker_2': 'It is true that there are a number of cities in California who have banned gas, gas powered leaf blowers. The number is about 19 that have done that. There's another five, strangely enough, who've banned both gas or electric leaf blowers.'",
        "'speaker_2': 'So essentially saying you got to use your rake. And then there's about 60 who who have various regulations around noise or timing of those, the use of the blowers. We looked at back and this is mainly thanks to the chief building official.'",
        "'speaker_2': 'We looked back in code enforcement complaints to see how frequently this issue had come up past ten years, about three times. In terms of a as a code enforcement matter. It's not a lot of complaints coming in. There is the challenge with enforcement.'",
        "'speaker_2': 'That is always a challenge with ordinances like this. On the positive side, our Recreation and Parks Department is already setting a new course with electric leaf blowers. And so there's a bit of a mini pilot going on already with city staff to see if there's a loss in efficiency or function or if the costs are too much'",
        "'speaker_2': 'by transitioning over there. So that's something, honestly, that Public Works is now taking a look at and thinking about just on our staff and our contractors to see if we can move toward electric blowers. And then finally, there's the climate plan where this was actually an explicit bullet point in the scope of work of the climate plan'",
        "'speaker_2': '. And so from staff perspective, that's sort of the vehicle to figure out if it's the right time to make that move. It would mean that in the outreach this fall and winter, it's something we could be talking to the community about.'",
        "'speaker_2': 'And then essentially as the plan comes back to council in draft form in January or February, it's either, you know, reclamation, one, two, three, or perhaps we figure out something that suggests we shouldn't be moving forward with it.'",
        "'speaker_2': 'So that's staff's recommendation is to have the climate plan be the vehicle for figuring out if this is the right move for Alameda.'",
        "'speaker_7': 'So my question was actually going to be, where are we as the city? I think it's hypocritical for us to ban something that we are currently using. So I was I'm happy to hear that we are at least looking at it within our city departments and with our contractors.'",
        "'speaker_7': 'I also think that rather than just banning something, it's really important to educate people and offer them alternatives. So I think if this is coming back to us as part of the Climate Action Plan, perhaps as part of the motion that's being put forward, that this could be part of that.'",
        "'speaker_7': 'And also that we perhaps put incentives or information out there to just educate people about the differences. I'm personally opposed to them, but I think a lot of people use the equipment that they have. They don't realize that there's new technology out there, that it's affordable, that sort of thing.'",
        "'speaker_7': 'And I also think that incentivizing the behavior and educating on it is going to get us much better results than just an outright ban from the beginning, much like with our our ban on on straws or saying straws upon request only.'",
        "'speaker_7': 'We did a lot of outreach and education around that through our different community groups. And I think we're still doing that outreach and education, every one of us, every time we go to our restaurants in town. But it it's going to be more effective if we go about it in that approach.'",
        "'speaker_7': 'So I'm happy to hear that we've already started on it. I'm looking forward to having the Climate Action Plan come back and having this be a component.'",
        "'speaker_0': 'And I just wanted to add, I did include. The alternatives in the referral. And there was a so you may only have had three. I know I've had more complaints than three during the time of the mayor regarding this.'",
        "'speaker_0': 'So they may not always reach out to you all, but we hear from a member already and then.'",
        "'speaker_2': 'Thank you, sir. Thank you. I also want to, you know, comments are similar to the vice mayor's. You know, I think we need to be careful if we do this on who is going to have the most impact on and it's probably gardeners.'",
        "'speaker_2': 'So, you know, I can imagine a lot of them are like rolling in dough. You know, it could be that this perhaps is one of their most significant assets in their gardening business besides a truck, you know, or a mall or something.'",
        "'speaker_2': 'So I'd like to see, you know, if we could do some incentivizing, even if it's, you know, costing us some money that we could help, you know, help gardeners find a way. Now, there are gas powered, quiet ones, I've understand.'",
        "'speaker_2': 'So maybe we want to move away from gas entirely. But, you know, if we start doing outreach to the for lack of a better word, industry, we may not feel more comfortable with that rather than just saying, you know, on January 1st, such as lunch and they were going to ban it, you know, and we kind of'",
        "'speaker_2': 'do a softer approach and get to the same result we want, which is, you know, at some point we have no more gas leaf blowers and Alameda member Ashcraft.'",
        "'speaker_5': 'And I'm the way I would approach it. And whenever I work with my public works director, Mr. Garland, I'm always impressed by your ability to do very effective, positive community outreach. But I would approach this from a health standpoint.'",
        "'speaker_5': 'First of all, it is not healthy to be operating a gas powered mower and breathing those fumes, and it isn't healthy for our environment because that's just, you know, adding more emissions to the air. And the other thing is it's they're very loud and not all gardeners wear the headphones that you should be using.'",
        "'speaker_5': 'And so they are potentially injuring their hearing, too. And Mr. Otis point is well taken about this, that, you know, financial support for many people. But to the extent that it might be possible to, I don't know, partner with some of our local businesses that might offer electric leaf blowers instead that might be not sweetheart deals or'",
        "'speaker_5': 'anything, but just saying, you know, we might be able to direct people. And then when we're doing our outreach and literature say that's developed, we should think about being at least bilingual to make sure that that, you know, people who are likely to be the users can can get the information in the language that they understand.'",
        "'speaker_5': 'But I think there's a way to turn this into something more positive. I'm still not sure about the enforcement angle, but there's you know, I'm I'll leave that in your capable hands.'",
        "'speaker_3': 'To.'",
        "'speaker_5': 'Do something.'",
        "'speaker_0': 'So when do you expect that you would come back on this issue?'",
        "'speaker_2': 'By January or February? We would have more information first on how the city's implementation of moving toward electric blowers, how that's gone, what we've learned on costs and logistics. And then the first draft of the plan is likely to be in front of council in January or February of 2019.'",
        "'speaker_2': 'And that would be this would be a part of that discussion.'",
        "'speaker_6': 'It's already in the plan. The existing.'",
        "'speaker_2': 'Plan. Exactly. And just taking a step back from there earlier in the fall, there's going to be community outreach where this will be part of that discussion as well. And obviously getting a lot of public input on on whether this is the right time to make the move or not.'",
        "'speaker_2': 'I want to make sure that outreaches also to the gardening community the gardeners. So.'",
        "'speaker_0': 'So my concern, honestly, on that is that it's this is just one component of, you know, other cities have this. The Climate Action Plan covers so many things, and I'm not sure that it needs to be packaged within that or or can't be expedited.'",
        "'speaker_0': 'So I think it could. But Madame Mayor, Vice Mayor.'",
        "'speaker_7': 'You know, one of the things and Councilmember Ashcraft commented on this earlier was that you've listed it as a low priority. And and I think that the one thing that that's important to note is there have been other things like, for instance, minimum wage and stuff like that, that took over a year in cannabis to come back'",
        "'speaker_7': 'to us. So having this come back for consideration in terms of further action and if.'",
        "'speaker_0': 'You look at it, I try to remember when did I do the minimum wage referral? I did that one many quite a while ago, so that was another one.'",
        "'speaker_7': 'So I think what I'm hearing from Mr. Garland is that it's going to come back in six or seven months and then we can we can take action on it. And so that's fairly that's quick.'",
        "'speaker_0': 'Fairly. Very good. Thank you. Okay. And then the next item we have is ten A.'",
        "'speaker_6': 'Do we vote on.'",
        "'speaker_7': 'Whether we have a motion on a second?'",
        "'speaker_5': 'And remind us what the motion was, again.'",
        "'speaker_6': 'Is to follow number two. And number two, if you read it, it says to I suppose it says to refer the matter of staff to schedule for a future council agenda. And we have to start right there.'",
        "'speaker_2': 'Taking into consideration.'",
        "'speaker_0': 'The second consideration comments. All those in favor. Hi. Thank you. Motion carries unanimously ten a.'"
    ]
}