{
    "Introduction of Ordinance Amending the Alameda Municipal Code, Including Article VIII (Sunshine Ordinance) of Chapter II (Administration) to Clarify Enforcement Provisions and Provide for Other Updates and Enhancements to the Sunshine Ordinance.  (City Attorney 10023040) [Not heard on July 20, 2021]": [
        "'speaker_3': 'In the last round of Sunshine Ordinance updates, we met with the Council to talk about various modifications. The most most of the modifications that the Council directed us to return to were changes to the remedies provision of the Sunshine Ordinance.'",
        "'speaker_3': 'And with respect to the remedies provision, the Council expressed interest in having us maintain the recommendation role of the Open Government Commission, but to return with the Open Government Commission's recommendation of keeping matters as much status quo as possible when a Commission decision has been rendered.'",
        "'speaker_3': 'We have met with the Open Government Commission throughout the last year on this topic, and that one major difference between our recommendation and the recommendation of the Sunshine Commission is or the Open Government Commission is, that we recommend that it would be an encouragement but not a mandate, so that city Garden City business can move forward as'",
        "'speaker_3': 'appropriate. Aside from that, the rest of the changes are minor and in the staff report itself, and we're happy to answer your questions.'",
        "'speaker_0': 'Thank you, Mr. Shen. Mr. Li, I can tell you in muted. Did you want to add anything?'",
        "'speaker_1': 'Can you hear me? Just fine?'",
        "'speaker_0': 'Yeah, just fine.'",
        "'speaker_3': 'I guess it's just a video. I have nothing to add. I just wanted to make sure you can hear me.'",
        "'speaker_0': 'All right. Thank you. And, Madam Cook, do we have public speakers on this item?'",
        "'speaker_2': 'We have one so far.'",
        "'speaker_0': 'Okay, Counsel, do we have any clarifying questions for Mr. Lay or Mr. Sheehan before we take our public comment? Should we take our public speaker first? Okay, let's do that. Madam Kirk, would you introduce our public speaker, please?'",
        "'speaker_2': 'We now have two, but the first one is Carmen Reid.'",
        "'speaker_0': 'All right. Good evening, Speaker Reid.'",
        "'speaker_1': 'Good evening, Madame Air and City Council Members. I would just like to bring attention to the penalties section in the Sunshine Ordinance. It's to dash 93.8 subsection D, and it states that a person who makes more than two complaints in a in a in a calendar year by the commission is 20.'",
        "'speaker_1': 'So if if a person who makes more than two complaints in in one year a 12 month period by the commission to which is determined by the commission to be unfounded shall be prohibited from making a complaint for five years.'",
        "'speaker_1': 'So I find this particularly concerning and this penalty seems rather harsh and unnecessary, especially because the LGC has not traditionally heard many complaints. And if our community wants a more open government, I recommend amending that clause to represent a more fair process instead of discouraging community involvement with the penalty that prohibits engagement.'",
        "'speaker_1': 'And I would also like to let you know that in San Francisco, the Sunshine Task Force, which is relatively equivalent or similar to the Open Government Commission in Alameda, they do not have a penalty clause like that at all.'",
        "'speaker_1': 'So it's something just to point out that they do not discourage public involvement. And perhaps we should also follow their lead. Thank you.'",
        "'speaker_0': 'Thank you. When we finish our public speakers, I'm going to ask the city attorney's office to comment on what exactly is before us this evening. And we have another public speaker.'",
        "'speaker_2': 'Yes, Jay Garfinkel.'",
        "'speaker_0': 'Good evening, Speaker Garfinkel.'",
        "'speaker_3': 'Good evening. I would second Commissioner Read's recommendation. My concern with the Open Government Commission and the Sunshine Ordinance is that while it made sense back around 2011, 2013, when the Sunshine Ordinance was created, it was aimed solely at enforcing the Brown Act.'",
        "'speaker_3': 'Since that time, we've all become aware of many issues that could use some more sunshine, but they are not related to posting of agendas. For instance, recently there was an error in an agenda and city staff went and changed what had originally been published.'",
        "'speaker_3': 'That's, um. That's uncalled for. Also, there are frequent additions to the agenda after its initial posting, and in the form, of course, it's finance. Now there is a number of people may submit correspondence over the ensuing two weeks and there's no notification given of the changes, the additions of the correspondence.'",
        "'speaker_3': 'There are any number of other items that need more openness and transparency. And I would suggest that we do what was what the Council did back in 2000, 11, 12, 13, whatever it was, create excuse me, create a citizens task force, just like you did for the police reform process.'",
        "'speaker_3': 'The difference I would make here is that I would have this meeting open to the public. I see no reason for secrecy. When discussing transparency, for instance, the ad hoc committee issue needs to be cleaned up. Most of what I've seen happening over the two years that the Sunshine Ordinance has been under scrutiny has been housekeeping.'",
        "'speaker_3': 'It's been items that restrict transparency. It makes the sunshine or the audit into the Open Government Commission almost useless. All it does is make sure that that agendas are published. Come on. That's not transparency. Yes, it should be done just as is required by the Brown Act.'",
        "'speaker_3': 'But there are a lot of things that go on in City Hall that the public is simply not aware of. And I think that a committee should be established to find out what the public wants to know and create a mechanism for doing that.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Any further public speakers, Madam Clerk?'",
        "'speaker_2': 'Joshua. I'll tarea Gualtieri Altieri MEP.'",
        "'speaker_0': 'Yes. Yes. Good evening. Speaker off here.'",
        "'speaker_3': 'Thank you, Madam Chair. This is my name is Josh Schulz here. I'm the community relations manager at the Housing Authority of the city of Alameda. And I want to thank everyone for their time. And today I'm announcing the opening of the housing voucher waitlist for both our housing.'",
        "'speaker_0': 'Project and Mr. Altieri. We're really excited to hear about that. I'm thinking you are probably not speaking about the Open Government Commission and the ordinance amending the Sunshine Ordinance. Yes, that's correct. If you could hang on really briefly for Matt to finish this item and the clerk will see that you were called on in oral communications, which'",
        "'speaker_0': 'is very shortly.'",
        "'speaker_3': 'All right. Thank you.'",
        "'speaker_0': 'It's very important, very important information you have to share. And we look forward to hearing from you at that time under oral communications. Thank you. Thank you. And to I have and I might add, Mr. Asteria has been a member of my vaccine task force and doing great work.'",
        "'speaker_0': 'Any further public speakers, Madam Clerk? And there's John.'",
        "'speaker_1': 'Lay.'",
        "'speaker_0': 'It really is you, Madam Clerk.'",
        "'speaker_2': 'No additional speakers.'",
        "'speaker_0': 'Okay. With that, I'm going to close public comment on item six. E continued from July 20th. I did want to ask for a little bit of clarification. As I understand it, there are specific provisions we are looking at this evening with regard to the comments of the first speaker about a penalty section.'",
        "'speaker_0': 'A person who makes two complaints in 12 months is that Mr. Lay. Mr. Shin, help us understand, if you will.'",
        "'speaker_3': 'I'm happy to, Madam Mayor. We do not propose any changes to that subdivision of the code. It is a carryover from, I believe, the original or near original, the Sunshine Ordinance. And I believe the intent there was to.'",
        "'speaker_3': 'Limit the amount of time that complaints complainants if they file unfounded complaints to limit the amount of work that the city's commissions and staff would end up doing with respect to unfounded complaints. We do not make any proposals in this particular round of ordinance changes before you tonight.'",
        "'speaker_0': 'Thank you. He went to Mr. Lay.'",
        "'speaker_3': 'No other than that, the I'm not.'",
        "'speaker_5': 'Sure that the Open Government Commission which had.'",
        "'speaker_3': 'An opportunity to properly that that issue as well.'",
        "'speaker_0': 'Thank you. All right. So and then the other one was I was going to ask the clerk. Madam Clerk, could you just tell me a little bit? There was some reference to correspondence may be added, may come in after the original agenda is published.'",
        "'speaker_0': 'Can you tell us how you handle that?'",
        "'speaker_2': 'Yes, gladly. So any additional correspondence that comes in, we attach to the agenda item and then as it's updated, if it it's continuing over days, that new new information is coming in. We basically put the date that it was updated and keep adding the most current new additions on the top so people don't have to scroll all'",
        "'speaker_2': 'the way to the bottom and then it can see it quickly and understand what's been added.'",
        "'speaker_0': 'And would you say that you often find that correspondence is coming in right up until the time of the council meeting?'",
        "'speaker_2': 'Yes, ma'am.'",
        "'speaker_0': 'All right. Thank you for those clarifications. Okay. Council motion discussion. Where are you? Calls over her. Eric Spencer.'",
        "'speaker_4': 'Thank you, Mayor. So I would like to know if it's possible to have the commission review that penalty that was raised during the public comments of a key member not being allowed to come back for five to file any complaint for five years.'",
        "'speaker_4': 'I think that's a pretty I don't know what that was based on, but I think in a court of law, you would not see that. And I think it's pretty extreme. So I would like to know the procedure of how to get us to look at to look at that again.'",
        "'speaker_4': 'And in regards to what I think is being proposed tonight under 2-9, 3.8 penalty subsection A, I have concerns in regards to the use shall. There's two places where it's used here.'",
        "'speaker_0': 'And tell us if you would tell us again where are you in this is.'",
        "'speaker_4': 'It's penalties is the name of the stats.'",
        "'speaker_0': 'So exhibit one the subcommittee's proposal.'",
        "'speaker_4': 'I'm looking at.'",
        "'speaker_0': 'Exhibit are you looking at? Exhibit one?'",
        "'speaker_4': 'Exhibit two.'",
        "'speaker_0': 'Exhibit two. Same as the newly installed commission proposal.'",
        "'speaker_4': 'Yeah. So that's. Yeah. Sorry. So that's what I was looking at. Sure. I think the same language might be in both. I'm not sure which one we're supposed to be looking at.'",
        "'speaker_0': 'That's okay. Which. And your section was two point.'",
        "'speaker_4': '92-93.8 in the title is penalties. Yes. A. Okay. Okay. So. That's third and actually fourth and fifth sentences I believe use the term shall where you have. If I'm reading this correctly, the Open Government Commission is making a decision that they think a decision needs to be reviewed.'",
        "'speaker_4': 'And then they're saying that such a. Let me see where the sentence is now.'",
        "'speaker_0': 'Mr. Shannon has his hand up.'",
        "'speaker_3': 'Council Member Maybe I could be of assistance in, in the fourth exhibit, which is the staff's draft ordinance. You're probably looking at 2-9, 3.8. And in the beginning the red line shows that the original body, the originating body, i.e. the City Council, will be required to consider the Commission's recommendation with the use of the word shall.'",
        "'speaker_3': 'I believe that's where you're directing us.'",
        "'speaker_4': 'Okay. So tell me which exhibit you think that.'",
        "'speaker_3': 'Is in the fourth exhibit. So in the audience.'",
        "'speaker_4': 'The audience is one minus.'",
        "'speaker_0': 'Instead of a third. It would be the third exhibit, isn't it?'",
        "'speaker_1': 'The audience minus the third.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'We don't have a fourth exhibit. The fourth item after staff report is updated correspondence.'",
        "'speaker_3': 'Oh, you know, if you the online version has correspondence as a third and audience is the fourth. And so depending, I guess on where you look in the third or the fourth exhibit.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'So what's called Ordnance Stash Sunshine, is that what you're referring to?'",
        "'speaker_3': 'Yes, I believe that's where Councilmember Spencer is directing us to where her concern is that the originating body shall consider the commission's recommendation.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'The original. Okay. Okay. Is that where you are? Councilmember Harry Spencer.'",
        "'speaker_4': 'It's the same language I think is very similar. But my concern is that I think it needs to be may consider the recommendation. I don't I have concerns about the commission dictating to council that we must consider their recommendation because in the interim as the in the interim, then they also suggest or say that council should keep'",
        "'speaker_4': 'the status quo. And so I don't understand in this correctly, you have a decision made by council, which we did while I was mayor in regards to cannabis. And there was the issue raised which I look to the city attorney and I asked if they thought the notice was sufficient.'",
        "'speaker_4': 'The city attorney says yes, and then we proceed with making a decision. However, in the meantime, then there's a change at council and it comes back. But I think if I'm reading this correctly, it would be that the council would have to follow the lead of the Open Government Commission and essentially void that decision, relook at it'",
        "'speaker_4': 'and then make a decision. So I think that this needs to be may consider, but I don't think it's appropriate if I'm interpreting it correctly or commission to be dictating to council what they have to do. I think not to make a suggestion.'",
        "'speaker_0': 'Okay. I'm going to ask I'm reading it a little differently, but I'm going to ask the attorneys. Mr. Shay. Mr. Lay, there's this language. The originating body shall be construed as the Commission's recommendation and render a final decision on whether to accept or reject the Commission's recommendation in whole or in part.'",
        "'speaker_0': 'But it would tell us a little bit about those 2 to 3 sentences. Really?'",
        "'speaker_3': 'Sure. Madam Mayor, Councilmember Spencer, we're happy to help. So in the example that Councilmember Spencer provided, the commission, for instance, would render a decision at the council. Decision enacting an ordinance is unlawful. Under this proposed language, the Council will be required to consider that recommendation, and it does not automatically mean that the Council's previous decision was void'",
        "'speaker_3': '. But you would have to agenda. Is it as soon as possible to consider the Commission's recommendation at that new council meeting? You may accept or reject the Commission's recommendation upon a majority vote, but you would be required to agenda as it and take action on the Commission's recommendation.'",
        "'speaker_3': 'If you changed it to May, then you may or may not consider the recommendation at your pleasure. To us, both of those are lawful approaches, and we would certainly take the Council's lead on which approach you prefer.'",
        "'speaker_0': 'Thank you. Any other councilmember, Harry Spencer, did you want to add anything to that or further questions?'",
        "'speaker_4': 'Yes, thank you. And then it continues on the subsection B of penalties, where, again, the city clerk manager, city attorney, as appropriate, shall promptly consider the commission's recommendation for counsel. I. So, again, I have concerns of the use shall throughout this section.'",
        "'speaker_4': 'And I really think that it's up to the council at that point, whatever council it is, to decide if they want to revisit an issue or not, and they can consider the Open Government Commission's recommendation. But I have serious concerns of the use of the word shall in both in both of those subsections.'",
        "'speaker_4': 'And I actually I think briefly, I think the city charter is very clear who has the power, the ultimate power. And I think it truly is council and not the commissioners, unless, in fact, there's a vote by the people to give that authority to the Open Government Commission.'",
        "'speaker_4': 'And I would question, I think, honestly, giving them power over words, telling us any time of the shall I think is a problem. Thank you.'",
        "'speaker_0': 'Okay. Thank you. The attorneys. Anybody want to? Weigh in on that.'",
        "'speaker_3': 'Madam Chair, we as you as you probably are well aware and Councilmember Spencer, we've had many meetings with the commission where the commission would have preferred to go much further than this. And at the end, this was compromised.'",
        "'speaker_3': 'We attempted to seek the maximum amount of compromise possible, given how far the commission was interested in going. If the Council wish to change the both shows, to me there are certainly no legal problems whatsoever and we can easily do it tonight.'",
        "'speaker_0': 'So if I'm understanding correctly, this pertains to public information. When there has been a complaint brought in, the commission finds that some there was some violation of providing public information. So may recommend to the city the steps necessary to cure or correct the violation city clerk, city manager and or a city attorney as appropriate to properly consider'",
        "'speaker_0': 'the Commission's recommendation and inform the Council of their final decision. Do we need another sentence that talks about what the what the Council then does with it?'",
        "'speaker_3': 'Not necessarily. Because on on the issue of public information, typically that's an administrative action. It's not the council doesn't typically take action on administrative actions. And so that's why we left this sentence in the cities, administrators versus the previous action where it's Brown Act violations, for example, when the council adopts an ordinance and that's why we included'",
        "'speaker_3': 'the council, the originating body, which includes the council. That's why the difference.'",
        "'speaker_0': 'Okay. Thank you. Okay. Other accounts from her. Spencer.'",
        "'speaker_4': 'Thank you. And thank you for asking that follow up question. So my concern would be what happens in our to open government makes a recommendation and then there's a time period before it comes to council. What happens to the council's decision that was made and now they're questioning the public access to the meeting?'",
        "'speaker_4': 'Does that decision continue moving forward or is it stalled?'",
        "'speaker_0': 'Mr. Chen.'",
        "'speaker_3': 'Yes. So the language provides that the city should be encouraged to maintain the status quo. So it will depend on the situation, largely the council by operation of law. The original council action is effective and so I'll give maybe a clear example.'",
        "'speaker_3': 'So for example, the council directed staff to lobby for a particular bill and there was only a month left before the session was going to end in that scenario. And if the staff do not lobby the council, the action will be nullified.'",
        "'speaker_3': 'In that scenario, it is more likely that staff would proceed, notwithstanding a commission decision, until the council reverses staff in a different scenario. Let's say the council directed staff to plant 1000 trees and it's going to take three years to plant those trees.'",
        "'speaker_3': 'Another two months delay would make no difference whatsoever. So in that scenario, I would imagine that staff would delay the planting of those thousand trees and then give the council the final say.'",
        "'speaker_0': 'Thank you. Other council members.'",
        "'speaker_3': 'Think.'",
        "'speaker_0': 'Okay. Do I have a councilwoman outside? I think can't go up.'",
        "'speaker_3': 'I think I simply wanted to thank all versions of the Open Government Commission that have given this consideration and city attorney Shen and staff, especially Mr. Lei, for their, I would say, very incredible hard work at trying to find a compromise that gets us to a place that provides some accountability at a certain point in time.'",
        "'speaker_3': 'May just allows the Open Government Commission to become even further a body that makes rulings but doesn't have that doesn't necessarily have impact on the way in which we do business. And I think that this language, with all the changes that have gone into it through the various public meetings, meets that compromise very admirably.'",
        "'speaker_3': 'It gives the city the flexibility whereby the harm from a finding is reduced, but also does give the public the ability to know that if if a finding of violation is found and there is the time to be here, that that it will be reheard and that that be cured at that point in time.'",
        "'speaker_3': 'So I'm ready to support it.'",
        "'speaker_0': 'So are you making a motion?'",
        "'speaker_3': 'Yes, sir. I will move approval of the of the ordinance as proposed by staff tonight.'",
        "'speaker_0': 'Okay. Do we have a second to that motion? And we'll continue with discussion. Vice mayor of L.A. We've got a second.'",
        "'speaker_1': 'I'll second if we can have time to discuss.'",
        "'speaker_0': 'Absolutely. Okay. We've had a motion by council in Oxford, seconded by Vice Mayor Vella. I think I saw Councilor it. Yes, I can go up. Is that correct? So what kind? Council member defect next, please. Okay.'",
        "'speaker_5': 'Well, thank you very much to the members of the public who have been involved in this, as well as the Open Government Commission members and our city staff. I, for one, would really like to hash this out even more.'",
        "'speaker_5': 'I'm not convinced of the language that we're seeing before us. The two areas of my concern let me focus on the first one, and we just had a brief conversation about that. It has to do with maintaining the status quo pending final review by the commission.'",
        "'speaker_5': 'So under this certain situation, as discussed by City Attorney Evenson and as asked by Councilmember Herrera Spencer if the city council makes a decision. That the Open Government subsequently finds troubling with regard to Brown Act or noticing or whatever under the current language that Lang the the decision of the city council.'",
        "'speaker_5': 'Should or should not move forward, depending on kind of the the immediacy of the issue as kind of outlined by city attorney even Chen. So if it's something as time sensitive of, say, you have to do something with regard to state legislation in those situations.'",
        "'speaker_5': 'Even if the Open Government Commission found something troubling with a council decision in those situations, the proposed language would allow the City Council to go ahead and move forward, even if the Open Government Commission found something troubling about that.'",
        "'speaker_5': 'In other scenarios, maybe there are some things that are kind of long distance in time. At that point in time, staff might defer to the to the Open Government Commission to delay a final decision. So here's here's the way that I see it.'",
        "'speaker_5': 'I think city staff needs to when they're putting together staff reports and agenda items, they need to factor in the the possibility that the Open Government Commission might have some questions with regard to how certain items are are noticed or gone through our Sunshine Act or or even the Brown Brown Act, the Sunshine Ordinance that is.'",
        "'speaker_5': 'So our city staff needs to kind of vet within before putting forward an agenda item. They need to do that kind of internal risk assessment and that should be done. I mean, if we're at a certain point where the Open Government Commission does find something that is troubling, I mean.'",
        "'speaker_5': 'Do we really want to move that forward, even if it's a time sensitive issue? Um, so I, I think in those situations, if the open government finds something troubling about something, then the City Council should revisit it and hold off on on finalizing its decision.'",
        "'speaker_5': 'So it should not be or should encourage the status quo, but it should be a must encourage the status quo. I think that's a critical part of giving our open government process effectiveness or or power, so to speak.'",
        "'speaker_5': 'So so I don't agree with that. The use of should encourage the status quo in cases where the Oakland government found something troubling with regard to the council decision. I think in cases where open government finds something that is troubling, the council should review that and hold off on on their decision, on executing their decision until having'",
        "'speaker_5': 'discussed it further. So that's less my viewpoint on that. The second point that I do want to talk about, what I'm concerned about is the idea that a person can't come back for five years. You know, I don't think that the situation in our open government is such that it's been so troubling where someone has just kind'",
        "'speaker_5': 'of mucked up the gears of the open government process. I don't think we've come to that situation. So I'm not convinced that that we have the reasons why we should impose such a drastic penalty at the end of the day.'",
        "'speaker_5': 'You know, if people want to come to city council, if people want to go to the Open Government Commission, that's their right. You know, if the Open Government Commissions don't like what they say or if they find them, you know, always raising things out there, just kind of mock up the gears.'",
        "'speaker_5': 'Well well, then the local government commission, I'm sure will will will act accordingly in their deliberations and their decision making. But I don't think we should be so heavy handed as to say, okay, well, if you have two things that are troubling and they don't pass muster.'",
        "'speaker_5': 'Well, now now you're you're, you know, put in the box for five years. I don't think that's fair. I don't think that's democratic. So, you know, let's let's let's let the people have their say, whether it's with the city council or with the commission.'",
        "'speaker_0': 'And council every day. I just want to remind you what Mr. Lay reminded us, that this issue may well come back before the Open Government Commission. We heard Councilmember Herrera Spencer ask that that happen, but right now it hasn't been vetted by the Open Government Commission and it since it's in the center, I propose that an earlier'",
        "'speaker_0': 'iteration of their body came up with it should be up to that body to reconsider. But I think that's what you're saying in not so few words, maybe.'",
        "'speaker_5': 'And that may very well be I'm just reiterating that that is just very drastic. But I think my key point is really the first point. I do think, you know, I agree. I was one of the first person to have concerns about the null and void power, because I just don't think the Open Government Commission has the'",
        "'speaker_5': 'power to declare things null and void. I don't think the charter gives them that power. So I, I'm going to have to say on that one to the Open Government Commission and to the public, I'm going have to say on that one, I'm going to have to go a staff.'",
        "'speaker_5': 'But on the matter of, you know, when when Open Government Commission challenges a council decision, I think those decisions should put be put in abeyance. They must be put in abeyance and it should not be should be put in abeyance.'",
        "'speaker_5': 'So that's where I am landing. So thank you.'",
        "'speaker_0': 'Thank you. Councilman, that's why. Did I see your hand going up again? No. Okay. Vice mayor of L.A.'",
        "'speaker_1': 'Yeah, I, you know. I'm going to be moving forward with the recommendations. I think that there have been several lively conversations with the GC. I do just want to put out there that I think we've had the ordinance in place for a decade, I think, or we're coming up on a decade.'",
        "'speaker_1': 'And you know, there may be a number of things that that, you know, looking back, we may want to change. This dog Sea and Sunshine Ordinance came about from large scale community conversation. And I think that there have been some proposals and differences of opinion about what may or may not be within the kind of the confines'",
        "'speaker_1': 'of the city charter. And certainly I think that if our constituents are interested in seeing certain things change and there's proposals to take action, whether it be through amending the charter or looking at different alternatives, I'm sure that we will have a robust community conversation on that.'",
        "'speaker_1': 'And I think that looking back after having this in place for for a number of years, this is a good time to do that, to say, is this working? Is this not working? But in the meantime, I think that there's been a tremendous amount of effort that has been put into the language before us tonight.'",
        "'speaker_1': 'And I'm prepared to support it. And I know I want to thank all of the volunteers who have served on the LGC over the years that this this item in particular has been discussed at length and proposals have been put forward.'",
        "'speaker_1': 'I know that there's been a substantial amount of time put into this and that, you know, there might not always have been agreement. But certainly I think everybody came from a place of wanting to have a better ordinance before the city and something that will make sure that we are being as open and transparent as possible.'",
        "'speaker_1': 'But I do want to encourage, you know, as the council, the city staff, the community, if we want to have a forum for a larger discussion on what open government really means, I think that, you know, we should have that and we can look at the different provisions and what the different options are.'",
        "'speaker_1': 'But that's not agenda tonight. And so I don't want to get into the specifics of what could or could not be proposed. And I want to thank everybody for their work on this.'",
        "'speaker_0': 'Thank you. Okay. With that, I think we've all been heard from maybe we have a roll cover, please.'",
        "'speaker_2': 'Sorry. Councilmember de thug?'",
        "'speaker_5': 'No.'",
        "'speaker_2': 'Herrera Spencer. They're not quite.'",
        "'speaker_3': 'High.'",
        "'speaker_1': 'Vela.'",
        "'speaker_2': 'Mayor as he Ashcraft.'",
        "'speaker_0': 'High.'",
        "'speaker_2': 'Net carries 3 to 2.'",
        "'speaker_0': 'All right. Thank you. Thank you, everyone. Thanks. And Mr. Lay, Mr. Shan. All right, so with that, I am going to adjourn the continued July 20, 2021 City Council meeting, and I will open the regular City Council meeting of September seven, 2021.'"
    ],
    "Mayors Nominations for Appointment to the Golf Commission, Housing Authority Board of Commissioners, and Library Board.": [
        "'speaker_0': 'All right. Thank you. Thank you, everybody. With that, I'm going to very quickly introduce you to my nominees for the golf commission, which is one position and two nominees for the library board. You will have a chance to meet them and vote on them at our September 21st meeting.'",
        "'speaker_0': 'And I am elated at what a robust response we have had to announcements of opening on our boards and commissions. People really want to get involved in their community and we have a tremendously talented, very generous community. So I am delighted to nominate Robert Lattimore to the Golf Commission.'",
        "'speaker_0': 'Mr. Lattimore is about to retire, but he has been working in finance, helping low and moderate income businesses and individuals build their businesses and be successful. And he also has been involved in the first tee program with minority young golfers for many years.'",
        "'speaker_0': 'He has experience as a PGA marshal at Pebble Beach and also a U.S. Golf Association scorer. He he didn't grow up playing golf and but he started in college and never put his clubs down since then. Then he, I think, will just bring a lot to the golf commission and really excited to nominate Mr. Lattimore.'",
        "'speaker_0': 'And we have two openings to fill on the library board and I am nominating Miss Dimple Kanji and she is by profession. She's a pharmacist. She actually works at CVS in Alameda where she tells me she's been given lots of COVID vaccines.'",
        "'speaker_0': 'Hooray for you as a 16 year resident. And she is the mother of a kindergartner and fourth grader who are very involved in the library and library programs and just have participated in all kinds of programs. And she has a lot of great ideas for making the library more accessible to everyone, including geographically, including out in the'",
        "'speaker_0': 'the West End, where maybe something like a bookmobile out at Alameda Point might be a way of bringing the library to people who can't come to the library. And then I'm also nominating Miss Sarah Strickler, who's a works for Google as a a service designer, and that's a designer of people's experience with various products.'",
        "'speaker_0': 'And and she spent a lot of time looking at case studies about libraries, how to make them more user friendly, how to make them more efficient and friendly to the staff, to all users, and.'",
        "'speaker_1': 'Just lots.'",
        "'speaker_0': 'Of enthusiasm. I love the fact that she's a Googler and she's young and all that, but she loves to just go and sit in the library and read books, actually flip the pages and read books, including cookbooks as a way of relaxation.'",
        "'speaker_0': 'So thank you. That is those are my nominations to the Golf Commission and the Library Board. It is my fervent hope that I will have a nominee for the Housing Authority Board and also nominees to fill the positions.'",
        "'speaker_0': 'Vacancies that are coming up on our Commission on Persons with Disabilities when we meet next time on September 24. So thank you very much, everyone. And now we will move on to proclamations and special orders of the day.'",
        "'speaker_0': 'And so I have a special announcement I want to share with you or news, I should say, which is I know you're aware we're Californians. We know that it seems like half our state is on fire. And there's been some really massive fires and fires that have joined fires and gotten even larger.'"
    ],
    "Recommendation to Authorize the City Manager to Execute a Six-Year Agreement with Eden Information & Referral, Inc. for an Amount Not to Exceed $700,000 to Provide a Transportation Network Company (TNC) Concierge Service as Part of the Citys Paratransit Program. (Planning, Building and Transportation 20941741)": [
        "'speaker_2': 'That carries by five eyes.'",
        "'speaker_0': 'Thank you, Madam Clerk. We move on to item five E. And do you want to introduce this, Madam Clerk?'",
        "'speaker_2': 'A recommendation to authorize the city manager to execute a six year agreement with Eaton Information Referral for an amount not to exceed 700,000 to provide transportation, network company concierge service as part of the city's paratransit program.'",
        "'speaker_0': 'Thank you. Mr. Levitt, I see that this item comes under planning, building and transportation. I really like the magic that goes on behind the scenes here. And like magic. Planning, building and transportation director Andrew Thomas and very capable member of the staff has titles I always get wrong.'",
        "'speaker_0': 'But Gayle Payne Hi there. And Alison DeJong have all appeared. So why do we do this? Why don't we see what council member. Welcome, all of you. They just keep coming. Hi there. Let's see what Councilmember Herrera Spencer's questions are.'",
        "'speaker_0': 'And then you can whichever one of you or a combination thereof can answer them. Councilmember Harry Spencer moving this right along.'",
        "'speaker_4': 'Thank you, Mary. So I had spoken with city manager Eric Levitt in regards to this item in advance, but I think it's important for the public to have an idea of what this item is about. So that's why I called it.'",
        "'speaker_4': 'It speaks to using Uber and Lyft as a transportation network company for the parent, for paratransit is my understanding. And I had had questions in regards to the vetting of the Uber and Lyft drivers and how you know more about this pilot program and if there's going to be special training or how this is actually going to'",
        "'speaker_4': 'work so that the needs of the people that utilize the paratransit are still met using Uber and Lyft drivers.'",
        "'speaker_0': 'Thank you. Who wants to take that one? Mr. Thomas, your unmuted or Ms.. Payne, whoever.'",
        "'speaker_3': 'I'm going to pass it off to Gail. The expert.'",
        "'speaker_0': 'Ms.. Payne, the.'",
        "'speaker_1': 'Expert.'",
        "'speaker_0': 'Hi. Hi. Well.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_0': 'Madam.'",
        "'speaker_4': 'Mayor, and members of the City Council. It's a pleasure to be here. We're also joined by Alison DeJong of Eden Iron, our and our.'",
        "'speaker_1': 'Third party provider that we're recommending.'",
        "'speaker_4': 'And the reason why we're recommending them is.'",
        "'speaker_1': 'To provide is what we're asking you all to approve. Tonight is.'",
        "'speaker_4': 'A TNC concierge.'",
        "'speaker_1': 'Program.'",
        "'speaker_4': 'And the the program that Eden INR will act as.'",
        "'speaker_1': 'The third party provider so as to book the trips for our community members, as well as monitor them and evaluate them. So holding their hands through the whole process from beginning to end of the trip.'",
        "'speaker_4': 'And so we really do feel like.'",
        "'speaker_1': 'That this and this program targets our most vulnerable population, those who are physically disabled, using East Bay paratransit, low income people who have difficulties using AC transit. And so they need curb to curb transportation. And so these folks, Eden INR, will help with that from beginning to end of that trip, making sure it's a successful trip.'",
        "'speaker_1': 'And this is taking the place of the former taxi subsidy program. And so this is the new way of doing it, where we actually were quite risk averse at it.'",
        "'speaker_4': 'We're one of the.'",
        "'speaker_1': 'Few jurisdictions who is not doing some type of TNC subsidy program because we really did hold back until things settled down with Uber, Lyft. So we do feel like this is the right time and we're actually getting pressure from the city to do this.'",
        "'speaker_1': 'And that concludes my remarks.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. And Mr. John, did you want to add anything to that? And by the way, I just want to express huge gratitude for all the work that Eden INR does. I don't know if everyone realizes how many important services you provide that do you want to speak briefly to the questions that were raised by the Council'",
        "'speaker_0': 'member and add on to anything that. Ms. PAYNE.'",
        "'speaker_1': 'Major Sure. Mayor. Thank you and thank you. Councilmembers. I always appreciate your your understanding and support of each minor and the two on one program, especially the since the pandemic started. It's some it's been a lot so very grateful to provide that service to the community.'",
        "'speaker_1': 'I just wanted to add, just to make council aware that we have been operating.'",
        "'speaker_2': 'The similar TNC program for the.'",
        "'speaker_1': 'Studio where it launched. We've been doing it for just over a year. It launched July 1st of the prior fiscal year. As Ms.. Payne said, most of the other cities.'",
        "'speaker_2': 'In Alameda County have similar.'",
        "'speaker_1': 'Some of the other cities are using a for profit company called Gogo Transfer that does a very similar sort of third.'",
        "'speaker_2': 'Party.'",
        "'speaker_1': 'Thing. We are very grateful to the City of Hayward and are hopeful that Alameda will follow suit in that. I could go at great length of the relationships.'",
        "'speaker_2': 'That we have with our.'",
        "'speaker_1': 'Clients. And in addition, it's sort of a natural fit because we.'",
        "'speaker_2': 'Also can provide the same.'",
        "'speaker_1': 'Callers who often need that kind of third party assistance with their rights, their joint often need services that we can then connect them and make referrals from the two other ones. So it's sort of a holistic, a holistic approach.'",
        "'speaker_1': 'I know that there are valid questions and concerns regarding Lyft and Uber with.'",
        "'speaker_2': 'Specifics regarding liabilities and things like that. The City of Hayward City Attorney has.'",
        "'speaker_1': 'Offered to connect with Alameda.'",
        "'speaker_2': 'City Attorney to answer very.'",
        "'speaker_1': 'Specific questions.'",
        "'speaker_2': 'I unfortunately can't get I don't I can't speak to.'",
        "'speaker_1': 'The sort of liability issues, but I just wanted to give that.'",
        "'speaker_2': 'Overview on and I'm happy to answer any.'",
        "'speaker_1': 'Sort of programmatic questions about.'",
        "'speaker_2': 'How it's working, how the Hayward.'",
        "'speaker_1': 'Program is working. And Lawson Borough also is our new transportation manager who can answer sort of logistic questions if that comes up.'",
        "'speaker_0': 'All right. Thank you. Thank you so much, Councilmember Herr Spencer.'",
        "'speaker_4': 'Thank you. So, first of all, the use that this TNC, I want to make sure the public is aware that means transportation network company. I would like to know how these. So as I have taken over, I have had not always the best experience.'",
        "'speaker_4': 'So I am I would like to know how the drivers are being vetted and monitored and if there is a way for feedback from the consumer after each ride or how we get feedback to make sure if they have a bad experience, how that is reported and taken into consideration.'",
        "'speaker_4': 'This is for a six year contract. I'm concerned about saying for six years we're going to be using Uber and Lyft instead.'",
        "'speaker_0': 'Who would like to answer that one? So. Mr. PEREIRA.'",
        "'speaker_1': 'Yeah. I wanted. Yeah. Yeah. Lobster, would you answer that? And I did want to say I will say that this came up.'",
        "'speaker_2': 'In the city commissioners, this sort of concern about.'",
        "'speaker_1': 'The feedback loop. We have actually heard that and we've incorporated that into one of the goals for our Transportation Department in this current fiscal year to implement a more robust feedback loop that we can get from clients. But Lampson wanted to talk about the driver qualifications.'",
        "'speaker_3': 'Yes. Good afternoon, everybody.'",
        "'speaker_0': 'Hello.'",
        "'speaker_3': 'My name is Leibsohn. Yeah. So what differentiates us and the Transportation Department from anybody who just uses the lift on their own is it's just the attention that we provide. It's an extra special security for the client. Not only do we provide excellent customer service, but as soon as the client reaches out to the Transportation Department, our'",
        "'speaker_3': 'average pickup is pickup line is at 12 seconds, so they don't have to wait too long. And to answer the question regarding the drivers, we would Uber and Lyft, we have special accounts, what they're called health accounts. And what differentiates this from normal accounts is that we are provided we're only 4.0 out of 5.0 star drivers in'",
        "'speaker_3': 'addition to any any issue that happens during the ride. We. There is a way that the client can reach back to us, you know, just by dialing two, one, one. In many occasions, if there is any issue that arise, any critique or any feedback, we do rely it to her and.'",
        "'speaker_3': 'In the contrary to me, you see my public account. I get feedback from Uber or Lyft in less than 30 minutes. So that's definitely a special attention from Uber and Lyft. Given these accounts. In addition, we have many success stories from the past year that we serve as the city of Hayward.'",
        "'speaker_3': 'Where are our staff? You know, it doesn't necessarily focus just on dispatching rights, but it all reviews and supervises the right of the client from the beginning until the end, right into the end of the ride. And if there's any discrepancies or any any suspicious activity on the way, like, for example, the driver hasn't moved there.'",
        "'speaker_3': 'A couple of minutes we'll reach out to our client and we'll make sure that they're safe. We get we get confirmation from them.'",
        "'speaker_0': 'Thank you very much. Okay. Miss Painted, you want to ask anything? I didn't know if I saw your hand going.'",
        "'speaker_1': 'Oh, it wasn't. But I do want to just say that there are some jurisdictions that do not use a third party provider at all and just work directly with TNC IDs. And so we're adding that extra layer of security because we do want that our most vulnerable population to have that hand-holding.'",
        "'speaker_0': 'Okay. Thank you. Councilmember Danzig.'",
        "'speaker_5': 'Yes. I just want to briefly say that I'm very pleased that the city of Alameda is working with Eaton in AH, as well as Uber and Lyft, largely because Eaton and Ah has a long history of providing social mental health referrals.'",
        "'speaker_5': 'Many years ago, when I worked with a nonprofit affiliated with the United Way of the Bay Area, with what was called the Northern California Council for the Community in Air was an incredible resource. So when we're talking about two, one, one, what we're talking about is the very people who are asking for transportation services, very low income'",
        "'speaker_5': 'household. We're now in a position to also kind of deliver information to types of services they need, whether it's for affordable child care, whether it's for, you know, food, accessing the food. I mean, this kind of information, I think it's not it's not available as an one stop area.'",
        "'speaker_5': 'So I think this is a great opportunity. I'm confident that the city of Alameda will put in safeguards so that we don't have the type of bad things that sometimes we hear about. Nothing's going to be perfect, but but I think we're going to be very careful as to how we move forward.'",
        "'speaker_5': 'And I look forward to the city of Alameda working with Eaton and our on this project as well as Great.'",
        "'speaker_0': 'Would you like to make a motion on that, Councilmember?'",
        "'speaker_5': 'I'd like to move the staff's recommendation.'",
        "'speaker_0': 'Perfect. We have a second Councilmember Knox seconds for comment. Of course you can.'",
        "'speaker_3': 'Thank you. I just want to thank and Gail knows this. I'm not the world's biggest fan of chances and Uber and Lyft in the general place. But if there is one place that she and I have talked for many years and that I have come to believe they have a really great use, it is literally this use'",
        "'speaker_3': '. And I so I just want to second everything Councilmember de SAC said and thank staff for bringing this forward. I think it's a really good use of this model.'",
        "'speaker_0': 'Thank you so much. Best mayor of L.A..'",
        "'speaker_1': 'I'm not going to be supporting this tonight. I have a number of concerns about the liability issues. I also have concerns about two of the companies specifically. I do think that we need to find a way. And I do hope in the future we can find a way to partner to make sure that we're taking care of'",
        "'speaker_1': 'our vulnerable community members. But I don't want to do it at the expense of workers not getting things like workman's comp and that sort of coverage. So that's my concern and that's why I won't be supporting this tonight.'",
        "'speaker_1': 'But I do also very much appreciate the work that he and I in our does. I support working through them and with them to make sure that we have that kind of stuff, that our constituents have the ability to speak with somebody and have basically a kind of a concierge service where they can get the feedback and'",
        "'speaker_1': 'make sure that they can talk to somebody. I just don't feel comfortable at this time supporting this particular rendition of it.'",
        "'speaker_0': 'Thank you. Okay, everyone, it's Councilmember Hirsh. Spencer.'",
        "'speaker_4': 'So I would like can staff confirm that these drivers are part of the that they would not have those benefits that the vice mayor just raised.'",
        "'speaker_1': 'So there are.'",
        "'speaker_0': 'There's been a decision, a court decision that the city attorney can probably further go into actually challenging. I think the. What is it?'",
        "'speaker_1': 'I'm 22, I think.'",
        "'speaker_0': 'Yeah. Okay. But this is. I would actually like to take a vote on this. We are only partway through the list of items you pulled, Councilmember Harry Spencer and it's almost 22 nine and we haven't gotten through the consent calendar.'",
        "'speaker_0': 'So I propose that we take a vote. This will either pass or it won't. Councilmember, Herr Spencer.'",
        "'speaker_4': 'Thank you. I'd like to make a friendly amendment to include an annual update, at least the first year, to see how it's working since it's a six year contract. Including the feedback from the population being served.'",
        "'speaker_0': 'Maker of the Motion. Councilmember de Saka, you are right with annual reports added to.'",
        "'speaker_5': 'Well, you know I want to defer to staff on how to staff feel about that. And and. Yeah.'",
        "'speaker_1': 'Maybe it's already in the staff report that we're already going to have for writing it. Perfect.'",
        "'speaker_0': 'Thank you. All right, then. Draw cover, please, Madam Clerk.'",
        "'speaker_2': 'So my prediction for Spencer.'",
        "'speaker_4': 'I don't believe staff answered my question, and I think it's procedurally incorrect to call the question without a motion to call the question.'",
        "'speaker_0': 'She said it was in the staff report. You're concerned about the annual report?'",
        "'speaker_4': 'That was one question. My other question went to the vice mayor's concerns, if that's correct, that these employees did not have the benefits that she articulated. We did not allow an opportunity for staff to confirm or.'",
        "'speaker_0': 'We talked about Prop 22 that it's been challenged, that it may be overturned, that that's in the courts, not before this council. And that's why I know just from following the news.'",
        "'speaker_4': 'I'm not I'm not planning to I'm just asking because they have their own way of doing it that could very well have added benefits or not.'",
        "'speaker_0': 'So you are asking about Prop 22. It it that's exactly what it covers. And in fact, it's an Alameda County judge who overturned it, but it still has to go to a higher court. But it may be I mean, this is way off of what we're discussing.'",
        "'speaker_0': 'I'd support overturning it, but it's we're not there yet. Councilmember Knox. Right. I think I saw your hand up.'",
        "'speaker_3': 'I was just going to say the answer is yes. Councilmember Vella is correct. They do not have those. It's possible if the courts move forward that they could get them in the future.'",
        "'speaker_4': 'Thank you, Councilmember. And I will be voting no.'",
        "'speaker_0': 'All right, so back to the roll call vote.'",
        "'speaker_2': 'CLERK Councilmember Nextbite.'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'Fella. No mayor as the Ashcraft. Yes, that carries 3 to 2.'",
        "'speaker_0': 'Thank you. Okay. Thank you all for being here. Nice to see you always, Mr. Zhang. Nice to meet you, Mr. Brewer. Thank you so much, Ms.. Pain. And hello, Ms.. Chan. Okay, let's try to keep moving along. We've got item five.'",
        "'speaker_0': 'I was pulled.'",
        "'speaker_1': 'Correct.'",
        "'speaker_2': 'And that's a recommendation to authorize the city manager to execute a First Amendment with Ackerman, similar to the exhibit one attached for federal legislative services for a term of 13 months with two when your options to extend an amount not to exceed 97,500 for a four year term, not to exceed 3667 500.'",
        "'speaker_2': 'And an agreement with your.'",
        "'speaker_0': 'ADC.'"
    ],
    "Recommendation to Authorize the City Manager to Execute a First Amendment with Akerman LLP, Similar in Form to Exhibit 1 Attached, for Federal Legislative Services for a Term of 13 Months with Two One-Year Options to Extend, and Compensation for the First Amendment Not to Exceed $97,500 and Total Four-Year Compensation Not to Exceed $367,500; and \nTo Execute a First Amendment with Clear Advocacy, LLC, Similar in Form to Exhibit 2 Attached, for State Legislative Services for a Term of 12 Months with Two One-Year Options to Extend, and Compensation for the First Amendment Not to Exceed $90,000 and Total Four-Year Compensation Not to Exceed $322,500 (City Manager 10021030)": [
        "'speaker_2': 'In a form similar to exhibit two for State Legislative Services with the term of 12 months with two to when your options to extend and compensate the First Amendment not to exceed 90,000 and a total for your compensation not to exceed 322 500.'",
        "'speaker_0': 'Perfect. Go ahead with your questions, Mr. Spencer. Thank you.'",
        "'speaker_4': 'Mayor. So I brought this because it actually is a purchase shared. It's two separate contracts and I would request that the item be bifurcated because I would like to be able to vote yes for the federal lobbyist Ackerman LLP, but not for the clear advocacy for the state.'",
        "'speaker_0': 'Okay, we can do that. Let's bifurcating. Okay. Do we have a motion to recommend authorizing city manager to execute the First Amendment with Ackerman LLP? That's our federal lobbyists.'",
        "'speaker_1': 'So.'",
        "'speaker_0': 'Okay, I think I heard Vela and Knox White in that order. What kind of simultaneously. Okay, so it's been moved. It's been seconded. May we have that motion, that roll call vote, please, Madam Clerk.'",
        "'speaker_2': 'The data.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Represent there. I knocked right.'",
        "'speaker_1': 'By.'",
        "'speaker_3': 'Your.'",
        "'speaker_1': 'File. I may as the Ashcraft high.'",
        "'speaker_2': 'Net carries by five eyes.'",
        "'speaker_0': 'All right, now I have a motion to authorize the city manager to execute a First Amendment with Clear Advocacy LLC, and that is our state lobbyist legislative services motion.'",
        "'speaker_3': 'So moved.'",
        "'speaker_0': 'Councilmember Knox White has moved desk has seconded. That was the second. Oh, I'm so sorry. Okay. Okay. As seconded by counsel by Vice Mayor Vella. Okay. Discussion was at your hand up. Councilmember Desai.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_5': 'Quick discussion. Thank you very much. Quick discussion is that I believe that there was a list of items that was to be on the state menu of things for the advocacy advocate to look into. And I think there are several things that I did not support.'",
        "'speaker_5': 'So I will continue by voting. No, thank you.'",
        "'speaker_0': 'Okay. All right. Is that what you were going to say, Councilmember Spencer? Yes.'",
        "'speaker_4': 'And specifically, I want to express a concern for having them look into the California Surface Lands Act and try to get the city to have a work around it. I really don't I really think it should apply. I don't think we should be contesting the use of it at this point, because I think it really goes to'",
        "'speaker_4': 'providing affordable housing. So I'm.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'That got it. Thank you. May we have a roll call vote, please?'",
        "'speaker_2': 'Thursday.'",
        "'speaker_5': 'No.'",
        "'speaker_2': 'Her Spencer Knox. Fine.'",
        "'speaker_3': 'Hi.'",
        "'speaker_2': 'Bella. I may or as the Ashcroft I. That carries 3 to 2.'"
    ],
    "Recommendation to Authorize the Purchase of Six Vehicles Consistent with Revised Vehicle Replacement Policy in Amounts Not to Exceed $93,377 from Freeway Toyota for Three Hybrid Vehicles, $74,984 from Cromer Material Handling for Two Forklifts and $311,598 from Leader Industries for One Ambulance. (Public Works 60141581)": [
        "'speaker_0': 'All right. Thank you. Okay. So now we move on to item five. And as in Nancy and this is a recommendation to authorize the purchase of six vehicles. Madam Clerk, I will spare you the agony of.'",
        "'speaker_1': 'All of that.'",
        "'speaker_0': 'Because actually. Aaron Aaron Smith, Mr. Smith, our public works director, delineated those. So. Mr. Spencer.'",
        "'speaker_4': 'Thank you. So I just want to jump to the reason I have a concern on this is that has $93,000 for to go to freeway Toyota for three hybrid vehicles. And that company is in Hanford and it apparently is from the state of California, somehow the one that we're supposed to work with or unless we do a'",
        "'speaker_4': 'bid for it. And my concern is that how do we know for sure that there weren't any more local Toyota companies that could provide these cars at the approximate? It looks like three for $31,000 each. This.'",
        "'speaker_0': 'Yes, that's a good question for you. And I see first, Heidrich, is that individual somehow related to this.'",
        "'speaker_2': 'Item or is it as our supervisor?'",
        "'speaker_0': 'Oh, fleet supervisor. Okay. I'll Miss Smith or Mr. Heidrick. Why are we using freeway Toyota? Is this a state program, a state purchase program? Mr. Leavitt, do you want to anybody? Let's move quickly.'",
        "'speaker_3': 'There's this Air Force camp. There's a state bid winner for these types of vehicles.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'Yes. Good. Good evening. Good evening to mayor and council. As our city manager stated, yes, these are all state contracts, specifically C mass, which is conducted by DGS in Sacramento and we have referenced those to purchase these vehicles.'",
        "'speaker_3': 'So all of the bidders are California companies dealerships. We did not reach out locally per the fact that many of these vendors bid these state contracts and they're because of that, they're moving a high volume of vehicles and they get a better price reduction from the manufacturer.'",
        "'speaker_0': 'Thank you. Great explanation. All right. Any further questions, Casimiro? Spencer.'",
        "'speaker_4': 'So I appreciate that answer. But in regards to these are Toyotas, so I'm not sure that we cannot go to a local. Right. So that's what I'm trying to get to.'",
        "'speaker_1': 'Yeah. There's a no one can.'",
        "'speaker_4': 'Sell the Toyota's local more locally at 1000 the car.'",
        "'speaker_3': 'Yeah. So the reason we don't generally perform a an RFP that we would put out locally and we do take advantage of a state contract or a conglomerate of purchasing or a piggyback is that generally most dealerships, unless they are operating a fleet department, are focused on selling vehicles to the general public.'",
        "'speaker_3': 'They make a lot more money when they do that, when they sell fleet vehicles, they make substantially less on individual vehicle sales. And it's the total number of vehicle sales is where they make their profits. So case in point, with this vendor, they will sell a lot of these vehicles and they will get this at a reduced'",
        "'speaker_3': 'price from Toyota. We could reach out to a local vendor, but most likely they're not going to want to sell a vehicle far under what they could sell it to the general public for. Thankfully, there's a sign. Staff.'",
        "'speaker_0': 'Thank you so much.'",
        "'speaker_1': 'Okay.'"
    ],
    "Adoption of Resolution to Increase Expenditure Appropriations in the American Rescue Plan 2021 Project (96034/C9930) in the Capital Projects Fund (310) by $23,625 for the Feed Alameda Program to Provide Alamedas Most Vulnerable Residents with Hot Meals and to Provide Support to Alameda Restaurants (Community Development 24161823)": [
        "'speaker_0': 'Okay, great. Let's. Does anyone want to make a motion? 11 Council member Desert Moves Council Member Knox White. Second. Thank you. I just read your mind. We have a roll call vote, please.'",
        "'speaker_2': 'Councilmember Dayton.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Earl spencer.'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'That's why.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Rella mayor as.'",
        "'speaker_1': 'Ashcraft.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'That carries by 4 to 1.'",
        "'speaker_0': 'Thank you, madam. Okay. Last pulled item is 250, which is the option of resolution to increase expenditure. Appropriations in American Rescue Plan 2021 having to do with additional moneys for the Feed Army program. This is under community development and the city manager's office has also been involved.'",
        "'speaker_0': 'Specific questions council for her Spencer.'",
        "'speaker_4': 'So my question goes to and I had shared this with the city manager in advance one and one restaurant or food provider in town was excluded from the program because they don't serve hot meals. They only serve a cold meal, whatever that is.'",
        "'speaker_4': 'And I think many of us I certainly have meals that are so I didn't know if that's actually part of the program or if the city has discretion. I think many of us I certainly do eat meals that are not hot all the time, salads, for instance, sandwiches.'",
        "'speaker_4': 'And so I want to know if that's actually part of the program or if we have flexibility to include that other local company that applied. Hmm.'",
        "'speaker_0': 'Who would like to answer that? I see our community development director, Lisa maxwell, out there at the ferry terminal. However, is Maxwell, do you want to. Are you prepared or. Lewis Butler two. Hi, who's been nice to you?'",
        "'speaker_0': 'Also from community development, economic development, who has been very intimately involved with the Feed our meter program, including, I think, delivering some of those meals. Do you want to speak to the requirements and such? Ms. Butler.'",
        "'speaker_1': 'Sure. Thank you. Good evening, Madam Mayor. And City Council. The program did call for hot meals, and that's why one of the restaurants was excluded. But to answer Councilmember PEREIRA Spencer's question, if you would like us to include them, we could also include them.'",
        "'speaker_1': 'But they they they indicate they cannot provide.'",
        "'speaker_0': 'And I will just throw in, because I had a little something to do with this program that, as I recall, the guidelines were those that they are set forth by the U.S. Department of Agriculture, I believe, or the state maybe Department of Agriculture, great plates.'",
        "'speaker_0': 'And it was similar to that criteria, though, that you had to have some fresh fruits and vegetables and couldn't include sugary drinks and there's nutritional requirements.'",
        "'speaker_1': 'So and it was the middle of winter when we started the program as well.'",
        "'speaker_0': 'That that's a good point. Yeah.'",
        "'speaker_4': 'So some of them may continue. So the fresh fruit, vegetables that you just mentioned, obviously those can be done on a salad and heated. And so I would like to make a motion to accept this. But I also think that one restaurant that provides cold, cold meals, as long as they satisfy all the nutritional requirements are met'",
        "'speaker_0': '. And so you would also be approving whatever additional expenditure it takes to provide. Ms.. Butler, remind us how many meals at a time were our restaurants providing you?'",
        "'speaker_1': 'Five. Again, we upped the amount because of the need.'",
        "'speaker_0': 'We were we were very successful. It was very popular. And it is a wonderful program. I'll just give a little shout out that not only did it help give our local restaurants a lifeline, especially while they were really struggling with, there were times when they could only do takeout and delivery, but it provided some wonderful, tasty, nourishing'",
        "'speaker_0': 'meals to some of our most vulnerable who are enumerated in the staff report. Councilmember Knox. But I saw your hand up.'",
        "'speaker_3': 'All right. And I guess since it's a theme for tonight's meeting, we're now discussing program design and selecting specific entities for and giving direction on an expenditure approval. I just wonder if we're yet again getting out. I know it says hot meals in here, but we're talking about adding giving direction to staff about specific program design and'",
        "'speaker_3': 'when we're actually just being asked to approve an appropriations request. So I'm just not sure we're not getting a little bit off the content account again.'",
        "'speaker_0': 'Yeah, I think we're pretty close. I but my point is there's a specific dollar amount of appropriation we're being asked to provide and it would be increased a little bit to add that meal. So if there's the way we could fashion a motion to include that flexibility, I think it would be for a worthy purpose.'",
        "'speaker_4': 'Be happy to include the additional cost for the one meal.'",
        "'speaker_0': 'Okay. Madam Clerk, with that motion amended, motion clear enough for you.'",
        "'speaker_2': 'As long as staff can amend the resolution accordingly. I believe for clear.'",
        "'speaker_0': 'Vice Mayor. I'm reading from your facial expression that you have questions.'",
        "'speaker_1': 'Yeah. I just you know, we started this this meeting earlier. We were talking about, you know, the Open Government Commission and making sure that we have transparency. And I'm just concerned, you know, if it's possible to approve this and then if we could just give direction to staff to come back, perhaps.'",
        "'speaker_1': 'You know, concerns that you have. Yeah, that I would I would feel more comfortable doing that.'",
        "'speaker_0': 'I think that's a good observation, I think. Councilmember Knox. Right. I you're right. You're very, very correct. We've we've heard from the Open Government Commission. We don't want to be inviting another Open Government Commission complaint. So I think the safest thing well.'",
        "'speaker_0': 'Attorney, I'm just going to read everyone's facial expression. City Attorney Mr. Chan, why don't you weigh in on this?'",
        "'speaker_3': 'For if the council wishes to make changes, it has to be an expenditure change. So for example, you could tonight change the resolution dollar amount. Right now it says what it says. If you want to add $2,000 or whatever it is, that's fine.'",
        "'speaker_3': 'That's perfectly within the council's purview. Staff doesn't need to bring it back. If you want to make programmatic changes, you probably want to just give a side direction to staff and Bill respond accordingly, possibly bring it back, possibly work within your existing budget.'",
        "'speaker_3': 'But what you're asked to approve tonight is funding for the program. And if you want to increase funding, you can do it tonight.'",
        "'speaker_0': 'We could modify that funding amount and you feel that the noticing is sufficient, such as it would not invite a complaint from the see?'",
        "'speaker_3': 'Well, anything could invite a complaint from the city. So if even a perfectly correctly agenda item could invite a complaint, but I believe that we could adjust. You could change funding because that is what your agenda is to do tonight and which is to fund.'",
        "'speaker_3': 'And if you want to give more money or less money, this is your time to do it.'",
        "'speaker_0': 'And I will add that this program is coming to its conclusion. But Vice Mayor Vella, I see your hand up.'",
        "'speaker_1': 'I was just going to ask if we added additional funds. That doesn't necessarily guarantee that there is a change to the program requirements. And so there would still need to be direction or side direction to have that come back to us.'",
        "'speaker_1': 'My concern is my concern is twofold. One, what happens if we allocate the funds here? Is there a way to word it such that if we can't make the change in time? The the funds go, you know, at what point do they come back?'",
        "'speaker_1': 'And then the second question I would have is, what is the timeline that we're we're looking at relative to the, you know, how long it would take to make these sorts of. Five. So I don't know if the time has passed essentially for for staff to make changes.'",
        "'speaker_0': 'Ms.. Butler, can you tell us about this to the vice mayor's point about. Does this require this change from hot meal to non hot meal? Does that require some sort of change or seeking permission on our part or.'",
        "'speaker_1': 'So it could be very.'",
        "'speaker_0': 'With that.'",
        "'speaker_1': 'It's it's really under the city manager's limit. He's asking for funding.'",
        "'speaker_4': 'And then the city manager.'",
        "'speaker_1': 'Can give me direction to to follow up based on the concerns. And and I think he's within his authority to do that. And so if you increase the budget to 26,000. Happened here a minute ago. But if you increase the budget to include an additional $2,625, and I can give you the additions fairly quickly, I think that'",
        "'speaker_1': 'that would just I think it would settle everything.'",
        "'speaker_0': 'How does that sound advice, maravilla?'",
        "'speaker_1': 'I'm fine. Adding that specific sum. If we can get that specific number, I'm fine adding it and I'll make that motion. $26,250. Okay. So I would total.'",
        "'speaker_0': 'The total amount.'",
        "'speaker_1': 'Yes. Yes.'",
        "'speaker_0': 'Not for.'",
        "'speaker_1': 'One. No. So I would I would move approval of that amount.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'And I'll second that. But I'd like to know what sense we're giving direction, almost to add a specific restaurant into a city program. I'd like to know what that restaurant is.'",
        "'speaker_1': 'It's JS coffee and tea.'",
        "'speaker_3': 'On.'",
        "'speaker_1': 'SNL.'",
        "'speaker_0': 'And it's an avenue. And in fact, I mean, do you want to read the list of all the.'",
        "'speaker_3': 'There's 43 of.'",
        "'speaker_1': 'Them.'",
        "'speaker_0': 'No, no, no. The last six. I know there are. Trust me. But just the those last six that didn't get there. You know what? Let's keep moving that you can people can look that up. Okay. Yes.'",
        "'speaker_1': 'And then I would just say, relative to the program requirements, just that that staff come back to us if they need council direction and get that agenda.'",
        "'speaker_0': 'Absolutely. All right. It's been moved by Vice Mayor Vella, seconded by Councilmember Knox White. May we have a roll call vote, please?'",
        "'speaker_2': 'Interpretations. I forever, Spencer. I knocked like.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Fell a. You did it again. And we didn't need it so fast. We couldn't.'",
        "'speaker_1': 'Move.'",
        "'speaker_0': 'Moving too quickly. I like carries by five eyes. Okay, that is great. And then the last one we need to take care of. Madam Clerk, do you want to introduce item five? Yes. As in Sam for us, please?'",
        "'speaker_2': 'Yes. Adoption of resolution authorizing issuance of City of I was made to Community Facility District 13 dash one Alameda Landing Public Improvements 2021 Special Tax Subordinate Bonds in the amount not to exceed 24,585,000 and approved related documents and actions.'",
        "'speaker_0': 'Thank you. And so you, I believe, have sent folks on here.'",
        "'speaker_1': 'Or.'",
        "'speaker_0': 'Are you okay?'",
        "'speaker_1': 'We have.'"
    ],
    "Adoption of Resolution Appointing Robert Ferguson, Jennifer Hoffecker and Peter Platzgummer as Members of the Public Art Commission.": [
        "'speaker_0': 'I feel fine. Council, our finance director. Okay. So, hey, counsel, I'm sure you have read the staff report. Does anyone have any specific questions or should we go straight to the motion? Maybe we go straight to the motion to have a motion to approve.'",
        "'speaker_0': 'Item five s move approval. Councilmember Knox witness approval. Councilmember de your seconding. All right, maybe we have a roll call vote, please.'",
        "'speaker_2': 'Councilmember de sag.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Sir.'",
        "'speaker_4': 'Spencer, i knox right.'",
        "'speaker_2': 'I avella. All right, mayor. As the Ashcraft high that carries by five votes.'",
        "'speaker_0': 'Okay, perfect. Thank you so much, ma'am. Thank you. City staff and our outside advisers for doing that. And okay, we're getting ready to move in to our regular agenda. However, we've been at this. This is what we're going to do.'",
        "'speaker_0': 'I'm going to call we're closing the consent calendar. I'm going to call.'",
        "'speaker_1': 'The.'",
        "'speaker_0': 'Item six day, which is adoption of the resolution, appointing our three new members as the Public Art Commission so we can vote on them. They can be sworn in by the city clerk. Move by vice mayor, seconded by Councilmember Knox White.'",
        "'speaker_0': 'And so this is an adoption of a resolution appointing Robert Ferguson, Jennifer Halfaker and Peter Platts. Gummer As members of the Public Art Commission I role cover please.'",
        "'speaker_2': 'So our data. Hi Herrera Spencer I knocked slate.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Met my mayor.'",
        "'speaker_2': 'As he Ashcraft I that carries by five.'",
        "'speaker_0': 'Eyes. Thank you so much. And I as I understand it, we have two of our three commissioners. One of our commissioners is actually overseas and he wasn't able to join us. But I am delighted to introduce to you in person I, Jennifer Huffaker and Peter Platts.'",
        "'speaker_0': 'Gummer They're all working artists of various kinds and extremely talented, and I'm just so grateful for your willingness to serve your community in this regard. And do you want to really briefly just tell us a little like really briefly a little bit about yourself.'",
        "'speaker_0': 'Ms.. Huffaker Why don't we start with you? Hi.'",
        "'speaker_1': 'I'm from for healthcare. I will try to be really quick. I'm in London right now, so it's really early in the morning.'",
        "'speaker_2': 'Um, I've been an Alameda resident for six years.'",
        "'speaker_1': 'I just quickly run down some things. I was formerly an assistant professor of art at the University of Texas. I have a BFA and an MFA in Interdisciplinary Arts. I have opened and run.'",
        "'speaker_2': 'Contemporary galleries.'",
        "'speaker_1': 'In Dallas. I came to California and started working as an art director and creative director. I have just.'",
        "'speaker_2': 'Recently retired.'",
        "'speaker_1': 'And have gotten back into making art again, and I'm also on the board of directors at the Alameda Civic Ballet, and I'm just I love Alameda, this beautiful island, and I'm going to be very excited to help make it even more beautiful.'",
        "'speaker_1': 'So thank you very much, Mayor and City Council.'",
        "'speaker_0': 'Thank you. And Mr. Platts. Gummer, tell us a little about yourself.'",
        "'speaker_3': 'Good evening, Madam Mayor. Good evening. Members of the City Council. My name is Peter Platz. I'm originally Austrian, studied in Switzerland in APAC during public administration with a focus on on performance management and impact measurement. Moved to the U.S. because of a research stay at the Naval Postgraduate School left the Bay Area found my wife, stayed in'",
        "'speaker_3': 'the U.S., started working for an arts company for Engineered Artworks. We're located in West Oakland and building large scale art sculptures. I am responsible for budgeting, managing all the all the sculptures and all mobile sculptures. And at the same time, I started working for Burning Man in the complex art project, Miniature, which is the person who's responsible'",
        "'speaker_3': 'for everything that's big and complicated and usually blows up or.'",
        "'speaker_0': 'Is not going to blow up anything here, right?'",
        "'speaker_3': 'That's certainly not what I hoped for even. But I do hope that see to see even more art in this town that I totally fell in love with. And I'm looking forward to stay here for a while. And to this.'",
        "'speaker_0': 'Thank you so much. We're fortunate to have you. Both of you willing to serve. And Mr. Ferguson, you'll enjoy meeting him, too. So thank you very much. And stay right where you are. We'll get you to bed soon, Mr. Miss Huffaker.'",
        "'speaker_0': 'But the city clerk, La West Speaker, will now administer the oath of office to you.'",
        "'speaker_2': 'If you'll please raise your right hand. Do you solemnly swear to uphold the Constitution of the United States, the Constitution, the state of California, that you won't faithfully discharge the duties upon which you're about to enter?'",
        "'speaker_1': 'I do.'",
        "'speaker_3': 'I do.'",
        "'speaker_2': 'I owe you a thank you.'",
        "'speaker_0': 'Thank you so much. I was trying to keep you up so late, but we thank you so much for your service and enjoy your visits wherever you are. Ms.. Huffaker and Mr. Petschler, thank you so much. Okay, everybody.'",
        "'speaker_0': 'Now what we're going to do is we are going to take a break. It's 902. We're going to start back up at high def and we're going to start back up at 915. So everybody be back then. Members of the audience at the public, rest your eyes a little counsel, rest your eyes from the screen and we'll'",
        "'speaker_0': 'see you. 915 Thank you, everyone. All right, bye bye.'",
        "'speaker_2': 'Okay. Okay. So all the speakers will get 2 minutes. The first figure is Marilyn Rosman.'",
        "'speaker_0': 'All right. Good evening, Speaker Rothman.'",
        "'speaker_1': 'Hello? Yes, hello. I just wanted to say that I am outraged about the.'",
        "'speaker_4': 'Calculated targeting of the.'",
        "'speaker_1': 'Wellness project.'",
        "'speaker_4': 'I understand that there.'",
        "'speaker_1': 'Is going to be.'",
        "'speaker_4': 'Brought up a.'",
        "'speaker_1': 'Very small negative report about the Zoom meeting.'",
        "'speaker_4': 'That that.'",
        "'speaker_1': 'Was was used for this. Not only is this morally wrong, but it's going to cost the.'",
        "'speaker_0': 'City.'"
    ],
    "Public Hearing to Consider a Call for Review of the Planning Boards Final Decisions at the July 26, 2021 Meeting to Approve (1) Design Review Application No. PLN21-0077 for an Approximately 29,810-square-foot Medical Respite Facility at 1245 McKay Avenue and (2) Draft Meeting Minutes from the June 14, 2021 Planning Board Meeting; and \nAdoption of Resolution Approving Design Review Application No. PLN21-0077 to Allow the Construction of an Approximately 29,810-Square-Foot Medical Respite Facility at 1245 McKay Avenue. (Planning, Building and Transportation 20962710)": [
        "'speaker_1': 'Another $5,000 plus for this inane.'",
        "'speaker_0': 'Attempt to stall.'",
        "'speaker_4': 'The project yet again.'",
        "'speaker_0': 'Thank you. Thank you. Our next speaker.'",
        "'speaker_2': 'Harman Reid.'",
        "'speaker_0': 'Good evening, Speaker Reed.'",
        "'speaker_1': 'Good evening, manager and City Council members again. It is evident that the planning board meeting agenda listed a nonfunctioning telephone ID number which precluded full participation from the public and that is protected under our state laws.'",
        "'speaker_0': 'Furthermore, the agenda.'",
        "'speaker_1': 'Was altered the following day to reflect.'",
        "'speaker_0': 'The corrected ID.'",
        "'speaker_1': 'But without any indication of when that revision was made. It seems it doesn't seem to make sense to change it afterwards. Since the meeting was already over. And also, I would like to remind you and the public that the California Brown Act states that a member of the public shall not be required as a condition to attendance'",
        "'speaker_1': 'at a meeting of a legislative body of a local agency to register his or her name, to provide other information, to complete a questionnaire or otherwise to fulfill any conditions and to his or her attendance. So I respectfully ask that because this meeting was not you properly noticed and to please regionalize the meeting.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Your next speaker.'",
        "'speaker_2': 'Harvey Rosenthal.'",
        "'speaker_0': 'Good evening, Speaker Rosenthal.'",
        "'speaker_1': 'So. Good evening.'",
        "'speaker_3': 'Can you hear me?'",
        "'speaker_0': 'Yes. Yes, you're just fine.'",
        "'speaker_3': 'After nearly four years of telling the public that he would be re-using the buildings, Mr. Big suddenly announced that he now plans to demolish them all due to the cost of seismic upgrades. He presented no seismic report of cost estimates or stated why he failed to consider this in earlier years.'",
        "'speaker_3': 'There was, however, a significant financial incentive for demolition. The over $3 million development fee that Mr. Big's and APC were to receive for the Reuse Reuse project will now greatly increase because this fee is tied to construction costs and new construction costs much more than were used.'",
        "'speaker_3': 'As a result, historic structures will be bulldozed. Tens of millions of tax dollars will go to the construction of this county facility. After 20 years, APC can sell the buildings and walk away with tens of millions of dollars.'",
        "'speaker_3': 'The future owner has no obligation to provide homeless services. What is now public land ends up in private hands after providing only temporary homeless services. It is unacceptable that former ABC board member Mr. Knox White sees no conflict of interest in voting to approve this project, which will funnel millions of taxpayer dollars to APC leaders.'",
        "'speaker_3': 'Own homeless and veterans have absolutely no priority for the beds at this facility. The vast majority of admissions will be for the high turnover age 18 plus restaurant unit, not seniors. A significant portion of the site is in the salami Rick's store.'",
        "'speaker_3': 'The costly and time consuming job of asbestos removal and destruction of historic structures will delay construction. It would be much faster and cheaper to build this facility elsewhere by adapting a more centrally located existing building for serving the county's homeless population.'",
        "'speaker_0': 'Thank you. Your time is up next.'",
        "'speaker_2': 'Speaker Jennifer Taggart.'",
        "'speaker_0': 'Good evening, Speaker Taggart.'",
        "'speaker_1': 'Hello? Can you hear me?'",
        "'speaker_0': 'We can.'",
        "'speaker_1': 'Good evening. The people of Alameda voted to approve.'",
        "'speaker_2': 'The wellness center a long time ago for unhoused.'",
        "'speaker_1': 'Medically frail, elderly people. And these delays are shameful and need to stop. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker.'",
        "'speaker_2': 'Paul Schrader.'",
        "'speaker_0': 'Good evening, Speaker. I need to see it on the screen. Trudel. Where's our speaker? Here you are. Oh. All right. Good evening.'",
        "'speaker_3': 'Just.'",
        "'speaker_1': 'Hello. Yeah, we're we're talking about the the flaw in the noticing. And it's obvious this is a controversial and complicated issue, but we're we're asking.'",
        "'speaker_0': 'For a remedy for this.'",
        "'speaker_1': 'Flaw. We're asking for the. For the meeting to be rescheduled. I mean, we could go into other aspects of where there were misrepresentation or conflicts of interest. But I but I just want to say that I, I stand with those who are requesting that the that the meeting be reheard so that people that weren't given a chance'",
        "'speaker_1': 'to speak can do so. And then the other I just had a question regarding the schedule, the consent calendar for this evening. What happened to the items that were skipped or removed? Can someone answer that for me?'",
        "'speaker_0': 'Not now. We can't. This is public comment.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'All right. Well, that's all I have to say. Thank you. Thank your next speaker.'",
        "'speaker_2': 'Ash Geiger.'",
        "'speaker_0': 'Good evening. Speaker Guyer.'",
        "'speaker_1': 'Hey, you're.'",
        "'speaker_3': 'Good evening. Mayor Ashcroft and other city council members. I'd just like to echo what Marilyn Ralston and other speakers have already pointed out about this being an obvious delay tactic by people who just don't want to see this facility being used to house.'",
        "'speaker_5': 'Homeless and fair.'",
        "'speaker_3': 'Medically frail.'",
        "'speaker_5': 'People.'",
        "'speaker_3': 'It's just seems just unaccountably cruel. And we all know that the members of the public have already had many opportunities to weigh.'",
        "'speaker_5': 'In, including when.'",
        "'speaker_3': 'They voted to pass the measure a several years ago to use the facility for this exact purpose. There's it's eventually going to be built. It's just a question of are we going to waste more time and waste more money before finally doing this?'",
        "'speaker_5': 'And maybe some some.'",
        "'speaker_3': 'Ill elderly people will die in the meantime because we'd pointlessly delay it. I sure hope not. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker that begins. Good evening, Speaker Biggs.'",
        "'speaker_3': 'Good evening, Madame Mayor and City Council. My name is Doug Biggs and the executive director of the Alameda Point Collaborative, the lead applicant for the wellness center here for my 18th appearance before a city board or commission to talk about the wellness center.'",
        "'speaker_3': 'Tonight is an easy decision. You cannot claim a meeting was not properly noticed, but that that only impacted one item period. I think the numbers letters from the public that you received and the comments tonight regarding your actions speak volumes about how egregious your attempt to deny services for unhoused neighbors is and how irresponsible it is that'",
        "'speaker_3': 'Mr. de SOG would force the cost onto the taxpayers instead of the applicants by cosigning this. I'm glad, however, to be here tonight to be able to for the opportunity to make an important announcement. Carvin or Councilmember Spencer Curran Reed and Harvey Rosenthal have been working hard to, quote unquote, delay the project past September at any cost'",
        "'speaker_3': '. Those are direct quotes from one of their missives they're fighting to delay in hopes that our current lease of three years will expire and our unhoused neighbors will be denied access to critically needed support and services. I'm delighted to report that this morning I signed a lease extension with HHS to take us through financing and conveyance for'",
        "'speaker_3': 'member Spencer misread. And Mr. Rosenthal, your strategy isn't is misguided at best. It's costing taxpayers needlessly and delaying the day when our doors open and we're able to serve those in great need. Please stop. We have unprecedented support for this project all the way up to the federal level.'",
        "'speaker_3': 'It's time to stop abusing government processes in the hopes that the center homeless will be their will be served. Go away. I'm asking you once again to join us at our table and work with us to create a center of excellence.'",
        "'speaker_3': 'Speaking of which, if indeed you do wish to discuss aspects of the design for which the Planning Board meeting was held, our lead architect from anchor and Voice and Chris Everett is available tonight to answer any questions you may have.'",
        "'speaker_3': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Speaker Biggs.'",
        "'speaker_2': 'Our next speaker is Denise Anderson.'",
        "'speaker_0': 'Good evening, Speaker Anderson.'",
        "'speaker_1': 'Hi. Sorry. A little trouble and meeting you're. I disagree. This is not a complicated issue. We do not need to be relitigating all of the. Every single delay tactic and obstruction to this project. It's been voted on. It's been debated over and over and over again.'",
        "'speaker_1': 'And we know exactly what this is. We know. So I beg of you caution, Tony, to do your jobs and just let this happen. It's going to happen. It doesn't matter how long you take to delay it and all you're doing is more harm to our community.'",
        "'speaker_1': 'Just do your jobs.'",
        "'speaker_0': 'Are you okay? I think she's completed. She's. She's muted. So our next speaker.'",
        "'speaker_2': 'Zach BOLLING, is our last speaker.'",
        "'speaker_0': 'Thank you. Good evening. Speaker bowling.'",
        "'speaker_5': 'Hi there. Thank you. Can you hear me?'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Okay. Awesome. Yeah, I won't.'",
        "'speaker_5': 'I submitted public comment of my personal feelings on this, so I'm going to keep this brief and not reiterate everything I said there. I didn't want to call out a letter that you all received from.'",
        "'speaker_3': 'Yimby Law about.'",
        "'speaker_5': 'SB 330 and potentially any violations, but having this item in the first place may raise.'",
        "'speaker_3': 'So I just wanted to call that to your.'",
        "'speaker_5': 'Attention before you take a vote on this, that you might be violating the five cap limit on having.'",
        "'speaker_3': 'Public meetings concerning items.'",
        "'speaker_5': 'Like this. So thank you.'",
        "'speaker_0': 'Thank you. Speaker Bowling. And you said, Madam Clerk, that was our last public speaker, correct? Correct. Okay. So with that, I'm going to close public comment on item six B and we'll get to discussion. But I'm wondering if we have a motion to support the the Planning Board's final decisions at their July 26, 2021 meeting.'",
        "'speaker_0': 'Vice mayor of L.A..'",
        "'speaker_1': 'So moved. I'd like a vote to uphold it.'",
        "'speaker_0': 'All right. Do we have a Second.'",
        "'speaker_3': 'Vatican.'",
        "'speaker_0': 'Council member in Knox? Right seconds. All right. Who would like to lead with discussion? Councilmember, that's why.'",
        "'speaker_3': 'So I'll ask a couple of questions. One of staff. This is a de novo hearing so that we are actually rehearing and this item has been re noticed as part of this meeting. Correct. So this would be the opportunity that anybody who was unable to attend the planning board meeting would come here and raise the concerns that'",
        "'speaker_3': 'they were they felt that they were unable to raise. Okay. Thank you. Sorry. I see Alan's as Mr. Ty's head shaking up and down. So I'm. I'm interpreting. Thank you. I guess my question is, I would like to hear specifically from Councilmember De suggested through the chair how it is that we're calling saying that a meeting is'",
        "'speaker_3': 'unnoticed correctly, but that we're only calling specific items and allowing other items to move forward.'",
        "'speaker_0': 'Right through the chair, I will convey your question to Councilmember Garza, Councilmember Desai.'",
        "'speaker_5': 'Well, thank you. Let me give my presentation, you know, for the residents who are very supportive of the of the facility that is being proposed. I understand the necessity of such a facility. And I also understand that the residents in a recent vote supported it.'",
        "'speaker_5': 'I think there's a clear indication of supporting these kind of facilities, not just there, but in other parts of Alameda. But for these kind of facilities to come to fruition requires a process, a democracy in which at its minimum, the residents are married, aware of and can participate in, in actions that are related to these kinds of'",
        "'speaker_5': 'facilities.'",
        "'speaker_0': 'Councilmember Desai Let me just stop you and make sure you understood. Councilmember Enoxaparin question.'",
        "'speaker_3': 'Is I.'",
        "'speaker_5': 'Will, I will. I'm speaking and I'm going to it. I think there is I mean, I don't I don't think the.'",
        "'speaker_1': 'Questions.'",
        "'speaker_5': 'Are subject to like interrogation by other.'",
        "'speaker_1': 'Council members.'",
        "'speaker_0': 'This isn't an interrogation. It was a question through the chair as to why if noticing was a problem. But it only applies to one. Okay.'",
        "'speaker_5': 'Well then.'",
        "'speaker_0': 'Agenda item.'",
        "'speaker_5': 'That the councilmember addressed the issue as he sees fit. Okay. So at its core, is is the necessity of making available information of an upcoming meeting for a facility such as this. And at its core, those kind of notices have to have the proper information that allows people to participate.'",
        "'speaker_5': 'Unfortunately, in this case, as important as this facility was, there was a mistake in the noticing that precluded the participation of some members of the audience. So that's why I joined Councilmember Herrera Spencer and making sure that we re agenda is this item so that we can have full participation with the correct information.'",
        "'speaker_5': 'Now, on the night of the of the decision with regard to this facility, there were other items that were discussed. Now it was decided between the time that we initially put together the the council referral, it was decided that certain of those items were of such a time sensitive importance that we had to let them go.'",
        "'speaker_5': 'And I think that had to do, for example, with the artistic events on Webster Street as well as with some of the projects over at Harbor Bay. So I think the time sensitivity of those projects, even though they certainly were not properly noticed, made us come to a reasonable decision that certain things could not be delayed.'",
        "'speaker_5': 'This, though, was one of the items that could be delayed without altogether a change of the substance of it. Now, there are some people who are adamantly opposed to this project from the very beginning and and perhaps that perhaps is seeing in this attempt to delay that they wanted to stop the project.'",
        "'speaker_5': 'That was not my case. I believe that the matter has been settled by the people in the recent vote. I think the people are supporting this project. While I certainly are concerned about the recent debate that we had about this project having to do with whether the property proper thing to do is to reuse of the the'",
        "'speaker_5': 'facility or to demolish the facility. And you know how I voted? I voted against demolition because I felt that the vote was for reuse. Nonetheless, I still felt that. Nonetheless, I still felt that the matter is settled. But the more important thing, though, is to make sure that as this facility is eventually built, that we just go'",
        "'speaker_5': 'through one more step of re agenda, re agenda, using this item for public input, which, by the way. Is the point of tonight. Tonight is an opportunity was an opportunity for the public to weigh in for those issues that they thought that they might have raised.'",
        "'speaker_5': 'Several meetings ago and tonight was their attempt at their opportunity to do so.'",
        "'speaker_0': 'Thank you, Councilmember de SAG Councilmember Herr Spencer.'",
        "'speaker_4': 'Thank you, Mayor. I'd also like to add that the two items that were removed and it was just the two items. There are other items other than the wellness center on the agenda. They were both. They were the only confirmed items.'",
        "'speaker_4': 'One of them was, in fact, as members pointed out, for shared was the expansion of the penumbra building. And the setback on that one is being moved from 50 feet to 49 feet, and there is never any comment at all on that item.'",
        "'speaker_4': 'And the sale was closing like the next day and we've been dark council hasn't had any meetings in the last month. So I was asked we were asked to remove that one item where there had never been any at all public comments and it wasn't back on consent.'",
        "'speaker_4': 'Then the second one was 60. That was also on consent that we were asked to remove. And that one there had been multiple hearings on this exact issue in regards to noise. And on that specific issue, contrary to the the people that have raised the property, that was the design review and it was the first and only'",
        "'speaker_4': 'hearing discussion of design that was all that could be discussed during that. And I listened to the meeting as it was occurring live and we did have a caller call in and point out that there was someone, you know, that they were having problems because of this phone number error.'",
        "'speaker_4': 'And there was a discussion by the city attorney's office at that point, the attorneys sitting on the diet or on Zoom who shared that. They thought that because that it wasn't also sufficient or because there even though the Zoom meeting ID number was incorrect on the agenda for those calling in.'",
        "'speaker_4': 'So it was actually raised live during the meeting that that that is where the issue arose during the meeting. And the president of the Planning Board was very precise that all comments had to be to design only. And that was where we saw the pictures of the design.'",
        "'speaker_4': 'It was the only time those pictures have been shared that detail and discussed by the public. So the fact that and we all know, as we've heard again tonight, this is a very important issue to our community. And the fact that it had this mistake in regards to the Zoom meeting had to be able to participate via'",
        "'speaker_4': 'phone call. I think we have allowed phone participation and we have and staff has in fact created agendas during COVID where they have the correct meeting ID, the meeting ID for the court phone callers and I agree with member de Target in regards to open government and democracy, and that puts out an agenda that is critical, that'",
        "'speaker_4': 'it includes the correct meeting ID so that we can hear from the participants and so that that was wrong. But so I think that I would hope that we would all agree that staff should in fact have the correct Zoom meeting ID on an agenda so that we can hear from the members of the public on on'",
        "'speaker_4': 'the agendas. So that's a critical error. And to me and it was brought up that night. And so we know that there were callers that were not that were having problems trying to call in.'",
        "'speaker_0': 'Councilmember Spencer, if I might ask if open government and democracy requires correct phone numbers so we can hear from members of the public, why doesn't it occur? Why doesn't that apply across the board? Open government in democracy.'",
        "'speaker_4': 'All right. So I did try to speak to that mayor. I'm happy to try again there. If you look, there were the two items that were removed. And obviously we need to, as we discussed today when the item came to us, May, versus now that there is some discretion to allow the movement and the progress of items'",
        "'speaker_4': '. So it would, if required to hold up the sale or transfer of property for which there had been zero feedback from the community in advance or during the meeting.'",
        "'speaker_0': 'How do you know that somebody didn't try to comment on those two items that you pulled from your call for review because they called in on the wrong number? How would you know that?'",
        "'speaker_4': 'Okay. So to date, there have been no there was to date, but I know there has been zero communication from anyone saying that they had tried to call in on either of those items and were denied as opposed to what happened during the meeting itself, where it was brought to our attention.'",
        "'speaker_0': 'My understanding from the correspondence attached to this item is that you pulled those two items when you got requests to do so from the proponents of each. You agreed to Mr. Ernst's review and you agreed to Ms.. Astbury requests.'",
        "'speaker_0': 'I should say that you delete those items for the call for review. Councilmember Knox. Right.'",
        "'speaker_3': 'All right. Thank you, sir. I appreciate the answers. I think, quite honestly, I don't buy it. I really just don't. You can't suggest that there's a problem with one item and there's not a problem with other items. It is very clear that this was a targeted call for review.'",
        "'speaker_3': 'And I think it's really unfortunate is shameful. I'm going to say and I'll walk my line very carefully here, but we have heard a lot of conversation about people who are very concerned about the fact that people don't abuse the rules with open government complaints.'",
        "'speaker_3': 'And we need to really loosen it up so people can just file lots of open government complaints because two people have concerns that they've already been turned down once. And yet here we are having a conversation where the very logic of we have heard no complaints about people who tried to call into the meeting on those other'",
        "'speaker_3': 'two items. We haven't heard from one person who was called in. They didn't even call in tonight to say they couldn't get in. The only complaint we heard was somebody who called in on the other line and said they had a problem with the first line.'",
        "'speaker_3': 'That person who is an open government commission then called in a second time in and broke the protocols for engagement in our public meetings. To continue commenting when they were when their time was up. So I think this is a really problematic precedent that we're setting here, that we're going to just call for review every single thing'",
        "'speaker_3': '. And so personally, I'd like to see as a party, after we vote on this, I'd like to provide some direction to our staff that we have some conversations about when call for review as appropriate. Because you didn't even call for review the decision.'",
        "'speaker_3': 'You want to call this an open government complaint file? An open government complaint. This was not a call for a review. All right. Since it was and we had the opportunity to hear from the community who didn't have the opportunity to give comment to the planning board.'",
        "'speaker_3': 'And yet not one of those people showed up. The only people who spoke were people who were actually there and on last time. I just I think that our meetings are never getting done because we are just constantly larding up a kind of political show and tell on here.'",
        "'speaker_3': 'And I'm really I'm really frustrated because, quite honestly, I've been worked really hard to try to help move even things I don't agree with forward on the agenda. And then we have to sit here and go through an hour long conversation on on an item because somebody wants just another bite at the apple.'",
        "'speaker_3': 'So those are my comments. I'm expressing my frustration. I appreciate the time that our staff has put in here. I'm very sorry that you have had to go through, you know, just so much waste of time. And we could be working on other things.'",
        "'speaker_3': 'But instead, we're having to prepare for ridiculous hearings like this. And I hope this is the last one. We've had 18 hearings on this project. And I understand that the design was not specifically a part of every single one of those 18 projects, but not one special new content came out.'",
        "'speaker_3': 'The only comment about the project we heard from Mr. Rosenstiel talked about the Rosenthal talked about the last call for review you guys had. You didn't even address the design. We haven't heard one design comment tonight. It's time to elect projects that are meant to help people that have had the support in concept of the voters to'",
        "'speaker_3': 'move forward and stop trying to play these games to just stop it. I look forward to working with both of you on other projects, but this one is really frustrating for me and I was really, really surprised and disappointed to see that it was managed to get too close to call for reviews.'",
        "'speaker_3': 'And quite honestly, I think it's an abuse of our process. And I don't want to rewrite our processes to have to address kind of the just the general abuse of trying to play politics with our processes. So that's my that's my rant.'",
        "'speaker_3': 'I appreciate. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Knox White. And I'm actually going to Segway. I'll get to Councilmember Gay. Like I'm going to segway on to something you said, Councilmember Knox. Right. That I had determined the first time I read that this item was coming to us.'",
        "'speaker_0': 'And I also greatly appreciate the planning staff and city attorney's.'",
        "'speaker_1': 'Work.'",
        "'speaker_0': 'On these items. But I would also like the council to direct the city attorney's office to work with the planning staff to consider limiting appeals on projects that address homelessness. Because we are never going to accomplish what we need to accomplish as a city to address homelessness.'",
        "'speaker_0': 'If we keep stretching out the approval of these worthy projects, making them cost more money. And I have to agree with the. The first public speaker is Rothman, who said she called this calculated targeting of the wellness center morally wrong and costly just for the project.'",
        "'speaker_0': 'Again, it has to be targeting. There is no other reason that the other two items were pulled, except that this was the one mark to colleagues wanted to attack. And the other thing I would like city staff, city attorney's office planning staff to look into is the issue of whether design review decision decisions are even appealable, should'",
        "'speaker_0': 'even be appealable to the city council. This is not universal among cities that a design review and decision by the planning board is appealable to the city council. And I think we've seen tonight just exactly the abuse that can come out of it.'",
        "'speaker_0': 'And I want to just add further that I mean, you know, that I for this year, I've been chairing a statewide policy committee on Housing, Community and Economic Development for the League of California Cities. And a couple of Fridays ago, a couple of league staff folks came down from Sacramento.'",
        "'speaker_0': 'I wanted to show them around Alameda Point and some of the developments and what we're doing with our 24, 25% affordable requirement. And we got to tour Corsair Flats and that is, you know, it happened it sort of I mean, it happened at exactly the right time.'",
        "'speaker_0': 'But because of COVID, we haven't been able to do a ribbon cutting, but we got to go in for a little tour and have those 60 units and they're all affordable. Senior housing. 28 of those units were set aside for formerly homeless veterans, and the on site residential manager told us that some of those veterans who are'",
        "'speaker_0': 'now housed in a lovely facility had been on the street for ten years, ten years. And, you know, some people are going to live and die on the street in that period of time. We have the the opportunity to move projects forward so that we avoid that sort of outcome.'",
        "'speaker_0': 'It is morally wrong to to throw these specious roadblocks in the way just to appease a few disgruntled community members who just can't get over the fact that this project has been approved time and time again. So I do think it takes more than hope that this won't happen again.'",
        "'speaker_0': 'I do think it takes some looking into and maybe some redesigning of our process. Back to you. Councilmember Jason.'",
        "'speaker_5': 'Well, thank you very much. And I just want to reiterate, what is the core of the issue? What is the reason why Councilmember Herrera, Spencer and myself brought this up not to target the facility, but because at its core, there wasn't a mistake in the agenda raising of this item.'",
        "'speaker_5': 'And in putting in the wrong telephone number, who knows how many people might have called and decided not to follow through because they they weren't getting the right number? I don't know. And that's what that's the problem here.'",
        "'speaker_5': 'That's the problem we're trying to address, you know, for projects that are as high stakes as this. It's imperative that city hall at least get the low hanging fruit item. Correct. And in this case, they didn't. And so I do believe that we were right to point this out and to call for a referral and to have'",
        "'speaker_5': 'the type of meeting that we're having tonight. It's glad it's good to see that this facility will be moving forward. I do believe that the residents support this. They have done so in the votes. They have done so when repeated coming out of meetings and emails.'",
        "'speaker_5': 'And I appreciate that. But ultimately, for a democracy to work or for projects to get their full discussion in the in the light of day, we have to meet the minimum standards of getting the information out correctly. And in this case, we didn't.'",
        "'speaker_5': 'And so I appreciate the the energy and the enthusiasm, not just council members, but the public have for this project. And I look forward to seeing it built. But in this case, it was imperative that we do bring it out.'",
        "'speaker_5': 'And again, as for the other items that were on the agenda, like we said earlier, there was such a time sensitivity with regard to those other items that we had to make the reasonable decision that the one item that did not have the same time sensitivity was going to have to go through the the vetting that we're'",
        "'speaker_5': 'putting it through tonight. Unfortunately, unfortunately, that was this project. But hopefully tonight, the council and the community will understand that this matter, this matter is settled in. The project will move forward.'",
        "'speaker_0': 'Vice mayor of L.A.'",
        "'speaker_1': 'So with all due respect, shame on us. Shame on us for having this many hearings on the same project. Shame on us for not streamlining this process. This project is in my backyard. I want it in my backyard.'",
        "'speaker_1': 'I'm proud of it being in my backyard. I think we all should be proud of this project. It's withstood, I don't know, 18 public hearings at this point. I do. Second, what the mayor has said about looking at our process to see if calls for a review should be allowed or permitted for design, for design review purposes'",
        "'speaker_1': '. I think we need to get back to business. This issue has been decided. It has overcome a lot of hurdles. It's not a high stakes project. We have made it a project that has had to withstand a number of different attacks.'",
        "'speaker_1': 'And shame on us for for that, because we have made this this project much more difficult than it needs to be. Additionally, I would disagree with my colleagues that that time isn't of the essence for this project. Time is of the essence.'",
        "'speaker_1': 'We do not have these services for our vulnerable community members. We do not have adequate housing and end of life care services, all of the services that are going to be provided by the wellness center, we don't have those in in a way that we need to provide them.'",
        "'speaker_1': 'And so I just we need to not be the ones causing any more issues relative to this project moving forward. I would also just say that I just don't I think the arguments that have been made for why we have exempted other things and only are hearing about this one project tonight to me, just don't stand muster'",
        "'speaker_1': '. And I think we have other items of particular concern that we need to get to. And I hope that this is the last of political stunts to try to stop or impede forward movement on the wellness center.'",
        "'speaker_0': 'All right. Councilmember Herrera Spencer.'",
        "'speaker_4': 'Oh, I do want to respond to the comments against member of the ACLU and myself by my colleagues. I, I disagree. I think it was appropriate to bring it. I think it's unfortunate that the personal attacks levied by my fellow council members against Member De SA and myself for bringing this item.'",
        "'speaker_4': 'We do have the. If you want to change the rules moving forward, then that can come to council. But currently we do as council members have the ability to call items such as this for review. And it is critical, as has been said, that the phone numbers and the ability, the way to participate in meetings be properly'",
        "'speaker_4': 'noticed. Thank you.'",
        "'speaker_0': 'Yes. I do think that we've seen where we need to make some changes in our rules. And so we've given direction to staff to please come back to us with those looking into those topics. Okay. I think we've heard from everyone.'",
        "'speaker_0': 'Madam Clerk, may we have a roll call vote?'",
        "'speaker_2': 'Please remember details.'",
        "'speaker_1': 'Oh, you're meeting Miss Chen.'",
        "'speaker_5': 'Epstein.'",
        "'speaker_0': 'Oh, wait. Miss Chen is. Has your hand up?'",
        "'speaker_1': 'Oh, I just wanted to ask if we wanted to do two separate motions, one to approve the minutes and one to approve the resolution.'",
        "'speaker_0': 'Okay, that is a good suggestion. Thank you. We can do that. Okay, madam, can you bifurcate that one interest, please?'",
        "'speaker_2': 'Sure. I think Councilmember Vela's late.'",
        "'speaker_1': 'She.'",
        "'speaker_0': 'What is it? I can.'",
        "'speaker_1': 'Appreciate it and make.'",
        "'speaker_0': 'A motion to make the motions. Okay.'",
        "'speaker_1': 'And then to make a separate motion to approve the resolution.'",
        "'speaker_0': 'The delay review. Okay. And the second order of the motions. Okay. With that, too, right? All right. All right. Thank you, Madam Quirk. So let's go first with the minutes.'",
        "'speaker_2': 'That's where. That's her Spencer Knox fight.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Villa.'",
        "'speaker_2': 'I mayor as the Ashcraft.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'That carries 4 to 1.'",
        "'speaker_0': 'Thank you. And so then will you please do the second part of that, which is the approval of the design review application?'",
        "'speaker_2': 'Councilmember de SAC.'",
        "'speaker_3': 'State.'",
        "'speaker_2': 'Treasurer Spencer Knox wi.'",
        "'speaker_3': 'Fi.'",
        "'speaker_2': 'Vela.'",
        "'speaker_1': 'High.'",
        "'speaker_2': 'Mayor as Ashcraft.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'That carries three as one. No one abstain.'",
        "'speaker_0': 'Thank you. All right. With that, we move on. Thank you, Ms.. Chen. With that, we move on to item 660.'"
    ],
    "Recommendation to Provide Further Direction to Staff Regarding the Allocation of $28.68 Million of Funding from the Federal Government Through the American Rescue Plan Act of 2021 to Assist with Recovery from the Impacts of the COVID-19 Pandemic. (City Manager 10021030/Finance 10024051)": [
        "'speaker_2': 'To provide further direction to staff regarding the allocation of 28.68 million of funding from the federal government through the American Rescue Plan Act of 2021 to assist with recovery from the impacts of the COVID 19 pandemic.'",
        "'speaker_0': 'Thank you. And I think we have a couple of members of our finance department. This one.'",
        "'speaker_1': 'Correct.'",
        "'speaker_0': 'I do, too. But I'm also looking for. There she is. Jennifer, tell. So who's who's taking the lead on this one?'",
        "'speaker_1': 'Jennifer will be presenting the report.'",
        "'speaker_0': 'Tonight and taking this to. Good evening, Mr..'",
        "'speaker_1': 'Good evening, madam mayor and council members. I'm Jennifer Patel, budget manager in the finance department. This evening, staff is seeking for the direction from Council on the spending plan for the city's Allocation of American Rescue Plan Act or ARPA funding, which may be used for recovering from the economic and public health impacts of the COVID 19 pandemic'",
        "'speaker_1': '. Madame Clerk, may we please bring up the slides? Thank you. Next slide. Earlier this year, the city was allocated $28.68 million in ARPA funding. We received the first tranche of funding or half of the full allocation from U.S. Treasury in June 2021.'",
        "'speaker_1': 'And we expect to receive the second tranche with the remaining allocation in 2022. Recipients have until the end of calendar year 2024. To spend or obligate ARPA funds to projects and obligated funds must be spent by the end of 2020 2026.'",
        "'speaker_1': 'Staff first sought direction from City Council on the use of the ARPA funds at the Budget Workshop on May 20th. At that meeting, council directed staff to focus on four main eligible use categories. Those were revenue lost due to the pandemic, addressing housing, homelessness and behavioral health, investing in broadband infrastructure and providing assistance to households and small'",
        "'speaker_1': 'businesses. On July 20th, staff returned to council for further direction on a draft spending plan that included proposals under the four main categories identified in May. At that meeting, council made a motion to refine the spending plan with a focus on housing, with flexibility to use the revenue loss funding for housing, and to include additional funding for'",
        "'speaker_1': 'Wi-Fi hotspots. Next slide, please. The refined spending plan put forth by city departments includes a supportive transitional housing program, development of permanent supportive housing through either hotel acquisition or ground up build of the bottle parcel, the Feed Alameda Program and a wireless hotspot lending program.'",
        "'speaker_1': 'Next slide. Since the last report to council in July, staff met with the Alameda Housing Authority to identify the housing authorities prioritized list of projects which could be initiated within the next 9 to 18 months. Those projects include an Eviction Prevention and Rapid Rehousing Fund.'",
        "'speaker_1': 'Funding to jumpstart construction on 90 units of permanent supportive housing purchase, or at least two own of existing multifamily units or motel suites that would be restricted for low income seniors. And funding to expedite affordable housing development. Next slide.'",
        "'speaker_1': 'Together, these spending plans exceed the city's first year allocation of $14.34 million, and, depending on the four affordable housing development options selected could also exceed the city has full allocation of $28.68 million. With that in mind, staff are seeking direction from council tonight on specific uses of the initial allocation of $14.34 million.'",
        "'speaker_1': 'If City Council authorizes staff to proceed on any of these projects, we will initiate work and report back on progress and available funds at a later date. We will also bring forward any necessary budget appropriations for City Council consideration and approval.'",
        "'speaker_1': 'Staff from the city manager's office, the Finance Department and the Community Development Department are here and available to answer any questions you may have. Thank you.'",
        "'speaker_3': 'You're on mute, Mayor.'",
        "'speaker_0': 'Sorry. I was just asking the city clerk if we had any public speakers on this item.'",
        "'speaker_1': 'We do not.'",
        "'speaker_0': 'Okay. With that, I am going to close public comment and we can just go into council questions, council direction, council comments. So I'd like to start. Okay. I don't mind. Well, let's all go left. Councilmember de Sack. I see your hand up.'",
        "'speaker_5': 'Well, yes. I just want to say thank you to our city staff for kind of guiding us through this whole process. It's not every day that the federal government drops any amount of money, let alone a $28 million divided in certain in two different tranches, as they call it.'",
        "'speaker_5': 'And in looking at staff's recommendation of the $15 million for the hotel acquisition or the ground up, ground up build, I didn't certainly supportive of that. I continue to be so. Know, I think we as a city of Alameda, we've made incredible headway.'",
        "'speaker_5': 'And I certainly as a councilmember, have been involved in so many of the decisions, tough decisions with regard to implementing national leading homeless prevention programs here in Alameda. And I'm speaking of many years ago, the what used to be called the Alameda Point Collaborative.'",
        "'speaker_5': 'So I've been very happy to be part of that. And I see the possibility of building a new facility with the assistance of $50 million as continuing that that leadership of the city of Alameda has shown. In terms of the other items, I think I think they certainly follow through on the priorities that we listed above.'",
        "'speaker_5': 'And I am glad to see, particularly with regard to wireless, that it was kind of honed in a little bit more in terms of how it's going to be delivered, and particularly with the Library Department taking the lead in that.'",
        "'speaker_5': 'So I'm glad to see that that makes natural sense to have out of libraries, whether in the West End or the East End as kind of a natural hubs of wireless activities. So I look forward to having council pass recommendations and if we have to make some tweaks, you know, I'd certainly like to work with our colleagues'",
        "'speaker_5': 'in making tweaks.'",
        "'speaker_0': 'Thank you, Councilmember de SAC. Councilmember Cox. Well, I think I saw your hand up there.'",
        "'speaker_3': 'Thank you very much. And I will share my my thanks as well to our to our staff. I think in terms of guidance for moving forward, I really appreciated the the focus on homeless accommodations that I think I heard very loudly in our last meeting.'",
        "'speaker_3': 'Learning a little bit more about some of the options. I am very interested in pursuing something that probably looks like the bottle parcel and maybe a transitional use or something at the at the big whites as well as, as I mentioned, the last the last meeting, I think we have a 20 year old city building that has'",
        "'speaker_3': 'not been able to find a use across the street from city hall that we can look at for some kind of resiliency and transitional center moving forward. I'd also like to really pursue how we could use some of these funds to support our 22 year commitment today.'",
        "'speaker_3': 'The folks at Alameda Point Collaborative in the rebuild of their various substandard housing out there that is in desperate need of of of work and that the city has said for over two decades that we will figure out how to how to help them do.'",
        "'speaker_3': 'And lastly, it's something that the mayor and I have talked about and we've talked about in those meetings as well. In year two, I'd really like to look at how we can use some of this money to support some sort of universal basic income pilot.'",
        "'speaker_3': 'I think for me, a pilot is not to show that it works. I think there's enough information coming out of existing pilots out there about the benefits, not just to the benefits of the folks who receive the money, but the benefits to the community around them, whether it's in terms of standard of living safety, public safety, etc.'",
        "'speaker_3': '. And I think that we have an opportunity here, too, to really figure out how to do that and move something forward. Lastly, I would just like to ask I don't have a specific ask here, but I do think that maybe if our staff, you know, we were very blessed that the state stepped in to really provide help'",
        "'speaker_3': 'to renters across the state with the rental assistance and also landlords. Right. Everybody benefits. But, you know, I do think that there are likely some some folks who have been hit pretty hard by COVID and have outstanding medical costs and other things like that.'",
        "'speaker_3': 'I don't have a number on that, but I'm just wondering if we want to spend a little bit of time of just thinking if we're looking to that might be folks who are currently housed. How do we keep them from becoming unhoused?'",
        "'speaker_3': 'Is there is there any information we have or some of the programs that we run that we can help identify potential need? Again, I don't want to develop a city program for seven people, but if we were able to identify significant numbers of seniors or people who have had.'",
        "'speaker_3': 'I heard a story today about a family member whose parent died and now they're in the do I pay for my do I pay the outstanding medical fees for the person who is no longer with us? How do I pay my rent?'",
        "'speaker_3': 'And that's not something that necessarily comes under the rental side. So just to my question is, just as we as we move out of this, are there any needs out there that are not being met by the county?'",
        "'speaker_3': 'I have not done any research. I would expect our staff probably know this better than I do through the homeless strategic plan and whatnot about what our what things are out there. But I just think, you know, if we could just be looking at whether or not there are some places where we can fill fill holes in'",
        "'speaker_3': 'the net to help those who are most vulnerable. I think that that would be fabulous. Those are my comments.'",
        "'speaker_0': 'Thank you. I see. Vice Mayor. I think I saw your hand up. Yeah.'",
        "'speaker_1': 'So I think stuff that I work on this I very much like what's included in option one. But I do want to add one other thing, which is I really think that we need to be looking at alternatives.'",
        "'speaker_1': 'I appreciate the idea of looking at a ground up project on on the Bible parcel. I just don't want to be limited to those too, relative to figuring out how we how we add more affordable housing stock. And to that end, I also really want us to consider community land trust, public land trust options.'",
        "'speaker_1': 'I think these are these are things that really will keep the affordable housing stock, keep people housed. They don't require us to go out and acquire or build ground up. They they really will give us an alternative. So I would just like to to add some sort of direction.'",
        "'speaker_1': 'I know we're on a really tight timeline, and so I just have concerns about if something falls through, what is the the additional do we have an alternative to the plan in place that still seeks to achieve the overall goal?'",
        "'speaker_1': 'And so I just want to put that out there. And I think even if we don't end up using our ARPA funds for that, that's something that we should be looking at.'",
        "'speaker_0': 'Thank you, Vice Mayor II Councilmember Harris Spencer.'",
        "'speaker_4': 'Thank you. So when I first of all, I want to thank staff for reaching out to the Army, the Housing Authority. I personally, their first item on here is evict eviction prevention and rapid rehousing funds around me to residents.'",
        "'speaker_4': 'And I think this is somewhat goes to the issues raised by member not quite in regards to allocating they're suggesting $2 million to be managed by a local nonprofit to assist households impacted by COVID eviction or other housing issues and finding housing and preventing displacement.'",
        "'speaker_4': 'So I think that I think that that's actually very important to keep families to help them right now. And it goes to what I think this money really could immediately help families stay in their homes and deal with preventing displacement.'",
        "'speaker_4': 'So to me, that is actually would be my first priority. The second one they have, again, under the Army, the housing authority, well, they have construct a jumpstart construction of 90 units of permanent supportive housing, and they estimate it's $8 million to expedite those first two phases.'",
        "'speaker_4': 'I think that's also very important. And then they also have purchase are based on of existing multifamily suites. And I don't have a pad on here. It's just a summary, doesn't have a timeline. However, it is existing buildings and then they have a price per unit of apartments going to 70,000.'",
        "'speaker_4': 'So these are move in ready. They describe them as I would think that that's a fast timeline as opposed to having to go out and build something from the bottom up. So I, I actually think the housing authority does a really good job and it's honestly, they would have been part of the city.'",
        "'speaker_4': 'But for a few years ago, under a different administration, they were separated from the city. And I think it's is appropriate to work with them and let them do their job. I want to call magic. This is what they do.'",
        "'speaker_4': 'I also I have the wireless hotspot lending program for that says 50,001 times 3600 annually to provide hotspots, 30 wireless hotspots. I think that that is something that I have actually been asking for for years to help people that don't have access.'",
        "'speaker_4': 'And especially as we've seen during COVID, how important it is that many individuals or families have been left out honestly of society during this COVID time. And I think that that that, too, is as as people are not able to participate in person, that continues to be an important need.'",
        "'speaker_4': 'And I know schools have tried to step up, but not every family has children that are attending schools that that's offered and not every family has children. And we have many individuals, especially seniors, that have been left out during COVID.'",
        "'speaker_4': 'And then I do have a concern in regards to the hotel acquisition that is currently in Marina Village in that is a revenue generating asset for even those that are owned by the city. It produces transient occupancy tax for the city.'",
        "'speaker_4': 'That's actually one of our few hotels in the city. And we have heard many times over the years how important that transient occupancy tax is. So I don't think it is I and if you look right now, they do currently they're operating, so they are creating revenue for the city.'",
        "'speaker_4': 'So I have concerns about removing one of our few hotels that produces higher level of tax dollars for the city as opposed to looking at another other ways of housing, those that are and has a transitional housing, because honestly, I think it defeats the purpose.'",
        "'speaker_4': 'If you're taking away tax revenue, then the city needs income to be able to provide services. And then there's also this battle parcel that is up for consideration, and I'm not sure that that's really the best use. I would like more information in regards to the fastest timeline to provide the housing.'",
        "'speaker_4': 'And I think the Alameda housing authorities proposals could very well be the most quick to get online, to start serving the people that need these services sooner rather than later. And I think it is more than likely going to be the most effective use of any income, any dollars.'",
        "'speaker_4': 'By the city to use to meet these needs as opposed to the city doing it on its own and not working with the housing authority. Those are the theater. Alameda. I think that's continues to be a great program if there's any you know, I, I absolutely support continuing that program to some dollar amount, as we think may'",
        "'speaker_4': 'be appropriate. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Herrera Spencer. So I will start by saying I strenuously object to any expenditure at this time to the housing authority, the Alameda Housing Authority. I would want to have a lot more information. For instance, how much money has the Alameda Housing Authority received from ARPA?'",
        "'speaker_0': 'Why does it need funding? The city receiver knows that there is a reference to the possibility that it could complete the North housing project sooner if it had ARPA funding from the city. But when that project was conceived of and begun, ARPA wasn't even a gleaming anyone's i.'",
        "'speaker_0': 'We hadn't had a pandemic, so I can't figure out whether this is just the housing authorities way of getting cheaper money because presumably there wouldn't be a finance charge from the city. And if it's just meant to supplant funds that they will get eventually, then I guess it's a loan.'",
        "'speaker_0': 'But I would tend to agree, not tend to agree. I very strongly agree with Vice Mayor Vela that a community housing trust is something that a lot of cities have done that allows them to do the very things that the Housing Authority is proposing to purchase properties.'",
        "'speaker_0': 'The Housing Authority accomplished one of these transactions recently, but they can find an apartment building that is for sale. They can do a transaction. There is a way that you guarantee that so many of the units will be will remain affordable for a certain amount of time.'",
        "'speaker_0': 'There's no reason that the city can't do this. And certainly working with a partner to administer and if it involves some wraparound services, those models are out there. I'm disappointed to say that as far as protecting eviction protection by the Housing Authority, I have personally been involved with more than one Alameda Housing Authority tenant and have had'",
        "'speaker_0': 'to go to bat for them. One of them, I was successful in keeping her in her home. The other one, sadly, a disabled woman, has been evicted and were it not for the fact that her sister has flown out free from the East Coast a number of times, and I was able to connect her with a resource'",
        "'speaker_0': ', but not the housing authority, because they were absolutely no help in finding alternative housing for this disabled woman who was prepared to camp on the beach. But anyway, I just feel that there's there's a lot of complexities involved with the housing authority.'",
        "'speaker_0': 'And I think that there are enough important things listed in option one that we should be allocating the funds from this first tranche to and not to extend our funds, certainly at this time, without more explanation and some safeguards in place to the housing authority.'",
        "'speaker_0': 'Among the other things that I just wanted to include. I we're going to talk at the end of the agenda, so maybe get there before midnight about the Alameda Sun so I won't go into too much of that.'",
        "'speaker_0': 'There I could see allocating some money from ARPA to the sun as a, you know, small business assistance as a business affected impacted by COVID. We'll talk about that when we get to that item. The the transitional housing.'",
        "'speaker_0': 'I did have a question. When staff is talking on page two about supportive transitional housing program provide temporary transitional housing allows for stays of up to six months. Extend on a case by case basis. Is that the bottle parcel or another location?'",
        "'speaker_0': 'Can someone give me a quick answer on that one?'",
        "'speaker_3': 'I can jump in.'",
        "'speaker_0': 'Thank you, Mr. Bowden.'",
        "'speaker_3': 'It could be the bottle parcel. This is the idea of putting up temporary housing. The the. Gosh, the word is.'",
        "'speaker_0': 'Portable, so. Yeah, yeah, that can go up quickly.'",
        "'speaker_3': 'Go up quickly and start the services. And it could it could be a site that can move around even. But the bottle parcel is is ideal for it.'",
        "'speaker_0': 'Okay. And I will also disclose that last week, I think it was last week, a number of us from city staff visited yet another transitional housing development. That's the city of Mountain View has done. I do get what I call Mayor Andy when I see this, but it's it's so instructive because we could compare and contrast it'",
        "'speaker_0': 'to what we'd seen in San Jose in the spring. And this one was interesting in that it it was these these units, these portables, portable sort. They they look like they're containers, but they really aren't because they're insulated.'",
        "'speaker_0': 'They have a tracking in and they combined in separate ends of this development. There were family, there was family housing. And then there was there's a need for single adults and adult couples. The one thing I will say about the Carnegie building, I think there was a reference to that.'",
        "'speaker_0': 'It is not ideal for transitional housing. It's really nice to be able to give people, in addition to roofs over their heads and their own bathrooms, a little outdoor space for they can just kind of chill in the sun and and they're eating outdoors these days because of, you know, concerns with congregate settings.'",
        "'speaker_0': 'And I think there's other uses and maybe, you know, as a navigation center or something. But as far as housing, not so much. But anyway, I would love to see us allocate money for transitional housing. And I think the bottle parcel is a great location close to a lot of city services.'",
        "'speaker_0': 'I will just reiterate what came up last time and I'll say it again. Every unit needs to have its own bathroom. It's a matter of human dignity. They were telling us at the this last place we visit that, well, you know, it's a way that you get people to leave their units, otherwise they'd never leave their units'",
        "'speaker_0': '. And I said, Well, we're assuming they're not going to starve themselves. And they thought that if we were adding a bathroom, we were also adding a kitchenette. No, that really increases the price. And there is something nice about being able to if you want to eat at the same picnic table or nearby somebody else.'",
        "'speaker_0': 'So I that's great. I know staff is still in the process working with the Marina Village in on getting the appraisal during the negotiation as far as the amount of top transit occupancy tax that it brings in to the general fund.'",
        "'speaker_0': 'That facility wasn't doing terribly well to begin with because the owner was willing to sign up for the Project Roomkey program, and that gave him some guaranteed income, none of which came to our total. And so that's why he's had the place on the market for a while.'",
        "'speaker_0': 'But we'll see. It's a business. It's a business transaction. The price and the terms have to be right. We haven't seen what the appraisal is yet. But anyway, in short, I would just say that I very much support option one.'",
        "'speaker_0': 'Councilmember Knox White, thank you for bringing up the guaranteed basic income. We might be able to do something even sooner than the second tranche because and I know our state lobbyist is keeping track of this, there is some state grant money that's supposed to be coming down that the governor set aside in the budget.'",
        "'speaker_0': 'We're just waiting for the rules that govern that. But our our state lobbyist is keeping an eye on that. So maybe even sooner than the second tranche. And I very much like the concept that I was reading into what you were talking about, keeping people from falling through the cracks because of unanticipated or just, you know, untenable'",
        "'speaker_0': 'expenses. It reminds me of a program in Oakland, mayor envy called Keep Oakland Housed. And there is a fund where and I'm told that people usually need to just draw from it one time they can't pay a utility bill, although there's federal funding now that will pay 12 months of your back rent, three months of your forward'",
        "'speaker_0': 'rent and unpaid utility bills. So be sure to call two, one one. They can give you information on how to apply, but this is something that we also might want to set aside a pool of money for, to do something based on that, to just keep people from falling through the cracks.'",
        "'speaker_0': 'Lots of good opportunities. Thank you. OC Councilmember Herrera Spencer Thank you.'",
        "'speaker_4': 'So I'd like to share that the Alameda Housing Authority does have a board and its appointed commissioners appointed by the council that offers oversight and they have meetings and I am disheartened to hear these come. Claims raised about their services.'",
        "'speaker_4': 'But I want to make sure the public is aware that there is an oversight board and the public is welcome to attend as meetings and report to council not to try to make them effective. But I do know that they try very hard to meet the needs and I don't know the extenuating circumstances of the particular case'",
        "'speaker_4': 'that was raised this evening. But I think that they serve many people and try their utmost. And I want to actually commend Vanessa for her efforts and your staff's efforts.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'So I'm. I'm sorry. Who is this? Just me. Okay. Okay.'",
        "'speaker_1': 'So do we need.'",
        "'speaker_0': 'Do we need a vote on this or is this just council direction?'",
        "'speaker_3': 'I guess we were just looking for direction.'",
        "'speaker_0': 'Direction? Okay. I would say.'",
        "'speaker_3': 'Fine.'",
        "'speaker_0': 'Yeah, I'd say the majority are saying we like option one with the enhancements of something akin to keep Alameda housed and something akin to a community land trust. Council are not quite.'",
        "'speaker_3': 'And I think that generally is agree. So I am definitely losing interest in the Marina Village and personally. So I just want to make that clear in my kind of transitional housing comments that staff is aware and also I would be interested in looking at if we could do the bottle parcel for less because it's not doesn't'",
        "'speaker_3': 'have the purchasing of the. I would like to look at how we can provide some, whether it's just water and sewer or whatever else, infrastructure support for for reshape. Oh.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'I wasn't in there, but in the city manager's recommendations, that was kind of hidden in some clever language.'",
        "'speaker_0': 'No, I meant to say. I meant to say exactly that. Thank you for reminding us. Thank you.'",
        "'speaker_3': 'I just want to thank you.'",
        "'speaker_0': 'Okay. All right. Okay, everyone, thank you so much for your input and thank you staff for all your hard work on this. All right, then we are moving on to item six D.'",
        "'speaker_2': 'Adoption of resolution and approving a revision to the public safety retiree. The provisions in the Executive Management Compensation Plan to provide up to five years of service credit for time served as chief, assistant chief and or Deputy Chief in another agency.'",
        "'speaker_0': 'Thank you. And I believe we have our human resources director, Nancy Bronstein, joining us.'",
        "'speaker_1': 'Yes, she's coming. Okay, good.'",
        "'speaker_0': 'Here she is. Welcome, Miss Bronstein. And Madam Kirk, do we have public speakers on this item? Not we do not. Okay, then I am closing public comment and we will just launch right into Ms.. Braunstein. Welcome. Welcome. Good evening, Mayor.'",
        "'speaker_1': 'Council members. I wanted to provide a brief a brief background.'",
        "'speaker_2': 'For you on this item before you tonight. In 2000.'",
        "'speaker_0': '19, city council approved.'",
        "'speaker_2': 'A modification to public safety, retiree health benefits for public safety chiefs hired from other agencies. And this modification allowed up to five years of service credit for actual time, served as a police or fire chief and another agency toward the ten years of service credit required to earn a retiree medical benefit from the city of Alameda.'",
        "'speaker_2': 'The item before you.'",
        "'speaker_0': 'Tonight is to is.'",
        "'speaker_2': 'Requesting to include time served as a deputy or assistant chief at another agency toward the five years of service credit. So we're just looking to expand who is eligible for that five years of service credit. And I am happy to answer any questions you may have.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Okay. Councilmember Herrera.'",
        "'speaker_4': 'Spencer thank you, Mayor. I have clarifying questions with Brownstein and thank you for your initial comments. The retiree medical benefits that you're speaking to. Can you describe what that is, that essentially lifetime medical or what is it?'",
        "'speaker_1': 'It is a single.'",
        "'speaker_2': 'Party lifetime medical benefit.'",
        "'speaker_0': 'So the.'",
        "'speaker_1': 'At some point, the employee.'",
        "'speaker_2': 'Transitions to a medicare supplement plan.'",
        "'speaker_0': 'But it is a.'",
        "'speaker_2': 'Lifetime benefit.'",
        "'speaker_0': 'For the employee.'",
        "'speaker_1': 'Only.'",
        "'speaker_4': 'And is that offered to all employees of the city of Alameda?'",
        "'speaker_1': 'It's offered to public safety employees. So not all.'",
        "'speaker_0': 'It is it's been negotiated.'",
        "'speaker_1': 'For public safety.'",
        "'speaker_4': 'All right. Thank you very much. So. So I don't know if anyone else had any questions before I offer my comments.'",
        "'speaker_0': 'Any other clarifying questions for Mr. Bronstein? Counsel. Go ahead with your comments. Councilor Hurst Herrera Spencer.'",
        "'speaker_4': 'Thank you, Mayor, and thank you, Miss Bronstein, for those answers. So at the policy level, I have concerns about this proposal. I we have employees, obviously, and I support our current employees. And we have a system of how they progress.'",
        "'speaker_4': 'I understand that this actually encourages or somehow chips away, I would say, at the policy level of bringing in people from outside for the highest level positions that worked in other agencies and reduces somehow the benefits over time for our long term employees at the policy level.'",
        "'speaker_4': 'And so and I think we all know that this retiree lifetime medical benefit is only offered to public safety, is extremely expensive for the city. And and we know that we have significant amounts currently of pension and other pension, OPEB, other pension.'",
        "'speaker_4': 'You all can help me with employee benefits, which is what this medical falls under. So I, I will not be supporting this. And I am very concerned about continuing to, at the policy level, chip away at our. But I feel like for our long term employees then to have outside employees be brought in at the high level'",
        "'speaker_4': 'and offer these very expensive benefits for the city. That to me makes sense for a long at this point. This is what our city has decided long term for our long term employees that are eligible for this essentially lifetime medical benefits for this one group.'",
        "'speaker_4': 'Most of our employees are not eligible. And most people in the United States, of course, and in our city and our taxpayers do not receive lifetime medical benefits. So I think it's a serious problem to continue to lower the bar of who this is offered to.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. The council comments. Councilmember decide.'",
        "'speaker_5': 'My quick comment is I could understand making changes for the head positions. But but I'm not I'm I'm not convinced about the changes for the assistant or the deputy positions. I think we really should be encouraging people to kind of grow through the ranks rather than kind of slotting people from outside into the higher positions.'",
        "'speaker_5': 'So but I understand why we might need to have these kinds of of of packages as if we're trying to recruit someone who's going to, you know, take the top positions. I'll leave it at that.'",
        "'speaker_0': 'This is meant for the fire chief. Correct.'",
        "'speaker_5': 'Assistant Chief and or deputy chief.'",
        "'speaker_1': 'Oh, to.'",
        "'speaker_2': 'Clarify, it's just to provide service credit for somebody who's being hired at that top position. So it would only be for somebody coming from the outside to be the fire chief.'",
        "'speaker_1': 'Or police chief to give.'",
        "'speaker_2': 'Them credit for time served, maybe in a larger.'",
        "'speaker_1': 'Agency where they were an.'",
        "'speaker_2': 'Assistant or a deputy.'",
        "'speaker_5': 'Oh, okay.'",
        "'speaker_0': 'But where they aren't coming as a fire chief, there is not an equivalent position, not a lateral. Exactly. It's a move. Did you want to add to that, Mr. Levitt?'",
        "'speaker_3': 'Yes. And there was one other clarification when I looked at the resolution. It had been changed in the recommendation, but not in the resolution that I didn't see in the resolution. And that was we we were recommending that it was only that credit was only given if they worked in another agency and had benefits of similar type'",
        "'speaker_3': 'in that other agency. And then I think.'",
        "'speaker_1': 'I'm sorry, that.'",
        "'speaker_3': 'Did not get it got changed in the resolution, but I think you got the early on draft and not the final resolution that had that new language. I was just looking at the resolution just now. But if you look at the recommendation and say manager recommendation, we only are recommending that they would get credit if they had'",
        "'speaker_3': 'a similar type benefit. So only if they had retiree health in another organization and they were moving over here to be the chief.'",
        "'speaker_0': 'Councilmember de SAC.'",
        "'speaker_5': 'Okay, great. With that clarification, I'd support this. I think I just talked with the city manager about this. I thought this was for also for the assistance and bringing in deputies. So I'm glad that's not the case.'",
        "'speaker_0': 'Thank you. Other comments? Okay. Maybe we have a real cover, please.'",
        "'speaker_2': 'We still need that motion.'",
        "'speaker_0': 'I'm so sorry. All right. We have a motion to approve. Do we have a second? Do we have a second from anyone? Well, if we don't have a second, we won't have a vote. But you know that by now.'",
        "'speaker_0': 'Does anyone want to offer a substitute motion? Amended motion. Well, I would say this motion dies for lack of a second. All right. Now, remember, they thought.'",
        "'speaker_5': 'What if we go with this and then sunset this after five years just to see how it goes?'",
        "'speaker_0': 'Could you explain what you mean by that?'",
        "'speaker_5': 'That we would just adopt the resolution but say that we're going to five years from now revisit this? If we want to go if we want to continue this or not. And so that would be part of the motion.'",
        "'speaker_5': 'If I had to a second. If we if we.'",
        "'speaker_0': 'You need to make a motion because the previous one failed.'",
        "'speaker_5': 'Or we can make the motion and then I can amend it.'",
        "'speaker_0': 'You want someone to make the motion that you're proposing?'",
        "'speaker_3': 'So can I just ask can I say quick question? My understanding is you're basically you're you're suggesting that we continue what we have done, which is basically negotiate every contract with a new chief and give them this. I mean, we have basically given every chief that has been here in the last ten or 15 years the same'",
        "'speaker_3': 'benefit that has come from outside. This is not a new thing. I mean, I'm happy if that's the way we get to to a vote. I'm happy to to to put some sort of timeline. I just want to call out that it's you know.'",
        "'speaker_5': 'I would put a timeline on it.'",
        "'speaker_0': 'I I've got a question about council remarks, its statement. I am trying to remember in the last 10 to 15 years how many chiefs from the outside we've had. And I know that that predates the sorry city manager and h.r.'",
        "'speaker_0': 'Director. We did have a recent fire chief from an outside agency, the other fire chiefs. I can remember all came from within rfd, the before Chief Joshi. The last two. 1 to 3? No, at least two, three. Fire and police chiefs.'",
        "'speaker_0': 'I can remember all came from APD Council over NOx. Wait, am I missing something?'",
        "'speaker_3': 'No, but that's still the the the external candidates that have come in have been that we have offered this because it's a problem hiring from outside of. People are losing a major benefit that they have it. There exists I mean we went through a whole thing with the last fire chief because some people were really wanted an'",
        "'speaker_3': 'outside fire chief. I think that I think it's important to have a wide pool. So anyway, I. I think you said contradict what I had to say. If if Tony needs a timeline, I'm happy to just just move this forward.'",
        "'speaker_0': 'Councilmember Herrera. Spencer, did I see your hand go up?'",
        "'speaker_4': 'Yes. Thank you, Mayor. And I did want to thank you for your comments. When you. I think you're right in regards to the promotions from within the department. Historically, other than the most recent fire chief and now the most recent police chief, and this policy from it looks like this started 2019.'",
        "'speaker_4': 'So it's not actually that old of giving these credits, but getting back to providing lifetime medical and the cost of that for something that's just come in. I know that we have we have not had those types of candidates very often when they reflect historically.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_1': 'For bringing that up.'",
        "'speaker_0': 'Hey. And a vice mayor of L.A..'",
        "'speaker_1': 'I also just my understanding is, is that we have still had applicants, despite this being the policy, the existing policy, and that people have accepted the job that. That were the top choice. Even with this policy in place, I guess my concern is what's the point of having a policy if ultimately folks are going to come in'",
        "'speaker_1': 'and then immediately try to negotiate or if we're changing this policy now, who's to say that the next time we do a recruitment for a top spot, this happens? And then just the other thing is that we've also heard calls for us to to defund or to limit funding for some positions.'",
        "'speaker_1': 'And this is a significant expenditure. So I would want to have this conversation relative to the city budget. I'm also concerned we, I believe, have started negotiations with a number of different units. And so to Councilmember de SACS point where he was asking what positions this would apply to if we're applying this to the top positions.'",
        "'speaker_1': 'I would certainly hope that this is a conversation that we have relative to, you know, that we would take into account the differences between what our executive compensation looks like relative to our line staff. So at this time, I'm not going to be supporting this for those for those reasons.'",
        "'speaker_0': 'Councilmember thank you both very. Councilmember de SA.'",
        "'speaker_5': 'Yeah, just if I can explain, you know, why I like a time limit. I mean my history of all the fire chiefs and police chiefs that we've had. I always thought we seemed to have like grown people through the ranks.'",
        "'speaker_5': 'So I'm confident in kind of the pipeline that that we've created. I think for the most part, every single one of them, you know, have just been stellar. The first out of city police chief before I began on city council, as I remember, was Chief Mathews for the police.'",
        "'speaker_5': 'And then but then he had, you know, created a great staff and then that grew from from there. And then there was another police chief, I think came who came from Tibbets. Wayne Tibbets came from outside of Walter Tibbets.'",
        "'speaker_5': 'But I think, you know, we've all Noonan was from within chief where Larry was from within. And on the fire chiefs, I think there's been a whole series of fire chiefs from within. And I think it's a pipeline that has worked.'",
        "'speaker_5': 'So that's why I'm kind of like in the direction of I mean, I get the idea of creating something where we kind of encourage people to come from outside. And that's great. You know, you certainly want to test the field, but I'm kind of biased towards our kind of system that we have in place.'",
        "'speaker_5': 'But I'm willing to experiment because if it means like getting the fire chief that that we were on the cusp of getting now, then great. You know, that's why, you know, I'm more than happy to experiment by putting like a time limit on this thing where we're going to revisit this in five years.'",
        "'speaker_0': 'Thank you, counselor. If I understand correctly and Mr. Levitt can confirm or deny this isn't a condition of the.'",
        "'speaker_1': 'Oh, no, it's not prospective chiefs.'",
        "'speaker_0': 'Fire chiefs, employment. It wasn't part of the employment package when that person applied. This is, you know, something that's being added on where I understand the credit in our department toward your lifetime medical benefits and I will just make a plug for fire.'",
        "'speaker_0': 'You heard that long list of our members of AFGE who are out fighting fires in various parts of our state. They're not just fighting fires on the line. They're breathing that air. It is very dangerous. It's harmful. It's unhealthy.'",
        "'speaker_0': 'Do they deserve lifetime medical benefits? You bet. I can justify that for folks who have worked here at AFGE and they should get that credit. I have a harder time seeing it for someone coming from the outside who was willing to come knowing that wasn't a part of the package.'",
        "'speaker_0': 'And also just the timing of we are going to have to grapple with how we pay for our unfunded OPEB liability. So those are those are my concerns. But at some point, we're going to take a vote. Councilmember decide that you.'",
        "'speaker_1': 'Well, it just.'",
        "'speaker_5': 'Seems to me then by putting a time limit on it, where it says that we're willing to experiment, but we're willing to draw back. So, I don't know, maybe I'm trying to have my cake and eat it, too, whatever.'",
        "'speaker_0': 'There's nothing wrong with that. So if I recall correctly, you made your motion, Councilmember de so.'",
        "'speaker_5': 'All right, I'll accept staff's recommendation, but with a caveat that I'd like to add that we that we sunset this in five years, at which point in time we would revisit it.'",
        "'speaker_0': 'Okay. So your motion is to OC is to accept staff's limitation with the caveat that it sunsets in five years or we revisit it in five years.'",
        "'speaker_5': 'So why you? It sunsets every year. Is it it or not? It sunsets.'",
        "'speaker_0': 'It sunsets in five years. Okay. That's your motion. Okay. And then Councilor Knox. Right. Is willing to second. Okay. Any further discussion? Councilmember a councilmember I always want to add you to the Council.'",
        "'speaker_1': 'Mr..'",
        "'speaker_0': 'Welcome aboard.'",
        "'speaker_3': 'But I would just request that you would add to that, that it would be consistent with the staff recommendation to amend the resolution that would only be for benefits they similarly had in another organization that would not exceed benefits.'",
        "'speaker_3': 'They had another organization.'",
        "'speaker_0': 'I can see that councilor dislike accepts that and I think you should count Councilmember NOx why it accepts that modification for his second. All right. That OC Councilmember Harry Spencer. You're muted. Council member.'",
        "'speaker_4': 'Okay. Thank you. At least one council member raised the issue of trying to train our first responders so that they are able to move up in the race. And I think that that is a policy a policy level I strongly agree with.'",
        "'speaker_4': 'And and that is something that historically our city has tried to do. So I just want to say that that is that is part of why I will not be supporting this. I have serious concerns about this type of policy.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Spencer. Okay. We ready for a vote? Let's take a roll call vote count. And, Madam Clerk.'",
        "'speaker_2': 'I'm sorry. I heard Spencer.'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'Not quite.'",
        "'speaker_3': 'I Vella.'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'Mayor Ashcraft.'",
        "'speaker_0': 'No.'",
        "'speaker_1': 'That fails. Two, two, three.'",
        "'speaker_0': 'Oh, okay. All right. Thank you, everyone, for your time and all your thoughtful comments. And they were indeed thoughtful. All right. So then we are closing item 60 and moving on to item six E and I believe we have some new folks coming on to the screen for this one.'",
        "'speaker_1': 'Yeah, well.'",
        "'speaker_0': 'While they're arriving, do you want to introduce that? I didn't.'"
    ],
    "Introduction of Ordinance Authorizing the City Manager to Execute a Second Amendment to the Lease with Dreyfuss Capital Partners, a California Limited Liability Company to Extend the Term for Five Years for Building 29, Located at 1701 Monarch Street, at Alameda Point.  (Community Development 29061822) [Not heard on July 20, 2021]": [
        "'speaker_2': 'A quick introduction of ordinance authorizing the city manager to execute a Second Amendment to the lease with Dreyfus Capital Partners, a Californian limited liability company, to extend the term for five years for building 29 located at 1701 monastery did Alameda point.'",
        "'speaker_0': 'Thank you. And hi we have our community development director Lisa maxwell and I see we have at least in name only and the Cano Lisa manager out of Alameda Point and Lori Curtis, welcome. So there you are, highness.'",
        "'speaker_0': 'What kind of I like seeing all of your nice faces. So who wants to take the lead on this one?'",
        "'speaker_1': 'I'm going to start by saying and we are as part of our commitment to next gen leaders in Alameda for the city of Alameda. We're going to have Ms.. Lori Curtis, who is in our department. She's management and she's going to do the presentations on the leases tonight.'",
        "'speaker_0': 'It's very nice. All right. Thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'My name is Laurie Curtis. I'm with the Community Development Department. Good evening, Mayor and council members. The first item I have for you this evening is a lease renewal for Building 29, which is located at 1701 Monarch Street.'",
        "'speaker_1': 'This is a.'",
        "'speaker_2': '59 month lease extension for Building 29, which is one of our last remaining multitalented shop and office spaces at Alameda Point. Our existing tenant, Dreyfus Capital Partners, has been at that location since 2009 and the diversity of our workforce at Alameda Point with skilled fabricators, students, fabricators, welders and artists.'",
        "'speaker_2': 'They work in a variety of mediums, including wood, metal and glass. This lease renewal is for 59 months, which would terminate January 31st, 2027. The current monthly rate is $4,702 a month, and that will increase to $4,843 at the lease extension and then increased by 3% every 12 months thereafter.'",
        "'speaker_2': 'This would represent a total revenue increase for the base reuse fund of $237,850. I would note that a previous concern raised in council discussion was that this term may delay development of the park. However, we have consulted with the Recreation and Park Director Woodridge and she's confirmed that the term is consistent with the long term development plan'",
        "'speaker_2': 'strategy.'",
        "'speaker_1': 'As a precaution, however, we have implemented.'",
        "'speaker_2': 'A termination rate with 12 months notice.'",
        "'speaker_1': 'For the city. I hope that you'll.'",
        "'speaker_2': 'Prove this.'",
        "'speaker_1': 'Week's renewal. Thank you very much.'",
        "'speaker_0': 'Thank you. Nice report. All right, madam Kirk, I should have asked, do we have any public speakers?'",
        "'speaker_1': 'We do not.'",
        "'speaker_0': 'Our public speakers have all gone to bed. Okay, I'm going to close public comment, but I see city attorney Eben Shan's hand up. So I'm going to call on you first.'",
        "'speaker_3': 'Madam Chair, members of the council, I just want to make one point of correction. For the record, of course, I believe the title of the item still says five years, but the substance of the staff's recommendations, clearly four years and 11 months.'",
        "'speaker_3': 'I just want to.'",
        "'speaker_0': 'Yes.'",
        "'speaker_3': 'It's clearly a reflect that the council action here is for four years and 11 months and not five years.'",
        "'speaker_0': 'Yes. Thank you for that. Because you're right, the ordinance needs to be the title. The ordinance needs to be changed, too. Thank you. Okay. We've noted that and I'm sure city clerk is making the changes as we speak.'",
        "'speaker_0': 'Councilmember Harris Spencer, I think I saw your hand up.'",
        "'speaker_4': 'Thank you, Mayor. I'd like to move to accept this item. I think it's actually one of my. I would encourage the public to go out there if you haven't already been there. It is one of my favorite, I guess, buildings and the tenants that we have there to give them this opportunity to continue this craftsmanship that I'",
        "'speaker_4': 'think is extremely unique and it is something that really adds to the diversity and culture of our community. I'm going to say the entire community, not just the point. If you go out there, there's a lot of sculptures.'",
        "'speaker_4': 'If you have the opportunity to meet with some of these tenants and many times they're they're happy to talk with whomever and show off their craftsmanship. It's a very broad diversity of work that you'll see at these skilled fabricators, welders, artists, at work, in steel, metal, glass.'",
        "'speaker_4': 'It's fascinating. And I think it's wonderful that we are. I mean, I want to commend and applaud staff for working this out and bringing it to us, because I've been very hopeful that we will see this extension. And there are so few places, sadly, you know, in the East Bay, maybe the you know, definitely the East Bay'",
        "'speaker_4': 'where you craftsmen like this can live and work. And I think it's just wonderful that we are trying to figure this out. So thank you and I thank you.'",
        "'speaker_0': 'Do we have a story.'",
        "'speaker_1': 'This.'",
        "'speaker_0': 'Great. Do we have a second? Councilmember. Wait 8 seconds. Any further discussion? Should we take a vote? Let's vote, madam. Oh, I'm.'",
        "'speaker_1': 'Sorry.'",
        "'speaker_0': 'Of course you can. Of course.'",
        "'speaker_3': 'I will. I will. Second everything, Councilmember Herr Spencer said. I agree with it all. And I just want to point out that our plans do not require the removal of this building for the park. The fact that it exists on the map with the Bay Park.'",
        "'speaker_3': 'And while it could disappear some time, I just want to make it really clear that no decision has been made that this building is going away. And I think that it's I really appreciate staff making sure that we have both options in our hands.'",
        "'speaker_3': 'But I just wanted obviously very careful thought out plan, but I just wanted to not accidentally send us.'",
        "'speaker_0': 'Thank you. Thank you. And you know what? Thank you for that comment. I made a pause, everybody, because I just got the five minute warning from the city clerk. Okay, we have to decide and we have to decide fast.'",
        "'speaker_0': 'We are on item five e. We still have on the rest of this agenda F, G and H on the regular agenda. And then we have a whole slew of council referrals. I'm willing to go up to the stroke of midnight, but not a minute beyond.'",
        "'speaker_0': 'Do we want to make a motion to complete our regular agenda and as much of the council referrals as we can get to by midnight, Councilor Harris Spencer had her hand up first.'",
        "'speaker_4': 'Thank you, Mayor. I would be supportive of continuing to hear six F, which is the least for a small sized pig mind and then six H, which is the Sun newspaper, but not six G. I think that that recommendation is not time sensitive, and that could it could actually take a while to hear.'",
        "'speaker_4': 'And I'd like to be able to spend more time on that one. And I think that's so that I think that one could wait and I would hold off on honestly all the referrals at this point.'",
        "'speaker_0': 'Okay. And I'll just say that I'm not going to support anything that doesn't finish the regular agenda tonight. Councilor Knox, what you had your hand up to?'",
        "'speaker_3': 'I was going to say, let's just work as much of this agenda in order as we can up till midnight, okay?'",
        "'speaker_0': 'All right. So that was the yeah. The most recent motion. Do I have a second for that motion? And we've got to move faster if it's going to go by default and we end in 3 minutes. Second by vice mayor, you going to second?'",
        "'speaker_0': 'Okay. Your seconding. Okay. To just see how much we can get through up to the stroke of midnight. And then we end Cinderella. Okay. May we have a roll call? Vote, please?'",
        "'speaker_2': 'Each thank.'",
        "'speaker_3': 'Oh, yeah.'",
        "'speaker_2': 'Her Spencer.'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'Not quite.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Mayor as the.'",
        "'speaker_0': 'Ashcraft High.'",
        "'speaker_2': 'That carries 4 to 1.'",
        "'speaker_0': 'Okay, let's go. We're back at it. Okay, let's see. We had the motion on this item by Councilmember Hirsch, Spencer Knox. Why did you second this? What you did okay. And did we finish our discussion? We finish our discussion because now we're on a race course.'",
        "'speaker_0': 'So, madam, correct me, we have a rural covered place.'",
        "'speaker_2': 'And summer day.'",
        "'speaker_5': 'Yes.'",
        "'speaker_2': 'Harry Spencer. I Knox.'",
        "'speaker_3': 'Quite I.'",
        "'speaker_2': 'Villa. I may or as Ashcroft high carries my five eyes.'",
        "'speaker_0': 'Thank you. Thank you very much, Staff. Nice to see all of you. Thank you for the great explanations.'",
        "'speaker_2': 'I will stay on for the next one.'",
        "'speaker_0': 'Well, don't go away, then. That would save time, right? Okay. So, Madam Clerk, do you want to introduce item six for us, please?'"
    ],
    "Introduction of Ordinance Authorizing the City Manager to Execute a Second Amendment to the Lease with Small Size Big Mind, Inc., a California Corporation, Substantially in the Form of Exhibit 4, to Extend the Term for One Year with One 12-Month Extension Option for Building 35, Located at 2450 Pan Am Way in the Main Street Neighborhood at Alameda Point. (Community Development 29061822)": [
        "'speaker_2': 'Introduction of ordinance authorizing the city manager to execute a Second Amendment to police of small size. Dig Mine Inc a California corporation substantially in the form of Exhibit four to extend the term for one year with 112 month extension option for Building 35 located at 2450 PanAm Way in the Main Street neighborhood in Alameda Point.'",
        "'speaker_0': 'Thank you. All right. Is that back to you, Miss Curtis? That's very nice. Okay, please.'",
        "'speaker_2': 'So, as Ms.. Larger said, this is a lease renewal for Building 35, which is located at 2450 PanAm Way. It is a 12 month extension term with 112 month extension option. Small size. Big mine is a child care and preschool provider in Alameda.'",
        "'speaker_2': 'They've been here since 2006 and expanded over to the West End in 2018. Not only do they help meet the growing demand for preschool and child care services in Alameda, but we've gotten substantial feedback that the imaginative and inviting playspace they've created at Alameda Point is somewhere that adults and children alike would love to play.'",
        "'speaker_2': 'So I hope that you're.'",
        "'speaker_0': 'One of them.'",
        "'speaker_1': 'Thank you. Yes.'",
        "'speaker_0': 'Thank you for that. I don't know if I've never had a chance to. I should call them and invite myself over. I haven't had a chance to tour the facility, but if you peek over the fence, it's like Miss Curtis said.'",
        "'speaker_0': 'The play yard just would inspire imaginations. You just want to get in there. Hands on. Can we have. Oh, I'm sorry. I should ask, do we have public speakers on this?'",
        "'speaker_2': 'We do not.'",
        "'speaker_0': 'All right. In closing, public comment on this item. Councilor Harry Spencer.'",
        "'speaker_4': 'Thank you, Mayor. I'd like to move this item. And I do want to comment that I think they provide a very critical need of daycare on the West. And and I, I supported their expansion back in 2018. And I think that they've done an amazing job.'",
        "'speaker_4': 'And so I think and again, I want to thank staff for your efforts of bringing this back and recognizing the timeline. So this is one year, 112 month extension, balancing everything that you all have in front of you.'",
        "'speaker_4': 'But I am very happy to support this and appreciate your work to get us to 12 months. Get get the parents and the children. The 12.'",
        "'speaker_0': 'Months. Thank you. Do I have a second? Councilmember Marks 5 seconds. Any further discussion seeing then maybe have a roll call vote please.'",
        "'speaker_2': 'Remember I Herrera Spencer.'",
        "'speaker_1': 'I knocked right.'",
        "'speaker_3': 'By.'",
        "'speaker_1': 'Vela high.'",
        "'speaker_2': 'Mayor as the Ashcraft High that carries I.'",
        "'speaker_0': 'Write perfect. Thank you so much, staff.'",
        "'speaker_1': 'You.'",
        "'speaker_0': 'Don't think you're on our next run, but thank you so much. I appreciate your efforts and good.'",
        "'speaker_1': 'Work.'",
        "'speaker_0': 'And great votes. Right. All right. Item six G and a bet. We're going to be joined by public works director or we are.'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'You want me to read the title?'",
        "'speaker_0': 'Yeah. Yeah. Why don't we keep things moving? Yeah, please.'",
        "'speaker_2': 'Recommendation Implement water conservation measures in response to drought and provide direction on further city of Alameda water reduction efforts. And the rec and park director will also be coming up.'"
    ],
    "Recommendation to Implement Water Conservation Measures in Response to Drought and Provide Direction on Further City of Alameda Water Reduction Efforts. (Public Works 31041500)": [
        "'speaker_0': 'Oh, very nice. All right. So I see. Before I start, she is Public Works director Aaron Smith is back and we are also joined by recreation parks director Amy Wooldridge. Greetings and Dylan Hammond. Refresh my recollection.'",
        "'speaker_2': 'Allan is from our Environmental Services Division in Public Works.'",
        "'speaker_0': 'Perfect. Welcome to you. All right, so who wants to take the lead on this one?'",
        "'speaker_2': 'I'll be giving the presentation tonight. Lara, am I sharing? Mike, your show? Wonderful. Excellent. So good evening again, Madam Mayor. Members of the Council, Aaron Smith, Public Works Director. And as you've noticed, I have I'll be giving a presentation, but Dillon from Environmental Services and Amy, our recreational park director, are here for the subsequent conversation.'",
        "'speaker_2': 'So the presentation item and presentation tonight, we'll cover a brief, brief background on the current state of the drought, and we'll also explore some conservation efforts related to city operations. And I just wanted to make sure that that was clear.'",
        "'speaker_2': 'We're talking about the 200 or so water meters that support city operations. So parks and landscape in the right away. We are talking conservation population wise, although that's important. The conversation tonight is focused on water that's specific for city operations.'",
        "'speaker_2': 'Ultimately, we will be seeking input and direction from Council on certain conservation efforts that have an upfront investment of funds will be seeking guidance on whether to move forward with those. And if so, when? Next slide, please. So just for a brief background, it wasn't that long ago that staff was before council in 2014 and 2015.'",
        "'speaker_2': 'During the drought, then Governor Jerry Brown had called for voluntary 20% reductions at the start of that drought. Alameda had opted to consider those reductions mandatory and moved forward pretty quickly thereafter to identify reductions in city operational water use.'",
        "'speaker_2': 'They within the next couple of months, we were able to identify and implement a reduction in 29% over city overall city water use. That put us in a really good position because subsequent to that, the governor actually had turned the voluntary reductions to mandatory and we were positioned well for compliance.'",
        "'speaker_2': 'Next slide. So just to bring us current on this drought, this past winter was the second driest winter on record in Columbia River watershed. That is the famous Maine water source. So following that, in April, you spent months board of directors declared a stage one drought and with that voluntary reductions at 10%.'",
        "'speaker_2': 'Governor Newsom also issued an executive order this summer in July for voluntary reductions of 15%, and those are statewide. And during that same time, this past summer at the city manager's direction, the city convened an interdepartmental team to start to begin discussions on ways to conserve water.'",
        "'speaker_2': 'And as shown in Arrow, that's color red. We are here this evening to give a report on those discussions to date and ultimately get gets council's input on next steps. We do and will likely intend to return back to Council sometime next year to update on the status of implementation of these conservation efforts.'",
        "'speaker_2': 'Next slide. So as I mentioned, the conversation nice about city operations. And if you look at the pie chart on the left, that is broken down in the following categories. And it's probably not a big surprise that parks and landscaping, the public right of way, which is managed by public works, are our biggest water users.'",
        "'speaker_2': 'The other category is mostly our city buildings. And you may be wondering why is Alameda Point called out separately? Just a reminder that the old navy installed water system is still managed by the city and will be until that infrastructure is replaced with East Bay infrastructure.'",
        "'speaker_2': 'The master meters that serve that water system are in the city of Alameda, his name. And so it's considered city use. So it's called out separately. We do essentially supply the water delivered to us by East Bay mud to the point.'",
        "'speaker_2': 'So you'll see that 16% of our water use, our total water use and annual average is 139 million gallons a year. If we were looking to meet the 15% voluntary reductions, we'd be looking for somewhere close to 21 million gallons a year in reductions.'",
        "'speaker_2': 'Next slide. So the next couple of slides, I'm going to present ways that we can reach those reductions. This first list looks like a lot, but I can go over them briefly. These are conservation measures that staff are recommending to be in place immediately and there's no cost to implement these or there are funds that have been'",
        "'speaker_2': 'previously appropriated for projects. If these in total are implemented, we estimate that about 10% overall city water use could be obtained. So these measures include washing city vehicles no more than twice per month, turning off any decorative fountains, the fire department doing dry drills whenever possible.'",
        "'speaker_2': 'The increase of compost around park trees to increase water retention, reduction of irrigation up the marshland. That's the large grass area across the street from City Hall West. Reducing that by 25% and the discontinuation of manual irrigation in various areas throughout Alameda Point.'",
        "'speaker_2': 'There will be a esthetic impact, although we feel it's reasonable given the large amount of reduction that could be obtained. You can see it's 3.6% overall city water use. In addition, staff recommending turning off the water spigot of the new and smoking launch facility.'",
        "'speaker_2': 'Amy, can there's questions Amy can speak further about why that's being put forth here. We have a marina village improvement project that was funded. And many years ago, that's getting ready for construction. There's a large amount of long conversion that's part of that project and the long conversions going to drought tolerant landscape.'",
        "'speaker_2': 'And we also will continue the work and really it's Dylan who is on on the meeting with us here tonight that's just doing an amazing effort and looking at much of the data given to us from East Bay mud at our water use and able to visualize that data and strategically identify areas to target for leaks and'",
        "'speaker_2': 'reductions in irrigation. So we feel if we focus on this a bit more, we should be able to squeeze out 5% more of additional water reductions. So again, just to summarize these efforts, we feel if we do them and we do them now, we would be on target to obtain a total 10% reduction in total city water'",
        "'speaker_2': 'use. That's one. These last two slides are specifically where we'd be seeking counsel direction on, since these measures have upfront cost associated with implementing them and they essentially can fall into two buckets. One is smart irrigation, which the slide is touching on and the next slide or lawn conversions.'",
        "'speaker_2': 'So smart irrigation is using additional sensors to refine the actual amount of water used at irrigated sites. Much of this technology is implemented already in the public right away, especially in new developments and in certain park locations. The 13 or so sites listed here do not have smart irrigation yet, and so this table essentially summarizes the estimated'",
        "'speaker_2': 'reductions that could be obtained. The cost for all of the sites listed would be an upfront investment of 100,000. And if you see down at the bottom of the table in the middle middle column, we believe this could reach an additional 3.6% reduction in city water use on the column.'",
        "'speaker_2': 'On the right does note, when you reduce water, it's not only good for the environment and for building resiliency, it's also good for your bottom line since you save money in your water bill. And so just to to look at the economics of this sort of investment, the column on the right presents the estimated utility savings showing'",
        "'speaker_2': 'that this upfront investment would actually pay for itself in about two and a half years. Next slide. So similar analysis we did for long conversions. I did want to start this discussion here, noting that Eastbay emerged in response to the drought is offering what they're titling a super rebate for lawn conversions that is converting eligible sites from'",
        "'speaker_2': 'lawn to drought tolerant native landscapes. And if certain criteria are met, the site is eligible for up to $15,000 in rebate. We have listed here city facilities that have lawn that would be good candidates for conversion using just a very basic conversion calculator.'",
        "'speaker_2': 'We have estimated costs. I did want to note that we would go through a design process, particularly for City Hall and City Hall West, which have historic requirements. We would go through a design process and firm up these estimated costs.'",
        "'speaker_2': 'But we do think that for purposes of this initial discussion, these these costs are in the range. So sorry to interrupt, but that is the ten minute presentation.'",
        "'speaker_1': 'Oh, we would need a vote to continue on.'",
        "'speaker_0': 'I'll make a motion to give. And this is about how much longer did you think you needed minute tops?'",
        "'speaker_1': 'One minute before.'",
        "'speaker_2': 'I pass it back to you, counsel for your input and guidance.'",
        "'speaker_0': 'Okay, I move that. We give Miss Smith one more minute. I think Councilmember Knox Wade just seconded. Is that correct? Okay, we need four. Yes, that's me. We have a roll call vote, please. Ms.. Whitaker.'",
        "'speaker_2': 'It's invitation.'",
        "'speaker_3': 'Yes.'",
        "'speaker_2': 'Sir. Spencer.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'It's not quite.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Villa. I may or as Ashcroft I. That carries by five eyes.'",
        "'speaker_0': 'Please continue.'",
        "'speaker_2': 'Sorry about that. I'll be quick. So these sites listed here, we have the estimated costs and estimated water reductions. So if all of these sites are implemented, you get an additional 3% in water reduction. The return on investment is a bit slower for land conversions, but it would be an upfront cost.'",
        "'speaker_2': 'You can see is about 2.34 million. And if you look at the annual utility savings, it would take upwards of 60 to 70 years to recover cost. But again, economics is not the only value that we apply for water conservation.'",
        "'speaker_2': 'Next slide, please. So just to quickly summarize, the study uses 139 million gallons of water per year. We're looking to target if we're looking to reach the voluntary reductions at the statewide level, currently that is 15%. The measures that I presented this evening do total 16.6% total.'",
        "'speaker_2': 'So if we implemented everything, we would be in compliance with the voluntary reductions statewide currently. So again, what we are looking to council this evening I'm sorry, last slide from last minute is that but what is our discussion for council this evening is which of the measures, particularly the smart irrigation and the long conversions are you interested'",
        "'speaker_2': 'in moving forward with? And did you want to move forward with them now, or do we want to see what occurs with the drought and or what have you of the budget?'",
        "'speaker_0': 'I think that's time. Thank you so much, Miss Smith. Okay.'",
        "'speaker_1': 'So, council, we are.'",
        "'speaker_0': 'Please go back to Gallery. Right. Yes. Well these are they. Yeah. Okay. So and those are the questions in the staff report as well. Okay. I saw council member Herrera Spencer's hand go up first, followed by Councilmember De Sykes ahead.'",
        "'speaker_4': 'Thank you. I have a clarifying question in regards to the rebate from East Bay mud for the 15,000. How many projects do you need to qualify for that?'",
        "'speaker_2': 'But my understanding is each individual meter, which in this case would be each individual site would be eligible for the 15,000. So we could pursue one project. We could pursue.'",
        "'speaker_1': 'All our.'",
        "'speaker_2': 'Measures at nine sites there. The thing that one thing I would mention is the rebate currently is only valid through the end of the calendar year. I don't know if you speak but is will be extending the program, but it is currently valid through the end of the calendar year.'",
        "'speaker_4': 'So can you expand on that? Does that mean that the city would have to have the projects completed by the end of the calendar year or voted on to be approved? What does that mean?'",
        "'speaker_2': 'Yeah, it's a good question, Councilmember. I was not able to get clarity from Eastbay about on that, whether a submittal of an application by the end of the calendar year would suffice to be eligible for the project. So I don't have that information with me this evening.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'So we'll just quickly interject that I was texting a little bit earlier with the manager of water conservation at East Bay Med, and I will forward that information to you because she's happy to assist. I don't have the answer to that either.'",
        "'speaker_0': 'I'm hoping that if the application is submitted by the end of the year, that would suffice. But I.'",
        "'speaker_2': 'Will get. That's my minor, too. Yeah. Yeah.'",
        "'speaker_4': 'My next question is the 2.3 million, where would that come from?'",
        "'speaker_2': 'So right now we would be looking towards the general fund for that.'",
        "'speaker_4': 'Okay. So this would be put ahead of other request for the general fund then.'",
        "'speaker_1': 'Or.'",
        "'speaker_2': 'That's up for discussion really. It's a challenge to bring this forward now. I know that we're we're essentially asking for input in a standalone budget item and perhaps something for the council to consider as to whether to wait until perhaps mid-year when you have other budget items to consider.'",
        "'speaker_2': 'You know, it's it's it's an imperfect process, but yes, we would. Right now, we're just seeking direction on if we want to move forward with them. We come back with any budget standalone budget amendment.'",
        "'speaker_4': 'So thank you, staff. And in the interest of time, I'll just share that. I do. Thank you for all the savings from that first chart with all the changes in regards. And I do also support the smart irrigation of the $100,000 which pays for itself in a very short amount of time.'",
        "'speaker_4': 'But I do have concerns about the 2.3 million. And so I would I'm happy to hear from my rest the rest of the colleagues at the say thank you.'",
        "'speaker_0': 'Councilmember de said you had your hand. Up next.'",
        "'speaker_5': 'I had two sets of questions. The first question is for Washington Park. The long conversions at city facilities. Washington Park is 36,000 square feet.'",
        "'speaker_1': 'Where where where.'",
        "'speaker_3': 'Abouts?'",
        "'speaker_5': 'Washington Park is this? 36,000 square feet. Is the green area closest to eighth.'",
        "'speaker_3': 'Street or where?'",
        "'speaker_1': 'Where where are we talking about? Hi. Amy Wooldridge, Recreation Parks Director. It's a smattering, honestly, of areas. It's not one large area, it's accommodation, it's several. It's landscaped areas that are not usable, not generally used by the public.'",
        "'speaker_1': 'So. Okay. So small areas for example in the front where we planted some trees and put the new sign, some areas over on central, some areas of lower Washington near the tennis courts. So it's it's a mix of areas, mostly areas that are close to the street and not used for for play or by the public.'",
        "'speaker_1': 'I see. Decorative areas.'",
        "'speaker_5': 'Okay, great. Thank you. A second question is on the installation of rain sensitive smart irrigation clocks. Is the reason why Lincoln Park or Franklin Park is not on here is because they already have those things or similar features.'",
        "'speaker_1': 'That's correct. You're absolutely correct that any parks that are not listed are ones that we've already installed. We've been trying to a couple of parks a year to install these smart irrigation meters.'",
        "'speaker_5': 'Okay, great. Thank you.'",
        "'speaker_0': 'The local next councilmember, they said, oh, and I meant to check with the city clerk. Do we have any public comments on this item?'",
        "'speaker_2': 'You do not.'",
        "'speaker_0': 'Okay. I've got mixed up about which public comment I closed, but I'm closing public comment now on this item. Okay. Further council comments, Vice Mayor Vallas, then Councilmember Knox.'",
        "'speaker_1': 'Right. I just want to make sure for the any sort of vote or conversation on Washington Park that we vote on that separately. I'll recuse myself because of where my home is located, but I'm happy to see this come forward.'",
        "'speaker_1': 'I think we we've since I've joined the council, we've gone through several droughts now. So I think it's really important that we we do our part to try to mitigate. I think I really like looking at especially the proposal relative to City Hall.'",
        "'speaker_1': 'I think that there's a huge opportunity for us to do our part and lead by example. So I really commend staff for for their turnaround on this, knowing that the deadlines are approaching and defer to staff in terms of what they think they can take on.'",
        "'speaker_1': 'I know that the money is is out there. I think that certainly we have a lot we can do. But I want to make sure that we're we're taking things on that we know we can handle. And we're not trying to overexert ourselves relative to just trying to meet this end of year deadline.'",
        "'speaker_1': 'I think that this is going to be an ongoing issue. And so I'm sure there's going to be continued funding. But, you know, so I just but I'm glad that this came forward and I'm glad that we we see all the opportunities and we can get to work on them.'",
        "'speaker_0': 'Thank you, Vice Mayor. Councilmember Knox White. Your muted still.'",
        "'speaker_3': 'Everybody looking at the staff report over there, not at the mute button over here.'",
        "'speaker_0': 'Everyone takes a turn at that.'",
        "'speaker_3': 'The guys had a second. Everything. Vice Mayor Vella said, I appreciate this. I also agree. The only question I have and I don't mean this is a if it's a criticism of anybody else of me in the council, but is whether or not we waited why this was we knew this was coming in March in the drought'",
        "'speaker_3': '. And I think the drought is going to be continuing. So anything we can do for significant long term change that Mike is swapping out the lawns for, for drought tolerant gardens, whatever else I think is is fantastic. I appreciate the.'",
        "'speaker_3': 'The life cycle recoup numbers but at the end of the day, what we really need is just saving water. And if it pays for itself, that's great. And some of this is going to not pay for itself, but also needs to be done in the earlier we do it, the better.'",
        "'speaker_3': 'But Vice Mayor Miller's point, you know, I know Amy and staff, especially in public works, have their hands full with a lot of things. So, you know, I will support kind of a meaningful timeline, but I but I would support, you know, 100% of this and finding the funds to do it.'",
        "'speaker_3': 'And we did just learn that we're on another big transfer tax good, another big business sale that just coming through that's going to, you know, one time funds. These are these this would be a good use of one time funds for us for us to consider.'",
        "'speaker_3': 'And I'm sure everybody in the city has already spent all those one time funds, at least five. But anyway, this to me would be the type of thing that would that would meet that need pretty quickly. So I appreciate this that did to my my direction would be do as much as that as we can as fast'",
        "'speaker_3': 'as possible without, you know, causing harm.'",
        "'speaker_0': 'Thank you, Councilman. Not quite. And I'm going to just say that I am very much in agreement with you and Vice Mayor Vella that the time is now to do this. I think the reason it didn't come sooner, the council, the city manager and I heard a presentation by East Bay Med staff to the mayor's conference, but'",
        "'speaker_0': 'I can't remember what month it was. But it's just I mean, you know, we've had really long agendas, lots going on in front of us. What I'm hoping is that the work that the considerable work that staff put into identifying these potential projects would go a long way toward completing the application.'",
        "'speaker_0': 'And by the way, I just sent you all the information and an email with the information about this is to be made person who is standing ready and able to to help you. So I would hope it wouldn't require too much more extra work.'",
        "'speaker_0': 'But I agree. I think we need to do all these things. I really like the idea of the City Hall lawn conversion to drought friendly landscaping. It can be very attractive. It will be very attractive and it's just a great example.'",
        "'speaker_0': 'We can lead by example. And it's it's so important that we practice what we preach. I mean, we tell our residents to please voluntarily conserve, so we should be doing it ourselves, the one. So I very much support the city manager's recommendation and also his recognizing public works and public works director and the recreation parks director talks'",
        "'speaker_0': 'about and approves the immediate actions recommended. Additionally, authorize one or two demonstration projects that could utilize is be made incentive funding recommends city hall conversion potentially one of the other facilities listed. The one question I have is how much say the historic advisory board should have in putting in drought friendly landscaping to address the drought to and'",
        "'speaker_0': 'to achieve water savings? And yet this has to go before the historic advisory board. I'm I'm having a little trouble understanding that. And again, if we're running up against a deadline to apply for the funds, what I mean, I do see that staff believes that landscaping can be part of a historic property's character defining, defining feature.'",
        "'speaker_0': 'I just wouldn't want to see any delays in what is a time sensitive item. If anyone wants to comment on anyone from staff, wants to comment on how that would be dealt with.'",
        "'speaker_2': 'I don't have much further information in the content that was in the staff report. I consulted with Alan Tai and our planning department and that was his recommendation. In terms of based on what I'm hearing tonight, I do see value in a if we're select about needing to hear more direction on one site many sites.'",
        "'speaker_2': 'But there are there is some economies of scale from hiring a single design contractor to do multiple sites. So I'll do the same applications for East Bay mud. So there's some value there. I think that we could move forward with the design and come back to council to appropriate funds for the design.'",
        "'speaker_2': 'And then by the time we're ready to move forward with construction, we would be able to be back at council probably closer to mid-year and council could approve whether to move forward with construction for all sites or maybe phase in how we wanted to do that.'",
        "'speaker_0': 'It will do that and still be able to apply for the $15,000 per project from thinking.'",
        "'speaker_2': 'If we have, obviously we'll have to work with our partners at East Bay Mud, but that if we have designs and applications and by the end of the rebate, that they'd be willing to work with us.'",
        "'speaker_0': 'Okay, that sounds good. Okay. Well, maybe we'll just have to get more information about the historic advisory boards role in all this. I just tend to think that when we're talking about something that is yet another one of our statewide crises, we could find a way to move forward.'",
        "'speaker_0': 'Okay, so staff direction, do you need a vote? Do we need to do a separate vote?'",
        "'speaker_2': 'And I don't think we need a vote. I'm just looking for general direction. That sounds like we will move forward with the design for the long conversions. And just to clarify, are we all on board of the smart irrigation as well.'",
        "'speaker_1': 'Crucial.'",
        "'speaker_2': 'That that will also include a budget amendment to appropriate those funds. And we can do that at the time. We come back with a design contract.'",
        "'speaker_0': 'That sounds good. City manager love it and then we'll go to you. Councilmember her Spencer city manager please. And mute. Yeah.'",
        "'speaker_3': 'And on the line, on the lines, do you want to do all of them or just two or three projects at this time for the design?'",
        "'speaker_0': 'Well, I would like to for sure do City Hall and then I don't know what is everybody think there's that chart. There were some that were real gas guzzlers. Gas guzzlers. Hello? Different Environmental Concern Council. What do we think?'",
        "'speaker_0': 'In a city hall with redaction of 870,000 gallons a year. Sounds pretty compelling. Vice mayor, got any thoughts? Officers Club. Washington Park Castle are not quite unmuted first. Go for it.'",
        "'speaker_3': 'I guess my my I you know, if we're giving the direction to move forward with all and to put together a time but a time frame, I think I would be comfortable asking staff to identify which city hall I think makes just complete sense.'",
        "'speaker_3': 'But beyond that, I think asking city staff to just kind of figure out the timeline in the appropriate order would make the most sense because there might be things we we don't know why one park might be better than the other moment.'",
        "'speaker_0': 'Kind of triage it now. Yeah. Okay. As for Councilmember Herrera, Spencer, she's got her hand up. Yes.'",
        "'speaker_4': 'Thank you. First of all, I wanted to I appreciate member Vice Mayor Vella bringing up whether or not to refer recusing herself because the park I rent within 500 feet of a park. And so I want to ask for the legal opinion if that would be as a renter, because it's not ownership that I would need to'",
        "'speaker_4': 'recuse myself.'",
        "'speaker_3': 'Councilmember Spencer in the excess of caution. I would recommend that you recuse yourself.'",
        "'speaker_0': 'At city attorneys. And as I understand it, we're just giving direction. So are we just specifying that the vice mayor and Councilmember Herrera Spencer are not giving direction on the particular parks that they live near?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Okay.'",
        "'speaker_3': 'And when it comes back, there will be a bifurcated vote. But for now, yes. Okay.'",
        "'speaker_0': 'Yes, that works.'",
        "'speaker_1': 'Okay.'",
        "'speaker_4': 'So I'd also like to follow up in regards to the priorities of, I think like for instance, city Hall, City Hall, West Fire Station, all those types of facilities. But I would prefer looking at first I have concerns about the parks because I would like to know more specific of where we're proposing.'",
        "'speaker_4': 'For instance, Upper Washington is quite often completely packed with people using it. And part of COVID is encouraging people to be outside. So I would be I would want to make sure we are continuing to allow access to people that use that for picnics and whatnot.'",
        "'speaker_4': 'And but these other areas are very clearly not not used really. And so that would be my priority.'",
        "'speaker_0': 'Can I just ask Ms. Wooldridge to to touch on this estimated reductions for these different products, because I know you were also extremely concerned about public usage of the parks, because I think I heard you say earlier in answer to Councilmember De Sykes question that these were not the lawn area you might envision.'",
        "'speaker_0': 'Could you touch on some of the parks? Absolutely.'",
        "'speaker_1': 'Yes, thank you. In order to get to the square footage, we did completely map it out. So we do have maps per park of where we were proposing. We just didn't include that level of detail in this report.'",
        "'speaker_1': 'So. I'm happy to address any questions on specific parts, but all of them were. We identified areas and I worked closely, obviously, with our park maintenance staff who know the parks and usage levels quite well. I also worked with our recreation services staff who also are out there with the kids and with the public.'",
        "'speaker_1': 'So we chose specifically areas that are not that are that are decorative areas, landscape areas. A great example, it actually is a little dog park. So so that whole area of the 29,000 square feet is is the hillside under the trees right on clement.'",
        "'speaker_1': 'And so it's it's it's a steep little area that people that's not usable and so is a perfect candidate for conversion to drought tolerant landscape.'",
        "'speaker_5': 'When a visitor.'",
        "'speaker_1': 'Thank you. Going to go?'",
        "'speaker_0': 'Yeah. Thank you. Councilmember Herrera. Spencer.'",
        "'speaker_4': 'And my preference would still be to add that those are public documents, to add those maps to this item whenever it returns and the public will have the opportunity to review it as well as council members.'",
        "'speaker_3': 'Absolutely.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay. But I think we can safely say that we're not taking away any usable usable by the public park space. Okay. Anything further? Okay. Lots of great direction. Thank you so much, staff. I know this is one more thing to keep on your plates.'",
        "'speaker_0': 'I just think this is one of those issues that is also where time is also of the essence. So thank you and good luck with everything. All right. We'll look forward to your updates. Thank you. All right. And thank you, Dylan Hammond and Lisa maxwell.'",
        "'speaker_0': 'Nice to have you on board to. Okay. We are moving along and we come to item six H. Now I'm here to want to introduce that and I think that also includes a little changing of the guard. Or is Ms..'",
        "'speaker_0': 'Butler coming back for this? Yes. Yes.'",
        "'speaker_1': 'Okay. Okay.'",
        "'speaker_2': 'It's recommendation to reconsider award of the contract for the publication of legal notices and consider providing direction for funding options to assist the Alameda Sun. And I can start while Lois just coming back on and basically this is coming back to the council and after a referral was presented by Councilmember Tasha at the June 20th PD and'"
    ],
    "Recommendation to Reconsider Award of the Contract for the Publication of Legal Notices and Consider Providing Direction for Funding Options to Assist the Alameda Sun. (City Clerk 10022020)": [
        "'speaker_2': 'and so July 20th, I'm sorry, wrong date. And so basically there's two things before you to consider tonight. There is one thing the contract and the second thing, funding options. So basically the council does have an option to terminate the existing contract with the Alameda Journal and could then, you know, pursue entering into a contract with the'",
        "'speaker_2': 'Army to fund and then the funding option. There are basic funding that I think I could turn it over to, Mr. Butler to outline the options and kind of discuss what funding I think they've had to.'",
        "'speaker_0': 'And and just before we get into that, do we have public comment on this item?'",
        "'speaker_2': 'Yes, we have at least one speaker.'",
        "'speaker_0': 'All right. Okay. Ms.. Butler, go ahead.'",
        "'speaker_1': 'Hi. Hi. Nice to be back. So we have given us some examples of the types of funding that we can provide as a city. For example, we could use general funds to do a general sponsorship for the news paper, or we could support the Sun with.'",
        "'speaker_4': 'Ads for our.'",
        "'speaker_1': 'Shop, local campaigns, restaurant week and other local events. Or we could sponsor a section in their paper. We could say it's sponsored by the city as far as funds that they have received from the city grants and things like that, they have not received grants from the city.'",
        "'speaker_1': 'They did apply for Almeda Strong and they applied for the COVID 19 grant that their lottery number did not come up.'",
        "'speaker_0': 'And those were two separate funds, right? The COVID 19.'",
        "'speaker_1': 'Crisis.'",
        "'speaker_0': 'What was the maximum that they could have received from each of those sources?'",
        "'speaker_1': 'So they could have received 7500 from one or the other. If they were qualified, we would have to evaluate their their application to see if they were qualified.'",
        "'speaker_0': 'And were applicants able to receive funds from both.'",
        "'speaker_1': 'Or just just one? One. Okay.'",
        "'speaker_0': 'Okay. And then I believe there may have been some other funds that they received from the state or federal government. Is that.'",
        "'speaker_1': 'Correct? That is correct. They received PPE, and I would just try the paycheck protection plan funds. And.'",
        "'speaker_4': 'That was a.'",
        "'speaker_1': 'Federal loan that could turn into a grant.'",
        "'speaker_0': 'Okay. Thank you. Counsel, any clarifying questions for Ms.. Butler before we open that public comment? Okay. Let's hear from our public speaker or speakers, please, Madam Clerk.'",
        "'speaker_2': 'We have one speaker at Chuck Capellini.'",
        "'speaker_0': 'Good evening, Speaker Capellini.'",
        "'speaker_3': 'Good evening. Not a mayor and city council members. Thanks. I'll be fast. I know you're trying to get through the meeting tonight. I'm here to encourage you to reconsider your early vote and award the contract for the publication of legal notices to the Army.'",
        "'speaker_3': 'The Sun. The Army. The Sun is locally owned and operated, and they are a vital part of our community. Six years ago, I began organizing the Alameda Spelling Bee, a citywide spelling competition for Alameda. Students in spelling bees are traditionally sponsored by local newspapers.'",
        "'speaker_3': 'I reached out to the Alameda Sun to see if they'd be interested in getting involved. And within just a few hours. Eric Cause The Sun's founding publisher responded that the Sun would absolutely be willing to step up and be a sponsor of the spelling bee.'",
        "'speaker_3': 'And Eric himself even volunteered to be a judge for the competition. In the ensuing years, the Sun has remained an important sponsor of the Almeida Spelling Bee. It provides free space to advertise the event, and they've been they've covered the event every year, including by displaying the winners photos on the front page.'",
        "'speaker_3': 'I share this story as an example of how the LME, The Sun, unlike other publications distributed in Alameda that I'm aware of, is engaged and active in the city in ways that go far beyond what other publications do.'",
        "'speaker_3': 'The Sun's pages feature stories about Almeida's history on a regular basis, and the publisher regularly conducts historic walks of the city. The Sun provides an outlet for city government, including updates in the library's other services, as well as regular front page column by Mayor Ashcraft.'",
        "'speaker_3': 'In fact, I suspect that the Alameda Sun may be the city's most important outlet for informing Alameda about news from the city government. So the fact that the sun is locally, locally owned and operated really does matter. And the legal notices contract goes a long way in helping this paper to survive.'",
        "'speaker_3': 'So when considering which publication the city should trust the legal notices contract, it's important to weigh the other values and value that the sun provides to our community. And of course, if there are alternate ways that the city can support the Sun, financial or otherwise, I'd encourage you to pursue those paths as well.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. And do we have further speakers, Madam Clerk?'",
        "'speaker_2': 'That was our only speaker.'",
        "'speaker_0': 'Okay, then we are going to close public comment at this time and we will hear from the council. Councilmember Dave, address your hand up.'",
        "'speaker_5': 'Yes, thank you. I think we talked about the reasons why we believe we need to consider reversing our decision. So I would encourage us to go immediately to a decision. And the thing that I would move is that we move to terminate the contract with Alameda Journal and award the contract to Alameda Sun and also invite the'",
        "'speaker_5': 'Alameda Sun to to obtain their sources of funding described in the three bullet points in the staff report, capping it at no more than $19,200. That's additive to the contract itself, by the way. So just to be clear.'",
        "'speaker_0': 'Okay. Thank you for your comments. Councilmember Herrera Spencer.'",
        "'speaker_4': 'Second, the motion.'",
        "'speaker_0': 'Was that a motion?'",
        "'speaker_3': 'Yeah, that's the motion.'",
        "'speaker_0': 'That was the motion at second. Okay, then we'll open for discussion. I'd like to lead the discussion. Okay. I will. I think this is a case for we can have our cake and eat it, too. And I'll tell you what I mean.'",
        "'speaker_0': 'I don't think we should terminate the contract with the Alameda Journal to provide legal notices. And the reason for that is they have the more extensive circulation, and that's important when we're providing legal notices. And I don't want to see us pit one small newspaper against another, albeit one is even smaller than the other.'",
        "'speaker_0': 'But they're both small newspapers. And in an era where we're seeing a lot of local journalism just fold and not be able to carry on, I don't think we need to in any way be punitive or adopt a punitive stance towards a newspaper.'",
        "'speaker_0': 'But I do think that we can certainly provide some forms of financial assistance to the Journal The Sun. And I mentioned briefly when we were talking about ARPA funds and ARP offenses, we all remember were there to assist businesses and entities to recover from the impacts of COVID 19.'",
        "'speaker_0': 'And certainly COVID 19 has has impacted this small local newspaper. They were they did get the paper money. And presumably, if they didn't lay off any staff, it converted into a grant. The ability to apply for either the city's COVID 19 relief funds or the strong was just by lottery.'",
        "'speaker_0': 'And your number came up or it didn't. And I guess we have expended those funds, is that correct? So we'd be we'd be looking from two other sources. But I would I would recommend that we follow the the first bullet and the alternative, keep the contract with the sun, with the Journal and provide direction on funding to'",
        "'speaker_0': 'assist the Alameda Sun. And I liked all of the things that Ms.. Butler mentioned to us that we can take money from general fund. I would add we can take money from ARPA, we could place ads for restaurant week, we can sponsor a city or a city section.'",
        "'speaker_0': 'I think a number of our departments I know I do a monthly column, by the way, my monthly column runs in the Journal as well as The Sun. And because we know we're trying to get the word out about important topics as widely as possible.'",
        "'speaker_0': 'But I know the city attorney's office and our public information officer and probably others recreation parks, I think all two informational pieces. So I do want to see us assist the sun. And I think it's a matter of how much money we'd like to allocate to doing that.'",
        "'speaker_0': 'Because remember, the contract isn't a price specific. There's an estimate that if the number of ads continues at the pace at a previous level, it would be about 46,000 a year. But that's not a guarantee either. We may be able to provide some guaranteed income anyway.'",
        "'speaker_0': 'My thoughts? Anybody who wants to weigh in who hasn't yet. Okay, back to Councilmember Harris Spencer.'",
        "'speaker_4': 'I just want to say, in the interest of time that I believe this meeting is at midnight, we have 14 minutes to go. So I'm looking at this correctly. There's a motion and a second on the table. I think it is critical that we terminate the contract with the Journal and award it to the Sun, I think'",
        "'speaker_4': ', and that's what the referral was. But so that I wanted to try to move this along.'",
        "'speaker_0': 'Thank you. Well, you know, in the end, when you mentioned time and time is running out, something that I made a mental note of after we didn't finish the consent calendar until almost 9:00. Is that moving forward? I'm going to go back to something I've done before, that when items are pulled from the consent calendar, we're going'",
        "'speaker_0': 'to move them to be heard at the end of the regular agenda item because it's just not fair to make our staff and any public speakers have to hang around this long to have their items heard. I want to hear from the entire council, though, before we vote.'",
        "'speaker_0': 'Vice Mayor Vella, we haven't heard from you and Councilmember Knox. Well, I don't think we've heard from you either. So.'",
        "'speaker_1': 'Your thoughts.'",
        "'speaker_0': 'Councilmember Knox.'",
        "'speaker_3': 'I am happy to speak. Yeah, well, I want to. I have a different perspective. I don't think we're talking about funding two small hometown papers. The Alameda Journal is owned by a Denver hedge fund, and they have 100 papers and 200 other publications nationally.'",
        "'speaker_3': 'The Army, The Sun is a local one and I continue to support them. If for some reason we wanted to continue running the ads in the Alameda Journal, I think that the number in the the original staff proposal was $46,000.'",
        "'speaker_3': 'If we want to commit to funding $46,000 in support for the Alameda Sun as well, I'd be happy to look at that as a as a way. But I think that, you know, right now I my interest, you know, I didn't vote to move the ads to the Alameda Journal.'",
        "'speaker_3': 'But if for some reason that bet that there's an interest in keeping the ads there, I would be willing to support something that also provided the funding that we were talking about for the Army. Do something about it for us back in June.'",
        "'speaker_3': 'If not, I'm happy to support that. The motion that's on the table.'",
        "'speaker_0': 'Vice Mayor Vella.'",
        "'speaker_1': 'But I continue to have the issue with the circulation and the whole point of the legal notices and until we can find a way to expand that. So, you know, I'm happy to, you know, look at the other options relative to the grants, advertising, things like that.'",
        "'speaker_1': 'My position hasn't changed. I. My sense of things is and I and I agree that they are not both hometown newspapers, but my sense of things is, at least for me, wanting to help them out, I think is separate from making sure that we have the legal notices.'",
        "'speaker_1': 'So I just want to make my position clear on that. I don't I would not support moving over the legal notices and then also giving them aid or assistance. But I would be open to talking about the, you know, the options that Ms..'",
        "'speaker_1': 'Butler added.'",
        "'speaker_0': 'Thank you. And. Okay. So. Are we? Is this a do we need to bifurcate this? Because the the there is the recommendation that we reconsider the awarded the publication.'",
        "'speaker_1': 'And.'",
        "'speaker_0': 'Funding options for the son. I I'm not sure. Well, I certainly can't support all of that, that we're going to avoid them the contract and give them all this other financial assistance. I mean, at some point, would would the city be the major funder of this local newspaper?'",
        "'speaker_0': 'And that raises some concerns in my mind.'",
        "'speaker_5': 'Councilmember SAC Yeah, thank you. I think that's a good point. I think, quite frankly, I think the cleanest thing to do is simply to terminate the contract with Alameda Journal and award the contract to the Alameda Sun without providing additional funding to the Alameda Sun.'",
        "'speaker_5': 'I think the contract is the funding. And Mayor, as he Ashcraft, I appreciate what you're trying to do. I really do. But in this case, I think we're just going to have to go with one provider who we believe to be.'",
        "'speaker_5': 'And each of us are going to have different opinions as to who we believe, but who we believe to be reflective of of the needs of Alameda residents. And so that's why I'm I'm just going to go with one legal notice provider and and change my vote from previous to the second bullet point.'",
        "'speaker_5': 'So that's the motion.'",
        "'speaker_0': 'Okay. And I appreciate that. I always appreciate our dialog. And also just and to be clear, we're doing this to support a local paper and not because they will provide their superior service of more extensive legal notices, because they won't.'",
        "'speaker_0': 'But we want to help keep them in business, but that's pretty generous and that's as far as we go. So the second year of the motion, are you in agreement with them?'",
        "'speaker_4': 'I'm happy to second that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay. We had a motion. We had a second. Any further discussion? Saying. Then let's have a vote. A roll call vote, please.'",
        "'speaker_2': 'On Florida. Yes. PEREIRA Spencer.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'KNOX Right.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Bella.'",
        "'speaker_1': 'I'm going to vote I. But I really hope that we can find a way to expand the legal legal notifications, because I think it's we need to do that.'",
        "'speaker_2': 'Mayor Ashcroft.'",
        "'speaker_0': 'I will reluctantly vote I and I'm going to look at this as a trial period for a year. I expect that this is a pretty, pretty significant infusion of funds to the sun. So we'll see what they do with them.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Trace by five.'",
        "'speaker_0': 'So when your contract. Okay. Thank you, Councilwoman. Not quite.'",
        "'speaker_3': 'All right. Just related to this that I'm wondering if we want to one of the reasons we have to do this is our charter actually requires us to have a newspaper, a record, which is a very outdated thing.'",
        "'speaker_3': 'It doesn't allow us to necessarily use online and other sources as our as our record. I'm wondering if you want to give some direction to it over the next few months. Consider bringing something back to the ballot that can be a part of a clean up in the 2022 election.'",
        "'speaker_3': 'There may be other items that people are interested in, but since it's something we.'",
        "'speaker_0': 'Can yeah, we can talk about that in charter. I think we're kind of creating a bucket of things. Okay. With that, let's move on. Thank you. Good. Good point. And that that will be considered that so let's let's call it close out.'",
        "'speaker_3': 'But we're not going to be very clear. We're not giving that direction to staff because that was my question was very in giving direction to staff to do that.'",
        "'speaker_1': 'I am.'",
        "'speaker_0': 'Vice mayor.'",
        "'speaker_1': 'I was just going to say I'm comfortable giving broad direction to staff to figure out if there's alternatives for writing a broader legal notice and what that would entail.'",
        "'speaker_0': 'We just don't want to get in trouble with that. Would you see?'",
        "'speaker_1': 'Yes. Okay. All right. So keeping it general direction.'",
        "'speaker_0': 'All right. Thanks, everybody. Okay, let's move on then to the next item. We're closing the item and we're moving on to council City Manager Communication, Mr. Leavitt. There you go.'"
    ]
}