{
    "Recommendation to Provide Direction on Potential Measures Amending the City Charter Relating to Charter Section 7-3 - Council Interference.  (City Council Charter Subcommittee)": [
        "'speaker_1': 'Recommendation to provide direction on potential measures. Amending the City Charter relating to Charter Section seven, dash three Council interference.'",
        "'speaker_0': 'Thank you. And before I call on my subcommittee, have Vice Mayor John Knox White and Councilmember Tony Day. So I'm going to give just a little intro because it was I who appointed this subcommittee way back on December 18th, 2018.'",
        "'speaker_0': 'And I just want to kind of bring us forward from that time. And I realize that by council rules, this counts against my 9 minutes. If any of us need a little more than 9 minutes to complete our comments on this very important topic tonight, I hope the rest of the Council will indulge us.'",
        "'speaker_0': 'Anyway, what I said when I was sworn after I was sworn into office as mayor on December 18, 2018, among other things, is that Alameda has so many has so much potential, but also serious issues that we need to address.'",
        "'speaker_0': 'Now, I talked about some that I am not talking about tonight, like housing and traffic transportation, but I and I said that I'm confident that this council will not look the other way or kick the can down the road, but will address these issues before us head on in Alameda, the public trust has been shaken by turbulent'",
        "'speaker_0': 'events of the past year. We need to restore public trust and make city government more effective. One place to start is by bringing our city charter in line with current day needs and realities. And I had talked to my two council colleagues ahead of time asking if they would agree to comprise this subcommittee, and they graciously agreed'",
        "'speaker_0': '. So I also said that our challenge as a council moving forward will be to focus our talents, strengths and energies. And among the members of this body, there are many and working in the city's best interests. I ask that we set aside perceived differences and do the work that our residents elected us to do because we are'",
        "'speaker_0': 'at our best when we find common ground and achieve together what we could never achieve on our own. And then six months later, the Alameda grand jury released a report on its investigation. And among its findings were some violations of the city charter.'",
        "'speaker_0': 'But what I want to point I want to make tonight is that tonight we are looking forward. We are not looking back. This is not meant to single out any one or more council members. This is about good governance going forward.'",
        "'speaker_0': 'But we the majority of this council also made a commitment to the the grand jury that we would move forward with certain of reforms, that they recommended recommendations. And so in relevant point is the second of four findings that they made and it's referenced in the staff report that was prepared, but it wasn't attached.'",
        "'speaker_0': 'And I as an attorney, I would like to see, you know, the basis of the recommendation. So the finding that brings us here tonight and again, we voted on this and the three of us who were able to vote unanimously decided back on July 16, 2019 that so the finding was the city of Alameda Charter fails to'",
        "'speaker_0': 'provide enforcement mechanisms when council members and staff violate provisions of the charter, creating uncertainty when such violations occur. That was the finding. The recommendation to that finding was the Alameda City Council must investigate possible charter or municipal code amendments to clarify and strengthen provisions relating to city governance.'",
        "'speaker_0': 'The Charter should delineate the specific types of conduct that constitute a violation of Section seven, Dash three, as well as outline and enforcement process period, end of sentence. That's why we're here. And we we do happen to have the backdrop of COVID 19 going on.'",
        "'speaker_0': 'But we have been working on this for the better part of a year. Well, I mean, the council subcommittee started working in early 2019. So anyway, without further ado from me, which is the I, I, you know, both Councilmember de Ford and Vice Mayor Knox White have contributed to this report who would like to start.'",
        "'speaker_0': 'And by the way, as we have been doing with all of our meetings, raise your hand so I can see you. Let me know in. Form when you're done speaking. So I don't accidentally go on to the next speaker who wants to start.'",
        "'speaker_3': 'No.'",
        "'speaker_0': 'I. Are you okay? Call them every day. So is that pointing it to my friend? Yeah. I love it. All right. You have been delegated advice there.'",
        "'speaker_2': 'I appreciate that. My box is right next to yours. Actually pointed at me. Thank you. Thank you. Thank you very much. There's a draft in beginning this conversation, and I will turn it over to Councilmember de Thor rather quickly.'",
        "'speaker_2': 'I want to give my thanks to our city staff. We have had many, many conversations on this topic, both with both Councilmember Desai and myself, together with our city attorney and city manager. But also I know that both of us have had a number of conversations independently, and I found them always extremely helpful and informative and really'",
        "'speaker_2': 'very much help to bring to light and influence the proposal that I will be proposing tonight, which I believe. And I'm actually going to suggest one minor change to it, though, that did come in via public comment to me over the phone earlier in the week.'",
        "'speaker_2': 'So essentially after from.'",
        "'speaker_0': 'We can hear you.'",
        "'speaker_2': 'I'm sorry. You were signaling that I couldn't see my microphone, but my microphone was not there.'",
        "'speaker_3': 'Oh.'",
        "'speaker_0': 'I was adjusting mine.'",
        "'speaker_2': 'No, no, no. I thought it was up on my head. Apologies.'",
        "'speaker_0': 'So it's kind of like the pitcher and the catcher communicating, I would just say. But.'",
        "'speaker_2': 'You know, it's a baseball themed evening, as you mentioned. You know, we've had many recommendations, starting with the Jenkins report. I followed with the grand jury that that we look at the charter and make much clearer what it is that it defines a violation of the city charter as written right now.'",
        "'speaker_2': 'You know, I know that I am not alone in coming to the conclusion that the current language of influence in the city manager is so broad that it actually suggests that no council member should ever speak to the city manager without fear of on on any topic related that could possibly be related to purchasing policy or, or'",
        "'speaker_2': 'the hiring processes of, of, of appointees, because it essentially just talks about influence. It doesn't actually describe what those behaviors are. So, you know, with looking forward with the recommendations of Jenkins and the grand jury, we identified the book, The City of Oakland and the city of Santa monica have changed their city charters in recent years to'",
        "'speaker_2': 'be much more instructive about how to think about this. And actually, I felt that the language was pretty, pretty spot on. There was not a lot of wordsmithing. I will thank the city attorney for his help in meshing the two into what I think is a very clear and understandable language.'",
        "'speaker_2': 'The one change I would say, and it does actually follow the the the second part of the grand jury's recommendation is at the end, I do understand that there could be some confusion about the the final sentence of this recommendation, violation of any provision of the section by a member state.'",
        "'speaker_0': 'Could could I ask you to slow that down just a little bit? Because I'm trying to take notes. Will you tell us where you are? This is page two of your staff report.'",
        "'speaker_2': 'Page three. This is the.'",
        "'speaker_0': 'Proposed.'",
        "'speaker_2': 'Language. So the final, final sentence of the proposed language.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Violation of any provision of this section by a member of this Council shall be a misdemeanor conviction, of which shall immediately forfeit the office of the convicted member. And I think that given that, you know, after a lot of conversation, the state already provides the remedy for removing a council member.'",
        "'speaker_2': 'And I think that one of the issues we had as we were discussing this was we got a lot of feedback of, well, why aren't you taking action? And because the charter is not clear about where that where that remedy exists.'",
        "'speaker_2': 'It would be good to just clarify in this last sentence that a violation of of any provision of this section shall be prosecuted as as as identified in state law, which would give us the flexibility that as state law changes, we would we wouldn't have to amend our charter, which I think would not be problematic and then'",
        "'speaker_2': 'conviction, and then we can include the conviction of which shall immediately forfeit the office of the convicted member. I would certainly and I'm sorry to our city attorney, that I didn't actually give you a heads up, that I was going to propose this, but I would certainly take his recommendation.'",
        "'speaker_0': 'I have a clarifying question. Vice Mayor. Okay. So that violation of any provision of this section by a member of the Council shall be.'",
        "'speaker_2': 'It shall be prosecuted as to as identified by state law, by state law.'",
        "'speaker_0': 'And if you're going to reference as a code section of state.'",
        "'speaker_2': 'Law, I would not know because that could change next week. And then we're going to have to ask the voters to change our charter. So I would just say that the remedy exists as it does today with state law.'",
        "'speaker_2': 'Okay. So I don't think we need to I don't think every document has to give you every citation. And given how citations change, I think it would be problematic to put that in our our charter.'",
        "'speaker_0': 'I imagine we'd want to hear from the city attorney at some point on that day. Got it. Okay.'",
        "'speaker_2': 'So that is okay. That is my proposal. Okay. So, Councilmember Davis, I don't know if you wish you would like to present on yours.'",
        "'speaker_3': 'Great.'",
        "'speaker_0': 'I'll be happy to call on Councilmember Desai.'",
        "'speaker_3': 'Great. Well, thank you. It's been a pleasure working with Vice Mayor Knox Wyatt over the months on this item. And thank you very much to Mayor he Ashcraft for appointing us to this subcommittee. And thank you very much to the all of the city council members and in your patience as we move this forward, Laura, if you'",
        "'speaker_3': 'can. So the thing that I'm pursuing is I'm not so much emphasizing the issue of. How to strengthen the work, how to strengthen and further and refine the the word influence as it is currently used in Charter Section seven, Dash three.'",
        "'speaker_3': 'And what I'm instead focusing on is, oh, they just leave it there. What I'm focusing on is a procedure by which we actually enforce, and it's a city managed procedure by which we remove city council members who violate the first paragraph of seven, dash three.'",
        "'speaker_3': 'And what I put together in the staff report seven, Dash three A and seven, dash three B, that would be added on to seven, dash three, which would stay in place. And if you follow through on seven, dash three A and 7-3b, what you end up is with A is a six step procedure to removing a council'",
        "'speaker_3': 'member who tried to influence a city manager in hiring decision making. And that procedure? Yep. Scroll up just a bit. Is open and open to the public. And it's also the accused themself can defend themselves and it addresses issues raised in the grand jury report.'",
        "'speaker_3': 'And finally, the procedure is one in which people have a say. Okay, scroll up. So I think the mayor said it best stop right there in in quoting the part of the grand jury report as to why we are here tonight.'",
        "'speaker_3': 'Scroll slightly up. We are here, especially because we want to look forward and we want to address this part of the grand jury report that is on page 15, and it's that final sentence there. The charter provides neither procedures for investigating procedure violations and nor a method for the enforcement of the charter.'",
        "'speaker_3': 'Okay. Thank you. So that's part of the grand jury that we want to deal with. And the mayor rightfully pointed out that the findings 19 Dash two again addressed the fact that there was a lack of enforcement mechanisms.'",
        "'speaker_3': 'That's the findings. And the mayor had mentioned that. And then go ahead, go up on then there is a recommendation and I will if we could stop here. The recommendation is interesting because this is where my success flows out.'",
        "'speaker_3': 'Recommendation 19 Dash two I just want to focus in on that last sentence that says the charter should delineate the specific types of conduct that constitute a violation of Section seven, Dash three, as well as outline. And that's the keyword outline and enforcement process.'",
        "'speaker_3': 'The word outline is in red. I red circled because when you look at what I've done with 7-3a and 7-3b, it is literally an outline as to how to move forward in instances when there are allegations of of a council member trying to insert herself or himself in a city manager's hiring decision making process.'",
        "'speaker_3': 'So let's let's see how it's seven dash, three A and 7-3b or A adopted. This is how things would happen. Step one. City manager alleges that city councilmember interference in a hiring decision process that that's a that's available already that exists.'",
        "'speaker_3': 'Step two City Council convenes meeting to discuss allegations and if it so decides Ford's allegations to the district attorney for investigation and substantiation of the allegations. Step three If a D.A. accepts the case and then substantiates the allegations, then the D.A. can forward matters to the grand jury.'",
        "'speaker_3': 'This is what we do already. This is a process that's in place. Step four If the grand jury accepts the case from the D.A. and itself substantiates the allegations, then it reports back its findings to the city council.'",
        "'speaker_3': 'And this is where the new steps pop in. Step five and step six. So the new process that I I'm proposing and especially my 7-3b is that the city council would hold in step five a public meeting to decide if it should call a special election to remove from office of Council Member.'",
        "'speaker_3': 'And this is important. To remove from office a council member who the district attorney and the grand jury says has interfered with a city hiring process. If both the district attorney or the grand jury do not substantiate allegations of misconduct, then you can't move forward.'",
        "'speaker_3': 'You have to have both, in my view of things. You have to have both the district attorney and the grand jury substantiating the allegations of interference in the hiring. Now, so the City Council on Step five holds this public meeting to decide if they should call a special election.'",
        "'speaker_3': 'At step five, the city council could conceivably decide not to move forward with a special election. They could just do something else and couldn't. They could just say, you know what, we've reviewed the information that the district attorney and the grand jury have to say, but for whatever reason, we're not going to move forward with a special'",
        "'speaker_3': 'election or. The City Council could move forward with a separate special election, which leaves us open to step six. So the special election occurs and the people decide and there's a little bit if a language there, if the special election occurred in the general election year, then the council can kind of coincide the special election along with'",
        "'speaker_3': 'a general election. So what you have here, what I've put together here is kind of a step by step outline as as because that was the literal word for word language from the from the grand jury reports that that the city charter should outline the enforcement mechanisms.'",
        "'speaker_3': 'And that's what I've tried to do in my language with regard to 7-3a and 7-3b, just in a nutshell, 7-3a is all about fact finding and the procedure is for fact finding. 7-3b is the procedures for enforcement. So let me just end up by by saying, you know, we all understand why we're here.'",
        "'speaker_3': 'We're here because as it's written in the grand jury report on page 29, the external pressure exerted during the fire chief hiring process and resulting actions represent the very conduct that good government advocates were trying to eliminate when the City Charter Amendment Preventing Council of Parents began to pop up throughout the nation.'",
        "'speaker_3': 'Cronyism and backroom deals are corrosive and can destroy the public's trust in the fair administration of government. So to the residents who are watching, to the people who have sent this email you have before you tonight, some ideas are put forward by Vice Mayor Knox White.'",
        "'speaker_3': 'Valid ideas, by the way, we're both coming from a place of trying to improve and strengthen 7-3. And then you also have my idea. And and howsoever we decide. I know that we as a city are going to come out for the better because we will have made the efforts to improve 7-3.'",
        "'speaker_3': 'My hope is to do it along the lines that I had enumerated. But I you know, I think what the vice mayor had put together, it is valid as well. So I just want to thank all the members of the City Council for your patience with us, as well as the public.'",
        "'speaker_3': 'And with that, I'll turn it back back to the mayor.'",
        "'speaker_0': 'Thank you, Councilmember de. So okay. Who would like to go next? Councilmember Odie.'",
        "'speaker_3': 'I mean, actually, I have a question.'",
        "'speaker_0': 'Please.'",
        "'speaker_3': 'So to me, go back to the proposed the proposed addition about something about state law, because I don't know if I wrote it down.'",
        "'speaker_0': 'Yes, Madam Clerk, do you have that language to read to us? Laura, can you hear me?'",
        "'speaker_1': 'Yes, I can hear you. I'm sorry. Which language did you want me to read?'",
        "'speaker_0': 'I think the vice mayor's new proposed language that references state law. Correct? Mr..'",
        "'speaker_3': 'Yes. The revised last sentence of the proposed amendment to the Charter.'",
        "'speaker_1': 'I am so sorry, but I did not get it down. Word for word. John, maybe I can repeat it.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Or do you have it?'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Sorry.'",
        "'speaker_0': 'Well, I mean, I would imagine that the vice mayor can do it, since he's the one who came up with it. But I. I think. Vice Mayor, why don't you take it? All right. Violation of any provision, right?'",
        "'speaker_2': 'Correct. Yes. So am I apologize. There was violation of any provision of this section by a member of the city council shall be prosecuted, prescribed as prescribed by state law. The conviction of which shall be immediately forfeit.'",
        "'speaker_0': 'Be prosecuted.'",
        "'speaker_3': 'Prescribed earlier. But. Okay, I.'",
        "'speaker_0': 'Get.'",
        "'speaker_3': 'It. Thank you for that clarification. I'll wait my turn.'",
        "'speaker_0': 'Okay. Okay. Next speaker. Well, maybe we have known. It's their public comments. By the way.'",
        "'speaker_1': 'We have public comment.'",
        "'speaker_0': 'Oh, you know it. Okay. So are any other clarifying questions about the staff report and the amended this amended sentence? No. Okay. Thank you. And, Ms.. Weisinger, how many public comments do we have?'",
        "'speaker_1': 'Okay. We have six that have been submitted via email and no one on the line. No one on.'",
        "'speaker_0': 'Okay. So, Councilor, are we okay with 3 minutes per speaker? I'm seeing nods. So let's do it. Thank you.'",
        "'speaker_1': 'Okay. The first one is from Kathryn Pauling for Alameda Justice Alliance, which represents the Army as Renters Coalition. Alameda Firefighters. Alameda Progressives. Renewed Hope Housing Advocates and Alameda Labor Cancer Council. Dear Madam Mayor and Council members. The last minute decision to schedule two additional council meetings this week on various aspects of the city charter revision process troubles'",
        "'speaker_1': 'us deeply. We don't understand the rush to push forward these changes that have nothing to do with the immediate welfare of Alameda, who are facing a lack of child care for essential workers, unemployment, food and housing insecurity and worries over family, mental health and general well-being.'",
        "'speaker_1': 'Furthermore, this is an unnecessary burden on city staff. For example, why is working on the new state program for helping local restaurants and seniors too burdensome for staff? But three meetings are directing work for city staff on recommended city charter language.'",
        "'speaker_1': 'Given the small numbers of letters submitted to council, it is evident that online council meetings are not being attended by the usual members of the public. Your insistence on holding three meetings this week on charter amendments is exactly what the public fears in a time of crisis.'",
        "'speaker_1': 'Government taking advantage of public distraction to force through major changes. Allen meetings have the right to consider these detailed and important matters when they're calm and secure again. We understand that the item on tonight's agenda involves recommended recommending language concerning the relationship between elected council members and the city manager.'",
        "'speaker_1': 'If you must consider this item tonight, the Alameda Justice Alliance supports the language put forward by Councilmember John Knox White, which is informed by existing ordinances in other cities. As we stated previously, our network is ready and willing to roll up our sleeves and work with the council and city staff to put Alameda back to work, supports'",
        "'speaker_1': 'seniors and families in transition, reopen and support our small businesses and provide our students with help they need. Sincerely.'",
        "'speaker_0': 'Okay. Thank you. Next comment?'",
        "'speaker_1': 'Karen Miller.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Dear Mayor and Council members, I strongly objected to the council considering significant charter changes during the shelter in place orders. I think these issues need to be discussed in open session with the public being able to weigh in.'",
        "'speaker_1': 'I realize you may be trying to make an election date date deadline, but matters of this importance should not be rushed through. I ask you to please reconsider your decision to go forward with these changes until the public is able to address you in person and not have a one sided conversation.'",
        "'speaker_1': 'We are all having to wait to get on with our lives and this matter is not so urgent that it can't wait as well. Thank you. Regards. And yes, his Dorothy Freeman. Good evening. Making changes to the city charter during a national emergency is not good governance.'",
        "'speaker_1': 'The citizens of Alameda are presently worried about things that are of a more urgent nature than these proposals. None of the proposed changes to the City Charter are of such urgent nature that they cannot be delayed until the 2022 national election.'",
        "'speaker_1': 'The ability to get proper information out to the public between now and the November election is very much in doubt. Campaigning will be very difficult for any item on the November ballot. We don't even know that our local newspaper will be able to survive this economic downturn.'",
        "'speaker_1': 'Not having a local newspaper will inhibit the ability to get pro and con information out. We also know that a return to normal is going to take longer than just removing the shelter in place order. People will remain in turmoil for an extended period as they work to recover from this disruption to every aspect of our lives'",
        "'speaker_1': '. I doubt the changes to the City of Alameda Charter will be high on their list of things they need to be concerned with. I strongly urge the City Council to delay all discussions of charter changes and any plans to place any charter changes on the 2020 national election ballot.'",
        "'speaker_1': 'We need to have full participation of our citizens in making these very important decisions regarding item three, a charter items seven, eight and seven be on tonight's agenda. I propose an outside independent prosecutor be used to determine the outcome of any investigation resulting from a councilmembers interference and actions or decisions that are the responsibility of the city'",
        "'speaker_1': 'manager, including any department or personnel under the city manager's responsibility. A prosecutor working for the city in the legal department by nature of their employment, cannot be independent. Thank you. And next we have thank you Katherine beer with.'",
        "'speaker_1': 'Dear Mayor and Council members, I strongly object to the Council considering significant charter changes during the shelter in place orders. I think these issues need to be discussed in open session with the public being able to weigh in.'",
        "'speaker_1': 'I realize you may be trying to make an election date deadline, but matters of this importance should not be rushed through. I ask you to please reconsider your decision and go forward with these changes until the public is able to address you in person and not have a one sided conversation.'",
        "'speaker_1': 'We are all having to wait to get on with our lives and this matter is not so urgent that it can't wait as well. Thank you. Regards. Then. Yes. Paul Foreman. On behalf of Alameda Citizens Task Force.'",
        "'speaker_3': 'We don't have sound in the public. Oh, sorry.'",
        "'speaker_1': 'Okay. Thank you for letting us know, Jim. We will momentarily check some levels here. Artie, do you have it up there? You can hear everything. It's okay. We checked Comcast and online and both are working here. Okay. I don't know.'",
        "'speaker_1': 'Maybe it was a AT&T issue. I'm not sure.'",
        "'speaker_3': 'But it they said it's back. I apologize.'",
        "'speaker_1': 'Oh, no, thank you.'",
        "'speaker_0': 'I got I got a text, too, I think possibly from the same person.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Um. Okay. And, Madam Clerk, if I could just ask you if the video of this meeting and I guess the audio and the video available will be available on our city's website after tonight.'",
        "'speaker_1': 'Yes. And the video will be available. Yes.'",
        "'speaker_0': 'All right. Thank you.'",
        "'speaker_1': 'Okay. And then, oops, I started the time I need to restart. Okay. This is our fifth commenter, Paul Foreman. On behalf of Alameda Citizens Task Force, we strongly object to council considering amending our charter during the current shelter in place order.'",
        "'speaker_1': 'We are even more dismayed by you proceeding with only the scant seven day notice required by law because one many members of the public will not be aware of these meetings and to community organizations such as A.C.T. are being forced to respond to all of these issues in a very short time frame.'",
        "'speaker_1': 'Neither Article 7-3 proposal responds to the concerns of Mr. Jenkins as quoted in the subcommittee report. Mr. Jenkins was critical of the broad attempting to influence language of Article 7-3, stating that a council member should be able to discuss the hiring process with the city manager.'",
        "'speaker_1': 'He suggests that any amendment clearly define the specific actions that constitute malfeasance. Both Mr. De Saag and Mr. Knox White's proposals contradict Mr. Jenkins. Mr. de Saag maintains the original language of the Article seven. Dash three. Mr. Knox White.'",
        "'speaker_1': 'Instead of narrowing the description of the offense, bronze it to prohibit a councilmember to in any manner, directly or indirectly direct request or take part in an appointment, discipline or removal of any person. This language inappropriately muzzles a councilmember from expressing concerns about the employment process.'",
        "'speaker_1': 'The final sentence of the Knox Bay proposal appears to suggest an alternate adjudication process to that now established by California law via the civil grand jury in the superior court. He has advised us that this is not his intent.'",
        "'speaker_1': 'That being the case, this license is a proposal should be deleted and replaced by language clarifying that the process will be through the civil grand jury and superior court. These remain this there remains an unaddressed major defect in both of the current and proposed charter article.'",
        "'speaker_1': 'No process is provided for triggering an investigation of possible malfeasance. We suggest the inclusion of a provision in Article seven, Dash three, that requires the city prosecutor to investigate such an allegation independently of the council, the city manager and the city attorney, followed by filing a complaint with the grand jury if warranted.'",
        "'speaker_1': 'The details of how he proceeds can be established by ordinance. We agree with Mr. Desai's proposal to require the district attorney's concurrence in the civil grand jury's finding. This is not required by California law. We also see no basis for Mr. de Sug suggestion of a recall election.'",
        "'speaker_1': 'Article 2-7 of the Charter covers the filling of vacancies, so no additional procedure for filling the vacancy is required. And then the next one. Is Jay Garfinkel. Honorable Mayor and members of the City Council. It appears to me that the proposals made by staff regarding the topic of item 7-3 is incomplete and leaves too many details unaddressed'",
        "'speaker_1': '. I don't pretend to have all of the answers, but would respectfully make the following suggestions for the Council's consideration. One For purposes of this policy, the term Council member shall be understood. To include the Mayor to a member of the Council should be precluded from communicating opinions to the city manager, assistant city manager and department heads regarding'",
        "'speaker_1': 'hiring, firing and various contracts for service and the purchase of materials. If a council member wishes to express any such opinion, it should be done through and after formal public discussion with him and majority agreement of the Council with the Mayor then doing any subsequent communicating with management regarding the issues discussed.'",
        "'speaker_1': 'Three Determine a mechanism defining how an investigation can be initiated for a method of determining guilt or innocence should be defined and the process should be carried out in a public forum. Five If and when a council member, including the mayor, are found to have violated this noninterference policy, he or she shall immediately be removed from office'",
        "'speaker_1': 'and shall be precluded from running for and holding elective office in the city. Six The policy should address a mechanism for replacing a removed council member. And. Yes. That is all.'",
        "'speaker_0': 'Okay. And that's all the public comment.'",
        "'speaker_1': 'Correct. Well, Mr. Garfinkle just emailed again and added two more I think. He added a seven and eight that might have been cut off from his previous. Can I read the last one?'",
        "'speaker_0': 'Yeah. And I think we're still within the 3 minutes, aren't we?'",
        "'speaker_1': 'Yeah, we had one minute and 40 seconds left, so it's just too slow.'",
        "'speaker_0': 'Oh, yes. Is that I'll add on Barea?'",
        "'speaker_1': 'He had number seven involving the county and or incorporating elections. Has a significant potential for inappropriately delaying the process of removing a guilty party. Eight. Deferring to state law is neither required and unnecessary, and doing so removes control from the Alamy citizens.'",
        "'speaker_1': 'Oh, and I just got one more forwarded to me to read into the record now.'",
        "'speaker_0': 'Yes, please.'",
        "'speaker_1': 'Okay. Okay. Last night I watched the city council meeting broadcast on Comcast Channel 15. Oh. Oh, thank you, Sean. There were multiple interruptions in the sound. Some silences were only for a few seconds, but enough to blot out all or part of what a council member was saying.'",
        "'speaker_1': 'Another time, the sound was completely missing when the city clerk read two letters intended for public comment at the beginning of the meeting. Those letters have not been heard and should be reread in a previous council meeting. There were even more serious sound problems blotting out large parts of the meeting.'",
        "'speaker_1': 'I understand that the governor has approved teleconferencing for city council meetings, but I believe he is assuming that a city's technol technology is working so that all of the meeting can be heard. This is not the case in Alameda.'",
        "'speaker_1': 'Therefore, these meetings are not completely transparent and are very frustrating for the viewers. In addition, I am disappointed that the Council has seen fit to call two special meetings on topics that are not emergencies. Tonight's and tomorrow night's.'",
        "'speaker_1': 'Tomorrow's meetings are scheduled for what is a common dinner time, which will make it less likely for many people, especially those with children, to watch. Furthermore, neither of these meetings have been noticed as often or as widely as other special meetings usually are, and they are occurring back to back with a regular council meeting.'",
        "'speaker_1': 'I believe these factors will greatly reduce the public's attendance. I could understand the urgency for these special meetings if the council was considering emergency ordinances or relief for the current health and financial emergencies. But this is not the case.'",
        "'speaker_1': 'While not emergencies, these agenda items are important and should be presented in time and in a venue where public participation can be easily made. I understand that the Council has to move forward with the city's business even during extraordinary times.'",
        "'speaker_1': 'But the way the city of Alameda is going about this right now is to sacrifice transparency. And I believe this is not in the spirit of the Sunshine Ordinance. And that was Tony Grim. Did I say that at the beginning?'",
        "'speaker_1': 'I apologize.'",
        "'speaker_0': 'No, but I think we got her her email earlier today, so I recognize that. Okay. Any further public comments, Madam Kirk? No more now. And you've checked all the different sources. The email, the text, the voicemail. Yeah. Yes.'",
        "'speaker_1': 'Just checked them all.'",
        "'speaker_0': 'All right. Well, with that, we will close public comment. All right. And we will open council discussion. Council. Vice Mayor Knox White.'",
        "'speaker_2': 'Happy to start things out fairly quickly. So thank you. Thank you very much again for the opportunity to present this to you. And I do look forward to hearing your comments. I did want to just I thank Councilmember Desai for his comments and his considered approach as well.'",
        "'speaker_2': 'You know, I do know that at the beginning of this process, I did want to highlight we did talk a lot about how we might be able to move forward with additional. But I would say the additional removal processes and through that process found that there were just you know, there are no cities that have a there'",
        "'speaker_2': 'there are no existing places where councils put recalls on the on the ballot, etc.. And at least for me, after talking to our city attorney's office here, of course, because there have been no court challenges, because these do not exist, one cannot say whether or not something will or will not be held up in law.'",
        "'speaker_2': 'I would be afraid that by adding something that essentially circumnavigate circumvents the district attorney's and grand jury process which are set up the city. The district attorney doesn't actually make a finding and tell the grand jury recommends that they take it to court.'",
        "'speaker_2': 'The district attorney offices just prosecutes that. So for the district attorney to make a recommendation to or sorry to come to a finding would mean that that district attorney had already prosecuted this and the court had already decided that something had happened and that would end up in removal, because that is that is the current law.'",
        "'speaker_2': 'So I do believe that another reading of outline in the process for removal is also covered by being very clear that there is already a process for move on and so on as we point to that, so that it's clearer in the future so that people don't believe that, you know, people on the dais can just decide'",
        "'speaker_2': 'to vote people off the island or which I know is not councilmember recommendation at all, but it it has been one that has been emailed to us many times over the last year and a half or else, you know, circumnavigating the recall process, which, you know, we know that there's at least one individual to have tried to'",
        "'speaker_2': 'foment recalls around the last the last issue multiple times and not been able to collect the signatures to do that. So I think we have the the proper protections and the proper process in place. And I think if we can follow the rest of the recommendation to clarify things, I think we'd be in good standing.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Vice Mayor, if I could ask a clarifying question. I'm going back to the suggestions that Mr. Garfinkle made that that the language should also address the mechanism for replacing a removed council member. Did you and Councilmember Defoe contemplate that?'",
        "'speaker_2': 'I speaking for myself, we did not. I mean, the charter already prescribes how we replace it when somebody is removed from office. If it's within, I think it's 180 days. That is the the next highest vote getter.'",
        "'speaker_0': 'True.'",
        "'speaker_2': 'Outside of that, then the council appoints that person. So I would I believe that is already covered and doesn't need a special process.'",
        "'speaker_0': 'Yeah, I think that's a that's a good reminder. Okay. Okay. Anything further?'",
        "'speaker_2': 'Over.'",
        "'speaker_0': 'Thank you. All right. Now, who has to go next? I know. Okay. Councilmember Desai.'",
        "'speaker_3': 'I do have 29 seconds, so I don't know if I have to, like, talk speedy quick, but, um, the first thing I want to say is, um, I actually like the language of 77-3 as is indeed the literal reading of seven.'",
        "'speaker_3': 'Dash three. Is that a council member? Cannot talk with the city manager about specific persons who they think should be hired or about specific companies that they think the city manager should hire. I'm comfortable with that. That's always been my.'",
        "'speaker_3': 'I do believe that there should be a bright line separating.'",
        "'speaker_0': 'Okay. Councilor Desai, I'm going to have to stop you here because we. I'm reasonably sure the city clerk is reminding me. Oh, and my video has frozen a couple of times. Okay. Wasn't just my present expression. The council will have to vote to allow extra time.'",
        "'speaker_0': 'I am going to propose that because I think this is an important topic that really requires and deserves thoughtful discussion and may not be able to be contained in 9 minutes. So could we vote to allow everyone up to.'",
        "'speaker_0': 'What do you think? Five extra minutes. Hold up. Fingers. Whatever, Councilmember Odie.'",
        "'speaker_3': 'I mean, I'd be inclined to allow the presenters more time since they presented, but I mean, I think I should be able to speak in less than 9 minutes.'",
        "'speaker_0': 'Okay. Yeah. And I like that suggestion too. It's just that based on those council rules that I think you and I put together. So do you want to say a specific number of minutes or. Oh, I'll make a motion that the presenters get three additional minutes, and if they need more than that, we can discuss adding more'",
        "'speaker_0': 'time to everybody. Okay, 3 minutes for now. Do you have a second?'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'I saw Councilman Brody's two fingers at every second. Maybe we have a roll call vote, please.'",
        "'speaker_1': 'Councilmember de SAG.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Not quite.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'I. Vela. I may or as the Ashcroft.'",
        "'speaker_0': 'By night.'",
        "'speaker_1': 'Carries by five eyes.'",
        "'speaker_0': 'Okay, so we are resetting your clock. Councilmember decide.'",
        "'speaker_3': 'Well, thank you very much.'",
        "'speaker_0': 'Well, we. Okay.'",
        "'speaker_3': 'I am comfortable with the language that's in the city charter now that basically says council members can't talk with a manager when it comes to hiring specific individuals by name or when it comes to hiring specific companies. I believe that the reason why that that came into being is historic in nature, because during the progressive era of'",
        "'speaker_3': 'the 1920s, we wanted to move away. We want to have professional form of government to move away from the type of influence that had been going on in Tammany Hall back in New York City and in many other cities.'",
        "'speaker_3': 'So I think that's why we have that kind of very overly broad language. It's meant to be a catch all. And that's basically the lens by which I see this whole thing. I don't think the issue is to to define away the term influence as it is currently now in the city Charter seven.'",
        "'speaker_3': 'Dash three. Now I agree the special election that I suggest is indeed a unique animal, potentially subject to challenge. But by virtue of being a city charter, I'm going to have to believe that city cities like Alameda, that we can create our own rules because we are a charter city.'",
        "'speaker_3': 'But the reason why the special animal, the special election came into being is because the grand jury had indicated in page 29 that they had the power to remove the page 29 of the grand jury report, that they had the power to remove a council member for malfeasance.'",
        "'speaker_3': 'But they decided not to do it because they wanted to respect the will of the voters. And so my way of addressing the issue of respecting the will of the voters was to create this special election, because that, in effect, would be a decision made by the voters.'",
        "'speaker_3': 'I understand I will summarize by saying, I understand that this is a unique animal that I am proposing. But I also think, though, that what Vice Mayor Knox White has put together is also something that we could work.'",
        "'speaker_3': 'It would be an improvement on 7-3. So either way, I think we're going to come out of this on the better side.'",
        "'speaker_0': 'Okay. Thank you. With 44 seconds to go, Councilmember Vela's hand is up. Councilmember Vela. So a few things. First, I am not a mayor. You started off by talking about public trust. And I do think, you know, I want to acknowledge our constituents that have raised issues about having this meeting as well as tomorrow night's meeting.'",
        "'speaker_0': 'And I think that if we're trying to build trust, I want to acknowledge that and acknowledge the fact that regardless of how we may feel, we have constituents that feel that this is happening without giving enough time for people to weigh in.'",
        "'speaker_0': 'I want to acknowledge the digital divide and the fact that some people don't have Internet at home, some people don't have the technology to follow these meetings. I want to acknowledge the fact that people aren't getting the word of mouth that they used to get by going to the senior center and seeing each other for lunch or'",
        "'speaker_0': 'being able to run into each other on Park Street or at the coffee shop. So I do want to make sure that whatever we do that we give that time and that ability for people to weigh in. I think that it's important.'",
        "'speaker_0': 'I think that that's why those meetings in June are particularly important. And I think that that that needs to be shared with our constituents and that there isn't going to be a decision, I would hope tonight to say, let's go put this on the November ballot.'",
        "'speaker_0': 'But I think that that's a message that needs to be shared and put out there. And certainly that's not my intent to make that type of decision tonight. I do feel that this measure is very different from the other charter provisions that have in terms of charter proposed charter changes that have have been put forward.'",
        "'speaker_0': 'The reason I think that this is different is that I think we're all in unanimous agreement that out of all of the provisions, this is the one that a couple of outside parties, whether it be Mr. Jenkins or the grand jury, have acknowledged needs changing and should be changed.'",
        "'speaker_0': 'And for that reason, I feel comfortable having this conversation tonight, at least as a starting point, and perhaps we'll have more conversation in June about timing and whatnot. A couple of other things. You know, I and I think this needs to be said, not all people that are indicted by a grand jury are found guilty at trial'",
        "'speaker_0': '. Not all people charged by a district attorney are found guilty. Somebody who's worked in a DA's office and prosecuted cases along with my sister, who is a district attorney, I can tell you, well, there's value there when they don't take every case to trial.'",
        "'speaker_0': 'They settle things out. They might charge somebody with a higher offense and that person might bleed out. But there's a whole process in place where evidence gets turned over. There's hearings. There's what we would call due process. There would be an opportunity to cross-examine an opportunity for representation by the accused party.'",
        "'speaker_0': 'I think that all of those things are very important. And I think in politically heated environments, that's especially important, especially in light of the fact that elections and the political voice is one of the most protected forms. I think it's the most protected form of free speech.'",
        "'speaker_0': 'And certainly I would say that one's right to vote is a manifestation of that expression of free speech. So I would be very uncomfortable trying to overturn the will of the voters through a democratic process by writing into our charter something that would usurp political voice of our constituents.'",
        "'speaker_0': 'I find the right to vote to be very sacred, and I think we need to uphold it and preserve it to the extent possible. So I would not be comfortable doing something that's going to undermine that. I would also say that there have been a number of how do I put this, a number of cases of political'",
        "'speaker_0': 'intrigue that have happened over the years. There was a council member that broke into another council members office. That council member didn't cooperate with police and was not removed from office. And there have been other instances where there were allegations, you know, of, you know, I think that council member was eventually there was a conversation potentially around'",
        "'speaker_0': 'some sort of censure or something like that. But I don't think the council can move forward with that is that, you know, that happened when I was a younger. There were also instances where there were allegations about previous council members meddling.'",
        "'speaker_0': 'With police officers where there were allegations of drunk driving on behalf of their partner. So I just I think there is always going to be political intrigue, but I think that our charter needs to stand up to constitutional muster.'",
        "'speaker_0': 'And in that respect, I think we need to be very thoughtful about what goes into it. Well, we are a charter city, and we can. We can. There's a number of areas where we can legislate. There's also a number of areas that are precisely and explicitly carved out under the Constitution of the US and the state of'",
        "'speaker_0': 'California. And I think we need to be mindful of those. I do. I do. Like Councilmember Knox White. Vice Mayor Knox white proposal. A couple of things that I think could be added to add further clarity. I like the point that the mayor should be named with.'",
        "'speaker_0': 'I think that needs to happen. I think that we need the mayor in other places. Yes, the mayor is a member of the council, but that can be confusing. I see the mayor nodding. Yeah, I know it's not this mayor that we're including, but the term.'",
        "'speaker_0': 'I think it's. No, that's absolutely right. Yeah. And I think the other thing is that we need to get rid of the gendered term. That's, you know, language that I think we should change throughout. And if we're going to update this section, I think we should think about that as well.'",
        "'speaker_0': 'But I'm willing to support the vice mayor's proposal. I do think that the term influencing is very overbroad. And I to that point, I do want to raise this example. As council members, we get contacted all the time by various vendors who who may want to talk to the city or talk to somebody at the city.'",
        "'speaker_0': 'Most recently, I was contacted by somebody that I knew about testing. It's not to say that I want the city to contract with these individuals, but I also know that our staff are looking for some of these contacts.'",
        "'speaker_0': 'Is it influencing for a council member to forward this and say why nothing else? I think influencing can be deemed as being that broad. I think that there is a lot of things that aren't necessarily ill intended that could fall under influencing, and that certainly, I think, don't necessarily get in the way of the day to day'",
        "'speaker_0': '. Now, if I was on the board of that company or anything else, I think obviously that would be or somehow set to gain by that company or any other company. Obviously, that's what we're trying to get at. We're trying to get at situations where a council member can profit or benefit financially in some way.'",
        "'speaker_0': 'And so I think that dealing with that word influencing is very important because of those scenarios. Thank you. Thank you. All right, Councilman Brody.'",
        "'speaker_3': 'Thank you, Madam Mayor. I want to thank the my two colleagues for putting in the time to do this and recognizing the comments of my colleague, Ms.. Vella, and the issues arising for why we're here are two and a half years old now.'",
        "'speaker_3': 'So what I understand and totally agree for the most part with all of the comments about considering charter revisions, I mean, this is not this is not a new thing. This is something that, you know, we've been expecting.'",
        "'speaker_3': 'So and I also appreciate the mayor's framing remarks in the beginning. This is about moving forward. So I'm going to try to frame my remarks around moving forward and not looking backward. So I appreciate the clarification in the last sentence of the proposal by the Vice Mayor, but I want to focus on what I think is probably'",
        "'speaker_3': 'the most important sentence in that in this proposal, is that the city council may further implement this section by ordinance resolution or rules of conduct. And we had had, I believe, in response to one of the grand jury recommendations, which I would have supported had I voted, but I didn't.'",
        "'speaker_3': 'We are in the process of developing a code of conduct. So I think when this is brought back for approval, in order for the public to see the big picture, we need to bring back that code of conduct, because the code of conduct, you know, outlined the levels of inquiry and it outlined the levels of, for lack'",
        "'speaker_3': 'of a better word, discipline for both board commission members and members of the city council. So I think that, you know, keeping those together, I think, are critical to having the public understand that we take this seriously. And, you know, we are implementing the recommendations of the grand jury and doing it in a way that improves our'",
        "'speaker_3': 'city government. So just a couple quick comments on the other. Let me just pull up my. Sorry. We're a little bit slow. You know, we see this a lot at the national level. And, I mean, it's easy for, you know, all of us who have like minded, like minded political beliefs and opinions to kind of get in'",
        "'speaker_3': 'a room together and sharpen our pitchforks and, you know, come up with all sorts of grandiose ideas and schemes and and plans. And but thankfully, our Constitution exists to control the, you know, the worst impulses of politicians. And, you know, we can be thankful that it's been used effectively in Washington to control, you know, the worst influences'",
        "'speaker_3': 'of the person who sits in the White House. And I appreciate, you know, the Constitution. And, you know, the one thing the Constitution has, you know, is a due process clause. And, you know, I could, you know, probably read it or or, you know, talk about it.'",
        "'speaker_3': 'But, you know, Edward Murrow, I think you all know he was a journalist. And, you know, one of the people that fought against the you know, when the McCarthyism Red Scare was and, you know, he just made a comment that we must remember always that accusation is not proof and that conviction of, geez, my daughter's calling me'",
        "'speaker_3': '. And right in the middle of the best part.'",
        "'speaker_0': 'Which she's not watching.'",
        "'speaker_3': 'Well, it's her phone popped up on the other one. That's the one that lives here.'",
        "'speaker_0': 'Oh, okay. Well, my.'",
        "'speaker_3': 'I guess I lost my place. He said that we we must always remember that accusation is not proof, and that conviction depends upon evidence and due process of law. And one of the weaknesses in the alternative proposal is that there's a mechanism to remove somebody just based on an accusation.'",
        "'speaker_3': 'And I think everyone in this room knows that the power of the district attorney is to accuse and that, you know, it's a court that has to convict. And as customer Abdullah said, you know, there are often many times where the district attorney will accuse and a person turns out not to be guilty.'",
        "'speaker_3': 'And the same with the grand jury. I mean, they're they're their task is to look at evidence, to see if the burden of proof is to accuse somebody or accuse the organization or or do whatever. So I want to keep that in mind.'",
        "'speaker_3': 'And, you know, to issue on the recall, I just want to go back to, you know, of all things that Jenkins report, because I think that Mr. Jenkins, uh, you know, the more that I read this report, you know, I haven't looked at it for a while, but, you know, the more I appreciate that report and a'",
        "'speaker_3': 'lot of the things that were said in there, so know he talked about he quoted a case, I think it was Washington versus something he said the right to hold public office either by election or appointment is one of the most valuable rights of citizenship.'",
        "'speaker_3': 'And he went on and said in California, again quoting a case, The right to hold public office has long been recognized as a valuable right of citizenship. In 1869 and people, the Washington Supreme Court declared that, quote, The elected franchise and the right to hold public offices constitute the principal political rights of citizens of the several states'",
        "'speaker_0': '. So he went on and.'",
        "'speaker_3': 'Continue quoting The right to hold public office either by election or appointment is one of the valuable rights of citizenship. The exercise of this right should not be declared prohibited or curtailed, except by plain provisions of law. And then when he put that in there, he then followed up with his own commentary.'",
        "'speaker_3': 'So I say this not to talk about the rights of any one of us to hold office, but Mr. Jenkins conclusion and and tying those those quotes together, he said the right is not just held by the office holder, but also also by the office holders constituents.'",
        "'speaker_3': 'So that's why I, I don't think that an extra statutory recall provision, I think is appropriate because I mean, I've got to say, from my perspective, I know exactly where the line is. And I'm not worried about ever crossing it or ever being accused of crossing it or ever going in a gray area.'",
        "'speaker_3': 'But. Somebody might. And I think we have to be careful in the future not to vest political power, because that could be the tyranny of the majority. And, you know, I don't think I'm in the minority now. I think I'm in the majority of a great council.'",
        "'speaker_3': 'But, you know, there could be somebody in the future that doesn't have that luxury. And I want to make sure that we protect their rights, not only their rights, but the right of the people that put them there from being kicked out by a majority that may oppose them.'",
        "'speaker_3': 'So, again, I appreciate the mayor's comments. I appreciate all the hard work put into this and I appreciate the updates. And I look forward to seeing the the code of conduct because these two, in my mind, go hand in hand.'",
        "'speaker_0': 'Okay. Thank you. And thank you for the signal. Um, so thank you. And I'm glad you raised the code of conduct, Councilmember Odie, because I was thinking of that too, and I was reading through the staff report. I want to quickly say that I agree with my colleagues, Councilmember Vela and Councilmember Odie, about not wanting to see'",
        "'speaker_0': 'a recall election be a part of this modification. I think we need to be careful to be as nonpartisan in the greater sense of the word as possible. You never know. And again, we're doing this for the future.'",
        "'speaker_0': 'It should not be up to a city council whether or not even after a day and or grandeur, I guess it's day and grand jury finding whether or not to pursue a special election in addition to usurping the right of the voters to choose.'",
        "'speaker_0': 'There's a cost to a special election. And man, are we cognizant of costs these days? But even in the best of times there is. So the. Okay. Okay. I'm just getting a text from the city clerk. Madam Speaker, I believe my first time is still correcting.'",
        "'speaker_0': 'And then we can.'",
        "'speaker_1': 'Yes. I just wanted you to know that I didn't want you to feel like this was your time. And I want you to know you had three more minutes after this, but I can't add it till you stop.'",
        "'speaker_0': 'No, I knew that. Thank you, though, for the reminder. Okay. All right. So where was I? Okay. So, anyway, I do not favor that. The other thing is, as as Councilmember Guillen noted about the D.A., I would add to that to say that D.A. is especially Alameda County D.A., given the breadth and depth of everything that comes'",
        "'speaker_0': 'across their desk, she might not or whoever the D.A. is just might say, I don't have time for this. And that doesn't mean that that isn't something that is worthy of being addressed. But we want to stay away from selective enforcement.'",
        "'speaker_0': 'And I also think simpler and straightforward is generally always the way to go when you're when you're drafting regulations that it's easily understood and unambiguous. And I want to just address a couple of things that some of our listeners addressed raised.'",
        "'speaker_0': 'And one is that, you know, we're rushing this and why now? I would draw your attention to the fact that there was a direction to this council back in July of 2019, and that was held at a public meeting.'",
        "'speaker_0': 'And there was ample opportunity for public comment. And the three of us who were able to vote voted unanimously to accept the findings of the the grand jury. As I further noted about the shortcomings of the Charter with regard to council or staff violating these particular provisions of the Charter.'",
        "'speaker_0': 'And also we agreed to investigate and delineate the charter amend so that the charter delineates specific types of misconduct that constitute a violation, as well as outline and enforcement process. And I happen to think that what the the vice mayor came up with, the modified language does just that.'",
        "'speaker_0': 'And I think I've heard from everyone, if I was hearing you correctly, that you were in agreement. And so notwithstanding that we aren't meeting in public, this issue came before the public. And so I'm not sure what the public would have us do that we're not prepared to do to more specifically delineate what that misconduct and what'",
        "'speaker_0': 'comprises that misconduct and and the the remedy, if that were to happen. And so and and the other thing is this does need to go to the voters again. We expect we respect the right of the voters. This is a charter provision.'",
        "'speaker_0': 'It needs to be amended by a vote of the people. We aren't saying, yep, we're going to make that change in the charter. We're saying we will bring that. If we agree, we will bring that forward to the voters.'",
        "'speaker_0': 'And notwithstanding our or in light of our discussion last night, we can decide we going to move forward with this and we don't need to spend more time wordsmithing and then we are going to meet in June as we also discussed last night to talk about timing.'",
        "'speaker_0': 'But I do want to just add a note of caution because I believe the city manager and I were probably on the same call this morning with county public health are at noon and maybe some of you were.'",
        "'speaker_0': 'I'm not sure that June is the magic day for opening up Alameda County, our public health officer. Let it be known that our county is a little more conservative. The Bay Area, I mean, all the Bay Area public health directors are in lockstep and they're a little more conservative than the governor is.'",
        "'speaker_0': 'He's the governor of the whole state, and different counties have different situations. With regard to COVID 19, the Bay Area is now we know where the first cases in the nation started. So which is just to say I don't want to hold people's hope out that June is going to be magic.'",
        "'speaker_0': 'But that doesn't mean we're not going to keep going forward with city business because we just don't put the city's business on hold. Um, but anyway, I also thank you all, all of you, for your input, for your time.'",
        "'speaker_0': 'And I would like to see we have come this far. I think we've done the work we're asked to do and I would like to see us come to some conclusion. I see Councilmember de SAC with his hand up.'",
        "'speaker_3': 'I just want to if it's okay, I just want to end by just saying this. I believe that if the D.A. and the grand jury substantiates allegations that a council member exercised cronyism. Then I do believe that people should be able to recall that council member through a special election.'",
        "'speaker_3': 'Clearly I don't have the votes tonight for my mechanism. I see that I can certainly read tealeaves. While I won't support councilmember vice mayor language, I won't oppose it either. And I'll just have to deal with it in the coming months.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Okay. And I would ask your strong reconsideration of that part, that position, Councilmember de SAC. And I fully respect your right to vote however you choose. But you were a part of this subcommittee that was tasked with making the the directed changes to the charter.'",
        "'speaker_0': 'And. I. I would like to see your support, but maybe you'll think another minute about this. All right. Any further comments from the council? All right. So here's what we are. Sorry. Go back over. So. Okay. Do we have, um.'",
        "'speaker_0': 'So the the recommendation I think is to was to move forward with the recommendations. So do I have a proposal for what recommendation that would be? Vice mayor.'",
        "'speaker_2': 'All right. Hey, nobody else jumping up after listening? I think I would propose I would move that with that. We direct staff to come back in June with the rest of the items that end up with whatever items end up being recommended for coming back in June with language that adds the mayor.'",
        "'speaker_2': 'So with that with language with the proposed language, I am going to say that I proposed, I guess, for clarifying the language around influence, adding the mayor and city council, although I think that the charter is pretty clear that the mayor is on the city council, but we can always make that clear.'",
        "'speaker_2': 'And the the. Yeah, I will certainly take the city attorney's guidance on better wording. But with the the the sentence restructuring violation of any provision of this section by a member of the City Council shall be prosecuted as prescribed by state law.'",
        "'speaker_2': 'Conviction of which shall immediately forfeit the office of the convicted member. That would be my.'",
        "'speaker_0': 'And I have a clarifying question on the second sentence of your proposed language at the bottom of page two, this sentence that says neither the city council nor any member shall give orders to any subordinates. Oh, you know it it's the from 7-3.'",
        "'speaker_0': 'I just looked at the top of the page. Neither the council nor any of the members. So elegant language there. So maybe that's where you would say neither. No member of the city council, including the mayor or what have you.'",
        "'speaker_0': 'Do you see that second sentence?'",
        "'speaker_2': 'Yes, I would propose we yes, I would propose we leave that in the hands of the city attorney to.'",
        "'speaker_0': 'Yes, that's fine. Councilmember Bell, I think it's a hand up. Yeah. So I want to second this motion. I did want to clarify with the vice mayor, you said to bring this back in June. I wanted to clarify that that would be at the June meeting on the scheduling, correct.'",
        "'speaker_2': 'Yeah. We actually had two. One would be which ones do we actually want to move forward with? And then I think about potential scheduling.'",
        "'speaker_0': 'Right. So this would be at the second June meeting.'",
        "'speaker_2': 'I would bring it back to both so that the guy I my understanding of our emotion last night was that all items that were proposed to move forward would come back so that we could say, here are the four items, or the two items are the one item that we decided to go forward.'",
        "'speaker_2': 'Which do we want to move forward and have a conversation about scheduling in the future so that we can actually decide we don't want to move this forward? I don't hear that happening, but I think that in Councilmember de SAC say that he would like to have the opportunity to know everything that's going on and consider them'",
        "'speaker_2': 'all and make a determination to that point. And if I thought that that's what we decided last night.'",
        "'speaker_3': 'Okay.'",
        "'speaker_0': 'Okay. I guess my question is sorry. At the first June meeting, I thought we would also. Well, I feel like we're giving direction about the specific language here. And there is a majority of us supporting that language that could potentially be put on a ballot.'",
        "'speaker_0': 'So I guess I just want to make sure that when this comes back in June, we're not rehashing this conversation and that we're really talking about timing as opposed to substance of the proposal itself beyond whatever the city attorney might give us.'",
        "'speaker_0': 'And the city attorney has his hand up. So let's hear from him. Councilor Mark.'",
        "'speaker_3': 'If I may preview very much with the matter.'",
        "'speaker_2': 'If I may suggest.'",
        "'speaker_3': 'We would be happy to bring you ballot language when you direct us to bring you ballot.'",
        "'speaker_2': 'Language. So if I may suggest that we do.'",
        "'speaker_3': 'That, once you've made a final decision that it's going to go forward, then whichever meeting you're going to do. So it sounds like the council will convene in June 1st or second meeting to make a decision on which whether any measures go forward.'",
        "'speaker_2': 'And at which.'",
        "'speaker_3': 'Election, once you give us that direction, will prompt you bring in promptly bring you back ballot language and with a staff report, which is what we would normally do with the resolution and everything else, if I may, suggested in the June meeting, it would be true, it would be premature for us to bring you a whole bunch'",
        "'speaker_3': 'of ballot language that creates confusion. And it's probably unnecessary for you to decide whether you want to move forward with an item or not. But and of course, the timing is that we have to get the councils. If you were to do it this November, we'd have to do it at the second meeting in July.'",
        "'speaker_3': 'So there is a little bit of time. So assuming you directed us to do it in the first meeting in June, we'll we'll come back in July with the language for you to amend, modify or put on the ballot.'",
        "'speaker_0': 'Sets indicate Councilmember Vela.'",
        "'speaker_2': 'I would say that is consistent with what I would.'",
        "'speaker_0': 'Okay. And I was actually going to call him Mr. O.D. because he had his hand up, Councilmember.'",
        "'speaker_3': 'Thank you. I mean, I would be inclined to support direction to actually prepare this language. I mean, this was the original charge of the committee. And, you know, as I mentioned in my comments, you know, this is something that that we've been aware of for quite some time.'",
        "'speaker_3': 'So, I mean, I don't know if we have to decide. I mean, maybe we decide this among everything else, but I don't think we need to have a second vote on preparing language. I mean, I don't even know why this would even be an issue about whether or not to put it on the ballot this year, given'",
        "'speaker_3': 'that this was the point of the committee. But, you know, I, I would support something that just said bring the language and then, you know, we vote on it.'",
        "'speaker_0': 'At all counts. Mr. Chen, would that work with you or for you? Yes. I mean, we absolutely.'",
        "'speaker_2': 'Absolutely. If the council directs us to bring us bring language back to you ballot language, we certainly will.'",
        "'speaker_3': 'Well, you know, we probably would look to do that in the second meeting in June or the first meeting in July.'",
        "'speaker_0': 'All right. So what do we think of that, of our councilor Otis suggestion? Councilmember Avella I think the mayor, I guess, yeah. I think, you know, I want to acknowledge what staff is saying in terms of just when they would start preparing ballot language.'",
        "'speaker_0': 'So I think for me, I'm fine with with the current motion as is provided that at that first meeting in June, we are not rehashing the substance of we are we are good to go on this option. And if there is language drafted, it's going to be based off of the conversation that we had tonight.'",
        "'speaker_0': 'And this motion. To me, what I'm hearing from the vice mayor is essentially the only conversation is the overall timing conversation that would happen at the second meeting in June relative to this provision. And if I guess. If we're making that determination.'",
        "'speaker_0': 'I'm also fine with this being on the November ballot. But but but I feel like I've heard my other colleagues suggest that they want to talk about other issues. Councilmember Vela, your time is up, but we can make a vote to give another 3 minutes because there's like I said in the beginning, I do not want anyone'",
        "'speaker_0': 'to feel that they didn't have ample time. And you all have some really good suggestions that I appreciate and want to hear fully. Can we can I? I would make a motion that we give everybody another 3 minutes, pass their time.'",
        "'speaker_0': 'Account. 30 seconds. May we have a roll call vote, please?'",
        "'speaker_1': 'Councilmember de SAG.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Not quite. I.'",
        "'speaker_3': 'Hi. But I have a meeting soon, so.'",
        "'speaker_0': 'Okay. Yeah. Hi. Okay. Continue counseling. So. So. I'm amenable. I think that whatever pathway forward where we can be as united as possible, I'm open to. And if we need to have the conversation on timing together in conjunction with the other provisions, I'm fine with that with in the second meeting.'",
        "'speaker_0': 'But I think I heard you say you would be okay with this being on the November ballot. Absolutely. Okay. So so then I because I am also respectful of staff time and how many times we bring an item back to staff.'",
        "'speaker_0': 'So that's why I'm just thinking maybe for economy staff time, if we could just give us a direction that you and Councilmember Otis seem to be saying we could do now. But Councilmember I mean, vice mayor next. I do not want to.'",
        "'speaker_0': 'Where did you go? Okay. Um, I don't want to. This is your motion. I don't want to hijack it.'",
        "'speaker_2': 'Yeah. I would say that in trying to answer Councilmember Vela's question earlier, her intent was my intent, which was just that it would come back for a quick. Yes, we're moving this forward. Yes, we're putting it on this thing, but that we're not coming back to have a conversation.'",
        "'speaker_2': 'So I think that her recommendation is consistent with my intent.'",
        "'speaker_0': 'Okay. And along with Councilmember Ortiz, that we can give direction to prepare a ballot language and we'll consider it for timing in June, although we've heard.'",
        "'speaker_2': 'I wasn't including that. But we can do that. I don't I don't I didn't hear that that was necessary. I think that in June, when we know what we're moving forward, we can give that direction to the staff and they can work on that language.'",
        "'speaker_2': 'And at that point, if it's important to give them the direction to work on the ballot language now and bring it back in July, that's fine too.'",
        "'speaker_0': 'Councilmember Vela. Yeah. I just. I also want to be considerate of Councilmember Desai again. I think he had he had talked about wanting to hear about what other charter amendments would be put forward and have that conversation in June.'",
        "'speaker_0': 'And I think wherever we can move together, kind of in unanimous agreement of the council and I know tonight he's not necessarily ready to support this. So perhaps that gives another opportunity to have a conversation with him. I'd be open to that.'",
        "'speaker_0': 'I'd like to hear from Councilmember De Saag if he thinks he might change his mind. Thank you. Councilmember De Soto there.'",
        "'speaker_3': 'Is the possibility of changing my mind. There are some issues that I would certainly love to pursue with the city attorney. Um, and it has to do with getting a comfort level with the language, the new language with regard to enforcement that Vice Mayor Knox White has raised.'",
        "'speaker_3': 'Um, and also a comfort level that, um, that we're, that if we move forward with the language right now, that we are not necessarily giving the green light to council members to go ahead and talk with, with the city manager about hiring specific individuals or or so.'",
        "'speaker_3': 'I need to know what are the parameters. And I think we can't we can't flesh that out tonight. And so I think I think for me, I think the wise move is to is to abstain and then talk with the city attorney as well as if he.'",
        "'speaker_3': 'So if he's open to it, I'll talk with continue to talk with Vice Mayor Knox White.'",
        "'speaker_0': 'Oh, I'm sure he's willing to continue speaking with you. Vice Mayor, your hand is up for process.'",
        "'speaker_2': 'I'm going to withdraw my motion. It sounds like there might be another motion that somebody would like to make.'",
        "'speaker_0': 'All right. Over on the other side of my screen, anybody want to make a motion?'",
        "'speaker_3': 'I'm actually on a different my screen. A little different than yours.'",
        "'speaker_0': 'I know. I know. I, I kind of gather that too, but. Okay, so did somebody want to clarify the motion? I mean, I actually thought you were there. And did we not have a second? Yeah. Councilmember Bell. And I thought you were there.'",
        "'speaker_0': 'Vice Mayor.'",
        "'speaker_3': 'Yeah. Yeah.'",
        "'speaker_0': 'If I could just remake the Pacemakers motion with clarity that it would come back in the second meeting in June relative to the conversation on timing. And in the meantime, the staff want to prepare ballot language that would.'",
        "'speaker_0': 'That we would consider it. Okay. Is that how we want to word it or how. How are you feeling about and I don't want to talk about Mr. Death. So when he is sitting here. But is. Well, I guess the preparing ballot language and he may be able to come around to support it in June.'",
        "'speaker_0': 'All right. Could I ask? But the city clerk and the city attorney, did we give you enough clarity or and the direction? And that's and that's for the vice mayor's revised language proposal and then the inclusion of the mayor, the term mayor and your language city attorney?'",
        "'speaker_3': 'I think so. And if I understand correctly, the council will take one more look at this. In the meantime, we might start drafting some draft language, but we won't be bringing it to you for approval in the second meeting in June.'",
        "'speaker_3': 'We'll bring it to you in July along with whatever else you want to yet have approved in July. Yeah.'",
        "'speaker_0': 'Okay.'",
        "'speaker_1': 'Agreed. What he said. That was good.'",
        "'speaker_0': 'What he said. All right. We have a motion. Do we have a second? Don't be shy, people. We've come this far.'",
        "'speaker_3': 'Okay. Fine.'",
        "'speaker_0': 'All right. Councilmember Ody has seconded it. May we have a roll call vote, please.'",
        "'speaker_1': 'Council member days are.'",
        "'speaker_3': 'At stake for now.'",
        "'speaker_1': 'Next light.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Yes, Bella. I may or as the Ashcroft I that carries by four eyes, one abstention.'",
        "'speaker_0': 'All right, everybody, thank you. Good job. I appreciate it. And thank you very much. Okay. So we have concluded item three, A and three, and that leaves adjournment. So with that. Thank you, everybody for your time. Um, all the hard work and fight that went into this.'",
        "'speaker_0': 'I, i am grateful. All right. See you all soon. Take care. Where are you? Masks wash your hands tonight.'"
    ]
}