{
    "Recommendation to Authorize the City Manager to Negotiate and Execute a Purchase Agreement, or in the Alternative a Lease Agreement, for a New Security Camera System from ICU Technologies for the Police Administration Building and Off-Site Property Storage Facilities in an Amount Not to Exceed $274,075.97.  (Police 3116)": [
        "'speaker_5': 'I.'",
        "'speaker_0': 'May or as he Ashcraft I that carries 4 to 1.'",
        "'speaker_2': 'All right, thank you.'",
        "'speaker_3': 'Then we move on to item five, see? And then, of course, you introduced that one.'",
        "'speaker_0': 'Recommendation to authorize the city manager to negotiate and execute a purchase agreement or in the alternative, a lease agreement for a new security camera system. From I see you technologies for the police administration building an offsite property storage facilities in an amount not to exceed 274,000 7597.'",
        "'speaker_3': 'Okay. And, Councilman, that's why you were the one who who pulled this. Did you want a staff reporter? Do you just want to.'",
        "'speaker_1': 'I'm okay without a staff report. I mean, maybe I can mention why. And then if we want a staff report after, we can get maybe more questions. So I appreciate all the information. I appreciate Chief Fenton and City Manager Levitt providing some information earlier today about this.'",
        "'speaker_1': 'I question why six weeks before we are actually hearing back from our community about how we want to prioritize funding and services with regard to our our police department. We are voting tonight to to extend or I'm sorry, increase the budget for the department with very little with an unknown general fund impacts as stated in the in'",
        "'speaker_1': 'the staff report. To me I think it would be better to have this come back as a part of a budget. It's a ten year old system. It was clearly not a priority two years ago. I do understand that there was an issue with some vandalism that's mentioned in the staff report that was not we weren't able'",
        "'speaker_1': 'to prosecute the vandals. But at this time, I'm not confident that this is actually rising to the to to increasing public safety. We have an item Councilmember Spencer has put on nine be at the end of the item, end of the agenda for us to discuss safety and whatnot in the future.'",
        "'speaker_1': 'And I think we should hear through the rest of our policy process before we start spending a quarter million dollars on a video system to catch folks vandalizing the police department.'",
        "'speaker_3': 'So I think, Councilmember, I see that we have joining us interim chief police chief Randy Shin. Captain Jeffrey Emmett, apologies. I don't know. Mark in Fresno, is that a member of the department or a madam?'",
        "'speaker_1': 'Madame Mayor? Yes. Dynamic representative from ICU Technologies.'",
        "'speaker_3': 'Got it. Okay. And before I call on either of you. City manager level. Did you. Are you fine? How would you like us to proceed?'",
        "'speaker_7': 'I could start off from my perspective. Or actually, maybe I'll let Captain Emmett first start off with the reason I was requested. And then I can add on to why. Why move this forward to the council? It actually came forward initially in August.'",
        "'speaker_7': 'I waited till late in the year to move it forward, basically because of the budget concerns that I. Councilmember Knox White had mentioned. But I'll let Captain Emmett first discuss it and then I can add to that.'",
        "'speaker_3': 'Okay. So I will note that I just heard from the city clerk that there are four public speakers on this item, but I am going to treat this like the staff report. And then we will come to the public speakers and we'll see if there are any clarifying questions from the council and then we'll go to our'",
        "'speaker_3': 'staff reports. So I'm Chief and if we could go to you first.'",
        "'speaker_1': 'Thank you for having me. I'd like to defer to Captain Emmett, who wrote the staff report.'",
        "'speaker_3': 'It's kind of where we started. Okay. Captain Emmett, back to you.'",
        "'speaker_1': 'Madam Mayor and members of the council and city staff. Thank you. So the security system that we currently have at the police department is is outdated. It's about ten years old. Its primary function is not to catch criminal acts.'",
        "'speaker_1': 'It is to help protect and to provide situational awareness to the employees that work in the building and for the citizens during normal times outside of COVID that would visit our building. And basically one of the issues that came up that was alluded to earlier, we did have a vandalism that occurred back in November of 2019.'",
        "'speaker_1': 'And the footage that was obtained from that vandalism was very poor quality. The cameras are old, and it did take some time to search through the DVR system that we have that records, all of the the motion activated footage.'",
        "'speaker_1': 'So that was one of the challenges. One of the other challenges that we have in that we're trying to increase is the offsite storage facilities that we use for our property and evidence. We do have two of those locations within the city that does house evidence that sometimes needs to be maintained for forever, whether it's a homicide'",
        "'speaker_1': 'investigation, sexual assault kits that we need to maintain. And we just don't have the space in our police administration building that allows us to keep it all in-house. We do have cameras at some of those locations. We would like to add a layer of security and add cameras in those locations to help to help us keep those'",
        "'speaker_1': 'safe. And if something were to happen at those locations, to be able to provide us some better quality footage that we can go back and look at at a later time if we needed to. Also, looking into the future, the city is has been working on a keycard access system for some of its buildings here.'",
        "'speaker_1': 'And the camera system that we are currently looking at does have the capability of being built into and working with those keycard access systems, which would also help to add a layer of security not only to our building but to our employees as well.'",
        "'speaker_1': 'So that that's. That's the reason we're looking at it at this moment. And to the city manager's comment, we did submit this back in August after a lengthy process with the vendors.'",
        "'speaker_3': 'Thank you, Captain. And Mr. Levin, is your hand up?'",
        "'speaker_7': 'Yes. If I could just add quickly and the reason we are bringing it outside the budget process, even though it wasn't budget, is because this is a replacement of a system that I was convinced is not functioning properly.'",
        "'speaker_7': 'If it was to ask for a new system and we didn't have a system in place, then I would be bringing it back with the budget. I held it because obviously with COVID expenses and COVID revenues and uncertainty, I wasn't sure if I felt I wasn't sure where we were economically.'",
        "'speaker_7': 'So that's why I held it for 4 to 5 months. I feel better economically today than I did four or five months ago, and I felt that we could handle it, although I can't guarantee where that money would necessarily come from because we have had salary costs that we that were, I assume just because COVID has hit'",
        "'speaker_7': 'us in certain ways, there's created salary issues in a variety of departments.'",
        "'speaker_3': 'Thank you, Mr. Levitt. Chief ended. You want to add anything to that?'",
        "'speaker_1': 'I think it was well covered. Again, just providing for the security of our employees and again, the citizens who use our facility, I think is of paramount concern here.'",
        "'speaker_3': 'Okay. Thank you. City council members. Any questions? Clarifying questions from the report. Vice Mayor Vella.'",
        "'speaker_5': 'So a few questions. One is a camera to which it would cover public parking. What's the the the. I guess my question is how far into that parking lot is actually being covered? Because that parking lot is shared with City Hall.'",
        "'speaker_1': 'Vice mayors, that camera that would be on the the southeast corner that would also capture the vehicle gate that our patrol vehicles come out of. I know in speaking with the vendor there, there is a way that we can angle the camera as such not to capture parts of the parking lot.'",
        "'speaker_1': 'That would be concerning. We also do have that storage garage that's in the city hall parking lot where that camera could also help to capture the comings and goings from that area as well. But it would. Which is.'",
        "'speaker_1': 'I'm sorry. Go ahead.'",
        "'speaker_5': 'Yeah. I mean, I think that there's I was going to that was my next question. Was that camera. But specifically because.'",
        "'speaker_3': 'I just would say I would ask that we let one speaker finish before we pose our questions. Captain, I think you were finishing a sentence and then back to the vice mayor. About your property storage area there at the edge of the parking lot.'",
        "'speaker_3': 'So. So, were you saying that the camera.'",
        "'speaker_1': 'Yeah. It would help us to keep an eye on that location. And I think that we could work with the vendor to position the camera in such a way that we were not capturing parts of the parking lot that were not intended with the security camera purpose.'",
        "'speaker_5': 'So I'd like to confirm because are you talking about camera five, garage b two.'",
        "'speaker_1': 'No.'",
        "'speaker_5': 'So we're garage May one.'",
        "'speaker_1': 'Those would be cameras that were more focused on the doors to those locations and inside of the building.'",
        "'speaker_5': 'Okay. So you're talking about the camera that's out that's mounted outside of the motor cage.'",
        "'speaker_1': 'Yes. And I can.'",
        "'speaker_3': 'Do you want to do a screen share check?'",
        "'speaker_1': 'So confirming camera two is, though, is that one on the southeast corner there that would capture part of the public parking lot in between the police department and city hall. More directed towards our vehicle pedestrian or vehicle gate where the patrol cars and.'",
        "'speaker_5': 'Is there a reason we would need to capture the vehicle gate?'",
        "'speaker_1': 'It would be a security concern because that gate is pressure activated from the inside and does remain open. If someone was to walk in behind a vehicle that was exiting, it would allow us to view that.'",
        "'speaker_5': 'Okay.'",
        "'speaker_3': 'Councilmember I mean Vice Mayor Avila.'",
        "'speaker_5': 'For the and yeah I think it's hard to understand based off of has the has the vendor provided. You've said that there's ways to to angle the cameras. Has the vendor provided any diagrams or anything like that that would show what areas would actually be filmed in these in these public spaces?'",
        "'speaker_1': 'No. Just the locations of where they would be mounted.'",
        "'speaker_5': 'Okay. So potentially things that could be captured if mounted incorrectly or if the amounts change would include councilmember parking spots. Correct. As well as some public parking spots in the city hall parking lot.'",
        "'speaker_1': 'But it's not our intention to capture those spots. And we would do everything that we could to prevent that from happening. We are focusing on the the paving and the the security of the.'",
        "'speaker_3': 'The police the police administrative building for.'",
        "'speaker_1': 'Those I'm sorry, the police administration building. And the reasoning for that camera in that position is to capture the vehicle gate and the pedestrian gate that's along that side of the police administration building.'",
        "'speaker_3': 'And I'm just going to interject that we will certainly have our council discussion about what direction we want to take. I want to hold out the consideration also that there may be security concerns for people who work late at night and come to their cars in the evening when it's dark, like I do oftentimes and oftentimes, even'",
        "'speaker_3': 'when I'm leaving in the evening with dark or cleaning, ladies who work late into the night are coming and they work into the early morning hours often. So we'll we'll have that discussion. But what other clarifying questions do we have?'",
        "'speaker_5': 'Did you have work? I still. Yes, I did. And so how long will the video be maintained?'",
        "'speaker_1': 'So video is maintained per state law and I believe it's in the report for any recordings for up to a year.'",
        "'speaker_5': 'Is that in compliance with our our data retention and privacy policies?'",
        "'speaker_1': 'I believe so.'",
        "'speaker_5': 'And who will have access to the footage? Is that subject to a public request for information?'",
        "'speaker_1': 'So one of the nice things about this system compared to the system that we currently have is the the access to our current system is extremely limited. We have one maybe to two people who can actually access the system.'",
        "'speaker_1': 'This system here does allow us to provide more access to employees. We can limit what their accessibility is. As I stated in the report, the the custodian of records will will do their yearly purge when it when we start that in about November.'",
        "'speaker_1': 'And they're the only ones that can actually delete information or or purge it. But it would give, say, a police officer at 3:00 in the morning who typically does not have access to our current system to be able to live view the cameras.'",
        "'speaker_1': 'If, say, there was a concern with something happening around the building or somebody at the front counter that needed assistance.'",
        "'speaker_5': 'Okay. And. In terms of changing the location that the cameras are focused on. What's the process for that?'",
        "'speaker_1': 'I'm not sure I understand your question.'",
        "'speaker_5': 'Can once mounted, can the cameras. The direction of the cameras be changed? And what is the process for that?'",
        "'speaker_1': 'Well, once the cameras are mounted, we want them in a certain location. If they were to move, it would it wouldn't be. What we intended for them to do. So we would have to call the vendor out, or we would have to call for a repair service to come in and reposition them.'",
        "'speaker_2': 'Okay.'",
        "'speaker_5': 'And what this is a question for the city manager. Do we have other another video surveillance system for other city buildings that we use? Or is this the vendor that we use?'",
        "'speaker_7': 'For surveillance. We have limited surveillance systems in other buildings. I think this is the only vendor we use. Can you. We do have the key card system that is currently getting implemented. I think that's a separate vendor bound deferred to the assistant city manager on that.'",
        "'speaker_6': 'Our public parking garage also has a video recording system. It's not working very well, and when it comes time to replace, it will likely look to the vendor that we've been working with, with the police department.'",
        "'speaker_3': 'I think the vice mayor's question and I don't want to speak for her is that is this vendor currently providing surveillance at any other city buildings or property? I need an audible answer.'",
        "'speaker_6': 'Sorry about that. Not at this time.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Okay. Okay. And so to follow up to that, and this is my final question. Other than the city. The parking garage for like where we keep our fleet or at other buildings. Do we have video surveillance? Or do we use other other technology?'",
        "'speaker_5': 'I don't need to know what that technology is. I'm just asking. We use the video technology.'",
        "'speaker_6': 'We have video cameras in the parking garage and at our maintenance service center currently, in addition to the police department cameras that are being.'",
        "'speaker_1': 'That the request is coming forward to.'",
        "'speaker_2': 'Replace. Thank you.'",
        "'speaker_6': 'Also, just one other location, Alameda point. We do have some cameras at Alameda Point as well.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'The. The Civic Center parking garage, Mr. Bowden. The Army to plan. What was the. The second one you mentioned?'",
        "'speaker_7': 'Maintenance. The maintenance facility.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_6': 'And our Alameda Point location, just so folks are aware, is it's a vacant building. And it's just to make sure that we are keeping an eye on things when we don't really have people around. And then inside city hall, folks know of the camera system that's outside of the city manager's office and the city attorney's office.'",
        "'speaker_6': 'So that's the that's the list.'",
        "'speaker_3': 'Q Thank you for the questions. Counsel before we get our public speakers, Councilmember Spencer. Add one more and mute.'",
        "'speaker_2': 'Thank you. Okay. So I'm not sure if you all answered this already, but this looks like the geography included in our fiscal year budget. And why was it not included? Was there some incident that recently occurred? Or was it just, you know, they had the money and city manager or any of these.'",
        "'speaker_7': 'I'll defer to the captain if it's okay, Mary. I defer to Captain. Captain to discuss why it wasn't submitted. It was the same as a proposal in the. In their two year budget.'",
        "'speaker_2': 'But.'",
        "'speaker_3': 'Kevin.'",
        "'speaker_1': 'Thank you. So initially, this project started back in November of 2019 when we had that first vandalism where our operator phone was ripped out of the wall. In looking through that footage, it was very clear that we needed to upgrade our system, which started the process of reaching out to vendors.'",
        "'speaker_1': 'As we were reaching out to vendors, COVID 19 hit, which put somewhat of a delay. I was not sure at the time if we were going to be able to move forward with the project. I fortunately came across the ICU technologies who is able to work with us during the COVID 19 issues that we were all having'",
        "'speaker_1': 'and experiencing. And by the time we went through that process and had reports completed, it was late August. So it wasn't it wasn't planned. And it was just a need that we came up, that we came across. And, you know, the project just kind of wrapped up at the time that it did.'",
        "'speaker_2': 'All right, so there was. I just want make sure we're talking about one incident in 2019.'",
        "'speaker_1': 'Yeah. And we've actually had two recent vandalism that have occurred in the last three weeks. We had some graffiti that was that occurred on the front bricks of the the front steps of the police department. And then last week, we had we had someone break one of the windows to our front doors.'",
        "'speaker_1': 'And, you know, those incidents were were captured on our current system. And again, the quality of the footage is, in my opinion, insufficient.'",
        "'speaker_2': 'All right. So if we don't. Yes, yes. Thank you. So if we don't approve it tonight, does this come back? When does it come back? I guess it's going to be in a mid-year budget or something. When when would we see that?'",
        "'speaker_7': 'It would. The mayor. Mary, can I have two things? It would either come back in either the mid-year budget or come back as far as the next two year budget, which is coming this spring.'",
        "'speaker_2': 'Okay. So how soon is the mid-year budget coming to us?'",
        "'speaker_7': 'The mid-year is scheduled to come on February 16th.'",
        "'speaker_2': 'So you're bringing this now. Otherwise it's going to come February 16th.'",
        "'speaker_7': 'We? That would be an option. You could come forward in on February 16th.'",
        "'speaker_2': 'So other departments will be bringing their additional requests February 16th.'",
        "'speaker_7': 'That. That would be correct.'",
        "'speaker_2': 'All right. Thank you.'",
        "'speaker_3': 'Okay. Any further questions? Clarifying questions. Okay. Let's hear our public speakers. How many public speakers do we have, Madam Clerk?'",
        "'speaker_0': 'We have six.'",
        "'speaker_3': 'Okay, so with six.'",
        "'speaker_0': 'They get 3 minutes.'",
        "'speaker_3': 'Each, so get 3 minutes. Okay. If another speaker comes up, please let us know, because the time will change. Okay.'",
        "'speaker_0': 'With the razor.'",
        "'speaker_3': 'Hello, Mr. Fraser.'",
        "'speaker_1': 'Hello again. I have to.'",
        "'speaker_7': 'Say, it makes me so happy to go first. I'm a middle child. I'm always.'",
        "'speaker_1': 'Overlooked. So being first three times.'",
        "'speaker_7': 'In one night, this is like my night. Anyway, I agree with everything Councilmember Knox said, and I believe that the.'",
        "'speaker_1': 'City manager knows his stuff.'",
        "'speaker_7': 'And so if he says you can't pay employees or you can't find money to pay employees, I would listen to that and not buy.'",
        "'speaker_1': 'A security camera system. I might add that I have a security.'",
        "'speaker_7': 'Camera system and watched my truck roll out of my front driveway. APD has that footage too, and I haven't heard anything back, so I'm not sure footage would help. At least it doesn't sit with citizens. So I would encourage you to wait on that item.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_3': 'Thank you, Mr. Fraser, your next speaker.'",
        "'speaker_0': 'We now have seven additional speakers, so we go to.'",
        "'speaker_3': 'Typically get 2.'",
        "'speaker_0': 'Minutes and Grover Wieman Brown.'",
        "'speaker_3': 'Good evening again.'",
        "'speaker_4': 'Good evening. Please do not spend any more of.'",
        "'speaker_5': 'Our public.'",
        "'speaker_4': 'Dollars on. Surveillance of our community that would just go directly into the police department. Security cameras don't prevent crime. And for me, my personal experience is that they don't keep me safe. They make me feel anxious and worried about privacy and who's watching me.'",
        "'speaker_4': 'And specifically, they don't prevent crime. They just.'",
        "'speaker_5': 'Record crime. If crime happens.'",
        "'speaker_4': 'As it's happening. And so. I just really this is a lot of money and it was put on consent, which worried me. And I just ask you to put on the brakes. And if this is really important to the upkeep, let us have a community debate about it as part of the budget.'",
        "'speaker_4': 'It's a lot of money to spend to surveil us as we walk around the sidewalks and come to protests outside of the police department for what has been mentioned as graffiti or a phone being pulled out of the.'",
        "'speaker_5': 'Wall.'",
        "'speaker_4': 'At a time when so many people in our community need desperate help and funds to keep their businesses open, to feed their children and to stay housed. How many people could stay housed with that amount of money that's being proposed?'",
        "'speaker_4': 'If we were to shift those funds outside of a police camera to support our actual community members that need it badly right now. Thank you.'",
        "'speaker_3': 'Thank you. Next speaker. Madam Clerk.'",
        "'speaker_0': 'Like the Abbey.'",
        "'speaker_3': 'All right. Good evening. This abbey.'",
        "'speaker_5': 'Good evening. I strongly urge you all to vote no on approving the new security cameras for APD. I can't help but continuously think of what almost $275,000 from the general fund can do for this city, for the folks that have lost jobs or housing due to COVID.'",
        "'speaker_5': 'For the public services on this island that already have an astronomically lowered budget than APD. Or maybe we could hire proper mental health workers to respond to mental health calls instead of cops or basically tons of things. It's also concerning that all of a sudden, after protests and rallies that have transpired over the past year, protests that'",
        "'speaker_5': 'often pass by or are outside of APD or nearby at City Hall, they've happened. And now all of a sudden there was a pressing need for security cameras. APD already gets almost 40% of the city's budget. There are current committees looking at and bundling services, and it doesn't make sense for them to take this almost $275,000 from'",
        "'speaker_5': 'the city's general fund. Thank you for your time.'",
        "'speaker_3': 'Thank you. Our next speaker.'",
        "'speaker_0': 'Ginny Sanderson.'",
        "'speaker_3': 'Good evening, Mr. Anderson.'",
        "'speaker_5': 'Good evening again. I just want to I kind of echo and I agree maybe it's for the first time and only time ever with Councilmember Herrera Spencer on asking why this isn't part of the regular budget process, which is coming up in less than a month, apparently.'",
        "'speaker_5': 'I you know, we had this whole debate over the summer about police accountability and racism, and we were told nothing can be done until these steering committees come back with their recommendations. And now the steering committees are starting to come back with their recommendations.'",
        "'speaker_5': 'And we're doing all of this budgeting stuff for APD in the interim. You know, and then I'm curious. City manager Levitt said that he was convinced this system doesn't work or it or doesn't work. And then Officer Mean says that it does work right now.'",
        "'speaker_5': 'So I feel like, you know, if it does work, it can work for another month until we address this budget in the regular budget. I also, you know, there's a lot of departments that are going to be cutting funds because of COVID.'",
        "'speaker_5': 'And as other speakers mentioned, there's a lot of needs in the community. So I'm just wondering what APD would be willing to cut in exchange for almost $275,000, maybe some trainings, which we've been told is incredibly expensive by APD themselves, perhaps some overtime, one or two officer positions or maybe an armored vehicle.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank. Thank you. Mr. Anderson. Our next speaker.'",
        "'speaker_0': 'Laura Katrina.'",
        "'speaker_3': 'Good evening, Miss Katrina.'",
        "'speaker_5': 'Good evening again. Council Members and Madam Mayor. As an Alameda resident, I ask that you do not approve these new security cameras for APD. The request is for almost $275,000, and it states that it would come from the city's general fund.'",
        "'speaker_5': 'And it seems like this upgraded system is a nice to have not need to have all the cameras. I'm just also curious, are the cameras being replacements entirely or that we adding to the system? The cost of replacing an operator full on removing graffiti and replacing glass seems like it would cost a lot less than $275,000.'",
        "'speaker_5': 'And I agree with the comments that have already been made around waiting to see where we go with the recommendations from the committees formed this summer so that we don't make that investment now. But it's our moral documents and how we spend money as a city demonstrates what we value as we continue to fight a pandemic.'",
        "'speaker_5': 'And citizens needs increase due to economic hardships exacerbated by COVID, that $275,000 from the general fund to be used elsewhere. I know that the FT Alameda program just launched, and if we were to take that $275,000, that would be the same as 11,000 meals that can be delivered to folks who are hungry during this pandemic, especially when'",
        "'speaker_5': 'APD budget is almost 40% of the city's budget. I think we need to defer this decision. And if APD wants new cameras, they need to allocate that in their own budget and not coming from the city's general fund.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Thank you, Ms.. Couture. And our next.'",
        "'speaker_0': 'Speaker, Melody Montgomery.'",
        "'speaker_3': 'Good evening, Miss Montgomery.'",
        "'speaker_4': 'Hi. Thanks for the opportunity to speak. I think that most of you all know that we're doing the committees. We're working hard out here with the reforming and the unbundling. And we we believe that you're all city council and city manager on our side and believing that this is a thing to be done.'",
        "'speaker_4': 'And if this is true, I'm asking that you respect the committee's work. Wait until we turn in our.'",
        "'speaker_2': 'Reports.'",
        "'speaker_4': 'And then see if this money can be found through unbundling services some place else rather than just try to throw it in early on.'",
        "'speaker_6': 'Something that we all know.'",
        "'speaker_4': 'The community said we didn't want to spend more money on police right now. Thank you.'",
        "'speaker_3': 'Thank you, Miss Montgomery. Our next speaker.'",
        "'speaker_0': 'Isobel Sullivan.'",
        "'speaker_3': 'Good evening, Mr. Sullivan.'",
        "'speaker_0': 'Hi. I urge you.'",
        "'speaker_4': 'To not approve.'",
        "'speaker_0': 'This new security camera system for the Alameda Police Department. This new system would cost nearly $275,000 coming out of the general fund at a time when many people are experiencing experiencing economic hardship due to COVID 19 and are without jobs and housing.'",
        "'speaker_0': 'And when many of your constituents are demanding a divestment from policing and a reinvestment in communities. Those $275,000 must be spent where the public.'",
        "'speaker_4': 'Is in need.'",
        "'speaker_0': 'A PD's budget accounts for nearly 40%.'",
        "'speaker_5': 'Of the city of Alameda. Total budget. If if.'",
        "'speaker_4': 'APD needs.'",
        "'speaker_0': 'A new camera system, APD should pay for it out of its own budget. Thank you.'",
        "'speaker_3': 'Thank you, Miss Sullivan. Our next speaker at bowling. Good evening, Mr. BOLLING.'",
        "'speaker_6': 'Hi there. Yeah, I'm just a little concerned with that. This was brought up in in concern item and that in I respect like the LAPD may have done some research into finding vendors but this isn't a open bidding process to potentially look for something that may be cheaper.'",
        "'speaker_6': 'I just kind of cursorily Googling the vendor here and not to speak to all of them, but it looks as if they're a reseller of just algun camera products, Motorola along camera products. And if there's other vendors that sell those for cheaper or what their value add is on top of that, I'm curious to hear or if'",
        "'speaker_6': 'there's other products in this space. This seems like a a lot of money to spend on cameras and camera systems that I would like to see, like if there's any competitive bids out there. That's mostly what I've got.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_3': 'Thank you, Mr. Bowling, our next speaker.'",
        "'speaker_0': 'Steve Peres.'",
        "'speaker_3': 'Good evening, Mr. Peres. Just you. Thank you.'",
        "'speaker_1': 'Good evening. Here we go. Hi. I'm just a mute. Thank you so much for allowing me to speak. I just would like to echo what my fellow Americans have said, and just I would like to encourage the council to look into the process for acquiring the cameras, maybe have a more thorough review process as part of the'",
        "'speaker_1': 'annual budgeting process as well. And also would echo the fact that we at the city spend what I think is an inordinate amount on policing. And I would encourage all of you to take a look at how we spend our funds.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Next speaker at Cali State of new.'",
        "'speaker_3': 'Good evening. Yes. Hello. Good evening.'",
        "'speaker_5': 'Again. So I would also like to echo my fellow constituents that this budget request should be denied. People are hungry, they can't pay their bills, they're losing housing. And this request just seems so out of touch with this reality.'",
        "'speaker_5': 'And I would rather see this money used towards under funding, underfunded city services that are proven to increase community safety like health care, food security and housing security. I'm also very concerned with these cameras would be used to surveil protesters, especially given the timing of this request after a summer of protests in front of APD.'",
        "'speaker_5': 'And I believe that this request was first made in August 2020, right at the end of that summer. I also don't understand why we're considering this request right before the committees come back with their recommendations, just out of respect for the committees and also for the public.'",
        "'speaker_5': 'We should have an opportunity to weigh in on this before it's considered. Thank you.'",
        "'speaker_3': 'Thank you. Just for clarification, either, Captain Ed, Mr. Levitt, I. I don't think it was first came first came to us in August 2020. Didn't I hear date?'",
        "'speaker_7': 'It didn't come to the city council. It came to me for as a request and then through my review and look.'",
        "'speaker_3': 'When was that? Mr..'",
        "'speaker_7': 'That was that was in August is when the police submitted it to me. But I didn't move it forward because I had concerns with the budget based on covert COVID at that time.'",
        "'speaker_3': 'Okay. I must have imagined hearing in November of 2019 was that not date night.'",
        "'speaker_1': 'That Madame Mayor.'",
        "'speaker_3': 'Kept captain?'",
        "'speaker_1': 'That was when I initiated looking into replacing our current system.'",
        "'speaker_3': 'Right, right, right. I did hear that. Okay. But I understand. So we're all correct. All right. Our next public speaker, Madam Kirk.'",
        "'speaker_0': 'Meredith Hoskin.'",
        "'speaker_3': 'Good evening, Ms.. Hoskin.'",
        "'speaker_4': 'Hello. Good evening, everyone. I also want to express my opposition to granting additional city funding to the Alameda Police Department at this time. I feel the 275 K in city funds would better support our community, particularly amidst the financial crisis many are facing during the COVID 19 pandemic.'",
        "'speaker_4': 'As the police department already has nearly 40% of the city's budget, I'd recommend they use those funds for their technical needs. Additionally, with the recent violence at our nation's capital on Wednesday, January six, and knowing some reports that representatives from police departments and public agencies from around the country were among the culprits involved in these attacks.'",
        "'speaker_4': 'The city of Alameda should not grant any additional funding to APD or other city departments until confirmed whether or not any of its officers and administrators were among the group of individuals who participated in the violent attack, violating their oath to uphold the Constitution and responsibilities to protect and serve.'",
        "'speaker_4': 'So please take that into consideration as we head into a mid-year budget.'",
        "'speaker_3': 'Thank you, Mr. Hoskin. Our next speaker.'",
        "'speaker_0': 'Vinny Camera.'",
        "'speaker_3': 'Good evening, Mr. Camarillo.'",
        "'speaker_2': 'Hello.'",
        "'speaker_3': 'Yeah. You're right.'",
        "'speaker_2': 'On. Hello. Good evening. I actually serve on the Unbundling.'",
        "'speaker_6': 'Police Services Committee, and I am here in opposition of giving almost $275,000 to the police department when they already get 40% of city funding. They could use their own funding to pay for this absurd amount of money that would come from the general fund.'",
        "'speaker_6': 'And I believe that this is.'",
        "'speaker_2': 'Such bad.'",
        "'speaker_6': 'Timing when we are about to.'",
        "'speaker_2': 'Bring out.'",
        "'speaker_6': 'Our recommendations just six weeks from now. And when I heard that it was brought to city manager Eric Levitt in August, right after the major protests that me and a few others.'",
        "'speaker_2': 'Had organized it. The timing just seemed really off, and I'm concerned about.'",
        "'speaker_6': 'If protesters faces will be.'",
        "'speaker_2': 'Shown and their idea.'",
        "'speaker_6': 'I want their identities to be protected. And I just hope that you.'",
        "'speaker_2': 'Vote against this. Thank you.'",
        "'speaker_3': 'Thank you, Mr. Camarillo. May we have a next speaker, Madam Clerk?'",
        "'speaker_0': 'Morgan Bellinger.'",
        "'speaker_3': 'Good evening.'",
        "'speaker_1': 'Good evening. I just. I just like to say that vandalism is cheap to fix. Terrorism is not. I don't understand how this can possibly be a focus of the police department when there's a white terrorist on the loose.'",
        "'speaker_1': 'Let's give the kids a wall to spray paint if they need a wall to spray paint. But let's let's find our terrorist first before we worry about kids vandalizing buildings.'",
        "'speaker_3': 'Thank you, Mr. Bell. And to our next speaker.'",
        "'speaker_0': 'That was our last speaker. We have no more speakers.'",
        "'speaker_3': 'All right. With that, I will close public comment and we will open it up to counsel discussion. I am going to just throw out a suggestion and you can see what you think. Counsel, I'm thinking maybe this isn't the right time to take this up for a number of the reasons stated and also the fact that we'",
        "'speaker_3': 'are coming up on budget hearings just next month. But I also want us to keep a couple of things in mind. I do think the timing is unfortunate for a number of reasons. There are a lot of issues that get conflated.'",
        "'speaker_3': 'However, I also take seriously the need to protect buildings where evidence of crimes, evidence that will be used to hopefully convict people of very serious crimes are stored. So whatever we do, let's make sure we don't throw the baby out with the bathwater.'",
        "'speaker_3': 'If there are other ways to go about this funding to reexamine the scope and the nature of this request in the not too distant future, I think that that is something the Council might want to consider. But I, I actually look forward to hearing from everybody on the screen.'",
        "'speaker_3': 'Our representatives from our police department. City manager. Assistant city manager. And my council colleagues. So who wants to go first? Councilmember Desai I think I saw your hand up. Then I saw Councilmember Knox White and I think I saw the vice mayor said, okay, so does that not take Vela in that order, please?'",
        "'speaker_6': 'Very well. Thank you very much. I have to believe that when our city manager and his department heads along with staff people who are charged with preparing reports, I have to believe that when they prepare a report with a recommendation that they're they're doing so for serious reasons.'",
        "'speaker_6': 'And so the recommendation is to move forward with these cameras. And it's occurring tonight on on January 19th, 2021. There has to be a reason. Otherwise, no doubt that they would among themselves have talked about, you know, holding it back until February, if not May or June, when we do the two year.'",
        "'speaker_6': 'So so from that vantage point, I'm inclined to support the staff recommendation. I don't think there's support for the staff recommendation. I think there's support more for holding it off for several weeks. And I respect that. I understand that.'",
        "'speaker_6': 'You know, but from my vantage point, though, I think what what I'm weighing heavily is, is that that a recommendation is being made tonight for us to deliberate over and make a decision. And I have to believe that it was a serious.'",
        "'speaker_6': 'There is a reason that that our our staff made that kind of recommendation. There have been some issues that have been raised with regard to the equipment itself, issues regarding privacy. But in reading the staff report, clearly the staff report indicates that the equipment, if and when implemented, would be consistent with our city's privacy data collection and'",
        "'speaker_6': 'facial recognition policies. So so I think that issue is taken care of. But I do think, though, that that the need is there. I mean, given the number of of of of vandalism against the police department building, I think there's certainly a need for it.'",
        "'speaker_6': 'I think certainly there's there is debate among ourselves tonight whether the need should be decided on tonight or perhaps in three weeks in the context of other mid-year items, or perhaps deliberated in several months in May. But but I'm going to go with the staff's recommendation and supporting this for tonight.'",
        "'speaker_6': 'So I do think that we should move ahead with this, and that will be my suggestion.'",
        "'speaker_3': 'Thank you. Councilmember Desai. Councilmember knocks way.'",
        "'speaker_1': 'So assuming that's not a motion, I'll make a motion that we can discuss, which would be to continue this item until the mid-year budget cycle. But I would like to include direction that we wait until after we have heard from the community groups about the work we asked them to do back here that they were asked to'",
        "'speaker_1': 'do back in July of last year before making decisions about how we're prioritizing funding moving forward. So I think it's up to the city manager whether he wants to do it as part of the two year budget that comes to us in April and May and is approved in June and available in July.'",
        "'speaker_1': 'We've waited ten years. We were able to wait over a year for this to start being thought about to come into here. My guess is we can wait another four months without it. We've not heard that this is a major public safety issue.'",
        "'speaker_1': 'And so I would like to remember.'",
        "'speaker_3': 'KNOX Well, if I could ask you to make your motion and we'll get a second and then we'll do the further discussion, please.'",
        "'speaker_1': 'Sure. I'm just explaining my motion. So thank you.'",
        "'speaker_3': 'Okay. That was the direction to staff right now with the Times, with your motion. Yes. Okay. So do you have a second to Councilmember? Not why motion? Vice Mayor.'",
        "'speaker_5': 'L.A.. I'll second it for the sake of discussion.'",
        "'speaker_3': 'Okay, so we've got 2 seconds. So.'",
        "'speaker_4': 'Councilmember Knox. Wait, I.'",
        "'speaker_3': 'Was just trying to get that second in there a bit. STAFF Did you get the direction from Councilmember? That's what they want to find out if there was any more. And City manager. Do you want to chime in on whether because I think there was a possible choice offered as to whether you want to roll this into'",
        "'speaker_3': 'the two year budget or can be for us on February 16th pending obviously council approval.'",
        "'speaker_2': 'Which go through your.'",
        "'speaker_3': 'You're you're muted.'",
        "'speaker_7': 'I think. I think it was that it as I understood the motion and you can correct me if I misunderstood was that it could come either in the mid-year or as part of the two year cycle, but not to be implemented.'",
        "'speaker_7': 'It would not go forward or be implemented until after the police committees had come forward to the city council in March to give their recommendations. If approved by the council, obviously. Is that correct or something?'",
        "'speaker_1': 'That is a fair summation. Okay.'",
        "'speaker_3': 'Okay.'",
        "'speaker_7': 'So I would likely probably bring in the two year budget just because that would be coming closer to the committees, because the two year would probably come forward for council. Discussion in May is what I'm guessing.'",
        "'speaker_3': 'So you would bring it back. Did I hear you say in March?'",
        "'speaker_7': 'No, I probably bring it in the May budget because by the time they close.'",
        "'speaker_3': 'The committee report in March. Is that correct? Okay. And I had heard quite a bit of commentary with a preference for finding the funding in the police budget as opposed to the general fund. COUNCILMEMBER That's why it is that part of your staff direction.'",
        "'speaker_1': 'That would certainly be my preference. Again, I definitely believe that if we're going to spend money, we should. When we're going dipping into the general fund, we are not competing against Paks, against all the unbundled or additional things that we have been saying we want to do, homeless response, etc..'",
        "'speaker_1': 'So I would like to know how we have prioritized this for additional general fund funding. As the city manager and many of our speakers also pointed out, the police department is funded by our general fund so that their budget is the general fund.'",
        "'speaker_1': 'So I don't want to say.'",
        "'speaker_3': 'Yes, there is the budget is the general fund. But there is also a separate segment that is specifically the police budget. You're you're giving the director I was just trying to understand it for clarification sake.'",
        "'speaker_1': 'So they went to the city manager to make the case.'",
        "'speaker_3': 'Okay, fair enough. And did you have any further direction you want to add?'",
        "'speaker_1': 'No, I think that's okay then.'",
        "'speaker_3': 'Vice Mayor Mel, vice mayor of L.A., you're the next speaker.'",
        "'speaker_5': 'So I mean, I have a few concerns. This is the second time there's been a presentations since I've joined the Council with a request from our police department to purchase surveillance equipment that was not you know, did not go through an open bidding process.'",
        "'speaker_5': 'So that's that's something that concerns me, that there's a lot of staff time being put in, and I appreciate the staff time, but typically the way that we see things is, hey, we like this technology. Then it comes to council, we approve a budget for it based off of some like early estimates.'",
        "'speaker_5': 'And then and then we go out to bid so that that process concerns me. But I'm not putting that on on anyone in particular. There were different people involved with each one. It's just that's the process that we use in for for a number of other things.'",
        "'speaker_5': 'I would like to see that used relative to surveillance equipment. The second thing is I, I have concerns about some of the areas that that want that there is a desire to film. I have I have concerns based off of whether or not surveillance of those areas creates free speech issues.'",
        "'speaker_5': 'I certainly I understand safety concerns. However, I also have concerns about who has access to the to the footage, what exactly is being kept. It seems like we want very clear footage of everything, the fact that we're filming the public parking lot.'",
        "'speaker_5': 'Well, you know, where we don't have diagrams of what's particularly being filmed in the areas in question, just the mounting pictures. I think that's you know, I would need more information about like what's the what what areas are we filming?'",
        "'speaker_5': 'I'm personally not comfortable with it. I think it's it's problematic for me, especially in light of the fact that we've had a number of demonstrations and people gathering in these areas. We have not had any issues to date of break ins that I've heard of.'",
        "'speaker_5': 'So it seems like we're spending or proposing the ask us to spend a lot of money for something that has not been a problem. I'm not saying that that's always the approach. Sometimes we want to be proactive, but I think the scope of what the request is is pretty extensive.'",
        "'speaker_5': 'And I also just wonder if we have or we know we're going to have other requests. We have technology. The reason I was asking the questions about what else or do we have video surveillance of, you know, it seems like we do this very piecemeal throughout the city where we acquire technology here and there and we do'",
        "'speaker_5': 'it segmented as opposed to kind of across the board upgrades. So that also is just something that seems odd that we would do it that way rather than have a coherent system. So that that is just another thing that I would like us to look at.'",
        "'speaker_5': 'I'm actually based off of the current proposal as is we can move this. I'm not prepared to support it. I think the expenditure is fairly high. I'd like to have the conversation relative to the two year budget. I would also like to hear from our committees.'",
        "'speaker_5': 'I wonder if this was presented to the committees or contemplated by them. I also think that the scope of what we're trying to film is fairly extensive and beyond what I feel comfortable with. And whenever we're surveilling members of the public, I'd like to balance the privacy concerns and the overreach concerns with the safety concerns, and I'",
        "'speaker_5': 'just don't see that being met here. Thanks.'",
        "'speaker_3': 'Thank you, Vice Mayor. Councilmember Spencer, did you have anything you wanted to add?'",
        "'speaker_2': 'Yes, I could go ahead and take my turn now. First, I want to thank members not like for pulling this item. I'm glad we're having this discussion. In regards to the motion, I actually well, my concern goes to the subcommittees apparently are not going to come back until March.'",
        "'speaker_2': 'The Molly Watkins incident was May 23rd. And I really have a problem with the secret meetings. I'm sorry. They're happening behind closed doors. The public is not part of it. And this is really a public incident. It's a public issue.'",
        "'speaker_2': 'We have many speakers tonight speak in regards to our police. So personally, I have concerns about the ongoing subcommittees happening in private. I actually think it skirts the Brown Act and it definitely skirts the purpose of the Brown Act in regards to this is government.'",
        "'speaker_2': 'And I think they should be meeting publicly just like we are and to the public in calling, we've heard from many speakers tonight that have been have not been given that opportunity throughout the course of it. So I personally would like to hear from the subcommittee sooner rather than later.'",
        "'speaker_2': 'I, I do want to also hear from our police and I think and then our public so that we are having actually a public conversation dialog of where we are going as a city in regards to policing. But honestly, in regards to March, I don't understand why it takes so long incident with May 23rd.'",
        "'speaker_2': 'I think that needs to come back immediately because that is going to be a robust conversation. Rest assured, we've had probably ten speakers for each item that has anything to do with policing tonight, including the public comment early on.'",
        "'speaker_2': 'I expect many participants from across the you know, across the political spectrum on every issue of it. So I personally would like to hear from the subcommittee soon, immediately. So I don't I'm not going to be able to support it.'",
        "'speaker_2': 'So I have concerns about supporting the motion that waits until March and then April alone. Like not the let's focus on the direction of our police. Make that decision needs to be made council. It needs to come to council.'",
        "'speaker_2': 'Council needs to make the decision and then we need to move forward with it, whatever it is that's so personally, I. I don't know if there's any way to get the subcommittee to go public soon and we can hear from them.'",
        "'speaker_2': 'But then honestly, at some point it does come back to council councilors from our police, and then we decide what direction we're taking on all these items. And in regards to the police request from APD. What I was looking for was in regards to the public, the safety of the officers, the safety of the public, things like'",
        "'speaker_2': 'that. And I didn't hear that. I don't think many of us are installing masks or whatnot, whether we are calling cameras in our homes because we're concerned about safety. To rest assured, we're not spending $275,000 to do it.'",
        "'speaker_2': 'And it is my understanding that the quality of the film we're getting can be used as it's good enough for vandalism and assault. I didn't hear the concern that really low as to why we need to spend it now especially and when I heard a lot of things like that for incidents that happen.'",
        "'speaker_2': 'Sounds like November 2019 or something like that. So and so personally and I would say this was sitting out here, a few thought that this was urgent or whatnot. Then the money we should have found the money. If this is an urgent request, it was very is it really that level back when the issues came?'",
        "'speaker_2': 'This is not that I would actually be looking for a different motion. Thank you.'",
        "'speaker_3': 'Thank you, Councilmember Harry Spencer. So we had a motion in the second and I'm going to add my comments before we move on, although we did have a couple of questions. City Manager Leavitt, can you remind us? I do think there's some public forums having to do with the police reform process and subcommittees and seeking the public's'",
        "'speaker_3': 'input. Can you remind us when that is or assistant city manager and whoever has that information?'",
        "'speaker_7': 'I don't have all the specifics in from it, but I think that starting this week, reports from the committees are being released with a series of different surveys as well as public meetings. I think the first public meeting may be this Friday, if I remember correctly, or I think there's a different series as well as them going'",
        "'speaker_7': 'to the different commissions. I think they're going to be going to the Transportation Commission and Srgb, for instance. So I think they're going to a variety of different public bodies to report, as well as trying to get input and feedback from the public in different forums.'",
        "'speaker_3': 'And actually, like magic, I have heard from our our city public information officer, Sara Henry, who says the forum is this Friday, January the 22nd, this Thursday, January 21st. The reports and surveys will be released live. They'll be made live on the city's website, I guess.'",
        "'speaker_3': 'And what time is the forum?'",
        "'speaker_6': '6:30 p.m..'",
        "'speaker_3': 'Thank you, Jerry. And so it's a Zoom forum like this one and. Okay. Yes.'",
        "'speaker_6': 'So if you go to if you search for police reform and racial equity, city of Alameda, okay, you land on the Web page and the Zoom information is there.'",
        "'speaker_3': 'Perfect. Thursday, the reports and the survey will be live. Okay. So the public survey has been out for a while.'",
        "'speaker_7': 'No. It's going out this week, I believe.'",
        "'speaker_3': 'Oh, okay. Got it. That's the reports will be released and the survey will be released. So this is the beginning of the public process just for members of the public who who are interested. And I hope and I am sure that there are many so that there's that housekeeping detail.'",
        "'speaker_3': 'And then we have a participant to the police department representatives. There has been there have been a couple of comments about the open bidding process. Was it was it followed that this was a single source or in any way it wasn't put out to public bid?'",
        "'speaker_3': 'Can either she Sen or Capt Emmett or. I think I'd start with you and this city manager. Assistant City Manager. Want to chime in? Captain Emmett and muted. So, yes, you're up. Thank you.'",
        "'speaker_1': 'I see you. Technologies as a GSA approved company which says.'",
        "'speaker_3': 'General Services Administration of the state of California.'",
        "'speaker_1': 'Correct. So they had to go through a vetting process to obtain that. That title. And what that typically means is that they are going to come in at or below the lowest bid that you would receive during an RFP process.'",
        "'speaker_3': 'Okay. All right. Did anyone want to comment on that? Councilmember Natalie. No. Okay. Okay. Thank you for that. And. And then just talk to us about the concern that has been expressed about the facial recognition capabilities of any surveillance cameras.'",
        "'speaker_3': 'And the concern, I think, about people exercising their First Amendment rights, possibly outside the police department. Yeah. You're kind of on the hot seat, I think, unless who. Who kept an idea from you? I think it sounds like you're closest to this equipment, if that's correct.'",
        "'speaker_1': 'So even if the vigilant cameras do have facial recognition is it is not our intention to use that. We would we would not we would not use the cameras in that fashion. We would not use that technology. As far as the the concern for recording folks that are walking in around our building, whether it be for protest'",
        "'speaker_1': 'or just day to day moving in and about, it's it's not our intention to to have those folks recorded on security camera systems. Our intention, as is with our current system, is to help one, keep our employees safe, to provide situational awareness to the folks that work in our building and to help her protect or at least'",
        "'speaker_1': 'have a starting point of being able to go back and investigate if our property and evidence rooms were tampered with. And same thing with our access to our building. You know, even though it may not have, even though it hasn't happened, I think there's the whether the potential is smaller.'",
        "'speaker_1': 'Great. We would not want folks getting into our building when they weren't allowed to to be there. And the the new system would help again, to give us some situational awareness where we could live stream to certain parts of our department where they are staff 24 seven like our communication center, our records clerks.'",
        "'speaker_1': 'You know, right now during COVID, they do need to verify if people come to the building for a service. And this would help to readily identify those those folks and who they're meeting, meeting with prior to walking out the doors.'",
        "'speaker_1': 'And again, our intention is not to record peaceful protests. Any type of protest that happens in and around our building. It is to help secure the safety of our employees and our property and evidence that we do maintain.'",
        "'speaker_3': 'All right. Thank you for that explanation. So we've had a motion. We've had a second, I would add, with the permission of the maker of the motion, with your consent, if you agree. I would also like to add direction to staff to come back with a refined use policy for this equipment that would address, say, the the'",
        "'speaker_3': 'concerns about the facial recognition aspect of the of this equipment.'",
        "'speaker_1': 'Yeah. I mean, I'm happy to do that. Your comment, actually, if I may, reminds me, we have a surveillance policy that requires such a report to accommodate such a request for purchase of the equipment. So actually, while I appreciated that the staff report says this is consistent with all the policies, it didn't actually bring that.'",
        "'speaker_1': 'Councilmember Vela's comments in your request to remind me that it didn't actually come with that report. And so I would imagine that when it comes forward in the future that that required report that accompanied it.'",
        "'speaker_3': 'Was and that would maybe satisfy the concerns raised by myself and the vice mayor. That's not what.'",
        "'speaker_1': 'I would be happy to give that direction.'",
        "'speaker_3': 'Okay. And Vice Mayor, would you still be happy to second that?'",
        "'speaker_5': 'With with that direction. I also I still have the question of I get that they're GSA approved, but that GSA approved just means they're approved for a specific type of technology. And pursuant to the report that's required, making sure that they're compliant with that, I do still think that there needs to be some sort of process.'",
        "'speaker_5': 'So I do have a concern with saying this is the vendor that we are are in fact going to use. I'm just going to put that out there.'",
        "'speaker_3': 'So are you asking for this to go out to bid or again or.'",
        "'speaker_5': 'I just think that there could potentially be issues being compliant with the existing policy if this vendor does not meet the requirements that we previously set forth.'",
        "'speaker_3': 'Okay. I think that.'",
        "'speaker_5': 'If the technology or if the technology is not so, I don't know how to address that in the motion. I see.'",
        "'speaker_3': 'I see that right now. Right. Go ahead.'",
        "'speaker_1': 'Can I just recommend that we just ask staff when they come back to show us how to to confirm with whoever vendor they are recommending, whether through the GSA or through an RFP, that they understand the requirements of our surveillance facial recognition ban and other ordinances.'",
        "'speaker_1': 'What that what has to be turned on and off in order for this to be a compliant system and that they can meet that.'",
        "'speaker_3': 'Okay.'",
        "'speaker_2': 'Okay.'",
        "'speaker_1': 'You know, personally, I don't have a problem with that using the GSA process. It has its pros and cons, but in government, if we require an RFP, it's going to be another year and a half before we see we see this come back.'",
        "'speaker_1': 'And if it's deemed a priority, I don't want to set this back another 18 months.'",
        "'speaker_3': 'Okay. So okay, Stephanie, look into that. Okay. We've had a motion. We've had a subcommittee. We have a roll call vote, please.'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'Not quite.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Spencer.'",
        "'speaker_2': 'So I had a clarifying question. Oh, yeah. I'm sorry. I just. Real quick, I just wanted to confirm that we would, in fact, hear from the subcommittee prior to the mid-year budget.'",
        "'speaker_3': 'Yes, that's what this is. Do you want to run that by us again?'",
        "'speaker_7': 'You would hear from the subcommittee prior to this item being approved. The mid-year budget is actually coming, the second meeting of February, which is before the subcommittees come in March. But I would move this to the regular budget in May for you so that you'd have the subcommittees before you heard it.'",
        "'speaker_2': 'All right. So if if APD has any other financial request at the mid-year, then we won't be hearing them. Is that what I'm hearing? Say.'",
        "'speaker_3': 'You know what? Let's just stick to this particular item. So we're talking about the motion in front of it. Thank you. Okay. So where were we on the roll call vote? Madam Clerk.'",
        "'speaker_0': 'Spencer?'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Villa. I may or as the Ashcroft high that carries 3 to 2.'",
        "'speaker_3': 'All right. Thank you. Thank you, everyone. Thank you. I'm Captain Emmett, especially interim chief fan and Mr. Levitt and Mr. Burton, for all your input and counsel, for your good discussion. Okay. Moving right along. It has taken us a while to get out of a consent calendar.'",
        "'speaker_3': 'Is it okay? We have finished. I didn't quite see. So we move down to item five I and that was pulled by Councilmember Desert, correct? Yes. Councilmember Desai.'",
        "'speaker_6': 'Great. Well, thank you very much. This item has to do with a density bonus residential project around the intersection of Broadway and Santa Clara Avenue for the residents who are watching tonight and. It's it's the site of the old for those tennis tennis enthusiasts in Alameda, the old site of the drumline tennis instructions, the Murphey site.'"
    ],
    "Adoption of Resolution Approving Tentative Map Tract 8534 and Density Bonus Application PLN19-0448 to Subdivide a 1.29-Acre Property into Twelve Lots Located at 2607 to 2619 Santa Clara Avenue and 1514 to 1518 Broadway. (Planning, Building and Transportation 481001)": [
        "'speaker_6': 'So yeah and you know for a forever the late Mr. Murphy was certainly concerned about measure a so I think having this project move forward, I would I would think that that he's probably looking down and saying finally.'",
        "'speaker_6': 'But, you know, that perspective on this project notwithstanding, I do have some concerns about this project. And the concern is this is that this this project is taking advantage of what's called the density bonus ordinance, which is understandable.'",
        "'speaker_6': 'But I think it's taking advantage of a density bonus ordinance in ways at least the way that the project is currently characterized is taking advantage of the density bonus ordinance in ways that don't meet. The reason why we have the density bonus ordinance in the first place and we have that in the first place, is because the'",
        "'speaker_6': 'the idea behind the density bonus law is that the building, the construction of affordable housing is so exorbitant such that in order to assist, in order to encourage the development of affordable housing and this project would have a to very low income housing housing in order to encourage that.'",
        "'speaker_6': 'State law and local law, which has accepted the state law, allows developers to build an additional amount of units on top of what non density local rules allow. So but, but when I look at this project though, there are not the way that is characterized right now.'",
        "'speaker_6': 'They're not building, they're not constructing very low income housing. What they're doing is they're saying because the Murphy area, the project area has 22 existing residential units right now there are 22 existing residential units. So what they're doing is saying is that two of the existing units will be designated as very low income housing units.'",
        "'speaker_6': 'And so they're not building two very low income housing units. They're rather designating two units that are already there. So there is no actual costs that are being borne by the by the the developer. Certainly they want to build nine market rate unit houses.'",
        "'speaker_6': 'So so I understand that. But in order to qualify from my reading of things, in order to qualify for the density bonus, they would have had to have experienced the triggering event that requires them to to, to, requires them to experience before having the getting the bonus and the triggering events is experiencing some kind of costs that's'",
        "'speaker_6': 'associated with the building of of affordable housing. But because they're not building affordable housing, rather the rather they're designating two units that already exist as very low income housing. I don't see how the project as currently characterized meets the density bonus.'",
        "'speaker_6': 'Now that's the first part of it, but if you do it in another way, you can actually do the project where you can still come out while my math is 11 actually. But, but let's just accept that nine you can still build nine units if you just simply have the two very low income units as part of'",
        "'speaker_6': 'the new construction. So two out of the nine oh could be very low income. They have to be newly constructed. My my math is that they're actually eligible for 11, but if they want to go for nine. Okay, that's fine.'",
        "'speaker_6': 'So if they went that route, I think I think the density bonus law would certainly kick out.'",
        "'speaker_3': 'So, Mr. Desai, I can remember dislike I, I can see why you pulled this. I'm thinking what might be useful to the entire council and the public who's trying to follow along is to get a brief staff report.'",
        "'speaker_3': 'I see that we have magically on screen have appeared are planning building and transportation director Andrew Thomas in the fabulous related Tampa Bay City Attorney's office have been working on this project. Let's have for the benefit of all of us that staff report it can be abbreviated and then we will come back to your clarifying questions and'",
        "'speaker_3': 'probably those of other council members in any public comments we have. But before you go too far into your concerns, I wanted to just have a chance to to allow staff to give their report. Yes.'",
        "'speaker_6': 'If I could just say for 10 seconds, though, and I also have apprized staff of my concerns also. So they're they're very well aware of how I'm framing my concerns.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_3': 'That is only one of my concerns. But you've got nine more seconds. Go ahead, don't you, then? Very economical. You've got 5 seconds left now. We have more time of your clock. Okay, Mr. Thomas, may we hear from you and Ms..'",
        "'speaker_3': 'Chan? Chime in whenever. Whenever you deem appropriate. So please.'",
        "'speaker_1': 'Thank you, Mayor. As the Ashcraft. Can you hear me?'",
        "'speaker_3': 'Yeah, that's. That's good.'",
        "'speaker_1': 'Here you go. It's a 1.29 acre parcel. It has 22 units already on the land occupied within 11 buildings under state density bonus. This project could actually get up to 35 units. In this case, they are only asking to build nine for a total of 31, the nine plus the 22 that already exist under state density bonus'",
        "'speaker_1': '. If the developer makes two units available for very low income households. And what that means is a permanent deed restriction. So essentially what they're doing is council member they Saugus. Correct. They're taking two existing housing units that already exist but are market rate with no caps on on permissible rent.'",
        "'speaker_1': 'And they will be they will be deed restricted to be affordable to very low income households in perpetuity. And that will be managed and supervised by the Alameda Housing Authority. So they could actually do as Councilmember de Sau correctly pointed out, they could do more than nine units, but in this case, they've chosen only to do nine'",
        "'speaker_1': '. So they do qualify for the density bonus and you don't have to build new units for those very low, you just have to make.'",
        "'speaker_6': 'The two units available to. Very well with that I'll.'",
        "'speaker_1': 'If I'm available to answer any questions I think Selena chan would like to add.'",
        "'speaker_3': 'Is Ms.. Chen. Just go ahead and mute. Thank you. See you.'",
        "'speaker_5': 'You as well. Good evening, Mayor. Council members. I just wanted to clarify. State law requires a deed restriction for the two units for a minimum of 55 years. Andrew, are you aware? I can't remember off the top of my head what our inclusionary ordinance requires.'",
        "'speaker_5': 'But if it's longer than 55 years, then obviously it would be that that longer term. But yeah, I just wanted to make that clarification.'",
        "'speaker_1': 'I can't.'",
        "'speaker_3': 'Hear. What was the clarification, Andrew? Is our city. So state law requires a 55 year?'",
        "'speaker_1': 'Yeah. Under state law, it's a 55 year deed restriction. The which of course, they will have. The way it works here in Alameda is that it's a rolls. So essentially when the when whenever it changes hands or the tenant changes, it goes for another 55 years.'",
        "'speaker_1': 'So essentially an Alameda ends up being sort of in perpetuity.'",
        "'speaker_3': 'Okay. I see how you're using in perpetuity. Okay. So so every time there's a new tenant, we just set the clock back.'",
        "'speaker_1': 'The. The. But in this case, I mean, the key point here just in response to Councilmember De Sox question, state law does not require that it be than two new units. It can be provision of just two units.'",
        "'speaker_1': 'Examples under state law, for example, you can get a density bonus under state law, even for a condominium conversion of an existing apartment building. So the concept of making existing units affordable to very low or low income households is something that's embedded in the state law itself.'",
        "'speaker_3': 'And I might observe that it is one of the most economical ways around to provide housing to very low income category because it doesn't require any construction.'",
        "'speaker_1': 'From from SAP's perspective, we also like this approach because it's to two units immediately into our affordable housing. Cool. We don't have to wait for them to be constructed. It's also in this case. So an effort was made to identify existing tenants who were already in the units who already qualified.'",
        "'speaker_1': 'So we will not be displacing anyone as what as well. So it's in this in this particular case, it's working out quite nicely.'",
        "'speaker_3': 'Will these units count toward our Rina requirements?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'All right. Thank you. Back to you, Councilmember De. So did you have further concerns? Okay. I'm sorry, what did you say?'",
        "'speaker_2': 'I just said let others matter.'",
        "'speaker_3': 'Okay. Very good. Okay. Does anyone, madam, click. Do we have any public comment?'",
        "'speaker_0': 'We have one speaker.'",
        "'speaker_3': 'When? Speaker. Okay, before we hear our public speaker, did we have any other clarifying questions from the council? Councilmember Spencer.'",
        "'speaker_2': 'Thank you. Dr. Thomas, could you clarify the two existing units where the tenants are going to carry through what those units are like? How old are they for? Are they one bedroom? Can you describe the two sustained units?'",
        "'speaker_1': 'Yes, I believe they're both one bedroom units. The final the way this the way that the entitlements are structured, the property developers and owners need to execute an affordable housing agreement with the city of Alameda before they do the final map or pull a building permit.'",
        "'speaker_1': 'So all the details have not been fully negotiated yet, which is standard at this stage of the game. But I believe and I can get confirmation on that during before hopefully somebody will text me the answer to that question.'",
        "'speaker_1': 'But I believe it's to single family homes. I mean, excuse me, two, one bedroom units that are being proposed.'",
        "'speaker_2': 'All right. And could you also speak to the parking of it's going to be at this development. Yeah.'",
        "'speaker_1': 'Founded the the the applicant in this case was eligible for. Yes. It's two one bedroom. I the magic of text just arrived. So there's two one bedroom units. In this case, the developers were eligible to waive the parking requirements under state density bonus, but they chose to provide two parking split and maintain existing parking for all the'",
        "'speaker_1': '22 units. The existing parking supply of the exists for the existing and then for the new nine units provide two spaces per unit.'",
        "'speaker_2': 'Okay. And were there any concerns from the neighbors, any letters from the neighbors or opposition from the neighbors?'",
        "'speaker_1': 'I believe we received at the planning board, we received a letter from one of the existing tenants who was concerned about the. Who is concerned about the loss of the tennis courts as far as areas for recreating the nine units are being built on basically on land that had been developed by the former property owners, the Murphys'",
        "'speaker_1': 'as well for two tennis courts and and a basketball court. So that's where the nine units are going there in the interior of the block. They're not facing the street, so they're behind the existing homes. And one of the tenants was concerned about the loss of those tennis courts.'",
        "'speaker_1': 'The planning board and the applicants work together to make the new common open space. There are some internal courtyards and and and common areas for tenants to to recreate and have outdoor space. And that space will be available to the tenants of the existing units as well.'",
        "'speaker_2': 'And do you know if any of the new units will have balconies or outside space for just their family?'",
        "'speaker_1': 'Yes, they will.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Okay. Any further? No. Okay. So if there are no further clarifying questions from council, we have one public speaker, is that correct? Ms. WEISBERGER.'",
        "'speaker_0': 'Now we have to.'",
        "'speaker_5': 'Now.'",
        "'speaker_3': 'We have two adjacent public speakers have to attend a bid of 3 minutes each. So let's have our first public speaker.'",
        "'speaker_0': 'Zach BOLLING.'",
        "'speaker_3': 'Good evening, Mr. BOLLING.'",
        "'speaker_6': 'I just quickly now, I followed this project through a planning board, and I like this proposal a little bit better than some of the earlier designs that were put up, and that.'",
        "'speaker_1': 'It's a great use of some underutilized space, these two.'",
        "'speaker_6': 'Tennis courts underutilized. And to put housing, there is a good boon for us, especially with our our arena allocation that we have to deal with, which is something that is staring us in the face that we have to deal with.'",
        "'speaker_6': 'These units are going to help in any way possible and the two affordable units will are greatly appreciated. And that's what I think.'",
        "'speaker_3': 'You and Speaker.'",
        "'speaker_0': 'Jay Garfinkel.'",
        "'speaker_3': 'Mr. Garfinkel.'",
        "'speaker_6': 'Hello. I would ask you to clarify. Are all of the existing units owned by a single party? Well, the they are. And so the developer doesn't have to specifically buy or pay for the two units that are going to be converted to low income.'",
        "'speaker_6': 'That's one question. The other is, will this count as nine market rate and too affordable for the Reno County? Thank you.'",
        "'speaker_3': 'Thank you. Chris, this is public comment, not Q&A. But I think the.'",
        "'speaker_6': 'Answer.'",
        "'speaker_3': 'Is, well, if you Mr. Thomas, if you wanted.'",
        "'speaker_1': 'Yeah. Just real quick. Yes, we will get for the arena. We'll get nine new units plus two new. Not they're not new units, but two affordable units which were not affordable prior to approving the project. So. And then the applicant all the all the the 22 existing units in the 11 existing buildings are all sitting on one'",
        "'speaker_1': 'large parcel. This is a tentative map. So what this is doing is it's creating 11 parcels for the 11 existing buildings and then a 12th parcel, which is the tennis courts parcel, which will be the nine. The nine townhomes will be on the 12th parcel.'",
        "'speaker_3': 'Thank you, Mr. Thomas. All right. We've had public comment. We've had, I think, council questions. Do we have a motion? Councilmember Knox.'",
        "'speaker_1': 'Slate I'm going to make a motion and I'm going to watch his head when he starts shaking his head. No, I'm going off. So I'm going to make one comment as I'm making my motion. My motion. My understanding is we are approving a tentative map of the density bonus application, and neither of these are tied to the'",
        "'speaker_1': 'development plan that was made that has been approved. And that actually we can't say we don't like what the project looks like in denying either one of these things that they are a separate thing. So given that this is almost ministerial, we just have to find that our staff, professional staff, legal and planning have reviewed the density'",
        "'speaker_1': 'bonus application correctly and come to the proper thing. I'm going to move approval to density bonus application and the tentative map as proposed by Salkeld.'",
        "'speaker_3': 'All right. We have a motion to have a second. Vice Mayor. Bill, I see your second. All right, we've had a motion, a second matter of May. We have a roll call vote, please.'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'Not quite.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Spencer.'",
        "'speaker_2': 'Do we get to discuss the motion after they make the motion?'",
        "'speaker_3': 'Oh, sure we do. Okay, let's. Yes, the motion is the same one that's been before as it hasn't been amended. But let's discuss. Why don't we start with you, council member Spencer.'",
        "'speaker_2': 'Thank you. Going back to Director Tallman, while I understand the motion. I just want it it sounds like there are already plans to add it to include some sort of balconies or outside areas per house. And as much as I appreciate that, that may not be enough.'",
        "'speaker_2': 'So so I'm I plan to support this if that is happening, because for me, here we are in a pandemic. I think it is important that people have some sort of private areas for their family. And I think it's so.'",
        "'speaker_2': 'So that's what I'm looking for. And then I do and I also appreciate the during the parking spaces and then that the neighbors seem to be supportive.'",
        "'speaker_3': 'Thank you, Councilor Spencer. Any further discussion? Okay. So hearing no further discussion and I'll just throw in I think this is a great project as well and it adds more well needed housing as has been noted. So I think that you got partway through the the roll call.'",
        "'speaker_3': 'Madam Clerk, I know you know where you are.'",
        "'speaker_0': 'Here, Spencer.'",
        "'speaker_2': 'Yes. Because that's where it is.'",
        "'speaker_3': 'Yeah.'",
        "'speaker_0': 'Bella. I may or as the Ashcroft I that carries by four eyes one now.'",
        "'speaker_3': 'Wonderful. Thank you, everyone. Okay. Thank you so much, Mr. Thomas. Mr. Chan, nice to see you. Okay, so moving on, we have we come to item five our.'",
        "'speaker_0': 'Final passage of ordinance authorizing the city manager to execute lease amendments for rent relief programs to Rockwall Winery and St George Spirits to the Loan Conversion Assistance Program for rent relief in response to the COVID 19 pandemic.'"
    ],
    "Introduction of Ordinance Amending the Alameda Municipal Code by Amending Article XV (Rent Control, Limitations on Evictions and Relocation Payments to Certain Displaced Tenants) to Adopt and Incorporate Provisions Concerning Capital Improvement Plans (CIP) for Rental Units in the City of Alameda.  (Community Development 265)": [
        "'speaker_0': 'The introduction of ordinance amending the missile code by amending Article 15 rent control, limitations on evictions and relocation payments to certain displaced tenants to adapt and incorporate provisions concerning capital improvement plans for rental units in the city of Alameda.'",
        "'speaker_0': 'And we are promoting the other staff.'",
        "'speaker_3': 'As the safe.'",
        "'speaker_0': 'Right now.'",
        "'speaker_3': 'All right. And counsel, you know, this is all a matter of time management. We will get as far as we possibly can. We don't have to feel that we we don't have to take our entire 9 minutes that are allocated to us.'",
        "'speaker_3': 'But if you do, it just means we probably get less and less territory covered. So who is presenting this item?'",
        "'speaker_0': 'I believe. Michael Roche.'",
        "'speaker_3': 'Michael Roche, there he is. Good evening. There he is. Hi.'",
        "'speaker_6': 'Nice to be here in council. How are you? I've been with you all. All evening. You know, rather than be here.'",
        "'speaker_1': 'We had a slide presentation. But I think in.'",
        "'speaker_6': 'Light of where the council is, why don't we just open it up to questions? And if the questions become more complex, we can either refer to the slides. But I think the council's generally aware of the of the issues with rent control, etc..'",
        "'speaker_1': 'So unless the council objects. Why don't we jump.'",
        "'speaker_6': 'Into clarifying questions?'",
        "'speaker_3': 'You know what I'd like to ask you? What I would like to ask you do Mr. Roush is just give a brief overview for members of the public. So they just bring them along with us and then we'll go into our clarifying questions.'",
        "'speaker_6': 'The the issue is a capital improvement plan policy. And what this would allow landlords to do would be to make certain improvements to their property. These improvements have to be substantial. They can't just be routine repairs or maintenance.'",
        "'speaker_6': 'They would be they would have to be a total of $25,000 and the overall amount and 20 $500 per unit in terms of the improvement. But if they make those improvements, then they would be allowed to pass through those costs to the tenants.'",
        "'speaker_6': 'So that's the that's the overarching principles of this. And the goal is to encourage landlords to improve the housing stock of the community. But the ordinance is set up in such a way that tenants will not be displaced because of this, which I think is an important aspect.'",
        "'speaker_6': 'They won't be displaced temporarily during this. The work cannot be done with the tenants safely in the building. And the other part of it is that tenants will know what the pass through amount is upfront, and so they can make an informed decision whether they want to pay that when the work is done or else they can'",
        "'speaker_6': 'tell the landlord, No, I'm not willing to pay that. And the landlord then has the option of not imposing the pass through on the tenant or having the tenant find alternative housing, in which case the landlord would have to pay permanent relocation payments.'",
        "'speaker_6': 'But the idea is to keep tenants in place, have landlords, make improvements of a substantial nature.'",
        "'speaker_1': 'Have that cost amortized over a.'",
        "'speaker_6': '15 year period in order to increase the housing stock, yet keep the tenants in place.'",
        "'speaker_3': 'Thank you, Mr. Roush, and nice to see the rest of staff there on screen. Okay, Counsel, any clarifying questions before we get to our public speakers? Councilmember Spencer and then Councilmember Knox Way.'",
        "'speaker_2': 'Thank you. Um, Tony Roush. We received, uh, I think opposition to this from the Alameda local, um, the realtors group and I. And part of their concern was that the number I guess is too high, the 25,000 to do a lot of the work that they think they need to do to cover most of the eligible major'",
        "'speaker_2': 'capital improvements and whatnot. I assume you got this letter. Can you discuss, you know, why we're here to support this or how this makes sense? Where you came by the 25,000 or so that they can keep the units that are good enough condition.'",
        "'speaker_6': 'Certainly the.'",
        "'speaker_1': '$25,000.'",
        "'speaker_6': 'Was sort of a staff driven number, thinking that the improvements ought to be so substantial that it's that most of the improvements that we have listed there in the ordinance are such that it's likely to cost that much.'",
        "'speaker_6': 'You're talking typically about, say, new utilities, new new plumbing, new electrical, new h-back for the whole the whole building you're talking about typically painting the whole outside of the building. Often we are we also added converting the the gas to electrical.'",
        "'speaker_6': 'All of those things we believe would probably be $25,000. But if the council is not comfortable with that number. It certainly could reduce that number, say 25 to 15 or something else. We just felt that that was a a good solid number that would warrant the kind of capital improvement that the list contemplates.'",
        "'speaker_3': 'Grandpa Spencer.'",
        "'speaker_2': 'Yeah. Thank you. So was there outreach to the these groups or this group to find out what is the number that they would be comfortable with?'",
        "'speaker_6': 'We met with the we met with the group in August and we did discuss the number with them. At that time, the number was was certainly higher than that. And as a result of that, we did reduce the number.'",
        "'speaker_6': 'But again, I understand the concern that that some of the landlord community has, that the number is still too high. But we feel if, for example, if a new group was only 15 or $20,000, that perhaps there would be other capital improvements that could be undertaken at the same time in order to get to the $25,000 threshold'",
        "'speaker_2': '. Okay. Thank you.'",
        "'speaker_3': 'Okay, counselor. Did you like your Heather?'",
        "'speaker_1': 'Yeah, I do. So, you guys, there's nothing I. I'm asking just. Just so that there's awareness of my thinking before the public comment, but there would be nothing from prohibiting us from actually delaying the implementation of the pass through till later in the year given the COVID crisis.'",
        "'speaker_1': 'Is that correct? That is correct. Okay. Thank you. And can you just add sorry, the question, how is how is a new roof, which is a you need to do it every 20 to 30 years. So it's actually just maintenance.'",
        "'speaker_1': 'Can you describe can you talk about how the how this process identifies what's just routine maintenance and what's a large capital project?'",
        "'speaker_6': 'Well, the the way it's set up, it's talking about a new roof that I think, as you suggest, isn't going to occur every four or five years. It's going to be a 15 or 20 or 25 year before a new roof is on.'",
        "'speaker_6': 'The amortization period for these proposed improvements is 15 years, which we feel is a reasonable amount given all the various improvements. So again, you know, we kind of looked at all of the items generically, felt that if we took it out to say 20 or 25 years, it probably wouldn't result in a a very high or not'",
        "'speaker_6': 'a high enough pass through to encourage landlords to make the improvements now. And by by doing the 15 years, we felt that that would be more encouragement to make these kind of capital improvements as they are needed.'",
        "'speaker_3': 'Thank you. Any other clarifying questions? Council counts over Spencer.'",
        "'speaker_2': 'Thank you. One more. So my understanding is that Oakland, for instance, has a CSP program modeled after Santa monica that has a whole list of approved a list of approved improvements that can be amortized over different periods. Why aren't we seeing after that?'",
        "'speaker_6': 'The Santa monica ordinance. And Mr. Shane can certainly Chip can chime in on this. It is not the same kind of of a capital improvement plan provisions that we're suggesting in the Santa monica situation. It's done as part of what's called a fair return process so that the amortized cost becomes a an operating expense against the revenue'",
        "'speaker_6': 'that a landlord then uses to determine whether or not the landlord is getting a fair return. So it's a much different process. And we felt we felt that this process that we're suggesting really is more is more beneficial in terms of encouraging landlords to make the improvements rather than through a fair return process, which might be seen'",
        "'speaker_6': 'as discouraging landlords from undertaking that process.'",
        "'speaker_1': 'Also under a fair return process. And this process that we're suggesting.'",
        "'speaker_6': 'Here can be done administratively through the program administrator. If we go to a fair return process for capital improvements, it will require petitions, hearings by a hearing officer. And again, that's going to just be more difficulty, we think, for most landlords, especially landlords with have to have fewer units.'",
        "'speaker_6': 'And that's why we're suggesting that it be a more simplified process as set forth in the ordinance.'",
        "'speaker_3': 'Okay. Any further clarifying questions? Then I understand we have. Oh, I'm sorry. Vice President's your hand up by square villa.'",
        "'speaker_5': 'Yeah, I did have a question about why we're moving. Moving away from the net, operating the A.I. to this new structure. What would staff's reasoning for that? For making that proposal.'",
        "'speaker_6': 'We're not moving away from it. Right now, it is a stand alone item in itself and in fact, the way it is set up right now. If a person had gone through the capital improvement plan process, they would have added that amount not as a pass through, but it actually would be added to the tenant's rent as'",
        "'speaker_6': 'a rent increase. And therefore the annual general adjustments would be based on a higher number than what's been suggested here. So we're not moving we're not we're not moving away from the fair return process. The fair return process is a separate way.'",
        "'speaker_6': 'And certainly if the council is interested in in in having that, we could come back with that. But we're not changing the matter. We're just sort of fine tuning, as it were, the current policy.'",
        "'speaker_3': 'And for you. Yes. Okay. So with that, we're going to go to our public speakers. How many do we have?'",
        "'speaker_0': 'We have two public speakers already.'",
        "'speaker_3': 'Go ahead.'",
        "'speaker_0': 'Tony Grim.'",
        "'speaker_3': 'Good evening. This Grim.'",
        "'speaker_4': 'But evening, everyone. I hope the City Council will take a serious look at the concept of past rules and the effect they have on rent increases. This may not be the only pass to request that you will receive.'",
        "'speaker_4': 'In my opinion, passives has the potential to destroy the protection of the Rent Cap Council Pass Ordinance 32 safety. After hearing from two consultant reports that the disparity of income between renters and property owners was increasing, as well as the rise in the percentage of income that renters have to use just for rent.'",
        "'speaker_4': 'What good does it do to establish a rent cap and then add on to it with pass rules? It clearly goes against the intention of the rent cap ordinance. In this particular case, the proposed department ordinances looking at amateur possession theories of 15 to 30 years for a continued pass through in addition to an increase every year'",
        "'speaker_4': '. This is a heavy burden, and I completely disagree with Attorney Ross respectfully that it won't lead to displacement. I think it will lead to displacement. One more point that I'd like to make since I have more time. I do not believe that guaranteeing a fair rate of return will discourage a landlord from making property improvements.'",
        "'speaker_4': 'Why should it? It really shouldn't. Thank you.'",
        "'speaker_3': 'Thank you, Mr. Greer. My next speaker.'",
        "'speaker_0': 'Aaron Pauling.'",
        "'speaker_3': 'Good evening, Ms.. Pauling. Just mute. Miss Pauline. Are you able to mute? Madam Clerk.'",
        "'speaker_4': 'Oh, there you are.'",
        "'speaker_3': 'There you.'",
        "'speaker_4': 'Are. So sorry. So. Good evening, Council. The Alameda Renters Coalition believes strongly that City Council should not implement a new capital improvement plan in pass through during the local emergency period. The City Council has already passed an emergency ordinance for this same period to protect renters against the economic hardship of rent increases and displacement.'",
        "'speaker_4': 'If you do choose to proceed, our request that the changes not begin until after the time period renters are given to pay back rent due to COVID. And we strongly, strongly oppose the pass through. And I agree and agree strongly with Tony Graham on how can guaranteeing landlords a fair return somehow prevent them from this process.'",
        "'speaker_4': 'Having these kind of automatic pass through is a way that most large complexes and investors basically undo the work of having a rent or rent cap. Thank you.'",
        "'speaker_3': 'Thank you. And that was our last public speaker.'",
        "'speaker_2': 'Yes, that was.'",
        "'speaker_3': 'So with that, we we closed public comment. Councilmember Knox White. Remind me for you, was that a motion you were making in the beginning?'",
        "'speaker_1': 'No, but I'd be happy to make one just for discussion.'",
        "'speaker_3': 'Sure. Well, I'm going to be lovely for.'",
        "'speaker_1': 'The staff recommendation with the following adjustment that while the well the capital improvement program can, people can start applying for it, no pass through. Payments will be allowed to start until January 1st of 2021.'",
        "'speaker_3': 'Okay. Do we have a choice?'",
        "'speaker_0': 'You said 2021. I think you mean 22.'",
        "'speaker_1': 'Thank you. That's what Michael. Michael as well. Yeah. 20, 22.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_3': 'It sounded right to me. Do we have a second for that? For the for council. And that's why it's motion. Vice Mayor Vella.'",
        "'speaker_5': 'All second for the sake of discussion.'",
        "'speaker_3': 'Okay, let's have a discussion. Let's have a expeditious discussion. Who wants to lead? Councilmember Daisuke.'",
        "'speaker_6': 'Great. Well, thank you. You know, I'm just going to quickly comment this way. I think we really should be working closely with the small mom and pop landlords in understanding what the right number is. It sounds to me the 25,000 threshold is is a number that's generated in city hall.'",
        "'speaker_6': 'And I'm not frankly sure that city hall is is the right place to generate the number. I think we we have the experience and capacity to evaluate numbers. But but I think we really should be working with smaller mom and pop landlords on that.'",
        "'speaker_6': 'And for that reason, I won't be supporting the motion. Thank you.'",
        "'speaker_3': 'Thank you. Councilmember de SAC. Other comments? Okay. I will go. I think I am comfortable with the vice mayors, vice mayor or the former vice mayors. Motion seconded by the current vice mayor. Because I do worry about the condition of our rental housing stock, and I think that it is very reasonable to delay any implementation in the'",
        "'speaker_3': 'applications until January of 2022. And I think that I am satisfied with the the analysis and the thought that staff has put into this. So by spirit, did you want to. You seconded the motion that we have heard from you?'",
        "'speaker_5': 'Yeah. My my only concern was a couple of concerns, but one is, is that I am concerned about it the starting faster than the 12 months beyond the period of the state of emergency. So I don't know if the maker of the motion is amenable to changing it to that.'",
        "'speaker_3': 'Okay. Just words that are sent that you want to throw something out.'",
        "'speaker_5': 'But just to amend the motion to have it not go into effect until 12 months from the end of the declaration of the state of emergency.'",
        "'speaker_1': 'Yeah, I support that.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'And I. This is a council policy. It's an ordinance or an ordinance. Ordinances obviously can be amended. I do think that there potentially are problems with the calculation of the pass through and the duration of time potentially. But I for the sake of this motion and trying to start addressing some of the concerns relative, I'd be amenable'",
        "'speaker_5': 'to voting for this tonight.'",
        "'speaker_3': 'Okay. So I believe we've all had a chance to speak. Madam, quick, may we have the motion and the roll call vote?'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Not quite.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Spencer.'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Velma. I may or as the Ashcroft I. That carries 3 to 2.'",
        "'speaker_3': 'Thank you. All right. With that, we move quickly. Thank you very much for your time and your perseverance, waiting to get to this item. And with that, we move to item six, see.'",
        "'speaker_2': 'Thank you.'"
    ],
    "Adoption of Resolution Requiring a Project Stabilization Agreement for Certain Construction Projects. (City Manager) [Continued from January 19, 2021; Public Comment Closed]": [
        "'speaker_0': 'Sorry.'",
        "'speaker_3': 'Lieutenant. I appreciate the quick.'",
        "'speaker_0': 'The adoption resolution requiring a project stabilization agreement for certain construction projects.'",
        "'speaker_3': 'All right. Is that you? Assistant City Manager Burton?'",
        "'speaker_6': 'It is. Good evening, Mayor. As the Ashcraft vice mayor. Bela, members of the city council. I'm Jerry Bowden, your assistant city manager. And I'm here tonight with a recommendation that essentially it's to consider adopting a resolution for a policy that would require the negotiation of a project stabilization agreement for certain types of construction projects in the city'",
        "'speaker_6': 'of Alameda. Just very quickly, as you all know, we do have we have all been working with project stabilization agreements. These are essentially what usually amount to agreements entered into by project owners or developers with members of the building trade unions.'",
        "'speaker_6': 'We do have a PowerPoint. I'm not sure how helpful it is. I could just very quickly. Okay, I'm seeing the city head shake now. We're going to work right through.'",
        "'speaker_3': 'Yeah, I'm actually I'm going to just jump in, Mr. Burton, because I know you're aware of some of the conversations that have been going on today. But I my comment is that when I read this item, I was concerned that we are seeking a policy that would require adoption of this resolution.'",
        "'speaker_3': 'If we pass this resolution, as is, it requires adoption by applicants. Owners and developers are only focuses on the concerns of the building and construction industry in the in the language in the terms that would be in this project labor agreement.'",
        "'speaker_3': 'And so what I and also I was concerned when I learned that staff in putting this proposal together didn't actually consult beyond the the building trades construction group. And you know, it's that's a that's a great place to start, but not to finish.'",
        "'speaker_3': 'My concern is that.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Think, you know, that I am all about housing. We need to build housing. We need to finish projects. They need to be efficient, economical. It says as much in the staff report, but an effective play has to be more than just an agreement not to strike.'",
        "'speaker_3': 'It has to address the concerns of all the parties to the agreement. So I did some research and I discovered that in fact there are good examples of just some additional language that I would want added to the proposal that staff has come up with and which I could support.'",
        "'speaker_3': 'And, and this actually comes from and it was attached as council correspondence in your packet this afternoon. It is a successor project labor agreement to the Mission Bay South Development in San Francisco was known as a very successful construction project.'",
        "'speaker_3': 'The developer was could tell us it was entered into by the San Francisco Building and Construction Trades Council, the AFL-CIO and affiliated unions. And the major items that I would want to see is the the inclusion of a requirement to to negotiate with women owned business enterprises, minority owned business enterprises, small local business enterprises.'",
        "'speaker_3': 'And then also that we added section, which is found on pages four and five of the correspondence that was attached. And it is titled Management Rights. And, and it's, you know, it's there the language is there for you to read.'",
        "'speaker_3': 'But it is just important to recognize the perspective of the owners, the perspective of the developers in getting these projects together. It's a it is a three legged stool that is going to fall if all the the the legs are not stable and strong and so on.'",
        "'speaker_3': 'Today, I had several conversations with Andrea Cleaver of the Alameda County Building Trades Council. And yes.'",
        "'speaker_1': 'We are public speakers. We haven't entered comment yet.'",
        "'speaker_3': 'Okay. I just want to just want to say that this is a direction that I would like to see us head in. So any other questions about Mr. Bowden Springs Park before we launch into public comment and then our deliberation?'",
        "'speaker_3': 'Councilmember Spencer. I think I saw your hand up first and then de and then not quite.'",
        "'speaker_2': 'Okay. So I have seen this same resolution attached to a referral by a member of ODY and members hour earlier, and then it was withdrawn. It didn't show up. Right. It sometimes removed from the agenda. And now this is coming forward by the city manager and I'm really not sure what happened there.'",
        "'speaker_2': 'And so can anyone address what happened to the referral and why do I have a staff member bringing this? And that just seems weird to me. I don't know how and I've actually heard that there have been discussions going on for 18 months and yet as far as I know, council has never approved a referral for staff'",
        "'speaker_2': 'to be working on this.'",
        "'speaker_3': 'Mr. Burden or Mr. Levitt, do you want to give the history on this?'",
        "'speaker_7': 'Sure, I can. I can give part of the history on this. So the city council has had, as part of agreements, as far as development agreements, going back before I was even city manager, where there's been some projects that plays were on development agreements.'",
        "'speaker_7': 'There's been different points in time where it's been concerning to different parties or to developers. And so a strategy that occurred back in December of 2019, I want to say November, December 2019, was that we should move forward and try to create a a I feel or create a situation where people that are coming in and are'",
        "'speaker_7': 'looking at city land or city development projects, if there was an expectation of a play or a play that be negotiated, that that would.'",
        "'speaker_3': 'Have it just in the interest of time. I think Councilmember Spencer is asking, how did this go from being a council referral to a staff item? Was it?'",
        "'speaker_7': 'Well, that's what I'm explaining. And so in 2019, so this part, this has been being discussed with the Labor Council and being something that we've been looking at as staff, it was planned to come forward in the fall.'",
        "'speaker_7': 'We were holding out for the new council and I think the referral came forward because it was already in place. So it didn't turn from a referral to this. This was something being worked on by staff and then the referral was asking that it come forward in November or December.'",
        "'speaker_7': 'I can't remember whether it's November or December.'",
        "'speaker_2': 'Okay. My next question. Yeah. My next question in the Executive summary, the last sentence is that the applicant owner developer will work with the Building and Trades Council of Alameda County. Can you explain why staff is naming one trade?'",
        "'speaker_2': 'And member on the mayor has spoken a little bit about this. So can you explain why staff is only name calling out as one building and trees council of Alameda County.'",
        "'speaker_3': 'For clarification, they are the umbrella organization over all the building trades except the carpenters, which are separate.'",
        "'speaker_2': 'In Alameda County. So. So. Yeah. So. Okay. So can you explain that the why why this one as opposed to if they wanted to work with them, if the developer wants to work with the union out of a different county or this other one.'",
        "'speaker_2': 'Right. Or even. Okay. So I wanted to make that. But also in regards to what I'd like to hear from you on that first.'",
        "'speaker_7': 'So I would. Oh.'",
        "'speaker_3': 'Vice Mayor, were you wanting to come in?'",
        "'speaker_5': 'Just that the the Carpenters are also an affiliate of the Alameda County Building and Construction Trades Council. It's an affiliated organization with a number of different local sorts.'",
        "'speaker_3': 'Okay. Okay. But they're not I mean, traditionally they have. And apart. But but the question is then why? Why not when an agreement with other why limits Alameda County.'",
        "'speaker_7': 'So I would say the perspective from staff was the trades count. Alameda County Trades Council would be the representative of the trades in Alameda County and that's why we were discussing specifically with that Trades Council.'",
        "'speaker_2': 'Okay. And my next question is, so we have minority owned businesses that are not part of the trades, right. We women owned, minority owned. And how do they fit in? How do the staff recommendation, how do they fit in?'",
        "'speaker_2': 'Can the developer hire minority owned businesses, not part of the trade there under this? They cannot.'",
        "'speaker_7': 'Well, I think there's three and three parts to that answering that. One is that there's flexibility in here for the city council. And the city council doesn't believe for some reason that there can be an agreement with a specific development.'",
        "'speaker_7': 'The Council can. This policy had a lot of latitude where the Council has the option with three votes to not require a play. So that's one. A second is I think we had some provisions, which I think the mayor's proposal is even strengthened that regarding many minority owned businesses.'",
        "'speaker_7': 'So I think I think there's some language in there to strengthen that. So that's a second part to it. And then the third part is that they would negotiate, but they don't necessarily negotiate the same level for all the trades.'",
        "'speaker_7': 'They try to do it collectively, but if there are some unique circumstances, other businesses could be be involved.'",
        "'speaker_2': 'Okay. And this is on. So staff works for the city. So I'm trying to figure out why this is in the city's best interest, why staff think this is so important that they're going to bring this reform, that they're going to bring this forward as opposed to having a council member bring it forward.'",
        "'speaker_7': 'So I can going back to the initial and part of the slides, we're going to address this. But going back to the initial statement I had. It had to do with the history of plays and how they been connected to the city developments.'",
        "'speaker_7': 'And so we were trying to create a playing field where the developer would understand what what the expectations are as far as negotiations. And then that there's always an opportunity that the council feels a specific project should be not held to this.'",
        "'speaker_7': 'The Council can waive this requirement on a specific project if they feel that it cannot be worked out after that negotiation has started.'",
        "'speaker_2': 'All right. But this also applies to someone leasing property from the city. And if there's a lot of work to be done. Can they they they can't just hire whomever they want. They just can't do the work themselves.'",
        "'speaker_2': 'If they've received so much over $5,000 credit from the city.'",
        "'speaker_7': 'I believe it is the property. I believe it's 5 million in construction or seven. It's either seven or eight that they'd have to.'",
        "'speaker_6': 'Pay 5 million for construction projects. Sorry, Eric, I'll just help this with these numbers. And it's it's seven and a half million if it's a nonprofit entity who's improving leasing city owned property so that we set the thresholds fairly high so that it had to be a substantial amount of work and up to a up to a7a'",
        "'speaker_6': 'minimum of a seven year lease term as well to make sure that there's going to be a significant investment before this this requirement is triggered.'",
        "'speaker_2': 'So does the city have any current tenants that would have fallen under this?'",
        "'speaker_1': 'It's a good question.'",
        "'speaker_2': 'Well, I'm trying to figure out, I think, something that isn't really relevant, that we don't have any situations or we do, and so we have some character would have changed their ability in the past of how they develop their property or how they make the improvements.'",
        "'speaker_6': 'I think that there's there's four there's four parts to the to the recommendation. The one is related to improving city owned properties or city owned leases. But there are also affordable housing projects which which would trigger that threshold fairly readily.'",
        "'speaker_6': 'It's the measure one a excuse me, the yeah, the one a bond for for the county housing that was approved in 2016. The county has a requirement that that labor be involved for when when that bond money does go to an affordable housing project.'",
        "'speaker_6': 'So those would certainly trigger the requirement with or without this. But it just makes it clear that here in Alameda, that is the expectation. And then for other projects where there might be a city contribution to a project, whether it's land or otherwise, that totals that kind of that kind of value for a developer, it would also'",
        "'speaker_6': 'trigger the requirement. And when we look at Alameda Point and Site A, that's certainly another example of a project in in recent memory where the requirement did would have triggered and did trigger because we entered into a legislative agreement with development agreement or a disposition and development agreement.'",
        "'speaker_6': 'So certainly there are examples in recent memory. Greenway Golf, Alameda Point Site A are examples where developers have done that. And then on the the the outside of this agreement and something else where in recent history the city has worked on labor agreements or project stabilization agreements as with our our public construction projects related to CIP.'",
        "'speaker_6': 'So we have a $1 million trigger there. If there's a contract over $1,000,000, then there is an agreement there as well. So kind of a there is a recent history of PSA play discussions and agreements with the city about with projects and development in the city of Alameda.'",
        "'speaker_2': 'But that's on a project by project basis.'",
        "'speaker_6': 'It has been. And that's, I think, what city manager Levitt was was was talking about in terms of adding that certainty or clarity to the process, which is why we thought this would be an opportunity to consider this for the city council.'",
        "'speaker_6': 'It just it really just clarifies the city council's expectations and the city's expectations with respect to labor agreements.'",
        "'speaker_2': 'And do you know of other cities in the Bay Area that have this language?'",
        "'speaker_6': 'There are there are other entities that have tackled this in a more comprehensive way. BART has a similar policy in place with respect to their their projects in other cities.'",
        "'speaker_2': 'Sorry, my question on cities.'",
        "'speaker_6': 'Yet there are cities that have done this on a more project by project basis. And I think the trades folks are actually talking with other cities now about this approach, which creates that clarity for developers.'",
        "'speaker_7': 'Yeah, to expand on what the assistant city manager saying, BART has a more global policy but other cities don't have. It's more on an individual project by project basis.'",
        "'speaker_3': 'And I think just that I mean, Councilmember Spencer, let me just make make a suggestion. We have four public speakers that have been waiting all evening to speak. And I'm wondering whether we should hear our public speakers at least get through that.'",
        "'speaker_3': 'And then we can pick this discussion up because presumably finish hearing public speakers come back to the discussion, go as far as we can, and then continue this at the next meeting. But I, I hate to leave public speakers out there waiting.'",
        "'speaker_3': 'Councilmember Spencer, would you would you allow us to circle. Okay. Thank you.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_3': 'Thank you. So, Madam Clerk, if we could have our first public speaker, please.'",
        "'speaker_0': 'Yes, the first public speaker is Joe Lewis.'",
        "'speaker_3': 'Good evening, Mr. Lewis.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_1': 'My name is Joe Lewis. I am a Bay Area resident and also a member of the Alameda County Taxpayers Association. I am here tonight.'",
        "'speaker_2': 'Seward's Lou and the.'",
        "'speaker_1': 'Council to vote against the proposed project stabilization agreement for certain construction projects in the.'",
        "'speaker_2': 'City.'",
        "'speaker_1': 'Traditionally, pieces include a variety of provisions that actually discourage many local construction.'",
        "'speaker_2': 'Firms from bidding. In short.'",
        "'speaker_1': 'Local workers and.'",
        "'speaker_2': 'Businesses being.'",
        "'speaker_1': 'Generally smaller and nonunion may not apply. Also. Various polls of contractors have shown that PSA can deter folks from bidding. For example, the Admiral Sir survey of contractors said 64% of respondents. Said such agreements are a disincentive to bid and 100% said that they increased costs.'",
        "'speaker_2': 'This is we are living in a critical time when it's not limits. Who can bid, who.'",
        "'speaker_1': 'Cannot bid and admiral restrictions that we need to do. An example of restrictions that have occurred was last year in the city of Concord, in neighboring Contra Costa County.'",
        "'speaker_2': 'The metro crew that had a very reasonable approach to redeveloping the naval weapons station. All same of local unions.'",
        "'speaker_1': 'Delayed and ultimately stalled the said proposal by demanding a project labor agreement. We don't want that similar situation to happen here.'",
        "'speaker_2': 'Another thing, there are a couple of local cases.'",
        "'speaker_1': 'Where project labor agreements have increased costs. For example, in the Alameda Unified School District, the historic.'",
        "'speaker_2': 'Alameda High School Modernization Project, it's had.'",
        "'speaker_1': 'A contract initially a 45,000,000.5. They had 21 change orders that increased the price of the project to 58 million. The only community college district.'",
        "'speaker_2': 'In three months.'",
        "'speaker_1': 'They had their project aim.'",
        "'speaker_2': 'Academic for buildings is 3.6 million, though they've had that started there. Now they've had eight revisions that increased the price to 6.6 million.'",
        "'speaker_1': 'We would encourage you, though, if you are going to do a project stabilization agreement.'",
        "'speaker_2': 'Please have one that includes local.'",
        "'speaker_1': 'Workers and companies to build quality projects built to last. Thank you.'",
        "'speaker_2': 'And that's all.'",
        "'speaker_0': 'Our next speaker is Doug BLOCK.'",
        "'speaker_3': 'Thank you. Sorry, I was muted. Good evening, Mr. Black.'",
        "'speaker_1': 'Thank you. Good evening, Mayor and City Council. My name is Doug BLOCK. I live on Bay Farm Island with my family.'",
        "'speaker_6': 'And I'm proud that our city has a long history of supporting working families and that this resolution is before you this evening. My day job. I'm also with the Teamsters Union. I represent the hard working men and women who pick up our garbage and recycling from a C.I. who deliver the food to our island's grocery stores, your'",
        "'speaker_6': 'local UPS.'",
        "'speaker_1': 'Drivers and more. As a member of the city's Economic Recovery Task Force, I joined.'",
        "'speaker_6': 'With my fellow islanders to ensure.'",
        "'speaker_1': 'That our economy stays strong and our children have bright futures in front of you. Tonight is a well thought out and.'",
        "'speaker_6': 'Negotiated agreement, which I believe will help us accomplish these goals. This gives.'",
        "'speaker_1': 'Us a real opportunity to use our resources to.'",
        "'speaker_6': 'Put our needs to work and to promote local businesses and deliver projects on time, efficient and well-built. Please support the adoption of this resolution. Thank you.'",
        "'speaker_3': 'Thank you, Mr. BLOCK. Our next speaker.'",
        "'speaker_0': 'Jay Garfinkle.'",
        "'speaker_3': 'Good evening, Mr. Garfinkle.'",
        "'speaker_6': 'Excuse me. Good evening. I. I understand that the people who do the labor want to make a fair living. I have no problem with that. I've never really understood some of the language that stabilization legislation or agreements. I read me code, but I'm always a little suspicious when.'",
        "'speaker_6': 'I never understood why government makes these deals that create safe harbors or tip the balance in favor of unions. I know that the building trades organizations donated a considerable amount of money to the Z A Measure Z campaign.'",
        "'speaker_6': 'I know that they contribute considerable amount of money to the state legislators, such as The Winner and Bonta and several others who have been supportive of them. And so I can understand why politicians would support them. But I don't see that the city.'",
        "'speaker_1': 'Gets anything out of.'",
        "'speaker_6': 'Creating these kinds of contracts. And I say, I don't understand them. But I don't see that the city gets anything out of it. I know that the project that was going to be at the Carnegie Building went under because the city enforced some kind of labor agreement.'",
        "'speaker_6': 'I know that the housing excuse me, the school district did the pay raise for the teachers was so exorbitant because the unions have made two contracts so that teachers are getting a raise while the janitors get raises, too.'",
        "'speaker_6': 'So I think it would be more responsible for the city to not enter in these protective kinds of agreements that so strongly favored the labor unions. Thank you.'",
        "'speaker_3': 'Thank you, Mr. Garfinkle. Our next speaker, Andreas Cleaver. Good evening, Mr. Cleaver.'",
        "'speaker_1': 'Hello. I hope folks can hear me.'",
        "'speaker_3': 'Yeah, it's just fine.'",
        "'speaker_1': 'Okay. I've been jumping on the Internet. My name is Secretary Fried with the Alameda County Building Trades Council. And first of all, I would also like to thank this city and the city council for standing up for working people and the relationship we've had with the building trades, having project labor agreements with the city around the Naval'",
        "'speaker_1': 'Air Station and also with the school district. And we'd also really appreciate your consideration for what I think is a very innovative policy around the public lands play policy in this policy that is not just a win for working people, that this policy will ensure that they'll be making sustainable wages and getting good benefits and working in'",
        "'speaker_1': 'safe conditions. This is also a win for for everybody involved. It's actually a win for developers or really leveled the playing field so developers know what's required of them coming in. And if you ask most developers, that is that is most important so that the goalposts don't change in the middle of the game.'",
        "'speaker_1': 'It also ensures a continuation of a skilled and trained workforce, especially the of housing, to make sure that there are workers that are.'",
        "'speaker_2': 'There to build.'",
        "'speaker_1': 'These types of projects. Are the public wins. You're ensuring that there's good, good contractors doing these projects for a good quality. And also there's language to ensure that we're going to have local workforce working on these. And with the amendment that the mayor proposed around minority women owned and small local businesses, we can actually put that language'",
        "'speaker_1': ', strong language in our agreements where the city can't because of Prop two nine. So we can do that. Also, the, you know, the city administration and governance wins because instead of coming every time, as every single project's coming, it comes up and having this discussion, every single project where we are putting a policy forward.'",
        "'speaker_1': 'And as was said earlier, this city council can always reverse that policy on any given project. So you're not locking yourself into this requirement. But it's it's a policy that everybody understands what's expected of them. I will say that I think, you know, the two amendments that I think have been presented by the mayor, we are totally'",
        "'speaker_1': 'open to, we are always encouraging the use of minority women owned and small local contractors. And we can we can build that into our agreements. And also in terms of management rights language, we're comfortable with that language. I think that is would be similar to I think the mayor raised the Mission Bay Agreement in San Francisco.'",
        "'speaker_1': 'We always have management rights language in our agreement, so we're definitely open to that. With that, again, thank you. And I also want to thank all the staff that work with us putting this resolution together.'",
        "'speaker_3': 'Thank you, Mr. Cleaver, and thank you for your time today. And we have one more story here, I'm told.'",
        "'speaker_5': 'Nicole Goring.'",
        "'speaker_3': 'Good evening was goring.'",
        "'speaker_4': 'Good evening, mayor ashcraft and members of the Alameda City Council. Nicole Garing with Associated Builders and Contractors. We have been in the Alameda County community for over 45 years training a skilled and trained workforce. And our apprentices are working in our communities daily.'",
        "'speaker_4': 'And unfortunately, with what is being presented here, the young men and women of minority veterans are not going to be able to work under these projects, under these types of conditions. They are specifically excluded because we are not part of the the union apprenticeship programs.'",
        "'speaker_4': 'We offer apprenticeship programs that are of high quality. And we would like to have the opportunity to work on projects in this community. And we believe our our workers are not going to be able to work due to only being able to use the workers out of the union hiring hall.'",
        "'speaker_4': 'So this definitely is an agreement that is not going to allow the contractors who have been working here on projects that are built to last, they're not no longer going to be able to to do these quality projects for you.'",
        "'speaker_4': 'The current play that is in place. Has there been any data about that on the citywide projects? Have the projects been coming in under budget? Over budget? What is the data? Where is the explanation on how many people have gone into the trades in regards to the current play?'",
        "'speaker_4': 'That is actually as far as what I read in the agreement. It looks to me like it's up this month. It's a three year agreement, so I wanted to know what the status is of that and what the status is.'",
        "'speaker_3': 'Recently we have reached 1159, which is the time that we said this meeting would adjourn. So I'm so sorry to cut you off in mid-sentence, Ms.. Gori, but we have to do that. So with that counted, that's.'",
        "'speaker_0': 'If council wants to vote to continue this item or you can even maybe extend to just let Nicole and then you could close pending comment and continue it. Perhaps if you wanted to just do that.'",
        "'speaker_3': 'A vice mayor, a village. Raise your hand. Go up.'",
        "'speaker_5': 'I was just going to ask if we could extend the meeting for 15 minutes, take you to just hear this item out. I would like to hear the rest of the public comment and then deliberate tonight.'",
        "'speaker_3': 'This is our last speaker. Okay. That would take a vote of four. Councilmember Knox White has a standing.'",
        "'speaker_1': 'Assuming that was a motion i will second that I feel it's in the spirit of what we told the community back in December.'",
        "'speaker_3': 'To go 15 more minutes to hear this last public speaker then do council deliberations if we can finish. Okay. We've had a motion, we've had a second. It will take four votes to continue. I think it would be a nice courtesy to miss scoring because she did have she was within her time with a little over a'",
        "'speaker_3': 'minute left. Madam took me. We have a roll call vote, please.'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'Knox White.'",
        "'speaker_1': 'Hi.'",
        "'speaker_0': 'Spencer.'",
        "'speaker_4': 'No Villa I.'",
        "'speaker_0': 'Mayor as the Ashcraft.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'That required four votes.'",
        "'speaker_3': 'So. Okay. That feels like.'",
        "'speaker_2': 'I'd like to make another motion.'",
        "'speaker_3': 'A cancer risk sensor.'",
        "'speaker_2': 'To allow the speaker to finish your comment and then concludes the meeting.'",
        "'speaker_3': 'And then close public comment.'",
        "'speaker_2': 'And I closed the meeting. We had so much more discussion. I don't think so. Yeah, I.'",
        "'speaker_3': 'All right. There's a motion to continue it just a minute and a half to let Ms.. GREENE complete her comments and then close public comment. And we'll continue this item to as soon as we can to add a second to that.'",
        "'speaker_3': 'I'll second that. I think it's very simple. Okay. Well, I will. Let's. That gets very nuts. Wait a second. The city attorney has a name? Yes.'",
        "'speaker_1': 'Madam Mayor, if you wish to continue this item to a future date, you would need to set up for a date and time. Certain or this or this item would at the end of tonight.'",
        "'speaker_3': 'You're right. Thank you for that. So Councilmember Spencer or OC Councilmember says is the maker of the motion bird counts very ducks why did you want to.'",
        "'speaker_1': 'My friendly amendment would be that we continue this to the February 6th item at 659. Before the before the regular item. And we finished this out.'",
        "'speaker_3': 'Would you would you be amenable to that amendment? Councilmember Spencer.'",
        "'speaker_2': 'Said February 2nd.'",
        "'speaker_1': 'Or February 2nd, is that it? Sorry. Yes, whatever the next council.'",
        "'speaker_3': 'It's just a trick question. Yeah. Okay. All right. Is that good? So usually that would suffice. Okay, great. So we've had a motion by Councilmember Spencer Bean, seconded by Councilmember Knox, by me. We have a roll call vote, please.'",
        "'speaker_0': 'Councilmember de SAG.'",
        "'speaker_6': 'No.'",
        "'speaker_0': 'Not quite.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Spencer.'",
        "'speaker_2': 'I.'",
        "'speaker_0': 'Vela. No mayor as the Ashcraft I. That also fails.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'I'd like to make a motion to continue this item to the second at 659.'",
        "'speaker_3': 'Mayor. Madam Vice Mayor. Would you consider the courtesy of letting the scoring finish the minute in some seconds she had left closing public speaker speaking and then doing that. Because I would really like to do public speaking.'",
        "'speaker_5': 'I feel like there's there's day I. No, because I don't know if there's other people that would like to speak. And I, I feel like we've we basically held this item to the very end. So I don't I actually don't want to close public comment if we're going to hear the item.'",
        "'speaker_5': 'I think I would rather just note who's spoken and if there's going to be more public speakers.'",
        "'speaker_3': 'Okay. Mr. City Attorney, if we can't come to an agreement on continuing and what happens to this, I want to hear from the city attorney. We'll come back to you, Madam Vice Mayor.'",
        "'speaker_1': 'If the council cannot continue this item, it's considered no action taken and staff.'",
        "'speaker_6': 'Would have to bring it back.'",
        "'speaker_3': 'Okay.'",
        "'speaker_5': 'Can I. Can I finish?'",
        "'speaker_3': 'You may.'",
        "'speaker_5': 'So I'm fine letting Ms.. Goring speak. Provided that when we continue this item, public comment is not closed, which was not clear on the last motion. If we can continue it, keep public comment open. What I heard on the last motion was that we would let her be our last speaker and finish her minute and 30 seconds'",
        "'speaker_5': 'out. I would just like to make sure that when we continue this to the to the next meeting, that public comment is not, in fact, closed.'",
        "'speaker_1': 'People won't be able to speak. So can I ask a question?'",
        "'speaker_3': 'Yes.'",
        "'speaker_1': 'Second, that just with the clarification, people won't be able to see speak a second time. But if the.'",
        "'speaker_5': 'New. Correct? I correct.'",
        "'speaker_1': 'I second the motion.'",
        "'speaker_3': 'Okay. Discussion. My concern is if we open up to, first of all, five people stayed long enough to speak on this item and we had good representation. If we open it at this again, we are just making our agendas longer and harder to finish.'",
        "'speaker_3': 'But let's we have let's see. So both has made a motion to allow is going to finish speaking continue to a date certain February six but reopen public comment and I think because we're I have did you second.'",
        "'speaker_3': 'You did. Okay. All right. May we have a roll call vote, please.'",
        "'speaker_0': 'And I just want to clarify the it's continuing to February 2nd at 6:59 p.m..'",
        "'speaker_3': 'Second, why do I say it's okay?'",
        "'speaker_0': 'Councilmember de Thug.'",
        "'speaker_2': 'No.'",
        "'speaker_0': 'Knox, right. Hi, Spencer.'",
        "'speaker_2': 'So.'",
        "'speaker_0': 'Vela. I may or as the Ashcroft.'",
        "'speaker_3': 'I but that was futile. Okay I so.'",
        "'speaker_5': 'I'll reconsider on the earlier motion. I just think that what we've done that.'",
        "'speaker_3': 'Would be lovely that.'",
        "'speaker_5': 'We've basically filibustered. And I'm I mean, we're now curtailing this.'",
        "'speaker_3': 'Okay. So you would reconsider the motion that Councilmember Spencer made. Correct?'",
        "'speaker_2': 'Yes.'",
        "'speaker_3': 'Okay. All right. So just so that motion, as I recall, was continued to February 2nd here, the balance of miss scoring time and close public speakers. And we'll be back on this at the top of the agenda on February 2nd.'",
        "'speaker_2': 'Yes. I just want to clarify. I don't believe there's any other speakers waiting to speak tonight, is that correct? She is correct. And yes, I think that's an appropriate motion. Yes.'",
        "'speaker_3': 'Okay. So we still have the motion. Same second.'",
        "'speaker_2': 'Yes. Okay.'",
        "'speaker_3': 'All right, let's try this one more time with Asta.'",
        "'speaker_0': 'Councilmember Desai.'",
        "'speaker_6': 'Nope.'",
        "'speaker_0': 'Next flight? Yes. Spencer.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'Vella. Yes. Mayor. As he. Ashcraft.'",
        "'speaker_2': 'Yes.'",
        "'speaker_0': 'That carries 4 to 1.'",
        "'speaker_3': 'We did it. Thank you. Miss Goring, I'm sorry to interrupt you. Why don't you pick up right where you left off? I see.'",
        "'speaker_4': 'Or am I? Am I? Can you hear me?'",
        "'speaker_3': 'Yes. Are you? And I'll bet our amazing city clerk knows how much time you have left. Because she knows everything.'",
        "'speaker_0': 'She has a minute and 20 seconds.'",
        "'speaker_3': 'I told you.'",
        "'speaker_4': 'Okay. Thank you for letting me continue. But I am confused as to why I would not be able to speak during public comment on the second, but that can be clarified and answered later. I just wanted to give some examples of what's been going on with project labor agreements in Alameda County and how they have not been'",
        "'speaker_4': 'inclusive of the entire workforce. A continuance of L.A. academic core buildings. The 61258 project had 29 change orders and the contract was increased from 126 million to 134 million, with an engineer's estimate of 120 million. It looks like the contractor there has got the job is continuing to.'",
        "'speaker_5': 'Make it longer and and have.'",
        "'speaker_4': 'Change orders. Alameda Hamlet Hall of justice project was delayed and over budget is this during this time is this going to benefit Alameda taxpayers and the Alameda hard working workers who are now not going to be eligible for these projects?'",
        "'speaker_4': 'So I just wanted to get some updates on the current situation with the public works. Play at 1 million and want to learn more why we want to expand into the private side, especially in some of these contracts that are really deep within companies use of their work.'",
        "'speaker_3': 'This scoring your time is now open. Just for clarification. The reason people have spoken tonight do not speak again is that we we have closed the public comment item and we would never have people get to speak twice on the same item.'",
        "'speaker_3': 'But so with that, we we are a few minutes, 10 minutes past the time that we designated. So I am going to adjourn this meeting and I am going to adjourn this meeting in memory of the Americans in this country, residents of this country who have died of COVID 19 since the beginning of this pandemic.'",
        "'speaker_3': 'As you may know, there was a memorial this evening at the Capitol. That number is now over 400,000. And so we remember, we mourn, we acknowledge the grief of their family and friends, and we look forward to moving past this dark time.'",
        "'speaker_3': 'So with that, thank you all for your perseverance, for staying with us. Remember to tune into the inauguration at 9 a.m. tomorrow morning. My guests this morning get a little sleep before then and we will see you soon.'",
        "'speaker_3': 'Take care. Stay safe. Wear your masks whenever you leave your house. There is a more contagious variant of the coronavirus out there. Take care. Thank you. Good night. Meeting is.'",
        "'speaker_2': 'Adjourned.'"
    ]
}