{
    "Recommendation to Endorse Next Steps and Projected Costs for Commercial Streets (Parklets) Two Year Extension. (Planning, Building and Transportation 20962740)": [
        "'speaker_2': 'Recommendation to address next steps and projected costs for commercial streets, which are parklets for a two year extension.'",
        "'speaker_0': 'A Q and so I am seeing a city of Alameda zoomed to. Does that indicate or is that you, Madam Kirk? Mr. LEVITT.'",
        "'speaker_2': 'We're working on promoting the planning, building and transportation director.'",
        "'speaker_0': 'There you go. Okay. So we will bring up I believe that would be Andrew Thomas and.'",
        "'speaker_1': 'And.'",
        "'speaker_0': 'Then Councilmember Harry Spencer. You'll have somebody to ask your questions or make your comments to. I'm ready to make comments, if that's all right. I would like to give the planning, building and transportation director the courtesy of we don't want to make him out of breath by ready to get to the zoom.'",
        "'speaker_0': 'Theory is like it. It's daytime, wherever.'",
        "'speaker_1': 'It's apparently sunny at that point.'",
        "'speaker_0': 'Yeah, it's always sunny in El Reno. All right. So went, hello, we have a mr. Thomas. Do you want to just introduce yourself and your colleague there?'",
        "'speaker_1': 'Oh, yes. Andrew Thomas, planning building and transportation director. I'm joined tonight by Robert Vance, our city engineer. The item before you tonight is really just a status report on our ongoing effort to manage Parklets and the next steps for the Commercial Streets program.'",
        "'speaker_1': 'We will be coming to the council at a in the next couple of months with an actual contract for what we described in the staff report. So the actual decision making and voting really will be occurring when you authorize the money for the next step in the project.'",
        "'speaker_1': 'But we wanted to give you an update on where we are at and the direction we were headed. So that was really the purpose of tonight's report. I think Mr. Ransome myself are here to answer any questions you might have about those next steps.'",
        "'speaker_0': 'Perfect. Well, Councilmember Harry Spencer pulled this item in some way to turn the floor over to her Councilmember Herr Spencer. Thank you, Mayor. I don't have any questions. I just have comments. So I'm happy to actually thank staff for their comprehensive report of this item.'",
        "'speaker_0': 'I have thought that we should follow what other jurisdictions, some other jurisdictions are doing in regards to having payrolls for the parklets and not as opposed to decorative concrete barriers that are the reason I want I want to commend staff because they were very forthright in saying that, yes, in fact, the corrals are not only less expensive'",
        "'speaker_0': 'than the anticipated cost is almost the approximately $200,000 difference at the corrals or less, while also acknowledging that the crews are safer. And so I appreciate that that's my position. So I will not be voting for this. I think it's critical that especially when we can save money, $200,000, that that be made very clear that rather than'",
        "'speaker_0': 'doing something that is safer and less money, the recommendation of the council's direction has in fact been to do something that provides less safety and at a higher cost. So I will be voting no for this.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay. Kelso, Woodside.'",
        "'speaker_1': 'Well, I appreciated the staff analysis indicating K rails are safer and and less expensive. So to me, I think I would rather just adopt the K rails as opposed to the, the what the, the, the alternative. So I'll, I'll move adoption of this with the proviso that that we pursue k rails and kiwirail's in place of the'",
        "'speaker_1': 'the the what's on the table.'",
        "'speaker_0': 'Okay. And let's hear from what did you want to second that Councilmember Harry Spencer. Okay. Is that decorative, concrete barriers? And then I see Councilmember Enough hands up. Councilmember That's why.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Know we have our our city engineer on the line. And I believe that the misrepresentation of what the staff report says about safety, I think needs to be clarified. I'll ask it is a leading question. My understanding is that it is the position of the engineers about who are in charge of safety on our streets, that the'",
        "'speaker_3': 'proposed decorative barriers are actually just as safe at 25 miles an hour and provide the level of safety as necessary and the rails which are designed to tip for freeway medians. In terms of the level of say that many in most cities don't aren't even putting barriers out, let alone decorative ones.'",
        "'speaker_0': 'And Mr. Vance may be calling you to comment.'",
        "'speaker_1': 'Thank you, Madam Chair. City Council Members. Yes, it is our position that the these concrete barriers to provide a satisfactory level of safety to protect the the parklets. We haven't done a side by side comparison of the rail versus the the concrete barriers, but my research has shown that they do provide the protection that we're providing that'",
        "'speaker_1': 'we're asking for.'",
        "'speaker_0': 'Whether they get it at speeds above 25 miles per hour.'",
        "'speaker_1': 'I don't have crash data that shows exactly how these two would perform side by side. So I can't make it. I can't. I mean, that was. We haven't done testing to show that. But I mean. But we've determined that these are safe for the conditions that are on the street today.'",
        "'speaker_0': 'Thank you. Councilor Harris Spencer.'",
        "'speaker_3': 'And then if I could.'",
        "'speaker_1': 'Sorry.'",
        "'speaker_3': 'I guess I was going to say I won't be supporting the motion simply because I believe that almeida's actually even with these decorative concrete, more decorative, nicer looking concrete barriers is going far and above what most cities in our in the Bay Area are doing for Parklets.'",
        "'speaker_3': 'And also that I think designing our downtown business district so that they look like freeway medians would be a problem. And since we're doing this as a place, a way to kind of increase the placemaking on Park Street in Webster Street and the increase in them being a place where people want to be.'",
        "'speaker_3': 'I fully support the staff recommendation.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Carlos, from the site. Back to you, Councilmember Hurst. Let's hear from Mr. Thomas. Mr. Thomas.'",
        "'speaker_1': 'I just from a process perspective, we don't need a motion. We don't need direction at this point. I think what I'm hearing, though, is we have to come back. Our plan is to, first of all, come up with a striping barricade plan.'",
        "'speaker_1': 'Then we can cost it out. Then we bring it to council to contract out for a single contractor to buy the barricades for us and place them for us and do the necessary striping of the striping on the street.'",
        "'speaker_1': 'So we plan on coming back. But I think, you know, if you would like what we can do is come back with a contract proposal that prices both options and the council can make that decision at that time.'",
        "'speaker_1': 'Just one quick point that I think we I hope we emphasize in the staff report, I can't remember a while ago we wrote the staff report visiting with the business community, talking to all the businesses. There was a feeling of the current situation with the water filled barricades and just the appearance made.'",
        "'speaker_1': 'The entire street, particularly on Park Street, look a little bit like a construction zone. And the Kay Rails, everybody felt the highway corrals will perpetuate that for another two years. So the decorative concrete from a bit from the business's perspective and I think from staff's perspective, we felt like since the goal of this program is to support'",
        "'speaker_1': 'our business community, help them survive through COVID and out of COVID, this this concern about trying to make Park Street look a little bit more uniform, less of a construction zone for the next two years. So that's why we were recommending the decorative.'",
        "'speaker_1': 'But at the end, all we can do is we can price them both out, bring them both forward for the final contract. And the council can make the decision at that point whether you want to do the more expensive rails or the or the the less expensive excuse me, less expensive rail versus the more expensive decorative.'",
        "'speaker_1': 'The other option is you can tell us right now. Don't come back with that other option. And just we just want one option. And you can determine right now what that option might be.'",
        "'speaker_0': 'And I like the sound of your approach because what we're hearing, Spencer Then I have a thought and then decide and then I have good council rehearsed back there, so I would just like to read from a staff report.'",
        "'speaker_0': 'That's why I want to commend staff for being forthright about this, the safety issue in the report. And it does say from a safety perspective, staff believes the decorative concrete barriers provide a significant increase in safety and esthetic improvement over the current water filled barriers, which is great, although a K rail is heavier and would provide additional'",
        "'speaker_0': 'collision protection from staff's perspective, that extra protection is not needed for a street with a 25 mile per hour speed limit. My position is that safety is the most important when we have an accident and we have had accidents here in town.'",
        "'speaker_0': 'You can go out and you can see the areas where they've been hit. We've been fortunate that we haven't had people being injured. However, not every city or jurisdiction has been so lucky. And so for me, safety is, in fact, the most important.'",
        "'speaker_0': 'And I appreciate the esthetics and other cities do, too, that do have rules. And what they have done is they painted them. They decorated them to blend in or put planters on one side of them versus the other to try to address that.'",
        "'speaker_0': 'That city throughout the state and I believe Fremont in Northern California from my research is using the K Rail. So I appreciate being able to share that. And I do like the staff being upfront about the safety issue.'",
        "'speaker_0': 'Thank you. Thank you. Councilmember Desai.'",
        "'speaker_1': 'Thank you. I just want to say overall in I'm incredibly supportive of the program on Park Street and Webster Street. I know, you know, people are concerned about, you know, the reduction of the to two lanes in one direction, two lanes in the other direction to one lane in one direction.'",
        "'speaker_1': 'But but I really do feel it slows things down and it does make life a lot more enjoyable on the on on either street. And and I will say, you know, I think just more information.'",
        "'speaker_2': 'I think would be great.'",
        "'speaker_1': 'You know, I think the mayor, for example, raised, you know, what if. How does it how does the decorative barrier hold up at maybe 30 miles per hour or 35 miles per hour? If we could just get more information, that would be great.'",
        "'speaker_1': 'So, you know, I could be convinced to support the decorative. So but, you know, I think what the planning director had suggested is just, you know, holding off, bring more back, more information, I think is a thought is I can live with that.'",
        "'speaker_1': 'So I if we pursue that that direction, I'm more than happy to withdraw my motion.'",
        "'speaker_0': 'Okay. Well, I would side with you on that. And what I just wanted to add is that cost isn't my primary consideration, it is safety followed by a statics. And the the thing about, you know, noting that this is a street with a 25 mile an hour speed limit.'",
        "'speaker_0': 'I think we all know that most of our streets have a 25 mile per hour street speed limit, but unfortunately, people exceed the speed limit and sometimes terrible things happen. And we have had on Park Street twice the same Parkland has been hit.'",
        "'speaker_0': 'And mercifully, one time the most recent was after hours and nobody was there. But the first time people were injured, not seriously. But I so what I would love is to pursue the planning director and with the city engineer's input, obviously suggestion that they just come back with those comparisons and side by side of the cost, the'",
        "'speaker_0': 'benefit and maybe they really are comparable. And so, you know, here we've got the data to go with one over the other. But I think at this point, I just you know, I think we do have to do our street designs with the understanding in mind that not everybody is a law abiding driver.'",
        "'speaker_0': 'And we but we just want to protect people. I do like the program. So. So Councilmember, they said, what's your pleasure?'",
        "'speaker_1': 'I'll withdraw my motion and take up planning director Andrew Thomas's suggestion as to how he will proceed and will look for more information.'",
        "'speaker_0': 'Just to persist after action. Okay, so good counsel, everybody. Nodding heads, casual remarks. Wait, your.'",
        "'speaker_1': 'Thoughts?'",
        "'speaker_3': 'I think it's great. At the end of the day, we can I mean, we could remove cars that would be the safest. I don't see anybody. It's but again, everything can always be safer. The question we need to ask is, does it add and does it provide an adequate, good faith effort for safety?'",
        "'speaker_3': 'We have people driving up on the side under crosswalks and sidewalks all the time. We're not building concrete barriers at the car, at the at those intersections where people are driving under the sidewalks. So I think, you know, it's our engineers say.'",
        "'speaker_3': 'The question shouldn't be how can we go even further? The question should be, ah, is it safe enough? And for me, that's the that is the analysis I'll be looking for.'",
        "'speaker_0': 'Okay. Well, we'll look forward to deciding coming back to us. Thank you so much, Mr. Thomas and Mr. Vance, as always. Okay. Thank you. Okay. And moving down the alphabet, we go next to item five H. Madam Kirk, would you introduce that one for us and why you're introducing it, city manager or whomever?'",
        "'speaker_0': 'Would you please bring the annex team in on this? These are the CFOs, right? Okay. Go ahead. Or will we? I don't think Mr. Thomas and Mr. Vance, are they.'",
        "'speaker_2': 'Yeah, we're both bringing the people here. Talk it out.'",
        "'speaker_0': 'Yeah, we can. Public works director. We can ship everybody away.'"
    ],
    "Adoption of Resolution Declaring Intention to Establish the City of Alameda Community Facilities District (CFD) No. 22-1 (Alameda Marina), and to Authorize the Levy of Special Taxes Therein; and \nAdoption of Resolution Declaring Intention to Incur Bonded Indebtedness of the Proposed City of Alameda Community Facilities District No. 22-1 (Alameda Marina). (Public Works 80700001)": [
        "'speaker_2': 'Yeah. Five Each has adopted a resolution declaring intention to establish the city of Alameda Community Facility, District number 22, dash one Alameda Marina and authorize levy of special taxes there in an adoption of resolution declaring it.'",
        "'speaker_0': 'You know what that is? You guys just.'",
        "'speaker_2': 'Read the whole thing on mute. I am so sorry, I.'",
        "'speaker_0': 'You didn't read the whole thing on mute. You got to declaring.'",
        "'speaker_2': 'Oh, yeah. Declaring intention to incur bonded indebtedness of the proposed development community facility. District number 22, dash one.'",
        "'speaker_0': 'And at least Laura has a secret code, has a side job as an auctioneer, as you can tell from the speed with which she's able to get those out. I can't talk that far that fast. Thank you. And with us, we have our public works director, Aaron Smith.'",
        "'speaker_0': 'Welcome. And do you want to. Well, we could do this one or two ways, counselor. Harry Spencer, you pulled this item. Was it to hear an explanation? Did you have comments or questions? I have questions. All right. So why don't we start with your questions and we'll see if we can keep moving through our consent calendar and'",
        "'speaker_0': 'get to our rather lengthy, regular agenda. Blogs are also joined by Liz Acord. Hello, welcome. And oh my goodness, the Gainesville here bus. Well, so just like that they appear and director Smith you want to just introduce the team who's accompanying your.'",
        "'speaker_2': 'Certainly. Ken, Jerry, that okay with you?'",
        "'speaker_1': 'Go ahead.'",
        "'speaker_0': 'Oh, I'm sorry.'",
        "'speaker_1': 'Totally fine.'",
        "'speaker_0': 'It's Women's History Month, so I'm kind of.'",
        "'speaker_2': 'Okay. Good evening, Madam Mayor. Vice Mayor, members of council. I am Aaron Smith, public works director here with me this evening for this item is called to make our Urban Council. Sarah Mares Our special tax consultant, Michael Bush, our municipal advisor, Liz Acord, our public works coordinator.'",
        "'speaker_2': 'We also have from Al Main Arena Sean Murphy. Sean, I'm going to let you introduce Little Charles as your attorney. Charles Olson. Also here with us is Elizabeth Mackenzie from our attorney's office. And I believe that's all the squares since I think I did it.'",
        "'speaker_2': 'Yeah, okay.'",
        "'speaker_0': 'We ran out of squares with all this stuff in there. So, you know, though, for the benefit of the public, who's watching? Could one of you, any one of you on the screen and that includes your assistant city manager, Jerry Bowden.'",
        "'speaker_0': 'Just give us an overview of what's with this item, both this item and the the next one. But well, let's stick to one. What's this item about?'",
        "'speaker_1': 'Sure. Thank you. Thank you. Mayor. Vice Mayor, members of the City Council. Jerry Bowden, assistant city manager. This is a community facility, community facilities district discussion. This is part of the Alameda Marina project. This is a special financing mechanism that's been used several times in the city of Alameda.'",
        "'speaker_1': 'This particular master plan for the area anticipated significant infrastructure costs. The the community facilities district that is before you this evening and tonight is really just moving forward with resolutions of intention for this item and the following item, which is really an opportunity for the public to see what we're up to for the first time in a'",
        "'speaker_1': 'public setting. And essentially the districts themselves are designed to finance a seawall as well as as well as some some road improvements out on Clement Avenue. And that is obvious that so far from the total infrastructure investment that's going into this area, but that's the those are the items that we put into this district, which will essentially'",
        "'speaker_1': 'help to to finance those those infrastructure improvements that will have community wide benefits in a lot of ways, but that are associated with the project. So there's a seawall that goes along the outer edge of the project. And then if you've been along Clement Avenue in recent months, you've seen all of the improvements that have gone in'",
        "'speaker_1': 'out there as well. So, you know, we can certainly there's a there's a large team. This this is a process that's somewhat unique. It's not something that we do every day. But several of the people on the screen have done this work with the city in prior examples.'",
        "'speaker_1': 'And so we're happy to answer any questions that you may have about this action and the process going forward from here.'",
        "'speaker_0': 'Thank you, Mr. Burton. Okay, let's go to Councilmember Harry Spencer pulled this item. Councilmember, the floor is yours. Thank you. Mayor and I had shared my questions with the city manager in advance, and I'm not sure he was able to get clarification.'",
        "'speaker_0': 'But there is a sample tax bill that is attached to the item. And if it's possible to and I'm sorry to ask that the clerk not that'd be nice if you could show that because I'll be referencing that.'",
        "'speaker_0': 'But that tax bill as, as you're working on that, it references town home sample tax bill and it shows the CFP on an annual basis of being an additional 5500 up to almost $8,000 per year, so that the annual property taxes and special taxes for these properties that it says it starts at 1600 square feet and at'",
        "'speaker_0': 'a price base price of just over $1,000,000 would end up being from 20 to $26000 per year for these taxes. And my question is that I know that this project included some condominiums, and I didn't see a tax bill for those units.'",
        "'speaker_0': 'And I don't know if when that shows a town home of 1680 square feet. Is that the condominium or what is the price points we're anticipating of what the additional taxes would be for condominiums, for the CFD. He'd like to take that.'",
        "'speaker_2': 'I will.'",
        "'speaker_1': 'That was.'",
        "'speaker_2': 'A hello.'",
        "'speaker_1': 'There.'",
        "'speaker_2': 'Amazon. The screen change just as I said that.'",
        "'speaker_0': 'Well, and just introduce yourself when you do, because it's I don't recognize voices readily. So. Yes, Miss Maris, please.'",
        "'speaker_2': 'Hi. Good evening, Mayor. Vice Mayor, members of the council. My name is Sarah Myers with NBS. I'm acting in the capacity as the special tax consultant for this project and I prepared this sample tax bill. So within this particular project, only the first phase of the development is included, and that includes only the townhomes that are being'",
        "'speaker_2': 'developed. So it is the townhome product that is in this district by itself. The size ranges you see and the lowest base prices for those units are representative of the product that is being developed. And then you can see the additional information that shows the general property taxes, the other items that are on the tax bill, other'",
        "'speaker_2': 'special assessments or taxes or charges, and then specifically this particular CFD special tax to come up to the total amount of the property taxes, special charges and CFD charges that would go on these parcels to result in the overall effective tax rate of 1.9% across the board.'",
        "'speaker_0': 'Thank you, Mr. Mary. That was helpful. Councilmember Spencer, you still on the floor? Okay. Thank you. And I appreciate that clarification. So I just want to confirm then when the can whatever phase the condos are in that this will not have any relevance to that.'",
        "'speaker_0': 'Or if they do a CFD, then we will not be these numbers will not apply at all.'",
        "'speaker_2': 'The Community facilities district number 20 2-1 for Alameda marina that has the facility's funding is not applicable at this time to any property other than those townhomes. There are if you look at the boundary map associated with this item, the other phases of this project are in the what's called future annexation area.'",
        "'speaker_2': 'And so there is potential that they could be annexed in the future to this CFD, but they're not in the boundary at this time and those proceedings would come before you at a later date if there is a desire to annex that property to the CFD.'",
        "'speaker_0': 'To, too. Yes. All right. So then is that staff's position that that is unlikely of occurring or that's actually probable?'",
        "'speaker_1': 'I'll I'll take that one, if that's all right with you.'",
        "'speaker_0': 'Mr. BURTON.'",
        "'speaker_1': 'So, Councilmember Herr Spencer, it is entirely possible. There's there's a there's a significant amount of infrastructure going into this area. And the idea of increasing bond capacity over time is something I think that that is is probable, but not it's not readily available at this time or not a decision that the developer can make at this time'",
        "'speaker_1': ', because those projects just aren't before us to be constructed at this point in time. So when they when they are ready to come online, there's that possibility. If we're still looking for ways to finance infrastructure at that point in time.'",
        "'speaker_0': 'You know, with the anticipated square footage of those units would be.'",
        "'speaker_1': 'I don't I'd have to look to the development team to see if they have any estimates on the condominium projects.'",
        "'speaker_0': 'Development team, any, any. And we don't want you to guess, obviously, but if.'",
        "'speaker_1': 'Yes. Sorry. Hi.'",
        "'speaker_0': 'Hi, Mr. Murphy from Alameda Marina. Did you want to. You want to.'",
        "'speaker_2': 'Offer.'",
        "'speaker_1': 'Me to answer so. Good evening, Madam Mayor. Council members. Thank you for hearing this consent item. It's important item for our project and for, frankly, the seawall, which is critical infrastructure. So the answer, councilman, or of question, the future condominiums will likely have a average size of between 700 to 1100 square feet.'",
        "'speaker_0': 'Spencer, you have a first if you want. Thank you. Thank you. And that's good to know, because that's significantly less than the 1680. So that if, in fact, a staff comes back at some point to recommend that this S.F. that those condos be annexed into the CFD, then could I anticipate that it would be a percentage of'",
        "'speaker_0': 'based on the square footage? Because I'm trying to find out. I'm hoping that those condos will be somewhat priced favorably so that people in the middle will be able to try to buy them. And my concern will be that all these additional charges will price them out of the market and actually defeat the purpose.'",
        "'speaker_2': 'If those parcels are annexed in the future, we would do a similar analysis to that sample tax bill that you see to determine what the effective tax rate is. And these special tax rates would be set accordingly.'",
        "'speaker_0': 'Thank you. That completes my questions. Okay. Questions, comments or a motion from other council members. And thank you all for being here, all of you experts. Councilor Daisuke, I think I saw your hand go up.'",
        "'speaker_1': 'Yeah, yeah. Just a quick comment. I'll be voting no on this, because I do believe for the same reason that a recent and nearby project, I just think there ought to be more affordable housing. So I appreciate that that I think 60% of the overall project is affordable.'",
        "'speaker_1': 'But the reality is our local rules require 15% off the off the bat. And I think, you know, the density bonus that was obtained by this, you know, they're getting a bonus on the number of additional units that they can build for doing something that they were required to do anyways.'",
        "'speaker_1': 'Usually when you get a bonus, it's because you did something above and beyond. And so I think the 16% is just it's not above and beyond. So that's why I'll not be voting for this. Thank you.'",
        "'speaker_0': 'Thank you. Conservation Council member Spencer. I'd just like to clarify. How many townhomes are there in this complex or this development total?'",
        "'speaker_1': 'You have that information? Mr. MURPHY. Yes. There is 182 townhomes within the development. 25 of those 182 are affordable and therefore exempt from the CFD.'",
        "'speaker_0': 'In the rest of the units, because isn't this whole complex like 760 units?'",
        "'speaker_1': 'That's correct.'",
        "'speaker_0': 'So what's the rest of the units then?'",
        "'speaker_1': 'That is a combination of apartments and condominiums of higher density, basically medium density project.'",
        "'speaker_0': 'Okay. And then the apartment happens to the apartments in regards to paying their share of CFD.'",
        "'speaker_1': 'So there is a significant infrastructure cost across the the various parcels, the apartments. There are a cost of about $12 million for total infrastructure costs that are outside of the CFD. And so it just it's significant there's significant infrastructure cost for this project in comparison to its land area.'",
        "'speaker_0': 'But do they pay me to continue their. Yes. Yes. Yes. But do they pay a CFD then for those units over time, or do they just pay the 12 million and then they're done because it's in the CFD over time, like it's 30 years or something.'",
        "'speaker_1': 'There's a CFD. 20 2-2. But I turn that over to Sara or Jerry to to speak about.'",
        "'speaker_0': 'Well, we're not going to speak about it now because we're on this particular item, but we will get to it next because it was also full of guilt. So every your question is what again, are you going to what do you think we're going to be hearing about that?'",
        "'speaker_0': 'So I'll go ahead and I'll move the item. Okay. So you move adoption of this resolution. I think you do have a Second Vatican Council councilmember, John. That's why it's seconds. All right. Any further discussion seeing then maybe have a roll call vote, please.'",
        "'speaker_2': 'And that was a doctrine of both resolutions, correct?'",
        "'speaker_0': 'No, it's not just one.'",
        "'speaker_2': 'There's two resolutions. Oh, yes. Yes.'",
        "'speaker_0': 'We're within the right item. 1783.'",
        "'speaker_2': 'It has two resolutions within its, I don't think exactly. Councilmember de SAG.'",
        "'speaker_1': 'No.'",
        "'speaker_2': 'Sir. Spencer Knox. Right. I know the mayor as the Ashcraft I. That carries 4 to 1.'",
        "'speaker_0': 'All right. Thank you, everybody who was on the screen. But don't go anywhere because we're going to close this item and we are going to move on to item five I. And Madam Clerk, if you would, introduce that item for us, please.'"
    ],
    "Adoption of Resolution Declaring Intention to Establish the City of Alameda Communities Facilities District (CFD) No. 22-2 (Alameda Marina - Shoreline Improvements Maintenance and Adaptive Measures), and to Authorize the Levy of Special Taxes Therein; and \nAdoption of Resolution Declaring Intention to Incur Bonded Indebtedness of the Proposed City of Alameda Community Facilities District No. 22-2 (Alameda Marina - Shoreline Improvements Maintenance and Adaptive Measures). (Public Works 80700001)": [
        "'speaker_2': 'That Senate resolution declaring intention to establish the city of Alameda facilities, district number 22 attached to Alameda Marina, shoreline improvements, maintenance and adaptive measures, and to authorize levy of special taxes there in adoption of resolution declaring intention to incur bonded indebtedness of the proposed city of the account for this District 20 2-2.'",
        "'speaker_0': 'All right. Thank you. And so, Mr. Byrd, Miss Smith, whomever who wants to give us an overview of this item.'",
        "'speaker_1': 'So I'll start. And then we can certainly, certainly use other members of the team to fill in the blanks that that they feel are important. Again, thank you, mayor, vice mayor, members of council. This this is a follow on item to the first community facility district.'",
        "'speaker_1': 'This is really an opportunity to take a proactive approach to potential changes to the the sea of the seawall that's being constructed. So if there are issues with either new requirements or or maintenance that needs to be taken care of, and there are you know, there's an inability for the the responsible parties to take care of it'",
        "'speaker_1': 'or that there's just a significant amount of new additional or new investment that needs to be made. This is an opportunity for for a subsequent community facility district to kick in and create a special kind of a back up tax that would allow us to have reserve or funding in place to to make those improvements in the'",
        "'speaker_1': 'long term. So essentially, once the first community facility district that covers the original costs, those bonds are paid off. There'd be an assessment at that time and these bonds could then start. So that wouldn't be an overlap with the with the first district.'",
        "'speaker_1': 'This would be subsequent to. And it's just an opportunity for us to make sure that this important infrastructure is maintained over time and can be enhanced if necessary. So with that, I'll conclude my presentation. I don't know if Director Smith would like to add.'",
        "'speaker_1': 'I see a hand.'",
        "'speaker_0': 'Yes, please.'",
        "'speaker_1': 'With the mayor.'",
        "'speaker_0': 'Absolutely. The public works effort with please.'",
        "'speaker_2': 'The evening again. Madam Mayor Council. I'm Aaron Smith Public Works Director. Jerry, thanks for that overview and intro. I just wanted to highlight one key point of this second CFD and it's I think maybe one of a first of its kind that's really contemplating revenue needed for potential sea level rise adaptation measures.'",
        "'speaker_2': 'So the seawall is currently built to end of century height based on current projections. So if that falls short, literally and figuratively, the this CFD would allow revenue to be collected to construct the seawall and shoreline improvements to a higher level for additional protection.'",
        "'speaker_2': 'There are some other nuances to what we're calling the triggering event. So these two CFDs will never be assessed. At the same time, the the bonds, which was the previous item, would be paid off before the second CFD kicks in and then their specific triggering requirements, one being the adaptive measure.'",
        "'speaker_2': 'So I spoke of others being the one Jerry had. So I just wanted to kind of highlight the uniqueness of, of putting in place this CFD for adaptive measures.'",
        "'speaker_0': 'And then thank you for the further explanation because I am very proud of the work that's been done. It's very proactive and forward thinking, and it's been almeida's approach with our climate action and resiliency plan that we have to take this stuff seriously.'",
        "'speaker_0': 'As you all know, we are an island, so that counts over her. Spencer Kim, we'll start with you because you pulled this item for discussion.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Mayor. And I.'",
        "'speaker_0': 'Really appreciate staff's and.'",
        "'speaker_2': 'The star crew's.'",
        "'speaker_0': 'Assistance in trying to figure out what the ask really is. So it sounds like and I please forgive me I don't recall it was the former 120 years. So are we talking that this would kick in at the.'",
        "'speaker_2': 'Earliest of 20.'",
        "'speaker_0': 'Years or what is the timeline? So what did you miss with.'",
        "'speaker_2': 'Its 30 years councilmember? 30 years to pay off the balance of the first CFD.'",
        "'speaker_0': 'Okay. And with so that we're actually talking that we're being asked tonight to make a decision for an issue that may or may not arise in 2052 or sometimes they're about.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_0': 'Is there a reason why this couldn't come back closer to the expiration.'",
        "'speaker_2': 'Of the.'",
        "'speaker_0': 'Former item so that we're not so that we actually are not making decisions for that far.'",
        "'speaker_1': 'Out? Yeah. If if I could answer.'",
        "'speaker_0': 'Mr. Gooden, please explain the rationale for this. Sure.'",
        "'speaker_1': 'That there will be people who will be buying real property as part of this as part of this development. And so the idea is to inform those property owners from from day one. So the disclosure package will include this as a requirement.'",
        "'speaker_1': 'Trying to impose a tax after somebody is already there means we'd be dealing with a lot more property owners and likely less support to do something like this. And so this is an opportunity for us to set this as the, I'll say, pun intended, high watermark or the the goal for this particular project to be able to'",
        "'speaker_1': 'to sustain itself over time.'",
        "'speaker_0': 'May I continue? And I'm just going to add, we're going to limit the number of puns. Just kidding. Go ahead. I think Mr. Bowden, assistant city manager, has more to add.'",
        "'speaker_1': 'Mr.. Back to your.'",
        "'speaker_0': 'Tim was bringing his own counsel. Sure. We always want to hear from the attorneys.'",
        "'speaker_1': 'Mr. Jimmy Loggins wanted to mention that the master plan for this community specifies that we have this district. Also, the quote, trigger event is only if the property owner responsible for these measures does not implement them. So it really is a backstop.'",
        "'speaker_1': 'And I would emphasize also what Mr. Bowden said, that once the you have all the registered voters in there to get a two thirds vote for something like this is very difficult. That's why it's written into the master plan that it be put in upfront, even though it may not take effect, it may never take effect if'",
        "'speaker_1': 'the property owner responsible does what they are required to do under the master lease and the bccdc permit. So it's really a safeguard for the city to be sure that this flood control measure is adequately addressed well into the future.'",
        "'speaker_0': 'Thank you, Mr. Olson, attorney for all made of Merida. Was there anything you wanted to add, sir?'",
        "'speaker_1': 'Charles Olson. I may have an marine. Yes, mayor and council members. Just you just add, as Mr. Tenet indicated, this this was built into the master plan from day one as a as a way to address this issue.'",
        "'speaker_1': 'And it is really very dependent on the future of sea level rise. The project is built to adapt the 42 inches of sea level rise. That should be good until the end of the century, but no one knows.'",
        "'speaker_1': 'And so it is consistent with the master plan approval from 2018.'",
        "'speaker_0': 'Thank you for that clarification. Okay. Back to Councilmember Harry Spencer. Thank you, Mayor. So the prior item was specifically for the townhomes. But does this include townhomes, condos, anything else that could be approved between now and 2050 to automatically.'",
        "'speaker_2': 'Hi, Sara. Mary's with NBC again. Yes. This if you refer to the boundary map that's attached to this item, you'll see that it does include additional area that was indicated to be future annexation area on the previous item.'",
        "'speaker_2': 'That area is included in the boundary of this CFD. So it does include the apartment property, the live work property, the nonresidential property, as well as the townhome project.'",
        "'speaker_0': 'Okay. And my understanding was, though, that the prior item for the condos, it would have to come back to council for a vote. Whereas what I'm hearing now is that for this item, there would be no more. There would not be a future vote.'",
        "'speaker_2': 'That's correct. Those projects are already in the boundary of the CFD.'",
        "'speaker_0': 'And I really appreciate the explanation of because right now, how many people, how many.'",
        "'speaker_2': 'Property owners are there.'",
        "'speaker_0': 'That will be voting to approve.'",
        "'speaker_1': 'This?'",
        "'speaker_2': 'Is it to property owners?'",
        "'speaker_0': 'Mr. Tim McGraw.'",
        "'speaker_1': 'It's still three young girls. Also three is correct.'",
        "'speaker_0': 'And who are those three?'",
        "'speaker_1': 'I'll defer to Paul related to aluminum arena. And the third is the townhome developer.'",
        "'speaker_0': 'Okay. And then in the future, for instance, in 2040, how many property owners would there be and who would they be?'",
        "'speaker_2': 'They would be voting on the idea.'",
        "'speaker_1': 'Nobody votes this. Once we put this in place, it's in place. The people who buy property, owner or rent or whatever, there will be disclosure that this CFD is in place, but there's no future vote and the number of people who may eventually reside here, it's really hard to predict.'",
        "'speaker_1': 'I mean, who would have thought some of the things world events are happening and financial markets are moving? So to predict the future 30 years out, a little tough.'",
        "'speaker_0': 'That doesn't really answer my question, so I'm going to try again if possible. My understanding is we're being asked to approve something tonight because and someone did speak to this one of y'all that in the future has to get the two thirds of the property owners.'",
        "'speaker_0': 'And right now there are three is what that answer was. So in the future, whether it be ten, 20 or 30 years from now, I think we're probably talking because we already were told that there would be about.'",
        "'speaker_2': '790 units or something.'",
        "'speaker_0': 'Like that. We're talking hundreds, I think, but that's what I want to make sure, because that goes to, I think, why we're being asked to approve it tonight as opposed to the 30 years. And I'm going to, if you will, hold on for just a minute.'",
        "'speaker_0': 'Assistant city manager has his hand up and behind you, but the upper screen part of my screen. So, Mr. Bowden, you want to comment?'",
        "'speaker_1': 'Sure. I think that in terms of the when the vote takes place to Councilmember Spencer's point, it is it is much more efficient to do this now and much more straightforward. The more property owners that come into the mix, if we don't take this action now consistent with the master plan, it gets harder to implement over time'",
        "'speaker_1': '. And whether there's you know, whether there's 50 or 100 or 500 property owners in this area today is today is certainly the the most straightforward time for the city to take this kind of this kind of belt Dalton suspenders approach to making sure that that seawall is properly maintained into the future.'",
        "'speaker_1': 'If if we do wait it if we waited ten years from now, the the likelihood of being able to get that two thirds vote necessary for this kind of for the for this kind of a financing mechanism is a lot less likely.'",
        "'speaker_1': 'And so I think Mr. Tim makes a point about it's hard to predict the number of property owners is true. I think what we're trying to do here this evening is is move forward with a master plan contemplated financing mechanism at a time when we have three property owners who are willing to support this effort, understanding that'",
        "'speaker_1': 'it helps protect their their investment, but also ensures that future property owners in the area are also going to be protected as well as other neighborhoods in the city of Alameda.'",
        "'speaker_0': 'Thank you, Mr. Brady. And now we'll go back to Mr. Tim.'",
        "'speaker_1': 'Just a very quick technical point. The city's municipal code provides that if there's less than 12 registered voters residing within the boundaries of the proposed district, the vote is by property owners with one vote for each acre or a portion of an acre.'",
        "'speaker_1': 'So as long as we don't have 12 registered voters under your municipal code, the vote is by property owners on the statutes designed for exactly what we're doing here to put mechanisms in place and then obviously inform property owners that they're there.'",
        "'speaker_1': 'And you've done cities, a number of other ones that have put in place similar measures.'",
        "'speaker_0': 'Thank you, Mr. Chairman. Back to Councilmember Harry Spencer. Thank you, Mayor. And I just want to clarify also that. So the three owners right now are all the developers. They're similar. It's different from a person going out and buying a house and becoming that owner.'",
        "'speaker_0': 'But in regards to the amount of money anticipated that what this would be, because we saw that the for the next 30 years, the prior vote that I did support would add an additional the CFD was, I believe, 5500 up to like 9000 per year for the 30 years.'",
        "'speaker_0': 'What is the dollar? And there was no tax bill attached to this as an example. So do we have any idea what we are committing to in the future of what the cost would be to the people then that are, you know, the hundreds of people then that are owning.'",
        "'speaker_2': 'The properties on an.'",
        "'speaker_0': 'Annual basis. This mayors, I wonder, is that where you'd like to to address?'",
        "'speaker_2': 'Yes, please. Thank you. So anything you know, to puzzle your point about not being able to predict the future, it's very difficult right now to predict what the values of those homes would be in 30, 40 years from now.'",
        "'speaker_2': 'And the effective tax rate is based on the value of the home. So for that reason, it is difficult to predict what those might be. However, the CFD is established, this particular CFD for the trust to is established at rates that start lower than the rates that you saw for CFD 20 2-1 for the facilities.'",
        "'speaker_2': 'So they are starting at lower rates in fiscal year 2223 and the special tax rates are going to increase by 2% on an annual basis. So when property owners are paying into CFD 20 2-1 for those facilities, they will have a special tax as shown in that rate method of apportionment and those rates increase by 2% a'",
        "'speaker_2': 'year. When we get to the point, if we get to the point that CFD 20 2-2 kicks in, they will be paying less than they were paying before when the bonds for the first CFD were outstanding. So. By that measure, I think that we're we're looking at a lower effective tax rate eventually, if this CFD were to'",
        "'speaker_2': 'kick in because the base rates are lower than they are for the facilities, CFD and they both increase at the same percentage rate on an annual basis.'",
        "'speaker_0': 'Thank you, sir. Harry Spencer. Any further? Thank you. Yes, but those numbers could change. Even though you're saying that that's currently what you're anticipating in the future, if, in fact, the cost of maintaining the sea wall or not is there not somehow it's open so that whatever the costs are would then be passed down to the homeowners'",
        "'speaker_2': '? No, it's not. Open in the dollar amount that is established in the written method of apportionment is a maximum special tax, and the most that it can increase by on an annual basis is 2%.'",
        "'speaker_0': 'And that applies to the one that we're talking about this 22 days to.'",
        "'speaker_2': 'It applies to both of the CFD is actually. Yes.'",
        "'speaker_0': 'Okay. And what is the start, the starting rate then in 2052?'",
        "'speaker_2': 'Uh, 1/2. I have to look that up.'",
        "'speaker_0': 'I will just add that it's pretty exciting to see this project take shape and I really like the cycle track that runs along Clements in front of it and and I appreciate the weekly updates I get on the construction and.'",
        "'speaker_0': 'I'm very excited to see this taking shape. And I'm happy to continue. Yeah. Well. Ms. Mares is, is then scrolling through your data, but just shout it whenever you're ready. Did any other council members want to comment? That's why that's your immediate.'",
        "'speaker_3': 'I guess, asking a quick question. My understanding is tonight we are just setting in motion a process that does not commit us to actually all it does is set a set in motion on a process that sets up the election that we can certify later.'",
        "'speaker_3': 'But we could actually decide at that time not to call the election ahead of that. Is that correct?'",
        "'speaker_1': 'It is.'",
        "'speaker_0': 'Mr. Burton.'",
        "'speaker_1': 'I was going to say that is correct. This is this is just the initial step, and there would have to be an election. The challenge is that this is a financing mechanism that was contemplated in the in the master plan.'",
        "'speaker_1': 'And so I'll stop there. I think that you all know where I'm going next.'",
        "'speaker_0': 'So we go to the lawyers. Yes.'",
        "'speaker_3': 'I understand. So I guess my my my comment and maybe request is, since we have at least three weeks before that's back before, you know, I personally I appreciated the opportunity to meet with everybody on the screen and ask my questions.'",
        "'speaker_3': 'So that's why I don't have any questions there. I'm wondering if maybe we could move forward with a vote and if there are further deep dove questions that can be answered. And we have three weeks until the next meeting and we have the opportunity not to move forward at that point in time if if the questions are'",
        "'speaker_3': 'unsatisfactory.'",
        "'speaker_0': 'And thank you for bringing that up. And because I also want to thank all of you on the screen who met with me. I'm sure you spent a solid hour going over these details. And I did ask lots of questions.'",
        "'speaker_0': 'I think I would like to see this continue to move forward. And I wonder if there is a way and we certainly want council members questions to be answered, but I wonder if there's a way to do some of that off line council day.'",
        "'speaker_0': 'So I see your hand up.'",
        "'speaker_1': 'Thank you. You know, I think we all here in Alameda know that our city, unlike any other city in the Bay Area, let alone California, is affected by sea level rise. And it's really simple. We either rise to the challenge of sea level rise or we sink.'",
        "'speaker_1': 'I think what's before us is quite innovative. While I certainly have my qualms with regard to the amount of affordable housing. I think that the financing mechanism contemplated for the future and there will be an increase in sea level rise.'",
        "'speaker_1': 'So that's without a doubt and I think it was just about ten days ago, I think the federal government issued a new saying that they're eight inches off. So if you're saying 42 inches a sea level rise at end of century, well, it's now 50.'",
        "'speaker_1': 'So so I think the mechanism that's before us, I think, really warrants any of us to step up and say, you know, we've got to support this. I might have my qualms with the housing project, but I think that's what what this is.'",
        "'speaker_1': 'Financing is important for all of Alameda and hopefully other projects along the waterfront do something is similar.'",
        "'speaker_0': 'Thank you for your comments. Councilmember Desai and I agree completely with you. And also, as was noted, it doesn't just affect this development, it would affect other properties in the vicinity. So we're protecting a lot of folks and properties and council redesign that have been in motion.'",
        "'speaker_1': 'Should be happening. I would be happy to move. Staff recommendation.'",
        "'speaker_0': 'Okay. And Councilor, we're not a second. Okay. We have a motion in a second. And Ms.. Mayors, you have your hand up. And I know you were doing some research, so please go ahead. Councilmember That's what you did.'",
        "'speaker_3': 'My and I just want with the direction that that staff connect with Councilmember Spencer to get her get any further questions that she has answered before the next meeting.'",
        "'speaker_0': 'Thank you for that. And Ms.. Mayors, let's go back to you.'",
        "'speaker_2': 'Thank you. I just I have that data that was requested. And so I'm just looking at one of the property types rather than going down the entire list. But just taking a look at the townhome property that is less than 1680 square feet.'",
        "'speaker_2': 'So that's just kind of the base unit that we're looking at in the CFD 20 2-1. That property in 2223 has a rate of $5,498 escalated to 2050 354. That special tax rate ends up being $9,958.87. And then we move over to the CFD 20 2-2, which is the maintenance CFD or the adaptive measure CFD.'",
        "'speaker_2': 'And that starts out with a with a special tax rate of $2,289 in 2223. And in the same time period that 2050 354, that rate would be 4000 147. So again, just comparing that to what they would have been paying in the other CFD, it would have been almost $10,000.'",
        "'speaker_0': 'Thank you. Yes, Councilman Harry Spencer. Thank you, Mayor. And is this one also 30 years.'",
        "'speaker_1': 'Or so ago through.'",
        "'speaker_2': 'Is the the CFD is actually levied in perpetuity. It does not have a 30 year term. It doesn't. There is no expiration on this. It's as needed to fund the special tax requirement.'",
        "'speaker_0': 'So if anyone wanted to end it, then what would they need to do?'",
        "'speaker_2': 'If a citizen at the years down the road wanted to end the special tax, they could petition the city to end the special tax.'",
        "'speaker_0': 'But then is the majority of council. Then that would determine in the future in perpetuity at some point whether or not they wanted to end the tax.'",
        "'speaker_2': 'Sorry. Could you say that again?'",
        "'speaker_0': 'So then it's the council. The majority of council in perpetuity. It doesn't. The the voters, the homeowners could not put something on the ballot. They have to try to convince three council members. Mr. TIMBERG, you're nodding your head as you want to say something.'",
        "'speaker_1': 'That is correct. That is correct. They can petition the council to terminate the CFD, but they don't have the right to just bring it to a vote. This is under your ordinance that governs this type of district.'",
        "'speaker_0': 'So I just want clarification in perpetuity. And at some point council.'",
        "'speaker_2': 'Could also increase.'",
        "'speaker_0': 'The amount or not.'",
        "'speaker_1': 'No, they cannot increase it without a vote. But to terminate it would require a council vote at any time. Three council members could terminate that CFD. The reason why it's in perpetuity is because the maintenance of the wall is not going to stop in any given year.'",
        "'speaker_1': 'Again, this is a fallback in case the property owner isn't doing the maintenance. This tax may never get levied, but if it if we need it and the property owners are not maintaining the seawall and there is an adequate protection, this CFP can continue to levy what is required each year up to the tax rates to maintain'",
        "'speaker_1': 'the flood protection.'",
        "'speaker_0': 'And you I believe Erin Smith had her hand up. What did you want to add, Ms.. Smith?'",
        "'speaker_2': 'Just to follow on, I think Paul was touching on it there. Each year it's determined whether that maximum assessment amount needs to even be levied. So it could be levied and then determined no longer needed. But the amount levied is only that which is needed for the maintenance and or adaptive measures.'",
        "'speaker_0': 'Hey. Thank you so much. We have a motion and we have a second and it's almost 9:00 and we're still on consent calendar. So how quick would you call the roll, please, for this vote?'",
        "'speaker_2': 'Councilmember de Shag.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'For Spencer. No.'",
        "'speaker_1': 'Actually, I Vela.'",
        "'speaker_2': 'I Mayor.'",
        "'speaker_0': 'As Ashcraft, I.'",
        "'speaker_2': 'That carries 4 to 1.'",
        "'speaker_0': 'All right. Thank you so much to our staff and to our outside experts, all of you working on this. We appreciate and I'm always fascinated to talk to you about this project. And I really do commend you for the forward thinking approach to an existential reality that we all face here in Alameda.'",
        "'speaker_0': 'So I think you're leading the way that other cities will follow. So thank you so much for your time. All right, counsel, I do believe we've come to the end of the consent calendar. Yay! So then we move on to our continued agenda items.'",
        "'speaker_0': 'And, Madam Clerk, if you would, please. I'm sorry. I'm so sorry.'",
        "'speaker_3': 'That's okay. I just. Given that it's given. It's 9:00, we're just about to start the things we didn't get to last meeting. Before we get to the regular agenda, I'm wondering, I know there's interest in seven C in the city.'",
        "'speaker_3': 'Staff for seven C and seven D are the same. I'm wondering if we might move 7e2 to the continued items as well that our planning, land use and transportation folks who needed to be here for this last item, one of the last items, you don't have to sit around and wait till 11:00 to find out.'",
        "'speaker_3': 'We're not going to get there. I, I, I'm not I don't think I'm pessimistic here.'",
        "'speaker_0': 'No, I think you're great. And I think let's do a quick vote so we don't get too much further. So I think.'",
        "'speaker_3': 'I move that we move item seven E to the continued items at our next meeting.'",
        "'speaker_0': 'And just thank you, Vice Mayor, just for the sake of clarity, madam, quickly you tell us what that item is.'",
        "'speaker_2': 'Seven E Yes, seven E is the Alameda Loop shuttle basically item.'",
        "'speaker_0': 'Thank you. So just before we vote, anybody who's in the audience waiting to hear that one or the transportation plan which we already had moved to the next item. When we come back before you on April 5th, I believe it is, those two items will be up at the top.'",
        "'speaker_0': 'It will I should not count chickens before they hatch. Let's take a vote and then I'll tell you whether those items will end up at the top of the next agenda. Councilmember Jane, a quick comment.'",
        "'speaker_1': 'Quick comment is, you know, we have a process in place for removing items. And and I think we should stick to that process. I believe we remove items at a certain point.'",
        "'speaker_0': 'So thank you for your comments. We have a motion. We have a second way. We have a roll call vote.'",
        "'speaker_2': 'Please remember they said no. Her Harris Spencer.'",
        "'speaker_1': 'I. Knox Phi Phi Phi Alpha.'",
        "'speaker_2': 'I may as the Ashcroft lie. That motion carries four, two, one.'",
        "'speaker_0': 'Thank you. Okay. So now we go back to the the regular agenda. And now, Kirk, if you would, please introduce our first item.'"
    ],
    "Introduction of Ordinance Authorizing the City Manager or Designee to Execute a First Amendment to the Lease with Park Street Wine Cellars, Inc., a California Corporation, for Approximately 700 Square Feet of Retail Space in the Historic Alameda Theatre Located at 2315 Central Avenue, Suite 122, to Provide Six Months of Rent Deferral with a Three-Year Repayment Period.  (Community Development 24061810) [Continued from March 1, 2022]": [
        "'speaker_2': 'Six days introduction of ordinance authorizing the city manager or designee to execute a First Amendment to the lease with Park Street Wine Cellars, Inc, a California corporation for approximately 700 square feet of retail space in historic Alameda Theater, located at 2315 Central Avenue, Suite 122, to provide six months of rent deferral with a three year repayment period'",
        "'speaker_2': 'rate.'",
        "'speaker_0': 'And so I have on screen joining us is our community development director, Lisa maxwell. And who is presenting decided tonight is this Maxwell? Are you married, Miss Maxwell?'",
        "'speaker_1': 'Oh, sorry.'",
        "'speaker_2': 'Miss McIntyre. Or is it?'",
        "'speaker_1': 'Masquerade, I think.'",
        "'speaker_0': 'I don't see it, but I do see Miss Curtis. Miss Curtis. All right, Miss College, if I.'",
        "'speaker_2': 'Had some Internet issues that evening, they're asking city council members. My name is Lorie Curtis. I'm a management analyst with the Community Development Department. The item my happiest evening as city clerk mentioned for us is an amendment to the lease with Park Street wine cellars.'",
        "'speaker_2': 'This tenant is a wine retailer occupying 700 square feet of retail space in the Alameda Theater complex. The business owner, Christopher Masi, is a certified familiar with more than 35 years of experience in the fine wine trade. Patrick Wine Cellars has been a city tenant since October 2019.'",
        "'speaker_2': 'They have a 66 month lease terminating in April 2025, with one five year extension option. In October 2020. Council approved 315,000 rent and rent relief for the Alameda Theater and as well as the nine three rent deferral program for Alameda Point.'",
        "'speaker_2': 'Commercial tenants, which you may recall is provided nine months of rent deferral with a three year repayment program. Park Street Wine Cellar was paying rent through July 2021, at which point they reached out to let us know that they needed some assistance.'",
        "'speaker_2': 'Tonight, staff is recommending six months of referral deferral, which is a total of $17,088 and the three year repayment schedule. Our terms are similar with the nine three program and that the well, we're hoping to provide them the opportunity to earn one month of rent credit for every year before the end of the repayment payment period that'",
        "'speaker_2': 'may repay the full deferred sum with a possible maximum three month rent credit. The difference, of course, is that we're asking for three or six months of rent deferral for Park Street wine cellar, as opposed to the nine months that was provided by the Alameda Point tenants.'",
        "'speaker_2': 'Thank you so much for your time and consideration tonight.'",
        "'speaker_0': 'Thank you, Mr. Caruso. I see we're also joined by from our city attorney's office, Lynn Asllani, and welcome. So a council clerk, I should ask, do we have public speakers on this item?'",
        "'speaker_1': 'We do not.'",
        "'speaker_0': 'So close public comment on this item. I am going to make a pitch for approving the staff's recommendation. I can just imagine what it was like to be a small business owner, to open a business in October 2019 when we hadn't even heard the word COVID 19.'",
        "'speaker_0': 'I mean, it was just, you know, timing unfortunate. I think they really struggled to do a good job. And I think they've been very diligent about struggling to pay their rent, that it hasn't been easy because they were also subject to mandates to close their businesses at times.'",
        "'speaker_0': 'So what I would just love is without a lot of fanfare, emotion and a second in a vote to approve this motion. But what's your pleasure, Councilman? That's why.'",
        "'speaker_1': 'I moved.'",
        "'speaker_0': 'To have a second. Vice Mayor Villa.'",
        "'speaker_2': 'Second.'",
        "'speaker_0': 'Any further digression? I got the advice for 2 seconds. Councilor Harry Spencer. I'd like to be able to discuss the item. That's why I'm calling on you. Thank you. So I'd like to know the date that they actually took possession and then what payments they've actually made since taking possession and if those payments were made on time'",
        "'speaker_2': '. Thank you for your question. So they took possession October 2019 and they were able to make payments through July 2019 through 2021. So they began they were unable to make payments in August of 2021 through the end of our proposed deferral period, which is January 2022, the six month.'",
        "'speaker_2': 'And then again they regained payment or started making payment again. February 20, 22.'",
        "'speaker_0': 'It's my understanding that when they first took possession, they were not required to make rent payments, that they were allowed to get some sort of credits for improvements for at least six months.'",
        "'speaker_2': 'You're correct, yes. The initial six months of their tenancy, they were provided by credit or rent credit. This was provided because of the improvements that they made to the building in order to make it a retail space.'",
        "'speaker_0': 'Okay. So then did they make a payment for April 2020? And if so, they do have a schedule. I've asked staff for this information in advance.'",
        "'speaker_2': 'Unfortunately, we didn't receive your question until a little later in the day, so I'm only able to provide the exact rent payment dates starting in July of 2021, but I'm more than happy to provide that information tomorrow.'",
        "'speaker_0': 'But were they current as of July 2021? Had they made every payment that.'",
        "'speaker_2': 'They were expected to.'",
        "'speaker_0': 'Make as of July 20.'",
        "'speaker_2': '21? Yes, I am happy to get that confirmed.'",
        "'speaker_0': 'Tomorrow in writing. I just want to find out exactly how far behind these tenants are in making their payments.'",
        "'speaker_2': 'They were paid in full until the end of July 2021. August 2021 was the first time they were unable to make a payment that they were expected to make.'",
        "'speaker_0': 'Okay. And did they make any payments since August 20, 21?'",
        "'speaker_2': 'Yes. They were able to make their February 2022 payment and we are awaiting them March, as you noted today in your email. We're awaiting their March payment, which is due today.'",
        "'speaker_0': 'Okay. So they didn't make payments for August, September.'",
        "'speaker_1': 'October.'",
        "'speaker_2': 'Yet another proposed deferral amount is six months from August 20, 21 through January 2022. Within that time period, they were unable to make payments.'",
        "'speaker_0': 'But they made the February payment.'",
        "'speaker_2': 'That's correct.'",
        "'speaker_0': 'What date did they make the February payment?'",
        "'speaker_2': 'The February payment was submitted on the 10th of February.'",
        "'speaker_0': 'And is it due that 15 through the first?'",
        "'speaker_2': 'The 15th?'",
        "'speaker_0': 'All right. And so the March payment for that was due today. They have not paid yet.'",
        "'speaker_2': 'As far as I know. At the close of business, I hadn't received confirmation, but I wouldn't be comfortable attesting to the fact that they had made their payment just because of. I don't I don't want to mislead, but I can confirm tomorrow morning that whether that payment had been made or not.'",
        "'speaker_0': 'And is it staff? So staff has had an opportunity to review. I want to back in a minute. There's a personal guarantee on this. And it's not because we're her sponsor. I see that MacLennan has joined us and she's nodding your head.'",
        "'speaker_0': 'So I'm going to ask because she'd like to and and thank you, Ms.. KURTIS, for all those great explanations. I appreciate it. And also, everyone, thank you for the staff report you put together. Very informative as well. Good evening, Ms..'",
        "'speaker_0': 'Mchunu. Are you able to unmute figure that evening?'",
        "'speaker_2': 'Mayor and staff, staff, mayor and city council members and I just Laurie, Mr. Curtis is the expert on this. So, I mean, I was nodding to confirm that, yes, there is a guarantor, it is the owner of the business, and he provided that the guarantor as part of the lease.'",
        "'speaker_0': 'Thank you, Miss McCann. I try to read body language and sometimes I miss it, but sometimes they get it wrong. Councilmember Harry Spencer, back to you. So was this tenant eligible for any cheap loans or any sort of grants related to COVID?'",
        "'speaker_0': 'And did they apply or receive any money?'",
        "'speaker_2': 'Looks like many of the tenants that we're seeing now, they were able to successfully run and pay their rent or run their business and pay their rent through much of the process. It was only until the end of July or August of 2021 that they actually were unable to make that commitment.'",
        "'speaker_2': 'At which time, I'm not sure that those kind of opportunities were available, but perhaps I can defer to an expert on such matters.'",
        "'speaker_0': 'Did I recall? Did they maybe receive a local grant or am I getting them confused? Mr. MCCONNELL. Do you know about that or Miss Mexico?'",
        "'speaker_2': 'I do not know if they received a local grant, but as Ms.. Curtis said, that they have. We are seeing a phenomenon with our tenants, which is they made it through the COVID. They, you know, got some support from us or from other agencies.'",
        "'speaker_2': 'But as things open up.'",
        "'speaker_0': 'They are not able to continue.'",
        "'speaker_2': 'And we are hoping that won't be the case with with the wine shop. Also, I just want to remind you all, because we will be coming back to you with another tenant in the complex, which is.'",
        "'speaker_1': 'We.'",
        "'speaker_2': 'Originally asked the council to set aside $316,000 for the theater complex. The idea was it would be for the theater and the the other tenants. However, the theater used all the money, so there was not opportunity for the other tenants to seek assistance from us.'",
        "'speaker_2': 'And so now this tenant who was able to make it through is now asking for a little bit of a breather. And they're not asking for abatement. They're asking for a deferral. So I just want to put that as sort of a footnote to the discussion.'",
        "'speaker_0': 'S Councilmember, Herb Spencer. So I haven't had the opportunity to review the tenants financials, personal financials in regards to the guarantee. But if there's a delay in making future payments, then with this, come back to council. Who would like to answer that?'",
        "'speaker_2': 'I would just say that if there's a delay in making peace, if we do an amendment which includes staff recommendation of all of the the programs, the package that we put together for this Tenet, and if the tenet was unable to meet the the requirements of the amendment, we would look to the city manager, the city manager's'",
        "'speaker_2': 'office, to advise on do we immediately come back to the council? Do we allow the tenet, you know, 30 days to catch up? But it's the council's pleasure. If this if the Tenet cannot make meet the requirements of the police amendment, then.'",
        "'speaker_2': 'If you want us to come back to you immediately, we can do that.'",
        "'speaker_0': 'And I would just chime in and add to put some context in all this. I believe the property we're referring to is, what is it, 700 square feet? Yes, I'm saying nodding heads. So I.'",
        "'speaker_1': 'Think.'",
        "'speaker_0': 'You know, we have a long agenda ahead of us. Of course, we all have our 9 minutes to speak, but we also have the option to vote no or vote yes. So anybody else, by the way, wanted to say anything?'",
        "'speaker_0': 'Cast member not wait.'",
        "'speaker_3': 'I just want to recognize an analogy, Mr. Anti and they are the owners of the Berkshire wine cellars. They must fear every time he comes before this council because somehow there is always some questioning of their validity and whatever else.'",
        "'speaker_3': 'And I know that your information has been out there for a months. You've been waiting for a decision. From my standpoint, I think I'm very grateful that your your your store is here and as as your landlord. Obviously, we have to do your due our due diligence in thinking about this.'",
        "'speaker_3': 'But quite honestly, I think the staff has done a really fabulous job of trying to find a way to support a business that has really done a good job of keeping themselves afloat through this. And I just wanted to make sure that at the end of this discussion, at least, there was some sort of positive like.'",
        "'speaker_3': 'Glad you're here. Thank you for for for being a part of the city and much appreciation. And I would like to move if I can remember we happened I think to move approval. The staff recommendation.'",
        "'speaker_0': 'I believe you moved in. The Vice Mayor.'",
        "'speaker_1': 'Oh, great. Okay, so you were there.'",
        "'speaker_0': 'And actually, I just want to tag on to what councilmember that's what I just said, that you're right, we are the landlord and I think we have an opportunity to model the kind of behavior we would like to see of other landlords who are in a position to do something to help their tenants.'",
        "'speaker_0': 'And commercial tenants have been extremely challenged in so many ways. So here's an opportunity. Vice Mayor, did I see your hand go into.'",
        "'speaker_2': 'Yeah. So just this this item was has been waiting to be heard before the council. I know that there's a motion before us that's been seconded. I just would like to move forward with this. I think they're not asking for too much.'",
        "'speaker_2': 'They're asking for a deferral.'",
        "'speaker_0': 'Is that a reason to call the question?'",
        "'speaker_2': 'That is.'",
        "'speaker_0': 'Okay. Madam Kirk, do you want to recommend. Remind us how that process works.'",
        "'speaker_2': 'Yes. So now that there's been a motion to call the question, there will need to be a second and we'll take a vote on that motion. And then if it passes, it will cut off the discussion.'",
        "'speaker_0': 'All right. So do I have a second to the the to the vice mayor's motion to call the question.'",
        "'speaker_3': 'I will second it. I must say, it's just as a request to my colleagues that we help move this forward.'",
        "'speaker_0': 'All right, Danielle, clarify. My understanding is it takes four to pass that motion. Yes. Understood. All right. They we have a roll call vote on the call for the question.'",
        "'speaker_2': 'Please remember.'",
        "'speaker_1': 'Nope.'",
        "'speaker_2': 'Her sponsor. No knock fight. I avella I as the Ashcraft I that motion.'",
        "'speaker_0': 'But that didn't that didn't pass. So Councilmember Harry Spencer, you may continue. Thank you. And I appreciate the opportunity to continue my questions. And I did ask staff in advance. I do want to point out then and it's my understanding that this tenant has not paid rent for the last six months.'",
        "'speaker_0': 'Miss McKenna, you're at your meeting now. May I just have clarification? When did you inquire of staff? Councilmember Spencer. Staff can tell me. We received.'",
        "'speaker_2': 'Our questions.'",
        "'speaker_1': 'Today.'",
        "'speaker_0': 'Okay. So what I do just want to remind you sorry. Before you let you know I'm not lecturing you all about why I am conducting this meeting. Council Member Harris Spencer We have in our council rules and I actually have them on my desk that we avoid disparaging each other or staff.'",
        "'speaker_0': 'And so it is entirely appropriate for us to reach out to staff, to ask questions. But it is not fair to imply that they didn't get back to you in a timely fashion. I'm sorry. I'm not implying that they're doing so.'",
        "'speaker_0': 'I'm not implying that. Thank you for clarifying. They have been acting like I'm sorry. I really don't appreciate you continue to harass me and not our nor my other council mates. I've been trying to ask these questions. I have been speaking with the city manager on an ongoing basis.'",
        "'speaker_0': 'I would like the opportunity to continue asking my questions. You have the opportunity to do exactly that. I just ask of all of my colleagues to please to stay within the bounds of the council rules that we all follow.'",
        "'speaker_0': 'Thank you. And I have been. So please stop correcting me. I would like to continue my questions. I'm happy to let the city manager speak because his hands up. Thank you. Mr. Levitt, please.'",
        "'speaker_1': 'Thank you, Madam Mayor. And Councilmember Spencer, I just wanted to clarify that Councilmember Harry Spencer has asked a series of questions that started before today, but then continued into the day and this afternoon. And so as we provide some information on this item, there have been more questions and some of that information has has created new questions'",
        "'speaker_1': '. So some of the questions were later today, but some of the information has been given a little bit earlier. So it's varied over time. Just so for clarity, for everyone's sake.'",
        "'speaker_0': 'Thank you for that clarification. Okay. Back to Councilmember Harris Spencer. Thank you. And thank you, city manager for accurately representing the development of my questions throughout the process. But I'd like to get back to so it's my understanding that since July then 2021, that this tenant has not paid rent.'",
        "'speaker_2': 'The tenant hasn't.'",
        "'speaker_0': 'Started paying you February.'",
        "'speaker_2': 'Right? Go ahead and answer. That's great. I'm sorry they didn't pay August through January, so they began paying rent again February 2022 this year. So they haven't.'",
        "'speaker_0': 'Okay. So then they've paid one month since and then they didn't pay for the last part six months prior to that. And. And my position is that this is in fact, city property. We know this. We know that we've also approved landlords of residential homes to be able to increase rent.'",
        "'speaker_0': 'And and this is a business and as the mayor has acknowledged, it's actually a small business. And I do have a concern that with the smaller business that they've been struggling, that I'm concerned that they may, in fact, continue to struggle, which goes to I want to make sure that there is, in fact, a personal guarantee that'",
        "'speaker_0': 'and I have had the opportunity to review the information, but that, in fact, would be sufficient to reimburse the city if necessary, if this tenant continues to fall behind. And I do plan.'",
        "'speaker_2': 'To support this, but.'",
        "'speaker_0': 'I do think it's important that we acknowledge that this is, in fact, city property. It's very important for this tenant to get back on schedule. And this is they've had multiple opportunities because, in fact, they received a six month credit early on for ten improvements.'",
        "'speaker_0': 'And and now this is an.'",
        "'speaker_1': 'Additional six months that they're.'",
        "'speaker_0': 'Asking to defer, but it's still going to be could very well be challenging to add this on top of a tenant that has been unable to make the rent, which is a lower amount. Now, this would be a higher amount.'",
        "'speaker_0': 'So I wanted to make that clear, too. So I appreciate the opportunity. Thank you. Thank you. And Ms.. McIntyre, you're in media. Did you want to speak, please?'",
        "'speaker_2': 'Thank you. Councilmember Herrera Spencer, for that analysis. What I just want to just offer is maybe it will make you feel a little bit better, which is the tenant was asking for the same type of program that we offered to our other tenants.'",
        "'speaker_2': 'And we were wanting to get to you earlier so that you could be ahead of the six month approval and so that we wouldn't be having this conversation. But in reality, the tenant is going to be following the same program that we approved for other tenants.'",
        "'speaker_2': 'And and they are going to be on a repayment plan. And it's it's it's just that we couldn't get to you and enough time to offer them some relief and and just get the paper trail to support that relief.'",
        "'speaker_2': 'But I definitely appreciate the fact that you are making a strong statement about being responsible landlords on city owned property, because we we strive to do that.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'All right. So if there there's no further discussion or perhaps there is. Seeing no further hands than me. We have a roll call vote, please.'",
        "'speaker_2': 'And somebody said.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Spencer, I knocked quite high if I may as the.'",
        "'speaker_0': 'Ashcroft by I carries by five eyes. Thank you. That's exactly the outcome I was looking for. It took a little longer to get there, but that's exactly going to thank your staff for all this good information to us.'",
        "'speaker_0': 'Take care. Stay safe. All right. We are moving on. Madam, would you please read our next item?'"
    ],
    "Adoption of Resolution Amending the Fiscal Year 2021-22 Budget; and  Adoption of Resolution Amending the Alameda City Employees Association (ACEA) Salary Schedule to Add the Classification of Street Light Maintenance Technician; Amending the International Brotherhood of Electrical Workers (IBEW) Salary Schedule to Remove the Streetlight Technician; Upgrading Two Maintenance Worker II Positions to Streetlight Technicians, Effective March 12, 2022. (Finance 10024056) [Continued from March 1, 2022]": [
        "'speaker_2': '60 is adoption of resolution amending the fiscal year 2122 budget and adoption of resolution amending the City of Alameda City Employees Association salary schedule to add a classification of streetlight maintenance technician and amending the International Brotherhood of Electric Workers salary schedule to remove the streetlight technician.'",
        "'speaker_2': 'Upgrading to maintenance work positions to streetlight technicians. Effective March 12, 2022.'",
        "'speaker_0': 'Thank you. And then are do we have all the staff we need on screen?'",
        "'speaker_2': 'We're promoting. Jennifer, tell who's going to be giving the presentation.'",
        "'speaker_0': 'Okay, good.'",
        "'speaker_1': 'And Madam Mayor, if I could.'",
        "'speaker_0': 'Say as a city manager. Yes.'",
        "'speaker_1': 'Yeah. So I'll just very briefly introduce I think Ross McCarthy may also get promoted into the into the screen. And so just so you know who those two folks are. Ross McCarthy is our new relative, still relatively new city controller in the finance department.'",
        "'speaker_1': 'And so welcome to Ross and then Jennifer tell you all know as our budget manager and Jennifer will be doing the presentation this evening. So over to you, Jennifer.'",
        "'speaker_0': 'You know, Jennifer Taylor, she has a whiteboard.'",
        "'speaker_2': 'Not today, I hope. Hopefully won't need it tonight.'",
        "'speaker_0': 'And welcome, Mr. McCarthy. All right. And, Mischelle, the floor is yours.'",
        "'speaker_2': 'Good evening, Mayor and council members. Jennifer, tell budget manager in the finance department. I will be discussing the mid-year budget update for fiscal year 2021 to 22. Madam Clerk, are the slides available? They're getting them up now. Okay.'",
        "'speaker_2': 'Next slide, please. And one more slide. Thank you. First, an overview of the topics we'll cover tonight. We will provide an update on current year revenue projections. Go over the mid-year budget requests from departments and review the proposed pension and other post-employment benefit payment per city policy.'",
        "'speaker_2': 'Following this presentation, the city manager and department heads are available to answer questions. Next slide, please. Staff are projecting a net increase in general fund revenues of approximately $6.3 million. This includes increases to property tax and property transfer tax due to change of ownership at higher assessed value.'",
        "'speaker_2': 'We are also seeing that transient occupancy tax or hotel tax is recovering from the pandemic downturn and the transaction and use tax that went into effect in 2019 is to continuing to perform strongly based on online transactions and large construction projects within the city.'",
        "'speaker_2': 'The AMP transfer to the General Fund was under budgeted, so this is a technical correction and recon park is experiencing increased class enrollment following reduced activity during the pandemic. Next slide. We are projecting a net increase in non general fund revenues of approximately $936,000.'",
        "'speaker_2': 'These changes include increased reimbursement or in residual payments from HUD for the home and CDBG programs. Grants from the Office of Traffic Safety and the Alameda County Transportation Commission. Private funds from the Sweeny Park Foundation. And Blue Rise Ventures.'",
        "'speaker_2': 'Under budgeted developer contributions from Catullus for Alameda Landing. And an update to the levy for the recently established Alameda Point Community Facilities District. Next slide, please. Now we will discuss the mid-year expenditure adjustments requested by staff. Next slide.'",
        "'speaker_2': 'The city manager's office is requesting $50,000 from the General Fund for developing a strategic communications plan. Next slide. The Community Development Department is seeking to appropriate the additional HUD and residual payments funding for the home program to increase the under budget professional services accounts in the Fleet Industrial Service Center or FISC Fund.'",
        "'speaker_2': 'And to carry forward the previously unspent budget for transportation demand management and Alameda Point staff is also seeking to increase the part time pay budget for in-house legal counsel in lieu of using contracted legal services for Alameda Point.'",
        "'speaker_2': 'Next slide, please. The fire department is seeking additional one time appropriations from the General Fund for engaging a consultant to conduct a community risk analysis or standards of coverage. Analysis of staffing and deployment. A local march of about $55,000 for an assistance to firefighters grant for procuring portable radios to comply with fire industry standards.'",
        "'speaker_2': 'And replacing the self-contained breathing apparatus, air compressor and fire station to next slide, please. The Information Technology Department is seeking appropriation of $60,000 from the fund balance of its internal service fund for enhancing the city's tools for cybersecurity and forensic monitoring.'",
        "'speaker_2': 'Next slide. The Planning, Building and Transportation Department proposes to reallocate 25% of the personnel charges for four code enforcement staff from the Planning and Building Special Revenue Fund to the General Fund in order for staff to dedicate a portion of their time to enforcing non building ordinance ordinances.'",
        "'speaker_2': 'The staffing costs to the general fund through the remainder of the fiscal year would be approximately $45,000 or approximately $135,000 annually.'",
        "'speaker_1': 'Next slide.'",
        "'speaker_2': 'The Police Department's fleet maintenance cost allocation was under budgeted, so the increase was about $37,000 is a technical correction. The department is also seeking to appropriate the Office of Traffic Safety grant funds discussed earlier.'",
        "'speaker_1': 'Next slide.'",
        "'speaker_2': 'Public Works is seeking one time general fund appropriations for improvements at the fast run animal shelter, barn conversions at City Hall and City Hall West, a citywide facilities security upgrade project and acquisition of a sweeper for protected bike lanes, the Alameda Landing, Alameda Point and Marina Cove community facilities districts would also contribute a portion of the cost'",
        "'speaker_2': 'of the new bike lane sweeper. Public Works is also seeking to upgrade to maintenance worker. Two positions, two streetlight technicians.'",
        "'speaker_1': 'Next line.'",
        "'speaker_2': 'Do you little landfill maintenance was under budgeted in the SA solid waste surcharge fund. So this increase is a technical correction. Staff are seeking one time appropriation of integrated waste funds for engaging a consultant for a zero waste implementation update as well as carry forward of unspent bottling can funds from prior years.'",
        "'speaker_2': 'Staff is requesting a budget increase in the parking and facility maintenance funds for emergency repairs to the Civic Center garage conveyance and a technical correction for the transfer from the Bayport Fund to the General Fund. Next line. Staff requests a one time increase for seaplane lagoon ferry terminal roof maintenance.'",
        "'speaker_2': 'A one time allocation from the Bay Farm Island Dike Assessment District for Northern Shoreline Repairs and an allocation to the Cross Alameda Trail Connector Capital Project from County Grant Private Funds and measures BMB Bike Pedestrian Moneys. Finally, technical corrections are needed for the sewer payment in lieu of taxes and an arbitrage rebate report for the 2012 sewer'",
        "'speaker_2': 'revenue bond. Next slide, please. The Recreation and Parks Department is seeking a one time general fund support for emergency repairs to the stalled storm damaged internal boat launch, Shoreline Park, asphalt repairs, smart irrigation clocks for conserving water and emergency repairs to the Lincoln Park fence.'",
        "'speaker_2': 'As discussed earlier, master class activity is returning to pre-pandemic levels, so additional budget is requested for the increased class activity. The department is also proposing to reallocate 50% of the personal charges for park maintenance for person 44 person from Marina Village to the General Fund to increase Alameda Family Services, Case Management Services at Mastec and to appropriate'",
        "'speaker_2': 'private funds from the Sweeny Park Foundation for a Monarch Butterfly Garden. Next slide. Non-Departmental adjustments include clean up of city debt service transfers with the net savings to the general fund due to shifting the police building debt service payment from the General Fund to the Construction Impact Fee Fund.'",
        "'speaker_2': 'There are increased costs associated with a new letter of credit for the 2003 Alameda Point Revenue Bonds and PA's administration of the OPEB or other post-employment benefits trust fund vacation pay off from employee retirements and resignations was also under budgeted in the OPEB internal service fund.'",
        "'speaker_2': 'Next slide. Per the city's pension and OPEB funding policy, the city commits half of the general fund surplus from the end of the prior fiscal year, assuming the 25% operating reserve target has been met in order to accelerate paydown of unfunded pension and OPEB obligations.'",
        "'speaker_2': 'As of June 2021, this amount is approximately $9.2 million. By policy, 75% of the sample or $6.9 million would be paid to CalPERS, and 25% or $2.3 million would be contributed to a Section 115 Trust for Future Payment of pension expenses.'",
        "'speaker_2': 'The city manager recommends reviewing this budget item further with City Council as part of the mid-cycle or budget year two work session in May. Next slide. In total staff recommend increasing revenue expectations citywide by approximately $7.2 million and increasing expenditure budgets by $4.6 million.'",
        "'speaker_2': 'With the proposed pension OPEB payment of $9.2 million. Citywide expenditure budgets would increase by a total of $13.8 billion this fiscal year. I will now turn it back to assistant city manager Bohdan.'",
        "'speaker_1': 'Thanks. Thanks, Mr. Estelle. Mayor Council and really concludes our presentation this evening. We're open to any questions that you may have and as as budget manager tell mentioned, we, we have department directors available to answer questions about the requests as well.'",
        "'speaker_1': 'And obviously all of us on the screen can jump in to.'",
        "'speaker_0': 'All right. Well, thank you very much. Nice presentation, Estelle. And I'm sure the ABC if you contributed to it. So before we go to any public comment, do we have public comment that I'm quick?'",
        "'speaker_1': 'We do not.'",
        "'speaker_0': 'Well, then we'll close public comment on this item at this time. And Councilmember. And that's when I see your hand.'",
        "'speaker_3': 'Thank you. I just a quick question that popped up during during the presentation, the across Alameda Trail Connector project. What is that? So I realized I didn't catch that when I asked you when we met earlier today. Just short answer.'",
        "'speaker_0': 'It's just I think I see the assistant city manager and meeting. So I'm assuming he wants to take that one. Is that.'",
        "'speaker_1': 'Correct? I actually don't. I. I was going to look into the backup that we have for this doctor for these items. So give me one moment. And Mr. Howell may be doing the exact same thing. So we'll get the we'll get you the answer.'",
        "'speaker_0': 'Hold that hold that thought. And anybody else have a comment or question while we're waiting to hear about the cross our media trail item.'",
        "'speaker_2': 'I'm afraid I don't have further detail on that project, but I'm hoping that perhaps someone from Public Works might be able to elaborate.'",
        "'speaker_0': 'Is watching and can. Well, we'll bring you onscreen. So would that be like it? That Public Works director Aaron Smith has rejoined us. Welcome back. Can you can you enlighten us about this item in the budget?'",
        "'speaker_2': 'Yes, sir. I'm I'm also just double checking with our city engineer. This is the connection at ninth and one street. That makes that section whole in there. So grant dollars. I'm sorry I'm live time getting some additional information from our city engineer, so bear with me.'",
        "'speaker_2': 'So it is the connection at Nathan Wood to connect to Sweeney Park.'",
        "'speaker_0': 'And is that just for the public's clarity and mine? Is that read those two nice mosaic columns. Ah, is that ninth hills where. That's what you know that you.'",
        "'speaker_3': 'Don't think so. I think further up. I remember correctly.'",
        "'speaker_1': 'Okay. Okay.'",
        "'speaker_0': 'Nice and good. Okay.'",
        "'speaker_2': 'I'm getting actually. Amy, are you sure?'",
        "'speaker_0': 'You're welcome to jump able.'",
        "'speaker_2': 'To help and.'",
        "'speaker_3': 'So.'",
        "'speaker_2': 'Happy for me.'",
        "'speaker_0': 'Maybe I'll get right back to you. Also Redux, as.'",
        "'speaker_3': 'You say, while we're. We're waiting for Amy to log it, I'd be happy to make a motion to approve the budget as recommended. Sorry, I didn't mean to get. I was really hoping this was like I.'",
        "'speaker_0': 'I was thinking. I was thinking that I would just convene a full staff. Yeah, because we've got 50% right on screen. Hi, this Walter. It's welcome.'",
        "'speaker_1': 'Hello, Mayor. I can provide a quick answer.'",
        "'speaker_2': 'So we received a grant from Ictsi and it's for for connection points from the cross Alameda Trail through Sweeney to to the south to the neighborhoods at eighth and Wood. And the 1 to 8 is the lovely mosaic columns.'",
        "'speaker_2': 'And then two on the north, one that connects toward triumph, the one that connects toward Challenger. Thanks, Amy.'",
        "'speaker_1': 'I'll just round it out because I finally found what I was looking for. There's other money coming from private and from private sources as well for this for this project. So it's a team effort.'",
        "'speaker_0': 'Yeah. And those are really important connections to and that that project just gets better and better. But I will look forward to not being down that path on my bike. But it is, it's I mean, it's good now, but it's going to be great.'",
        "'speaker_0': 'Okay. I'm sorry. Not sorry. You made a motion, did you?'",
        "'speaker_3': 'I did, yes. I moved. I moved approval. The budget as recommended.'",
        "'speaker_0': 'Okay, I.'",
        "'speaker_1': 'Do. It is right.'",
        "'speaker_0': 'To have a second. Then hold the discussion. Here is second. Okay. And then let's open the floor for discussion. Council member Harriet Spencer. Thank you, Mary. So the item has to resolutions a mid-year budget and a mid-year workforce change.'",
        "'speaker_0': 'And first of all, I want clarification that the motion has actually to approve the two proposed resolutions. Promoted.'",
        "'speaker_1': 'If it is.'",
        "'speaker_0': 'That's your intent. And secondly of the motion, you would concur. You're nodding yes. Yes. All right, then. I'm trying to figure out which one of these motions, and I don't. Maybe it's the first one. Includes the.'",
        "'speaker_2': 'Movement of the 9.'",
        "'speaker_0': 'Million to pay down the. OPEB unfunded pension liabilities. Or is it not included in either of these because it's going to come back later. Assistant city manager.'",
        "'speaker_1': 'But it is included in the. It's included in the first resolution and it's part of the non department pension OPEB discretionary advance pay down. And, and the idea is that we would we would take care of that the policy itself would be something that we would come back to with the, the mid-cycle discussion and the budget workshops'",
        "'speaker_0': '. Which are already scheduled in May. Is that correct, Mr. BURBANK.'",
        "'speaker_1': 'We were talking about this today. I'm not sure that we have the dates yet, but we are scheduled. We are we are planning for budget workshops in May. Okay.'",
        "'speaker_0': 'Well, we won't announce them then at this moment. Go ahead. Bet. You bet. I bet you can. Over here, Spencer. Thank. Thank you. So, assistant city manager. So what language is the language that speaks to the 9,000,000th to pay down the unfunded pension liabilities?'",
        "'speaker_1': 'There's a there's an exhibit attached to the resolution, which includes which includes a non-departmental item towards the bottom of the table on page one of two. It shows the $9.2 million payment.'",
        "'speaker_0': 'Okay. So there's this.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'So I do want to make a comment because when you read the resolution itself, it doesn't speak to the $9 million items specifically. And that is, in fact, the most expensive, I believe, item we're being asked to approve.'",
        "'speaker_0': 'And there is other language that describes other things that are being included or whatnot. But I think that that's a significant ask and I and I would like it to be more specific in the future. I have also asked what is the current amount.'",
        "'speaker_2': 'Of reserves.'",
        "'speaker_0': 'If before this 9 million and after this 9 million, and how much has been paid today.'",
        "'speaker_2': 'From the reserves to.'",
        "'speaker_0': 'Pay down the unfunded pension.'",
        "'speaker_2': 'Liabilities.'",
        "'speaker_1': 'Under this policy? So maybe I'll try and I'll try and answer the question generally. And then I think budget manager tell has a, has a table that's been put together that summarizes the, the set asides that have been made and payments towards our pension and OPEB obligations based on the policy since it was adopted six or seven'",
        "'speaker_1': 'years ago. But really, the way the policy, the intent.'",
        "'speaker_0': 'Of Mr. Burton before you continue. Sorry for the interruption, but we'll. Mr.. Will be able to actually share that table because I don't believe it was in the staff report as the pay down amounts. It is not in.'",
        "'speaker_0': 'Yes. Okay. Perfect. Please continue.'",
        "'speaker_1': 'Though. So I will say that the the intent of the policy is to to be able to set aside funds when there's when there's a surplus of revenue that comes in. So above the set amount, the surplus is set aside and then put towards pension and OPEB.'",
        "'speaker_1': 'So the the intent behind the policy was to take it in the, in the good years when the Reserve has been met for the General Fund, but it was identified by council that additional money would be, would be allocated towards the the ever growing pension and OPEB obligations that the city is facing.'",
        "'speaker_1': 'And so that that is that is how the $9 million was derived. Times the funds that were part of the budget process because of COVID and for a variety of reasons that budget manager tell mentioned when she opened up the presentation.'",
        "'speaker_1': 'Revenues came in strong. Expenses were also kept under, kept, contained. And so there was a significant surplus this past this past year. And so we are in a position to be able to follow the city policy as it exists today and set aside the $9 million towards that pension obligation.'",
        "'speaker_1': 'And and I hope that answers the question. I'll turn it over to budget manager tell to to show the table because I think it's easier to describe it in that way.'",
        "'speaker_0': 'Thank you. I'm sorry. That's the first part of the question. Yeah. And we'll get the the data that you asked for and then it probably maybe will show up in the tables. You're going to show us. But didn't we suspend payment to this this fund during the during the pandemic, I thought.'",
        "'speaker_0': 'Mr. Levitt.'",
        "'speaker_1': 'Correct.'",
        "'speaker_0': 'You were not. I think because there was so much uncertainty right in the beginning, we didn't know what our finances were going to look like. Mr. LEVITT.'",
        "'speaker_1': 'Yes. No, we were very we were conservative in many of our estimates. As as as you well point out, in May and June, when the budget was passed in 2020, No. One and that this budget was passed in May, June 2020 or the previous one was.'",
        "'speaker_1': 'And at that time, no one knew quite what we were facing moving forward. And so we were we were very concerned at that time. That was right during the start of the lockdowns and across the state. And so we weren't sure how long ago and what the impacts would be to multiple businesses.'",
        "'speaker_0': 'Thank you, Mr. Levitt. Okay, Mischelle, on to you.'",
        "'speaker_2': 'I will share my screen to show hopefully this document so that this first table, hopefully is visible, shows the payments that have been made since the policy was adopted in 2017. So as we just discussed, fiscal year 20 1920 is when we opted not to make that that discretionary payment.'",
        "'speaker_2': 'So the amount was lower then. And in this last year, as part of the mid-year process, we contribute about $10 million. So comparable amount to the 9.2 proposed. Now as a result, so year excuse me, not year to date, but since inception of the policy the city has paid to CalPERS or contributed to pension OPEB trust funds'",
        "'speaker_2': '$37.5 million. And I believe was there also question about the sort of the alternative scenario, had we not been the status of reserves, had we not been making the payment?'",
        "'speaker_0': 'Spencer I was looking at. Thank you, Mayor. I'm actually looking at the shared screen right now so I can see people. But my other question goes to what has happened to the reserves during this time?'",
        "'speaker_2': 'Where where were we? Yes. So we so with Comptroller McCarthy today, we put together this table showing and apologies. There's a lot of a lot of numbers here. But this this has been our actual general fund, year end fund balance for each of these fiscal years since 2017.'",
        "'speaker_2': 'And column E shows where we would have been had we not made any pension or OPEB contributions during that time. And so it's it's effectively adding together what would have happened had we not made the contribution with our net annual activity, which is our sort of finance way of saying revenues, less expenditures, and then getting to that'",
        "'speaker_2': 'that ending fund balance for the general fund.'",
        "'speaker_0': 'May I continue? Yes. And just a clarifying question. Does this include finance charges we pay on outstanding debt? Or does that even apply?'",
        "'speaker_1': 'Well, if it's an obligation that is part of the general fund, it would. But if it's another funding source, then it may not be captured in this table. Yes.'",
        "'speaker_0': 'Continue and please continue from her center. Thank you, Mary. So is the current. The the reserves. Because there's not on these reports that we received. There's not a line item.'",
        "'speaker_2': 'That says reserves.'",
        "'speaker_0': 'And when I'm looking at this, I still don't see an item entitled reserves. So is the reserves. This actual general fund ending balance? Fund balance. Are you calling out the reserves or what are the what is the amount of the reserves?'",
        "'speaker_1': 'Yes, that's the reserves. So. Yeah.'",
        "'speaker_0': 'Go ahead, Mr. Bowden. Either way.'",
        "'speaker_2': 'Yeah, I might actually defer to Comptroller McCarthy. This is more of an accounting question than a budget question. You're kidding me.'",
        "'speaker_1': 'Excuse me. Yes, you're correct, Councilmember Spencer. Ah. Ah. Accounting terminology for fund ending balance is reserves. I guess opposite the reserves equals the funding balance. Yes.'",
        "'speaker_0': 'Okay. Thank you. And if the city had spent more during COVID. Then we would have less money spent more on the community during COVID. Then we would not have as much money available now left in reserves or available to sweep from reserves to pay down the pension fund.'",
        "'speaker_0': 'The pension.'",
        "'speaker_1': 'Yeah, correct. I think that the the pension the pension set aside or the funding policy that was created with regard to pensions is really it's a balancing act. The idea is that we're still maintaining a flow of of revenue for ongoing organizational and community needs, while at the same time acknowledging that long term pension and OPEB obligation'",
        "'speaker_1': 'that the city has. And so we're just really trying to make sure that we're putting resources towards both of those competing interests in the in the near term and with the long term perspective.'",
        "'speaker_0': 'And can we go back to the slide that shows the pension contributions in the past for it was.'",
        "'speaker_2': 'Four years or something?'",
        "'speaker_0': 'Five years. So this proposed 9.2 is actually would be the second highest contribution and ironically is occurring during COVID, which suggests to me that we actually, as a city should have been spending more money on people and their needs.'",
        "'speaker_0': 'And we have many people who are hurting right now as we in fact, we heard from a tenant earlier who were deferring rent on. So I have concerns that we're thinking that during COVID we are having. The quote was In the good years and this isn't it.'",
        "'speaker_0': 'I don't know how we as a city can be saying we're having good year and acquiring all this excess money instead of spending it on the community. Thank you. Thank you. You know, I think that I am look forward to discussing the this policy and whether we need to revisit it and maybe make some modifications when we'",
        "'speaker_0': 'implemented it back in, I guess, 2016, 2017. The I mean, we still do have the issue of our unfunded pension liabilities with 2020 hindsight, but I'd like to see a little more steady go into it. The formula might be a good one, but perhaps we should cap the amount that we will put toward this in any given'",
        "'speaker_0': 'year. But that's, you know, again, subject to discussion in our May budget workshops. The other thing I would say is every time I talk about this policy is we want to make sure that we're. We're not stringing beads without a knot at the end.'",
        "'speaker_0': 'So we have to make sure that we're doing something to. Get a handle on our pension and our OPEB costs and, you know, find some constructive ways of doing that. I know I have not had a chance to follow up, but I sent to city staff some relevant city staff materials for.'",
        "'speaker_0': 'It's either tonight, maybe it's tonight's Hayward City Council meeting. Unless they met last night. Where? Or maybe there's a special finance committee meeting where they're looking at how they can address this very topic so we can learn from others.'",
        "'speaker_0': 'This proposal came from a presentation to the League of California Cities that many years ago. But, you know, I think it's probably good too to look at some other approaches OC other council members council data.'",
        "'speaker_1': 'Well, thank you. You know, this isn't the first time I have, along with other council members, expressed deep concerns about the formula that was arrived at in I believe, in March 2017 or sometime in 2017, because my concern really comes down to this.'",
        "'speaker_1': 'So what we're seeing over the four or five year period in which the formula has been put in place, we're seeing a cumulative 37 million, $37 million to buy down our pension obligations, as well as our outstanding OPEB unfunded obligations.'",
        "'speaker_1': 'And let me make sure to be clear, clearly, we have to pay down those obligations because we have $356 million in unfunded. That's unfunded. We don't know which we know we're going to have to pay this much, but we don't know where the money is coming from.'",
        "'speaker_1': 'We have $356 million in unfunded liabilities towards. OPEB and and CalPERS of the 2.356 million 277 is CalPERS. So clearly we have to figure out a way to buy down pay down that unfunded liability. But I as I said one year ago, the formula that's in place I don't think is the right formula, largely because.'",
        "'speaker_1': 'For two reasons. One is, any time that you're going to desert, you're going to spend thousands. A magnitude order of magnitude amount of dollars, like $37 million on something. I think clearly the people of Alameda need to be involved in it.'",
        "'speaker_1': 'There have been many things for which the vote the people have voted on that was much less than than $37 million because at the end of the day, the people need to under make it be involved in making a choice.'",
        "'speaker_1': 'Where do we want this $37 million to be spent? Or the other question is maybe it's not $37 million, but maybe it's $20 million, but whatever. So it's really that formula that has kind of driven this kind of.'",
        "'speaker_1': 'Incredible amount of spending without, in my opinion, the proper involvement of the residents. And on top of that, $37 million, now we're budgeting $9 million. So. So the so that's my my first concern. It's it's one of public involvement in transparency.'",
        "'speaker_2': 'I think the second.'",
        "'speaker_1': 'Concern is saying, oh.'",
        "'speaker_0': 'Sorry to hear that again.'",
        "'speaker_1': 'The second concern that I have about this reserve is that you have to understand that especially in the past two fiscal years, as demonstrated in our comprehensive annual financial report. TAFFER So this is an audited budgeted statement. So last year we had budgeted a certain amount of spending.'",
        "'speaker_1': 'That's we budgeted at the fiscal year ending June 30th, 2021. But we actually came in the actual spending came in under that by $13 million. And it came in under that for obvious reasons. You know, there was COVID.'",
        "'speaker_1': 'But in the previous year it was also similar on the on the similar order where we had budgeted a certain amount of dollars. But the actual that that we actually we spent for the fiscal year ending June 30th, 2020 also was roughly around $13 million.'",
        "'speaker_1': 'The issue is, is that when we're actually underspending that which we originally budget. What's happened is that the savings, if you will, guts put programed into the reserve. And so what happens is that we're kind of overexpressing the reserve and by overexpressing the reserve, we're also therefore because of the formula where resulting in this amount of dollars'",
        "'speaker_1': 'that that it just. In my opinion, it's just wacky. So. You know, I expressed the same concerns last year and I think two years ago as well. So I think for tonight, I mean, I think for now, I'm just going to have to vote no because we really have to fix this.'",
        "'speaker_1': 'Now, let me end on saying this. I'm not saying don't spend I'm not saying spend $0 of your reserve towards paying down that. $356 million in unfunded liability. I'm not saying $0, but by the same token, I think $37 million is just out.'",
        "'speaker_1': 'You know, it's just that order of magnitude is just. Wait, wait, wait out there. And and I'm also saying that I think the residents need to be involved. I think the residents will be supportive of us having some kind of formula.'",
        "'speaker_1': 'Don't get me wrong, I think they would actually be supportive, but I think they also want to know that the formula is reasonable. Thank you.'",
        "'speaker_0': 'Thank you. Our city manager, Eric Levitt, has patiently had his hand up. So I'm going to go to him next. Mr. Levitt.'",
        "'speaker_1': 'Mayor, mayor and city council. First of all, I want to say a lot of good points have been made regarding the pension in relation to the mid-year budget. I totally understand and appreciate those those statements. I think the Council was proactive in trying to set up a policy and set a policy.'",
        "'speaker_1': 'We're seeing some of the differences that that creates for you and what we've done in the past two years. And I just want to make sure everyone's aware of what I'm recommending for this mid-year is the same as what we did the previous two years, is that you put it as set aside, but it would not be'",
        "'speaker_1': 'going to the pension, to the pension, to the pension obligations until you get to your budget workshops in a in a couple months. And the reason I say that is because we put it in because that's the policy that's in place.'",
        "'speaker_1': 'But I also understand there's a lot of things that are also priorities that you're trying to deal with currently. And so I'm just saying set aside, but you could use it, you could decrease it. So for instance, two years ago we did the same strategy and then COVID hit between the mid-year and the annual budget.'",
        "'speaker_1': 'And at that time, the council did not move any money towards the pensions because obviously we were trying to deal with an emergency that was was coming at us very strong. And then last year, we had, as it was pointed out, a big amount that was going to pensions, but the council decided to reduce it somewhat, still'",
        "'speaker_1': 'quite significant dollars towards the pension obligation. But to reduce it, I'm recommending you do the same strategy where we have the 9 million at this point the mid-year, but that before you passed the final budget that you may want to adjust that amount because this 9 million represents the policy.'",
        "'speaker_1': 'But as a council, I think you should be reviewing that policy annually.'",
        "'speaker_0': 'Thank you, Mr. Levitt. And elsewhere, we're next with your hand up, please.'",
        "'speaker_3': 'Thank you. But I guess I have a few questions in December. I think it was December. We passed the Vision Zero Action Plan and a part of that. As part of that, there was a direction from the council to start putting $2 million a year towards additional new safety projects.'",
        "'speaker_3': 'And I don't see that in this in this is staff deciding that that's a that's a year or two of the budget item. The. I guess it didn't. Sorry. It just didn't dawn on me until halfway through the presentation.'",
        "'speaker_0': 'I know. Thank you for that. And and also, we we did answer your question about the cross-sell immediate area where those expenditures were. And so. Mr.. Mr. Bowden, I don't think this is one for Mr. McCarthy. Do you do what can you tell us about visions, your expenditures?'",
        "'speaker_1': 'Well, I'll I'll jump in. We do not have the $2 million set aside budgeted currently, but that does not mean that in the budget workshop for a year or two of our our annual budget process, that we we can't have that in place for you.'",
        "'speaker_1': 'And just just to maybe step back a little bit, the the the mid-year budget is is really an opportunity in most cases when we don't see the kinds of surpluses that we're seeing to do technical fixes, clean ups, and just make sure we're in good shape.'",
        "'speaker_1': 'And the mid-cycle budget is really our opportunity to kind of bring some policy discussions back into the mix, which is why we were talking about the pension policy, and we'll certainly talk about hopefully some city council priorities that come up.'",
        "'speaker_1': 'So apologies for not having the $2 million as the $2 million transportation related item in the in the list this evening. But we certainly can for the next full year budget discussion, which would be the budget workshops in May and hopefully adoption in June for for the next fiscal year.'",
        "'speaker_0': 'That's very nice.'",
        "'speaker_3': 'From my comment will be I think we spoke pretty clear clearly and pretty loudly that what we were doing in December was taking fast and decisive action. And I appreciate that. You know, there may be some reasons why I feel like we actually we gave direction and I'm a little surprised that we don't, especially with the large'",
        "'speaker_3': 'surplus. You know, one could have taken $1,000,000 in it in the in the budget for this year. But I understand that we may wanted to wait for the next one. You know, my concern is that we should not be waiting to think about what we're doing with that money until July.'",
        "'speaker_3': 'Right. When that in the next year's budget and whatever else. And I just, you know, I, I understand the process and all that, but I guess my concern is that there was kind of a let's figure out how to hit the ground running and get some contracting in place.'",
        "'speaker_3': 'You know, here's the state manager's recommendation included, you know, kind of using that to get contracts in place and whatnot. And I'm just a little concerned that that we're going to be waiting to even start talking about it in May and that we're going to be a fall or the end of the year or possibly beginning of'",
        "'speaker_3': 'next year before we can even start doing that. Which is which is a year after our commitment in December. I don't need it. I mean, I see the same managers and I will I don't need a response to that.'",
        "'speaker_3': 'I'm just going to flag that, that that is kind of a concern. And, you know, my expectation really will be at the provider workshops that that that that there is a funded program based on council direction that is a part of that a part of that budget and that and that we are we have we have begun'",
        "'speaker_3': 'work on that so that we're ready to hit the ground running when the year to budget hits.'",
        "'speaker_0': 'And before I call on the city manager also note that we have a council priority setting workshop coming up even before the May budget hearings, which is yet another opportunity for the Council to emphasize and prioritize where it wants to see staff work and and expenditures directed.'",
        "'speaker_0': 'So City Manager Eric Leavitt.'",
        "'speaker_1': 'So councilmember and city council and mayor and city council to answer that we can bring that back as part of the annual budget or mid-cycle budget. But in addition to that, after that direction from City Council, I had meetings with the transportation director as well as the public works director.'",
        "'speaker_1': 'And where they want to try to emphasize is two ways to try to expedite the projects that they already have in the pipeline. And they were saying they already have the funding. It's just trying to get that funding spent.'",
        "'speaker_1': 'So adding 2 million doesn't necessarily spend it, but they're trying to actually spend faster. So I can get an update of where we are and what we can do to continue to try those efforts. Because I understand what the council wanted to do in that was expedite the transportation.'",
        "'speaker_1': 'I did have initial meetings, I haven't followed up and I will do that now.'",
        "'speaker_0': 'Sort of an x y.'",
        "'speaker_3': 'I guess we've had conversations before the council meeting. The comments were made at the council meeting. It was written into, I believe, the resolution that that money was was made available to get consulting and contracting things in place to increase the capacity.'",
        "'speaker_3': 'And so I guess I'm all I know we're I don't want to get too far off, but but I just, you know, I I'm a little concerned that we're giving budget direct, that we're giving budget direction and then decisions are being made that we can't use the money.'",
        "'speaker_3': 'And, you know, the commitment that the council made to the community in December is is is going to be on hold until we have a different plan. So I'm just. Anyway, I've already moved approval of this budget. I'm not asking to make changes here, but but with the workshop coming up, I want to make it really clear'",
        "'speaker_3': 'that that. We need a plan.'",
        "'speaker_0': 'Thank you. Okay. Mr. Levitt, back to you.'",
        "'speaker_1': 'So I just received a message from the Public Works director and that those those actions based on that action, are in the mid-cycle review right now. To come back to you as part of the mid-cycle. And I understand what you're saying as far as expediency.'",
        "'speaker_1': 'But I also want to let you know that she did just communicate that those were while heard. And they are in the mid-cycle right now.'",
        "'speaker_0': 'Thank you for that. Okay. We've had a motion. We've had a second cast member. Disagree?'",
        "'speaker_1': 'Yeah. Just got it. I will vote no. But it is with utter respect to our city staff, city manager and assistant city managers. But, you know, is that I think, you know, you guys did good, great work. And so you gave us the information to have this kind of public dialog with it.'",
        "'speaker_1': 'So I certainly appreciate it. But for now, I'm going to vote no. Hopefully we can work things out several weeks from now. Thank you.'",
        "'speaker_0': 'All right. Thank you. Okay. Are we ready for that vote? Madam, quickly, we have a roll call vote, please.'",
        "'speaker_1': 'Councilmember Dechant know.'",
        "'speaker_2': 'Her as Spencer. No, actually, I avella. I may.'",
        "'speaker_0': 'As Ashcraft fly.'",
        "'speaker_2': 'Like carry 3 to 2.'",
        "'speaker_0': 'All right. Thank you. And yes, I second that. Councilmember De Saxe, thanks to staff all of you on screen, off screen who joined us briefly. Thank you. And this is important information. And as soon as we get those dates nailed down for the May, budgets will make that budget hearings will make that information public.'",
        "'speaker_0': 'And I think maybe did I hear that we're going to use some tools that help people do some. Planning or flight awareness dealing with thunder. So come to the budget hearings. It'll be great. Hurray! Thank you, everyone. Okay, at this time, we have to finish the continued agenda items, but we are going to take a break because'",
        "'speaker_0': 'we've been at this two and a half hours and my zoom rules are 2 hours and we take a break. Let's be back at ten oh ten. It's 1958. You got 12 minutes, everybody. See you at ten at 10 p.m..'",
        "'speaker_0': 'Thank you. And thanks again, Steph. Okay. Harvey, everyone. I think we have quorum.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Laura, are you ready? We are. All right.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'Welcome back, everyone, from break. This is still the city council meeting for the city of Alameda. It's March 15, 2022, and we are moving on to the regular agenda. Would you please introduce the next item?'",
        "'speaker_2': 'Presentation by the Alameda Point Collaborative on the Alameda Williams campus at McKay Avenue.'"
    ],
    "Recommendation to Authorize the City Manager to Execute an Agreement with Andrew M. Jordan, Inc., DBA A&B Construction, in a Not to Exceed Amount of $31,277,673, for the Alameda Point Reuse Area Infrastructure Replacement Phase 1 and Phase 2, No. P.W. 11-19-55; and\nAdoption of Resolution Amending the Capital Improvement Program Budget by Increasing Revenue and Expenditure Appropriations in the Alameda Point Backbone Infrastructure Capital Improvement Project (C75000) by $5,790,913 from Available Fund Balance in the Alameda Point/Base Reuse Fund (290) to Construct the Alameda Point Reuse Area Infrastructure Replacement Phase 1 and 2, No. P.W. 11-19-55.  (Public Works 31041520)": [
        "'speaker_2': 'Is recommendation to authorize the city manager to execute an agreement with interim Jordan, anchoring businesses and construction in an amount not to exceed $31 million. 277,673 for the Army. 2.4 Use area infrastructure replacement phase one and Phase two number p.w 11 1955 An adoption of related budget resolution.'",
        "'speaker_0': 'Ex Madam Clerk and we are joined again by our public works director Aaron Smith. Welcome back. And the floor is yours.'",
        "'speaker_1': 'Right?'",
        "'speaker_0': 'The screen. Okay.'",
        "'speaker_2': 'So making sure we can get thumbs up. Everybody can see my screen.'",
        "'speaker_0': 'And see your screen.'",
        "'speaker_2': 'Excellent. Good evening again, Madam Mayor, Vice Mayor, members of the Council, Aaron Smith, Public Works Director. I'm very excited to be here this evening to present award of a construction contract to build backbone infrastructure in Alameda Point's adaptive reuse area.'",
        "'speaker_2': 'Council is considering two items this evening award of a $31 million contract to A and B, construction and a budget amendment to appropriate 5.8 million from the base reuse fund to the capital budget. Alameda Point's adaptive reuse area shown here highlighted in yellow, is a historic district.'",
        "'speaker_2': 'Buildings within the reuse area are planned to be incrementally sold to private property owners on a parcel by parcel basis. Upon receipt of funds from the sale of properties, the city is overseeing the logical implementation of the backbone infrastructure under the Capital Improvement Program.'",
        "'speaker_2': 'Five buildings have sold to date, shown here in yellow, generating 31 million in revenue governing. The phased implementation of infrastructure in the reuse area is a 2017 agreement. The city has with estimated the city agreed to build out the water system in three phases as shown here.'",
        "'speaker_2': 'Phases one, two and three. Color coded. The agreement has specific requirements and milestones for the water system, design and installation. Following a building sale in any one of the given phases, since buildings have sold in both Phase one and phase two, the city is obligated and is replacing the Old Navy installed water system in these phases.'",
        "'speaker_2': 'As this work is advancing ahead of city phase two and the West Midway Project. We are also bringing in Eastbay mud infrastructure from Main Street into the reuse area along that section of West Midway in West Tower shown here in purple.'",
        "'speaker_2': 'In addition to the water system, the project includes all backbone infrastructure in phase one there, and all backbone infrastructure include sewer storm, joint trench, street lighting, landscaping and complete streets with bike, pedestrian and transit facilities. It also the streets will capture 100% of stormwater runoff and have that treated in the fire retention areas before discharge to the'",
        "'speaker_2': 'bay. This substantial project was successfully bid and we received four responsive bids. The low bid was A and B or is A and B construction out of Berkeley. Their bid came in and the total $28 million figure is shown here on the slide.'",
        "'speaker_2': 'When you add it, 10% contingency councils considering award of the construction contract of $31,277,673. To award the contract. We're also seeking a budget amendment to appropriate 5.8 million from the Base Reuse Fund to the capital budget. This will allow not only award of the contracts this evening, but ensure adequate funding for additional soft costs during a two'",
        "'speaker_2': 'year construction period. The appropriation or the budget amendment tonight can be considered a request to advance building CIL revenue from the sale of Building 92, which is in Phase one. Building 92 was originally going to be sold in 2018, but the Surplus Lands Act delayed the sale and now that requirements in the Surplus Land Act have been'",
        "'speaker_2': 'met. The building is intended to be sold this summer. The last building evaluation was in 2018 and it was 7.2 million. The following sale of Building 92 that that actual sale amount would be deposited back into the base re-use fund.'",
        "'speaker_2': 'So I kept my presentation nice and short. I hope I can't see everybody, but I hope we're smiling because this is a really exciting project for me. And with that, I'm happy to answer any questions and have a productive conversation.'",
        "'speaker_0': 'Thank you, Miss Murph. I think we are smiling. That was a great presentation. I love those graphics where you have all the colored arrows showing every which way, where things are. I mean, who knew sewage could be and sewer and water and electrical engineer?'",
        "'speaker_0': 'Totally. Anyway, before we go to our clarifying questions, we have public speakers on this item. We do not. Okay. Close public comment on this item. Council. Comments. Questions. Motion. Hands up, counselor. Not sweating.'",
        "'speaker_3': 'I have a couple questions. I'm not sure if you're able to pull back up the map first, only because I don't know how to I don't know what to call it. But this you should schedule phases one, two and three.'",
        "'speaker_3': 'What is what is the is is being minor? The VA doing the not phase one two and three part of the. Or the beehive.'",
        "'speaker_2': 'Those are exercising. Only go back. I'm sorry. Councilmember, what area are you.'",
        "'speaker_1': 'Discussing in.'",
        "'speaker_3': 'The area is not listed one, two or three up in the beehive and whatnot. I'm just curious.'",
        "'speaker_2': 'Understood. Yeah. So that's considered part of the development area in the master infrastructure plan. Our community development director, Lisa maxwell, would be able to speak in more detail. I believe that area is called Edge K, but the intent is that it would be sold to a developer and the developer would be bringing in the infrastructure.'",
        "'speaker_1': 'Okay.'",
        "'speaker_3': 'And then where the were the top blue, the blue, that section that doesn't have a number under the blue arrow.'",
        "'speaker_2': 'Yeah. My understanding these are not considered backbone street. So the adaptive reuse area when when these areas are subdivided and sold, the adjacent development would be bringing in frontage improvements.'",
        "'speaker_3': 'Okay, great. I guess the other question that I, I guess one could ask is the $31 million program we heard earlier that when the city does programs of this size, we take it to the voters if the voters approve this.'",
        "'speaker_2': 'Not the the project specifically, but the policy around building sale revenue being spent on backbone infrastructure in the adaptive reuse area.'",
        "'speaker_3': 'If the voters approve that.'",
        "'speaker_2': 'That's my understanding. I'm going to look to perhaps our city manager's office as well. I know the master infrastructure plan contemplates this approach. Master infrastructure plan was brought to council and approved, and they do contemplate this sort of logical implementation of the backbone infrastructure in the reuse area.'",
        "'speaker_2': 'I can follow up with you further, Councilmember, just specifically when when that building sale revenue into backbone infrastructure was formally approved?'",
        "'speaker_3': 'No, I'm sorry. I understand how it's done. My question is, is whether or not there were any votes of the city electorate that approved this project or anything like this project. My my understanding my memory and understanding and involvement is that that it was all council directed.'",
        "'speaker_3': 'Including that the fiscal neutrality project that our policy that you're discussing.'",
        "'speaker_0': 'And that's what I would if it would help. Mr. SMITH Were you perhaps harkening back to an earlier discussion this evening?'",
        "'speaker_3': 'Well, yeah. As I said, we heard earlier that projects of $30 million and even $9 million are are always approved by the voters and that it's not council appropriate to be making decisions. And I'm just trying to understand whether or not this project falls into that.'",
        "'speaker_1': 'Well, I could see.'",
        "'speaker_0': 'I think I was busy when they let me call on you. I was going to say. Why don't we let I? Because I think you might be referring to council members this statement. So why don't we hear from council decide what you were, what you said or intended to say?'",
        "'speaker_1': 'Yeah, I don't see any issue here. The earlier discussion was about the use of general fund money and the choices we make between activities funded by general fund money. In this case, this is basically a pay as you go kind of activity where the proceeds of the sales of a property are being paid to, are being used'",
        "'speaker_1': 'to pay for the infrastructure that will eventually help this area. Is just two completely separate subjects. The one was about general fund and the cumulative amount of money that you could have had different choices to spend the $37 million.'",
        "'speaker_1': 'This is a very specific project where it's about the sales and the uses of land proceeds. It's not unusual. I mean, we don't have to go to the voters for the sales of land proceeds at Alameda Point. We haven't done that.'",
        "'speaker_1': 'So.'",
        "'speaker_0': 'Thank you. So I just wanted to give Mr. Smith the benefit of some backstory. Kels, we're not quite that to you.'",
        "'speaker_3': 'Think so? Yeah, I think I have one other comment that I may make later, but I'll just point out that it was it was a council policy that made the sale of these buildings, put the money into a fund that was going to go back and be used to fund this infrastructure.'",
        "'speaker_3': 'That was that was a council decision. So these aren't special funds like act funds or park funds or whatever else. These were council decisions that that made these large decisions about how to move funds around to address large, significant city costs.'",
        "'speaker_3': 'And I don't have a problem with it. I just that. Sorry, that's that. My apologies if I wasn't clear. Ms.. Smith, I don't have a problem with that at all. I think it's a very small one. In fact, I've been a very strong proponent for maintaining the Fiscal Neutrality Project program and really making sure that we maintain'",
        "'speaker_3': 'that commitment to our community, that that that we are fiscally neutral out here. I just I think you can draw the lines wherever you want, but at the end of the day, we don't have a threshold by which we go to the voters for certain things.'",
        "'speaker_3': 'And I think this is a perfectly good example of how past councils have made policies that have driven decisions that are now being implemented by this council in order to meet long term needs. Thank you. I think it looks great and I will be looking forward to supporting it when there is a motion.'",
        "'speaker_0': 'Would you like to make that motion?'",
        "'speaker_3': 'Yeah. I'd be happy to. I will move approval of this. Of this item.'",
        "'speaker_0': 'Thank you. Grab a second. Will continue our discussion. Councilmember Daza a.'",
        "'speaker_1': 'Second with continued discussion.'",
        "'speaker_0': 'Perfect. Would you like to go next on the discussion?'",
        "'speaker_1': 'Yes. Thank you. This is an exciting project that will move the redevelopment of Alameda.'",
        "'speaker_0': 'Councilmember Desai made his way to options. Sorry. So the city clerk tried so hard with me, I. I'm supposed to stop now. We need to do that housekeeping vote because it's coming up on 11 p.m.. So we have a couple more items to go.'",
        "'speaker_0': 'We've got seven C on automated license plate readers. We have seven D on addressing catalytic converter theft and we have what? We have three council referrals. I would entertain a motion to complete this current item or on and the other to seven C and at 70 and the agenda in the meeting.'",
        "'speaker_0': 'Then we need four votes to do it. So whatever we do, we got to do it between before 11:00 or it becomes a moot point. So anyone want to make a quick motion to hear this item and two more.'",
        "'speaker_1': 'Sure.'",
        "'speaker_0': 'Counselor desk. The excitement. You might like to have a second.'",
        "'speaker_1': 'It's not.'",
        "'speaker_0': 'Very reassuring. No. Okay. Um hmm. So we just want to say, I would.'",
        "'speaker_3': 'Make I would make a motion that we just finish this item. It'll be 11:00 when that happens that we hear the rest of our updates and everything else.'",
        "'speaker_0': 'Just continue the rest of our updates. What updates.'",
        "'speaker_1': 'Are you?'",
        "'speaker_3': 'We agree. We have counsel communications and oral communications. Sorry.'",
        "'speaker_0': 'Well, we don't have any more communications because we finished before 15 minutes was up. So we we have. Okay. So that's a motion then to do finish this item and here council communication, correct?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Okay. Anyone willing to second councilmember Harry Spencer. Thank you. Actually, I thought he was going to second member Desert Motion. And I'm interested in seconding that motion and following what you had suggested, Mayor. Oh, okay. Which was to do those three items.'",
        "'speaker_1': 'You still need more votes.'",
        "'speaker_0': 'Isolate for votes. Yeah, well, you never know. You never know. Okay. We've had a motion by Councilmember Desai that's been secured by Councilmember Herr Spencer. I'm. We have a roll call vote, please.'",
        "'speaker_2': 'Disorientation. I heard Spencer. I knocked. Right. That was the No and Bella no cash high. That motion failed due to two since it required for it.'",
        "'speaker_0': 'Okay. Then I would ask that we also move those two items that we're not going to get to tonight on the regular agenda to the item six on the next council meeting.'",
        "'speaker_1': 'As I move.'",
        "'speaker_0': 'And wait until tomorrow, Harry Spencer had her hand up for. So let me call her then back to you. Kelso Spencer. Thank you, Mayor. I'd like to try to at least get through a finish of this one and then do the 75, which is the cameras, and go for it quickly and then tell you what the then'",
        "'speaker_0': 'that's the motion. Finish this item and do 70 days of your second council release. Okay. Roll call vote on clerk, please.'",
        "'speaker_2': 'Council Member Dave i. I for spencer.'",
        "'speaker_0': 'I next.'",
        "'speaker_2': 'Five. Sorry, I can hear you, but I think that was a no also.'",
        "'speaker_3': 'Now, I don't know what's going on with my microphone, you know.'",
        "'speaker_2': 'Okay. Okay.'",
        "'speaker_1': 'You know, where is Ashcroft?'",
        "'speaker_0': 'I that. Okay, we revert to revert to plan B. So those two items said then. What did I say? C and D go to item six in the next agenda. Okay. Council member knocks away.'",
        "'speaker_3': 'All right. I think I was I was going to say, are you looking for emotion? I'll be make that make that emotion for you.'",
        "'speaker_0': 'Is it emotional? Which is to direction?'",
        "'speaker_2': 'Yes. You need emotion to put it on that section. Yes.'",
        "'speaker_0': 'Okay. Yes, I need emotion. Okay. Gebert Herrera, Spencer crossover here. Spencer, you're making the motion. Okay, Catherine, that's what you're seconding, correct?'",
        "'speaker_3': 'Yes. Okay. 70 and continued items, correct?'",
        "'speaker_0': 'Correct.'",
        "'speaker_3': 'Yes, I.'",
        "'speaker_0': 'See. Okay. And in the order of the same order, I don't want to change your order. Right. But they're going to be like numbers three and four on the section six. So seven, you should follow the when we carry them all over is my point or 7f2 for that matter.'",
        "'speaker_0': 'All of them would carry out just keeping the same order from the original agenda as well.'",
        "'speaker_1': 'Mm.'",
        "'speaker_0': 'Yeah, that actually makes sense I think because that was the order in which they were listed, but they're coming at the top of the agenda so we ought to be able to get through them. Let's see if we can get through the vote to do that.'",
        "'speaker_0': 'Okay. We have a roll call vote, please.'",
        "'speaker_2': 'A birdie flag. Hi, Parish. Spencer. Hi. Next fight?'",
        "'speaker_1': 'Hi, Mila.'",
        "'speaker_2': 'I may as.'",
        "'speaker_0': 'I carry.'",
        "'speaker_2': 'Sci fi advice.'",
        "'speaker_0': 'All right. Okay. And apologies to any staff for those two items that we didn't get to. But let's continue. Where were we? We were we had measures second. And does anyone any further discussion? Councilmember Harry Spencer. So I'd like a point of order in regards to and I'd like to know can, can I start talking about a'",
        "'speaker_0': 'prior agenda item and how that vote may be consistent.'",
        "'speaker_2': 'Or inconsistent with my position.'",
        "'speaker_0': 'On this item? Because asking the city attorney, city attorney is that what you're asking? Khurshid.'",
        "'speaker_1': 'If so. Councilmember Without knowing specifics, generally, as long as your conversation relates to this item, the Brown Act gives you latitude. So, for example, you could explain that I'm voting yes on this item because among other things, you've looked at this item from a prior agenda item from a different perspective, and that has helped you to get'",
        "'speaker_1': 'to. Yes.'",
        "'speaker_0': 'What about if I said I voted against I voted no on a prior item that dealt with the pension. Councilmember Herrera Spitzer Mr. Shinn was still talking, so I would ask, just let him finish. And then I will be happy to have you answer your next question.'",
        "'speaker_0': 'Please finish what you were explaining, Mr. Chen.'",
        "'speaker_1': 'I'm good. I'm good. Thank you very much. My apologies.'",
        "'speaker_0': 'Okay, so we'll try to talk over each other, okay? Question. Next question. Councilor Gregory Spencer. Thank you. Yes. So I could understand that the city attorney had completed his comments as I appreciate being able to continue mine and unfortunately I was interrupted one more time.'",
        "'speaker_0': 'But I'd like to be able to continue my comments because earlier we had a council member essentially I'm going to bring up comments from a prior agenda item that have, as far as I can tell, no relevance to this item.'",
        "'speaker_0': 'But I too voted no for the prior item. And I would like a point of order in regards to may I continue and discuss why I voted no on that item and yet I will be voting yes on this item.'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'I'm city manager of.'",
        "'speaker_1': 'My question.'",
        "'speaker_0': 'Well, is it.'",
        "'speaker_1': 'A question for me.'",
        "'speaker_0': 'Madam? I'm not sure. It's it's not true. It's a legal question. I you know, I think what we what we do and we we we all work hard at what we do. And sometimes maybe we get a little agitated about things.'",
        "'speaker_0': 'We we. But at the end of the day, we're doing the people's work. People are watching. People have stayed up until 11:00. They might be interested in how we're going to move the infrastructure on this very important project for our city forward.'",
        "'speaker_0': 'You you have 9 minutes. We all do for our allocated time and your you know, as long as you stay within the Brown Act and as the city attorney has explained it, you have some latitude. I mean, you have the right to to discuss.'",
        "'speaker_0': 'So I would imagine he would champion, although he's very always very courteous, but he would let us know when we're veering into Brown Act, the danger zones, wouldn't you? Mr. Shand So.'",
        "'speaker_1': 'Yeah, it's a matter of mayor and council member. If I may just share one, maybe I can try to be further helpful here now that I'd have a little more specifics from Councilmember Spencer, which is that I think my suggestion is that instead of necessarily explaining and going into detail about what you did at a prior agenda'",
        "'speaker_1': 'item, you use, whatever your prior experience is to relate to how you might vote in this case.'",
        "'speaker_3': 'So that would be my suggestion.'",
        "'speaker_1': 'Is to relate everything to this matter. But you certainly could use prior agenda items to inform your decisions here and to compare and contrast. I hope that's helpful, Councilmember.'",
        "'speaker_0': 'May I continue? Yes, you may. Thank you, Mayor. So I do appreciate the comment from the city attorney, but I think that's actually a different response to what we had occurred earlier between two council members and I. Two did vote against the 9 million being allocated.'",
        "'speaker_0': 'But I do think that that's actually in the former agenda item, and I really don't think it's.'",
        "'speaker_2': 'Appropriate to be.'",
        "'speaker_0': 'Discussing at this time. So I actually do want to stay within the boundaries of this agenda item and not discuss the 9 million or voting no on a prior agenda item.'",
        "'speaker_2': 'Because I really don't.'",
        "'speaker_0': 'Think it is relevant to this item. I think it did stray outside of the Brown Act. And in regards to this item. I think that I want to commend staff. I think that I'm very happy seeing this move forward.'",
        "'speaker_0': 'I, I do think that there has been multiple.'",
        "'speaker_2': 'Agreements.'",
        "'speaker_0': 'From former councils and it's been implemented that the moneys from the projects out of the point will be spent out at the point to support that infrastructure and the building there of and that the balance of the city will not be imposed upon to complete any of the projects out there.'",
        "'speaker_0': 'And I. There were multiple. Actually, I think that we did have several votes go to the people where council was pretty much given kept trying to figure out how to make progress out of the point. And at least one measure failed out there.'",
        "'speaker_0': 'So I think council has tried to hear the public and try to figure out how we're going to do this. And I think the policy of fiscal neutrality was in fact a good policy. And I think it's really helped us try to balance the needs of the community at large and really encourage and in some ways force'",
        "'speaker_0': 'this the staff and the city council members and the developers to to actually do a heavy lift out there. And I don't I don't I want to actually focus on that. This is a really heavy lift that staff is bringing forward.'",
        "'speaker_0': 'And I don't want to distract it with other agenda items because I.'",
        "'speaker_2': 'Think this is really good work.'",
        "'speaker_0': 'So I do really want to commend the staff and.'",
        "'speaker_2': 'The developers throughout this.'",
        "'speaker_0': 'Year trying to figure out how we're going to build and develop. The point that we have all found has turned out to be extremely expensive, extremely expensive and really, really hard to do. So I want to thank I think it's Director Smith now for doing this work.'",
        "'speaker_0': 'I'm looking forward to the project moving along and I think we are making a good attempt to do our best for the people at large. Thanks. Thank you, Councilor Harry Spencer at their comments. Questions. Councilmember Desai.'",
        "'speaker_1': 'Thanks. Yes, thank you. So, you know, I just want to say, you know, what I like about the project that's in front of us is that. I do think that it's consistent with the vote of the people in the sense that when I got elected to City Council in 1996, my message was that Alameda Point has to'",
        "'speaker_1': 'pay for itself. So I think in that sense that that message certainly got through. And so I really appreciate that. All joking aside, I think this is a great use. People understand that Alameda point, you know, the money that's generated out there through the land proceeds really have to be funneled back in.'",
        "'speaker_1': 'There's just there's no need for, you know, having elections on every item out of Alameda Point. So that was kind of a broad statement that I ran on in 1996 successfully. And then ultimately in 2003, I finally created the fiscal neutrality policy for Al Gore.'",
        "'speaker_1': 'Made a point. And I see everything that's happening here still being aligned with what we talked about and what we decided way back, you know, more than 25 years to 20 years ago plus. So so I'm excited about this project and I think, you know, the things that are just happening around there from not just Blade AM'",
        "'speaker_1': 'thank God that they were able to hang in there all these years, but also the new kind of outdoor beer at the hall or whatever it is. There's a lot of exciting things going on and I think this is going to be a part of that.'",
        "'speaker_1': 'And so I certainly appreciate. I appreciate the residents of Alameda hanging in there with us. And I think, you know, these are great days that are going to be coming down even faster than than we think. Thanks a lot.'",
        "'speaker_0': 'Thanks, Councilmember, they said. I would agree this is a very exciting time. I agree with councilmember herrera spencer. This is a heavy lift. I really commend staff. Public Works director Aaron Smith and all the folks you've worked with.'",
        "'speaker_0': 'And just there's there's lots of moving parts when you talk about all these different utilities there. There's a lot of different representatives that go in there. And yet when you go out to Alameda Point, it really is pretty impressive with what has developed.'",
        "'speaker_0': 'I mean, those of us who've been working on it a long time know there's still more to come. But we've come a long way and this is an absolutely essential part of this this development, and to enable it to move forward.'",
        "'speaker_0': 'And I'll just throw out an enticing little date for your calendar. Is that on Saturday, April 9th, just a few weeks from now, we're going to be doing the ribbon cutting for the waterfront park at Alameda Point. So I've got it scheduled from, well, I guess 1 to 5.'",
        "'speaker_0': 'But I think the ribbon cutting is somewhere of the beginning of people's lives. Lots of excitement is planned that I'm not a part of planning. But yeah, we'd love to see members of the public and I'm sure it'll be a beautiful day.'",
        "'speaker_0': 'So anyway, we need a vote to move this item forward. And I think we had the motion and the second, so there's no further discussion and that's in hands up. Now we have a roll call vote, please.'",
        "'speaker_1': 'It's an invitation. Yes.'",
        "'speaker_2': 'Sir. Spencer, I. Next slide.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Vella. I may, as I like, carries by writing.'",
        "'speaker_0': 'All right. That's great news. Thank you so much, staff. And we appreciate all your hard work on this. All right. So with that, we move down the agenda to item because we've already done the city manager's communications. So then we just jump right down to council communications.'"
    ]
}