{
    "On the message and order, referred on November 3, 2021, Docket #1146, authorizing the City of Boston to accept and expend an amount not to exceed Three Hundred Eighty Seven Thousand One Hundred Sixty Four Dollars ($387,164.00) from the Massachusetts Executive Office of Energy and Environmental Affairs Division of Conservation Services for the Parkland Acquisitions and Renovations for Communities (PARC) Program grant, to be administered by the Boston Parks and Recreation Department. The grant will help fund the acquisition of two parcels on the western shore of Sprague Pond at 0-4 Lakeside Avenue in Hyde Park as a permanently protected parkland to be known as the Sprague Pond Shoreline Reserve, the Committee submitted a report recommending the order ought to pass.": [
        "'speaker_0': 'Docket 1146 The Committee on Environment, Resiliency and Parks, to which was referred on November three, 2021. Docket number 1146 message in order authorizing City of Boston to accept an expanding amount not to exceed $387,164 from the amass Executive Office of Energy and Environmental Affairs, Division of Conservation Services for the Park Land Acquisition and Renovation for communities known'",
        "'speaker_0': 'as the Park Program Grant to be administered by the Boston Parks and Recreation Department. The grant will help fund the acquisition of two parcels on the western shore of Sprague Pond at 024 Lakeside Avenue and Hyde Park. As a permanently protected parkland to be known as the Sprague Pond, Shoreline Reserve submits a report recommending that the order'",
        "'speaker_0': 'of 2.'",
        "'speaker_2': 'Thank you, Madam Clerk. Council tells the President. Email you have the floor.'",
        "'speaker_1': 'Thank you very much, Madam Chair. On Friday, December 3rd, we chair to hear. I chaired a hearing on these two dockets. I wanted to thank councilors Braden, Arroyo, Flynn and Flaherty for their participation. I also wanted to note former councilor and current state representative Rob Consalvo also testified and offered his support.'",
        "'speaker_1': 'This is really exciting. These are two Park Fund program opportunities or funding fundraising opportunities. What is a $400,000 grant that will help allow for renovations at the Winthrop Park in Dorchester, Roxbury? Eldercare and Garran, the senior planner for Parks and Recreation, noted that the renovations for the playground will include a new basketball and multi-sport sport court, a'",
        "'speaker_1': 'splash pad and new exercise equipment with a paved exercise circuit, a refurbished lawn area for open play and new tables and benches. The renovations will also improve accessibility by meeting ADA compliance and would include new tree planting and plantings.'",
        "'speaker_1': 'There will be a net gain of eight new trees. The proposed completion date for this project is June of 2023. Docket 1146 is another park land acquisition grant in just under 400,385 $87,164, which will help fund acquisition of two parcels on the western shore of Sprague Pond at 024 Lakeside Avenue and Hyde Park as a permanently protected'",
        "'speaker_1': 'park land to be known as the Spragg Pond Shoreline Reserve. This is something that is really, really, really interesting. I think many of you know that this is the site of the encampment of the 54th Massachusetts Voluntary Volunteer Infantry Regiment.'",
        "'speaker_1': 'I believe it was the first regiment of black Americans who fought and fought in the Civil War. It's a place of incredible pride that it was in not only our city limits, but so close. And we will not only be protecting that space and really giving that space the reverence that it deserves, being almost like an outdoor'",
        "'speaker_1': 'educational classroom we firmly protect it from development, will make sure that we're able to get resources. And it's a really, really exciting not only environmental justice investment, but also historically historical investment. Joe Bagley, who is our city archeologist, offered testimony to support the historic, historical and archeological sensitivity for the site.'",
        "'speaker_1': 'This is without landmark designation, the city and state or federal protections. The city cannot enforce archeological preservation without acquiring the lands. One of the reasons why this is so, so important. So a vote on this would be a vote to accept the grant money which would then work towards an acquisition.'",
        "'speaker_1': 'We will not be voting to acquire the land at this moment. I am very hopeful that this will happen in very short order next year. But both of these dockets are incredibly important, incredibly transformative for our city. And again, I think we all I know everyone in this chamber is a fervent defender and lover of our outdoor'",
        "'speaker_1': 'space in our Boston parks. There's a renewed sense of importance after nearly whatever. What are we at now? 20, 22 months of pandemic to see how important it is for to protect and grow these outdoor spaces. It's not only an environmental justice issue, it's a public health issue, it's a public safety issue.'",
        "'speaker_1': 'It's obviously a huge environmental issue. And in this particular case, as it relates to Sprague Pond, it's also a vital part of our history that we need to protect and preserve. So I urge you all through you, Madam Chair, all colleagues, to please vote in support of both of these dockets.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_2': 'Thank you, Councilor O'Malley. Anyone else wanting to speak on these dockets at this time? Councilor O'Malley, who's the chair of the Committee on Environmental Resiliency and Parks, seeks not suspension of the rule, seeks passage of docket 1145 and docket one one for six will take them separately.'",
        "'speaker_2': 'All those in favor of passage of docket one, one, four or five say any opposing nay. The ayes have it. Docket 1145 has been passed. All those in favor of passage of docket 1146. Say I. Any opposing. The ayes have it at 1146 has been passed.'",
        "'speaker_2': 'Thank you, Madam Clerk.'"
    ],
    "On the message and order, referred on December 1, 2021, Docket #1210, authorizing the City of Boston to extend the local option first adopted in 2012 that offers members of the Massachusetts National Guard and reservist on active duty in foreign countries a real and personal property tax exemption of up to 100% of the total assessed, the Committee submitted a report recommending the order ought to pass.": [
        "'speaker_1': 'Thank you very much, Councilor Campbell. Madam Clerk, would you now please read docket 1210?'",
        "'speaker_0': 'Surely. Docket 1210. The Committee on Ways Means to which was referred on December 1st, 2021, docket number 1210 message an order authorizing the city of Boston to extend the local option first adopted in 2012. It offers members of Massachusetts National Guard and reservists on active duty in foreign countries a real and personal property tax exemption up to'",
        "'speaker_0': '100% of the total assessed. Submits report recommending the order to pass.'",
        "'speaker_1': 'Thank you, Madam Clerk. The Chair now recognizes the Chair of the Committee on Ways and Means, Councilor Kenzie Bok. The floor is yours.'",
        "'speaker_3': 'Thank you so much, Mr. President. We had a great hearing on this on Friday. Thank you so much to Councilors Flynn and Flaherty for attending. And as it says in the description, Docket 1210 would authorize the city of Boston to accept this local option, which lets us provide a property tax exemption of up to 100% to homeowners'",
        "'speaker_3': 'who are active members of the National Guard or military Reserve serving in a foreign country during the fiscal year. This was adopted in 2012, and so every two years it's required that we reauthorize it. So the Council has been doing that continuously since the option first was created.'",
        "'speaker_3': 'I have to say that one of the things we discussed in the hearing is the fact that this is probably too well-kept of a secret. I mean, it's a fairly narrow band of folks as it is. But for instance, like the year before last, we had seven people taking advantage of it.'",
        "'speaker_3': 'In this past year, we actually didn't have anybody taking advantage of it. So one of the things that Councilor Flynn and I discussed with the assessor and sort of a follow up action step is to go reach out to Commissioner Santiago and think about ways to spread the word about this a little bit more, because through the'",
        "'speaker_3': 'military channels, there are definitely discreet people who qualify for this in the city of Boston who don't know that it's an option for them. So I think that was a major thing that came out of the hearing. And I'm grateful that Councilor Flynn for his partnership on that.'",
        "'speaker_3': 'But certainly we want to spread the word, but we need to have the exemption to spread the word about. And so in order for that to happen, as chair of the Committee on Ways and Means, I'm recommending today that this this stuck it out to pass, Mr. President.'",
        "'speaker_1': 'Thank you very much, Madam Chair. Would anyone else wish to speak on Docket 1210? Seeing no takers. Kenzie Bok, chair of the Committee on Ways and Means, seeks acceptance of the committee report and passage of Docket 1210. All those in favor please indicate by saying I oppose.'",
        "'speaker_1': 'Nay, the ayes have it. The docket has passed.'",
        "'speaker_2': 'The President.'",
        "'speaker_1': 'Roll call vote yes. If Councilor Baker is doubting the vote. So, Madam Clerk, would you please call the roll on docket one two, one, zero.'",
        "'speaker_0': 'Thank you. Target 1210. Council Arroyo. Yes. Councilor Arroyo. Yes. Councilor Baker. Yes. Councilor Baker. AS Council BLOCK. Council BLOCK is Councilor Braden. Councilor Braden. Yes. Councilor Campbell. Councilor Campbell. Yes. Councilor Edwards. Councilor Sabi George. Councilor Sabi George. AS Councilor Flaherty.'",
        "'speaker_0': 'Council. 30 Years Council Flynn. Councilor for ten years. Councilor Janey. Council me here. Councilor, I'm here. Yes. Councilor Murphy. Councilor Murphy. Yes. And Councilor.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Yes, Mr. President, do I get number 1210 received a unanimous vote.'",
        "'speaker_1': 'Thank you, Madam Clerk. Now moving on to the matters recently heard for possible action. Madam Clerk, would you please read docket 0221?'"
    ],
    "Order for a hearing to discuss internet access and digital equity in the City of Boston.": [
        "'speaker_0': 'Thank you. Docket 0221. Order for a hearing to discuss internal access and digital equity in the city of Boston.'",
        "'speaker_1': 'Thank you. The chair now recognizes Councilor Ed Flynn, chair of the Committee on City and Neighborhood Services. Councilor Flynn, the floor is yours.'",
        "'speaker_4': 'Thank you, Mr. President. Mr. President, we held a hearing on digital equity and Internet access this Monday, December six. The matter was sponsored by myself council me here in council. I want to thank councilors Brayden, Murphy, Bach and Flaherty for attending and to the panelists for being there also Alex Lawrence, Michael Lynch, Sarah Segal, Lara Peter for'",
        "'speaker_4': 'the Reader and from the from the Do It Week team. Margaret McKenna, who is the chair of the Boston Human Rights Commission. Theodora Hannah from Tech Goes On. Stephanie Lee is with Verizon. Angela Holm is with Comcast at the hearing.'",
        "'speaker_4': 'They do. A team presented their work on digital equity, including their efforts on publicizing the emergency broadband benefit to eligible residents, which gives up to $50 discount a month to qualified residents. And with the new infrastructure bill, there will be a new affordability connectivity program going forward.'",
        "'speaker_4': 'We spoke about the barriers for families to apply to these programs, since the application itself is in eight pages and the application itself is only in English and Spanish. Two, it is now working to reach out to different communities and help them apply for this important benefit.'",
        "'speaker_4': 'Margaret McKenna also spoke about the immediate need to address the gap of access for all residents and how broadband is now a necessary. Necessity for everyday life. She suggested having wi fi at bus and street train stations as a way to close the gap.'",
        "'speaker_4': 'Panelists from Tacos Home, Verizon and Comcast also spoke about the spoke about their programs, including plans to expand that network and current discount programs for residents. We still have a lot of work to do to address this important issue.'",
        "'speaker_4': 'And with the passage of this infrastructure bill, we have an opportunity to expand resources and take a huge step forward in closing the digital gap. I'm asking that this matter remain in committee so that we can continue the conversation.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you very much, Councilor Flynn. Um, would anybody else wish to speak on this docket? I'm sorry I missed your light there. The chair recognizes the co-sponsor. At-Large city councilman. Dorchester councilman here. The floor is yours.'",
        "'speaker_2': 'Thank you to my co-sponsors, Councilor Flynn and BOC for working to create an incredible productive hearing on a topic that we all deeply are invested in. There seems to be a lot of work going on when it comes to expanding Internet access across the city of Boston.'",
        "'speaker_2': 'But a lot of this work seems to be happening in silos, and we need to step up to ensure that the work of connecting Boston is unified and intentional about reaching communities that are usually left out of the conversation.'",
        "'speaker_2': 'I also want to uplift something that the Human Rights Commission chair, Margaret McKenna brought up during the hearing. We already know what we know. We know that communities in Boston, particularly low income black and brown communities, lack access to reliable Internet services and simply by expanding Wi-Fi free and wicked free Wi-Fi isn't enough.'",
        "'speaker_2': 'We know why these communities are not connected. The question is, what are we as a city going to do about it? I look forward to working alongside Councilor Flynn and Bach to implement short term and long term solutions to ensure that everyone has a stable and reliable Internet connection as a right, not a privilege.'",
        "'speaker_2': 'And thank you again to my co-sponsors.'",
        "'speaker_1': 'Thank you very much, Councilor, here. The chair recognizes the district councilor for Beacon Hill, Councilor Kenzie BLOCK. The floor is yours.'",
        "'speaker_3': 'Thank you so much, Mr. President. And I want to also thank my co-sponsors, Councilor Flynn and me here on this. And I just wanted to underscore one thing that came up in the hearing, which is that I really think.'",
        "'speaker_3': 'We need to be careful. There's a lot of really good, well intentioned efforts to extend Internet access around the city. But when you drill down the quality of the Internet access that a lot of those low income and subsidized programs are providing is just not competitive with what people need for real educational and economic access.'",
        "'speaker_3': 'And so we're at risk of creating a city where even in the programs that we're extending and frankly, any emergency broadband benefit that the city that the federal government is subsidizing, where we're subsidizing and extending a real kind of second class, class service.'",
        "'speaker_3': 'And so, for example, right now, 75% of the city in theory, has access to fiber at their household. But only less than 2% of the Bostonians taking advantage of the emergency broadband benefit are getting it through fiber. And what that means is a situation where we're talking about low income Internet programs that might cap out at a'",
        "'speaker_3': '50 megabyte upload five download cap, whereas for folks who are paying for fiber are getting sorry, 50 megabytes versus a gigabyte, right, which is like a 20 x difference. So I just really want to stress because I think it's something that we're going to need to work on in the coming year.'",
        "'speaker_3': 'But the reason that we get into the conversation long term about municipal broadband and about extending fiber that is more under public control is because the only way you're actually going to shift it into being a utility as opposed to sort of an amenity that's and recognize it's essential ness to people's life is if we're investing in'",
        "'speaker_3': 'that really high quality product for everybody. So that was just something that alarmed me a bit that came out of the hearing. And I just really want to stress that I think it's going to be an area of council and administration need for action in the coming year.'",
        "'speaker_3': 'So thank you.'",
        "'speaker_1': 'Thank you very much, Councilor. Would anyone else wish to speak other than the three co-sponsors on this docket? Councilors Flynn, McKenna and Bach are asking the docket 0221 remain in the Committee on City and Neighborhood Services. And so it shall.'"
    ],
    "Petition for a Special Law re: An Act Relative to Reorganization of the Boston School Committee.": [
        "'speaker_1': 'Madam Clerk, would you now please read docket 0899?'",
        "'speaker_0': 'Thank you. Docket 0899 petition for a special law enacted relative to the reorganization of Boston School Committee.'",
        "'speaker_1': 'Like Madam Claude Cartier now recognizes the vice chair of the Committee on Government Operations and the At-Large Council from South Boston. Councilor Flaherty, the floor is yours. Thank you, Mr. President.'",
        "'speaker_4': 'We held a three hour hearing the other evening on docket zero 899, which is a formal petition seeking to change the structure of Boston School Committee from an appointed committee to a fully elected committee in three phases, ultimately resulting in a fully elected committee with 13 members, three at large seats, nine district seats that correspond with the'",
        "'speaker_4': 'electoral districts of the Boston City Council. And also the remaining seat will be for one voting student member of the elected Boston school student population. Through the Boston Student Advisory Committee, this petition also outlines the terms of the member's vacancy protocols and creates a nominating panel in respect of processes and timelines for nominations and vacancies until the'",
        "'speaker_4': 'committees become fully elected. During the hearing, we heard testimony from a number of panelists and members of the public. Testimony included discussions of the pros and cons of an elected school committee, the academic research behind the topic and discussion around the at large format versus the district format.'",
        "'speaker_4': 'With that said, as discussed during the hearing, this particular home law petition is substantive, will require additional hearings into a working sessions in the new council session with the newly elected body and mayor at this time asking that the matter remain in committee and also defer and ask the two co-sponsors if they would like to make any'",
        "'speaker_4': 'additional comments through the Chair. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Mr. Chair. The Councilors Arroyo and me here wish to. Cotterill, did you want to speak on this? She recognizes the district councilor from Hyde Park Council. The floor is yours.'",
        "'speaker_5': 'Thank you, Mr. Chair. I just want to thank Councilor Clarity for making sure that this hearing happened. I know we're close to the end of our legislative session, and it would not have been possible with Council 30, and I stepped up to ensure that we could have that hearing.'",
        "'speaker_5': 'I want to thank the advocates and the folks who contributed. And to my co-sponsor, councilor me here as well for her participation and efforts on behalf of this effort for school committee. Thank you, Ms.. Chair.'",
        "'speaker_1': 'Now to the chair now recognizes the other co-sponsor, Councilor McKee, and the floor is yours.'",
        "'speaker_2': 'Thank you again to my co-sponsor, Councilor Arroyo, and to Councilor Flaherty for his swift intentional action in making sure that we were able to pass this through. Yes. The other day, I mean, to all the amazing advocates who helped us get to this historic point, the yes on three coalition, Boston Education Equity Coalition that keep former elected'",
        "'speaker_2': 'school committee members and so many others. You all have helped to ensure that this hearing was not only productive, but it centered on community expertize. As I said during the hearing, we received a mandate from the people to return to an elected school committee in the city of Boston.'",
        "'speaker_2': 'There will be times in the future to discuss specifically how that would work, but in this hearing it was meant for us to focus on the why. Our panelists came from all different backgrounds, from parents to advocates to former elected school committee members to academics, and each brought their expertize and their passion to move us in the'",
        "'speaker_2': 'direction of an elected school committee. We'll be picking up this work in the New Year and look forward to collaborating alongside our new colleagues and the amazing advocates who got us here today. Thank you.'",
        "'speaker_1': 'Thank you very much. Counsel me here. Would anyone else wish to speak on docket zero 899? Seeing none. Docket 0899 will remain in the Committee on Government Operations. Madam Clerk, would you please read dockets 0192 and 0547 together?'",
        "'speaker_0': 'Thank you, Mr. President. Docket 0192 Message An order authorizing City of Boston to accept an expanded amount of $691,110 in the form of a grant for the COVID 19 response grant awarded by the Center for Tech and Civic Life to be administered by the election department.'"
    ],
    "On the message and order, referred on April 14, 2021 Docket 0547, authorizing the City of Boston to accept and expend reimbursements in the amount of up to Six Million Dollars($6,000,000.00), from the Federal Emergency Management Agency and the Commonwealth of Massachusetts, for expenses related to the COVID-19 event, the committee submitted a report recommending the order ought to pass.": [
        "'speaker_0': 'The grant funded planning and operating a safe and secure election administration in the city of Boston for the 2020 election. And docket number 0547 message in order authorizes the city of Boston to accept and expand reimbursements in the amount of up to $6 million from the Federal Emergency Management Agency and the Commonwealth of Massachusetts for expenses related'",
        "'speaker_0': 'to the COVID 19 event.'",
        "'speaker_1': 'Thank you. The chair recognizes Councilor Ricardo Arroyo, chair of the Committee and Public Health Council. Arroyo, the floor is yours.'",
        "'speaker_5': 'Thank you, Mr. Chair. These matters were sponsored by the administration, referred to the committee on January 27, 2021, for Docket 0192 and April 14th, 2021 for Docket 0547. The committee held a public hearing on these dockets on December seven, 2021.'",
        "'speaker_5': 'And I want to thank Councilors Flynn, Councilor, Bach, Councilor, in any sense IP, George and Councilor Murphy for participating in that hearing. These dockets, both of them go towards reimbursements. So this is money already spent. The committee public hearing was attended by James Williamson or Jim Williamson, Deputy Director of Budget of the Officer Budget Management and Anita'",
        "'speaker_5': 'Tavares was the commissioner of the Boston Elections Department who provided testimony on behalf of the administration. Commissioner Tavares stated that the City of Boston's Elections Department implemented many temporary measures in response to the COVID 19 epidemic. Measures such as expanding voter access and providing a safe voting process.'",
        "'speaker_5': 'The city was awarded this grant to provide funding for the cost of emergency personnel due to the expansion of mail in voting operations, which includes overtime costs and the costs of printing signage and informational fliers to spread awareness of early voting.'",
        "'speaker_5': 'The Commission stated that these funds have already been expended. Mr. Williamson stated that the city of Boston received a reimbursement of 6 million to cover the cost of the city of Boston's measures in response to the COVID 19 epidemic.'",
        "'speaker_5': 'This reimbursement is from FEMA or the Federal Emergency Management Agency, and it's administered through the Commonwealth of Massachusetts. This reimbursement will help support additional emergency food access, personal protective equipment, professional cleaning assistance, emergency sheltering, and administrative costs for emergency COVID 19 operations.'",
        "'speaker_5': 'In total, FEMA has reimbursed the city nine city of Boston 9.5 million, in addition to this 6 million reimbursement for COVID 19 related costs. The committee also discussed the possibility of continuing current mail in voting operations permanently and the prospects of receiving more grants and reimbursements from FEMA to cover emergency response costs in the future.'",
        "'speaker_5': 'As Chair of Committee on Public Health, I recommend moving the listed dockets from the Committee to the full Council for discussion and formal action. My recommendation to the full Council will be that the matters ought to pass.'",
        "'speaker_1': 'Thank you, Councilor Roy. The Chair recognizes the district councilor from Beacon Hill, Councilor Kenzie Bourque. The floor is yours.'",
        "'speaker_3': 'Thank you so much. Mr. President, I just wanted to add as an addendum, thank you to Councilor for chairing the hearing. I was pleased to be there. I, when I heard the numbers, was a little bit concerned that the the total of the ten that we had gotten before and the six that was coming in now from'",
        "'speaker_3': 'FEMA seemed low based on what's eligible and 100% numbers. So I did do some follow up, and I'm gratified to be able to share with the council that the Boston Public Health Commission, separately under the same FEMA program, has been authorized for $28.5 million of reimbursement.'",
        "'speaker_3': 'So when you put those two together, you're up more about 44, 45 million, which checks out better with kind of my sense of what we should be getting through this program. And it's worth the council knowing that now that it's been extended to April ten with the next wave of COVID challenges that we're dealing with, there likely'",
        "'speaker_3': 'will be further things that will be eligible for reimbursement. But I just because I did that homework, because I was I had some questions about it. I wanted to share with the whole council that the number of plus hours is more in the $4,445 million.'",
        "'speaker_1': 'Great. No, appreciate that. That's great context. Thank you, Councilor Buck. Any further discussion on dockets 0192 or 0547? Saying none. We are going to vote on these separately. So for docket 0192. All those that which is the $69,000 110 grant.'",
        "'speaker_1': 'All those in favor please indicate by saying I. I posed nine. The ayes have it. The docket is passed. And for docket zero 547, which is the $6 million grant. All those in favor please indicate by saying I oppose name.'",
        "'speaker_1': 'The ayes have it. The dockets have passed. Madam Clerk, would you now please read docket 0861.'",
        "'speaker_0': 'Docket 0861 order for a hearing to discuss predatory lending programs in the city of Boston.'"
    ],
    "Resolution Renouncing Nuclear Weapons Proliferation and Urging the United States to Pull \"Back from the Brink\" and Prevent Nuclear War.": [
        "'speaker_1': 'For all those in favor, please indicate by saying I am opposed. Nay, the ayes have it. The docket is adopted. Madam Clerk, would you now please read docket. One, two, four, five.'",
        "'speaker_0': 'Do I get? One, two, four, five? Council Britain offered the following resolution renouncing nuclear weapons. For proliferation in urging the United States to pull back from the brink and prevent nuclear war.'",
        "'speaker_1': 'The Chair recognizes the district councilor from Alston, Brighton, Councilor Liz Braid. And the floor is yours.'",
        "'speaker_6': 'Thank you, Mr. President. Mr. Chair. This resolution renouncing nuclear weapons proliferation and urging the United States to, uh, to, um, to pull back from the brink, um, and. And prevent nuclear war. This is a grassroots campaign called Back From the Brink to.'",
        "'speaker_6': 'And the call to Prevent Nuclear War and the International Campaign to Abolish Nuclear Weapons are calling for our federal government to make nuclear disarmament the centerpiece of our national security policy and join the global effort to prevent nuclear war.'",
        "'speaker_6': 'Um, I have a personal history in advocating for nuclear disarmament. As a young person in my in the 1980s I was involved with, uh, there was increasing nuclear tensions and the US deployed nuclear missiles to Greenham Common in England and they had this huge outpouring of sort of a resurgence of an anti-nuclear movement that had been sort'",
        "'speaker_6': 'of dormant almost since the, since the 1950s. Um, and one of the most memorable experiences I had was at a meeting in which someone had a, a bucket of. Ball bearings and each ball bearing represented a nuclear missile that existed that is equivalent to the bomb that was dropped in Hiroshima and the person.'",
        "'speaker_6': 'It was an interfaith gathering to talk to talk about nuclear disarmament. And the person slowly but dropped the bucket, just left the ball bearings, dropped out of the bucket into another bucket. And it seemed like an eternity, but there was thousands of ball bearings and each one equivalent to the nuclear bomb that dropped on Hiroshima.'",
        "'speaker_6': 'And it went on and on and on. And just as this huge number of nuclear weapons that don't actually make us any any safer. And in January of 2020, 1912, 2021, the United Nations and a the Treaty on the Prohibition of nuclear weapons, which finally classifies nuclear weapons in the same status as chemical weapons, biological weapons, landmines'",
        "'speaker_6': 'and cluster munitions, which are already prohibited by international treaty. The treaty currently has 56 ratifications and 86 signatures, but the United States is not not not yet a signatory. Back from the Brink started right here in Massachusetts in 2017.'",
        "'speaker_6': 'I was prompted to offer this resolution after being contacted by Dr. Ira Helfand of the Physicians of Social Responsibility and the International Physicians for the Prevention of Nuclear War. We also heard from Jack Tap Nick, a Boston law school senior and student organizer who has part of a student effort to circulate a petition collecting over 300 signatures'",
        "'speaker_6': 'from black students. And I have all of the signatories from the black students is here. They passed on the pass and the petition to pass the position on to our office and shared messages from students in our school in support.'",
        "'speaker_6': 'One Black students, Rachel Wong Trump said It is shocking that we, when we learned recently learned that the US has the power to inflict catastrophic damage on people and children just like us anywhere in the world. In one single moment, the US claims to be a leader among nations and to fulfill the responsibility of that title, we'",
        "'speaker_6': 'must lead the way in global nuclear disarmament. We should not have to worry about whether one misguided move by a temperamental president could spell certain doom for millions. We urge you to adopt this resolution and support nuclear disarmament.'",
        "'speaker_6': 'So the United States serves as a role model for peace and not aggression. I urge you to pass this resolution today. Thank you.'",
        "'speaker_1': 'Thank you. Cancer brain. And would anyone else wish to speak on docket? One, two, four, five. Would any councilors wish to add their name as a co-sponsor for docket 1245? Madam Clerk, please add. Councilor Arroyo. Councilor Baker. Councilor Bach.'",
        "'speaker_1': 'Councilor Campbell. Councilor Siby George. Councilor Flaherty. Councilor Flynn. Councilor me here. Councilor Murphy. Please add the chair's name as well. Councilor Liz Braden seeks suspension of the rules and adoption of docket 1245. All those in favor please indicate by saying I oppose name.'",
        "'speaker_1': 'The ayes have it. The docket has passed. Moving on to personnel orders, of which we have many. Madam Clerk, would you please read docket one, two, four, six.'"
    ],
    "Councilor Janey for Councilor Edwards offered the following: Order for the appointment of temporary employee Michael Bonetti, Yamina Lachmi-Benbokreta, Theresa Malionek, Ricardo Patron and Jesse Purvis in City Council effective December 18, 2021.": [
        "'speaker_0': 'Docket 1257. Council Agenda for Councilor Edward.'",
        "'speaker_1': 'Chair Suspension of the roles and passage of docket 1257. All those in favor please indicate by saying I oppose. Nay, the ayes have it. The docket has passed. Good job, everybody. We're now moving on to late file matters where there will be more in the personnel file.'",
        "'speaker_1': 'But before it we must allow it. Before that, we have to have a total of eight late file matters in absence. Letter from counselor Janie and absence that are from Counselor Edwards and then six personnel orders. So we are first taking a vote to add these items to the agenda, all those seven seven personnel.'",
        "'speaker_1': 'I apologize. So we have a total of nine, the two letters and then.'",
        "'speaker_0': 'Two letters.'",
        "'speaker_1': 'And then seven personnel.'",
        "'speaker_0': 'It's. Six seven.'",
        "'speaker_1': 'Okay. So everyone's clear on what we are doing right now, which is just voting to put these matters before us. All those in favor of adding these late files to the agenda, please indicate by saying I oppose nay, the ayes have it.'",
        "'speaker_1': 'The late file matters have been added. Madam Clerk, would you please read the First Lady file matter in and place it into the record?'",
        "'speaker_2': 'To the clerk.'"
    ]
}