{
    "On the message and order,referred on October 4, 2021, Docket #1036, Message and order authorizing the City of Boston to accept and expend the amount of Two Hundred Thirty Nine Thousand Two Hundred Fifty Four Dollars ($239,254.00) in the form of a grant, for the FY2020 DNA Capacity Enhancement and Backlog Reduction Program, awarded by the United States Department of Justice to be administered by the Police Department. The grant will fund two Criminalist positions, overtime, lab supplies, and continuing education expenses, the committee submitted a report recommending that the order ought to pass.\nThe report was accepted; the order was passed.": [
        "'speaker_1': 'nuclear or radiological materials that pose a threat to the Homeland Security and high risk urban area. Two Mr. Report recommending the order of two parts and docket number 1036 Committee on Public Safety and Criminal Justice, to which was referred on October 4th, 2021.'",
        "'speaker_1': 'Docket number 1036 message an order authorizing the city of Boston to accept and expanded an amount of $239,234 in the form of a grant for the FBI. 2020 DNA testing has been a backlog reduction program. What about the United States Department of Justice to be administered by the police department?'",
        "'speaker_1': 'The grant will fund two criminalist positions over time. Lab supplies and continuing education expenses submits a report. Recommending the order ought to pass.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you very much. How about a round of applause for our clerk?'",
        "'speaker_1': 'Oxygen.'",
        "'speaker_0': 'Please take take a break, please. So the chair will soon recognize Councilor Andre Campbell, chair of the Committee on Public Safety and Criminal Justice. She will be discussing all these dockets together and then we will obviously vote on them separately.'",
        "'speaker_0': 'So the chair now recognizes Chair Campbell, Chair of the Committee on Public Safety, Criminal Justice. Counselor Campbell, the floor is yours.'",
        "'speaker_3': 'Thank you, counsel. President. And thank you, Madam Clerk, because I often tell my team you're hired. Thank you very much. The committee heard from a number of members from the administration who gave the committee a breakdown, an overview of how these moneys would be spent.'",
        "'speaker_3': 'And we also submitted documents. The department also submitted documentation, which we forwarded, of course, to the council. And as a part of these dockets as well, we heard from Frank DeLuca, who is the program administrator at BPD, and also for why we heard from Roy Martin, who's the program director for SS, why at the Health Commission, we'",
        "'speaker_3': 'heard from Ali Boehler, who's a senior program manager for SS. Why at the Health Commission? Mark Scott, who's the Director of Division of Violence Prevention at the Health Commission. Christopher MacInnis, who's the Director of Quality Assurance and Operations Division of BPD.'",
        "'speaker_3': 'Anthony or Tony Rizzo, who's a program coordinator at BPD. Timothy Connolly, who's a DPD captain who spoke on one of the docket dockets. Kevin Laredo, who's the director of Quality Assurance and Forensic Division of CPD. And then lastly, Maria Cheevers, who runs the Department of Research and Development at PPD.'",
        "'speaker_3': 'And I want to thank all of them for coming and providing robust testimony for each docket. I will talk to them each separately and then, of course, take a vote on each. The first is docket 0850845. This is why I grand.'",
        "'speaker_3': 'We've received this grant for a number of years and this committee has actually done a lot of work to improve how the resources are given out, namely that there are a diverse array of organizations that receive it in community and also some of how they measure their work.'",
        "'speaker_3': 'I will say there's always, I think, ways to improve in which we measure our success, including for this grant. So the next council will have to sort of take this over, which I think is really important. This particular round, the funding went to those who work in occupational training and employment service.'",
        "'speaker_3': 'This includes more than words or I Strive project, right mission safe new beginning the Economic Development and Industrial Corporation of Boston Youth Options Unlimited. Boston Inner City Weightlifting Education Service, an education service provider at the Notre Dame Education Center, a behavioral health service provider and some of Bmc's work at the best program and in partnership with the'",
        "'speaker_3': 'Bay Calls Human Services. And what was great about this round of this is why I despite the severe disruptions with COVID 19 as is why I only met their service goals, they exceeded them. And this is a reminder that this grant is used to target those who are getting involved and those deemed to be and I put'",
        "'speaker_3': 'this in quotes, at risk and most at risk of involvement in violence. And so they write, they reached many folks. The initiative has a contract, has contact with nearly 3500 youth. It enrolled 122 young people out of its target of 300 in the midst of COVID.'",
        "'speaker_3': 'So clearly more work to do. But it exceeded its work this year compared to last. BPD is also in agreement with the Health Commission to actually partner as is why I, which hasn't been done in a long time usually to just the BPD.'",
        "'speaker_3': 'Now there's a partnership between the two which should be applauded. The next docket is 0954. This was a grant in the in the cost or in the amount of $4 million. This will fund course with enhanced 911 services.'",
        "'speaker_3': 'We heard lengthy testimony of how this will be used to maintain and upgrade the computer dispatch system and improve technology improvements, which is obviously critical and defray some of the costs for nine on one personnel. They always are looking for more resources here because that department, frankly, is overworked when you think about the number of calls.'",
        "'speaker_3': 'This grant is in partnership with docket 0956, which is in the amount of $399,000 or 399 $418.73, which funds the training and the certification of these 911 telecommunication staff members. And training topics include obviously communication. There's a CLE requirement for folks products and software enhancing the service itself.'",
        "'speaker_3': 'Administrative and public safety communications. The next docket was docket 1012. We heard a lot on this docket. And so I encourage folks, if they have not watch the video, they can. This is a year or two of a two year funding program called Securing the Cities.'",
        "'speaker_3': 'It is a regional approach to deal with and to detect and prevent terrorist attacks and other high consequence events which could utilize. Other radiological materials that pose a threat, obviously, to homeland security and particularly in urban areas. The funds would be used for a whole host of things, including backpack detention devices used in large crowds by various'",
        "'speaker_3': 'personnel, and also to cover some costs in the event that there are events that call for more staffing given the risk factors. I want to thank Tony in particular, who was brought on to manage this grant. We asked for a lot of transparency here.'",
        "'speaker_3': 'He provided a lot more than is normally required in hearings and some documentation which I want to applaud the department in particularly his efforts on. And then lastly, we have docket 1036. Pretty self-explanatory. This is an amount of $239,254.'",
        "'speaker_3': 'We've received this before. We can always use more. This helps the department deal with the DNA backlog and to reduce that backlog to also do more in terms of collecting and receiving data to track what the backlog is and to hire some more folks and in order to deal with it.'",
        "'speaker_3': 'And so this was a critical grant that the department is always looking for. It funds a couple of positions. It helps with lab supplies, which are really important as they're going through the backlog and continuing education expenses, which are required for certain positions within that department.'",
        "'speaker_3': 'So I want also thank the department for sending folks to testify on that at this time as the chair of the Committee on Public Safety and Criminal Justice seeking suspension and suspension passage of all of these dockets. Thank you.'",
        "'speaker_0': 'Thank you very much, Madam Chair, for that very thorough overview. Again, we will vote on these all individually, but we will do a voice vote. An individual can, of course, doubt the vote if they wish, but I don't think that will be necessary.'",
        "'speaker_0': 'So beginning with the first one. Councilor Andrea Campbell, chair of the Committee on Public Safety and Criminal Justice, seeks acceptance of the committee report and passage of Docket 0845. All those in favor please indicate by saying I oppose nay.'",
        "'speaker_0': 'The ayes have it. The order is passed. Chair Campbell seeks acceptance of the committee report and passage of Docket 0956. All those in favor say I nay oppose any way I have at the docket. As past Chair Campbell seeks acceptance of the committee report and passage of Docket 0954.'",
        "'speaker_0': 'All those in favor please indicate by saying I oppose nay. The ayes have it. The docket is passed. Chair Campbell seeks acceptance of the committee report and passage of docket 01012. All those in favor please indicate by saying I oppose.'",
        "'speaker_0': 'The ayes have it. The docket is passed. And finally, Chair Campbell seeks acceptance of the committee report and passage of Docket 1036. All of those in favor please indicate by saying I oppose. Nay, the ayes have it. The docket has passed.'",
        "'speaker_0': 'Thank you, Chair Campbell. Madam Clerk, would you now please read Docket 1010?'"
    ],
    "On the message and order, referred on September 29, 2021, Docket #1010 an order authorizing the City of Boston to apply for, and to accept and expend, the Federal Fiscal Year 2021 Continuum of Care grant funds from the U.S. Department of Housing and Urban Development in the amount not to exceed Forty Five Million Dollars ($45,000,000.00). These funds will be used to support programs that provide services and housing to persons experiencing homelessness, the committee submitted a report recommending the order ought to pass.\nThe report was accepted; the order was passed.": [
        "'speaker_1': 'Certainly. Docket 1010. The Committee on Housing and Community Development, to which is referred on September 29, 2021, docket number 1010 in order authorizing City of Boston to apply for and to accept and expand the federal fiscal year 2021 Continuum of care grant funds from the U.S. Department of Housing and Urban Development in the amount not to exceed'",
        "'speaker_1': '$45 million. These funds will be used to support programs to provide services and housing to persons experiencing homelessness. Submits a report recommending the order to pass.'",
        "'speaker_0': 'Thank you, Madam Clerk. The chair now recognizes Chair Lydia Edwards, chair of the Committee on Housing and Community Development. Councilor Edwards, the floor is yours.'",
        "'speaker_3': 'Thank you very much. I just wanted to first thank my, uh, my, um, vice chair of the, of the committee, Councilor Bach, who helped to hold this hold the ultimate hearing on this money that we've had many years and coming forward.'",
        "'speaker_3': 'And what the folks who attended included accounts not only Councilor Bach, but also Councilor Flynn, councilor here, and Councilor Braden. Leila Bernstein is a former colleague of mine who also works at the end in support of Housing Division and her work on homelessness and helping to eradicate veteran veterans homelessness.'",
        "'speaker_3': 'And also making sure that we have a comprehensive plan that is not only regional has been, I think, of an actual lead in the region for how to deal with homelessness. So her coming to testify, I know, was really important for us to hear how the money would be used, especially as we're getting additional funds in ARPA'",
        "'speaker_3': '. Ultimately, this is a grant again that we've received before and I just would love to. Ah, excuse me, I am recommending that this ought to pass, but I would prefer that my.'",
        "'speaker_2': 'Vice chair also added.'",
        "'speaker_3': 'Any additional details and and notes from the hearing.'",
        "'speaker_0': 'Thank you very much, Madam Chair. The Chair now recognizes the Vice Chair of the Committee on Housing Community Development. Vice Chair. The floor is yours.'",
        "'speaker_4': 'Thank you, Mr. President. And Madam Chair, we did have a great hearing, and I would just say. For the Council to understand. If you want any further details, there is a three page fact sheet on this continuum of care programs in the packet.'",
        "'speaker_4': 'As Councilor Edwards said, it's mainly a continuation of programs that we do right now, although within that 45, there is about $4 million worth of new funding, about half for domestic violence focused housing programs and and half for folks who are homeless.'",
        "'speaker_4': 'But I just really want to stress for people, because it's come up a lot in our public conversation, that these really are housing first. These are dollars from the federal government that are very focused on actually providing more housing opportunities to people.'",
        "'speaker_4': 'And they do come with a supportive service component of the funding, which is critical. We found a lot of times that what people need that low barrier housing first, they don't need housing only. Right? They need to get in and then they need the support.'",
        "'speaker_4': 'And I just would echo the chair's comments about how much work our our partner neighborhood development, that portion that well runs does on all of this. So I would just say, you know, we asked lots of questions. Councilor here, you know, raised some great points about the sort of people who don't get counted as officially homeless.'",
        "'speaker_4': 'Under HUD's definition, we're not really able to use these funds for. So, for instance, our young people who might be doubled up, but I think we've got some city focused funds focused on that and that. And I would just say that while it was very open to all the work that needs to be done ahead in this'",
        "'speaker_4': 'space. So it's a it's an important grant for us to authorize, even though there's lots more work needed and ongoing. So I would join the chair in a recommendation that we pass it today.'",
        "'speaker_0': 'Thank you very much. Chair Lydia Edwards and Vice Chair Kenzie Bach, Chair and Vice Chair of the Committee on Housing Community Development, seek acceptance of the Committee report and passage of Docket 1010. All those in favor please indicate by saying I am opposed.'",
        "'speaker_0': 'Nay, the ayes have it. The docket has passed. Moving right along, Madam Clerk, two matters recently heard for possible action.'"
    ],
    "Order for a hearing regarding reparations and their impact on the civil rights of Black Bostonians.": [
        "'speaker_1': 'Docket number 0734 councilor councilors Mejia and Balk offer the following order for a hearing regarding reparations and their impact on the civil rights of black Bostonians.'",
        "'speaker_0': 'Thank you, Madam Clerk. The chair now recognizes Chair Julian me here, who is the chair of the Committee on Civil Rights. Consider my hand. The floor is yours.'",
        "'speaker_2': 'Thank you, Mr. President. Yesterday, the Committee on Civil Rights held a hearing on docket 0734 order for a hearing regarding reparations and their impact on civil rights on black Bostonians. It was a marathon hearing spanning over three and a half hours.'",
        "'speaker_2': 'We were joined by we were joined by several council colleagues, including Councilor Bach, the co-sponsor of this hearing. In addition to counsel readings, Slim Flaherty Campbell and Representative Brandy Fluker, Oakley also joined us. We structured the hearing into several different panels, starting with an African Libation by Dr. Ben Mer and Atlantic knowledge from Jean-Luc Pigott.'",
        "'speaker_2': 'Our first panel, consisting of Dr. Ben Damir and Dr. Jamari, come on to discuss the history of slavery and reparations, both not nationwide and in Boston in particular. Our second panel featured a number of amazing advocates, including Imani White.'",
        "'speaker_2': 'Good night Robinson, Tammy Atai, Tanisha Sullivan, Dr. Attia Martin and Kevin Peterson. The covered subjects range from health and wellness, land in gentrification, education, arts and culture, economic empowerment and more. I want to uplift equal in particular from Armani, who said it's important to recognize that we came here as slaves, we got free and we were able'",
        "'speaker_2': 'to purchase land. But then that land was taken from us by a city government and used to create a way for business. I wanted to uplift that quote in particular because it drives home that this conversation is not just about slavery.'",
        "'speaker_2': 'It's about the repeated injustices in policy decisions that have been made specifically to disenfranchize and target black communities. Our third panel consisted of a more this thing summarized and detailed several reparation efforts across the country and across the world, and reminded us that any effort towards reparations reparations here in Boston needs to be guided by a sense'",
        "'speaker_2': 'of healing and love. We were also grateful to have been joined by the administration who were not only present but listened and learned and moved their schedules around so that they can stay and take part in the conversation.'",
        "'speaker_2': 'We were joined by Chief Lori Nelson, Chief Salena Barros Miller and Jessica Felipe. During the hearing, several advocates, both on the panel and from those who presented public testimony, voiced their support and urged the council to take up the cause of creating a commission to explore reparations.'",
        "'speaker_2': 'We will continue to work with advocates to determine the best course of action, implementing a reparations program and process here in the city of Boston. I want to close out by sharing a quote, a quote offered by Dr. Camara.'",
        "'speaker_2': 'The question is not what needs to be done. The fundamental. Issue is whether we have the political will at this time will be keeping this order in committee. And I also would like to thank Tunisia Sullivan for inspiring us in filing this hearing order and all of the folks who have been doing the work to get us'",
        "'speaker_2': 'here. Thank you.'",
        "'speaker_0': 'Thank you, Councilor Maguire. Did the co-sponsor wish to speak on this? I would just. Thank you. Thank you. The co-sponsor echoes the chair's report on that and docket 073 or anything else that we ought to speak on. Docket 0734 Seeing no takers.'"
    ],
    "On the Ordinance, referred on  April 28, 2021, Docket #0600, to Create a Task Force to Address Literacy Rates in the City of Boston, the committee submitted a report recommending the ordinance ought to pass in a new draft.": [
        "'speaker_0': 'Docket 0734 shall remain in the Committee on Civil Rights. Madam Clerk, would you now please read docket 0600?'",
        "'speaker_1': 'Certainly I could 0600 council zero off of the following wardens to create a task force to address literacy rates in the city of Boston.'",
        "'speaker_0': 'Thank you. The chair now recognizes the chair of the Committee on Governance Operations, Councilor Lydia Edwards. The floor is yours.'",
        "'speaker_2': 'Thank very much.'",
        "'speaker_3': 'I, I unfortunately could not chair this hearing. So I want to thank my vice chair, councilor at large, Michael Flaherty, for doing that. I do know that this is the conversation is to continue, however, and that the matter would stay in committee and work.'",
        "'speaker_3': 'We would have a working session to talk about the composition responsibilities of the task force. So now I'm going to turn it over to the vice chair and then, of course, the lead sponsor.'",
        "'speaker_0': 'Thank you, Madam Chair. The chair recognizes the vice chair of the Committee on Governance Operations, Counselor Michael and Vice Chair Michael Flaherty. The floor is yours.'",
        "'speaker_5': 'Thank you, Mr. President. This is a very important issue in our city. This will establish this ordinance will establish a literacy literacy task force to examine literacy rates. They will study the rates of literacy across Boston among adults and children, and also help develop a plan that will also put programs and policies in place to address literacy'",
        "'speaker_5': 'in the city. There's also a task force membership where non city Boston employees would be able to get a $100 stipend not to exceed a certain amount. And we had a great conversation with the administration and with the panelists that the lead sponsor had assembled.'",
        "'speaker_5': 'And questions remain. Of course, we put to put a series of questions in front of the administration. So we look forward to further discussion with the administration alongside our colleague and lead sponsor, Julie. Me here. Through. Through the chair to the lead sponsor.'",
        "'speaker_5': 'Sure.'",
        "'speaker_0': 'Thank you. Thank you, Mr. Vice Chair. Chair now recognizes the lead sponsor and the At-Large Council from Dorchester Council. Julie May here. The floor is yours.'",
        "'speaker_2': 'Thank you, Mr. President. And thank you to Council Clarity for chairing a great hearing. It was incredibly inspiring to be able to sit in a meeting with so many experts in their fields uniting around a common cause. Thank you to the advocates who made their voices heard Edith Bazile, Elizabeth Santiago, Lee Harlan, as well as members of'",
        "'speaker_2': 'the administration who came to offer their support, including during wind use of valley, Jennifer Viola Wang, Christine Duvalier. And we learned a lot about people. We learned a lot about we learned a lot about people who this ordinance was designed to help and how we can make our efforts even stronger.'",
        "'speaker_2': 'The first thing we learned is that this is a pathway to literacy is different for everyone. And while some people it may take a matter of months, for others it may be years before they are able to get on that path.'",
        "'speaker_2': 'This is why it's so important to ensure that one of the responsibilities of this task force is to find ways to make access to services easier for people who cannot read or write in any language. Because while people are learning to read and write, they also still need help with the services that our city provides.'",
        "'speaker_2': 'The second thing we learned is that people who are relying on these literacy services are coming from all back to all types of backgrounds in need services that are catered to their lived experiences. Some people are coming as doctors and lawyers from their homeland who can read and write in their native language but have very limited English'",
        "'speaker_2': 'proficiency. Other people have never learned to read or write, even in their native language, because of war, lack of funds, family obligations, physical abilities and more. We need services that cater to each of these groups that allow them to thrive.'",
        "'speaker_2': 'It seems like forming this task force will be the best way to ensure that we're coordinating and consolidating our services in the best way possible. And I also just want to take a quick moment to acknowledge that, you know, we talk a lot about the school to prison pipeline here in the city of Boston.'",
        "'speaker_2': 'And I think this is a key opportunity to really look into how a lot of our young people are struggling to read and write and showing up with social and emotional issues in class. And oftentimes they end up in d y.'",
        "'speaker_2': 'Yes. So if we can tackle the issue of literacy and get a handle of it, we might be able to address the school to prison pipeline. Then we also have our returning citizens who are coming back from incarceration and struggle with reading and writing and are unable to fill out a job application.'",
        "'speaker_2': 'So I think about those folks. It's a really serious about addressing the issues of violence and poverty. And this will be an opportunity for us to really look at some of the root causes of what some of our returning citizens are experiencing.'",
        "'speaker_2': 'And then we're thinking about those who are coming to this country and juggling to make their ends meet, who've come here with interrupted education and are struggling to read and write. So I see this task force as an opportunity to address a lot of the issues that we've been talking about here in the city of Boston, and'",
        "'speaker_2': 'do so in a way that's going to look at some of the root causes. So I'm really looking forward. Or to this conversation. And I'm looking forward to working alongside my partners here to move this as quickly as possible so that we can file this ordinance and get it passed through the council.'",
        "'speaker_2': 'Thank you very much.'"
    ],
    "Resolution Supporting H.1339/S.829 An Act to Guarantee Debt-Free Public Higher Education.\nOn motion of Councilor Mejia, the rules were suspended; the resolution was adopted.": [
        "'speaker_0': 'Thank you very much, councilman here. DUCAT 0600 shall remain in the Committee on Government Operations, but motions, orders and resolutions. Madam Clerk, would you please read Docket 1135?'",
        "'speaker_1': 'Serve me docket 1135. Councilor offered the following resolution supporting House Bill 1339 and Senate Bill 829, an act to guarantee debt free public higher education.'",
        "'speaker_0': 'Thank you, Madam Clerk. The chair now recognizes the At-Large Council from Dorchester Councilor Julian. Here, the floor is yours.'",
        "'speaker_2': 'All right. Today's my day was the last one. So thank you, Mr. President. Earlier this year, our body passed a resolution urging the Biden administration to cancel all student debt within their first 100 days in office. Sadly, as anyone burdened with the weight of student debt will tell you, that has not happened.'",
        "'speaker_2': 'However, thanks to thanks largely to the advocates of the community organizations and advocacy groups such as Zero Debt, Massachusetts and film efforts are underway in our State House to work towards addressing debt free public higher education. 8.1339.8.829. An Act to guarantee debt free public higher education submitted by Rep Higgins and Senator Eldridge is a systemic solution to'",
        "'speaker_2': 'the crisis of college unaffordability and student loan debt, which will guarantee tuition and fees free public college. It will also award additional cost of living, grant money to low income families to eliminate the need to borrow for housing, transportation, childcare, etc..'",
        "'speaker_2': 'This is an incredibly impactful legislation, especially since Boston is home to UMass Boston, the city's only public research university and the third most diverse campus in the United States. UMass Boston is also a school where students are being saddled with debt that impacts their daily lives.'",
        "'speaker_2': 'Having access to debt free school in Boston would be an amazing opportunity for students who want to go to college but are afraid of taking on a lifelong debt. For those reasons, I move that we suspend and pass the rules to pass this resolution.'",
        "'speaker_0': 'Thank you for asking me here. Would any other councilors wish to speak on Docket 1135? Would any councilors wish to add their name as a co-sponsor to Docket 1135? Madam Clerk, please add Councilors Arroyo, Baker, Balk Parade and Campbell Edwards aside be George Flaherty Flynn please add the chair.'",
        "'speaker_0': 'Please add Councilor Will and Councilor me here seek suspension of the rules and adoption of Docket 1135. All those in favor please indicate by saying I oppose nay, the ayes have it. The the docket is hereby adopted. The resolution is hereby adopted.'",
        "'speaker_0': 'Thank you very much. We're now moving on to late files and I am informed by the clerk that there is one late file matter which is a personnel order. All those in favor of adding the file matter to the agenda please indicate by saying I oppose.'",
        "'speaker_0': 'Nay, the ayes have it. Thank you. To file matter has been duly added to the agenda. And Madam Clerk, would you please read the late file matter into the record?'",
        "'speaker_1': 'Certainly. In the City Council. Oct 27, 2021. Councilor O'Malley for Councilor Edward.'"
    ]
}