{
    "Message and order authorizing the City of Boston to accept and expend the amount of Thirty Eight Thousand Eight Hundred Twenty Nine Dollars and Sixteen Cents ($38,829.16) in the form of a grant for the FY22 Firefighters Safety Equipment, awarded by the Massachusetts Department of Fire Services to be administered by the Fire Department. The grant will fund the purchase of rescue, safety and exercise equipment.": [
        "'speaker_1': '03770377 message on order authorizing the city of Boston to accept and expand the amount of $38,829.16 in the form of a grant for the fiscal year. 22 firefighters safety equipment awarded by the Massachusetts Department of Fire Services to be administered by the fire department.'",
        "'speaker_1': 'The grant will fund the purchase of rescue, safety and exercise equipment.'",
        "'speaker_0': 'Thank you, Mr. Clarke. The Chair recognizes Councilor Flaherty, Chair of the Committee on Public Safety, Criminal Justice Counsel, three of the floor. Thank you, Mr. President. Chair of the Committee on Public Safety in Criminal Justice asking to rise for to suspend the rules and past docket 0377.'",
        "'speaker_0': 'This grant small amount of 38,000 will fund the purchase and rescue safety and exercise improvement for our firefighters. Thank you. Thank you. Thank you. Counsel of Clarity. Counsel 30 moves for suspension of the Rules. Passage of docket 0377.'",
        "'speaker_0': 'All those in favor say aye. Aye. All opposed, say nay. The ayes have it. The docket is passed. Mr. Clerk, can you please read docket 0378.'"
    ],
    "Message and order to accept for the benefit of the City of Boston Police Department, a donation of Bicycle helmets from the Boston Police Foundation, valued at Fourteen Thousand Seven Hundred Thirty Two Dollars ($14,732.00) for the purpose of providing protective gear to the Boston Police Department.": [
        "'speaker_1': 'Stuck number 0378 message in order to accept for the benefit of the City of Boston Police Department, a donation of bicycle helmets from the Boston Police Foundation valued at $14,732 for the purpose of providing protective gear to the Boston Police Department.'",
        "'speaker_0': 'Thank you. The Chair recognizes Counsel of Clarity, Chair of the Committee on Public Safety, Criminal Justice Counsel. Farrelly You have the floor. The President. As Chair, I rise to ask that the rules be suspended to pass Star Code 0378.'",
        "'speaker_0': 'It is a message in order for 14,732 to provide helmets in much needed protective gear for our police officers, particularly for the bicycle unit. And I know we all know as district and at large councils how popular that division is in all of our neighborhoods.'",
        "'speaker_0': 'So if we can get these resources and these helmets out to these officers as the weather is changing, so we get to see these cyclists out in the neighborhood. Thank you, Mr. President. Thank you. Counsel Clarity. Counsel Clarity.'",
        "'speaker_0': 'Removed suspension of the rules. Passage of docket 0378. All those in favor say aye. Aye, aye. The ayes have it. The docket has passed reports of public officers and others. Mr. Clerk, please read docket 03790380 together.'",
        "'speaker_1': 'Docket number 037. A notice was received from the City Clerk in accordance with Chapter six of the ordinances of 1979 regarding action taken by the Mayor on papers acted upon by the City Council at its meeting of February 16th, 2022, and docking number 0380 notice was received from the City Clerk in accordance with Chapter six of the'"
    ],
    "On the order referred on February 9, 2022, Docket #0264, that the appropriate committee of the Boston City Council hold a working session to review applications for the Commission on Black Men and Boys, the committee submitted a report recommending that the order ought to pass.": [
        "'speaker_0': 'Thank you. 03790380 will be placed on file reports of committee. Mr. Clerk, please read docket 02640264.'",
        "'speaker_1': 'The Committee on Civil Rights and Immigrant Advancement, to which was referred on February 9th, 2022. Dr. Number 0264. Order that the appropriate committee of the Boston City Council hold a working session to review applications for the Commission on Black Men and Boys submits a report recommending that the order pass in the names of the 14 individuals listed'",
        "'speaker_1': 'in the report be submitted to Mayor.'",
        "'speaker_0': 'Thank you. The chip. That she recognizes council illusion. Chair of the Committee on Civil Rights and Immigration Council Lujan the chair of Committee. Council of Illusion. You have recognized.'",
        "'speaker_5': 'President. We're here to discuss docket 0 to 6 for the order to review applications for that commission on Black Men and Boys. Sponsored by Councilor Julian Mejia and Council President Ed Flynn. I was referred to the committee on February nine, 2022.'",
        "'speaker_5': 'I may, who is accepting 14 recommendations from the Boston City Council, of which seven will be approved and appointed to serve on the Commission on an ordinance creating the Commission on Black Men and Boys was initially codified last September.'",
        "'speaker_5': 'This year, the current ordinance was amended by adding provisions relating to executive director and defining the role of the Executive Director. And the Executive Director would be a member of the Commission ex-officio without additional compensation and would have a vote on a mat on matters before the Commission.'",
        "'speaker_5': 'In order to collaborate with the City Council, the mayor requested recommendations from us and will appoint seven members to the Commission from our 14 recommendations. And we establish an online application process where members of the public were encouraged to apply for to be one of the 14 nominees submitted to the Council.'",
        "'speaker_5': 'And the members of the Commission will serve a staggered two, three and four year terms. Councilors nominated two or three individuals when we held a hearing working session for consideration by the Mayor Council as we discussed the community involvement experience of the nominees.'",
        "'speaker_5': 'We also recognize the work of former District seven City Councilor Tito Jackson in getting this commission really off the ground, even when he was initially told no. He persisted on in council to express also support for our fellow city councilor colleague Brian Moore out to serve as a commission member.'",
        "'speaker_5': 'We emphasized the importance of participation and we also recognized that we wanted to ensure that members of the public had one of the 21 seats on the commission. And so it is our understanding that Brian Morrell, who had overwhelming support from city during the council process, will be included in the administration's selection process, which may also include'",
        "'speaker_5': 'being a member of the steering committee and being involved in other ways so as to ensure that members of the public will be able to have one of the seats and can be civically engaged in that way. So the passage of this order will prove the names of the following 14 individuals.'",
        "'speaker_5': 'A Submission to Mayor Woo. First Tito Jackson. Darrell Miller. James Hill. Dave Bazil. James Mackey. Jackson Killian. Justin Brown. Alex Edwards. Devin Morris. Curt Foulston. Kwame Edwards. Louis Elisa Ozark, Ohio. Ohio. Moby and Stephen Hinton. From these recommendations, Mary will appoint seven members to serve on the commission and submit this report, recommending that this order ought to'",
        "'speaker_5': 'pass. Thank you, Father Flynn.'",
        "'speaker_0': 'Thank you, counsel, again. Conclusion. The chair of the Committee on Civil Rights, Immigration of Advancement seeks acceptance of. The committee report named passage of docket 026 for. Before we do that I'd like to recognize council. Wirral Council. Well would you like to speak.'",
        "'speaker_0': 'Some of the. Okay. I apologize. I didn't see the identity on that. I do apologize. The light was not on, so I apologize it was.'",
        "'speaker_2': 'And then I turned it off because you went straight to the other side. So I figured I let you live a little bit, but I do appreciate you looking out for me. So thank you. So just want to say thank you to President Flynn and congratulations to council for sharing your first hearing and holding it down like'",
        "'speaker_2': 'she always does. I'm incredibly proud to be here today to vote in favor of the 14 black men that we have nominated to serve on the Commission for Black Men and Boys. Our nominees come from all different backgrounds sexual orientation, ages, lived experiences, and bring so much resources and life to this conversation.'",
        "'speaker_2': 'And while the mayor is slated to select seven of our 14 nominees, I think we can all agree that all 14 deserve to sit on the commission during the working session at all. We also came to the conclusion that our very own Councilor Morales is incredibly qualified to serve on the Commission, and we hope that the Mayor'",
        "'speaker_2': ', I will make room for him so that the voice of black men from the council can be heard as well. I look forward to working with the commission, the commissioners, once they are sworn in, so that we can continue to uplift the voices and the lived experiences in our spaces.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you, Councilman. Here at this time, the chair recognizes Councilor Bryant Wirral Council. You have the floor. Yes. Thank you, President Flynn. And thank you. Thank you, Councilor Louis, Jane and Carson here for your work and your leadership in establishing the Black Men and Boys Commission.'",
        "'speaker_0': 'And I just want to thank to all my colleagues for nominating me. I'm very honored and truly grateful to have the opportunity to serve on this historic commission here in the city of Boston that will advance black men and boys here in the city of Boston, and to ensure that our community are given the supports and to'",
        "'speaker_0': 'that they need to thrive. Thank you. Thank you, counsel. We're all. Would anyone else like to speak on this? Thank you. Counsel Evolution. Counsel Here. Thank you. Counsel Overall, and I'm so, so glad that Counsel World will play a key role on this commission.'",
        "'speaker_0': 'He has an incredible, important voice in this city. So thank you, counsel. We're all for the important work you do. Conclusion Chair of the Committee on Civil Rights Immigration Advancement seeks acceptance of the Committee report and passage of Docket 0264.'"
    ],
    "Petition for a Special Law re: An Act Granting the City of Boston the Authority to Provide Legal Voting Rights in Municipal Elections for City of Boston Residents Aged 16 and 17 Years Old.": [
        "'speaker_0': 'All those in favor say aye. Aye. All those opposed say nay. The ayes have it. Docket docket 0264 has passed. Matters recently heard for possible action. Mr.. Please read Docket 0185 Police.'",
        "'speaker_1': 'Numbers 0185 Petition for a special law relative to enact granting the City of Boston the authority to provide legal voting rights in municipal elections for the city of Boston. Residents age 16 and 17 years old.'",
        "'speaker_0': 'The Chair recognizes. Councilor Royal Chair of the Committee on Government Operations Council. Royal. You have the floor.'",
        "'speaker_6': 'Thank you, Mr. President. On Tuesday, March 14th, the committee held a hearing on docket 0185. This matter was introduced by councilors Maria and Councilor Bach. I want to thank the lead sponsors for introducing this matter and for my council colleagues that were able to join us Councilor Braden, Councilor Fernandez Anderson, Councilor Laura, Councilor Louise and Councilor Flynn'",
        "'speaker_6': ', Councilor Wirral and Councilor Flaherty. I also want to thank the Elections Department and our panel of advocates for their time and participation. This home rule petition would authorize the city of Boston to allow any individual age, 16 or 17 who was a resident of Boston to be able to vote as long as they are eligible under state'",
        "'speaker_6': 'law for other all other qualifications other than age. These individuals would be added to a separate list of voters to be established and maintained by the Board of Election Commissioners and be allowed to vote for local office and ballot questions.'",
        "'speaker_6': 'This would be done by having them fill out an alternative registration form. The Board of Elections would be responsible for associated costs. The petition would also grant the Board the authority to implement regulations associated with this Act. When the individual turns 18, they would be removed from the separate list and informed that they must register to vote'",
        "'speaker_6': 'in accordance with state law. During the hearing, we heard testimony from the Elections Department on the logistical details that would be needed to address the implement and implement this petition. Including restrictions around how information of 16 year olds would need to be safeguarded.'",
        "'speaker_6': 'The Elections Department also shared that since implementation of pre-registration for 16 and 17 year olds in 2020, the Department has processed a total of 3720 applications, showing that there is a high interest in electoral participation among those who have not yet turned 18.'",
        "'speaker_6': 'Both the administration and the advocates were able to speak to practices from other cities, states and countries that have implemented similar electoral policies, as well as the impact this legislation would have on expanding the electorate in Boston this time.'",
        "'speaker_6': 'This conversation serves as a good starting point for this home roll petition, and I look forward to more detailed conversations about the language in future working sessions. As Chair, I recommended, this matter ought to reign out to remain in committee.'",
        "'speaker_6': 'Thank you, Ms.. President.'",
        "'speaker_0': 'Thank you. Thank you, counsel. Roya, would anyone else like to speak on this matter that she recognizes? Councilman here. Councilman, here. You have the floor.'",
        "'speaker_2': 'I just wanted to thank the chair for hosting the hearing and also just want to uplift massage rare, who is one of the young one of the young people that participated in the hearing. She took some time from school to participate with us, which goes to show how important it is to ensure that we recognize that the'",
        "'speaker_2': 'reason why we're pushing for this is that young people want to be engaged, they are mature and understand what is at stake for them. They're the ones that are working, paying taxes, oftentimes working 2 to 3 jobs just to help support their families.'",
        "'speaker_2': 'So we need to do right by them and making sure that we support this effort. And I really want to thank my colleagues who participated and for their support around this initiative as well. So thank you so very much.'",
        "'speaker_0': 'Thank you constantly here. The chair recognizes council block. Council block. You have the floor.'",
        "'speaker_3': 'Thank you so much, Mr. President. I also want to thank the chair and councilwoman here and all our panelists who came and the councilors. I think that, you know, this is a docket where I think we've already heard a majority of councilors and support we heard support from the elections commission.'",
        "'speaker_3': 'We had really good, tangible feedback from the Elections Commission about what they would need to implement it most effectively. So I'm looking forward to the working session under the auspices of the Chair. But I just want to emphasize, you know, we we had a colleague from Scotland come and join the meeting virtually in Scotland.'",
        "'speaker_3': '16 and 17 year olds have been voting for almost a decade in their local elections. And and it's been a huge driver of youth participation. It has not upended the world, but it has allowed a lot of people to really get involved in democratic civic activism.'",
        "'speaker_3': 'And as was brought raised on the call, when we involve our young people, it also means involving a lot of our marginalized communities. It often drives things in a direction of economic justice. I mean, there's a lot of reasons why we want to make voices and immigrant families sometimes as the only thought that you might have access'",
        "'speaker_3': 'to for now. And so just really want to stress that we're looking forward to partnering with a chair and making this something that the council is able to support in the near term. So thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilor. BLOCK Anyone else like to speak on this matter? Docket 0185 will remain in committee. Docket 0291 has been withdrawn from the agenda now at this time. Mr. Kirby, please read docket 0312, please.'"
    ],
    "On the message and ordinance, referred on  March 2, 2022, Docket #0312, for your approval regarding targeted residential picketing, to protect the quality of residential life in our city,  the committee submitted a report recommending that the order ought to pass in a new draft.  Councilor Arroyo moved for substitution. Motion prevailed.": [
        "'speaker_1': 'Duncan Number 0312 message in order for your approval, an ordinance regarding targeted residential picketing to protect the quality of residential life in our city. Filed in the Office of the City Clerk on February 28, 2022.'",
        "'speaker_0': 'Thank you. The chair recognizes counsel. Royal Chair of the Committee on Government Operations Counsel. Royal. You have the floor.'",
        "'speaker_6': 'President. On Monday, March 13th, the committee held a hearing on docket 031 to an ordinance regarding residential picketing to protect the quality of residential life in our city. This matter was introduced by the mayor on March 2nd, 2022, and, according to council rules, must be acted upon by this body before May 2nd, 2022.'",
        "'speaker_6': 'I want to thank my council colleagues that were able to join us Councilor Murphy, Councilor Louie Jeon, Councilor Barker, Councilor Braden and Councilor Fernandez Anderson. Councilor Flaherty, Councilor me here, Councilor Flynn and Councilor Laura. I also want to thank Chief Miller for joining us from the administration.'",
        "'speaker_6': 'This ordinance would limit the ability of individuals to engage in targeted picketing between 9 p.m. and 9 a.m.. For this ordinance, targeted picketing means picketing, protesting or demonstrating directed towards a specific residents. This ordinance would work in addition to existing laws around excessive noise, disturbing the peace and blocking streets and sidewalks.'",
        "'speaker_6': 'Violation of the ordinance would result in a fine of $100 for the first offense, 200 for the second offense, and 300 for the third and any subsequent offense. The ordinance would be enforced by the Boston Police Department. During the hearing, the committee discussed.'",
        "'speaker_6': 'There we go.'",
        "'speaker_0': 'Excuse me. This is a warning. Next time you're going to be escorted out of the building.'",
        "'speaker_3': 'Well.'",
        "'speaker_0': 'Can we take a break briefly? So somebody's going to interrupt me. We're back in session.'",
        "'speaker_6': 'Thank you, Mr..'",
        "'speaker_0': 'Counselor Arroyo, you have the floor.'",
        "'speaker_6': 'Thank you. During the hearing, the committee discussed the legality of the ordinance and whether it would unreasonably restrict First Amendment rights. There was some discussion of including a sunset clause or more clearly defining which protest, demonstrations and picketing would be covered by this ordinance.'",
        "'speaker_6': 'Several councilors highlighted the fact that this ordinance was not introduced in a void, but rather in the context of hateful, extended attacks in the mayor's residential neighborhood. While the law department did send a letter discussing some high level legal aspects of the ordinance.'",
        "'speaker_6': 'They declined to attend the hearing, and the committee was not able to get further clarification on how the ordinance could be more narrowly tailored. Several councilors also inquired about the lack of enforcement of the city's existing noise ordinance and expressed concern over the addition of this ordinance instead of enforcement upon an existing law.'",
        "'speaker_6': 'The committee will be submitting requests for information to the administration, including an explanation from the police department about why existing noise ordinance has not been enforced. The total amount spent on police details for the demonstrations at the mayor's residence, the number of attorneys within the law department, their responsibilities and their salaries, as well as the amount of'",
        "'speaker_6': 'money spent on.'",
        "'speaker_0': 'Excuse me. That's a warning sign. Please do not disrupt. Please do not disrupt this this hearing. You have your right to your opinion not to disrupt. Please escort him out. Please, American. Let's take a quick, quick. Question.'",
        "'speaker_6': 'Thank you, Mr. President. The number of attorneys within the law department, their responsibilities and their salaries, as well as the amount of money spent on contracting outside legal counsel, whether a stay away order would be a more effective punitive measure rather than fines.'",
        "'speaker_6': 'This hearing has also included a large amount of public testimony. And as Chair, I would just like to correct some misinformation that may have been spread because of this hearing that COVID 19 virus is real. It's not a hoax.'",
        "'speaker_6': 'Vaccines are proved safe and an important way to prevent serious illness. And in addition, City Hall has been open to the public since last summer. I also want to thank our essential staff lady Candace and Christine, whose patients leading up to and throughout the hearing allowed it to go as smoothly as I believe it possibly could due'",
        "'speaker_6': 'to outstanding questions of counselors. I recommend that this matter ought to remain in committee for a working session so that we can hear from the police department and the law department on specific language adjustments that were discussed at the hearing.'",
        "'speaker_6': 'Thank you, Mr. President.'"
    ],
    "Order for a hearing to discuss the regulation and siting of cannabis establishments in the City of Boston and the Zoning Board of Appeals.": [
        "'speaker_0': 'Thank you, Counsel Royal. Would any other counselors like to speak on this? Dawkins 0312 will remain in committee motions, orders and resolutions. Mr. Clerk, please read DAWKINS 0381.'",
        "'speaker_1': 'Lucky number 0381 Councilor Edwards offered the following order for a hearing to discuss the regulation and siting of cannabis establishments in the city of Boston, Boston and the Zoning Board of Appeals.'",
        "'speaker_0': 'The chair recognizes Councilor Edwards. Councilor Edwards, you have the floor.'",
        "'speaker_3': 'Thank you very much, President Clinton. Just real quick, I also want to thank you for your leadership in this moment. And to my colleagues, I think you should be our president.'",
        "'speaker_4': 'A round of applause on this for.'",
        "'speaker_3': 'I think people forget part of the job of the president is not only to keep the meeting moving, but to protect the body and to make sure democracy is happening. So thank you so much. Thank you, Counselor Arroyo as well.'",
        "'speaker_3': 'So we're I want to give a quick history lesson because there's a lot of institutional knowledge about cannabis that needs to be brought into this moment and hopefully will be discussed as we discuss how it is going on in the city.'",
        "'speaker_3': 'As many of you know, in 2016, the city of Boston voted overwhelmingly to decriminalize and outright legalize cannabis, a part of the statewide initiative. The statewide initiative also required the creation of a state agency called the CCRC, the Cannabis Control Commission.'",
        "'speaker_3': 'And they have a specific mandate, a moral mandate to undo the harm of the war on drugs that allows for cities and towns also to opt in or opt out of having legalized marijuana, the sale of it, or cannabis, I should say, in their districts.'",
        "'speaker_3': 'But it also puts on them an obligation to also deal with the war on drugs and the harms caused by it. Moreover, when we're talking about from the state wide mandates, you are required every city and town to have at least 20% of the liquor licenses.'",
        "'speaker_3': 'You must have 20% of those in terms of cannabis establishments and licenses. So we have a quota to meet. We have a moral obligation to meet. We have also an industry to grow and to regulate in the city of Boston that the city of Boston overwhelmingly chose to be regulated and to grow here.'",
        "'speaker_3': 'Now, with all of that being said, there was a delay. Some people felt the prior administration had taken too long and even trying to establish a system to give out licenses, to give out host community agreements, which is basically the way in which we can contract with a dispensary to allow them to open.'",
        "'speaker_3': 'And they felt that there was due to the Baker administration and the Walsh administration seemed to oppose the legalization. There seemed to be the unclear understanding. But eventually we opened up the Office of Emerging Industries. I was there when that office opened, and I was there when that office seemed to, unfortunately, in an opaque way, pick which'",
        "'speaker_3': 'entities were able to have a say and which ones weren't. We also, when I want to give credit to my colleague, Councilor Flaherty, one point or to point out to point out to point out to point out he took it upon himself, which I do appreciate to say.'",
        "'speaker_3': 'Not only are we going to have this industry thrive, we're not going to let it be concentrated in any one community. And we have and the number is 52 establishments to have in the city of Boston. It will be spread everywhere.'",
        "'speaker_3': 'No one gets to say, not in my backyard because everyone voted for it. So as a result, we didn't want a green mile as well, where it's just that neighborhood to go to, to go get high or go get your stuff.'",
        "'speaker_3': 'As a result and half mile buffer zone was put into this regulation to separate them and to encourage diversity, geographic diversity. That is why it's put it. There is no other industry, no other vice in the city of Boston that has a buffer zone like that.'",
        "'speaker_3': 'We also required to site from distances from schools as well, I think 300 feet. That is part of other laws when it comes to liquor establishments and so on and so forth. Now, I do want you to know that your Office of Emergency Industry was called by this body, which is our number one role, which is to'",
        "'speaker_3': 'hold accountable and to demand answers. Counsel Janey at the time held a hearing specifically to ask what is going on and why are people getting their licenses? What are what are the points system you're even using? And why is it that this person got it and this person didn't?'",
        "'speaker_3': 'And is Boston we had a horrible problem or two where within the half mile buffer and one got the both got the HCA and then had to go to the ZBA. And that's where the problem is exists today.'",
        "'speaker_3': 'After all the back and forth and getting there, HCA was going to the A. The Zba then chose the corporate cannabis shop and gave them their gave them the the opportunity to open up. They were just they just happened to be in front of.'",
        "'speaker_3': 'The Iraq veteran, the Latino, the local person who I represent, they were physically in front of him in mind. That's it. He came up and said, Well, I would like to also open up one. And they said, Sorry, you're within a half mile buffer.'",
        "'speaker_3': 'They enforce it against him. They could have easily switch the order and favored the local veteran. They chose not to. And they had no guidance to do so. So since then I have been disgusted with the CPA and their role in any way, shape or form in the conversation when it comes to campus.'",
        "'speaker_3': 'And I use that word disgusted because that's exactly how I feel and that's what they've heard. Now Councilor Janey's leadership was immense ingredients in creating the BCB, the Boston Cannabis Board. We're for the first time. Folks like ourselves, regular people in Boston will be giving out licenses.'",
        "'speaker_3': 'These licenses are connected to the HCA. So now we have a cannabis port. This did not exist when the half mile buffer was introduced. Introduced? This did not exist when we legalized it. It existed three years later. And that board has grown immensely and has made the entire process very transparent.'",
        "'speaker_3': 'They have hearings. They require, for the first time, a district city councilor to be notified to write a letter of opposition, of support. All of these things happened in the public eye. They require a community meeting. All of these things before the person can even come in front of them.'",
        "'speaker_3': 'And they have to have security. They have to show that they're an equity applicant. And that was one of the best things and one of the lasting legacies of Councilor Janey. Former Mayor Janey is the equity, the one for one requirement so that corporations can come in and just take up all the good spots and take up'",
        "'speaker_3': 'all the cannabis areas. We have a one for one that only exists for the BCB. Equity applicants only exist with the BCB. The analysis of location only exists with the BCB. And we did that. We added that in there.'",
        "'speaker_3': 'We added in labor members, we added in people who are part of the neighborhood for the first time. We added in veterans as a protected class. We added an indigenous people. We this body. And the thing is we this body can only add and amend the BCB, those standards, those individuals who sit there.'",
        "'speaker_3': 'That's where our power lies and we are able to adjust with the BCB as this industry will adjust because we're going to have on site consumption at some point, we're going to have restaurants at some point and we need to be able to regulate them.'",
        "'speaker_3': 'That's why I'm further disgusted by the. Because we cannot regulate them. I have a home rule petition right now that's been waiting two years to even add an urban planner to the Zba. You see, they are now able to say no to an industry that's moving like this to a board that's moving like this.'",
        "'speaker_3': 'It's moving faster than them with different standards in them, with equity obligations that they do not have, are not trained and don't know what they're talking about. Asking about race. Asking about equity applicants to only cannabis establishments. They don't ask about the color or the racial demographics of the developers who come before them.'",
        "'speaker_3': 'Trust and believe. It's nowhere near as diverse. They don't ask about it. They're not trained in it yet. They play around. And what happens is we end up being the last step for a bunch of people, in some cases NIMBYs who just don't want cannabis in their.'",
        "'speaker_3': 'So they pile on piling and just get the zba to say no to them. There's no standard, by the way, for their half mile when they choose to enforce it or not, it shows. Today there are six people, six entities that have been given a license by the BCB.'",
        "'speaker_3': 'Half of them are equity applicants, people of color, and they were told no by the zba. They're stuck in this horrible situation. When we had the hearing about the original and I introduced a zoning amendment to remove the Zba.'",
        "'speaker_3': 'When they came forward, one of the applicants owner appraisers said, If I didn't have to go to the zba, I would have saved $40,000. I wasted time and money. That's what we're doing to an emerging industry that's supposed to actually be repairing the harm on black and brown individuals who were harmed by the war on drugs.'",
        "'speaker_3': 'We continue that harm by BIA bureaucratic mess that we allow to continue to happen. So. Last year, I introduced the zoning amendment. It did go to the zoning commission. During that conversation, Councilor Bork and I, which we disagreed on, they brought on the broadness of my amendment.'",
        "'speaker_3': 'We disagreed, but we believe we came to it. I think a narrowly tailored compromise. I hope that Councilor Brock will come to the hearing on this to talk about that narrowly tailored compromise. As a district city councilor, I am sympathetic with her situation in that she represents predominantly the downtown neighborhoods where there might be an oversaturation of'",
        "'speaker_3': 'a lot of industries, including cannabis. So I know that's a lot, but I like half the council wasn't here when all this happened, so I wanted you to know why this is so important. We have this conversation. We are talking about real money and the tens of millions of the hundreds of millions of dollars.'",
        "'speaker_3': 'We are talking about an obligation, a moral one, to make sure that money flows equally, equitably into the hands of people who are formerly incarcerated and to people who are veterans, who are indigenous, who are black, who have grown up in communities that have been over overpoliced.'",
        "'speaker_3': 'All of that is in our hands. And by the way, if we separate the zba, it's solely in this body's hands. That's the kind of control and the movement and also the empowerment that we need to have. The CBA has nobody on there that deals with public safety.'",
        "'speaker_3': 'They do not have somebody on that list dealing with economic equity. We put them on the books. They don't deal with public health. They're not dealing with addiction specialists. All of them are on the licensing board right now.'",
        "'speaker_3': 'We have the expertize. We have the people in the movement. I'm just asking that you separate the two. But and by the way, I'm sure by now you've already heard enough complaints about the CBA and the administration of the laws they already have.'",
        "'speaker_3': 'Why are we letting them do this? So apologize for the length of time. It just felt it was very necessary that you understood my passion in this. My neighborhood was the one that got screwed over the most. In this back and forth and half mile and so on and so forth.'",
        "'speaker_3': 'We now have four cannabis establishment in East Boston, half of whom are equity applicants. I'm proud of that. So I'm not against the industry. I'm also not looking to promote it. I just want us to be the best government we can when we're dealing with these deep injuries.'",
        "'speaker_3': 'The best way we can do that is remove the CBD. Thank you.'",
        "'speaker_0': 'Thank you. Councilor Edwards, is anyone else looking to speak on this matter? The chair recognizes council for every council authority of the floor. Thank you, Mr. President. And thank you to the previous speaker as the original sponsor of the half mile buffer and as the former chair of government operations who worked closely on the ordinance that created'",
        "'speaker_0': 'the Boxing Against Sport. I'm happy to have this discussion. Please add my name. And it was actually a great recap of things that have happened to date. So as a reference to the spirit of the intent to the buffer zone was to ensure cannabis facilities were sited equitably throughout the city.'",
        "'speaker_0': 'Unfortunately, our CBA has approved a few buffer zone conflicts and they've denied others exposing the city to potential legal action and causing additional lack of predictability and fairness for residents first and foremost, as well as for the business owners who are out there trying to make commitments, signing leases, getting securing investors, trying to navigate the lengthy permitting'",
        "'speaker_0': 'process to site a fully legal business. With that said, I think it's also important to note that that we as a city were familiar with the Zoning Board of Appeals process. Our residents, our civic groups understand how to engage in that process that takes place every week in this building.'",
        "'speaker_0': 'On the second, on the upstairs on Tuesdays. The state law that legalized marijuana also allows for municipalities to control the time, place and manner of cannabis establishments. And that does not need to be done through local zoning. So we do have a cannabis board and we could empower them to make these decisions at the end of the'",
        "'speaker_0': 'day. For me, it's about predictability of process. It's about fairness and it's about upholding the half mile buffer zone. That's it. That's in the zoning code. And it can't be about who you know and who you hire. And this meeting in that meeting.'",
        "'speaker_0': 'We have a half mile buffer zone that was supported by this body, that was supported overwhelmingly by residents across the city who asked us to do that. And so I'm looking forward to a public discussion about this. Let's get the civic associations and the community groups.'",
        "'speaker_0': 'Let them get them in. I know that when we talked about this the last time, there was concern, because that's the process. They know. They know the zoning board of Appeals process. They know that they deal with the Office of Neighborhood Services.'",
        "'speaker_0': 'They work with District and At-Large Council is on our staff. Maybe it was sort of a new sort of process for them, but we need to bring them in so that they understand that the cannabis board that we have up and running, that they can be empowered to make these decisions if these aren't local zoning decision.'",
        "'speaker_0': 'But at the end of the day, again, predictability, process, fairness and upholding the half mile buffer is key to this entire equation. Thank you. I look forward to the hearing. Thank you. Counsel clarity. The chair recognizes counsel by our counsel blocking of the floor.'",
        "'speaker_3': 'Thank you so much, Mr. President. Thank you, Counselor Edwards, for both reintroducing the conversation and for that summary to everyone. And I think that we you know, one of the things that Counselor Edwards mentioned in passing, but I just want to underscore is that I think this council passed last year in ordinance a number of changes to'",
        "'speaker_3': 'the BCB in order to address, as Councilor Flaherty was saying, the question of whether the ECB itself was considering location in the buffer zone because part of what was happening was that there was a sense that the buffer zone question was sort of being punted to the zba and that therefore if we took the Zba out of'",
        "'speaker_3': 'the process, we'd be taking out that factor altogether. And so Councilor Edwards her with her leadership, we passed something that put more expertize in zoning and more focus on location into the PCB side of the equation and also raised the standard for a buffer zone exemption that the BCB was weighing.'",
        "'speaker_3': 'And I and I want to give credit to the cannabis board. I think we've seen them reflect those changes. We've seen them because that was another question is will they do it? But but we've seen them kind of process those.'",
        "'speaker_3': 'I think that the remaining thing that we have to navigate and it's going to be the topic of further conversation, is just that. Aside from the concern downtown about concentration, we have both in my district and I know in a number of colleagues districts and these like neighborhood business subdistricts where a lot of uses are all on'",
        "'speaker_3': 'top of each other. And one of the ways historically that we figured out how to deal with the fact that like five different people are getting deliveries for their businesses, all to one corner is that we basically use the Zba process as a way to be like, where are you storing your trash and what are you doing'",
        "'speaker_3': 'with deliveries and stuff? And so one of the, one of the concerns that arose on in my district was okay, but that level of granular detail isn't really what the PCB is talking about. But if someone's going to open a stationary store in this subdistrict, they're going to need to talk about this with their neighbors.'",
        "'speaker_3': 'And we don't want it to be that a marijuana store doesn't have to talk about those things with their neighbors. So that's sort of that's the kind of operational challenge that we're dealing with in the subdistricts. But I think, as Councilor Edward said, that we sort of move towards a a narrowly tailored solution to that problem, that'",
        "'speaker_3': 'looking forward to discussing it further. So thank you, Mr. President.'",
        "'speaker_0': 'Thank you, counsel. BLOCK And adding your name, Counsel. BAUCUS The chair recognizes counsel of our counsel. Are you on the floor?'",
        "'speaker_3': 'Thank you, President Flynn. And thank you to Councilor Edwards for for offering this hearing order. I just wanted to speak in support of reviewing the process of how we approve cannabis stores in our neighborhoods. But I also wanted to caution us to maybe use a wider lens when we're looking at it.'",
        "'speaker_3': 'I know of at least two instances when the Boston Cannabis Board has approved two locations within the same half mile, and then the ZBA has had to make a decision on which one they were going to approve in the neighborhood.'",
        "'speaker_3': 'One of those instances is outside of my district. One instance is Curry is currently excuse me currently live in Jamaica Plain where the cannabis board approved one corporation, one equity applicant. And now the CBA is left to make a decision about who goes there.'",
        "'speaker_3': 'And the other instance, it was in a different neighborhood. The Zba made the choice to obviously leave and the equity participant. And so I say that to say that I would like us to really look at the entire process, find the inflection points on where we can make changes to make sure that it's streamlined.'",
        "'speaker_3': 'And also, I am supportive. I'm not supportive of the CBA in any way, shape or form, but also thinking about how we remove remove bureaucracy without zoning in on only one issue when we've also seen similar decisions come out of the Boston Cannabis Board.'",
        "'speaker_3': 'So I really look forward to having this discussion. I just want to ask to my colleagues to widen the conversation, to look at the entire process and how it could be more equitable versus just looking into the CBA.'",
        "'speaker_0': 'Thank you, Counsel. Borough Council. We're adding your name?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Anyone else like to speak on this matter? Would anyone else? Would anyone like to add their name? Please raise your hand. Please add Counselor Arroyo. Counselor Counselor Braedon. Counselor Fernandez Andersen. Counsel. Florida Counsel. Laura Constitution. Counselor here. Counsel Murphy.'"
    ],
    "Order for a hearing on the importance of census and demographic data and the consequences of an undercount. Remains in the Committee on City Services and Innovation Technology.": [
        "'speaker_0': 'Counsel. Relevant. Please add the chair. Dark 0381 will be referred to the Committee on Planning, Development, Transportation. Mr. Clerk, please read Docket 03820382.'",
        "'speaker_1': 'Councilor Breeden offered the following order for a hearing on the importance of census and demographic data in the consequences of an undercount.'",
        "'speaker_0': 'The chair recognizes counsel Brett and counsel Brett. And you have the floor.'",
        "'speaker_7': 'Thank you, Mr. President. This is a hearing order on an important on the importance of the census and demographics and demographic data and the consequences of an undercount as policymakers in municipal government. We like to say that we make data driven decisions, but we all know that the 2020 census was considered significantly underfunded, highly politicized by a'",
        "'speaker_7': 'former president, and was conducted in the midst of a pandemic and as a result of seriously undercounting black and brown communities across the country and certainly here in Boston, in addition to the 40% decline in Alston Bryant's group for this population.'",
        "'speaker_7': 'So in January of 2626, the council already voted to adopt docket numbers 0203 in order for the city to submit a count. Question Resolution Operate operation the formal and legitimate process for government units to challenge our census results.'",
        "'speaker_7': 'So however, I say this hearing order to discuss the importance of census and demographic data beyond just the decennial census years and explore how we can better integrate demographic data as metrics and indicators across all aspects of city work and programs.'",
        "'speaker_7': 'All of this data is essential to guiding our decision making and planning for the future. The important work of population estimates, projections and demographic interpretations happens every year and every day. As we know, the election department conducts an annual residential listing, which is what some decision making is based on.'",
        "'speaker_7': 'However, there are additional annual programs in the sense of programs of the Census Bureau, which would significantly impact Boston over the next decade. If we do not connect correct the inaccuracies of the 2020 Census. The Census Bureau conducts an annual population estimates program, a program collecting, using, collected, using population basis, which will be determined by the results'",
        "'speaker_7': 'of the 2020 census and takes into account population changed and change, including deaths, births and migration. The city of Boston has a record of successfully disputing estimates in the count in 2005, 2006 to 37 22,014, with the city's official population estimates been revised with increases between 5000 to over 35,000 residents at a time.'",
        "'speaker_7': 'Any change? Just want to state that any any changes are in correction of the numbers will not influence our discussions regarding redistricting or representing within the city. There is also the Census Bureau's housing unit estimates, which also uses the 20 census 2020 census population based on factors the Boston's reported building permits and new residential construction.'",
        "'speaker_7': 'So really, in essence, I anticipate that this hearing would be an opportunity for us to discuss the ramifications of the 2020 Census undercount and how it impacts all of our city departments. Revise updates for the Cities for our cities, challenge to the count and hear from our city departments, current practices and from demographers and policy experts on'",
        "'speaker_7': 'how to use the demographics and demographic data to inform our policymaking on city programs in general. So. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Counselor Braden. Would anyone else like to speak on this matter? Would anyone else. The chair recognizes Constitution and Constitution. You have the floor.'",
        "'speaker_5': 'As an Flynn, I just rise to say, to add my name and to say that I support this hearing order. We know that with undercount, it's really affect immigrant populations oftentimes who are afraid to answer census questions, especially under this past administration.'",
        "'speaker_5': 'We know that it affects transient folks, those who are under house, black and brown folks, and that this undercounting is directly tied to federal funding. Right. Seeing, seeing and realizing a decrease in funding at that level. And so I 100% support this hearing order so that we can get our numbers right, so that we can get the'",
        "'speaker_5': 'funding that we deserve, our neighborhoods, and for our black and brown and immigrant communities. Thank you.'",
        "'speaker_0': 'Thank you, counsel. Illusion. Would anyone else like to speak on this matter? I also wanted to I also wanted to state that during the census count, there was a lot of tremendous work from various neighborhood and civic groups, including the Chinese Progressive Association, the Council Square Tenants Association, the NAACP in Boston.'",
        "'speaker_0': 'And this during this count, the census count. It happened during the pandemic. And a lot of the a lot of my constituents weren't answering their door by their phone, especially in the AAPI community here in Boston. So I just want to say thank you to the Council of Great and the important work that you're doing on this'",
        "'speaker_0': 'on this issue. Would anyone else like to? Would anyone like to add their name? Please raise your hand. Please add Councilor Arroyo. Councilor Bach. Councilor Edwards. Councilor Fernandez Anderson. Council. Borough Council. Lucerne Councilmember here council. Murphy Council. We're all please other chair docket 0381 will be referred to the committee.'",
        "'speaker_0': 'I'm sorry. Yeah. Docket zero three will be referred to the Committee on City Services and Innovation Technology. Mr. Clerk, please read Docket 0383.'"
    ],
    "Councilor Flynn for Councilor Edwards offered the following: Order for the appointment of temporary employee Gerardo A. Fabrizio in City Council.": [
        "'speaker_0': 'To Murphy, the Chair Seek suspension of the rolls passage of docket 0388. All those in favor say I oppose. Same day the ayes have it docket has passed. Mr. Clerk, please read docket 0389.'",
        "'speaker_1': 'Duncan 0389 Counsel appealing for counsel.'",
        "'speaker_0': 'Edwards seek suspension of the rules passage of docket 0389 All those in favor say aye. Opposed say Navy. Ayes have it. The dog has passed. We're on to lead files. I'm informed by the court that there are three files.'",
        "'speaker_0': 'One is a letter of absence from Counsel Baker. The second one is a hearing order from Counsel Fernandez Anderson. The third is a resolution from Counsel Brady. The file should be on everyone's desk. We will take a vote to add these items to the agenda.'",
        "'speaker_0': 'All of those in favor of hearing the late file matters to the agenda say I oppose. Same day. The ayes have it. Thank you. The late file matters have been added to the agenda. The First Lady file matters.'",
        "'speaker_0': 'A letter of absence from counsel. Baker Mr. Clerk, if you can read the letter into the record.'",
        "'speaker_1': 'March 16th, 2022. Correspondence from City Councilor Frank Baker. Dear President Flynn, please be advised that I will not be in attendance at the Boston City Council meeting on Wednesday, March 16, 2022. Please ask the clerk to please ask that the clerk read this matter into the record.'"
    ]
}