{
    "Message and order authorizing the City of Boston to accept and expend the amount of Forty Four Thousand Six Hundred Forty Seven Dollars ($44,647.00) in the form of a grant, for the FY20 CARES Act Supplemental Operating Funds, awarded by the United States Department of Housing & Urban Development, passed through the Boston Housing Authority, to be administered by the Office of Food Access. The grant will fund food box preparation and delivery services to eight BHA housing sites.": [
        "'speaker_3': 'Docket 0959. Message in order authorizing city of Boston to accept an expanded amount excuse me of $44,647 in the form of a grant for the FBI 20 CARES Act supplemental operating funds awarded by the United States Department of Housing and Urban Development passed through the Boston Housing Authority to be administered by the Office of Food Access.'",
        "'speaker_3': 'The grant will fund food preparation and delivery services to eight housing sites.'",
        "'speaker_0': 'Thank you. Madam Clerk, the chair now recognizes Councilor Michael Flaherty, chair of the Committee on Boston's COVID 19 Recovery Chair. Flaherty, the floor is yours. Thank you, Mr. President.'",
        "'speaker_4': 'I would like to move for suspension rules and passage. This is a $44,647 grant for the Fiscal Year 20 CARES Act Supplemental Operating Funds. The grant funding will be used to support the work of the Office of Food Access.'",
        "'speaker_4': 'The grant will fund food preparation and delivery services to eight sites. The grant was awarded to us by the United States Department of Housing and Urban Development that passed through the VHA in their administered by the Office of Food Access as Chair of COVID 19 Recovery Committee.'",
        "'speaker_4': 'I'd like to suspend and pass these funds so they can be used expeditiously for those that are in dire need of food access. So appreciate everyone's willingness to move a suspension passage.'",
        "'speaker_0': 'Thank you, Mr. President. Thank you, Michael. Counselor Michael Flaherty, chair of Boston's COVID 19 Recovery Committee six. Suspension of the rules and passage of docket 0959. All those in favor please indicate by saying I oppose nay. The ayes have it.'"
    ],
    "Message and order authorizing the City of Boston to accept and expend the amount of Thirty Two Thousand Five Hundred Dollars ($32,500.00) in the form of a grant for a Policy Fellowship, awarded by the University of Massachusetts to be administered by the Office of Equity. The grant will fund a research fellow who will assist in tracking a diverse portfolio of policy issues, and benchmarking policy trends nationally.": [
        "'speaker_0': 'The docket has passed. Moving right along, Madam Clerk, to docket 0960.0960.'",
        "'speaker_3': 'Message an order authorizing the city of Boston to accept and spend an amount of $32,500 in the form of a grant for a Policy Fellowship Award by the University of Massachusetts to be administered by the Office of Equity.'",
        "'speaker_3': 'The grant will fund Research Fellow who will assist in tracking a diverse portfolio of policy issues and benchmarking policy trends nationally.'",
        "'speaker_0': 'Thank you, Madam Clerk. The chair now recognizes Councilor Anissa SIBY George, Chair of the Committee on Education. Chair Siby George, the floor is yours.'",
        "'speaker_2': 'Thank you very much. Mr. President, as you can see in this docket. It is for $32,500. It's a grant. It will fund this particular fellowship program. I request that we suspend and pass this docket.'",
        "'speaker_0': 'Thank you very much. Concerned Isa. So be George, chair of the Committee on Education. Seek suspension of the rules and passage of docket 0960. All those in favor please indicate by saying I oppose name. The ayes have it.'",
        "'speaker_0': 'Docket 0960 has passed. Madam Clerk, up next is docket 0961.'",
        "'speaker_3': 'Docket 0961 message, an order authorizing the city of Boston to accept and expend an amount of $1,000 in the form of a grant for the Youth Poet Laureate program awarded by donor groups to be administered by the arts and culture.'"
    ],
    "On the message and order referred on April 14, 2021, Docket #0549, authorizing the City of Boston to accept and expend the amount of Two Million Fifty-One Thousand Nine Hundred Three Dollars ($2,051,903.00) in the form of a grant for the Boston Cultural Fund, awarded by the Boston Redevelopment Authority to be administered by the Office of Arts and Culture. The grant will fund cultural spaces, organizations, programs, artists, and activities in the South End, with the goal of preserving and enhancing cultural activity, the committee submitted a report recommending the order ought to pass.\nThe report was accepted the order was passed.": [
        "'speaker_0': 'Thank you. Docket 0965 will be placed on file reports of committees. Madam Clerk, would you please read docket 0549?'",
        "'speaker_3': 'Ducats 0549 The Committee on Arts, Culture, Tourism and Special Events, to which is referred on April 14th, 2021. Docket number 0549. In order authorizing the City of Boston to accept and expand the amount of $2,051,903 in the form of a grant for the Boston Cultural Fund, awarded by the Boston Redevelopment Authority to be administered by the Office'",
        "'speaker_3': 'of Arts and Culture. The grant will fund cultural spaces, organizations, programs, artists and activities in the South End, with the goal of preserving and enhancing cultural activity. Submits a report recommending the committee report back to pass.'",
        "'speaker_0': 'Thank you. The Chair now recognizes Councilor Frank Baker, Chair of the Committee on Arts, Culture, Tourism and Special Events. Councilor Baker. The floor is yours.'",
        "'speaker_1': 'Thank you. Mr. President. A hearing was held on Thursday, September 9th, on docket 0549, and a message authorizing City of Boston to accept and expand the amount of $2,051,903. The matter was sponsored by Mayor Kim Janey and referred to the committee on April 14th, 2021.'",
        "'speaker_1': 'Chief Cara Elliott Ortega and Director, Director of Policy and Planning for the Mayor's Office was there, and the DIA Ferr, director of Administration Finance from the Office of Arts and Culture, was there and gave the committee an update on the arts and cultural programs in the city.'",
        "'speaker_1': 'Overview of how these funds will be used. These funds are the result of a zoning code which requires the creation and support of affordable spaces for quality, art and cultural uses. So listen up district councils. The code also has a provision for contribution in lieu of providing a physical space to which this is here.'",
        "'speaker_1': 'Chief Ortega explained the BDA is expected to receive a certain contribution of funds generated as a result of the Section 29 of Article 64 of the Boston Zoning Code. Projects proposed within planned developing areas in the south and neighborhood district of Boston that incorporates nonresidential uses are required to provide affordable cultural spaces as defined in Section 64'",
        "'speaker_1': 'Dash 21.2 of the code under under Section 29 B and C. A proposed project may provide a portion of affordable cultural space as a contribution equivalent to 5% of the total gross floor area allocated to nonresidential uses and to any and all proposed projects within an approved plan.'",
        "'speaker_1': 'Develop the area above that allowed as of right in the underlying zoning sub district. In layman's term, 5% of this project was a 10,000 square foot space, of which 4000 will be on site and the other 2 million will be able to stay with the project.'",
        "'speaker_1': 'So we can do the groups can do programing and art uses and spaces in there in the surrounding area. So I view it as a good thing. The grant will fund cultural spaces, organizations, programs, artists and activities in the South End with the goal of preserving and enhancing cultural activities.'",
        "'speaker_1': 'As Chair of the Committee on Arts, Culture, Tourism and Special Events, I recommend moving the listed docket from the Committee to the full City Council for discussion and formal action. At this time, my recommendation is to. Passed Docket 0549.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Thank you, Mr. President. Thank you, Mr. Chair.'",
        "'speaker_1': 'Counselor Roundhill.'",
        "'speaker_0': 'Counselor Baker, chair of the Committee on Arts, Culture, Tourism and Special Events, seeks acceptance of the Committee report and passage of Docket 0549. Seeing no further discussion. All those in favor please indicate by saying I oppose nay. The ayes have it.'"
    ],
    "On the communication referred on February 24, 2021, Docket #0353, was received from Eneida Tavares, Chair, of the Board of Election, for your approval a citizen petition entitled \"Petition for Eversource Substation East Boston\", the committee submitted a report recommending the petition ought to pass in a new draft.\nThe report was accepted; the petition was passed in a new draft.": [
        "'speaker_0': 'The docket has passed. Madam Clerk, would you now please read docket 0353?'",
        "'speaker_3': 'I could 0353 The Committee on Government Operations, to which is referred on February 24, 2021, docket number 0353. Communication was received from Anita to virus chair of the Boss, the Board of Elections for your approval. A Citizens Petition.'",
        "'speaker_3': 'Untitled petition for Eversource substation in East Boston submitted a report recommending that the petition ought to pass in a new draft.'",
        "'speaker_0': 'Thank you, Madam Clerk. The chair now recognizes Councilor Lydia Edwards, chair of the Committee on Government Operations, as well as the District Council from East Boston. Chair Edwards, the floor is yours.'",
        "'speaker_2': 'Thank you very much. It is about a nonbinding question that will be placed before the voters if we vote on it today as a body. This docket was actually created by ten people in East Boston who came forward and presented the question properly before the Elections Department.'",
        "'speaker_2': 'At Elections Department then had us have a hearing on it. And I conducted the hearing with a question at the time that read, Excuse me, trying to find the question. Do you support relocating an Eversource electric substation now proposed at 400 Condor St East Boston away from nearby homes, parks and flood risk in East Boston to an'",
        "'speaker_2': 'alternate secure location such as within Logan Airport. Now, ultimately, after the hearing, we decided that the question was a little bit confusing in a lot of conditions. So the hearing then produced an amended question which reads as follows, which I hope that my colleagues will vote to allow for the people of Boston to consider should a high'",
        "'speaker_2': 'voltage electric substation be built at 400 Condor Street in East Boston along the Chelsea Creek near homes, parks, playgrounds, jet fuel storage and a flood risk area rather than an alternate safe nearby location such as a nonresidential Massport land at Logan Airport.'",
        "'speaker_2': 'We took Eversource out of it and really wanted to go to the concept for whether this should be located in any neighborhood so that the city of Boston can decide and make a moral statement as to whether we should be building that kind of infrastructure in those kinds of locations.'",
        "'speaker_2': 'So ultimately, I'm suggesting or asking that my colleagues vote, that this question be approved in the amended version and it would be placed on the ballot for November 2nd. For the people of Boston to do in a non-binding way vote as to whether this is infrastructure that they would like to see continuing in the city of Boston'",
        "'speaker_0': '. Thank you very much. Councilor Eldridge, chair of the Committee on Government Operations, seeks acceptance of the committee report and passage of Docket 0353 in a new draft. All those in favor, please indicate by saying I oppose nay. The ayes have it.'",
        "'speaker_0': 'The docket is has been passed. Congratulations, Councilor Edwards. Madam Clerk, would you now please read docket 0481?'"
    ],
    "On the message and ordinance referred on March 31, 2021, Docket #0481, Amending the City of Boston Code, Section 5-5.20, Paid Parental Leave for City of Boston Employees, the committee submitted a report recommending that the ordinance ought to pass.\nThe report was accepted; the ordinance was passed.": [
        "'speaker_3': 'Docket 0481, the Committee on Government Operations, to which is referred on March 31st, 2021. Docket number 0481. Ordinance Amending the City of Boston Code Section five. Dash 5.20. Paid parental leave for the City of Boston employees submit a report recommending that the order ought to pass.'",
        "'speaker_0': 'Thank you. The chair now recognizes Councilor Lydia Edwards, chair of the Committee on Government Operations. Chair Edwards, you have the floor.'",
        "'speaker_2': 'First, I want to thank my co-sponsors, Counselor Michelle Wu and counselor Anita Sobhy George, for their support and upgrading our parental leave policies. This upgrade is essentially a for loss of pregnancy to be part of the reasons that any potential parent can also request leave from the city of Boston.'",
        "'speaker_2': 'It is a suggestion of compassion. It is a suggestion of acknowledging that many people on this path have encountered difficulties, and it's an acknowledgment in modernizing our parental leave laws. Now, we had a robust hearing about this when we realized many of the regulations that support this also need to be updated, that the language is entirely gendered'",
        "'speaker_2': '. It's also oftentimes based off on whether you're married to your partner. And those things are all we found to be no longer relevant and not really reflective of the diversity of the parents that we have in the city of Boston.'",
        "'speaker_2': 'So we did make several suggestions to the Human Rights Commission excuse me, to the H.R. department of the city of Boston. But today is about the specific language on the ordinance, and there are some changes, including loss of pregnancy as a reason, and also upgrading it to the 12 weeks, making it consistent with what the administration had'",
        "'speaker_2': 'already done. I also want to thank you, Councilor O'Malley, and help me and my vision in my heart to be open up to the impact on a lot of our male parents who are impacted by also loss of pregnancy.'",
        "'speaker_2': 'I think your testimony was by far one of the most powerful that day, along, of course, with counselors Abby, George and counselor shows and us and also Councilor Julie me here in talking about their pathways to becoming parents and why this is so necessary to be open to all pathways and all forms of parenting.'",
        "'speaker_2': 'So I hope that you will my colleagues will vote to pass this amendment. And that is that is all. Thank you. And that's my co-sponsor, 70.'",
        "'speaker_0': 'Thank you. Thank you, Chair Edwards. So no further discussion on docket 0481. Councilor Lydia Edwards in concert with counselor Michelle Will. In Concert Necessity, George seeks acceptance of the committee report and passage of Docket 0481. All those in favor please indicate by saying I oppose nay.'"
    ],
    "On the ordinance referred on June 16, 2021, Docket #0773, ordinance creating a Commission on Black Men and Boys, the committee submitted a report recommending the ordinance ought to pass in a new draft.\nThe report was accepted; the ordinance was passed in a new draft.": [
        "'speaker_0': 'The ayes have it. The docket has passed. Congratulations, Madam Clerk, would you now please read docket 0773 Docket 0773.'",
        "'speaker_3': 'The Committee on Government Operations, to which is referred on June 16th, 2021. Docket number 0773. An ordinance creating a commission on Black Men and boys submits a report recommending the order ordinance ought to pass in a new draft.'",
        "'speaker_0': 'Thank you. The chair again recognizes Councilor Lydia Edwards, who is the chair of the Committee on Government Operations. Chair Edwards, the floor is yours.'",
        "'speaker_2': 'Thank you very much. I want to thank the lead sponsor of this commission councilor at large jewelry here for her leadership and pushing to make sure this conversation happened. As we know, this body voted for this commission in 20.'",
        "'speaker_2': '14. And pass this already. And so a counselor making a did and listening to the community. She upgraded this commission and made sure that we had a working session and a hearing or actually just a working session specifically on the language.'",
        "'speaker_2': 'There were some amendments looking at the organization and duties as well, and also making sure that LGBTQ members were involved in the commission and also recognized as their own pathway as part of the black men and the Commission on Black Men and Boys.'",
        "'speaker_2': 'It's very exciting to see us again, to create history and to push this forward, to make sure that the vital conversations about how the city moves in any community, but especially when dealing with black men and boys, is at the table front and center.'",
        "'speaker_2': 'So I am moving for this amended version to be. Passed by the committee or by my colleagues and of the IT sponsor has any comments.'",
        "'speaker_0': 'Thank you. Councilor Edwards, the chair now recognizes the At-Large Council from Dorchester Councilor McGee. And the floor is yours.'",
        "'speaker_5': 'Thank you, Mr. President. And thank you to counsel Edwards for chairing our hearing on this ordinance and, more importantly, for the commitment of moving it along as quickly as you did. So thank you for that. The work to create a commission on black men and boys in Boston started seven years ago.'",
        "'speaker_5': 'I'm in for context. It predates predated President Obama's My Brother's Keeper initiative. It passed the council in 2014 unanimously before being vetoed by Mayor Walsh. But the need for this commission has not gone away since it's been vetoed.'",
        "'speaker_5': 'Back in in 2014. Since then, we have continued to see disproportionately impacts of black men and boys in all sectors, from education to health and wellness to economic empowerment to violence. The need for this commission never went away, and neither did the advocates who have been pushing for this.'",
        "'speaker_5': 'Pointless. Tito Jackson Councilor. Former Councilor. Tito Jackson. Ron Bell. Thaddeus Miles. Corey Thomas. Canaan Harris. James Macmillan. Bishop DICKERSON. Matthew Parker. Lee Mays. Jason Boyd. Just to name a few, you will all have paved the way for this moment.'",
        "'speaker_5': 'And on behalf of the Boston City Council, I thank you for your commitment to this project and making space for our black men and boys. I want to say I want to talk a little bit about the process and how we got here, because it's always paved in lots of zigzags.'",
        "'speaker_5': 'In June of this year, we introduced this ordinance after seven years of no council action. Here we are three months later and we are prepared to pass it today. It looks like we meet the moment and answer the call to action.'",
        "'speaker_5': 'We all rise to that occasion. This ordinance is essentially the same thing that the council passed in 2014 with only a few key changes. First, we made revisions based on Mayor Walsh's veto back in 2014 to ensure that this ordinance is in compliance with our city charter.'",
        "'speaker_5': 'Second, we have given the Commission the ability to hold community conversations on topics that impact black men and boys. We spoke with the community and came to the agreement that this ordinance is doing everything possible to impact change on behalf of black men and boys in the city.'",
        "'speaker_5': 'We have the opportunity to make history. This ordinance matters because black men and boys matter. We have an obligation to step into the space and let people in and create space for people to step into their power. And let those as our colleague, a congresswoman.'",
        "'speaker_5': 'Now, Ayanna Pressley, says the people closest to the pain should be the people closest to the power. Thank you again to the advocates for getting us to this point. And I urge my colleagues to vote in favor of this ordinance today.'",
        "'speaker_0': 'Thank you, Councilor. Any further discussion on docket 0773? Seeing None. Counselor Lydia Edwards as chair of the Committee of Government Operations, as well as Counselor Julie McCarthy is the lead sponsor. Seek acceptance of this committee report and passage of docket 0773 in a new draft passage.'"
    ],
    "On the Communication referred on August 18, 2021, Docket #0896, was received from Eneida Tavares, Chair, of the Board of Election, for your approval a citizen petition entitled \"An Elected Boston School Committee\" for the placement of a local nonbinding public opinion advisory question on the ballot of the next regular municipal election on November 2, 2021, submits a report recommending that the petition ought to pass.\nThe report was accepted; the petition was passed.": [
        "'speaker_0': 'In a new draft. All those in favor please indicate by saying I oppose nay. The ayes have it. The docket is passed. Congratulations. Madam Clerk, would you now please read docket 0896 Docket 0896.'",
        "'speaker_3': 'Issues to which is referred on August 18, 2021. Docket number 0896 Communication was received from Anita Tavares, Chair of the Board of Elections, for your approval, a citizen's petition entitled and elected Boston School Committee for the placement of a local non-binding public opinion advisory question on the ballot of the next regular municipal election on November 2nd, 2021'",
        "'speaker_3': ', submits a report recommending the petition to pass.'",
        "'speaker_0': 'Thank you, Madam Clerk. The chair now recognizes Chair Lydia Edwards, Chair of the Committee on Government Operations. Councilor Edwards, the floor is yours.'",
        "'speaker_2': 'Thank you very much. The committee had an excellent hearing about this specific question. This would be a non-binding question put to the people of Boston again in November to essentially ask their thoughts or their opinions, if you will, about whether we should have an elected school committee.'",
        "'speaker_2': 'The question reads as follows Should the current appointed school committee structure be changed to a school committee elected by the residents of Boston? I want to thank the residents of Boston who actually brought this to our attention and for their reason, many of whom are here today.'",
        "'speaker_2': 'We are having this vote now. They came forward. They did the citizen petition and then properly filed that with the elections department. The Election Elections Department certified them as properly before our body. We had a hearing and discuss this as well.'",
        "'speaker_2': 'During that hearing, I could say honestly, majority of our colleagues supported at least allowing the people of Boston to have an opinion about that about this topic. So I also want to thank Councilor Ricardo Arroyo also. I believe he has been part of this movement and has a whole petition that will also we'll be discussing later on'",
        "'speaker_2': 'this year. So and of course, I want to thank the election department. I just want to give a shout out to them. I know a lot of people had been concerned about results and so on and so forth.'",
        "'speaker_2': 'I want to acknowledge they're the hardest working department, especially now. And as while we have a lot of cameras on them and a lot of pressure on them, I do want to acknowledge and I think they deserve a round of applause for all the work that they are doing for us.'",
        "'speaker_2': 'Including quickly turning around these ballot questions. We will now have three ballot questions on the November 1st. Excuse me. Oh, sorry about that. Sorry. On the November 2nd election. This one is binding as a charter amendment. We have now after your vote, the East Boston substation.'",
        "'speaker_2': 'And if you vote for this, we will have the elected school committee question as well. I recommend you vote. Thank you.'",
        "'speaker_0': 'Thank you. Chair Edwards, any further discussion on Docket 0896? The chair recognizes the district council from Hyde Park Council. Arroyo, the floor is yours.'",
        "'speaker_1': 'Thank you. And I just want to acknowledge again, the Elections Department certainly has had a long night and they've had many, with course, in the last couple of years. So their work but also some of the folks who were behind making this happen are here today.'",
        "'speaker_1': 'And so I wanted to thank them for taking this monumental step. The question about what we do with our Boston Public Schools as Boston School Committee specifically has been a question since the right to elect our members was taken.'",
        "'speaker_1': 'And to see that put to a vote to the citizens and the residents of Boston is going to be a.'",
        "'speaker_0': 'Big deal to get an.'",
        "'speaker_1': 'Idea of where and what they'd like to see the future of their schools be. I think we're now nearing almost 20 years of this is more than enough time for the city to have a real analysis or a frank opinion on where how we should move forward.'",
        "'speaker_1': 'And so as this moves forward, I just want the city and the residents to know that that home rule petition that has been placed before this body is a template is something that will be fed by both the members of this this council, but also informed by what voters decide to do and how they add their voice'",
        "'speaker_1': 'to this. And again, thank you to the Council for passing this. And thank you well, hopefully for hopefully passing this and to the residents of Boston who took it upon themselves to bring this moment forward.'",
        "'speaker_0': 'So thank you. Thank you. Council royal chair now recognizes the At-Large council from Dorchester Councilor Julian. Me here.'",
        "'speaker_5': 'Okay, Mr. President. And I also would just kind of like I echo Councilor Royal's point in terms of how important it is to really seize this moment, to acknowledge the power of the people and really what it looks like when we are led by those who are living the realities and doing the work.'",
        "'speaker_5': 'So I just really want to like emphasize and underscore the importance of really honoring who it is that we're here to work for and on behalf of and doing so in ways that. Encourages us to. Sometimes it's important for us to step to the side and others others lead.'",
        "'speaker_5': 'And so that is what these residents are doing, is holding us to task to that work and so incredibly grateful for their leadership in this space. And I'm looking forward to a favorable response and a yes vote so that we can let the people do the people's work.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilor. The chair now recognizes the At-Large Council from Dorchester Councilor side B George. The floor is yours.'",
        "'speaker_2': 'Thank you very much, Mr. President. And I do want to just say very clearly first that although I do not support an elected Boston school committee, I think that this is a really important referendum and it's, of course, non-binding.'",
        "'speaker_2': 'So it creates an added level of community discussion, of public discussion around this very specific question. So I look forward to participating in this opportunity to discuss the governance structure of the Boston School Committee in greater detail with the public.'",
        "'speaker_2': 'I look forward to its helpful passage today because I think it's an important question to put before the people of Boston. And I'm just grateful to the lawmakers for this effort, certainly the leadership of our city's residents who have put this before us and the work of the chair.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you very much, Councilor. So be George. Any further discussion on docket 0896? Seeing Noncancer Lydia Edwards, chair of the Committee on Governance Operations, seeks acceptance of the committee report and passage of Docket 0896. All those in favor please indicate by saying I am opposed.'"
    ],
    "Ordinance Amending City of Boston Code, Ordinances, Chapter VII, Sections 7-2.1 and 7-2.2, Building Energy Reporting and Disclosure (BERDO).": [
        "'speaker_0': 'Nay. The ayes have it. The docket has passed. Now, moving on to matters recently heard for possible action. Madam Clerk, would you please read docket 0775?'",
        "'speaker_3': 'Certainly. Docket 0775. Councilor O'Malley offered the following ordinance amending the City of Boston Code Ordinance, Chapter seven, Section seven, Dash 2.1 and seven. Dash 2.2. Building Energy Reporting and Disclosure of Virgo.'",
        "'speaker_0': 'Thank you. Madam Clerk recognizes the Chair of the Committee on Government Operations, Councilor Lydia Edwards. The floor is yours.'",
        "'speaker_2': 'Thank you very much. I think I'm going to be turning it over shortly to you. But I do want to just quickly give a quick summary of the actions we've taken so far. We had a very successful, robust hearing on this, and we had two working sessions thus far.'",
        "'speaker_2': 'The first working session went literally line by line to essentially pull, I think, any leftover questions or acknowledge any changes that had happened. I do want to thank Alison Brazil and of course, the chair of Environment and Open Space, Councilor O'Malley, for your incredible leadership and preparation for 21 page ordinance to come through and have.'",
        "'speaker_2': 'And I think one of the best conversations we've had about how we're going to essentially provide for a future for our children. The Bourdeaux legislation essentially is about building emissions reduction and assuring that as we build, we're building for an actual future we can all live in.'",
        "'speaker_2': 'And so I wanted to thank again and also Chief Mariama White Hammond, program manager Hannah Payne, and as I mentioned, Commissioner Alison Bridges, who were from the administration. I want to thank all the all of my colleagues who I think at one point either attended the hearing or one of the working sessions to make sure that we'",
        "'speaker_2': 'were steadfast in our commitment to make sure that the Met Bureau 2.0, as is called, will happen this year. So I at this point, I'm going to ask that the matter stay in committee per the request of the lead sponsor and make sure that we finish the conversations and any leftover ideas concerns and make sure that we'",
        "'speaker_2': 'have the consensus that we need to pass this as soon as as the lead sponsor is ready. I turn it over to you now. Not formally.'",
        "'speaker_0': 'Thank you, Madam Chair. Perfectly said. We'll be calling this for a vote in relatively short order, but did want to appreciate your incredible partnership on this. This is something that will be one of the most impactful things we can do as a body, and I'm really excited about it.'",
        "'speaker_0': 'So thank you for that talk in 0775 shall remain in the Committee on Government Operations. Now, moving on to motions, orders and resolutions. Madam Clerk, could you please read docket 0966?'",
        "'speaker_3': 'Certainly. Docket 0966 Council of our call for the following order for a hearing to discuss city protocols for providing public records.'"
    ],
    "On the order, referred on September 15, 2021, Docket 30967, regarding the Civilian Review Board Nomination, the committee submitted a report recommending that the enclosed nine names appointment to Civilian Review Board.": [
        "'speaker_2': 'Madam Clerk, would you please read docket 0967?'",
        "'speaker_3': 'Certainly. Docket 0967 Council male councilors O'Malley and Campbell are for the following order regarding civilian review board nominations.'",
        "'speaker_2': 'Councilor O'Malley, you have the floor.'",
        "'speaker_0': 'Thank you very much, Madam Chair. On July 21st of this year, Councilor Andre Campbell and I announced the procedure for our civilian review board nominations. As you know, we pass this incredible work from Chair Campbell, as well as Councilors Arroyo and Mekere.'",
        "'speaker_0': 'And the mechanism begins with the council, president of the council itself submitting nominations to the mayor. So working in concert with the chair of the Committee on Public Safety, Criminal Justice, I think we've done as good a process as imaginable.'",
        "'speaker_0': 'We've created a portal where we are seeking applications that the end date is September 20th, which is this upcoming Monday, and we have a few more days until then. So please share with your networks the link to the application portal, which can be found on our website, Boston.com City Council.'",
        "'speaker_0': 'Purpose of this order is to hold a working session to review the application. Applications thus far received of which we will then be submitting our nominations to the acting mayor. The mayor will appoint three members to the Civilian Review Board from a pool of nine nominees who are submitted by us.'",
        "'speaker_0': 'These nominees will each serve a term of three years, provided, however, that of the members first appointed, three shall be appointed for a term of one year. Three shall be appointed to a term of two years, and three shall be appointed to a term of three years.'",
        "'speaker_0': 'We've made available a paper copy of the application portal and have translated the application into Chinese, Cape Verde and Creole, Haitian Creole, Spanish and Vietnamese. I want to thank again the incredible work of the Chair, as well as Councilors Arroyo and Mejia, for their great partnership on this.'",
        "'speaker_0': 'And I look forward to getting more applications in the next couple of days and then having a transparent and open process. Thank you very much, Madam Chair.'",
        "'speaker_2': 'Do. But the chair now recognizes it. I'll be brief. Thank you, council President, for your leadership on this and again and get this application out. It is a beautiful thing. It's a public process. It's incredible to thank you for your leadership.'",
        "'speaker_2': 'Thank you. Is there anyone else who would like to speak on the matter? All right. Docket 0967 will be referred to the Committee on Public Safety and Criminal Justice.'",
        "'speaker_0': 'Madam Chair, maybe councilors who wish to add their name.'",
        "'speaker_2': 'Oh, I'm sorry. Sorry. Any councilors who wish to have their name added to the docket. I see. Counselor Arroyo. Counselor Baker, Counselor Braden. Councilors Abby. George Custer Flaherty. Councilor Flynn. Councilor Macchia and Councilor Wu and Councilor Edwards. Thank you.'",
        "'speaker_2': 'Yeah. Yeah.'",
        "'speaker_0': 'Thank you, Councilor Edwards. And we referred that, I believe, to public safety. Um, moving right along, Madam Carr, could you please rate Duckett.'",
        "'speaker_3': '0968.0968 Councilors Arroyo and Mejia offer the following resolution recognizing September 15th through October 15 as Hispanic Heritage Month in the city of Boston.'"
    ]
}