{
    "Rezones property located at 151, 155, 165, 171, and 175 South Harrison Street from PUD 625 to PUD 637 under Former Chapter 59, located in Council District 10. (NEIGHBORHOODS AND PLANNING) Rezones property located at 151, 155, 165, 171, and 175 South Harrison Street from PUD 625 to PUD 637 under Former Chapter 59, located in Council District 10. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on  9-18-14.": [
        "'speaker_9': 'Thank you, Mr. President. And good evening, City Council. I'm Sara Showalter, senior city planner with the Department of Community Planning and Development. This case is located on several parcels addressed 151 through 175 South Harrison Street, located in the southeast section of the city and Council District ten in the Cherry Creek Statistical neighborhood.'",
        "'speaker_9': 'This area outlines the site in the yellow dashed line. It's located at the corner of Harrison Street and Cedar Avenue, just west of Colorado Boulevard. The property is just over a half acre in size. It's currently vacant land and the applicant is requesting to rezone to a pad under former Chapter 59.'",
        "'speaker_9': 'The current zoning is APD PD 625. This was adopted in 2008 to allow for townhome development on the site. It currently allows for 15 units total with a three storey maximum height, and it does have very specific and detailed architectural elevations, some of which you can see a photo of here on the screen.'",
        "'speaker_9': 'The primary reason the applicant is requested to rezone is the desire to do different architecture than what's in the existing PWD. There are very few substantive changes from the existing period. It'll still allow for multifamily as the only use with a maximum of 15 units.'",
        "'speaker_9': 'The height will remain the same, which is three storey maximum at 42 feet total. The changes that are proposed through this rezoning are updating the building elevations and allowing for them to be more conceptual rather than a very specific design.'",
        "'speaker_9': 'And probably the most important change is incorporating design guidelines that are based on the current version of the Cherry Creek East Design Guidelines. There are also very small changes to the development program to reflect slight change in the design of the site.'",
        "'speaker_9': 'The main reason that the requested zoning is a PUD as opposed to a standard zone district from our Denver zoning code is because of the desire to incorporate design guidelines. There are design guidelines today called the Cherry Creek East Design Guidelines that went through a process over ten years ago but were never officially adopted by a planning'",
        "'speaker_9': 'board. And our Cherry Creek Area plan, which addresses this neighborhood, calls for updating those design guidelines and then having them officially adopted until that time. This PD allows for the majority of those guidelines to be incorporated and applicable to this site.'",
        "'speaker_9': 'The reason why it's a PDF under former Chapter 59 is really a matter of timing. When the applicant applied several months ago, CPD was using a very strict interpretation of the PUD criteria under the Denver zoning code, one of which is public benefit would result from the PUD.'",
        "'speaker_9': 'Since that time, we've had a conversation with a lot of City Council members about the importance of zoning into new code districts under the Denver zoning code and seeing that as a public benefit. So it is our hope that this is one of, if not the last one of the last former Chapter 59 parties that you would'",
        "'speaker_9': 'see that policy shift was made after the applicant had already applied. And we did not want to make them start over again with a new code PUD. So that's why it's under former chapter 59. This is the district plan, as it's called in the proposed PUD, showing the 15 units that are proposed.'",
        "'speaker_9': 'They are oriented to face the streets and really promote a pedestrian friendly, walkable neighborhood. This is the proposed conceptual building elevations and alternate view, seeing them from the back of the alley. In terms of the existing context in this area, the zoning is immediately around the site is either other PDE zoning or GM three and immediately to'",
        "'speaker_9': 'the south S.R. eight. The uses in this area are primarily residential. There's quite a mix of two family and multifamily being the predominant residential uses. These images quickly orient you to the existing building form and scale in this neighborhood.'",
        "'speaker_9': 'The image on the top shows existing duplexes that are just north of the site. The image on the bottom there shows the vacant site with some multifamily behind it. The this image on the top shows the property that's directly west of the site, a three story multifamily building.'",
        "'speaker_9': 'And the image on the bottom shows property across the street on the other side of Harrison. In terms of the public process. We went to planning board for a public hearing on August 20th. They did vote unanimously to recommend approval.'",
        "'speaker_9': 'I went to the Neighborhood and Planning Committee on September 18th, and then we're here tonight, October 27th. In terms of the public outreach that's been done for this public hearing, there was written notification to R.A. emailed on October 6th.'",
        "'speaker_9': 'The sign was legally the property was legally notice was signs from October 6th through today. And the only public comment we've received is one letter that was included. Just today we received it. The neighbor who wrote this letter expressed kind of two concerns.'",
        "'speaker_9': 'One was about the notification of the property for the planning board public hearing. I did want to note that all of the noticing requirements per our code for both the planning board public hearing as well as this public hearing were met.'",
        "'speaker_9': 'And the second concern cited in the letter revolves around the maximum height of the building, which is three stories or 42 feet. There is a small enclosed stairway and landing that goes up to the roof of the property, which does not count as a fourth story per our code, as long as all it contains is a minimum'",
        "'speaker_9': 'landing area for the stairway. So as the applicant, if the zoning is approved tonight, as they proceed with their design and construction, they will be closely monitored to make sure that it does not include anything more than that and does not qualify as a fourth storey.'",
        "'speaker_9': 'I'll quickly walk through the review review criteria for this piece, which does fall under former Chapter 59. The first is consistency with adopted plans. It is consistent with three of the strategies identified in comp plan 2000, including goals relating to promoting infill development in existing areas that already have infrastructure promoting infill development.'",
        "'speaker_9': 'That's consistent with the quality and scale of surrounding neighborhoods and also identifying areas where it makes sense to add density in appropriate way. Blueprint Denver does designate this site as urban residential, which the proposed use is very much in conformance with.'",
        "'speaker_9': 'It also designates this area along Harrison Street as an area of change. And finally, the Cherry Creek Area plan adopted in 2012 has this entire section dedicated to the Cherry Creek East neighborhood where the site lies. It complies with many of the goals that are in the plan for Cherry Creek East, including reinforcing the residential character of'",
        "'speaker_9': 'this neighborhood, respecting the existing scale, revitalizing and encouraging reinvestment along Harrison Street and updating the Cherry Creek East Design Guidelines. As I mentioned earlier, we see this pegged as an interim solution until we have the staff resources to engage in the process to completely update those guidelines and have them officially adopted.'",
        "'speaker_9': 'This is also in compliance with the Cherry Creek Area Plan because it has a maximum of three stories, which is what the plan calls for and our other other criteria. We do find that the site through this request meets all of them, including the justifying circumstance of a change or changing condition.'",
        "'speaker_9': 'This whole neighborhood is seeing a lot of change with residential redevelopment. We also have a newly adopted plan that encourages that type of change in this area. So with that, staff does recommend approval, finding that all of the review criteria have been met.'",
        "'speaker_4': 'Thank you very much. We have three speakers today and all three of you can come up to the front pew. Steven Spahn, Reed Phillips and Brooks Waldman. So, Steven, you can go ahead and get started.'",
        "'speaker_8': 'Good evening, council members. Name is Stephen Spahn, 1731 15th Street, Boulder, Colorado. Can I get to back to my answering your. There it is. There we go. Great. I'm here tonight to make some very brief comments. I'm available for questions and I will ask for your approval of PewDiePie 637 tonight.'",
        "'speaker_8': 'My client purchased this property early in 2014 with the underlying PDP 626. And which would require an architectural style that was due, which would involve this architectural style, which was very restrictive, and it was due to the way the party was approved.'",
        "'speaker_8': 'We believe that design could be a it could be much improved before we started designing. However, we carefully reviewed the Denver Comp Plan 2000 Blueprint Boulder Blueprint Denver excuse me, 2002 and the Cherry Creek Area plan for guidance.'",
        "'speaker_8': 'With this knowledge, we created our initial design concept. We then conducted a proactive neighborhood outreach program to learn our neighbors concerns and to review our design concepts with them. We met with the East Cherry Creek Neighborhood Association on two separate occasions to better understand their concerns and fine tune our design concept.'",
        "'speaker_8': 'We are pleased to have earned the neighborhood support for this project to garner their support. However, a key element was to develop clearly defined architectural guidelines for this project, which is part of your package to be approved tonight.'",
        "'speaker_8': 'The neighborhood appreciated that the primary building was only 37 feet high, where 42 feet is allowed. With the exception of the roof stair structure on the top, we also met with city council member Jean Robb, who corresponded with many of the neighbors regarding this project.'",
        "'speaker_8': 'I know this hearing is not about architecture, but the images shown today represent the project that we hope to build on this site. Our team is ready to move forward on the next stages of this project, and we would very much like your support today.'",
        "'speaker_8': 'Thank you very much. Thank you.'",
        "'speaker_4': 'Fred Phillips.'",
        "'speaker_8': 'My name is Reed Phillips. I live in Lafayette, Colorado, and I mostly want to make myself available for questions, but also wanted to talk a little bit about our working with the Czech priest, East Arnaud. One of the specific things that may not be included within those guidelines is also a commitment to incorporate the pedestrian.'",
        "'speaker_12': 'Lights within the area that.'",
        "'speaker_8': 'Are unique to that area. Not only in this project, but also to other products we have going in the area and they are not up yet. They will be as well. So I just want to put that forward as well.'",
        "'speaker_4': 'Thank you. Brooks Waldman.'",
        "'speaker_8': 'My name is Brooks Waldman. I live at 66 South Garfield Street. I'm the past president of Cherry Creek East. I'm standing in tonight for Tracy Winchester, who wasn't able to be here tonight. She's our current vice president. And I really want to let the applicant know and planning staff that we so appreciate this moving forward as a'",
        "'speaker_8': '. Our neighborhood has been opioids for years now. And the design guidelines were the the tool that we had to make sure that design was consistent within the neighborhood. Having lost that tool, a project like this could be much, pretty much anything under the the new form based zoning.'",
        "'speaker_8': 'So this has allowed us to get the results that we intended originally and set a good precedent. And I'm so glad to hear Sarah speak about the guidelines being updated. So I'm here in support of this project. Thank you very much.'",
        "'speaker_4': 'Thank you. That concludes our speak and that concludes our speakers is now a time for questions of members of council. Councilman Robb.'",
        "'speaker_10': 'Thank you, Mr. President, for Brooks Waldman, I. I was at one of the Cherry Creek East meetings where there was a discussion of this proposed PUD, but did at any time did the neighborhood organization take a formal position on it?'",
        "'speaker_4': 'Can you come up to the ABCs? Can you, Mr..'",
        "'speaker_10': 'Waldman, go to the microphone. I'm sorry.'",
        "'speaker_8': 'It's my recollection that it was voted at the board level. It was presented at the time to the community. And we had support. We had a consensus.'",
        "'speaker_10': 'Got it. I knew there were a lot of questions at night, but generally positive, and that there were some small neighborhood meetings or smaller group meetings going on. And then just one other question, Mr. President, for Reed Philips.'",
        "'speaker_10': 'You mentioned the lights that will be going in at the other projects that you've done in Cherry Creek East. As you know, this is really important to the pedestrian feel of the area in sort of a neighborhood tradition.'",
        "'speaker_10': 'Are you also are those properties occupied?'",
        "'speaker_8': 'No, they are not. One is in construction and one has just completed the construction of the main structure. Okay. And those have been ordered together.'",
        "'speaker_10': 'Okay. Because I wanted to be sure that you have a common wall agreement that provides for the maintenance of the light.'",
        "'speaker_8': 'Yes. And has addressed those lights.'",
        "'speaker_12': 'Specifically, which I've heard is.'",
        "'speaker_8': 'An issue.'",
        "'speaker_10': 'And in this episode, they're actually shown and reflected in the text. So unlike the other zoning, they're actually part of this property. Yes, they are. Okay. Thank you. Great.'",
        "'speaker_4': 'Thank you, Councilwoman Robb. Are there any other questions from members of council? Seen on the public hearing on 705 is now closed. It's time for comments from members of Council Councilman Rob Cook.'",
        "'speaker_10': 'Didn't even ring in yet, but thank you, Mr. President. I feel like there's strong neighborhood support and there's been plenty of information out on this property. I will also confess, Mayor Culpa, perhaps on the old Chapter 59 PD, the day we had a discussion in committee about an EV, chapter 59 PD And I really I think we've'",
        "'speaker_10': 'only done two or three of these in total in the last four years. But I had been in committee listening to this PD and Councilman Brooks district and we weren't happy with it being an old code PD. I went back to my computer and saw a notice on this rezoning, picked up the phone and said, Is this'",
        "'speaker_10': 'an old code PD? And it was already in the hopper. And I think they have good explanations for why at this point it was felt that that was the way the developer should proceed. I will be supporting this and would appreciate my colleagues support.'",
        "'speaker_4': 'Thank you, Councilwoman Robb. Councilwoman Fox.'",
        "'speaker_0': 'Thank you, Mr. President. There was reference, I believe I the first speaker to the fact that he hoped or thought that architecture would be what would be finally presented. I sincerely hope it is. I'm voting for it because it's a very attractive rendition.'",
        "'speaker_0': 'And I'd like to see on the street what I voted for.'",
        "'speaker_4': 'Thank you. Councilman Fox, any other comments from members of council? Scene on Madam Secretary, roll call.'",
        "'speaker_7': 'Rob Shepherd. Sussman. All right. BROWN All right, Fats, I can eat Lemon. Lopez. All right. Monteiro. I never i. Ortega, i. Mr. President, II.'",
        "'speaker_4': 'Madam Secretary, please close the voting announce results. 12 1275 has been placed upon final consideration and does pass. Right. We are moving on to prior public hearing for 764 and 765. Councilwoman Fox, will you please put council bill 764 on the floor?'",
        "'speaker_0': 'Certainly, Mr. President, I know the council bill 764 be placed upon final consideration and do pass.'",
        "'speaker_4': 'It has been moved in second hand. This is a combined public hearing for Council Bill 764 and 765 and is now open. Speakers may address either or both bills at the conclusion of the public hearing. Council will vote separately on each bill.'",
        "'speaker_4': 'May we have the staff report?'",
        "'speaker_9': 'Good evening again and thank you, Mr. President. I'm Sara Showalter with Community Planning and Development, and I'm here with my colleague Kyle Dalton, co project manager on Cherry Creek Zoning. We're going to give this presentation together and just as we come as a team, we have the two amendments as a team here, the text amendment and the'",
        "'speaker_9': 'map amendment. I will quickly walk through the background on this project, which has lasted many months and has been a great endeavor and partnership between our office and the technical task force that Kyle will talk about in a minute.'",
        "'speaker_9': 'The zoning that's before you tonight implements three plans that the city has adopted our comp plan 2000. It very much furthers the goals and that plan for promoting quality mixed use infill development. Blueprint Denver recognizes all of Cherry Creek North as an area of change and encourages the mixed use redevelopment of this area.'",
        "'speaker_9': 'And then the Cherry Creek Area plan adopted in 2012. One of the primary recommendations in the plan was to update the C CCN zoning that stands for Urban Center, Cherry Creek North. I think most of you are familiar with the fact that when we re zoned the city in 2010, the zoning was not updated into the Denver'",
        "'speaker_9': 'zoning code. Form based and context based approach. There was a desire then to have the neighborhood plan adopted first, and that did occur in 2012 after a very long process that involved the input of hundreds of stakeholders. And as I mentioned, a major recommendation of that plan was to update the zoning.'",
        "'speaker_9': 'A development study was done as part of the plan that recognized the current zoning had many factors, including floor area ratio or FAA limits, height limits and off street parking requirements that were limiting redevelopment opportunities in Cherry Creek so that the development that's been happening in the area, so much of that development that people have seen in'",
        "'speaker_9': 'the past few years has been occurring under different zoning than the CCN. The plan has a very robust implementation section with lots of implementation steps. Just we wanted to note that adopting this zoning, while very important, is just one line on a very long implementation plan.'",
        "'speaker_9': 'A lot of the comments that we received and a lot of discussion we had with the public throughout this process involved items that are not really in the zoning code and yet still very important and related to land use.'"
    ],
    "Approves a Legislative Map Amendment to rezone property from C-CCN, PUD, or C-MU-10 with waivers to proposed zoned districts C-CCN-4, C-CCN-5, C-CCN-7, C-CCN-8, or C-CCN-12. (NEIGHBORHOODS & PLANNING) Approves a Legislative Map Amendment to rezone property from C-CCN, PUD, or C-MU-10 with waivers to proposed zoned districts C-CCN-4, C-CCN-5, C-CCN-7, C-CCN-8, or C-CCN-12. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on  9-18-14.": [
        "'speaker_9': 'These include concerns about traffic and parking in the neighborhood, about the need for better transit, serving Cherry Creek. And we did want to note that in addition to the zoning that we've been working on in the past year and a half, there have been a lot of efforts underway to address a lot of the other implementation recommendations'",
        "'speaker_9': 'in the plan. Many of those by partners that are in the private sector, including groups such as the Cherry Creek North Business Improvement District, the Cherry Creek Area Business Alliance, who have formed a parking task force to address some of the parking concerns in the area.'",
        "'speaker_9': 'We've also been working with other public partners like RTD, who conducted a study to look at improving transit on Speer and First Avenue. And some of the recommendations from that study are already being implemented this year, including more frequent bus service on that corridor.'",
        "'speaker_9': 'So we did just want to note that this the zoning is one piece of a much larger puzzle to realizing the vision in Cherry Creek. There were eight specific goals to guide our zoning effort in the Cherry Creek area plan.'",
        "'speaker_9': 'I will not read all of these to you, but I'll throw them up on the slide here for everyone to see on the screen. They include goals about retaining and enhancing the character of Cherry Creek, encouraging smaller lots to remain and redevelop and not reassembled into larger development sites wherever possible.'",
        "'speaker_9': 'Maintaining high transitions, especially between second and Third Avenue and to the adjacent neighborhoods that are about this district and really trying to promote that vibrant, pedestrian friendly atmosphere that Cherry Creek North is so well-known for. And with that, I'm going to turn it over to Kyle.'",
        "'speaker_12': 'So with a clear plan direction to change the zoning in Cherry Creek. Several months after his adoption, we set forth on the process to do that and the process started just over 18 months ago. It was a three phase process that began in the summer or was finished in the summer of 2013 with the first phase.'",
        "'speaker_12': 'In the first phase, both the Cherry Creek Steering Committee and this technical task force that Sarah mentioned agreed to the process and use that first phase to identify how they would work together, what sort of rules they would have regarding communications, ground rules in the meetings, and really what would be on the menu to solve through the'",
        "'speaker_12': 'zoning process. Phase two followed through the rest of the summer of 2013, fall of 2013, and wrapped up in the spring of 2014 with the Technical Task Force actually doing the hard work of drafting the zoning after they had a complete draft.'",
        "'speaker_12': 'They put that draft out for public review and adoption, which is the third phase of the zoning process, which concludes here tonight and took place throughout the summer and is wrapping up here in the fall where the public and stakeholders provided input on that draft.'",
        "'speaker_12': 'The Technical Task Force. We reviewed the draft and then it went through the public approval process as all of our rezonings do. Wrapping up here tonight with City Council at the end of the first phase, agreeing to the process phase, the Cherry Creek Steering Committee and the Zoning Technical Task Force agreed to a framework document that set'",
        "'speaker_12': 'forth sort of the scope for the whole zoning project. So it identified the guiding documents, the rules for how folks would work together. It cemented in writing that the group's commitment to having a transparent, inclusive and accountable process and really set the roadmap for how they would all work together during the drafting phases and ultimately through the'",
        "'speaker_12': 'adoption phase. The process was designed from the beginning to be a collaborative process where everyone was listening to the voices of those who lived and worked in Cherry Creek. It was facilitated by a third party facilitator who we hired to set to set the ground rules, to work together with the task force and with the steering committee'",
        "'speaker_12': ', and to be a neutral third party, to draw out all the voices and help them achieve consensus. And that third party facilitator, Mike Hughes, is here tonight and can address the body later. I should note that the staff took the the role here of of taking a back seat and serving as technical experts.'",
        "'speaker_12': 'This is not staff's code. This is the code of the technical task force, as reviewed and by the public and as changed by them and is facilitated by the third party facilitator. We attended all meetings and provided the technical expertize for the process.'",
        "'speaker_12': 'And then the technical task force was a 16 member task force of diverse stakeholders representing a wide variety of community groups, professionals, folks who were who represented neighborhood organizations, who represented business organizations, architects, landscape architects, planners, many of them wearing multiple hats, the majority of whom were residents in the district or in the neighborhoods immediately surrounding the'",
        "'speaker_12': 'district. And these are the folks who who set forth to draft the code throughout phase two, multiple meetings that were all open to the public in which they took comment from the public in every meeting. Each of these meetings was at least 3 hours, sometimes 4 hours long in the evenings, really diving into the technical details of'",
        "'speaker_12': 'the zoning code. During that process, they used four guiding documents to to guide their work, the Cherry Creek Area Plan, as Sarah mentioned, and its two appendices. They also look to certain aspects of the current zoning, recognizing that there were still some qualities worth keeping in the current zoning.'",
        "'speaker_12': 'That design sentencing guidelines for Cherry Creek North, which were updated in 2012, continue to be relevant and and guide and shape the kind of development that happens in Cherry Creek North. So they looked at how the new zoning would interact with those design standards and guidelines.'",
        "'speaker_12': 'And then finally the Denver zoning code adopted in 2010, they agreed from the beginning to use the context based and form based approach of the Denver zoning code in drafting the new zoning. Once they had a draft, it went through an extensive public review process throughout the month of June this year.'",
        "'speaker_12': 'The Cherry Creek Steering Committee weighed in and had presentations on the Technical Task Force draft. We invited all of the registered neighborhood organizations to review the draft, and Sarah and I went out and presented to many of them the red line draft and was posted on on the city's website and available for public comment as well as'",
        "'speaker_12': 'at the local Denver Public Library branch. It was distributed by email to all those who signed up. At the very beginning of the process. We sent postcards to every property owner in the statistical neighborhood and invited them to sign up on the email list.'",
        "'speaker_12': 'So folks have been getting emails throughout the process. We sent postcards to all of the property owners who are actually affected by the zoning. We had a public meeting in an open house with over 50 people attending. Are there in the district again at the library branch.'",
        "'speaker_12': 'We held office hours to meet with folks. One on. One and answer any questions you need to maybe their property or some curiosity they had about the draft code. And then we also presented at the Inter Neighborhood Cooperation Zoning and Planning Committee at following that review.'",
        "'speaker_12': 'And the task force reviewed the draft and put and put forth their final draft for the public adoption process. It was forwarded to the planning board. They had a public hearing on September 3rd and recommended approval of both the text amendment and the MAP Amendment unanimously.'",
        "'speaker_12': 'The draft was forward to the Neighborhoods and Planning Committee of City Council and moved out on September 17th. In your packets, there are two letters of support from two of the Rochester neighborhood organizations the Capitol Hill, United Neighbors and Cherry Creek North Neighborhood Association.'",
        "'speaker_12': 'I'll also note that for both the text amendment and the map amendment, written notification of the hearings has been provided in advance in accordance with the code and for purposes of the MAP Amendment. We have posted signs throughout the Cherry Creek North District.'",
        "'speaker_12': 'So I'll turn it back to Sarah to go through the substance.'",
        "'speaker_9': 'Thanks, Kyle. So one of the primary goals of the new zoning is to implement the building height recommendations from the Cherry Creek Area Plan. This is a map from that plan showing the variety of building heights in the area, which range anywhere from 3 to 12 stories for a recommended height.'",
        "'speaker_9': 'The zoning does have a menu of zoned districts, as is common in our Denver zoning code, where you have options depending on a maximum building height. So can three, CCN, four, CCN, five, etc. as a way to implement these height recommendations.'",
        "'speaker_9': 'That does include a height transition that was very important in the plan as well as its appendix. The Urban Form Study, also known as the White Paper. The task force chose to follow the recommendations specifically from the Urban Inform study when it came to how to step down in height from third from Second Avenue to Third Avenue'",
        "'speaker_9': '. So this image is showing you have Second Avenue on the right where building heights can reach up to eight storeys. And as you move north towards Third Avenue, you step down to a five story zone district with additional height limits that I'll discuss in a minute based on a bulk plane along Third Avenue.'",
        "'speaker_9': 'This is the proposed zoning map. The the stripes of color you see there, again, represent the height transitions that were recommended in the plan and how they're being implemented here. There are also some important transitions that are required where the zoning abuts adjacent residential neighborhoods or protected districts and the zoning code.'",
        "'speaker_9': 'So all of the protected district setbacks and upper storey setbacks that are required for most of our mixed use commercial zone districts do apply here. So that does include a ten foot minimum setback at the ground story and then upper story setbacks that are diagramed here, including a 40 foot setback once you're above 51 feet in height'",
        "'speaker_9': 'and a 25 foot setback when you're about 27 feet in height. As I mentioned a moment ago, there's additional sculpting and reduction in building height along the south side of Third Avenue. This is rooted in a planned goal to preserve the pedestrian oriented character of Third Avenue, which has traditionally been it's recognized again in the plan as'",
        "'speaker_9': 'an area that attracts kind of smaller scale, more voce grouped retailers, and really has that pedestrian oriented character. That is what drove the task force to recommend the Third Avenue Solar accessible clean, which as demonstrated in this image here, the build primary building that you see in the center, in left of the image is on the south'",
        "'speaker_9': 'side of Third Avenue. And this is showing kind of the darkest day at the darkest moment of the year, which is 12 p.m. on December 21st. The shadow that this building casts does not extend onto the sidewalk on the north side of Third Avenue, which is over here in any way.'",
        "'speaker_9': 'So the angle of the bulk plane was specifically designed so that shadows do not impact the north side of the streets. And that is what any future buildings developed under the zoning would have to follow. Another major component of the zoning is the requirement for an upper storey mass reduction.'",
        "'speaker_9': 'This is rooted in a lot of the plan goals about access to sunlight throughout the district, as well as the desire to allow for new development and higher density in the area, but making sure that it's appropriately scaled and not too bulky.'",
        "'speaker_9': 'So what this requirement is, is one chair above the second story of the building. You can essentially only use 75% of your zoned lot for your building footprint. So it reduces the amount of the building by 25%. One chair above the second story.'",
        "'speaker_9': 'And that does allow for flexibility in architecture. The example of showing here's where that that mass production is coming out actually allows for the building to curve because it's not a set setback, for example, from the street. Another important topic the task force discussed a lot relates to the form and character of buildings as you experience them'",
        "'speaker_9': 'along the streets. There was a clear consensus on retaining the five foot setbacks that are required along all streets in the current zoning that will remain in the proposed zoning. There's also a lot of requirements for transparency and pedestrian entrances along the ground floor of buildings to encourage that vibrant pedestrian atmosphere that Cherry Creek North is known'",
        "'speaker_9': 'for. And these requirements build upon the design standards and guidelines that Kyle mentioned earlier were just guiding document for the technical task force. I would note the task force did propose a few minor redlines to the design standards and guidelines to compliment the zoning, and those were presented and approved as part of the Planning Board, public hearings'",
        "'speaker_9': ', planning board as part of the approval for those. So they all work together as a great package to ensure quality design in terms of uses. Another big component of our zoning, in large part the mix of uses, remains very similar to what the current zoning allows as a way to promote a very vibrant, mixed use district.'",
        "'speaker_9': 'There were some changes made by recommendation of the task force and these mostly focused on the desire to have the most active pedestrian environment as possible. So one of those changes is that surface parking lots are no longer allowed as a primary use.'",
        "'speaker_9': 'They can only be accessory use. So you have to have another use on the site. Another change is having more robust requirements for active ground floor uses where you have parking garages. Another change related to land use in the district is the allowance for lodging.'",
        "'speaker_9': 'In the current season, zoning only bed and breakfasts are allowed, and under the proposed zoning, all lodging uses will be permitted. And I'm going to turn it over to Kyle.'",
        "'speaker_12': 'Parking was a very important topic to the task force and to members of the public throughout the process. There were many conversations on various aspects of parking, many of which aren't addressed through zoning. And as Sarah mentioned, in many ways, this process was a springboard for other organizations to begin talking about parts of parking that aren't addressed'",
        "'speaker_12': 'through zoning, like wayfinding and pricing and and how to manage the on street supply. But zoning deals with the off street minimum parking requirements for private development, and the task force did agree to new ratios minimum of three parking ratios, which are shown in the red box on this table.'",
        "'speaker_12': 'They are higher than our typical urban center. And this is appropriate because Cherry Creek is a unique urban center in that it draws from the entire region and beyond, even out of state. And so there is justification for higher parking ratios than in urban and other urban centers.'",
        "'speaker_12': 'But I will note that most of the uses are substantially reduced from the current rates, which are the highest in the city. And so the technical task force landed on these rates as a compromise. Looking at development feasibility, some of the task force members did their own studies in terms of what rates would be appropriate, in terms'",
        "'speaker_12': 'of balancing the need for appropriate levels of parking and development, feasibility and of course, looking to the guiding documents we talked about earlier. So all in all, they did recommend some changes as shown on the slide. Another important topic to many of the task force members, and that was in the plan recommendations that Sarah mentioned earlier was'",
        "'speaker_12': 'to try to preserve small lots. One of the unique characteristics of Cherry Creek North remains that there are still several a few dozen small zone lots that remain, even though they're a small portion of the total land area.'",
        "'speaker_12': 'It's very important to keep this character of the small lot experienced. So the technical task force looked at ways to provide incentives for those lots to be able to to reinvest in what can be a difficult situation on a small lot and and and help them from from having to aggregate with their neighbors into larger lots.'",
        "'speaker_12': 'So the task force identifies three things to do in the new zoning. First, small lots do not have to do the upper story mass reduction that Sarah mentioned earlier. There's a parking reduction in the code. There has been a series of parking reductions in the code for small lots for many years in Cherry Creek North.'",
        "'speaker_12': 'And and the new zoning includes a parking reduction for small lots. And then they may also include encroach into the Third Avenue bulk plan that Sarah mentioned earlier. In some situations, another topic that was important to the task force members was to create an incentive for the kind of unique, privately held open spaces that are found in'",
        "'speaker_12': 'Cherry Creek North that provide a kind of interesting pedestrian experience. So the task force set forth to provide an incentive where for property owners that provide at their option private open space that those properties do not have to provide the upper storey mass reduction that Sarah mentioned earlier if they meet the rules defined in the new Denver'",
        "'speaker_12': 'zoning code and I'll make that mention that these private open spaces do have to comply with the design standards and guidelines to ensure that they're quality spaces. Now, that's the general rule. Small lots on the south side of third have a different kind of open space incentive because they already are excluded from the upper storey mass reduction'",
        "'speaker_12': 'that I mentioned earlier. They can encroach into the bulk plain on the south side of third in exchange for providing that private open space. So they get a little bit more height if they if they agree voluntarily to provide private open space on their properties.'",
        "'speaker_12': 'So that wraps up the content. The major content themes of the zoning code. Really quickly, I'll go through the review criteria. There are three review criteria in the zoning code for a text amendment. First is that they be consistent with the city's adopted plans and policies.'",
        "'speaker_12': 'Sarah did a good job earlier explaining how this zoning is intended to implement those plans, so I won't repeat that. There is also additional information in your staff reports about how the new zoning will further the public health, safety and general welfare through the implementation of the adopted plans.'",
        "'speaker_12': 'And each zone district will have regulations that are uniform. There are also three review criteria for a legislative map amendment, which is what this is, and they're essentially the same three criteria. First, that the MAP amendment be consistent with adopted plans.'",
        "'speaker_12': 'Second, that regulations be uniform throughout the districts. And then, third, that they further the public health, safety and welfare. And again, as we further detailed in our staff report, we find that the both the text and the map amendment are consistent with the codes review criteria.'",
        "'speaker_12': 'And therefore, having reviewed both the text and the MAP amendment against the review criteria, we recommend approval of both.'",
        "'speaker_4': 'Thank you. Thank you both. We have eight speakers for 764, 765. I'll call up the first five K Pride, Michael Hughes, David Steele, Bob Flynn and William DeMaio and Mr. Pride, you can go ahead and get started.'",
        "'speaker_5': 'Thank you, Mr. President. My name is Kay Pride. I live at 335 Cook Street in Cherry Creek North in Denver. And I appreciate the council hearing us tonight. You all know how important Cherry Creek North is to the economy and vitality of the city.'",
        "'speaker_5': 'It's a real draw for people, as Kyle pointed out from all across the region. So if we're going to increase density and height and make this more like downtown than it has been, it will be a major activity center that needs public transit to connect it to the larger transit grid.'",
        "'speaker_5': 'There was a mention of more frequent bus service. I hope we can think creatively beyond that. For instance, I would like to have a van or a small bus that would leave from the front of Neiman Marcus, go to the Golden Triangle and the cultural complex, go on to the DCP and on to Union Station.'",
        "'speaker_5': 'That would solve a lot of driving for a lot of people. I think it would also bring the downtown visitors out to Cherry Creek, which would also be very helpful. There's also something within Cherry Creek that would be helpful, and that is something like a mall shuttle maybe down second and up third or vice versa, so that'",
        "'speaker_5': 'people didn't have to move their cars every time they wanted to make another stop in Cherry Creek, because it's it's a long, narrow artery there. And we we know that not everybody can walk that far. So I would urge you, as members of the city council, to use your leadership skills to support better transit, connecting Cherry Creek'",
        "'speaker_5': 'to the rest of the metro area. And I think there would be a big payoff.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Thank you. Michael Hughes.'",
        "'speaker_8': 'Good evening. Thank you. Michael Hughes. I live at 40 South Miller Street in Hilltop, and I was the third party facilitator that you heard about. I just want to say two things. As you prepare to cast your vote, either for or against these texts and map changes.'",
        "'speaker_8': 'First, I just want to commend the work of the technical task force. They did an extraordinary job, really wrestling with the hard issues and balancing the interests of adjacent neighborhoods and business owners and landowners and trying to find something that fully implemented the Cherry Creek Area plan.'",
        "'speaker_8': 'And they did as good a job in consensus building as I've ever seen. Second, I want to commend the staff effort that was connected to this. They listened very carefully to the conversation among the task force members and really did an extraordinary job in presenting back to the task force the physical representations in the maps and the'",
        "'speaker_8': 'text changes that fully implemented the discussion of the task force. So I hope that you'll support this really extraordinary level of effort from both the task force and the staff.'",
        "'speaker_4': 'Thank you, David Steel.'",
        "'speaker_8': 'My name is David Steele. I live at 300 Lafayette Street in Denver. I'm here on behalf of the Cherry Creek Area Business Alliance and the vice chairman of that organization. And we've full and wholeheartedly support the adoption of these bills.'",
        "'speaker_8': 'Seven, 647, six, five, I believe. Thank you.'",
        "'speaker_4': 'Thank you. Bob Flynn.'",
        "'speaker_8': 'Yes. Thank you. I'm Bob Flynn and I live in Englewood, Colorado, but I'm here in my capacity this evening as board chair of the Cherry Creek North Business Improvement District. The Business Improvement District Board supports this new zoning for the following reasons.'",
        "'speaker_8': 'Zoning is a matter of citywide interest and vibrant and regionally competitive. Cherry Creek North is absolutely vital to the economic health of this city. Modernizing the Cherry Creek, zoning the Cherry Creek North zoning is a necessary step to fully implement the Cherry Creek Area plan that was adopted by this body in July of 2012.'",
        "'speaker_8': 'The new zoning is consistent with the city's new form based zoning, and it customizes it to the unique character of Cherry Creek North. And lastly, the zoning with the Cherry Creek North Design Guidelines and the oversight of the Cherry Creek North Design Advisory Board will ensure high quality infill development for years to come.'",
        "'speaker_8': 'City Council members the Cherry Creek North Business Improvement District Board urges you to pass these zoning measures. Thank you.'",
        "'speaker_4': 'Thank you. William DiMeo. And as he comes up, I want to call up the final speakers, Wayne New Robert Vogel and Brooks Waldman. Go right ahead.'",
        "'speaker_8': 'Thanks. My name is Bill DiMeo. I live as seventh and cook, and I'm here on behalf of Capitol Hill United Neighborhoods. We have discussed the Cherry Creek zoning in several meetings and after a presentation by the Community Planning and Development Capital Neighborhoods, supports the new zoning in Cherry Creek.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_4': 'Thank you. When you.'",
        "'speaker_8': 'I knew. I live at 443 Adams Street, the A Cherry Creek North. I'm a member of the Cherry Creek North Neighborhood Association, a member of the Cherry Creek Steering Committee, co-chair of the four year planning process and a member of the Tactical Task Force.'",
        "'speaker_8': 'So I just want to to commend Carl, our senior planning staff, for a wonderful collaborative process that we had with the Tactical Task Force. It was a very collaborative. We they ensured and encouraged good participation and input from all the tactical task force members and also from the general public, people who who attended developers or or residents'",
        "'speaker_8': 'who attended our tactical task force meeting, making sure they had the opportunity to input into the deliberations. You also the the the end product was a very strong collaboration of all of the parties that were involved. It was it was very encouraging to see the agreement and the consensus that was reached.'",
        "'speaker_8': 'And we're very pleased with the outcome of the process. One of the things that was really strong in the process was the use of analytics, use of data. It helped improve the quality of our decisions, but also it helped explanation to explain to residents the decisions that were made, eliminating a lot of anxiety and fear.'",
        "'speaker_8': 'It really improve the quality of the process as we move forward. And I hope that you will approve the zoning requirements tonight. I hope that we'll be able to work together closely with the Business Improvement District Planning, Public Works and all the neighborhoods to help address the ramifications of the development.'",
        "'speaker_8': 'We're going to have some traffic and parking issues we need to address. We just need to manage that and work together to do that. Also very important, too, is we've worked so hard nine months to develop these zoning requirements and I can't imagine any kind of justification to have a variance to these requirements coming up in the'",
        "'speaker_8': 'near future. I think all the property owners had the opportunity to opt in to the new zoning and they made a decision about that. So I feel that we we have a very strong zoning requirements that I feel that we should be able to use the zoning requirements for the next couple of years.'",
        "'speaker_8': 'Thank you for listening to and I hope you'll approve the zoning today.'",
        "'speaker_4': 'Thank you, Robert Vogel.'",
        "'speaker_8': 'Mr. President, members of the council. My name is Robert Vogel. I'm the president of the Cherry Creek North Neighborhood Association. Thank you for hearing what we have to say from the neighborhood. On behalf of the board of CC and A, I'd like to support the changes that are proposed here.'",
        "'speaker_8': 'Our board has voted on that. Our family of our members have taken part in the process. I would like to thank the members of the Technical Task Force for their hard work in reaching a very collaborative agreement. I will stop at this point praising what has gone on, because I think that there are several reservations that I'",
        "'speaker_8': 'have about this. My neighbor Kay on Cook Street and others have said that this is a good start. Cherry Creek North is a robust neighborhood. It is also a fragile neighborhood. If you want to know how fragile it is, just go down there at the end of our stormwater management excavation project and see the impact that difficulties'",
        "'speaker_8': 'in traffic and parking and transportation have had on the community. If the Council does not recognize that as much progress as we've made in rezoning, if it is not continued in parking and traffic and transportation, we're going to have the same difficulties at the end of the renovation of Cherry Creek.'",
        "'speaker_8': 'And so I implore the Council to think beyond the zoning, to think about the difficulties that density and height will bring. You have to bring people into the neighborhood if you want to maintain it as a robust point of interest within Denver and within Colorado.'",
        "'speaker_8': 'So I want you to think about the next steps, because this is only a good start. This is not the end. It's a good start. And I implore you to vote about the new zoning through. But think about what we still have to do, which is to provide transportation, to collaborate with the bid, to provide parking as'",
        "'speaker_8': 'Boulder does much better than Denver does. To think about transportation for those who will not have cars in the future. I strongly support the transportation in the form of walking and biking, and all of this needs to be done collaboratively with the neighborhood to make and keep Cherry Creek, the robust neighborhood that we know it to be'",
        "'speaker_8': '. So thank you for your efforts and for listening.'",
        "'speaker_4': 'Thank you. Brooks Waldman.'",
        "'speaker_8': 'Brooks Wallman, 66. South Garfield Street. Past President Cherry Creek East. Co-Chair of the Cherry Creek Steering Committee. A member of the task force. I'd like to see some of the things that Dr. Bob Vogel said, because I think moving forward is really very important.'",
        "'speaker_8': 'We worked really hard to strike a balance between business and residents. At this point in time, I think we're going to have nearly 1500 new units coming forward in Cherry Creek. It's going to put a lot of strain on our infrastructure.'",
        "'speaker_8': 'We spent two and a half years.'",
        "'speaker_1': 'On a plan. We spent 18.'",
        "'speaker_8': 'Months on a rezoning. We now have the tools we now need to implement that plan. And if any of you have been through Cherry Creek recently with all the construction, you can feel the electricity in the air. This zoning is already working.'",
        "'speaker_8': 'We've got the density and it's a change in scale of Cherry Creek that we've never seen before. So we're going to need support from the city for the infrastructure for this. The burden that's put on the new residents to be able to cross those streets.'",
        "'speaker_8': 'Connectivity. Connecting. Open spaces. All those things that make it a livable environment for the future. Appreciating this change in scale.'",
        "'speaker_1': 'And I don't think any of.'",
        "'speaker_8': 'Us speaking for myself, I didn't realize what a massive change this really is. Cherry Creek will not be the same Cherry Creek that those of us who grew up in this area and our children grew up in. It's going to be different.'",
        "'speaker_8': 'So we really have to make it a livable place and an exciting place and keep it vibrant and make it thrive. So we're going to need your help. We're probably going to be back. Thanks so much. Thank you.'",
        "'speaker_4': 'That concludes our speakers is now time for questions from members of Council on 764 765. Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. I'd like to ask Caio if you can come to the microphone, please. And I was trying to pull up the PowerPoint, not finding it so easily. Would you mind pulling up the slide that had the parking information?'",
        "'speaker_5': 'Let's see if I can.'",
        "'speaker_6': 'Get back to it.'",
        "'speaker_5': 'Okay. So in the highlighted section that's in red is that two for every thousand square feet. Okay. So on the restaurant or any of the commercial. So that's two and a half spaces for 3000 square feet. How how does that differ from other areas of the city?'",
        "'speaker_12': 'Sure. So regarding the restaurant minimum parking ratio, you'll see the 2.5 per thousand is the same as the current zoning and it's also the same as the urban center zoning throughout the rest of the city. So that particular ratio is not changed as compared to those.'",
        "'speaker_5': 'Okay. That answers my question. Thank you.'",
        "'speaker_4': 'That's why I'm an Ortega councilwoman each.'",
        "'speaker_3': 'Thank you, Mr. President. I was wondering if I could ask Mr. Vogel a question. Do you mind? I was really intrigued. Well, it's here. Up here. Mr. Vogel, I was really intrigued by your comparison to Boulder, and I was curious if you could share what you think they're doing better that we maybe should be learning from.'",
        "'speaker_3': 'I just. You really picked me.'",
        "'speaker_8': 'My daughter and three wonderful grandkids live in Boulder, so I'm up there fairly often. I think Boulder does a better job in constructing park parking structures that allow for affordable parking in the downtown area. And despite the fact that Boulder is what we know it to be very much pro biking and and pedestrians and all the things'",
        "'speaker_8': 'that are evolving in our society. They still realize that you have to be able to park. And I think that if we don't solve the parking problem in Cherry Creek, we will lose its vitality. And I know that there are reasons why the Business Improvement District has a vested interest in being able to park.'",
        "'speaker_8': 'But the sad story is that if we don't park adequately there, we spill into the neighborhoods and we lose the wonderful residential slash business collaboration that we have now. So I go to Boulder often. I am able to park cheaply and and easily downtown, something that I can't do in Cherry Creek.'",
        "'speaker_8': 'And our residents of Cherry Creek have the same feeling. There is more availability in the parking, in the high rise parking. There's reluctance to use it. But I think that if the city becomes involved in partnership with the business district, we're going to get the best of both worlds.'",
        "'speaker_4': 'Thank you, Councilman Canete. Catwoman Fat.'",
        "'speaker_0': 'Thank you, Mr. President. First for one of our staff members. I need to have you use your calculator. Tell me how much reduction parking we are approving if we approve this from current zoning.'",
        "'speaker_12': 'Well, let me take a shot at that. So this slide that's still on the screen shows the only rates that are changing. So every other use that's in the code isn't changing. So there are a lot of other uses.'",
        "'speaker_12': 'We're just kind of highlighting the main ones that people talked about the most and that are kind of critical and are typically the ones that are developed most in Cherry Creek. So there's the office, the retail and the residential I mentioned earlier the restaurant isn't changing, so the office is going down from three and a third parking'",
        "'speaker_12': 'spaces per thousand square feet today down to two per thousand square feet. The retail goes from 3.33 per thousand today down to 2.5 per 1000 square feet. And then the residential is cut in half as an incentive really to get out to remove one of the barriers to providing housing in the district.'",
        "'speaker_12': 'It's cut in half from two per unit to one per unit.'",
        "'speaker_0': 'I mean, so percentage wise, when you take a look at the total picture, how much less parking are we requiring? Or is that are you can you even tell?'",
        "'speaker_12': 'Yeah, it's a good question, but it's not possible for staff to say because it all depends on what uses ultimately get developed and what folks ultimately decide to build there. If they build more residential will have a different impact than if they build more office or more retail.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_4': 'Thank you. All right.'",
        "'speaker_9': 'Sorry. I just gave one point that the the shared parking and other tools that are in our code apply, too, which complicates that. So, for example, one of the things the task force talked about that they really want to see continue to happen in Cherry Creek is renters recognizing that sometimes you have complimentary land users that can'",
        "'speaker_9': 'share parking. So there's that's a tool that's already allowed in the code and will continue to be allowed. So makes it challenging when you think about all those different factors to calculate exact percentage.'",
        "'speaker_0': 'If I could ask one other question along that same line with now saying that there will be no parking lots per say. I gather the idea is to build down or are you thinking they will use up parking?'",
        "'speaker_0': 'Or what is your vision of of this lesser parking requirement which deeply concerns me?'",
        "'speaker_9': 'I think we've certainly modeled the options and talked with the task force about both options for going below grade and or above grade. The because of water table issues and the cost of going below grade, we assume no more than two stories below grade in the modeling we were doing for all of the proposed zoning.'",
        "'speaker_9': 'So for a lot of larger developments, that did translate to some parking above grade, which is one of the reasons why there's very strong design standards for parking garages and the design standards and guidelines.'",
        "'speaker_0': 'I can't think.'",
        "'speaker_4': 'Thank you, Councilman Potts. Councilwoman Robb.'",
        "'speaker_10': 'Thank you, Mr. President. Well, funny, but parking's on my list too, for questions. And I do want to address you can build parking at grade, but you have to wrap it with retail. So for instance, along Second Avenue, just east of film or Plaza where there's a new I'm trying to think, is that where the new Hallmark'",
        "'speaker_10': 'store is? And there's a restaurant there that is actually in front of a parking garage that is at grade level and then goes up. Okay. So my question on the parking and this is always dangerous when you don't know the exact answer to ask a question.'",
        "'speaker_10': 'But David Steel, since you have been developing office and residential, you're currently developing that. Could you talk about what the market is for office parking and for residential parking? Because I know, boy, before we even started this, we had we had lots of discussions on parking.'",
        "'speaker_8': 'Well, I think the the simple answer is, you know, there's code requirements and then there's market requirements and they're not necessarily in alignment with each other. But as far as Shore Creek North is concerned, at this point in time, a ratio of 2 to 1 is going to satisfy both of those requirements.'",
        "'speaker_8': 'So that's what we're providing. And that's not to say that as a developer, you can't provide more. I guess you can always provide more if you want. They're very expensive to build and really, depending on the size of your development, stuff like that, it gets very expensive going down.'",
        "'speaker_8': 'So I would assume that going forward, some of the people will like to try to go up a little bit, but then there's a ceiling on that as well too, in terms of height. And so in terms of the the residential, the proposed one per unit at this point in time, that seems to be okay.'",
        "'speaker_8': 'We are actually providing a little bit more than that for some of the residents because I think there's a husband and wife there living over there. Chances are that they probably have more than one car. We get back to Kay's point, and that is that we are desperately trying to figure out ways to have better transportation access'",
        "'speaker_8': ', if you will, to the Cherry Creek north and provide, you know, connectivity, if you will, to into downtown and particularly down the Denver Union Station area. So all that plays together. But so there's no you know, that's what we're doing.'",
        "'speaker_8': 'And it seems to be working. And I got to tell you that so far it's been successful.'",
        "'speaker_10': 'Okay. Thank you. And then my second question on parking, I've been talking to some of my colleagues about the dilemma that all over the city on 60 to 50 square foot lots, no parking, I don't mean all over the city in commercial mixed use zones, of which Cherry Creek North is one.'",
        "'speaker_10': 'We already have no parking requirements on 60 to 50 lots. But when Sarah talked about a small lot parking reduction in order to and we very much did want to incentivize that. Could you talk, Sarah? One in Cherry Creek North Zoning, we define a small lot slightly differently.'",
        "'speaker_10': 'It's a little bit larger. And what that reduction is for the small lot, I think it's the same as in the current Cherry Creek North zoning.'",
        "'speaker_9': 'Sure. So the the definition of a smaller and Cherry Creek North is slightly larger. It's 9375 square feet. That was based on testing that we did with the technical task force, looking at actual lot sizes in Cherry Creek and putting development program on those lots to see what was feasible based on the zoning requirements.'",
        "'speaker_9': 'So the 60 to 50 small exemption that's citywide assumes a 50 foot wide lot with by the typical depth of 125 feet. But we found through the modeling that we did and that the testing that the Cherry Creek zoning was very difficult to accomplish on even a lot.'",
        "'speaker_9': 'That was 75 feet wide. And the task force felt that that was still qualified as a small enough parcel that they would want to incentivize development on those parcels, not see them be assembled. So therefore, the the incentives you see for small lots apply for those lots, which is where the 93, 75 comes from, 75 foot wide'",
        "'speaker_9': 'lot. And then the reduction that's available to those lots is a 67% or two thirds, which is indeed based on what's in the current zoning. The current zoning is a little more complicated. It actually has four tiers of parking reductions depending on your lot size.'",
        "'speaker_9': 'So it starts with lots that are 6200 square feet and then moves up in different tiers and depending on what tier and you get a certain reduction with the task force we worked on trying to simplify that, make it a little clearer and under just easier to understand and kind of went with for when you were in'",
        "'speaker_9': 'the range of 9375 square feet in the current code, it would be a 67% reduction. So we kept that same amount.'",
        "'speaker_10': 'So to summarize between 93, 75 square feet, in 6250, you get a 67% reduction. And after that no parking is below 6250, no parking is required. But the task force did discuss whether that was the ultimate and decided to wait for a citywide sort of approach.'",
        "'speaker_9': 'That's correct, because the exemption, the 6250 cutoff only exists due to the city wide requirement in Article ten. It's not tied to the zoning.'",
        "'speaker_10': 'Okay. And if folks can bear with me, Wayne knew I was just going to give you an opportunity because you did a lot of the modeling on the parking in the Cherry Creek North neighborhood, actually did a parking study.'",
        "'speaker_10': 'And I want to know if you wanted to add anything.'",
        "'speaker_8': 'Part of the data analysis that we did. We did a lot, took all the parking ratios and worked with Karl and Sarah, and we looked at all different sized of all the way up to a half a block, down to 60 to 50.'",
        "'speaker_8': 'And I just want to say, we the analysis that we did, we did like 41 different case studies. And they really conformed to what Sarah Sarah said, the 6250 lot you couldn't park. There's no question about that. As you get up to the 93, 75, you could park it and as you got it to the larger light'",
        "'speaker_8': ', what any problem especially wasn't a problem if you go to one floor of parking above grade. So it added parking above grade, which we now really favor, but it does work for adequate parking. So we we think that these parking ratios will will suffice for Cherry Creek.'",
        "'speaker_8': 'And also other developers like David Steele are building more than one residential space per per unit. So I think that's going to work out in the future. So I hope that we work together and will again. The main thing is, like Bob Vogel said, because deal with the traffic and the congestion that we come up and I'",
        "'speaker_8': 'think we can do this successfully.'",
        "'speaker_10': 'Thank you. I'm good.'",
        "'speaker_4': 'Thank you, councilwoman. Councilman Brown.'",
        "'speaker_8': 'Thank you much. President Wayne, back to the podium, please. I have a question for you. I hope I misheard you. When you said that this plan was good for a couple more years, surely that's a typo? No. You don't spend two and a half years creating a plan and have it last for two years.'",
        "'speaker_8': 'We've spent a lot of time and money and effort in Cherry Creek, as you know. So. Come on. I'm sorry. I hope I heard misheard that I wasn't clear on that. The plan was to drill for 20 years.'",
        "'speaker_8': 'Okay. And we will support that. No problem with that at all. What I'm suggesting is there should be any significant changes to the zoning coming in the next couple of years. There may be there may be some kind of rezoning or PD or some kind of issue that comes up that must have extraordinary circumstances.'",
        "'speaker_8': 'But I can't see the way the zoning has been developed that there should be able to need a lot of changes, that one property owner would have to deviate from the zoning that we're proposing tonight. So. But the players.'",
        "'speaker_8': '20 years. Sure. Thank you. Thank you. Thank you, Mr. President.'",
        "'speaker_4': 'Thank you. Councilman Brown, are there any other questions from members of council? Seen on the combined public hearing on seven, six, four and 765 is now closed. Comments from members of Council. Councilwoman Robb.'",
        "'speaker_10': 'Thank you, Mr. President. I jotted down on a lot of things on comments, but first and foremost, like most of the people who commented said the technical task force was amazing when you heard three and four hour meetings and I know a lot of us have trouble sitting still that long.'",
        "'speaker_10': 'That's pretty awesome in that sense. Well, at least all of 2014 through August of 2014 and before that, we had a couple or another phase that took long meetings. So I'd like to ask, I know there are more people here than spoke.'",
        "'speaker_10': 'If you served on the technical task force, would you please stand so we can recognize you? Okay. And then I do also want to say that Sarah and Kyle, while they say, well, we're only technical, this is in our zoning, they are extremely technical.'",
        "'speaker_10': 'They are the dynamic duo of technical advice and guidance. And finally, but not least, I couldn't think of a great descriptor for you, Mike, if, you know, if we have the dynamic duo of Batman and Robin, I heard this superhero named Night King, you know, you flew in and when nothing else would do, you could save us'",
        "'speaker_10': 'from ourselves. So I really think it was an amazing effort. I haven't really in the whole time I've been on council seeing something that went that well where people really and we worked by consensus. If there wasn't consensus, it didn't happen.'",
        "'speaker_10': 'To comment on some of the other things that came up tonight. I had written down even before that the comments started, the testimony start started, the words move forward together. And I heard that in two or three or maybe even more of the comments, those words move forward.'",
        "'speaker_10': 'And, you know, it's it's not surprising because transportation is all about moving people. And certainly for the remainder of my term, I am committed to continue to working on this. I think we've started with the business alliance and with some other creative thinking transportation solutions.'",
        "'speaker_10': 'I think we have started to get a handle on it doesn't mean it's going to happen overnight. Secondly, on the parking, there's a lot that the private sector yet has to do in terms of wayfinding signage. I'm hoping even over the holidays we could maybe test some ideas on making parking in garages easier for people to come'",
        "'speaker_10': '. I know when I go out to Park Meadows, I go, No, I'm sorry, Lone Tree or wherever Park Meadows is, but I go, I can't stand it out here. I don't know where I'm going. There's too much traffic.'",
        "'speaker_10': 'Which lane do I get in? But they want me out there, you know, and I only go occasionally, I confess. But I have a feeling that when people who don't live right in the Cherry Creek area come to Cherry Creek, they had that same reaction that I have when I'm in a place I'm not in all the'",
        "'speaker_10': 'time, and we have to make it easy for them to park once and then walk.'",
        "'speaker_5': 'I love the fact that someone said.'",
        "'speaker_10': 'I think it was Sarah that we worked very hard to have a transparent, inclusive and accountable process. And I heard that numerous times in other processes in Cherry Creek that we weren't getting there with those goals, and I think we did it this time.'",
        "'speaker_10': 'Finally, I'm going to go a little off script. I want you to know that the first in university construction will be done by this Saturday and that. If you are coming from point south like Lone Tree or you can't find what you need at Park Meadows, no problem.'",
        "'speaker_10': 'You can come right up university and get into Cherry Creek. You can get the Whole Foods, you can be part of the folks crowding that parking lot. And it's it's going to come back. Whole Foods, I promise you.'",
        "'speaker_10': 'But I also want to say in that regard, I think, Bob Vogel, you might have spoken about the small retailers. They have struggled. They are doing remarkable jobs of reaching out and trying to do special things, working longer hours.'",
        "'speaker_10': 'Some have laid off employees. That's not good for anyone. It means their bottom line is down. It means people are out of jobs. And it's really important, as important as parking and transportation. And Bob Vogel, you're right. They're related.'",
        "'speaker_10': 'We need to keep the small local retail in Cherry Creek alive. And I know even as we did some of the rezonings, people worried about that and we were zoned anyway. They're still marvelous. 73% of the shops in the bid area are still locally owned.'",
        "'speaker_10': 'So we really need to have that focus as a community. And that too is partially a private sector thing. Bringing the community and making it feel like a community, a place, events, the things that that you know of.'",
        "'speaker_10': 'People have told me I always go to show of hands in Cherry Creek when I go, there's no place like it. But get these people over there to do some activities so they'll drop in and shop. So that's sort of my soapbox for tonight.'",
        "'speaker_10': 'Come back to Cherry Creek and shop locally. We're making it easy for you now.'",
        "'speaker_4': 'Thank you, Councilwoman. Councilwoman Shepherd.'",
        "'speaker_3': 'Thank you, Mr. President. Just want to thank my colleague, Councilwoman Grubb, for her wonderful words. But I do want to let everybody in the audience know that I never shop in Lone Tree. I often shop in Cherry Creek at the mall or either in North Cherry Creek.'",
        "'speaker_3': 'And I've been over there enough times now that I don't usually get lost, except for the last time I was going through there on my bicycle on that cherry. So I really want to know when that transition for the cyclists underneath underneath University Boulevard is going to be reopened again.'",
        "'speaker_3': 'So you don't have to navigate all that traffic on university. But I do want to make a couple of comments on some of the of the points that were brought up tonight. I mean, I know what a diverse group you all are.'",
        "'speaker_3': 'And it's just, you know, I highly, highly commend you all for, you know, being able to work so productively and effectively, you know, through these years to come up with something that sounds like you have tremendous consensus on.'",
        "'speaker_3': 'And so, you know, hats off to you and kudos for doing such a great job. I'm sure it wasn't all smooth along the way and I wasn't there for the blow by blow. But, you know. Fantastic. Hats off to you, too, Mr. Waldman.'",
        "'speaker_3': 'You know, Cherry Creek is an area that draws people from all over the city and the region. You know, and it is so obvious when you're going I live in northwest Denver and I represent that area. But when I'm when I go to Cherry Creek, it is shocking to even me, you know, and I do this for'",
        "'speaker_3': 'a living about how much it's changing. And so, you know, I hear I hear what you're saying about wanting to keep it to keep it livable and vibrant. And then secondly, to many of Mr. Vogel's points, during the regular part of your testimony, there was a lot of discussion among this whole body during our City Council budget'",
        "'speaker_3': 'hearings on this very issue. So Cherry Creek is experiencing a tremendous amount of urban infill development, but so are several other areas in our city, including my district and in several others of us who are on this body.'",
        "'speaker_3': 'And we talked very much about, you know, how our our planning and our engineering on our transportation side and our infrastructure side needs to keep pace or certainly try to catch up significantly to what's happened on the development side with all this increasing density, you know, and all this influx of new people.'",
        "'speaker_3': 'I am the chair of the Infrastructure and Culture Committee, so I wanted to communicate to you that, you know, there were there was a significant I think there was 11 folks on this council that agreed that these issues were of exceedingly exciting importance during our budget hearings.'",
        "'speaker_3': 'And as Councilwoman Sussman alluded to earlier, we were able to ask the mayor for a significant staffing increase in the transportation planning and engineering areas. That includes six new people in both of those areas to deal with intersection safety and pedestrian safety and traffic calming and parking because it is an issue that we're all experiencing, you know'",
        "'speaker_3': ', the crunch very significantly. So, you know, thanks to the advocacy of this council, we were able to get six new people in addition to those that were already asked for in the 2015. Birgit. So I just want you to know that we hear you not just in Cherry Creek, but, you know, northwest Denver and downtown and all'",
        "'speaker_3': 'of the areas that are experiencing this kind of growth. And we know that we have to do a better job. So I just want to make sure that you knew that and I will be supporting this this package tonight.'",
        "'speaker_4': 'Thank you, Councilwoman Shephard. Councilwoman Fox.'",
        "'speaker_0': 'Thank you, Mr. President. I think it is very impressive that so many of you have come representing different interests and all coming to the same conclusion. And for that reason, I'll start with the punch line. If this is what you want, this is what I'll vote for.'",
        "'speaker_0': 'On the other hand, I think the parking reduction is a big, big mistake. And I know that my other colleagues on this council who have great faith that public transit will solve the problems, and I know that Councilwoman Sussman and Council and Rob are working on alternative methods such were mentioned our first speaker.'",
        "'speaker_0': 'I mean people are trying to be creative but I do not believe the kind of reduction that you have asked for and that you want will be solved in any way by public transit or creative transit. And so I would say it's with a heavy heart that I give you what you want.'",
        "'speaker_0': 'I will.'",
        "'speaker_4': 'Thank you. Councilwoman Fox McKinney.'",
        "'speaker_3': 'Hello. Thank you, Mr. President. I did not expect to be following that. I, I wanted to, first of all, thank my colleague, Councilwoman Robb, for a lot of her leadership, sometimes quiet and sometimes forceful. And, you know, this area of town is one that I think everyone has some nostalgic connection to.'",
        "'speaker_3': 'Right. And what I found fascinating when many of us were elected to office in 2011, was how we had to come to terms with our nostalgia about Cherry Creek versus what was really going on in the ground. And it took some of those tours from the bid and the forming the business alliance was just forming and getting'",
        "'speaker_3': 'itself organized at that time and just noticing how many really vacant spaces there were and the, you know, split levels. I don't know the technical term, but the split levels with the steps down and just realizing, you know, as a parent of a one and a half year old at the time, how I didn't use any of'",
        "'speaker_3': 'those because I had a stroller, much less, you know, someone with a mobility disorder, disability. And so I think that you all and I, you know, I credit the business community, I think, for starting that conversation with us and the council.'",
        "'speaker_3': 'And I think that was in some ways the start of this zoning, which is the idea that if you love it, how do you let it evolve and how do you let it grow and how do you come to terms with the fact that it has to change to survive?'",
        "'speaker_3': 'And I think that that was a really hard process. And I think there were fits and starts. But but I really do believe that what has been described and what you all shared, having gone through, was really a process of really coming to terms with the idea that this is the future and it may not be perfect'",
        "'speaker_3': ', but that allowing it to grow and allowing to change the boundaries a little bit is the best hope for that Cherry Creek in its next iteration. It'll look different than our nostalgic memories, but it'll also have potential to really survive and grow.'",
        "'speaker_3': 'And I think that daytime population the other thing I want to say is I know that it was really hard for folks to see some of the individual zoning laws come forward. But the time that it took you to get through this process, I really I fear for what it would have happened if we had stopped all'",
        "'speaker_3': 'development during that time. You know, it's hard to get financing. It's hard to get these projects off the ground. And so I think that this is a pinnacle now, this area rezoning. But I also think that it was a really important catalyst to see those early projects go through as difficult as that was.'",
        "'speaker_3': 'So. So I think that there was a big team effort here on a lot of areas, some folks continuing to move forward with the market while this major process went forward. And and I think that that just deserves a lot of credit and a little reflection.'",
        "'speaker_3': 'And so congratulations. And to all of you who spoke tonight and to especially Councilwoman Robb for her leadership. Well done. Thank you.'",
        "'speaker_4': 'Thank you. Councilwoman Kenney, do we have any other comments from members of council? All right. We're going to roll call on 764, the text amendment. Madam Secretary, roll call.'",
        "'speaker_7': 'Rob. I. Shepherd. I. Susman. Brown. I fight. I can eat. Lemon. Lopez. Monteiro. Nevitt. Hi, Ortega. Hi, Mr. President.'",
        "'speaker_4': 'Hi. Councilwoman can each. Madam Secretary, please both of you announced the results.'",
        "'speaker_7': 'To advice.'",
        "'speaker_4': 'To advise 764 has been placed upon final consideration and does pass. Councilman Fons, will you please put 765 on the floor?'",
        "'speaker_0': 'Certainly, Mr. President, under the council, Bill 765 is placed upon final consideration and do pass it.'",
        "'speaker_4': 'It has been moved and seconded. We're done with comments, Madam Secretary. Roll call.'",
        "'speaker_7': 'Rob Shepherd, Susman Brown Fats. I can eat lemon. Lopez All right. Monteiro Nevett I. Ortega. Mr. President.'",
        "'speaker_8': 'I.'",
        "'speaker_4': 'Kathryn Lopez. Madam Secretary, please close the vote and announce the results. 1212 By 765, the zoning map amendment has been placed upon final consideration and does pass. One Free Adjournment amounts announcement on Monday, November 3rd, 2014. Council will hold a required public hearing on Council Bill 708, approving a proposed First Amendment to the intergovernmental agreement between the'"
    ]
}