{
    "A proclamation Honoring the Dedication of El Viaje (The Journey) and the Annual Summer Solstice.": [
        "'speaker_1': 'I think let's just move on before 55, if you don't mind, Councilman Clark, because now we we can tie it in. Councilman Espinosa counts a proclamation for 55.'",
        "'speaker_2': 'Thank you, Mr. President. Um, so this. I'm going to be reading the proclamation number 16 0455, honoring the dedication of the hour by the journey and the annual summer solstice. Whereas Grupo Tulloch, Danza Azteca is a traditional cultural dance group comprised of adults children dedicated to preserving the indigenous dance of their ancestors ancestors.'",
        "'speaker_2': 'The Mexicana mean America. And. Whereas, Grupo Tulloch is hosting the 2016 summer solstice in La Raza Columbus Park, where family members come to share oral traditions, pray and dance in honor of the rain that grows crops and nourishes our bodies.'",
        "'speaker_2': 'Because without rain, nothing survives. And. Whereas, Grupo Tulloch has been dedicated to the community for the past 36 years, providing direction and guidance with dances and ceremonies in Denver, Colorado, Iceland in the world and throughout the world. And.'",
        "'speaker_2': 'Whereas, the time to water the seeds that need growth and development to heal the sorrows of life, moving from inhumanity to humanity. And. Whereas, for 36 years, Grupo Tulloch has used Onza to educate La Comunidad and to summon our ancestors to walk with us on this historical journey.'",
        "'speaker_2': 'And. Whereas, other forms of art such as mural ism, poetry and La Palabra that emanate and belong to the hint, they are part of our cultural renaissance, produced and communicate communion with Nuestro spirit to have joined us this year to celebrate summer solstice.'",
        "'speaker_2': 'And whereas the mural Elvira The Journey was unveiled Sunday, June 19, telling the historical journey that La Raza has taken in and the ongoing sojourn that remains. And. Whereas, we take the time to honor our ancestors, self, homeland, spirituality and community from Mesoamerica, the Las Americas and throughout the world has arrived.'",
        "'speaker_2': 'And. Whereas, the summer solstice symbolizes the nurturing of our youth who need guidance and vision to create a better tomorrow. And. Whereas, Dunsborough reclaims our identity and spirituality through action and performance in new ways to our communities to pass down to the next seven generations.'",
        "'speaker_2': 'Whereas political, cultural and intellectual development is the basis of human progress, recognizing our past informs the course of history. That is the proclamation. And so I just wanted to. Well, that's the proclamation I won't add any more language at.'",
        "'speaker_1': 'But Councilman, you have to make that motion to adopt Council Regulation 455. Yeah.'",
        "'speaker_2': 'I think that's. Mr. President, I move that proclamation. 455 be adopted.'",
        "'speaker_1': 'Do we have a second? You see, it has been moved and seconded. Councilman Espinoza. Let me see. Do we did you read the sections? Yes. Okay. All right. Councilman Espinoza.'",
        "'speaker_2': 'So I would like to some know there is somebody I would like to invite to receive the proclamation. I need you to sing.'",
        "'speaker_1': 'This is just comments if you want to do comments. Okay, we do the comments. Then we do roll call and then we out of.'",
        "'speaker_2': 'Sorry. You're calling me on the comments? I'm sorry. No problem. So, yeah, I'm surprised. I'm thoroughly amazed because between the procession that preceded the dance and the hours of dancing that went on yesterday, to see that you guys all had the energy to continue to do it.'",
        "'speaker_2': 'Here is thoroughly impressive, but it shows the dedication to this artform and to the community that is inherent in their work and that resonates with David. So the real reason for the I mean, the solstice has and continues and will hopefully forever happen.'",
        "'speaker_2': 'But new to this year's install performance was the dedication of the artwork that was sponsored by Denver Arts and Culture, produced by Dave David here. And that was wonderful. So it was my honor to participate in that dedication of the mural.'",
        "'speaker_2': 'It was a mystical experience. The prayer, I mean, the blessing that you received was incredible and be part of that process. And I'd like to thank Ramon del Castillo, Maria Salazar and Rudy Cheri with Denver Arts and Culture for our arts and venues, for their hard work in coordinating the event.'",
        "'speaker_2': 'I'd also like to thank Carlos and Grupo De look for yesterday's ceremony and tonight's performance. So I've said it enough for David. Your artwork is beautiful and I'm going to be working hard to find out that we properly illuminate that project and that artwork so that it's able to be experienced day and night.'",
        "'speaker_2': 'And now I'd like to thank Ramon for your assistance in actually drafting this this proclamation. Thank you.'",
        "'speaker_1': 'Thank you, Councilman. Councilwoman Gilmore.'",
        "'speaker_7': 'Thank you, Mr. Pro-Tem. I would like to commend my colleague, Councilman Espinosa, for sponsoring this proclamation. And, Madam Secretary, I'd like to have my name added to the proclamation as well. And, you know, I'm just honored to be present here tonight.'",
        "'speaker_7': 'I had forgotten how powerful and centering the drums can be, and it brought me back to that place of center. And so I'm very honored to have been here and been so close and honored to be here and witness and and be part of it.'",
        "'speaker_7': 'So thank you, Councilman. And thank you, Mr. Pro-Tem.'",
        "'speaker_1': 'Thank you, Councilman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. Pro Tem. I want to ask that my name be added as well. And I want to thank Councilman Espinosa for bringing this forward. And I look for your continued work in our community. This is a group that has been around for many, many years, not only sharing the culture with the greater Denver community'",
        "'speaker_6': ', but continuing to ensure that young people carry that tradition on. And if any of you have ever had the opportunity to go to the March powwow and see the different tribes that come from not only every state in the United States, but other countries, and to see the entire floor of the Coliseum filled with dancers that are'",
        "'speaker_6': 'carrying on that tradition, and to see elders and little tiny toddlers dancing on the floor of the Coliseum and sharing that culture with all of us, it's it's just very touching and just gratifying to know that that culture was never lost when you see so many of the atrocities that happened to the Native American community.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Brooks.'",
        "'speaker_2': 'Yeah. Thank you, Mr. President. And I just would love to be a part of this and add my name as well. And I love this group, Grupo CRO Claro. We have had numerous events on the east side, the east side peace walk as well.'",
        "'speaker_2': 'And you guys have been incredible. And what I love is that you all come into a community that's mixed in, diverse with African-Americans as well. And the African the African Aztec Alliance is alive and well. And we appreciate you all for always being present.'",
        "'speaker_0': 'So thank you.'",
        "'speaker_1': 'All right. Thank you, Councilman Brooks. Councilman.'",
        "'speaker_4': 'Thank you, Mr. President. I, too. I thought I'd added my name is a sponsor, but I don't see it. So if you can please add me, that would be great. Thanks.'",
        "'speaker_1': 'Right. Duly noted. Are there any other comments? Well, I was a little premature in my comments, but, you know, I can, you know, attest that the group of dialog has been around for quite a while, I think over 30 years.'",
        "'speaker_1': 'Oh 2636 I think I was two years old when they started to a teen as I was your age. Now I am very proud to hear those drums and to have you here in the chambers. It is definitely full circle.'",
        "'speaker_1': 'And, you know, it's a misnomer to not to. Think about Denver and or even to, you know, welcome folks with America and scientists to Denver because they were here. And this is just as a part as Denver culture, as our skyline or Mile High Stadium or five points or the west side or the east side it is'",
        "'speaker_1': 'and north Denver to I'm looking over how to manage to get mad at me if I don't mention north Denver and it's it's it's a very important tradition. And like I said, for me it's home because I have my, my, my brother from another mother over there and we went to school together.'",
        "'speaker_1': 'And if it wasn't for that and if it wasn't for that culture and that support throughout those years. It's establishing community. You don't you really don't have that that support network if you don't have that. So thank you very much for being in these chambers.'",
        "'speaker_1': 'Madam Secretary, roll call.'",
        "'speaker_5': 'Black eye.'",
        "'speaker_0': 'Brooks i. I.'",
        "'speaker_5': 'Espinoza, I.'",
        "'speaker_0': 'Flynn I.'",
        "'speaker_7': 'Gilmore I.'",
        "'speaker_5': 'The Cashman. Carnage. I knew. Ortega. I Sussman. Mr. President.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'And if I might add, the murals are amazing throughout Denver. Madam Secretary, can you please announce the results?'",
        "'speaker_5': '11 eyes.'",
        "'speaker_1': '11 eyes. The proclamation has passed and been adopted.'",
        "'speaker_0': 'Congratulations, gentlemen, as we know that.'",
        "'speaker_1': 'Councilman Espinoza, is there anybody you would like to receive to the, uh, to the podium to receive the proclamation?'",
        "'speaker_2': 'Thank you, Mr. President. I would like to invite David and Carlos to receive the proclamation. Carlos? I'd like to have you both up to receive the proclamation. Right? Actually. While that headdress is coming, I want everyone to know that David spent six months working on this mural, and it was amazing to see it.'",
        "'speaker_2': 'After I shortly after I was elected to see it in progress, just as sketches, pencil drawings on on pieces of paper, and then getting painted painstakingly, hour after hour, onto these giant pieces. And so to start the work that you see in that building out there today is original artwork.'",
        "'speaker_2': 'It's not a reproduction or anything. It is is the real deal. Thank you.'",
        "'speaker_1': 'Thank you. All right. Thank you. Thank you. All right. Let's move on to do the proclamation with you. Or did you?'",
        "'speaker_2': 'Actually, I'm looking for Amanda. Oh.'",
        "'speaker_1': 'Go ahead, David.'",
        "'speaker_0': 'I just want to say thank you.'",
        "'speaker_2': 'To all the.'",
        "'speaker_0': 'Council here. And I'm really.'",
        "'speaker_8': 'Honored to be here myself.'",
        "'speaker_0': 'With with you all and very honored to have been chosen to create this mural at this park. And I myself also identify with with dance, the culture, the colors, the the symbolism is very important, very powerful, very spiritual.'",
        "'speaker_0': 'That it is very the sounds are very centering for me as well. And there's a lot of respect there. There's a lot of positive energy for everyone, for the children. And that's what I that's what I was when I was the mural.'",
        "'speaker_0': 'That's that's that's what I had in mind, you know.'",
        "'speaker_2': 'It's for everyone.'",
        "'speaker_0': 'And so I hope you if you haven't been able to go out there, I invite you to to to take some time and stop by the park and just see see the painting. And. So thank you very much and honored to be here.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'All right. Thank you, guys. All right. Thanks. Next up, we have. Proclamation. 454. Councilman Clark, this is your proclamation when you read a council proclamation for 54.'",
        "'speaker_8': 'Thank you, Mr. President. Proclamation CP 16 0454 designating the week of June 20th through June 24th as Bike Week, and Wednesday, June 22nd as Bike to Work Day in Denver. Whereas the city and County of Denver partners with the Regional Council, Denver Regional Council of Governments, local bicycling organizations and cycling enthusiasts each year to plan activities and'",
        "'speaker_8': 'events intended to promote awareness of the benefits of bicycling. And. Whereas, Bike to Work Day is an annual event designed to encourage people to ride their bicycles for transportation on a consistent basis to reduce congestion, improve air quality, and benefit public health.'",
        "'speaker_8': 'And. Whereas, the Department of Public Works hosts the Civic Center Park Breakfast Station, one of the largest in the region where cyclists celebrate their commute to work with free snacks, raffle prizes, music and educational outreach offered by organizations in the region.'",
        "'speaker_8': 'And. Whereas, the Department of Public Works is a major contributor in the planning and implementation of Denver's bicycle infrastructure, implementing at least 15 miles of new bikeways annually, and this year installing two protected bikeways on Arapaho and Lawrence Streets in downtown, with vertical separation between bikes and cars, and whose plans to install more protected bike lanes are'",
        "'speaker_8': 'contributing to Denver's designation as a top bicycling city and its inclusion in the People for Bikes Green Lane Project, which provides technical assistance in the installation of bike lanes. And. Whereas, the city now has more than 140 miles of on street bike lanes and SROs and more than 100 miles of off street trails, offering recreational opportunities along'",
        "'speaker_8': 'scenic routes and is in the process of constructing the 35th 36th Street Bridge, an important pedestrian and bicycle connection from the new RTD East Line and will begin work on the Brighton Boulevard bicycle facility in the near future.'",
        "'speaker_8': 'And. Whereas, Denver is supporting bicycling in other new and creative ways, offering on street bike crawls and bike sharing stations near places where people gather with the goal of supporting local businesses and making bike riding an attractive way to get around for more of Denver residents.'",
        "'speaker_8': 'And. Whereas, bicycle and pedestrian safety and infrastructure continues to be a top priority for the Denver City Council and the city and county of Denver, which is supporting funding for additional and expedited multimodal improvements that will increase bicycling in our city now therefore be proclaimed by the City Council of the City and County of Denver, Section one'",
        "'speaker_8': 'that the Council designates the week June 20th through June 24th, 2016 as Bike Week, and June 22nd as Bike to Work Day and encourages citizens to keep their heads up and watch out for one another and stay safe this summer, no matter what mode of travel Section two that the clerk of the city and county of Denver'",
        "'speaker_8': 'shall attest and affects the seal of the city and county of Denver to this proclamation, and that a copy hereof be forwarded to the Manager of Public Works.'",
        "'speaker_1': 'All right, Councilman. Clerk, your motion to adopt.'",
        "'speaker_8': 'Thank you, Mr. President. I move the proclamation for 54 to be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Councilman, is would you like to make any comments to start us off?'"
    ],
    "A proclamation designating the week of June 20 through June 24 as Bike Week and Wednesday, June 22, as Bike to Work Day in Denver.\n": [
        "'speaker_8': 'Yes. Thank you, Mr. President. I don't think it's any secret that I am an avid bike fan. And so it's very exciting for me to be able to put forth a proclamation about Bike Week and Bike to Work Day.'",
        "'speaker_8': 'I think every day should be Bike to Work Day, and I did ride my bike to work today. My bike is sitting down in the parking lot tied up to my parking post. I think that as our city continues to grow 18,000 new people in the last year, we have to continue to invest in our infrastructure that'",
        "'speaker_8': 'allows people choices. You know, I don't see a bike as or promoting bicycling as telling people that they shouldn't or can't get in their cars. It's about you have the option to ride your bike. And I'll tell you that when I really adopted riding my bike around town, not just to work but to the grocery store and'",
        "'speaker_8': 'everywhere that I possibly can, I started to realize just how frustrating it is to get around town in a car. And when you are outside and enjoying the breeze and the sun and you can hear the birds and the trees and you're cruisin down the street, it's a totally different experience when you get back in your car'",
        "'speaker_8': '. And so I think this week is really about educating people and spreading the word that everybody can ride their bike somewhere during their day. And I really do think that it has significantly enhanced my quality of life. And so I'd encourage everybody to dust off that bike, rent a bicycle and get on the bike this week and'",
        "'speaker_8': 'give it a try. And hopefully it becomes something that is a regular part of your routine. I also have to say that when I first started bike commuting, I wasn't quite the spandex writer, but it was very much about how quickly can I get from point A to point B, which led to a lot of very sweaty'",
        "'speaker_8': 'and smelly meetings for me at work, which was unpleasant and wasn't helping me think that biking to work was better than sitting in my air conditioned car. But it was really through the Green Lanes project that I started to learn about different cities who really have embraced a bike culture where where a huge portion of people use'",
        "'speaker_8': 'the bicycle to get around town. And when I was touring around with this one gentleman, he was wearing his suit on on a bike. And I was like, This is crazy. I've never seen this before. What are you doing?'",
        "'speaker_8': 'And and I started asking him questions and I said, I said one of the things I said, don't you get hot and get sweaty wearing your suit on your bike? And he said, You know, if I start to sweat, I stop pedaling.'",
        "'speaker_8': 'It's not about getting there fast. It's about enjoying the ride and being ready to hop into a meeting, not sweaty when I get there. And so I've adopted that mantra, and many of my constituents in District seven have seen me riding around town in my modified mountain bike that I made, as you know, these great.'",
        "'speaker_8': 'It doesn't look cool, but it is awesome because it has great baskets on it that I can throw on my gear and I ride with my suit jacket on when it's cold and I folded up and put it in a basket when it's cool, roll up my sleeves and ride in my work clothes.'",
        "'speaker_8': 'So I encourage everybody to think outside the box. Throw away what you think you know about bike commuting dust off that bike. And let's let's do this Denver for bike week and Bike to Work Day. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Brooks.'",
        "'speaker_2': 'Thank you. Thank you, Mr. President. And thank you, Councilman Clarke, for for bringing this up. And I think Councilman Clarke hit most of my comments around the importance of taking this serious as back as, you know, back to work day for our community.'",
        "'speaker_2': 'I guess I want to elevate the conversation to the importance of us investing in a system that works and putting bikes in their place. I get a lot of I get a lot of constituents criticizing bike users because they're all over the place.'",
        "'speaker_2': 'And what I tell my constituents is try riding a bike for one day in this city and you will see why folks are all over the place. The system is not complete in our city. There's a lot of things in our city that it stops, right?'",
        "'speaker_2': 'You know, a lane will go three blocks in in a slap stop and throw you right on to Broadway. And they say, okay, good luck. And so.'",
        "'speaker_0': 'That's.'",
        "'speaker_2': 'One of the reasons we have to invest in this network, because we know that 60% of people who do not ride will ride when they get a protected bike lane, a consistent system that is safe all the way to their destination.'",
        "'speaker_2': 'And so it's important that we look at that. And I was a part of the Green Lanes project that Councilman Clark was talking about, and I saw myself as a supporter. I came back from the project and became an advocate.'",
        "'speaker_2': 'So you too will see a brother with a suit on in District nine every once in a while. It's a weird sight. But it's important that we model this. It's important that we use multi-modal city options in our city.'",
        "'speaker_2': 'We are growing fast, and we shouldn't always have to rely on one mode of transportation. And I just think that the last thing that I'll say is for those motorists who are upset at bikes and you you're frustrated at them, they actually help because the more folks who are riding a bike, the quicker you're going to get'",
        "'speaker_2': 'to your next destination. So next time you're riding your car, make sure you look out. Don't park in the bike lane. That's for them. Make sure you're looking in both of your mirrors to see oncoming traffic for bikes.'",
        "'speaker_2': 'And and let's support this and let's be a city that does as well. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Brooks, Councilman Cashman.'",
        "'speaker_0': 'Thank you. Thank you, Mr. President. Pro tem. So historically, I've been more of a runner than a cyclist. At the encouragement of my friends by Denver. As of this past weekend, I have returned to the wheeled set and took my my new bike out for a spin this past weekend.'",
        "'speaker_0': 'And I'd like to report that the eight year old in me is alive and well. And besides it being a great way to keep in touch with our neighborhoods and get around town in a more relaxed fashion. I just found it.'",
        "'speaker_0': 'I found that same thrill that I found as a kid. And I also got more in touch with the temptation to not stop it. Stop stop signs, which is what cyclists are required to do. And as I did so, it just I empathized with that feeling of just wanting to fly around town.'",
        "'speaker_0': 'And I just closed by saying, I'm making a promise to all my constituents to limit the use of brightly covered spandex in our residential neighborhoods. Thank you, Mr. President.'",
        "'speaker_1': 'I'd say thank you, but I don't know about that. I'm just kidding. Thank you, Mr.. Mr.. Councilman. Councilwoman can each.'",
        "'speaker_4': 'Thank you, Mr. President. May I please also be added as a co-sponsor for this one? And the only thing I will add to my colleague's great comments is just that I am. I dropped my son off every day for camp in the summer at the South Platte River.'",
        "'speaker_4': 'The organization that my colleague, Councilman Clark, used to run. And I have to drop him off by car because he's not a confident enough driver yet or rider yet to be in the streets. He probably would be able to bike to camp with me if he were in a protected lane.'",
        "'speaker_4': 'But we don't have one yet for my neighborhood, and so I drop him off. But it is a dangerous crossing to drop him off because the bike path along the Cherry Creek River is like a freeway. It is a freeway of cyclists commuting into this city.'",
        "'speaker_4': 'And I love that. I love that we sometimes have to wait 5 minutes while bikes zoom by us to get to the drop off, because it just shows that there are so many individuals commuting, especially to our downtown to work, and that our trail system is a really important piece of that of that infrastructure.'",
        "'speaker_4': 'So I think it's a trail system to be proud of. We talk a lot about protected bike lanes and we do have a lot, a long way to go. But we have an amazing trail system with more miles than many cities of our size where you can ride off, off, off road.'",
        "'speaker_4': 'So if that works and you can get to one of those trails, it's a really good way to warm up with this bike to work thing. Thanks so much.'",
        "'speaker_1': 'Thank you. Councilwoman, are there any other comments on this particular proclamation? All right, Councilman Sussman?'",
        "'speaker_5': 'Oh, I just wanted to say thank you so much.'",
        "'speaker_4': 'For bringing the.'",
        "'speaker_5': 'Proclamation. I, too, am.'",
        "'speaker_4': 'A avid bike rider and just want to let you know that wearing a suit and a to a bike in, it's a very.'",
        "'speaker_5': 'Good accomplishment. But you should try it with a.'",
        "'speaker_4': 'Dress and heels. That's not easy to do, but.'",
        "'speaker_5': 'It can be done.'",
        "'speaker_1': 'Councilman. I think you just challenged him to wear a dress. Yes.'",
        "'speaker_6': 'Oh, yeah. Okay.'",
        "'speaker_4': 'Yeah, that.'",
        "'speaker_1': 'You can do it. I'll tell him. And thank you for it. Thank you, Councilman, for pulling this proclamation together. Any time we can talk about the need for bicycle infrastructure in these chambers. And on this day, as I think it's a very important thing, Denver's rapidly growing as you are, who are driving now that there are no'",
        "'speaker_1': 'more shortcuts to get anywhere in Denver. And unless.'",
        "'speaker_2': 'You.'",
        "'speaker_1': 'Want to bike. And it is important that having said that, yes, it's important that we get folks out to to use our bicycles, but we need that infrastructure in particular on the West Side. We need to be able to bike across Colfax.'",
        "'speaker_1': 'And that is the challenge. For us in this in this room is to connect that city, to connect our city from one end to the other, not just by vehicle, but also by foot and bicycle. So you try going back up on Colfax.'",
        "'speaker_1': 'I mean, you may get here, you may come here and not have so much sweat because you're coming down hill. But when you go back up, I tell you what, my dry cleaning bills would be very expensive. It's very hard to get back up.'",
        "'speaker_1': 'All right. Madam Secretary, roll call.'",
        "'speaker_0': 'Clerk by black.'",
        "'speaker_4': 'Tie.'",
        "'speaker_0': 'Brooks I.'",
        "'speaker_5': 'Espinosa, I.'",
        "'speaker_0': 'Flynn I.'",
        "'speaker_4': 'Gilmore, I.'",
        "'speaker_5': 'Cashman Carnage. New. Ortega assessment. Mr. President.'",
        "'speaker_1': 'High. Please announce the results.'",
        "'speaker_5': 'Of your books. Thank you, sir. 11 eyes.'",
        "'speaker_1': '11 eyes. The proclamation has been adopted. Adopted? Councilman Clark. Is there anybody you want to bring up to the podium?'",
        "'speaker_8': 'Thank you, Mr. President. I'd like to invite Dan Ryan up to receive the proclamation.'",
        "'speaker_0': 'Thank you, Councilmember. Please allow me to introduce my coworker, Rachel Bronson. We together work on the bi team public works and thank you all very much for supporting bicycling in Denver. While Public Works takes the lead on Bike to Work Day, you know, it's really about all our partners, whether it's Parks and Recreation, Department of the Civic'",
        "'speaker_0': 'Center or Arts and venue for providing all the tables or folks with them. Public Works, Denver Water, all the sponsors and vendors that come out to support bicycling and sustainability and transportation and all those good.'",
        "'speaker_2': 'Things that make Denver great.'",
        "'speaker_0': 'So while Wednesdays Bike to Work Day, it's not the only bike to work day, every day is Bike to work day. So we hope to see you on Wednesday and frankly, every other day. All right.'",
        "'speaker_1': 'Thank you. All right. Resolutions. Time for resolutions. Madam Secretary, will you please read the resolutions?'",
        "'speaker_5': 'From Business Development for 11, a resolution approving a proposed amendment assumption modification modification agreement between the city and county of Denver, Saint Charles Holding Company, LLC and 4331 Morrison Road LLP assigning the loan to 4331 Morrison Road LLP 412 A resolution approving a proposed amendment assumption and modification agreement between the city and county of Denver.'",
        "'speaker_5': 'Saint Charles Holding Company, LLC and 4331 Morrison Rohde LLP signing of the loan to 4331 Morrison Road LLP from Financing Services for 07a resolution approving a proposed amendment to a master purchase order between the city and county of Denver and O'Meara Ford Center, Inc. to increase the maximum amount for the purchase of light trucks.'",
        "'speaker_5': 'Truck parts please me before 16, a resolution approving a proposed purchase order between the city and County of Denver and Worldwide Technology Inc. to purchase and install servers and assorted equipment to upgrade the city's primary technology storage platform from Governance and Charter Review.'",
        "'speaker_5': '422 A resolution approving a proposed second a mandatory agreement by and between the City and County of Denver and School Soft Corp. for a learning content service from infrastructure and culture. 369 A resolution approving a proposed contract between the city and county of Denver and Sky Blue Builders, LLC for installation of protected bike lane and neighborhood bikeway'",
        "'speaker_5': 'facilities. 370 A resolution approving a proposed agreement between the City and county of Denver and Broadway Station Partners LLC concerning environmental standards, open space vested rights and horizontal infrastructure design and construction related to the development of a portion of the former gates rubber factory site I-25 and Broadway.'",
        "'speaker_5': '403a resolution approving two proposed purchase orders between the city and county of Denver and Trans West Truck Inc. and O.J. Watson Equip Co Inc. to manufacture and deliver seven quad axle Freightliner cabin choices with dump plow and spreader bodies fully installed for zero eight.'",
        "'speaker_5': 'A resolution approving a proposed amendment to the master purchase order between the City and County of Denver and EP Laser LLC, doing business as John Elway Chevrolet to increase the maximum amount for the purchase of light truck parts.'",
        "'speaker_1': 'Right. Madam Secretary, Bills for introduction. Will you please read the bill for introduction tonight.'",
        "'speaker_5': 'From Infrastructure and Culture for 24. A bill for an ordinance to vacate six inches of sidewalk adjacent to the building at 1601 way Water Street along Chestnut Place at 16th Street without reservations from neighborhoods in planning 395 a bill for an ordinance designating 1899 York Street, the ghost Rose House as a structure for preservation.'",
        "'speaker_1': 'All right. Now, let me to recap. But before I do that, this is your last opportunity to call out an item. Councilman Espinoza, will you be making the motions this evening?'",
        "'speaker_2': 'Yes, I will.'",
        "'speaker_1': 'All right. Let's do a recap. On page three, I'm going to make a comment on 412 416 Councilman Ortega. 316 Councilman Clark and Flynn have called that out and 370 Councilman Clark has filled that out. Councilman Clark, on the resolutions you called 370 what did you want to do with this particular resolution?'",
        "'speaker_8': 'Thank you, Mr. President. I'd like to postpone adoption of this companion resolution at the conclusion of the public hearing this evening, scheduled.'",
        "'speaker_0': 'After.'",
        "'speaker_8': 'The recess on Council Bill three one for changing the zoning classification for multiple addresses at 800 to 100 block South Broadway.'",
        "'speaker_1': 'All right, Councilman Espinosa, will you please put Resolution 370 on the floor?'",
        "'speaker_2': 'Thank you, Mr. President. I move the resolution 370 be adopted.'",
        "'speaker_1': 'All right, Councilman. Clerk. Emotional. Postpone.'",
        "'speaker_8': 'Thank you, Mr. President. I move that adoption of resolution 370 be postponed at the conclusion of the public hearing this evening, scheduled after the recess on council will 314 and that speakers be allowed to also address this companion resolution during the public hearing on Council Bill three one for changing the zoning classification for multiple addresses at 810'",
        "'speaker_8': '100 block South Broadway.'",
        "'speaker_1': 'Thank you. Councilman has been moved and seconded. Madam Secretary, roll call on the postponement.'",
        "'speaker_5': 'Black Eye.'",
        "'speaker_0': 'Brooks I.'",
        "'speaker_5': 'Clerk by Espinosa.'",
        "'speaker_0': 'Flynn I.'",
        "'speaker_5': 'Gilmore, i. Cashman. Carnage. New. Ortega I. SUSSMAN Mr. President.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Please close the voting and announce our vote. Results are actually counts. Okay. Yeah.'",
        "'speaker_5': '11 eyes.'",
        "'speaker_1': '11 eyes. The resolution, the adoption of Resolution 370 will be postponed after the conclusion of the public hearing this evening, scheduled after the recess on Council Bill 314. Thank you, Councilman Clark on. Page three 416 Councilman Ortega, you called this resolution out.'"
    ],
    "A resolution approving a proposed Contract between the City and County of Denver and Sky Blue Builders LLC for installation of protected bike lane and neighborhood bikeway facilities.\n (INFRASTRUCTURE & CULTURE) Approves a three-year $5,607,581.34 on-call contract with Sky Blue Builders for installation of protected bicycle lane and neighborhood bikeway facilities including curb and drainage reconfiguration, pavement markings, bicycle loop and rack parking, and signage (201626972). The last regularly scheduled Council meeting within the 30-day review period is on 7-11-16.  The Committee approved filing this bill by consent on 5-19-16.": [
        "'speaker_8': 'I was just wondering if somebody could come up from public works, introduce yourself and kind of tell us where this money will be spent in our city. That would be fantastic.'",
        "'speaker_12': 'Certainly. Thank you, Mr. Scott. The Microcosmic Denver Public Works, transportation and mobility. So in general, the 2016 enhanced bikeway contract is in two umbrellas protected bike lane facilities like Lawrence and Arapahoe Downtown and Neighborhood Bikeway facilities, which is a new type of facility that we're introducing in Denver, the first of which will be a Knox court between'",
        "'speaker_12': 'Kentucky and Alameda.'",
        "'speaker_8': 'Right. And and you referenced some of the projects that are already done. What are the projects that are planned to spend this money on?'",
        "'speaker_1': 'So, so.'",
        "'speaker_12': 'And Chichi, thank you for the levity on time. Knox Court Neighborhood Bikeway, the 13th 35th Avenue Neighborhood Bikeway, The Traffic Signal at 21st and Broadway. Three components of the Garfield Neighborhood Bikeway, which is Alameda and Garfield, Cherry Creek Drive, North and Dakota, which is at the.'",
        "'speaker_1': 'South End and.'",
        "'speaker_12': '17th in Garfield, which is at the North End, then on the protected bike lane front, the 14th Street Market to.'",
        "'speaker_0': 'Colfax.'",
        "'speaker_12': 'And Stout Street, 19th Street to 26th Street and 14th Avenue. Spirit of Panic are all protected bike lanes. These are all in design right now that we would envision building with this contract.'",
        "'speaker_8': 'Thank you so much. Thank you, Mr. President.'",
        "'speaker_1': 'Councilman Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. I more question. This is a these services are listed as being on call. Why are we doing this long haul? Are they not going to we don't know if we're going to do all these.'",
        "'speaker_3': 'No, we may do more different ones.'",
        "'speaker_12': 'So so the nature of on call contracting. I started preparing this contract October 2015. It takes a long time to prepare these and we want to be flexible and nimble enough to be able deliver these facilities onto the level that we described earlier today.'",
        "'speaker_12': 'The when you want to be able to deliver 15 miles of bike lanes, three protected bike facilities and neighborhood by neighborhood bikeways all in the same year, and just the sheer volume of number of types of facilities is kind of it would be a really more challenging thing to provide.'",
        "'speaker_12': 'These facilities will vary in the five figures to close to 500,000 range each one of them. So it's enough that they're kind of under the gun. You wouldn't want to let each one of them separately, but there's still we need to deliver a lot of them in a short amount of time.'",
        "'speaker_3': 'So it's okay. So we don't have final pricing on any single one of them. And so we're just going to make an on call work order as we as we're ready to roll them out, correct? Okay. Yeah. Thank you.'",
        "'speaker_3': 'That's all.'",
        "'speaker_1': 'And you, Councilman Councilman Brooks, you chimed in.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_2': 'One quick question. Sorry to keep you up here. The 19th and 20th uptown is is that's already been funded. So this is not a part of that contract.'",
        "'speaker_1': 'Thank you. Thank you. All right. That looks like all the other bills. I did have a comment on 412. Madam Secretary, we can put forth full council resolution for 12 colleagues. I wanted to make a comment on this and pull it out because it is actually pretty significant.'"
    ],
    "Amends a  $2 million loan to St. Charles Holding Company, LLC to 1) assign the loan to a new borrower, Morrison Road, LLLP, 2) assign property to Morrison Road, LLLP, 3) authorize the Director of the Office of Economic Development to administer the loan, 4) extend the performance period of the loan for the property acquisition and future development of 197 affordable income-restricted units at 4325-4331 Morrison Road and 4404 Morrison Road, formerly known as the Belmont and Shady Nook trailer parks (2793-01).": [
        "'speaker_1': 'A while back, this what this does is this amends a current contract that's moving forward. It means a loan for us to be able to help with an amazing project on Morrison Road in my district. This is the former mobile park site, the Shady Nook and Belmont Homes on Morrison Road.'",
        "'speaker_1': 'If you do recall, a few years ago, they came under some serious violations, about 36 of them on the property which triggered the fire department to show up. They found a lot of conditions that were deplorable at this trailer park site.'",
        "'speaker_1': 'We took a lot of a lot of flack for it because this is what we do. We can't allow those kind of conditions to exist. A lot of folks who are living in these trailers are living in some substandard conditions, I would say third world style conditions.'",
        "'speaker_1': 'And I would walk over there to be smelling like liquid propane tanks. Well, like they were leaking and you could smell it. And that's why the firefighters had showed up. People's pipes are freezing. A lot of different crazy violations.'",
        "'speaker_1': 'The choice was at the time, either we do nothing and turn a blind eye and let something miserable happen to this. And a lot of the folks who were there or actually do something about it, which also triggered a termination notice.'",
        "'speaker_1': 'And under that that that termination notice and those violations, the the property owner was able to negotiate with the city. We were able to give them the right to care in that time. We had somebody come to the table at Saint Charles, which is what you see here, and offered to buy the parks and not only address'",
        "'speaker_1': 'the issues, but help relocate. He purposefully triggered the Federal Uniform Relocation Act, which creates a mandatory relocation of all residents and mandatory benefits that kick in. So here's the short of the story. By this moving forward, it allows it to happen.'",
        "'speaker_1': 'It continues alone. And what this does and just as an update. Almost every single one of those folks who were formerly living in a trailer are now in a better spot. Some of them with the relocation benefits and with the help from the city, were able to actually put a down payment on their first home.'",
        "'speaker_1': 'It's a remarkable project that's happening here and a great story because as those those trailers are being sold and recycled and scrapped and the property cleaned up, they're going to build 197 affordable units with its own football court garden spaces along Morrison Road.'",
        "'speaker_1': 'And all those folks who used to live at that site now have first right of refusal if they want to come back to a new, safe, sanitary and decent unit. So. Sometimes these things just move forward. But that's too amazing of a story for us to pass by.'",
        "'speaker_1': 'And I just wanted to call attention to that and just think that apart our Office of Economic Development, the men and women that work in that particular department, they did a tremendous amount of job working with every single resident, working with the neighborhood.'",
        "'speaker_1': 'It is an amazing project that's moving forward and I'm proud of and I've seen it happen on my watch and through these chambers. Councilman Ortega, you chimed in also important.'",
        "'speaker_6': 'Councilman Luis I just wanted to first state that it takes a catalyst to make something like this happen. And I can remember you inviting me out to tour the site and seeing garden hoses connecting the propane tanks to the trailers, and they were exposed.'",
        "'speaker_6': 'Kids are playing, sometimes tripping over them. I mean, talking about a serious hazard. That was an accident waiting to happen. So I just want to thank you for your efforts. I know you have received criticism from folks, you know, talking about displacing those poor people and where are they going to go.'",
        "'speaker_6': 'But it was through the work that you did with our Office of Economic Development in making sure that the families who lived in those trailers were relocated. And as you said, they'll have first refusal to move back there.'",
        "'speaker_6': 'But it was a deplorable situation. And I'm really grateful for your efforts because we didn't wait for something bad to happen before trying to take action. So thank you.'",
        "'speaker_1': 'Thank you, Councilman. I appreciate that. All right. We are ready for the block votes. All bills on introduction are ordered published. Councilman Espinosa, will you please put the resolutions on the floor for adoption?'",
        "'speaker_2': 'Thank you, Mr. President. I move that the following resolutions be adopted in a block. C.R. 16 041106 All series 16 actually 041204070416042203690403 and 0408.'",
        "'speaker_1': 'Thank you, Councilman. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_5': 'Black eye, Brooks. Clark.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Espinoza.'",
        "'speaker_2': 'I. Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Gilmore.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Cashman. Carnage. New. Ortega. Hi. Sorry, Ortega. I said I'm sorry. SUSSMAN Hi, Mr. President.'",
        "'speaker_1': 'Hi, Madam Secretary. Because the voting announced the results.'",
        "'speaker_5': '11 eyes.'",
        "'speaker_1': '11 eyes. The resolutions have been adopted. Councilman Espinoza, where you put the bills on final consideration on the floor.'",
        "'speaker_2': 'Thank you, Mr. President. And with the following bills being placed on final consideration and do pass in a bloc. The Council Bill 16 0418 and Council Bill 16 0406 and Council Bill 16 0371.'"
    ],
    "Rezones property at 3441 W. 39th Avenue & 3914 N. King Street from PUD #406 to U-SU-B1 in Council District 1. (NEIGHBORHOODS AND PLANNING) Rezones property at 3441 W. 39th Avenue & 3914 N. King Street from PUD #406 to U-SU-B1 (urban, single unit, 4500 minimum lot size, 1 accessory dwelling unit allowed) in Council District 1. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 4-13-16.": [
        "'speaker_5': 'zone lot area of 4500 square feet. Also allowing for adu use. To understand the existing zoning context, you can see that the site is PD 406 and is entirely surrounded by the zoning of USC. Up 1b1. Excuse me.'",
        "'speaker_5': 'The existing zoning was constructed in 1996 and its intent was to permit child care and community uses. That child care uses were restricted to 3000 square feet, which is approximately that of the single family residential and the community use restriction was limited to about 12,000 square feet, which is that of the Robert Steele gymnasium.'",
        "'speaker_5': 'Additionally, this PDR was based on the former R two zone district, and what it specifically allows for is the maintained use of those are two regulations in addition to the child care and the community use. In terms of the historic structures on the site.'",
        "'speaker_5': 'The Robertsville Gymnasium is located on the State Register and currently the Denver Square does hold a certificate of non historic status. From a land use perspective and looking at the existing context, we can see that the surrounding neighborhood is predominantly single family residential, with also duplexes categorized as multi-family low rise.'",
        "'speaker_5': 'The site itself is categorized as recreation, where the gymnasium is for the previous Boys and Girls Club and the Preschool Center is categorized as public, quasi public. To give you a few photos to acquaint yourself with the site.'",
        "'speaker_5': 'The Robert Steele Gymnasium is at Mission Revival and fronting King Street, and the residential structure is fronting 39th Avenue and some surrounding photos of the residences in the area. To provide a summary of the public notice, we received a receipt of complete application in December of 2015 with the Planning Board Public Hearing on March 30th of this'",
        "'speaker_5': 'year. The Planning Committee moved it forward on April 13th of 2016, and we are here tonight on June 20th, 2016. All Arnaud's within a 200 foot boundary of the site have been notified at the point of this presentation that was produced on Thursday.'",
        "'speaker_5': 'There were 17 letters that have been received in total, six letters in opposition and 11 letters in support. It's my understanding that some additional letters have been forwarded on to you guys in the meantime. I will highlight that a protest petition has been placed on this site and that in view of that 24%, 20 or more percent'",
        "'speaker_5': 'of the property owners or excuse me, of the land area within the 200 foot boundary. It will require a cast of ten affirmative votes for the passage. And so we had 22.6% residents sign on. A total area of 59,841 square feet.'",
        "'speaker_5': 'Next, they'll go through the review criteria outlined by the Denver zoning code, the first of which is consistency with adopted plans for this area. We have two citywide plans of comp plan 2000 as well as blueprint done for the land use and transportation plan and review of comp plan 2000.'",
        "'speaker_5': 'There's a variety of strategies, a few of which I will highlight in the land use strategy strategies. We are looking to broaden the variety of compatible uses within the neighborhood, working with economic activities, strategy to support and collaborate, effort for business, educational institutions to enhance the supply and quality of childcare.'",
        "'speaker_5': 'Also wanting to continue to foster the integrity of livable neighborhoods and support high quality, comprehensive preschool education. Moving forward, the blueprint Denver. The land use recommendation for the subject site and surrounding area is single family residential, with the recommendation that single family homes are the predominant residential type.'",
        "'speaker_5': 'Also, please note that this site is within the area of stability. The future street classification of both 39th as well as King Streets are designated locals and intended to serve more localized neighborhood serving trips. As a result, CPD finds that the rezoning is consistent with Trump Plan 2000 as well as blueprint done for the land use and'",
        "'speaker_5': 'transportation plan. We also find that it applies a uniformity of district regulations and furthers the public health, safety and welfare. Additionally, the justifying circumstances within this area is that we note that there is an evolving community demand for communities serving needs within the neighborhoods as we see an increase of families moving back into the city and that'",
        "'speaker_5': 'that growth. Additionally, we have the adoption of the 2010 Denver Zoning Code, which provides greater flexibility and opportunities for these uses. And as a result, CPD finds that these criteria are met. And finally, we do find that it meets the neighborhood context or excuse me, the zone district context, purpose and intent and applies in that.'",
        "'speaker_5': 'As a result, CPD recommends approval based on the findings. All these review criteria have been met. Thank you.'",
        "'speaker_1': 'Thank you. So excellent staff report. I am going to start calling folks up to speak this evening. I'm going to call the first five speakers. If you can make your way up to the bench right here at the front, this will help with all the other proceedings.'",
        "'speaker_1': 'So when I when I call the next five, just make sure that that bench right there is reserved for them. The first speaker that we have is David McMurtry. Yep. Come to the podium. You have 3 minutes. And correct me if I'm mispronouncing your name.'",
        "'speaker_13': 'McMurtry is correct.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_13': 'And I believe I was given three additional minutes.'",
        "'speaker_1': 'Who gave you three additional Ryan.'",
        "'speaker_13': 'Howard right there.'",
        "'speaker_1': 'Okay, good. You got six. Go for it.'",
        "'speaker_13': 'Okay. My name is David McMurtry. And along with my wife, we are the ones applying for this zoning application being discussed. A special thank you goes to Councilman Espinosa. I know we did not see things eye at first, but your willingness, along with Amanda Sandoval, John Olson and Levinsky and historic Denver to work to create a compromise'",
        "'speaker_13': 'is something that I am truly grateful for. I would also like to thank Brian Stammer for being so supportive during this entire process. Lastly, I would like to thank my district representative, Councilman Cashman. Now I'm going to go off what I had prepared just for a second to give a little background.'",
        "'speaker_13': 'Last Friday, a group of neighbors filed the protest petition requiring the majority or the super majority of votes of ten as of 330 today. An email was sent to a lot of the parties that were involved in this, saying that they were withdrawing their opposition to the project and as has been relieved, confirmed.'",
        "'speaker_13': 'Nobody from the opposition has shown up. I'm going to read some parts of mine, but just because of brevity and to help honor everybody's time in this room, I've pushed it so that myself shall speak. My wife shall speak, and any from historic Denver shall speak.'",
        "'speaker_13': 'There's probably eight or nine other people all wearing the fancy little buttons that came here to speak in support. And I asked them not to speak at this point unless for some reason the council finds reason to bring them back up to speak on our behalf.'",
        "'speaker_13': 'So that being said, there was a very, very vocal but small group of neighbors that had not at the time gotten behind the compromise. Their number one concern from the beginning was the preservation of the building and honoring its past to quote one of the concerned neighbors in an article she wrote in North Denver Tribune about a'",
        "'speaker_13': 'year ago. She states the Robert Steele gymnasium is a community treasure and has benefited North Denver families for more than 100 years. Denver wants to build for the future and preserve what is valuable from the past. Sensitivity and responsibility will be required in order to balance the gymnasium history and importance in this community.'",
        "'speaker_13': 'I could not agree more. Plus, the picture shows I call it the Little Alamo. But why I'm so frustrated by all the attention that had been created up until today is that everything the neighbors wanted was right in front of them.'",
        "'speaker_13': 'If the council wants to honor the past and find an owner to turn the building into a child care facility and continue the tradition of serving northwest Denver youth started over 100 years ago by Reverend Rudolph. If the council wants to make sure that the building remains for future generations and is preserved, then find an owner who'",
        "'speaker_13': 'is willing to put over $1.5 million into renovations, bringing the building up to code with modern air heating and plumbing. While not in any significant way altering the building we have pushed, the boundary of the building will allow to make the history respected.'",
        "'speaker_13': 'We are going to have the highest ceiling of any. Got it in the country. We are going to be the only Goddard School in the country with a basketball gymnasium floor for classroom. For the classroom. We intend to create a museum along two walls of the school to celebrate all the images and stories of the property that'",
        "'speaker_13': 'I have collected up to this point. This is being done not because it is the best practice of being a child care facility, but because those that walk into the building will immediately feel the historic nature of not just the building, but the Northwest Denver community since time is short.'",
        "'speaker_13': 'I will bring up two additional issues that the neighbors brought up. They wanted the additional protection of the Rudolph Four Square. We met that with a two year covenant and we have acquired a zone zoning permanent permit dating May 18th of this year that specifically allows for continued use of the space as a child care facility.'",
        "'speaker_13': 'Let me be very clear. Not only is it our desire to turn the House into an annex for STEM learning, art and extracurricular activities, but keeping the house is in our best interest. If we demolish the building, we will lose square footage that we will never be able to gain back.'",
        "'speaker_13': 'It is a tough balance when neighbors put financial burden of updating a building that has had a ton of work done over the past 50 years on owners who have already leveraged most of their personal assets into the upkeep and updating of the gym.'",
        "'speaker_13': 'All we asked for at the time was flexibility as we figured out the best way to deal with the building. A third concern presented by the neighbors parking and traffic. For this, we are looking to the leadership of those that have done it before and are intimate with the inner workings of the neighborhood.'",
        "'speaker_13': 'Councilman Espinosa's office has told the neighbors that they are committed to working through their concerns along with the city, myself and this along with my city in the self ones, zoning has passed and in addition, we are in negotiations with the nearby U.S. Bank and Skinner Middle School to allow our staff to park on their property as'",
        "'speaker_13': 'requested by the neighbors. I will skip some and kind of come to the conclusion, which is I would like all of us to take a deep breath. And while it may seem very simple now, for the past few months, it has been very tense and strenuous and emotional at times.'",
        "'speaker_13': 'But the bigger picture is that there is a massive shortage of early childhood education in the city, not just in northwest Denver. Our school, while not going to solve that problem, will play a role in this issue. We are not big developers.'",
        "'speaker_13': 'We are a husband and wife, both raised in Colorado that have a dream to own a small business and at the science and at the same time make a lasting educational impact. If we don't get our zoning passed tonight, then who is next?'",
        "'speaker_13': 'The line will be out the doors with developers drooling at the opportunity to build something on a city property. Zoned us sub one. This is not what anybody wants. So I can look at all of you in the eyes tonight and I mean this genuinely, that this is not going to be just a school, that this is'",
        "'speaker_13': 'going to be something that the members and residents of Northwest Denver are proud of, but the city at large as well. So, again, I really appreciate your time and that's all I have to say.'",
        "'speaker_1': 'Thank you, Mr. McMurtry. Before I call it the next speaker, I want to look over at our assistant city attorney. Dave brought in your testimony just now. You mentioned about pulling a petition or sending an email that you pulled your petition.'",
        "'speaker_1': 'Is that true? Can we.'",
        "'speaker_13': 'There.'",
        "'speaker_1': 'From that? Go ahead. I don't see any email popping.'",
        "'speaker_13': 'And you may not have gotten it, so I got it. Rafael Councilman Espinosa.'",
        "'speaker_1': 'So that makes a difference in terms of the words, I don't know. I don't want to interrupt the process here, but I just wanted to.'",
        "'speaker_2': 'Good evening. Members of council, namely Sarah. Assistant City Attorney, Section 12 410 five Zoning Code, specifically Subsection B provides that any protest, petition or withdrawal of the protest petition shall be received seven days prior to the public hearing.'",
        "'speaker_2': 'So in this event, since if if any email was received withdrawing that petition, it's too late and you need ten votes.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_13': 'And I was aware of that, that legality.'",
        "'speaker_1': 'Thank you. Next speaker is Annie Lewinsky.'",
        "'speaker_5': 'Allison.'",
        "'speaker_1': 'I'm sorry. Allison McMurtry, I just.'",
        "'speaker_4': 'Okay, another word first. Since I can cut part of my speech, I would just like to say thank you for that beautiful dance. It has been a really stressful week and that was a beautiful blessing. So I just want to say thank you for that.'",
        "'speaker_4': 'So we have a baby boy here who's due in October. And if he is due on born on his due date, he, I, I will need to go back to my full time job in January. If you pass our zoning tonight and construction goes as planned, this baby will have childcare when my maternity leave ends.'",
        "'speaker_4': 'Ironically, if our zoning does not pass tonight, we will find ourselves in the same shoes as so many other Northwest Denver families with no childcare. When I return to work every day, this school isn't open. Parents in Denver have one more day of uncertainty while hoping their turn is next on the wait list.'",
        "'speaker_4': 'One more day they are driving miles out of their way for childcare rather than a school in their own neighborhood. One more day with one less option where to put their kids in preschool. Especially in northwest Denver, there simply is not enough childcare to meet the needs of all the families that live there.'",
        "'speaker_4': 'This is personally frustrating not just to me and my husband, but to many other families here. And our support tonight that a few neighbors could prevent over 100 children from schooling every day counts. This is a pivotal night for me and David.'",
        "'speaker_4': 'The future of our family dream is decided tonight. Colorado Uplift has been helpful and supportive of us while we while they wait for us to purchase this property. Our original contract with uplift expires in three days from today.'",
        "'speaker_4': 'Because of the challenges we faced and their support of us in particular, they have generously extended our contract to get us through this meeting tonight. Every month of this extension, we have paid $10,000 to hold this contract. We are just a family trying to open a small business.'",
        "'speaker_4': 'We are not land developers with deep pockets. We are out of time and money to continue to invest in this property before we even own it. Any other zoning option would take months and we don't have the assets to hold the property beyond the commitment that uplift to uplift has generously provided us.'",
        "'speaker_4': 'We need a resolution tonight to proceed. We're looking forward to running this school for decades to come into our seventies. We feel we've proven our respect for this wonderful, the wonderful, historic nature of these buildings, and we ask for the flexibility to maintain it in the future as necessary.'",
        "'speaker_4': 'We were absolutely ecstatic when we discovered this property with its long history of serving the community and children. It seemed like a perfect fit for the God or our Goddard dream. We applied to the city for the appropriate zoning for our school, and they recommended you as you be one.'",
        "'speaker_4': 'They said that was the correct zoning to run our school. We trust them and we ask that you pass our bill tonight and approve our zoning. We can't wait to get started on our school.'",
        "'speaker_1': 'Thank you. Next up is Annie Lewinsky.'",
        "'speaker_5': 'Hello. I'm Annie Levinsky, executive director of Historic Denver, and I'm happy to be here tonight to offer our support for this rezoning. As has been mentioned, the steel gymnasium is a wonderful historic property and constructed in 1914 as both a church and a youth center by the Reverend Rudolph.'",
        "'speaker_5': 'And it was designed by the architect Robert Wilson. And you'll know his work. He's also the architect of the auditorium, theater and the 20th Street gym. And they all share that same blond colored brick that is one of our iconic features in the city.'",
        "'speaker_5': 'It did, of course, later serve as a Boys and Girls Club and has really continued its legacy of being a center for the community and for youth throughout its 100 year history. When the property went on the market last year, we were mildly concerned about its fate, given its unique nature.'",
        "'speaker_5': 'And so when we heard from the owners here tonight, the prospective owners, we were both relieved and pleased with their potential use as a Goddard school. And this is, I think, a particularly appropriate use given the history of the building and one that will serve the community and the building well.'",
        "'speaker_5': 'We are also grateful to the owners for engaging with us and seeking our counsel about renovations over the last few months and as well as for formally providing the certainty that David mentioned in the form of two covenants.'",
        "'speaker_5': 'The first is a ten year non demolition covenant on the gym, which as mentioned is on the State Register of Historic Places and a two year non demolition covenant on the Associated Manse even though it already has a certificate of non historic.'",
        "'speaker_5': 'We recognize that these may not have satisfied all the neighbors concerns, but we believe that execution of those last week is a large part of the reason that many of them chose not to be here this evening. We are very much looking forward to the continuing relationship with the owners as they begin their stewardship of this building'",
        "'speaker_5': '. And we hope that we can offer continued support and assistance in its preservation over the long term. Thank you.'",
        "'speaker_1': 'Thank you, Mr. Linsky. Mr. Chris Penney.'",
        "'speaker_0': 'This.'",
        "'speaker_1': 'I'm sorry. We can't. Okay. Amy. Next up is Amy. Sure. Okay. They're not. So nobody else is going to speak. Well, let me just call through Jill Donoghue, Emily Jacobson. All right. That concludes our. Speakers questions from members of council.'",
        "'speaker_1': 'Councilman Black.'",
        "'speaker_4': 'Thank you. Just a quick question. Did you consider applying for a landmark designation for this building? Why or why not?'",
        "'speaker_13': 'We did consider applying for the landmark designation, but one of the biggest reasons with is that specifically with child care being some of the strongest and most stringent zoning in the city that we wanted, very flexible and quickly adaptable, moving ability to make repairs.'",
        "'speaker_13': 'One example that we had talked about is that our target audience doesn't know the difference between a piece of a broken window and why you shouldn't eat a nail. So we were really making a strong push to protect the building that still give us the ability to make immediate changes to the building that addressed the safety of'",
        "'speaker_13': 'the children specifically.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Brooks. I mean, Councilman Cashman. Thank.'",
        "'speaker_0': 'Thank you, Mr. President. Pro tem. Mr. McMURTRIE, please. So you're the property owner you want, or will you be involved in the actual administration of the school? Your background, etc.?'",
        "'speaker_13': 'Good question. I and my wife will be on site owners. I will be the one that will be opening it and I will be there on a day to day basis as if I was a neighbor in the property.'",
        "'speaker_13': 'We're not just dropping in, making a big to do and then leaving. We will be a part of the community. And as far as the background, my wife is incredibly beautiful and smart and she has a business background.'",
        "'speaker_13': 'And on the other side, I have been in education my entire life. Foster care, middle school teacher. Last six years I worked for a nonprofit. So the combined combo of the two of us makes for what I think is a very strong team.'",
        "'speaker_13': 'And I really, being an educator myself and a part of my life is I'm a professional speaker and trainer for educators, and it would be hypocritical to not walk the talk. And I really do intend to have this to be some of the most empowered teachers and educators in the city and be a real leader in that'",
        "'speaker_13': 'way by living by example.'",
        "'speaker_0': 'So we spoke earlier and you told me that you felt early on in this process you had made some missteps that might have contributed to the early contentiousness of the debate. Talk about that. And if you do become a part of this community, the ability to interact with the neighbors is going to be critical.'",
        "'speaker_0': 'Talk to me about plans for the future.'",
        "'speaker_13': 'Well, as far as the neighbor, I truly believe I've flooded a bunch of people's, not me specifically. But I think there's been a lot of additional letters of recommendation that have come in email form to a lot of the council people via neighbors in your districts.'",
        "'speaker_13': 'But I believe very deeply that as neighbors we are leaders in the community that we will treat everybody with not only respect, but that we will take care of them as if we were living in that neighborhood. To the to the question about what happened at first.'",
        "'speaker_13': 'I had never even bought a house, let alone a split level gymnasium and a house connected to it. So I come into this process having never done anything like this, and as I kind of stumbled through it, one of the things that I would have liked to have done is been more clear early on.'",
        "'speaker_13': 'But what is a challenge is I now have the clarity, like I now have seen not just how this plays out, but we know exactly what we're doing with we have architect plans that are 99% done. So I can say I know this is what's going to happen as opposed to when I first started, I was a'",
        "'speaker_13': 'little unclear. And that uncertainty sometimes created challenges. And some of the neighbors felt that I didn't communicate as clearly as they would like. And for that I will own as part of the learning process that has been this is this entire experience.'",
        "'speaker_0': 'Okay. Thank you. That's all, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Brooks.'",
        "'speaker_2': 'Thank you, Mr. President. And Elise, quick question for you on the technical aspects of the zone, and thanks for going through your presentation. I didn't find a lot that was in conflict. And so maybe give me a little specificity around what the neighbors were complaining about over the criteria on which we judge rezoning.'",
        "'speaker_5': 'But I don't think that there are specific concerns with the criteria itself, maybe a little bit of questioning of some of the analysis on the adopted plans. But the concerns that we heard from the neighbors, as David made mention of, was parking and traffic flow.'",
        "'speaker_5': 'That was a big concern that we hear really with any rezoning, understanding that that will further be handled at time of zoning permits and then the preservation of these buildings due to their historic nature and ensuring that the zoning doesn't further incentivize the demolition.'",
        "'speaker_2': 'Okay, great. Thank you. And the applicant. Quick question and this is more on a near use. Will you all be receiving any funds from different preschool program?'",
        "'speaker_13': 'Not at first. That's something that will be addressed as we move down the road. But this project is currently funded without needing to have the preschool.'",
        "'speaker_2': 'And that's not so much on capital, but on the actual program to subsidize the costs for those who are struggling financially. I mean, actually, the preschool program is for every kid in every economic level. But we see more than anything folks who are very poor using those preschool program dollars.'",
        "'speaker_2': 'So just want to, number one, let you know that that's a resource. Number two, hope there's probably some folks in your neighborhood who would appreciate that. Got her school be in a resource of them and subsidize in some of the costs.'",
        "'speaker_13': 'You asking the question?'",
        "'speaker_2': 'I'm just letting you know.'",
        "'speaker_4': 'Go ahead. Okay. Yeah. We were familiar with that specific program, but David and I have talked a lot about loving to be able to do something kind of once we're up in open and running. I'm assuming it's some sort of scholarship type program and stuff like that.'",
        "'speaker_4': 'So we've talked a lot about how excited we are to be able to do stuff like that once it's opened. And so we'd love to hear more about that.'",
        "'speaker_2': 'Great.'",
        "'speaker_1': 'Thank you, Councilman Katzman Espinoza.'",
        "'speaker_2': 'You know, can you bring up the slide for the with the prep the protest boundary? And Mike, if you're here, you can hear me. Thank you for these new monitors. I can see the whole thing and it's great.'",
        "'speaker_2': 'Really, this is more of a comment to my fellow council members, but I wanted to use this as an exhibit. If you look at this. The Antilles. What percentage was achieved with these with what's shown here.'",
        "'speaker_5': '22.6%.'",
        "'speaker_2': 'So this is the second time District one has experienced a protest petition and I just spoke last time. This is not easy to accomplish. And I just I spoke last time about it, how difficult it was. And so I just wanted to point point out that if you look at the sheer number of properties, the better part'",
        "'speaker_2': 'of half of those properties have been have signed that petition, but yet it only equals 22%, which is barely hits the threshold. And so when if this happens again, that's what I'm talking about is even if you get over a huge majority, simple or a huge majority, it's very difficult because of the nature of how this is'",
        "'speaker_2': 'calculated with the right of way counting as part of that area when it's actually a significant number of property owners. So I just wanted to point that out and then talk to the. You know, there was some the I think the you answered correctly in mentioning that the concern from the neighborhood was was largely around the preservation'",
        "'speaker_2': 'aspect. I mean, the landmark status of the building. But there actually was significant debate at that planning board. Wasn't there more towards is this actual particular correct zoning for this sort of anomalous building in a Opseu zoning district?'",
        "'speaker_2': 'But ultimately, planning board recognized that every bit of planning supports this actual zoned district in this use and structure can be used for this use. In our current rules, with the appropriate zone district in the new zoning code, is that correct?'",
        "'speaker_5': 'That is correct.'",
        "'speaker_2': 'Yeah. So thank you.'",
        "'speaker_1': 'All right. Are there any other questions for members of council? Public hearing for council bill 252 is closed. Comments by members of Council. Councilman Espinosa.'",
        "'speaker_2': 'Yeah, I actually for for for two just so that people know I did receive at 311 the letter from the primary negotiator on behalf of the community and just to quote it, so that people don't wonder what it really said.'",
        "'speaker_2': 'It said the neighbors. The neighbors copied on these emails, have examined the covenants, conferred with their neighbors, and have reached out to the property owners who signed the protest petition. All parties concerned have agreed to suspend their efforts to defeat the zoning map amendment application.'",
        "'speaker_2': 'However, at this late hour, there will be no effort made to actively participate in this hearing. I mean, I paraphrasing now the rest of it. So, you know, I'm I think that speaks to. Well, it does speak directly to the covenants that were negotiated and agreed to.'",
        "'speaker_2': 'And so I do want to thank the applicant for for doing that, because as referenced in my comments with the planning board there for, you know, I'm a stickler for criteria. And for all intents and purposes, every bit of criteria that we weigh on these rezonings is met by this application.'",
        "'speaker_2': 'And so it would have been a tough thing to sort of find the daylight in that protest petition. For me personally, as much as a stickler, I am looking for that daylight. The nun was here. And so I am glad, though, that you both of you have agreed, even though you didn't have to, to reach that covenant'",
        "'speaker_2': ', because that buys that building, which is significant and recognizably landmark ish, ten years of guaranteed, tender loving care and protection from demolition. And to add the additional two years on the house voluntarily as well is is noteworthy. And so thank you very much.'",
        "'speaker_2': 'You're right. We did have a tough go of it to begin with and it was a learning process. But I really appreciate that you what you said here tonight and what you agreed to with historic Denver. So thank you.'",
        "'speaker_2': 'And I'll be supporting this.'",
        "'speaker_1': 'You can't swim, Kenneth.'",
        "'speaker_4': 'Thank you. Mr. President, I just wanted to thank the folks that did come out tonight. Appreciate it. Even more, especially even when you give up your turn to speak. And I just want to give my kudos to the councilman for your role in helping to encourage this in historic Denver.'",
        "'speaker_4': 'You're here so often as part of these really positive outcomes. And so I just want to thank all those of you who are involved in the effort. I'm a resident of Berkeley, and, you know, I'm only recently in the Denver public school system after having to find, you know, all that child care that didn't exist in the'",
        "'speaker_4': 'neighborhood. So I can attest to the fact that it is needed and it will be a net benefit. I hope that you make an effort. We're losing a lot of diversity in northwest Denver. So to ensure that you're doing outreach and recruitment for the kind of integrated environment that I think our neighborhood is still struggling to maintain'",
        "'speaker_4': ', even in the face of some of that loss of diversity, I think would make this a wonderful outcome as well. But it is a landmark in all of our eyes, regardless of its legal status. And so thank you for your willingness to take care of it.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Councilman Cashman.'",
        "'speaker_0': 'Thank you, Mr. President. Pro tem. I'll be supporting this this evening. The I appreciate your education background. I appreciate the glowing recommendations from from your friends and people who know you and that you're a fine American. And but what I really appreciate what mattered to me in this decision was in our discussion about you're realizing that you'",
        "'speaker_0': 'blew it early on to whatever degree, you know, and those things happened. You know, sometimes we run with scissors and and nobody gets hurt. Other times we we stumble and someone gets stuck. This appears to be a no blood, no foul situation.'",
        "'speaker_0': 'But even better than that, your stated willingness to to work with the community as time evolves and to work with historic Denver to for the long term preservation of what I think is a spectacular building. And so, as I said, I look forward to supporting this tonight.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. I really want to echo what Councilwoman Kennish to my right just said and to Councilman Espinosa. It seems to me that this is a really good example of active preservation rather than passive preservation. Sometimes the best.'",
        "'speaker_3': 'I think the lesson to take from this is sometimes the best way to preserve a historic building isn't necessarily to put a plaque on it, but to find a way to reuse it in the form that that really in a way that's really consistent with the form of the building.'",
        "'speaker_3': 'And so I'm very happy to support this. Thank you, Councilman Espinosa.'",
        "'speaker_1': 'Councilman, are there any other council members? I want to chime in. All right. If not, I just wanted to say. Thanks a lot. I drink coffee, waiting to be up all night. And now I'm going to be up all night and there's not going to be a public hearing.'",
        "'speaker_1': 'Having said that, since community planning and development has determined that the requirement for a legal protest signals of the owners of at least 20% of this property within 1200 feet of the site has been met. Petition signatures represent 22.6% ten affirmative votes instead of the standard seven affirmative votes of counsel are required to pass this bill.'",
        "'speaker_1': 'Having said that, Madame Secretary, roll call black.'",
        "'speaker_5': 'Hi, Brooks.'",
        "'speaker_0': 'Clark. Hi.'",
        "'speaker_5': 'Espinosa.'",
        "'speaker_0': 'Hi.'",
        "'speaker_5': 'Flynn. I. Gilmore. I. Cashman. Can each new Ortega. I. Assessment. I. Mr. President.'",
        "'speaker_1': 'I. In. Let me just make that correction. I meant ten instead of seven. And so happens we're not bringing my glasses to.'",
        "'speaker_5': 'Waiting for Ortega.'",
        "'speaker_6': 'You can.'",
        "'speaker_1': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_5': '12 hours.'",
        "'speaker_1': '12 eyes council bill 252 has passed. I apologize for that rookie mistake. Councilman Espinosa, will you please put Council Bill 314 on the floor for a final passage?'",
        "'speaker_2': 'Thank you, Mr. President. I move that council bill 314 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. This has been the motion. In the second Ortega. All right. Council. A public hearing for Council Bill 314 is open. Speakers may address either the Moth Council Bill 314 and Resolution 370. We mean we have the staff report.'",
        "'speaker_9': 'Good evening. Council President Pro Tem Members of City Council. My name is Ryan Winterberg with community planning and development here to present presenting to you at the I 25 and Broadway station area. So it does include 27 individual parcel addresses.'",
        "'speaker_9': 'I won't read them all out you tonight, but the request is to rezone from TMU 30 waivers and conditions UO one to CMC 12, DMX 12, C, Max 16 and C are x eight. So the subject site is located in Council District seven.'"
    ],
    "Rezones multiple addresses at the Broadway Station area (800-1000 blocks South Broadway, 301 West Mississippi Avenue, 700 South Santa Fe Drive, 925 South Santa Fe Drive, 711 South Cherokee Street, 501 West Ohio Avenue, 510 West Tennessee Avenue, and 99 West Kentucky Avenue) from T-MU-30 with waivers and conditions, UO-1 to C-MX-16, C-MX-12, C-MS-12, and C-RX-8 in Council District 7. (NEIGHBORHOODS AND PLANNING) Rezones multiple addresses at the Broadway Station area (800-1000 blocks South Broadway, 301 West Mississippi Avenue, 700 South Santa Fe Drive, 925 South Santa Fe Drive, 711 South Cherokee Street, 501 West Ohio Avenue, 510 West Tennessee Avenue, and 99 West Kentucky Avenue) from T-MU-30 with waivers and conditions, UO-1 to C-MX-16, C-MX-12, C-MS-12, and C-RX-8 in Council District 7. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 4-27-16.": [
        "'speaker_9': 'At the confluence of the Baker and Ashmore Park neighborhoods. But we can see that it's it's really bringing together a lot of different neighborhoods in the hub of this transit oriented area of our city. Zooming in a bit to the location, we can see that the site is located at the I 25 and Broadway station area.'",
        "'speaker_9': 'And just to orient you a little bit, we can see that it's bound by I-25, the interstate at the north south Broadway at the East Mississippi Avenue at the South, and the Santa Fe Platte River Drive couplet generally at the West.'",
        "'speaker_9': 'And our site is split by a number of manmade, as well as natural barriers, including the consolidated mainline in the South Platte River. And we can see Vanderbilt Park East and Vanderbilt Park West just to the west of our subject site.'",
        "'speaker_9': 'There are both dedicated city parks and the subject site. The station itself is served by five light rail lines and multiple different high frequency bus lines as well. So to the request, the property is a 58.5 acres and it is largely vacant.'",
        "'speaker_9': 'Former Industrial. This is the area that we often think of as the former Gates redevelopment site at the Gates factory. It does include today one small auto service structure in the northeast corner of the site as well as the RTD station.'",
        "'speaker_9': 'So that includes the bus bays, the station platform itself, as well as surface parking. And the entirety of the site is currently owned by four property owners. So our Broadway station partners, which is a private development entity as well as the city and county of Denver and these four property owners are requesting a rezoning to facilitate redevelopment'",
        "'speaker_9': 'within the framework of the Denver Zoning Code to facilitate transit oriented development. So the request before you was to rezone from 10 to 30 waivers in conditions you are one to the forward zoned districts as seen here. And just to let you know, the current zoned district does include the yellow one adult use overlay and it is'",
        "'speaker_9': 'not proposed to retain that overlay coming into the Denver zoning code. And currently there are no adult uses on the subject site. And just a reminder tonight that the approval of a rezoning is not the approval of a specific development concept.'",
        "'speaker_9': 'So now on to existing context. First zoning so we can see that our site is HTML 30 waivers and conditions and tenure. 30 is a former Chapter 59 zone district generally mapped around station areas. It includes a maximum of 5 to 1 and height of 220 feet.'",
        "'speaker_9': 'And it's important to note that the waivers and conditions that apply to the site do not apply to the entirety of the site. They are concentrated within certain sub areas. So the waivers for parcel five, parcel five is that little portion outlined in yellow to the west of the river, waivers for that particular site way out, certain'",
        "'speaker_9': 'uses highly limited for that piece of property specifically. And then for Parcel six, which is the parcel located generally right around the I-25 and Broadway station area, that's the portion owned by RTD. There's a number of different waivers and conditions, all generally getting to the same intent that for private development to occur on that subject site, a'",
        "'speaker_9': 'waiver, the reduction of parking spaces essentially is waived out through a number of different mechanisms and a different process is specified for sharing parking across the GDP area. Additionally, conditions are attached to the subject site. An important one is that an infrastructure master plan is also required as part of the zoning, along with a general development plan'",
        "'speaker_9': '. So something to see as we go forward. I now looking to the surrounding context to the north of I-25. We can see some see Amex 16 and see Amex eight zoning, and that's the IMX 16. Zoning was just approved by this body in March of this year.'",
        "'speaker_9': 'We can see a number of different old codes in districts as well as Denver zoning code zone districts generally mixed use in contexts surrounding the property. And to the south of Mississippi, we can see that the tme 30 waivers and conditions that was mapped on or subject site in 2003 also does extend to the south of Mississippi'",
        "'speaker_9': 'and CPD is exploring with the property owners throughout this entire TI and the 30 waivers and conditions area to bring all of that property into the Denver zoning code. And we can see OSA zoning located to the West where there's two dedicated city parks are located now in two existing contexts for the GDP and the Urban Design'",
        "'speaker_9': 'Standards and guidelines. The Cherokee redevelopment of the former Gates factory GDP was approved for the subject site in 2005. So again, a requirement of the TMU 30 with waivers in condition zoning and coterminous for the same boundary. We see urban design standards and guidelines that are intended to facilitate redevelopment over time.'",
        "'speaker_9': 'But we do understand today that the majority of the site was not developed under this general development plan or these urban design standards and guidelines. So as you'll see, moving into the 25 and Broadway stationary plan, we do see specific recommendations to review these various layers of regulations that exist on the site, streamline where possible, and ensure'",
        "'speaker_9': 'that they're implementing our adopted plans. So as such, we do anticipate that the general development plan will be repealed and the Urban Design Standards and guidelines have been substantially amended and restated. Recently recommended approval by our Denver Planning Board just last week.'",
        "'speaker_9': 'So we're not going to be talking about these two tools as we move forward tonight. It's now on to the view plane. We can see that the Washington excuse me, Washington Park view plane applies to the subject site.'",
        "'speaker_9': 'Originating, of course, in Washington. And estimating maximum building heights of 111 to 169 feet across the subject site, which, of course, these will fall below the maximum building heights requested for the zone districts. So ultimately, the Washington Park View plane will regulate building heights across the subject site.'",
        "'speaker_9': 'It's now looking to land use. We can see that our site is largely vacant. Its former industrial and the small outdoor service. The structure there, we can see in purple in the northeast corner of the site and we see a mixture of industrial and mixed use uses, specifically industrials concentrated to the southwest portion of the site as'",
        "'speaker_9': 'well as mixed use continuing on the Broadway corridor. Now on to building form and scale. We can see some images of the vacant property and the one remaining structure, as well as the station area itself, the platform, the light rail flyover and the surface parking lots.'",
        "'speaker_9': 'And then the photos in the lower right hand corner are the vacant properties to the west of the Consolidated Mainline and west of the South Platte River. Now looking to the foreman scale, we can see generally low to mid rise buildings located around the subject site and then moving into more auto oriented industrial and flex spaces to'",
        "'speaker_9': 'the south and the west. So now in terms of process, the following ten registered neighborhood organizations have been notified throughout the process. And we did actually receive 37 letters of support. This has not been updated and they are all included in your staff report packet.'",
        "'speaker_9': 'A notice of receipt of application was sent on February 17th, 2016 to register neighborhood organizations and City Council. Notice of the Planning Board public hearing was sent on March 21st, 2016 to Arnaud's, as well as notification signage posted on the Property Planning Board did vote unanimously to recommend approval on April six, 2016 and the Neighborhoods and Planning'",
        "'speaker_9': 'Committee move the bill forward on April 27th. And of course here we are tonight at City Council and Arnault's have been properly notified as well as signage posted on the property. So in terms of the review criteria, we will move on to consistency with adopted plans.'",
        "'speaker_9': 'And there are three adopted plans that apply to the subject site, the first of which is comprehensive plan 2000. And we did find that the rezoning is consistent with the strategy seen here and comprehensive plan 2000, which is of course adopted now six years ago, actually does call out the Gates site as a significant transit oriented development'",
        "'speaker_9': 'redevelopment opportunity. Next on to Blueprint Denver, our land use and transportation plan. We can see that the subject site is called out with two land use concepts. The first is that sort of bright pink fuchsia color, which is transit oriented development, which recommends compact mid to high density mix of uses, high pedestrian orientation and friendliness, as well'",
        "'speaker_9': 'as high multimodal access and a reduced emphasis on auto parking. And then to the west of the South Platte River, we can see that pink color, a lighter pink color, is called out as mixed use. And these are subject sites that are recommended for a mix of employment and residential uses next within buildings, but also within larger'",
        "'speaker_9': 'areas and the entirety of our subjects that is called out as an area change. So areas where the city of Denver recommends channeling the most growth and redevelopment to benefit the city as a whole. Next onto the I-25 and Broadway station area plan, which was recently adopted by this body in April.'",
        "'speaker_9': 'You will recall that the station area plan recommends encouraging a variety of uses to activate the station area. And again, seeing the reinforcement of the concept land use categories from Blueprint Denver. Next. The plan also recommends in terms of building heights, incorporating higher densities near the station with overall building heights ranging from 8 to 16 storeys across'",
        "'speaker_9': 'the subject site. Ultimately, though, being regulated by the Washington Park Viewpoint. We do find that the rezoning request will also result in the uniformity of district regulations. By bringing all these properties into the Denver zoning code, additionally facilitating redevelopment within the framework of the zoning code across properties owned by multiple entities over a long period of time'",
        "'speaker_9': '. We also find that the rezoning will further the public health, safety and welfare through the implementation of adopted plans. And in terms of justifying circumstances, we can look to a number as articulated in your application and your staff report.'",
        "'speaker_9': 'So the land or its surrounding environs has changed or is changing, and we can look to specific change circumstances. The first being that adopted plans over for now almost the last 20 years have recommended redevelopment of this particular area and recognize the evolving character all the way back to comprehensive plan 2000 reinforced through the adoption of the'",
        "'speaker_9': 'Strategic Plan in 1216, 2014, and now the 25 and Broadway stationary plan. And of course, we're given this a finer grain analysis through the 25 and Broadway stationary plan that sets much more specific guidance than we have been given before in the past.'",
        "'speaker_9': 'We also see that redevelopment in the area is signaling an evolution in the environs. So redevelopment occurring at the Denver Design District to the north along with the south Broadway corridor. Additionally, the sale of the former Gates factory to a private entity opens up new redevelopment opportunities for this particular site.'",
        "'speaker_9': 'And the adoption of the Denver Zoning Code has introduced new tools to implement adopted plans that we would not have had available to us at the time of the TMU 30 with waivers and conditions rezoning in 2003. Specifically, the design recommendations that are coming forth from the 25 and Broadway stationary plan are not implemented by the existing'",
        "'speaker_9': 'zoning on the site as articulated in your staff report. Now looking to excuse me. Consistency of neighborhood. Context to a district purpose and intent. As articulated in your staff report, we do see that it is appropriate to resume the site within the urban center and neighborhood context as well as the zone district purpose statements that are stated'",
        "'speaker_9': 'for the Max AMS and our zone districts, as well as the specific intent statements where we see specific guidance both in terms of building heights from the stationary plan as well as the transportation context. So based upon our review of the five criteria, we find that the rezoning meets all five and recommend approval.'",
        "'speaker_9': 'And property owners are here this evening from RTD as well as Broadway station partners. Should you have any questions for them? Thank you.'",
        "'speaker_1': 'Thank you. Right. So first up, we have Kate Iverson. 3 minutes. Welcome.'",
        "'speaker_4': 'Kate Everson, artist Todd, manager in the Archduke's Planning Department. I'm here to answer any questions. No comments.'",
        "'speaker_1': 'Thank you. Our final speakers. Lisa Angel. I'm pronouncing that right.'",
        "'speaker_4': 'Hello. Good evening. My name is Lisa Ingle. Address of use is 1821 Blake Street 3c80202i represent Broadway Station Partners as the development project manager and local owners representative. We want to thank you for your time tonight. Of course, we're excited to bring forward the rezoning of this important underutilized and contaminated land.'",
        "'speaker_4': 'We recognize the significance of the property to the city and its citizens and look forward to bringing it back into productive use. We are already cleaning the site, as I think we've mentioned to a few of you and see quality development that the city and its neighbors will be proud of moving forward.'",
        "'speaker_4': 'Over the past year, we have worked closely with the city and county of Denver, the I-25 and Broadway Station Area Plan, which was adopted through council back in April. We also convened back in November of 2015 a steering committee made up of neighborhood representatives.'",
        "'speaker_4': 'We called that the B stack. We met four times over the past several months, along with two additional public meetings, and the team was on hand to answer questions as well as get input into the vision of the of the project itself.'",
        "'speaker_4': 'As a result, tonight, we have letters of support from each of the participating neighborhood organizations. You have a summary of the public outreach on your desk, along with each of those letters of support. And we're here tonight to seek your approval on the rezoning application.'",
        "'speaker_4': 'And the rest of the team is here as well to answer questions, if you have any.'",
        "'speaker_1': 'Thank you, Mr. Singh.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Questions for members of Council. Councilman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. Pro tem. I have a couple of questions. Let me start first with Lisa. If you wouldn't mind coming to the front.'",
        "'speaker_1': 'And it might be helpful to have all our speakers that were just here for questions in French just in case they have.'",
        "'speaker_4': 'Come on down.'",
        "'speaker_6': 'So. I would like to ask what kind of discussions have taken place with the city related to proximity to rail? As you know, we have cargo shipments that travel through this corridor and we have had a working committee that has been meeting to talk about rail safety and also as it relates to new development.'",
        "'speaker_6': 'And just curious to know what those discussions have entailed that would ensure that item number three, which says we're addressing health, safety and welfare, that we're in fact, doing that and. Okay. I understand. You mean you're clearly probably not at that level of detail, but, I mean, I want to know, has the conversation come up?'",
        "'speaker_6': 'What you know, what has that consisted of?'",
        "'speaker_4': 'Sure. I think it was really brought to our attention by you when we met to to have these initial discussions on the zoning. There has been some some minor discussions with the city staff around this, but we haven't really gotten to that level of detail since we are still really in the visioning phase and not the implementation'",
        "'speaker_4': 'phase. But it's obviously good to keep on the on the radar.'",
        "'speaker_6': 'So as the representative of the development team, can you tell me if they will be looking at creating a special district, if they will be requesting tax increment financing, what are the additional approvals that will need to be coming back before this body for this project to to develop as it's envisioned?'",
        "'speaker_4': 'Sure. There currently is a special district. We have a metro district on the actually there's three districts. One is an operating district. There will, in fact, be a public finance component of this that we are seeking. We are in current negotiations with Dura and we will, of course, be back in front of each and every one of'",
        "'speaker_4': 'you for briefings and discussions on that package as well. We're hoping that that will be finalized towards the end of this year.'",
        "'speaker_6': 'And part of that discussion will include affordable housing, I'm assuming that is correct. Part of the TIFF conversation. I know you've been engaged in some conversations with on that topic as well.'",
        "'speaker_4': 'We have.'",
        "'speaker_6': 'When will we know what that package entails?'",
        "'speaker_4': 'Sure. Right now, the the current affordable housing requirement remains with the land. As you noted, we are in negotiations with OED at this time. We are closing in on an agreement. We hope to have something finalized by the end of potentially this week, at which point in time we will look to make rounds back through city council'",
        "'speaker_4': 'and give some additional briefings and information as well.'",
        "'speaker_6': 'Thank you. I have no further questions at this time.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. Ryan, could you talk to me a little bit about the the parking waivers and how that works? Sure. The sites that were actually rezonings. I remember if you read I don't know if you were here when we adopted the.'",
        "'speaker_3': 'The stationary plan. Mm hmm. Okay. I had a lot of concern about the references to locating transit parking far near, but not necessarily at the station, which is the words that are used in your staff report. So there are currently 1200 and 1250 parking spaces for RTD I 25 Broadway.'",
        "'speaker_3': 'Under this zoning, where do we expect the transit parking will go?'",
        "'speaker_9': 'That's a great question. So there's actually very little change in the way that parking is treated for transit operations between the current zoning and the proposed zoning. So the site that's up right now, I don't know if you can see it, but the waivers for Parcel six, that's the area that's owned by RTD, generally around the I-25'",
        "'speaker_9': 'and Broadway station. Those waivers relate specifically to private development that would occur on the parking related seating and the property related to parking. So in former Chapter 59, just like the Denver zoning code, transit users themselves don't have minimum parking requirements.'",
        "'speaker_9': 'Understanding that these stations can occur throughout the city of Denver depending on the context. And so the zoning today that is proposed is really a framework to facilitate redevelopment over the time, but doesn't require that parking is removed, just like the current zoning does not compel that parking stay.'",
        "'speaker_9': 'So then what does that mean, though, from kind of the plan perspective in the policy guidance that we see? So we've seen policy guidance now for the past 20 years that recommend balancing the importance of multimodal access to the station as well as placemaking with continued operations as a larger and having a larger aspect, I guess, of'",
        "'speaker_9': 'park and ride function is of course the station was constructed as the former end of the line in 1994 and we've definitely seen transit facilities expand since then. So the context has shifted and we're seeing the realization of that planned direction come to light.'",
        "'speaker_9': 'RTD has expressed an interest in maintaining the parking that they currently control. Definitely over the long term, as well as the station area plan does reinforce that. However, recommending that given the urban center context that's contemplated for this site, that surface parking is not the appropriate context moving forward and structured parking would be more appropriate.'",
        "'speaker_3': 'I agree with that. Kate, can I ask you a few questions? Of course I can. You care, Kate. Kate and I used to work together at RTD. It's nice to see you again.'",
        "'speaker_4': 'Good to see you, too.'",
        "'speaker_3': 'Tell me, since our TED reconfigured the Alameda station and has the there's now housing there and and we don't actually have parking there anymore to speak of. Do you do you know and if you don't, that's okay, because no reason you would expect this question.'",
        "'speaker_3': 'But what how has that affected the boardings and the lightings on light rail? And has it changed the mix of them, if you know?'",
        "'speaker_4': 'So boardings decreased when we closed the parking at that station. Of course, that station was also under construction and jerky was a gigantic mess for a period of time. What we've seen is, you know, we do run boards every three months or we check boardings and lightings every three months.'",
        "'speaker_4': 'So the residential project at that station has been fully that it was fully leased this winter. We don't have those numbers yet. We have seen, as it has leased up, that boardings at that station have continued to rise.'",
        "'speaker_4': 'It's one of the few stations in the system where they are continuing to rise. They are, however, below the level that they were when we initially closed it. So I don't think I think the verdict is out in terms of what that what kinds of conclusions we can draw from that.'",
        "'speaker_3': 'Okay. Do you know if any of the folks who used to park at Alameda, which is just is too hop, skip and a jump from I-25 Broadway. Do you know if they've has that increase the pressure on I-25 and Broadway parking?'",
        "'speaker_3': 'Because I know that's pretty heavily utilized.'",
        "'speaker_4': 'You know, I 25 and Broadway has always been heavily utilized. And we don't track individual usage in a way that we could tell you that when somebody stops parking at one station, they go to a different. But you don't.'",
        "'speaker_3': 'Know. When you closed Alameda did did I 25 Broadway become even more crowded or you don't know.'",
        "'speaker_4': 'You know it is it's risen steadily. We haven't seen it. It went, you know, down here and up here. We haven't seen a direct correlation like that.'",
        "'speaker_3': 'Okay. And finally, from what Ryan said, can you confirm that it's Artie's intent that the parking there remain at the at the level it is now, whether it's configured in structure or whether it's dispersed over different locations? My my interest is in seeing that that the station platform, the train platform is is conveniently walkable by regional commuters'",
        "'speaker_3': 'who choose to park there, remembering that this is a this is a regional commuting station, not a neighborhood station.'",
        "'speaker_4': 'Understood. Yes. I mean, at this time, that is the intent. We recognize it's an important station. It's one that we have a high commuter usage. That parking in general is a very difficult is a is a complex issue.'",
        "'speaker_4': 'It's something that will actually be going to our board in a study session in the end of July. I believe so.'",
        "'speaker_3': 'Okay. Very good. Thank you. That's all. Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_0': 'Thank you, Mr. President. Pro tem for the owners. Representative, couple of questions. Can you can you talk to me about what the current brownfields situation is on on the property? And is there any anticipation of any need to limit users because of that?'",
        "'speaker_0': 'Or will will it be wide open?'",
        "'speaker_4': 'Sure. When we bought the property, we only had 13 acres clean at this point in time. Santa Fe has been fully cleaned as well as our so the triangle parcel. I don't know if you guys have an exhibit on your screen that you can see sort of the triangle parcel against Vanderbilt Park West.'",
        "'speaker_4': 'We also have no action, determination letters on a portion of Broadway running north, south and sort of to the center line of the Broadway parcel. But the remainder of Broadway is is still contaminated. The needs call for requirements to clean two commercial standards, not residential.'",
        "'speaker_4': 'So there will be some limiting uses. But based on the way parking and retail will be placed on the site, we'll be able to do residential above. There will be ongoing cleanup and portions of this property, you know, for for a certain period of time and then throughout the end of this year and ongoing.'",
        "'speaker_4': 'So we saw a little bit of a road ahead of us, but we're well underway.'",
        "'speaker_0': 'Sure. Thank you. As far as how substantial is the site grade from Broadway down to Santa Fe?'",
        "'speaker_4': 'I'm sorry, could you repeat that again?'",
        "'speaker_0': 'How substantial is substantial is the grading of the site. I know it's lower down towards the river, but how substantial is that a story? Two stories, three story difference, do you know?'",
        "'speaker_4': 'We haven't done full topography studies, but it's about a story and a half, as you hear from the rail. And the way to really look at this is sort of from the rail to the Santa Fe to to the Platte River Drive and Santa Fe Road.'",
        "'speaker_4': 'As that grade sort of falls away, you know, will be changing the grade of the site as we improve. However, you know, it's around a half a story story somewhere in there. I don't have the exact I could sure defer to a team.'",
        "'speaker_4': 'Remember who's here. If you'd like an exact answer.'",
        "'speaker_0': 'No, that's fine. Thank you. Yes. Yes, that's all, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Cashman. Councilman Brooks. Yeah.'",
        "'speaker_2': 'Thank you, Mr. President. Ryan, I have a question for you and Steve now. Please be listening. This is this is more this is more of a oh, they just took my screen off. This is more of a question on the relation of the 16 story buildings to the single family homes.'",
        "'speaker_2': 'Sure. So I had I had the. Maybe you can pull it up. The the correlation between that 16 stories and the single family. And I just want to talk real quick. That's a a dramatic drop from the 16 to the five.'",
        "'speaker_2': 'Do you see that?'",
        "'speaker_9': 'The five, the tan area to the south of Tennessee?'",
        "'speaker_2': 'Yeah, right on Broadway. Mm hmm. And does that go right into single family homes?'",
        "'speaker_9': 'I might not be looking at the exact same area that we're looking. So we're talking to the east of east. So you can see that the building heights recommended for the area between the castle and Broadway. That's 12 stories.'",
        "'speaker_9': 'Yeah. And again, calibrated by the Washington Park View plane. So an actual building heights, as you're closer to Broadway, will be around 110 feet. So more on the eight stories. But to answer your other question, we do not see any single family homes located between the intervening alley between Lincoln and Broadway.'",
        "'speaker_9': 'We see single family homes located on Lincoln. So we have a good block separation for single family ones as well as the Broadway corridor, which is two blocks.'",
        "'speaker_2': 'Yes. I mean, you're two blocks away. Okay. And this was a community process that you all work with neighborhoods for support. Do you have any complaints from any of the single family neighbors?'",
        "'speaker_9': 'No. What we heard through the stationary planning process is that maintaining the Washington Park Plain was of utmost importance. So the building heights map that you see in the plan and then we are implementing today through the rezoning is roughly calibrated to that building heights.'",
        "'speaker_9': 'But overall, throughout the process, there was, I think, an expectation that this is the area, if anywhere in the city of Denver, that high density toddy blocks that mixed uses and an intensity that truly catalyzes the development of the station belongs here.'",
        "'speaker_9': 'So we didn't hear great concerns over building heights, those specifically to the west of Broadway.'",
        "'speaker_2': 'Okay, great. Yeah. And I'm specifically talking about exposition to East Center Avenue on on Broadway to Lincoln.'",
        "'speaker_9': 'Okay. So we're talking to the north of the interstate. Yeah. Okay. And those building heights there where we see it, right along the interstate and then five along the South Broadway corridor, we did reinforce Building Heights recommendations from the Alameda Station Area plan adopted in 2009.'",
        "'speaker_9': 'So those recommendations were carried forward. No change there.'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'All right. Were Mr. Nowlin, myself, we're working on another part of the city.'",
        "'speaker_1': 'And there were some concerns.'",
        "'speaker_2': 'And they wanted to know where has this precedent been set in other locations. And so, obviously, Mr. Clark said in the precedent over here. So thank you. Appreciate it.'",
        "'speaker_5': 'Okay.'",
        "'speaker_1': 'Right, Councilman Espinoza? Well, actually, Councilman Kinney did not ask a question earlier. Do you guys do you mind? You go ahead and then we'll go to Espinoza.'",
        "'speaker_4': 'Thank you, Mr. President. I'm happy to do. I don't know if Councilman Espinoza got one on this round yet, so I'm happy to let him go ahead with my spot.'",
        "'speaker_1': 'Oh, sorry. I apologize.'",
        "'speaker_4': 'No, it's.'",
        "'speaker_1': 'Dropping busy everywhere all over this field.'",
        "'speaker_4': 'No worries. It's a busy night, Mr. President.'",
        "'speaker_1': 'Councilman Espinoza.'",
        "'speaker_2': 'Oh, no, it's okay. My. My reputation is. Is. Yeah, I'm already chimed in, and.'",
        "'speaker_1': 'It's, like, burned into my screen right here to burn.'",
        "'speaker_2': 'Actually, I wasn't going to say anything until I heard comments, so I would have questions both to Ryan and to RTD. On to Councilman Brooks. QUESTION So what is the in maybe you had it in the presentation. I missed it.'",
        "'speaker_2': 'What is the what is the zoning on the north side of I-25 between Broadway and Lincoln?'",
        "'speaker_5': 'Okay.'",
        "'speaker_9': 'So we really get back to that slide. Okay. If you're seeing the same image, I am. Great. So this map was actually produced just before the approval of the rezoning for the parcel that we have actually called the Sliver Parcel currently owned by our TD.'",
        "'speaker_9': 'You would have seen this back in March. So if you can see just to the north of that yellow boundary, which is our rezoning boundary, we can see some see max eight in that kind of pink translucent color and then the area.'",
        "'speaker_2': 'So I was really concerned with I was just asking about that you ams three in the YouTube so that half of this is UMass three and then we have a ride away which is, which does separate protected districts from non-protected districts, correct.'",
        "'speaker_9': 'Right. That is an intervening alley. And that's everything that you're seeing now is to the east of Broadway. And just to be clear, the only the boundary that is outlined in yellow is proposed for rezoning today.'",
        "'speaker_2': 'Okay. Um, interesting. Okay. And then now the question for RTD, since we were talking about boardings, do you have data? And it doesn't need to be presented here, but maybe you could shoot it to my office about the historical data, about the boardings at Broadway station.'",
        "'speaker_2': 'Do you have information about where those riders are coming from and where they're going? You know, how many are boarding there and going in the core versus going down to to to Greenwood Village or something like that.'",
        "'speaker_4': 'So what I could tell you, the way that we the way that we collect data, we do license plate utilization surveys, I think we do them on only an annual basis. I'm not positive I can check. So that will show us where people who are parking are originating.'",
        "'speaker_4': 'If somebody got there by foot, by bike, if they got dropped off, if they transferred from a bus. Typically throughout the system, we see that only about 20% of our ridership actually comes from park and rides. We don't have a way to track where those people are coming from and going to.'",
        "'speaker_4': 'So we have in one instance prior actually to Alameda Station done a person by person survey. So we have a single snapshot in time, but we don't have that system wide and we don't have that station.'",
        "'speaker_2': 'Well, actually, I'm only I'm glad you have that information on the cars, the vehicles, because that's actually the only part I'm concerned about. Right. Which is the huge amount of land area to accommodate those cars, to just sort of sit there, roast all day.'",
        "'speaker_2': 'So if you if you can put shoot in my office, whatever historical data you have about where those cars originate. And if you I guess you don't have any way of correlate correlating the driver or whoever's in that vehicle where they go.'",
        "'speaker_2': 'But it would be interesting on where they're coming, how they're where they're coming from to Broadway station.'",
        "'speaker_4': 'Absolutely. I can get you that.'",
        "'speaker_2': 'All right. Thank you. That was it. No further questions.'",
        "'speaker_1': 'Councilman Ortega.'",
        "'speaker_6': 'Do you want to go first? Okay. Okay. So I have a couple of questions about infrastructure. And first, I want to know if the three acre park, Vanderbilt Park East is going to remain on the east side of Santa Fe.'",
        "'speaker_6': 'And. Will it also be used as detention for storm storm drainage?'",
        "'speaker_4': 'Vanderbilt Park East is a designated park and we are not seeking to change that. So yes, it will stay effectively a park throughout the entirety of this development vision. As far as detention, we are seeking to use the northern end of the park for some small amount of detention, but the majority of the detention will be housed'",
        "'speaker_4': 'along Santa Fe on private property and we will be improving that park. As you know, it's sort of a vacant dirt lot right now.'",
        "'speaker_6': 'So were you all connecting pipe into drainage that would go into the South Platte River?'",
        "'speaker_4': 'That is correct. We have an outfall that is planned and if you'd like a little more detailed information, Laura Loretta is also here who did the engineering for that. But yeah, the intent is to have drainage coming from Broadway under the under the rails into our private property where it will be detained and then outfall into the'",
        "'speaker_4': 'river. Okay.'",
        "'speaker_6': 'So now I want to talk about the road that she has to approve that would allow access to the site from traffic going southbound on Santa Fe. Mm hmm. Where is that at in the discussions with CDOT? And are they going to require a traffic study that looks at the traffic flow and what that might do to'",
        "'speaker_6': 'backing up traffic on this already congested corridor?'",
        "'speaker_4': 'We have begun discussions with see that we have sort of a preliminary, if you want to call it, sort of a verbal preliminary approval. We have to go through the the process, of course. Yes, we are looking at a traffic impact study.'",
        "'speaker_4': 'We have some results back from that. And Laurel kind of deferred to you if we need to a little bit more in detail. But yes. Yes. So we are looking to put the bridge there and we'll have to do a traffic study for that.'",
        "'speaker_6': 'And that will be both pedestrian and car.'",
        "'speaker_4': 'That's correct. Multimodal. So bike, pedestrian, vehicular.'",
        "'speaker_6': 'I thought I read in one of the documents that there will be some credits available based on infrastructure improvements that are put onto the site. Was I making this up with something else that I was reading over the weekend on the for.'",
        "'speaker_4': 'What type of credits?'",
        "'speaker_6': 'I don't remember if it was infrastructure. I was looking through the documents, trying to see if that was part of this one.'",
        "'speaker_4': 'And we're going to consult I'm not familiar with with this have it so far. Okay.'",
        "'speaker_5': 'Good evening. Jill Jennings Gold at Community Planning and Development in the agreement that you'll be talking about next. We have agreed if there is detention that is put within Vanderbilt Park East, in order for them to do that and get credit for open space, we'll give them 50% credit and not the full credit for improving that park'",
        "'speaker_6': '. Okay. That's what it was. Okay. Thank you. I have no further questions. Thank you.'",
        "'speaker_0': 'Okay. Um.'",
        "'speaker_1': 'Looks like the trio. I mean, she disappeared.'",
        "'speaker_4': 'Every time I defer, I disappear.'",
        "'speaker_1': 'All right. Go for it. Councilman Cohen. Each.'",
        "'speaker_4': 'Thank you, Mr. President. I want to thank my colleague because she asked a couple of my questions about affordable housing. So it was great to hear. I do just have to comment really quickly that it's a little funny to be talking about the Gates project with Fred Bells having a little historical, historical moment.'",
        "'speaker_4': 'But anyway, he's not here for this project anymore. I want to pick up where Councilwoman Ortega left off with the open space question. So I think that I think I just got the answer, so. The GDP has a requirement for open space.'",
        "'speaker_4': 'How much of it is being satisfied with the park?'",
        "'speaker_9': 'Correct. So the existing general development plan, the Cherokee Gates redevelopment concept, had a 10% open space requirement. But of course, the concepts that we're looking at now going forward proposes a different open space configuration, as well as different tools to specifically secure that open space.'",
        "'speaker_9': 'So we're talking about Vanderbilt Park East specifically.'",
        "'speaker_5': 'Well, I've.'",
        "'speaker_4': 'Actually my follow up question was going to be that to the extent are there other open spaces planned within within the development areas? So that was so I'll just throw them out. So so that that was one question.'",
        "'speaker_4': 'The question that comes from that then is is this zoning appropriate for the whole site, even if it includes some of those open spaces? So pocket parks and things like that, even I understand they may not be dedicated because they may be maintained by the Met District or something, but do we not carve out zoning for those'",
        "'speaker_4': 'things? We just we just kind of plop them in the middle of this bigger zoned district, and that's okay and that's fine. So those that's the line of questions that I had.'",
        "'speaker_9': 'So. Okay. So first question. Are there other open spaces proposed on the site? So the tool that we are using going forward to secure open space across the site is an infrastructure master plan. And just to recall, there is one existing on the site today.'",
        "'speaker_9': 'So the general development plan that was approved in 2005 for the site. Thank you. This is a much larger version than my tiny copy recommended. The future location of aggregated open spaces as well as the location of smaller open spaces throughout the entirety of the site as redevelopment occurred.'",
        "'speaker_9': 'So not all of the open spaces were fully sort of locked in and articulated in the GDP at the time. And the infrastructure master plan then provided an additional layer of specificity and detail. And then secured by development agreement.'",
        "'speaker_9': 'So lots of lots of things trying to all achieve the same purpose. So what we're doing going forward is the infrastructure master plan is the method to secure the 10% open space. So there are open spaces that are fully credited.'",
        "'speaker_9': 'So they are given entirely out of private property owned by Broadway station partners. Open spaces that are partially credited. So that is the portion of, for example, Vanderbilt Park East where there will be stormwater. So the infrastructure master plan lays out an open space framework that is responsive to the I-25 and Broadway stationary plan and provides greater'",
        "'speaker_9': 'connections than what we would have seen in the general development plan that currently exists on the site. So then when it comes to. Yes. So the total open space credit that is provided is 3.72 acres, if you're interested, and the open space required by 10% of the net area.'",
        "'speaker_9': 'So the area minus the right of ways is 3.33 acres, so exceeding the 10%. And then to the question of how we would typically implement these things. So you're correct that certain open spaces will be managed by the Metro District, and there is an expectation that a portion will be given to the city when the specific site'",
        "'speaker_9': 'plans are developed and the exact boundaries are known, which is part of what we struggled with when considering rezoning options that did it make sense to rezone a portion of property to say the OCA or the OSP zoned district without knowing the specific boundaries to the point of a legal description to exactly where that would occur.'",
        "'speaker_9': 'So to answer your question, no. The OSA or OSP zoned districts are not proposed for the subject site, but the infrastructure master plan and then the development agreements that give specificity allow our development reviewers during the site development planning process to specifically allocate and review open spaces based upon these criteria.'",
        "'speaker_4': 'Okay. And then just to follow up questions, which is that so it's okay that there's open space within this dense zoning district for. Yes, it is. It's an allowed use. It is a.'",
        "'speaker_9': 'Permitted. Yes.'",
        "'speaker_4': 'Okay. I didn't want to have any situation whereby the zoning is for closing the open space. And then my my question probably for the the owner's representative is just having come back from New York City and, you know, 16 stories, you know, we're getting into some density that is you know, we're talking about when you're in some'",
        "'speaker_4': 'of the outer boroughs, they're dog park. Are you working on a dog park? Because, you know, I think it's it's really critical. So given that given this zoning, you need all kinds of infrastructure and that's one of them.'",
        "'speaker_4': 'So we heard very strongly from the community and council that Joel and really just of the dog park, I was not put up to this question, by the way, by Councilman Clark. So so as long as you don't mind calling it the Clark Park, I think we can accommodate a dog park on this on this site.'",
        "'speaker_4': 'Now, seriously, though, it is our intent to incorporate and build a dog park, and that is written into the parameters of the development agreement for open space. And I know we're all laughing about it, and it sounds like just an amenity, but the truth is that you end up with conflicts in the other open spaces if you'",
        "'speaker_4': 'don't plan for it. And this kind of dense. It just requires it. So thank you. I appreciate that. I think that's all, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Any other questions? Town Council Bill 4314 actually. Okay. Constable 314. Hearing is closed. It's time for comments, Councilman Clark.'",
        "'speaker_8': 'Thank you, Mr. President. And I did not put my colleague up to the dog park question. I was grinning from ear to ear when it was asked to, but I did I did not put her up to that.'",
        "'speaker_8': 'This is, you know, a site that we've been talking a lot about in the just a year since the new class of us came on. An area that is exciting for all of Denver is also really exciting for the community that I represent and is really at the heart of the community that I represent.'",
        "'speaker_8': 'This has been a really long time coming. This community has sat and watched this site and dreamed of what it could be. As we you know, I was I was writing down during the staff report that six years ago a plan called about eagerly awaiting redevelopment of this site.'",
        "'speaker_8': 'And it's so exciting now through Broadway stationary plan and now to be taking the step to be continuing to take steps. And I just hope that we are able to do this and achieve this and actually start seeing dirt being moved around.'",
        "'speaker_8': 'Because I think that that's what the community is is waiting for and longing for, because we've been down this road before. And and and they're ready for things to start coming out of the ground. So I'm excited that we have this here tonight.'",
        "'speaker_8': 'I just wanted to say a couple of things. You know, my West Watch Park Neighborhood Association is one of the most active neighborhood associations on the planet, as my colleagues have seen, with their turnout at a lot of different issues, whether they are specific to my district recently or not.'",
        "'speaker_8': 'And and in your report, you can see and this is the neighborhood councilman Brooks was talking about, are they okay being this close to this kind of density? And they had a 12 to 0 vote and sent no one here tonight to to to even you know, I think when we had the stationary plan, they had a'",
        "'speaker_8': 'unanimous vote of support and then set five people to say, we support this unanimously, but here's here's what we're still worried about. So they're very active and they're very engaged. And so the fact that they have provided the support and strong support from all the neighborhood associations, but specifically from West VI to that conversation, is proof.'",
        "'speaker_8': 'I think that one, this community process has been successful, that everyone from our team with the city to the property owners has really engaged very deeply with these communities, with these neighborhood associations, and worked very closely with them on every little detail, from sound mitigation to light mitigation to dog parks, to fit in everyone's hopes and dreams'",
        "'speaker_8': ', and to a piece of property that this community really feels like they own in a lot of ways. And so I'm thrilled to see this and to see this just, you know, pack it full of very strong support from all of the neighborhoods, saying, okay, let's let's go do this thing, let's start building something.'",
        "'speaker_8': 'I also think that, you know, when I was on the campaign trail and with the city that's growing as quickly as we are, density and growth is always this red hot issue. And across the board, when I talk to people at doors, when they said, you know, we have to protect our historic neighborhoods, Baker West, Rochford, Platte'",
        "'speaker_8': 'Park Overland, Ruby Hill, Ashmore Park and these traditional single family residents. When I would ask, okay, well, if eight or 10,000 or however many people are coming to Denver, where should we put them so that we can protect our neighborhoods?'",
        "'speaker_8': 'And everybody would turn and point to this piece of property and say, that's the perfect place. There are two train stations within a rock throw of each other between Alameda and Broadway, and there is a big brownfield, ugly site that is not bringing value to us and to our community.'",
        "'speaker_8': 'Let's build it there. This is the right place. This is, as I've said before, and I stole this from other people. But this is midtown for Denver. You know, it's not the DTC, it's not downtown. It's that happy place right in the middle that is urban but surrounded by single family.'",
        "'speaker_8': 'And I think that I'm really excited to see this. I really hope that my colleagues up here will support this tonight so that we can take one more step in a process that will continue to have a bunch more steps before we can actually see something come out of the ground.'",
        "'speaker_8': 'But this is an important next step to continue moving us towards that. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_0': 'Thank you, Mr. President. I just wanted to ask that in the final design of Clarke's Bark Park, that we might include a just a small separate area for hairless varieties. I think that's. That's all, Mr. President. Thank you, Susan.'",
        "'speaker_1': 'All right. We still have two public hearings to go. All right, Madam Secretary, let's roll call on the moment.'",
        "'speaker_0': 'Black eye. Brooks. I Clark.'",
        "'speaker_8': 'I mean, I.'",
        "'speaker_5': 'Espinosa.'",
        "'speaker_0': 'I. When I.'",
        "'speaker_5': 'Gilmore. I. Cashman. I can each. I knew Ortega I. Susman, I. Mr. President.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Police closed the voting in a civil.'",
        "'speaker_5': 'War vise.'",
        "'speaker_1': '12 eyes council bill 314 has passed. Councilman Espinosa, will you please put resolution 370? Those postpone on the floor for adoption.'",
        "'speaker_2': 'Thank you, Mr. President. I move that resolution 370 be adopted.'",
        "'speaker_1': 'All right. Thank you. We have a motion in a second. Councilman Clark, did you want to. Comment on this one.'",
        "'speaker_8': 'I don't have any comments on this. Thank you.'",
        "'speaker_1': 'Okay. Seeing that there's no other comments on this one, can we have a roll call, Madam Secretary, on Council Resolution 370 black.'",
        "'speaker_5': 'Hi, Brooks. CLARK. Hi. Espinosa.'",
        "'speaker_0': 'Hi.'",
        "'speaker_5': 'Flynn.'",
        "'speaker_0': 'Hi.'",
        "'speaker_5': 'Gilmore. Hi. Cashman.'",
        "'speaker_0': 'Hi.'",
        "'speaker_5': 'Can each. New. Ortega. My assessment, Mr. President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_5': 'Tonight's.'",
        "'speaker_1': 'Ten is resolution three. 70 has passed. Councilman Espinoza, will you please put Council Bill 319 on the floor for final passage?'",
        "'speaker_2': 'Thank you, Mr. President. I move that council bill 319 be placed upon final consideration and do pass.'",
        "'speaker_1': 'We have a motion. Do we have a second? Second is Flynn right? The public hearing for Accountable 319 is open and we have the staff report. Curt Upton, welcome.'",
        "'speaker_10': 'Thank you, Mr. President. Pro Tem. Good evening. Council Members. Curt Upton Committee Plans, Planning and Development. Tonight we have the first of three items relating to regulatory changes to implement the 61st in a stationary plan. This is a large private property owner initiated rezoning moving property from former chapter 59 mixed use CMU ten with waivers and conditions'",
        "'speaker_10': '. CMU 20 with waivers and conditions and CB 30 with waivers and conditions. And the urban overlay one which is the adult use overlay to the new Denver zoning code with a variety of mixed use districts. So as we all know, this is Council District 11, near 61st and Pioneer Boulevard.'"
    ],
    "Rezones property at 18400 E. 64th Avenue, 6004-6294 Rifle St., 6006-6106 Salida St., 6007-6208 Telluride Way and 6297 Tower Road from C-MU-10 with waivers and conditions Airport Influence Overlay (AIO), C-MU-20 with waivers and conditions AIO, C-MU-30 with waivers and conditions, UO-1, AIO to S-MX-8 AIO, S-MX-8A AIO, S-MX-12 AIO, C-MX-8 AIO, C-MX-12 AIO, and S-CC-5 AIO in Council District 11.  (NEIGHBORHOODS AND PLANNING) Rezones property at 18400 E. 64th Avenue, 6004-6294 Rifle St., 6006-6106 Salida St., 6007-6208 Telluride Way and 6297 Tower Road from C-MU-10 (urban center, multi-unit, 10 stories) with waivers and conditions Airport Influence Overlay (AIO), C-MU-20 with waivers and conditions AIO, C-MU-30 with waivers and conditions, UO-1 (use overlay allowing adult businesses), AIO to S-MX-8 (suburban, mixed use, eight stories) AIO, S-MX-8A  (eight stories more urban form standards) AIO, S-MX-12 AIO, C-MX-8 AIO, C-MX-12 AIO, and S-CC-5 (suburban, commercial corridor, five stories) AIO in Council District 11. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER ": [
        "'speaker_10': 'This gives you a sense of the scale. This is just east of the 61st and penner light rail stop. It's a vacant land again just to the east of the 61st. And Penn Station is just south of 64th Avenue and west of Tower Road.'",
        "'speaker_10': 'It's nearly 150 acres, a little over 147 acres. And the property owners are requesting the zoning to be consistent with the 61st in a stationary plan. It proposes a mix of urban and suburban contexts at a variety of heights.'",
        "'speaker_10': 'And it's going to see if this works. Yes, it does. I'm going to just walk you through the proposed zoning districts starting in the lower southwest corner. Is the C-Max eight zone district that is the closest to the light rail station.'",
        "'speaker_10': 'And the general pattern of this zoning proposal moves from the more urban and dense condition and pedestrian oriented design standards and zone districts closer to the station. And then as you move away from the light rail station, it gets a little more suburban and character.'",
        "'speaker_10': 'So, again, these two districts in the southwest corner of the proposed zoning area are C-Max eight and C-Max 12. Just north of those districts and to the east is the proposed C-Max. Eight a district and the A is a newer zone district that's a hybrid of urban and suburban contexts.'",
        "'speaker_10': 'It's basically a suburban scale of development. However, it provides more pedestrian orientation along key streets. And then as you move north in this purple colored zone district is the Max eight, which is a suburban context, mixed use of eight stories right in the center of the proposed zone area as a yellow zone district.'",
        "'speaker_10': 'That's S-Max 12. And there are some additional height there for reasons I'll get into when I get into plan consistency. And then furthest away from the station in the northeast corner of the proposed zone area, suburban commercial corridor.'",
        "'speaker_10': 'And that's proposed at a scale of five stories. So with that I will. That's the proposal. I'll move into consistency with adopted plans. Blueprint Denver identifies this area as an area of change and transit and orange development, along with open space, town center, commercial corridor and mixed use.'",
        "'speaker_10': 'The only street classification in this area blueprint in Denver is Tower Road as a commercial arterial. And so the recommendations for these land use designations in Blueprint Denver are somewhat self-explanatory. A transit arena development is obviously high density mixed use development with pedestrian friendly design features.'",
        "'speaker_10': 'Open Spaces Open Space Town Center is a little bit more of a mixed use feel along Tower Road and provides more of a destination use and commercial corridor is intended to be a more auto oriented in a more suburban recommendation closer to Tower Road and furthest from the light rail station.'",
        "'speaker_10': 'So next I'll move into the 61st and panel stationary, a plan. And as you can see, the box in blue is the proposed zone area. It's also similar to Blueprint Denver. It proposes a transit community core that's similar to transfer in development recommendation and Blueprint Denver and the pink area.'",
        "'speaker_10': 'And then as you get further away from the light rail station, it transitions into mixed use employment commercial corridor again closer to Tower Road and then town center just to the south of it, along with a linear open space concept that traverses through the site.'",
        "'speaker_10': '61st company stationary plant also has a building heights map. The the building heights proposed in the stationery plan range from 5 to 12 stories and eight stories is actually the most prevalent recommendation in the light blue. And so the proposed zone districts exactly match this recommendation from the 61st and Pena Station area plan in this area.'",
        "'speaker_10': 'Again, closer to the station, down on the south southwest corner, there's a recommendation of eight stories in the light blue, 12 stories in the purple. And then, as I mentioned previously, there's this sort of triangular shaped parcel here.'",
        "'speaker_10': 'It's shaped that way because of the proposed open space that runs through the site, and that's proposed for 12 stories to take advantage of the open space in front of that parcel and views towards the city. And then again, as you get further away from the light rail stop in the yellow, is that the five story or'",
        "'speaker_10': 'the lower intensity zone districts in the northeast corner? The 61st page station plan also has an urban design plan that specifies active edges and where pedestrian oriented building frontages should be oriented to. And so, as you can see here, this these blue corridors that run east, west through the station area are these key pedestrian and urban design'",
        "'speaker_10': 'corridors that link tower road to the to the light rail stop. And this is where the C-Max districts, which again are the more pedestrian oriented districts, are mapped in the proposed rezoning along with that hybrid S-Max eight A that I mentioned.'",
        "'speaker_10': 'And so that hybrid zone district will require pedestrian friendly frontages along these two key corridors of 60th and 61st Avenue. And then the remaining portions of the site can be left in more of the suburban context. So with that, we do find that the proposed rezoning is consistent with all of our plans with Blueprint Denver and with'",
        "'speaker_10': 'the 61st and Pinion stationary plan. It's consistent with uniformity of district regulations. It furthers the public health, safety and welfare. It meets, obviously the justifying circumstances criteria as the 61st Centennial Light Rail Station is open. We have several plans that are calling and recommending for more intensive development.'",
        "'speaker_10': 'It's also consistent with the neighborhood context and zoned district purpose and intent. With that, CPD does recommend approval. The planning board recommended approval unanimously and we have received no public comment on this case. I'd be happy to take any questions.'",
        "'speaker_1': 'Thank you, Mr. Upton. We have only one speaker for 319, so let me call Fred Bellows up to the podium.'",
        "'speaker_3': 'Good evening heard bells representing Elsie full in rider anchored the developer. 1125 17th Street Suite 2500 Denver. And I got to admit, that was rather surreal. It's a flashback anyway, but that's not why I'm here to speak. Yes, we're excited about this rezoning.'",
        "'speaker_3': 'It is consistent with the station area plan. This property has a lot of properties in town that have waivers and conditions. Didn't get re zoned with the new zoning code in 2010. This brings us into compliance with it.'",
        "'speaker_3': 'And we've worked hard with the staff to make sure that this zoning will match the station area plan. In fact, we created a news only district that you all approved as a max eight a the really kind of specializes some of the particular aspects on this property.'",
        "'speaker_3': 'So and as you'll see later tonight we need to rezone to avail themselves of the signage overlay that hopefully you'll also pass. So I'm here to answer questions and we ask for your support.'",
        "'speaker_1': 'Thank you, Mr. Cross. We have no other speakers. Do we have any questions from members of council? Uh, Councilman Espinoza?'",
        "'speaker_2': 'Yeah. Could you go to the slides about the plan? It was first shows to the proposed zoning zone districts.'",
        "'speaker_10': 'You must see the. The proposal.'",
        "'speaker_2': 'Yeah. We're going to step through these again. This one. Well, let's let's start at that last one. And then we'll come to this. Okay.'",
        "'speaker_10': 'Blueprints. Denver And this is the most visionary plan.'",
        "'speaker_2': 'So second on the blueprint, Denver. Sorry. Okay. Second, on the recommendations for that letter listed here. Who knows what the true priority is, is open space. And then you clearly have that green belt shown here. And if we were to scroll through every single subsequent plan, you also have that greenbelt shown here.'",
        "'speaker_2': 'Now, if you could go back to the actual proposal in district. Map. How come there isn't any OWS zoning? Even vaguely. I mean, there's no ozone district here whatsoever. How come there isn't any attempt to sort of recognize that?'",
        "'speaker_2': 'There are several plans that call. It looks like the you know, the max eight. Honors that that boundary. But there is nothing here that would obligate open space other than, you know, whatever the zoning requires. And it could be put here, there and everywhere.'",
        "'speaker_10': 'Great, great, great, great question, Councilman. So I didn't mention I probably should have in my presentation that there is an approved general development plan for this area that does require a 10% open space. And so similar to the last case that this came up with with the Broadway station, all of these zone districts allow open space.'",
        "'speaker_10': 'The general development plan will be the tool to require that that open space and especially in these areas where the real detailed designs are still to come. Often what we've seen is when we map. Those open space districts.'",
        "'speaker_10': 'Before that detailed design happens, we'll have to come back in and make some small adjustments and go through a rezoning process just to reconfigure some of those own districts. So the general development plan, combined with these zoning districts, we feel, is not only meeting that 10% requirement, it's requiring that 10% requirement, but it will allow a better'",
        "'speaker_10': 'development process going forward.'",
        "'speaker_2': 'So I thought I thought I saw at some point in a point in a committee where those sort of notions were married. But is there anything that compels that them to make that open spirit, meet that open space requirement in sort of that large aggregate, contiguous sort of form that was shown in the plans?'",
        "'speaker_10': 'Yes. So so the general development plan not only requires the minimum, it also delineates where it is generally. And so the general development plan is essentially what you're looking at here in terms of the design of the open space.'",
        "'speaker_2': 'Okay. So if if any development was being proposed, it needs to conform to the GDPR, which would clearly honor the intent of these underlying plans. With respect to where the open space. Absolutely places. Thank you.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I wanted to ask a question about the scale of the development. So we've got 147 acres that makes up this site. Would you remind me what the amount of acreage is that is to the West that makes up the whole stationary plan that we've already done rezoning for?'",
        "'speaker_10': 'Do you happen to know? So are you showing the proposed zone map here? Are you talking about.'",
        "'speaker_6': 'I'm not talking about the area that we're rezoning here. I'm looking at the big picture of how much development we're going to be seeing and then looking at the sort of scale and density of what we're looking at in this general area with what we've already rezoning with this zoning.'",
        "'speaker_10': 'So I'll just put this map up that this shows the whole the whole station area. And so the the blue box is the the proposed zone area that we're talking about. So it's maybe a third of the whole 61st opinion stationary itself.'",
        "'speaker_10': 'To my knowledge, this is the. This is the first zoning that we've done in this station area.'",
        "'speaker_6': 'Okay. So what I get confused with is I don't sit on the ah land use committee and we've seen many different phases of this project that have come through piecemeal and so it's hard to keep it all straight in terms of which ones are.'",
        "'speaker_6': 'You know, the phasing of them and you know what each one is doing. And so I'm just trying to understand the scale because my next question is going to get it. How much big box retail are we looking at as part of this overall development?'",
        "'speaker_6': 'Because as we know, we've got people who live in Denver that shop in Aurora, and we want to be able to have some of those amenities in Denver County that Denver residents can shop at. And so just looking at that overall scale for me is is helpful to understand the big picture and where we might see that'",
        "'speaker_6': 'on on the map.'",
        "'speaker_3': 'Sure, Councilwoman. Thank you. So the entire land area for Union Station area, Penn Station area plan is 384 acres. This is about 147. There is a landowner to the south that's from 56 to 60th. It's about 150 acres.'",
        "'speaker_3': 'The remaining land is a small landowner to the north west corner that has about 20 acres, and then DIA has the remaining 60 acres. DIA runs along Pena Boulevard to the west of this property.'",
        "'speaker_6': 'So so does all of that make up the 384 or that's enough to.'",
        "'speaker_3': 'Know that that all of the together those four landowners Dias Donald Airport and I don't think they envision any residential and probably not any big box. So the big box would be along Tower Road. This our rezoning proposal would allow big banks along Town Road, most likely at about 64th and tower where you come into the station'",
        "'speaker_3': 'at 60th, first and 60th. That's where we had the cinema. A And really that is designed to be more pedestrian friendly, which frankly big box is not. So that's why we have as CC up at the corner of 64th and Tower Road currently I believe the rezoning and I'm sure that CPD staff could speak to it.'",
        "'speaker_3': 'The zoning on the southern portion that's not being redone tonight is a mix of CMU ten, 20 and 30. And frankly, that probably has more flexibility overall for Big Box. Although if they were to rezoning the Long Tower Road to SCC, they could have the same opportunity.'",
        "'speaker_3': 'So we are planning on keeping portions of the site on the major arterials tower and 64th and tower and 56 of L four. Big box.'",
        "'speaker_0': 'Great.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Right. Are there any other questions for members of the council? All right. A public hearing for Council Bill 319 is closed. Comments from members of Council. Councilman Goma.'",
        "'speaker_5': 'Thank you, Mr. Pro-Tem.'",
        "'speaker_7': 'You know, this gets us to a place with the 61st and Pena Station area plan that, you know, is really exciting for myself and constituents in District 11. I think maybe I was two months into office when we started having these conversations and I very quickly had to pull up the 1988 IGA and delve very deep talking'",
        "'speaker_7': 'about, you know, noise overlays and how this area was envisioned and really staying true to that vision and working with the community of District 11. We held a very large town hall visiting visioning. Evening with about 100 community members to specifically talk about this and other developments in District 11 and had CPD staff present to answer any'",
        "'speaker_7': 'questions and through that process had over a thousand, you know, constituent responses to a different survey. And this was one of the questions that we asked about what people would like to see. And honestly, to Councilwoman Ortega's question, you know, retail is something very important, followed closely by, you know, entertainment opportunities for families and residents and then'",
        "'speaker_7': 'full service restaurants. And so really having the density that, you know, you need to encourage that sort of retail development is something that that this will get us to. And I will be supporting this tonight, and I would ask my colleagues to do the same and consider it.'",
        "'speaker_7': 'Thank you, Mr. Pro-Tem.'",
        "'speaker_1': 'Thank you, Councilman. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. And Councilwoman Gilmer. I'll be very happy to join you in supporting this. It's simply amazing to me to see how quickly the private sector and the CIA and RTD have worked together to make this happen.'",
        "'speaker_3': 'I read because I, as you know, for I worked on the the airport train project at RTD. And I remember when the mayor and Full and wider came to RTD and said, you know, we want to we want to move ahead with that station there.'",
        "'speaker_3': 'And then we would start pulling our hair out, say, how are we going to do this? We've already started construction. And wouldn't you know that by opening day, by opening day 61st and Penn Station was available? And I have to say, despite the sticker shock that you guys probably experienced during the negotiations, it's a beautiful station and'",
        "'speaker_3': 'an 800 car and 800 space park. And. Right. It's already being used by commuters. And to see what's happening there, this is exactly the kind of opportunity that this city wants to and needs to take advantage of to to accommodate the growth that's coming to our city.'",
        "'speaker_3': 'So I congratulate the city, the DIA, RTD and full and wider on putting this together. I'd be happy to support it. Thank you.'",
        "'speaker_1': 'Councilman. Councilman Espinoza. That's my husband.'",
        "'speaker_2': 'I'm sorry. Question for my colleague. I just wanted to thank Stacey for. For bringing this forward and and embracing density out there, because this is this is are one of the few pieces of greenfield sort of that we have.'",
        "'speaker_2': 'And we're going to be putting infrastructure in and we're going to be it already has infrastructure and recycled water systems and stuff that are out in northwest northeast Denver. And, you know, it's a great opportunity. If you look at the stormwater plans that we looked at, you know, just last week, you'll see that they've got nothing but'",
        "'speaker_2': 'green. You know, it's handled out there. There's ways to do this, do development and all aspects of development, all the things that are difficult to do it right and do it relatively economically out here. And so it's it would be a travesty to continue to do more single storey I mean, single family, you know, resource intensive suburban'",
        "'speaker_2': 'developments, a longer rail. So as she knows, when they came forward, I said it's not going high, high enough. So I just hope that you're able to curate and bring the sort of developer partners to really bring something completely different to Denver, to certainly capture the housing needs, the the retail needs of that area and all the'",
        "'speaker_2': 'other needs. Because this is the certainly the zone districts that are proposed have a lot of latitude to do a lot of creative things. But they also because our form based zoning will allow such a wide range of things, it could really be sort of stagnant at the same time.'",
        "'speaker_2': 'So it's really up to you guys to, to, to do it and do it in a way that is really, really, really vital for years to come. So it will be sort of supporting the rezoning because it can capture those things.'",
        "'speaker_2': 'But it's up to you guys to follow through. Thanks.'",
        "'speaker_1': 'Thank you. Councilman, are there any other comments?'",
        "'speaker_2': 'No, thanks.'",
        "'speaker_1': 'Right. Madam Secretary, you ready for the roll call?'",
        "'speaker_5': 'Black eye, Brooks. Clark.'",
        "'speaker_8': 'I.'",
        "'speaker_5': 'Espinosa. I. Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Gilmore. I. Cashman.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Can each new. Ortega. I. Sussman. I. Mr. President, i.'",
        "'speaker_1': 'Is closed voting and announced results. 11 811 hours council bill 319 has passed. Councilman Espinosa, will you please put Council Bill 346 on the floor for final passage? Before I do that. And no, I'm being extra cautious here when I'm asking our assistant city attorney, do we need to move both of these at the same time or'",
        "'speaker_1': 'just one after the other? And that suffices. Oh three, 46 and 47.'",
        "'speaker_2': 'You'll need to motions, but you can you can make those at the same time.'",
        "'speaker_1': 'Okay. Do I get.'",
        "'speaker_2': 'And motion them separately or can I put them both moving separately and keeping.'",
        "'speaker_1': 'Them separately? Just want to make sure because.'",
        "'speaker_2': 'Thank you, Mr. President. I move that council bill 346 be placed on final consideration and do pass.'",
        "'speaker_1': 'All right. The combine public hearing for council bills, 346 and 347 is open. You can address either or both bills at the conclusion of the public hearing. We will vote separately each bill. I mean, we have the staff report or actually.'",
        "'speaker_1': 'Yes.'",
        "'speaker_2': 'Thank you, Mr. President. If council can go ahead and put the other bill on for final consideration as well. If you want to make that motion now.'",
        "'speaker_1': 'Okay. Councilman, do you want to do that?'",
        "'speaker_2': 'Yes, sir. And I move that council bill 347 be placed upon final consideration. Do passed as well.'",
        "'speaker_1': 'Thank you. All right. We have both of them combined a public hearing. May we have the staff report, Steve?'",
        "'speaker_11': 'Thank you, President Pro Tem and good evening, members of council. I'm giving one presentation and one staff report for these two items, both a text amendment and a map amendment. This is the opinion section. Next design overlay. And part of that overlay or part of this amendment includes changes to the Denver International Airport signage.'",
        "'speaker_11': 'This is Text Amendment number six, and that's an image of Pinion Station, which we've been talking about quite a bit this evening. This amendment was sponsored or is sponsored by the Department of Aviation and Department of Community Planning and Development.'",
        "'speaker_11': 'We have heard some comments in the last case of how quickly DIA was able to work with property owners with CBD as quickly worked with the area as well. And it's been a great relationship and working to put this bill in front of you.'",
        "'speaker_11': 'Also, we've worked quite a bit with the property owners at 61st and Pioneer, which you've heard from first. And I believe they'll speak again the process. Starting with December 5th and 2015, CPD presented a summary of amendments to the Inter Neighborhood Cooperation Zoning and Planning Committee on the 1st of February.'",
        "'speaker_11': 'A draft of the amendment was supposed to to the CP website and the email was sent noticing all Arnaud's and Councilmember members excuse me, on February 11th there was a Council District Town Hall, which our Council Chairman Gilmore mentioned on the previous case.'",
        "'speaker_11': 'And then on March 2nd there was a planning board public hearing. They continued the public hearing that evening we actually held a planning board study session to roll up our sleeves, get into more detail and into this amendment.'"
    ],
    "Approves a map amendment to apply the proposed Pea Station Next Design Overlay District (DO-6) concurrent with the adoption of the accompanying text amendment in the area from Pea Boulevard to Tower Road, from 56th Avenue to 64th Avenue in Council District 11. (NEIGHBORHOODS AND PLANNING) Approves a map amendment to apply the proposed Pea Station Next Design Overlay District (DO-6) concurrent with the adoption of the accompanying text amendment in the area from Pea Boulevard to Tower Road, from 56th Avenue to 64th Avenue in Council District 11. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 5-11-16.": [
        "'speaker_11': 'On April 20th, we went back to the Planning Board for the continued public hearing where they recommended approval with the condition. The condition is detailed in the staff report on May 11 through its Neighborhoods and Planning Committee on the 27th notice was sent to City Council before the City Council public hearing to all Banos and Council members'",
        "'speaker_11': 'and signs were posted throughout the subject map area, which is 384 acres of land. And then we're here tonight for the city council public hearing. So there are two parts to this amendment. We are revising the DIA signage rules and we're establishing the Pinion Station next design overlay.'",
        "'speaker_11': 'So the purpose of the first part is to clarify the manager of aviation's existing authority to regulate signs in the days on district. So in the days of the district and again, this is only maps, not again, but DIA is only mapped on land owned lands owned by DIA, Denver International Airport.'",
        "'speaker_11': 'And in the Denver Zoning Code, Section nine five to Denver International Airport Zone District states that the Denver manager of aviation shall determine all design and development standards applicable to new developments in the day zone districts district. However, there are conflicting provisions in Article ten that were carried forward from former Chapter 59 and Division 1010, which is'",
        "'speaker_11': 'the sign code of the Denver Zoning Code. It sets forth standards for signs in the DIA Zone District. So even though the manager of aviation has the authority to determine all design and development standards in the DIA district, so the proposed zone district would remove the DIA standards from Division 10.10, which is design code to be consistent'",
        "'speaker_11': 'with the airport. Close authority. Per the Denver Zoning Code, section 952. For a portion of the proposed Doe six, the sign centers will still apply, and I'll explain that a little more detail when I have a map in front of you.'",
        "'speaker_11': 'So we mentioned the 1988 airport IGA in the last case, but this is a map kind of depicting the requirements or the basically establishing the scenic buffer. So in 1988, the airport Internet Intergovernmental Agreement excuse me, between Denver and Adams County, as amended, requires a scenic buffer.'",
        "'speaker_11': 'And that's what's on your map in green that extends a thousand feet on either side of the center line of Pioneer Boulevard within excuse me, within the transportation corridor that shall be preserved as open space. The idea also requires Denver to ensure that no residential, commercial or industrial development occurs within the scenic buffer that includes signage.'",
        "'speaker_11': 'This applies to the entire portion of the corridor that borders the subject map amendment area. Therefore, the effect of the delays on district signage amendments will only be to clarify the authority to set science standards in the airport proper.'",
        "'speaker_11': 'And that's that's really that yellow area. So once you've once you're kind of entering the a470, you see in the distance the University of Colorado Airline passing over, you have the sign that says Denver International Airport. That's really where the CEO has authority to make decisions about signage.'",
        "'speaker_11': 'Also on this map, you see the digital experience location. So that's that's what this represents. So this is a new entrance. This is an illustrative example of a new entrance today. And this is what this amendment would would allow.'",
        "'speaker_11': 'So now shifting over to the Deus Ex, the actual design overlay itself. So this is to establish and enable innovative signage in the pinna and 61st strains that were in the development area subject to standards and further review.'",
        "'speaker_11': 'I'll get into to some of those details. You can find quite a bit of detail in the staff report. But we have to map the overlay route. We have to apply it. So this is the end district 11 in the day neighborhood shown in red.'",
        "'speaker_11': 'Is that 384 acres? Again. The MAP movement is initiated by CPD and the Department of Aviation. Multiple owners are included in this in this 384 acres, including DIA. So as you can see. My map. We have a 60 acre portion of land here that's mapped DIA.'",
        "'speaker_11': 'So the authority that's given to the CEO for controlling signage really applies off the map right in that yellow area. The six will still apply here. So they're subject to the same rules that the other property owners are subject to.'",
        "'speaker_11': 'Also from the previous case, there was a rezoning into the new code, a lot of this, and now this map is outdated. A lot of this area is still zoned. Former Chapter 59. The design overlay will not apply there until those property owners come forward with map amendments.'",
        "'speaker_11': 'So how does the design really work? So the Tech Summit, which is Deus Ex, is adopted by City Council. Hopefully it enables and sets the review criteria and standards for a district plan. So really it enables it sets the criteria.'",
        "'speaker_11': 'It talks about how do you how you amend it, how you notice create notice for amending who can amend it. And it's really enabling language and all of the detail, the pretty graphics, the signage, the sign types, all the things that we're really interested in when we talk about signage.'",
        "'speaker_11': 'We really found in the district plan itself. So the district plan would be approved by planning board. It would not come before this body. The district plan sets framework for sub areas, supplemental plans and and permitting and must be consistent with the districts of the planning board must find that anything in that year six is in the'",
        "'speaker_11': 'district plan is consistent with districts. There are also supplemental plans. So as as properties come forward. As you can see, it's 384 acres. It's not all plan. We don't know exactly what's going to happen out there yet. Staff can administer and approve supplemental plans kind of block by block, providing greater specificity on projects or sub areas and'",
        "'speaker_11': 'must be consistent with the district plan. So we kind of have this hierarchy. We enable with the text amendments, we get into the details in the district plan, we get into a lot more detail on the supplemental plans which can actually be administered by staff, and then we start issuing permits.'",
        "'speaker_11': 'So just a quick summary of the key provisions in the dossier itself. The standards will vary among some areas. The language in the DIO six actually requires the creation of some areas. So we're not just saying the district plan has one sign type across the 384 acres.'",
        "'speaker_11': 'It's going to be very different. Right. The the transit the platform itself is probably different than Tower Road, which is probably different than the residential areas. Also billboard pole signs as we know them. Right. This is that traditional billboard are prohibited unless architecturally enhanced by the district plan.'",
        "'speaker_11': 'So it's actually really difficult to prohibit a sign on a pole because most signs have a pole. Right. And so this is this is defined as one pole or multiple poles for general outdoor advertising. The intent is what we know as a traditional billboard and the district plan really defines what it means to be architecturally enhanced.'",
        "'speaker_11': 'And planning board would have to find that it's not what we think of as that traditional billboard. Also in the d06, there's the minimum pixel pitch resolution. So this is to ensure quality of the digital signs. So it's it's actually requiring a minimum pixel density.'",
        "'speaker_11': 'The more pixels you have, the clear the picture your monitors in front of you probably have a higher your new monitors in front of you probably have a higher pixel pitch than your previous monitors. And then the district plan shall prevent the cumulative effect of signs from being visually overwhelming and must mitigate adverse impacts.'",
        "'speaker_11': 'All right. So getting into the design criteria or the review criteria, this is the same for a text amendment. As for the MAP amendment, there are three plans that apply to the site. But before I get into those, this amendment will further the public health, safety and general welfare and will result in regulations that are uniform within'",
        "'speaker_11': 'each zone district. Getting into the plans themselves can't plan as a number of standards that encourage the use of an overlay in order to be flexible and accommodate a number of land uses across the site. Of course, it recommends mixed use study that encourages vibrant urban centers and neighborhoods, and it focuses on design centers and review efforts'",
        "'speaker_11': 'on new and evolving districts that are undergoing the most dramatic change. Also recommends identifying community design and development issues and targeting specific concerns with appropriate controls and incentives. So the text movement improvement are both consistent with comprehensive plan 2000 getting into to blueprint.'",
        "'speaker_11': 'So the overlay itself is is identified as a tool that should be used and could apply to larger areas where there are similar objectives. So it's it's really designed for a site, a larger site where you have maybe multiple based on districts, but you're trying to create a character throughout that site.'",
        "'speaker_11': 'As you can see, the land use concepts desire the mixed use commercial corridor or the town center, open space. Tod We have kind of this variety of land use recommendations all within an area of change, but the overlay would apply across the 384 acres to find that consistent character.'",
        "'speaker_11': 'So the design overlay map movement and and Texoma furthers implementation of Blueprint Denver And then getting into the fenestration station vision the 61st and pinion stationary plan another shot looking down aviation place at the platform itself looking west.'",
        "'speaker_11': 'There are a number of sentences and a number of recommendations within the plan that call this kind of the national model, this unique station. It is the only entirely greenfield to the opportunity within Denver, which really sets it apart from other transit communities right here in Denver.'",
        "'speaker_11': 'The plan calls for a showcase of the best of kodi. State of the art treatments also calls for world class design, 21st century solutions and kind of that showcase community for what the 21st century lifestyle could be. All of these point to innovation in signage, innovation in our tools, really taking advantage of this opportunity out at 60%'",
        "'speaker_11': 'pioneer so with that stuff recommends approval of Denver zoning code text amendment number six and stuff also recommends approval of Map Amendment Proposal 2069 ten Rezoning of property from Pioneer Boulevard to Tower Road and 56th Avenue to 64th Avenue to the DOT six Overlay Zone District.'",
        "'speaker_11': 'Thanks.'",
        "'speaker_1': 'Thank you. All right, we have one speaker, Mr. Fred Bells. When I approached the podium.'",
        "'speaker_3': 'Four Bells, 1125 17th Street, representing the master developer, Elsie Foreman Weitering. I think we're going to get out of there a lot earlier than last week. I watched you guys until 1 a.m. and done. But anyway, this is really unique side and this is the opportunity to make it very special using a lot of the technology that'",
        "'speaker_3': 'one of our major anchors is bringing to the table. There really started our cutting edge company that is going to allow us to be transformative in the way we operate, in transformative the way we present ourselves. I believe there's enough controls in it to give you all the comfort that the planning board will be able to manage'",
        "'speaker_3': 'it properly. We've already been working closely with them in terms of some of the particulars. But, you know, this is obviously the enabling legislation and we very much ask for your support, and I'm here to answer any questions.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. I conclude the Speaker's public hearing for Council Bill 346 and 347 are closed. Can we. Do we have any questions from council? Councilman Espinoza.'",
        "'speaker_2': 'Here it is. Planning board will approve the plan, but if it's anything like the stadium signage plan wouldn't fall on the zoning administrator to approve or not approve actual designs of signs.'",
        "'speaker_11': 'So I'll get back to the kind of hierarchy slide which may help here. So. So the d6 enables the creation of a district plan. Planning Board has to approve the district plan. If a building comes forward and it's treated as a supplemental plan, it's consistent with the language of both Doe's six two supplemental plan and the district'",
        "'speaker_11': 'plans a supplemental plan. Then staff can administer it. It has to be found consistent with the district plan and iOS six. So there they're kind of different levels of review. So for example, if you come in with a block and that that area is well defined in the district plan and there are standards set forth in the'",
        "'speaker_11': 'district plan, then you can come in with a supplemental that is consistent, right? You're showing you're not inconsistent with the district. Should you come forward with a building that is inconsistent, you would have to go back to a planning board and actually amend the district plan and planning board would have to approve that.'",
        "'speaker_2': 'So their staff and zoning administrator approved it and found it consistent. Right. What recourse does the public have? Is that a decision that is appealable to the Board of adjustment.'",
        "'speaker_11': 'Might be a question for for need as far as appealing appealing the approval of a supplemental plan approved by staff. Does it go back to the planning board? I don't think it does.'",
        "'speaker_2': 'I couldn't quite hear the question. I don't know if is the acoustics in this room or what. Yeah, it's it it again, this thing the if if since these if if the zoning administrator and staff find that whatever's being proposed is consistent with the plans and what is the what recourse is the public have if they don't'",
        "'speaker_2': 'agree is are these decisions subject to appeal to the board of adjustment. So I believe the way it's written and I'll take a look at the at the text amendment again here real quick. But I believe it provides that the planning board's decision is a final agency decision.'",
        "'speaker_2': 'So it would be appealable under current rules of civil procedure. One of six. So I, I agree with the planning board, but the problem is, is the planning board sets the framework. After that, it comes down to the zoning administrator and staff to to say yay or nay.'",
        "'speaker_2': 'It meets what the planning board said. And and the reason why I'm familiar with this is this. Are you familiar with the now defunct business, the Sports Authority? Never heard of it. Just, of course, genuinely. Are you familiar with their logo?'",
        "'speaker_2': 'Yes. What does it look like?'",
        "'speaker_11': 'Uh, I could pull it up on Google if you'd like.'",
        "'speaker_2': 'Does it look like what's on the stadium? Yes or no?'",
        "'speaker_11': 'So this is just like a naming rights question?'",
        "'speaker_2': 'No, it's actually a signage plan. Question. Okay. I mean, does it look like what's on the stadium today?'",
        "'speaker_11': 'Right. So so I understand that there's I believe there's a comprehensive simply and I'm not really.'",
        "'speaker_2': 'There is in the comprehensive sign plan specifically says that the building shall not have any logos on it. Well, it just so happens that the Sports Authority logo is the word. Sports Authority is very specific font in a certain color.'",
        "'speaker_2': 'Right. The zoning administrator. But that comprehensive sane plan approved by planning board, amended by planning board adopted by planning board is then administered by the zoning administrator. And at the zoning administrator says that that's not a logo. With everyone.'",
        "'speaker_2': 'Everyone in their brother knows that that is what's on the sports castle as their logo. There is no recourse for the public to. To. So what. What avenues if. What. What is there? What legs does the community have?'",
        "'speaker_2': 'If what gets approved ultimately by the planning board, if if staff and the zoning administrator then deviate from that in some sort of allowed manner. But it is genuinely inconsistent with what was what was approved.'",
        "'speaker_11': 'Right. So as he mentioned, there's the 106 process. But do understand that that it must be consistent, right. As you've said, it must be consistent with that district plan. So we are putting a lot of detail into the district plan.'",
        "'speaker_11': 'Planning Board is also very, very tuned into this effort, and they're putting a lot of time into the district plan. In fact, we have another study session with planning boards so we can roll up our sleeves again and really get into those details.'",
        "'speaker_11': 'And we can certainly discuss this with them as a concern that you've raised. But but again, it staff must find it consistent if if they do not. So let's go.'",
        "'speaker_2': 'Back. We'd like us. I guess I'm not comfortable at this point in time. For that reason, I would like us to have a mechanism just like GDP's are never approved by council. The these comprehensive same plans could. I would like us to have a mechanism to sort of redress issues about when there is a parent.'",
        "'speaker_2': 'I mean, when there's a challenge of the inconsistency with the planning boards, with these district planning supplemental plans. You know, by the community.'",
        "'speaker_11': 'Okay. So, so again, I can discuss this with planning board. I'll be sure to as a, as an issue and we can talk through it in more detail with them.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Councilman Flynn. When the coming.'",
        "'speaker_3': 'Shooting. Thank you. Just a quick question. Is the Steve, as I don't see any mention of the other landowner involved here, Mr. Smith, who owns a substantial section of the land down to 56th Avenue. Has he been involved in this at all?'",
        "'speaker_3': 'Does he concur?'",
        "'speaker_11': 'So he has had representatives involved and has been involved in the conversation. I know that perhaps Fred can speak to the conversations that they've had. I do know that we may have future map amendments coming forward in order to enjoy the new districts that we're proposing to map tonight.'",
        "'speaker_11': 'But as far as the conversation, I'd like for you to address that.'",
        "'speaker_3': 'All right. Thanks. Thank you, Steve. Councilman, we have had discussions with their representative and the law firm in town when we all know and they are. The law firm has told us that they're fine with the overlay because really the overlay, they cannot avail themselves of anything in the overlay until they re zone number one.'",
        "'speaker_3': 'You don't see the district plan, but none of the properties that is their property are going to be in phase one of the district plan. So they'll have to come in back to the planning board and add on their property to it.'",
        "'speaker_3': 'So specifically they said, fine for the overlay, don't include us in a district plan if and when we want to take advantage of this will rezoning. Okay. So I take it from your from what you just said that they were notified of this process and they are obviously not not here.'",
        "'speaker_3': 'They definitely were notified and and involved in the discussion. Okay. Thank you. That's all.'",
        "'speaker_1': 'Let me ask our assistant city attorney to chime in.'",
        "'speaker_2': 'Thank you, Mr. President. I just wanted to add some clarification to Councilman Espinosa's questions concerning what happens if if the public is unsatisfied with the zoning administrator's decision and the that the actual text amendment does provide a mechanism to appeal that.'",
        "'speaker_2': 'And that appeal goes to the planning board. And then again, that that is that is appealable under one of six. So to initiate the appeal is a 30 day window from the decision from the zoning administrator. And how does the community get notified of that?'",
        "'speaker_2': 'Are we talking about appeal from the zoning administrator's decision? Correct. I don't see that clarified here. Let me let me take a look at that and I'll get back to you. Thank you. Thank you.'",
        "'speaker_11': 'So there are multiple appeal sections here because there's an appeal process for the district plan in addition. But you're asking me about the supplemental plan. So it's it's actually on page 9.43 of your draft. It label appeals the letters appeal any decision to the zoning administrator under section 945 ten W may be appealed to the Planning Board'",
        "'speaker_11': '. Thereafter, the Planning Board's decision may be appealed to the District Court.'",
        "'speaker_2': 'So is that. But is that so? Is there a notification component to the is the zoning administrator's decision? How would a member of the community know that there's already administrator and.'",
        "'speaker_11': 'So that there has to be notice to others prior to approvals? The zoning administrator shall send notice of the supplemental plan to an organizations each city council member in the at large. So notices are required by the section and shall be sent at least 14 days prior to the zoning administrator's decision to approve, approved with conditions or'",
        "'speaker_11': 'deny such plan.'",
        "'speaker_2': 'So we know that it's going to be a decision is going to be made. We don't know what the decision is until it either happens or somebody inquires.'",
        "'speaker_11': 'That is correct. Okay.'",
        "'speaker_2': 'As written and then 30 day window, there's a same statute of limitations or whatever we call that to appeal. The appeal process. I guess it is because it's in the DCC, so if it's there, whatever. But a planning board, though, I mean, planning board really can be at any time, correct?'",
        "'speaker_2': 'Are you asking about the timing of the appeal to the planning board? Yeah. So the actual text amendment doesn't address the time within which to appeal, and we can address that in the district plan, however. So like and Councilman Espinosa, you're familiar with the the Board of Adjustments provisions and their bylaws provide when appeals need to be'",
        "'speaker_2': 'made of their of their decisions. And so the same is as we did with the bylaws for the Board of Adjustment. We could also put timing into the district plan, which addresses when a person would need to appeal a supplemental plan.'",
        "'speaker_2': 'Well, actually, leave it like this, because right now it is. It's any time, right? Right. It's pretty wide open right now. But there needs to be some reasonable limitation on that. All right. Thanks.'",
        "'speaker_1': 'Councilman Gilmore.'",
        "'speaker_7': 'Thank you, President Pro Tem. Steve, can.'",
        "'speaker_5': 'I ask you a couple of questions.'",
        "'speaker_7': 'With the first planning board meeting? Could you talk a little bit about some of the concerns that the members of the planning board had? And, you know, through the planning session, how both the the manager of aviation, Brad Buchanan with CPD myself was present in that planning session, worked through pretty much line by line talking about this'",
        "'speaker_7': 'this, you know, the sign overlay.'",
        "'speaker_11': 'Yeah, that's a great question. So we we went to I can pull up the schedule again to reference our dates, went to planning board initially. That's not the side. Initially on the second for the public public hearing, we had gone we had visited with planning board prior to that, an information item.'",
        "'speaker_11': 'But the planning board wanted to learn more. They wanted more detail. They wanted to see and understand what the vision was to really get a sense of why why we were doing this and really, you know, learn more about the project.'",
        "'speaker_11': 'So at the study session, we spent more time going through the more detail of the plan itself and what it recommended. We pulled up the language and really, like you said, went line by line and talked about the detail that we couldn't really get to in the in the public hearing setting.'",
        "'speaker_11': 'Representatives from Dan were there during National Airport and started talking about why and what they would like to achieve with their entrance sign. And it was just a good conversation and more detail, more kind of meat on the bone.'",
        "'speaker_11': 'So plenty more had a better understanding of what we were proposing to do.'",
        "'speaker_7': 'Thank you. Thank you, Mr. Burton.'",
        "'speaker_1': 'Q Councilman Ortega.'",
        "'speaker_6': 'Thank you. I want to ask Stu, if you wouldn't mind coming forward. I want to know if there are any FAA guidelines related to lighting that is within a close proximity to airports. I mean, I can imagine that Panasonic's going to have these huge signs that people will be able to see from from afar distance as they'",
        "'speaker_6': 'approach the, you know, the new Penn Station and any of the development that will be there. So I'm assuming we have to make sure that it's not going to be destructive to pilots as they're flying in to be, you know, sort of misinterpreted with some of the other signage that's on airport property, especially in inclement weather, where'",
        "'speaker_6': 'you can't really see that well in in some weather conditions. And the same for that, the traveling public that's traveling on the roadway. So is that something you're able to address?'",
        "'speaker_0': 'Good evening, Stu William, senior vice president of special projects for Denver International Airport. Thank you, Councilwoman, for that question. So let me start first with where anything that would happen, like in Penn Station next, for instance, obviously has a different code requirement than what we would have for the FAA.'",
        "'speaker_0': 'And frankly, the distance from the runways at Penn Station probably wouldn't be a concern now. The lighting on our.'",
        "'speaker_10': 'Property.'",
        "'speaker_0': 'Definitely has to be basically approved by the FAA to the point of even the solar canopies. We're going to put over the the 800 space parking structure that you folks approved the lease for a couple of weeks ago, had to be approved by the FAA.'",
        "'speaker_0': 'And then as we get on to more airport proper, any of that signage again would have to come in under compliance.'",
        "'speaker_10': 'With FAA.'",
        "'speaker_2': 'Rules.'",
        "'speaker_0': 'So ultimately, I think the answer to your question is the FAA controls.'",
        "'speaker_6': 'Okay. So then let's talk about the the roadway. And I just want to check in with with Howard or. To find out if there are maybe some C dot guidelines or any of that kind of stuff where, you know, the signage may be distractive to drivers as they're driving down, whether it's visible from pinhoe or visible from'",
        "'speaker_6': 'tower, because the signage is pretty much for the whole the whole area.'",
        "'speaker_0': 'And I'm excuse me and I'll definitely leave for for his $0.02 and on this, too. But frankly, as the plan goes from the D6 overlay to the district plan, the criteria for that would be set at that point in time that would basically take care of something that would be distracting.'",
        "'speaker_0': 'If you're thinking about the Panasonic building or another building along Pioneer Proper, more or less that those the criteria in the district plan should take care of that and solve that problem just as it would along any highway for.'",
        "'speaker_6': 'Thanks to.'",
        "'speaker_3': 'Thank you, Councilwoman. But specifically, when we did our session with the planning board, that was one of their questions. And they say, what in this deal six allows us to say, when you get here with the district plan, you can't cause problems for the roadways.'",
        "'speaker_3': 'And so we specifically put in language that we had to mitigate any impacts. And there they we put that in so that they can point to that when we come back and go, how are you mitigating the impacts?'",
        "'speaker_3': 'And so there's a lot of guidelines that we have from our experts in terms of how to do that and what's the best way to do it and what that requires and what the feds require. That will be part of that criteria for that mitigation.'",
        "'speaker_6': 'Okay. Thank you. I have no further questions.'",
        "'speaker_1': 'Thank you. Councilwoman, are there any other questions by members of council? Right. The public hearing for 346 and 347 are closed. Comments by members of Council. Councilwoman government.'",
        "'speaker_7': 'Thank you, Mr. Pro-Tem. You know, this is something new. And going to the planning board, I think for myself as a newly elected council person, I really appreciated. Just like I appreciate, you know, my colleagues questions about an appeal process that we're going into this kind of new area in a very thoughtful way and asking all of'",
        "'speaker_7': 'the great questions. And, you know, honestly, with my first experience before planning board was something that is new. You know, we have the theater district downtown when you start talking about iconic and branded signage. So you can really brand and market an area.'",
        "'speaker_7': 'It was honestly a little bit frustrating for me to I wasn't sponsoring this. And so I had to just basically sit back and listen to a lot of the conversation around how honestly conservative the planning board was looking at this.'",
        "'speaker_7': 'And it was frustrating with knowing, you know, we're in the 21st century and when you start looking at branding and marketing an area and having iconic, innovative signage, it was frustrating when, you know, they were were kind of pulling back a little bit.'",
        "'speaker_7': 'And so, you know, I have full. And the utmost faith that that district plan is going to be the most iron clad document because this is new. And just because it's new, it's not it's not a good excuse for us not to do this because it's new.'",
        "'speaker_7': 'It's important for us to take our time and ask all of these great questions. But that district plan is really going to be the guiding document for this specific area. And, you know, when you drive into Delia, the signage that introduces you to the airport is a box basically that says Denver International Airport.'",
        "'speaker_7': 'And so when you look at having something that you can change the pixels, you can change the brightness, you can change the colors and all the time. Being very cognizant of the traveling public, of the people who are going to be living at 61st and Panya with the with the multifamily residential that this council approved the rezoning'",
        "'speaker_7': 'of the area to extend those boundaries. Having great oversight through this district plan is that framework. And believe me, the questions that are being asked tonight, the planning board is paying attention to and they are going to take that into consideration.'",
        "'speaker_7': 'And so I am supporting this tonight because one of the comments at that very first planning board meeting was why this area? Who cares? You come in from DIA, you either ride the train and you're going through this area or you're leaving town.'",
        "'speaker_7': 'Why should we care that there's iconic signage and and really were placemaking at this Tod station. And that was my cue. And my point to ask Steve was CPD, may I please say something as an over 20 year resident of, you know, district 11 in Montebello and and Green Valley Ranch, and my response back was, why not'",
        "'speaker_7': '? Why is the front door to Denver far northeast? Why aren't we good enough to have something that is iconic that, you know, introduces you to the theater district downtown? This is the perfect place to not only introduce travelers and tourists to Denver.'",
        "'speaker_7': 'This is something for the residents and the community members that I represent. This is an opportunity for them to have something that is is cutting edge as far as technology and placemaking at the 61st and Panya Tod Station but also with Denver International Airport that we can truly say, you know what, this is in District 11 and'",
        "'speaker_7': 'we've got the greatest signage and it's interactive and it's cutting edge. And how we're able to engage our community in learning more about that technology and how it is so important to communicate with residents, communicate with travelers, but to create that very, very special place that I know near and dear to my heart is is home.'",
        "'speaker_7': 'But that we're going to be able to show the rest of the city, people from, you know, other countries why this is such an amazing place in Denver and District 11. And so I will be supporting both of these tonight, and I ask humbly for my colleagues to do the same.'",
        "'speaker_7': 'Thank you, Mr. President. Pro Tem.'",
        "'speaker_1': 'Thank you, Councilwoman. Are there any other comments? Councilman Espinoza.'",
        "'speaker_2': 'Yeah, I, I appreciate the comments of our planning board and sort of their their conservative approach, because I find that, you know, they're far more reliable in their decision making when it meets the criteria. It meets the criteria and it doesn't.'",
        "'speaker_2': 'It doesn't. And that's their job. That's their charter to sort of recommend approval and not approval to council on matters of zoning. The same applies for how they would review these things if if in fact it ever went back to them.'",
        "'speaker_2': 'So I would support this bill if the language of appeal actually did put ultimately the ability to question the decision of staff and the decisions of the zoning administrator back into the Arena of planning board, where they would look at it relative to their own criteria that they established to sort of merit, whether it's good or not'",
        "'speaker_2': '. Good. And. And was. Clear on that language, because the problem right now is that, yes, the Sports Authority signage looks like a logo. And it clearly states in that comprehensive sign plan that those signs are supposed to be put on the elevator.'",
        "'speaker_2': 'Cause. And I can tell you, as an architect and somebody who worked on that stadium, that the sign on the north side of the building extends far beyond the elevator course. And so there's a distinct difference between what Invesco put up there and what was permitted by the zoning administrator in a very political atmosphere.'",
        "'speaker_2': 'And so we need to if we could go back and say, look, because we got the signage off the Upper Bowl, why? Because that was a decision that the planning the planning board ultimately got a question. I mean, the question came back to the planning board.'",
        "'speaker_2': 'Is this consistent with the comprehensive science plan? It wasn't, but the zoning administrator felt that it was. And so when it clearly know and so somehow we need to get we need to be able to de-politicize once these once these these these plans have gone through that they have that process that that that, you know, when when'",
        "'speaker_2': 'somebody says these things meet if if the public goes, no, that's not what was agreed to. To be able to go back and say and have somebody sort of more concretely, more make that determination rather than have it put back into this arena.'",
        "'speaker_2': 'Because we I'm sorry, but we don't question things the way they do. And it is our purview. It is our job. But we don't. And I'm sorry, but, you know. Well, we have the language of appeal in there.'",
        "'speaker_2': 'It is still not clear and it's still to me. And so it's in two important because we have a Japanese company and I don't want Tokyo out on the plains. And I'm not saying it will, but who knows?'",
        "'speaker_2': 'I mean, I've just asked for the best in development potential on that site, on the prior zoning. And and I will I fully expect us to. I don't I'm not not understanding this to that. This gives me that level of assurance.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_1': 'Q Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. I I'm happy to support this tonight. And I wanted to thank Councilwoman Ortega for reminding me of my historical trivia lesson for tonight, which is when she mentioned the bright lights being a potential confusing factor out of the airport.'",
        "'speaker_3': 'I do recall an early conversation about the placement of the demon horse out there at the airport, that it was oriented in a way that the glowing red eyes would not be mistaken for a navigational aid by any pilot on final approach to runway 25, and he might actually crash into it.'",
        "'speaker_3': 'So I recognize that and I hope that there we do think about such things when we when we have lighted signs out there. Thank you.'",
        "'speaker_1': 'Councilman Flynn, I think you want to crash into that statue. Mm hmm. Councilman.'",
        "'speaker_0': 'Thank you, Mr. President. I just want to echo Councilman Espinosa's concerns about the public process and. And think that it is so important that I just want to encourage and make sure that that district plan, like Councilwoman Gilmore's mentioned it, will be addressing that that process and will make sure that it isn't tied in and there will'",
        "'speaker_0': 'be an adequate public process in appeal for any concerns. So I just want to support that issue and encourage and make sure that district plan is as well constructed to include that. Thank you.'",
        "'speaker_1': 'Thank you. Councilman, are there any other comments? I want to make a comment. I do appreciate this moving forward. You know, when we look at signs and we look at overlay districts, we look at the signs as the permitted use.'",
        "'speaker_1': 'You know, it's one thing when it's in a neighborhood with homes that are already existing, it's completely different than an airport. And yes, there absolutely has to be strong public policy, strong public input in a public process for anything like this.'",
        "'speaker_1': 'And I think that's you know, the clear thing here is this is the public and this is the public realm for it. However, there are things that, you know, brush up along the First Amendment when.'",
        "'speaker_0': 'You.'",
        "'speaker_1': 'Look at content of signs. But also I think that what was discussed here at length and what I took from this is just the word iconic. Right. And nothing against the current signs that are out there or the people that have placed them out.'",
        "'speaker_1': 'But when it comes to iconic entrances. We don't got it. I had just flown in from LAX yesterday and was admiring their signage. When you go to other airports, you do see that. You do see the icon ism there.'",
        "'speaker_1': 'The airport itself, I would say, is iconic. There's nothing like it. As a matter of fact, it's a logo and it's now the logo for Dan. So, you know, the fact that we were actually looking at this and moving this forward allows us to create that iconic figure.'",
        "'speaker_1': 'And, you know, this may tug on somebody's nerves here. But I got to say. When Mile High Stadium was Bear Stadium and it became Mile High Stadium and it still Mile High Stadium to me. But through its different iterations, we have to remind ourselves, those of us that live around in the area, we live by a stadium'",
        "'speaker_1': ', we may have lights, we may have fireworks, we may have shouting and screaming. We live next to a stadium. So we there are some things that as we evolved in this city and as we develop, we do have to be mindful of.'",
        "'speaker_1': 'But we also have to remember that this is the airport area and this corridor wouldn't be here. We wouldn't talk about these development opportunities or the zoning changes if it wasn't for the airport and the local economy. Everything along this quarter will be based upon the success of the airport, a little bit of a stretch for signs'",
        "'speaker_1': ', but we do have to have that public process and I look forward to seeing something iconic as we enter that and that corridor. Madam Secretary, can we have a roll call on 346?'",
        "'speaker_5': 'Black eye, Brooks. CLARK. Hi. Espinosa.'",
        "'speaker_2': 'Epstein.'",
        "'speaker_5': 'Flynn.'",
        "'speaker_0': 'Hi.'",
        "'speaker_5': 'Gilmore. I Cashman can reach new Ortega high assessment. Mr. President.'",
        "'speaker_1': 'I. Can you please announce the Madam Secretary, can you please announce the results?'",
        "'speaker_5': 'Nine eyes. One abstention.'",
        "'speaker_1': 'Nine eyes. One abstention. This bill passes. Now it's time for 347. Councilman Espinoza, will you please put 347 on the floor for final passage?'",
        "'speaker_2': 'No. Already motion.'",
        "'speaker_0': 'I mean. I mean.'",
        "'speaker_5': 'You know, yo, we need to it.'",
        "'speaker_1': 'I messed up on that. And I looked at the script when we went off script. Madam Secretary, mean we please have the roll call in 3047.'",
        "'speaker_6': 'We're voting them separately.'",
        "'speaker_0': 'Yeah. Mm hmm. Yeah.'",
        "'speaker_5': 'I Brooks.'",
        "'speaker_0': 'Clark, i. Espinoza, I. Flynn, I.'",
        "'speaker_7': 'Gilmore, I.'",
        "'speaker_5': 'Cashman can each new. Ortega, i. Sussman. Mr. President. All right.'",
        "'speaker_1': 'Disclose the voting and announce the results.'",
        "'speaker_5': 'Ten days.'",
        "'speaker_1': 'Ten Eyes. 347 has passed. On Monday, June 27th, Council will hold a required public hearing on Council Bill 395, designated 1899 York Street, the Ghost Rose House as a structure for preservation, saying that there's no other business before this body.'",
        "'speaker_1': 'This meeting is adjourned.'",
        "'speaker_0': 'Subject.'"
    ]
}