{
    "A proclamation honoring Philip S. Mehler, MD, FACP, FAED on the occasion of his retirement. A proclamation honoring Philip S. Mehler, MD, FACP, FAED on the occasion of his retirement.": [
        "'speaker_2': 'Thank you, Madam Secretary. And now let's move to proclamations. We have two proclamations this evening, and I have the honor of reading the first one Proclamation 449 Honoring Philip s miller, M.D. f ACP fh ed on the occasion of his retirement, whereas Dr. Philip s Maler began his career 27 years ago with Denver General.'",
        "'speaker_2': 'We all remember it as Denver General, during which time he has served in many assignments, including staff attending physician Glassman, Professor of Medicine and Endowed Chair Denver Health and Department of Medicine. University of Colorado School of Medicine. Associate Dean.'",
        "'speaker_2': 'University of Colorado School of Medicine. Professor of Infectious Disease and Medical Director and Chief Clinical Officer. And. Whereas, Dr. Miller is nationally renowned as the expert in eating disorders and has saved many lives of people who have suffered from this disease.'",
        "'speaker_2': 'And. Whereas, Dr. Miller is a prolific academician, having published over 350 articles in peer reviewed journal journals and also is an accomplished professor of medicine with an international reputation for excellence in research, education and clinical care. And. Whereas, Dr. Miller has trained hundreds of interns, residents and fellows to be physicians of medicine.'",
        "'speaker_2': 'And. WHEREAS, Dr. Mailer's leadership abilities have led to the creation of a world class facility supported by world class physicians and staff, many of whom have devoted their entire careers to Denver Health and its patients, providing compassionate state of the art and equitable medical care to thousands of patients, including the current mayor, Michael B, Hancock governors and'",
        "'speaker_2': 'city council members. And. Whereas, as a result of Dr. Mailer's work, Denver Health became a truly integrated health care system, which resulted in it becoming a model health care organization for the nation. And. Whereas, Dr. Mailer has received many awards and commendations, including being on the list of Denver's top doctors of internal medicine in our 50 to'",
        "'speaker_2': '80 magazine, who's who among executives and professionals, the best doctors in America and internal medicine, just to name a few. And. Whereas, this city will miss his leadership, his ability to create the future of health care, and importantly, his constant dedication to our patients and the true mission of Denver health.'",
        "'speaker_2': 'Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, the Denver City Council hereby recognizes Dr. Mailer for his contributions. To Denver's communities in countless ways, personally and professionally, to keep Denver's residents healthy.'",
        "'speaker_2': 'And for his professional and personal dedication to the city and county of Denver, the state of Colorado and the nation. His retirement scheduled for June 2nd, 2014. He will make us have a void that will be challenging to fill.'",
        "'speaker_2': 'Section two that the clerk of the city and county of Denver shall attest. And a fix the seal of the city and county of Denver to this proclamation and that a copy be transmitted to Dr. Philip s mailer, M.D. Frcp an faa e d and having read the proclamation, I move the proclamation 449 be adopted.'",
        "'speaker_2': 'Second, it has been moved and seconded. We now have comments from the council members and I will go first. I am very, very happy to be able to do this for Dr. Mailer. He is my constituent, so that makes him even more special.'",
        "'speaker_2': 'But your history and your career are amazing. Outstanding, excellent. That service that you give in our city is above and beyond. And we can't thank you enough. We will miss you greatly. And I'm so glad to be able to do this proclamation this evening.'",
        "'speaker_2': 'And I see no other comments. Madam Secretary, roll call. Oh, no, I do see a comment a little bit coming in late. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Madam President. Sorry, I was trying to switch from one screen to the other. First of all, I want to ask that my name be added to the proclamation. Certainly. I just want to express my gratitude and appreciation to Dr. Taylor for his 27 years of service to the city of Denver.'",
        "'speaker_6': 'It takes very special people who want to do this work and commit their profession and their lifetime history to working with the population at Denver Health Serves. And I think we all owe a great debt of gratitude to you.'",
        "'speaker_6': 'So thank you very much.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Madam Secretary, roll call.'",
        "'speaker_0': 'Madam President, high growth round, high fat. I can eat lemon Lopez. Hi, Montero. Hi. Nevitt Ortega. Rob Shepherd. Hi.'",
        "'speaker_2': 'Madam Secretary. Close the voting. Announce the results.'",
        "'speaker_0': '12 eyes.'",
        "'speaker_2': '12 eyes. The proclamation is adopted, and I would like to call on Dr. Gonzalez, I believe, to the podium. I think you have a few words to say about Dr. Mailer.'",
        "'speaker_3': 'Madam President, members of council, it's a delight for me to be here and join you in this proclamation. We've had several ceremonies and events for Dr. Mahler honoring him, and it was a real pleasure to see all of his colleagues, his former students, all of the employees come and visit and wish him well wishes.'",
        "'speaker_3': 'I think the proclamation speaks for itself in terms of all of his accomplishments as a researcher, as an educator, and also, first and foremost, his love of taking care of patients. But the one thing I'd like to add is I've gotten to know him over the last 18 months, and he's a person of very high integrity and'",
        "'speaker_3': 'character, caring deeply about the work that he does and about the patients that he takes care of. And as someone mentioned earlier, that it's a special calling for someone to do that and do that so well for so very long.'",
        "'speaker_3': 'Finally, it's my pleasure to announce to you that after a lot of conversations with Dr. Miller that he will be staying on at Denver Health in a part time basis, post-retirement, after he enjoys a little time off with his family.'",
        "'speaker_3': 'And he'll be still the director of the Acute Eating Disorders Center. And it's a pleasure to be able to retain him for the benefit of all in Denver, who needs his service and those from around the country who come as well.'",
        "'speaker_3': 'So we certainly wish him our very best and it's a pleasure to be able to be here and celebrate this with him tonight. And some of his family members are here, too.'",
        "'speaker_2': 'Thank you. Dr. Gonzales, sounds like we don't have to go cold turkey and without his services. Dr. Miller, would you like to come up to the podium?'",
        "'speaker_3': 'Good afternoon or good evening, I guess. Thank you for this honor. I'm a native Denver. I was born in St Anthony's and grew up in the west side of Denver. Went to see you night school. I worked as a butcher up in 50th in Washington for five years when I was going through night school.'",
        "'speaker_3': 'And then I went to see U. Medical School when I was a resident and then joined Denver General at the time. I walked into Denver General for the first time when I was a third year medical student in 1982, my pediatric rotation and fell in love with the place and never left.'",
        "'speaker_3': 'So it's been a 34 year marriage for me, including residency and student time. And it's truly been a an honor and a privilege for me to serve the institution, to serve its patients, to serve its medical staff and all the other staff.'",
        "'speaker_3': '5500 people that work at Denver Health. Denver Health is a jewel locally. It's well acclaimed nationally and deservedly so. We practice terrific medicine there. We have a wonderful nursing staff. We have a wonderful administrative staff and medical staff there.'",
        "'speaker_3': 'And Denver really can be very proud of Denver Health that although we've taken care of the DISENFRANCHIZED for many years, we've never lost sight of the fact that our sacred pact in life is to heal and to heal everybody, regardless of their ability to pay.'",
        "'speaker_3': 'And that's been my calling in life, and I'm very privileged that I've been able to spend my entire career there. And with the exaltation of Dr. Gonzales and his staff, I'm going to be staying on on a part time basis, continuing to take care of the folks that I've worked with for about 30 years, those with severe'",
        "'speaker_3': 'anorexia nervosa and bulimia. And we have a center at Denver Health Medical Center that has no replica in the United States. It's the only medical stabilization program like itself in the United States where we take critically ill patients and restore them to life.'",
        "'speaker_3': 'About 30% of our patients come by air ambulance from other cities and states in the United States. And it truly speaks volumes about the quality of care of Denver health. So thank you for this honor. I'm eternally grateful for Your Honor, and I'm eternally grateful for the opportunity that's been given to me to work at Denver Health'",
        "'speaker_3': 'for all these years. Thank you very much.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_6': 'Madam President. Yes? We will get a chance to meet.'",
        "'speaker_2': 'Whose family didn't get a chance to meet his family. Would you like to hear what? The family with the family members of Dr. Miller, please stand.'",
        "'speaker_7': 'One family member is. Very, very. Thank you very much. Thank you as well.'",
        "'speaker_2': 'Okay. We have a second proclamation number for 77 and I'll call on Councilman Brown.'",
        "'speaker_3': 'Thank you, Madam President. This is a proclamation recognizing the 80th anniversary of Southeast Denver's Bonnie Breed Tavern, where as local diners have always played a vital role in the economic and social life of a neighborhood. And. Whereas, for 80 years, a little diner in southeast Denver called the Bonnie Brae Tavern has served four generations of neighbors.'"
    ],
    "Approves a rezoning of portions of 2800, 2900 and 3000 blocks of Welton Street from C-MX-3 to C-MX-5 in Council District 8.  (LAND USE TRANSPORTATION AND INFRASTRUCTURE) Approves a rezoning of portions of 2800, 2900 and 3000 blocks of Welton Street from C-MX-3 to C-MX-5 in Council District 8.  A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 4-1-14.": [
        "'speaker_5': 'And this map shows the specifically affected properties. It is Welton Street between 28th and the intersection with Downing. Affecting all of the 2800 block and then just the western half of the 20 903,000 blocks. I also want to point out that the 30th and Downing Light Rail Station is not included within this area.'",
        "'speaker_5': 'The reason for that is because of the specific plan guidance that we have that showed five storeys as being an appropriate height on the property facing Downing and Welton, but recommended three stories facing California, and that is the zoning that the property currently has so to avoid.'",
        "'speaker_5': 'Split zoning the station itself into two different districts. We left it out of this map amendment. This map here shows the subject area in detail. There are 38 properties in total within the subject area, about seven acres in size, all of it zoned Cemex three.'",
        "'speaker_5': 'And the proposal is to rezone to Cemex five. Cemex five stands for Urban Center. Mixed use five storeys maximum. Adjacent properties. Many of these are already zoned CMCs five. You can see here along Welton Street, a couple of blocks of properties that already have the Cemex five zoning directly across the street from this area as well as'",
        "'speaker_5': 'to the southwest. Further down the corridor also has Cemex five so rezoning the affected properties here to see them x five will result in a consistent treatment of the properties along Walton Street. They'll all have the same zoned district beyond that to the west.'",
        "'speaker_5': 'In the Curtis Park neighborhood, you see u RH 2.5 zoning. And along this edge there's some GM x three mapped here at the Denver Health Clinic. In terms of historic districts, there are a couple in the vicinity. The affected area is partially located within the Walnut Street Commercial Cultural District.'",
        "'speaker_5': 'All of the properties except those here on the northernmost reach are located within that historic cultural district. Additionally, the Curtis Park Historic District is shown mapped in green. So there's location within a historic district as well as adjacency to historic district and current uses within this area, primarily a mix of commercial, retail and office as well as'",
        "'speaker_5': 'residential uses. Adjacent uses include the light rail station to the northeast, to the southeast and Southwest uses consistent with what's found along Walton Street, commercial residential mix into the northwest in the Curtis Park neighborhood, residential uses. And here are some photos of properties within the affected area.'",
        "'speaker_5': 'All of these are within the subject area, except for this one here in the lower right corner. These properties are already zoned CMC's five. In terms of our process. This was recommended by Planning Board for approval at their March 19th meeting, and we have followed the city's standard process for zone map amendments, with one exception, which was'",
        "'speaker_5': 'at the outset of the process before any notification had gone out to other organizations. CPD worked with Council District eight and the Five Points Business District to mail notification letters to all of the property owners within the affected area.'",
        "'speaker_5': 'So they were first notified of the intention to legislatively rezone the area before anyone else was notified. And then we continued from that point forward with our normal rezoning notification process. We did receive one official letter of support for this rezoning that coming from Curtis Park neighbors, and we have not received any letters of opposition.'",
        "'speaker_5': 'The Curtis Parks letter is included as an attachment to the staff report. In terms of review criteria, there are normally five, but for a legislative rezoning there are only three. And we'll go through each of those criteria now.'",
        "'speaker_5': 'The first is consistency with adopted plans. There are four that apply in this area, the first being comp plan 2000 and CPD has found that the proposed rezoning is consistent with several comp plan 2000 recommendations related to environmental sustainability, mobility, land use and legacies, and specifically increasing the mix of uses and identifying areas where additional building higher'",
        "'speaker_5': 'density can be accommodated and is desirable. Blueprint Denver identifies This is an area of change and the concept land use is a mix of pedestrian shopping corridor and transit oriented development, both of which are types of mixed use.'",
        "'speaker_5': 'The street classification for Welton is Main Street Collector. So for Blueprint Denver, we also find consistency with the proposal. The Welton Downing Triangle Plan is one of our older active plans adopted in 1986 and re adopted in 2000 with Comp Plan 2000.'",
        "'speaker_5': 'And this plan identifies the subject properties as being located in the Upper Walton sub area. And the guidance from that plan is to allow additional commercial. If that commercial is found to be compatible with adjacent residential. And we do believe that our new zoned districts adopted in 2010, which provide for building sculpting at the rear of properties'",
        "'speaker_5': 'where there's an abutment with a protected residential district, which is the situation that we have here, does provide for that level of compatibility between commercial and residential uses. Finally, the Northeast Downtown Neighborhoods Plan adopted in 2011 has recommendations that are specific to Main Street corridors, and it identifies Walton as one of those corridors and states that a'",
        "'speaker_5': 'moderate mix scale of general shopfront, apartment and row house building forms is desired in this area. It recommends that those buildings be sited in a context sensitive manner with emphasis. Orienting to the street in parking, access off the rear or to the alley promotes the use of design elements that link the building directly to the street environment'",
        "'speaker_5': 'and allows for a mix of uses within both the area and within buildings themselves and the CSX five. Zoning does accomplish these objectives. The plan also provides specific guidance in terms of land use and building height. It recommends transit oriented development within the subject area and a maximum height of five storeys.'",
        "'speaker_5': 'So there also we find consistency. So in terms of all three applicable criteria here, we find that there is consistency with all of the adopted plans within the area. The second criteria, which is uniformity of district regulations, we find that rezoning the CMC's three properties to CMC's five will encourage the uniform application of the new Denver zoning'",
        "'speaker_5': 'code within this area, and furthermore that the Public Health, Safety and welfare will be advanced primarily through the implementation of the city's adopted land use plans. So after considering all this, the official recommendation from CPD is approval.'",
        "'speaker_2': 'Thank you very much. It looks like we have seven people signed up to speak and I'm going to ask the first four to come on up in the front pews so we can have you on deck. And they are.'",
        "'speaker_2': 'Tracy Winchester, Jill Dancy Williams, Michael Markel, Aubrey Atherton. Come on up and we'll start with Tracy Winchester.'",
        "'speaker_4': 'Thank you very much. My name is Traci Winchester. I'm the executive director of the Five Points Business District. Thank you for allowing me to speak. I'm here in support of the Community Planning Development's recommendations that we rezone from Cemex three to SIMEX five, the 2800 to 3000 blocks of Welton Street, as you all heard from Cortland.'",
        "'speaker_4': 'It was very important to us that we notified our property owners and we went over and above the normal procedures for notification. We sent out letters to everyone prior to the planning board and prior to the City Council meeting and the subcommittee for Land Use.'",
        "'speaker_4': 'We also sent out another letter prior to this hearing on June 2nd to make sure that their voices would be heard in opposition or in support of this. In the last couple of weeks, or rather last couple of months, this office has received no opposition at all.'",
        "'speaker_4': 'In fact, we received phone calls saying this was a great idea. We're glad we're moving forward with this. And people that we thought might potentially oppose this said no, they were in favor of it. And these were property owners.'",
        "'speaker_4': 'We were hoping that they would be here today, but they're not. We have other property owners who will be speaking in support of this rezoning effort. So to keep this short, I'll let the other people speak. The property owners here speak in our behalf.'",
        "'speaker_4': 'And we thank you again for taking this under consideration.'",
        "'speaker_2': 'Thank you, Miss Winchester. Jill. Dorothy Williams.'",
        "'speaker_4': 'Good evening. My name is Jill Dancy Williams. I'm the owner of 3025 Welton Street. I'm a practicing attorney. I've been a residential property owner and business owner in this area since 2000. My children also attend Gilpin Montessori Elementary School, which is right around the corner from this proposed rezoning area we zoned area.'",
        "'speaker_4': 'I'm asking I'm here today in support of this rezoning proposal of the 28th to 30th block of Welton Street from Cemex, 3 to 5. I follow the changes that have been going on in this area and believe that this is one of the most important acts that the Council can undertake to ensure that the end of the'",
        "'speaker_4': 'Welton Street corridor continues to be used for both residential as well as commercial purposes. There were several policies that speak to the importance of rezoning the end of the corridor and encouraging more residential density and strengthening existing businesses.'",
        "'speaker_4': 'First, I believe that it will create a more compatible and consistent development, enhance the community's character, increase affordable housing, spur economic development, while improving the transition between commercial development and adjacent residential neighborhoods. The goal here is to enable people to live near where they work, shop, play, educate their children and receive a variety of services.'",
        "'speaker_4': 'This measure will also help to increase the value of all of the properties in this area and make the properties on the northern blocks of the corridor more attractive to developers because of its proximity to downtown and to the RTD.'",
        "'speaker_4': 'We can capitalize on opportunities to develop housing along the transit line and help reduce vehicle traffic, travel and pollution. This will benefit not only the residents but the schools and the small business owners in the area. Allowing for smart growth and design will also encourage more modern style residential development, attracting a more professional, younger demographic and encouraging'",
        "'speaker_4': 'uniformity in line with the downtown market and the Lower Welton Street Line and Walton Street Trends. This will allow for more flexibility consistent with the vision of the entire neighborhood. You have already furthered the goals of many of the property owners by making tax increment financing available, supporting the vitalization of this district.'",
        "'speaker_4': 'I am fortunate to own in this corridor and I ask that you consider the positive economic efforts and effects on businesses and the economic benefit to the community in making this decision. This rezoning change will be a welcome addition to this beautiful neighborhood.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_2': 'Thank you. Mr. Ansley Williams, Michael Markel.'",
        "'speaker_3': 'Good evening, council members. My name is Michael Markel and I resided 5723 Arapahoe Avenue in Boulder and I'm here I'm a hard act to follow on that last was very eloquently spoken. I just I'll try to be brief.'",
        "'speaker_3': 'I'm a property owner on Welton Street and we owned five properties to 28, 31, 28, 43 and we would be here in support of the rezoning effort from the Cemex three to see in next five and just my first project in.'",
        "'speaker_3': 'Boulder. Absolutely. First project in Denver, and I'm a Boulder County developer, but I'm excited, you know, to be in Denver and I'm excited to be on Welton Street and also in five points. And I would ask, you know, your support for this rezoning and we do have been doing some concept plans.'",
        "'speaker_3': 'And with your approval on the rezoning, we would be very excited to talk, you know, to all the neighborhood groups, you know, get involved and start the process and demonstrate, you know, to the neighbors, you know, that we would be very compatible with some of the uses that are within the neighborhood.'",
        "'speaker_3': 'And we would also be compatible with the city of Denver's.'",
        "'speaker_5': 'You know, goals.'",
        "'speaker_3': 'That have been outlined, you know, by the planner that spoke previously. So if you had any questions, I'll be happy to answer them. If not, I would like your support. Thank you very much.'",
        "'speaker_2': 'Thank you, Mr. Merkle. I'll call Aubrey at a time. But while he's coming up, I'd like to ask Joel Noble, Sekou and King Harris to come to the front pews to be on deck. And thank you for your patience, Mr. Arrington.'",
        "'speaker_3': 'Hello, council members. My name is.'",
        "'speaker_5': 'Aubrey Addison, and I live at 2036.'",
        "'speaker_3': 'Glenwood Glencoe Street here in Denver. Just wanted to say that as I've had a chance to work with some of the owners, Mr. Markel's particular on the area and interact with the community. I've had nothing but positive feedback from the people we've dealt down there and in our professional experience and business acumen, it seems that this change'",
        "'speaker_3': 'of the zoning from the CRM x three to CRM x five will really help rehabilitate some of that area and I think we'll get things going. So I hope you support it. And I appreciate your time. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Addison. Joel Noble.'",
        "'speaker_5': 'Good evening, council members. My name is Joel Noble. I live at 2705 Stout Street and I'm here representing Curtis Park Neighbors, the neighborhood organization that I serve as president of. Curtis Park Neighbors took a position on March 17th in favor of this rezoning.'",
        "'speaker_5': 'We voted with a vote of nine in favor, zero opposed, and with two new board members abstaining throughout the second half of 2010, Curtis Park neighbors and the whole neighborhood spent a lot of time working on the new area plan, which was an update from our 1987 Curtis Park Neighborhood Plan.'",
        "'speaker_5': 'And in addition to the wonderful sessions the community planning and development always holds, we had ten specific Curtis Park study sessions in the evening that Cortland Heiser took his evenings to join us with. And one of those sessions was What about our edges?'",
        "'speaker_5': 'What do we want to see? What's our vision for Welton Street, for Downing Street, for Park Avenue? And the result of that is in the Northeast, Downtown Neighborhoods plan the vision for five stories that steps down at the alley with a protected district gate guidance that is now in the zoning code.'",
        "'speaker_5': 'So when it came time to adopt that plan, Curtis Park neighbors was unanimously in support. We'd like to express our gratitude to Councilman Brooks, who's bringing this forward legislatively. You know, why is it being brought forth legislatively as Jill Durante Williams was talking about?'",
        "'speaker_5': 'There's a serious commitment on behalf of the city to revitalize this corridor. Bringing this forward legislatively reduces the burden on the property owners from having to rezone one at a time piecemeal, which is an expensive and lengthy and sometimes contentious process.'",
        "'speaker_5': 'If I may, I think there's some lessons here for how well this has worked that that I think we can learn from. One is the northeast downtown neighborhoods plan spent the time with the community to get the vision specific what's called for in the area plan is five stories and a particular set of uses.'",
        "'speaker_5': 'It's not a range of stories, but then several years later, when it comes time to zone, we have different opinions about what the vision was. We took the time to do that and I think you'll see the more recent an area plan is CPD is looking for that specificity which serves us all well.'",
        "'speaker_5': 'Secondly, I would venture to guess that there's less controversy on this than some others because we have transit on the corridor where we're directing density and Transit's been here. It's been here since 1994. It's been here actually since the early days of Denver, but light rail and its modern incarnation is here.'",
        "'speaker_5': 'And so there's a a lesson to what what can we do to guide transit where we want density. I will be available for questions and thank you for supporting this.'",
        "'speaker_2': 'Thank you, Mr. Noble Sekou.'",
        "'speaker_3': 'Huh? First of all, my name is Sherman Siku. I am proud to represent the Black Star Action Movement. Was self-defense a voice for poor, working, poor and homeless people? Address 2514 Chapel Street. Born and raised five points since 1952.'",
        "'speaker_3': '1932. We stand opposed to this zoning change. What I learned this afternoon in operations meeting was looking at the criteria of the zoning and what its purpose is. Its purpose was not underlying to ethnically cleanse a neighborhood and drive out a population of black people and replace it with white folk.'",
        "'speaker_3': 'One set up for that. And yet that's what's been happening since 1982. Hmm. Now you got to get with David so you can explain that, because I couldn't believe what I heard today, that we were actually training people to look like they're listening when they're not.'",
        "'speaker_3': 'So they wouldn't violate rule one or see what a democracy fit in all of that. Is that for real? I need you to pay attention. 106. Look at me. Pay attention. Say. Because I know you know what's going on here.'",
        "'speaker_3': 'And we got active participants not only in the white community, but members of this board who represent black people who are running with this like running dog lackeys of capitalism. Well, it's all about the money. It's all about the money.'",
        "'speaker_3': 'You don't care about this neighborhood, your opinion about these people. And you are looking forward to no black people being there. Now, I understand how Geronimo better now understand how the Native American people felt. Is this how the West is won?'",
        "'speaker_3': 'And we continue the process, and there ain't no question about it. And you have no more ground to stand on. Well, guess what? Act like you ain't listening, because that's more authentic, because I'm watching what you do. But guess what?'",
        "'speaker_3': 'God's watching. Do you think you're going to get away with this? For real? For real? Well, come on.'",
        "'speaker_2': 'Bring your time is up, Mr. Psycho. King Harris.'",
        "'speaker_3': 'Good evening. My name is King Hezekiah Harris. I reside at 2634 Garfield Street. Own property in the area that is talking about being resolved. It seems that you have a number of people who are speaking in favor of this.'",
        "'speaker_3': 'And after hearing these lovely ladies, I felt like I should run out the door, as I am not nearly as well prepared to to say it as well as they did. But the reality is this. I've owned property in five points since 1975.'",
        "'speaker_3': 'And we have been looking forward to the opportunity to develop the Five Points community. That opportunity has arrived. And I think that the change in the zoning that you're talking about now is just another way of uplifting that opportunity.'",
        "'speaker_3': 'So I encourage you to move forward with the rezoning. Thank you.'",
        "'speaker_2': 'Thank you, Mr. Harris. That is the end of our speakers. Will you first have questions from council? Are there any questions? Councilman Brooks.'",
        "'speaker_5': 'Yes, for Courtland Kizer. I'm kind of smiling because King's voice is so good.'",
        "'speaker_1': 'He just tell he's a pastor Hezekiah.'",
        "'speaker_5': 'But anyway, hey, I had a question around this RTD lot. I think this is really interesting because I know when we put this northeast down to neighborhood plan together for the protection of Curtis Park, it's a landmark district.'",
        "'speaker_5': 'Even the zoning that we're doing now is going to have some certain requirements around step setbacks and setbacks. And, you know, because it's a protected district right there. Couldn't you do something similar on this RTD lot? I mean, couldn't a portion of it be Zone C and mix five?'",
        "'speaker_5': 'And couldn't you, I don't know, put some requirements for some step backs on that on the on the parking lot. Yes. The well the property's already zoned x three. Yeah. And that's consistent with the plan recommendation for the portion of it that fronts California.'",
        "'speaker_5': 'So it would be an option to split zone it. And so on the front half that's facing downing C-Max five, that would be consistent with the plan. But the reality is that with the consolidated parcel in the way that the stations developed historically, you would have had an alley dividing it, which would have been a rational place'",
        "'speaker_5': 'to draw that line. The alleys no longer there. And generally, we would try to avoid creating a split zone situation like that. Yeah. So the thinking was if at some future point in time the station isn't there, that that would be the time to have a conversation about potentially up zoning, that one portion of the lot and'",
        "'speaker_5': 'the developer would have to come and just do it that way and rezone it. You know, the reason I say this is Denver City of Denver and RTD is looking seriously and I believe we will extend the 30th and Downing Station to 30th and Blake to connect with the commuter rail if that happens.'",
        "'speaker_5': 'RTD, you know, is talking about that lot being in play. And so I just wanted to have that conversation just to make sure I see there's a lot of other folks that have questions. Let me just ask this, because I think this cuts to the reason we're doing this rezoning.'",
        "'speaker_5': 'You know, when we did blueprint in Denver in 2010.'",
        "'speaker_1': 'Why wasn't this.'",
        "'speaker_5': 'Property, this this whole all these properties and these streets zoned at that time? Can you just explain that? Because I think that's a major reason why we're here today. Well, I believe it has to do with the mapping, the equivalent districts that at the time along Walton Street, you had a mix of B districts.'",
        "'speaker_5': 'Yeah. And, you know, generally, when you didn't have plan support for doing something different in the remapping effort in 2010, the first thing that you do is look to establish the equivalent zone district. So the the decision was made at the time, I think it was openly discussed and folks like John Noble have the specific history on'",
        "'speaker_5': 'it. But I believe Karla madison had conversations with the neighborhood and the decision was made to wait for the Northeast Downtown Neighborhoods plan because at that time it was in process and imminent and coming up a year later.'",
        "'speaker_5': 'And that that was the route that they decided to take. Okay. I'm going to come back to that. I love my other colleague.'",
        "'speaker_2': 'Okay. Thank you, Councilman. Councilwoman Sheppard.'",
        "'speaker_0': 'Thank you, Madam President. So either for Cortland or even Councilman Brooks, I remember when we voted on the you are a for this corridor and I can't even remember when that was. Now, in the last 12 year OC September, I remember hearing from at least one block of folks that lived on Welton, I believe in some Victorian'",
        "'speaker_0': 'homes that were really adamantly opposed to the area at the time because of fears about potential eminent domain on their properties. And I was wondering if those properties are covered in this map that you're drawing. And any information that either of you can provide about about that situation.'",
        "'speaker_5': 'I'll I'll comment first. Thank you for asking that question. And, you know, we went through Tracie Winchester's office, five points Business District to do the letters. In addition to that, I went to those houses and knocked on them.'",
        "'speaker_5': 'That included Denver Weekly News Leonora. That included the gentleman who came up here and said, Hey, they're going to rezone this here pretty soon. And that included another resident. I can't remember her name, but we went and talked to them and two of them were in support of it.'",
        "'speaker_5': 'The gentleman actually came to the planning board and he said, Oh, you know, I have some questions, you know, but you know, I'm not going to come out in opposition against it. But I do have some questions about this and.'",
        "'speaker_5': 'I wish we could have, you know, done some other things as well, but there was no outright opposition to it.'",
        "'speaker_0': 'And those homes are largely included in this map.'",
        "'speaker_5': 'They're all included in this map, yes.'",
        "'speaker_2': 'Okay. Thank you, Councilwoman Sheppard. Councilwoman Lemon. Yeah.'",
        "'speaker_4': 'So can you explain to me the relationship between that historic and Landmark District and the Sea Five in particular? What does that mean to the buildings that are there and how it's going to be redeveloped?'",
        "'speaker_5': 'Sure. Well, the the landmark review process for design kind of lays on top of whatever zone district is in place. So in the portion of the corridor that's included in the historic cultural district, properties that redevelop will be subject to that additional level of review that comes from the landmark process at the northernmost block of the corridor'",
        "'speaker_5': 'that's outside of the Landmark District. They won't be subject to that review, and that's essentially the effect of it.'",
        "'speaker_2': 'Thank you, Councilwoman Lehman, Councilman Levitt.'",
        "'speaker_5': 'Oh, thank you. Madam President, I had a question about the origin of the C-Max three, the original C-Max three zoning.'",
        "'speaker_3': 'Councilman Brooks asked that question, and I had a question about the overlay of the urban renewal area and the Tift district and Councilwoman Shepherd asked that question. So all my.'",
        "'speaker_5': 'Questions have been answered. Thank you.'",
        "'speaker_2': 'Okay. Thank you. Councilman Levitt, Councilman Brooks, did you have a question?'",
        "'speaker_3': 'You know what I'm going back to I'm.'",
        "'speaker_5': 'Going to bring up John Noble, because he was very intimately involved in this process with my predecessor, Councilwoman Carla madison. Joe talked to me about, I think Cortland set it up very well for you, saying that, you know, they wanted to wait.'",
        "'speaker_5': 'They didn't do it during the blueprint Denver rezoning this this parcel here but you guys wanted to wait to northeast downtown neighborhood plans, but we never got to it. During the zoning code update, there were three criteria that were looked at throughout the city as to what the new zoning should be.'",
        "'speaker_5': 'And one of them was, what's the current zoning on Welton Street from Park Avenue to 27th? There was one zoning that was higher intensity than the next block. Up from the 2700 block was middle intensity. And then the rest of the blocks were a lower intensity in in the old zoning code.'",
        "'speaker_5': 'And so that's what was recommended by staff during the 2010 zoning code. UPDATE That top section that we're dealing with now, zoned to three stories, that middle block to five storeys and below that to eight. So it's a very good, you know, just correspondents waiting for the new area plan because the new area plan would give more'",
        "'speaker_5': 'specific guidance. The new area plan, unfortunately, was running one year behind the zoning code updated. Now, there was you'll see there's a chunk missing that we're not rezoning tonight. That's already five stories. And I'm not entirely clear what what the discussion was during the zoning code update to say, well, we can accelerate that half of the block'",
        "'speaker_5': 'early and they did it and there wasn't any opposition to it. Okay. Thank you. Last question. I'm sorry. This is this is a legislative rezoning and armed omnibus zoning change that we voted on must have been a couple of months ago during the legislative rezoning, there was a change there that.'",
        "'speaker_5': 'Can you talk about the impact of that change? So what I understand it is that we don't we no longer have to come forward with a resolution first for a legislative rezoning. We can for legislative rezoning. We can just initially charge CPD to start the process.'",
        "'speaker_5': 'That's correct. So this ended up being a pretty lengthy process because we had to take that resolution through before we could even start working on the proposal. And my understanding is that the new process would be that any individual city council member would have the authority to initiate the the legislative rezoning process.'",
        "'speaker_5': 'And that would effectively skip that, you know, couple of months that we spent putting the resolution through the process. Okay. Thank you.'",
        "'speaker_2': 'Thank you. Councilwoman Brooks, Councilwoman Robb.'",
        "'speaker_0': 'Thank you. I think maybe this is a question for Tracy Winchester. We heard from Mr. Merkle about his plans on his property. Do you know of any other properties where development may be imminent or someone is really looking that?'",
        "'speaker_0': 'Yeah. As soon as we get this passed, I'm just trying to, you know, see how much change we're going to see at once.'",
        "'speaker_4': 'Well, we're fortunate right now that we do have a lot of plans in the works. Most of it is further down southern part of Welton Street right now. Markel Homes is pretty much the main. Developer down to that end.'",
        "'speaker_4': 'In addition to across the street, we have Saint Bernard Properties which they developed property. What if you've been to the purple door to the little coffee shop? There's four different businesses there right there at 29th and Walton, as well as Studio Trope, those were both of them were two of the winners of the Walton Challenge.'",
        "'speaker_4': 'And they have plans to develop within the next 18 months. So they're across the street from Markelle. Holmes They're on the site that's closest to the light rail side. And so they will be developing, but they're there. They don't need the requirement of five stories are coming in a little bit under TMX.'",
        "'speaker_4': 'A little bit around four stories is what their plans are right now. So we do have development happening, but it's not contingent upon the zoning being changed from mixed three. That's a mixed 504.'",
        "'speaker_5': 'Stories would.'",
        "'speaker_3': 'Take a.'",
        "'speaker_4': 'Change. That's right. Excuse me. Exactly right. You're absolutely right. Yes.'",
        "'speaker_0': 'Okay, good. I thought I was tracking there. Okay. Thank you for that answer.'",
        "'speaker_2': 'Thank you. Councilwoman Robb. Councilwoman Ortega.'",
        "'speaker_6': 'This question is either for Tracy or for Portland. I would like to know if you can share how many properties within these boundaries have already been resold within the boundaries of this area, not rezoning developed where it's required a separate one off zone application.'",
        "'speaker_5': 'Well, there I don't believe there have been any that have required rezoning as all of the properties within the boundary have the the three story zoning currently.'",
        "'speaker_4': 'Okay. Yeah, I agree.'",
        "'speaker_6': 'Okay. That answers my question. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. And I see no other questions. So in a close the public hearing and ask for comments by council members. Councilman Rob. Councilman Brooks.'",
        "'speaker_5': 'Councilman Robb, you want to.'",
        "'speaker_3': 'Talk about.'",
        "'speaker_0': 'It's got to be.'",
        "'speaker_2': 'In an hour.'",
        "'speaker_5': 'Oh, no, don't you know, I am I'm excited to to finally see this come through. It's this has been a labor of love. And one of the reasons you don't see any opposition to this rezoning is there was a pretty deliberative process in getting information, phone calls, knocking on doors in and letters out to individuals and property'",
        "'speaker_5': 'owners pick up a value of getting their homes redeveloped, whether it's homes or businesses. I've actually received emails and letters from and phone calls from developers who have not purchased property just yet in this zone district who were saying, hey, can you hold off because they know the price is going to go up for the property owners'",
        "'speaker_5': '. So this is actually a good what I like to say a good thing for property owners and it has nothing to do with the timing of this is just the way it happened. It just took a long time through the city.'",
        "'speaker_5': 'This was not because, you know, there's a setup here or anything like this. This is something that we've been trying to work on for four, three, three years. As soon as I got in office, Tracy Winchester, John Noble from Curtis Park, sat down with me and talked about this incongruity that we see on Walton with these parcels'",
        "'speaker_5': '. And as I went back to my office, I have a Carla Carla Mattison list. And this was one of the things that she wanted to get done. And unfortunately, Orgill didn't say is this is what she wanted to get done in 2011 when she passed.'",
        "'speaker_5': 'And and so there's there's an emotional connection to this as well. But that's not the reason we need to do this. We need to do this because the criteria fits. David Braswell And.'",
        "'speaker_3': 'The.'",
        "'speaker_5': 'Everything lines up perfectly for this rezoning, the plans, the adopted plans, the northeast downtown neighborhood plan calls for this specific site. We had a lot of community input around this. We have business leaders like Jill who is saying, Hey, how come those folks across the street have a higher zoned district than we do?'",
        "'speaker_5': 'And so this is something that is the right thing to do. And we we're excited about it. You know, I also want to say that transformation is happening on Walton, and it is exciting. And I'm so glad that King Harris I love it when someone who's been in the district, I mean, 1975, I was minus four.'",
        "'speaker_5': 'At that at that time when he was just buying the property and and to see him say this is something that we've wanted for a long time, and to know that because of the protected district, the the, you know, the historic district, the landmark district, we can do smart development.'",
        "'speaker_5': 'We could do smart growth. And so we're excited. I will say this is the only part of the city where I just feel like we have so much going on. We have, you know, almost five, six TIFF applications.'",
        "'speaker_5': 'I was just talking to Tracey about on one street for just for this year. And so there's a lot of development going on. But I am confident in the systems, in the structure that have been in place. And so because of the the plans that are in place, the uniformity of district regulations and restrictions and also the'",
        "'speaker_5': 'public health and safety and general welfare, I'm in favor of this, and I hope that my other colleagues will do the same and be in favor of this and be a part of the transformation that's going on. Five points.'",
        "'speaker_2': 'Thank you, Councilman Brooks. Councilwoman Shepherd.'",
        "'speaker_0': 'Thank you. I couldn't help reflecting on the fact that maybe a bit of a tale of three cities here. So tonight we have a whole group of people advocating on behalf of five stories on a and.'",
        "'speaker_2': 'On a commercial.'",
        "'speaker_0': 'Corridor. And then was it last week or the week before? We had a vehement a group of people vehemently opposed to five stories on a commercial corridor in a separate part of the city. And then, you know, a year or two ago, we actually had a lawsuit again against a potential five story development that happened in my'",
        "'speaker_0': 'district by a separate group of neighbors. So, you know, it's just interesting to notice all these these differences among the city. But it reminds me of several cities that I've lived in where folks say, hey, if you don't like the weather, just wait 15, 20 minutes.'",
        "'speaker_2': 'It'll change, you.'",
        "'speaker_0': 'Know, get something new. But I'm glad to see the community and the Business Improvement District also in support of this. So happy to support you all tonight as well as my colleague, Councilman Brooks.'",
        "'speaker_2': 'Thank you, Councilwoman Shephard. Councilman Levitt.'",
        "'speaker_5': 'Thank you, Madam President. I'll certainly be voting in favor of this legislative rezoning tonight. But I just want to.'",
        "'speaker_3': 'Congratulate Councilman Brooks in absentia, his predecessor, as well as all the people in the audience who've been working on this for years. A lot of pieces are being put in.'",
        "'speaker_5': 'Place, and so often it.'",
        "'speaker_3': 'Requires all the pieces to be put in place before the big thing.'",
        "'speaker_5': 'That you want to see happens. And it requires patience, it.'",
        "'speaker_3': 'Requires vision, it requires persistence. And that patience, that vision, that persistence that patients has been shown.'",
        "'speaker_5': 'Over many years.'",
        "'speaker_3': 'All the pieces are being set up, the most recent to having the urban renewal area established for the Weldon Street corridor, and now here the zoning for the Weldon three corridor. And the irony is that when.'",
        "'speaker_5': 'Things really pop down on the five.'",
        "'speaker_3': 'Points, people go, Wow, that was fast. But we know that it took a lot of work over a lot of time to get all those pieces together to make it happen. So I'm looking forward to being startled by how fast it all happened.'",
        "'speaker_2': 'So thank you. Councilman Nevett. Councilwoman Monteiro.'",
        "'speaker_6': 'You're. Speaker seven.'",
        "'speaker_4': 'Quick. Thank you, Madam President. I want to thank everybody that's here tonight for doing the heavy lifting that you're doing. And I am not even mindful.'",
        "'speaker_0': 'Of.'",
        "'speaker_4': 'All of the work that you've done. Just on a personal note, I've always wondered why when that particular corridor in Welton was built out, why there wasn't ever a station area plan done, and why it was, in my opinion, the Wilton three corridor that that rail system was ahead of its time and it was built.'",
        "'speaker_4': 'And there was a lot I remember a lot of RTD politics going on. And at the end of the day, it was a neighborhood that suffered. That's my perspective. And as a result, it started to fall between the cracks.'",
        "'speaker_4': 'And the idea that you're here tonight to empower the neighborhood and to lift the power of the neighborhood up is really important because as you know, as you're going through all of this, that everything in every neighborhood is always about the land and who owns it and how it's zoned.'",
        "'speaker_4': 'And it was to me, it was one of the greatest injustices that was done to. This particular part of town, because there was never during that time there was never any any strategy or any thought behind how we would have this station stop and how it would relate to the people that live there and how it would'",
        "'speaker_4': 'connect to the rest of the city. And it's so close to downtown and it has so many possibilities. And so I just want to say that I completely support this. I'm glad that the intersection of everything that's happening is happening.'",
        "'speaker_4': 'It's going to go fast for everyone that lives there. But I can't think of a better way for people that live in the neighborhood and own their homes to realize the American dream because it isn't silo thinking anymore.'",
        "'speaker_4': 'You know, it's just this and that. It all needs to work together. And I just want to, again, commend you, commend you for all of the work that you're doing in your neighborhood and you keep it up. Thank you.'",
        "'speaker_2': 'Thank you. Councilman Monteiro and I see no other comments. I think that we are ready for the vote.'",
        "'speaker_0': 'Brooks Brown Fox. I can each layman i. Monteiro i. Nevitt I. Ortega, i rob Shepherd. Madam President. Hi.'",
        "'speaker_2': 'Madam Secretary. Close to voting announced the results.'",
        "'speaker_0': '11 eyes.'",
        "'speaker_2': '11 eyes. The zoning passes. Congratulations. Now we are ready for the next public hearing. Councilwoman Sheperd, will you please put Council Bill three or four on the floor?'"
    ],
    "Approves a rezoning of 2000 East 28th Avenue from PUD #572 to new PUD under Former Chapter 59 in Council District 8.  (LAND USE TRANSPORTATION AND INFRASTRUCTURE) Approves a rezoning of 2000 East 28th Avenue from PUD #572 to new PUD under Former Chapter 59 in Council District 8.  A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 4-22-14.": [
        "'speaker_0': 'Thank you, Madam President. I move. Excuse me. Yes, I move. That council bill 304 series of 24 be placed on final consideration and do pass.'",
        "'speaker_2': 'The public hearing for council bill 304 is open. May we have the staff report? Mr. Heiser.'",
        "'speaker_5': 'It doesn't seem to be responding. And I don't know if I'll let me scroll through or anything. Yeah, it's on the desktop. Okay. So this is actually. Maybe that will go. Okay. All right. So this next rezoning proposal is for 2000 East 28th Avenue.'",
        "'speaker_5': 'The proposal is to rezone from existing few number 572 to new 50, number 636 under former Chapter 59. So by way of explaining what that means, we'll rewind a little bit and go back to the time when the city made a policy decision back in 2010 not to rezone existing pads as part of the overall citywide Denver'",
        "'speaker_5': 'zoning code update. This meant that about 400 distinct former Chapter 59 flood zone districts remain mapped within the city. And so one question is what happens if the owners of one of those old code pads wants to rezone what?'",
        "'speaker_5': 'We do have an ordinance that tells us what to do in that instance. And that's listed here at the top of this slide. That ordinance provides, spells out what the options are for these old code pads. One option is to rezone to a zone district, standard zone district under the new Denver zoning code.'",
        "'speaker_5': 'You could also rezone to a new paved district an additional option listed in. The second bullet point there is that you can rezone to a new pad under the former Chapter 59. You'll notice that the ordinance doesn't give the option of amending an old Code PD.'",
        "'speaker_5': 'It tells you that you can create a new old code pad. So even in the case of reusing 99% of the material from that old PD, which is the case with the proposal here tonight, technically a new PD with a new number needs to be created, and that PD replaces the old PD, which then ceases to exist'",
        "'speaker_5': '. So that's the that's the background of what's being considered tonight. And you can see the proposed planning and development attached to the back of the staff report. You'll notice that it does reuse almost all of the material from the existing PD and has a few changes which will be explained here in the staff report moving forward.'",
        "'speaker_5': 'So this map shows the location of the proposed rezoning within the city, within Council District eight and within the Whittier neighborhood. Specifically, the property is located at the southeast corner of 28th AV and Race. The property itself is an embedded commercial shop at, you might call it, or a corner store type building.'",
        "'speaker_5': 'This particular building has multiple storefronts for individual businesses within the structure. It faces 28th. AV is about a third of an acre in size and as already mentioned, currently is on PD number 572 and the applicant is requesting to rezone to a new PD under the former Chapter 59.'",
        "'speaker_5': 'So a little background on PD number 572. It was created in 2005. The purpose of it was to facilitate the improvements at the time for Mandy's restaurant. The development standards for that PD are specific to the property as it exists, and that's a very common approach in some of these older pwds that the standards are written very'",
        "'speaker_5': 'narrowly. So the allowed building heights, for example, is exactly the height of the existing building. The allowed setbacks are exactly the setbacks of the existing building and on and on for pretty much all of the development standards that are in the pad.'",
        "'speaker_5': 'That was the standard approach at the time and that was also applied to the permitted uses within the structure. So the only uses that were envisioned at the time were Mandy's restaurant and an office space, and those are the only two allowed uses.'",
        "'speaker_5': 'Now furthermore, each of those uses has a limitation on the amount of square footage that it can occupy, and it's also specific to the amount of square footage that Mandy's restaurant occupied at the time. So what this has resulted in is that the you know, the tenants have changed over time.'",
        "'speaker_5': 'Now, instead of one restaurant and the space, there are two restaurants at the space, but they're not allowed to get any bigger than the original footprint of Mandy's because of the strict standards of the PD and how it's been written.'",
        "'speaker_5': 'Meanwhile, the storefront on the far left of the building, so this one here can only be used for office and sits vacant because there haven't been any office tenants that have shown interest in leasing the space, although many other potential leases have stepped forward with interest.'",
        "'speaker_5': 'They're not allowed to because they're not an office use. So the proposed PDD retains all of the provisions of the existing PD, which in most ways meets the current owners needs. But and this is the principal justification for pursuing the new PD is that it expands the list of allowed uses to include most of the permitted uses'",
        "'speaker_5': 'in the E2 district, the B2 being the reference point, because we're talking about a former Chapter 59 plan unit development and then furthermore removes all of the square footage limitations for the individual uses within the building. So if one of the restaurants wanted to expand, it would be able to under the provisions of this proposed putting that'",
        "'speaker_5': 'has a somewhat of a cascading effect on some of the other sections. When you change the use, you need to update the sections of the plan that are regulated or directly related to use. So off street parking and signage.'",
        "'speaker_5': 'So for example, originally you're allowed to have two signs in this PD because it envisioned having two uses the restaurant and the office use. This approach allows it to be more flexible. So we have to change that provision so that if each of the individual storefronts has a different business unit, each of those businesses is able to'",
        "'speaker_5': 'have a sign, for example. And then finally, there are some sections in the PD requirements that were waived because no new exterior construction is proposed and so they don't apply. So for example, your construction schedule or phasing those types of things don't apply in this situation.'",
        "'speaker_5': 'And so they were waived. So the adjacent properties in this area, almost everything in the neighborhood is zoned you as you b1 there is a you mx2x zone district map directly across the street. The current uses in the space.'",
        "'speaker_5': 'As I've mentioned, there are two restaurant tenants currently and then the vacant office space adjacent single family residential on all sides except to the north, which has an office building. And here's some photos of the property. So this top photo here is taken from the corner of 28th and Reyes looking across 20th as well as the the'",
        "'speaker_5': 'property to the bottom. So it's one largest building with the multiple storefronts. This is the alley and adjacent residential to the east and the tap image on the bottom image, you can see the adjacent single family residential to the west.'",
        "'speaker_5': 'The office building across the street is the image at top, and at the bottom is a shot of the rear of the property, its parking lot and adjacent single family. The Planning Board recommendation on this application is for approval.'",
        "'speaker_5': 'They made that recommendation on April 2nd. And beyond that, we followed our standard notification procedures throughout the rezoning process, including written notification to all neighborhood organizations in affected city council districts. And today, we have not received any comments on this particular application.'",
        "'speaker_5': 'The excuse me, the the normal five criteria that you're accustomed to seeing that is specific to the Denver zoning code. Remember, we're talking about former Chapter 59. And under the criteria for form a Chapter 59, there are four and those are listed here and we'll go through each of those.'",
        "'speaker_5': 'The first is consistency with adopted plans, of which there are three that apply here. The first is comp plan 2000. And there are there's consistency with this proposal with several comp plan 2000 strategies, mostly related to the promotion of retail commercial development, as well as encouraging the identification of areas where new uses are desirable and can be'",
        "'speaker_5': 'accommodated. Blueprint Denver has a land use concept of single family residential and identifies the property as being within an area of stability. The street classifications for both East 28th and Raise is designated local for both. So although the blueprint Denver recommendation here is for single family residential and it's identified as an area of stability, the blueprint Denver'",
        "'speaker_5': 'definition of single family residential does acknowledge that single family neighborhoods can have a limited employment base. And this particular structure was constructed in an era of the 1920s, when it was common and customary to have corner store retail uses within residential neighborhoods.'",
        "'speaker_5': 'So by making the changes in the proposed PDE that increase the lease ability of the vacant, chronically vacant commercial space, it would help to enhance the stability of the Whittier neighborhood. The Whittier neighborhood has a plan that was adopted in 2000 that clearly expresses support for the concept of reestablishing commercial uses in locations where they have been'",
        "'speaker_5': 'historically located. And there are three strategies related to this. The first is land use and zoning strategy number three, which is to encourage effective use and redevelopment of underutilized, underutilized commercial facilities within the neighborhood. Urban Design Strategy six is to encourage the redevelopment of commercial sites to compatible retail services and economic development strategy.'",
        "'speaker_5': 'One is to inventory and evaluate vacant properties in order to recruit neighborhood businesses. So going back to the four criteria, we do find that there's consistency with the relevant adopted plans for the area. The second criteria is to reasonably necessary for the promotion of public health, safety and general welfare, which the finding is consistency given implementation of'",
        "'speaker_5': 'the city's adopted land use plans. The justifying circumstance for this rezoning is changed or changing conditions specifically at the time when the pad was originally written in 2005. It was envisioned that both the restaurant and office uses would be viable and with the chronic vacancy of the office space, it's been found that it's too limiting for that'",
        "'speaker_5': 'space to be successful with office being the only allowed use. And so this is a proposed correction to allow for a wider variety of commercial uses in the space. Fourth and last, the criteria is uniformity of district regulations and restrictions.'",
        "'speaker_5': 'This particular rezoning, because it's a pad for a single property, would apply only to the subject property. And so this criteria is met by virtue of the fact that no other properties would have a zoning designation within the city.'",
        "'speaker_5': 'So upon conducting this review, CPD does recommend approval based on the finding that all of the review criteria for new pads under former Chapter 59 have been met.'",
        "'speaker_6': 'I mean, you finished?'",
        "'speaker_2': 'Yes. Okay. Thank you very much. I didn't know you were about to say something else. We have two speakers I'd like to call Herb Kastner to the podium.'",
        "'speaker_3': 'Thank you. My name's Herb Kastner. I'm the applicant representing the property owner, and I'm here to answer any questions you might have.'",
        "'speaker_2': 'Thank you very much, Mr.. Sekou.'",
        "'speaker_3': 'Some say cube like soccer moves self-defense. But I'm in poor working, poor, homeless, homeless people. Here we go. Prime example. I hope all are listening. Used to be, Piers. I mean, used to be Amanda's restaurant, Black, owned 30 years, ran into a situation the economy popped, couldn't get a refinance on a loan, but yet tired of covering'",
        "'speaker_3': 'folks over there. You've got to refinance. Twice. I was here. I watched it. Gentrification of my neighborhood. And now we have a white pub. They're looking to go back to the way the zoning was so he can expand his business and getting all the help that he need.'",
        "'speaker_3': 'Where was the help when M&A was going under? You cannot be serious. There is a contradiction here. All right. Make it easy for them. Make it hard for them. And now we got a white pub and a black neighborhood, and we lost a black institution that never got a chance to get 80 years like Bonnie Brae.'",
        "'speaker_3': 'Explain. So how does that happen? Is that accidental? Come on, y'all real? For real. And you're watching it happen. This is really getting scary. It's almost like free Germany. Nazi is the silence the non speaking to let it just flow.'",
        "'speaker_3': 'Why black people disappear in this town and nobody cares. Yeah. Nobody care where to go. Have anybody seen them? Are they working anywhere on any of the construction sites where they had where they go or they just, boop, there it is.'",
        "'speaker_3': 'They disappear. Oh, we just solve the negro problem. The Negroes are gone. Magic. Outstanding, America. And then you sit up here and you sit looked at black. Are you kidding me?'",
        "'speaker_2': 'Okay. We have questions from council members. Councilwoman Kenney. Thank you, Madam President.'",
        "'speaker_0': 'Courtland, you mentioned or I was reading the staff report, but that there weren't a lot of changes from the original to the new party and the uses you focused a lot on for the office space. But you mentioned early on the specificity of the height and some of those things.'",
        "'speaker_0': 'And I'm wondering if you are using this opportunity or we are using this opportunity to also kind of give a little bit bigger envelope should they need to renovate, expand something like I just. Are we are we thinking towards the future or being so short sighted that we're just doing the teeniest changes that have to be made'",
        "'speaker_0': 'for.'",
        "'speaker_5': 'This particular economic challenge.'",
        "'speaker_0': 'Without thinking about what the next one might be?'",
        "'speaker_5': 'Know so we are not proposing any changes to the existing party beyond what's necessary to accommodate the change in use. So the specific standards for the building, for example, they remain as specific under this proposed party as they are currently.'",
        "'speaker_5': 'So no, we're not making any broader changes in the minimum necessary.'",
        "'speaker_0': 'No, I guess I. May I. Madam President, go ahead. The follow up question is for you. Why? Why? You know, I don't know the age of the building, but it's not uncommon for, you know, businesses to need to expand or update.'",
        "'speaker_0': 'And so would would it not be typical in other parties to be a little more general or similar in height to what the appropriate zoning would be in the code, even though there's restrictions in there that make it mean that you want to keep it a pudi.'",
        "'speaker_5': 'All of all of that is on the table. With the initial discussions with the applicant. The, the first thing that we talked about was remapping to the, um, x to x, which is located across the street. Another option would be to do a pad with more sweeping changes.'",
        "'speaker_5': 'Like what, what you discussed. Ultimately, it falls on the applicant and what they choose to apply for. And this applicant was mostly happy with the pad, didn't like the restrictive use list, but didn't see a need for anything else to be addressed.'",
        "'speaker_5': 'So it is applicant driven in this case that they chose to apply for this minor fix, if you will, to deal with the users and not open the door on everything else related to the potential development of the site.'",
        "'speaker_0': 'Madam President, one last question, which was why do you do you remember why they didn't choose or what the lack of fit was with the, um, x?'",
        "'speaker_5': 'Yes. So the um, x2x has compatibility standards, 4 hours of operation, which the existing PD does not have. So if rezoning to the um, x to x, they would be subject then to those new hours of operation, more limited hours of operation.'",
        "'speaker_5': 'Actually, not even the current restaurant business. It would be the next restaurant business that might come after that one.'",
        "'speaker_0': 'Okay.'",
        "'speaker_2': 'Thank you, Jim. Thank you, Councilman Kennish, Councilwoman Ortega.'",
        "'speaker_6': 'I just wanted to ask a few questions about parking and what the requirements are for a building that was built in the twenties. So if, for example, they wanted to turn the whole building into one big restaurant, are are the parking requirements per square foot the same in a building built at that time, or are they completely'",
        "'speaker_6': 'different? So I'm just wondering what the potential effect on the adjacent neighborhood would be. I don't know if there's a lot of on street parking. I haven't looked at this particular property, so I'm just curious about that.'",
        "'speaker_5': 'So the the PD prescribes the parking ratios. And it provides the specific number of spaces per square feet. I'm trying to find that now. So for the restaurant, use one space per 250 square feet is the standard for an office, use 1 to 400.'",
        "'speaker_5': 'Those are the same ratios that are in the current existing field for all other permitted uses. They would then be directed to the requirement as written in the B2 Zone District. So as part of that, your question is what if the whole thing became a restaurant?'",
        "'speaker_5': 'Would there be enough parking? The answer is yes. Under the prescribed ratio of 1 to 250 square feet, they they would have enough spaces.'",
        "'speaker_6': 'Okay. So given the fact that it's a twenties building, I know in some neighborhoods if you, you know, put a certain use in an existing older building, it didn't have all the same parking requirements, but because it's a pad that was already built into it, is that correct?'",
        "'speaker_5': 'No, actually, what you're describing would be a provision in the new Denver zoning code and it would be unaddressed in this period. And it has its own parking ratios that are prescribed.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilman Levitt.'",
        "'speaker_3': 'Thank you, Madam President. So I. I'm kind of frustrated here because, you know, we're taking a pod, which is something that, you know, we wanted to get rid of and we're replacing.'",
        "'speaker_5': 'It with a new pod. I mean, I know there's provision for doing.'",
        "'speaker_3': 'That, but, you know, we could not get to an ordinary zone district. I mean, this whole thing sort of reminds me of the story of the guy who goes to the county.'",
        "'speaker_5': 'Clerk and says, I want to I want to change my name. And the clerk says, well, what's your name? And he says.'",
        "'speaker_3': 'John Jacob Dingell. Hammerschmidt Clerk's like, Wow, okay, I understand you want to buy you want to change your name? What do you want to change it to? He says, Steve, Steve, Jacob, jingle Hammerschmidt.'",
        "'speaker_5': 'I mean.'",
        "'speaker_3': 'That's I feel like that's what we're doing here is changing, you know, one pad to another, you know, to accommodate a little use. But we're still.'",
        "'speaker_5': 'Working with this bad.'",
        "'speaker_3': 'Tool I have. I mean, don't know where to get. Well, maybe it's I don't want to, you know, put the applicant through more process to get to an ordinary zoned district. But I guess I'm looking to use or how did we.'",
        "'speaker_5': 'Get to the spot? Well, like I said, we we did have those conversations. It was the first thing we talked about was, you know, what standards on district would work for you. And I think that had, you know, the applicant was generally receptive to it until discovering the limitation on the hours of operation which the existing Whittier'",
        "'speaker_5': 'Pub currently operates outside of those hours. And so it was viewed as an impact to the existing business. That was not a risk that they wanted to take. And so they decided not to apply for that zone district and instead to go this route.'",
        "'speaker_5': 'And I guess you already know my answer because you referred to it, but this is a viable route that's available to people and they can apply for it and they did apply for it. Okay.'",
        "'speaker_2': 'Thank you, Councilman and Councilwoman Robb.'",
        "'speaker_0': 'Well, I'm I'm on the same tack.'",
        "'speaker_4': 'As.'",
        "'speaker_0': 'Councilman Nevitt and Councilwoman Sheperd. And I can I mean, excuse me, Councilwoman Kenney and I can read Councilwoman Sheppard's mind because she spoke it clearly in committee. We all questioned the Pudi and frankly looked at how we allowed rezoning to the old Pudi.'",
        "'speaker_0': 'But the way I want to phrase the question is these have more restaurant hours inside and outside than in a mixed two embedded retail zone. And this would allow so allow both a retail marijuana store or medical marijuana store, which are no longer allowed, I believe, or at least the retail would would would be allowed the medical'",
        "'speaker_0': 'might go, I don't think either could get in. So how does that lead to creating more stability for the neighborhood? Which planning in your report said that by doing this zoning change we were creating more stability? That was one of your rationalizations or reasons for the rezoning?'",
        "'speaker_5': 'Well, what I meant when I stated that is that the the commercial space that's been sitting vacant, they haven't been able to find someone to lease it for office use. There is indication and interest that, you know, non office users would jump at the chance.'",
        "'speaker_5': 'So you'd be removing a chronically vacant space that's been sitting there for a long time. It would have a neighborhood business in it.'",
        "'speaker_0': 'Yeah, that does make sense. So thanks, because that helps me with our criteria for rezoning, which we've been talking about tonight. I just don't think it's very predictable for people who are moving into the neighborhood when they see that sort of neighborhood, embedded retail, they expect one set of conditions and they're going to find another set.'",
        "'speaker_5': 'Okay. Would you like me to address the marijuana issue? Yes. Okay.'",
        "'speaker_0': 'Just what would be allowed and what wouldn't?'",
        "'speaker_5': 'Right. So the party doesn't say anything about marijuana, so it defaults to all the other city laws governing how where marijuana related uses can be established at this particular location. It's about 750 feet away from Manual High School.'",
        "'speaker_5': 'So in licensing, if someone tried to establish that use, they would run into the standard of not being able to be within 1000 feet of a school. So it's zoning doesn't address it, but licensing does address it. And you would not be able to have marijuana at this location.'",
        "'speaker_0': 'Okay. Thanks.'",
        "'speaker_2': 'Thank you, Councilwoman. Councilman Brooks, did you have another question?'",
        "'speaker_5': 'You know, I'll do it because he's right here. Yeah, I just had a question. It's 750 feet from manual. Do we do any provisions with city owned buildings, library libraries within even shorter? I don't do know that at all.'",
        "'speaker_5': 'I'm not sure. I don't I don't look it up in the light. Okay. Okay, great. Okay. Schools, I know for sure, are included. Yeah.'",
        "'speaker_2': 'All right. Well, that looks like all the questions. So I'm going to close the public hearing and ask for comments by members of Council Councilman Brooks.'",
        "'speaker_5': 'Yep. Thank you. This is kind of a tricky one. We we kind of debated this and in committee, and I think we need to split it up into sort of issues. One is a business owner that is trying to grow their particular business and make sure that the hours of operation is not hindered and their business is'",
        "'speaker_5': 'not hindered. And then two is a macro kind of PD issue that we have in the city that has certain allowances for applicants that for one, it's their right to be able to choose this. But we have this kind of policy conversation and level up here saying, you know, we want to start moving away from Pwds.'",
        "'speaker_5': 'Well, if we want to start moving away from Pwds, we need to have that solidified with CPD. And I believe at the time that this was coming through CPD, we did not have a director, which again kind of points out that, you know, there needs to be some vision around this and we need to have kind of'",
        "'speaker_5': 'a deeper conversation around this issue. And in my opinion, the applicant shouldn't suffer for something that I think is a is a city issue. So I am. With that being said, I'm in favor of this moving forward with this kind of caveat that I hope that we can go back to the drawing board and have a larger'",
        "'speaker_5': 'conversation, whether it be with Councilman Rob and Ludi, to say how do we handle applicants that come in that need to, you know, that want to have amendments to the certain pwds? How do we want to handle it so we don't come to this this point again where we don't, you know, as a city, we want to'",
        "'speaker_5': 'be able to work for all. We want to be able to make sure that businesses can work. But at the same time, we have a certain vision that we're trying to to understand here and see implemented in our city.'",
        "'speaker_5': 'So I'll be voting in favor of this and excited to to see that this business thrive here on the 20/24.'",
        "'speaker_2': 'Thank you, Councilman. Councilwoman Sheppard. Thank you, Madam President.'",
        "'speaker_0': 'Well, actually, I just wanted to address my colleague, Councilman Nevitt, regarding the John Jacob jingle. Hammerschmidt wanting to change his name to Steve. John Jacob, jingle Schmidt. So Councilwoman Robb and I initiated a very lively discussion around this particular issue at Land Use and Transportation Committee.'",
        "'speaker_0': 'We both had a lot of heartburn over precisely what you expressed a while ago, and I believe we have adequately expressed that heartburn to both others on Land Use and Transportation Committee as well to community planning and development.'",
        "'speaker_0': 'And they have heard loud and clear that, you know, we you know, there's and then also, I took the opportunity to speak to Mr. Hancock about this. It is unwieldy to be moving forward with two codes four years after, you know, a very intense rezoning and comprehensive citywide zoning code revision.'",
        "'speaker_0': 'So it has all been duly noted. And there is a firm commitment from CPD to move towards the day when we will no longer allow such a thing and we will be pushing people into coming into conformity. With Ozone District that is appropriate in the new code.'",
        "'speaker_0': 'However, we couldn't deal with that hiccup regarding this particular situation. So we all recognize that. And I will be supporting Councilman Brooks in this endeavor this evening.'",
        "'speaker_2': 'Thank you, Councilwoman. Seeing other comments. Let's take the roll call on council fell three or four.'",
        "'speaker_0': 'Brooks.'",
        "'speaker_5': 'High.'",
        "'speaker_0': 'Brow high butts I can each high layman monteiro nevett.'",
        "'speaker_3': 'Grudging grudgingly I.'",
        "'speaker_0': 'Ortega, I. Rob Shepherd, I. Madam President, I.'",
        "'speaker_2': 'Madam Secretary, close to voting the results.'",
        "'speaker_0': '11 eyes.'",
        "'speaker_2': '11 eyes. The zoning passes. We have a third public hearing this evening. Council Bill 30504 See? What do I do? Councilwoman Sheppard, will you please put Council Bill three or five on the floor?'",
        "'speaker_0': 'Thank you, Madam President. I move that the following Bill Council Bill 305 Series 2014 be placed upon final consideration and do pass.'",
        "'speaker_2': 'Thank you, Councilwoman. Public hearing for Council Bill 305 is open. And may we have a staff report.'",
        "'speaker_5': 'Yes. Good evening. My name is Tim Watkins. Community Planning and Development present tonight the rezoning application for property property located at 3600 East Alameda. Other addresses as part of this property under consideration is three one and 319 South Garfield Street as well as 314 South Monroe Street.'",
        "'speaker_5': 'Property, though, is located in Central Denver in Council District ten, in the Cherry Creek neighborhood, southeast corner in an area known as Cherry Creek Triangle. The site is just over an acre in size that fronts Alameda, which is a parkway that connects Pulaski Park like one block to the west, and Byrnes plot Burns Park, like three blocks'",
        "'speaker_5': 'to the east. And it's just one block north of the Cherry Creek Greenway. Here's a photo of the site. Existing building on the site from Monroe Street and alameda looking to the east. This is the view of the site from Alameda and Garfield looking to the Southwest.'",
        "'speaker_5': 'The majority of the site is actually service parking. The building existing building footprint area occupies only about 20% of the site. The applicant is Rachel L Trust, represented by Robert Smith. The applicant is present tonight and is available to respond.'",
        "'speaker_5': 'Any questions or comments that you might pose to them? The current zoning is general business or B for this district allows commercial uses adjacent to arterial streets and also permits residential, single family and multi-family uses. There are two waivers.'",
        "'speaker_3': 'Applicable to the site.'",
        "'speaker_5': 'Weaver, 74, has a 72 foot height limit, as well as some use limitations, as well as waiver age 60 and both of these wave intensive commercial industrial manufacturing and warehouse uses. There are also two overlay districts, year one adult use and your two billboard uses.'"
    ],
    "Approves a rezoning of 3600 East Alameda from B-4 with Waivers UO-1, UO-2 to C-MX-5 and C-MX-8 in Council District 10.  (LAND USE TRANSPORTATION AND INFRASTRUCTURE) Approves a rezoning of 3600 East Alameda from B-4 with Waivers UO-1, UO-2 to C-MX-5 and C-MX-8 in Council District 10.  The Committee approved filing this bill at its meeting on 4-22-14.": [
        "'speaker_5': 'And so the proposed rezoning to the new zoned districts would retire all of these existing entitlements and replace with two zone districts, two proposed zone districts, CMCs five and CMC. I would just point out in the first rezoning case that we heard related to the Welton Street Station that we were talking about split zoning and Cortland mentioned'",
        "'speaker_5': 'generally not practiced. There are times when it is necessary to implement the vision plan and I will demonstrate tonight how that is the what we feel is the best opportunity to implement a vision that set forth clearly in an adopted plan.'",
        "'speaker_5': 'So I'll be addressing that throughout the presentation. So a look at the existing context. As I mentioned, there's existing commercial office and surface parking. The area is served by multiple bus routes on Alameda, North Cherry Creek Drive and Colorado Boulevard.'",
        "'speaker_5': 'And Alameda Avenue is a dividing point for transition along Alameda between the lower scale residential in Cherry Creek to the north and commercial and mixed uses to the south in the Cherry Creek Triangle. There is a recent trend of investment and redevelopment in the Cherry Creek Triangle to the South.'",
        "'speaker_5': 'Here's a view of property to the east across from Garfield Street. A four story office. To the south, we see redevelopment currently underway under CMCs eight zoning, which was recently resumed. And a recent development about five years old is a multifamily mid-rise project to the west across from Monroe Street and fronting Alameda.'",
        "'speaker_5': 'This particular project implemented or further improved the Alameda Parkway, which is very much a neighborhood priority. And you see this 20 foot setback as applied and enhances the condition along the street between development and the street for both the visual qualities along Alameda for motorists as well as the pedestrians and cyclists using using the parkway to the'",
        "'speaker_5': 'north across from Alameda is vacant property and the lower skilled residential to the north. So the public review process has followed our standard notification and outreach efforts. I'm very appreciative to the applicant has done a great job reaching out to applicable registered neighborhood organizations, property owners and written notice.'",
        "'speaker_5': 'Receipt of application and hearing notices have been sent to applicable neighborhood organizations and council districts. Planning Board Public Hearing was held on April 2nd, 2014, which resulted in unanimous recommendation of approval. And there have been three letters of support submitted on behalf of this project, and we have also provided the proper legal posting written notification for this'",
        "'speaker_5': 'hearing this evening. So I'd like to speak to the five criteria applicable to current Denver zoning code. First, starting with consistency with adopted plans, comprehensive plan 2000 encourages infill development that provides housing that meets increasingly diverse needs in a manner that is consistent with surrounding neighborhood character.'",
        "'speaker_5': 'Blueprint Denver The concept land use shows the Alameda excuse me, formerly known as Alameda, but now the Cherry Creek Triangle as an area of change and intended to evolve into a regional center such that future land uses serve not just the surrounding neighborhood, but also serve neighborhoods throughout the city.'",
        "'speaker_5': 'And this is appropriate given the the regional service provided by Colorado Boulevard, Alameda Avenue. These are arterials that do bring people from across the city, as well as the Cherry Creek Parkway, bringing folks to this area from throughout the city in the region.'",
        "'speaker_5': 'Alameda fronts the property to the north. Blueprint Denver Street classification for the street is mixed use arterial and the two side streets Monroe and Garfield are local streets recently adopted. Cherry Creek Area Plan also shows the intent for this area to evolve into a regional center.'",
        "'speaker_5': 'And you'll note that I've highlighted the property, the subject property proposed for rezoning in the red box and that there are actually two building heights recommended for for this particular area. And the intent here is to create a transition from a five story Alameda frontage, which is considered to be most appropriate to the lower scale residential to'",
        "'speaker_5': 'the north, and then transitioning up to eight stories and then to 12 stories for the the bulk building height transition. So also contained in the Cherry Creek Area Plan is encouragement to improve the Alameda Parkway. And this includes encouraging private investment adjacent to Alameda such that new development fronts and addresses new buildings on Alameda that can improve'",
        "'speaker_5': ', placemaking and improve the public realm. That this can also create a vibrant urban mixed use district, especially office and residential in the proposed or in the recommended regional center area. The plan also encourages adopting form based and context based zoning the new Denver Zoning Code and finally the building mass transition with the five storey edge facing Alameda'",
        "'speaker_5': ', transitioning up to eight storey and then 12 storeys to the south. These graphics are taken from the adopted Cherry Creek Neighborhoods Plan showing the intended vision for improving the Alameda Parkway. It shows today's condition. And then a proposed condition.'",
        "'speaker_5': 'And you can see the intent to provide amenities in terms of landscaping, new walkways, and then the new development fronting and activating this parkway. And so to implement and improve the Alameda Parkway vision, a 20 foot setback is is currently a requirement in place and is applicable to both sides of Alameda.'",
        "'speaker_5': 'Also applicable to this site are other regulatory controls, including a 75 foot height limit within 175 feet of protected residential districts. And you can see in the highlighted yellow areas these are protected residential districts. G RH three The current PD applicable to the vacant, partially vacant site is not a protected district, so the Red Hat area results'",
        "'speaker_5': 'in a 75 foot height limit in this rather peculiar scalloped form, as you can see. And so this is the resulting bulk playing given some of the regulatory controls in place. You also see the 20 foot parkway setback as the applicant is actually proposing to zone districts to implement this transition from five storey to eight storey applicable'",
        "'speaker_5': 'to this area. Fronting Alameda. So try to provide this graphic to make it visible and comprehensible at a glance. But the applicant is proposing CMCs five at a depth of 40 feet. 20 feet of that depth would be the applicable parkway setback, with a 20 foot distance remaining four cm x five and then the remaining portion to'",
        "'speaker_5': 'the south would be CM eight, a portion of that with the 75 foot height control and then some of that allowing for the 410 feet allowed under CMC zoning. I would point out that the 20 feet of CMC five is the depth allowed for CMCs, or it's the step back depth when you mix five and see Acceder'",
        "'speaker_5': 'adjacent to protected residential district. So we staff felt that that was an appropriate depth to implement that transition between five and eight storeys. So the second criteria, uniformity of district regulations find that these two zoning districts would result in that uniformity uniform application of district regulations and further the public health, safety and welfare through implementation of adopted'",
        "'speaker_5': 'plans. The justifying circumstances changing circumstances include the fact that there is a recently adopted neighborhood plan, that there is underutilized property in terms of today's standards and market demand, and that there is a surrounding pattern of investment and development in the neighborhood.'",
        "'speaker_5': 'And this also would result in consistency with neighborhood context, zoned district purpose and intent and finding consistency with all the plan criteria or the rezoning criteria. CPD recommends approval for rezoning to these two zoned districts. See them x five and see if say thank you.'",
        "'speaker_2': 'We have three speakers. I call on them one at a time, Robert, and I can't see the last name, can Smith?'",
        "'speaker_3': 'Madam President. City Council members. My name is Bobby Smith. I represent the applicant in this rezoning for your consideration tonight. I'd like to thank him for all of his fine work. And I'd like to thank you all for your consideration this evening.'",
        "'speaker_3': 'And I'm here to answer any questions that you might have. Thank you. Increasing.'",
        "'speaker_4': 'Thank you, Madam President. I'm back again to my neighborhood. As Councilwoman Robb knows, I'm a resident and property owner for the last 15 years and I live on 217 South Jackson Street, literally right behind Monroe. So I'm here as vice president of the Cherry Creek Eat Cherry Creek East Association.'",
        "'speaker_4': 'I was elected as vice president recently, and I had joined last year, mainly because of my work in the Five Points area. I felt that the experience that I was gaining in the last two and a half years should be used as well in my own personal neighborhood.'",
        "'speaker_4': 'So my fellow board members felt the same way and and selected me as VP. So I'm today here speaking in support of this rezoning application because this request is consistent with the Cherry Creek Area plan. We appreciate Smith, Jones, Partners Awareness, Insights and tivity to the public right away.'",
        "'speaker_4': 'Requirements for Alameda Parkway. We are encouraged that they want to enhance the pedestrian and the multimodal transit connections between Cherry Creek East and the Cherry Creek Triangle. So if you have any questions for me, please feel free to ask me.'",
        "'speaker_4': 'I will be here. Thank you.'",
        "'speaker_7': 'Thank you very much, Chester.'",
        "'speaker_3': 'You know, I can't do it alone. I can't do it. Here we have a project that we support because what the project works is a possibility that maybe we'll get some jobs out of this and maybe, you know, some members in our community and some subcontractors and maybe we can go to work, so maybe that we can'",
        "'speaker_3': 'afford the housing being built in our neighborhood, which is beyond our means right now. See, part of the deal in being part of this city is that we're all connected in some way, form or how. And for those who are.'",
        "'speaker_3': 'Blessed. Too much that is given. Much is expected not to do less, but to do more. We broke. We're done. We need help. But we're not begging because we got skills, too. And if this city is going to be a diverse city and not have the unintended consequences of turning itself into an elitist town like Boulder, then'",
        "'speaker_3': 'we got to do something different. We have to do something different. And I know we can do better than this. We got to do better. So I ask.'",
        "'speaker_5': 'Myself, why? What?'",
        "'speaker_3': 'Why am I here, man? Why am I here? People trying not to listen, but to look like they're listening. Why am I here? Well, I'm here because I refuse to quit. I can't quit. I'm stuck. So think about it as you going about building your projects up.'",
        "'speaker_3': 'The councilman. I can't even say his name knows about minority serves. Kind of looks like one sometime. He knows who they are. Enrolled him in the process so he can get you some votes. I didn't say his name.'",
        "'speaker_3': 'I don't care. So it can be personally found. No, I'm not finished yet. But I think. Okay. Well, I think I'll just.'",
        "'speaker_7': 'Go on back the girls, because I'm not going to take a lot of questions from.'",
        "'speaker_0': 'Thank you, Madam President. This question is for Mr. Smith. Mr. Jacob Helmer Smith. I just thought it might be educational for you to explain the relationship of this project with the one to the south of it, the one that looked like a lot of other lots in Cherry Creek right now, the dirt lot with the cranes, because'",
        "'speaker_0': 'you've planned them to really coordinate. As I understand.'",
        "'speaker_3': 'We have a patent pending y'all's consideration tonight. The intent is, were the developers of the project immediately to the south of what's before you this evening. And that was zoned by you all a little over a year ago.'",
        "'speaker_3': 'Four CMCs eight were under construction now. And the idea with this proposal this evening is that we would start with a five storey edge along Alameda as the transition from the Cherry Creek East neighborhood to the north across the existing Alameda Parkway, which would in our new development of were successful tonight with rezoning set the stage for'",
        "'speaker_3': 'a future Alameda Parkway, improvements of five stories, setback and transition to meet the project that we currently have under development at CMC eight to the South.'",
        "'speaker_0': 'Okay. And does the parking work together or not?'",
        "'speaker_3': 'No. We've our intentions pending Earl's approval tonight would be to have this project be a completely standalone self marked as our project to the South as self park. All the parking hidden from the street view completely encompassed within the building.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_2': 'Okay. Thank you, Councilwoman Robb. I see no other questions, so I'm going to close the public hearing and ask for comments. Councilwoman Robb.'",
        "'speaker_0': 'Thank you, Madam President. This is another example of huge private investment in the Cherry Creek area, of which we have seen many examples of lately. But I want to point out, as Tracy Winchester knows so well, while in a lot of areas we invest with tax increment financing in infrastructure and in attracting development in Cherry Creek, we'",
        "'speaker_0': 'don't have to worry about attracting development. We do that pretty well, it seems. But that doesn't mean that public investment in infrastructure isn't needed. Mr. BROOKS. Or excuse me. Mr. BROOKS. Not you. Mr. Smith talked about setting the stage for the future.'",
        "'speaker_0': 'Alameda Parkway developers can set the stage, but there's no light rail in Cherry Creek. We're not talking about what Joel Noble.'",
        "'speaker_4': 'Spoke about, where light rail was already in place in five points.'",
        "'speaker_0': 'We don't really it's designated a parkway. But this is the one stretch of Alameda between First Avenue and Alameda to the east of Colorado Boulevard that isn't planted in the median. It's River Rock. It really doesn't look like Parkway.'",
        "'speaker_0': 'There are not trees along this side consistently of the street. Some reconfiguration needs to be done and it's going to cost money. And my constituents, long after I'm gone, I'm sure at least gone from this dais, I might still be on this earth, will be asking for those improvements.'",
        "'speaker_0': 'So I really want to put that out there because a lot of you will be around the next time we have a bond issue. And I'm working very hard to be sure we set the stage publicly because we can't rely on the private investment to do that.'",
        "'speaker_0': 'There are also you have a letter in front of you on your desk from the Cherry Creek East neighborhood, things that I have talked about before, as well as the Alameda Parkway. They talk about the Garfield Bike Boulevard that is in the planning phase this year.'",
        "'speaker_0': 'And I hope there will be implementation money that goes all the way from Cherry Creek, the creek up to City Park. There is also in the plan a proposed bike, PED Bridge over Cherry Creek from Garfield on the South over no funding for that.'",
        "'speaker_0': 'So that's a very important improvement. So I just want to keep pointing out that as we put the people here, we really have to make the investments. But I will be supporting this rezoning tonight and lobbying you in the future for those investments.'",
        "'speaker_2': 'Thank you, Councilwoman Robb and I see no other comments. Let's go for that roll call.'",
        "'speaker_0': 'Rob. Hi. Sheppard Brooks. Hi, Brown. I fats. I can eat lemon i. Monteiro, I. Ortega. Madam President. Hi.'",
        "'speaker_2': 'Okay. All righty. Councilman Ortega.'",
        "'speaker_0': 'For.'",
        "'speaker_2': 'Council. Councilman Lopez. Okay. Madam Secretary, close the voting. Announce the results.'",
        "'speaker_0': '11 eyes.'",
        "'speaker_2': '11 eyes. The zoning does pass. Thank you all for your good patience and goodwill. And I am going to have to say that this meeting is a journey.'",
        "'speaker_0': 'Denver eight TV York City your source.'",
        "'speaker_1': 'Denver eight on TV and online to stay connected to your community. Your city, your source.'"
    ]
}