{
    "A proclamation in recognition of the Csar E. Chvez Holiday. A proclamation in recognition of the Cesar Chavez Holiday.": [
        "'speaker_1': 'Thank you, Councilwoman Ortega. Your motion to adopt.'",
        "'speaker_4': 'Madam President, I move for the adoption of Proclamation 205 series of 2014.'",
        "'speaker_1': 'It has been moved and seconded comments by members of Council Councilwoman Ortega.'",
        "'speaker_4': 'Thank you. Madam President, I served on the council with Councilwoman Ramona martinez when this proclamation was brought forward, and I had the pleasure many years ago when I worked for Councilman Sal Carpio to meet Cesar Chavez, who was here during one of the the boycotts that they were doing.'",
        "'speaker_4': 'And, you know, they were traveling across the country trying to convince people. Why it made sense for communities all across the country to participate in the boycott, to ensure that the working conditions were safe for the workers. And when the working conditions were safe, then they could have access to bathrooms and clean water.'",
        "'speaker_4': 'Then they were going to be dealing with the food in a more sanitary way as well. And it was just such an honor to be able to meet such a humble man who gave so much of his life to the cause of ensuring that the farmworkers in this country had safe working conditions.'",
        "'speaker_4': 'Just as a quick sidebar, I don't know how many of you have had an opportunity to see the the play, the Ludlow Massacre. But in that play, it depicts some of the same working conditions that the coal miners had to live in, that the farmworkers experience.'",
        "'speaker_4': 'And so it really took a huge effort. And this this man paid the price with his life for all of us to be able to have the safe food that we are able to put on our tables. And over time, the working conditions did improve, the living conditions improved, the wages improved, and it took that organized effort'",
        "'speaker_4': 'to make all of that happen. So I just want to encourage my colleagues support of this proclamation, will have some folks who are part of the organizations come up afterwards. But I am honored to bring this forward on behalf of the Latino community.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega, Councilwoman Kennish. Thank you, Madam President.'",
        "'speaker_5': 'And thank you to my colleague for bringing this proclamation forward. One of the first community activism that I engaged in in my neighborhood when I moved to Denver many years ago is petitioning for the renaming of the Cesar Chavez Park and learning about the history and the connections between Denver and the agricultural issues.'",
        "'speaker_5': 'Unfortunately, so many years later, so many challenges still exist for the people who grow our food. They are still exempt from many of our wage and hour protections nationally. A lot of susceptibility to abuse from employers by holding immigration status over them while also benefiting by paying them low wages.'",
        "'speaker_5': 'So, you know, our Colorado Legal Services does a lot of work still protecting farmworkers and carrying this legacy forward. But what I love about Cesar Chavez, as well as MLK Holiday is, you know, watching these holidays through the eyes of a child who asks, who is that and going to the park.'",
        "'speaker_5': 'And so every time I take my son to my neighborhood park, you know, we get to have a conversation about fighting for people's rights. And it's amazing how each each year he kind of understands a little more sophistication about what that meant to join together with other people and why, you know, that work continues today.'",
        "'speaker_5': 'And so I am so appreciative that this city was so forward thinking in, you know, renaming a park and having a holiday dedicated because it creates that conversation. On everyday dinner tables, just like these films create and these events create big community conversations.'",
        "'speaker_5': 'So thank you, councilwoman, for for accounting that history so eloquently. And to those of you who continue to carry forward work on behalf of workers who still struggle for their equal rights in our country, in our state, and in our city.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_1': 'Thank you. Council. Councilman Lopez.'",
        "'speaker_0': 'Thank you, Madam President. I wanted to thank my council. Woman And she is my councilwoman. Technically, I get to vote for you. I wanted it and think I'm Councilwoman Debbie Ortega for bringing this proclamation forward. And I also wanted to say she mentioned it and I actually wanted I wanted to say this, but I wanted to actually'",
        "'speaker_0': 'thank her for her leadership when this was an issue. And also because Councilwoman Ortega worked really hard to dedicate 38th Avenue to Cesar Chavez Boulevard a long time ago. And I want to make sure that she understands that, you know, those of us in the West that are really inspired about that and we haven't forgot about that'",
        "'speaker_0': ', I think it's amazing when we are able to recognize somebody who was so humble, never made more than $13,000 a year, and his whole life dedicated himself to that cause. And he was and always Cesar Chavez is a great book.'",
        "'speaker_0': 'It's called Conquering Goliath. And it was Cesar Chavez, his life, you know, as told by Fred Ross and who was with him around the time. It's such a wonderful book and it really talks about, you know, a person, a regular person who grew up in an.'",
        "'speaker_0': 'In the ghettos of outside of the South spoilers, which is get out if you can, this exact translation of the community you lived in and just begin by doing voter registration. And there are so many people who are just waiting for someone to knock on their door to get them involved.'",
        "'speaker_0': 'And that is how a person like so that Chavez began. That is how a woman like Dolores Huerta, who was a co-founder of the union, who had 11 children and still found it to be one of the most you know, she is one of the most primary incredible activists that a woman in our lifetime who was still'",
        "'speaker_0': 'alive, still organizing in the day I saw her on Sabado Gigante which those of you know that it's like it's it's basically price is right but Spanish at night with crazy music and all kinds of crazy stuff going on.'",
        "'speaker_0': 'She was on there talking about the cause still, right. And she still makes her way to Denver because she has family and and where she still, you know, always had the opportunity to sit down and eat with her.'",
        "'speaker_0': 'You know, one of the best times is one of the best memories of sitting with her was in Washington, D.C., in a and a bar where she drank all of us under the table. And she said with the you know, Paul.'",
        "'speaker_0': 'She says Cesar Chavez loved being in Colorado. And it is a shame today that even though he visited it, even though they were big supporters, even though folks in Denver, from Denver to Chicago to Florida to New York, all boycotted grapes to support the union.'",
        "'speaker_0': 'Farmworkers in Colorado still cannot organize, not because they don't have the right to, not because it is illegal for them by Colorado law to form a union. And if all you have to do, if you really support this are Chavez and I'm going to really talk about was say sure quote It's one thing to say I support'",
        "'speaker_0': 'Cesar Chavez. I support that. I remember back in the day and I boycotted grapes. Right. Well, in the year 2014, all you have to try all you have to do is drive up I-25 or drive up 80 all the way north to Greeley.'",
        "'speaker_0': 'And you'll see those same farmworkers bent over picking crops in 110 degree weather. They deserve to have those same rights that farmworkers in California do. Our farm workers in Texas do. And it is up to us to apply those lessons that we have learned in the past, especially those civil rights and human rights lessons now.'",
        "'speaker_0': 'And it's one thing and I'm going to say, this is what Cesar Chavez said. Right. Quote unquote, talk is cheap. It's the way we organize and use our lives every day that defines who we are and what we believe in.'",
        "'speaker_0': 'And kind of paraphrased there. But that's exactly what this holiday means. So it's not just a high as the people take a day off. It's a day of service. As Martin Luther King Jr. Day should be a day of service.'",
        "'speaker_0': 'A day of action, not a day of leisure. And so, you know, I'm very proud to see this proclamation come through these council chambers read by a councilwoman who was very integral, along with Councilwoman Ramona martinez, and making sure that this holiday existed.'",
        "'speaker_0': 'And it was Denver City Council as a whole. And I believe this. I remember the day that they adopted it. I was sitting right there in the pews. So anyway, I love these proclamations. I love being able to celebrate this day.'",
        "'speaker_0': 'Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilwoman Monteiro.'",
        "'speaker_4': 'Thank you. Madam President, I also want to thank my colleague, Councilwoman Debbie Ortega, and Councilwoman Ramona martinez. If you're out there watching, hello to you and your family, one of my favorite quotes from Cesar Chavez is when you have people together who believe in something very strongly, whether it's religion or politics or unions, things happen.'",
        "'speaker_4': 'And his clarion call of Si Se Puede has probably resonated with so many people that believe in their cause and believe in how they think humanity should be equal in our society. Each year that we've done this, this proclamation, it never fades and it never pales.'",
        "'speaker_4': 'The words that are said in these proclamations, because each year they become stronger. To me, because of the times that we live in, it's so easy for people to sort of overlook one another when times are good, and it's really easy for people to look over, overlook each other when times are bad.'",
        "'speaker_4': 'And when we have holidays like this, there are remembrance of the legacy that many of us live by. And to be able to be rooted in, connected to that history, to that philosophy and that time of United States history is very, very important.'",
        "'speaker_4': 'So thank you again, Councilman Ortega, for sponsoring this. And I will be supporting.'",
        "'speaker_1': 'Thank you, Councilman Monteiro. And looks like we're ready for roll call, Mr. Secretary.'",
        "'speaker_4': 'ORTEGA Hi.'",
        "'speaker_3': 'Rob Shepherd. I'm Brooks Brown. I thought I. Herndon. I can teach. Lemon Hi. Lopez I can tell you, I never I and I'm president.'",
        "'speaker_1': 'High counselor, in fact.'",
        "'speaker_4': 'So that's.'",
        "'speaker_1': 'That's fine. And please close the voting and announce the results.'",
        "'speaker_3': '39, zero and.'",
        "'speaker_1': '13 as it passes unanimously. Councilman Ortega, is there somebody you'd like to ask up to the podium?'",
        "'speaker_4': 'Yes, there is. I want to ask Cecilia Flores and others who are okay, the Sanchez and I'm sorry, I don't know your name who are here with the AARP group, if you would come to the podium. Those of you who I don't know if you could introduce yourself, I would appreciate it.'",
        "'speaker_4': 'And let me just say, while you're doing that, that Cecilia Flores, her dad, knew Cesar Chavez very well and worked very closely together.'",
        "'speaker_5': 'So I thank you. I'm here on behalf of this estate, Chavez Peace and Justice Committee of Denver. My name is Amr Gonzalez. Thank you, Madam President, and current and past city council members for recognizing the annual Cesar Chavez March and celebration.'",
        "'speaker_5': 'With the commitment of community and and politicians, Denver residents to acknowledge and celebrate a true American hero says that each others yes as who Chavez is an American citizen and recognition of Cesar Chavez holiday, the Cesar Chavez Peace and Justice Committee of Denver, cordially invite City Council citizens of Denver to join us as we honor this American'",
        "'speaker_5': 'hero during the 13th annual Cesar Chavez March and celebration this Saturday, March 29th. This Ussery Chavez Peace and Justice March has been celebrated for 12 years here in Denver. Its purpose is to educate the general public relative to the many contributions that Cesar Chavez made in the area of social and human rights.'",
        "'speaker_5': 'In this country in general and the farm workers in particular, in order to to continue his legacy, because the struggle of that of the United Farm Workers, we're engaged in American society. Farm workers now have more benefits, more decent working conditions and a better wage.'",
        "'speaker_5': 'The event is also a celebration of in honor of this American hero. The event begins with a Catholic mass followed by a march, then a celebration. During the celebration, speakers, poets, dancers and musicians share the legacy of society.'",
        "'speaker_5': 'Chavez and his work toward human rights and social justice. Thousands of Denver citizens were instrumental in the position needed in naming the Street Chavez Park in 2006. As a great leader once said, We cannot seek achievement for ourselves and forget about progress and prosperity for our humanity.'",
        "'speaker_5': 'Our ambitions must be broad enough to include the aspirations and needs of others for their sake and her for our own society. Chavez. Arcilla Victoria.'",
        "'speaker_4': 'My name is Cecilia Flores. And thank you, Madam President, and council people. I really do have a word to prepare, but I would just like to say that through my father, Tim Flores, I did get to meet Cesar Chavez twice and have met the laws with them numerous times.'",
        "'speaker_4': 'But he was such a humble man and he listened. And I know my father was inspired by him. And I think Cesar was inspired by my father because my father worked in the fields. I did it for one week.'",
        "'speaker_4': 'And that was because my think my father wanted to make sure we went to school. He says this is the alternative. And so I so I never I almost cut my thumb doing onions. But I didn't. But we did also I to there is the movie on Friday but it is a movie but on Monday at and'",
        "'speaker_4': 'I'm going to see this wrong sorry, sorry. Theater, which is next to the terror cover on Colfax. And Elizabeth, we will have a documentary on surfers last fast at 7:00. So you are invited to go to that? I have seen the previews of that.'",
        "'speaker_4': 'It's wonderful. So thank you. And thank you again for this powerful emotion. Councilman Ortega, thank you so much.'",
        "'speaker_1': 'Thank you, Ms..'",
        "'speaker_5': 'Flores. Hello, R-Truth. Rick Sanchez and I would.'",
        "'speaker_4': 'Say are we are on the AARP.'",
        "'speaker_5': 'Advisory Latino Advisory Committee called.'",
        "'speaker_4': 'El Comit.'",
        "'speaker_5': 'It is our duties, responsibilities to.'",
        "'speaker_4': 'Bring the voice of the.'",
        "'speaker_5': 'Latinos, what their needs are and their concerns, and to carry that out.'",
        "'speaker_4': 'So I feel privileged to be here.'",
        "'speaker_5': 'Cesar Chavez every time I look at a lettuce or grape and I get very emotional. I really appreciate.'",
        "'speaker_4': 'The work and the sacrifice that they have brought.'",
        "'speaker_5': 'So that we can have this.'",
        "'speaker_4': 'Wonderful food at our table. So thank you, Councilman. Woman Debbie Ortega thank you all city council for your service and work in the city of Denver.'",
        "'speaker_1': 'Thank you for your service. Not quite finished yet. Councilman Lopez, you had a comment.'",
        "'speaker_0': 'You know, I forgot to make this announcement during the announcement, so I may do it. And it ties right into the Cesar Chavez holiday. The one person who would always do the math for the holiday, for Cesar Chavez, the march.'",
        "'speaker_0': 'Father Tomas Fraley. Oh, because he passed away last week.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'And he was the founder of Saint Catches in church going out. So from when it got closed down at an area to make way for the college campus, a lot of those folks got displaced. The residents got displaced.'",
        "'speaker_0': 'The church got this place. So there's two engaged in churches, one in the Lower West Side and one on the Upper West Side over there. Father Tomas would always be very happy to do this math. And when he did this mass and talked about the farm workers, talked about Cesar Chavez, and remember and it's all these stories'",
        "'speaker_0': ', you just kind of came alive. What are these these social justice times? And they were always very spiritual people. Right. And so it's fitting that we also recognize the work of Father Thomas Friday, who worked very hard for the people in West Denver and was just an amazing, amazing leader who touched so many lives.'",
        "'speaker_0': 'I could tell you from cradle to council, he was my spiritual guy. And so it goes hand in hand with that kind of work that that was being done on behalf of all those people. So, you know, in memoriam and in his memory as well to you know, want to recognize that.'",
        "'speaker_1': 'Thank you. Guardsman Lopez, so nice memorial. Okay, we're moving on to the next proclamation. Number 248. I'll be reading this one, thanking Dr. Nita Mosby Henry for her service to the city and county of Denver. Whereas Dr. Anita Moseby Henry stars your job as executive director of Denver's Career Service Authority Office.'",
        "'speaker_1': 'On January 17th, 2012, the first African-American woman to head the 59 year old Denver Agency, having served nine years on the Career Service Board, appointed by Mayor Webb and Mayor Hickenlooper. And. Whereas, she immediately set about overhauling the agency an update signified by her successful campaign to change the name to the Denver Office of Human Resources.'",
        "'speaker_1': 'And. Whereas, Dr. Henry designed a major agency redesign focused on delivering invaluable service, launched the Inclusivity Project, and made the city more inclusive and integrated in the communities it serves and paved the way for the city to become a true learning organization through the development of Denver City Employee University.'",
        "'speaker_1': 'And. Whereas, she has received national recognition for her work with companies and organizations in health care and service delivery. She is the founder and director of the Kaleidoscope Project, a community based organization designed to increase social and health equity within Denver communities.'",
        "'speaker_1': 'And she serves or has served several organizations, including one Colorado, the Local and National Human Rights Campaign, the Colorado Tobacco Review Committee, the Black Health Collaborative Education Committee, and the Disparities Action Committee. Whereas Dr. Henry is leaving the City of Cancer to pursue other opportunities and continue her service to the community.'",
        "'speaker_1': 'Now, therefore, be it proclaimed by the Council of the City and County of Denver, this section one, the Council hereby recognizes Miss Nita Mosby, Henry, and thanks her for her work in Denver and the strides she has made in updating the Denver Office of Human Resources Section two that the Clerk of the city and county of Denver'",
        "'speaker_1': 'shall attested affixed the seal of the city and county of Denver to this proclamation, and that a copy be transmitted transmitted to Dr. Nita Mosby. Henry so I move that this proclamation be adopted.'",
        "'speaker_4': 'Second.'",
        "'speaker_1': 'And it has been seconded comments. I just want to thank Dr. Mosby Henry for I always want to call you Mosby, but for all your service to our city and I wish you great luck in your future endeavors, I know that you'll be just as great there as you have been for us.'",
        "'speaker_5': 'Appreciate it.'",
        "'speaker_1': 'Councilman Brooks.'",
        "'speaker_0': 'Thank you, Madam President. Dr. Henry is not only, you know, a friend, a community leader, but also an incredible transformative leader in this city. And how I kind of define leadership is consistency of message. And one thing that I've heard consistent from what Dr. Henry has done is inclusivity.'",
        "'speaker_0': 'Diversity is no longer the standard. It's about shared values, it's about inclusivity. And it's been amazing to see her transform this agency. But also, you know, I was just with some members of the sheriff's department. I had no idea she was training them in inclusivity and they were raving about, you know, the time spent with Dr. Henry'",
        "'speaker_0': '. And so, you know, we we were privileged to have her for just a short time. And, of course, I wish we could have. I think we all wish we could have a little bit more time with her in this position.'",
        "'speaker_0': 'But I am I'm very confident that at Children's Hospital she's going to continue to make a difference. And she's still the neighborhood president at Whittier. So I know she's going to be transforming things in our neighborhood. So I want to thank you so much for your service, Dr. Henry.'",
        "'speaker_0': 'I can't see you because there's a computer, right. And you look beautiful over there. And thank you for just for that message of inclusivity and impact in my life and the way that I talk about what it means to truly have shared values and lead from that perspective.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks, Councilwoman Fox.'",
        "'speaker_4': 'Thank you very much, Madam President. Well, I will really miss your advancing, bold ideas in personnel reform. That was very important to do. I've really enjoyed our conversations, and I know you have a great commitment to mentoring. I mean, I can list so many things that I just have admired so much of.'",
        "'speaker_4': 'Children's Hospital is lucky. We will look forward to seeing great things for you there.'",
        "'speaker_1': 'Thank you. Councilwoman Fox, Councilman Levitt.'",
        "'speaker_0': 'Thank you, Madam President. I feel weird calling you Dr. Henry Moseby. Moseby. But Moseby like Cher, maybe. Anyway, Nina Henry, we barely knew you. And the loss is ours. You've done a lot in the short time that you've been here.'",
        "'speaker_0': 'The city. I wish you weren't going, but certainly wish you well. I've enjoyed every minute of working with you while you were here, and I look forward to additional opportunities in the future to do the same.'",
        "'speaker_1': 'Thank you, Councilman.'",
        "'speaker_5': 'Councilwoman Kennish. Thank you, Madam President. It's funny, we do a lot of community proclamations from this dais, as well as retirements or folks departing the city. And when I think about UNITA, I think about so much. We could be doing just a community based proclamation.'",
        "'speaker_5': 'You know, the work that you did making civil unions happen in a state by helping to create and grow one, Colorado is going to forever be lasting and the equal rights history of this state. And so for me, that was that was high on the list when I heard you were leaving the city.'",
        "'speaker_5': 'It's funny, because the first thing I thought is, where else could she go? Because, you know, she's and I thought, health, it's health. And of course, such a passion of yours. And you've really made it into not so much a delivery system, but a cult of engagement, which I just think is really amazing.'",
        "'speaker_5': 'And that legacy also lives beyond you in the community. And so I know that the legacies that you created internally in a department that, you know, had had some bumps and its confidence level in the city will also live beyond you.'",
        "'speaker_5': 'And so for those reasons, I can accept saying goodbye because I know that all of that that loop, that path that you leave behind you benefits us in so many ways. And because, like others have said, I know that we'll continue to see you.'",
        "'speaker_5': 'So thank you so much for your contributions here and elsewhere and good luck.'",
        "'speaker_1': 'Thank you, Councilwoman Kennish. Councilman Herndon.'",
        "'speaker_0': 'Thank you, Madam President. I just it is a it is a sad day because the city is losing a true champion, though her impact will continue to be felt because she will still be active in the community making change.'",
        "'speaker_0': 'And I just want to say thank you for our personal conversations, your candor as someone who always tells it like it is. And that is certainly something that is needed throughout all levels of government through the community. So I really appreciate those conversations and I'm sure our paths will cross always.'",
        "'speaker_0': 'Thank you, Native, for all that you've done.'",
        "'speaker_1': 'Thank you, Councilman Herndon. Councilwoman Ortega.'",
        "'speaker_4': 'Thank you, Madam President. I want to ask that my name be added to the proclamation. All right. Neither. I want to thank you for all your contributions. You will be missed. And I want to wish you the best of luck in your new endeavors.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. I said. All right. Looks like it's time for roll call. Hi.'",
        "'speaker_3': 'Brooks Brown. I thought I. Herndon. I mean, I am in Lopez. Hi, Montero. I never I fatigue.'",
        "'speaker_4': 'I rob.'",
        "'speaker_3': 'Shepherd.'",
        "'speaker_1': 'And Councilwoman Kennish. Thank you, Matt. Mr. Secretary, I keep one and call you madam. Mr. Secretary, would you please close the voting and announce the results? 13,013 I0 nays. It passes unanimously. Dr. Henry, would you like to come up to the podium and say a few words?'",
        "'speaker_5': 'Thank you, Madam President and council. Rarely am I speechless, but I'm a bit speechless today since I didn't know what this was. I'd like to first thank my staff. You know, this is a bittersweet transition. It's one thing to have a job and leave a job.'",
        "'speaker_5': 'It's quite another one to have love and leave love. And that's what this experience working in the city and county has been for me. It's been filled with love to the point where.'",
        "'speaker_6': 'It hasn't felt like.'",
        "'speaker_5': 'Work. I really have been fortified as a leader from this experience with the city and county of Denver, and that's something that I think I can take with me wherever I go. I'm very thankful for being blessed with this role to lead the Office of Human Resources at this time.'",
        "'speaker_5': 'I think this was my time, and I think now it's the time for other leaders to take it to the next step. I'm very grateful to this mayor and to this council and to this wonderful team called the Office of Human Resources for believing in Me at a time where all of the details weren't there yet and'",
        "'speaker_5': 'the team went with me anyway. I'd also say to you that it's been.'",
        "'speaker_1': 'A gift to have.'",
        "'speaker_5': 'Been a part of an agency that has the city's most tenured employee in it, Albertine Sellers, who is in her 59th year with the city and county of Denver. And to be able to be blessed enough to be the leader of an agency with that type of history in it, in and of itself.'",
        "'speaker_1': 'Was a gift.'",
        "'speaker_5': 'So thank you for recognizing me in this way. Thank you for all of this wonderful journey that we've.'",
        "'speaker_1': 'Had together.'",
        "'speaker_5': 'And know that I'm with you, but from a different seat.'",
        "'speaker_1': 'Thank you very much, Dr. Henry. Okay. Moving right along. And in the spirit of taking things out of the order, I forgot to make an announcement which was to congratulate Councilman Herndon on an excellent, inspiring, inspiring speech as a keynoter at 40 under 40 at the Denver Business Journal last Friday.'",
        "'speaker_1': 'Just want to thank you for great representation of the council and for your wonderful speech. Good. Well, well done. We are ready to move on to the resolutions. Mr. Secretary, will you please read the resolutions.'"
    ],
    "A bill for an ordinance to rescind and reappropriate in the Capital Improvement program and make an appropriation from capital improvement fund contingency.  \n (GOVERNMENT & FINANCE) Rescinds and reappropriates $1,423,932 in unused capital improvement funds from the 2014 Capital Improvement Program budget and appropriates $250,000 from capital improvement fund contingency for the Housing & Urban Development (HUD) Choice Planning Local Match. The Committee approved filing this bill by consent on 3-6-14.": [
        "'speaker_1': 'All right. Thank you very much. Councilwoman Layman, will you read the motions this evening?'",
        "'speaker_4': 'I will.'",
        "'speaker_1': 'Will you please put Council Bill 145 on the floor?'",
        "'speaker_4': 'I move that council. Be 14, dash 145, be put on final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved in. Seconded comments. Councilwoman Ortega.'",
        "'speaker_4': 'Thank you, Madam President. First, I want to thank Skye Stewart for providing us additional information on this. This is a rescission and appropriation of funding. And I also want to thank Parks and Recreation for providing additional information on this as well.'",
        "'speaker_4': 'This is so my concern is about one particular aspect of this, which is the bio retention for the Hinsdale Park site. And I also want to thank Councilwoman Lehman for taking time to talk with me about this issue as well.'",
        "'speaker_4': 'And part of my reason for bringing this out is if you all remember when the land swap on this property came up, I asked lots of questions and I brought some of the materials from those questions that I asked related to the drainage.'",
        "'speaker_4': 'So there were two issues related to drainage on this property. One was that the city of Denver made a commitment to spend $3.4 million to take an open channel and to pipe that. And that was not part of the costs of the land swap.'",
        "'speaker_4': 'And then the other issue was there was a retention pond on the site that was utilized for drainage that comes off of Havana Street. And in looking at this particular project for this bio retention area, which I understand would be an amenity for young people, particularly the children that will go to that school.'",
        "'speaker_4': 'Also, from my conversations with Parks and Recreation, it could be utilized by any other youth group. And I think that is a really positive thing that could happen for the for young people and for the citizens of our city.'",
        "'speaker_4': 'My issue is with the cost and the fact that this bio retention was not discussed as part of the additional cost of doing this project at that site. And I ask questions about the the retention pond that was on site that was going to be impacted as a result of the school going in there.'",
        "'speaker_4': 'And in going through this process. I remember asking questions about whether or not the Colorado Department of Public Health and Environment was going to have to sign off on things because that retention pond was going to be affected as a result of this project moving forward.'",
        "'speaker_4': 'And. I just I have heartburn with Denver spending an additional $400,000. And so DPS will contribute 203,000 and the city of Denver will spend $406,500 to make this retention fund happen. And I understand that it is in part a regional retention where others can, I guess, get credits towards contributing towards this plan.'",
        "'speaker_4': 'I don't really understand exactly how that works. I know that initially the site that was being looked at to be the retention, the regional retention pond was at Heron Pond or in that general vicinity. And for some reason that site just didn't work.'",
        "'speaker_4': 'I'm assuming maybe it had something to do with some of the contamination from Asarco that's in those soils. But my heartburn is with the cost and the fact that when this project came forward, it was never part of the original big picture that we were asked to vote on.'",
        "'speaker_4': 'And so unfortunately, that means I have to vote in a way that would impact the other projects that are part of this package. But I have heartburn voting in support of putting more money into something that we already spent 4.3. $4 million on to to address drainage.'",
        "'speaker_4': 'And to be asked to spend another $400,000. I just don't think it makes sense. It should have been part of the big picture at the time that this project was brought forward. So for those reasons, I will not be voting for this bill tonight.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilwoman Robb.'",
        "'speaker_5': 'Thank you, Madam President. Since Councilwoman Shepard pulled this out last week, I have gone through some of the same process as Councilwoman Ortega looking at this, because, like Councilwoman Ortega, I had not supported the swap out there, although I admit that was a really difficult decision that all of us faced.'",
        "'speaker_5': 'And I was concerned about the additional costs. But what is key to me, because we are always investing in our parks at some level. And if it has been determined that DPS in the city are working together on this, what was crucial to me in the cost was that DPS was bearing its fair share and we were'",
        "'speaker_5': 'bearing our fair share. I would like in and I'm really comfortable with it if it's all on Denver land, and that's a question I've been asking. So I'd like to ask Scott Gilmore to come up to the microphone and talk about the land and how these dollars are different from just the degree that the detention pond and'",
        "'speaker_5': 'the stormwater project that Councilwoman Ortega referred to it, 3.4 million.'",
        "'speaker_1': 'Thank you, Counsel and Rob, Mr. Gilmore.'",
        "'speaker_0': 'So I brought I brought the map of the area so I could show you guys. Exactly. It's popping up. So when we transferred the land and you see if I can make it a little smaller for you guys.'",
        "'speaker_4': 'That's good.'",
        "'speaker_0': 'And I think he's going to bring around a picture. So if you can look at the image, this area, this is Cherry Creek. This area over here is a banner on the right side of the picture up there.'",
        "'speaker_0': 'The right side is Havana, and down at the bottom is Geraghty, all the way at the bottom. So right now, the way the land is situated, everything toward the top of the picture, on the on the top side of the red is actually parkland.'",
        "'speaker_0': 'And so the red is actually part of the land that was transferred to DPS for the school site. That will be where the detention, the bio retention area is built. And and that is actually where the the outdoor education amphitheater that the kids could utilize and, you know, nonprofits and and just people can go down and enjoy'",
        "'speaker_0': 'being by the creek and sit down and enjoy the red areas where DPS actually they own that at this park at this time. Once this area is built and this is all done, they will actually transfer this land back to us and we won't have to pay for it.'",
        "'speaker_0': 'So we're actually going to get a half an acre back. The reason we're doing that is because I know Parks and Rec is going to be committed to making sure that this area is managed properly, that the plants are taken care, that the area is growing well, and that we we care for this area as part of'",
        "'speaker_0': 'this will actually become part of Hensel Park. All the land on the upper part of the the map is now part of designated Hensel Park. This will actually added an additional half acre to that park. So this will be theme park parts land.'",
        "'speaker_5': 'Scott, I didn't let you get to how, how this cast is different from the other. But while we're on the land, is there an IMO you or some guarantee that DPS is willing to transfer that land to us?'",
        "'speaker_0': 'We haven't done a MRU yet, but we've been we've been talking to them and they actually want to transfer the land to us because they know we'll take care of it at least this half acre, because if they don't transfer it to us, they'll be responsible for caring for this.'",
        "'speaker_0': 'And well, I mean, it's part of the park park part of the bio retention area. So it makes more sense for us just to go ahead and take over management of the whole area. One other thing I wanted to show you.'",
        "'speaker_0': 'There's a little on the toward the bottom of the map. There's a little rectangular box right on the edge of the bio retention pond that is actually underground vault. That is something that Parks and Rec actually asked public works and DPS that we want at this underground vault.'",
        "'speaker_0': 'It's a very progressive type thing, but there should have been a four bay. They had a four bay plan to put be put in here, four bays just catch trash. And so it would have just been catching a lot of trash and it would have been a nightmare to maintain and just keep clean.'",
        "'speaker_0': 'And so what we did was actually have them put into the plan underground vault, which is a big part of the cost of making this work. Right. So I think that was a big thing that Parks and Rec actually requested and that we've got them to buy off on.'",
        "'speaker_0': 'So.'",
        "'speaker_5': 'Okay. So if I have this right, DPS is of contributing 200,000 plus a little bit to the project, about a third of the cost plus they're contributing half an acre. We're doing the maintenance. I do wish that were spelled out.'",
        "'speaker_5': 'But can you also address the difference what we're getting in addition to the bio retention or we have another picture and on disk and you might as well show the public.'",
        "'speaker_0': 'There you go. So what what we're getting traditionally, what what would have happened in a in a bio retention area or detention pond? As you just dig it out, you make sure it just drains out or it seeps out or drops into the creek.'",
        "'speaker_0': 'We really want it somewhere where people could get down to the river and actually do scientific exploration. Getting kids down there with microscopes and getting them down there with, you know, with bug catching nets and actually exploring the river.'",
        "'speaker_0': 'You could do so many interesting things along this river, along Cherry Creek. You could talk about history. You can talk about gold panning that was done on these creeks. You can do science, scientific stuff about riparian zones and all the wildlife that uses these corridors.'",
        "'speaker_0': 'So we wanted to build an area that worked really well for. For school groups and nonprofits to be able to get down in there and just really do some hands on learning. So that's what you're seeing in this picture that actually represent us, represents a school group down there right on the creek in this outdoor education area'",
        "'speaker_0': '. So.'",
        "'speaker_5': 'Okay, Madam President, that that's the end of my questions. I will just comment that I gave this a lot of thought. It's a good project. I think it's going to be a real addition to the area. But like Councilwoman Ortega, I really want the public to know what we're doing here.'",
        "'speaker_5': 'Like no screens over this. So when I saw it pop up in it, it sort of missed my radar. I wanted to be sure we talked about it tonight. I also wanted to be sure we talked about it because in an ideal world, and I know we all know through city processes that they don't all follow in'",
        "'speaker_5': 'the order we would like sometimes. But in the ideal world, we would have a commitment from DPS on the transfer of this land, on their commitment to actually do environmental education if we're building and maintaining this. So but I think just by having that public discussion, that commitment now is on record.'",
        "'speaker_5': 'And I know Councilwoman Layman won't let up on it.'",
        "'speaker_1': 'Thank you, Councilwoman. Right, Councilwoman Canete. Thank you, Madam President.'",
        "'speaker_5': 'I think most of my questions have been answered. But, Mr. Gilmore, if you can answer just one more. So for me, I did end up supporting this project, but it was a very close call and I had a very hard time because of my concerns about the habitat impact.'",
        "'speaker_5': 'When you shrink a space, you just necessarily impact its integrity as habitat in a urban environment, particularly where there's so many threats. And so one of the things that I had asked questions about was the investment in other habitat enhancements.'",
        "'speaker_5': 'So if we're going to shrink the space, what do we do to increase the integrity of what's remaining? And so we talked a lot about plantings and restoration of native plants, etc., which I have been told I believe is actually still separately being funded.'",
        "'speaker_5': 'This is not intended to satisfy that commitment that is still coming and that is still a commitment of the cities in terms of the remaining habitat. Is that right?'",
        "'speaker_0': 'Yes. So the the dollars our request is for the bio retention area that will include all the plantations and all the revegetation around the bio retention area in the park where we actually were clearing some areas and there was some degraded property.'",
        "'speaker_0': 'We actually are in the process of right now treating some of the non noxious weeds that were there. We're actually going to start scraping some of the areas and and revegetated that is on the plan and we'll be doing that this spring.'",
        "'speaker_0': 'And with the weather the way it's been, it's been it should go really well.'",
        "'speaker_5': 'Great. Thank you. And I guess then I just want to just close the loop on this by saying it's my understanding that this investment, you know, we see in this picture the really beautiful steps, you know, for for poor people to learn.'",
        "'speaker_5': 'But there are, in fact, habitat improvements related to this investment in terms of the water, in terms of the plants and in terms of wildlife and or the enjoyment of, you know, those who want to experience a more natural setting.'",
        "'speaker_5': 'This is not simply just education space. There's actual biological investment occurring here.'",
        "'speaker_0': 'That's a great point, Councilwoman. This actually the pond could have just been dug out and it could have seeped just straight into the creek pretty quickly or they could have just ran the pipe to the creek. This actually is improving water quality and it will really help in the long run having that underground vault, that trash will'",
        "'speaker_0': 'not end up in Cherry Creek. So I think this is a good project for the city, for DPS, for the city, and for just the residents that will be walking along this creek and actually can walk down and get by the river and just enjoy a nice place to sit.'",
        "'speaker_5': 'Well, thank you. That's the end of my questions. And so I just I share with my colleagues the desire that our arrangements be contractually put to paper and that DPS is similarly are contractually put to paper. But I consider this a positive that above and beyond the investment that you all committed to when I voted for the'",
        "'speaker_5': 'project, that this is additional improvements to the biological habitat. And for that, I think it's actually a good thing.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Kennish. Councilwoman Lehman.'",
        "'speaker_4': 'Thank you, Madam President. I just want to thank Scott for all the time and all the support and really doing a fine job of answering questions from council from. My constituents, sometimes from the teachers at DPS. He was just in and did an incredible job for this project and he deserves much.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Lyman.'",
        "'speaker_4': 'And then I just want to say that I'm very excited about this project. And for southeast Denver as well as the city, I think it adds anything to an incredible outdoor education opportunity for everyone. So thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Leah and Councilwoman Shepherd.'",
        "'speaker_5': 'Thank you, Madam President, I, I was the one that did pull this out last week for questions. And I'm so glad that, you know, everyone else did, too, and that we got a lot of good information. And I do appreciate all that.'",
        "'speaker_5': 'I had a long talk with Scott and Laureate Laura today in my office just about our capital improvement program, the funding for it, the sources for it, and sort of how much, if you will, gets allocated across the city and across the districts for various projects throughout the year.'",
        "'speaker_5': 'And I did not vote for the Central Park land swap. But I will admit when the when Scott talked to me today about this amenity that will be created not just for the student education, but, you know, looking at it in the context of the river and presuming that the eventual product looks like this lovely conceptual image'",
        "'speaker_5': ', you know, I think it's a great amenity for all users of the trail. And in the summer I bike quite frequently through Confluence Park, and there's that one step area on the west side of the Confluence, and it's full with people sitting there enjoying the river.'",
        "'speaker_5': 'So I do think, you know, that the the disbursement of 400,000, you know, for this project is money well spent. But what came up for me was more of an understanding about was how our capital improvement program works.'",
        "'speaker_5': 'And I learned that, you know, we only get 50 million annually across the city to address everything, especially in public works and parks that needs to be maintained and or added to. And I just doing a little quick math in my head and thinking about the fact that we have just over 600,000 residents and that works out'",
        "'speaker_5': 'to about $83 per capita annually for all of these various capital maintenance and potential additional projects, both in public works in our parks and then moving further. There's about 8 to 10 million annually that sort of filters down, if you will, at the district level to the various council people who can advocate for specific projects in their'",
        "'speaker_5': 'district that that may be addressed, you know, quickly or may be put in the queue for a longer term addressing of needs in the longer term. And what that boils down to is about $17 per capita annually. That is discretionary at the city council district level.'",
        "'speaker_5': 'So my reason for bringing all this up, and I'm sure that some of you out there are wondering where I'm going with out with all this is the fact that $1.4 million is a lot of money, if you think about it, at the district level.'",
        "'speaker_5': 'So that's and a large percentage of that $1.4 million is actually going to match funding for planning for the North Denver Cornerstone Collaborative. So while I think it's important absolutely to leverage those funds as much as possible, that means less in the pot left over that gets distributed to the rest of the city for all of the'",
        "'speaker_5': 'various projects that we have to do. We are an old city with a tremendous amount of aging infrastructure. And as I sit here and I think about this and every time I ask for a ten or $20,000 improvement in a park or something, you know, it gets on a list and it doesn't get addressed until two or'",
        "'speaker_5': 'three years out. And it's I find it difficult and challenging to be responsive to the needs of my constituents when we're dealing with such, you know, great demands, such aging infrastructure, which is quite visible. So this is all a very long way of saying that I'm very concerned about this.'",
        "'speaker_5': 'And it's something that I want to let my colleagues know that I'd like to talk about at our upcoming city council budget retreat, because I just don't feel the you know, certainly the way that this is being allocated on an annual basis is enough to address the maintenance and all of the deferred maintenance that has happened during'",
        "'speaker_5': 'the recession over the last several years. So, you know, and then saving it all up for these large bond requests every ten years leads to more additional deferred maintenance. And I just find that we're getting farther and farther behind the eight ball.'",
        "'speaker_5': 'And that's what my concern is. That's why I started this discussion in the first place. So I will be voting yes for this tonight. But I am asking for a bigger conversation about this issue and about how. Take better care of our capital investments, because I think that they can greatly enhance the quality of life for our'",
        "'speaker_5': 'residents. And if they're not being properly taken care of, I think that really chips away at our quality of life. So thank you very much for listening to my abstract conversation. I will be voting yes for the bill, but I do.'",
        "'speaker_5': 'I'm asking for a bigger conversation. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Shepherd. Pertinent to that, I said on the urban drainage flood control district with my colleagues, Councilwoman Lyman and and Councilman Lopez, who's the chair of that group. And I was just asking him, had we seen this camp, detention pond, retention pond remain?'",
        "'speaker_1': 'I always think flood control. But a bio retention pond is something very different. So but I'm wondering if urban drainage, is it also going to help out in the maintenance of this as they do? Because, of course, it is going to provide a little bit maybe cleaner, healthier water for sharing.'",
        "'speaker_0': 'So that we make.'",
        "'speaker_1': 'A case for that.'",
        "'speaker_0': 'We could try. But we're we're committed to making sure that we maintain it and take care of the parks.'",
        "'speaker_1': 'Okay. So they wouldn't they don't have any responsibility towards us.'",
        "'speaker_0': 'We're holding them to the ones we can.'",
        "'speaker_5': 'All right. So.'",
        "'speaker_1': 'All right. Thank you. I was just checking on that.'",
        "'speaker_6': 'All right.'",
        "'speaker_1': 'Looks like all the questions and comments are finished. I guess it's time for a roll call on come on, Council 145.'",
        "'speaker_3': 'Or take a bow. Rob Shepherd Brooks Hi Brown. I thought I heard two. I can reach Laming. Hi, Lopez. Hi, Monteiro. I never I Madam President.'",
        "'speaker_1': 'Hi, Mr. Secretary. Close the voting announce the results.'",
        "'speaker_3': '12 eyes when they.'",
        "'speaker_1': 'Go eyes one nay counts Bill 145 does pass. Okay, that is all of the ones that were called out. So I think we're ready for the block votes count from Lehman. Would you let me first say that all other bills for introduction are ordered, published and Councilwoman Lehman, would you please put the resolutions on the floor for'"
    ],
    "Amends the Denver Zoning Code per an omnibus package of substantive, clarifying and corrective changes through the entirety of the code. Amends the Denver Zoning Code per an omnibus package of substantive, clarifying and corrective changes through the entirety of the code. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 2-18-14.": [
        "'speaker_1': 'Okay. It has been moved and seconded. The public hearing for council, though one or two is open. May we have the staff report? Miss Pop.'",
        "'speaker_5': 'Good evening, Michelle, of Community Planning in Development. Also here with me as Tina Axelrod and Michael Flaherty. So we're presenting a package with lots of changes to the Denver zoning code for clarifications and also substantive changes. We began in November by releasing a public review draft.'",
        "'speaker_5': 'So before we began the formal adoption process, we spent a lot of time with the community to walk through all the changes. We presented info items to planning board to the City Committee, which were then posted on Channel eight for folks to watch.'",
        "'speaker_5': 'And we hosted office hours, attended I and C really just to have that input before we began any formal process. In January, we, we did begin the formal adoption process. We went to the planning board and had a public hearing and that was approved unanimously, recommended approval unanimously.'",
        "'speaker_5': 'Based on that initial public review process, we actually took a number of things out. One, we needed more time to work with the community on the changes. We also found some new changes that we added based on public feedback, and those are all reflected in the package that you received.'",
        "'speaker_5': 'And we do have some comments of support as well for the package. So we've organized the text amendment into these groupings and we'll walk through just a summary, some highlights of the text amendment. Not not each change. You have each change in your packet, I believe, and I'll start with group one, which are design standards, and these'",
        "'speaker_5': 'are located in Articles three through nine of the Denver Zoning Code, and they include building forms and supplemental design standards, alternatives and exceptions. So a few examples here of changes we're making that are minor. We allow window wells to encroach into required setbacks three feet.'",
        "'speaker_5': 'If you have a setback. So a lot of times this is your single family home. The code also regulates the dimension that's running parallel to the home and limits it to four feet today. And we're proposing to increase that to six feet.'",
        "'speaker_5': 'And that's based on feedback from developers who have a new window product that they want to install. So this is a great, great change for that. We're also adding a number of graphics to our commercial mixed use sound districts.'",
        "'speaker_5': 'So you'll see here on the left page, this is the shop front building, farm and shop front. In the code today, there's one building that you can look at and it's a box. And it's sort of confusing that you actually can build a lot of different things under shopfront.'",
        "'speaker_5': 'So we added these graphics you'll see at the top a townhouse product. Single family, yes. You can construct single family in the main street zone districts using the shopfront building farm and on on down showing various building formats.'",
        "'speaker_5': 'This was based on a lot of feedback from folks using the code, not understanding that illustrative. And so we're providing more illustrative that actually look like buildings you might actually construct and see on the ground. Group two are general design standards, which which apply to all zone districts.'",
        "'speaker_5': 'This is Article ten of the code and its includes parking and loading, landscaping, fences and signs. Some changes that we're making in here that are substantive. One is to the bicycle parking requirement. So in 2010, we added bike parking requirements in the Denver zoning code.'",
        "'speaker_5': 'There's an exception, however, if you're doing a change of use that you're exempt from adding bike parking. When we were looking at this, we thought, since it's so easy to add the bike parking because you can put it in the right away if you don't have room on your lot, etc. It was important to actually still require'",
        "'speaker_5': 'that bike parking, even if it's just a change of use. So you'll see here this is a very old building. It has a new cafe in it. And you can see that bike parking has been accommodated for this building.'",
        "'speaker_5': 'A flexible use of accessory parking. This is a great addition to the Denver zoning code. So this is an office building you're looking at. And then at the end of the block, there's a very popular restaurant in Low High.'",
        "'speaker_5': 'And what they're able to do under the Denver zoning code is lease out those parking spaces for that office building when the office building is closed. So folks are really liking this provision, especially restaurant owners. However, they want to have some assurance from the city that they have approval and the only way to do that is to'",
        "'speaker_5': 'require a zoning permit. So this change actually came from them. They want to come in and obtain that zoning permit so that they have proof that they have approval before they enter into any private agreements with property owners.'",
        "'speaker_5': 'We're also eliminating references to valet, which is regulated by public works. Another change is we have when you're within a quarter mile of rail transit and you want to do surface parking, we restrict you to 110% of the minimum parking required in order to encourage structured parking and more active uses at our station areas.'",
        "'speaker_5': 'We are proposing to change this provision such that we would allow one space per dwelling unit even if it exceeds the 110%. This came from a developer working in the urban center neighborhood context when it was only three stories, so they couldn't quite build the structured parking and they also weren't able to get one space per dwelling'",
        "'speaker_5': 'unit under that 110%. So we feel that this this minor change still maintains the intent of that standard. Additionally, we are adding senior housing parking reductions to the Main Street Zone districts, and we're extending the 25% reduction for required parking when you're within a quarter mile of transit to the industrial and master plan zone districts.'",
        "'speaker_5': 'So the map on the screen, if you can see it, there's some IMAX around this station area and they don't have the allowance to for that 25% parking reduction. But the property just to the east, which is in the urban center, does so this just kind of evening, the playing field.'",
        "'speaker_5': 'We have some minor adjustments to fences, adding some graphics here to help understanding whether you can have a four foot fence or a six foot fence and where. And more importantly, in the master plan zone districts, we are allowing a six foot fence between the primary structure and the primary street when the primary structure is orienting toward'",
        "'speaker_5': 'open space. So this is a unique condition in our master plan zone districts. This came from builders working in Stapleton, primarily where the open space actually functions as the primary street. And the street, which in the zoning code is called Primary Street, is functioning as a side street.'",
        "'speaker_5': 'So this kind of just allows us to recognize that unique condition to the signs. We're adding an allowance for projecting signs and this is pretty exciting today. You have to go through the part of adjustment variance process to get these great pedestrian oriented signs.'",
        "'speaker_5': 'So we're going to add these to the mixed use zone districts, and they'll include all the limitations that you see in the Golden Triangle Zone District today, which which allows projecting signs. And I'll now turn it over to Tina.'",
        "'speaker_6': 'Hi. Tina Axelrod for community planning and development. Pick up with the next group which deal with allowed uses in the code to this is you'll see these provisions in the use tables and articles three through nine and then in article 11 which has all of our use limitations.'",
        "'speaker_6': 'Again, just highlighting a few of the changes in the package. One is revisions to the allowance for certain nonresidential uses in residential zones, provided that the use goes into an existing business structure. This has been on the books for a long time.'",
        "'speaker_6': 'Recently, I think we've seen a bit of a resurgence in people applying for this use, and it's brought out a number of of a need for clarification. For example, we never really defined what a business structure was and wasn't.'",
        "'speaker_6': 'So this amendment does clarify that. It's a structure that was originally constructed for 100% business use, not mixed business and residential and not churches. And that's how we've been interpreting it and applying it over the years. But to get it into the code just makes it clear at this point for for everyone.'",
        "'speaker_6': 'We've also added back more clarity to how much you can expand the existing building structure, if at all. And you'll see in the photograph this is pretty typical. Might have a small office building on the corner of what's otherwise a residential zone will allow you to do minor modifications to the building, put in new doors and windows'",
        "'speaker_6': ', do things that essentially are nonstructural or increasing. You cannot increase the volume anymore. I mean, the whole point is to accommodate reuse of the existing structure, not allow you to morph into something two times bigger than what you were originally.'",
        "'speaker_6': 'Another highlighted change that a substantive change is a wholesale package of changes to make it easier to establish small scale breweries, distilleries and what's the other one? Wineries in are manufacture under our manufacturing uses in more places in the city under a set of controls to make them feel like an act like more like other uses allowed'",
        "'speaker_6': 'in our mixed use commercial zone districts. We will allow these. So for example near residential zones, just like a restaurant or bar or another land use with the potential for impacts on surrounding neighbors, we've added limitations. If you're going to put in a new craft brewery, you're going to operate under the same limits on hours of operation'",
        "'speaker_6': ', on outdoor uses, again to mitigate potential impacts. So that's a major change.'",
        "'speaker_5': 'We had a lot of.'",
        "'speaker_6': 'Interest from the industry last year and the year before to accommodate the growth that we're now seeing. And this will take us even further. Another new use that's been added to the code is a new type of home occupation.'",
        "'speaker_6': 'These are home businesses, businesses you can run out of your house under a certain set of limitations. We are clarifying that a new type of permitted use would be food preparation. If you want to run a catering business and use your home kitchen and assuming you can bring it up to other types of codes and safety regulations'",
        "'speaker_6': 'that are out there, you can do that out of your home and not have to go to a commercial or commissary kitchen to do it. A point of clarification. You cannot sell the food from your from your home under this type of business.'",
        "'speaker_6': 'The next group has to do with changes to parking requirements. And just this is just focus on the amount of parking required. We had a few changes here. We revised some parking requirements for high schools to better distinguish them from middle schools because as you can intuitively know, there'll be a greater demand for parking spaces for students'",
        "'speaker_6': 'who are old enough to drive and are high schools rather than our middle schools. We reduced the minimum parking requirement for Artists Studio that use had been combined with a number of more intensive or a number of uses that have more intensive parking requirements.'",
        "'speaker_6': 'And upon further study, we determined that we we were requiring or over parking artist studios. So that's been reduced. And similarly lodging within a campus district like putting a hotel on the campus of a college or university. We had this scenario occur, had a lot of discussion and reevaluation of what the park bicycle parking demand and how'",
        "'speaker_6': 'can be accommodated there. So you'll see a reduction in bicycle parking as a result of that study. Group six is all of our zoning procedures. This is Article 12 of the code. And you'll see from the list that the changes have touched a number of different procedures that obviously we use every day.'",
        "'speaker_6': 'So we had revisions to zoning permit process, administrative adjustments, rezonings, a few fewer GDP's regulating plans, compliant uses and structures across the whole gamut. I'm just going to hit and highlight a few of these. Again, we're here to answer any questions later if you want more detail on the rezoning side, something close to home for all of'",
        "'speaker_6': 'you. We clarified and and codified the charter authority for any individual council member to initiate a MAP amendment to the code. So if you'll recall, very recently we've had a number of requests for resolutions from the entire Council to initiate a rezoning sponsored by one of one of you.'",
        "'speaker_6': 'That was a process step that was pretty unique post 2010 because we've kind of inadvertently removed your right just to bring it forward on your own initiative. So we had to go through that resolution process. This will clear a path for any of you to bring forward without having to take that additional step.'",
        "'speaker_6': 'And you've got the charter given right. We just unintentionally made it harder for you through the zoning code and other rezoning changes. Again, you see a lot of these. So it's it's important for you to realize some of these changes before a zoning rezoning application can even become a rezoning application and move forward.'",
        "'speaker_6': 'There are some minimum requirements and one of them is a minimum land area. So you have to consolidate enough land for to in order to ask for a certain zone districts in our code to move forward. We've taken a hard look at this and we continue to evaluate our minimum area requirements.'",
        "'speaker_6': 'But for this package, here are some of the changes that have come out. One thing that we saw over and over was the minimum area requirement is kind of getting in our way of moving land from old code to new code.'",
        "'speaker_6': 'Our goal overall is to try over time to get us to get all our land into the new code and operate under one code.'",
        "'speaker_5': 'But we have a lot.'",
        "'speaker_6': 'Of former Chapter 59 zone lands out there. Some of them are very small and wouldn't necessarily meet our minimum area requirement. We didn't want that to create a false barrier to getting re zoned into the new code just by virtue of the fact that they had waivers or conditions or so.'",
        "'speaker_6': 'We've eliminated the minimum requirement. They still get evaluated for plan, consistency and all the other criteria that you're familiar with in others. For other rezonings to other zone districts, you can see we've reduced or eliminated the minimum requirements.'",
        "'speaker_6': 'Again, based on reevaluating what we were trying to do, we're trying to implement our plans. Some of these zone districts operate at a much smaller scale, even an individual property scale still consistent with what their intent is. So where we could we eliminated it.'",
        "'speaker_6': 'Administrative adjustments are a great tool in our code for folks to seek some variation from strict application of the zoning standards on a case by case basis through a staff review, rather than having to go to the Board of Adjustment for a variance.'",
        "'speaker_6': 'So here with this package, we've added a new area where property owners can ask for an adjustment, and that's on some of our narrower residential lots on this interior setback lines to be able to ask for a or decrease in setbacks no less than three feet.'",
        "'speaker_6': 'But yes, maybe if they have a five foot or seven and a half foot requirement, some reduction there, again, has to be based on a finding that that reduction would be or would result in a more in a in a setback that's more compatible with what's already in the neighborhood.'",
        "'speaker_6': 'So that's a great change for homeowners. Then our final group of changes, Group seven were two, Article one, which has our general provisions and of most interest here are zone provisions. We made some changes to the allowance on the creation of flag lots and you can see from the picture what we're talking about is this type of'",
        "'speaker_6': 'zone lot where you have a narrow flagpole between where really you're putting the main use of the land and your access to a public street. Then we clarified what these really were meant to do. It never had an intent statement, so it was never clear why we allow these in the first place.'",
        "'speaker_6': 'Generally, they respond to some historic or a subdivision pattern that was created that resulted in especially deep lots that now 20 years later or 30 years later. Don't quite respond to market demand. So we have put some limits on it to assure that true to the intent, we're only capturing or allowing these things where we have those'",
        "'speaker_6': 'especially deep lots and we do have them. We have them in Southwest Denver, we have them in Central Denver, we have them in Northwest Denver. So with all that, what we're asking you to do today is to take this package of zone amendments, hold them up against the review criteria for text amendments, which I'll briefly go through'",
        "'speaker_6': 'and hopefully at the end of this evening be able to make a final decision. You must find that the package taken as a whole is consistent with the city's adopted plans and policies. Staff's finding in this case is that this entire package is consistent with the plan, that that these amendments will assure that we remain flexible and'",
        "'speaker_6': 'responsive of current and future land use needs in the city. The second criteria is that it further the public health, safety and general welfare staff again found bombs and fines. Getting my verbs mixed up that these changes again help to provide clarity and predictability for facilitating planned and desired private businesses, changes in industry and redevelopment.'",
        "'speaker_6': 'And that through these amendments, we continue to consistently attempt to implement our adopted plans. And finally, the last criteria that the package results from regulations that are uniform, we do find that the regulations will result in uniformity in the treatment of buildings and land uses within the same zoned district and that overall bigger picture.'",
        "'speaker_6': 'The amendment includes improvements to assure greater consistency in the application of zoning regulations, which of course improves this, improves the city's ability to administer and enforce the code uniformly. With all that, CPD recommends approval. And of course, Michael, Michelle and I are here to answer any more specific questions you may have.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Tina. We have two speakers this evening and I'll just call them out one after another. Joel Noble.'",
        "'speaker_0': 'Good evening, counsel. My name is Joel Noble. I'm president of Curtis Park Neighbors and I live at 2705 Stout Street. You have a letter in your packet from Curtis Park neighbors supporting this omnibus text amendment and laying out several the many reasons why we believe you should support it as well.'",
        "'speaker_0': 'Broadly, this is a package of bug fixes. My computer science person, someone asked me in a local paper, what's what's going on with this? I said, it's it's bug fixes. It's the little things that haven't worked right that they're putting all together rather than dealing with 1 to 1, one on one and passing in Curtis Park.'",
        "'speaker_0': 'Some of those fixes allow very important things like row houses that are on corners. There's something called the primary street determination, and the short edge of your property might be your primary street. And rather unexpectedly, that's the edge where you're happy, where your doors have to be.'",
        "'speaker_0': 'Even though for a row house going along the side street is where you'd want all the doors. So that's fixed in this four hour context. The bicycle parking requirements are very appreciated. Right next door to us in on Welton Street are the commercial mixed use districts.'",
        "'speaker_0': 'There's been some confusion about all the different building forms and do I have to pick one and I have to stay with that forever? Well, the this set of amendments simplifies the building forms pretty dramatically. There's one provision in here that specific to Curtis Park.'",
        "'speaker_0': 'It was referenced just briefly in the presentation in 2010. We worked really hard to make sure that the zoning that we got allowed accessory dwelling units. And it does. And in 2011, people started trying to build them and said, oh, this isn't working right.'",
        "'speaker_0': 'Because we have exceptionally narrow lots. And the problem with the the out of the box provisions for accessory dwelling units is they have something called a bulk plain. And if you own exceptionally narrow lot and you have a bulk plane, you can build a garage with a hallway on top of it.'",
        "'speaker_0': 'So since 2011, we've been saying, you know, could we do this? We have a strong desire for building accessory dwelling units so that people can age in place, so they can move family here to live with them, but not to close with them.'",
        "'speaker_0': 'And and also to increase the affordability of the neighborhood. Central city neighborhoods throughout the country are becoming more popular and prices are going up. And if we have the ability in a compatible way to have some smaller units, those smaller units will inherently be more affordable and keep the mix that we so treasure in our neighborhood.'",
        "'speaker_0': 'So after presenting a letter to CPD asking for this and then responding to their requests for a photo essay, demonstrating that this was in fact continuing an existing pattern of what were called carriage houses in the neighborhood. They agreed.'",
        "'speaker_0': 'And as part of this, that's specific to Curtis Park. So thank you.'",
        "'speaker_1': 'Thank you, Mr. Noble Sekou.'",
        "'speaker_7': 'Yes. My name is Chairman Sekou. Founder of the Black Star Action Movement for Self-defense, an advocacy group for poor, working, poor and homeless people. First of all, we like to commend the city planning department for taking on this task.'",
        "'speaker_7': 'And at the same time, our concern is that because it's so overreaching, okay. And there's so much stuff in this, if we just get real honest about this. We can have a show of hands that will say, hey, I read this thing and I understand all the implications of this thing and therefore I'm going to vote for'",
        "'speaker_7': 'it or I'm not going to vote for it. See, that ain't gonna happen because nobody had time to do none of that kind of research. All right. And this thing is so broad. All right. And outreaching that we need to look at the details of this thing before we vote on this thing.'",
        "'speaker_7': 'All right. Which means that sometimes we got to slow down and do our homework. You know, kind of like what we tell our kids to do. Take your time, do your homework. Get it.'",
        "'speaker_0': 'Right. All right.'",
        "'speaker_7': 'Because there are some pieces in this that are missing that a glaring. Because when I looked at this thing, I was like, where is poor people in any of this? Where was the outreach in getting us involved in this process where we could even learn that this even existed?'",
        "'speaker_7': 'See? And there are some things that need to be strengthened in this thing, especially when it comes to those accessory units. All right. The poor people need. So we have a place that we can go. So when there's an economic downturn and somebody needs to move into a family, then they don't have to go to a whole'",
        "'speaker_7': 'bunch of this. And then we one bureaucratic mess. So it's okay for them to move a family in and create a permanent structure for them to have without it being. No, Ms.. De none of that in there. All right.'",
        "'speaker_7': 'None of that in terms of how does this work. All right. So to step up and to vote for this thing without doing the research and getting to the fine details of this thing would be a huge mistake.'",
        "'speaker_7': 'Huge mistake. And then there's a cost involved. And then all of this involves how do we engage poor people in the city in the process of doing some of the work that was under construction being part of public work?'",
        "'speaker_7': 'Do this, do that, do that. And we're all now talking about being all of Denver because we're all included. But there was no outreach for poor people in this. There's not one poor organization on this list of community organizations that was contacted to represent poor people.'",
        "'speaker_7': 'So now we're out there picture like we don't exist. What's up with that? Come on. Real. I know we can do better than that. If you don't use your position that the bully pulpit to advocate for that, to win the mayor and the city departments come in here and do that and ask for the outreach of including'",
        "'speaker_7': 'everybody in this. Then we're we're missing our duty because we're supposed to represent everybody in the city. All right. Not just some classes or privileged groups, but everybody got everybody involved and engaged in this. Because in order for this thing to work, everybody needs to feel a part of this thing.'",
        "'speaker_1': 'Your time is up.'",
        "'speaker_7': 'So I want to thank you very much and thank you.'",
        "'speaker_1': 'Okay. That concludes our speakers now questions from council. Councilwoman Fox.'",
        "'speaker_4': 'Thank you, Madam President. I have questions, I think, for Tina. Tina, on the slide, one of the slides you put up, it was about eliminating the maximum area for R0. And I'd like to have that put in more context for me.'",
        "'speaker_4': 'Where are you stuck? Because I presume that we have changed much. Of what? Anything that fell under the new zoning code wouldn't still be called R. Oh.'",
        "'speaker_6': 'This is a diff. Okay with me. Are you done with your question? I don't want to. Please go ahead. Okay. So in this list, R zero is the zone district that the R stands for residential. The it's actually not R zero.'",
        "'speaker_6': 'You got me. This is r o. It's actually a letter, not a number. So R0 stands for residential office. It is not the same as R zero under former Chapter 59, which was a single family zoned district. R o and the new code is a residential office, so it's a higher intensity residential zone that also allows office'",
        "'speaker_6': 'uses. We have that allowance under R for R three and the old code, and this is a continuation of that policy in the new code. So not the twain shall meet.'",
        "'speaker_4': 'Thank you so much. I was getting confused there. The second question I have, I don't know. Let me ask you. And then Mike might need to chime in. Has concerned the domestic employees not counting toward the maximum number of people in the in the household.'",
        "'speaker_4': 'And I see that there's a reference to moving a definition in to or from Chapter 59 wasn't into this. I'd like to know what is the definition? And I put it in the context that one of the most frequent complaints we have is too many people in one house.'",
        "'speaker_4': 'Are we aggravating the situation by this? These are not homes. Ordinarily, that would be considered hiring domestic employees in the usual sense.'",
        "'speaker_6': 'So Michael's looking up our definition of domestic employee, which was carried from former Chapter 59 back and back into the Denver zoning code. It had been overlooked and it was brought to our attention through a number of zoning reviews in the intervening years.'",
        "'speaker_6': 'It had been a policy under the former code not to count domestic employees who live full time in your home towards the total number of unrelated persons who come live in your household has nothing to do with with really, you know, what is a household?'",
        "'speaker_6': 'There are limits, as you know, on the number of unrelated people who can live in a single household. So we realized during this package review and the collection of of changes that we had discontinue the policy, if you will, that had been in place for many years by being silent on it.'",
        "'speaker_6': 'So therefore, if you had a live in help or caretaker domestic help, it would have counted towards your three or four maximum unrelated. And we didn't want to ding someone from that. The definition, again, pretty much straight from the previous code, is a person or persons living in the household of another, paying no rent for such occupancy'",
        "'speaker_6': 'and paying no part of any household utilities where such person or persons perform household and or property mount maintenance duties for the general care, comfort and convenience of the household occupants. Today, answer your question at this point or did he need more?'",
        "'speaker_4': 'A domestic employee does not have to receive compensation.'",
        "'speaker_6': 'It does not talk about comments. It just talks about that they're not paying rent. It's not like a tenant. So whether they receive compensation in money or or some other means. We don't speak to that. But the point is, they're not on the same level or treated legally as a tenant would be who is expected to pay'",
        "'speaker_6': 'rent of some sort.'",
        "'speaker_4': 'Madam President, can I ask Mike then? Mike, can you tell me from an anti-choice standpoint or any of the regulatory reviews, then if a person says there's just too many people in that household and indeed a couple of them are being claimed as domestic employees, but you just really believe that maybe that's not quite the case.'",
        "'speaker_4': 'How are you going to handle this, or are you.'",
        "'speaker_0': 'The definition that is now in the Denver zoning code gives us a little more back background to clarify exactly what the status of that person is, whether that person is a tenant or a rooming and boarding person in the house versus somebody who's actually not paying rent and exchange for living is providing household domestic service.'",
        "'speaker_0': 'So I kind of get that the intent of that definition is to clarify just what that person is doing and to try to give us something to test against the relationship of that person to the rest of the household.'",
        "'speaker_0': 'Thank you. You're welcome.'",
        "'speaker_1': 'But is that the last question? Okay. Thanks, Councilwoman for Councilwoman Connie.'",
        "'speaker_5': 'Thank you, Madam President. My first question was about the house facing open space and the fence on the side. So you mentioned that this idea came from Stapleton, where we kind of have, you know, the main housing type in the city that faces open space, the commons, I think they call it.'",
        "'speaker_5': 'So let me ask this change only applies to the new zoning code. It's my understanding that portions of Stapleton are still in the old zoning code. So can you clarify for me how much of Stapleton is still in the old zoning code?'",
        "'speaker_5': 'No, I can't give you that number here tonight. Sorry, I have to get, like, a sense, like significance. Yeah, it's significant. There are significant portions that were not rezone to the new code. However, they're under a completely different set of rules, so they don't currently experience this problem.'",
        "'speaker_5': 'We inadvertently created this problem when we wrote the new zoning code. Okay, that's helpful. That's what I was trying to go. Second question is about we have a staff summary, which is, oh, it is from you guys. Okay.'",
        "'speaker_5': 'I was just thinking it might be from our staff, but page 16 and I don't remember this being one you mentioned in the presentation. So it's about trailer courts and trailer parks. So it talks about limiting the continuance of nonconforming trailer courts and it gives some conditions where you then I think the correct words to state is'",
        "'speaker_5': 'lose you lose your ability to continue non conformance. And so some of these make sense to me, right? Which is if you increase the number of trailers, right, you're adding if you reduce the space between trailers. But the second the second half does not make sense to me.'",
        "'speaker_5': 'So if you replace an older trailer with a newer HUD who've trailer, which to me sounds like a really good thing to do, we penalize you by losing your status. Same thing if you replace an individual trailer with a newer one that's placed in a permanent foundation, which I would think is probably much safer and much more'",
        "'speaker_5': 'likely to hold up to weather events and other types of flooding or other things that might put a family at risk. And so explain to me why we would discourage folks from upgrading mobile homes by their park, losing its zoning status.'",
        "'speaker_5': 'That that's confusing to me.'",
        "'speaker_6': 'Okay. Let me try to step this out. These provisions only apply to preexisting mobile home parks or trailer parks. We do have those in the city. They became non-conforming in 1956. So there has been an established policy set by councils starting back then with no change in the interim that that is a use that we don't want'",
        "'speaker_6': 'to see expand or grow more permanent than it already is existing on the ground. If you accept the premise of the policy decision behind the treatment of trailer parks in Denver, and that's we're taking that as a given, then anything you do to a trailer park or the individual trailers and the trailer park to make them more'",
        "'speaker_6': 'permanent or to upgrade them. So essentially they're they're not replacing a like for like but replacing an old trailer with something that's going to last a long time, goes against the grain of the policy decision that we'd prefer not to see these trailer parks, mobile home parks continue in perpetuity in the city of Denver.'",
        "'speaker_6': 'So that's why C and.'",
        "'speaker_5': 'D.'",
        "'speaker_6': 'Are are limited in terms of you can replace an old trailer with another old trailer or essentially pre HUD trailer and they do exist on the market out there. But we don't we see that a distinctive change in the character and duration of that use.'",
        "'speaker_6': 'If you replace the old trailer with something that's now certified and manufactured to last a good number of decades beyond today and similar, when you tie them to the ground and create a permanent foundation, you've just added, for better or for worse, more life to that.'",
        "'speaker_6': 'Use that again. If you take if you start with the premise that this is something we wanted to phase out of the city, that's how we got to these limitations.'",
        "'speaker_5': 'I don't want to cross over to my friend and comments, but I guess I mean question for you and it's not as tongue in cheek as it sounds because I just want to make sure. So the idea is that will phase out trailer parks by allowing them to crumble around the people living in them.'",
        "'speaker_5': 'I mean, that's kind of I mean, it's like.'",
        "'speaker_6': 'We've been interpreting and applying these standards unwritten for decades now, and we've got a long history of that. So we wanted to bring it up. You know, it's a little more transparent with more clarity to the park owners and to others.'",
        "'speaker_6': 'We had a big case where it came up in the last year where there was a lot of confusion. So that's our hope now just to, you know, bring into the light what we've been practicing as zoning policy and rules for decades now.'",
        "'speaker_5': 'That's all the questions.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilwoman Rob.'",
        "'speaker_5': 'Thank you, Madam President. I had one question, but I want to follow up on the issue that Councilwoman Kennedy raised, because I think it's valid. It's not a discussion I recall having, but we basically do allow HUD approved manufactured factory homes, and that's not particularly regulated by any zone district.'",
        "'speaker_5': 'We do allow those in the city in a lot of those.'",
        "'speaker_6': 'A lot. You can you can put a manufacturer.'",
        "'speaker_5': 'Still do have to have that that individual lot which can be a constraint to some people.'",
        "'speaker_6': 'But is a source of affordable housing as a product type. Right.'",
        "'speaker_5': 'They are good.'",
        "'speaker_6': 'Products. You have the land or you get the land and it's in a single family. Whatever you can, you can use a factory built home. There's no prohibitions on that from zoning or building in the city.'",
        "'speaker_5': 'Okay. And I assume existing trailer parks are in various zoned districts throughout the city in the new.'",
        "'speaker_6': 'I will let Mike respond to that. And I know generally where they I don't want to take.'",
        "'speaker_0': 'They are, they there's probably somewhere around eight or ten that I can think of. And they're in a variety of districts ranging from residential to business. And I think there's one in an industrial zone.'",
        "'speaker_5': 'Okay. Okay. Thank you. So, Mike, my question that I had On my Radar tonight is on page two of the staff report on primary building forums. It's right in the very beginning, talks about I'm looking primarily in the districts, the zone districts that I have in my district, the new RH zone.'",
        "'speaker_5': 'It talks about replacing the upper storey step back with an upper storey setback. And for the life of me, I don't know the difference between those terms. It's where you measure from. So a setback is measured from a property line or a zone lot line and a step back is measured from the building phase.'",
        "'speaker_5': 'So a step back of 15 feet as measured from where that building starts. Right. You go in 15. A setback would be measured from the zone lot line, which is probably some distance from that block. So basically what you're doing then is removing the upper story step back because I'm assuming the the lower storey, the first floor'",
        "'speaker_5': 'is at the setback. And if if the upper storey has to be at the setback, you're moving the step back. So what was happening? So the step back works well when you want to create one plane, but when you have a home that modulates down the zone lot as it moves to the back yard, the step back'",
        "'speaker_5': 'was still forcing this 15 foot break in the wall. So if you measure it from the setback, you still get it when it's close to the property line. But as you opt to move your building away from your property line for architectural reasons, you're no longer going to provide that same.'",
        "'speaker_5': 'Oh, I see. Yeah. I wish I had an illustration. I apologize. Thank you. Yeah.'",
        "'speaker_1': 'Councilman Ortega.'",
        "'speaker_4': 'Thank you. I have several questions. So let me start with the first one as I've gone through this document. I'm trying to clarify whether there are any new categories. We have this cheat sheet that was provided to us some time ago.'",
        "'speaker_4': 'For those of us who were not involved in the rewrite of the zoning code that is supposed to help guide us. And so I'm trying to figure out whether or not there are any new categories to add to this cheat sheet.'",
        "'speaker_5': 'No. Okay.'",
        "'speaker_4': 'Great. That's good to know. So on the setback the and particularly for properties, you know throughout north and where we have a lot of. These houses and carriage lots in the back. So you have properties that sit right on the zone lot.'",
        "'speaker_4': 'And so I'm trying to understand how either adding on to a house or replacing the home is affected by these. Changes. I know. Some time ago when I was on the council before. If a home that sits on the zone lot burned down, it could be replaced in the same exact place without having to do the set'",
        "'speaker_4': 'back. But I don't know what the case is. If you just want to expand or as you know, we are seeing lots of scrape offs throughout northwest Denver and trying to figure out if in those cases are able to build right up to the zone lot or if they still have to have the setback.'",
        "'speaker_0': 'So one of the big differences in the Denver zoning code from former Chapter 59 is that the required set back distance from the side property line decreases as a lot is narrower. So we have a gradient of setback requirements.'",
        "'speaker_0': 'We also have work carried forward from former Chapter 59, which allows enlargement of a non-conforming structure. When that non conformance is the side setback, that building can be legally expanded when using the non-conforming setback dimension.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'And then the protection for non-conforming structures carries through for any residential structure in a residential zone district. If it's accidentally damaged or destroyed, it can be fully replaced to the extent that it was standing. Non conformance can't be expanded over what it already was.'",
        "'speaker_4': 'So in the same footprint. Yes. Okay. All right. Madam President, I have two more. Do you want me to continue or do you want to call on others and then come back to me? Go ahead. Okay. On the flexible parking issue, help me understand if this only applies to office buildings or is it where it's shared parking'",
        "'speaker_4': '? And you use the example of my old office building actually that was in the picture on 16th Street, across the street from the old Wenger's mortuary, which has lots of businesses in it now. So what I'm trying to understand is if it's another commercial use that's not an office building, how are you all making sure that you're'",
        "'speaker_4': 'not competing for the same parking?'",
        "'speaker_5': 'There's actually a review criteria in there or a performance criteria in there that talks about how you can't be using the same pool of parking because that's required parking for someone else. Yeah. So there are I don't I don't have the language in front of me, but there are provisions in there that, that speak directly to that'",
        "'speaker_5': 'so that we're not creating parking problems with this allowance.'",
        "'speaker_4': 'Great. Okay. And then my last question has to do it's actually with the GDPR and then the regulating plan. And on page 16, it looks like there are proposed changes and the language isn't clear. That helps me really understand what these changes mean and what they're doing.'",
        "'speaker_4': 'So I want you to walk through what the changes are to the GDPR and then also the same to the regulating plan.'",
        "'speaker_6': 'So this is on page 16 of your summary document at the top of the top of the page. Two substantive changes to general development plan provisions are described. The first one, it says it deletes the requirement for a subsequent regulating plan if an approved general development plan does not include designation of primary streets.'",
        "'speaker_6': 'So we thought we had a bright idea at the beginning of the day that we might want to use the regulating plan in cases where you've got a general development plan. It's unclear in the general or just not specified in the general development plan which of the many streets that might be laid out in that GDP is'",
        "'speaker_6': 'under zoning terms of primary street because once you know what your primary street zone that line is, a lot of zoning standards attached to that, like setbacks, like bill twos, like transparency and entrance requirements. So we thought at the time that maybe it would be a good idea that if you didn't specify that in a general development'",
        "'speaker_6': 'plan, that we should require a tool in before site development, that you would you would take to designate on second and third and much discussed.'",
        "'speaker_4': 'So let me just make sure I heard that clearly. Sure. So you're the leading the requirement for a regulating plan only if a GDP has been approved for that site.'",
        "'speaker_6': 'One of the few places where we where the code required a regulating plan was this scenario one of several play scenarios under which we would require regulating plan. So we're just deleting this as a mandatory requirement because we did find in practice that it didn't it wasn't necessary.'",
        "'speaker_6': 'We had other tools that could step in and designate the. Primary streets, most likely a site development plan where you're really we're beginning to lay it all out and that this was adding an unnecessary procedural step and taking time that didn't need to be taken in the development process to do this.'",
        "'speaker_6': 'The second substantive change was just to clarify a clarification that we do have some instances in the preparation of general development plans where the city steps in as an applicant, often to essentially represent numerous land owners of smaller properties or where it would just be unrealistic to expect them to come to the play to do a general'",
        "'speaker_6': 'development plan. So for example, the federal Decatur General Development Plan that just has gone through the approval process, the city was an applicant there and represented a lot of the smaller landowners through that process to lay out a master plan for the infrastructure of the open spaces and some of the key connections and parks improvements and drainage'",
        "'speaker_6': 'improvements. It was unclear and a little bit difficult in the new code to to understand what that meant when it came time to approve the GDP. Could the city kind of in their representative role, just sign the GDP?'",
        "'speaker_6': 'And that would be if they were the applicant and we didn't need to go the hundred and 50 individual landowners to sign the GDP when in fact the city had stepped in to that role. There's a lot of outreach involved.'",
        "'speaker_6': 'And under former Chapter 59, we saw and under our rules and regulations that we had never required those 150 people who were never applicants to sign off. But it was unclear in the code. So we just wanted to make it absolutely clear and aboveboard that the GDP's executed by the applicants and not by all the owners in'",
        "'speaker_6': 'this scenario. So I'm sorry if that's confusing, but in practice, in the short answer is it removed a procedural barrier to a practice of the city. Being an applicant which had been in place since GDPs were adopted, that we inadvertently took away.'",
        "'speaker_4': 'Okay. Can you speak to the regulating play?'",
        "'speaker_6': 'Sure. So also on page 16 of your summary, we have a few changes, one substantive change in a few, just usability and clarification changes to the regulating plan procedures in Article 12. One thing which is we have in all our zoning procedures in Article 12, when it comes time to make a final decision, there's typically three choices'",
        "'speaker_6': 'you have as a decision maker. You can approve it, you can deny it, or you can approve it with conditions attached. Well, that last approved with conditions attached was missing from the choices that the final decision maker on a regulating plan had.'",
        "'speaker_6': 'So that went against the grain of of giving that option to the decision maker. So we just put that back in for the or put that in for the regulating plan.'",
        "'speaker_4': 'So just to make sure I understand what you're saying correctly, you're attaching those conditions to the actual free zone.'",
        "'speaker_6': 'No, this has nothing to do with the rezoning. This is just the process of reviewing and approving a regulating plan, which comes after a rezoning and typically before site development, where it lays out more specifically the range of choices you have to implement.'",
        "'speaker_6': 'This already approved zoning you have on the ground.'",
        "'speaker_4': 'But just to be clear, the regulating plans are, as I recall, with one that came forward between the applicant and the community, wasn't in agreement with the city.'",
        "'speaker_6': 'I don't know what you're referring to, but all regulating plans that we've approved through the process described in the zoning code are between the landowner, developer and the city. It's a binding agreement or a plan between those two parties.'",
        "'speaker_4': 'So the provisions that are in the regulating plan have the effect of enforcement?'",
        "'speaker_6': 'Yes, they do. They're regulatory. Okay. So that was just a clear, you know, to give that option to our decision maker. And then the other changes were just clean up, essentially. You can see them listed there. Did you have any specific questions on the floor there?'",
        "'speaker_4': 'No, I just remember we had one regulating plan that came forward that was part of a rezoning. And that's what I remember.'",
        "'speaker_6': 'That was it was a condition. Two of the research hall. A regulating plan. Yes, you're right. There was a.'",
        "'speaker_4': 'Case it was an agreement between the developer and the community, as I recall, that.'",
        "'speaker_5': 'So the neighborhood didn't like it?'",
        "'speaker_6': 'No, that was what I.'",
        "'speaker_4': 'Remember was that it didn't have the effect of of law or enforcement, because in in this particular case, the community had had basically worked these things out that they wanted to see incorporated, but there wasn't any way to ensure that they were enforced.'",
        "'speaker_4': 'And if the land had been sold, there was no way to ensure that those provisions carried with the land to a new purchaser.'",
        "'speaker_6': 'So there's a bit of mixing of of of things there. But some of what you're saying, you're absolutely right, some of which you're portraying is a little off from the sequence of events that happened. There was a rezoning, there was a condition.'",
        "'speaker_6': 'It was a rezoning with a condition. The condition was prepare a regulating plan prior to site development, according to the Denver zoning code. That's all it said. So that was packaged with the rezoning. And so you did see that condition.'",
        "'speaker_6': 'But what you didn't see were were the final specifics of the of the details of the regulating plan. I think as a courtesy, the applicant at that time brought forward where they were in the process of preparing the regulating plan, which is pretty far along.'",
        "'speaker_6': 'So you got a taste of what is in a regulating plan. The requirement for the condition arose out of the fact that the zoned district, as it stood, didn't fully implement our adopted plans. And the regulating plan condition was a tool that we had available for our use to assure a better fit between the ultimate rezoning and'",
        "'speaker_6': 'the and the limits of that zoning district. An implementation of a recently adopted plan. Okay.'",
        "'speaker_4': 'So I'll. I'll just let everybody keep going. Thank you. And see if I have additional questions.'",
        "'speaker_1': 'Good choice, Councilwoman Shepard.'",
        "'speaker_5': 'Thank you, Madam President. So I don't know where it is in this, but can you me to the part about the the spirits and the the small scale manufacturing of spirits, wine and beer.'",
        "'speaker_6': 'Okay. So in your summary document, which might be the easiest place to see the summary of those changes, it's on page. Okay. Page ten. This was a substantive change described to Article 11, which has ah, which was a part of the group Newsies.'",
        "'speaker_6': 'So you can see under primary uses industrial manufacturing and wholesale. Number one, that whole list of changes there relates to the effort and the codification of a greater allowance for small scale wineries, breweries and distilleries in the city.'",
        "'speaker_6': 'We did that through a variety of paths. We created new definitions of essentially what a small scale type of operation would be and the least impactful of that smaller scale. We could fit into a definition of custom manufacturing along the lines in terms of productions of what a brewpub might produce in a year that small but without'",
        "'speaker_6': 'the food and everything, just the production side, that small scale of a brewery became a could be fit under custom manufacturing. And then we made sure the custom manufacturing was allowed. And so in districts to allow this use where we allow Brewpubs, for example, we looked at we have three levels of manufacturing uses custom, general and heavy'",
        "'speaker_6': '. Previous to this proposed amendment, the only way you can get a full blown brewery, winery or distillery was to go into the heavy manufacturing use category, and that's only allowed in a very few parts of our city that are zoned industrial.'",
        "'speaker_6': 'So by carving out small scale operations, fitting them into the definition of custom manufacturing and general manufacturing, distinguished by the amount of production we could allow the more places in the city. So that's one we did. And then where.'",
        "'speaker_5': 'We.'",
        "'speaker_6': 'You know, acknowledge that we now could have a brewery winery distillery that may want to operate in our smallest neighborhood. Commercial are our twos or threes where we have some of that embedded in residential neighborhoods. We added limitations similar to how we treat restaurants, bars, whether it's an outdoor patio or, you know, any type of entertainment.'",
        "'speaker_6': 'They're subject to the same limitations on ours. Their lighting has to be turned off at a certain hour. And those types of things, if they want to do an outdoor tasting or seating area accessory to a brewery, distillery or winery that's acknowledged as an as an allowed accessory use.'",
        "'speaker_6': 'But you've got to go through the same process that a restaurant patio or outdoor eating area, you might have to go to the boa if it's really close to a residential use. Otherwise we'll limit you on hours and placement and and other things like that.'",
        "'speaker_5': 'I'm assuming for the places that have a tasting area that there's no food requirements.'",
        "'speaker_6': 'Yeah, this is different than an outdoor eating area which we have listed separately. So this will just be an outdoor seating slash tasting area.'",
        "'speaker_5': 'So, you know, I'm not sure, you know, there's a particular place that's operating in my district that might fall into this category. Now, I'm not sure if it would, but operates more like a bar excuse me, operates more like a bar, but doesn't have food on site.'",
        "'speaker_5': 'Food trucks come sometimes. There's. Sometimes the food trucks are not located where they should be. And then there's these, you know, conflicts between protected zone districts. The food truck slash food service thing that customers are wanting, you know, and it gets hairy.'",
        "'speaker_5': 'So I'm just wondering if you can enlighten me on any more so that because typically people like to eat when they're drinking. Yeah. Well.'",
        "'speaker_6': 'This category of yours that we've sliced out of the heaviest of of production facilities is all about production. And it can have, as an incidental or secondary use, an accessory use. It could have a tasting room inside. It can have tours, it can do all that.'",
        "'speaker_6': 'It could have a seating area. It could also move those functions outdoors subject to these limitations. We're dealing with what happens on private property with these zoning changes. So food trucks that are allowed through other combination of policies and rules on the street in front of it are not going to be affected by this at all.'",
        "'speaker_6': 'Okay.'",
        "'speaker_5': 'That's kind of what I was trying to clarify or, you know, or food. Yeah.'",
        "'speaker_6': 'If they want to serve food, then really you're we're looking at a combination use of restaurant slash, bar slash manufacturing or a brewpub. If you're brewing beer or, you know, it becomes another use once you start serving food.'",
        "'speaker_6': 'Okay.'",
        "'speaker_1': 'Okay. Thanks, Councilman Lopez.'",
        "'speaker_0': 'Thank you, Madam President. I just wanted to ask a general question now. We were talking about signs. I forget I'm not bringing it up when we were actually talking about it in committee, but we weren't talking about the sign code and looking at those horizontal signs.'",
        "'speaker_0': 'Do we have to address the mural signs now? Because a lot of those are are actually violations of the zoning code when you do a mural sign. But they worked back when because you can see the evidence of them on our walls and they're actually pretty catchy and they're vintage and other vintage is cool.'",
        "'speaker_0': 'Again, we may want to reconsider that. And also because I have a district where mural art is also a cultural thing, where the signs are cultural and where they create a sense of vibrancy, a sense of place. And you go to L.A., you look at Latino urbanism in L.A., and that's what it's about.'",
        "'speaker_5': 'So there's a few different flavors when I hear the term mural, right? So there's pure art where there is no logo, there's no signage that's allowed. Zoning doesn't get involved, right? If you're doing our zoning, it's not a sign, right?'",
        "'speaker_5': 'As soon as you start to incorporate signage, there are provisions in the code, so it gets treated like a sign at that point. There's one section specifically about art that incorporates a logo and that has its own set of provisions.'",
        "'speaker_5': 'If you meet that, that's your set of rules. But then if you're purely just a sign that's also artistic, you start to follow all the sign code provisions. As you know, we hope to do an overhaul of the sign code, knowing that there are many parts of it that are broken.'",
        "'speaker_5': 'This was one sort of minor fix that we did in the you know, until we can do that. But I think that would be part of that package is looking at when it's more artistic or culturally relevant to a neighborhood, what are the rules and regulations for that type of sign?'",
        "'speaker_0': 'And I think that I mean, that's that if I may add, you know, that is what is missing. And I think that's where we are. We don't get it right and we don't adapt to the culture in our city.'",
        "'speaker_0': 'And I think when you look at some of these other cities, what makes them that city is that culture. Right. And you look at some of these districts, you know, I would rather see a mural sign, if you will, and some crappy plastic signage just hanging off of a building.'",
        "'speaker_0': 'I think it's much more tasteful.'",
        "'speaker_5': 'Right? I don't disagree.'",
        "'speaker_1': 'Thank you. Thank you, councilman. Councilman Brooks.'",
        "'speaker_0': 'Thank you. I have two questions. And I don't I don't know who wants to take this one. We have one of the most complicated to two areas, very, very complex. One, I think you're you're kind of getting to the D.'",
        "'speaker_0': 'S zoning in here. And the other one is a larger conversation about four storey zone districts, which you don't have in the city. But was that ever a part of the conversation at all? And here's why. As we're looking, there is a certain rezoning in the Skyland neighborhood, and it's in a residential area, and I'm sure you'",
        "'speaker_0': 'guys are aware of it. And the neighbors would support a four storey, you know, zoned district, but they want support of five storey. But in order to get to five. So you got to do, you know, so the so you got to do the five story.'",
        "'speaker_0': 'And so I just have wondered, has there been a demand for that in the communities and development community at all?'",
        "'speaker_5': 'It's definitely not the first time we've heard of a desire for fourth story, and we've been having some creative conversations among staff about different ways to achieve that within the construct that we have in the Denver zoning code.'",
        "'speaker_5': 'So, you know, we'd love to if you want to reach out to our office to talk more about specific cases you have.'",
        "'speaker_0': 'So there's some innovative ways for us to do that. That's what you're saying? Yeah. Okay. I just want to be on record for saying that. And then the little bit more complicated, the DEA zoning is some pate, I think it was page seven and we went work with Kari Buckey before he left.'",
        "'speaker_0': 'We miss him. On this issue, the city has zoning between 18th and 22nd on Welton, which is it's very confusing for some of the individuals who are coming and redeveloping there. And I see that you you did some work here, minor kind of interior parking, landscaping issues.'",
        "'speaker_0': 'But the issue that is still not clear because it's coming from the old eight zoning is whether kind of developers or anyone who is trying to, you know, do any kind of new build has to come before the planning board for a review of their new build.'",
        "'speaker_0': 'And I went round and round with Kerry on this issue because it's not codified in the new zoning. And so I'm just wondering if if we get that taken care of.'",
        "'speaker_5': 'Yeah, I think you might be referring to a supplemental set of regulations, the proposed square design standards and guidelines. So we recently and it doesn't come before council because their rules and regulations we added a map to that document that shows these properties are subject to this document and it talks about the planning board process and the'",
        "'speaker_5': 'various design guidelines. So it's been clarified and well, we should get you a copy so you can take a look at it.'",
        "'speaker_0': 'And when did you guys clarify this?'",
        "'speaker_5': 'I think it went to the planning board in December oh, 2013. Yeah, I think it was the city attorney. I think Carrie actually brought it to our attention in relationship to a project that was happening.'",
        "'speaker_0': 'And the reason I brought it up is because there's, there's two others on districts that are similar to it. And I was just wondering, did we take care of all of them because we're going to come up to this issue again somewhere else in the city.'",
        "'speaker_0': 'So.'",
        "'speaker_5': 'Yeah, and we look forward to the, you know, whatever the rewrite or whatever that is for the Arapahoe Square zoning, looking at all the various documents that those property owners are subject to and streamlining and finding ways to make it as clear as possible.'",
        "'speaker_5': 'Thank you. Yeah.'",
        "'speaker_1': 'Okay. I'm going to close the public hearing now and ask for comments by members of council. Councilwoman Robb.'",
        "'speaker_5': 'Thank you, Madam President. I want to thank staff for one thing, your staff report for addressing my 1258 pages.'",
        "'speaker_0': 'Of zoning.'",
        "'speaker_5': 'Code was very concise. And I also want to say that I.'",
        "'speaker_6': 'Was able to.'",
        "'speaker_5': 'Attend the planning board hearing, I think it was early February and and listened to it was maybe their meeting after the hearing. I don't know. But I listened to their. You know, Joe testified it was a hearing. I listened to their discussion of it.'",
        "'speaker_5': 'And I want to say what a terrific job the planning board did on delving into all the details. Staff is noted that they talk about flag lots, but they also talked about tandem houses. They really picked up on things they were hearing from community outreach, from the board of Realtors.'",
        "'speaker_5': 'I think they did some of our.'",
        "'speaker_0': 'Work.'",
        "'speaker_5': 'In a way. They they really did that. Now, other things have come up tonight. There's always going to be things that we're going to want to delve into further. But they did a terrific job. The other thing I just want to talk about is I think in not every case, but I think in a lot of this'",
        "'speaker_5': 'you are seeing changes that people on council brought to the attention of planning board, like the projecting signs. You know, that was a little too late for the Argonaut on Coal Fax or the new Office Depot, you know.'",
        "'speaker_5': 'And they had to spend the time and the money to go through the Board of Adjustment. But I was really glad to see that in their high school definition, I think might be another one and the parking requirements there.'",
        "'speaker_5': 'So I really appreciate this. The other piece that actually sort of not troubled me because council should have the right to bring forward the rezonings. But I really like the policy when rezoning a larger area of doing the proclamation so that people know that we're doing it and there's just a little bit more notice.'",
        "'speaker_5': 'I understand that it's not required for an individual property, something that is sort of quick and easy. Totally support that. But when you're looking at a broader group of people who may have different opinions, I still think that's good policy, if not mandated by the court.'",
        "'speaker_5': 'So I look forward to supporting this and hearing the rest of the discussion tonight.'",
        "'speaker_1': 'Thank you, Councilwoman Councilman Lopez.'",
        "'speaker_0': 'Thank you, Madam President. I really appreciate the work that's been. I think there's a lot of things that are being caught in this one. I do want to follow up with as an issue, I mean, as we're starting to see these, I really like it.'",
        "'speaker_0': 'I really think it really picks up the the spunk and the funk of local communities. I really like it. You go up and down Federal Boulevard, you go down Morrison Road and you see that right? And I rather see that in plastic banners and also because it doubles as a graffiti prevention tool.'",
        "'speaker_0': 'Right. And their jobs. Right. And it's a way to express themselves. I've seen, you know, we're able to get folks off of the street instead of doing this late at night on some empty fence without permission. Imagine being able to pay somebody to do that.'",
        "'speaker_0': 'And I know there's a lot of businesses that would rather pay to do that kind of art. Does that have their logo on their wall, on their own wall, rather than have to buy a $10,000 sign and keep it lit?'",
        "'speaker_0': 'It's not efficient. It's not energy efficient. Right. So I think we can it's a win win win. The second thing I do want to speak about the trailer parks. I really I like the ordinance language that exists because, you know, we have a better standard of living in the year 2014.'",
        "'speaker_0': 'And some of these trailers are not the kind of trailer parks that you see in other communities where they are double wides, where they are security find it was were well-planned a well-planned site. These are just feet away from each other.'",
        "'speaker_0': 'And in a lot of cases, they're turning into too many slums because nobody can fix them up. Why? Because they don't make those trailers anymore. They don't make the parts anymore. Some of them are made of asbestos. You can on the side and on the bottom, so you can't even touch them.'",
        "'speaker_0': 'I've took in so many folks around the trailer parks in our area. This was all initiated because folks who live in the parks are fed up with what they're having to live with and what they're stuck in. And what we have to be able to do is create a high level of standard, a high standard of living'",
        "'speaker_0': 'for all incomes. Right. I think single family homes, duplexes, apartments, all the other forms that exist in our code that are allowed are a better standard of living. We've had to see Parks shut down because of the units, because of the because they're not safe.'",
        "'speaker_0': 'Because they're not healthy. Right. Doesn't mean that we go around saying, okay, you got to get out. Got to get out, got to get out. But as we progressed decades from now, those things should be pretty much I mean, they're already outdated, but they should no longer exist.'",
        "'speaker_0': 'That standard of living should no longer exist really low. It's not safe. And imagine if a fire breaks out. We still have tornadoes in Denver. God forbid something like that hits. There's nowhere to go. There's no basement, there's no bathroom, there's nowhere to go.'",
        "'speaker_0': 'And we've always heard about this nationwide. You see trailers being thrown around like toy cars. And that's what most of them are. They're still considered vehicles. And some of these cases, they're being sold these homes when they're really being sold a vehicle without a title.'",
        "'speaker_0': 'And it just creates a situation where an area deteriorates, the standard of living deteriorates, and people's health and safety deteriorates along with it. And so, yes, it's a hard decision. Yeah. Does it make us look kind of bad doing it?'",
        "'speaker_0': 'Does it? Maybe it's a kind of getting the bad guy saying, Oh, no more trailer parks. Probably. But better than being in a city that still has that kind of living, that standard of living, that's not safe. That's not secure.'",
        "'speaker_0': 'And watching folks, their health or their lives disappear because of it. I'd rather be the bad guy and say, hey, look, you know what? Trailer parks shouldn't exist anymore in Denver. We have a better standard of living than a person who says, you know what, we're going is going to turn a blind eye on what's happening in'",
        "'speaker_0': 'these trailer parks. God forbid there's a fire or some kind of disaster and we lose lives because we didn't do anything about it on the front end. So I think there's a better standard of living in Denver. We have to keep that.'",
        "'speaker_0': 'We can't let that undermine. And also because we can't let trailers be the cop out for real affordable housing in Denver. That's all. That's all I got to say about that. Thank you.'",
        "'speaker_1': 'Okay. Thank you, Councilman. Councilman Leavitt.'",
        "'speaker_0': 'Thank you, Madam President. I won't belabor this. I'll just take a moment. I just want to thank the folks at CPD for the fantastic amount of work that went into putting this together, as well as previous text amendments and previous text amendments and previous text amendments and previous text amendments.'",
        "'speaker_0': 'When we passed the new zoning code in 2010, it was a gigantic document. We all paid an enormous amount of attention to it, focused on it, worked and worked it over for months and months and really years and years.'",
        "'speaker_0': 'And since then, CPD has kept faith with the knowledge that what we passed was the right thing to do, but we probably didn't get it exactly right. And so rather than simply sort of live with the document we produced CPD without all the fanfare of the, you know, passing a new zoning code has kept at it their'",
        "'speaker_0': 'nose to the grindstone, getting it writer and writer and writer every time. So that's not glamorous work, but it is a work worth acknowledging, at least, you know, when you guys come here and just want to know that I thank you for it.'",
        "'speaker_0': 'I also want to thank people in the community who have continued to focus on this and spend. I mean, the good folks at CPD, they're to be applauded, but they are paid for the work. People like Joel Noble aren't paid a penny.'",
        "'speaker_0': 'And we really appreciate the kind of work that he and others put into helping us get it right. So here's to getting it right, even though it's a long and sometimes tedious and boring process, but it's worth doing so.'",
        "'speaker_0': 'Thank you, Madam President.'",
        "'speaker_1': 'Here, here. Councilman. Councilwoman Canete. Thank you very.'",
        "'speaker_5': 'Much, Madam President. Just a couple call outs. I'm very supportive of the parking reduction for senior housing. I think it's very common sense. I think, you know, some seniors are very active and still able to drive, but many choose to give up their their cars when they get to the point of transportation.'",
        "'speaker_5': 'That's public and access on the the trailer park issue. I just want to since I raised it, I think it's important to bring it to closure. So I recognize that what you've proposed is implementing a policy that, you know, it was passed by council many, many, many, many years ago.'",
        "'speaker_5': 'And I don't disagree totally with that policy. I certainly, you know, think that there are places in the state of Colorado where trailer parks are an affordable place for people to live in, you know, decent homes that are well-maintained and newer.'",
        "'speaker_5': 'And I've been to those places, you know, not far from our borders, and I've been to them in other cities in Colorado. And so I'm not one who believes that by definition that form of housing is substandard. I also recognize what Councilman Lopez has pointed out, which is that in Denver, you know, we do mostly have substandard'",
        "'speaker_5': ', you know, parks. And I don't think that we should be apologetic and I think we should be aggressive in enforcing health and safety in those locations. I don't think preventing folks from putting new housing or a new new a new trailer in is necessarily the best way to aggressively protect health and safety.'",
        "'speaker_5': 'Right. I would rather see I would rather us take a different approach. I would rather us say we have a major priority on, you know, the health and safety of folks in these living situations. And our job is to go in and aggressively close down any that are any units, you know, or any parks that are substandard'",
        "'speaker_5': '. It's to aggressively help to rehouse people in the affordable housing we're building and to plan for those sites future in terms and work to negotiate. Right. We can buy out you know. Owners if they do so willingly. We have an urban renewal authority, and that's what urban renewal authorities in many cities do, is they go after these'",
        "'speaker_5': 'really tough places and they work to, you know, purchase the land. So I think all of those would be better ways to go about this than preventing the inclusion of of new units. I recognize, though, that, you know, we're pretty late in the game here.'",
        "'speaker_5': 'And this is one piece of a very, very large package. So it's not a large enough piece for me to vote against it. But I really do think that that there are better and more more direct and more humane ways to go about it, because certainly at this point, if this has been our policy for years, it's'",
        "'speaker_5': 'clear to say that the deterioration is in part a result of our policy of not letting people upgrade. I mean, if you refuse to let people upgrade, you will get downgraded. And so. So I totally am not there on this piece, but it is one piece of a very, very large omnibus package.'",
        "'speaker_5': 'So I will support it. And then I will also commit to learning more about how we can address this more head on than than with this kind of approach. So thank you very much, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_4': 'Thank you, Madam President. Councilman Keach, thank you for bringing up that issue. I think it's an important one that we need to continue to have conversation about. We know that they've been grandfathered, but that doesn't mean that they haven't continued to exist since they were grandfathered.'",
        "'speaker_4': 'And what I have seen with those that I'm aware of is that most of them have been allowed to continue to deteriorate. So we do not want to create that environment that perpetuates that, you know, denigration of those communities because in most cases are very low income and we should be having provisions that address the ability to'",
        "'speaker_4': 'replace that housing. Either that or we should say if if we don't want them in the city, we should relocate and rebuild or do something else on those sites and be serious once and for all about whether or not we support them, their existence.'",
        "'speaker_4': 'And if we do, then we should allow a little bit greater flexibility that ensures that people are living in in a more safe and habitable environment. I want to thank staff for answering the many questions that my office had throughout this process.'",
        "'speaker_4': 'I appreciate the efforts on some of the provisions related to the regulating plan and the GDP that you all have worked to try to address to make it a little bit more clear and easy. There is one area that we did not talk about that I would like to begin a conversation about, and that's about the issue'",
        "'speaker_4': 'of micro-housing. And I know that it is a way of ensuring that we do have affordable housing. It's not going to be for everybody, but it just gives us one more potential tool we have to talk about, you know, where are the ideal locations?'",
        "'speaker_4': 'You know, are they on business corridors? Where where would be the most ideal locations for them? But I think it's it's the kind of housing that's starting to creep up all across the country. It is very affordable in those cities.'",
        "'speaker_4': 'In most cases, they don't have parking there next to transit or rail. And so I think this is something that we should begin to talk about. And I would love to get together with your folks and some people who are doing this in major cities across the country.'",
        "'speaker_4': 'So with that, I will be supporting these changes tonight as well. Thank you.'",
        "'speaker_1': 'Thank you, Councilman. I would just like to add I would like to ditto what Councilman Levitt said about all the hard work of the planning departments and zoning and everything. It's a major accomplishment. I'd also like to add my thanks to the Land Use Committee because I know how hard they worked on it and to their chair'",
        "'speaker_1': ', Councilwoman Robb, who we can always depend upon to ask the questions we can't even think about. So thank you very much, Councilwoman Robb. And to her Vice-Chair Councilman. Councilwoman Monteiro. Good. Good job. Good work. Okay. I think that we are ready for the roll call.'",
        "'speaker_0': 'Excuse me, I brown.'",
        "'speaker_3': 'But I Herndon. I can each layman i as Lopez, Ontario. However, I Ortega. I Rob Shepherd. I am president.'",
        "'speaker_1': 'I close the voting, announce the results.'",
        "'speaker_3': 'Surveys are only.'",
        "'speaker_1': '12 eyes fill one or two does go past.'",
        "'speaker_4': 'Because.'",
        "'speaker_5': 'Congratulations.'",
        "'speaker_0': 'You get in 2011.'",
        "'speaker_1': 'Yeah. I've been getting a little punchy. On Monday, April 21st, Council will hold required public hearings on the three zoning map amendment bills ordered published this evening. These are proposing changes at 2157 Downing Street, 32, 26 West 19th Avenue, and 1205 through 1275 Osage Street.'",
        "'speaker_1': 'Any protests against these bills must be filed with the council offices no later than noon on Monday, April 14th, 2014. Seeing no other business for this body, this meeting is adjourned.'",
        "'speaker_0': 'I doubt it.'",
        "'speaker_5': 'Denver eight TV. Your city. Your source.'",
        "'speaker_0': 'Denver. Eight on TV and online. Stay connected to your community. You.'"
    ]
}