{
    "A proclamation honoring Mikki Patterson's 38 years of service with the City and County of Denver.": [
        "'speaker_6': 'It's my distinct pleasure to read Councilman Council Proclamation 166 series of 2015 honoring Mickey Patterson's 38 years of service with the city and king and county of Denver. Whereas Mickey Patterson, a Denver native, worked for the city and county of Denver for 38 years, starting with the city building inspection in 1976, then joining the Solid Waste Management'",
        "'speaker_6': 'Management Division of Denver Public Works in 1977, working as an operations supervisor, equipment operator, senior utility worker and clerk. And. Whereas, Mickey said, quote, unquote, some people want to be doctors and lawyers. When I was a little girl, I wanted to work for the city.'",
        "'speaker_6': 'That was my dream job. And. Whereas Mickey Patterson lived in. Her dream and went on to become a trailblazer as the first female to ride the back of a city refuse truck. Spending more than three decades in public service, making Denver a cleaner, more beautiful place for all of us to live.'",
        "'speaker_6': 'And. Whereas, Mickey will now focus on spending time with her three grandchildren and one great grandchild and is looking forward to traveling, reading, sewing, playing piano, singing church and teaching Sunday school in her retirement. And. Whereas, the city and county the city Denver City Council would like to recognize and congratulate this Mickey Patterson on her 38 years'",
        "'speaker_6': 'of service with the city and county of Denver, and thank her for her dedication to the citizens of Denver. Now, therefore, be it proclaimed by the Council, the city and county of Denver, Section one, that the Council, the city and county of Denver wishes Mickey a well earned and happy retirement and thanks her for her.'",
        "'speaker_6': '38 years of service in Section two at the clerk of the city and county of Denver shall and affix the seal of the city and county of Denver to this proclamation and that a copy be transmitted to Mrs. Mickey Patterson.'",
        "'speaker_3': 'Thank you. Councilman Lopez, your motion to adopt.'",
        "'speaker_6': 'I move that council proclamation 166 series of 2015 be adopted.'",
        "'speaker_3': 'It has been moved and seconded comments from members of the council. Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. I know we get a lot of folks up here that come in in council chambers that are managers and folks that are individuals in our community that lead organizations. And we thank them on their on their on their service and on occasion.'",
        "'speaker_6': 'We have folks like Mickey Patterson who quietly made history without anybody even realizing it. And it wasn't until a few weeks ago where I was, you know, just flipping through the channels. And I saw that Mickey Patterson was on TV because Fox 31 had a had I did a story on this.'",
        "'speaker_6': 'And it was such a great story, such a heart wrenching story, a great moving story to know that somebody like Mickey Patterson, a civil servant, has worked for us, has worked for us as a city and such a distinguished honor.'",
        "'speaker_6': 'Her work every single day, whether it was raining or it was snowing and the heat. Putting up with some angry constituents here. And they're probably putting up, you know, some bureaucrats telling her what to do all the time.'",
        "'speaker_6': 'Right. Going home, putting up with kids, probably having get them ready to go to school. Now grandchild, a couple of grandchildren and a great grandchildren. What a blessed, blessed life. And the fact that we have Mickey Patterson here in the council chambers.'",
        "'speaker_6': 'She thought she could just go into retirement and just be in peace and never hear from the city again. Right. So we wanted to bring you here one last time. We want to bring her in here one last time to thank her.'",
        "'speaker_6': 'And I you know, it's folks like this every single day who are true public servants. There are folks who take oaths or folks who put uniforms on their folks who do it and wear that city seal in so many different ways.'",
        "'speaker_6': 'And I can't think of some something more honorable today than the work that you, as Patterson have, have provided for the city and county in Denver. So hats off to. Hats off to Mickey Patterson. I am proud to have this proclamation, read it and ask my council members while my fellow council members also support this proclamation.'",
        "'speaker_6': 'Moving it forward. We have a surprise for you, by the way.'",
        "'speaker_3': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_5': 'Mr. President, I would like to ask that my name be added to this proclamation. Whenever we have someone that has served this city for the number of years that Nikki has for 38 years, certainly deserves to be honored and recognized.'",
        "'speaker_5': 'And I'm honored to have my name added to the proclamation. Thank you.'",
        "'speaker_3': 'Thank you, Councilman Ortega. And the comments Proclamation 166. Scene on Madam Secretary.'",
        "'speaker_4': 'Roll Call Lopez Montero I Nevitt Ortega, Rob Shepherd Sussman Brooks Brown. Hi, Fats. I can each layman I. Mr. President.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Councilmembers can reach Lopez and Ortega. Thank you. All right. Now, Secretary, please close. Very nice results. 3939 Proclamation 166 is adopted. Councilman Lopez, anyone you'd like to invite to the podium to receive the proclamation?'",
        "'speaker_6': 'Yes. I want to invite the stunning Miss Mickey Patterson up to the podium to say a few words and to receive her proclamation. I have it here.'",
        "'speaker_8': 'Good evening, everybody. First of all, I'd like to say thank you for this honor. I I'm humbled. I would like to say working for the city has been a pleasure. It's been my dream. I, I hated to go, but it was time.'",
        "'speaker_8': 'You know, we all know when it's time to go. 38 years is a long time. So I'd like to thank my children for making it easy for me where I didn't have a lot of problems. And I have my children here.'",
        "'speaker_8': 'And my supervisor is also here. I still say that I work for the city. My children have to tell me all the time, Mom, you don't work for the city. But it's it's been only two months, so I still say my crew, my supervisor.'",
        "'speaker_8': 'I love the city and I am truly blessed. Thank you very much. Thank you.'",
        "'speaker_3': 'Kathy want to take. I just know, as you chimed in, did you want to add.'",
        "'speaker_5': 'Something to say? Nikki, you don't look a day over 30. Thank you for your service.'",
        "'speaker_3': 'That is fantastic. Thank you, Councilman Lopez, for that great proclamation. All right. We're moving on to the next one. Proclamation 167, sponsored by Councilwoman Monteiro, will you please read Proclamation 167?'"
    ],
    "A proclamation recognizing the 41st Annual Denver March Pow Wow.\n\n A proclamation recognizing the 41st Annual Denver March Pow Wow.\n\n": [
        "'speaker_5': 'Thank you, Mr. President. Proclamation 167 is recognizing the 41st annual Denver March. POWELL And it reads, whereas the 41st annual Denver March powwow will be held Friday, March 20th through Sunday, March 22nd, 2015, at the Denver Coliseum. And.'",
        "'speaker_5': 'Whereas, activities at the powwow will include traditional tribal storytelling, contemporary hip hop presentations, empowering youth and educating listeners with a message of hope, dancing, drumming, and the opportunity to purchase authentic Native American arts and crafts and delicious Indian fry bread by Northern Colorado Tribal Powwow Association.'",
        "'speaker_5': 'And Where is Indiana University and Kelley School of Business? MBA delegates will be in attendance to visit with Denver March Powwow Board of Directors and Tribal Artisans for the Natives Go Global Project initiated by the Rocky Mountain Indian Chamber of Commerce.'",
        "'speaker_5': 'And. Whereas, the annual Powell is an important event for the region's Indian people, making a powerful contribution to passing their cultural heritage from one generation to the next. Maintaining pride in their heritage and promoting cultural awareness of the Native American people of the general public.'",
        "'speaker_5': 'Now, therefore, be proclaimed by the Council of the City and County of Denver, Section one, that the Council hereby designates the days of March 20th, 21st and 22nd of 2014 as Denver Native American Cultural Days. In honor of the many Native Americans who make their home in our Denver region, Section two that the Council recognizes the occasion'",
        "'speaker_5': 'of the 41st Annual March powwow and commends members of the Powell Committee for their efforts to make the event a cultural and educational success for the Denver community. Section three that the Clerk of the city and County of Denver shall attest and effect the seal of the city and county of Denver to this proclamation, and that a'",
        "'speaker_5': 'copy be transmitted to the Mar Powell Committee President Ken LeDoux.'",
        "'speaker_3': 'Thank you, Councilwoman Monteiro. Your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. I move the proclamation 166 be adopted second 167.'",
        "'speaker_3': 'He said six 167 Oh, we got it. It has been moved.'",
        "'speaker_5': 'And that was Councilman Lupe Proclamation when 67.'",
        "'speaker_3': 'Has been moved and second it comments. Councilwoman Montero.'",
        "'speaker_5': 'Thank you, Mr. President. As many of you know, Denver is a home of many as as many 80 American Indian tribes are represented by residents of the Denver area. The original inhabitants of the area that is now Colorado include the Apache Nation Nation, the Arapaho Nation, the Cheyenne Nation, the Pueblo tribes and the Shoshone tribe and the'",
        "'speaker_5': 'Ute Nation. Other Indian tribes whose territory sometimes extended to and into Colorado included the Comanche tribe, Kiowa tribe and the Navajo tribe. Annual events at the powwow include the introduction of the power royalty, the royalty procession, the beginning of the song A Living Hoop and a coronation of the March Powwow Princess.'",
        "'speaker_5': 'The power will be held again in District nine at the Denver Coliseum at 4600 Humboldt Street this weekend on March 20/20, 21st and 22nd. Admission is $7 a day and $20 for a three day pass. 66 and under are free and the senior rate is $3 a day.'",
        "'speaker_5': 'So I'm very, very happy to be able to sponsor this this proclamation for the 41st year of the powwow. And I would encourage all of my colleagues to support it as well. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilwoman Monteiro. Councilwoman Ortega.'",
        "'speaker_5': 'I'd like to add my name to this one as well. I want to congratulate Ken and the Powell Committee for so many years. Ken, I'm not sure how long you've been doing it. You can let us know when you come up.'",
        "'speaker_5': 'But I know when I was the council person of the district where the Coliseum is worked to bring this forward on many occasions. And I just want to commend you, because I think this is truly an opportunity for people who have not really followed the the history and the tradition of our Native American cultures and how it'",
        "'speaker_5': 'continues to be passed on from generation to generation. The other thing I wanted to share is I don't know how many people realize that a number of our streets in the Platte Valley and Lower Downtown were actually named after some key native chiefs or their wives, such as Little Raven, Wayne, Coop, Woollahra.'",
        "'speaker_5': 'So, you know, the history lives on and I'm proud to add my name to the resolution and just want to say thank you to Ken in the March Powell Committee for continuing to put all the work into making this happen every year.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Ortega. Councilwoman Sheppard.'",
        "'speaker_1': 'Thank you, Mr. President. I would also like to ask that my name be added to this proclamation as a sponsor. Thank you.'",
        "'speaker_3': 'Thank you. Any other comments on proclamation 167. Scene on Madam Secretary Raquel.'",
        "'speaker_4': 'Montero.'",
        "'speaker_5': 'I.'",
        "'speaker_4': 'Nevitt i Ortega I Rob Shepherd I Susman Brooks Brown I futz I can each layman i lopez i nevett.'",
        "'speaker_9': 'My little voting client thing has decided to go on holiday, so you'll just have to leave early.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_3': 'I. Madam Secretary, please close the very nasty results. 3939 167 has been adopted. Councilman Monteiro, is there someone you'd like to invite to the podium to receive the proclamation?'",
        "'speaker_5': 'Yes, Mr. President. Mr. Ken LeDoux, if you could come up to the podium.'",
        "'speaker_6': 'This is the second time. Good evening. To answer Debbie's question. How many times have come here? I've been president of the powwow for 27 years, and I've been involved with the committee for 36 out of the 41 years.'",
        "'speaker_6': 'So it's been a nice time. I've seen a lot of the faces change here. And so with the commission, I think the intent of the committee from its very origin still stays the same. This did start as a youth power and to recognize what youth could do as far as learning their culture and present.'",
        "'speaker_6': 'It was mentioned that, you know, more than 80 tribes lived here. And a great deal of these people did come in the fifties as there was a relocation program. So in addition to the tribes that also were residing in this area, a lot of other ones came to this area for education, employment and other areas.'",
        "'speaker_6': 'It became their home and is still the home for a lot of a lot of the people here. There is this is one of the areas where there is a large Indian population. And during this weekend, it grows even larger.'",
        "'speaker_6': 'This is one of the major events in the United States in terms of a cultural event. Not only is it an event that showcases the variety of culture that exists, but also the crafts that these people make that are a part of this country.'",
        "'speaker_6': 'It is something that not only the tribal people, but the people of Denver can be proud of because there is only one Denver March power and it happens every march. And it's something that I know that will continue on long after I pass on.'",
        "'speaker_6': 'I know that my wife, who's here with me, has devoted a lot of time to make sure that I get here on time for different things. And that's true for a lot of live events. Mothers and wives often.'",
        "'speaker_6': 'Often times are overlooked, but yet they provide the foundation. And that is a part of Indian culture that oftentimes is not properly recognized. Often you look at the warriors, but there are women warriors. And at this time, you know that something to be thankful for.'",
        "'speaker_6': 'But I'd like to thank all of you who come at this time for the proclamation. And I do hope that you do take time to come and look at the event. And attend and see what's there. But if you're not able to, you know, one of the through the modern technology, we now stream this to not only'",
        "'speaker_6': 'the local area, but all over the world. Because one of the things. Tribal members, you know, have always been a part of the military. And we have a lot of our members who take this opportunity to see what's going on.'",
        "'speaker_6': 'One of my grandsons, who was one of my good volunteers for a number of years dealing with the arts and crafts, I think currently is stationed in Hawaii. So usually at the power usually will give him a hello.'",
        "'speaker_6': 'And surprisingly, he does respond back. So it's something that the city and the county can be extremely proud of because there's only one coliseum and there's only one. Denver much power. And I brought some information here for for you to take a look at.'",
        "'speaker_6': 'So I hope to see all of you there. And again, thank you very much.'",
        "'speaker_3': 'I thank you and thank you, Councilwoman Monteiro, for that. All right. We are ready for the resolutions. Madam Secretary, would you please read the resolutions.'",
        "'speaker_4': 'From safety and well-being 116 resolution approving the mayor's appointment, the Denver Preschool Program Board of Directors. 119 Resolution approving the mayor's appointment to the Denver Latino Commission.'",
        "'speaker_3': 'Thank you, Madam Secretary. Bill, for introduction. Will you please read the bill for.'",
        "'speaker_4': 'Introduction from Business Development? 113 A Bill for an ordinance proposed software maintenance agreement between City under CGI Technologies and Solutions Inc. related to software maintenance and support at Denver International Airport. 114 A bill for an ordinance pre and post agreement between City and county of her signature Technologies Inc. related to configuration and supporting software systems at Denver'"
    ],
    "Rezones 1410-1420 South Santa Fe Drive from E-CC-3 UO-1, UO-2 (Urban Edge, Commercial Corridor, 3 stories, Use Overlay allowing adult businesses and billboards) to I-A UO-1, UO-2 (Light Industrial, Use Overlay allowing adult businesses and billboards) in Council District 7. (NEIGHBORHOODS AND PLANNING) Rezones 1410-1420 South Santa Fe Drive from E-CC-3 UO-1, UO-2 (Urban Edge, Commercial Corridor, 3 stories, Use Overlay allowing adult businesses and billboards) to I-A UO-1, UO-2 (Light Industrial, Use Overlay allowing adult businesses and billboards) in Council District 7. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 2-4-15.": [
        "'speaker_3': 'It has been moved and we do second. Thank you. Council Bill three zero approves the Zoning Map Amendment. The Council is required by law to conduct hearings on zoning map amendments, and the Council's actions are subject to a court review in order to provide a record for court view.'",
        "'speaker_3': 'Testimony is recorded and any items presented to the Council are marked as exhibits and become part of the record. Public hearing for council bill 30 is now open. We have the staff report.'",
        "'speaker_10': 'Good evening. My name is Tim Watkins with Community Planning and Development here to present rezoning application number 2014 IE 82 for property located at 1410 and 1420 South Santa Fe Drive property is located in South Denver Council District seven, known as Lucky District seven in the Overland neighborhood in the northern northeast portion of the North Overland neighborhood'",
        "'speaker_10': 'and located at the intersection of Santa Fe Drive and Arkansas Avenue, the property collectively is just over 30,000 square feet and the owner is requesting a rezoning from E three, which is urban edge commercial corridor three story maximum two I.A. or light industrial.'",
        "'speaker_10': 'And this would allow for marijuana cultivation facility and an existing building and property and for the city's strategy of retaining First Amendment freedom of speech rights. The use overlay one or adult use would be retained and also use overlay to a billboard is proposed to be retained.'",
        "'speaker_10': 'The existing zone district urban edge commercial corridor three storey allows for development along auto dominated corridors and provides for a deep build to requirement, which allows for some parking between the building and the street. And this zone district allows for provides a transition between commercial and residential areas.'",
        "'speaker_10': 'The requested zone district, air or light industrial use is intended for employment areas, allows for offices, businesses and lighter manufacturing and warehouse uses, and does not allow any new residential uses. The existing context of the site in a surrounding area, beginning.'",
        "'speaker_6': 'With the zoning.'",
        "'speaker_10': 'Is surrounded by. Some heavy industrial or before. Just to the south or excuse me, not heavy industrial. That is a general bit general business. And then I.B. is the heavy industrial to the northeast and to the west and northwest is more urban edge.'",
        "'speaker_10': 'Commercial Corridor three story. The existing land use is predominantly industrial and the purple color as well as some surrounding commercial retail and office uses. You'll also note the rail corridor, major rail corridor running north and south, just a block or two to the east of the site.'",
        "'speaker_10': 'Here's an aerial image showing the property in the surrounding area and you can see that it is predominantly industrial and lies within quarter. About a quarter mile separates it from the established residential area, which begins just east of the Broadway corridor to the right of the screen.'",
        "'speaker_10': 'The building form and scale. The center image to the left is the property. This is a light industrial flex building that allows for general manufacturing office and retail or wholesale uses. For a number of years. This was actually the Monarch Shower Doors facility where they would manufacture these products and had a showroom for wholesale sales and service'",
        "'speaker_10': 'to the north west of the property is existing residential and light industrial flex uses and abutting the property to the south is a fairly new commercial retail complex fronting Santa Fe Drive. Public process to president includes applicant outreach to the Overland Park Neighborhood Association and other applicable neighborhood groups were notified through written notice for all public meetings'",
        "'speaker_10': ', and also written notice was provided to all applicable groups for the Planning Board, Public Hearing and Neighborhood and Planning Committee, as well as the public hearing this evening at the Planning Board hearing on January seven. Planning board members unanimously voted to recommend approval for this application onto the five review criteria, beginning with consistency with adopted plans.'",
        "'speaker_10': 'Comprehensive Plan 2000 recognizes opportunities for smaller custom fabrication and entrepreneurial start up businesses in historic industrial areas, including the South Platte River Corridor and rail tracks, which has been an important part of Denver's economic base for over a century.'",
        "'speaker_10': 'It also addresses the age or suggests that the age of the buildings and infrastructure and the change changing needs of industrial users should be addressed. Blueprint. Denver The concept land use is industrial. Recognize that this area is an area of stability and there are two types of areas of stability recognized in Blueprint Denver including committed and reinvestment'",
        "'speaker_10': 'and reinvestment maintains is intended to maintain the character of an area but also accommodate new development and select redevelopment. And this is fitting for an aging industrial district where reinvestment could benefit the existing buildings and surrounding infrastructure. The Future Street Classification and blueprint.'",
        "'speaker_10': 'Denver recognizes Santa Fe Drive as a commercial arterial. These typically serve commercial areas and contain small retail strip centers with front parking lots. They are often highly auto dominated or oriented and less amenable to walking and bicycling. They're primarily intended to accommodate regional traffic from one part of the city to another, while providing access to nearby businesses'",
        "'speaker_10': '. Arkansas Avenue is a local street. The Overland Neighborhood Plan, adopted in 1993, acknowledges the presence of industrial users in northeast, in the northeast, half of the neighborhood, and it encourages landscape buffers between industrial and residential areas, which is not applicable to this property, given the blue white distance between industrial uses and the residential areas that are about'",
        "'speaker_10': 'a quarter mile away. The next review criteria uniformity of district regulations. The Denver Zoning Code would be applied uniformly to this site, so that criteria would be met. The rezoning would further public health, safety and welfare by implementing recommendations of adopted plans.'",
        "'speaker_10': 'The justifying circumstance is that the land and surrounding environs has changed or is changing. This is characterized or could be characterized by the recent retail development adjacent to the property to the south. Also there is new residential and mixed use development occurring and in the more central and south part of the overland neighborhood closer to the Evans'",
        "'speaker_10': 'rail station. And this is creating more demand for retail in that part of the neighborhood, more so than this industrial sector. Also, the aging industrial properties are in need of a reinvestment and there are some new regulations that apply, including November 2000 medical marijuana, which was legalized in the Colorado Constitution at that time.'",
        "'speaker_10': 'And in November 2012, recreational marijuana was legalized in the Colorado Constitution. The Denver Zoning Code, adopted in 2010 specifies where growing of marijuana is allowed and there are excise and licensing spacing requirements and business application requirements provided through the Business Excise and Licensing Office.'",
        "'speaker_10': 'The fifth criteria is consistency with neighborhood context, and the purpose and intent of the zone district should be in alignment. So the industrial context is characterized by an irregular pattern of large blocks with parking that often surrounds and buildings.'",
        "'speaker_10': 'And businesses that are located near highways or arterial streets. The Light Industrial Zone District is intended for employment areas. It allows for offices, businesses, light industrial uses and warehouse uses, and no new residential uses are allowed. So these are a good fit with each other and for the area and CPD, upon finding that all review criteria has'",
        "'speaker_10': 'been met, recommends approval of this application. Thank you. Thank you.'",
        "'speaker_3': 'We have three speakers. Sign up today. Call up all three. You can come to the first few. Tom Downey, Gary Cohen and Kara Swisher. And you all three can make your way up. And Mr. Downey, you can begin your remarks.'",
        "'speaker_12': 'Good evening, Mr. President. Council members. Tom Downey, 9856 East 27th Drive.'",
        "'speaker_10': 'Where the attorneys representing the applicant.'",
        "'speaker_12': 'And we're just available for questions.'",
        "'speaker_3': 'Thank you, Gary Cohen and.'",
        "'speaker_10': 'Gary Cohen.'",
        "'speaker_13': '1318 South.'",
        "'speaker_10': 'Marion. I'm available for questions.'",
        "'speaker_6': 'I'm the owner of the building.'",
        "'speaker_3': 'Thank you. Thank you.'",
        "'speaker_5': 'I'm curious. We see little 150 West Ninth Avenue, apartment 4512 in Denver, and I'm representing the applicant. All right. Available for questions.'",
        "'speaker_3': 'Thank you. That concludes our speakers. Do we have any questions from members of the council? Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Mr. President. One thing in the presentation just raised my curiosity. I'm familiar with this area because I drive by it often. And there was a statement not about the grow house. I understand that use, but when I said in the interest of free speech, they wanted to retain the adult use.'",
        "'speaker_5': 'What are you planning?'",
        "'speaker_10': 'I won't go back to the slide, but it is the general policy and recommendation city of Denver to retain First Amendment freedom of speech right in the city that whenever existing property owner has a existing district that includes you overlay one, we encourage that to be retained to provide for that that right throughout the city.'",
        "'speaker_10': 'But it's not necessarily an intended use by the applicant.'",
        "'speaker_3': 'Go ahead.'",
        "'speaker_5': 'I really was asking the applicant if there is any use that you are intending for this, because I'm curious.'",
        "'speaker_10': 'No, councilman, there's no plans for an adult use. I was just at the request of the planning department. We did not request a change in that availability.'",
        "'speaker_5': 'I appreciate the explanation. Thank you.'",
        "'speaker_3': 'Thank you. Councilwoman Fox, Councilwoman Ortega.'",
        "'speaker_5': 'Councilwoman. Fantastic. My question. Thank you.'",
        "'speaker_3': 'All right. Any other questions on public airing for accountability? Seen on public hearing is now closed. Time for comments. Councilman Nevett.'",
        "'speaker_9': 'Thank you. I'm going to see if that works. Oh, it did work. Okay. But you called on me anyway. I don't have a whole lot to add. This is pretty straightforward, pretty cut and dried. I can tell you that I did a little extra outreach to the surrounding neighborhoods and got no particular interest or concern from them'",
        "'speaker_9': '. So I hope will move forward with this and improve it tonight.'",
        "'speaker_3': 'Thank you. Count Commonwealth. And the other comments on Council Bill three zero. Scene on Madam Secretary. Roll call.'",
        "'speaker_4': 'Now. Nevett I Ortega. Rob Shepherd Sussman. Brooks Brown. Hi, Fats. I can each layman. Hi. Lopez. Hi, Monteiro. Hi, Mr. President.'",
        "'speaker_3': 'Hi, Madam Secretary. Please close the building and announce the results. 3939 as council bill three zero has been placed upon final consideration and does pass. All right. We're moving on to this excellent second one, which is Council Bill 83, a bill for an audience approving a proposed cable franchise agreement between the city and county of Denver and'"
    ],
    "Grants Qwest Broadband Services, Inc., doing business as CenturyLink a nonexclusive franchise agreement with a duration of 10 years and authorization to make reasonable and lawful use of the Rights-of-Way within the City to construct, operate, maintain, reconstruct and rebuild a cable system for the purpose of providing cable television service in exchange for 5% of gross revenues. a) Presentation.  b) Fifteen (15) minutes of public comment on proposal. Two minutes per speaker and equal opportunity for opposing perspectives as determined by the Committee Chair. Individuals wishing to speak must sign up in the Council conference room (3rd Floor, City & County Building, Rm. 391) between 1:00pm and 1:15pm. The order of speakers is determined by the Committee Chair. c) Discussion/Action. Grants Qwest Broadband Services, Inc., doing business as CenturyLink a nonexclusive franchise agreement with a duration of 10 years and authorization to make reasonable and lawful use of the Rights-of-Way within the City to construct, operate, maintain, reconstruct and rebuild a cable system for the purp": [
        "'speaker_3': 'Quest Broadband Services Inc, also known as CenturyLink, granting a non-inclusive cable television franchise. Councilman Brown, will you please put Council Bill eight three on the floor to be ordered published?'",
        "'speaker_10': 'Thank you, Mr. President.'",
        "'speaker_6': 'A move the council bill 83 be ordered published.'",
        "'speaker_3': 'It has been moved in second in a public hearing for council bill 83 is now open. May we have the staff report?'",
        "'speaker_10': 'Good evening. My name's Frank. The tone of the chief information officer for the city and county of Denver. Thank you for having me. Tonight, we're going to discuss the the CenturyLink Cable Television Franchise Agreement. This agreement is very similar to the existing franchise agreement that exists today with Comcast that was signed by Mile High Cable back in'",
        "'speaker_10': '1984. With the exception of one fairly significant difference, the things that are identical provision wise, the terms of the agreement are ten years, the amount of franchise fees is 5% of gross revenues. The amount of the peg fees is a dollar five per customer per month.'",
        "'speaker_10': 'Administration and regulation of the franchise are the same. Customer service standards are the same and franchise violations are the same. So I will now move on to the piece that is relatively significant between the two. The agreement that was signed back in 1984 was for the service availability piece of it was for universal coverage, which meant coverage'",
        "'speaker_10': 'throughout the entire city and county of Denver. The the the agreement that's here tonight is not that way. It's actually an agreement that is based on market penetration and market success. So how that would look, this agreement sort of started out actually this agreement to understand what we are trying to do here.'",
        "'speaker_10': 'We have a term that I need to explain, which is a remote terminal, a remote terminal as a way to provide service to homes and residents. A remote terminal is a point which is a distributor of the service and a can service in any given neighborhood, up to 4 to 500 living units.'",
        "'speaker_10': 'So how this service available ability breaks out within two years. CenturyLink must offer service to at least 15% of all living units within the city and county of Denver. But they must also offer at least one RTA, which is that remote terminal that I just mentioned in each of the 11 Council districts.'",
        "'speaker_10': 'So that 15% cannot start in one area and grow from there. It has to be distributed throughout the entire city, a county of Denver by at least one remote terminal per district. So 15% would be roughly about 44,000 living units within the first two years.'",
        "'speaker_10': 'Market penetration is the metric that is used for moving forward with the with further expansion. And how that works is if you have 100 homes and you provide service to 28 of those homes, then you are at 28% of your service availability footprint.'",
        "'speaker_10': 'The agreement today states that once CenturyLink reaches 27 and a half percent, then they would need to, after two years, continue to grow their footprint by at least one additional R.T. and every council district. There's also a piece in there.'",
        "'speaker_10': 'If at any point in time CenturyLink becomes the primary service provider and with a majority of 50% of market penetration, then they will then provide universal service to all of city and county of Denver. There's also a language in there about nondiscrimination, and it prohibits them from discriminating against any neighborhood on the basis of income.'",
        "'speaker_10': 'There's also a language that states they guarantee to commit a significant portion of their investment, which will be targeted to areas below the median income of the city. Within each of these authorities. They will also have to provide service.'",
        "'speaker_10': 'They must also cover one school or library, and that goes on for each of the two years going forward. How this will be monitored is through transparency within the language of the contract. CenturyLink needs to provide on demand to the city their existing service availability footprint and what their market is today.'",
        "'speaker_10': 'And then that will be monitored and monitored by the city. Quarterly There will be meetings with CenturyLink to look at their progress and to review that. And we also have members of CenturyLink that are here today, if you have any questions.'",
        "'speaker_3': 'Thank you, Mr. de Novo. David, your name was listed as staff. Did you have anything you wanted to add for the presentation? Mr. Broadwell.'",
        "'speaker_13': 'David Broadwell. Assistant City Attorney. I'll just answer questions as they arise.'",
        "'speaker_3': 'Great. I thank you.'",
        "'speaker_10': 'Thank you. Mr. President, members of council. My name is Jim Campbell. I'm the regional vice president for Regulatory and legislative affairs for Central Bank. Thank you so much for having us here tonight. I'm not going to repeat what Frank said.'",
        "'speaker_10': 'I think he did a good job of describing what's in the agreement. I would note that the requirement to add in a remote term, I think is actually a one year, not two years. So we would have to do it within one year of hitting those market penetration rates.'",
        "'speaker_10': 'I would be remiss if I didn't think staff for their hard work over the last nine months, they've been incredibly diligent throughout this process and David and Frank at all times had the interests of the residents of the city of Denver at first and foremost at their hearts.'",
        "'speaker_10': 'I also want to thank all the members of Council for participating in the committee process. Those of you that aren't on the committee were there, and I appreciate your willingness to listen to us, to us as we made our presentation.'",
        "'speaker_10': 'This is pretty exciting. For the first time in over 40 years, you're actually have an application from a company that's going to make a significant investment to bring to bring cable competition to Denver. And it's the residents of Denver that benefit from this.'",
        "'speaker_10': 'I think the studies have shown throughout the country that the incumbent operators generally behave a little bit better when you have a wireline facilities based competitor. And that's exactly what we intend to bring. We're obviously very excited about the opportunity to make this investment here right in the city of Denver.'",
        "'speaker_10': 'I can tell you that it's this is about innovation. This is about jobs, it's about investments. So, again, we asked for your your favorable support of this application. And I will be here to answer any questions you might have.'",
        "'speaker_10': 'So thank you very much, Mr. President.'",
        "'speaker_3': 'Thank you. We have 12 speakers signed up for this today. We have seven in favor, five against. And I'm going to call the first five. You can make your way up to the first pew. Patrick Byrne, David Briggs, Cynthia Wake, Jason Peck and Sara Randall.'",
        "'speaker_3': 'You five can make your way up and Mr. Barron, you can go ahead and begin your remarks. You have 3 minutes.'",
        "'speaker_6': 'Well. Good afternoon. Members of council. My name is Patrick Byrne. I live at 1196 Grant Street in Council District ten. Speaking on behalf of myself tonight.'",
        "'speaker_10': 'I'm a current customer of.'",
        "'speaker_6': 'The existing franchise holder and don't have anything.'",
        "'speaker_10': 'Particularly bad.'",
        "'speaker_6': 'To say about them tonight. But I just want to encourage you all to vote in support of Council Bill 83 that will provide some competition to benefit all of the consumers here in Denver. Allowing a second franchisee will lead to competition in products, pricing, bundling and customer service.'",
        "'speaker_6': 'And I think everyone benefit from that. And from what you all just heard tonight, I think the build out terms have been really thoughtfully done and I think they'll be very fair and equitable. So with that, I would ask for your support.'",
        "'speaker_6': 'And thank you very much. Thank you.'",
        "'speaker_3': 'David Briggs.'",
        "'speaker_12': 'Good evening. My name is David Briggs and I live in the area on 4933 Durham Court. I'm all for competition, but how do I know I'll get Centrelink service in my area? And if not, how is that competition?'",
        "'speaker_12': 'I understand the Comcast was required to serve the entire city within three years. What is the time table for CenturyLink? For the contract as it seems vague on obligations to serve the entire city. And it seems that this council is not requiring CenturyLink to serve all of the within and defined time period.'",
        "'speaker_12': 'When will they come to my area? And what says they have?'",
        "'speaker_3': 'Thank you, Mr. Briggs. Cynthia Wake.'",
        "'speaker_8': 'Good evening, members of Council. My name is Cynthia Wake and I reside at 3779 William Street, Denver. I am a CenturyLink employee as well as the president of the Cole Neighborhood Association. Cole, of course, is located in the Great Eight, as Councilman Brooks always affectionately refers to us.'",
        "'speaker_8': 'I just wanted to express my support for Council Bill 83. As a resident of Denver as well as a CenturyLink employee, we're really excited about being able to offer innovative products to the residents of Denver and provide a choice other than cable or satellite service, which are really your only two options for television service right now in'",
        "'speaker_8': 'Denver. Satellite is somewhat cumbersome and not available to every resident. If you can't get satellite, especially if you're in a multi dwelling unit where there's some other restrictions, you really only have one choice, which is cable. So I would like to express my excitement and support for the bill, not only to make my job a little bit'",
        "'speaker_8': 'easier as well to provide choice to the residents of Denver. Thank you.'",
        "'speaker_3': 'Thank you. This week. Jason pick.'",
        "'speaker_6': 'Thank you. My name's Jason Peck. 901 Area.'",
        "'speaker_10': 'Parkway, Denver 80204.'",
        "'speaker_6': 'Just want to bring briefed background on this. I have testified on this issue in other cities as CenturyLink is going to.'",
        "'speaker_10': 'Other cities around Denver. I'm a realtor and there are some.'",
        "'speaker_6': 'Concerns I have specifically about this franchise agreement.'",
        "'speaker_10': 'Obviously, technology's very, very.'",
        "'speaker_6': 'Important to people who are looking to purchase within the city of Denver.'",
        "'speaker_10': 'They have lots of questions and this.'",
        "'speaker_6': 'Franchise agreement is very vague when it comes to the availability. I'm all for market competition.'",
        "'speaker_10': 'Okay. But I think.'",
        "'speaker_6': 'That the city of Denver can do better than this franchise agreement that's put in.'",
        "'speaker_10': 'Front of you.'",
        "'speaker_6': 'With that being said, the one thing I have been able to tell them, like in affluent areas, that's the first place that CenturyLink is going to go. They're going to set up in affluent areas like this gentleman here.'",
        "'speaker_6': 'He's probably not going to get it or he might get it. But setting up a router and each district doesn't necessarily the the citizens that should be getting the service are going to be getting the service, but they're going to be setting up in flow in areas.'",
        "'speaker_10': 'I want to express the concern that Denver really.'",
        "'speaker_6': 'Didn't do that good of a job in negotiating this franchise agreement as I've gone to other cities talking about these same concerns. It's the same agreement. You guys.'",
        "'speaker_0': 'Shit. You're the biggest city.'",
        "'speaker_6': 'You're the big dog. You should be getting a better franchise agreement. Now, while this promote equity initial build up, I did watch some of the city council meetings in regards to this. And I'm just there's just some significant concerns about this franchise agreement.'",
        "'speaker_6': 'And I know that a lot of you were in favor of it from that standpoint. But one thing that does make me nervous is that CenturyLink basically came out and said, well, we don't want to set a precedent.'",
        "'speaker_10': 'As we negotiate with other cities with giving you guys something that we might not be giving to other cities. And that's a concern to me. So most importantly, I just.'",
        "'speaker_6': 'Want to thank you for your time. I'm here for the little guy. I'm here for the person that might be working a second job tonight.'",
        "'speaker_10': 'That doesn't necessarily come here.'",
        "'speaker_6': 'Have a voice and I thought was important. They speak on this tonight. Thank you for your time.'",
        "'speaker_3': 'Thank you, Mr. Peck. Sarah Randall. And as Sarah comes up, I want to call the next five speakers Sharon Alexander Holt, Jack Kroll, Brigitte Alexander, Naomi Ramirez, and Reverend Patrick Demmer. You can come up to the first pew.'",
        "'speaker_3': 'And Ms.. Randall, you can go ahead and begin your comment.'",
        "'speaker_1': 'Hi, my name is Sarah Randall. I live in Uptown on 1801 Pennsylvania Street. I would really like to have the option for CenturyLink Cable. I think a city as forward thinking and innovative as Denver, we should thrive on competition and the drive to create better options for our community.'",
        "'speaker_1': 'When there is more competition, I'll have the opportunity to have improved customer service. I only have 3 minutes. I do not have the time to talk about my customer service. Problems with Comcast and Comcast consistently ranks at the bottom of of good customer service.'",
        "'speaker_1': 'I value competition and I do want to live in a city where, ah, I value competition and I want to live in a city where our council members do as well. So thank you for your time.'",
        "'speaker_3': 'Thank you, Miss Randall. Sharon Alexander Holt.'",
        "'speaker_8': 'Hello. My name is Sharon Alexander Holt, and I'm pleased to be here. Thank you for Mr. President and city council members. I'm the former CEO of the Urban League of Metropolitan Denver, a concerned community citizen. And currently I work with the in a position where I have a radio program that I co-host every Sunday that deals with'",
        "'speaker_8': 'the community, a Christian community of ventilation and education. And so I'm here because I'm concerned about, again, our community and properly being able to represent the concerns we have as we ventilate about some of the language in the contract.'",
        "'speaker_8': 'Well, what's good is that there's some build out going on. My concern is that the build out is not hitting the inner city the way that it should. And then there's language like significant. What does that really mean when you begin to divine what is significant mean?'",
        "'speaker_8': 'When will that happen? When do you feel there's a significant amount of the territory that is viewing our on the system that they would go to next level? Those are teams right now hold around what, 500 you said and maybe over two years to be a thousand.'",
        "'speaker_8': 'But when does that guarantee in the inner city, the communities that they too will have that build up? My concern again, because of my past and the hats that I wear, is our communities being forgotten. Are we forgetting about those neighborhoods and we're hitting more the fluent, which always goes back to that concern about redlining.'",
        "'speaker_8': 'And I want to eliminate that. So I'm just asking that you go back, look at the language in the contract, reevaluate it, just don't accept it as is when is there. But we need some allocated times, we need some definitive times.'",
        "'speaker_8': 'And that just randomness of is going to happen when we reach those numbers. When it took others like Comcast a few years to get to those numbers and our children don't have those kind of years on their side.'",
        "'speaker_8': 'So I ask that you consider that, and I would like to really see that a more guaranteed build out is given to us. Thank you.'",
        "'speaker_3': 'Thank you. Miss Alexander Holt. Jack Kroll. Good evening. My name is Jack Kroll. Thank you for your time. I reside at 2307 Ivy Street. I'm here to speak in favor of this bill. I think it will improve the competition in our city.'",
        "'speaker_10': 'It will bring an upgrade to current.'",
        "'speaker_3': 'Communication infrastructure in certain areas as well, and over time to many more areas. And this is going to continue to make Denver a popular place to live for young people moving to the city. Speed and connectivity is everything in the 21st century.'",
        "'speaker_3': 'I mean, if you look at the closing of certain trading floors in Chicago.'",
        "'speaker_6': 'They just can't keep up with.'",
        "'speaker_10': 'The.'",
        "'speaker_3': 'Trading that's going on in other cities. And if we want to be a world class city, we're going to have to have Internet and communication technologies that allow us to do that. I had a friend recently moved to a new city and he chose the neighborhood where he was going to live based off of the connectivity of'",
        "'speaker_3': 'the Internet and the speed of which the Internet in that area. And that's going to ring true for people my age as they move to Denver. And we need to build a system that provides proper access and is attractive to people to move to.'",
        "'speaker_3': 'And finally, if we do not act, we will only continue to push people to less to forms of entertainment, video, entertainment that generate less revenue for the city. Right. If there's not competition. Comcast provides poor customer service. Young people are just going to seek their entertainment dollars and spend those elsewhere.'",
        "'speaker_3': 'And the city isn't going to get the 5% of the revenue that comes in when I go buy my Netflix subscription. Right. And so with all of that, I thank you very much for your time and I ask for your support on this measure.'",
        "'speaker_3': 'Thank you, Mr. Crowe. Brigitte Alexander.'",
        "'speaker_8': 'Good evening. My name is Brigitte Alexander. I am a mother of two, a college student and a high school student. And I live in the community of Montebello and I'm greatly concerned about the accessible currently proposed in this agreement between the the Century CenturyLink and the City Council.'",
        "'speaker_8': 'As a member of this community, which is, I wouldn't say poorer than some because I'm a hardworking citizen, but I probably have to work harder than some people. I want to know what's going to be done to ensure the services that will reach me and my children, who have the projects to do, who have research papers to'",
        "'speaker_8': 'do, who have these things to do, what's going to be done for this CenturyLink to reach us and when will it be done? I think that what I've heard in this presentation, presentation that I heard tonight is kind of unclear to me.'",
        "'speaker_8': 'It's kind of vague. It's not really telling me anything that I really need. So I'm asking you as my city council people, what are we going to do or what are you going to do, should I say, to help them serve the community that I live in?'",
        "'speaker_8': 'And when will be this? When will this be done? Thank you for your time.'",
        "'speaker_10': 'Bye bye.'",
        "'speaker_3': 'Thank you. Ms.. Alexander. Naomi Ramirez.'",
        "'speaker_1': 'Good evening, council members. My name is No Ramirez with a strategy. We're the largest privately held minority owned broadcaster in the U.S., and we ranked number three in Spanish media in the United States. I am for choice and for competition.'",
        "'speaker_1': 'Let's give people what they want to watch. Comcast uses market dominance to undercut competition and limit diversity in broadcasting. As of February 19th, we were forced off there, off of Comcast. And this happened in the Denver market, Houston market and Salt Lake City market.'",
        "'speaker_1': 'Are huge Hispanic markets. Houston number five in the market. Denver is 17th in the United States as far as the Hispanic population. This affects the Hispanic voice. We are a window of information and a win and a voice for the Hispanic community.'",
        "'speaker_1': 'And as this is happening, you know, we're Comcast is definitely limiting that voice and that window of information that we provide as a straight away. This is also affecting advertisers. Over 50% of our advertisers are minority owned, locally owned businesses.'",
        "'speaker_1': 'So, you know, I'm definitely pro-choice and pro pro competition. Definitely Comcast has put it has put its business interests ahead of the Hispanic community and consumer. This is a David versus Goliath scenario as straight straightaways live in this right now as we speak.'",
        "'speaker_1': 'And when there's no competition, you you don't give people choice. So I'm definitely food for choice and for competition. Thank you.'",
        "'speaker_3': 'Thank you. Ms.. Maria Ramirez. Reverend Zimmer. And as Reverend Dimon coming up, I'm going to call the last two speakers, Nancy Ulrich and Richard Schultz. You can make your way to the wrap. You and reverend dinner. You may begin your remarks.'",
        "'speaker_12': 'President Herndon and to all of the members of the city council, thank you for once again allowing me this opportunity to speak to you. I have spoke to you. I have written to you. I have urged you. I have strongly allowed my voice to be spoken concerning this.'",
        "'speaker_12': 'And I want it to be clear. For the record, I am not against CenturyLink. I am against the language and that which seems to be guiding the proposal that the city council is accepting. And I'm I'm disturbed. I'm very disturbed as some of the others that have spoken after speaking and really sharing my heart and after they'",
        "'speaker_12': 'they went back and they redid some of the contract language, they came back with things like significant and I'm not sure what significant means because when we talk about our T's remote terminals, that only will reach 500 residents.'",
        "'speaker_12': 'And most of your city council districts have at least 25,000 residents. How can you possibly think that 500 and adding one more. If you reach 27.5, adding one more or two more or three more will not make a difference.'",
        "'speaker_12': 'And we elected you to look out for the little person, the affluent, those that are wealthy, those that are in great communities. They don't need your representation. They do not need your protection. I am here because I represent the voice and the political voice of not only the NAACP, but also the Greater Metro Denver Ministerial Alliance.'",
        "'speaker_12': 'And I'm a pastor in my community. And I want you I beg you to really consider what you are about to. Okay? It is great to have competition. I welcome it. I like the idea that if I don't want a McDonald's hamburger, I can go get a Burger King.'",
        "'speaker_12': 'I like the idea that if I do not want Comcast, I can go to CenturyLink. I like that. But I want you to hold anyone who comes into our community as responsible to every ethnicity, black or brown, as you did with Comcast.'",
        "'speaker_12': 'What's wrong with guaranteeing that you will reach a build out that will insure all people? Thank you.'",
        "'speaker_3': 'Thank you, Aaron Timmer, Nancy Ulrich.'",
        "'speaker_5': 'Good evening.'",
        "'speaker_1': 'I'm Nancy Elrick, and I live in Denver and District five. I'd like to.'",
        "'speaker_5': 'Start my comments by saying, by taking the opportunity to say.'",
        "'speaker_1': 'Thank you to each and every one of you, city council people.'",
        "'speaker_5': 'For all the time and.'",
        "'speaker_1': 'Effort you put in in your office. There's a major election this spring.'",
        "'speaker_5': 'And there will.'",
        "'speaker_1': 'Be new faces here in July of 15. But thank you. And I hope that some of your constituents. Thank you also. Now, as to this courtesy hearing.'",
        "'speaker_5': 'The only thing that concerns one of the things that.'",
        "'speaker_1': 'Concerns me is has the.'",
        "'speaker_5': 'Contract already been signed?'",
        "'speaker_1': 'I have already seen.'",
        "'speaker_5': 'Advertising by CenturyLink and I understood they would not advertise until this the contract was completed. This kind of makes this.'",
        "'speaker_1': 'Courtesy.'",
        "'speaker_5': 'Hearing unnecessary. But the bottom line is Denver at long last has cable.'",
        "'speaker_1': 'Another cable provider. And not only that, this because of this new service, the Communications Workers of America will be assured of jobs for for years to come. And, of course, jobs are good for Denver and what we need.'",
        "'speaker_1': 'I do have a concern.'",
        "'speaker_5': 'That that CenturyLink might start in affluent areas. The rules changed by the FCC in 2008 allow this second entrant.'",
        "'speaker_1': 'To have a different course.'",
        "'speaker_5': 'Than Comcast had.'",
        "'speaker_1': 'However.'",
        "'speaker_5': 'I think the leadership of CenturyLink cares.'",
        "'speaker_1': 'Loud and clear that the city will be.'",
        "'speaker_5': 'Watching them as time goes on. I'm wondering if the if CenturyLink will have.'",
        "'speaker_1': 'To report annually to City Council. For some years, Comcast did that. And there was a way for the public to come to a meeting and voice their concerns.'",
        "'speaker_5': 'And the the agreement, which I understand is ten years.'",
        "'speaker_1': 'Then what is spire ten years from now in the spring is that I understand that should be correct. I know that members.'",
        "'speaker_5': 'Of CenturyLink will.'",
        "'speaker_1': 'Meet with the staff of the city of Denver.'",
        "'speaker_5': 'And I think that's a very good thing. And I would also like.'",
        "'speaker_1': 'To hope that someone from the public at large would be able to attend those meetings to be kind of an overseer in that process. Thank you very much.'",
        "'speaker_3': 'Thank you, Miss Horwich. Richard Schutz.'",
        "'speaker_11': 'Hello. I'm Rick shoots. I live in the Flat Park neighborhood in Denver. Thank you for hearing me tonight. CenturyLink has been installing new fiber optic communication equipment in my neighborhood. The new equipment supports higher speed communication technologies, cable television, and makes CenturyLink more competitive with Comcast.'",
        "'speaker_11': 'We. As consumers usually come out ahead when there is competition. And I support this. I do. However, the installation has a lot to be desired. CenturyLink has chosen to put four or five separate boxes at some sites. The result is that each site has a standalone Excel Power meter, a fiber optic equipment box, a DSL box, and'",
        "'speaker_11': 'one or two patch panels. There's at least one of these sites within a four block radius of each other. Most of the time, these boxes end up in the utility right of way strip between the sidewalk and the street, which is often landscaped by the property owner.'",
        "'speaker_11': 'I think the installations look too industrial and out of place in our neighborhoods. Our neighborhood also has Comcast service, but I have never seen any of the Comcast equipment or if I did see the Comcast equipment, it did not look out of place or bad to me.'",
        "'speaker_11': 'So why can Comcast provide service and not trash out the neighborhood with their equipment? And CenturyLink does. Another problem with the CenturyLink infrastructure is it becomes a graffiti magnet that is never, ever, ever cleaned off by CenturyLink people.'",
        "'speaker_11': 'This really adds insult to injury. The neighborhoods really don't need industrial looking equipment covered in graffiti. The public right away. In the public right away. CenturyLink has all the rights but none of the responsibility. I would like to question if the right of way is the best place for this kind of equipment.'",
        "'speaker_11': 'This equipment's foothold or sorry, this equipment's footprint is increasing in size and the number of sites. In many cases, the public right of way is the front of the homes and therefore the front of the neighborhoods. But this equipment looks like something that belongs in the alleys.'",
        "'speaker_11': 'Placing CenturyLink equipment in the right away might have sounded like a good idea in the past, but after seeing the reality of this new implementation, I think it was a bad mistake. Can we have as part of the conversation with CenturyLink, how can their infrastructure be more compatible with neighborhood character and not look so industrial during permitting'",
        "'speaker_11': '? Can we have better oversight where this equipment is going to be placed? And finally, at a minimum, can we hold CenturyLink responsible to clean the graffiti off of their equipment? Thanks for listening to me, and thank you for your service to the city.'",
        "'speaker_3': 'Thank you, Mr. Schmidt. That concludes our speakers. Now time for questions from many members of council. Council councilmember.'",
        "'speaker_6': 'Well, thank you, Mr. President. We've had some good questions. And Mr. Campbell, would you like to come and address some of those specifically from the last two speakers, Nancy and Richard? And why don't you start with the last comments from Richard in terms of the equipment, the you know, the looks of it, the graffiti, etc..'",
        "'speaker_6': 'Would you mind addressing.'",
        "'speaker_10': 'No. Councilman Brown. Of the equipment that we use is actually pretty similar to what the the incumbent uses and other utility providers. Obviously when we've we've been installing equipment in the public rights of way in the city county for a hundred years now.'",
        "'speaker_10': 'And we obviously have to comply with all of your right away rules and regulations. And and we do that every day. If there's an issue with a particular box that we've installed, we'd love to hear about that. We've been doing it for a long time.'",
        "'speaker_10': 'So I'm not sure, you know, what, what the scope of the graffiti issue is. Obviously, it's it's an issue throughout the city or not on our boxes, but on other people's as well. And we certainly try and work as hard as we can as a company to ensure that we minimize our impact on the right of away'",
        "'speaker_10': '. The equipment.'",
        "'speaker_6': 'That you're currently installing in.'",
        "'speaker_10': 'Plant Park?'",
        "'speaker_6': 'Is that for phones? Phone service?'",
        "'speaker_10': 'It would be for both phone, internet. And then when we have the franchise agreement would be able to do for cable television as well. So I think all three services are going through those boxes.'",
        "'speaker_6': 'Okay. And then getting back to Nancy's concern, she asked a very basic question. No contract has been.'",
        "'speaker_10': 'Signed, right? No contract has been signed. With respect to the advertising. There probably is advertising on TV that residents of Denver and Aurora and other places we don't have a franchise are seeing. When you purchase advertising, you purchase it on what's called a DMA wide basis.'",
        "'speaker_10': 'So when we buy it, we're buying it for the city and county of Denver as a whole. So, yes, there are those places where you'll see we can't sell the product. I've actually seen the advertising as well. We just can't sell it until we get a franchise agreement.'",
        "'speaker_10': 'Okay. Thank you. You're welcome.'",
        "'speaker_3': 'Thank you. Councilman Brown. Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. We had a lot of questions about this issue in committee and actually had asked that our city team and CenturyLink go back and try to define what ended up being language that speaks to significant.'",
        "'speaker_5': 'And I'd like to ask either David Broadwell or Frank Dayton to describe the process by which the city will look at how we're going to ensure that cherry picking of fluent neighborhoods does not happen and that we are looking at more equitable distribution or deployment of services that will be provided by CenturyLink across the city.'",
        "'speaker_10': 'Well, thank you for the question. I'll respond to the process. And then with regards to the words significant, I'll leave that to David Broadwell. So what the intent is in the language of the contract, we can request from CenturyLink on demand where their service availability exists and who they provide service to.'",
        "'speaker_10': 'What we would do at that point then is is to bring that information, that data into what we call our geospatial system, which is generation of maps. Those maps would overlay the footprint of service availability throughout the entire city and county of Denver down to the home level.'",
        "'speaker_10': 'But what we will do is we'll also put on underneath it is the median income above and below. So we'll flag that and go below median income. One color above the median income will be another color. And then we'll be able to see the percentage that's above and a percentage that is below.'",
        "'speaker_10': 'We will track that and we will monitor the trends as they continue to grow. We've done some reference checks throughout some other cities with regards to how they monitor and what they've seen and everything that CenturyLink had done thus far.'",
        "'speaker_10': 'They've exceeded by by an extreme amount. So so that's how we'll monitor it going forward. And then we've got those quarterly meetings. We'll also put this information out for the public to take a look at as well on our on our website.'",
        "'speaker_10': 'So if we get any feedback, we could take that and consider that as well when we discuss that with CenturyLink.'",
        "'speaker_5': 'Thank you. David, do you want to describe.'",
        "'speaker_13': 'I'll comment briefly. Again, David Broadwell, assistant city attorney, the negotiation. And let me just back up for a moment. Took place over the course of June, all the way up until now. So there have been months of negotiation, most of which is centered on this very issue in terms of how specific CenturyLink was willing to be, in'",
        "'speaker_13': 'terms of exactly where and exactly what rate its service deployment was going to be occurring. And what you see in the final product was the best results we could achieve in that negotiation. Which one of the speakers said it's the same as the other cities in the front range and it certainly is not.'",
        "'speaker_13': 'There are there are multiple differences in our service delivery provisions that vary quite a bit from some of the other communities, particularly just to the south. But at any rate, that the one of the last changes before bringing the bill forward to the floor today was this we were seeking all along geographic distribution, some element of geographic'",
        "'speaker_13': 'distribution so that we wouldn't have services being built from south to north as they were serving communities south of Denver. We certainly didn't want to see 20 or 30% penetration of the Denver market, all in South Denver. We wanted to see it spread around town, so that's in there.'",
        "'speaker_13': 'And then one of the last amendments was to say, and in the course of deployment, there has to be demonstrable, significant investment in lower income neighborhoods. The word significant is is admittedly subjective. It's not a specific, measurable performance standard where X numbers of households in Y numbers of lower income neighborhoods would have to be served.'",
        "'speaker_13': 'But it's. Not without meaning. The word significant is used in hundreds of state statutes and has been interpreted by the courts on a number of occasions to have a meaning which, as I explained in committee, means not token, not minimal, not trivial.'",
        "'speaker_13': 'It has to be something beyond just a token effort in terms of the deployment in the lower income neighborhoods. It has to be substantial and above some trivial or minimal level. Does it have to be a 50, 50, 50 type of a pure, exact equal parity?'",
        "'speaker_13': 'No, it just has to be something beyond minimal that we can actually see and perceive and address as Mr. de Noun indicated. One of the things we've done in our due diligence is just to get a sense for other communities like Colorado Springs and elsewhere in the western United States to get a sense for what this company's'",
        "'speaker_13': 'deployment has been. And we're encouraged that there doesn't appear to be cherry picking, there does appear to be broad geographic distribution in the other cities that they worked, and certainly above the level of what we would probably define a significant in terms of service to lower income neighborhoods as well as higher income neighborhoods.'",
        "'speaker_5': 'So I have one additional question, if I may, Mr. President, and this is to the companion Bill. It's actually companion in terms of timing in which it's been filed. It's actually the the ordinance that basically addresses the role that city the city plays in overseeing of cable TV franchise agreements.'",
        "'speaker_5': 'So, David, can you speak to what the. I'm looking at the language here. The second. The certain provisions that City Council would have involvement in reviewing and looking at with the committee that's going to look at the enforcement of the cable franchise.'",
        "'speaker_13': 'Yes. And at your direction and Councilwoman Rob's direction, we brought this forward at the same time to make sure formally in ordinance council will have a seat at the table in terms of overseeing compliance with all the performance standards in the franchise on an ongoing basis, but with a new specific reference to this issue.'",
        "'speaker_13': 'And that is fair, fair roll out of service to lower income neighborhoods as well as as any other neighborhood in town and no discrimination on the basis of income levels of a particular neighborhood. Up until a few years ago.'",
        "'speaker_13': 'We had an interesting situation in Denver where cable franchise administration was entirely under the city council, but it was moved out of your purview just a few years ago for different reasons and placed in technology services in the executive branch.'",
        "'speaker_13': 'And when we moved it over, we kind of said from now on, franchise enforcement will be an executive branch function. Now by virtue of the companion ordinance, you're reading it back a little bit in terms of adding some council involvement again and to sitting side by side with Mr. De Doan and with his department in terms of'",
        "'speaker_13': 'regular monitoring of the performance of the franchisees for franchise obligations. One of the speakers referred to a broader citizen involvement in that process that is not directly addressed in the ordinance. If you ever wanted to have more conversation with technology services about having some broader citizen oversight, I'll let Mr. De don't speak for himself about whether that's'",
        "'speaker_13': 'something that that he would entertain as to add even more transparency to the process.'",
        "'speaker_5': 'Thank you. I have no further questions at this time.'",
        "'speaker_3': 'Thank you, Councilwoman Ortega. Councilwoman Kenney.'",
        "'speaker_1': 'Thank you, Mr. President. Several of my colleagues asked some of the questions that I had about the fairness, as well as council monitoring. But I wanted to dig in to some of the questions that folks had about the amount of build out.'",
        "'speaker_1': 'So there was a lot of concern expressed about the remote terminals, which only serve 400 to 500 households, but that's not the only provision requiring buildout. And so, Mr. Dayton, if you could please clarify, if CenturyLink only built it one remote terminal in each council district and they never met the 27.5% threshold, would they be satisfying the'",
        "'speaker_1': 'terms of this agreement and why not? What provisions are in play?'",
        "'speaker_10': 'There's another provision that says they need to cover at least 15% of the city and county of Denver as a whole. If you were to put and this is all obviously rough estimates, if you were to put one remote terminal in each district, that would only represent roughly 2%.'",
        "'speaker_10': 'So they would actually distribute another 13.'",
        "'speaker_1': 'So if I may just make sure I'm understanding that correctly. What that means is regardless of market penetration, they will need to build out to 15% of the customers households in this city by the time the two years are up.'",
        "'speaker_1': 'The first two years.'",
        "'speaker_10': 'You're correct.'",
        "'speaker_1': 'Okay. Thank you. The second question I had is for Jim. If you could come up so to Mr. Chutes, if I'm saying that correctly. I'm sorry, Mr. Schuetz, your questions I want to get you're kind of vague in your answer.'",
        "'speaker_1': 'And so here's what I wanted to do, is to ask you if you would commit to contacting or sharing information with each of our council offices, with the phone number where we would report any graffiti that's on your boxes and confirm that indeed there are personnel in your company or through a contractor that are assigned to graffiti'",
        "'speaker_1': 'abatement. And then if you could also just share with us what, if any, notification requirements you use for property owners so that we can all be informed of what cause, you know, people who are having a box put in that impacts their property, what notice they should be getting, who they will hear it from so that we'",
        "'speaker_1': 'can just make sure that we understand the procedures you're using. And if we get a complaint about graffiti, who we call so that we have not you know, we're not looking at the phone number in the white pages, but we have a maintenance office or some other point of responsibility to take those concerns.'",
        "'speaker_1': 'Would you be willing to get us that information between now and the next. Yes, vote on this? That would be very.'",
        "'speaker_10': 'That's in with respect to what our internal procedures are regarding graffiti, I'm going to be honest with you. I don't know.'",
        "'speaker_1': 'Understand. Get it? If you can get it set after tonight, give you a short time to dig into that. We will do that.'",
        "'speaker_10': 'And you can call me.'",
        "'speaker_1': 'That's all right. Thank you very much. Those are my questions, Mr. President.'",
        "'speaker_3': 'Thank you, Councilman. Can each. Councilman Brooks.'",
        "'speaker_7': 'Thank you, Mr. President. Jim, you can come on up here. I'm a very competitive person, and so I love competition. I think it's really important that we have this, especially in business. But I also want folks to, you know, start off from the same playing field.'",
        "'speaker_7': 'And so I just want you to answer the question, why is it so tough? To commit to universal coverage for business.'",
        "'speaker_10': 'Councilman Brooks is a second entrant. Obviously, every subscriber we acquire currently has a relationship with someone else. I mean, to go back to 1984 when the incumbent first signed, that's their franchise at that time, first of all, franchises were actually exclusive between 84 and 92.'",
        "'speaker_10': 'So when they originally signed up, the federal law prohibited this city council from signing a franchise agreement with someone else. They eliminated that in 92. And there's still no any no competitive franchises in Denver. There was one for a short period of time with a small company.'",
        "'speaker_10': 'So as a second entrant in any market like this and I'll flip this to the telephone side, if I may, Councilman Brooks, when we had the monopoly, we served 100% of the market and they opened up our markets in 1996.'",
        "'speaker_10': 'At the time, competitive local exchange providers and cable companies entered the telephone market. And the first thing that they said, including predecessors of this incumbent, is we we can't agree to any build out because there's no second entrant that would ever commit to that type of capital upfront before you have a subscriber on the FCC.'",
        "'speaker_10': 'And every state commission agreed with them. They had zero buildout requirements. And now here we are eight years later, and competitive providers have taken over 75% of our market share. That same truth holds for the video side as a second entrant.'",
        "'speaker_10': 'We we as a company and we answer to our shareholders could never commit to a $500 million billion dollar build over a short period of time entering a market where there is an incumbent with a 40 year head start in a contract.'",
        "'speaker_10': 'And that's sort of the policy behind why we've done this. I would point out what Mr. de Doan said, and I think David alluded to it, even though we are agreeing to a smaller number initially, and I would point out that's in two years the South Denver franchises are three.'",
        "'speaker_10': 'So that's 44,000 homes we have to hit. We'll go beyond that. But to put it in a contract that where we're subject to penalties, where we're subject to franchise revocation and all the the bad things with go with breaching a contract, there's really no second entrant that's ever done that.'",
        "'speaker_10': 'Yeah.'",
        "'speaker_7': 'And so in your home market, you've never done a universal covered. Let me let me ask Mr. Duncan. Thanks, Jim. Appreciate it. I mean, if you think about nationwide, what we have and, you know, obviously there's new federal laws that prohibit us from from making certain businesses do certain commitments.'",
        "'speaker_7': 'But if you look, is there any other second entrant who's who's had universal coverage?'",
        "'speaker_10': 'Not that I'm aware of.'",
        "'speaker_13': 'Councilman Brooks, we've seen franchises, particularly back east, with another company, a different company, Verizon, where they have agreed to a universal service requirement over a period of seven or eight years. Often it's a is that there's a set time.'",
        "'speaker_13': 'They have to do it. But these are franchises we saw negotiated in the 070809 time period where at least that company in some locations has agreed to do it. But we don't know of another example of CenturyLink agreeing to do it in recent years.'",
        "'speaker_7': 'Okay. So so let me just clarify. This was 070809 with Verizon. But since 20 1314, there's been no other company who's done that.'",
        "'speaker_13': 'I'm afraid I'm going to be at a loss. I haven't kept up totally with everything exactly going on. I was talking to my counterparts in Portland just this past week, but I can't say comprehensively around the country in the last couple of years that the ones I've reviewed have tended to come from that time period a few'",
        "'speaker_13': 'years ago.'",
        "'speaker_7': 'David That's okay. You can't know every single thing, so you're, you're given permission. Okay. One one more quick question. And I think, Councilwoman, can each ask this question. But I just wanted to clarify this. The remote terminals. Jim, real quick, I.'",
        "'speaker_10': 'Don't need to go to the gym tonight.'",
        "'speaker_7': 'So, yeah, the remote terminals cover how many households?'",
        "'speaker_10': 'About 500 homes. Okay. For remote terminal, that's in about 500.'",
        "'speaker_7': 'Okay. So, yeah. All right. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Brooks. Councilman Levitt.'",
        "'speaker_9': 'Thank you, Mr. President. I wanted to follow up on Mr. Schuetz question about the the placement of those terminals and or the the switch cabinets. And I'm looking around and Kevin Magner was here earlier, but he's no longer here.'",
        "'speaker_9': 'So maybe I'll just sort of throw this out. You know, you get rights to operate in the right of way and the ideal location for you might be dramatically suboptimal for nearby neighbors. Whereas a slightly less ideal location for you could actually be a dramatic improvement for neighbors.'",
        "'speaker_9': 'I don't know what the system is for establishing that. Do you guys just, you know, put in a permit to permit application? Here's where we want to. Is there any sort of thought or interaction with public works about, you know, where would be a better location, any dickering over those locations?'",
        "'speaker_9': 'You understand that dynamic on display?'",
        "'speaker_10': 'Councilman Everett, I do not mind.'",
        "'speaker_9': 'Okay. Well, it's slightly less good to put it there. That's fine. We'll do that. And that would make it a whole lot better for Mr. Schrute. We're not just, you know, helping him out.'",
        "'speaker_10': 'We're helping. No, I understood it. But Councilman Nevett, obviously, even though we do have access to the right away as as the traditional incumbent monopoly, we don't we can't really run around the right away and toss stuff in there without talking to your public works department.'",
        "'speaker_10': 'So the process we're following is yours. And so I imagine some locations get approved quicker than others. I'm sure I'm not speak for our network. I absolutely imagine there has been negotiations back and forth. Hey, can you put it here?'",
        "'speaker_10': 'Do you mind moving it here as a result of the notification? I mean, we've got lots of boxes out there, so I can't imagine there's been a time where the city hasn't said, can you move it in the right away?'",
        "'speaker_10': 'And I'm sure we've agreed to do that.'",
        "'speaker_6': 'Okay. Thanks. Thank you.'",
        "'speaker_3': 'Thank you. Councilman. Councilwoman Robb.'",
        "'speaker_1': 'Thank you, Mr. President. Yeah. Perfect. Segway from Councilman Nevitt. I actually like so many of our council districts, I imagine every district has dealt with boxes that were optimal locations in the right away. And what I learned in the last experience in my district is the city does not require permits for boxes under four feet in height'",
        "'speaker_1': ', and your boxes are getting smaller, but the holes in the ground are getting deeper. So I do think it's something that the city's got to look to as well. And I think we have some work to do in the next week on that, because the last box that went in in my district should have been run by'",
        "'speaker_1': 'forestry, but it was under four feet high, even though it was a five feet hole in the ground and the damage to tree roots was substantial. Now, you guys were great in, came out and changed things, but it was sort of hard to put the roots back.'",
        "'speaker_1': 'Oh, hopefully the tree will live. So I think that Mr. Schuetz has raised a really good question and I think I'm supposed to be answering it, asking a question here. So let me let me just ask if you would be amenable to working with the city on the boxes that are under four feet high in terms of'",
        "'speaker_1': 'permitting.'",
        "'speaker_6': 'We we will work.'",
        "'speaker_10': 'With you any way we can. I absolutely, councilwoman.'",
        "'speaker_1': 'Okay. Thank you for that. And then secondly, it's amazing how much we can talk about this in committee. And certain questions don't come up until the public hearing. This is probably for Frank de Doan in our Comcast franchise, I believe we had auxiliary legislation about customer service standards.'",
        "'speaker_1': 'Do we have that same those same standards with CenturyLink?'",
        "'speaker_10': 'I believe they're identical. But I just heard David.'",
        "'speaker_13': 'Yes, the customer service standards were adopted by ordinance to be applicable to any cable service provider in Denver.'",
        "'speaker_1': 'That's why we.'",
        "'speaker_13': 'Don't have to present or future. But so they are applicable and they'll be physically attached to this franchise as an attachment. And they are identical for both companies if if this franchise is granted.'",
        "'speaker_1': 'Okay. And I ask this because I think in the most recent Comcast franchise, we stopped the annual hearings in. So that's not in it. But what is the route for a citizen to complain about service from whatever cable provider?'",
        "'speaker_1': 'What how does a citizen do that?'",
        "'speaker_10': 'There's today I don't know the number off the top of my head, but there's a number that they can call which comes to my agency. And then we contact whoever the vendor is and communicate with them. And then we follow up and make sure that the issues were addressed.'",
        "'speaker_1': 'And can they do that on the Internet as well as is there a place on the Denver gov site? I'm looking.'",
        "'speaker_10': 'For to saw the Denver gov so I can get that information.'",
        "'speaker_1': 'Again. And can you track the complaints or do you track the complaints so that council, if they wanted an annual report, could could get that from you?'",
        "'speaker_10': 'Absolutely. We tracked them all the way through resolution.'",
        "'speaker_1': 'Okay. Thank you very much.'",
        "'speaker_3': 'Thank you, counsel. And we're comfortable in the mantra.'",
        "'speaker_5': 'Thank you, Mr. President. Like like Councilwoman Robb. I'm concerned about the customer service. I recently called CenturyLink because I needed to get service, and it wasn't a great experience. So can you can you walk me through and assure me that because what you're saying is it's after the fact.'",
        "'speaker_5': 'You're talking about well, you know, if somebody complains, we'll follow it and things like that. But you're sitting here asking for us to vote on on this. And I worry about how people are going to be treated through that and how many you know, how much it's going to cost and how much you're going to be bumped'",
        "'speaker_5': 'around. And also the wait time for them to get the service should this go forward.'",
        "'speaker_10': 'QUESTION Thank you, counsel. And obviously, that's your primary goal as regulators to ensure that the customers receive a good experience in a competitive environment, which we're trying to substantially increase that in Denver. Most people now will have the ability to not walk, but maybe they'll walk with their feet as opposed to call in the city.'",
        "'speaker_10': 'They'll actually be able to call another provider is a competitive you know, we're entering we pass now over two and a half million homes. And as I said, every subscriber we pick up currently has a relationship with somebody else.'",
        "'speaker_10': 'So if our customer service isn't up to speed.'",
        "'speaker_5': 'Doesn't that mean.'",
        "'speaker_10': 'That means that means when they when the incumbent built in 1984, there were no cable subscribers, they were guaranteed every mile of plant they built. Everyone that subscribed is going to subscribe to them. Now we're entering a market where they've had a 40 year head start, so if our customer service isn't good, then it's not going to'",
        "'speaker_10': 'be really a city issue. We're not going to do very well in the market in a competitive marketplace, so it behooves us to have the best customer experience possible. Now that being said, I'd be happy to take offline what your experience was, if there's anything I can do to fix it, but it's incumbent upon us to do'",
        "'speaker_10': 'a good job.'",
        "'speaker_5': 'Of course it is like. Of course it is. But that doesn't always happen. And I you know, I would like I would like to hear, does it need to be. Well, if you can. I mean, I think people need to feel like when they call that, they're going to be treated special and that they're going to get'",
        "'speaker_5': 'the service that they that they want and not have to eventually complain and do that because people work so hard. And if they're on hold for a half hour waiting for service, you know that's not right either. So do you.'",
        "'speaker_5': 'And also the other question, so if you could tell me how that would work. And then also, will they be calling when they call? Are they calling locally or are they calling somewhere else in the United States.'",
        "'speaker_10': 'On new orders, on prisms? Some of those calls, the incoming calls will be local in nature. Again, all CWA jobs, you know, we have 17 million subscribers, the incoming, as you know, 35 million subscribers. We take pride in our customer service.'",
        "'speaker_10': 'Have we tripped up? I, I assume we have. And we do everything in our power to fix any problem that might exist, like any provider in the marketplace. But obviously, as I said, as we're entering this market, trying to get people to come to us from another provider if we don't.'",
        "'speaker_10': 'Do a good job. The market's going to speak and it's not going to be a city or a government issue. It's going to be a market issue.'",
        "'speaker_5': 'So so right now you don't. I've asked twice for a customer service. What will it be like when someone calls? What is good customer service to me?'",
        "'speaker_10': 'Well, according to the the guidelines, obviously, all calls have to be answered within 90%, within 30 seconds. Obviously, then our salespeople, if they're calling into order PRISM, I'm sure they're going to try and get them to bundle as much as they can.'",
        "'speaker_10': 'They're going to try and offer the higher speeds on the Internet, because the more products you have from a customer, if they're you know, if if we have a customer that has two products, the likelihood they stay with us for a longer period, it grows.'",
        "'speaker_10': 'So we're going to be offering, you know, I hope our representatives, we're telling them all the products and service we offer, the different pricing packages, the different levels, and. I don't know if that specifically answers your question. I mean, when somewhere every conversation with a customer service representative is a little bit different when people call in.'",
        "'speaker_10': 'But.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman Monteiro. Councilman Ortega's okay if I go to Councilman Lopez since he hadn't had the. Thank you. Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. I was going to ask you a question if you. I understand some of the worries about services in areas where there they're very low income. And I understand some of the questions now. My question would be is but understanding what the franchise agreement is saying and, you know, looking at these areas, I think'",
        "'speaker_6': 'the council over the last so many months has expressed some desire to see things leveled out. What has been and I know I heard this in committee, but if you can remind us what has been your work or team plan so so far, what you've been able to do, where you look at going, where you're planning on'",
        "'speaker_6': 'locating some of these services to kind of to equalize that access to that information, to make sure that there's terminals in areas that are not just affluent. What's been some of the work that you've been doing or how have you how are you planning on where do you know where you're going to put these things?'",
        "'speaker_6': 'I mean, sure. How do you know where you're going to put them?'",
        "'speaker_10': 'I think your question I think you asked in committee, what are the factors we look at when we were making our initial investment? Obviously, one of the first is when you start out and you build your beachhead, you want to find out network, that's the least costly to upgrade.'",
        "'speaker_10': 'So we're looking at in part of that is density. If you're going to spend $50 million, you'd rather cover 100,000 homes as opposed to 20. So one of the issues we look at is how many homes are within an area.'",
        "'speaker_10': 'The video market does very well in higher density areas where you have a lot of homes where you pass more that I kind of that increases your penetration rates does does.'",
        "'speaker_6': 'Is that likelier or more universally? The issue or not the issue the the result, whether it's lower income or higher income as is density. The I mean, I know that's a factor, but do you see a difference?'",
        "'speaker_10': 'No. Councilman Lopez, I actually don't. I mean, there are there are dense neighborhoods that cover the wide spectrum of socioeconomics in Denver. So, you know, a household as a household, we want to get access to as many subscribers we can.'",
        "'speaker_10': 'The whole issue of of redlining and cherry picking, I understand it. It is, Frank said I it's never the claims never been made against us. We've never engaged in it. Every city we've launched in, we've made a very significant investment below the median come after the Colorado Springs and other areas.'",
        "'speaker_10': 'So I understand the issue and I think frankly that Staff and City did a very good job during this negotiation process to try and alleviate that concern. And I think Mr. Broadwell said it. This agreement is in fact, different than any other agreement we've ever signed.'",
        "'speaker_6': 'Okay. And I think the last thing if I can, Mr. President, the last thing I asked, you know, some of the work that's been that you guys have been working on, things that you've been planning, what where do you see the gaps existing in Denver and where do you plan on?'",
        "'speaker_6': 'I mean, I know if there's you, you probably don't want to say everything because I guess, you know, there is such thing as competition and and your own competitive bids are competitive.'",
        "'speaker_10': 'And Mr. Dolan has his pencil out ready to write down the neighborhoods. So. So some of the work we've been doing, you saw we announced our gig deployment recently, which is which is an Internet deployment. We're very excited to come into the Villa Park neighborhood and the whole neighborhood as well, where we those subscribers are online today'",
        "'speaker_10': '. And with that service, once we have the ability to sell the video, the ability to offer that to the home, those homes will be immediate in addition to the work we're doing to upgrade remote terminals. So.'",
        "'speaker_6': 'Okay. So where you went into the gig areas, the cable will almost be.'",
        "'speaker_10': 'The only thing that prohibits us from selling cable in the Villa Park neighborhood today is this agreement. We could sell it today.'",
        "'speaker_6': 'Because they're capable. Because of the game.'",
        "'speaker_10': 'Because? Well, because the Internet speeds. We've already done the work on the head end. Really. All the neat thing about Denver, as I said, we have no speed to market issues. Once we have the agreement, we can launch immediately.'",
        "'speaker_10': 'Okay.'",
        "'speaker_6': 'All right.'",
        "'speaker_10': 'Thank you. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_5': 'I'd like to ask Frank to come back up to the microphone. Frank. I know that when you talked about. This franchise being virtually the same as Comcast, I'd like you to just speak briefly to how many of our pick, not the channels, but the organizations that received funding from the franchise still exist.'",
        "'speaker_5': 'It's my recollection that we still have DPS, Terraria, Denver Open Media. Is there another area.'",
        "'speaker_10': 'As of right now that in Denver Media Services?'",
        "'speaker_5': 'Okay. And can you just describe how franchise fees from this from CenturyLink will actually help support those as well?'",
        "'speaker_10': 'Sure. Well, I mean, it's it's a fee of $1.05 per month per customer. It'll it'll be remained to see how much revenue that generates to distribute to those different groups. However, there is one slight difference that maybe David could explain with regards to multi units and how that works.'",
        "'speaker_10': 'But for the most part, I mean, it's still going to be distributed the same way and it will. It remains to be seen how much revenue actually drives.'",
        "'speaker_13': 'The one main difference is that the peg fee under the CenturyLink proposal would, in a congregate living situation like an apartment, house and so forth, be multiplied by the number of units as opposed to being charged one time 105 per month as it is under the Comcast franchise.'",
        "'speaker_13': 'But let me illuminate a little bit more Frank's previous point, which is it's hard to calculate how much additional revenue a major may generate because there's question is if CenturyLink gains a customer, will Comcast lose the customer? Right.'",
        "'speaker_13': 'And so whether or not there will overall be more video customers paying higher and paying more, claiming accumulative fees. It's very speculative at this point because we haven't been in this sort of competitive environment historically. Who knows how it's all going to shake out?'",
        "'speaker_5': 'Well, that may depend on how affordable the rates are. That might entice more customers that don't exist today at all. Would you address whether or not the previous position that was held by Darren Silk is going to be replaced so that as there are complaints that need to follow, these standards are being addressed that there is a'",
        "'speaker_5': 'point person or do you already have a point person who handles any of the cable franchise issues that come through?'",
        "'speaker_10': 'Actually. So it's. Thank you for that question. The actual position that Darren Saki held will not be replaced. The functions have already been distributed. So Julie Martinez is now the acting director of Denver Media Services and she'll manage that.'",
        "'speaker_10': 'Those inbound customer service requests and also the fee agreements with those other organizations like Denver Open Media Services. The other part that we actually incorporated under under my Spanish Control, we have a governance and compliance group that's run by Steven Corey.'",
        "'speaker_10': 'He's our chief information security officer. And there is an actual auditor that sits within several auditors, actually, that sit within his group, but one specifically that's dedicated to a franchise agreement, monitoring it and doing all the data analysis to ensure that.'",
        "'speaker_10': 'And what that does as well is it also kind of separates the two functions. So Denver Media Services actually benefits from the cable peg fees. So I wanted to ensure that there was some kind of outside oversight that was managing that to ensure that, you know, everything was being distributed equitably.'",
        "'speaker_5': 'So have you thought about how council plays a role in working with the IT department in monitoring the compliance?'",
        "'speaker_10': 'Quite honestly, I welcome it just like I do with any other technology, you know, initiatives that we have. You know, I know there's the, you know, the ordinance that's out there right now, the change in, you know, I supported 100% of your feedback is absolutely invaluable.'",
        "'speaker_10': 'You understand what's going on on the ground, on the ground in your and your districts. You know, I understand technology and that's that's really, you know, my area of expertize.'",
        "'speaker_5': 'Thank you. And I just have one last question for David. We've had some concerns expressed that Denver didn't go far enough with the work that we did on this franchise. And I would just like you to help council understand if we would even be in a position to oppose this franchise.'",
        "'speaker_5': 'So can you just speak to that in general?'",
        "'speaker_13': 'Well, the short answer is you could oppose it if you voted down if you choose to, and send us back to the drawing board for more negotiations. You have the option to do that. How much is too much?'",
        "'speaker_13': 'We were talking about subjectivity a while ago. The federal law says we're in a competitive franchise. He wants to come in. Approval shall not be unreasonably withheld. So what is unreasonable? What would be terms that would be unreasonable?'",
        "'speaker_13': 'And so there's a whole range of choices in terms of how hard a bargain you may try to to drive before you say no or where you where you draw the line and so on and so forth. So the much longer answer is, who knows?'",
        "'speaker_13': 'You know, in terms of whether or not there's more to be gained from this deal, the thing that, you know, is implicit in everything we've been talking about here tonight is that a franchise ordinance is different from any other kind of ordinance where further ordinance says you can drive the deal.'",
        "'speaker_13': 'You can you can pass a law forcing people to comply with it. But this is a negotiation. It's a contract as well as being an ordinance. And as such, you have to have willing parties on both sides. And this is the best deal that we could get to as of this point and is presented to you for'",
        "'speaker_13': 'your action. If you were to oppose it and articulate a different way to go, that might just send us back to the table.'",
        "'speaker_5': 'So I do have one last question. This is for Mr. Campbell. I wanted you to clarify. If our negotiating team had asked you to look at anything other than what is on the table today. We had a brief conversation after the last committee.'",
        "'speaker_10': 'Yes, we did. We saw some language. I don't remember it word for word that sort of had a one for one or sort of had some capital requirements in it. And we instead came to the agreement what we'd agreed to in another franchise, which is the significant language.'",
        "'speaker_10': 'So we had seen language I don't remember the exact wording, Councilman, but it had some sort of one for one capital requirement that said, if you build one here, you have to build one there. And we we we you agreed to the significant portion.'",
        "'speaker_10': 'Okay.'",
        "'speaker_5': 'Thank you. You're welcome. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilman Ortega. Any other questions? Scene nine public hearing is now closed. Time for comments. Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Mr. President. I didn't have any questions because I've gone to all the meetings and really given this a lot of thought. And I do appreciate the people who came tonight. They were very succinct and raised very good points on both sides of the issue.'",
        "'speaker_5': 'Like all of them said, they appreciate competition. And I believe competition is a very, very beautiful word. And I'd like for Denver to have it for cable TV. Our proving our predecessors, the previous council members set up cable franchises as non-exclusive in the period that I can remember.'",
        "'speaker_5': 'You may go back Father wisely. They wanted and expected other companies to enter the competitive arena under basically the same rules. Unfortunately, that's not what we have in front of us today in this CenturyLink franchise. It's a tortured agreement and a long way from what those previous councils envisioned.'",
        "'speaker_5': 'The key issue is buildout or lack thereof. I'd feel far better if I could go back to my area and say yes. Here's a small area that will get. The CenturyLink franchise opportunity to have some competition. You guys across the street, you guys down the blocks.'",
        "'speaker_5': 'I don't know if you'll ever get it. I agreed to something that I don't know if you'll ever benefit from or not. Just don't know. And that is comfort comfortable to me. Government should foster a level playing field.'",
        "'speaker_5': 'That also is the concept the voters approved in all Comcast or other iterations of the the Comcast history franchises that they were allowed to vote on per the city charter. Now, a number of things have changed. Apparently a Boulder court case, which is last time I look, is not a decision from the Supreme Court.'",
        "'speaker_5': 'And so therefore not definitive. And federal legislation has led our legal team to advise us that a level playing field is no longer a viable requirement. As much as I respect our legal advisors and I truly do. Other parts of the company have followed government not picking winners and losers.'",
        "'speaker_5': 'One was just referenced. Philadelphia, that's the eastern city that I remember, was given a franchise to a second entrant that follows all the principles of a level playing field. The entrant was just given more time to get to the final goal of build out, which I consider to be a very reasonable accommodation and would have been jumping'",
        "'speaker_5': 'up and down if that had been the agreement. One of the most troubling changes our legal team recommends loses me completely. However, it flies in the face of an oath I took when I was sworn into office to follow the city charter.'",
        "'speaker_5': 'The charter requires a public vote to grant cable franchises. If that is no longer viable based on our legal team, Denver should have asked the voters to change that charter provision when we made other charter changes in 2012.'",
        "'speaker_5': 'Despite my suggestion then, there were no takers then or now. Now we have a new franchise request to grant a much sweeter deal on build out and the voters are cut out of the decision making completely. Especially where the deal being offered isn't the same as the one offered to the previous provider.'",
        "'speaker_5': 'The voters should have a say. As so often happens, I may stand alone on this particular concern, but the inequity of this deal. And the circumvention of voter approval required by the city charter lead me to cast a no vote tonight.'",
        "'speaker_3': 'Thank you, Councilwoman. Thoughts, Councilman Lopez.'",
        "'speaker_6': 'Thank you, Mr. President. You know, seven years on this council, I think, you know, we did. See, we're able to look at these agreements. And the first one where I think I'm fortunate enough to be able to see this process and to see a new company come into the market and create this competition, you know?'",
        "'speaker_6': 'You know, first of all, I just wanted to commend our council president, Chris Herndon, for representing the council on our behalf in the negotiations. But being able to really look at the franchise agreement, we want to really understand this is very new.'",
        "'speaker_6': 'This is new to a lot of us. You weren't around the first time mile high cable in and when it went into the works. I am I shared a lot of the same concerns. I do share a lot of concerns, same concerns that some of the folks that Reverend Denver and Reverend Denver.'",
        "'speaker_6': 'That's your new nickname. Now, Reverend Demmer shares. I do. I come from Westwood. I come from an area where I think there was a few areas where we were completely blacked out cable. And the only way you can get it as humanely crawl up that tower and do it yourself, which a lot of people used to do'",
        "'speaker_6': ', but long gone are those days. I could tell you that right on my block off of Sixth and Knox in that area, I was in the alley throwing the trash one day and I saw a truck come by.'",
        "'speaker_6': 'Installing what he was saying was new Internet. And I had been living in this neighborhood for a while. I lived throughout the district. But the neighborhood, he was installing this Internet. It was a villa park. And the fact that they were already there.'",
        "'speaker_6': 'Installing this gig service. Now I know that in a lot of the neighborhoods I represent Villa Park struggles. And I don't like to say one more than the other, but it really does. And so it made me smile, knowing that they have access to this Internet now.'",
        "'speaker_6': 'Had nothing to do with the councilman living there, had nothing to do with anything except for the fact that it was an area that they recognized and needed the service. I'm happy to see it going. And, you know, I wouldn't be surprised if the whole neighborhood and neighborhoods to the south, although also share into it, because now'",
        "'speaker_6': 'that there's this infrastructure there, I know it's going to grow. What's around that area? Sun Valley Avenue. Westwood, Barnum, Valverde, some of the poorer areas in my district. And I know that competition will help. It helps the consumer.'",
        "'speaker_6': 'It helps folks have access to information that they need to. You know, we've been working diligently with the emergency broadcast system to make sure it's in Spanish. Now, I know it's going to be in Spanish no matter where who you order your cable with.'",
        "'speaker_6': 'Right. It's going to be broadcasted. I know that. You know, I've seen CenturyLink and some of the areas of my district. You know, not only support the organizations in the district, but also open up new new infrastructure banking service.'",
        "'speaker_6': 'So, you know, I do have you know, do I think it's going to happen overnight? Absolutely not. Do I think it's going to be completely universal? Absolutely not. But I think we'll get close. And I think I feel I absolutely feel pretty confident with this agreement because I know I'm not the only council district that has folks'",
        "'speaker_6': 'who are struggling. And I know that this agreement speaks to other council districts. And I have already seen presence in the east side with this infrastructure. So, you know, I wanted to, you know, just on the cable side, thank you for your work and thank you for prioritizing that area town that helps me be able to look'",
        "'speaker_6': 'at this agreement and say, okay. I think that there's a good track record here and I'm going to cast my vote yes for it. And also because I know there's a lot of workers out there that are installing this and those are good union jobs.'",
        "'speaker_6': 'And I got to say, thank you for that as well, too. Those jobs are jobs that are forever. People retiring from those jobs have health care from those jobs. And I know that there's a knocking on doors. I do see a lot of your employees in my district.'",
        "'speaker_6': 'And so, you know, I'm a yes vote tonight and I'll be a yes vote for this franchise agreement the next time it's up. Thank you, Mr. President.'",
        "'speaker_3': 'Thank you, Councilman Lopez. Councilwoman, can each.'",
        "'speaker_1': 'Thank you, Mr. President. I wanted to start by just thanking a number of my colleagues. This contract has taken a lot of input from this council, starting with Councilman Herndon. You know, there is not many other, if any models where you have a per council district build out.'",
        "'speaker_1': 'And I know that that was the result of his representation and coming back and forth for feedback from us during the negotiations. Councilwoman Ortega and Councilwoman Robb making sure that council had a role in the monitoring and the implementation of this agreement.'",
        "'speaker_1': 'That bill, which was, you know, really conceived of two or three weeks ago and is now being we actually council but 151 which we voted on in the block votes earlier tonight. Councilman Nevett, you know, although an unrelated issue, the question of right away and, you know, taking things wires off poles and burying them unrelated to this'",
        "'speaker_1': 'franchise but, you know, connected to this company. And so, you know, anyone who thinks that there hasn't been pushing on this particular contract, you know, one may not be aware or two just hasn't been able to follow the detail.'",
        "'speaker_1': 'There has been a number of ways that this council and the colleagues I've named and probably others that I may not just be aware of have impacted this. So I just want to say thank you to my colleagues for that representation in terms of the agreement.'",
        "'speaker_1': 'You know, one thing I think that both these providers are incumbent and our new entering have in common is, you know, I've had less than joyous customer service experiences with both of you as well as with most other companies.'",
        "'speaker_1': 'I have to call on the phone these days. I mean, it is really. And so I do I share Councilwoman Montero's concern. I hope everyone ups their game. People do still need to talk to human beings. You cannot do complicated transactions through Internet chat rooms.'",
        "'speaker_1': 'And so I do hope that training standards go up, not just stay the same, but go up for each of these companies. And I do hope that the competition, you know, results in better trained, more responsive, more experienced employees, because I don't think that those employees aren't trying hard.'",
        "'speaker_1': 'I think that they're new. They may be turning over too quickly. They may not have enough time trained before they're taking calls. I don't know what the problem is, but I do think that, you know, that that whole standard is an area that I hope that we monitor closely for all of our providers.'",
        "'speaker_1': 'In terms of this question of, you know, I share that customer service is one area of competition, but you know that for me, the fundamental vote on this on this agreement comes down to the question of whether I can deny anyone in the city competition because I can't guarantee it for everyone.'",
        "'speaker_1': 'I'm having to say that again because it's kind of counterintuitive. But if I said no to this agreement because I can't ensure that every single person in Denver will have a choice, I will be preventing any resident. In Denver from having a choice because there is no other company currently asking to provide services in Denver.'",
        "'speaker_1': 'And this is a really important point. If I were legislating an ordinance about the kind of service provision and the kind of build out requirements that I wanted, I would do what Councilman Fox has suggested. I would write an ordinance that said you should provide service to every single resident of Denver.'",
        "'speaker_1': 'But this is not an ordinance. It's a contract. I have to have agreement from another party. And so that is a factor in the kinds of things that I can deliver to my constituents and in terms of the kinds of things that I can deliver to the city.'",
        "'speaker_1': 'And so for me, the question isn't, could I write a perfect requirement? I'm sure I could. And I also believe that based on my team of city staff and my council president spending a year, maybe more than a year in these negotiations, I, I don't think that would result in provision of any service in Denver, because I'",
        "'speaker_1': 'don't know that I would have a provider who would agree to that. And that is a requirement in this situation. I can't require something unless there is an agreement because this is a contract. So that to me is the fundamental point on which I have to make my decision.'",
        "'speaker_1': 'And so I believe that we have pushed I believe that my colleagues have advocated. I believe that we do have mechanisms to hold this provider accountable. And I, for one, being a little bit of a data obsessed person, will be checking on the overlays and will be, you know, calling constituents and making sure that we have that'",
        "'speaker_1': 'accountability if we run into any discrimination related to income. So with that, I believe that it's our obligation to open the doors to some competition, even if it's imperfect. And I will be supporting this agreement tonight. Thank you.'",
        "'speaker_3': 'Thank you, Councilwoman and Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. I first want to thank all of the speakers who are here tonight, particularly those who also came to our committee and shared their thoughts on all sides on this issue, as well as letters that we received forever in Denver.'",
        "'speaker_5': 'I know you wrote to us on several occasions and thank you for that input because I think that input helped ensure that we were looking at all the key points that we needed to be looking at in this process.'",
        "'speaker_5': 'I want to say thank you to our negotiating team that acted on the city's behalf. Would we like to see the build out more closely defined? Yeah, I think we all would. But again, I think our team advocated for the very best language that they could get agreed to.'",
        "'speaker_5': 'As Councilwoman Cannick just spoke about, I'm comforted by what I am hearing from our team and what we've heard from CenturyLink on what's actually happening on the ground in terms of the commitments that were made and where they're exceeding them.'",
        "'speaker_5': 'In many of our neighboring communities, where they're doing the build out of a franchise agreement. In the past I've sat on a couple of negotiating teams or rounds, I should say, for the CenturyLink contract. I mean, for the Comcast contract.'",
        "'speaker_5': 'And, you know, as as we were going through this process, I was, you know, recollecting all of those different areas that we were able to get agreed to by Comcast. And 99% of those issues were incorporated into this particular franchise.'",
        "'speaker_5': 'And so, again, we know that the sticking point was that 1% it was on on the build out and how how we were going to see that happen. I think with the additional language that we added to this agreement that came back to committee before this bill was filed, it helps ensure that the work that's going to'",
        "'speaker_5': 'be done by Mr. Dayton's team, along with the input from City Council, which by the way now will not just be on this franchise, it will also be on the Comcast franchise because it's related to the overall governing ordinance of cable TV franchise agreements.'",
        "'speaker_5': 'So I believe that we've got the the best deal that we've been able to work out. I'm comforted by the fact that CenturyLink does have good paying jobs for people who are union members. I think that's important for folks in our city who are dealing with increasing prices of housing to be able to afford to live in'",
        "'speaker_5': 'this city. And basically, I also want to thank CenturyLink when when this issue came to committee, we asked you to go out and hold at least one. A public hearing and you held two of them on the same day to ensure that we had some additional input from the public.'",
        "'speaker_5': 'So I appreciate that extra effort that you put into this. So I will be supporting this franchise agreement tonight. And just again, thanks to all who were involved in in bringing this forward and making it happen and looking forward to the competition.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_3': 'Thank you. Councilwoman Ortega, Councilwoman Monteiro.'",
        "'speaker_5': 'Thank you, Mr. President. I want to thank everybody also for coming out tonight. I'm very I'm very conflicted about my vote on this tonight. The issue of significance was brought up by a couple of speakers that are here this evening, and that was explained by our city attorney.'",
        "'speaker_5': 'And I get that I'm not clear yet that significant applies to a high standard of customer service. And I want to I'm going to abstain tonight because I really I agree with Council Councilwoman Kennish about everybody needing to up their game.'",
        "'speaker_5': 'And my experience with Comcast was in that grade. Either it was, you know, but what is that saying? That saying that we what are the standards of customer service? And right now, I don't see any significant, compelling, wonderful, proactive customer service tonight.'",
        "'speaker_5': 'And I want to. Give you a time to tell me what that is. And we are on first reading tonight on public hearing. And I just want you to understand that I feel very strongly about that because people work very, very hard for their money.'",
        "'speaker_5': 'And and I believe that when people call that, they should be treated with dignity. They should be treated with promptness, they should be treated with respect and not bumped around. I don't think that's a lot to ask for people when they call.'",
        "'speaker_5': 'And I and I think that generally my feeling is when I call is I feel like I'm a victim instead of a like a prized customer. And I worry about customer service. And I just want to give you the time if you want to sit down and talk with me, because it didn't really come through clearly.'",
        "'speaker_5': 'And if any company, regardless of competition, blah, blah, blah, if they can't pick up the phone or when somebody calls in, they can't even do that part. Right. What's the point that the the driving force behind quality service is how you treat the people that call.'",
        "'speaker_5': 'And so let's have that conversation. And I just want to understand that tonight. The best I can do is abstain. Thank you.'",
        "'speaker_3': 'Thank you. Councilman Monteiro. Any other comments on Council Bill 83? You know, I will simply add, I sincerely appreciate my council members are complimenting me for the role I had in negotiating team, but I want to compliment them because before I, I sat down with the team, I reached out to each of them and said what was'",
        "'speaker_3': 'important to you for you to see? And I appreciate all their comments. The vast differences that we had. So I had an understanding of how I could better represent council at the table. So I want to one thank them.'",
        "'speaker_3': 'I want to thank Frank Dayton and his team for the work they did as well as David Broadwell who was a part of that and CenturyLink. We've been at this for a while and to to say where we started at and where we are now are two very different points.'",
        "'speaker_3': 'And so I think it's worth noting, I appreciate their willingness to understand what our position was as a city and why it was important to that, because I think that is certainly worth noting. You know, we can complain about the law in regards to build out for a second entrance, but that is the law.'",
        "'speaker_3': 'And I don't think we should it's not something that we can be taken lightly, tends to apply the same standard when we know that we cannot. That's unfair to CenturyLink or any future entrant to to say we want the same thing that the initial interim had.'",
        "'speaker_3': 'When the law specifically tells us that that's something we cannot not do. I believe that the proposal before us, the franchise, does take equity into account, not in the form of a full build out, but the specifications that we are asking of CenturyLink are I definitely think are substantive.'",
        "'speaker_3': 'And the fact that we've noticed that any previous franchise before CenturyLink has gone above and beyond. So to think that for whatever reason they would do something different in Denver, I have not understood why people would think that.'",
        "'speaker_3': 'That's someone who represents far northeast with the largest city council district currently. There should be some concerns about one R.T. in each district. But I want to note that this is with the new council districts where the equity of population is equal, not the way that it is currently right now.'",
        "'speaker_3': 'And as Councilwoman Candace noted, you know, they just hit one R.T. and each of those district, they would be well below that threshold that they are required to hit. And so I think that's another that's another point. We have to ensure that there will be some distribution throughout all spectrums when it comes to income and other.'",
        "'speaker_3': 'So this is something that I feel is worth moving forward, and I would encourage my colleagues to do so. Madam Secretary, roll call.'",
        "'speaker_5': 'Ortega Hi.'",
        "'speaker_4': 'Rob. I Sheppard I Susman Brooks Brown by Fox.'",
        "'speaker_5': 'No.'",
        "'speaker_4': 'Can each i laman Lopez Hi, Monteiro Nevitt.'",
        "'speaker_6': 'Hi.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_3': 'I am secretary. Please close the vote and announce the results.'",
        "'speaker_4': 'Ten Eyes one no and one abstention.'",
        "'speaker_3': 'Tonight one no. One abstention. Council Bill 83 has been ordered published one pre a German announcement. The policy agenda stated on a monday, March 23rd, 2015. There will be a required public hearing on Council Bill 117, amending the Weldon Street Commercial Corridor Cultural District as a district for preservation.'",
        "'speaker_3': 'However, it had been determined that a public hearing is not required on Council Bill 117 related to the One Street Commercial Corridor Cultural District, because the area encompassed by the historic district is not changing. The bill only changes.'",
        "'speaker_3': 'The name of the historic district amends the period of significance for this historic district and adds two contributing structures to the historic district. So there will not be a required public hearing and seeing no other business before this body.'",
        "'speaker_3': 'This meeting is adjourned.'",
        "'speaker_0': 'Denver 365 is always available to show you the complete variety and scope of cultural, sporting, historic and family events offered in Denver and Colorado. Visit.'"
    ]
}