{
    "A proclamation welcoming the 109th National Western Stock Show, Rodeo and Horse Show to Denver. A proclamation welcoming the 109th National Western Stock Show, Rodeo and Horse Show to Denver.": [
        "'speaker_5': 'Thank you, Mr. President. Proclamation number ten is welcoming the 109th National Western Stock Show, Rodeo and Horse Show to Denver. And it reads, Whereas a national Western stock show, Rodeo and Horse Show will ride into town with the kickoff parade in downtown Denver on January 8th and will open the annual event for the 109th time on January'",
        "'speaker_5': '10th with various activities happening through January 25th, 2015. And where is the National Western Stock Show is a treasure and landmark destination to Denver's past. On Wednesday, January 31st, 1906, Mayor Robert W Speer declared that day as Denver's stock show day an official holiday in the city of Denver so that everyone could partake in the first ever'",
        "'speaker_5': 'stock show that ran for six days with an estimated attendance of 15,000 people. And. Whereas, in addition to exhibiting prized livestock farming technology and other important components of Colorado's rich agricultural traditions, the National Western Stock Show's earlier years also included entertainment shows from popular figures like Buffalo Bill, like boxing events from professional fighters such as Jack Dempsey'",
        "'speaker_5': 'and Jess Willard, and tug of war contests between the Denver and Omaha Police Departments. And in 2014, other events were added, such as Cinch Cross Games similar to the X Games where high school kids competed in extreme events with college scholarships.'",
        "'speaker_5': 'And. Whereas, today, the primary mission of the National Western Stock Show is to educate urban and suburban citizens about the importance of understanding and preserving Colorado's Western heritage in agriculture and providing city kids with a hands on experience with farm animals, and to host one of the world's largest professional rodeos and horse shows.'",
        "'speaker_5': 'And it reads. Whereas National Western Stock Show provides ranchers and farmers an opportunity to share the latest information on livestock, including scientific and genetic research. And in addition, more than 350 vendors fill the showgrounds with food and a variety of products for sale.'",
        "'speaker_5': 'And. WHEREAS, now, the National Western Stock Show attracts more than 600,000 visitors annually, and in 2014, 40 states and 38 foreign countries were represented. And more than 15,000 head of horses, cattle, sheep, swine, llamas, bison and other animals were shown.'",
        "'speaker_5': 'And. WHEREAS, the most recent economic impact studies suggest the National Western Center contributes approximately 100 million to the city of Denver's economy. And. Whereas, a new vision has been created for the National Western Stock Show by the city and county of Denver, Western Stock Show Association, Colorado State University, Denver Museum of Nature and Science and History, Colorado'",
        "'speaker_5': '. It brings together life long learning, the arts, entertainment, competition, and. Ms.. Andrew one uni campus that will serve as an international model benefiting the entire community. And. WHEREAS, the National Western Center masterplan sets in motion a new year round destination goal for promoting new out-of-state tourism that will generate job growth for generations to come, and a plan'",
        "'speaker_5': 'that will position Denver as a global player in the 21st century agriculture that will advance knowledge of healthy food production and safety at an international scale. Now, therefore, be it proclaimed by the City of by the Council of City and County of Denver, Section one, that the new vision for the National Western Center advances the city's intent'",
        "'speaker_5': 'to secure and grow the National Western Stock Show for the next 100 years. As the state's largest agricultural convention and unique destination connection Section two that the Denver City Council hereby enthusiastically welcomes the 109th Annual National Western Stock Show, Rodeo and Horse Show to Denver and extends our very best wishes for another exciting and successful year and'",
        "'speaker_5': 'encourages Denver residents to put on their Western wear and enjoy the rodeo. Section three that the city that the clerk of the city and county of Denver shall attest, and a fix the seal of the city and county of Denver to this proclamation and that a copy be transmitted to Paul Andrews, president and CEO of the National'",
        "'speaker_5': 'Western Stock Show, Rodeo and Horse Show.'",
        "'speaker_1': 'Thank you, Councilwoman. Tell your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. I move that proclamation ten be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments from Council Councilwoman Monteiro.'",
        "'speaker_5': 'Thank you. Sorry. Annual start. Your proclamation is always a meaningful marker of the start of the year here in Denver. And I was driving the other day, the other day thinking, okay, so shopping in the holidays are over.'",
        "'speaker_5': 'And yeah, now it's time for the National Western Stock Show. So I'm so excited to be able to sponsor my final proclamation for the stock show this hundred and ninth year. So agriculture, food production and health are taking on you significant and globally and locally food frontiers and is growing at the national western and soon to be'",
        "'speaker_5': 'a year round facility that will position us at the forefront of show casting in leading this field. It's an exciting time at National Western. A draft master plan has been recently released that outlines a future events center in Q, including a commuter rail station stop on the north metro line, year round amenities and A through street named'",
        "'speaker_5': 'Betty Cram Street and paths that reconnect the surrounding neighborhoods. This master plan brings a new vision to the whole area and integrates the surrounding neighborhood plans, as well as Citizen's Advisory Committee, consisting of residents, business and landowners from Globeville, O'Leary and Swans here, along with other stakeholders, were part of the master planning process, offering strategic recommendations that'",
        "'speaker_5': 'will benefit the National Western Center and strengthen the surrounding neighborhoods with a new multimodal connection. The partners with National, Western and the City of Denver include Colorado State University, the Denver Museum of Science and Nature and History. Colorado will bring together lifelong learning, the arts, entertainment, competition and commerce under one unique campus that will serve as an'",
        "'speaker_5': 'international model benefiting the entire community. In addition to new tourism, the National Western Center will generate job growth for generations to come and strengthen our economy. It's my sincere hope that the National Western will be a catalyst for strengthening the health, well-being and education of the residents in the local community and will improve the conditions of the'",
        "'speaker_5': 'neighborhood infrastructure as well. So I am encouraging all of my colleagues to support my final proclamation for National Western Stock Show tonight.'",
        "'speaker_1': 'Thank you, Councilwoman Monteiro. Councilwoman Sussman.'",
        "'speaker_2': 'Thank you, Mr. President. If Councilwoman Monteiro remembers that stock show because shopping is over for Christmas, I remember a stock show because the temperatures hovered around zero degrees. And one of the first things I thought about is it must be stuck show time.'",
        "'speaker_2': 'Congratulations to you on your 109th. Of course, I know you weren't around for the first, but we are so happy to have you leading that effort. And congratulations on a very bold vision for the National Western Center. It's very exciting to read.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Brooks.'",
        "'speaker_0': 'Well, thank you, Mr. President. I tell you what I am really excited for. I just had. I do. I got to work on it. Listen, I love the National Rosenstock Show because it is inclusive of everyone in Denver.'",
        "'speaker_0': 'A city slicker like myself, urbanite like myself, can dress up in little cowboy gear and, you know, fill it home. And my kids love it. It's incredible. And so we're not just saying this over 100 you know, 109 years has been incredible.'",
        "'speaker_0': 'But it's it's it's amazing to see our contemporary society embrace the stock show in the way that we've done. And so thank you, Paul and Paul got it. He gave me a tour of the stock show today. And you don't appreciate what he does until you see the conditions in which the stock show is today.'",
        "'speaker_0': 'And that's why we put this master plan together to envision something that's going to transform this site in the next ten years. And so you've done a meticulous job and in working on that master plan, but at the same time making sure that the stock show is still vibrant and great for our city and our state.'",
        "'speaker_0': 'So thank you so much for your hard work. And my daughter Kenya is looking forward to the rotation call the stock show. She calls it the rodeo. She's looking forward to it. So thank you so much.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilwoman Cheryl.'",
        "'speaker_2': 'Yee ha!'",
        "'speaker_6': 'My Lord, I'm pretty excited about the stock show, too. I was talking to Paul Anders before this and telling him how much writing I've been doing in the last year and I've got my full get up now, so I'm really excited to join the festivities.'",
        "'speaker_6': 'It was interesting that Councilman Sussman mentioned the temperature because usually the temperature for the well, well-known stock show parade is very cold. But I want to let you know, at least according to my phone, that the parade will be on Thursday at noon and I'm showing a balmy 46 degrees.'",
        "'speaker_6': 'So there should be no excuses for why you can't come out and enjoy the fun and festivities. And that starts at high noon and it will mostly be marching down 17th Avenue, which is always a treat to see things that we don't normally see here on our downtown downtown streets in Denver.'",
        "'speaker_6': 'So once again, I'm excited for the kick off of this year's event and very much looking forward to joining the festivities. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Sheppard, any other comments from members of council?'",
        "'speaker_7': 'I am having problems trying to get connected.'",
        "'speaker_1': 'Oh, well, go right ahead, Councilwoman.'",
        "'speaker_7': 'Okay. Sorry. I've been trying to do this, and for some reason, my. My screen is just not working. But I want to. Councilwoman Monteiro said most of everything that needed to be said. But just want to weigh in here as well.'",
        "'speaker_7': 'This is part of my old council district and have long history with National Western Stock Show. And I'm very glad that National Western made a commitment to long term presence here in the Denver community and has engaged in a process over the last few years with the city of Denver to put together the master plan that we're'",
        "'speaker_7': 'going to see in more detail later this month. That committee and later this year will have an opportunity to hear more about what those costs look like and how the the overall plan would be financed. But just the fact that this commitment was made, I think is is huge because national western is part of Denver, has been'",
        "'speaker_7': 'part of the history of the Denver community, not just for the 109 years, but, you know, it's it's part of what Denver is all about. I mean, we were originally a cowtown, and it's one way that people can come and still enjoy that part of our our culture and our history.'",
        "'speaker_7': 'And for those who are done shopping for the holidays, there's an opportunity to do some shopping at National Western. Any of you who really enjoy the Western apparel, which you see many of us dressed in tonight, you know, it's one place where you can go buy boots and skirts and all kinds of different things for the ladies'",
        "'speaker_7': 'anyway. Anyway, congratulations on your 109 years of existence. Look forward to the opportunity to spend some time over at the stock show and heard you on the radio this morning saying, Yeah, so it's a great time. I know this week we have a number of different luncheons and events where people come together and really gear up to'",
        "'speaker_7': 'support the two week, actually three weekend two week event that takes place at National Western, which really is important because at this time of the year, after people have spent during the holidays, you know, it's it's where we get that that shot in the arm to our economy through the events put on by national yesterday.'",
        "'speaker_7': 'So thanks for all you do and look forward to the next couple of weeks.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega, any other comments from members of the council? Seen none. Madam Secretary.'",
        "'speaker_4': 'Raquel Montero. Hi, Nevitt. Hi, Ortega. I'm Rob Shepherd. Susman. Brooks Brown. Hi, Fats. I can eat lemon. Hi, Mr. President.'",
        "'speaker_1': 'Hi. I'm secretary. Please close the voting, announce the results. 1212 ize proclamation ten has been adopted. Councilman Monteiro, is there anyone with the cowboy hat in the audience you want to invite up to the podium to cover?'",
        "'speaker_5': 'I'm looking there. There certainly is. But before I call up Paul Andrews, I wanted Sky Steward. If you could take a message back to Mayor Hancock and just let him know that we appreciate that he heard us loud and clear several years ago when there was a threat that we could you lose national western.'",
        "'speaker_5': 'And since that time, you know, being able to get funding to do the master plan and the Elyria, Swansea neighborhood plans and all the attention that's going into this particular area, if you could just tell them, thank you and we'll keep up the good work.'",
        "'speaker_5': 'Appreciate it. Thank you. So, Mr. Andrews, would you come up to the podium, please? If you want to say hee haw, that's good. I could never say it is cool.'",
        "'speaker_0': 'You know, all my all my ideas go in the radio when I do that radio promotion stuff. But now I'm always so humbled to come here before all of you and and really hear the nice comments that you all have for us.'",
        "'speaker_0': 'And it's really a humbling experience. So thank you all. As you know, this week kicks off the National Western Stock Show 109th edition. What we didn't mention here tonight is that our grand marshal for the parade this Thursday is none other than the king of Park Hill.'",
        "'speaker_0': 'My man, Chauncey Billups is the grand marshal of the parade. So all of you, on that 50 degree day that we're going to have, which I call stock show, whether this Thursday come out route on hometown hero Chauncey and then the start of the national western.'",
        "'speaker_0': 'You know we are the Super Bowl of livestock shows Barnum. We're the most prestigious in the world. We are the largest horse show in North America. I don't know that everyone knows that. With over 13,000 horse entries in our show over 16 days and the shopping experience is second to none as well.'",
        "'speaker_0': 'And we have 29 rodeos that are a plus. Rodeos you will not find a better rodeo. I give all the credit to the board of the nation of Western and to my great staff that puts all this on.'",
        "'speaker_0': 'It's just a great experience to go through. So I think before I in my comments tonight, though, I appreciate the time that you've given me, I would be remiss without thanking the greatness of Council District nine that has been led for many, many years by Judy Monteiro.'",
        "'speaker_0': 'And Judy, I can tell you that when we honor you at this year's rodeo, I will be the first one standing up for your standing ovation. Thank you so much for all you've done for the neighborhood and all you continue to do.'",
        "'speaker_0': 'Sitting in that chair. So thank you from the nation of Western Stock Show so much.'",
        "'speaker_3': 'And we'll see you at the hunt.'",
        "'speaker_0': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Mr. Andrews. Thank you, Councilwoman. All right, we're on to the resolutions. Madam Secretary, please read the resolutions.'"
    ],
    "A bill for an ordinance approving a Purchase and Sale Agreement between the City and County of Denver and Belle Haven Realty Company for property located at 2100 31st Street.\n (FINANCE & SERVICES) Approves a $5,338,820 purchase and sale agreement between the City and Belle Haven Realty Co. for land and improvements located at 2100 31st Street for a new service center for City fleet and the Electronic Engineering Bureau (201419298). The last regularly scheduled Council meeting within the 30-day review period is on 1-20-15.  The Committee approved filing this bill by consent on 12-18-14.": [
        "'speaker_1': 'It has been moved in. Second eight comments. Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Mr. President. This is a bill authorizing the purchase of a building to move the city fleet. And I want to make it clear, I have no problem with the fact that.'",
        "'speaker_8': 'We are purchasing a new.'",
        "'speaker_5': 'Building. Nor do I have a problem with the fact that it's this building.'",
        "'speaker_8': 'What I do have a problem.'",
        "'speaker_5': 'With is the same problem I had with the 911.'",
        "'speaker_8': 'Building purchase.'",
        "'speaker_5': 'The intention.'",
        "'speaker_2': 'Is.'",
        "'speaker_5': 'Some time after.'",
        "'speaker_7': 'This to roll.'",
        "'speaker_5': 'Both of those amounts into ac0p certificate of participation so that we are.'",
        "'speaker_7': 'Now incurring more.'",
        "'speaker_5': 'Debt that the voters have not gotten a chance to weigh in on. And so when we buy things that we cannot pay for and we have to finance through co-pays which bypass the voter, they know that I am help me out.'",
        "'speaker_5': 'Which I will mention one other thing. I think I brought this up before when the accompanying material comes through and it says, is there any.'",
        "'speaker_8': 'Controversy surrounding this ordinance? Perfunctory.'",
        "'speaker_5': 'Somebody just puts no in there. Any time a copy is connected to these purchases, please put. Yes.'",
        "'speaker_1': 'Thank you, Councilman. Thoughts in the comments on or questions for 1115 Councilwoman Monteiro.'",
        "'speaker_5': 'Thank you, Mr. President. I see there's someone here from the city who could just give us a little. Well, give us some information, background information on this.'",
        "'speaker_0': 'Good evening, council members. I'm Jeff Steinberg. I'm the director of the Division of Real Estate. This building is a building that would replace the existing fleet Maintenance and Electronic Engineering Bureau building that's located at 35th and Arkin's Court.'",
        "'speaker_0': 'This building will be a 50,000 foot building. Currently, it's a 70,000 foot building that's being impacted by an RTD take. The building size will be reduced by 20,000 feet, so the net square footage will be 50,000 feet. Councilwoman Fox is correct in that the form of the acquisition will be financed via a copy.'",
        "'speaker_5': 'Nick Grimm. And what agency of the city of Denver is it for?'",
        "'speaker_0': 'It's actually for two agencies. It's for safety and technology services.'",
        "'speaker_5': 'Okay. So Denver police and sheriff.'",
        "'speaker_0': 'It is predominantly Denver police. That's fleet maintenance. So that's where all the police vehicles go to have all of the services done to their vehicles. And then separately, the Electronic Engineering Bureau does all the radios for police vehicles.'",
        "'speaker_0': 'So it's a one stop shop.'",
        "'speaker_5': 'And is it is it accessible then for those particular city agencies to be able to get there? Because currently where they are, it's pretty easy. Down Brighton Boulevard.'",
        "'speaker_0': 'Yeah. I mean, this is down Brighton Boulevard as well. This is a 20/131 Street. So from Brighton Boulevard at 31st, if you go west, it's probably less than a half a mile. So it's in the same general facility as the existing facility.'",
        "'speaker_5': 'And did you do a pretty widespread search for replacement of that property?'",
        "'speaker_0': 'I spent almost a year and a half to two years looking for a replacement. And ultimately what we were looking for is a site that we could lease. The problem was, is that when we found facilities that had a potential to be leased, the amount of capital improvements that we would have to put in, it was several'",
        "'speaker_0': 'million dollars. And it didn't make sense for the city to spend that much money in capital improvements on somebody else's building.'",
        "'speaker_5': 'And whether and what other options for financing did you look at?'",
        "'speaker_0': 'I mean, we looked at what options there were, which is ultimately the general fund and what moneys are available to be utilized for the acquisition of the building. And there aren't any funds that are available.'",
        "'speaker_5': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Monteiro. Councilwoman Robb.'",
        "'speaker_2': 'Thank you, Mr. President. I understand this couldn't go to committee because it came in that week when we weren't having committee meetings. So I think there are a lot of questions and that's why we're doing committee work on the floor where we reimburse by RTD for the building that is part is being taken.'",
        "'speaker_0': 'Now we're paying less the amount that is being taken. So in other words, the building is currently owned by Belle Haven Realty and in its configuration it currently has 70,000 feet. We went out and had the building appraised based on the architectural plans that show what the building will be after the take occurs.'",
        "'speaker_0': 'And that's the price that we're paying for the building in the after statement.'",
        "'speaker_2': 'Okay, I thought so. We're relocating from the. I thought you were saying that the Arkansas court building we were leaving because of an to take.'",
        "'speaker_0': 'No. This building is being impacted by an RTG.'",
        "'speaker_2': 'Take the one we're buying.'",
        "'speaker_0': 'Correct.'",
        "'speaker_2': 'Okay. So why are we leaving the Arkansas court building again?'",
        "'speaker_0': 'The the Arkansas court building is a building that will be demoed and be used as a park as the improvements to Brighton Boulevard and the area. Very good.'",
        "'speaker_1': 'Thank you, Councilwoman Robb. Councilman Brown.'",
        "'speaker_0': 'Councilwoman Robb asked my question.'",
        "'speaker_1': 'All right. Thank you. Any other questions or comments on 1115? Thank you, Mr. Steinberg. Seeing none. Madam Secretary, welcome.'",
        "'speaker_4': 'But no can eat. Lehman. Monteiro. Nevitt. I. Ortega. I. Rob. Shepherd. I. Sussman. I. Brooks. Brown.'",
        "'speaker_0': 'I.'",
        "'speaker_4': 'Ortega.'",
        "'speaker_7': 'Sorry. I did vote already.'",
        "'speaker_4': 'Mr. President. Hi.'",
        "'speaker_1': 'Madam Secretary. Please close the voting. Announce the results.'",
        "'speaker_4': '11 eyes, one nay.'",
        "'speaker_1': '11 eyes, one 811 eyes. One day. 1115 has been ordered to publish. Madam Secretary, can you do you have the next one, I believe is 1062 called out by Councilman Fox? Councilman Fox, would you like for us to do with this?'",
        "'speaker_7': 'I have several.'",
        "'speaker_8': 'Questions I'd like to ask. I don't want to pull it out for a vote.'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_5': 'There are seven bills tonight that are related to health.'",
        "'speaker_8': 'Insurance, dental insurance, etc..'"
    ],
    "Approves an agreement with Kaiser Foundation Health Plan of Colorado to provide medical insurance coverage in 2014 to eligible employees with a contract amount not to exceed $59.408 million (CSAHR-201419383-00). (TECHNOLOGY & GOVERNANCE) Approves an agreement with Kaiser Foundation Health Plan of Colorado to provide medical insurance coverage in 2014 to eligible employees with a contract amount not to exceed $59.408 million (CSAHR-201419383-00). The last reguarly scheduled Council meeting within the 30-day review period is on 1-19??-15.  The Committee approved filing this bill at its meeting on 12-16-14.": [
        "'speaker_5': 'I just pulled this one out. This one actually relates to the amount that we are authorizing for Kaiser. But I had several questions and I see Heather Britton here, and I know that Heather would know the answers.'",
        "'speaker_8': 'To these questions there, certainly know where.'",
        "'speaker_5': 'To find them. And I will mention that I was asked questions.'",
        "'speaker_8': 'Before the meeting started.'",
        "'speaker_5': 'By citizen. And so I'm going to ask that some of this be discussed here.'",
        "'speaker_9': 'First of all.'",
        "'speaker_8': 'The bills themselves authorize the.'",
        "'speaker_5': '2014 year contract and we're now 2015. I know this is customary, but would you please explain why we're doing 2014 business today term?'",
        "'speaker_7': 'It's all timing.'",
        "'speaker_8': 'Actually.'",
        "'speaker_1': 'Heather, could you just introduce yourselves for the record, please?'",
        "'speaker_7': 'Heather Britton I'm the benefit manager with the Office of Human Resources. It's a timing issue. I visit you guys frequently. In fact, in for 2014. I visited you in August of 2013 to receive approval to purchase all of these contracts.'",
        "'speaker_7': 'By the time we make our way through the contract approval process, the division of insurance, so on and so forth, with our 13 different contracts, it takes pretty much all year to get the final contract language.'",
        "'speaker_4': 'So this is just sort of.'",
        "'speaker_7': 'Buttoning things up. You guys already approved the purchase about a year and a half ago for these contracts.'",
        "'speaker_5': 'Okay. My second question is, it was commented on what a.'",
        "'speaker_7': 'Large amount once.'",
        "'speaker_5': 'You added all seven amounts.'",
        "'speaker_8': 'Together.'",
        "'speaker_5': 'Can you mention whether this includes both the employee premium and the city contribution?'",
        "'speaker_7': 'And this was the Kaiser? Yes, it includes both the employer employee premium, but it also includes all employees. So it's the.'",
        "'speaker_4': 'Career service.'",
        "'speaker_7': 'Group and fire and police in that Kaiser's Kaiser number.'",
        "'speaker_5': 'Thank you. And the last one was not connected to these contracts, but since I had you up here, there was an approval to do a bonus.'",
        "'speaker_8': 'For those who wanted to participate in the wellness program.'",
        "'speaker_5': 'Has that been paid out to employees?'",
        "'speaker_7': 'It did. There was a brand new wellness program I presented to you all in, or at least that Technology and Governance Governance Committee for completing a wellness incentive. Employees were rewarded really with the $240 one time incentive, and that was paid on their first December check.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_1': 'Any other questions on things? 1062 CNN. Thank you, Miss Britain. Oh, I'm sorry, Councilman Ortega.'",
        "'speaker_7': 'I just want to mention that when we. Discuss these bills last in committee. We also talked about the fact that folks from Human Resources are going to begin having conversations with city employees about the fact that our plans for next year are going to be different.'",
        "'speaker_7': 'And so for 2016, we're going to start having those conversations early with employees because some of it is complex. And I just want to remind folks that not to be surprised that, you know, human resources will begin coming to the different city agencies to talk about how the changes will impact them in 2016 and be able to'",
        "'speaker_7': 'answer all those questions early. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. All right. So you know the comments on this one, Madam Secretary, one to your next one, which should be 1112. Councilwoman Ortega, what would you like for us to do with this?'",
        "'speaker_7': 'So I have questions on all three of these, and the questions are the same. So if we can just address them all together, go ahead. That would be helpful. So I'd like to address these with I see Aaron in the audience from DIA.'",
        "'speaker_7': 'So my questions are, number one, there's language in here that says it's eliminating midterm refurbishment requirement and it looks like this is extending or. Allowing the contract to be renewed. I'm not sure if these are PDC premium value program concessions.'",
        "'speaker_9': 'No.'"
    ],
    "Amends an agreement with Denver Airport Enterprises, LLC (DAE) to document DAEs agreement to complete the remodel of the Concourse A newsstand location, eliminating the mid-term refurbishment requirement (AC38041(7)). (BUSINESS DEVELOPMENT COMMITTEE) Amends an agreement with Denver Airport Enterprises, LLC (DAE) to document DAEs agreement to complete the remodel of the Concourse A newsstand location, eliminating the mid-term refurbishment requirement (AC38041(7)). The last regularly scheduled Council meeting within the 30-day review period is on     .  The Committee approved filing this bill by consent on 12-24-14.": [
        "'speaker_7': 'So help me understand with this, eliminating the mid-term refurbishment requirement means on all three of these contracts.'",
        "'speaker_9': 'Sure. It's a great question. I'm Erin Barrasso representing desire. So each of these each of these concessionaires are required in their contracts to have a mid-term refurbishment so that we this amendment is just changing the renovation completion date to May 31st of 2014 because these renovations are already taking place.'",
        "'speaker_9': 'They're not extending the contracts. The it's they're going to have the same ending date of August 31st of 2017. So we're not extending these.'",
        "'speaker_7': 'So it's just changing the date in the contract. But you're saying the work already took place, correct? Okay. All right. That that answers all of my question. So I don't need to ask the others. Thank you.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'All right. I can count on you. And that was for 1114. Well, you're good. Okay. Thank you. All right. Well, if I'm not mistaken, then that is all the bills that we had called out. Is that correct, Madam Secretary?'",
        "'speaker_4': 'Yes, Mr. President.'",
        "'speaker_1': 'All right, so all of the bills were introduction to order publishing, and we are ready for the block votes. Councilwoman Robb, would you please put the resolutions on the floor for adoption?'",
        "'speaker_2': 'Yes, Mr. President. I move that council resolution 1090 and Council Resolution 1108, both series of 2014 be adopted.'",
        "'speaker_1': 'As been moved in second. In any comments from members of Council C None. Madam Secretary.'"
    ],
    "Approves a text amendment to Article 9, Division 9.4, of the Denver Zoning Code to create the South Sloans Lake Design Overlay, DO-5. (NEIGHBORHOODS AND PLANNING) Approves a text amendment to Article 9, Division 9.4, of the Denver Zoning Code to create the South Sloans Lake Design Overlay, DO-5. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 11-12-14.": [
        "'speaker_2': 'Yes, Mr. President. I move that council bill 962 series of 2014 be placed on final consideration and do pass.'",
        "'speaker_7': 'Okay.'",
        "'speaker_1': 'It has been moved in second in the public hearing for council bill 962 is now open. May we have the staff report?'",
        "'speaker_8': 'Good evening, Mr. President. Members of council. I'm Deirdre Oates with Community Planning and Development. I will present to you this Council Bill 962 a proposal for an amendment to the Denver Zoning Code. No. Specifically to Article nine Division 9.4 to add d05 or design overlay five concerning the South Sloan's Lake redevelopment.'",
        "'speaker_8': 'Former St Anthony's Hospital. The ordinance is sponsored by Council District one councilman Susan Shepard. The ordinance also and the overlay itself has been reviewed by the property owners who are actually within the area that is defined in the proposed design overlay.'",
        "'speaker_8': 'And unlike some text amendments that you might see to the zoning code, which are are something to be applied citywide, this is a design overlay that is more specific to a larger site that will be developed over time by multiple folks, but is looking for a consistent approach in design and transitions to adjacent neighborhoods.'",
        "'speaker_8': 'And so the design overlay tool was chosen as the way to implement recommendations and plans, and I'll explain those to you. So the purpose of the overlay district, it must meet one or more of the following in accordance with our zoning code, and in this case, highlighting implementation of land use and urban design recommendations and standards that'",
        "'speaker_8': 'are set forth in neighborhood and small area plans that have been adopted as part of the Comprehensive Plan. Also to provide uniform standards for mitigating the impact of more intensive uses adjacent to less intensive uses, and to reinforce the desired character for newly developing areas.'",
        "'speaker_8': 'All three of those are very specifically applied to the South slogans like area. The Tax amendment process. Specifically, there is an internal draft review by community planning and development. The text amendment itself was drafted, reviewed by our city staff and then Council District one and partners and owners who are affected by the specific design overlay that occurred'",
        "'speaker_8': 'in the fall of 2014. Notice was then emailed to all registered neighborhood organizations with links to that review, draft and summary was posted to our website on September 30th. The Planning Board had a public hearing in November 5th and notification to the Register, Neighborhood Organizations and City Council was was provided for that hearing and also notification for'",
        "'speaker_8': 'the Neighborhoods and Planning Committee that occurred on November 12th. So those are the processes that have occurred up to now, the final hearing for the text amendment. With regard to the schedule, there are two, two items here that you'll see on your presentation.'",
        "'speaker_8': 'The top is the the text amendment, and that is where we are today, January 5th, for the final hearing. Below is an accompanying map amendment. Now, that map amendment will come to city council in February. Tonight, we are just talking about the text amendment to establish the text as part of the Denver zoning code.'",
        "'speaker_8': 'And then we will later come back with a proposal to map that design overlay to the site. So I just wanted you to see that schedule as well. So this is concerning the Southlands Lake redevelopment area, the former St Anthony's Hospital in Council District one on the west side of Denver, just north of Colfax.'",
        "'speaker_8': 'It's 17th between Stuart and Perry Street. And this is the site, obviously an old areal. Now, everything is is under redevelopment actively right now. But the areas specifically affected by this design overlay take off the little legs that are south of Kansas.'",
        "'speaker_8': 'And you're looking at the areas between Stewart Street on the West, Perry Street on the East, 17th on the north, and then Kinney House on the south. The existing zoning of the site. So you have a little bit of that context is c m x5 urban center mixed use five story.'",
        "'speaker_8': 'The action that you take tonight should you approve this design overlay will not change that underlying zoning. That will be an action that will take place as a proposal in February, as I mentioned, as part of an accompanying map amendment.'",
        "'speaker_8': 'So here are a few more pictures of the slums like redevelopment area. This is the slums like park to the north of cell slums like redevelopment area. And then some of the context around the site to the east on Perry Street.'",
        "'speaker_8': 'We're talking about primarily single family, lower density residential and lower intensity residential that surrounds the site to the west and to the east. And that is the reason that this overlay has been proposed, is to provide transitions to these sites that are consistent with neighborhood plans.'",
        "'speaker_8': 'Okay. The West Colfax plan and the South like general development plan both advocate for height transitions to existing lower density, lower height West Colfax neighborhood blocks, including Stuart and Perry Street. The design overlay as proposed implements height limitation concepts that were conceived in the West Colfax Plan and specifically delineated in the approved southlands like general development plan'",
        "'speaker_8': '. I should note now that the General Development Plan is not an official supplement to the comprehensive plan, but the West Colfax Plan is. And so that is our main guiding document. But it was more refined in the general development plan as a supporting document.'",
        "'speaker_8': 'The design overlay uses a distance from the zone, not line so the edge of the property to identify the extent of these height limitations. And I'll show you. You also have in your packet the actual redlined draft of the overlay and then I'll show you some pictures as to how that applies.'",
        "'speaker_8': 'And the overlay also provides an exception for exterior balconies. And I'll talk about why that is. It provides context, sensitive height, transitions to the adjacent neighborhood and again, does not change your base zoning. So let's start on 17th and Stewart Street.'",
        "'speaker_8': 'These are just pictures that you also have in your your packet. This shows a structure. This is simply kind of a building envelope. It's typical of the kinds of drawings that we have in our summer zoning code. And this shows for Stewart Street a three storey 45 foot maximum height between 17th and 16th, 480 feet from that'",
        "'speaker_8': 'zone, lot line. So you can see where the height can transition up to the five story road's current five story district, 80 feet from that zone lot line on Stewart Street. And that provides more of a pedestrian oriented height transition along Stewart.'",
        "'speaker_8': 'Then between 16th and Carney House, which is to the south, it's another it's 80 feet and then there's a four storey maximum. And this accommodates an existing structure in the parking garage on the site. And then also any future development that might come into play, it would be limited to four storeys for 80 feet from that mine'",
        "'speaker_8': 'plus it. Along 17th Avenue, there is a five story maximum height limitation for 4343 feet from the zone lot line. That's kind of a funny number. It comes up because a cell phone's like was being redeveloped. 17th Avenue needed to be finally, finally added as part of the subdivision.'",
        "'speaker_8': 'And when they looked at the delineation of what 17th Avenue would become, it turns out that the private property, there's eight feet of the public sidewalk that's actually included within some of that right of way. So we actually added.'",
        "'speaker_6': '88 feet.'",
        "'speaker_8': 'To the normal 35 foot from zone lot line. That would have been our normal restriction to make it 43. So a little math behind that. And then on Equipment Street, which is Mid-Block in South Sloan's Lake at 60 feet from the zone lot line with a five story maximum height or 70 feet.'",
        "'speaker_8': 'Perry Street. Lastly is three stories and 45 foot maximum height with 80 feet from the zone lot line along Perry and that is that eastern side of the south sounds like redevelopment. The balcony exception if you look at your your packet and look at your slide, there is a little area in beige called the restricted height area'",
        "'speaker_8': '. Normally, if we did not accept a balcony, they wouldn't be able to build a building and then actually have balconies that would be added to it like you see on most multifamily buildings that are constructed today. That is because in our height exceptions in the code, we do not list balconies as an exception to height.'",
        "'speaker_8': 'They're seen as an exception to setbacks. So how of how far they come close to the street, even if it's a balcony up, you know, four stories or five stories. But they're not shown as height exceptions. And so we wrote an exception to ensure that the developer was able to provide balconies without taking away square footage of'",
        "'speaker_8': 'the units which they would have to do if they were to meet those those zone line restrictions for the height. There are two and we're calling them adopted and pending rezonings. Right now both of these are pending the ACM x five, which is the current zoning, the proposed design overlay oh five that would be applied to the'",
        "'speaker_8': 'site is part of a map amendment that will come to you in February. And then there is also a map amendment for what's called block. One of the sounds like subdivision filing one and that is that northwest block of the redevelopment.'",
        "'speaker_8': 'They're looking for a rezoning to CMC's 12 and that is the applicant proposing that to see him x 12 they would be applying for and reinforcing the deal five again. But because we don't have the deal five on the books, that application still looks as if it's pending until we have the deal five on site.'",
        "'speaker_8': 'So now, you know, there are kind of three things that are happening along with the site that you will see over the course of the next month, month and a half. Review criteria for text amendments include consistency with cities, adopted plans and policies, uniformity of district regulations and restrictions, and then further in the Public Health, Safety and'",
        "'speaker_8': 'General Welfare Plan 2000 or Blueprint Denver from 22 in the West Coal Flex Facts Plan adopted in 2006 all provide the structure for that plan consistency review. Within the the comprehensive plan, there is specific guidance. A lot of that in the narrative to use the best of Denver's architectural and landscape legacy to guide the future in quality'",
        "'speaker_8': 'design, to be livable and admired. All of the components of the city, its infrastructure, buildings and open spaces must function well and be attractive individually while combining to create meaningful, beautiful places. When you're adding new to old as and we as we're doing here with this redevelopment.'",
        "'speaker_8': 'So slums like this is one of those phrases that really rings true for redevelopment here. Also, the primary urban design challenge of the early 21st century will be to integrate elements of Denver's traditional urban design character into redeveloping areas and new, more compact, mixed use areas.'",
        "'speaker_8': 'And so the design overlay has come to us as a tool to apply to the site because it can be applied over time to multiple blocks that will be developed by different people. It'll provide a consistent approach. Specifically policies regarding Denver's legacy is to identify areas where increased density and users can be accommodated and then to encourage'",
        "'speaker_8': 'quality infill development. We want to encourage that quality infill development. We want to make sure that it is sensitive to the context and the neighboring blocks, in this case, the West Colfax neighborhood. Blueprint. Denver is our land use and transportation plan.'",
        "'speaker_8': 'It specifically identifies the sites within an area of change for mixed use. Development and specific concepts that are applicable from blueprint include a change in the land use standards of a zone as a tool to improve compatibility. Again, the design overlay using land use and transportation types, focusing on the experience of place at the ground level where'",
        "'speaker_8': 'the qualities of pedestrian oriented city are most apparent and again, tapering down the height toward the edges is important for creating that pedestrian space along a mixed use street pedestrian scaled facades, which may include height transition step backs for the front of a taller building promoting pedestrian activity.'",
        "'speaker_8': 'Again, the overlay is designed to provide a building envelope for that to occur. It doesn't constitute detail on the architecture. It doesn't say what to build. It just gives an envelope for building height restrictions in the West Colfax Plan, which is the most specific plan for the site redeveloping St Anthony's in a manner that catalyzes reinvestment in'",
        "'speaker_8': 'the larger study area while respecting, complementing, enhancing stability of the surrounding neighborhood. The site is identified as catalytic development opportunity as an urban town center, and specific to that with variable scale radiating from the dense core to a lower intensity at the fringe.'",
        "'speaker_8': 'And there is also a picture in your packet of one of the many kinds of concepts that could be it's on page five of your packet could be used to to look at this site. And it shows generally the higher buildings in the center and lower buildings toward the fringes.'",
        "'speaker_8': 'And so these height restrictions are designed to create that that lower height and intensity from the West Colfax plan. There are a number of different policies and language that supports the development of this area. So that is not what's the question tonight.'",
        "'speaker_8': 'It's how we do this best and what kinds of tools can be used to provide this transition. So I've listed many of those specific here. We're talking about promoting safe and attractive pedestrian linkages, incorporating focal points, public gathering spaces and strong pedestrian linkages, and then creating an urban edge along West 17th to define the park.'",
        "'speaker_8': 'That, for instance, when you create an urban edge or creating a place where people can walk along, where you can have the ability to provide space, either if it's residential or if it's commercial mixed use, which the zoning does allow.'",
        "'speaker_8': 'If you're doing it in a way that is not creating canyons of taller buildings right next to the street and instead providing height transitions, it creates a better space for the pedestrian. And that's part of best practices in urban design.'",
        "'speaker_8': 'In the general development plan. If you look at this slide, there's a dotted line around the middle of the site from 17th Avenue down to new house. That dotted line defines what was called the core area. And when we talked about variable densities and variable heights, you're radiating from the denser inner core to the lower intensity at'",
        "'speaker_8': 'the fringe. These height limitations are designed, if you look on the right for Stuart Equipment and Perry Street to be specific to those recommendations in the South Sloan's General Development Plan. Again using the general development plan for the text amendment.'",
        "'speaker_8': 'The GDPR provides additional reinforcement, but it is not considered a supplement to the comprehensive plan. It's just additional information for you. And then the Denver Zoning Code provides that the city council may approve an official map amendment which will come to you next month for property located within an approved GDP.'",
        "'speaker_8': 'So keep this in mind as you're looking at this a month from now in an application for the MAP Amendment that will accompany this this design overlay. With regard to uniformity of district regulations, the text amendment results in regulations that are uniform across the districts.'",
        "'speaker_8': 'This means that they will be applied across the area that gets Ddr5 five that they will be applied in the same manner and to which it is written. And it is written very specific to certain blocks. And furthering the public health, safety and welfare, providing for context sensitive transitions between new infill development and adjacent lower intensity, lower'",
        "'speaker_8': 'height blocks in established neighborhoods, and transitions that provide for pedestrian friendly environments at the street level where experience of place is most apparent. So the public review, I went through this a little bit, but we had informational notice symptoms of tember 30th.'",
        "'speaker_8': 'There was no dissent of the planning board hearing on October 21st. There was also a public meeting where the applicants the city attended, but then also the owners of the property that's affected also attended to help answer questions about how this overlay will affect future development, followed by the Planning Board, public hearing and just the update notice'",
        "'speaker_8': 'was sent for City Council to a number of different registered neighborhood organizations. With regard to public comment, we actually had a few public comments sent to CPD at the public meeting. They asked about how the balcony height exception works in the future of new based zoning with higher height as approved balcony height exception still applies for anything'",
        "'speaker_8': 'that's over the site. And then with planning board there, there were questions about the use of applicable city plans and concerns regarding the overall development impact. Things that weren't necessarily related to the overlay, but we did hear those as well.'",
        "'speaker_8': 'So with that, staff recommends approval of the Denver Zoning Code Text Amendment for the Southlands like design overlay or D or five. Thank you.'",
        "'speaker_1': 'Thank you, Miss Host. We have three speakers signed up and I'm gonna call all three. You can come up to the front pew and the first one can begin his remarks Cameron Bertrand, Dan Shay and Ben Stetler. So excuse me, you three can come on up and Mr. Bertrand, you can go ahead and begin your remarks.'",
        "'speaker_0': 'Hi, my name is Cameron Bertrand. I work for LFG. Sounds like one. We are not the applicant, but we are the property owner of four of the six blocks affected by the design overlay. Our address is 475 17th Street, Denver.'",
        "'speaker_0': 'Thanks very much for having me up here tonight. I just briefly wanted to say that as the owner of four of the six blocks and once upon a time all six of the blocks, it may be a little bit unusual for a property owner to support what is really effectively height restrictions across much of the property.'",
        "'speaker_0': 'But for us, this is really the culmination of an effort that the city started back in 2006 with the twin Anthonys task force recommendations, followed by the West Colfax Corridor plan that I think put very clearly out there the intention after many community meetings that the development of the redevelopment of the St Anthony's site be sensitive to'",
        "'speaker_0': 'the surrounding neighborhood and that heights transition from the center down to the edges. And I think that that was further put forward through more than 60 meetings that we had with the community when we showed up in 2012.'",
        "'speaker_0': 'And the passage of the GDPR, which further reinforced not only transitioning heights at the edges, but also to some extent in the center to make for active urban mixed use streets. So just on behalf of us as the owner as well as our development partners who are building the are the presumptive builders of the mixed use buildings'",
        "'speaker_0': 'on this site, we support the passage of the design overlay text amendment here tonight and just a quick thank you to CPD for all their work along the way and to Councilwoman Sheperd for sitting through 60 public meetings with us.'",
        "'speaker_0': 'Thanks very much.'",
        "'speaker_1': 'Thank you. Dan. Dan Shay.'",
        "'speaker_0': 'Yeah. Dan Schorr and I met with the West Colfax Business Improvement District. And I just want to thank you for your time to consider our input. My district strongly supports the text amendment because it furthers the principles and recommendations of the West Colfax Plan and because the proposed development projects that are coming on based on that following'",
        "'speaker_0': 'the text amendment restrictions are a critical step toward revitalization in West Colfax. In addition to specific design recommendations, the West Colfax plan sets out objectives for growth in West Colfax, and the proposal under consideration today should be commended because it is designed to ensure that type of growth actually occurs at the Saint Anthony site.'",
        "'speaker_0': 'These objectives include promoting a range of housing types, increasing income diversity and offering the density of development that will support enhanced retail and neighborhood services, as well as a healthy walking and transit oriented environment. The design overlay not only enshrines in code recommendations from the West Colfax Plan, but working in conjunction with even more restrictive design guidelines'",
        "'speaker_0': ', plays a critical part in laying the groundwork for the kind of owner occupied condo project that is sorely missing from among the housing types in West Colfax and actually is not found in any of the other of Denver.'",
        "'speaker_0': 'Denver's Untested Markets. It therefore supports the plan's recommendations to increase the range of affordable I mean, of available housing types in West Colfax. We know that from a business development perspective, this form of market rate housing will attract residents with greater disposable income, also recommended by the West Colfax Plan and contribute importantly to West Colfax is well'",
        "'speaker_0': ', revitalization. Last but not least, by striking a balance between existing housing stock and more intense development. The text amendment also supports the West Colfax vision of a neighborhood developing with sufficient rooftops. To support strong neighborhood serving retail and services.'",
        "'speaker_0': 'At the same time, the density also supports the West Colfax Plans recommendations of inculcating a strong walking and transit oriented culture. For these reasons, the West Colfax bid supports the proposed tax amendments as directly supporting the West Colfax plans objectives of income, diverse, retail, abundant and healthy neighborhood in West Colfax.'",
        "'speaker_0': 'So thank you very much for your time. Appreciate it.'",
        "'speaker_1': 'Thank you, Mr. Shah. Ben Stetler.'",
        "'speaker_0': 'Hello. Good evening. My name's Ben Stetler. I live at the corner of 17th and Utica, and I'm co-president of the West Colfax Association of Neighbors. Our organization is excited for this project and for the opportunity that it presents for the West Colfax corridor.'",
        "'speaker_0': 'I'd like to read a letter that we prepared, read that you all now. And thank you, by the way, for the opportunity to speak this evening. I'm writing on behalf of the West Colfax Association of Neighbors Weekend to express our general support for the Design Overlay District at the Sloane's redevelopment.'",
        "'speaker_0': 'Since the board membership of our organization voted to support the GDP for the redevelopment in December of last year, and the design overlay district merely codifies the lower height specified in the GDP at the time. The Board of Directors feels confident in supporting this new district.'",
        "'speaker_0': 'It should be noted that we did not take any official vote on this issue, but simply lean on our previous support. By and large, the board and the membership are quite happy with the way in which the project is progressing and glad to see that the city is taking it upon itself to ensure that the residential edges'",
        "'speaker_0': 'of the development are protected from taller development as outlined in the GDP. We can represents the needs and desires of the residents and business owners in the Denver's West Colfax neighborhood. Our organization currently has over 550 registered members and is dedicated to creating a healthy, safe and sustainable community in West Colfax.'",
        "'speaker_0': 'Please support us in approving this rezoning. We look forward to the completion of this project. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Now is time for questions. Do we have any questions from members of council? Councilwoman Shepherd.'",
        "'speaker_6': 'Thank you, Mr. President. This is a question for Deirdre. So the evolution of this project has had many phases, shall we say, met several of which perhaps may not be the most obvious or clear to folks that have been following it.'",
        "'speaker_6': 'And I think there may be a lot of people perhaps watching tonight via television that say, you know, why are we doing this? Because isn't this what we already did through the general development plan process, which was, you know, you know, went we went through literally a year ago and planning board made the final vote.'",
        "'speaker_6': 'So I think it would be beneficial to clarify why this next step is needed.'",
        "'speaker_8': 'Certainly the general development plan is a guiding tool. It is a process that is in our Denver zoning code. It is not a regulatory tool for helping to restrict that height in a formal way that attaches to zoning.'",
        "'speaker_8': 'And so while it's in the general development plan, without this tool, there isn't a consistent regulatory approach that would accompany the zone district that's currently there, the Cemex five or any other zone district that they propose. So it is a regulatory tool.'",
        "'speaker_8': 'It is the way we help implement that GDP as the next step.'",
        "'speaker_6': 'Okay. Thank you for that. I appreciate it.'",
        "'speaker_1': 'Thank you, counsel. I'm sure councilman in each.'",
        "'speaker_2': 'Thank you very much. I just want to make sure I am saying it back and understanding correctly the differences between the different votes coming in phases. So what we're doing tonight is creating a new district with some rules regarding three stories, four stories, five stories.'",
        "'speaker_2': 'Any zone district that adopts those this DOE five at a later date will be adopting these restrictions regardless of what the height is in the non restricted portion. So for example, it could be three stories next to five, which is what it is today, or it could be three stories next to 12 if that's what's adopted.'",
        "'speaker_2': 'Just depending on which street you're on, so am I. Am I understanding that correctly in terms of how this will interact with what comes after it?'",
        "'speaker_8': 'What comes after it? Right. Pretty much, yes. So what we're doing is putting the language on the books today. And should you approve that, then that would become part of the Denver zoning code. And in a month, you'll see the map amendment that goes with this applied to that very same area that we talked about.'",
        "'speaker_8': 'And that map amendment will then make the zoning on the site effectively seem x five slash DL five. So we're adding that overlay to it. The third that we're talking about for an applicant who comes in and is proposing a different zone district like the CM x 12 to change the base zoning, we've asked just to reinforce'",
        "'speaker_8': ', even though it already would be on the site, we've asked that they come in with an application that still says d05 on it to make very clear that it doesn't go away, that it's staying along with that. And in fact, you know, sneak peek, the planning board looked at that and said, that's great, but we want to'",
        "'speaker_8': 'make sure that the door five is applied to the site. And so it's just a reinforcing way to look at any zoning application in the future. But the deal five would apply to the entire site.'",
        "'speaker_2': 'Okay. Thank you for making sure I understood that.'",
        "'speaker_8': 'Yeah.'",
        "'speaker_1': 'Thank you, Councilwoman. Any other questions on 962? Seen a public hearing on 962 is now closed time for comments from members of council councilwoman shepard.'",
        "'speaker_6': 'Thank you, Mr. President. I am glad to sponsor this text amendment this evening and it's precisely for many other reasons that we've already spoke about tonight. The West Colfax plan in 2004, you know, did envision higher density in this site because it is an area of change.'",
        "'speaker_6': 'And we knew the hospital would eventually leave and then we'd have, you know, all these blocks and, you know, what would we do with them? And in particular, with the advent of the light rail and of course, also the West Colfax bus line that exists today, which has 15 minute headways.'",
        "'speaker_6': 'We have excellent, excellent public transportation opportunities throughout this whole corridor. And if, you know, as our city grows and changes, it is imperative, you know, that we plan for the infrastructure that helps to accommodate that growing population. And the number one of the number one ways to do that is by making sure that we have adequate public'",
        "'speaker_6': 'transit, transportation, transportation options to help meet that need. However, although it is an area of change, there is already a very large established neighborhood there in that area, many 1 to 2 story homes throughout the whole neighborhood. And I think it is imperative, you know, that.'",
        "'speaker_6': 'We protect the quality of life for those folks, especially on Perry Street and Stewart Street, which is the east and west boundaries of this site. And I think it's a very sensitive approach to help limit the height at those edges, to better compliment the site as it develops forward.'",
        "'speaker_6': 'And in particular, I think this is extremely important as we contemplate potential heights that are even higher than the five stories that is currently on the site. And as many of you know, through the presentation, that is already a higher, you know, heights, higher than five stories are already being contemplated there.'",
        "'speaker_6': 'So I think it's even more imperative that we move to codify this in a way that can give residents that have already been on the on the ground for quite a while, you know, some security that they're not going to be faced with, you know, potentially up to 12 stories right there, you know, across the street from'",
        "'speaker_6': 'them. So for that reason, I am definitely supporting this tonight as I chose to sponsor this application and I would ask my fellow council members to support it as well. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Sheppard. Councilwoman Kennedy.'",
        "'speaker_2': 'Thank you, Mr. President. I would also like to just enthusiastically add my support to this to this overlaid change. I really do think that the idea of density is one that people talk about. And often when they're articulating their concerns, it's really design that's more concerning than total height.'",
        "'speaker_2': 'It's about what it feels like, it's about what it looks like. And so, in my opinion, these kinds of overlays and even some of the basic things we already have in our zoning code like step backs and setbacks from the street edge, which will also apply to some of these edges to even further enhance the way that'",
        "'speaker_2': 'it feels when you're walking by it or living near it. So I really do think that these pieces are really responsive to the to the community and actually even to the original conversations about how you make something that was a piece of the neighborhood, but a pretty rough transition from hospital to residential become a little more of'",
        "'speaker_2': 'an integrated transition. And so I think that it'll actually be an even better experience than the prior uses and the prior edges were. And so in that way, I think redevelopment presents an opportunity for a really great, seamless community.'",
        "'speaker_2': 'So I want to just thank all of the work that went into it and to Councilwoman Sheperd for coming forward and sponsoring this creative solution. So I hope we all support it enthusiastically.'",
        "'speaker_1': 'Thank you, Councilwoman. Any other comments on 962? Seen none. Madam Secretary.'",
        "'speaker_4': 'Raquel Brooks. Hi, Brown. I fats. I can eat lemon Lopez. Hi, Monteiro. Hi, Nevitt. Hi, Ortega. Hi, Rob. Hi. Mr. President.'",
        "'speaker_1': 'I. As women can each. Thank you, Madam Secretary, please close the voting. And as a result, 3939 counts will 962 is passed on Monday, February 2nd, 2015. Council will hold a required public hearing on Council Bill 963, changing the zoning classification between 17 Drive, Cornelius Place, Stewart Street and Perry Street, South Long Lake General Development Plan Boundaries'",
        "'speaker_1': '. Any protests against Council Bill 963 must be filed with the Council offices no later than noon on Monday, January 26, 2015. Seeing no other business before this body, this meeting is adjourned. Yeah.'"
    ]
}