{
    "A resolution approving a proposed Agreement between the City and County of Denver and Hensel Phelps Construction Co. concerning baggage handling system enabling projects for TSA relocation at Denver International Airport. Approves an on-call contract with Hensel Phelps Construction Co. for up to $80 million for two and a half years for baggage-related enabling projects to be done prior to the relocation of the TSA passenger screening activities from Level 5 to Level 6 at Denver International Airport (201628516).  The last regularly scheduled Council meeting within the 30-day review period is on 12-19-16.  The Committee approved filing this resolution by consent on 11-16-16.": [
        "'speaker_0': 'Under bills for introductions, we have Council Bill 1087 called out for a vote by Councilman Ortega and council bill 1143 called out for a question and a vote postponed by Councilman Espinosa. Under bills for final consideration, we have Council Bill 1078 called out for a question and a vote to postpone by Councilman Espinosa.'",
        "'speaker_0': 'Underpinning we have nothing. Madam Secretary, will you please put the first item on our screen? Councilman Flynn, what's your question? On 1044.'",
        "'speaker_2': 'Thanks, Mr. President. I did review the committee materials on this and saw the presentation from DIA, but I still had some things I need to clarify. Maybe Stew Williams could come up very quickly. You don't have to come up very quickly, but answer very quickly.'",
        "'speaker_2': 'Number one, Hensel Phelps. They had a key role in in the original opening of the airport. I think they were. Were they our the city's consultant on the interim bag system?'",
        "'speaker_4': 'Good evening, Mr. Williams, senior vice president of special programs at Denver International Airport. So until Phelps had a number of contracts originally during the original construction of the airport and.'",
        "'speaker_2': 'Councilman put on the baggage system and specifically.'",
        "'speaker_4': 'The work, they didn't do work on the original United System, but they did some interim work post the United States.'",
        "'speaker_2': 'Okay. I think they're highly qualified that I know a lot of the work that they did that they've done out there. So I understand why they were selected, but I'm wondering if this is an $80 million on call contract.'",
        "'speaker_2': 'I'm wondering how the airport arrived at that level. I understand that it's a work order, so it's a maximum of it doesn't mean we're going to spend 80 million, but how did you arrive at a cap of 80 million?'",
        "'speaker_4': 'And it is correct that it is a non call contract and we we decided to go for a cap of 80 million. We believe that the main task of this program or main task of this program would be to construct a level of what we call a level 5.5, which is above the level five ceiling and below'",
        "'speaker_4': 'the level six for for conveying baggage both north and south on the east and west sides. To give us greater flexibility will need that flexibility in order to move all the airlines from Mode one to MUDs two and three so that we can put TSA in MOD one.'",
        "'speaker_4': 'To answer your question, we estimated the project actual the level five task level 5.5 has to be somewhere between 65 and 75 million at the time that the contract was said, we wanted that flexibility for other baggage connections that may be needed.'",
        "'speaker_4': 'So we chose the $80 million.'",
        "'speaker_2': 'Thank you and thank you for explained to me to help me visualize the physical space there. I couldn't imagine where we could put a 5.5 level in there. And you clarify that for it's not it's not for habitable space or occupied space by people just for equipment.'",
        "'speaker_4': 'That's correct. There's a approximately ten foot interstitial space between the ceiling of five and four six.'",
        "'speaker_2': 'Now, the crucial question is, does any of this work commit us prematurely to any of the great hall reconfiguration, the scope of which and the configuration of which we do not yet? No.'",
        "'speaker_4': 'No, it doesn't. What this project does is it does enable because our stated goal for anything in the Great Hall, whether it's been done under the public private partnership or not, is to be able to move TSA in order to move TSA and use that space.'",
        "'speaker_4': 'We need level 5.5. A particular configuration is it's somewhat irrelevant to this project. The tie in will still occur regardless of the configuration. Okay.'"
    ],
    "A resolution approving a proposed Amendatory Agreement between the City and County of Denver and W. L. Contractors, Inc. to rebuild traffic signals within the City. Amends an on-call contract with W. L. Contractors, Inc. by adding $4.4 million for a new total contract amount of $6,314,207.80 and extending the term by two years for a new end date of 9-30-18 to rebuild existing outdated traffic signals within the City (201522741-01). The last regularly scheduled Council meeting within the 30-day review period is on 12-19-16. The Committee approved filing this resolution by consent on 11-17-16.": [
        "'speaker_2': 'Very good. Thank you, Mr. President. I just don't want to vote during a block vote on $80 million without the public understanding what we're doing.'",
        "'speaker_0': 'Thank you. Thank you. Councilman Flynn. Madam Madam Secretary, next item, please, which is one, one, two, one and kills 15. Your question.'",
        "'speaker_2': 'Thank you. This one's a little simpler. I don't know Angela or John. Maybe we could address this, but in the WRAL contractor's contract to update our traffic signals throughout the city, some that need updating. Do we know how many of these include my.'",
        "'speaker_2': 'My nemesis, the flashing yellow arrow? Can you?'",
        "'speaker_0': 'Cosmo. My name is John U at the public works transportation and mobility.'",
        "'speaker_4': 'The that this contract is an on call contract so there is.'",
        "'speaker_0': 'No identify locations where there are going to be any flashing yellow arrows identified.'",
        "'speaker_2': 'With. Okay thank you Angela maybe you can help them. Last time we met on this, I talked about driver confusion. People don't understand. What does this mean differently than a green ball? Which. And the answer is it means nothing differently.'",
        "'speaker_2': 'I still see a lot of driver confusion around these intersections. And we talked last year about doing some public education and I haven't seen it, has it occurred and I just missed it yet.'",
        "'speaker_3': 'We did develop a video that we put on YouTube and we sent it out to we sent it out on our social media network and there was a press release that went out as well.'",
        "'speaker_2': 'I remember that, okay, we're not doing any essays or anything.'",
        "'speaker_3': 'We haven't done any pieces. Okay. So we've mostly done it through social media.'",
        "'speaker_2': 'All right. Thank you. In the meantime, an acquaintance of the daughter of an acquaintance of mine was in an accident at one of these installations because of the confusion over them. So I'd like to see that ramped up if we could.'",
        "'speaker_2': 'Thank you. That's all.'"
    ],
    "A bill for an ordinance creating a Fund Number in the Wastewater Management Enterprise Fund for the Water Quality Capital Projects. Establishes a new storm capital improvement fund for the Public Works Wastewater Management Division for the Regional Water Quality Program. The Committee approved filing this bill by consent on 11-10-16.": [
        "'speaker_0': 'Yeah. Thank you. Thank you. Councilman Flynn, we all have our nemesis Sunk City Council. Madam Secretary, next item. Council on article. You are calling this item up for a vote? Yes, sir. Right. Councilman Espinosa, will you please put Council Bill 1087 on the floor for publication?'",
        "'speaker_0': 'I move that council bill 1087 be ordered published. All right. It's been moved the second. Now it's been moved, and second it comes. Councilwoman Ortega.'",
        "'speaker_3': 'Thank you, Mr. President. This item came to committee and we had a discussion about it. I believe because we do water quality as part of all of the wastewater projects. There isn't a need for additional. Fund to be created.'",
        "'speaker_3': 'The explanation we were given in committee is that they wanted some transparency in segregating out the water quality projects. And I just I don't agree with that thinking. I think since these are all part of an enterprise fund already where the water quality is being addressed as part of them, I am going to vote no, thank you'",
        "'speaker_0': '. All right. Any other comments? So in other comments, Madam Secretary, roll call.'",
        "'speaker_1': 'Ortega. No. Sussman. Black. Clark. Espinosa. Flynn. Gilmore. Herndon. Cashman. Carnage. Lopez. I. Mr. President.'",
        "'speaker_0': 'I close voting against the results.'",
        "'speaker_1': '11 eyes, one knee.'"
    ],
    "A bill for an ordinance approving a proposed Partial Release of Use Restriction and Right of Reentry for CDOT Parcel between the City and County of Denver and Metropolitan Football Stadium District for land the Metropolitan Football Stadium District will convey to the Colorado Department of Transportation. Authorizes the partial release of use restriction and right-of-reentry for City parcels previously deeded to the Metropolitan Football Stadium District to allow the Colorado Department of Transportation to construct a new headquarters on Stadium Parcels B6, B7, and B8, at approximately West Colfax Avenue and Mile High Stadium West Circle in Council District 3. The last regularly scheduled Council meeting within the 30-day review period is on 12-19-16. The Committee approved filing this bill by consent on 11-17-16.": [
        "'speaker_0': '11 eyes, 1a1. Hey, not a constable. 1087 has been ordered published. Madam Secretary, next item. Councilor Lopez, you're calling on Constable 1143 for a question and a vote to postpone final consideration to December 12th, 2016. That's correct. The other Lopez Councilman Espinosa.'",
        "'speaker_0': 'Sorry.'",
        "'speaker_5': 'That as I say, I don't have a problem with this.'",
        "'speaker_0': 'That is correct. Why did you say I couldn't hear? No, I'm just joking. All right. So, Councilman, you're going to put Bill 1143 on the floor for publication. I move that council bill 1087 be ordered published.'",
        "'speaker_3': 'No.'",
        "'speaker_0': '1143 1143 1140 oh oh. Sorry. Yes. Yeah. I moved that council. Bill 1143 be ordered published. Sorry, I'm a step ahead of myself. Yep. Okay. It's been moved in, so I might have messed you up there. It's been moved in a second.'",
        "'speaker_0': 'Councilman, go ahead and make your comments. Is so I still have questions on it. I was going to ask them on the floor, but I couldn't formulate them all in a sort of succinct way. So I really just need the extra time to have that conversation offline.'",
        "'speaker_0': 'But before I'm comfortable putting it mean having to moving it through. So, Councilman, are you asking for us to vote this down just to postpone further to a date certain on 12th? 12th. Okay, great. Councilor Lopez.'",
        "'speaker_5': 'Thank you, I. Thank you, Mr. President. I know this is and this is around our boundary and council district three and one by the stadium. This is for that seat on for the new headquarters. And so here's the thing.'",
        "'speaker_5': 'I, I wanted to call up Geoff or or somebody from that can kind of speak to this from real estate. If we postpone it, does that create any kind of problem with with the transaction or with Sudan? I mean, here's the thing.'",
        "'speaker_5': 'I I'm more than happy to. You know, hear this. And a week later, if it doesn't mean that we're going to be putting anybody behind the eight ball here, because I know this is big, this is a big deal.'",
        "'speaker_2': 'I'm Jeff Steinberg. I'm director of real estate for the city and county of Denver.'",
        "'speaker_0': 'Councilman, the.'",
        "'speaker_2': 'City that is planning to break ground on this property on December 5th, they can't move forward. They're actually financing the project with CLP.'",
        "'speaker_0': 'Funds and.'",
        "'speaker_2': 'It's a requirement of the lender to have this released in order for them to move forward with the loan. So it would certainly create issues and or problems on their project in terms of construction contract and timing.'",
        "'speaker_5': 'Thank you, Mr. Steinberg and Mr. President and Councilman Espinoza, I don't get this is real cut and dry. I mean, I think when it when it came to committee, it had some question. But it. It's. See that moving onto a parcel that is empty.'",
        "'speaker_5': 'And I think it's a big deal here for the west side. And I think. If that's the case, we should not postpone and you can have your questions or ask them now I guess, and the figures are suffice, but I wouldn't want to see it postponed because I think it throws a monkey wrench in this whole thing'",
        "'speaker_0': '. Hey, just. Just a point of order. So on the on the floor right now is the actual publication. So we will need to order it published and then we'll vote on that and they will vote for a postponement later.'",
        "'speaker_0': 'Councilman Espinosa, do you want to respond? With regard to publication. No, no, no, no, no, no, no. Regards to Councilman Lopez's request. Yeah. I mean, I'm happy if everyone will bear with me. I'm happy to ask the questions now.'",
        "'speaker_0': 'Like I said, I'm not totally succinct in how I was going to formulate them, but I'm happy to do that now, recognizing that there is now a deadline. I think it's silly. We are not obligated to move until 1219 on this.'",
        "'speaker_0': 'So why would CDOT, you know, put their shovel in the ground a full 14 days ahead of that date? But, you know, I've been in this position before. I can work with the situation. Okay. Tell us briefly.'",
        "'speaker_2': 'Mr. President, I wanted to suggest, since it is just publication, that we ordered it published, that would allow Councilman Espinosa a week to get answers and then not delay final, but to postpone publication until 1212. It's not it is definitely not a good idea because that would delay it now until the 19th.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. You know, Councilman Councilman Espinosa, I think we're. Go ahead and vote on the publication. Do you want to respond to Councilman Flynn's? That's fine if you're really interested in killing a really good project. Okay. I do have legitimate questions that I thought would be better save for a discussion with Jeff and company, but that's great'",
        "'speaker_0': '. Madam Secretary, roll call.'",
        "'speaker_1': 'Espinosa. Hi. Flynn. Hi. Gilmore. I Herndon. Cashman. I can eat. Lopez. All right. Ortega. Sussman. Black. Clark. All right. Mr. President.'",
        "'speaker_0': 'I. Please close the voting and announce the results.'",
        "'speaker_1': 'So I'm just like you. 12 Eyes.'",
        "'speaker_0': '12 eyes. Constable 1143 has been published. Councilman, you'll have a week to to meet with the team and get your questions answered. Okay. Counsel Madam Secretary, please bring up the next item. Council Bill 1078.'"
    ],
    "A bill for an ordinance relinquishing portions of the easement reserved by Ordinance No. 300, Series of 2006, located near West Howard Place and Federal Boulevard. Relinquishes a portion of the easement established in the Vacating Ordinance No. 300, Series of 2006, located at West Howard Place and Federal Boulevard in Council District 3. The last regularly scheduled Council meeting within the 30-day review period is on 12-12-16. The Committee approved filing this bill by consent on 11-10-16.": [
        "'speaker_1': 'I am trying to find it.'",
        "'speaker_0': 'Espinosa You want to call out? 1074 question and a vote to postpone? Correct. I move. I move that council bill 1073 placed on final consideration and do pass. Okay. It's been moved and seconded. Catherine Espinosa. We need a motion, so I'm going.'",
        "'speaker_0': 'And before you do that, actually go ahead and do the motion and then you can make your comments. Okay. I'm going to move that final consideration of Bill 1078 be postponed to Monday, December 5th, to coincide with this other bill we were just discussing.'",
        "'speaker_0': 'To a date certain. Monday, December 5th. Okay. Um. It's been moved has not been seconded. Okay. It's been moved in. Second comments. Councilman Espinosa. So this is a companion bill to the I mean, I had general questions and I'm sorry, I apologize to everyone.'",
        "'speaker_0': 'I the date that we were obligated with the 30 day shot clock was the 12th on this one and the 19th on the other one. I wasn't intending to sort of interfere with other other with the project in particular.'",
        "'speaker_0': 'So I think it's a it's a reasonable compromise to just switch it to a seven day period rather than a 14 day period. And just hopefully Jeff and.'",
        "'speaker_4': 'Company can can.'",
        "'speaker_0': 'Get with me right away. Okay. Councilman Herndon. Thank you, Mr. President. A question for Jeff. I was just and I didn't know Kathryn Lopez chimed up earlier. I didn't know if I was going to ask him. I just was curious, is on the west side if this was necessary?'",
        "'speaker_0': 'I was just trying to figure that out. So that was I. I just want to get to my councilman. Lopez wanted to chime in on that, Mr. President. So I'm from L.A. I'm just curious, I thought. Guzman-Lopez you to chime time and I do not see Jeff Steinberg.'",
        "'speaker_5': 'You know, I, you know there's you're going to see a series if I, if I can. Mr. President. I'm sorry. I don't want to speak out.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_5': 'You're going to see a series.'",
        "'speaker_0': 'I'll go and look at this. From Public Works. And I think you want to wait till she goes or you want to.'",
        "'speaker_5': 'Okay.'",
        "'speaker_3': 'Angela, kasey dec public works. Are you asking if this easement is necessary to go through? What? What is the. Is there a question about the easement?'",
        "'speaker_0': 'Mine was. Yeah. So just the stopping this how does that the as we start this walking down this path, delaying this, does that have an impact? If we were we're delaying this one vote a week. How does this impact that?'",
        "'speaker_0': 'I was just going to make sure that wasn't something.'",
        "'speaker_3': 'I mean, if they if they needed to move forward, they could do that without the easement. It would they would just it would cause an extra step.'",
        "'speaker_0': 'Okay. And then that's that's just my my concern as a president. That's why I was curious of Councilmember Lopez since he spoke up before, had a concern about that, just delaying for the sake of delay. I know Councilman Espinosa wanted to line it up.'",
        "'speaker_0': 'I just wanted to know if what we're if we're possibly missing something. Okay. Thank you, Councilman Councilor Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. Look, I am not a person to just shy away from questions and making sure that all questions are answered. But here's the thing. With Federal Boulevard, it's been in the works for a very long time.'",
        "'speaker_5': 'There's a lot of moving parts as a lot of different parcels, a lot of different acquisitions, a lot of different things happening. Just and just for folks who understand what this is about, it's adding that northbound lane. It's putting a median down federal boulevard.'",
        "'speaker_5': 'Undergrounding utilities, widening the sidewalks, putting trees on some side of it. You know, you want to be able to make federal boulevard walkable and safe. It is one of the it was at 1.1 of the most dangerous strips in the whole state.'",
        "'speaker_5': 'With that being said, there's a lot of businesses here that have parking lot issues that, you know, whenever we start doing something like this, it literally it's it's throwing a ball bearing into the machine and it could have some unintended consequences.'",
        "'speaker_5': 'What I don't want to see happen is some of these unintended consequences, being incumbent upon, you know, businesses and, you know, and work hours and things like that. So, you know, I think if you have questions, ask questions.'",
        "'speaker_5': 'This is a this is something that's ongoing. You're going to see a lot of these bills come through. That has to do with this with this project. It's part of a bigger it's part of bigger picture of what we want to see is this move forward as fast as possible.'",
        "'speaker_0': 'Okay. And Alexis.'",
        "'speaker_3': 'So I just want to clarify for this that this is a utility easement. So we're removing the easement for utilities at this location on a specific area. And so all of those utilities have been moved as part of this project.'",
        "'speaker_3': 'So there's no there's no controversy. There's no there's no everything's been resolved as far as the easement goes. So, I mean, holding it back is not I mean, there's no there's not any significance to that.'",
        "'speaker_0': 'I think that's what we need to. I appreciate that. Okay. Council members, we are going to vote on the postponement right now. If the postponement fails, we will then vote again to put this on final consideration and do pass.'",
        "'speaker_0': 'Okay. It's been moved in second it. Councilman Espinosa. Yeah, I just want to sort of help my colleague. I mean, I think we all understand it, but I just want to clarify that the two bills that I did that I called out are they're only dealing with a very defined piece of property that that is only related'",
        "'speaker_0': 'to the construction of the new headquarters, not, you know. Well, it might have tangential impact. I mean, relationship to other work does see that as doing you know, we're only talking about things that are within the property lines of that parcel that will then contain the new headquarters in their parking structure like not roadways.'",
        "'speaker_0': 'All right. Thank you. It's been moved and seconded. We're again voting on the postponement of Council Bill 1078. Madam Secretary, Raquel Espinosa Flynn.'",
        "'speaker_1': 'No Gilmore. No. Herndon, no. Cashman can each. Lopez? No.'",
        "'speaker_3': 'Ortega, I.'",
        "'speaker_1': 'Susman. No. Black, no.'",
        "'speaker_5': 'Clerk, no.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_0': 'No. Close the voting or announce the results.'",
        "'speaker_1': 'Sorry. Just making sure.'",
        "'speaker_0': 'So benign. Nice, loving.'",
        "'speaker_1': 'Four eyes and nine knees. Eight.'",
        "'speaker_0': 'Sorry, two.'",
        "'speaker_1': 'Four, eight. NIS. Unless somebody voted incorrectly.'",
        "'speaker_0': 'Yes, my name. We only have one question.'",
        "'speaker_1': 'Lopez. Did you mean to vote in favor?'",
        "'speaker_3': 'I think I voted both.'",
        "'speaker_5': 'Okay. Just for the record, I voted no, so I know that.'",
        "'speaker_1': 'Okay. Let's see. So.'",
        "'speaker_0': '12. We have 12 of them.'",
        "'speaker_3': 'You know, Kelly, I mean, to be a nine.'",
        "'speaker_0': 'Okay. So so we we have four. We have four eyes. Eight nace.'",
        "'speaker_1': 'Three eyes. So we have Espinosa Cashman Ortega for I. That's correct. Is that correct?'",
        "'speaker_0': 'Okay. Three eyes and eight names is that we have.'",
        "'speaker_1': 'Three and.'",
        "'speaker_0': '939. Okay. This the postponement for Council Bill 1078 fails. Councilman Espinoza, we now move that council bill 1078 to be placed upon final consideration and do pass.'",
        "'speaker_1': 'It's actually already on the floor, so.'",
        "'speaker_0': 'Okay. Oh, great. So we can just vote on this. It's been moved in second. Madame Secretary Rocha.'",
        "'speaker_1': 'Espinosa. No. Flynn. I. Gilmore. Herndon. Cashman. Can eat. Lopez. I. Ortega. I. Assessment I. Black i. Clark, i. Mr. President.'",
        "'speaker_0': 'I. Close voting in US results.'",
        "'speaker_1': 'So just making sure to. Lebanese one day.'",
        "'speaker_0': 'Okay 11 eyes when they counsel bill 1078 has has passed. Okay. I see no other bill's called out for a separate vote. All other bills for introduction are order published. We now ready for the block vote on resolutions and bills and final consideration councilmembers.'",
        "'speaker_0': 'Please remember that this is a consent or block vote and you will need to vote otherwise. This is a chance to call it a bill for a vote. Because when, Espinosa, will you please vote to put resolutions for adoption and the bills for final consideration on final passage on the floor?'",
        "'speaker_0': 'Thank you, Mr. President. I move that the resolutions be adopted in bills on final consideration to be placed on the upon final consideration and do pass in a block for the following items. 1610 4416 1128 1611 3716 1140, 16 1096, 16 1097, 16 1129, 16, ten, six, eight, 16, 11, 21, 1611, 27.'",
        "'speaker_0': '1611 3116 1144 1611 2616 ten 232. 16, 1085, 16, ten, 86, 16, 1088 and 1638. 16, 1038. All right. It has been moved and seconded. Secretary Roll Call.'",
        "'speaker_2': 'Flynn I.'",
        "'speaker_1': 'Gilmore All right. Herndon, I. Cashman can eat. Lopez All right. Ortega I assessment i black.'",
        "'speaker_5': 'Clark Hi.'",
        "'speaker_1': 'Espinosa.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_0': 'I.'",
        "'speaker_1': '12 eyes.'",
        "'speaker_0': '12 eyes. The resolutions have been adopted. The bills have been placed upon final consideration do pass since there are no public hearings, and if there are no objections from members of council, we will not take a recess. Seeing no other business before this body, we stand adjourned.'"
    ]
}