{
    "A proclamation recognizing April as HELP KIDS THRIVE - CHILD ABUSE PREVENTION MONTH. A proclamation recognizing April as HELP KIDS THRIVE - CHILD ABUSE PREVENTION MONTH.": [
        "'speaker_2': 'Very much for being a great.'",
        "'speaker_1': 'Partner in city community building. We appreciate it. Thank you. We have a second proclamation this evening, proclamation number 277. And I will call on Councilman Lopez to read the proclamation.'",
        "'speaker_5': 'Thank you. Madam President, I wanted to read well, will re council proclamation 277 series of 2014, which is a proclamation recognizing April as Help Kids Thrive Child Abuse Prevention Month. Whereas the city and county of Denver joins businesses, government agencies, nonprofits and dozens of other organizations across the state are observing April as Help Kids Thrive Child Abuse'",
        "'speaker_5': 'Prevention Month. And. Whereas, Blue ribbons and pinwheel gardens, which you'll see like these are on display throughout the city, signify the importance of keeping families stable, helping kids thrive, and upholding a strong community. And. Whereas, we think child care providers, doctors, nurses, parents, police officers, social workers, teachers along with all organizations and people who dedicate their lives'",
        "'speaker_5': 'to caring for and protecting children. And. Whereas, as we prepare our children for the future, by keeping them active and engaged, giving them access to the programs and resources they need no matter what their family station in life is.'",
        "'speaker_5': 'And. Whereas, children have the right to thrive, live and grow to their full potential. And. Whereas, we encourage families to surround themselves with a strong supportive system comprised of friends, loved ones and neighbors, and remember to learn on them.'",
        "'speaker_5': 'Sorry, and remember to lean on them when times get tough. And whereas we must come together as we must come together to keep children safe, ensuring that children's voices are heard by all, and extending a helping hand to children and families in need.'",
        "'speaker_5': 'And. Whereas, a Denver department of. Human Services extends a helping hand to the children and families in need by offering free parenting workshops during the month of April. And. Whereas, we ask all Denver residents to observe this month with programs and activities to help kids thrive, keep families stable, and support a healthy community in a world class'",
        "'speaker_5': 'city where everyone matters. Now, therefore, be a proclaim, be it proclaimed by the Council of the City and County of Denver. Section one of the Denver City Council proclaimed proclaims April 2014 as Help Kids Thrive. Child Abuse Prevention Month in the City and County of Denver.'",
        "'speaker_5': 'Section two that the clerk and that the clerk of the city and county of Denver shall attest and affixed the seal of the city and county of Denver to this proclamation and that a copy be transmitted to the Denver Department of Human Services.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Your motion to adopt.'",
        "'speaker_5': 'Thank you, Madam President. I move that council proclamation to 77 series of 2014 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilman Lopez.'",
        "'speaker_5': 'Thank you, Madam President. It's it's a great honor to be able to read this. And also because we are seeing these pop up all over the place. And when it's a windy day like today, you see these all over and you know, they're just a symbol.'",
        "'speaker_5': 'It's a symbol of the dedication and it's a symbol of the responsibility that we have as a community to help prevent child abuse. Right. It's not just up to social workers in schools. It's not just up to human care, human services caseworkers.'",
        "'speaker_5': 'It's up to every single one of us to help prevent this. You know, our children our children have a real beautiful future. Every single one of them in our city. And they have the potential to do anything they want to do, no matter where they come from, what the status of their families is.'",
        "'speaker_5': 'They just need the environment to allow them to grow, to allow them to be great human beings, to not live in cruelty, to not live with abuse, not be taken advantage of, but to have that innocence. We all know that childhood innocence that needs to be protected, it must be protected.'",
        "'speaker_5': 'And the only way it's going to be protected is when all of us, all of us take that responsibility. I know sometimes, you know, people in communities, you see kids running around, you know, without clothes or just a diaper running around in the front yard.'",
        "'speaker_5': 'He oh, man, that's not my kid. Thank God that's not my kid. Well, you as a community member have a responsibility. If something if there's abuse going on, if there's some kids getting yelled at, or if there's all kinds of different abuses going on and you know of it, you need to ask yourself, would you let your'",
        "'speaker_5': 'own kids go through that? Would you have been where you are today if somebody well, if somebody didn't support you or if somebody didn't do the right thing. And I think our kids and our kids have that right to self-determination, have that right to their future, and we have to protect that.'",
        "'speaker_5': 'And so that's why, you know, I did you know, I'm honored to read this proclamation. I've read this proclamation in the past because I know that the Denver Department of Human Services is a stellar department. It is the best in the state.'",
        "'speaker_5': 'And our caseworkers and our employees and all our management staff and everybody who works with the Denver Department of Human Services is a public servant, a dedicated public servant on a daily basis. They help change people's lives, helps save lives.'",
        "'speaker_5': 'They help turn lives around. And it's a very hard job because, as you know, Madam President, we do not have the budget like we used to for the down for the Department of Human Services. It is a fraction of what it used to be, but the caseload is immense.'",
        "'speaker_5': 'It's big. It's it's grown leaps and bounds, especially during the recession when our budget took a nosedive. Reports of child abuse and reports of different cases skyrocketed. And I think, you know, it's up to us as a city and this is where our county duties come in.'",
        "'speaker_5': 'And you say city and county in Denver, it's up to us to be able to fight for these families and fight for the folks and make sure the folks that are taking care of these families are also taken care of.'",
        "'speaker_5': 'Imagine having to deal case and case after case after case and go home and try to live a somewhat happy life and not think about everything you've heard right and not feel that support. So I think it's really honorable that representatives from the department are here.'",
        "'speaker_5': 'And so thank you very much. I really loved being able to read this proclamation.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_3': 'Thank you, Madam President. Councilman Lopez. Thank you for bringing this forward. I don't think there's much more that I can add. I think he was very eloquent in his comments. I would just ask that my name be added.'",
        "'speaker_3': 'And lastly, I just want to thank the social workers or caseworkers from Denver Human Services who deal with this issue day in and day out with the many families whose cases come through their doors. And as Councilman Lopez said, it is a tough job.'",
        "'speaker_3': 'But I think having worked there at the department, I know our staff at the Department of Human Services to be dedicated and to really work towards solving these situations where the safety of the children is number one. So thank you for the work that you all do.'",
        "'speaker_3': 'I see Penny May is in the audience and will probably be addressing this in a minute, but this is critically important work for our entire community. So thank you for what you do.'",
        "'speaker_1': 'Thank you, Councilwoman. I take it, Councilman Lopez.'",
        "'speaker_5': 'Madam President, I forgot to acknowledge that Councilman Albert Brooks co-sponsored the proclamation. I wanted to make sure that he was recognized for that as well, too. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez. Madam Secretary Calderon.'",
        "'speaker_2': 'Lopez. All right. Montero. Nevett. I. Ortega. I. Rob i. Brown. I thought I heard him. Can I. Layman Hi, Madam President, I.'",
        "'speaker_1': 'Madam Secretary, closed the voting unaccountable and got it close to voting and announced results.'",
        "'speaker_2': '11 eyes.'",
        "'speaker_1': '11 eyes. The proclamation is adopted. Councilman Lopez, is there somebody you'd like to bring up to the podium?'",
        "'speaker_5': 'Yes. I'd like to bring up our manager of the Department of Human Services. Miss Penny, me and anybody else. Who would you like to bring up? Penny?'",
        "'speaker_1': 'Thank you so much, Madam President, Councilman Lopez and Councilmember Silver for supporting our proclamation for April. This year's campaign is help kids thrive, and we can all help kids thrive. We all play a part in that. So we're partnering with Pinwheels for Prevention Colorado, the Pepsi Center, Focus Points, Resource Center and many other community partners to heighten'",
        "'speaker_1': 'awareness, to help strengthen families and our community as we help kids thrive. This this year and this month, part of our campaign includes five love and logic parenting seminars that will be held at our east, building their free of charge.'",
        "'speaker_1': 'They'll be child care, and they'll provide simple.'",
        "'speaker_3': 'Solutions and techniques to.'",
        "'speaker_1': 'Help parents with kids of all ages. We also will have our signature pinwheels for prevention gardens that libraries, fire stations, various city buildings, the Pepsi Center, businesses and community organizations. This year we've included with the pinwheel, a postcard and a magnet with five ways to help kids thrive.'",
        "'speaker_1': 'Tomorrow will be kicking off this month at the Focus Point's Family Resource Center with the mayor and Councilwoman Monteiro. We invite any of you who would like to join us at 130 to be there. They'll be state representatives and the Denver district attorney's office and other community partners.'",
        "'speaker_1': 'And then we're going to close out the month with an event at Hamilton Elementary School where the children have created giant pinwheels. I'm not sure what giant means, but we'll find out. And that will help us close out our month.'",
        "'speaker_1': 'So if any of you are interested or if you need more pinwheels, please feel free to contact us. I'd also like to thank our communications director, Anna, Master Cheryl for accompany me tonight, as well as Joe Homer, our division director for Child Welfare.'",
        "'speaker_1': 'So thank you. Thank you very much, Ms.. May, and thank you for all you do for the children of Denver. That that's the end of our proclamations and we will move on to resolutions. Madam Secretary, will you please read the resolutions.'"
    ],
    "Changes the zoning classification from OS-A (Open Space context, Public Parks) to S-MX-3 (Suburban context, Mixed Use, 3-story max.) of 7155 E. 36th Ave. Rear to conform to adjacent zoning in Council District 11. Changes the zoning classification from OS-A (Open Space context, Public Parks) to S-MX-3 (Suburban context, Mixed Use, 3-story max.) of 7155 E. 36th Ave. Rear to conform to adjacent zoning in Council District 11. A PUBLIC HEARING WILL BE HELD AT LEAST FOUR WEEKS AFTER PUBLICATION. The Committee approved filing this bill at its meeting on 2-18-14.": [
        "'speaker_1': 'Councilman Herndon, will you please put count 115 on the floor for final passage?'",
        "'speaker_4': 'Yes, Madam President, I move that council bill 115 to 2014 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. The public hearing for Council Bill 115 is open. May we have the staff report? Miss us. Thank you. Madam President, members of council. My name is Deirdre Rose with Community Planning and Development here with application number two 2013 i000234 7155 is 36th Avenue and this is specifically an 18,000 square foot portion of the rear of'",
        "'speaker_1': 'what is really a larger lot. The rezoning proposals to go from OSA, which is an open space, a category typically reserved for publicly maintained and owned public lands to as a mixed three or suburban mixed use three story.'",
        "'speaker_1': 'This is in Council District 11, just west of Quebec Street in Councilman Herndon's district. And as I mentioned, is a very small strip of land along the Quebec corridor where there are commercial hotel development that was associated with Stapleton Airport.'",
        "'speaker_1': 'This property is just to the west of that. Here's a picture of the property just to give you a full appreciation for what we're doing here. The property abuts an alley that serves Pontiac Street just to the west.'",
        "'speaker_1': 'And the status of the property is that it was sold to the applicant milk and hospitality, and they're the owners of the hotel just to the east of the property. There were restrictions on this property prior to it going for sale to use as open space and they were removed by prior agreement by the former owner.'",
        "'speaker_1': 'That open space agreement was specific to when the Denver Airport associates, the two owners ago on the property and reserved the area as an open space buffer in agreement with the neighborhood. The Greater Park Hill Neighborhood Association. That neighborhood association was then deeded the property and held the property and never maintained it as open space, never had'",
        "'speaker_1': 'the funding to do that and then sold the property to the applicant for this rezoning to go forward. It was never under city and county of Denver parks, maintenance or ownership and OSA is not a typical zoning for a property in that situation.'",
        "'speaker_1': 'The request is to rezone it to us. Annex three a suburban mixed use three storey, which is the same zoning as on the parcel for the hotel just to the east. The hotel is zoned as Annex three. The residential to the west is ESU.'",
        "'speaker_1': 'RDX, that's urban edge single unit D. So that is a typical corridor, commercial corridor condition, where you have a residential neighborhood adjacent to a commercial corridor and then to the north is office development. Under the industrial mixed use categories, there is quite a different diverse array of context in this area.'",
        "'speaker_1': 'The building form and scale around this site, I showed you the site itself, but then there are single storey homes as well as the office development to the north. Again, it's fairly low scale as far as the process is to has out a ruling on February 25th and is it a city council today.'",
        "'speaker_1': 'Regarding public outreach, as I mentioned, the Greater Park Hill Neighborhood Association, per community association did sell the property to the applicant and did remove the deed restriction for open space. So we did not receive any other comments from any other associations.'",
        "'speaker_1': 'We have reviewed this zoning consistent with our review criteria, including consistency with adopted plans, uniformity of our district regulations, furthering the public health, safety and welfare, justifying circumstances and consistency with neighborhood context on district and intent. With regard to neighborhood plans, I'll quickly go through these because really this is a matter of ensuring that this slice of'",
        "'speaker_1': 'property has the same zoning as the proper. That is owned by the same owner to the east. But regarding comprehensive plan, there are typical strategies regarding urban infill development and consistency with zoning, encouraging quality infill development that is consistent with the character of the surrounding neighborhood.'",
        "'speaker_1': 'In order to further develop this property at any point to use this property, it would have to have the same zoning as a hotel site to the east, whatever it may become in the future. With regard to Blueprint Denver, this is also an interesting piece of information.'",
        "'speaker_1': 'This is an area of stability along this commercial corridor. It has never been residential along the commercial corridor, but it is designated as an area of stability where changes can occur and they just don't happen on quite as large an impact as areas of change.'",
        "'speaker_1': 'Let's say Stapleton, just to the east of Quebec, on the other side. With regard to streets 36th Avenue and 38th are both designated local and industrial collectors. And in Quebec Street is a commercial arterial. The Park Hill Neighborhood Plan does not specifically talk to the site, but along the Quebec Street corridor.'",
        "'speaker_1': 'There are descriptions of the sub area in which the site is located, talking about it being framed by airport, hotels and other industrial businesses, and that with the economic development goal being five to develop vacant land in a way that is compatible with the character and density of the surrounding business and neighborhoods.'",
        "'speaker_1': 'And the Stapleton perimeter plan designates the property as underutilized land, but doesn't have any specific recommendations with regard to justice. Justifying circumstances of explain those in the preceding discussion that the property is really no longer considered or ever managed as open space at this time.'",
        "'speaker_1': 'And a deed restriction on the use was removed by the former owners in 2012. Therefore, current zoning is generally reserved for publicly maintained parks in open space, and a new zone district needs to be assigned with regard to neighborhood context, zoning and intent.'",
        "'speaker_1': 'Within the suburban neighborhood context, it is being proposed to have the same zoning as the property to the east, capturing current conditions on the commercial sites and should it ever be developed, would be developed part and parcel with that larger site.'",
        "'speaker_1': 'With that, CPD recommends approval based on the finding that all review criteria have been met. Thank you. Thank you very much, Mr. Ose. Two speakers. The Mr. Mallory would like to come to the podium and speak or know.'",
        "'speaker_1': 'You don't. You don't have to know, okay? You're just here for questions if we have them. Okay. Thank you very much. Sekou.'",
        "'speaker_4': 'Yes. Chairman Sekou Black Collective Movement, self-defense, representing poor, working for homeless people. First of all, it's my honor to be here today in support of this. The only change. It may seem small and trivial, and we're trying to put together some consistency in terms of how these different areas have some consistency in terms of zoning for possibilities'",
        "'speaker_4': 'of development and from looking at the picture. Most folks would think that what you're going to do with this I mean, this analogy does and real do this. I know this man. And I've had homeless people stay in his hotel.'",
        "'speaker_4': 'He's been more than kind in embracing us and helping us out to find emergency housing for them. When it's like going through a bunch of loops and circles and things to get it done through the city, especially on emergency thing.'",
        "'speaker_4': 'And so he's been there for us, and we hope that you will approve the zoning change because just thinking about it, it would be an excellent spot to teach poor people how to grow some food. I mean, what better place to do it?'",
        "'speaker_4': 'And it's already set up in a row. So it's almost like we decided to plant some cotton and we'd be right there with it and maybe get a shirt out to do that. But it gives us a chance to do something and be active and keep the neighborhood looking good.'",
        "'speaker_4': 'And there's a lot of possibilities for it. If we just take this thinking out the box and I'll be sharing these ideas with my friends here, and I would like to personally thank you for all the work that you've done.'",
        "'speaker_4': 'And my brother, who lived at the hotel, who Pastor Jerry Stephens. We spent a lot of time at that pool together, figuring out how to keep me from ended up going to jail by coming down here every week.'",
        "'speaker_4': 'So thank you very much for your time and I hope you guys support this donation.'",
        "'speaker_1': 'Okay. That's the last of our speakers. Are there questions from council? And seeing none. Well, we'd have one. There is one councilman. Never just in the next.'",
        "'speaker_4': 'Or maybe two early. Thank you, Madam President. I just. I can't resist asking a question. So is this a it couldn't quite see it on the the display. Is this on the other side of the alley from the existing or is it on the same side of the alley as the existing smx3?'",
        "'speaker_1': 'It is on the same side.'",
        "'speaker_4': 'It's on the same side of the alley. Right.'",
        "'speaker_1': 'If you if you look at there's a zoning picture in your staff report as well, I guess you don't have the. But just to the east of the site is that some x three that goes north and south between 38th and just south of 36.'",
        "'speaker_4': 'So if you so if you go from oh, now, that didn't make sense. Go back in you reach the the this weird osa strip before you get to the alley.'",
        "'speaker_1': 'That's right.'",
        "'speaker_4': 'Strip. And then you get to the alley. So rezoning this strange strip that's been reserved next to the alley. Right. Got it. Okay. So that was sort of confusing me. And then the neighborhood association owned this piece. The third.'",
        "'speaker_1': 'Yeah. The the former owner, Denver Airport Associates, I imagine, has developed many of the hotels or those properties for that commercial development. And in some discussion with the neighborhood for which notes, we could not find anything on it.'",
        "'speaker_1': 'But according to the Greater Park Hill Neighborhood Association reps of today, that it had been granted to their neighborhood association as an open space buffer from the commercial development. And then they were provided the property and the responsibility of maintaining it and then were cited for not maintaining it.'",
        "'speaker_1': 'Because if you look at the property and you look at the picture, it's doesn't make sense that it's the property they would be maintaining. It actually looks like it belongs to the hotel. And so now with it under other ownership, actually the current owner is responsible and has been responsible for maintaining that.'",
        "'speaker_1': 'So yeah, it was. And then the Denver Airport Associates actually removed the restriction for the Greater Park Hill Neighborhood Association in order for them to sell it so that.'",
        "'speaker_4': 'It wouldn't happen. Oh, I see. So the airport association sold or gave it to the neighborhood association with the Covenant and then had to remove the covenants so the neighborhood association could then sell it to the. Thank you.'",
        "'speaker_4': 'The current owner got it. Yes. Wow. That must be the only occasion of a neighborhood association owning a big chunk of property. Anyway, that's. I'm sorry. This is just mere curiosity. I look forward to voting in favor of this.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Nevitt. And see no other questions. I'll close a public hearing. Ask for comments from council members. Councilman Herndon.'",
        "'speaker_4': 'Thank you, Madam President. As Councilman Levitt said, this is a bit peculiar, but I think we're certainly fixing the dilemma. I've met with the owner as well as the Register Neighborhood Organization, and you would be surprised at the costs it takes to maintain that plot.'",
        "'speaker_4': 'And they were certainly losing money funds doing this. And this is certainly, as most people realize, assumed it belonged to the the hotel as well. So it's happy that all parties involved were really happy with this. And I certainly would encourage my colleagues to support this.'",
        "'speaker_1': 'Thank you, Councilman Herndon. And seeing no other comments, i will ask for Raquel Herndon.'",
        "'speaker_2': 'I can eat Lemon Lopez Montero by Nevitt Ortega by Rob Wright. Brown Fats.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Madam President, I.'",
        "'speaker_1': 'Madam Secretary, close to voting. Announce the results.'",
        "'speaker_2': 'Tonight.'",
        "'speaker_1': 'Ten Eyes. The bill passes on Monday, April 28th. Council will hold a required public hearing council bill 245 Changing the class zoning classification of 24 2024, 30, 24, 42, 24, 60 and 2460 through to 2490. South University Boulevard.'",
        "'speaker_1': 'Any protests against Council Bill 245 must be filed with the council officers no later than noon on Monday, April 21st, 2014. And seeing no other business before this body, this meeting is adjourned. Thank you, everyone. Denver ATV.'",
        "'speaker_2': 'Your city, your source.'",
        "'speaker_0': 'Denver eight on TV and online. To stay connected to your community, your city, your source.'"
    ]
}