{
    "A bill for an ordinance establishing a temporary voluntary disclosure and compliance plan process for existing buildings that have undergone unpermitted work, and temporarily amending Section 142.2 of the administrative section of the Denver Building and Fire Code to allow occupancy of certain existing buildings prior to the issuance of a certificate of occupancy through a conditional certificate of occupancy. Amends Chapter 10 of the Denver Revised Municipal Code (DRMC) to allow occupancy of certain existing buildings through a conditional certificate of occupancy.  The Committee approved filing this bill at its meeting on 6-28-17.": [
        "'speaker_4': 'Man. A man, councilman.'",
        "'speaker_1': 'Can we give it up for Councilman Lopez, please? How? All right. We're going to go right to presentations. Madam Secretary, do we have any presentations?'",
        "'speaker_3': 'None, Mr. President.'",
        "'speaker_1': 'Communications. Do we have any communications?'",
        "'speaker_3': 'None, Mr. President. How about.'",
        "'speaker_1': 'Proclamations? Proclamations?'",
        "'speaker_3': 'None. Mr. President.'",
        "'speaker_1': 'Great. Can you read the resolutions, please?'",
        "'speaker_3': 'From Business Arts Workforce Aeronautical Services 736 Resolution Protocols Agreement Change City and County of Denver. J.C. Watts, Inc.. Concerning Project Management Services at Denver International Airport 737 Resolution New Oppose Agreement between City and County Denver to Follow and Associates, Inc. concerning project management services at Denver International Airport 738 Resolution Approve any post standard concession agreement between City'",
        "'speaker_3': 'and County Denver Rocky Mountain Hospitality Partners, LLC concerning concession at Denver International Airport 739 Resolution Approve New Post Standard Concession Agreement between City and County Denver Host ESL DNF LLC concerning concessions at Denver International Airport 740 Resolution of Universal Standard Concession Agreement 13 City Encounter HFA Ltd HD An LLC concerning concession at Denver International Airport 741 Resolution'",
        "'speaker_3': 'of Revenue Agreement for Professional Services between City and County of Denver Metrics Advisors, LLC. Concerning the Premium Value Concessions Program at Denver International Airport. 742 Resolution Approve any post agreement between City and County for ABM Aviation, Inc. concerning operation of curbside transportation management services at Denver International Airport.'",
        "'speaker_3': '743 Resolution Approve any post office lease agreement between City and county Denver DNA Solutions LLC concerning office space at Denver International Airport 744 Resolution of Rooney First Ninth Amendment to Agreement between City and County of Denver Sky Port Holdings, LLC concerning concession at Denver International Airport Financing Governance 749 Resolution for new post temporary crane license agreement between'",
        "'speaker_3': 'City and County Denver South Broadway Station Improvements LLC for the temporary operation and use of a crane swing 753 Resolution approved impose a mandatory agreement between city and county Darren Caplan, Kersh and Rockwell LLP to increase compensation lane use transportation infrastructure 650 resolution approving post second amended three Concession License between City and county Denver ABC Evergreen LLC'",
        "'speaker_3': 'for Food and Beverage Concession, Evergreen Golf Course and a Modified Concessionaires Improvement Responsibilities and special event procedures for non golf events. 747 Resolution Laying out opening instruction as part of the City Streets System Paso Lane as a public alley founded by West 44th Avenue Zone.'",
        "'speaker_3': 'Rio Street. Sheraton Boulevard in West 46th Avenue. Safety. Housing. Education. Homelessness. 506. Resolution Approving Foes Agreement between City and County. Denver, Colorado Women's Employment and Education, Inc. Doing Business Center for Work Education. Employment to provide case management support for employment and Training Services to Temporary Assistance for Needy Recipients.'",
        "'speaker_3': '507 Resolution Approving Proposed Agreement to Man City Encounter and Jewish Family Service to Colorado, Inc. for Employment and Training Services to Temporary Assistance for Needy Families TANF Recipients 733 Resolution Approving and Providing with execution Post Grant Agreement between City and County Office of National Drug Control Policy concerning high intensity drug trafficking area fiscal year 17 program and'",
        "'speaker_3': 'the funding therefor 748 resolution approving the Mayor's appointment to the Affordable Housing Advisory Committee.'",
        "'speaker_1': 'All right. Thank you, Madam Secretary. Now read the bills for introduction.'",
        "'speaker_3': 'For Finance and Governance 659 Before Norton is naming the city owned building located at 2051 Fremont Place in a Joe Haines Early Learning Center 691 Bill for an ordinance monkey supplemental appropriations at Denver Municipal Airport System Enterprise Capital Equipment Improvement Fund and 735 bill for an ordinance establishing any new fund in the general government.'",
        "'speaker_3': 'Special Owner Fund for the Firefighter Heart Benefit Program.'",
        "'speaker_1': 'Madam Secretary. Is that it?'",
        "'speaker_3': 'That's it.'",
        "'speaker_1': 'All right. All right. Councilmembers, this is your last opportunity to call out an item. Now do a quick recap. Under resolutions, nothing has been called out under bills for introduction. Nothing has been caught out on the bills for final consideration.'",
        "'speaker_1': 'Councilwoman Ortega has called out Council Bill 726 for an amendment under pending. Nothing has been called out. Madam Secretary, can you please put the first item on the screen? 726 Thank you very much. Councilman Lopez, will you please put Council Bill 726 on the floor?'",
        "'speaker_6': 'Thank you, Mr. President. I move that council will certainly be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. It has been moved and seconded. Councilwoman Ortega, go ahead and make your amendment.'",
        "'speaker_5': 'Council members a move to amend Council Bill 17 0726 as follows on page one 926 Strike July 19, 2019 and replace with January 17, 2020. On page two Line 14, add the following phrase to the end of subsection four A except as specifically allowed in subsection four.'",
        "'speaker_5': 'See below on page two, line 18. Add the following phrase to the end of subsection four C except during the period July 21, 2017 through January 19th, 2018, on page two, lines 22 through 26, strike all references to 270 and replace with 365 on page two line to strike the word and on page to line 29 strike'",
        "'speaker_5': 'the period at the end of the line in insert and at the end of the subsection four print F and page two line 30 insert new subsection 4G that reads as follows. G during the period July 21, 2017 through January 19, 2018.'",
        "'speaker_5': 'Owners or tenants of existing buildings who have received an order to vacate from the city from December one, 2016. That's a typo. Through July 21, 2017, due to unpermitted work and or no valid certificate of occupancy may apply for a compliance plan subject to the conditions of subsections.'",
        "'speaker_5': 'Four Perin B Perin D for an E and print F above a light on page two Line 31 strike July 19, 2019, and replaced with January 17, 2020 2020. On Page three Line two Strike July 19, 2019 and replace with January 17, 2020.'",
        "'speaker_5': 'On page three, line 28, strike the word and from building official on page three, line 30, strike the period at the end of the line in insert end on page three line 31, insert new subsection six E that reads as follows For any owners of tenants who may apply for a compliance plan as allowed in Section four'",
        "'speaker_5': 'G above may also apply for conditional certificate of occupancy subject to the requirements of Section five through ten of this ordinance. And on page six Line one, insert a new Section 11 that reads as follows. Section 11 Every six months from the effective date of this ordinance, Community Planning and Development shall prepare a written report to be'",
        "'speaker_5': 'delivered to City Council, explaining CPD's activities related to an assessment of outcomes of applications and issuances of compliance plans and conditional certificates of occupancy. No later than October 18th, 2019, CPD shall conduct a policy review of this ordinance and report any recommendations to City Council.'",
        "'speaker_1': 'It has been moved. I need a second. However. David Braswell I see a typo in this. It says. Did you say owners of or owners or. Councilman Ortega.'",
        "'speaker_5': 'I which.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_5': 'It's e g.'",
        "'speaker_1': 'E parentheses e below. Page three.'",
        "'speaker_5': 'Owners of tenants that should be owners or tenants. Okay.'",
        "'speaker_1': 'Just just just want to make that. Let the record show that it's not of us or. Okay. It's been moved and seconded. Um, let's see what your comments. Yeah, go ahead. Okay. Councilman Ortega.'",
        "'speaker_5': 'So let me let me first say that there were a number of meetings that took place between CPD and the D y, a group that represents the artists in the Reno Arts District. You know, we had a public hearing last week on this ordinance.'",
        "'speaker_5': 'There were some concerns expressed, and I think we were able to work through all of the issues by sitting down with CPD. I was not party to the actual meetings but was in the loop on all the discussions going back and forth.'",
        "'speaker_5': 'So I'm going to just read this to explain what the amendments do. So this amendment extends the time frame of the ordinance for an additional six months. The amendment allows owners and tenants of existing buildings that have been modified without permits required by Denver's building code to apply for a compliance plan and conditional certificate of occupancy.'",
        "'speaker_5': 'Even if the owners and tenants have not voluntarily disclosed the existence of unpermitted work, but only for the first six months after the effective date of the ordinance. Additionally, owners tenants of existing buildings that have received an order to vacate from the city due to unpermitted work or no valid certificate of occupancy from December one, 2016 to'",
        "'speaker_5': 'the effective date of the ordinance may take advantage of the compliance plan and conditional certificate of occupancy process. Last, the amendment creates a requirement for CPD to prepare reports of the Conditional Plan and Conditional Certificate occupancy programs for City Council every six months and for CPD to review the program three months prior to the end date of'",
        "'speaker_5': 'the ordinance and report any recommendations to City Council. Lastly, I do want to acknowledge that there are representatives of the d y arts community in the audience. Just ask if maybe you raise your hands, acknowledge your agreement with the amendments.'",
        "'speaker_5': 'We are not having a second public hearing tonight, but just want to thank you for your input last week and to say that your input made a difference. So I just want to encourage my colleagues to support this amendment tonight and allow us to move forward and have safety issues addressed while at the same time really working'",
        "'speaker_5': 'with the artists community who are challenged. The last piece I'll mention is that we will. Councilman Cashman has committed to assist in trying to help us find some dollars that may be available to assist and hopefully work with the other groups in the Reno Arts District, whether it's the bid or maybe some of the businesses that are'",
        "'speaker_5': 'down there to match funding that might be used and assist the folks who are trying to get some of those safety life safety issues in your facility addressed. So just want to encourage your support for this amendment tonight.'",
        "'speaker_1': 'Thank you. Thank you, gentlemen. I say again, thank you for your support of this to get this going. Councilman Espinosa, you're up. And Mr. President, are we asking questions if we have a breath since you're here? Quick question.'",
        "'speaker_1': 'The the ordinance is clearly written around the 2015 code, which I like, because it offers some predictability. But since we're going out to 2020, there is a chance that something could come. There might be an M and a another adopted code between now and then.'",
        "'speaker_1': 'Do you see that happening?'",
        "'speaker_10': 'I wouldn't think so. I wouldn't think we'd have a coat of another coat adoption before the expiration of this time period.'",
        "'speaker_1': 'So, well.'",
        "'speaker_10': 'We could certainly address that. If we if that turns out to be, we can certainly mean that it would be for our version. You're saying no.'",
        "'speaker_1': 'She's not doing it again.'",
        "'speaker_4': 'I think we're going to have another code amendment. Yeah.'",
        "'speaker_1': 'Right. All right. Great. Thank you.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Good question. Councilman Cash, when you're up on questions, questions, comments. Yeah, you turn on your mike.'",
        "'speaker_9': 'Thank you very much. I just first want to thank Councilwoman Ortega for putting this together along with the.'",
        "'speaker_10': 'CPD in our DIY community.'",
        "'speaker_9': 'And I just couldn't be more.'",
        "'speaker_10': 'Proud.'",
        "'speaker_9': 'Of community planning and development and our artistic community.'",
        "'speaker_10': 'For.'",
        "'speaker_9': 'Coming to a compromise that works. It's going to be.'",
        "'speaker_6': 'The.'",
        "'speaker_9': 'Beginning, I think, of of changing or of giving a future to our bohemian arts community that I think is so important. And, you know, at the hearing last week, the number of issues that popped up, I wondered how it was going to resolve and the level of commitment on both sides made it fall into place fairly quickly'",
        "'speaker_9': '. I don't know if it, in fact, does answer each and every detail of concern from from the artistic community. But I think it goes a long way and we can look and we will keep our eye on how this evolves and if it needs to tweak along the way, maybe we need to get back together.'",
        "'speaker_9': 'But thank you all for for some hard work. It's important.'",
        "'speaker_1': 'Thank you. Yeah, thank you. Councilman Kasper and Councilman Councilwoman Canete.'",
        "'speaker_7': 'Thank you very much, Mr. President. Little mea culpa for throwing out the idea of amendment, but then not having the capacity to really work her lead on it. So I just want to say that I appreciate the staff and Councilman Ortega really leading on the implementation.'",
        "'speaker_7': 'And I want to also just commend the department. You know, the idea of regulatory enforcement and flexibility are kind of an anathema. The two concepts don't really go well together. And so this kind of creative thinking is is really important.'",
        "'speaker_7': 'And I think it's it's a sign of our evolution, the idea that if we have a certain goal, which is safety and folks, you know, being able to come forward, that it's best served actually by something like this than it is by rigidity, because people are more likely to hide safety hazards without something like this, and that'",
        "'speaker_7': 'doesn't make us safer. So I think this focus on the end outcome and vision and goal versus the details along the way is is the right approach. And so thank you to the community for working with the department to find some of these changes this week.'",
        "'speaker_7': 'And I'll be happy to support these amendments.'",
        "'speaker_1': 'Great. Thank you. Councilman, can you tell someone to take you back up?'",
        "'speaker_5': 'Yeah, I just wanted to extend my appreciation also to our city attorney, Adam Hernandez, who drafted the amendments, sat in on the meeting. And the meeting in Brad's office actually included the other agencies that would need to weigh in, like the fire department and and others, the building department, so that we weren't having to schedule more meetings'",
        "'speaker_5': 'and postpone the the the bill and the amendments, but really be able to bring everybody together all at once and and hash out the the issues and the concerns that were outstanding. And Brad, to you and Jill, in, you know, your efforts in pulling everybody together, I just want to thank you for helping make this happen.'",
        "'speaker_5': 'So I think this will be a good thing for the city of Denver. And just appreciate your support. My colleagues support as well.'",
        "'speaker_1': 'That's great. Thank you. Councilwoman Ortega, I just want to remind everyone, we're voting on the amendment that we have to vote on the bill 726 as amended. And my final comments are, I think CPD, our legal team building code, I said this last week, you all came quite a ways.'",
        "'speaker_1': 'And I think our artists, the fact that ours or in this building went through security and are sitting in these seats to to fight for an amendment, y'all came quite a ways. But this is not it. There's a lot of work that we have to do and this proves that we can do the work together.'",
        "'speaker_1': 'So thank you all for working very hard. Madam Secretary.'",
        "'speaker_3': 'Raquel Ortega. Hi assessment i black clerk. Hi Espinosa by Flynn I Gilmore I question can each Lopez I knew Mr. President.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2901 Broadway in Five Points. Rezones property at 2901 Broadway from I-B UO-2 and R-MU-30 with Waivers and Conditions to C-MX-16, (industrial and residential, mixed-use to commercial, mixed-use) in Council 9. The Committee approved filing this bill at its meeting on 6-6-17.": [
        "'speaker_1': 'Council is reconvene. We have three public hearings this evening. Speakers should begin their remarks by telling council their names and cities of residents and if they feel comfortable doing so, their home address. If you're here to answer questions only when your name is called, come to the podium.'",
        "'speaker_1': 'State your name and know that you're available for questions of council. Speakers will have 3 minutes unless another has yielded his or her time, which would result in a total of 6 minutes on the presentation monitors to your right and left on the wall you will see their time count down speakers must stay on the topic of'",
        "'speaker_1': 'the hearing. Ms. Director comments to the Council as a whole and please refrain from profane or obscene speech. Direct your comments again to council as a whole. Okay. And no individual attacks, please, councilman. Oh, never mind. We're okay.'",
        "'speaker_1': 'Okay. Council Lopez, will you please put Council Bill 615 on the floor.'",
        "'speaker_6': 'It is the president of the council bill 615 to please two one panel final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. Public hearing for council bill 615 is now open. May we have the staff report?'",
        "'speaker_9': 'Thank you, Mr. President, and Councilor Scott Robinson with Community Planning and Development. This is a request to rezone 2901 Broadway from I.B.M. to an RMU 30 with waivers and conditions to see Annex 16. This and the next case.'",
        "'speaker_9': 'Right next to each other. But there are two separate applications. There'll be two presentations. The property is in Council District nine in the Five Points neighborhood. In the Navajo Market Development at the southwest end of the Brighton Boulevard corridor.'",
        "'speaker_9': 'Property is about an acre and a half. There's currently a 29,000 square foot industrial structure on the property. The applicant is requesting the rezoning to redevelop the site. The majority of the property is zoned oh two and then a small portion at the northeast corner of the property is review 30 with waivers and conditions.'",
        "'speaker_9': 'Which is the ambiguity of the Industrial Zoning Review. 30 years old code. Former Chapter 59 residential mixed use zoning and then see Annex 16 is urban center context mixed use with a 16 storey maximum height. Surrounding properties are either remunerated with waivers in conditions or B you go to as well.'",
        "'speaker_9': 'The waivers and conditions that apply to the small portion zones ami 30 limit the height to 75 feet. There's a 12% minimum open space within the general market GDP area and a few other things. There's a GDP, a general development plan that covers the majority of the general market area.'",
        "'speaker_1': 'Scott, can you hold on just a second, Madam Secretary? We are not finding this PowerPoint in our. In our slide deck. Do we know if it's. Okay.'",
        "'speaker_4': 'You can see if I'm just looking at the staff report.'",
        "'speaker_1': 'Okay. So members of council, you can either look on this slide deck in front of you or there's a staff report that you can pull up as well. Okay. Go ahead.'",
        "'speaker_9': 'I'm sorry. So there is a general development plan for the general market area that covers the majority of site. And that was done in conjunction with the waivers and conditions zoning in 2007. But this property is not actually covered by the GDP.'",
        "'speaker_9': 'So there is a slight mismatch in where the zoning was applied and where the general development plan was applied. So a portion of the zoning with waivers and conditions was applied to this property. But the general development plan was not.'",
        "'speaker_9': 'As I mentioned, the site is currently has an industrial use. There are new apartments in the target market area just across the way to the north railroad track to the south and southeast and then vacant land on the east and west.'",
        "'speaker_9': 'You can see the new apartments there on the top left. The existing building there in the center and the railroad tracks down there on the bottom. Right. This application was reviewed by the Planning Board on May 17th. They voted 7 to 2 to recommend approval.'",
        "'speaker_9': 'There was no public comment at that meeting. I also went to the Land Use Transportation Infrastructure Committee on June six and we received no written public comment on this application. So, as you know, to approve a rezoning, the city must find that these five criteria are met.'",
        "'speaker_9': 'The first is consistency with adopt plans. There are three adopted plans that apply to this property. The first is comprehensive plan 2000. As described and staff report, staff has found that the application complies with these four strategies from the comp plan, mostly relating to mixed use development and redevelopment.'",
        "'speaker_9': 'The second plan is Blueprint Denver from 22. The plan designates the future land use concept for this property as mixed use, which calls for a mix of employment and residential at higher intensity than other areas in the city.'",
        "'speaker_9': 'It's also designated an area of change. Blueprint. Denver also includes street classifications. However, a waterway, the street on which this property sits, did not exist in 22 when the plan was adopted. So it doesn't have a designation in Blueprint Denver.'",
        "'speaker_9': 'But looking at the other local streets within that did exist in 2002, which were designated and designated locals. We assume that move all the way would be designated local as well. Which intended to provide access to individual properties and connect them to collector in arterial streets.'",
        "'speaker_9': 'Broadway and Brighton to the east are just a mixed use arterial. The Allegheny is a residential collector and that connects to Park Avenue, which is also an arterial. The River North Plan from 23 includes specific recommendations for the general market area, also designated as residential mixed use, which says both residential mixed use and commercial mixed use zoning'",
        "'speaker_9': 'are appropriate and calls for a compact, mixed use pedestrian friendly development in the area and does not include any specific height recommendations for the property. So Steph believes that the proposed Connect 16 zoning is consistent with the adopted plans and finds the first criterion met.'",
        "'speaker_9': 'The second criterion is uniformity of district district regulations. Steph finds that the proposed rezoning will result in the uniform absolute application of the annexed 16 zoning. The third criterion is to further the public health, safety and general welfare of the city.'",
        "'speaker_9': 'Steph finds that the proposed rezoning will do so by implementing the city's adopted plans. The fourth criterion is for justifying circumstance. Steph finds that there are changes in changing conditions in the inarguably development area and in the broader Brighton Boulevard corridor to justify the rezoning in this case.'",
        "'speaker_9': 'And the fifth criterion is consistency with the neighborhood context, zone, district purpose and intent. This is where the planning board had some discussion when they looked at it. Staff finds that the proposed rezoning is consistent with the purpose and intent of the scenic 16 zone district seem like 16 does call for development served primarily by major arterials'",
        "'speaker_9': '. And while this property does not have direct access to a major arterial, the area is served by, as I mentioned, both Broadway and Park Avenue, and the locals provide pretty quick access to both of those arterials. It's also well-served by transit and has good bike infrastructure, with both the South Platte Trail and the new cycle tracks that'",
        "'speaker_9': 'are going in on Bryant Boulevard. So that staff finds that the intent of the Connect 16 zone district is met and that all five criteria have been met and therefore staff recommends approval. I'll be happy to answer any questions.'",
        "'speaker_1': 'Thank you, Scott. Great presentation to the point. All right. We have three speakers this evening, if you would, please. Yes. If you please sit up on this front bench when I call your name. James West. Dudley Simmons and Chase Hill.'",
        "'speaker_1': 'James West. Your first. You have 3 minutes.'",
        "'speaker_9': 'I'm James West. My address is 24 2017, number 316 here in Denver. I'm just the applicant here to answer questions.'",
        "'speaker_1': 'Great. Thank you. Dudley Smith. Simmons.'",
        "'speaker_10': 'Dudley Simmons. My address is 24 2017, Suite 3016. Here to answer.'",
        "'speaker_1': 'Questions as well. Great. And Chase Hill.'",
        "'speaker_9': 'Yes. My name is Chase Hill with Alcohol Residential. My address is 2420 West 17th Street, Suite 3016 here in Denver. I'm here to answer questions as well.'",
        "'speaker_1': 'Thanks. Thank you. You guys practice your speeches together for your candidate, okay, Councilwoman Canete.'",
        "'speaker_7': 'Thank you, Mr. President. I was going to ask if community development could come up again and talk about the slide that flashed on the screen really quickly. And it said that one of the conditions of the site was that there was a requirement for an affordable housing plan.'",
        "'speaker_7': 'But I don't remember you discussing that in any detail. So I wanted to ask if you can please go into as much detail as possible about that current requirement and then what the new zoning is carrying over.'",
        "'speaker_9': 'Right? So this was for the portion that was zoned AMI 30 with waivers and conditions, which was just this the small portion over here. So this was a part of the target market general development plan. When I was adopted, there was a requirement for a affordable housing plan to be put in place before the first development was'",
        "'speaker_9': 'approved and constructed in the target market. So that already took place with several developments having already been constructed in target market. The affordable housing plan was pretty similar to what the the affordable housing requirement was before the adoption of the fee last year.'",
        "'speaker_9': 'So is that for sale? If there was for sale product built in the general market area, a certain portion of it had to be affordable. And so so far there hasn't been any affordable housing or for sale housing built in the general market.'",
        "'speaker_9': 'But this property being re zoned out of that small portion that was covered by that being rezoning out of that will now have to comply with the current affordable housing requirements.'",
        "'speaker_7': 'Great. Thank you. And if I can ask someone from the team, you guys can decide who's appropriate, what your intentions are. The current ordinance, you know, has a fee per square foot, which obviously for the industrial and commercial floors that you'll be doing in your building would would would be appropriate.'",
        "'speaker_7': 'But for the residential, it allows to perform on site and build the units on site. Have you given any thought to how you plan to approach that?'",
        "'speaker_9': 'Yeah. Can you repeat the second part of that question? Yeah.'",
        "'speaker_7': 'So the new linkage fee that the council passed last year applies and that there's a per square foot fee on all development regardless of the type. But if you're building residential units, you could choose to include affordable units instead of paying the fee, you'd get credit towards the fee.'",
        "'speaker_7': 'And I was just curious if you have had some conversation yet about how you're going to go about approaching affordable housing in the project if you're planning just to pay the fee or you're thinking about building some affordable units.'",
        "'speaker_9': 'Rates are currently only for multifamily. It's a dollar 50 per square foot. So for the we're calling the phase three, which is the western side, it's about a 250 to anticipate it to be about 25,000 square foot sites that be about at $375,000 fee.'",
        "'speaker_9': 'On the fourth phase, the eastern side, that's probably about the same 200 to 200000 square feet. Again, a $385,000 fee. So combined $750,000 linkage fee. And currently that's what we intend to do. Obviously, we know that was formally adopted at the end of last year and we intend to pay that, obviously to adhere to that.'",
        "'speaker_7': 'Okay. I just I would just well, it's not comments. So you could talk to the department about the possibility of including units. I encourage you to think about that. Well, thank you.'",
        "'speaker_9': 'Let me just say that in Austin, Texas, the requirement is actually inclusive, affordable housing instead of a linkage fee. And a lot of developers and a lot of constituents and citizens of Austin are actually more in support of the linkage fee.'",
        "'speaker_9': 'The problem we've had and projects in Austin too that come to mind where we did have 10% affordable at 60% of in the thigh one and the other one is 10% and 80% of it. So we actually had a hard time leasing those units even at the affordable rates.'",
        "'speaker_9': 'And I'm not sure if it's that they're one and two bedroom units in the locations or the amenities aren't attractive to those people that that could choose to live in the projects. So we've actually had vacancy in those units, surprisingly.'",
        "'speaker_9': 'So we think the linkage fee is actually a better solution because it allows you, the city of Denver, to take the funds into the paid into that that linkage fee account or fund and decide where you want to build affordable housing, how you want to build it, what kind of amenities you want, include kind of finishes and'",
        "'speaker_9': ', and really have a project at a location of your choosing to address that need.'",
        "'speaker_7': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Yeah, thank you. Can someone can each councilman as well? Yeah. Along that line, is there some documented stuff or is that just purely anecdotal?'",
        "'speaker_9': 'In Austin, Texas, or in Austin. You want me to file documentation that we did that did the timbers and affordable it to projects in Austin?'",
        "'speaker_1': 'Yeah, but is that true for all these projects that have.'",
        "'speaker_9': 'Been recalled or I can only think of the two that we've that we built in the past three years. But I've heard that's the case that other projects as well, surprisingly, that when there is an affordable component, you think there would be a line out the door to live in those units and the wait list for those'",
        "'speaker_9': 'units. And in fact, that hasn't been the case. Again, both those were urban infill projects. So some of those affordable units were 600 square foot one bedrooms, some were 900 square foot two bedrooms. And perhaps that's not the right unit mix or unit size for to address that need.'",
        "'speaker_9': 'So that could be an issue you would have here in Denver, I would imagine, if you try to do the same thing.'",
        "'speaker_1': 'Sorry. The the the. And this is helping me sort of understand the the sort of the option to continue to buy out rather than to provide the. Do you think. Well, I'd be curious to. To. Councilman, there's so many things you can think about.'",
        "'speaker_1': 'Come right back. Yeah, that'd be great. Sorry. Councilman Cash. Okay. So quick question. Actually, Scott, let me have you answer this. So we're rezoning this to 16.'",
        "'speaker_9': 'Correct.'",
        "'speaker_1': 'Currently, we're in conversations coming before this council of the 30th and Blake Station Air Station area. They would not have to comply with the design standard.'",
        "'speaker_9': 'Right. This this property is not included within the 30th and Blake.'",
        "'speaker_1': 'That's right. It's right outside. Okay. Sorry. Sorry about that, huh? Let me just ask let me ask some one of you all to address this question. This process at the rhino area has been through for the last two years, looked at addressing affordability, what you guys just talked about.'",
        "'speaker_1': 'But it also looked at design standards. And so we will be passing hopefully through this council in October, November design standards and guidelines. And just we're really concerned about that just because, you know, we have national and international developers now coming in and throwing up a lot of stuff.'",
        "'speaker_1': 'And so just wondering, have you all looked at what the standards will be and have you thought about if you'll be able to comply at all to those standards?'",
        "'speaker_9': 'Yes. We have looked at the proposed standards that are that are on the books. And for the most part, we do believe that we would comply. We're looking forward to seeing how those hashed out. The one stipulation.'",
        "'speaker_1': 'I think, that's in the proposed.'",
        "'speaker_9': 'Design standards is the ground floor having a ceiling height of, I believe it's 18 to 25 feet, which is a little bit awkward for residential ground floor units, unless there's a mezzanine allowed. But still, it's still within our.'",
        "'speaker_10': 'Intention to comply.'",
        "'speaker_9': 'With the adopted plans, assuming that there's also no conflict between the design standards and the normal.'",
        "'speaker_1': 'Marketplace. Okay. So just just real quick, just the mass reduction, you know, at the top end and also retail on the bottom or activation, I guess. So those those two would comply.'",
        "'speaker_9': 'Correct. And residential really counts as an active street activation.'",
        "'speaker_1': 'All right. Thank you, Councilman Flynn. Oh, sorry I missed you because you can go. Okay.'",
        "'speaker_8': 'Thanks, Mr. President. Just briefly, Scott, could you discuss the transit accessibility here? Because I'm fairly familiar with the routes there, and that's kind of sitting in an island where you can't really get to Broadway because it's down in the in the cut and union stations a mile away, the commuter rail platform.'",
        "'speaker_9': 'Right. So there's there's no transit directly within the general market area. Right. But as you mentioned, there is transit on Brighton, Broadway, and there's a stop right up here at 28th. So that's a pretty short walk up to there.'",
        "'speaker_9': 'And then there's also a stop up at Warren Park that serves a lot of.'",
        "'speaker_8': 'That's yeah, that's a very robust one on Park Avenue. Right. The one on Broadway serves one rally.'",
        "'speaker_9': 'Around.'",
        "'speaker_8': '48 that has 30 minute headways during the peak and one hour in the off peak.'",
        "'speaker_9': 'Right. So just one in one route on Broadway there, but quite a few there on park.'",
        "'speaker_8': 'Okay. So the transit accessibility is the I believe it's a little over a half a mile walk to Park Avenue.'",
        "'speaker_9': 'I think it's less than half a mile to park. Okay. I mean, it's just. Sorry. That's just up right here. Right up the ramp.'",
        "'speaker_8': 'Just. Just a little cheat here. I did the Google walking distance while we were talking. So it's about a half a mile.'",
        "'speaker_9': 'Okay. I'll take your word for it.'",
        "'speaker_4': 'That's all.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Councilman Espinosa. All right. I think I got it now. So the 10% that Austin requires, is it do they provide assistance when you do that, or is it strictly on your guys's nickel?'",
        "'speaker_9': 'Our responsibility.'",
        "'speaker_1': 'Okay. Do they offer any reduction in that percentage if you increase the number of bedrooms per unit?'",
        "'speaker_9': 'They're learning a lot of lessons right now. Our project in the East Charleston Core Zone was one of the very first projects to have this inclusive, affordable housing. Our second project, called Burnham Marketplace, is the fifth or sixth.'",
        "'speaker_9': 'They're learning as they go. Initially, they did not have you allocate between ones to threes. So it left the developers the option to put all the affordable units in their smallest units, which obviously is not not right and not what the community needs for affordable housing.'",
        "'speaker_9': 'But so they solved that problem. But it is entirely up to the developer to provide the affordable housing and in proportion to their unit mix. Or if their unit mixes 70% ones, 30% to use, their affordable units have to be 70% ones, 30% twos as well.'",
        "'speaker_1': 'So I appreciate your candor. I appreciate my colleagues entertaining this because I am I am actively trying to sort of structure something to address gentrification, particularly in northwest Denver that is, I think tends to be very pro developer.'",
        "'speaker_1': 'But I want to make sure that we're thinking about it in ways that get outcomes that we're trying to get, which is people actually using marketing of the units. Do you have to self market or is there a centralized service that with Austin housing of some sort?'",
        "'speaker_1': 'You know.'",
        "'speaker_10': 'In in the projects in.'",
        "'speaker_9': 'Austin we've teamed up with a local housing authority that's helped with that that the residents and make sure that they're qualified to meet those and as units were tied down for 40 years. One one thing I want to address also what's up for consideration in Austin right now with their new.'",
        "'speaker_10': 'Zoning.'",
        "'speaker_9': 'Is the planning commission has been considering in lieu of a certain number of units the 10% number that you could do, a 10% of the gross square footage as an option to to be able to play with larger unit sizes, for example, if that's what's deemed necessary.'",
        "'speaker_1': 'So if you could please contact my office after this, I'd like to throw our concept out for you guys to review, because the idea is, is that we'd have our market developers doing affordable housing. If it makes if it can make sense to particular to this, then it looks like through the documentation that the application was sort'",
        "'speaker_1': 'of ruminating and being applied to somewhere in February of this year, there are 9 to 6 to nine nanos, depending on sort of the veracity of the R.A. that we're talking about. When did you guys do the outreach to the R.A.?'",
        "'speaker_9': 'We met with Councilman Brooks six months ago, seven months ago, and started the process of reaching out to all our no's shortly thereafter. So I would say the first quarter of this year, I think there were nine or nos.'",
        "'speaker_9': 'We reached out to all of them, had conversations. A couple of some were less responsive, as you might expect. But we did have several conversations with around our district as an example, and so we've reached out to all those groups.'",
        "'speaker_1': 'So was it before or after the application was filed?'",
        "'speaker_9': 'It would have been. I think it was right after the application was filed, we started reaching out to them after the application was filed.'"
    ],
    "A bill for an ordinance changing the zoning classification for 3204 & 3206 Denargo St. in Five Points. Rezones property at 3204 & 3206 Denargo Street from R-MU-30 with Waivers and Conditions and I-B UO-2 to C-MX-8, (residential, mixed-use and industrial to commercial, mixed-use) in Council District 9. The Committee approved filing this bill at its meeting on 6-6-17.": [
        "'speaker_1': 'Okay. This is how sorry. I'm looking at my own notes. Yes, I know. That was. That's great. Well, and how how would you characterize the nature of that input? Obviously, no one's here in opposition. So I would.'",
        "'speaker_9': 'Say that from the feedback, I figured it was good, was helpful. One of the things we'd like to incorporate in our project, again, we did this in Austin in a similar neighborhood. You know, the East Austin area of Austin's very similar in a lot of ways to Reno, a lot of art artists and coffee shops and bars'",
        "'speaker_9': ', a lot of great retail. It's gentrifying quickly. And one of the things they ask us to incorporate in our project here that we've successfully done in Austin is live work units a place for the artists to have a gallery but a way to live space, a functional living space in the back.'",
        "'speaker_9': 'So a storefront along the street with their with their art on display and then a bedroom, kitchen and closet bathroom in the back. So we're incorporating a 4000 square feet and possibly more. It depends on the frontage, but we're gonna incorporate hopefully around 7 to 10 of those live work units on the street frontage.'",
        "'speaker_1': 'And is that codified in some sort of way or or just.'",
        "'speaker_9': 'It's not yet. It would be, I guess, codified in the side of the same process or perhaps I guess a concept review approval. We could do that.'",
        "'speaker_1': 'Okay. But you didn't enter into any agreement with any of the surrounding arnault's or birds or something like that?'",
        "'speaker_9': 'We weren't asked to, but again, it's on the site plan they've seen. We intend to provide it.'",
        "'speaker_1': 'Are do you guys lease these projects when you in after you've built them or.'",
        "'speaker_9': 'Yes. They're all be rentals, including the live work units. Okay. Um.'",
        "'speaker_1': 'The reason why I ask is we know that a live work scenario is something we, we got in a development to element 47, in particular in Jefferson Park. But they were they're just they're live units. You know, they have a commercial storefront on the ground floor.'",
        "'speaker_1': 'Or is there some way that you guys compel this to actually be a storefront or operate as a business through the lease agreement of some sort?'",
        "'speaker_9': 'The leases are structured like a traditional apartment lease. That's one of things that's attractive about it because a lot of the we found in Austin, a lot of the artists or could be a a spray tan studio or a hair salon, they wouldn't qualify for traditional retail space because of the requirements from the lender for the loan'",
        "'speaker_9': 'for the TY work. So they're structured like traditional 12 month apartment leases, and that's what we intend to do here.'",
        "'speaker_1': 'Mm hmm. Yeah. So, all right, no further questions. All right. Thank you. Public hearing for council 615 is not close comes members of council. I'll start out being that this is in District nine. You know, the proposers, I think, had a chance to sit down with me some several months ago.'",
        "'speaker_1': 'I asked them to to reach out to Arnaud's and find out some of the issues and they did immediately. Not a lot of pushback from Arnaud's. You know, I wish that it was going simultaneous with our new 30th in Blake, but it doesn't matter because this is barely outside of.'",
        "'speaker_1': 'But I really do hope that you all will work with what the community has come up with, which I think is an incredible affordable housing plan and also a design standards and guidelines you guys are making a decision to pay into a fund, and that's up to you.'",
        "'speaker_1': 'I'm glad we passed that in September, but I really would hope that you would think about the life of this building. Hope you think about the life of this area and how to give back to it. So we will have those done in October and you'll have plenty of time to look over it.'",
        "'speaker_1': 'I hope that you can comply. Thank you. Seeing no other comments. Madam Secretary.'",
        "'speaker_3': 'Raquel Black. Hi, Clerk.'",
        "'speaker_10': 'Hi.'",
        "'speaker_3': 'Espinosa. Hi, Flynn.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Gilmore. I Cashman can Kenny Lopez.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Knew. So I'm just looking. Mr. President.'",
        "'speaker_1': 'I was wondering these results.'",
        "'speaker_3': 'Ten eyes.'",
        "'speaker_1': 'Ten eyes. Council Bill 615 has passed. Congratulations. Councilman Lopez, will you please put Council Bill 616 on the floor?'",
        "'speaker_6': 'Mr. President, move that council. 616 me please to one final, final consideration do pass.'",
        "'speaker_1': 'It has been moved in second at public hearing for council bill 616 is now open. May we have the staff report? Scott, you're back.'",
        "'speaker_9': 'Yes. Thank you again, Mr. President. And Council. Scott Robinson with community planning involvement. Again, as I mentioned earlier, this application is immediately adjacent to the previous one, but it is a separate application. So this one is 3204 and 3206 Tanaka Street.'",
        "'speaker_9': 'The request is to go from review 30 with waivers and conditions to and if you go to to see Annex eight again in District nine, in the Five Points neighborhood in the Largo market area. And this one is part of the Largo market general development plan.'",
        "'speaker_9': 'The property is about two and a half acres currently vacant and again requesting rezoning to redevelop the site. Currently, the majority of the site is Army 30 with waivers and conditions. So again, that's old code. Former Chapter 59 residential mixed use with just a very small portion at the east end of the site, I.B. Hirota, which is'",
        "'speaker_9': 'an industrial zone district. The request is to go to see an x eight. So urban center neighborhood context mixed use with an eight storey maximum height. As I mentioned, part of the Eden Argo Market General Development Plan from 27, which calls for between 2020 500 residential units, 125,000 200,000 square feet of commercial space, residential retail office uses'",
        "'speaker_9': 'and a 75 foot maximum height. And there are urban design standards and guidelines that apply to this property. As I mentioned, the site is in the city with waivers and conditions and a small portion year or two surrounded by the same zone districts.'",
        "'speaker_9': 'The waves and conditions. Same ones we talked about with the 75 foot maximum height, 12%, minimum open space within the GDP area and that same affordable housing requirement. That the plan was in place before the first development occurred in the GDP area.'",
        "'speaker_9': 'Property, as I mentioned, is vacant with the industrial use just to the east, the railroad tracks to the south, new residential to the north, and other industrial uses to the west. There you can see the surrounding buildings. This application went to the planning board on May 17th, where it was recommended for approval by nine.'",
        "'speaker_9': 'A vote went to the Land Transportation and Infrastructure Committee on June 6th. I received no public comment at the planning board meeting or since. And again, there are five criteria that must be met for the rezoning to be approved.'",
        "'speaker_9': 'The first is consistency with the adopted plans. Three plans here, the first being conference of Plan 2000 as described in the staff report. Staff has found that the proposed rezoning complies with these four strategies, mostly dealing with mixed use redevelopment.'",
        "'speaker_9': 'Blueprint Denver from 2000 to designates a future concept land use in this area mixed use calling for employment and residential uses at higher intensity than other areas. Also an area of change. This one is again fronted by waterway, which as we discussed, was not in place in 2002, but we infer that it would be in a designated'",
        "'speaker_9': 'local, and then it also has frontage along DeNardo Street, where it turns into the Lake Del Gainey Street, which is a residential collector. The Reverend Ross plan from 2003 designates this area residential mixed use and also includes specific recommendations for the general market area, including creating a compact, mixed use, pedestrian friendly development and recommends residential mixed use'",
        "'speaker_9': 'or commercial commercial mixed use zoning. And again, no specific height recommendations in the River North plan. So that staff finds that the proposed rezoning is consistent with the adopted plans and the first criterion is met. The second criterion is uniformity of district regulations.'",
        "'speaker_9': 'Staff finds that the proposed rezoning would result in the uniform application of the Sea and eight zone district. The third criterion is to further the public health, safety and welfare state finds that the proposed rezoning would do so by implementing the city's adopted plans and facilitating the redevelopment of a vacant parcel.'",
        "'speaker_9': 'The fourth criterion is justifying circumstances. Staff finds that there changed in changing conditions in the generic market area in the larger Breton Boulevard corridor to justify the rezoning. And the fifth criterion is consistency with neighborhood context, zoning, district purpose and intent and staff finds that the proposed rezoning would result in development consistent with the purposes, purpose and'",
        "'speaker_9': 'intent of the Urban Center, Neighborhood Context and the Max eight zone district as described in the zoning code, so that staff finds that all five criteria are met. And I'll be happy to answer any questions.'",
        "'speaker_1': 'All right. Thank you. We have. Three speakers again. You know, we just got through this. Okay. James with Dudley Simmons, Chase Hill, James West. You have 3 minutes.'",
        "'speaker_9': 'I'm James West of the applicant.'",
        "'speaker_1': 'My address is 2420 17th Street. Number 3600.'",
        "'speaker_9': 'In.'",
        "'speaker_1': 'Thank you. Dudley Simmons.'",
        "'speaker_10': 'Dudley Simmons, 2420 17th Street.'",
        "'speaker_8': 'Here to answer questions.'",
        "'speaker_1': 'Thank you. And Chase Hill.'",
        "'speaker_9': 'JAY So again, same address as in January 24, 2017, three, three, zero and six.'",
        "'speaker_1': 'Just for the record. Thank you. All right. Questions by members of council. Question. Councilman Espinosa. So different question. It looks like the app came in at the exact same time. When did you start the present process? Because this probably wasn't really straight forward or was it?'",
        "'speaker_9': 'Started the prep process late last year, I believe in.'",
        "'speaker_1': 'December of 2016. Oh, so it only took two, two and a half months of wrangling with the zoning. Okay, that was it. Thank you. Thank you. Councilman Espinoza, Councilman Flynn.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4000-4090 North Jason Street & 4001 Inca Street in Sunnyside. Rezones property at 4000-4090 North Jason Street and 4001 Inca Street from I-A UO-2 to C-RX-8, (industrial to residential, mixed-use) in Council District 1. The Committee approved filing this bill at its meeting on 6-6-17.": [
        "'speaker_8': 'Thanks, Mr. President. Maybe Scott could address this. We Want Away is not a public street. It's a private street.'",
        "'speaker_9': 'Correct.'",
        "'speaker_8': 'And so the the metro district will take care of the maintenance on that repaving, etc.. So it's not a responsibility of the city.'",
        "'speaker_9': 'Correct? The street is already built and it is maintained by the metro district there.'",
        "'speaker_8': 'Okay. And the applicant, what is your relationship to the Donato Metro District?'",
        "'speaker_9': 'I'm actually the architect and the planner for this project.'",
        "'speaker_8': 'Okay. What was your. Are you. Are you in any way affiliated with the Metro District or you just own property or the master.'",
        "'speaker_10': 'Developer originally ran the infrastructure and.'",
        "'speaker_8': 'Helped to form the metro. Okay. So we we still retain one parcel. Yes, very like that. Okay. Thank you. That's all.'",
        "'speaker_1': 'Right. Thank you. All right. This concludes a public hearing for 633 Thomas by members of council. As a representative, I'll go first again. Kind of the same comments we've met, reached out. This meets all of our criteria. I hope that again for this rezoning that the same criteria for design standards and guidelines will be met.'",
        "'speaker_1': 'And I'm grateful that we're capturing a linkage fee into our city wide linkage fee. I would love for it. Affordable units to be right there by that station, that billion dollar station. But I do recognize that every every project has to make their own decision.'",
        "'speaker_1': 'And so I'm glad we're capturing something. Councilwoman Canete.'",
        "'speaker_7': 'Thank you, Mr. President. I just couldn't resist the second bite at the apple on this same conversation, which is just that I, I, I don't know of a single project that has had an absorption problem at 60 to 80% of Am I in Denver right now?'",
        "'speaker_7': 'I know that Austin also has some rent challenges, but I don't know that they have been as acute at the percentage levels that we have. And, you know, all of the over construction of the luxury market has not trickled down.'",
        "'speaker_7': 'And so, you know, I'm thinking about three or four projects in Councilman Brooks's district that closed their waiting lists with 400 names on them for 80% of my units. So I just I would encourage you to spend some time talking to the Office of Economic Development and talking to those folks who are building that product.'",
        "'speaker_7': 'I think you will find that there is not been an absorption problem with the price point that you're describing. And I think there is an opportunity to do what Councilman Brooks has described within your project, and I hope you'll take a look at it, because I will say this, the Tiago Market affordable housing plan, and this is'",
        "'speaker_7': 'no fault of anyone sitting up here. It was it was before most of our time, but is the weakest in the city. If you look at the Central Valley, if you look at Green Valley Ranch, if you look at Stapleton, no other major redevelopment area in the city had such a little requirement.'",
        "'speaker_7': 'I'm not quite sure how that happened happened during a time when I was transitioning between kind of work. But but I do think it's a missing piece of that neighborhood. It's not just a missing piece in the city.'",
        "'speaker_7': 'That neighborhood itself has not really lived up to the mixed income potential that we expect of other areas. And so I hope you'll you'll spend some time just doing the research on it rather than dismissing it on comparison.'",
        "'speaker_7': 'That said, I understand the vote tonight is on the criteria, and I understand that the criteria are met, so I'll be supporting it. Thank you.'",
        "'speaker_1': 'Great seeing no other comments. Great comments. By the way, Council can each see other comments. Madam Secretary.'",
        "'speaker_3': 'Raquel Black. Hi, Clark. Hi, Espinosa. Hi, Flynn.'",
        "'speaker_8': 'Hi.'",
        "'speaker_3': 'Gilmore, I. Cashman. Kenny Lopez. I knew Ortega. Sorry, Mr. President.'",
        "'speaker_1': 'I please. Very nice. Results.'",
        "'speaker_3': 'Ten eyes.'",
        "'speaker_1': 'Ten eyes, 615 passes. Thank you very much. Congratulations, Councilman Lopez. As I said, 615 tonight. Madam Secretary.'",
        "'speaker_3': 'Oh.'",
        "'speaker_1': 'You're supposed to catch me on that. It's 616 has passed. Just for the record. Congratulations, Councilman Lopez, will you please put Council Bill 633 on the floor?'",
        "'speaker_6': 'Now, Mr. President, I move that council bill 633 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It had been moved in. Second, did the public hearing for council bill 633 is now open.'",
        "'speaker_0': 'Jeff Hurt. Welcome back.'",
        "'speaker_10': 'Thank you, Mr. President. So Jeff heard was CPD. So this is a request for a rezoning for properties at 60/40, an inker to go from IAU oh 2 to 0 eight. It's in Council District one. Look at it in the Sunnyside neighborhood.'",
        "'speaker_10': 'So this these properties encompass most of one city block. It's sort of bisected by an alley. And you have one portion of the site sort of carved out for the the commuter rail pedestrian bridge platform in the northeast corner.'",
        "'speaker_10': 'All told, the properties are about two acres. So the subject site is zoned I.A., which is a light industrial zone district. And you oh two, which is a billboard use overlay district. And they are not requesting to retain the billboard use overlay.'",
        "'speaker_10': 'The surrounding zoning is to the West IMX three six industrial mixed use and to the north is the same zoning as the subject site light industrial you go to. And then to the south southwest you start to get some more into the residential with the you t you see.'",
        "'speaker_10': 'So the existing uses on the subject property, most of it is currently vacant. There is some industrial and office uses. And you look at the surrounding properties to the north, you have more industrial and then to the west and you transition more into the residential.'",
        "'speaker_10': 'And then soon to the east you have the railroad tracks for the commuter rail and freight rail as well. So looking at some images of the subject property, so this is standing on the commuter rail platform looking south, that sort of the the eastern half of the site that's across the alley.'",
        "'speaker_10': 'So you can see the proximity to downtown. This is a subject property looking north from 40th Avenue. So you see the alley that bisects the properties and then the image on the bottom of the screen is looking northeast, standing at 40th and Jason Street.'",
        "'speaker_10': 'And then since this is a large site, a couple more pictures. So this is a subject property from Jason Street looking northeast. You see some of the existing office uses. There's a residential structure that was converted to an office use some time ago.'",
        "'speaker_10': 'And so this is looking south at adjacent properties. So looking south from 40th Avenue, you see to the right on this top image is, I believe, a four unit residential complex and to the left, a warehouse that I believe is not there anymore.'",
        "'speaker_10': 'And then the Bonhomme image looking south. I'm sorry that I don't know that. That's right. So that's 40th Avenue looking east in the subject. Property is on the right, so you can see the more industrial uses to the north.'",
        "'speaker_10': 'From Jason Street looking west. So you see some residential. The top image is sort of the southern half of the that block of Jason Street. You see some warehouses and industrial type uses and then the bottom image is more than north half of that block.'",
        "'speaker_10': 'So immediately across Jason Street where you see the residential, so the requests to go to CRC, which is commercial, it's a residential mixed use district that allows for up to eight stories. The process for the rezoning followed our standard rezoning process that led us here tonight.'",
        "'speaker_10': 'We did receive there were no comments received in error in time to make it into the packet, but we did receive a letter of support from the Sunnyside United Neighbors. I'm not sure they came in to me today.'",
        "'speaker_10': 'I'm not sure if that made it to all the council members. But it was a letter of support for the request to S.R. eight. Public outreach went to all the Arnaud's listed on the screen here. So pretty extensive.'",
        "'speaker_10': 'And so these are the criteria that staff uses to evaluate each of the rezoning requests, and I'll just hone in on a couple of them. Certainly more detail in your staff report. So as far as city wide plans can't plan, Steph does fine.'",
        "'speaker_10': 'The requests are consistent with the comp plan and a number of strategies are listed here, most of which relate to the idea of promoting infill development and in areas that are well-served by services and infrastructure which this property is, particularly with the new commuter rail station immediately adjacent to it.'",
        "'speaker_10': 'In addition to utilizing underutilized or vacant land on which this property, in staff's opinion, is underutilized land, given the proximity to the station blueprint, Denver has all of these surrounding streets as designated locals, but it does show the subject property as within an area of change and an urban residential concept land use.'",
        "'speaker_10': 'So as far as area specific plans, we have both the Sunnyside plan and the 41st and Fox station area plan. The Sunnyside plan is more dates from 1992, so the guidance isn't as specific as the 41st and Fox stationary plan, which was done in 2009.'",
        "'speaker_10': 'That does that plan does call for urban residential 2 to 8 stories on the subject property. So staff does find the request consistent with that designation and to hone in on one other criteria justifying circumstances. This is an area that's seen a significant amount of change recently, not only with sort of public infrastructure, with the commuter rail'",
        "'speaker_10': 'station and pedestrian bridge over the tracks. But you also see an excellent new multimodal connection with the with the off street pedestrian and bike path that follows anchor and actually takes you right into downtown, sort of over and under the highways and 38th Avenue.'",
        "'speaker_10': 'So a lot of new changes to this area, areas for the public infrastructure, a lot of not only rezoning requests but site development plans in this area as well. So a lot of development activity in this area. So CPD does recommend approval of the request based on the criteria, and I'd be glad to answer any questions.'",
        "'speaker_1': 'All right. Thank you, Mr. Hurtt. And then you since parking. Okay. We have three speakers this evening. Please come to the front, Tony. The simian is first. I'm sorry if I missed. I pronounce your name. Ambrose Cruise and Sid Container.'",
        "'speaker_1': 'Please come to the front here. All right, Tony.'",
        "'speaker_10': 'All right. Thank you. My name is Tony de Simon. 430 in the street in Golden. And I'm here tonight. I represent the applicant council and companies, and I'm here to answer any questions.'",
        "'speaker_1': 'Great Ambrose Cruz.'",
        "'speaker_12': 'How's it going? Ambrose Cruz, third generation North Sider. I live very close to the proposed area of this application, the zone request. I'm also here as a represent representative of United Northside neighborhood and we are strongly against the zone changing because of for one of the area that it's in.'",
        "'speaker_12': 'It's very congested already because there's already multiple areas for housing, for a site, for apartments, for shops and things like that that are very nearby and walkable distance. Something like this will just bring congestion to that area even more, even in a place that there is no real emergency exits.'",
        "'speaker_12': 'The highways are very there's one area, one way and one way out, not very many areas to be able to transport things around. So congestion with traffic will be a very big issue over there. That will mean you won't be able to get ambulances and won't be able to get a fire fire department in there and things'",
        "'speaker_12': 'like that. We just won't be able to happen with this type of congestion that it'll bring to go eight storeys up. It'll bring a lot of people here and we don't need that anymore. I mean, like I said, within walking distance, we have everything that is possibly could be bought with this type of zone change.'",
        "'speaker_12': 'Again, it's in walking distance from this area. It would be irresponsible to add this this amount of congestion again to our community. But for us city council, there needs to be a stopping point to this this type of gentrification in communities like that's happening in our communities and we're all being displaced.'",
        "'speaker_12': 'People can't afford with these these buildings are going to be put up. Nobody that lives in that community longer than ten years can afford it. The people that are going to be displaced because of the property taxes will not be able to afford these places that are going to be put up there.'",
        "'speaker_12': 'So it would be totally irresponsible for this council to approve this application just along with any other ones that come up like this, alcohol or anything like that. It's coming to a point where we have too much there.'",
        "'speaker_12': 'You need to realize that you can be the city council that's known for the ones that allow the congestion and things like that to happen to the city. And it'd be overpopulated. Yeah. Maybe some areas are underutilized as they're being.'",
        "'speaker_12': 'That's been stated. But to utilize these places properly, we don't need condos, we don't need yoga studios, we don't need these businesses. We have plenty of them, but we need these community centers that have already been displaced by this.'",
        "'speaker_12': 'We have one community center left for an entire district. I think city council dropped the ball on that one. If nobody here can can see that that's a problem in a community that's that's under the poverty line to some people that live there, a high number of people that still live there under the poverty line.'",
        "'speaker_12': 'And we have one community center that's irresponsible. I got to say.'",
        "'speaker_1': 'Thanks for screws. Sit on a.'",
        "'speaker_11': 'Hello. Good evening. My name is Quintana. I'm a member chairperson of R.A.. I am the original North Denver individual. I was born and raised there and now living quick. Newton projects three blocks from where you're talking about. All of what Mr. Cruz said is absolutely the truth.'",
        "'speaker_11': 'Come and spend the day at my house. Because if you park, you better not move because you won't have parking to come home and unload your groceries. I'm 67 years old. They pulled me out of the closet. It's time that you guys realize that.'",
        "'speaker_11': 'North Denver. Needs to be left alone. This zoning six storey building. How are you going to fill a IT truck down there? I know. I played on that street. But I do represent at least 300 residents that are not ignorant.'",
        "'speaker_11': 'They've been ignored by the city in council, city council and city of Denver. We're still there. I'll be representing them and fighting no on this. Because we don't need it. If we needed it, it'd be different. We don't need it.'",
        "'speaker_11': 'Gentrification. Has anybody done any studies on what it does to the people? I don't see anybody raising their hand. You remember that were there? We've been ignored since this gentrification. And this is our last stand. And we're going to stand diligently.'",
        "'speaker_11': 'And I represent a minimum of 300 residents in north Denver. We're not ignorant. We've been ignored. And it's time you stop ignoring us. And we say no to this project. You've tore down our whole community. You've okayed this.'",
        "'speaker_11': 'It's not okay with us. You haven't asked us. We haven't been here. We're not ignorant. I'm here. He used to my face because I'm going to be coming back. We need to place our kids can play. We need a community where we can park at our home.'",
        "'speaker_11': 'It's so congested and so full. I'm going to jail for stopping my car every time somebody asks me to do over the speed limit in a residential area. If you're that late, get up earlier. It's that simple. We're so congested, we can't do anything.'",
        "'speaker_1': 'Superintendent. Your time is up.'",
        "'speaker_11': 'That's good.'",
        "'speaker_1': 'Thank you. Thank you.'",
        "'speaker_11': 'Nice to meet you all. I'll see you again.'",
        "'speaker_1': 'Thank you. Hey, Jeff. This is now. Question. Question portion. Jeff, can you tell me what what neighborhood plan did? Did you all use doing your analysis?'",
        "'speaker_10': 'There's the 41st and Fox station area plan and the Sunnyside Neighborhood Plan, but the 41st and Fox stationary plan is the most recent of the most clear guidance. Okay. That's from 2009, I believe.'",
        "'speaker_1': 'Okay. 2009. And do you was there a community outreach process that allowed stakeholders in Sunnyside, in the neighborhood to be a part of the rezoning efforts?'",
        "'speaker_10': 'Yeah, you know, it was before my time, certainly. But, you know, it's well documented in the plan itself and in the supplemental documents, the engagement that did happen. So there were numerous community meetings and a lot of it centered around land uses and building heights and things like that.'",
        "'speaker_10': 'Yeah.'",
        "'speaker_1': 'Okay. Councilman Espinosa. Yeah. The. So I brought this up in, in a in ludi on a, on a rezoning in the same area about the concept plan that is in the. You know, it's a it's exactly, I think two pages away from that site plan.'",
        "'speaker_1': 'Yes. Two pages prior. So what I'd like to do is I've seen what's been shared with the community and isn't part of this rezoning. But I think I would like my colleagues to the degree that it is an actual it's here to be discussed and it's actually in the in the the owner or whoever is capable or'",
        "'speaker_1': 'yourself as comfortable talking about. But the city has invested in part on this property. Is there any agreement related to that that we, the community, can sort of be assured that certain things are going to be delivered by this development that would come with this rezoning?'",
        "'speaker_10': 'I'm not aware of any. We wouldn't typically include that as part of the rezoning process. But I don't know if you. You know, as part of this project, we've been at it for about 16 months and we originally agreed to do the project.'",
        "'speaker_10': 'We committed to to to bring in 21% of our of our units, both for sale and for rent to the community as affordable. We call them workforce. That's that's in the end, that's going to equate to about 87 workforce or affordable units that we'll be bringing to this community.'",
        "'speaker_10': 'And so I know this was discussed with the previous applicant of of do you do you build those units out or do you pay a fee from a developer? It's much easier and much less risky just to pay the fee.'",
        "'speaker_10': 'And that's not something that that we want to do. This is a property that we want to own long term. And that's why we're looking at 40 year financing on it. And we want to control the experience. And so with that, during those 16 months, we reached out to the community.'",
        "'speaker_10': 'We not only had one, but we had four meetings in the community in a public setting with the Sunnyside neighborhood. And as Jeff mentioned, we had a a glaring report of of support that came through. And I apologize that you guys have not seen that.'",
        "'speaker_10': 'But in those public meetings, I know Councilman Espinosa has been there and we've gotten a lot of support. So I'm a little disappointed to hear that, that there's some opposition. And, you know, we didn't know about those those issues.'",
        "'speaker_10': 'But this is the right place for density. And we're trying to create a walkability in this community and help get some of the cars off the road by doing that and allowing access to that light rail station. So with that, there's also a need during those meetings for neighborhood retail space.'",
        "'speaker_10': 'And if you look at a lot of the the housing in the neighborhoods is not as walkable as you would think. And we've heard a lot of different concerns over over retail that the neighbors would like us to bring there, and we're actively seeking that.'",
        "'speaker_10': 'So I you know, I can't commit tonight that we're going to do that, but we're going to try the best we can to do that. So as far as what's what's coming, it's 21% affordable workforce.'",
        "'speaker_1': 'Okay, good. Councilman Espinosa, I'm sorry I missed the. What was the number of affordable? 81, I believe.'",
        "'speaker_10': 'I, I don't want to get pinned down on a number because we're still working through the planning. It's 21% right now, but that works out to 20.'",
        "'speaker_1': 'To 20% affordable units with.'",
        "'speaker_10': '21%, sorry, 87 total.'",
        "'speaker_1': 'At what level am I?'",
        "'speaker_10': 'So it's a combination between 80, 80% and 95%.'",
        "'speaker_1': 'Okay. All right. Go ahead, Councilman. So. Was it always that because so you know, I be I became first cognizant of the potential development proposal back in June of 2017, 2016.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_1': 'I thought at that time there was some greater, deeper levels of affordability or my mistaken.'",
        "'speaker_10': 'I don't I don't believe that to be the case.'",
        "'speaker_1': 'Okay. So but it is both for sale and rental affordable.'",
        "'speaker_10': 'Right. And I think that's a unique thing about this property. And we control both sides of that and so on. The on the condominium side, those are going to be for sale, affordable. Again, 21% of those will be workforce or affordable.'",
        "'speaker_1': 'Okay. One of the things that is, is the city money still involved and will continue to be involved in this development or not?'",
        "'speaker_10': 'Currently, there is a loan in place with the Office of Economic Development.'",
        "'speaker_1': 'Yeah. In in that to some degree allows you the latitude to sort of enter into the sort of a of some affordability that you might not otherwise choose to do.'",
        "'speaker_10': 'Right. That's correct. And I think the other key point here is the ability to go eat stories also helps because at the end of the day, as I mentioned, you either pay a fee or you subsidize internally. And that's what we're able to do here, is subsidize those affordable workforce units by increasing the density on the project'",
        "'speaker_10': ', and that allows us to deliver those so much higher.'",
        "'speaker_1': 'In the early discussions when we were talking, you know, the potential for a project and the potential for a rezoning, I made it very clear that my concerns were essentially eyes on the pedestrian bridge. So to sort of ensure safety for anybody crossing over the bridge that, you know, there was some comfort level that people were and'",
        "'speaker_1': 'there was activity around that and people were watching. And there was early consideration in in sort of schematic design, further consideration and development of that design. Even though we're not talking about projects here, I think it's important because a lot of times you hear council people lament.'",
        "'speaker_1': 'The fact that we're not talking about project is that I'm a little worried that, you know, the ground floor retail component that seemed to be part of integral into any scheme might be on the block is the activation around the stair tower and the elevator in the bridge also is subject to going away.'",
        "'speaker_10': 'No, that's that's still currently part of our plan. That whole street frontages is frontage by retail space as well as trying to create that pedestrian plaza. Right. Right. Where that stair platform, you know, comes down to the street.'",
        "'speaker_10': 'You know, we've taken a lot of other comments that have come through both both meeting with you and the neighborhood. And instead of kind of creating a community that faces inward, we've created one that faces outward. And so we've activated the alley, allowing pedestrians to come through through the community, as well as create outdoor space that faces'",
        "'speaker_10': 'outward and gets eyes on the street and kind of handle some of those concerns.'",
        "'speaker_1': 'Yeah. So, so again, we're not looking at projects. I wish we were, but to the degree I mean, it's a shame that you don't have the the level of development and how far you've progressed because, you know, that is what has been shared with the community and got you the support that you earn.'",
        "'speaker_1': 'And, you know, I'll reach out to Ambrose and said, I actually go ahead and actually I'd like to maybe ask you both, have you seen the development proposal that was shared with the community? I've seen the development proposal that was shared the community with the mixed use Mr. Quinn container come to the so that you could be'",
        "'speaker_1': 'on record. Mr. Cruz. Okay. No, it's not. Here it is for you. Go ahead. Yeah, it was at the public meetings. Where were you able to see it? What was being proposed?'",
        "'speaker_11': 'Yes.'",
        "'speaker_1': 'Okay. And you're still opposed?'",
        "'speaker_11': 'No. Yeah, I'm not. I'm opposed.'",
        "'speaker_1': 'Okay.'",
        "'speaker_11': 'Absolutely. We don't we don't need it. It's we talk about density. How? Against when I don't want to be rubbing elbows with you. Yeah. I don't want to be sharing my parking space with you. You're not paying my rent and I'm not paying your mortgage.'",
        "'speaker_11': 'And that makes a difference to the people that still live there, the people that have been ignored. And there's a large group of them. And they haven't been ignored. And they don't not come here because they don't care.'",
        "'speaker_11': 'In Arkansas, they have to work and feed their kids. They have to worry about the traffic that congested streets that their kids don't get here. Yeah, that's what we have to do. We don't have time to be coming.'",
        "'speaker_11': 'The city council. They picked the old guy. So you got to go. And this is where our vote is and their vote is now. Okay. So you've abuse our our communities been abused. With this gentrification, we still have people older than me that were born and raised in North Denver.'",
        "'speaker_11': 'And I happen to know. And they they don't. They have nowhere to go. I'm not going to plead with you's. But there's enough families there to make a difference and their vote is no. Period. We've been abused enough.'",
        "'speaker_11': 'Give us a break. Give us a moratorium on this rezoning and this gentrification. Let us breathe. Let us enjoy. Let us enjoy a year of our life to make these important decisions. But they have to have me come up here.'",
        "'speaker_11': 'So that they can get their kids in bed, so they can finish their work from their job. That's 300 people. That's 300 families. That's why I'm here.'",
        "'speaker_1': 'Thank you. Said. Thank you.'",
        "'speaker_9': 'You're welcome.'",
        "'speaker_1': 'Jeff, I have a question. The the.'",
        "'speaker_12': 'The. I just want to let you know, every resident I talk to in the area, there had no idea of this proposal.'",
        "'speaker_11': 'None.'",
        "'speaker_12': 'No. And I've talked to almost every resident that lives within, like, a three block radius of that area. I went personally and knocked on all their doors and showed them what was happening. And none of them knew. No.'",
        "'speaker_12': 'Two of them, like 30 people or 30 doors are knocked on, knew what was happening there on Jason and in the street, two out of the three doors nearly got knocked on. So no, nobody knows about what's going on because they're too busy trying to live.'",
        "'speaker_12': 'The outreach that he's done, I never got a call about the zone changing. I'm the chair of R.A.. I never got a call. So there's your answer. No, people don't know.'",
        "'speaker_1': 'My struggle there. Cruz, is that your ANA was notified at every point in the process and I wish you had reached out to my office. We would have been happy to advise you.'",
        "'speaker_12': 'Like you said, though, some of us are trying to survive. But I have reached out to your office for a number of things. And when I do reach out to your office, I'd appreciate a response from you directly, because you are who I'm trying to speak to.'",
        "'speaker_12': 'Okay.'",
        "'speaker_1': 'Or Jeff. So my question is. The the stationary a plan which I am going to reach out to both Ambrose and Sid in particular on the stationary plan. What's that? I have to go. Okay, but I want to reach out to you on this stationary plane because there's a lot here you need to know about.'",
        "'speaker_1': 'On the stationary plan sort of conveniently ends before it gets too quick. Newton. Do you know where Craig Newton and the residents of Quick Newton specifically are specifically involved in the stationary planning process?'",
        "'speaker_10': 'I don't know. I could certainly find out, but I don't know.'",
        "'speaker_1': 'Okay. The reason why I ask is to some degree, yeah, there is a there is no onsite parking for all those units. It is all on street parking and it does get congested over there. And as we know and that's what I want to, you know, advise my my constituents on this that plan does call for 2'",
        "'speaker_1': 'to 8. It does have relaxed parking because of its proximity to the station. So the things that they were speaking to specifically are exactly exacerbated by the plan recommendations. And it's concerning to me that there might, in fact, be a disconnect between, you know, existing long time residents and what the stationary plan calls for.'",
        "'speaker_1': 'So. Thanks. Okay. But before we we we get in to two comments, I'm just going to ask you one more question. You know, I think before councilman. Lopez did a couple West Side plans, neighborhood plans before Council Monteiro before me did Global or Swansea.'",
        "'speaker_1': 'There wasn't great attendance in the neighborhood plans meetings, right. And I guess that's where I'm kind of struggling with and CBD is acknowledge that neighborhood plans have been largely Anglo represented and in communities of color they've really struggled in that.'",
        "'speaker_1': 'I think that we're seeing that here today and I wouldn't just ask them had they been a part of the process they say they haven't been reached out to. And so I guess I want to know more about that 2009 plan.'",
        "'speaker_1': 'You weren't here, so it's unfair. There's no one else. So I'm just going to leave it as an open question. But I would love some folks to get back to me around that 41st and Fox. I know my side of the tracks in Globeville there was, but I'm not sure about the sunny side.'",
        "'speaker_1': 'And it's troubling. And as you can see, this is this is what we're seeing in our neighborhoods. That's kind of a question. All right. This closes. Councilman Espinosa, you back up, are you? Yeah, I'd like to say a few comments.'",
        "'speaker_1': 'Okay. Council Bill 633. Public hearing is now closed. Councilman Espinosa. Yeah. To what you're saying. The thing. The reason why I was bringing up the context plan and I did bring it up in the in ludy on it, on a related rezoning or in the same area, is that the context plan shows a stepping down.'",
        "'speaker_1': 'Shows the highest density right at that right along Inca. And then it transitions down. It even shows illustrations and and visuals, photographic visuals of what that transition should be. And even though it's not for consideration, the project, the project that has been shared and, you know, acknowledges that mean it does, in fact, step down.'",
        "'speaker_1': 'It transitions from an eight story approximately down to a five storey as you go at least south on the site. And you know, where if you look at that concept plan, it is very consistent with that transition into the neighborhood.'",
        "'speaker_1': 'And that's important because that is one of the things that I have heard from people that I know were part of the of the station area plan in 2009. That said, because we've done so many rezonings across the tracks in the 12 and 20 story range, I don't have any problem saying that.'",
        "'speaker_1': 'Yeah, I, I believe the plan should actually be revisited because maybe the density wasn't enough to go to, to, for this opportunity. That said, you know, eight storeys is consistent. A storeys was supposed to be along Inka Street and then transitioning down into the neighborhood.'",
        "'speaker_1': 'I wish there were language to to capture the transition, but this is the this is the way we go about things. You know, I wish the developer luck and I will be supporting it because the the activation, you know, the things the core things that they've communicated as desires seemingly can be captured in this rezoning have been'"
    ]
}