{
    "A bill for an ordinance designating 670 Marion Street, the Meyer-Reed-Muraglia House, as a structure for preservation. Approves an individual Denver landmark designation for property located at 670 Marion Street in Council District 10. The Committee approved filing this item at its meeting on 8-28-18.": [
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to the Council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilwoman Ortega, will you please put Council Bill 933 on the floor?'",
        "'speaker_1': 'Mr. President, I move that council bill 933 be ordered published.'",
        "'speaker_0': 'I think this one is placed upon final consideration.'",
        "'speaker_1': 'That's what I meant to say. Placed upon final and do pass.'",
        "'speaker_0': 'All right. Thank you. It has been moved and seconded. The public hearing for Council Bill 933 is open. May we have the staff report?'",
        "'speaker_9': 'Good evening, Councilwoman Clark, members of City Council. My name is Karen. I am with Landmark Preservation in Community Planning and Development and we are here for 670 Marion Street, which is a landmark designation application. As you know, the 1967 ordinance that was established for landmark preservation allows for the designation of properties.'",
        "'speaker_9': 'There are currently 338 historic properties and 53 historic districts. Designations that come through landmark preservation are typically community driven processes. As is the case in this, this is an owner supported designation. The owners, John and Beverly, who are unfortunately unable to attend due to health concerns, submitted this designation application.'",
        "'speaker_9': 'The property is located in the East Country Club neighborhood, but within the East Seventh Avenue Historic District. This is being called out as an individual designation, although it's already a contributing building to the historic district. There are a few cases where a property's history is significant enough that it can be an individual landmark within a historic district'",
        "'speaker_9': '. It is in Council District ten in the Blueprint Denver area of stability with a zoning of USAC. In order for a property to be a Denver landmark, it needs to meet the designation criterion in at least two of the following categories history, architecture and geography.'",
        "'speaker_9': 'It needs to maintain its historic and physical integrity and then consider how the property relates to a historic context or theme for this particular property. The application was found to meet the history criteria under A and C, architecture A and B in geography B two.'",
        "'speaker_9': 'So to start with, it is significant under history for having a direct association with the historical development of the city, state or nation. This particular property was constructed in about 1905, which was right after the recovery of the silver crash from 1893.'",
        "'speaker_9': 'So as you can see on the map on the left, which is the based map, it is the first property that was constructed on the constructed on this block in one of the early ones in the Capitol Hill area.'",
        "'speaker_9': 'By 1929, you can see that there's been a considerable build out in this particular area. This building was one of the first to come through and be constructed in this particular area, and it represents the Denver recovery from the 1893 silver crash.'",
        "'speaker_9': 'It is also significant for having direct and substantial associations with a person or groups of persons who had influence on society. There were a series of property owners or homeowners who were very significant. It started in 1904 with Julius Kinney, who was a prominent Denver physician.'",
        "'speaker_9': 'In 1907, William H. Mayer, who was a stockman and a politician. He also signed the Colorado Constitution. He was a lieutenant governor, and he was a representative of the Colorado Territorial House. He was followed by the owners in 1916 of Albert and Lydia.'",
        "'speaker_9': 'How to read. Albert was a chair of the law department at SIU. He was actually one of the more famous members of the law department at SIU, and there's actually a building that is named after him. He was also very prominent in prohibition.'",
        "'speaker_9': 'His wife, Lydia, was a founder of the School of Missions at Chautauqua in Boulder, and she was very active in women's suffrage, and they were some of the longer term owners. Eventually, in 1947, Walter Emery was the owner and resident of this property.'",
        "'speaker_9': 'He was a CEO of the Bank of Denver, but is actually probably better known in 1967 for starting the Denver Broncos, along with seven others.'",
        "'speaker_10': 'Wow.'",
        "'speaker_9': 'It is also significant under architecture for being the shingle style for embody embodying distinct distinguishing characteristics of an architectural style or type. So this type of style is typically seen a little bit earlier, but this was constructed in 1904.'",
        "'speaker_9': 'The shingle style is very rare in Denver, and the defining characteristics of it are the shingles that are seen on the upper storeys, an asymmetrical facade, the irregular and steeply pitched roof intersecting gables, multilevel eaves and an extensive porch.'",
        "'speaker_9': 'As is true with a lot of Denver architecture, nothing is just a pure style, but is often a melding of multiple styles. So you see the shingle style, but you also see Oma style cut the richest Sony and Romanesque.'",
        "'speaker_9': 'And so influences from that which are really the large arches that are prominent on the porch and on the portico chair. The property is also significant as a work of a recognized master architect. This is a significant design by Merian and Norton.'",
        "'speaker_9': 'They designed a lot of prominent buildings throughout Denver residents commercial buildings, as well as public structures. They designed the governor's residence on the Steele house, the Humphries mansion, the Robinson House, and then Cheesman Memorial Pavilion, all in of a variety of different architectural styles.'",
        "'speaker_9': 'This is one of the only ones that's been known to be designed by them in the shingle style. So it's a significant example of their work because it's one of the rare ones that was designed as a shingle style building.'",
        "'speaker_9': 'And then finally, it is significant for promoting an understanding and appreciation of the urban environment by means of distinctive physical characteristics a rarity. The shingle style is very unusual for Denver. It's distinctive in East Seventh Avenue, and it's very rare.'",
        "'speaker_9': 'There are no others along the block or that are around it. So it is significant for its rarity and also represents a identifiable moment in Denver's historical geography. When the Victorian era meant the modern era as the city expanded.'",
        "'speaker_9': 'And this is a photo of not far from where the Norton House was in about 1905, showing that the trolleys and that's how people were commuting into town. And you are seeing a more modern era of Denver. In order to be a Denver landmark, it also has to maintain its historic and physical integrity, which is sort of'",
        "'speaker_9': 'preservation speak for saying that it needs to kind of look like what it used to look like. There are seven aspects of integrity. Staff, as well as a landmark commission, found that it retained its integrity of location, design, workmanship, materials, setting, feeling and association.'",
        "'speaker_9': 'There have been some changes to the building. There's the rear and side additions. You can see from the 1967 Sanborn map and then the current aerial. There are some additions on the side as well as what's shown in the photograph.'",
        "'speaker_9': 'However, those are not readily visible from the front facade and do not take away from the integrity of the building. And finally, for a property to be a Denver landmark, it should be considered how a structure relates to a historic context or theme in Denver history.'",
        "'speaker_9': 'And this is showing the recovery from the 1893 silver crash in the early 20th century growth of Denver, specifically to the Capitol Hill area. These are three historic photos showing the evolution and the changes of Capitol Hill. The one on the left is near Sherman, taken in about 1900.'",
        "'speaker_9': 'The one in the middle is on eighth and Logan taken about 1915 to 1920, which was just slightly after this building was constructed. And then the next was Seventh Avenue in Columbine, taking in about 1920, showing the evolution of the Capitol Hill area and how this started to spark the growth in this area.'",
        "'speaker_9': 'The Landmark Preservation Commission and Landmark Staff found that this designation application meets the criterion under history, architecture and geography, that it maintains its historic and physical integrity and considered how it related to the historic contexts and themes and recommend approval.'",
        "'speaker_0': 'Thank you very much. We have one individual signed up to speak this evening. So any levinsky, if you want to come up, you have 3 minutes.'",
        "'speaker_9': 'Good evening. Thank you for your time and your LEVINSKY. I'm the executive director of Historic Denver, located at 1420 Ogden. We're a local nonprofit, historic preservation advocacy organization. Tonight, I'm here for two reasons both to offer historic Denver's unqualified support for the designation of 670 Marian, but also to represent the home's owners, John and Beverly Morales, who'",
        "'speaker_9': 'have called this their home for more than 40 years. John and Beverly began the process to designate their home an individual landmark over a year ago, contacting a graduate student to do the extensive research that's required. Late last spring, our office took over the completion of the application at the request of the owners who have a sense'",
        "'speaker_9': 'of urgency. As Beth is battling cancer. This is the reason that they are not here in person tonight. But I spoke to John last week and I know he called Kara today to once again express their desire to have this home achieve the highest status the Denver Landmarks offers.'",
        "'speaker_9': 'They sought this status out of pure pride. They love this home. Take pride in the stories of the prominent families that have lived here and want to ensure it is recognized even among some of its very auspicious neighbors.'",
        "'speaker_9': 'I won't repeat the details of this home significance that Kara so carefully outlined, except to say that it is clearly a home with a tremendous story. And three families in particular stand out the miners, the reeds and then the morale.'",
        "'speaker_9': 'Yes. And I'll note that the descendants of the Reed family, which is the only other family to have a tenure as long as the Marias have had attended the hearing at the Landmark Commission to express their support, including the great grandson of the reed who lived in the house whose name is Reed.'",
        "'speaker_9': 'As Kara mentioned, it's not unusual for a home to have individual landmark status and be located in a district. And I'll give you the example that is most obvious to me, which is historic. Denver's very own Molly Brown House Museum, which is an individual Denver landmark and sits in the Pennsylvania Street Historic District.'",
        "'speaker_9': 'And the Mya Reed Malia house will have other neighbors who also have both statuses. On a personal note, I actually met them earlier, many, many years ago as an elementary school student at Dora Moore, where their sons also attended.'",
        "'speaker_9': 'As you probably know, two or more is an elementary school that is steeped in history. And during our tenure there as kids, it turned 100 years old. And I think that a lot of the families really took great pride in that.'",
        "'speaker_9': 'And the morale youths were very involved in the celebration of that centennial, as well as in organizing the annual House tour of Historic Homes around or Moore. That's a tradition that continues today. And Beverly in particular, really supported that effort in showcasing the neighborhood's history and the history of homes like theirs.'",
        "'speaker_9': 'So I'm happy to answer any questions that you might have. And again, appreciate your support for this designation. Thank you.'",
        "'speaker_0': 'Thank you very much. That concludes our speaker questions from members of Council Councilman Espinosa.'",
        "'speaker_7': 'This should probably go to either of you when we do an a count about the amount of area, land area in Denver that is designated, landmark designated. Do we double count those properties that are both individual landmarks in in a district.'",
        "'speaker_9': 'So the count is typically done. We see there's about 6800 properties. The count is done by our guys office who do it off of parcel data. So there may be there may actually be a few that are counted as the 338 individuals in the total of 6800.'",
        "'speaker_9': 'I would have to double check with our GIS specialist to see if they call out the handful that are within a historic district and our individual landmarks.'",
        "'speaker_7': 'So it's sort of busy work. But if you could get back to me because we're going to be having that discussion about the preservation ordinance and be nice to know if we were actually sort of marginally inflating that number and maybe it's not as high as we would be with one spot.'",
        "'speaker_9': 'I will double check with them.'",
        "'speaker_7': 'All right. And I was I was in your presentation. It didn't strike me until now. But you referenced the Richardson Romanesque style. And I thought, this is a little late for that. But so I Googled that's what I was doing.'",
        "'speaker_7': 'And it sounds to me like we were sort of late to to get it on this side of the Mississippi. So even though it was at the dying end of that period, it was the right time for it to be in the West.'",
        "'speaker_7': 'So I just was a little worried about that then. What is the last question? Oh, city, beautiful. Were the trees that are shown in your images part of the city beautiful movement? And if so, when did those get planted?'",
        "'speaker_9': 'Yes. I believe that trees were planted as part of the city beautiful movement, especially on designated parks and parkways. So we do have early images of Seventh Avenue, East 17th Avenue, with very young sapling trees.'",
        "'speaker_7': 'And but what about what time in Denver's history was that?'",
        "'speaker_9': 'That would have been in the 19 teens and early 1920s.'",
        "'speaker_7': 'Primarily the reason why I'm asking and again, these are the things that came in my head during your presentation is the development pattern. So this house sort of the loan block, I mean, loan structure on this face block and then the history of those images seem to imply that we actually went through and did parkway improvements before'",
        "'speaker_7': 'we actually did infill development because there are some substantially sized trees in some of those pictures where there is still missing. So it is interesting to me that we were proactive with our tree planting historically because we have lost tree canopy in northwest Denver.'",
        "'speaker_7': 'But just nice to see that in whenever we that's part of the Denver history that comes up when we do these landmark designations. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Seeing no other questions. The public hearing for Council Bill 933 is closed. Are there comments by members of Council Councilman? No.'",
        "'speaker_6': 'Yes. Thank you, Mr. President. Oh, wow. What an application. What a home for this tonight. The Marie Moraga house is is such a wonderful example. That to me is almost like the perfect example of why historic preservation is important to our city.'",
        "'speaker_6': 'It's just a wonderful, wonderful example of of Capitol Hill architecture and a home that that should be protected forever. We hope that everybody has a chance to read the well-documented and well written history of this whole. I mean, I enjoyed reading this so much and seeing all the rich and prominent characters and leaders that were actually occupied'",
        "'speaker_6': '. This home care did a great job of listing some of their accomplishments, but it was just amazing, not only for the owners, but the architects, the famous architects and what they what they did with this home. I love riding through Capitol Hill because we get the largest number of historic homes and and districts.'",
        "'speaker_6': 'And I rode by the home today just just to see it one more time. This is because of tonight's application. So it was just wonderful. So I'm just really proud to support this application for a historic designate landmark designation.'",
        "'speaker_6': 'And, and I just want to thank the Maragos for all they've done for preserving this home. And and again, congratulations on this tonight. Thank you.'",
        "'speaker_0': 'Thank you. Councilman knew seeing no other comments I'll just add a thank you for the staff report and the presentation today show and how this met all the criteria. Very excited to vote in support of preserving this. Madam Secretary, Raquel.'",
        "'speaker_4': 'New Heart Ortega I Sussman High Black. Brooks High Espinosa High. Flynn, I Herndon I. Cashman High can eat. Lopez. Hi, Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close voting and announce the results.'",
        "'speaker_4': 'So you. Sorry some ladies.'",
        "'speaker_0': 'Didn't push their.'",
        "'speaker_7': 'Button, but.'",
        "'speaker_1': 'I voted yes.'",
        "'speaker_7': 'Me?'",
        "'speaker_1': 'I voted.'",
        "'speaker_0': 'Yes. Here we go.'",
        "'speaker_4': 'Sorry. One more. I get it. 11 Eyes.'",
        "'speaker_0': '11 Eyes. Council Bill. 933 has. Past. Before we adjourn, because there's nothing else on our schedule, I'm going to take a quick moment of privilege here and just say that this is a big week for the Denver City Council because we have two employees who have been with us a really long time who are retiring on Friday'"
    ]
}