{
    "A resolution approving a proposed Fourth Amendatory Agreement between the City and County of Denver and Hitachi Vantara, LLC to increase compensation, extend the term and amend a provision regarding the Denver Police High Activity Observation (HALO) video and surveillance system. Amends a contract with Hitachi Vantara, LLC by adding $144,200 for a new total of $2,447,569 and one year for a new end date of 12-31-21 for support and maintenance of the Denver Police High Activity Observation (HALO) video and surveillance system (POLIC-202057090). The last regularly scheduled Council meeting within the 30-day review period is on 3-8-21. The Committee approved filing this item at its meeting on 2-3-21.": [
        "'speaker_0': 'Thank you, Councilwoman. The next item up is Council Resolution 21, Dash 008 for Council Member Cashman. Will you please put Council Resolution 20 1-0084 on the floor for adoption?'",
        "'speaker_1': 'Yes, Council President. I move the council resolution 20 1-008 for be opted.'",
        "'speaker_0': 'Against and moved. Thank you, Councilman Herndon, for the second questions or comments by members of council. Council members say to Barker.'",
        "'speaker_2': 'Thank you. I'd like to go on record with a vote for this one. This contract is to pay for the ongoing maintenance and perhaps replacement of Halo cameras throughout our city. We've had several instances of cameras that did not detect crime over and over.'",
        "'speaker_3': 'In.'",
        "'speaker_2': 'Specific locations, and I have consistently requested data showing us the return on investment with our Halo camera systems and have yet to receive that. And so I would like to make sure that there I vote no on this because there is no data proving that we should continue with this mechanism for deterring crime in our neighborhoods.'",
        "'speaker_2': 'And until we have specific data in our high crime areas proving they're effective, I think we should be considering alternative technologies. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman CdeBaca. Not seen in the other hands raised for comment. Madam Secretary, roll call, please.'",
        "'speaker_2': 'CDEBACA No. Black. I. Clark.'",
        "'speaker_4': 'All right.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Can each.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Ortega. First I Sandoval. I. So you're. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_2': 'Ten Eyes. One Day.'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver and Northeast Denver Housing Center, Inc. for administration of the Temporary Rental and Utility Assistance (TRUA) Program. Approves a contract with Northeast Denver Housing Center, Inc. for $1,533,600 and through 12-31-21 for administration of the Temporary Rental and Utility Assistance (TRUA) program (HOST-202157450). The last regularly scheduled Council meeting within the 30-day review period is on 3-8-21. The Committee approved filing this item at its meeting on 2-3-21.": [
        "'speaker_0': 'Ten Eyes. Council Resolution 20 1-0084 has been adopted. The next item up is Council Resolution 20 1-0088. Council Member Cashman. Can you please put Council Resolution 20 1-008 on the floor for adoption?'",
        "'speaker_1': 'Yes. Council President and I moved that resolution 20 10088 be adopted. I get.'",
        "'speaker_0': 'All right. You've got to attend the fair. Friends of family member Ortega. Thank you, Madam President. I asked for this to be called out for a vote because I am on the board of one of the organizations that is not an actual signatory to the contract with the city, but they're a subcontractor.'",
        "'speaker_0': 'And so just to be completely transparent, I want to abstain from the vote on this particular bill tonight. All right. Thank you, Councilwoman Ortega. In other hands raised. Madam Secretary, roll call. Ortega abstained.'",
        "'speaker_2': 'Sandoval. I. Sawyer. I. Black. I see tobacco. I. Clark.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_4': 'I.'",
        "'speaker_0': 'Cashman.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Hi, Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_2': 'One abstention tonight.'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver and Colorado Village Collaborative to fund two Safe Outdoor Space sites with amenities and services that provide outdoor accommodation for up to 100 households. Approves a contract with Colorado Village Collaborative for $899,569 and through 12-31-21 to fund two Safe Outdoor Space (SOS) sites, with amenities and services that provide outdoor accommodation for up to 100 households (HOST-202157407). The last regularly scheduled Council meeting within the 30-day review period is on 3-8-21. The Committee approved filing this item at its meeting on 2-3-21.": [
        "'speaker_0': 'Ten I's Council Resolution 20 1-008 has been adopted. The next item up is Council Resolution 20 1-0090. Council Member Cashman, will you please put Council Resolution 20 1-0090 on the floor for adoption?'",
        "'speaker_1': 'Yes, Council President. I move that council resolution 20 1-0090 be adopted. Second.'",
        "'speaker_0': 'It's been moved and seconded by Councilman Herndon. Second, questions or comments by members of Council. Council Member Sawyer, you're up.'",
        "'speaker_3': 'Thanks, Madam President. I call this out for a vote because I would like to be a no on this. That's something I've struggled with and gone back and forth on for months. And I want to just be really clear.'",
        "'speaker_3': 'Everyone deserves a home, especially one that's safe during COVID. But more than 80% of our voters in May 2019 said they don't want urban camping. And I don't understand why we are spending our time and money defending urban camping ban in courts on the one hand, and then funding urban camping in direct contradiction to the will of'",
        "'speaker_3': 'our voters on the other. To me, that doesn't make any sense. So the lack of a cohesive plan, I think, is a failure of our leadership. I think we're sending mixed messages and breaking the trust of our voters while all the while causing confusion for our most vulnerable citizens.'",
        "'speaker_3': 'Our population of residents experiencing homelessness deserve better. To start with, they deserve heat and a roof and a door. We think we have around 2000 people sleeping on our streets every night. In addition to those who are using our shelters.'",
        "'speaker_3': 'And in addition to those who are couch surfing, this contract is a Band-Aid that covers about 5% of the need at a huge cost and pays a private provider for services that we as a city already provide when it comes to social services.'",
        "'speaker_3': 'That money can be spent on so many other things that could help stop the cycle of homelessness upstream before it starts, like eviction protection or drug rehabilitation or mental health services. Once again, we councilmembers are being put in a no win situation over which we have very little input.'",
        "'speaker_3': 'This contract fronts 100 tents with for almost $900,000, where 60% of the budget is directed at a site that has yet to be determined where residents have not been engaged or even know that this might be coming to their neighborhood.'",
        "'speaker_3': 'And the two pilot SS sites were private sites with private funding. And that makes sense. But this is very different from what we're talking about here. This is taxpayer money. And that requires a process that I don't see has happened in this case in the same way.'",
        "'speaker_3': 'I saw this last week, and I find it ironic that I'm saying it again tonight, a week later. This is not the only solution to this problem. This is the only solution that we're being presented. And once again, councilmembers are left to be the voice of our residents, asking for a rational explanation that isn't coming.'",
        "'speaker_3': 'I don't believe that this is a responsible use of our tax or our city tax dollars. So I'm going to be a no on this one tonight. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Sawyer. Councilwoman Connie.'",
        "'speaker_3': 'Thank you, Madam President. I appreciate that. You know, colleagues can respectfully disagree about different approaches, and I respect anybody's right to vote against, you know, any contractor approach that they are not comfortable with. But I do want to just clarify some of the facts on the record, because I think some of the concerns that have been shared'",
        "'speaker_3': 'might be confusing to members of our community who may be watching this meeting. And I think it's important if we're going to debate these things, that we get all those facts out there. So I would like to ask if Cole Chandler could please be promoted as one of the individuals receiving this contract.'",
        "'speaker_3': 'And then I see Angie Nelson is here. So I'd like to start maybe with a question, a couple of questions for Angie, if I may, Madam President.'",
        "'speaker_0': 'Mm hmm. Go ahead.'",
        "'speaker_3': 'Angie, can you clarify, please, how much private funding was being leveraged along with the city dollars involved in this contract? And you should introduce yourself as well, please. Hi, everyone. My name's Angie Nelson. I'm the acting.'",
        "'speaker_2': 'Deputy director.'",
        "'speaker_3': 'For Homelessness Resolution and Housing Stability within the Department of Housing Stability. And your question about how much private funding is leveraged, I am going to have to get back to you with that. Well, why don't we have Callie answer it, then, perhaps.'",
        "'speaker_3': 'There you go. Thank you. Thank you. And please introduce yourself. Call.'",
        "'speaker_4': 'I am Cole Chandler, executive director of Color Village Collaborative. I live in District nine. So the answer to that question for 2021 is that this contract would provide 86% of the funding that would fund both of these programs through the entirety of 2021.'",
        "'speaker_4': 'Now that being said, we have been operating one of these sites since December 15, 2020, and we did that as well as opened a site at First Baptist Church of Denver, utilizing about $300,000 worth of private funds. And so those are not coming into that figure that I'm sharing with you.'",
        "'speaker_4': 'But 86% of the funds to operate this through the end of the year would be provided by this contract.'",
        "'speaker_3': 'Okay. So $300,000 for a first site and then about 16% of this contract, private funding. Kim Kohl, can you please describe several of the differences between the safe outdoor spaces and encampments that are subject to the urban camping ban that has been raised?'",
        "'speaker_3': 'Can you just describe those differences?'",
        "'speaker_4': 'Absolutely. So I think it's really important that we state that safe outdoor spaces are not what was on the ballot when Initiative 300 came forward. Those are two entirely different things. Initiative 300 would have given people the right to sleep in public space, essentially wherever they choose.'",
        "'speaker_4': 'That is absolutely not what this is. This is a resource rich service rich encampment model that's fully managed by staff 24 hours a day and intends to do three things. First and foremost, to prevent the spread of COVID 19, which we have done to date, 0% of folks that have been tested have tested positive.'",
        "'speaker_4': 'Second, it intends to connect people to long term housing resources and case management. So we have connected five people to the beloved community, tiny home village. To date, we've had two people connect to vouchers. We've had five people entered into the one home system.'",
        "'speaker_4': 'Eight people in our program are currently receiving ongoing case management. So you've seen those kinds of things as well. Third, it intends to reduce the impact on neighborhoods of existing unsanctioned camps. So if you're a council member that is getting calls about unsanctioned camps, if you're getting calls saying, hey, I call 311 all the time and nothing'",
        "'speaker_4': 'ever happens if you're getting those kinds of complaints. This is intended to be a solution to that precise issue. So I want to create that differentiation. This is not the same issue that was voted on in 2019.'",
        "'speaker_3': 'Thanks. And then, Angie, I just want to ask, is there a supportive housing home available for every individual? Well, first of all, let me ask. There was a claim made that there are 2000 people sleeping on the streets right now.'",
        "'speaker_3': 'We have imprecise data to count things, but we had both a point in time study as well as some community studies. So do you do you have an estimate or what? What's your thought? Is that the right ballpark figure to be using today?'",
        "'speaker_3': 'You know, the ballpark figure, just like.'",
        "'speaker_2': 'You said, there are a few different data points.'",
        "'speaker_3': 'One being the point in time, but in the other, there was.'",
        "'speaker_0': 'A community led.'",
        "'speaker_3': 'Point in time count that happened over the summer, which inflated that number tenfold. And so we are still getting our hands around what that ballpark figure looks like right now. And I think we need to to get back to you on what the the best precise estimation is right now through our street outreach teams.'",
        "'speaker_2': 'And some of.'",
        "'speaker_3': 'Their understanding. We probably won't get a great number for this, and it's part of the challenge, and we'll have even less data in the coming year than we have now, unfortunately. But let's just go with 1000 from the point in time or 2000.'",
        "'speaker_3': 'Do we have a supportive housing unit available in Denver for each of those individuals today?'",
        "'speaker_2': 'No, we don't.'",
        "'speaker_3': 'We are absolutely working to build that pipeline. And in interventions like safe outdoor space, help give people a platform of stability.'",
        "'speaker_0': 'That.'",
        "'speaker_3': 'Meets them where they're at so that they can work towards those longer.'",
        "'speaker_2': 'Term.'",
        "'speaker_3': 'Solutions that Coleman spoke to. But, you know, unfortunately, the availability.'",
        "'speaker_0': 'Of a.'",
        "'speaker_3': 'Permanent housing is the thing that we're we're driving towards but don't have enough of for everyone in need today. And then call can I just ask for the folks who are staying in the safe outdoor spaces now? Do you have data or anecdotal information about where they were sleeping before and whether or not they were?'",
        "'speaker_3': 'You know, I would I, too, would like everyone to sleep in a heated building with a bed and a door. But I'm not sure that's where the people you're serving were sleeping prior to this.'",
        "'speaker_4': 'Thanks, Councilwoman. 100% of the people that were serving were sleeping outdoors in tents or worse prior to move in. When we opened our site. 32 of the people that originally moved in were in an unsanctioned camp directly across the street.'",
        "'speaker_4': 'That camp is now gone because of this solution coming in place. And so people that are coming in are coming from outdoors. When they come into our site, they have a tent that's rated for subzero temperatures that's on a platform that keeps them out of the snow.'",
        "'speaker_4': 'And they have electricity to every single unit, as well as warming tents available on site as well.'",
        "'speaker_3': 'So. Well, I appreciate that additional background. I'm just going to add a comment, Madam President, before I turn it back to you, which is that, you know, I think full disclosure, I was one of the folks who worked with the community to help to bring this idea and develop it and bring it to the city.'",
        "'speaker_3': 'And I think that in that process, I both heard from numerous neighborhoods, including, you know, not just folks that experienced camps every day, but I you know, Councilman Cashman and I were at a Westwood Park neighborhood meeting where I was asked, why can't the city find a safer, more orderly place for people who are not going inside'",
        "'speaker_3': 'to be more safely and to get the help they need? These ideas, they didn't use this language safe outdoor space. Right. That's language that we invented. But they talked about this concept. You know, we did massive outreach around to be an overwhelmingly you know, more than 50% of folks were supportive of this in scientific surveys as well'",
        "'speaker_3': 'as informal surveys. There is really strong support for this model. And I will just say I heard a lot of mixed feelings. You know, I have a 10,000 plus person email list. And when I sent an email out specifically about this model, I heard lots of questions, consternation, some, you know, some concerns.'",
        "'speaker_3': 'But I did not hear widespread disapproval. But I will tell you that when I shared that, it was then open and folks were seeing the news coverage and seeing the sites. I have had no complaints from folks saying we should close this, we should stop doing this.'",
        "'speaker_3': 'So I just you know, I knew that we all have different constituencies and districts and we hear from different people. But I would just say I've got none of the to see that the community does not support this model and does not want to see it.'",
        "'speaker_3': 'And therefore, you know, to vote against it, I think is just misstating the massive, you know, you know, again, polling, surveys and others that show that a majority of residents think this idea is worth trying. It is an interim measure.'",
        "'speaker_3': 'This if this is our destination, we're in big trouble, but it's not our destination. We just doubled down on our supportive housing pipeline to accelerate it and to generate more homes. And so if anyone thinks we're going to address this crisis only with long term solutions and no emergency solutions, then the lives that will be lost in'",
        "'speaker_3': 'the interim, whether it's to hypothermia or hopelessness or what other ways that people die when they're on the streets unprotected, I'm not willing to make that sacrifice. So I will continue to advocate for doors and roofs and individual keys to homes for everybody.'",
        "'speaker_3': 'I'll continue to be an advocate for supportive housing, but I will be strongly supporting this contract tonight, not just because I believe it is the more humane harm reduction alternative to sleeping on the streets without the heated tent and without the service provider and without the food that these sites provide.'",
        "'speaker_3': 'But also because I have heard from massive numbers of my constituents that they think this is the direction that would be better to go than what we've had with unregulated camps. So for those reasons, I'll be supporting it tonight, and I urge my colleagues to do the same.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Canete. Councilwoman. So I see your your back up. I'm going to go ahead if it's okay to go to Councilwoman Ortega and then we'll circle back with you. Councilwoman Ortega, go ahead, please. Madam President, I just wanted to ask Cole or Angie a question about some of the data that we were provided.'",
        "'speaker_0': 'There was some information that showed that some people had secured vouchers. And I'm just trying to understand if those are going through the one home process with MDA, try to get people into the pipeline to secure those vouchers.'",
        "'speaker_0': 'And if they've been successful in finding housing, because we've heard in the past that just because somebody has a voucher doesn't mean it automatically provides them a unit.'",
        "'speaker_4': 'Yeah. Thank you, Councilman. I'll take that one. And Angie, if you want to jump in, feel free. So those are our data points from CBC Internal Data. Just so you know, every single person that's enrolled in the safe outdoor space has been enrolled in the HMS Homeless Management Information System.'",
        "'speaker_4': 'That's all that's also really important because that means people that weren't previously connected with services are now connected to this greater system. So an outreach worker working for St Francis Center, working for an urban peak, can find literally where this person that they used to have to go try to meet in a different encampment, find where they're'",
        "'speaker_4': 'staying every single night and see where they are. So the two people that have now, as I stated, been connected to housing vouchers. It's because they previously had come up on a list, but their outreach worker had not been able to connect with them.'",
        "'speaker_4': 'And they were able to do that because they found that they were within our space and they were able to let them know that they have come up and that their name is up for a voucher. Now, they have not yet connected to your housing unit, but that work is ongoing through the process with the outreach workers'",
        "'speaker_0': '. So can you tell me if any of the client population that have ended up in any of these locations have come from areas other than downtown Denver? So, for example, as you know, we've got a lot of people that live outside along.'",
        "'speaker_0': 'I think it's Sanderson Gulch near the MDH facility on Florida and Federal Boulevard. I know that we've had people living along same creek in Council District 11. The Santa Fe Corridor is another area. And so just wanted to ask about how people are getting plugged into that pipeline because I know a lot of the homeless outreach tends'",
        "'speaker_0': 'to be right in the downtown, but we have chronic homeless people who have been, you know, living along the South Platte River and other areas of the city that don't seem to have the same entree, if you will, into the MDH pipeline, because it's based on the street outreach workers helping get them connected to that resource and'",
        "'speaker_0': 'get them into the system so that, you know, when their name comes up and a unit comes up, they get priority over, you know, people who are not in that system. So can you speak to that?'",
        "'speaker_4': 'Yeah. So our strategy for filling this site and I'll speak specifically for the CBC operated site at Denver Community Church was to identify people that were camping within a four block radius of the site and help bring them in.'",
        "'speaker_4': 'And the reason for doing that was in order to deliver on that third goal that I shared, which was to reduce the impact of unsanctioned homelessness in the neighborhood. So our specific outreach efforts are for people that are in that Capitol Hill area.'",
        "'speaker_4': 'And what I would say is that the points that you're making are reasons to be advocating for this to exist in other areas of town. We need these kinds of solutions to pop up all around the city so that people that are in unsanctioned camps can come in to a resource and service rich environment.'",
        "'speaker_4': 'And it shouldn't just be located within the downtown core. But right now, those are the only options that are available to us.'",
        "'speaker_0': 'Yeah. And I think the Street outreach piece is a critical part of being able to ensure that people across the city are being able to get plugged into the same pipeline, because that's that's been sort of a a missing link, if you will, where, you know, unfortunately, we've got more people on our streets than than what we'",
        "'speaker_0': 'would like to see. And, you know, through lots of different mechanisms. I mean, people don't realize who who come here every Monday night that we've spent, you know, upwards of $50 million on providing overnight sheltering for people in our motels and at the Coliseum and National Western, as well as the shelters that are owned by the city'",
        "'speaker_0': 'of Denver and run by other folks. But at the same time that we've had more shelter beds than ever, we also have more people on our streets. And so I am supportive of this tonight. I just wanted to make sure that and this really is a conversation for Britta as well, because, you know, that's where our our'",
        "'speaker_0': 'homeless services are. And we always want to make sure that we're not just concentrating everything downtown, which is important, but we also want to be addressing the needs of people in other areas of our city at the same time.'",
        "'speaker_0': 'Thank you. Thank you, Madam Chair. Thank you, Councilman Ortega. Councilwoman Sawyer.'",
        "'speaker_3': 'Thanks, Madam President. Just wanted to point out that I attended committee and don't need to do committee work on the floor. Our job is to approve contracts or not approve contracts based on what we think is appropriate for tax expenditures, based on our constituencies.'",
        "'speaker_3': 'And I have made my point and I don't need to continue the conversation any more. I'm ready to vote. Thanks.'",
        "'speaker_0': 'All right. Thank you, Councilman Sawyer. Madam Secretary. Roll call.'",
        "'speaker_2': 'Sawyer. No, black I. CDEBACA Yes, of course.'",
        "'speaker_3': 'Clark.'",
        "'speaker_4': 'All right.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Kenny.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Ortega, I. Sandoval. Yes, absolutely. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce results.'",
        "'speaker_2': 'One eight and I's.'",
        "'speaker_0': 'Ten I's Council Resolution 20 1-0090 has been adopted. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Cashman, would you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_1': 'Yes, Council President, I move that resolutions be adopted and bills on final consideration be placed upon final consideration and do pass in the block for the following items. All series of 2020 10051005200750077006900990121012200 30 700 60 700 70 300 70 40000 80 500 90 500 90 700980 100 zero zero 50 400 80 600 80 900 92 and 0059'",
        "'speaker_1': 'second.'",
        "'speaker_0': 'It has been moved and I heard Herndon first councilman oh.'",
        "'speaker_1': 'In a way.'",
        "'speaker_0': 'You've got three more hearings in their.'",
        "'speaker_1': 'Calendar. The second. Can we vote on that? Let's go to the tape.'",
        "'speaker_0': 'Got to keep eye on it. Madam Secretary, roll call, please.'",
        "'speaker_2': 'Black. I see tobacco. I. Clark.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'When?'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Cashman. I can eat. I. Ortega. I. Sandoval. I. Sawyer. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results. 11 eyes. 11 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 20, Dash 1424, changing the zoning classification for 753 South Downing Street.'",
        "'speaker_0': 'A required public hearing on Council Bill 20, Dash 1561, changing the zoning classification for 925 South Pennsylvania Street and a required public hearing on Council Bill 21, Dash 0006 Changing the Zoning Classification for 2112 South Emmerson Street. Anyone wishing to speak on any of these matters must go online to sign up during the recess of council.'"
    ],
    "A bill for an ordinance changing the zoning classification for 753 South Downing Street in Washington Park West. Approves a map amendment to rezone property from U-SU-B to U-SU-B1 (allows for an accessory dwelling unit), located at 753 South Downing Street in Council District 7. The Committee approved filing this item at its meeting on 12-1-20.": [
        "'speaker_1': 'Yes, Council President. I move the Council bill 22 1424 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 Dash 1424 is open. May we please have the staff report? And I believe we have, Fran.'",
        "'speaker_2': 'I think it's James.'",
        "'speaker_0': 'Is it James? Oh, sorry, James. My start up. I had you down wrong. Go ahead, James.'",
        "'speaker_4': 'Not a problem. Thank you, Madam President. And thank you, Fran. Members of Council. Are you able to hear me and see my presentation? Yes. Thank you. Before you today we have a requested rezoning at 753 South Downing Street.'",
        "'speaker_4': 'The request is to go from UCB to UCB one to allow for the detached edu building for. Property is located in Council District seven in the Washington Park West neighborhood. The site is approximately 55, 20 square feet or 0.12 acres and is a single unit residential use.'",
        "'speaker_4': 'The rezoning from UCB to UCB one would allow the Urban House and detached accessory dwelling unit building for the max building. Height for an ADU is 24 feet and the minimum lot size is 4500 square feet. Existing zoning is also being surrounded by other U.S. B properties as well as U.S. U.S. to the north and OSA in'",
        "'speaker_4': 'the form of Walsh Park to. The East. Existing ladies is single unit residential surrounded by other single unit residential as well as to multi-unit residential and park and open space. Some photos of the existing context. The photo in the top left is the existing house and some other homes in the area and the intersection of Exposition and'",
        "'speaker_4': 'Downing Street. Perhaps a slide. We've received an R.A. position statement of our position, as well as nine letters in our position and six letters in support of this proposed application. Council will need to find the application consistent with the five reset with the five criteria from the Denver zoning code to approve.'",
        "'speaker_4': 'This proposed rezoning will begin with criteria. One Consistency of the adopted plans for this site. We have Top Plan 2040 Blueprint, Denver and the West Park Neighborhood Plan. This proposed rezoning is consistent with a number of planned 2040 goals, including equity goals and climate goals.'",
        "'speaker_4': 'Moving on to Blueprint Blueprint Denver This property is located in the urban neighborhood context. Urban. The urban context is characterized by a high degree of walkability and bike ability with good access to transit and less resilience, less reliance on cars.'",
        "'speaker_4': 'Typically, one and two unit residential areas with small multi-unit, residential and mixed use areas embedded like patterns are generally regular. There's a mix of alley uses in the urban context. This property does have alley accidents. Future place type is low residential, which is predominantly single and two unit uses.'",
        "'speaker_4': 'And so accessory dwelling units are appropriate in this context. Future Street type Downing Street is a residential arterial and there is a bus stop almost directly in front of this property. Blueprint, Denver Future Growth Strategy, all other areas.'",
        "'speaker_4': 'The city which anticipates seeing 10% of jobs and 20% of housing growth by 2040. Its application is also consistent with additional policies in Blueprint Denver specifically policy for diversify housing choice throughout the expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_4': 'And consistency with the West Washington neighborhood plan. This is a plan that was adopted in 1991. It is silent on Haiti specifically. However, staff does find that the proposed data use consistent with residential land use. Recommendation number four includes including compatible setbacks.'",
        "'speaker_4': 'The detached data building form was developed specifically to take these types of concerns into consideration and provides for appropriate setbacks between structures. Review criteria at number two. Uniformity of district regulations and proposed rezoning will result in uniform application of zoned district building form, use and design regulations.'",
        "'speaker_4': 'No waivers or variances are being sought here. Criteria for furthering the public health, safety and welfare staff finds this application consistent with this criteria, principally by implementation of adopted plans and by providing an additional housing unit in the neighborhood that is competitively integrated.'",
        "'speaker_4': 'Justifying circumstances. Again, we are looking at the specific implementation blueprint, Denver, which specifically recommends the city diversify housing choice through the access, the expansion of accessory dwelling units throughout all residential areas. And that plan was adopted after the date, the date of the approval of the existing zone district and therefore is appropriate justifying circumstance for the proposed'",
        "'speaker_4': 'rezoning. And Criteria. Five Consistency with Neighborhood Contexts Zone District Purpose and intent. Again, going back to the urban neighborhood, context primary consists of single unit and two unit. Residential uses the residential districts that are intended to promote and protect residential neighborhoods within the character of the urban neighborhood.'",
        "'speaker_4': 'Context building form standards, design standards and uses work together to promote desirable residential areas. In the U.S., you be one single unit district allowing the urban homes and detached accessory dwelling units, a minimum zone wide area of 4500 square feet.'",
        "'speaker_4': 'And the setbacks in lot coverage standards accommodate front and side yards similar to us hub and allow while allowing the detached accessory dwelling unit in the rear yard. Staff recommends council approved the application based on the finding that all review criteria have been met.'",
        "'speaker_0': 'Thank you, James. Counsel has not received any written testimony on Council Bill 20, Dash 1424, and this evening we have 13 individuals signed up to speak and we will go ahead and kick it off with our first speaker, Janet McIntyre.'",
        "'speaker_0': 'Might have to go ahead and unmute, Janet. You can go ahead.'",
        "'speaker_3': 'Thank you. Yes. My name is Janet MacIntyre and I live at 824 South Corona Street, which is one block south.'",
        "'speaker_0': 'Of.'",
        "'speaker_3': '753 Downing. And I've read the opposition letter by.'",
        "'speaker_2': 'West Rush Park Neighborhood Association.'",
        "'speaker_0': 'And Mr. Torres's rebuttal to that. And I thank the council.'",
        "'speaker_3': 'For hearing me tonight.'",
        "'speaker_0': 'I do want to point.'",
        "'speaker_2': 'Out that.'",
        "'speaker_3': 'This is relatively unknown in our neighborhood, although there was some canvasing done.'",
        "'speaker_0': 'This was a tough year to canvass and talk with people, I'll say.'",
        "'speaker_3': 'Mr. RACI talks about the benefits.'",
        "'speaker_0': 'To the community.'",
        "'speaker_3': 'But my view is it's 90 plus.'",
        "'speaker_8': 'Percent beneficial to him.'",
        "'speaker_3': 'And second.'",
        "'speaker_0': 'Point is, I believe.'",
        "'speaker_2': 'There's strong opposition in the neighborhood.'",
        "'speaker_3': 'I'm familiar with a few folks in the 700 block.'",
        "'speaker_2': 'Of South.'",
        "'speaker_0': 'Corona Street that are right behind Mr. Powell racist property. And I walked that alley.'",
        "'speaker_3': 'I would not like a second storey building looking down into my backyard as.'",
        "'speaker_8': 'This setup.'",
        "'speaker_3': 'Entails. I do believe it really.'",
        "'speaker_8': 'Disrupts the privacy of.'",
        "'speaker_0': 'The surrounding neighbors and.'",
        "'speaker_3': 'I think that is a significant concern.'",
        "'speaker_2': 'Let's see. He also makes points about.'",
        "'speaker_3': 'Having the community flourish.'",
        "'speaker_0': 'And I'm.'",
        "'speaker_3': 'Well aware of our housing shortage and.'",
        "'speaker_8': 'Homelessness. I'm quite.'",
        "'speaker_0': 'Involved with the S.O.S. site at the First Baptist Church that Cole Chandler was talking.'",
        "'speaker_3': 'About.'",
        "'speaker_0': 'Earlier. And this sort.'",
        "'speaker_2': 'Of housing I.'",
        "'speaker_0': 'Just don't think.'",
        "'speaker_3': 'Helps low.'",
        "'speaker_0': 'Income people find a place to live. And in my block.'",
        "'speaker_2': '800 South Carolina Street.'",
        "'speaker_3': 'I can name 14 or 15.'",
        "'speaker_0': 'People strongly opposed to this.'",
        "'speaker_3': 'Set up and.'",
        "'speaker_0': 'This approval.'",
        "'speaker_3': 'And. Concern about proliferation of this type of thing in the neighborhood.'",
        "'speaker_0': 'And I guess that's all I have to say. Thank you for your time. All right. Thank you, Janet. Our next speaker is Kirsten Michele.'",
        "'speaker_3': 'Hi everyone. My name is Kirsten.'",
        "'speaker_2': 'Mitchell and apologies to.'",
        "'speaker_3': 'Not sure quite how my camera on your computer. But anyway, I'm a resident of the Sphere neighborhood and a member of the West Park Neighborhood Association. I am here to support the application for rezoning of 753 South Downing and ask that the City Council vote yes on build 20 Dash 1424.'",
        "'speaker_3': 'I am here for two reasons. First, I believe City Council's role must be to support and part of a path for the future of this city, which includes planning for the growth of the Danvers residents and housing needs.'",
        "'speaker_3': 'Please do not subvert plans that the city has made in favor of its use based on faulty assumptions that a neighborhood must never change. Its use are another tool in the housing supply toolbox and affirmed in Blueprint Denver.'",
        "'speaker_3': 'I've heard comments in opposition to this particular rezoning because of how the aid may or may not be used. But the reality is that's not relevant. The property could be sold as soon as the ADU is ready and the new owners may have a different use for it.'",
        "'speaker_3': 'That's the whole point. This is flexible housing that has many potential uses for different people. Now, before my husband and I bought our home, we looked for a rental where we had some control over the heat and a little outdoor space for our dog.'",
        "'speaker_3': 'It was really hard, if not impossible, to find rentals that allowed pets that weren't in large buildings. But we were hoping to find a new place to live that was in a converted house or some other multi-unit structure and where we were fortunate and at the time we were fortunate to be working with a comfortable budget in'",
        "'speaker_3': '80. You would have been perfect for us. Perfect. They are smaller and we don't need a ton of space. But we couldn't. We couldn't find we couldn't find one, not a single one. Instead, we found a half duplex for nearly $3,000 a month four years ago.'",
        "'speaker_3': 'The point of this story is not to make you feel bad for.'",
        "'speaker_0': 'Me, but instead.'",
        "'speaker_3': 'I'm trying to convey a clear example of the need for different housing types across all neighborhoods in this city. Had we not been able to battle this ridiculous housing market? Who knows where we would have ended up? My final point is just that there are 380 youths in the alley behind my house.'",
        "'speaker_3': 'None of these have any measurable impact in my life. And to the contrary, having more folks around means more eyes on the street, which I consider a safety benefit. Someone who's always out walking my two huskies.'",
        "'speaker_0': 'It's 380.'",
        "'speaker_3': 'Use a perfectly fine on the block in which I lived, and they are perfectly fine in other parts of the city, too. We have to stop this approach of limiting housing type to limit who our neighbors are. Thank you.'",
        "'speaker_0': 'Q Our next speaker is Chris Miller.'",
        "'speaker_4': 'Thank you. My name is Chris Miller. I live in the Sphere neighborhood for disclosure. I'm a member of the West Park Neighborhood Association, the zoning board who abstained from voting on this item. And tonight, I am speaking only on my personal behalf.'",
        "'speaker_4': 'And I'm here to speak towards approval, not because of the merits of this specific project, but because they feel it important to speak up on behalf of the rule of law. Any just order really society. Blueprint Denver unambiguously states that any use should be approved in residential districts, and the city zoning code lays out how to incorporate'",
        "'speaker_4': 'plans newer than the code itself. This is a residential district. All other 20 plus previously submitted 80 applications since Blueprint and Rules passed in 2019 except for one withdrawn, have been approved as well, all with generally similar justifying rationale in reports from city staff because the same zoning code and comprehensive plan and broad balance of evidence apply'",
        "'speaker_4': 'to all of them. City Council passed a blueprint over after extensive public outreach. And we should respect and give way to the comments that led to Blueprint Denver. Being a nation of laws is worth little if we do not hew to them.'",
        "'speaker_4': 'And after January 6th, I believe that understanding and defending the rule of law and justice is more important than ever, both on the big things and the little things. I will concede that not all laws or enforcements are just.'",
        "'speaker_4': 'But there has been no indication that approval of this project would be an injustice. I additionally urge that City Council move towards amending the zoning code to implement and recognize the reality of Blueprint Denver which is that ideas are encouraged in all residential zoning districts.'",
        "'speaker_4': 'Given the zoning code criteria and our comprehensive plan, I do not foresee a circumstance where a conforming to you would be disallowed in a residential area according to our criteria. This will provide additional clarity for all residents about what changes will happen and give all of us time back to focus on matters that actually require substantive discussion'",
        "'speaker_4': 'and are not foregone conclusions under a city code, city code and comprehensive plan. And I would like to note that this same comment also applies to the next hearing about nine 2925 South End as well. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is John Ferguson.'",
        "'speaker_1': 'Hi. My name is John Ferguson. Thank you for letting me speak tonight. I'm speaking in favor of the EU being allowed. I think that that having an avenue in our neighborhood. I live a block and a half away, by the way.'",
        "'speaker_1': 'I live at 901 South Downing Street. I think having a great EU gives us to sort of a moderate, very moderate increase in density. And by the fact that the ideas are smaller, it may force has to be a lower cost housing and so that'll lead to some economic diversity in the people who are living in our'",
        "'speaker_1': 'neighborhood. So it's a positive thing, I think, for our neighborhood to have it. I decided to speak tonight when I saw the weapon it was was opposing. It was sending a letter to oppose it. And I had I had seen pretty much the same letter sent to the planning board and planning board pretty much shot it down'",
        "'speaker_1': '. One of the things that that keeps coming up in their opposition to ideas is this idea of having people looking down into your backyard and not allowing that to happen. Well, they don't have any problem with writing. People know three storey pop ups and mine in my neighborhood, in my block, looking down into my backyard.'",
        "'speaker_1': 'And somehow there's a bias towards people who are living in single family houses, who have a lot of money. So I decided because of that that I just had to speak tonight. So thank you very much for letting me buy.'",
        "'speaker_0': 'Thank you. Our next speaker is Roy Penny.'",
        "'speaker_1': 'I. Hopefully I made it. Hi, everyone. It's Roy Penney. And I'm. I live one block to the south of where this is. So I'm on Corona Street. And this is actually the first time I've ever participated in one of these.'",
        "'speaker_1': 'I've lived here since 1989. And the thing that struck me about the presentation from the person from the.'",
        "'speaker_4': 'Zoning board.'",
        "'speaker_1': 'I guess, was that it really didn't seem to capture what's really going on here. What we're talking about here, if you've ever walk by it, is an alley house. So there's there was it was mentioned set back. There was no setback whatsoever.'",
        "'speaker_1': 'This property abuts right on the property line. It showed a picture from the front, but it didn't show from the back. So what's going to happen here? This is going to be a. An Airbnb is what this is going to be used for.'",
        "'speaker_1': 'So if you I'm sure everyone here has alleys in their neighborhood. We have them here obviously in our neighborhood and our alley. If you just drive up, go across the street, you're in the alley where this is. So it's exactly the same for that block is for our block.'",
        "'speaker_1': 'So what you have is there's probably only. Maybe two or three places in the alley where two cars can pass. And all of these Airbnb people are going to come up the alley and park by their Airbnb. And there, you know, the alleys are already hugely crowded as it is.'",
        "'speaker_1': 'It mentions that there's a bus stop somewhere nearby. Nobody from out of town coming in and going to go to a Bronco game or whatever. They're not going to use public transit. They're going to take their car and they're going to park it in the alley, or they're going to call Uber to come down the alley and'",
        "'speaker_1': 'pick them up. So forcing all of this traffic down the alley is completely unrealistic. And it's, you know, kids can't can't even play in the street anymore. So the kids that are within two blocks of us, they play in the alley, Jack and Kate, and they shoot hoops.'",
        "'speaker_1': 'If you're going to route all this traffic through the alley, it's going to completely change the character of the neighborhood. So I and I understand what people say about, well, it's going to be you know, there's going to be more housing and stuff for people.'",
        "'speaker_1': 'But these are Airbnb people. And so, you know, really, you're not you're not providing housing for anybody. You're just taking from a motel or a hotel and putting them in the alley. If everybody did this, what this guy's trying to do, it would completely change the character of the neighborhood.'",
        "'speaker_1': 'So I understand 20 of these have come up and 20 have been passed. This one should not be. This is this is a really bad idea.'",
        "'speaker_0': 'Thank you. Our next speaker is Carolyn Diana. Go ahead. Hi. So, yes, I'm Carolyn. Diana and I live in West West Park. I am. So this is my neighborhood.'",
        "'speaker_2': 'I live on South Penn at the corner of Virginia. I have read the letter from the neighborhood association. I have so I'm I have.'",
        "'speaker_0': 'Familiarized.'",
        "'speaker_2': 'Myself with this this whole thing. And. Basically. I wanted to say that.'",
        "'speaker_0': 'If anything, COVID has brought up the reason we need.'",
        "'speaker_2': 'More flexibility.'",
        "'speaker_0': 'In our in our housing arrangements.'",
        "'speaker_2': 'So I want to speak in favor of approving this. Everybody else will bring up the.'",
        "'speaker_0': 'Details of.'",
        "'speaker_2': 'Arguing one point or the other. But I wanted to keep it simple and just say if it was my neighbor, I would be for it. If it was my neighbor across the alley, I would be for it. This is my neighborhood.'",
        "'speaker_2': 'I am for it. So I would encourage you to approve. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Gary Grant. Go to, you're probably going to have to unmute yourself. Sara. My name is Grady Grant and I thank you council members for the chance to speak. I live at 242 South Lincoln Street, Denver in Council District seven, and I'm here on behalf of the West Park Neighborhood Association Board who'",
        "'speaker_0': 'voted to oppose this rezoning. Wapner opposes this rezoning for several reasons. The neighbors who responded to a flier opposed it. We distributed fliers door to door to three blocks on Downing in Corona last June, asking for email feedback.'",
        "'speaker_0': 'Because COVID prevented our usual neighbor in-person meeting of the ten responses to the zoning committee, two supported it and eight opposed it, including the two neighbors on Corona, right across the alley from this existing uphill two story garage studio.'",
        "'speaker_0': 'This structure is a garage expanded in the 1980s and is taller than anything else on that alley. It peers over the single storey garages of the downhill neighbors across the alley. Most of the houses on this part of the block are on.'",
        "'speaker_0': 'Both Downing and Corona are one and a half stories tall. Then a neighbor led an almost successful effort to get enough signatures for a protest. Made more challenging here because Washington Park takes up almost half of the area from which to approach signatures.'",
        "'speaker_0': 'The petition wasn't sent in the end to avoid putting neighbors at risk who would sign thinking it would change the required number of votes to pass. There is also a feeling of hopelessness because the certainty that the zoning code was supposed to provide is no longer there.'",
        "'speaker_0': 'The code doesn't protect neighbors from short term rentals. The concern about strangers peering into their backyards and unpredictable noises at night, night from partying vacationers in the EU. Furthermore, the new design standards provide some privacy protection to neighbors, but would be improved by imposing on the property owner the loss of privacy burden created by the ADA, requiring'",
        "'speaker_0': 'windows on the property facing side and skylights or clear story windows on the lot sides and alley facing sides of the adu. What else? The neighborhood does not fit the description of neighborhoods vulnerable to displacement, where blueprints vision encourages ADA use.'",
        "'speaker_0': 'Unlike many Denver neighborhoods, the housing stock is built in. This part of the neighborhood already is far from homogenous. Even within areas zoned single family, there are duplexes and more dense housing on corners. Wapner values this existing diversity.'",
        "'speaker_0': 'We already have gentle density in our neighborhood and use uses. Short term rentals do not necessarily provide affordable housing. There is as there is a zone because there is no zoned district allowing ADA use for prohibiting short term rentals.'",
        "'speaker_0': 'I urge you to vote no on this rezoning, but in the next ADA you were zoning before you tonight. Wapner supports the rezoning. Thank you very much. Thank you, Gertie. Next up, we have Greg home.'",
        "'speaker_1': 'Evening. My name is Greg Home. I've lived on a 30 hour block in South Vietnam for 32 years, and I fully support this rezoning and urge city council to approve it. Use our most effective tool for immediately adding to the supply of affordable housing 80 user consistent with Blueprint Denver and Comprehensive Plan 2040.'",
        "'speaker_1': 'It is essential that West Wash Park offer more cost housing options and also increase the diversity of our neighborhood, allowing avenues to contribute to reducing segregation. West Wash Park is 88% white and reducing economic inequality. As a member of Live Now, I'd like to offer an alternative view on the points raised in the letter in response to'",
        "'speaker_1': 'Section one. City Council's decision on this application should be based solely on whether the application is consistent with the zoning code in the city's planning documents, not on whether the zoning code is supported by other residents. It's not a popularity contest.'",
        "'speaker_1': 'In response to Section two, page 83 of Blueprint Denver states in 04a that the city should quote study and implement its use in all neighborhood contexts and residential zoned districts unquote and states for be that the city should quote identify strategies to prevent involuntary displacement in conjunction with expanding the allowance for free to use, unquote, unquote, in'",
        "'speaker_1': 'all neighborhoods in zone districts. It does not say that you should be encouraged only in areas vulnerable to displacement. In response to section three, aid use do not impinge on neighbors privacy more than other housing types. All housing types in the neighborhood are within 8 to 15 feet of one another and have windows that look into neighboring'",
        "'speaker_1': 'yards as well as in the houses. And you should not be treated differently from any other housing category in this regard. In response to section four, rejected using other innovating housing types because they are different is not a legitimate rationale for rejecting housing that would increase affordability and foster a more inclusive neighborhood, particularly considering the exclusionary and'",
        "'speaker_1': 'racist history of single family zoning. In response to Section five, short term rental is a concern for all housing types, not just abuse. It is a completely separate discussion and should have no bearing on this application. Thank you very much for.'",
        "'speaker_0': 'Allowing me.'",
        "'speaker_1': 'To speak tonight.'",
        "'speaker_0': 'Thank you, Greg. Our next speaker is Jim Hartman.'",
        "'speaker_1': 'Hello members of council and thank you for allowing me to speak. I am.'",
        "'speaker_4': 'Speaking in support of.'",
        "'speaker_1': 'The EDU. Just wanted to point out a couple of things because most people are touching on the same issues. One blueprint Denver supports this, and I think we should.'",
        "'speaker_4': 'We should get behind it and.'",
        "'speaker_1': 'Support it as well. In response to the letter that the West West Park Neighborhood Association has written. One of the things that there are two of the things that jumped out to me is one is the privacy issue that was brought up.'",
        "'speaker_1': 'And it's been brought up several times. There is in in. In my opinion, there is no clear definition of privacy in this area and my house is extremely close to the house next to it, which I'm sorry to state this.'",
        "'speaker_4': 'But I live.'",
        "'speaker_1': 'In the 600 block of South Pennsylvania in the neighborhood. But my there is no clear cut definition of privacy. And it can be interpreted whether it's a house that's next to me that's.'",
        "'speaker_4': 'Been on that same.'",
        "'speaker_1': 'Lot for over 120 years. Or if it's a new multi-story house built next to me, it seems pretty arbitrary to bring up privacy in these issues. And then lastly. The uses of is of a great concern. But the if you're talking about a short term rental really that can apply to any one of the houses in the'",
        "'speaker_1': 'neighborhood. In fact, the front of the house could be a short term rental and the owners could live in the 80. You it seems kind of arbitrary to bring that issue up. Lastly, I think that there really is only one way that we can take pressure off of the housing stock in our in our neighborhood.'",
        "'speaker_1': 'And that's by Audi adding more housing. Thank you for your time.'",
        "'speaker_0': 'Thank you, Jim. Our next speaker is David Hagan.'",
        "'speaker_4': 'Hi. Good evening. Thank you for letting me speak tonight. I wanted to talk about a V in support of this. I think.'",
        "'speaker_8': 'That.'",
        "'speaker_4': 'Housing is a good thing and I appreciate the gentleman. Actually, the last couple of gentlemen talked about.'",
        "'speaker_1': 'The.'",
        "'speaker_4': 'The racism that has kept people out of these neighborhoods. And I think that people should be able to move into the neighborhoods. And I if I pull up Airbnb right now, I could probably find 20 to 50 Airbnbs in the front out in front of folks houses just right now.'",
        "'speaker_4': 'And as far as the privacy goes, I don't think anybody wants to be looking into their windows. I mean, they've got their own stuff going on. It's not going to really I don't know. It doesn't make a lot of sense to me.'",
        "'speaker_4': 'The, uh, let's see here o and the gentleman who spoke.'",
        "'speaker_1': 'About the kids playing in the alley.'",
        "'speaker_4': 'I'm pretty sure this is across the street from what park is it not. So I think the kids should probably in was part of the alley so that that doesn't really work for me either. My only thing when it comes to zoning is I'm just going to for example, is when you block line of sight, like, for'",
        "'speaker_4': 'instance, one of the little houses you.'",
        "'speaker_1': 'Put out because of COVID. I got into.'",
        "'speaker_4': 'A car accident the other night and followed my car because it was blocking my line of sight. This is not blocking my safety, so I'm good for it. That's all I have to say. Thank you.'",
        "'speaker_0': 'All right. Thank you, David. Next up, we have Jesse Paris.'",
        "'speaker_4': 'Yes. Good evening. Member of council. I was at home when I was just in Washington, Paris, and I'm representing or I was represented for Denver homicide loud no longer. I represent for Black Star Action more for Self-defense, Positive Action Committee for Social Change, as well as the Unity Party of Colorado and Mile High News.'",
        "'speaker_4': 'And I will be the next mayor of Denver in 2023. I'm in favor of this rezoning tonight. We have a housing crisis. Just in case you forgot, we have a housing crisis. We had a housing crisis before COVID.'",
        "'speaker_4': 'We still have a housing crisis now during COVID sources for 80 used as food dwelling units all over the state. And as David already alluded to, this area was red line. It was not accessible to black people or so-called people of color for a number of years.'",
        "'speaker_4': 'So what is on display tonight is complete NIMBYism, not in my backyard. And unfortunately, it is going to be in your backyard because this housing crisis isn't going to solve itself. So any opportunity that council gets to increase more housing for people throughout this city, I approve it, just like I approved that when I ran for city'",
        "'speaker_4': 'council at large in 2019 and I plan to continue supporting it in 2023. So I am in favor of this rezoning. We need accessory dwelling units all over the city and every single district, just like we need safe outdoor camps and tiny home villages in every single district in this town.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Jesse. Next up is Steven Tabrizi.'",
        "'speaker_4': 'Good evening. Can you hear me?'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_4': 'My name is Steve Tracy. I am the owner at 75 three South Downing Street. The property in question for the reason. Thank you, councilmembers, for letting me speak tonight and thank you to everybody who spoke in support of this.'",
        "'speaker_4': 'I really appreciate it. I was not expecting actually so many people to come out in support. So I thank you. With this reason, I intend to finish an existing space, open my garage and turn it into an apartment.'",
        "'speaker_4': 'This structure was built in 1984, in the same styling as the existing 1909 Tudor style primary house. The space already exists, but in its current state its unfinished and unusable as housing. There has been a number of people who spoke out in opposition.'",
        "'speaker_4': 'That's the reason. The way I see it, it's not really about the reason. It's more about not wanting the short term rental off the really. Personally, I don't know if I'm going to use this as a short term rental or long term rental.'",
        "'speaker_4': 'But to those who don't want it, it really doesn't matter. Basic concerns like privacy, alley traffic. By the way, there is a dedicated spot for this apartment out of this flow of traffic. Property value, preservation of neighborhood character, etc..'",
        "'speaker_4': 'Most of these arguments, though, are rooted in fear of not fact. I've got a friend in the in West Warwick Park who has an adult and uses that as short term rental number or a short roster of their tenants over the last few months.'",
        "'speaker_4': 'A family in town to visit their sister in the new baby that stayed at an Airbnb so they wouldn't stress out the new family. A mom helping her daughter move into her new college home in the neighborhood, wanting to help out with without encroaching on her daughter's newfound freedom.'",
        "'speaker_4': 'A family with a baby that wanted to experience snow for the first time, a couple on their honeymoon, a single mom and her family on a very tight budget who wanted to take a vacation that wouldn't break the bank and allowed her to buy locally while on a vacation to cook a beer.'",
        "'speaker_4': 'And Airbnb. There's a number of them. I don't think I need to go on. There are safeguards in place, though, rules and regulations and screens to make sure that the neighborhood and your house is safe with short term rentals.'",
        "'speaker_4': 'I also see what's happening to Denver in the bigger picture. Lack of housing has caused real estate prices, deaths and rents to skyrocket. Homebuilding can't keep up in the few houses that are being built are being built in the ever expanding sprawl of the front range.'",
        "'speaker_4': 'Denver's affordability has plummeted over the last ten years and as a result, its desirability as a lifestyle destination in decline. There's no silver silver bullet to the solution to the problem, in my view, certainly won't solve the issue.'",
        "'speaker_4': 'It's a drop in the bucket. But my property is two and a half miles from downtown Denver. If we can't allow a milder form of density in existing families, single family neighborhoods directly adjacent to the city, I believe we're in for more of the same.'",
        "'speaker_4': 'Especially in this instance where the space already exists. As I close, I urge council members to keep the bigger picture in mind. This reason is in tune with the city a comprehensive comprehensive plan blueprint 2019 and having an inclusive government.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you, Steve. Our next speaker is test.'",
        "'speaker_3': 'Hi there. My name's Tess Sturdy and I am in Council District nine and I am in support of this rezoning. I just have a couple curiosities. Aren't y'all adjacent to watch Park so. And can't kids play there? I am hearing a comment that kids can't play in the streets anymore.'",
        "'speaker_3': 'It just it makes me I just have to think that, you know, the gentleman was more concerned about kids being able to play in the streets. But I haven't really seen him advocating for the streets availability to those experiencing homelessness who maybe need somewhere to survive, let alone play.'",
        "'speaker_3': 'And then the comment is going to change the character of the neighborhood. Comments like these are coded racist sentiments and rooted in Jim Crow era racial segregation in housing policies. I heard in the city planners report that integration is key and opposition to changes in your single family zone neighborhood is racist in classes.'",
        "'speaker_3': 'And your comments support just that. David and I were displaced from our home this year because of an asbestos spill and fiberglass getting into our HVAC unit. And we thought we were going to be out of our house for no more than a month, and it's been since September of 2019.'",
        "'speaker_3': 'We've lived in 15 different places, and one of the longest standing places we were in was an Airbnb during the time that we were in that Airbnb, which by the way, was literally I mean, it was a godsend for us.'",
        "'speaker_3': 'It allowed us to not have to move from hotel to hotel anymore. It allowed us some stability and some sanity. And so, you know, the comments of like people coming in town to party and, you know, really mucking up the neighborhood are just not based.'",
        "'speaker_3': 'In fact, as the homeowner presented previously, in that time that we were there, it was in a duplex and there were family members who came for a funeral. There were family members who came for for college, which is either their daughters, and that was in college.'",
        "'speaker_3': 'So I think that the idea that that is going to bring that sort of thing to the neighborhood is just really not rooted in fact. And and also, I think that the the the determined or, you know, leaving the determination to the renos in the neighborhood when it was mentioned that they gathered ten responses from members through'",
        "'speaker_3': 'email, which is in and of itself exclusionary because not everyone has access to the Internet. And and so I think that leaning on R.A. is, is the sole source of public opinion is dangerous and and not representative of the true, you know, opinion of of the of the public.'",
        "'speaker_3': 'So I just would caution any reliability on that. Thank you for allowing me to speak.'",
        "'speaker_0': 'Thank. Thank you. That concludes our speakers this evening. Questions from members of Council. Councilman Clark.'",
        "'speaker_4': 'And you, Madam President.'",
        "'speaker_1': 'It is gurdy, Grant.'",
        "'speaker_4': 'Um, is there. I think it's. She's still in the attendees of Could We Get Ready, Grant? And then the owner, Steven Teresi, back in. Hi, Judy. Can you hear me? Are you back in?'",
        "'speaker_0': 'Yes, I can. Mr. Karp.'",
        "'speaker_4': 'First of all, good to see you. And thank you so much for your years and years and years of service to our community. I really appreciate that you're still at this and still, you know, so involved. You had mentioned briefly and I just wanted to ask, there are two areas in West Park boundaries tonight.'",
        "'speaker_4': 'This one and then the next one is also in West Wash. Marks boundaries. You had mentioned that this one you guys voted to oppose and the next one you voted to support. I think I did not catch that before.'",
        "'speaker_4': 'Can you just clarify if I'm catching that right and then give me, you know, the brief, what is different for you? You know, from a zoning perspective on this one versus the second one.'",
        "'speaker_0': 'Councilman Clark and council representatives. The difference from my perspective, and I think from West Wash Park's perspective, is twofold. Number one, the neighbors oppose this in this one. But they support it in the subsequent one. And secondly, this 80.'",
        "'speaker_0': 'You. Pierce down into the backyards of the neighbors across the alley. The one on South Pennsylvania does not the it fits in much more compatibly with the architecture and character of that neighborhood. But it's primarily the fact that in this one, the neighbors opposed it and gave what I consider valid reasons.'",
        "'speaker_4': 'Great. Thank you so much, Gary. I really appreciate it. And again, thank you for your service and all your work with your association. Stephen, can you tell.'",
        "'speaker_1': 'Me.'",
        "'speaker_4': 'This is an existing structure permitted originally in the eighties that was before you owned this property. You did not build this structure. You purchased this property with the structure already built, is that correct? That's correct. Yeah. I purchased this property in 2019 and the structure was built in 1984 as an addition to an existing single car garage'",
        "'speaker_4': '. And as far as I've been able to tell, was it was it properly permitted at that time for what was built or is that unclear? Yes, I actually don't know that. Gary, you've done more research on the structure than I have, actually.'",
        "'speaker_0': 'Yes, Councilman Clark, it was properly permitted. It was it at the time before those of you, maybe only Paul Cashman remembers this. It was before quick wins, too, when two storey dwellings could extend all the way back to the alley.'",
        "'speaker_4': 'Got it. Okay. Okay. Those were my questions. Thank you both very much. And thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilman Clark. Not seen in the other hands raised for questions. The public hearing for Council Bill 20 Dash 1424 is closed. Oh, I'm sorry, Councilman Cashman. I did a quick look and didn't see the hand raise.'",
        "'speaker_0': 'We'll go ahead and pause. Go ahead and ask your question, please.'",
        "'speaker_1': 'Councilman Flynn has the question.'",
        "'speaker_0': 'Oh. Excuse me, Councilman Flynn.'",
        "'speaker_1': 'Thank you, Madam President. Could James, could you answer a couple of questions for me in the in this urban edge context, what are the setbacks and what are the things for addus detached to use in the rear of the property?'",
        "'speaker_4': 'Thank you for the question, Councilman Flynn. So it's actually the urban context, not this is urban. Urban? Yes, sir. Not urban.'",
        "'speaker_1': 'So what are the setbacks? Because I notice in this, Ali, I wasn't here for a while because of COVID and everything staying close to home. But I just did the Wall Street view and the camera goes down the alley and all of the it looks like all the garages are just up to the zero setback basically is'",
        "'speaker_1': 'that are the rules for detached to use any different do they require setbacks from the alley?'",
        "'speaker_4': 'They generally do. Let me I'm pulling up my code right now so that I can speak intelligently and not.'",
        "'speaker_1': 'Always a good thing. Yeah. Thank you. I think it was stated in the in the application also that that this is already a non-conforming structure. And in what ways is it non-conforming in in the 2010 code and I guess it was non-conforming in old chapter 59 as well.'",
        "'speaker_1': 'I don't know if the owner could respond to that. Why you're looking at up, James. Stevens was this non-conforming in the old code as well as 2010?'",
        "'speaker_4': 'You know, I'm not I'm not as familiar with the old code. What I what I can say, though, is that. As a group, as a garage. I believe this would be conforming because the back edge of the building does sit directly on the property line.'",
        "'speaker_1': 'Right. But there's studio space above it that that makes it non-conforming because it's habitable or.'",
        "'speaker_4': 'Well, it was never it was never habitable. There's no I mean, if I if I if this reason goes through, I'm going to have to go through the permitting process. And we're going to we're going to add power, water, sewer, electrical.'",
        "'speaker_4': 'Well, that. I think as far as the nonconference goes, I believe that the ability on the north edge of the building, on the property line and it may be outside of the the back 35% building envelope. Okay. So, you know, I still have to get through the zoning or the permitting process in order for that.'",
        "'speaker_1': 'Would you need a. Would you need a variance then. It's. Rob James, do you have the answer yet as to.'",
        "'speaker_4': 'Five foot rear setbacks or is.'",
        "'speaker_1': 'And in the rear 35% of the property, correct?'",
        "'speaker_4': 'Yes. Correct.'",
        "'speaker_1': 'Okay. So would this if this were a brand new if this were brand new construction, it would not conform because of the rear setback. But it is in the rear 35%.'",
        "'speaker_4': 'That is my understanding at this time. However, as Mr. Tracy alluded, he will have to go through all of the whole permitting process and and determine those those factors. You know, in the rezoning stage, we really you know, we're not looking at specific buildings.'",
        "'speaker_4': 'Right. It's you know, we could demo and build a totally new area and we would want to be comfortable that that meets the criteria as well.'",
        "'speaker_1': 'So, of course, we know in this case he's not going to do that because I read the application. So I don't know if that means he would need a variance from the zoning board or what. So. All right.'",
        "'speaker_1': 'That's why I have. Madam President. Thank you.'",
        "'speaker_0': 'Mr. Casey, did you have.'",
        "'speaker_4': 'Yeah, that's my clear clarification. Sure. The building does sit five feet off of the alley line or does. Yes. And and then it has a small apron in front of it, just as with the other garage structures in the alley, you know, there is my for example, my neighbor's fence protrudes five feet beyond the structure of the'",
        "'speaker_4': 'garage. And so the alley is already blocked there. Where I believe the noncompliance would be is simply the property line. And then any any potential building envelope, which I have not corrected. And those primarily stem from the fact that the building sits on the property line.'",
        "'speaker_1': 'Okay. All right. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Flynn. And we'll take another pause here. Scene. No hands raised live. We're going to close the public hearing for Council Bill 20 Dash 1424 Comments by members of Council Councilman Clark.'",
        "'speaker_4': 'Thank you, Madam President. And I just want to thank all of the folks from the neighborhood, from District seven who came out for this a lot. There's a lot of speakers for an 80, you and I, and I appreciate everyone coming out and and spending time and again.'",
        "'speaker_4': 'I want to thank Gurdy for being here and represent the Neighborhood Association's position. You know, we've had a lot of use this, the first one in this particular neighborhood. And I think that we're going to continue to grapple as these come forward in communities that, you know, have some historically we heard about, you know, some not far'",
        "'speaker_4': 'away, but haven't gone through this process as far as people acclimate to, you know, the new plan, support from blueprint and plan on how to use and not every community is set up the same. We had one, you know, the other day that we're talking about areas that don't have an alley.'",
        "'speaker_4': 'And again, this is a community that's not gone through this process before. And I think we're going to continue to hear and grapple with the issues around short term versus long term rental and about privacy in the same ways that we continue to grapple with that in communities that are historically like this community, single family bungalows where'",
        "'speaker_4': ', you know, a movement started a couple decades ago to tear down and build bigger and bigger houses. And now we're getting three story houses and we continue to grapple with with those things that are currently allowed in the zoning code.'",
        "'speaker_4': 'But that, you know, we're trying to some some work imagined and were allowed and some were. And and there are a variety of opinions on that. And I appreciate all the folks who came out to share those opinions with that.'",
        "'speaker_4': 'And again, I think as we continue to look at.'",
        "'speaker_1': 'Short term rentals.'",
        "'speaker_4': 'And not license and how that's going overall, that lives in a different place and a conversation that needs to continue. At the end of the day, here, we're tasked with does this meet the legal criteria for a rezoning for, you know, for this type of use?'",
        "'speaker_4': 'And I believe that, as demonstrated in the staff report, it does, you know, as as we see as we'll see with the one coming next, you know, this is not the only one coming forward in this neighborhood. And one of the distinguishing features, you know, both of them are going to be existing structures and we'll look at'",
        "'speaker_4': 'that one coming up. So there are some some factors with that versus a new build, but a lot of it comes down to, you know, the neighborhood sentiment of what's going on in there. And that is, you know, something?'",
        "'speaker_4': 'I think that we're going to continue to have to discuss and work through that, relate to all of those other ancillary issues. But at the end of the day, I think that this does meet the legal criteria for zoning for a change in zoning.'",
        "'speaker_4': 'And so I will be supporting this tonight, and I would encourage my colleagues to do so as well. And again, with with that asked that we continue those other conversations in the appropriate places about the potential impacts, the design guidelines.'",
        "'speaker_4': 'And I don't think it's just the ones that were raised here tonight. But we have a lot of areas that are.'",
        "'speaker_1': 'In my in in in.'",
        "'speaker_4': 'My neighborhood in Plat Park right next door that are already zoned for a to you. But you can't do an 80 over a garage because of both plane setback rules on the sides with the smaller lot sizes make it impossible to actually do.'",
        "'speaker_4': 'And so we have places where it's allowed and it has been allowed since the 2010 zoning code, and you can't do it because of the building requirements. And we have other places where you know it know fits, but there are there are, you know, evolving neighborhood concerns.'",
        "'speaker_4': 'And so I think we need to continue all of that. This isn't just a one size a use came through with and we're getting used to them and having so many of them that go through consent in committee, there are real, you know, construction issues and short term rental issues that we need to continue to grapple with'",
        "'speaker_4': '. As we look at the, you know, the recommendations in these planning documents to make a to use a building form that is more universally implemented citywide. So but again, with that, I will be voting yes tonight because it doesn't meet the legal criteria.'",
        "'speaker_4': 'Thank you. Madam President.'",
        "'speaker_0': 'Thank you, Councilman Clark. And now we have you up, Councilman Cashman. Go ahead.'",
        "'speaker_1': 'Thank you, Madam President. Yeah, this is one of those interesting situations where I have dear old friends and not just friends. People I respect a great deal on both sides of this debate. But, you know, I learned a while ago that I need to vote my conscience and my understanding of the legal criteria that we're charged to'",
        "'speaker_1': 'evaluate here. And so I will be supporting this application tonight. But there's a couple of things that have come up, some of which. Councilman Clark went into a little bit that I think really do merit more than just a drive by.'",
        "'speaker_1': 'I think we really need to be evaluating on an ongoing basis the effect of short term rentals on our community. You know, so many people I talked to expressed concerns about the effect of short term rentals on the housing stock in the community.'",
        "'speaker_1': 'And then in the next breath say, as I do when I travel, I use short term rentals frequently. You know, so there's that evaluation. But the whole subject of privacy. I think really merits a deeper dove from from this council and from CPD.'",
        "'speaker_1': 'As far as you know, we're building these big houses. And we're building three story houses and then we're putting rooftop jacks. On the top of three story homes. Now, I realize, especially in our inner city neighborhoods, that we gave up what some would think of privacy when we started with with five foot setbacks.'",
        "'speaker_1': 'Some of our older homes are even closer than that. But I still don't think we need to throw the baby out with the bathwater. I think we need to take a closer look if we are going to be building regularly, one and a half or two story structures along the back alleys.'",
        "'speaker_1': 'Are there design techniques that we can use to minimize the intrusion? So I just wanted to bring that up a little bit. And as this discussion moves forward, I do think we need to keep those tangential topics top of mind.'",
        "'speaker_1': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Cashman. And I'll go ahead and weigh in here saying no other hands raise that. This looks like it meets all of the criteria. And I will be voting in favor of it tonight. Madam Secretary, roll call, please.'",
        "'speaker_2': 'Clark.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_6': 'I.'",
        "'speaker_0': 'Herndon.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Hines. Cashmere. I can eat. I. Ortega, I. Sandoval. Sawyer. I. Black.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'CdeBaca, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': 'Can I ask?'"
    ],
    "A bill for an ordinance changing the zoning classification for 925 South Pennsylvania Street in Washington Park West. Approves a map amendment to rezone property from U-SU-B to U-SU-A1 (allows for an accessory dwelling unit), located at 925 South Pennsylvania Street in Council District 7. The Committee approved filing this item at its meeting on 1-5-21.": [
        "'speaker_0': 'Ten I's Council Bill 20 Dash 1424 has passed. Councilmember Cashman, would you please put Council Bill 20 1561 on the floor for passage? Oh, you're muted.'",
        "'speaker_1': 'There we go. Sorry, Madam President, I move council bill 1561 be adopted. Thank you.'",
        "'speaker_0': 'All right. Thank you. We've got it placed upon final consideration and do pass. And thank you for the motion and the second. Councilman Herndon. The required public hearing for Council Bill 20 1561 is open. Can we please have the staff report?'",
        "'speaker_0': 'And I believe we have three on.'",
        "'speaker_2': 'Afternoon, Madam President. Members of City Council. My name is Phil and an associate city planner with Planning Services. Today I am going to present an overview of the MAP Amendment for 925 South Pennsylvania Street. The subject property is located in Council District seven with Councilman John Clark.'",
        "'speaker_2': 'In the Washington Park neighborhood. The property is located along Pennsylvania Street, just west from May 25. The lot sizes around 4440 square feet and is powered by a single unit home. The property is in the urban single unity zone district and the applicant is proposing to rezone their one single unit, a one zone district with a smaller'",
        "'speaker_2': 'minimum zone. So lot size. This would allow to legally permit an existing accessory dwelling unit that was built before the current owner purchased the property. As mentioned before, the property is currently in the Urban Single Unit district, which allows for a minimum of 4500 square feet.'",
        "'speaker_2': 'As you can see on the map, the property is surrounded by property. So us you be with a historic structure use overlay district. So the north and east and us you be to the south and you are h38 with a historic river later to the west.'",
        "'speaker_2': 'The current land use of the site is single unit residential and it is surrounded by mostly other single unit uses and some two unit a multi unit unit uses to a west and east. In this slide, you can see the existing building form and scale of the area with the site of the proposed rezoning on the bottom'",
        "'speaker_2': 'right and some images to show the residential character of the neighborhood in the top right and top left. And here you can see a couple of images from the alley where you can see the existing structure in the rear of the subject property.'",
        "'speaker_2': 'Both the images are from the alley looking north. Subject properties within the Washington Park new plane, which would allow a maximum building height of 89 feet, which of course does not affect your request because the maximum height for any you in this district is only 24 feet.'",
        "'speaker_2': 'Speaking of the processes, information on notice of the application was sent on October 26, 2020. Planning Board recommended approval on December 16th, and to date, staff has received four letters from the public supporting the application, given the proximity to multi-unit dwellings to the west and east and two layers of opposition.'",
        "'speaker_2': 'One of the letters is against short term rentals. The other one actually has concerns with the fact that the rezoning is to 81 instead of B one, but does not oppose the idea. As I said, one of the leaders of opposition refers to a potential use of aid to you for short term rental.'",
        "'speaker_2': 'On that point, I would like to mention that the Denver zoning code and associated licensing regulations allows the resident of the primary dwelling unit to conduct a short term rental, either in the primary dwelling unit or in a legally permitted accessory dwelling unit.'",
        "'speaker_2': 'Basically, anyone resident in a primary structure can apply for a short term rental license as long as they live in the property. Not allowing for an 80, you won't prevent the applicant from getting a short term rental license.'",
        "'speaker_2': 'The other opposition expressed its concerns not with the rezoning of the district, but with the fact that the applicant is rezoning to a smaller lot size. And this could lead to a patchwork zoning or or what we call split zoning.'",
        "'speaker_2': 'The reason why the applicant is requesting to rezone to you as a one instead of you as you be one is because a lot size is only 4440 square feet and does not comply with the minimum so lot size of 4500 square feet.'",
        "'speaker_2': 'We will go over this in my analysis and we'll explain why we think it is okay to rezone to a smaller size. Denver's zoning code has five review criteria, which I will go over. The first criterion is consistency with adopted plans.'",
        "'speaker_2': 'There are three plans applicable to this rezoning. The rezoning is consistent with several of the tragedies in comprehensive plan 2040, and I will go over a couple of them. This MAP amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead to an environmentally resilient Denver by promoting infill development'",
        "'speaker_2': 'where infrastructure and services are already in place. Looking at Blueprint Denver The subject property is mapped as part of the urban neighborhood context. The future places map designates the subject property as low residential place type. These place type have predominantly single and two unit uses, and accessory dwelling units are appropriate.'",
        "'speaker_2': 'Pennsylvania Street is designated as a local street, which is mostly characterized by residential uses. Denver also provides guidance on when it's appropriate to rezone to US district with a smaller minimum lot size. It says that it is appropriate when a pattern of smaller loads with similar uses is present in the surrounding blocks.'",
        "'speaker_2': 'The blog with the subject site shows a large proportion of properties that are under 4500 square feet. Which would be consistent with the U. As a one district and a few lots that are larger than 4500 square feet, which would be consistent with the existing Southern District of u.'",
        "'speaker_2': 'S. U. V. One. The button east and south of the site is of smaller, lots more consistent with a U.S. A1 district, whereas on the north side of Kentucky, the lot a bit bigger and more consistent with you as you do one district.'",
        "'speaker_2': 'Lupine also includes specific policy recommendations. Housing Policy four focuses on diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas. Now looking at the West Washington Park neighborhood plan adopted by city council in 1991.'",
        "'speaker_2': 'This plan is silent on energy use specifically. However, the proposed rezoning is consistent with residential land use. Recommendation number four include compatible setbacks, significant buffering and landscaping and site plans for new moderate density residential development to ensure compatibility with adjacent low density residential uses that attach a new building for was developed to specifically take these types of'",
        "'speaker_2': 'concerns into consideration and provides for appropriate supports between structures. Staff also finds the requested zoning meets the next two criteria. The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare primarily through the implementation of adopted plans.'",
        "'speaker_2': 'To justify a circumstance where this rezoning is a city adopted plan. Since the approval of existing the existing U.S. business district, the city has adopted a comprehensive plan 2040 and blueprint Denver a stated throughout this presentation, the proposed rezoning to you assume a one mid-season tent of this plans.'",
        "'speaker_2': 'Lastly, the proposed zoning is consistent with urban neighborhoods, context, residential districts and the you issue a once on district. Stuff recommends approval based on finding all your criteria has been met.'",
        "'speaker_0': 'All right. Thank you, Fran, for the staff report. Council has not received any written testimony on Council Bill 20, Dash 1561. And this evening we have three individuals signed up to speak. And Fran, we're going to go ahead and ask if you could take down the screen sharing there, and we will go ahead and kick it off'",
        "'speaker_0': 'with our first speaker, Adam CAVANAUGH.'",
        "'speaker_4': 'Yes, I am the owner of the property and we are requesting the rezoning really for use of an existing structure. I think a lot of the points cover a lot of the discussion of the previous property applies to ours.'",
        "'speaker_4': 'I don't think I have anything further to add to the discussion.'",
        "'speaker_0': 'All right. Thank you, Adam. Next up, we have gurdy grant. Good evening. Council members and Council President again. It's me, Gerty Grant. I live at 242 South Lincoln Street, Denver, Colorado in council wonderful council District seven. And I am here on behalf of the West Park Neighborhood Association, which I believe sent a letter of support for this'",
        "'speaker_0': 'ADU rezoning. And our reasons for supporting it are that the immediate neighbors, both to the north and south, one of whom is Jane Kraft, Paul Cashman. And I think you remember her and they support it. The support from the neighbors was much more in favor than against.'",
        "'speaker_0': 'And this the architecture of this building fits in with the character of the neighborhood. It was converted to an access to a dwelling unit illegally without permits. However, it does fit in with the character of the neighborhood and West Wash Park voted to support it.'",
        "'speaker_0': 'Thank you. Thank you, Gary. Our last speaker for this hearing is Jesse Paris.'",
        "'speaker_4': 'Yes. Good evening. Members of Count. Mm. Those watching at home. My name is just Michelle Paris. I'm represented for Black Star Action Women for Self Defense, Positive Action Committee for Social Change, as well as the United Party of Colorado and Mile High North.'",
        "'speaker_4': 'And I'll be the next mayor of Denver in 2023. I'm in favor of this rezoning tonight for the reasons I stated at the previous rezoning. We have a housing crisis. We have this House housing crisis before Congress. We still have it during Kobe.'",
        "'speaker_4': 'So any opportunity opportunities council gets to pass rezonings of this type I am a supporter of. So I support this zoning tonight. Thank you.'",
        "'speaker_0': 'Thank you, Jesse. That concludes our speakers questions from members of council. We're going to give it an extra second there. All right. Seeing no hands raised, the public hearing for Council Bill 20 Dash 1561 is closed. Comments by members of Council Council member Clark.'",
        "'speaker_4': 'Thank you, Madam President. I won't belabor this one. I think the criteria have been met, and on top of that, everybody in the neighborhood is seen as supportive and happy to this one. Just another thank you to Gertie Grant for sticking around and speaking for the neighborhood on this one as well.'",
        "'speaker_4': 'And that's it. I will be voting to support and would encourage my colleagues to do the same. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Clark. And likewise, I will be supporting this as it meets all of the zoning criteria. Madam Secretary, roll call like I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Cashman. I can, Kimmage. I. Ortega.'",
        "'speaker_0': 'I. Sawyer.'",
        "'speaker_3': 'I. Black I.'",
        "'speaker_0': 'CdeBaca. I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results.'",
        "'speaker_2': 'Ten Eyes.'",
        "'speaker_0': 'Ten Eyes Council Bill 20 Dash 1561 has passed. Council Member Cashman, will you please put Council Bill 20 1-0006 on the floor for passage.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2112 South Emerson Street in Rosedale. Approves a map amendment to rezone property from E-SU-B to E-SU-B1 (allows for an accessory dwelling unit), located at 2112 South Emerson Street in Council District 6. The Committee approved filing this item at its meeting on 1-5-21.": [
        "'speaker_1': 'Yes. Council President, I move the council bill $21 0006 be placed upon final consideration. Get ready and do pass. Okay.'",
        "'speaker_0': 'Very good. The required public hearing for Council Bill 20 1-0006 is open. May we please have the staff report? And I believe we have Libby with us.'",
        "'speaker_3': 'Yes. Um. Can you see my screen and hear me?'",
        "'speaker_0': 'Mm hmm.'",
        "'speaker_3': 'Awesome. So my name is Libby Adams, and I'll be presenting the Third Avenue case that you'll be hearing this evening for the Wrap amendment application at 2112 South Emerson Street. This application is located in Council District six, in Councilmember Cashman's district in the Rosedale neighborhood.'",
        "'speaker_3': 'The property is near the intersection of South Emerson Street and Evans Avenue. The applicant is requesting to rezone from Urban Edge Single Unit B to Urban Edge Single Unit b12 to allow for an accessory dwelling unit. I'm associated.'",
        "'speaker_3': 'Previously, the existing zoning is ECB, which allows for the Urban House primary building form and typically has a minimum zone size of 4500 square feet. The site is occupied by a single unit residents. It's surrounded by mostly other single unit residences.'",
        "'speaker_3': 'There are some two unit and multifamily kind of scattered throughout the neighborhood and then more commercial uses located along Evans Avenue. This slide shows the existing building performance scale with the site of the proposed rezoning on the right hand side of your screen, and then one of the multiple units just to the north along at the corner'",
        "'speaker_3': 'of South Emerson and Evans Avenue, and then one of the single unit homes across the street. This map amendment was complete in mid-October. A postcard notifying neighboring property owners and registered neighborhood organizations within 200 feet of the site was sent out on October 20th.'",
        "'speaker_3': 'Today, we have received one comment from the Platte Park Peoples Association concerned that this rezoning will lead to spot rezoning. However, spot rezoning occurs when a proposed district does not meet adopted plan guidance and when there's no justification for the rezoning.'",
        "'speaker_3': 'But staff has found that this rezoning is consistent with adopted plans and that there is a justifying circumstance warranting a change in zoning and which I'll discuss in the coming slides. So we don't do that. This would enable spot rezoning.'",
        "'speaker_3': 'And I also do want to point out that the Park People's Association was notified of this request because they are within 200 feet of the proposed site, but they are not the R.A. that is for this site. That would be the Rosedale Harbor Gulch Neighborhood Association.'",
        "'speaker_3': 'The Denver zoning code has five review criteria, which I'll go over. The first is consistency with adopted plans, and there are two plans that are applicable to the site. The proposed rezoning meets the goals and strategies in the comprehensive plan by creating a greater mix of housing options in the Roseville neighborhood and allowing infill development where infrastructure'",
        "'speaker_3': 'is already in place. The future neighborhood context and blueprint. Denver is urban edge. These areas contain elements of both the urban and the suburban neighborhood context and are mostly single and two unit residential areas with some multi-unit and mixed use embedded throughout.'",
        "'speaker_3': 'Blueprint identifies the subject property as the low residential place site. These place types are mostly single unit residential uses is accessory dwelling units are compatible and can be integrated throughout the area. And then South Emmerson Street is designated as a local street, and these are most often characterized by residential uses, which is consistent with the proposed rezoning'",
        "'speaker_3': 'of a single unit use with an accessory dwelling unit. The growth area strategy is all other areas of the city. This is where we anticipate to see 10% of employment growth and 20% of housing growth by 2040. The proposed rezoning to allow in a view is again consistent with this, as it would allow a slight increase in'",
        "'speaker_3': 'density consistent with the proposed housing growth. Blueprint. Denver also identifies specific policy recommendations. So the land use and built form housing policy for strategy states that individual rezonings to allow ideas are appropriate and should be small and area to minimize impacts.'",
        "'speaker_3': 'And so the proposed rezoning of just a single property is consistent with this strategy. South also finds the requested rezoning meets the next two criteria. The rezoning will result in uniformity of district regulations, and it will further the public health, safety and welfare, primarily through implementing adopted plans, also providing an additional housing unit that's compatibly integrated and'",
        "'speaker_3': 'also providing an additional unit in an area with high opportunity. This is less than a mile from a hospital, as well as an RTD station and less than half a mile from a public park and a full service grocery store.'",
        "'speaker_3': 'This stuff also finds a justifying circumstance for this MAP amendment, with the newly adopted plan, guidance and blueprint Denver to allow it. And of all of our residential neighborhoods. And lastly, the proposed rezoning is consistent with the urban neighborhood context.'",
        "'speaker_3': 'The residential districts purpose and then the specific intent of the ESU be one zone district. So based on finding our review criteria have been met. Staff recommends approval of the proposed rezoning. And that concludes my presentation. I do know the applicants are on the call, but I did not give them the link to sign up to speak'",
        "'speaker_3': 'at close by the time I sent it to them. But they'll raise their hand when the time comes. And I can use my presentation.'",
        "'speaker_0': 'Very good. Thank you, Libby. And tonight, counsel has not received any written testimony on counsel Bill 21, Dash 0006. And we have one individual signed up to speak this evening and we are going to go ahead and get started.'",
        "'speaker_0': 'Jesse Paris.'",
        "'speaker_4': 'Yes. Good evening. Remember, for those watching at home. My name is Justin LaShawn Paris. And I'm representing for Black Star Xtreme over for self-defense. Positive. Come in for social change as well as the Unity Party of Colorado and mile high north.'",
        "'speaker_4': 'And I'll be the next mayor of Denver in 2023. I am once again in favor of this rezoning. Tonight, we have a housing crisis. We had this housing crisis before it, and we still have it now. So any opportunities council gets to approve rezonings of this type I am in full support of.'",
        "'speaker_4': 'I supported Adios when I ran for City Council at large in 2019 and I will continue to support them. We have a housing crisis while we have 26,000 vacant luxury apartments. So I am in full support of this rezoning.'",
        "'speaker_4': 'I believe this is in Cashman's district. Good job, Cashman. You got this. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. That concludes our speakers this evening. Questions for members of Council. Councilman Quinn.'",
        "'speaker_1': 'Thank you, Madam President. Let me could you clarify for me what does CPD consider? When does CBD consider a parcel to be in a transit area? When I heard you talk about this being near an RTD station, it's actually in the staff report.'",
        "'speaker_1': 'It says it's it's several blocks away from a bus stop and there's probably any property in the city that's several blocks from a bus stop. The staff report also mentions proximity to the Evans light rail station on the Southwest corridor and the DU Station at the university up on, I think, High Street of Bucktown.'",
        "'speaker_1': 'Neither of those is within any reasonable walking distance routinely for somebody who wanted to use that for transit. So could you clarify what is CPD's measurement or standard for saying that a property is near transit?'",
        "'speaker_3': 'So it's typically within, I would say, a half mile. So you're right, this is a little bit farther outside of that area. And this started the bus stop along. Evans would be a lot closer, but that would potentially take you to the light rail station.'",
        "'speaker_3': 'Or if someone, you know has a bike that could very good bike to the station.'",
        "'speaker_1': 'Okay. Is there an outer limit where CPD would say, well, this site is not near transit, but we recommended that name? I mean, I don't I don't have a problem seeing this as my criteria. I do quibble with the notion that it's near transit just because there's a bus stop nearby.'",
        "'speaker_1': 'And I say that as someone who for five years when I worked at RTD, walked a half a mile every morning to a bus stop.'",
        "'speaker_3': 'Yeah. You know, that is. Oh, sorry. Go ahead. Something else.'",
        "'speaker_1': 'Is there a limit to is there a beyond which CPD would not say this is near transit?'",
        "'speaker_3': 'Oh, that's you know, because most of our city is served by at least a bus line. I would say so. I think for the most part, we would say that it's now some places are closer to higher frequency transit.'",
        "'speaker_3': 'So a bus line on Evans is probably going to run a lot more. We're on Colorado if you're close to Colorado Boulevard or Downing Street's more frequent. Um, so that varies throughout the city. But I mean, for the most part, our city is served by our two busses.'",
        "'speaker_1': 'Depending on where you are. Some are greater than other areas. Certainly. Certainly. All right. Thank you. That's all, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Flynn. Councilman Cashman.'",
        "'speaker_1': 'Thank you, Madam President. I see just Hastings. The applicant is in the queue. I wonder if we can promote.'",
        "'speaker_0': 'Yep. Well. Get that done here.'",
        "'speaker_1': 'Are you there, Jesse? You'll need to unmute.'",
        "'speaker_4': 'Yup. I'm here. Can you see and hear me?'",
        "'speaker_1': 'Yep. Absolutely. Can you just tell us what your thoughts are for what you want to do on your property? Yeah. We're looking at building a.'",
        "'speaker_4': 'Three car garage up the alley that has a two bedroom apartment above it. We've hired an architect with a lot of experience with use, so we're being very conscious to try and match the existing buildings architecture. And there's been a lot of talk about privacy concerns tonight and we definitely agree with that.'",
        "'speaker_4': 'Um, you know, we've talked to both of our neighbors who were very close to the, to the south and to the north. And we're gonna make sure we take every precaution to preserve that and try and have everything fit with the neighborhood's best we can.'",
        "'speaker_1': 'Okay. And what? Do you have any particular use in mind at this point?'",
        "'speaker_4': 'Out of the gate. We're looking at either a long term or a short term rental. I think the previous two people had a couple of really good examples of how a short term rental, even though maybe it has a negative connotation, the real positive thoughts with that.'",
        "'speaker_4': 'I have parents who actually live in Nebraska. We have a two year old daughter who they've come out to visit quite a bit and our house is pretty small. So that's something where the flexibility of having a short term rental, if we have relatives coming to visit and stay with us and they can stay on the property'",
        "'speaker_4': ', but outside would be really nice for us as well. So that's something we're very interested in.'",
        "'speaker_1': 'Great. Well, you're should this pass? You have plenty of options on what to do with the property. We're looking for zoning, not the particular use. But I did appreciate your sharing your plans with us. That's all. Madam President.'",
        "'speaker_4': 'Thank.'",
        "'speaker_0': 'All right. Thanks, Jeff, and thank you, Councilman Cashman. And see no other hands raised for questions of council members. The public hearing for Council Bill 20 1-0006 is closed. Comments by Members of Council. Councilman Cashman.'",
        "'speaker_1': 'Thanks again, Madam President. Yeah. You know, for the reasons that we've talked about tonight, I do think accessory dwelling units make a a much needed addition to our housing inventory options. And I do need to just raise the name of Bob Sperling, whom I've talked about before, who is going office to office city planning for years when'",
        "'speaker_1': 'no one would listen to him. And he was talking about Granny Flats at that time, and he would come to my office hours, Pete's Cafe on a weekly basis and sit and yell at me, trying to get someone to listen to him.'",
        "'speaker_1': 'And finally, people listened. And unfortunately, Bob passed away a couple of few years ago before this latest involvement of accessory dwelling units. So he lives on and and did more good for, I believe, for his community than he probably even realized at the time.'",
        "'speaker_1': 'So with that said, thank you, Madam President and I will be supporting this application and would hope my colleagues would join me.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Councilman Flynn.'",
        "'speaker_1': 'Thank you, Madam President. I will support this also, and I believe that it meets the criteria. I especially like the fact that it is on an alley and has adequate access as the other two tonight did have. But I just want to take the opportunity to urge CPD to refrain or to be a little more discreet about'",
        "'speaker_1': 'using the transit access. I did look up the schedules and it's 30 minute frequencies on the on the 21 and the 12. And that's by no means a high frequency at all. And I'd like to reserve that for something that truly is near a high frequency transit corridor or train station.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn, and see no other hands raised for comment. I'll go ahead and chime in that seeing that this meets all of the criteria, I'm happy to support it tonight as well. Madam Secretary, roll call.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_3': 'I can each write Ortega a.'",
        "'speaker_2': 'Sawyer.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Black. I see tobacco.'",
        "'speaker_3': 'I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I and on Secretary, please close the voting and announce the results tonight. Tonight's Council Bill 20 1-0006 has passed and our pre adjournment announcement is on Monday, March 14th. Council will hold a required public hearing on Council Bill 21, dash 0083 Changing the zoning classification for 2650 Arkin's Court 3205 ten Argo Street 3218 Argo Street and 2700'"
    ]
}