{
    "A bill for an ordinance amending the maximum fines that may be assessed by the Denver Department of Public Health and Environment. Amends Article XII of Chapter 2 and Article I of Chapter 24 of the Denver Revised Municipal Code to increase the maximum fines that may be assessed by the Denver Department of Public Health and Environment to $5,000 and to allow for administrative citations to be sent via first class mail. The Committee approved filing this item at its meeting on 7-14-21.": [
        "'speaker_0': 'No items have been called out under bills for final consideration. Council Pro Tem Torres has called out bills 770 for questions under pending. No items have been called out. Madam Secretary, would you please put the first item on our screen?'",
        "'speaker_0': 'And Councilmember Torres, you can go ahead with your questions on Council Bill 770, please. Thank you, Madam President. Director McDonald, just a few clarifying questions as this comes through for final reading. I know in our in our second briefing, there were a number of things that came up that I just wanted to make sure we're we're clarified'",
        "'speaker_0': 'from my community questions that we might have been getting in any others. But the the jump from a $999 fine to $5,000, I wanted to give a little bit of time for explanation on what kind of is what created the the cause or the justification for that jump, because that was something that I think was important information'",
        "'speaker_0': 'to know.'",
        "'speaker_5': 'Sure. Well, thank you, Councilman. And before I answer the question, I would just like to say, I hope you're all doing well. We are still not out of the pandemic. So I hope I hope you're all hanging in there.'",
        "'speaker_5': 'So let me start out by saying that this initiative is not because of the pandemic. We were going to move this effort forward before the pandemic, before we ever had our first case, because what we've been seeing more and more is that our administrative fine authority hadn't been changed in decades.'",
        "'speaker_5': 'It's been at 999, and because of that, because it's over, the course of time has become outdated. We were seeing more and more where regulated industries were disobeying orders. Now, I want to I want to stress this, that I think that in Denver, I think we do very, very well.'",
        "'speaker_5': 'All regulated industries, I think, do a very, very well with complying with Denver's public health orders. But from time to time, in all industries, we have those that might disobey public health orders because the $999 cap was not enough incentive for them to comply.'",
        "'speaker_5': 'And we would see this sometimes during the course of our interactions with them during regulated or inspections, where we might hear that they're not going to do that because the cost of paying the fine is less than the cost of being closed.'",
        "'speaker_5': 'And that's that we hear that in a number of different regulated industries. So there's that. And then we would also see that sometimes when a responsible party in a regulated industry would comply while we're there, they might. Changed their mind and then not continue to comply after we leave.'",
        "'speaker_5': 'So, for example, if we were to issue an order for a particular venue, a restaurant, a swimming pool, a barrier facility or what have you. If we were to issue an order to them to close or discontinue using a piece of equipment, or they might comply while we're there thinking that maybe we're not going to come back'",
        "'speaker_5': 'in the evening or we're not going to come back in the weekend, and they would go ahead and move open back up or move forward using a piece of equipment that they shouldn't have used. And these are serious public health violations.'",
        "'speaker_5': 'We're not talking about a $5,000 fine for repeat violations. We're talking about some serious public health violations that are imminent public health risks. And I'll give some examples. Just set the context for why we're doing this. But again, I want to stress that the industries that will reference are not those that stand out to me in terms'",
        "'speaker_5': 'of where we see this the most. But if we were to issue an order for a body artist to continue using an autoclave, that's not working properly. If we left that facility and came back and they were using that, that could result in the transmission of hepatitis or HIV between people that are receiving tattoos.'",
        "'speaker_5': 'If we were to issue an order for a responsible party to close the swimming pool because there was no chlorine in it, and then we came back and they let kids and everybody get back in the pool. That could result in an outbreak of something called cryptosporidium, which is a pretty, pretty serious parasite from recreational waters when'",
        "'speaker_5': 'there's no sanitizer in the water, no chemicals. If we were to issue a restaurant in order to close because it was too dirty to operate and that that's rare, but it happens. I think overall the restaurant industry does a very good job.'",
        "'speaker_5': 'But we do occasionally find that where someone will go ahead and open back up or we condemn some food product during the course of an inspection and they agree to comply to throw it away. But then later on might try to use that that could result in a wide range of foodborne illnesses.'",
        "'speaker_5': 'So. So we've seen this in a wide range of regulated industries, more and more because that 1999 has been in place for decades, decades. And yet throughout the state, all local public health departments and their specialties, if they find someone who has not complied with a public health order, it is of up to a $5,000 fine.'",
        "'speaker_5': 'That in Denver it's 999. Not only is it $5,000 outside of the city of Denver, they will charge that person with a criminal violation and take them to court. You know, our goal indeed is to gain compliance with public health orders, not to assess fines and generate revenue.'",
        "'speaker_5': 'We we we will continue to use this with great discretion.'",
        "'speaker_0': 'And can you just reassure me of the process by which fines might incrementally increase or what that schedule looks like?'",
        "'speaker_5': 'Yeah. Thank you. So I don't I don't envision huge changes. Right now we have existing fines, schedules that will go up incrementally. It's just that, again, when we reach the cap, we need a little bit more of a tool that we can use for those that are resistant to compliance.'",
        "'speaker_5': 'So we did a lot of research throughout the country, and I wish I could say that throughout the country it's $5,000, but that's not the reality. It's quite varied depending upon the jurisdiction, depending upon the type of the public health violation.'",
        "'speaker_5': 'But we did that research and if we were to take the average of many, many municipalities, the average fine cap for all of them, the average is about 50 $500. But probably more important than what we're seeing is the average across the country is what is it?'",
        "'speaker_5': 'And the tri county health department, what is it in Jefferson County or up in Larimer County? In El Paso County, it's $5,000 for violating a public health order. So I think that that we've fallen behind with the public health tools that we can use.'",
        "'speaker_5': 'And that's just been that that's just become more apparent during the pandemic.'",
        "'speaker_0': 'Thank you so much, Director. I don't have any more questions about. All right. Thank you, Counselor Dan Torres. And thank you, Bob, for answering those questions.'",
        "'speaker_5': 'Okay. Thank you all.'",
        "'speaker_0': 'All right. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote by otherwise. This is your last chance to call on an item for a separate vote.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2208 North Bellaire Street in South Park Hill. Approves a map amendment to rezone property from U-SU-C to U-SU-C1 (allows for an accessory dwelling unit), located at 2208 North Bellaire Street in Council District 8. The Committee approved filing this item at its meeting on 5-11-21.": [
        "'speaker_0': 'Councilmember Torres, will you please put Council Bill 5 to 2 on the floor for final passage and move that Council Bill 20 1-52 to be placed upon.'",
        "'speaker_1': 'Final.'",
        "'speaker_0': 'Consideration and do pass. Thank you. It has been moved and seconded. The required public hearing for council bill 5 to 2 is open. May we please have the staff report? And I see we have some here.'",
        "'speaker_1': 'Good afternoon, everyone. My name is Ed Henry. Yes, I am with CPD today and before you today we have 2208 North Street and the applicant is currently zone US U c which is a single unit zone district and they are requesting to change course to allow for an accessory dwelling unit.'",
        "'speaker_1': 'So it's currently located in Council District eight in Herndon in the South Park Hill neighborhood. So the site itself is a single unit, residential. It's just approximately over 6000 square feet. You can see City Park there to the west and it's between 23rd and 22nd Avenue.'",
        "'speaker_1': 'So the current zoning as you as you see, it's surrounded by us, you see, which is a single unit zoned district and you do see some open space which is at City Park. Um for the land use its current.'",
        "'speaker_1': 'It's currently single unit residential and it is surrounded by single unit residential in this area. And as you can see on the top right corner is the subject property. But you can see that in the close proximity there is a one story, two two story structures.'",
        "'speaker_1': 'And this went before the planning board in April and it was approved unanimously and has before you today as a present we have received two comments of opposition and those comments were around noise, the placement of the ADU, such as the setbacks, the height, as well as several visual impacts that can happen by the placement of the'",
        "'speaker_1': 'detached ADU. And you all received a response letter from the applicant that was responding to a lot of the concerns found in the opposition. That was by Bruce O'Donnell. Then he submitted that about Friday and I sent that over to you.'",
        "'speaker_1': 'Um, and so now whenever we're dealing with a rezoning case, we look at a specific review criteria that's found in the Denver zoning code. So the first one is consistency with adopted plans. And so we're really focusing on three plans here, which is a comprehensive plan, 2040 blueprint, Denver Land Use and Transportation Plan of 2019 and the'",
        "'speaker_1': 'East Area Plan of 2020 that was recently adopted. Um, there are several strategies found in comprehensive plan 2040 and that's specified in the staff report. And I would jump into your blueprint. Blueprint classifies this area as urban, um, which allows for small multi-unit residential and low intensity mixed use buildings.'",
        "'speaker_1': 'Um, and within the future place type classification, it's classified as low residential, which is predominately single into uses and accessory dwelling units are easy to use, are appropriate, and below street is a local street, which is primarily served by residential uses.'",
        "'speaker_1': 'As well as when we look at blue print, they have their specific policy that addresses AIDS, such as policy for funding the language in built form housing, which is the diversity housing choice through the expansion of accessory dwelling units in all residential areas.'",
        "'speaker_1': 'When we jump when we jump into the east area plan, the east area plan classifies this area as low residential single unit, which is predominantly single unit uses. And it does call that accessory dwelling units are appropriate. And when we look at specific policy and strategy language in the plan, policy six does talk about accessory dwelling units'",
        "'speaker_1': 'and appropriate locations as well as implementing and adopting city policies for the expansion of aid to use. And when we look at specifically Section four, South Park Hill, it talks about integrate accessory dwelling units in appropriate locations and then for the rest of the criterias are specified in the staff report.'",
        "'speaker_1': 'Therefore, CPD recommends approval based on all findings of the rubric right here have been met. I am available for any questions you may have as well as the applicant should be online.'",
        "'speaker_0': 'All right. Thank you. This evening we have it looks like. Seven speakers who are joining us and they are all joining us virtually. Our first speaker this evening is Tess Dougherty.'",
        "'speaker_8': 'Hi there. Good evening. Thank you for letting me speak tonight. Since I wasn't able to speak at the general public comment session, even though there were 3 minutes left. So I would just I just don't quite understand how that works.'",
        "'speaker_8': 'It seems like you're taking 3 minutes away from the people. But I was I wanted to talk about the the zoning and how it relates to gentrification and displacement. I'm in favor of this aid to you. I think we need to be providing more, you know, options and making it easier.'",
        "'speaker_8': 'I think the planning process needs to be easier and the criteria need to be updated to reflect the needs of the city. I don't think that that's been done and I'm still curious what is being done, because we've heard you all discuss how they're out of, you know, they're not effectively meeting the needs of, you know, of'",
        "'speaker_8': 'the city to protect people from displacement. And I'm I'm just curious how much of the history people in Denver know about displacement and the proposal, the recent proposal of the arena for the satellite area campus? Well, when the area campus originally came to be, it displaced, forcefully displaced people.'",
        "'speaker_8': 'And so when we're in these zoning, I would like to be hearing more of the the historical context that y'all are making these decisions from, because this city of Denver has a history of displacement. I mean, it goes back, you know, over 100 years.'",
        "'speaker_8': 'And and like that is a feature of this city. Zoning is displacement. And it doesn't feel like that is is at the center of your conversations about zoning. So thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Carol Kraft. And we have a dick crack. And so, Carol, if that's you, if you could, please raise your hand and we'll get you into the queue. But our next speaker is Carol Crack.'",
        "'speaker_0': 'Or there's a motley crew as well. So whoever is, Carol, we need you to raise your hand so we can bring you into the Q place.'",
        "'speaker_8': 'We're here all together.'",
        "'speaker_9': 'So it's Molly and Carol.'",
        "'speaker_5': 'Christine.'",
        "'speaker_0': 'All right, go ahead, please.'",
        "'speaker_9': 'We're the ones who own the property. My mom is. And so we're the ones making the request.'",
        "'speaker_0': 'All right. Thank you for joining on this evening.'",
        "'speaker_8': 'Sure. I mean, we can tell you if you want to know a little.'",
        "'speaker_9': 'Bit about what we're planning on doing, I'm not sure if you know. But so my mother, who's lived in the house since 1975, is wanting to age in place. And so it was her idea that we explore the option of building a very tiny adu in her backyard so that.'",
        "'speaker_8': 'My husband and I, with.'",
        "'speaker_9': 'Our son, would move into the larger house and be able to take care of her so that she can age in place. That's our.'",
        "'speaker_3': 'Intention. We're available for any questions, too, of course.'",
        "'speaker_8': 'Do you want to make the request? Yes. I ask that you grant us the variance.'",
        "'speaker_0': 'All right. Very good. Thank you. We're going to go ahead and move on to our next speaker. We have Luann Erickson.'",
        "'speaker_2': 'Hello. So I really hate doing this because Carol is my next door neighbor. And it it is difficult when you put neighbor against neighbor. But what I have my situation is that I'm retired and my investment is my house.'",
        "'speaker_2': 'That is my legacy for my children and my grandchildren. And I'm looking to protect that investment. I'm looking to continue to have as much privacy as I can. The placement of the lady you shared with us right now is really an issue for me because it will be very close to space that I use on a regular'",
        "'speaker_2': 'basis. The front of the ADU would be where I can see it, not only from the outdoors but from the indoors. So that interest in and out of the location of the. The zoning requirements don't really define how you get access in and out of this unit.'",
        "'speaker_2': 'If it's placed where they shared, the closest way to get to the front door would be basically on my driveway. And, you know, making the gate into the fence that exists right now because there just isn't room on the property on that side of the residence.'",
        "'speaker_2': 'So I said a letter. There's a number of issues, but what I'm finding is that the zoning requirements, when you're trying to do a new build on to an existing small law, not where there's an existing two car garage that they're trying to convert or one of these very large lots that we have within the neighborhood.'",
        "'speaker_2': 'The neighbor that is closest to them, which just happens to be me, is the one who was impacted. And so what could be a very good thing for Carol ends up being a very not good thing for me, because I'm going to have to figure out how to spend money to try to undo the damage of privacy'",
        "'speaker_2': 'and noise and other issues by the creation of the. Are you basically sitting five feet from where I spend my time in my yard? So although, you know, I. I understand what Carol wants to do and I applaud it.'",
        "'speaker_2': 'As it currently stands. I just can't support it. Thank you.'",
        "'speaker_0': 'All right. Thank you. Our next speaker is Geoff Baker.'",
        "'speaker_5': 'Hello. Good evening, counsel. My name's Jeff Baker. I live at 2422 Tampa Street. And I am here in support of this. The crack family actually hired my company waiting for you to help with the build of this. A little back story on the crack family.'",
        "'speaker_5': 'For over four decades, Carole has lived in the house. Molly was raised in the house. And Carroll wants to age in place, which is a perfect example of what blueprint Denver is outlining. And we built or have designed a very small area that started at 480 square feet and 17 feet tall and was reduced after Logan's comments'",
        "'speaker_5': 'to 396 square feet and 16 feet. And this. I can't see a better reason to build one of these. This is exactly what Denver needs. Carroll is going to be able to stay on the property that she's been in.'",
        "'speaker_5': 'Molly and her family are going to get to move back into her home that she grew up in. And it's not going to change the character of the neighborhood. This thing is teeny tiny. There was outreach done. There was some support for it.'",
        "'speaker_5': 'There wasn't comments submitted because Carol does not want to get into neighbors arguing with each other. And then I'll address a couple of the concerns that. We ran mention so that the lot size is actually a medium sized Denver law and pretty standard for for most of the the bicycle aid use built on them.'",
        "'speaker_5': 'And there is um minimum lot size requirements in the code. The height and sun blocking that she's concerned with is addressed by the bulk playing in the code. Um, and the concern about the, the electrical feed and connection that is all addressed with utilities coming off the primary house.'",
        "'speaker_5': 'Um, access to the edu on the property is not outlined in the code, but the north side where she's describing has never been used in over four decades as a primary access point to the back and actually has a permanent fence there with no gate.'",
        "'speaker_5': 'That doesn't mean you can take it down, but that is not where there will be access. There's a driveway that goes all the way up on the other side. And as far as I see, yes, there will be a sea and many split unit which is similar to running an AC unit and the five foot buffer between'",
        "'speaker_5': 'the property is addressed by the set back requirement. I understand that that's too close for comfort for lou-ann, and I apologize for that. But that is what the code is. And we ask tonight that you support this and that you approve the reason of this property so we can build this adorable little cottage for Carol.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker is Rachelle Subfloor.'",
        "'speaker_3': 'Good evening, members of City Council. My name is Rachel Floor and I live in the Five Points neighborhood in Denver. Bruce O'Donnell, myself, are assisting the Craig family with the rezoning application. So I'll try to keep this short and to the point, try not to repeat.'",
        "'speaker_9': 'Too much information you've already heard.'",
        "'speaker_3': 'So first, the proposed rezoning was recommended by approval, by planning board.'",
        "'speaker_6': 'And.'",
        "'speaker_8': 'As it meets the rezoning criteria for.'",
        "'speaker_9': 'An 80.'",
        "'speaker_3': 'Map amendment. Second, it has plenty of planned support from citywide plans such as.'",
        "'speaker_9': 'Comp Plan 2040.'",
        "'speaker_3': 'Blueprint Denver 2019 Blueprint. Denver specifically speaks positively to the addition.'",
        "'speaker_6': 'Of ideas and most, if not all, residential neighborhoods, as they are a low intensity approach to.'",
        "'speaker_3': 'Diversifying the housing stock.'",
        "'speaker_9': 'It is also supported by Housing Inclusive Denver, as well as the land use and zoning goals and recommendations of the East Area Plan and the Parkdale Neighborhood Plan. And overall, they just add to the much needed housing stock allowing for development that is also in character with the neighborhood.'",
        "'speaker_3': 'In addition to the neighbor outreach conducted by Jeff Baker with a.'",
        "'speaker_9': 'Do for you and the homeowner. We reached out to local Arnaud's back in December 2020, including a phone call with Greater Parkhill. We informed them or them and the other several RINO's of the homeowners plans.'",
        "'speaker_3': 'To build a granny flat.'",
        "'speaker_2': 'And.'",
        "'speaker_6': 'Of the proposed rezoning as well, which would allow them to do so.'",
        "'speaker_9': 'We invited them to meet with us virtually so we could share more information if needed. The Arnaud's did not reply needing any additional information, nor did they hold a position.'",
        "'speaker_6': 'For these.'",
        "'speaker_9': 'Reasons that they meet the criteria. I ask that City Council members.'",
        "'speaker_3': 'Please vote yes on this bill for the.'",
        "'speaker_9': 'Rezoning of 2208.'",
        "'speaker_3': 'Miller Streets.'",
        "'speaker_9': 'And I am able to answer any questions about the application itself. Thank you.'",
        "'speaker_0': 'All right. Thank you. Our last speaker is Jesse Perez.'",
        "'speaker_1': 'Yes. Good evening. Member of the council. Those watching at home, those that are out of town full time. My name is Justin with some personal representative for black staff to move to self defense, positive action, Memphis, Memphis, The Times as well as the Unity Party of our auto and Frontline Black News.'",
        "'speaker_1': 'And I'll be the next mayor of Denver in 2023. I'm in favor of this 82 request tonight. It meets all the criteria that is specified in Blueprint Number and Comprehensive Plan 2040. So I have no choice but to vote in favor of this.'",
        "'speaker_1': 'I also live in Council District eight, which is good for this district and Northeast Park here. I supported 80 youth when I ran for city council at large in 2019, almost 15,000 votes with no money. And I continue to continually support these 82 requests throughout various parts of the city.'",
        "'speaker_1': 'We need more housing lost their aging mother to aging in place. I'm in favor of that. We need to have more of this across the city. We need to support our seniors and allow them to age in place in the communities that they.'",
        "'speaker_1': 'Have helped to build and grow and say over the years. So I'm in favor of this rezoning. Please pass this to. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of Council on Council Bill five, two, two. I'll give it a moment. Seen no questions by members of council. The public hearing is closed. Comments by members of Council on Council Bill 522.'",
        "'speaker_0': 'Councilmember Herndon.'",
        "'speaker_5': 'Thank you, Madam President. I, I just want to say I believe the criteria has been met quite clearly, and I would urge my colleagues to vote in support of this. Thank you very much.'",
        "'speaker_0': 'All right. Thank you. Councilmember Herndon and I agree the criteria have been met and we'll be voting in favor of this rezoning. Madam Secretary, roll call on Council. Bill five two. Two.'",
        "'speaker_5': 'Herndon, I.'",
        "'speaker_6': 'Hines Cashman.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Canet.'",
        "'speaker_8': 'I.'",
        "'speaker_6': 'Sandoval, i. Sawyer, i.'",
        "'speaker_2': 'Torres, i. Black. I.'",
        "'speaker_6': 'See. Tobacco. I. Clark.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_6': '12 hours.'",
        "'speaker_0': '12 eyes Council Bill 21, Dash 522 has passed. All right. Moving on to our second hearing this evening. Councilmember Torres, will you please put Council Bill five, seven, seven on the floor for final passage? I move that council bill 20 1-0577 be placed upon final consideration and do pass.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4710 North Pennsylvania Street in Globeville. Approves a map amendment to rezone property from E-SU-D to U-SU-C1 (allows for an accessory dwelling unit), located at 4710 North Pennsylvania Street in Council District 9. The Committee approved filing this item at its meeting on 4-13-21.": [
        "'speaker_0': 'Thank you. It has been moved and seconded. The required public hearing for council bill 577 is open. May we have the staff report? And welcome back, edson.'",
        "'speaker_1': 'Hello everyone. At 21 years with CPD here. 4710 north Pennsylvania Street is requesting a rezoning to allow for an accessory dwelling unit. It's currently on Eastside, which is a single unit zoned district asking for us. You see one.'",
        "'speaker_1': 'It's currently located in Council District nine. Seelbach is a district in a Globeville neighborhood, so the site itself is just over 6000 square feet. It's a single unit, residential. It's across the street from Argo Park and they're requesting an accessory dwelling unit.'",
        "'speaker_1': 'The current zoning is ESU. D it's surrounded by you. You do have some, um, x three, which is a mixed use, up to three stories in close proximity as well as s, which is open space. And then when we look at the land use, it's a single unit residential with single unit residential, some industrial and open space'",
        "'speaker_1': 'across across the street. And the site itself is in the upper left corner. As you can see, it's a one story structure and the park across the street. And it went before the planning board in May and it was approved unanimously.'",
        "'speaker_1': 'And as a present we have received no comments for this item. And when we're looking at specifically a rezoning, we have specific review criteria that we analyze based off the Denver zoning code. And the first one is consistency with adopted plan.'",
        "'speaker_1': 'So we're looking at comprehensive plan 2040 Blueprint, Denver, L.A. and Transportation Plan of 2019 and the Global Neighborhood Plan of 2016. There are several strategies found in the staff report that this case is consistent with. And so I would jump into Blueprint Denver.'",
        "'speaker_1': 'And so Blueprint Denver classifies this area as urban, which where you see the small area plan as well as a blueprint deviate from what it's currently zone, which is the urban edge. And so urban edge is more a transition between urban and suburban.'",
        "'speaker_1': 'But this area is one of the few areas in the city where Blueprint Denver, as well as the neighborhood plan, specifically call out for a change in the neighborhood context. And so this neighborhood context is urban, which is a small multi-unit, residential and low intensity mixed uses buildings typically embedded in single unit and two unit residential areas'",
        "'speaker_1': ', and it offers good walkability with short predictable blocks as well as when we look at the place type, the place type is single and two unit uses and accessory dwelling units. ADAS are appropriate as well as Pennsylvania Street is a local street which are primarily served by residential uses.'",
        "'speaker_1': 'As well as Blueprint has policy around AIDS, which is policy for which talks about the expansion of accessibility throughout all residential areas. And then when we when we dove into the neighborhood plan, the global neighborhood plan of 2016, this plan specifically calls this area a single family with an edu.'",
        "'speaker_1': 'And more importantly, the plan has specific recommendations, such as recommendations B one that says all accessory dwelling units. Units to enable aging in place, additional income through rentals, and to increase population density in the neighborhood without altering the character.'",
        "'speaker_1': 'And then, more importantly, this area says update the neighborhood context, the Denver Zoning Code's Urban Neighborhood context, as opposed to the currently mapped urban edge context, better reflects the use of the alleys limiting or prohibiting curb cuts for street access and the continuation of detached sidewalks where possible.'",
        "'speaker_1': 'As well as it talks about tailoring the minimum zone lot sizes in areas where existing zoning requires a 6000 square foot minimum zone that size. The Future Zone district should have a 5500 square foot zone minimum. So that's what the Zone District is doing here.'",
        "'speaker_1': 'But the applicant's applying for. There are several other review criteria that the staff report classifies and therefore CPD recommends approval based on all findings of the records. Your having met and I am open for any questions and the applicant Eric is also on as well.'",
        "'speaker_0': 'All right. Thank you, Ensign, for the report. We have three individuals signed up to speak this evening and all are joining us virtually. The first one is Tess Dougherty.'",
        "'speaker_8': 'Is that me, Stacey? Yes, I did. Go ahead and say that. I'm so sorry. I didn't hear because it was changing over. So I'm in support. I think I actually mark the wrong thing for both of these ones on the thing.'",
        "'speaker_8': 'I just I don't know what happened, but I I'm in support of the aid to you. And I just, you know, this is in Globeville, where they haven't had they haven't had gas for three days. And, like, I don't know what's going on because, like, why why do we continue to allow the environmental racism in this town'",
        "'speaker_8': '? You know, there was a time in five points where they there was there wasn't even indoor plumbing because, you know, the city and county of Denver refused to service that area in the same the same time the rest of the city had it.'",
        "'speaker_8': 'And, you know, we've since renamed well, not we, some real estate developer renamed Fivepoint Reno, which is absurd to me. How about right? Never. It's five points. And I don't understand why we allow people to come into our spaces and to completely I mean, they got to change the name.'",
        "'speaker_8': 'And now we have clans named after with the rhino. Something clean. I mean, why did we even allow that to be named that? You know, and we have people in hilarious ones here who are literally in Globeville who can't even breathe right now because of the I-70.'",
        "'speaker_8': 'All the particulate matter in the air. Not to mention they're near Suncor, which we know went unregulated for 11 years. No idea how that, you know, just slipped the mind of everyone and, and like we have, I mean John Evans is one of two people who ordered the Sand Creek massacre and we have a mountain named after'",
        "'speaker_8': 'him. We have a boulevard. Like these are the things that we want you guys to start actually doing and taking ownership of because you have the power to change some of these things that are just racist and they're just blatantly racist.'",
        "'speaker_8': 'There's an unquestionable. And like in these meetings about zoning and all of these plans that are coming forward, where are the plans that address this? Where are the plans that address the racially restricted covenants of this city's zoning?'",
        "'speaker_8': 'We'd like to start seeing that as well in these plans because it's really gross to think that there's a mountain and a boulevard and a light rail station named after a man who slaughtered 300 women, children and elderly.'",
        "'speaker_8': 'And what would you do if you had to if your family was impacted by that, your ancestors and you had to hear people talk about Evans Boulevard every day? I mean, it's just the legacy of displacement and racial segregation is so strong in the city that we really need to start addressing it, thinking you.'",
        "'speaker_0': 'We're going to go ahead and move on to our next speaker. We have Helen Herron, Mushfiqur. And we're going to be able to allow them to speak.'",
        "'speaker_3': 'To.'",
        "'speaker_0': 'The camera. Go ahead, Helen.'",
        "'speaker_2': 'Hello? Hello? Can you hear me?'",
        "'speaker_3': 'Yes. Hello. I'm sorry I followed. Hello? You hear.'",
        "'speaker_2': 'Me? Hello? Can you hear me?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Yes.'",
        "'speaker_8': 'Yeah. I was going to speak at La La.'",
        "'speaker_2': 'Okay. I'm sorry.'",
        "'speaker_0': 'That's what we had to. HELEN So if it's okay, we'll go ahead. And skip over you for this hearing and we'll make sure we've got you. I believe we had you with Llama Lincoln Park as well.'",
        "'speaker_2': 'Okay. Thank you.'",
        "'speaker_0': 'All right. Our last speaker for this hearing is Jesse Paris.'",
        "'speaker_5': 'Yes.'",
        "'speaker_1': 'This is all me.'",
        "'speaker_0': 'Yes.'",
        "'speaker_1': 'Members of council. Those watching at home. Those who are still in the chamber. My name is just Allison Pearson. I'm representing for black sites a move to self-defense self the positive action command for social change as well as the Unity Party of Colorado and frontline black males.'",
        "'speaker_1': 'And I will be the next member in 2023. I'm in favor of this rezoning. So I of this 80 year request, this neighborhood has been rapidly gentrified, as already had alluded to earlier. So we need more accessible dwelling units throughout the city, especially in areas that have been rapidly gentrified and have suffered rampant displacements.'",
        "'speaker_1': 'So it meets all five of the criteria. So please pass this. You request to my good job, Candy. I think you got this one. Thank you.'",
        "'speaker_0': 'Thank you, Jesse. That concludes our speakers questions from members of Council on Council Bill 577. Seeing no questions. The public hearing is closed. Comments by members of Council on Council Bill 577 council members say the Barca. No comments.'",
        "'speaker_0': 'This is something that I think.'",
        "'speaker_2': 'You know, we've talked many times about it.'",
        "'speaker_0': 'People shouldn't have to go through all of these hoops to get here. So I definitely support this idea. Thank you. All right. Thank you. Council members say to Barca and see no other speakers. I agree that this meets the zoning criteria and will be supporting this this evening as well.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 577 CdeBaca.'",
        "'speaker_6': 'I Clark.'",
        "'speaker_5': 'Hi.'",
        "'speaker_6': 'Flynn. I Hinds. I Cashman. I can. I. Sandoval. I. Sawyer. I. Torres. I. Black. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_6': '11 Eyes.'"
    ],
    "AS AMENDED A bill for an ordinance designating the La Alma Lincoln Park Historic Cultural District as a district for preservation. Approves the designation of La Alma Lincoln Park as a district for preservation, roughly bounded by 14th Avenue on the north, Kalamath Street on the west, 10th Avenue on the south, and Mariposa Street and La Alma Lincoln Park on the west in Council District 3. The Committee approved filing this item at its meeting on 7-13-21. Amended 7-26-21 to reduce the size of the proposed historic district by amending its legal description. The new legal description removes 2 noncontributing properties on the edge of the proposed district boundary.": [
        "'speaker_0': '11 Eyes. Counsel Bill 20 1-577 has passed. Thank you, edson, for the staff reports and for the community members who joined us. We are on to our final hearing this evening. Councilmember Torres, will you please put council bill 758 on the floor for final passage?'",
        "'speaker_0': 'I move that council bill 20 1-0758 be placed placed upon final consideration and do pass. Thank you. It has been moved and seconded the required public hearing for council bill 758 is open. And we have Karen here. May we please have the staff report?'",
        "'speaker_3': 'Good evening. I'm Karen with Landmark Preservation in Community Planning and Development. And we are here for the alma Lincoln Park Historic Cultural District. Landmark Preservation was established in 1967, and since that time, we have designated 352 individual landmarks and 56 historic districts.'",
        "'speaker_3': 'What I primarily wanted to point out is that we have one other historic cultural district, which is the Five Points District. If the properties are designated, all properties would go through Landmark Design Review. All of the individual structures are designated as is, so there is no requirement to make improvements or rehabilitate the property.'",
        "'speaker_3': 'However, if a property owner chooses to make any changes to the property on the exterior of the building that requires a building or zoning permit. They would go through landmark design review as part of this process as a historic cultural district similar to five points, there will be customized design guidelines.'",
        "'speaker_3': 'The preservation staff has worked through a yearlong community process in order to update the design guidelines to reflect the character of the neighborhood. We met with community members over the course of 2020 and 2021. These proposed customized design guidelines would provide greater flexibility on materials, cladding, porches and fences, which reflects the character of the neighborhood.'",
        "'speaker_3': 'LPC would review and approve it if this district is designated. The end point of this is to help preserve the character of the district while also allowing change for community members. So this proposed historic cultural district is located in District three.'",
        "'speaker_3': 'The map you see here reflects the amended legal description from the Fourth Amendment last week, and here's a list of the applicants for the designation application. Members of the community have been working on this for about four and a half, five years.'",
        "'speaker_3': 'They started doing preliminary research and outreach to the community. They applied to historic Denver's Action Fund in order to help write a historic context. In addition to that, as they were going through the designation application. They worked with long term community residents to do oral interviews and histories to ensure that they were getting a correct history, particularly'",
        "'speaker_3': 'for the Chicano movement. Throughout this time, they did a wide variety of community outreach as required in the designation application. They did listening sessions, community meetings, walking tours. Things like ice cream socials and flier the neighborhood multiple times, knocking on doors to reach out to residents.'",
        "'speaker_3': 'Landmark Preservation in CPD also did a community outreach on this and community engagement, or we set up a website for the proposed historic cultural district. We also knocked on doors and delivered fliers. We mailed fliers out to every resident and owner within the proposed historic district.'",
        "'speaker_3': 'And then we held two online community meetings, one in April and one in May of this year. After the community meetings, we had an online survey or questionnaire in order for residents and property owners to provide their opinion on the proposed historic district.'",
        "'speaker_3': 'Staff also held office hours and one on one meetings with anyone who had any questions about what it means to be in a historic district. And this is just a really quick process timeline where this started about four and a half years ago to tonight with a vote at Denver City Council.'",
        "'speaker_3': 'As you all are aware, in order for a structure or district to be designated, it needs to maintain its integrity. The district needs to be 30 years of age or of exceptional importance, and it needs to meet three out of ten criteria, as well as having the Landmark Preservation Commission consider the district's historic context.'",
        "'speaker_3': 'The LPC and CPD staff found that it met the following four criteria. First, having direct association with the historical development of the city. This was historically home to the Apache, Ute, Cheyenne, Comanche and Arapaho Peoples. This area was part of their migratory path and states along Cherry Creek were part of the indigenous peoples seasonal encampments.'",
        "'speaker_3': 'However, by the 1870s, with the arrival of the air of the railroad, this area began to develop. A.C. Hunt, who also served as territorial governor, homesteaded and platted this area. The current park was hot was his homestead, and the surrounding land, including Burnham Yards, was platted for development.'",
        "'speaker_3': 'The residents who resided there were prominent, primarily working class and immigrant communities made up of German, Irish, Italian, Jewish and Mexican residents. They resided within walking distance of work, which was typically Burnham yards or the other industries related to that.'",
        "'speaker_3': 'And they were well outside the Denver urban core. However, horse drawn streetcars and then eventually trolleys connected it to the city. But it was established as a community neighborhood with people residing there, churches that were established there, as well as commercial corridors along Hellmouth and then Santa Fe Street.'",
        "'speaker_3': 'Avenue. Sorry, the district is significant for the development of one of Denver's earliest residential neighborhoods, which was primarily a working class and immigrant community. The district is also significant for embodying vernacular yet distinctive visual characteristics of architectural styles and types.'",
        "'speaker_3': 'These vernacular buildings are modest, yet identifiable architectural styles of Italianate Victorians, front gable types, terrace for squares and bungalow styles. Vernacular structures typically are not architect designed, but rather are constructed by craftsmen and builders and tend to use common and readily available materials.'",
        "'speaker_3': 'Architectural historians Thomas Carter and Elizabeth Collins, calmly, in their invitation to vernacular architecture, talk about common or simplified building forms and styles, as well as handmade and industrial produced materials that are seen in vernacular architecture, as you can see here in the images and as well here.'",
        "'speaker_3': 'These buildings tend to be one or one and a half story simplified versions of architectural styles found in the surrounding areas, such as in Cap Hill or the Potter Highlands. You can see a shift in the popularity among the architectural styles from the late 19th to early 20th century, with the majority of buildings built between the 1880s'",
        "'speaker_3': 'and 1920s. This district embodies the distinctive, visible characteristics of the architectural styles of the late 19th and early 20th century. The district is also significant under criterion, each representing an era of culture or heritage that allows an understanding of how the site was used by past generations.'",
        "'speaker_3': 'So all the Lincoln Park architecture, with its layers of history and cultural significance, provides an understanding of how the site was used and changed by past generations. Over the decades, there have been changes to the structures within the district.'",
        "'speaker_3': 'While the original styles are still readily evident, the alterations occurred during the period of significance and reflect the community of people that altered them. When the area saw a change in population with a in-migration of Latino and Chicano residents, neighborhood began to take on the character, heritage and culture of the community.'",
        "'speaker_3': 'Community members began adapting the buildings, adding stucco or other siding, and including fences to extend living spaces. The layers of change reflect how new generations of residents, creatively and adaptively used the buildings and how the cultural history of the neighborhood is reflected in the built environment.'",
        "'speaker_3': 'The changes made by the people that inhabited the neighborhood became intertwined with the physical characteristics of the houses and illustrates how the district was used and changed by past generations. And finally, the district is significant under Criterion J.'",
        "'speaker_3': 'The historic cultural district is strongly associated with social movements and institutions that contributed significantly to the culture of the community, the city and the state due to its central role in the Chicano movement. In addition to the diversity among the neighborhood's earliest residents, many residents of the neighborhood Hispanic, Mexican-American, Mexican and Latino descent moved to La alma'",
        "'speaker_3': 'Lincoln Park during the mid-twentieth century. The Chicano movement represented the convergence of independent issues land rights and labor rights, opposition to the Vietnam War, and the fight for civil rights. As long as as well as fights for against long term discrimination, backward lack of equity in education, and the inadequacy of the political and governmental institutions to address'",
        "'speaker_3': 'these issues. In time, the neighborhood and the park than just called the Lincoln Park became the incubator for Denver's Chicano movement. As residents came to identify as Chicano or Chicano and advocate for social justice. Denver served as the forefront as one of the members of the forefront of the National Chicano movement.'",
        "'speaker_3': 'Residents of the district participated in the movement, and leaders of the movement resided in the district, including important organizers and early political leaders, as well as organizations within the district. One of the primary areas Chicanos fought for nationwide was education.'",
        "'speaker_3': 'The community fought ongoing unequal access to facilities. The lack of bilingual programs and an overall disrespect of the cultural heritage in many of the education programs. This led to high school walkouts that began in L.A. in late 1968.'",
        "'speaker_3': 'As we have recently seen in civil rights movements today, movements that begin in one part of the country quickly spread. The walkouts in L.A. helped spark the blowouts in Denver's West High School in the spring of 1969, with marches from West High School to Lincoln Park throughout the neighborhood.'",
        "'speaker_3': 'The walkout spawned a blowout among hundreds of students from other Denver junior high and high schools over several days in March of 1969. These marches, along with other events and activities, made the park historically important ground for Chicano rights in Denver and made the Alamo Lincoln Park neighborhood an incubator for the Chicano movement.'",
        "'speaker_3': 'Another significant part of the movement's connection to the neighborhood is through the murals that are in both public and private buildings. Artist Emmanuel Martinez, who lived in the neighborhood, is a key figure in the creation of these murals and in in developing the Chicano mural movement in Denver.'",
        "'speaker_3': 'Denver was one of a handful of cities in the US that simultaneously began to paint community murals in the late 1960s. Many times, Chicano artists drew inspiration from traveling to these other locations. Several murals in the OMA Lincoln Park remain, including two in the proposed district's boundaries and they are character defining features of the area.'",
        "'speaker_3': 'The movement grew out of a number of inequitable circumstances that pushed Latinos, Hispanics and Mexican-American communities across the country to push for change in government and systems. It was fostered in part through voluntary social service groups that helped organize individuals and groups in the movement, many of which were located in the district.'",
        "'speaker_3': 'The alma Lincoln Park neighborhood was central to the movement and provided safe places where Chicano movement organizers and supporters lived, worked and gathered. The Landmark Preservation and CPD staff found that the district met all of the criteria. The LPC also found that the district retained all seven aspects of integrity, as are seen here on the screen.'",
        "'speaker_3': 'They also discussed the historic context and found that it reflects the layered nature of the neighborhood from the permanent structures in the 1870s through the 1960s and seventies Chicano movement. They found that the historic, strong context is strongly associated with the criteria and is well documented in the designation application.'",
        "'speaker_3': 'Because this is also a historic district. Denver Planning Board reviews historic districts with respect to its relationship to the Denver Concern Comprehensive Plan. The effect of the designation upon the surrounding neighborhood and such other considerations as may be relevant.'",
        "'speaker_3': 'Just wanted to provide a little bit of context for the zoning here. The Blue Line represents the proposed historic district. It's primarily a two unit with a few other zone districts in there as well. And then 100 also provide you with existing land use.'",
        "'speaker_3': 'The yellow color is single family, so it's primarily used for single family with a little bit of multi-unit and two unit, as are noted in the peach in orange colors. Within that context, we can look at the proposed district's relationship to the comprehensive plan.'",
        "'speaker_3': 'The proposed historic district reinforces the visions of the Comprehensive Plan through the preservation of community cultural assets in the LA Elmo Lincoln Park neighborhood, as seen in the three goals under a strong and authentic neighborhoods, as are seen here on this slide.'",
        "'speaker_3': 'It preserves the city's authentic, historic character, enhances design excellence, and contributes to a strong sense of cultural identity. Additionally, it encourages the stewardship of city properties through the continued use of the Alma Lincoln Park and the preservation of the Alma mural on the wall of the Rec Center.'",
        "'speaker_3': 'Designation of the alma Lincoln Park Historic Cultural District preserves the important character and cultural heritage of the community and advances design quality through design review of new infill while providing flexibility for the proposed cultural historic district with a draft customized design guidelines.'",
        "'speaker_3': 'The proposed district also meets recommendations of policies and strategies under Blueprint Denver. It meets the recommendations related to equity in diversity in one, A and B, ensuring neighbors have equal access to design quality tools and exploring improvements to make design tools more accessible.'",
        "'speaker_3': 'This may include additional staff resources to support the neighborhoods and improved process guides to more clearly articulate requirements. And also talks about exploring the feasibility of programs to provide resource resources for design tools in underserved neighborhoods. CPD work to find ways to make the guidelines more accessible through a yearlong process with the community.'",
        "'speaker_3': 'We have drafted customized design guidelines to better reflect the neighborhood character. If the district is approved, the customized design guidelines will also be translated into Spanish. And it's also relationship to blueprint Denver under strategy to a to continue the city's commitment to existing historic districts and use historic designations to preserve the character of the district.'",
        "'speaker_3': 'Overall, the proposed designation is consistent with Blueprint Denver recommendations. And reinforces the policy plans. It is consistent with Blueprint's vision to embrace the city's existing character and cultural heritage through customized design guidelines. It would preserve the key historic features, ensure that changes and infill are compatible with the character of the historic district.'",
        "'speaker_3': 'Denver Planning Board also looked at its effect upon the surrounding neighborhoods because the Landmark Preservation Commission only has purview over what is within the boundaries. It would have little impact on the surrounding neighborhood. Throughout this process, we received public comments, we received nine comments from organizations or Arnaud's, and we received 18 public comments submitted from individuals.'",
        "'speaker_3': 'The letters from the organizations and Arnaud's. We're all in support. We received letters from 14 individuals in support and four in opposition. At the Landmark Preservation Commission hearing, 12 individuals spoke. Eight were in support. One was undecided, and three individuals were in opposition.'",
        "'speaker_3': 'The individual who was undecided later wrote and provided public comment that she was in opposition and was counted here in this group of four that are opposed. And then Denver Planning Board, seven individuals spoke at the Landmark Preservation Commission.'",
        "'speaker_3': 'Kathy Prideaux, who is an applicant, also spoke in support of the designation application. And this is a photo of her in 1869 protesting at the state capitol. And she's there in the center. Public comments were also received by a CPD hosted survey or questionnaire.'",
        "'speaker_3': 'We received a total of 73 responses. 50 were strongly in support. Four were neutral, six were somewhat against, and 13 were strongly against. And the map here on the right represents those individuals who are either within the historic district or just right outside the historic district.'",
        "'speaker_3': 'So we wanted to differentiate between the total number that we received and then those that are within the historic district. And then it also notes if the people who are providing the comment or a property owner or a renter.'",
        "'speaker_3': 'So in summary, the landmark designation application was unanimously recommended for approval by the Landmark Preservation Commission. They found that it was over 30 years of age, that it meant at least three criteria, that it retained its integrity. And the LPC considered the historic context.'",
        "'speaker_3': 'Denver Planning Board also reviewed it and unanimously recommended approval and CPD staff recommends approval as well. And I'm happy to answer any questions.'",
        "'speaker_0': 'All right. Thank you, Kara, for the presentation. And this evening, we have 34 individuals signed up to speak and we're going to alternate between in-person and virtual participation for efficiency. So we'll call a segment of the in-person participants first and then we'll alternate to the virtual participants.'",
        "'speaker_0': 'And our first set of in-person participants that I'd like to invite to come to the front pew is in Tafoya, Felix Herzog, Shannon Stage Tan, Tanya Mote and Cathy Prieto. And so we will go ahead and start with Ian to for you, please.'",
        "'speaker_5': 'Do you have to push a button? No, you don't. Okay. I counsel you and Thomas Tafoya here. Want to start by in a cruel twist of fate, I somehow got it signed up in opposition. I want to make clear I'm not in opposition to this.'",
        "'speaker_5': 'I wrote op eds, did do a lot of work on this over five years. I do want to start by saying we're on occupied Arapaho, you and Cheyenne territory. This is how we start our historic tours that we give of the West Side and Chicano West Side that I've been a part of for the last five years'",
        "'speaker_5': '. I'm here speaking for a couple groups that I'm a member of Latinos and Heritage and Conservation and National Organization of Historic Preservation Advocates, Green Latinos My Job Who Works in Public Lands and Cultural Respect? The Colorado Latino Forum, which I have the chance to chair.'",
        "'speaker_5': 'All of these organizations stand in support of this very important moment. You know, the Trust for Historic Preservation took such an interest in this that we had a chance to give them a tour. And it was through that that I was even welcomed to speak and do a land acknowledgment opening up at Red Rocks, which was a'",
        "'speaker_5': 'once in a lifetime experience. But I think it goes to show you that all eyes are on Denver to create the very first Chicano Heritage Cultural District in the country.'",
        "'speaker_10': 'You know, I heard Kara talk.'",
        "'speaker_5': 'About Blueprint Denver and the equity goals. I was a member of the Blueprint Number Task Force. I actually held it up for several months on behalf of RNC over concerns with equity. And so I would drive home what she has to say.'",
        "'speaker_5': 'You know, my personal connection my grandfather graduated West High School in 1929. My aunts and uncles were part of the West Side blowout, and my grandmother and my aunt also went to.'",
        "'speaker_1': 'Emily Griffith School.'",
        "'speaker_10': 'You know, there's so much to say.'",
        "'speaker_5': 'About how long this took. You know me, I'm an action oriented person. Five years was a long time in the making for me. I was hoping it would go faster, but I can say considerably. There was so much work done that I made friends in the community that I didn't know before.'",
        "'speaker_1': 'Some who had lived there their entire lives, some who are.'",
        "'speaker_5': 'Newcomers to the community. But I know those murals and Emmanuel Martinez and Veronica Barela.'",
        "'speaker_1': 'And Betty Benavides, these are people.'",
        "'speaker_5': 'Who I look up to for their fight for our community and for our culture. Again, I just want to say all eyes are on you and you can do the right thing, just like we did with La Raza Park of.'",
        "'speaker_1': 'Securing our heritage as gentrification and zoning or wiping away our people. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Felix Herzog.'",
        "'speaker_1': 'On the evening. I'd like to start off with a quick reference to a Bloomberg article that was published on July 19, 2021, and it say that fewer than 8% of designated historic landmarks in this country represent histories of ethnic minorities.'",
        "'speaker_1': 'Now, I think as a country that usually takes great pride in being a melting pot and really bringing together minorities and bringing people from overseas together. That's a really, really sad statistic. It's just I mean, there's a lot of us here and only 8% represent minorities.'",
        "'speaker_1': 'I think that's something that today there's a chance to really make a change to that and kind of creating a district that kind of goes against that statistic.'",
        "'speaker_5': 'When you look at.'",
        "'speaker_1': 'Groups like Hispanic Access Foundation and particularly the White Progressive Era, he stated that historic sites tell a very wide story, and I think that just shows that there is something that can be done. That being said, I moved to the Lincoln Park about six years ago and when I.'",
        "'speaker_1': 'Walk to the box of my dog in the morning and met people. Everyone's very welcome. He was very friendly and on one occasion I made the accident of shortening the name of the neighborhood from within contact with just Lincoln Park.'",
        "'speaker_1': 'And I was informed of the fact that the Amer translates to the soul. And I think that's what we're here to protect today. Over the last 15 years, a lot of things have changed in Denver and a lot of city parts of the city have gotten gentrified and culture has gotten washed away.'",
        "'speaker_1': 'And much of the minority neighborhoods are no longer what they used to be if they're pleasant at all. I spent a lot of times living up by Sloan's Lake, and Sloan's like, used to be very nice and welcoming.'",
        "'speaker_1': 'And unfortunately, over the last five or six years, a lot of that welcoming nature has kind of faded away and been replaced with big concrete jungle. So you just kind of walk down the street and there's concrete to the left and concrete to the right in the ongoing compact.'",
        "'speaker_1': 'That's not the case. We have lots and lots of front porches. You go down the street, people say hello to you, and I think that's worth protecting. That sort of saw that. But with income, parks still has where you can just meet people and everyone is friendly and welcoming.'",
        "'speaker_1': 'You have a combination of small homes and bigger homes, front porches and changing fences, all sorts of new and old windows. And no one wants to just simplify it and scrape it all the way along with the sad history of redlining from the 1960s.'",
        "'speaker_1': 'And. The idea being a food desert for many years where there was no access to good produce and just public access for food that was otherwise completely common. So by. Getting this designation. I think we can keep in mind that there's a very important history to that.'",
        "'speaker_1': 'I'm asking you to support the submission of this today. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Shannon Stage.'",
        "'speaker_8': 'Good evening, council members. My name is Shannon Stage and I am the manager of Grants and Preservation Services at Historic Denver. It feels so good to see and before you today in person on behalf of our organization to show our support for the law, the Lincoln Park Historic Cultural District.'",
        "'speaker_8': 'And we hope council sees the value, merit and effort that has gone into this proposal. We have been working with the law, the Lincoln Park Neighborhood Group, on this project for over four years, ever since some of the folks in this room and online apply to our Action Fund program back in 2016.'",
        "'speaker_8': 'We provided both financial assistance to support, research and inventory work, as well as technical assistance and outreach support. The four, four year long process took time because it was critical to engage both current and former residents in this effort.'",
        "'speaker_8': 'It was important to identify the right approach to honor and protect the deep layers of history in and Lincoln Park from its earliest years through the Chicano movement of the 1960s and seventies. To identify the right approach, volunteers, our organization and the R.A. hosted meetings to collect stories, oral histories and to discuss ideas how to honor the'",
        "'speaker_8': 'neighborhood's heritage. There were eight community meetings where some we had or where we had translators available, some professionally facilitated by Bill de la Cruz. Some dedicated to sharing stories and others with breakout sessions to talk about what people wanted to see for the future of this neighborhood.'",
        "'speaker_8': 'In between meetings, neighbors hosted walking tours, delivered fliers, conducted surveys, and gave updates to the R.A.. All of our communications were also translated. Out of these sessions, the neighborhood group heard, the community wanted to see the homes, spaces and Chicano murals in La alma Lincoln Park honored and preserved in order to avoid the loss of identity or'",
        "'speaker_8': 'lose places that have angered this neighborhood. The sessions also brought forth ideas on the kind of protections that were appropriate for the neighborhood, given its long and diverse history, along with the desire for flexibility in any proposed design guidelines.'",
        "'speaker_8': 'City staff agreed this was warranted for this district. So CPD formed the Custom Design Guideline Working Group in 2019, which was open to anyone in the community. Volunteers delivered an update about the potential designation effort and the opportunity to participate in the Custom Design Guideline Working.'",
        "'speaker_9': 'Group through door to door flowering.'",
        "'speaker_8': 'From August to September of 2019. The working group, led by the city, met a total of four times to develop the specific ideas for the custom design guidelines. Over the course of this effort, I personally have spoken to preservationists across the country about the code, about cultural districts, and how to increase access to preservation tools for communities'",
        "'speaker_8': 'currently underrepresented in local and national preservation programs. From this, I know tonight's proposal is special and will be among the first districts nationally to recognize the Chicano movement and seek to safeguard the cultural and physical environments that contributed to this important history.'",
        "'speaker_8': 'If approved. LAMB Lincoln Park would be the second historic cultural district in Denver, but the first district that honors the Chicano movement. And what better way to honor it?'",
        "'speaker_9': 'But that's all.'",
        "'speaker_0': 'We're going to go ahead and move on to our next speaker, ten year Moti.'",
        "'speaker_3': 'Hi there. I'm Tanya. I'm the associate director at Smooth Theatrical Cultural and Performing Arts Center. I support the La Palma Lincoln Park historic cultural district as an important resource for new residents, for people who have lived in the neighborhood for generations, for the city, and for all of us who care about culture as a source of resistance'",
        "'speaker_3': ', hope and joy. Sioux Theater has a deep stake in the West Side, the heart of the city, the tight.'",
        "'speaker_8': 'Knit community of concerned.'",
        "'speaker_3': 'Neighbors that made sure all youth were well mentored, protected from police brutality and the racism of the outside world. A place where culture and the sweetness of everyday life was celebrated. A place that produced legions of activists, organizers and artists whose legacy stands and continues to evolve in its interaction with each new generation.'",
        "'speaker_3': 'When Suits set up shop in the West Side, we viewed it as an important reclamation of territory. The La alma Lincoln Park Historic Cultural District is also a reclamation of territory and an important engine for preservation, meaning making and even transformation.'",
        "'speaker_3': 'The great civil rights historian Dr. Vincent Harding, taught us that we have yet to achieve democracy, but our dreams of democracy can still be if we want to be a city that represents everyone from every socioeconomic sector, cultural background, sexual orientation and gender identity, then we must know every facet of our history.'",
        "'speaker_3': 'We must invite cultural exchange and dialog. We cannot erase and make invisible the histories and stories of people who have been too long marginalized. We have to see each other. We have to respect each other. La alma Lincoln Park historic cultural district is important not just because it commemorates what was, but because it acknowledges what is.'",
        "'speaker_3': 'Culture lives in people who pass it on in their DNA and through their commitment to carry on memory and tradition. We can start to build a better city tomorrow the type of democracy we would like to be by uplifting all histories, heralding all cultures, and being in genuine relationship with each other.'",
        "'speaker_3': 'Each of us embodies a past, a present, and the future. And each of us deserves access to the life of the city. Thank you.'",
        "'speaker_0': 'Thank you. Next up, we have Kathy Prieto.'",
        "'speaker_6': 'Hello. My name is Kathy Seattle and I live in long my area since 1969 and I love it. I wouldn't change my neighborhood for the world. Change has always come to us. In so many ways. We never had a chance to say we want that change or we don't.'",
        "'speaker_6': 'But I was in a lot of the marches, the movements that were there. The West High School blowout. I was involved and a lot of the homes on in the La Jolla, my area there, their beautiful homes, they've all got history.'",
        "'speaker_6': 'They have something to say. And each one of those homes, we've had beautiful neighbors that have come and gone. And I wouldn't change it for the world. My kids grew up there. My grandkids come over all the time to grandma's house.'",
        "'speaker_6': 'And it's a wonderful place to live. The people are beautiful there and I love the way la my is. And if we can make it a lot better, let's do it. Just take this big Band-Aid off and start putting it together the way it was.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. All right. We're going to go ahead and transition. I believe if I've got we've got things marked here. All right. We have folks in the virtual platform. And so we have Adrian Prieto, Brook Whyte, Arthur Way and Winter Roy Ball.'",
        "'speaker_0': 'And we'll start there. And so we'll go ahead and start out with Adrian Prieto. All right. We're going to see. We don't it doesn't seem like we have Adrian in, so we'll go ahead and move on and come back if we need to.'",
        "'speaker_0': 'Next up, we have Brooke White.'",
        "'speaker_3': 'Hello. Can you guys hear me? Yes. Hi. I'm so my name is White. And, you know, and I was like, I mean, I don't have anyone. My husband and I were unaware that the historical research was being proposed until we have received via April of this year.'",
        "'speaker_3': 'And we were really shocked to learn that they had to find out that everything had already been pushed through. And so we were wondering, you know, over the idea war with this very complex and even thing that somebody had said, I've lived in my house since 2018, I've never known it hasn't might have been in 2019 and'",
        "'speaker_3': 'have been seeing our neighborhood on a Saturday afternoon. We found that about 40% of our neighbors on one street had not been informed of this change prior to 2021. And then that was proceeded with their statement that they had found out about it.'",
        "'speaker_3': 'And I think it's really unfortunate that that's how the process starts because my husband and I would absolutely love to support that. So we look to the neighborhood houses and heroes. This is the way to have support, but we feel like we've been cheated because we weren't aware that this was happening until the application had already been'",
        "'speaker_3': 'pushed through. And I know that it said that people were gone for years, that they did a lot of force, but by us and then the evidence that we found, we were out with people with custody of that.'",
        "'speaker_3': 'And so if this is to get approval, acceptance of what we are asking is that, you know, there's a six month period before those changes that actually go into effect that would allow people within the neighborhood whose houses are going to be directly affected to be able to make any property changes that they would like to know'",
        "'speaker_3': '. Even in a meeting at the end, a few people were calling and say, Hey, what does this mean for us? How is this going to change my life? Or, you know, I don't think that my building should be designated as a structure.'",
        "'speaker_3': 'Look at that. And all those questions are going to be addressed to the neighbors who are going to be living there and that that process will be set, be fulfilled. And a lot of people who are actually going to have to make the changes that they want.'",
        "'speaker_3': 'Thank you so much for your time. And they say thank you.'",
        "'speaker_0': 'Next up, we have Arthur Wei. Okay. It looks like we don't have Arthur with us. Next up, we have Winter Roybal.'",
        "'speaker_8': 'Hi. Can you hear me okay? Yes. Perfect. So, hello, council. My name's Winter. I am speaking today as a constituent of District seven and as a recent graduate of the Historic Preservation Master's program at See You, Denver. I'm urging.'",
        "'speaker_3': 'You to approve Bill.'",
        "'speaker_8': '758 for an ordinance designating all the Lincoln Park Historic.'",
        "'speaker_3': 'Cultural District.'",
        "'speaker_8': 'I believe that this community lot designation effort will provide a benefit to the neighborhood, city and state of Colorado by recognizing the importance of our Chicano history. Denver has experienced exponential growth that has drastically altered the physical and cultural landscape of the city.'",
        "'speaker_8': 'These changes are most evident in the historically marginalized neighborhoods that have been subject to historic redlining, racially motivated development practices, disproportionate demolitions, and the physical and cultural displacement of residents. The city must do more to protect our historic landscapes and promote the diverse stories of our shared history.'",
        "'speaker_8': 'Preservation is often blamed as the cause of gentrification and displacement, but in this instance, the preservation.'",
        "'speaker_3': 'Can be.'",
        "'speaker_8': 'Used as a tool for the stabilization of the community. One of the things that makes this historic district different than others that we've seen is that the long time Chicano residents of long Lincoln Park have been the leading voices working on this project since 2016.'",
        "'speaker_8': 'It is your duty as council to help this community that is often underrepresented in our city's.'",
        "'speaker_3': 'Historic landmarks to preserve their culture.'",
        "'speaker_8': 'As you are aware, Denver is facing an affordable housing crisis as well, and increasing density is crucial to expanding housing in the city. Although the homes in Lincoln Park are primarily single family homes or duplexes, many are occupied by multi-generational families.'",
        "'speaker_8': 'This shared living provides density in a unique way. Additionally, most of the neighborhood's homes have garages that can easily be converted to additional dwelling units, ensuring that the city can achieve its density goals while also stabilizing the existing stock of affordable housing and preventing.'",
        "'speaker_3': 'Gentrification.'",
        "'speaker_8': 'And displacement. While this.'",
        "'speaker_3': 'Council cannot undo.'",
        "'speaker_8': 'Past transgressions, it does have the amazing opportunity to be a national exemplar in its efforts to change the future through an inclusive approach to preservation and development. Very few historic cultural districts exist in the U.S., and yet Denver stands to have two if Laemmle Lincoln Park is approved.'",
        "'speaker_3': 'Along with five points, which has.'",
        "'speaker_8': 'Already been approved. Finally, I would like to close by reminding Council of the city's goals for a more diverse and inclusive future. In the most recent version of Blueprint. Denver, the city decided that by 2040, Denver's neighborhoods should be completely unique and reflective of our diverse history.'",
        "'speaker_8': 'Additionally, the city and county of Denver put out a call for the community to bring forward culturally significant places to better preserve our Chicano and Latino history. This is the time to listen to our long time Chicano residents and preserve their neighborhood.'",
        "'speaker_8': 'A yes.'",
        "'speaker_3': 'Vote for.'",
        "'speaker_8': 'Lincoln Park will be a public display of Council's commitment to this vision and the values that support it. Thank you for your time and consideration.'",
        "'speaker_0': 'Thank you. Our next speaker is Pamela Clifton.'",
        "'speaker_6': 'Okay.'",
        "'speaker_0': 'Am I on here? Yes.'",
        "'speaker_3': 'Okay, great. Good evening. My name is Pamela Clifton and I have lived in the.'",
        "'speaker_2': 'La alma.'",
        "'speaker_3': 'Lincoln Park neighborhood for a little over 20 years. But my connection to not only the neighborhood, but the West Side in general goes back even farther. When I was growing up in the Arvada suburbs in the sixties, my father, who was a teacher, became active in the Carol movement.'",
        "'speaker_3': 'I've vivid memories of him taking my little brother and I to marches and hearing speakers the likes of Cesar Chavez, Betty Benevides and Corky Gonzalez. I remember after one rally, he took me to a restaurant on Santa Fe called Joe's Buffet.'",
        "'speaker_3': 'He told me I was going to take the best Mexican hamburger on the planet. He ordered me an entire portion lathered in green chili. I didn't want to disappoint him because I was so excited about it. But that green chili was so hot.'",
        "'speaker_3': 'I actually got high. I started to hallucinate. I was only in the fourth grade, but from then on I was hooked. And to this day I have that chili sauce on everything. But later on, in 1985, I got a job working at the Buckhorn Exchange and worked there for about six years.'",
        "'speaker_3': 'So in the year 2000, when my father worried that as an artist I might end up homeless, decided he wanted to buy a house. It seemed fitting that he would start looking on the West Side, where he had so many memories and such a love for the culture, which is how I ended up here, and why making'",
        "'speaker_3': 'this sure this neighborhood receives the recognition and the protection it deserves is so important to me. I've lived here for 20 years and it's not only been, it's only been since my neighborhood association got involved with this project that I really became aware of the incredible and important history of this area.'",
        "'speaker_3': 'The murals, which I have always loved and appreciated, but I had no idea of the history and the importance of keeping them reject the notion that the Cheyenne and the Arapaho look on this land at one time.'",
        "'speaker_2': 'I've always walk my dog every.'",
        "'speaker_3': 'Day past that very house that Betty and Margo Benevides lived in. And I had no idea. I don't want other people to live in ignorance the way I have. Everyone in the city should know the importance of this extraordinary neighborhood and the impact it's had on the growth of Denver and all of Colorado.'",
        "'speaker_3': 'This designation would be a step in that direction. Thank you.'",
        "'speaker_0': 'Thank you. All right. We're going to go ahead and transition back in person. I'll call out the next five speakers. We have Sara McCarthy, Erin McMillan, Annie Levinsky, Bob Bassett and Desiree Maestros. And so we'll go ahead and start with Sara McCarthy.'",
        "'speaker_2': 'Good evening. My name's Sara McCarthy. I live in the 300 block of South Clarkson Street, and I'm very honored to be here tonight to support the nomination of Lama Lincoln Park as a historic cultural district for its role in the development of Denver and as a very important ground for Denver's Chicano movement.'",
        "'speaker_2': 'The cultural roots stretch from the 1820s after Mexico gained its independence and established trade routes along the front range. 11th Street and columns align with one of these early routes the trappers trail that originated in Taos and Santa Fe and followed the west side of Cherry Creek to the confluence.'",
        "'speaker_2': 'I conducted the project's early research that involved more than two dozen interviews of West Siders, and I'm sure I missed two dozen more who had their own stories to tell of the 1960s and seventies on the West Side.'",
        "'speaker_2': 'Of course, I talk first to Veronica barela, who was married to Thatcher, infamous as the king of the high boards at the Lincoln Pool. Other West Siders interviewed included current and former city and state elected officials such as Ramona martinez and former state representative Selina Benevides, whose mother in law was a West Sider and Colorado's first Latina'",
        "'speaker_2': 'in the legislature. I had the privilege to interview the artist, sculptor, muralist Emmanuel Martinez, and I learned that there is an enduring West Side connection to the Sand Creek massacre spanning from Governor Hunt in 1865, who lived in Lincoln Park.'",
        "'speaker_2': 'That was his homestead. To a man named Jay O'Leary. Who was one of many who said to me. Once on the west side, always from the west side. When you hear the train whistle tonight, you will experience a tangible reminder of the West Side significance to Denver's history from the 1860s through the 1960s and seventies.'",
        "'speaker_2': 'Please vote yes on this nomination. Thank you.'",
        "'speaker_0': 'Thank you. Next up, we have Aaron McMillan. All right. Aaron McMillan. All right. We'll go ahead and move on. Annie Lewinsky. Good evening, members of Council. I'm Annie Levinsky, executive director of Historic Denver at 1420 Ogden Street. My colleague Shannon R.E. describe the long and in-depth outreach effort that's going on in Llama Lincoln Park.'",
        "'speaker_0': 'I was privileged to take the very first phone calls and attend the very first meetings of the group of volunteers working on this effort. And I can attest to their diligence, dedication and patience and their willingness to move slowly in order to build trust and craft something that is not cookie cutter but respects the history lived experience'",
        "'speaker_0': '. Public Spaces, Art and culture of llama. Lincoln Park Historic Denver invested in this project through our Action Fund, which was intended to catalyze just this kind of grassroots activity and to support creative preservation efforts that reflect the full depth and breadth of our city's history.'",
        "'speaker_0': 'There were meetings, tours, news stories, PowerPoint presentations, door knocking and more. And I was privileged to attend many of.'",
        "'speaker_2': 'Those and learned so much from.'",
        "'speaker_0': 'The residents and former residents of this neighborhood and their inspiring actions to make our city and our state a better place. The custom design guidelines that Cara mentioned earlier on are important to this proposal as well. The guidelines, honor and respect that the attributes that make this neighborhood special are not only those that were established in the'",
        "'speaker_0': '19th century, but also those that came about in the 20th century. The modifications, creative and economical solutions and cultural preferences that add to the story of this place. The guidelines provide the flexibility and affordability. Community members.'",
        "'speaker_2': 'Asked for ensuring that.'",
        "'speaker_0': 'A wide range of materials can be used to renovate and repair the homes in the traditions that have existed here. We appreciate Cbd's willingness to work with the community on these guidelines. I also want to note that this is one of our first or our first cultural historic district proposal that includes public art, like the murals.'",
        "'speaker_0': 'And while it does not protect them in some of the same ways that buildings are protected, it does open them up for important historic preservation, financial incentive programs like grants from the state historical fund and tax credits for repair, as well as protections through other kinds of tools like preservation easements.'",
        "'speaker_0': 'So it is an important first step in ensuring that those pieces can remain a part of our city. I also want to note that while Lincoln Park zoning is compatible with this proposal, as you've already heard, ADA use are commonly constructed in historic districts and that can be the case here as well.'",
        "'speaker_0': 'The zoning in La alma Lincoln Park also allows for duplexes and tandem homes with a front and back unit, making it very possible for existing structures and parcels to accommodate greater density without demolition or loss of cultural fabric.'",
        "'speaker_0': 'The alma Lincoln Park is a complete neighborhood and many of the ways outlined in Blueprint Denver and, you know, including encouraging missing metal housing, supporting the preservation of smaller and a fair and affordable homes, and ensuring that neighborhoods have equal access to design quality tools.'",
        "'speaker_0': 'I want to just close by thanking the neighborhood residents that have dedicated hundreds of hours to this, along with the former residents, the key players in the Chicano movement for whom La alma Lincoln Park will always be home, as well as the staff of partners and institutions like Sue Teatro, the Denver Inner-City Parish News ADD and the'",
        "'speaker_0': 'Chicano Murals of Colorado Project, as well as Ferryhill and Company and Tonya Motel for their research and writing help. Thank you. Thank you. Next up, we have Bob Bassett.'",
        "'speaker_5': 'Thank you. Thank you, counsel. My name is Bob Bassett. I'm currently a Denver resident of District four. I was the chairman of the board of Historic Denver for two terms during which we founded the Action Fund. So it's very satisfying for me to see the results here tonight of that effort.'",
        "'speaker_5': 'I'm also a native of Denver. I grew up on the north side. North high graduate in 1968. Long time ago. But I have a deep appreciation of the cultural importance of the West Side as well as the North Side.'",
        "'speaker_5': 'I've been asked tonight, and it's my pleasure to read a letter that Councilwoman Ramona martinez wrote today and sent to council. I would like to read it into the record. Councilman Martinez says as a person who grew up in Denver and spent a great deal of my youth in Lincoln Park neighborhood, I am compelled to write this'",
        "'speaker_5': 'letter to you today and ask you for your support in designating Alma Lincoln Park as a historic district. Not many residents of Denver know the history of the west side of Denver. I'll editorialize and say, Order the north side.'",
        "'speaker_5': 'But the west side of Denver, when I go way back to the 1940s and as a child it was where I met other Spanish speaking families who came to Denver and settled on the west side of town. Descendants of those early settlers chose to raise their families in this part of Denver.'",
        "'speaker_5': 'Some even still live there and houses that their grandparents purchased or built. She continues. During my time on Denver City Council, there were a few tough choices about historic places. But I believe it is an imperative that we as a city protect the places that matter most to our history of Denver and its cultural heritage.'",
        "'speaker_5': 'Development cycles go up and go down, but it is what we commit to protecting that will remain at the heart of the city. Counsel, thank you very much.'",
        "'speaker_0': 'Thank you. Our next speaker is does Ray Masters?'",
        "'speaker_6': 'Hi. My name is Desiree Masters. Kathy prepares daughters 1015 in the street. My whole life. I for the llama historic society. I think it's great that somebody is finally stepping in to help the people in the community that could really need help instead of trying to push them out of their properties.'",
        "'speaker_6': 'We have people that are standing up for them, you know, trying to get the. Trying to get their situations right and take care of our people. And I appreciate that. So I hope we win this thing.'",
        "'speaker_0': 'All right. Thank you. All right. We're going to go ahead and transition to our virtual folks. And so I'll go ahead and call the five names just so you're ready. So Fatuma here. She's Allison Crabtree, Travis Hill. Andrea Barela and Helen Herron misspeak.'",
        "'speaker_0': 'And so we're going to go ahead and go first to Fatima.'",
        "'speaker_2': 'Hello.'",
        "'speaker_0': 'Yes. Hello?'",
        "'speaker_3': 'Can you hear me? Yes. Okay. I guess you can't see me. That's unfortunate. But my hair today. Let's see. Well, here it is. Start video in the. Here we go. Okay. Hello, everybody.'",
        "'speaker_0': 'There you go.'",
        "'speaker_3': 'Name the team. Richie and I am one of the original applicants for the action fund from historic Denver.'",
        "'speaker_2': 'And.'",
        "'speaker_3': 'But the fund enabled us to have a deep dove into this history, into the history of this neighborhood that we moved to in the early or mid 2000. And as a as the first of two or three people who started this was beyond the project, as you've heard numerous times for four years now, four plus years now'",
        "'speaker_3': '. And during our research and our delving into the history of this area, I was just completely taken aback by all the layers that are part of this community. I think that we are at a unique moment in time.'",
        "'speaker_3': 'And it's a historical moment and a cultural, cultural moment to give a designation to that speaks to like acknowledging the everyday person who often doesn't have a voice in some of these matters. I think authenticity is hard to come by, particularly when there are a lot of pressures around us.'",
        "'speaker_3': 'We heard the young lady talk about, you know, affordable housing. We talked, there was a comment about density. And there are many things around this neighborhood that are sort of driving some of the decisions that might be made by people to replace this authenticity and and sort of substitute sort of community and heritage that we've been hearing'",
        "'speaker_3': 'about. I think that what's interesting for me is that this community is about welcoming.'",
        "'speaker_2': 'It's about.'",
        "'speaker_3': 'Stories. A lot of stories. I'm not an original founder, as Kath Creado is, but I came to this neighborhood with a story. It's an immigrant story. We moved here trying to find people who wanted to be out on their porches and wanted to say hello and wanted to talk to each other.'",
        "'speaker_3': 'And it's at this moment where I met a lady from Chicago who was instrumental in getting, you know, a light fix for the alley so that it would be better lit for the people who walk down it to pick up their kids from school.'",
        "'speaker_3': 'That might be. So I humbly ask that the council recognize that just because it's a modest place does it at.'",
        "'speaker_0': 'The time when you have a lot of stories that are triggered and switch to our next speaker? I'm glad you got your camera working so we could see you. Next up, we have Alison Crabtree.'",
        "'speaker_2': 'Hi. Can you hear me? Yes. Great.'",
        "'speaker_8': 'So, four years ago.'",
        "'speaker_2': 'I was also one of the original applicants for the historic Denver Action Fund. As a resident of this neighborhood and also.'",
        "'speaker_9': 'As the president of the La alma Lincoln Park, R.A..'",
        "'speaker_2': 'And the goal was really to document the historic nature of this area of the neighborhood. And I am here speaking in support of this measure. One of the things that is so striking about this area is its sense of place and identity.'",
        "'speaker_2': 'And this sense of place is really.'",
        "'speaker_9': 'Reinforced in many ways.'",
        "'speaker_2': 'Visually in the distinct architecture, the rhythm of the houses.'",
        "'speaker_9': 'And the.'",
        "'speaker_2': 'Murals, but more experientially, the relationships and strong sense of community which goes back decades. And I feel very honored to have been folded in to that sense of community having only moved in in 2013. The homes represent a key period in Denver's growth as the railroads.'",
        "'speaker_8': 'Were being built and.'",
        "'speaker_2': 'Many workers and immigrants seeking opportunity and a better life. People who had been shut out of other places d boarded at Burnham yards in this neighborhood and stayed on locally to work in the railroads and Denver water to help build out Denver's foundational infrastructure.'",
        "'speaker_2': 'And more recently.'",
        "'speaker_9': 'This area was the center of the.'",
        "'speaker_2': 'Chicano Liberation Movement. This movement occurred at a time that the neighborhood.'",
        "'speaker_9': 'Had already been redlined, and the Chicano and Latin.'",
        "'speaker_8': 'People who lived here had very limited.'",
        "'speaker_2': 'Housing options and options for home ownership. And the residents of our sister neighborhood in our area were also being displaced. This community banded together and created its own social.'",
        "'speaker_9': 'Institutions.'",
        "'speaker_2': 'To support each other at a time when the city and the city.'",
        "'speaker_8': 'Government was not there for.'",
        "'speaker_2': 'Them. And as a result, it really strong sense of community.'",
        "'speaker_9': 'Identity and a bond developed.'",
        "'speaker_2': 'And leaders grew out of.'",
        "'speaker_9': 'That community and and.'",
        "'speaker_8': 'Denver has benefited.'",
        "'speaker_2': 'From that history and they have.'",
        "'speaker_3': 'Had a significant impact on Denver's history.'",
        "'speaker_2': 'These are achievements that Denver claims among those.'",
        "'speaker_3': 'That the.'",
        "'speaker_9': 'City is proud of. And throughout this process, and with the help of historic Denver.'",
        "'speaker_2': 'We have documented the history.'",
        "'speaker_8': 'Of the area lead history.'",
        "'speaker_2': 'History Walks.'",
        "'speaker_3': 'Hosted many.'",
        "'speaker_8': 'Community meetings and given this history and.'",
        "'speaker_2': 'Info back to the community and ask how they would like.'",
        "'speaker_8': 'To proceed with it.'",
        "'speaker_2': 'And the response has.'",
        "'speaker_8': 'Been what we've bring to you today.'",
        "'speaker_2': 'And I hope and I ask that you.'",
        "'speaker_9': 'Honor this legacy with the historic.'",
        "'speaker_3': 'Cultural designation. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Travis Hill.'",
        "'speaker_5': 'Good evening. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_5': 'All right. Good evening. Council members, friends, neighbors and allies. I have relatively few comments that would not just.'",
        "'speaker_1': 'Be echoing and mirroring.'",
        "'speaker_5': 'Many of the things that have already been stated by others in support of this designation. I'll just say for my part, but by the way, Travis Hill, I note a 1219 look at the street, which is within the proposed designated area.'",
        "'speaker_5': 'I've lived in the neighborhood for about five years now after.'",
        "'speaker_1': 'Effectively kind of being crowded out of my neighborhood in West.'",
        "'speaker_5': 'Colfax by aggressive development and infill projects that made the neighborhood rather unappealing. I was lucky enough to land here in my Lincoln Park and find a home that is not only comfortable but due to a visual disability functional for me where I can walk to what I need, I can get around the neighborhood easily and safely.'",
        "'speaker_5': 'In addition to getting to meet great neighbors and the aforementioned, you know, front porch culture and just getting to know people that have been here for a few years like myself or for generations again, I don't have a whole lot more to state.'",
        "'speaker_5': 'Other than that, I feel this designation would be a very positive thing for the neighborhood, and I respectfully encourage the council to please support this designation. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Andrea barela.'",
        "'speaker_2': 'Hello? Can you hear me? Yes. All right.'",
        "'speaker_8': 'My name is Andrea Barela.'",
        "'speaker_3': 'I'm the executive director of New Community Development Corporation. I serve on the board of the Art District Office on Santa Fe. I'm the board president for.'",
        "'speaker_8': 'The Santa.'",
        "'speaker_3': 'Fe Business Improvement District, and I'm a very proud board member of the Denver Inner City Parish. All of these organizations, our llama, Lincoln Park.'",
        "'speaker_9': 'Neighborhood.'",
        "'speaker_3': 'Nonprofit organizations. Just a big thank you to historic Denver for all their hard work and to all those who contributed to this historic effort.'",
        "'speaker_8': 'As the director of a lot of.'",
        "'speaker_3': 'Lincoln Park organizations whose sole.'",
        "'speaker_9': 'Purpose is to create sustainable families and.'",
        "'speaker_3': 'Communities, we see this project as unified with new sets core organizational values.'",
        "'speaker_2': 'On a personal note, I.'",
        "'speaker_3': 'Would very much like to see the neighborhood that my mom and dad grew up when I grew up in, preserved in its original and beautiful form. I would like to.'",
        "'speaker_2': 'See the neighborhood where I met my.'",
        "'speaker_3': 'Husband preserved for our grandchildren to see. I would very much not like.'",
        "'speaker_9': 'To see the displacement.'",
        "'speaker_2': 'Of our history and culture.'",
        "'speaker_3': 'Much like we have.'",
        "'speaker_8': 'Seen.'",
        "'speaker_9': 'And are still seeing in North.'",
        "'speaker_3': 'Denver and other historically.'",
        "'speaker_9': 'Significant parts of Denver. My hope is that this effort is successful and that it could be expanded to other parts of the neighborhood.'",
        "'speaker_8': 'Including to my grandma and grandpa.'",
        "'speaker_3': 'Beautiful white stucco house in the 1400.'",
        "'speaker_9': 'Block of Penn. In the words of my mother, who regrettably could not.'",
        "'speaker_8': 'Be here in attendance tonight. Long Lincoln.'",
        "'speaker_2': 'Park is rich with history.'",
        "'speaker_8': 'And culture, and every effort should be made.'",
        "'speaker_3': 'To.'",
        "'speaker_9': 'Preserve its character.'",
        "'speaker_3': 'Preserving cultural space is.'",
        "'speaker_8': 'More than a movement. It is creating.'",
        "'speaker_2': 'Opportunity for housing, business growth and services.'",
        "'speaker_3': 'That create a.'",
        "'speaker_8': 'Stable community.'",
        "'speaker_3': 'A historical cultural district.'",
        "'speaker_9': 'Will help the preservation of WAMU, Lincoln Park homes in Latino.'",
        "'speaker_3': 'Culture. I encourage all of you to vote yes. Thank you.'",
        "'speaker_0': 'Thank you. All right. We've got one speaker left on our virtual platform, and I'll go ahead and call our next three in person so we can go ahead and get you to come up to the front pew. Matt Meldrum, Emmanuel Martinez and Lucia Luna.'",
        "'speaker_0': 'But first, we'll go ahead and go to Helen Herron music on the virtual platform. Go ahead, please. Helen.'",
        "'speaker_8': 'Okay. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_9': 'Okay.'",
        "'speaker_3': 'My name.'",
        "'speaker_8': 'Is Helen.'",
        "'speaker_9': 'Joan.'",
        "'speaker_3': 'I am a Denver resident and also the president of La Alma Neighborhood Association in LA.'",
        "'speaker_9': 'My alma is the soul.'",
        "'speaker_2': 'And it has deep spiritual meaning.'",
        "'speaker_3': 'For me.'",
        "'speaker_8': 'Not only.'",
        "'speaker_9': 'Is La Alma.'",
        "'speaker_3': 'The soul of the neighborhood.'",
        "'speaker_9': 'But it was the soul of.'",
        "'speaker_3': 'The Chicano and Chicano movement of the sixties and seventies and the struggle for civil rights. I was there during these exciting times, and I'm proud to say today and talk about my participation in this.'",
        "'speaker_8': 'These historic.'",
        "'speaker_3': 'Moments bringing about equality for the Chicano and Chicanos in education in which they have today. There are a couple of members of city council who remember these times.'",
        "'speaker_2': 'Also either because of their.'",
        "'speaker_3': 'Participation or the participation of their parents. Designating light hearted might as a historical and cultural district will.'",
        "'speaker_2': 'Cement this.'",
        "'speaker_3': 'History.'",
        "'speaker_8': 'In the pages of.'",
        "'speaker_3': 'Denver, along with the other indigenous history, such as the Northern Cheyenne and the Arapaho.'",
        "'speaker_2': 'I urge the City Council to approve this.'",
        "'speaker_3': 'Proposal to designate La Alma as an historical and cultural district honoring the thousands and I mean thousands because I was there of young people who sacrificed so much to bring about justice and equality in education so many years ago.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Matt Meldrum. And after him, we have Emmanuel Martinez and Luca Luna. Go ahead, please.'",
        "'speaker_1': 'Hi, Council. Good evening. My name is Matt Meldrum and I'm a resident at 13th and Le Pen in the designated area. I'm speaking in support of the Historical District designation as a resident.'",
        "'speaker_5': 'Property owner and real estate professional.'",
        "'speaker_1': 'My partner Ashley and I have only lived in the neighborhood for three.'",
        "'speaker_5': 'Months, but we moved to this neighborhood and love this neighborhood because.'",
        "'speaker_10': 'It's one of Denver's.'",
        "'speaker_1': 'Oldest residential neighborhoods rich in history. Culture, architecture.'",
        "'speaker_5': 'Arts and much more. Having lived in several other.'",
        "'speaker_1': 'Neighborhoods across Denver, I've seen how quickly.'",
        "'speaker_5': 'Neighborhoods can lose their.'",
        "'speaker_1': 'Charm, character and historical sense of community. This this proposal will protect and honor this neighborhood's rich history, architecture and soul. Which is why I'm in support of the historical cultural district designation. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Emmanuel Martinez.'",
        "'speaker_5': 'Thank you. I'm a former resident of the Lama Park neighborhood. My wife, Soledad, who is also an activist and and my two daughters at the time lived in the housing projects at 13th and Navajo from 1969 to 1972.'",
        "'speaker_5': 'During this time, I became a community activist and muralist. I was president of the Lincoln Park Tenant Council, member on the West Side Action Council and on the West Side in the West Side Coalition. I was also a lifeguard at the Lincoln Park School and I found a llama recreation center and served as its first director.'",
        "'speaker_5': 'In 1971 with community volunteers, we painted the first Colorado community murals on a swimming pool. Bathhouses. And the First Loma Recreation Center. Later in 1978, we volunteered to paint the existing mural at the new recreation center. Law firm of Lincoln Park is not only one of Denver's oldest residential neighborhoods.'",
        "'speaker_5': 'It is the center of how a community came together and took over the park to include community residents to work for Parks and Recreation. The actions we made at home set the example for other parks in Denver to follow, like La Raza in the North Side.'",
        "'speaker_5': 'Mestizo Curtis Park on the east side. Longmont neighborhood embodies Denver's history of civil rights and was the heart of the Chicano movement of the 1960s and 1970s. For example, the 1969 West High School walkout was inspired by this movement because of my past experiences.'",
        "'speaker_5': 'I have a very special place in my heart for this neighborhood. So for the last few years, I have been working as an artist with other community members on this project to document the neighborhood's history and buildings. We want to protect and honor the unique historic context and cultural heritage of the neighborhood from its beginning in the'",
        "'speaker_5': '1870s to its role in fostering Denver's Chicano movement. I was very involved in the police confrontation riots that took place in the Lama neighborhood and was arrested at the West High walk out. I support the project team that has worked so hard to develop the current proposal to create the Lama Lincoln Park Historical Cultural District.'",
        "'speaker_5': 'This designation will include flexible design guidelines to protect the things that make the neighborhood unique with historical significance. This will also send a strong message to the local and national Chicano community, especially to those of us who sacrificed a lot to give the neighborhood pride, dignity and a sense of brotherhood.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Lucha Luna.'",
        "'speaker_3': 'I thank you. So I'm director of the Chicano Murals of.'",
        "'speaker_0': 'Colorado Project and.'",
        "'speaker_3': 'Also associate.'",
        "'speaker_0': 'Curator of Latino.'",
        "'speaker_3': 'Heritage at History, Colorado. I'm going to repeat a little bit of what my father just said, but I felt I should tell you a little story.'",
        "'speaker_0': 'A little.'",
        "'speaker_3': 'My father and then a man led Martinez and my mother, Soledad, three, whom met.'",
        "'speaker_0': 'During the early.'",
        "'speaker_3': 'Years of El Movimiento. They traveled to California in 1966 to support Dolores Huerta and Cesar Chavez, participated in the L.A. High School walkouts, where my mother was.'",
        "'speaker_0': 'Brutally beaten.'",
        "'speaker_3': 'Over the head with a baton by a policeman. My parents made many sacrifices.'",
        "'speaker_0': 'To fight for a cause. They truly.'",
        "'speaker_3': 'Believed in social.'",
        "'speaker_0': 'Justice and equality.'",
        "'speaker_3': 'They were exposed to many dangers supporting the land rights movement in New Mexico. Supporting the movement in Denver as well. My father created art to support all three movements, but longed to paint murals that told and.'",
        "'speaker_2': 'Describe.'",
        "'speaker_0': 'The story of our rich heritage.'",
        "'speaker_2': 'Of the.'",
        "'speaker_3': 'Hispano, Chicano and Mexicans.'",
        "'speaker_0': 'That lived.'",
        "'speaker_3': 'In Colorado and were.'",
        "'speaker_0': 'Absent from all historical textbooks in the DPS.'",
        "'speaker_3': 'Curriculum. In 1969, my parents moved into.'",
        "'speaker_0': 'The Lincoln Housing.'",
        "'speaker_3': 'Projects and quickly began an arts youth program that my father.'",
        "'speaker_0': 'Mentioned earlier.'",
        "'speaker_3': 'In.'",
        "'speaker_0': 'Where we lived.'",
        "'speaker_3': 'In the Lincoln Housing Projects. My parents began with painting.'",
        "'speaker_0': 'The facade of the.'",
        "'speaker_2': 'Housing projects.'",
        "'speaker_3': 'And obviously the city was not very happy with that, but they.'",
        "'speaker_0': 'Were very determined to paint these murals. They later.'",
        "'speaker_2': 'Started.'",
        "'speaker_3': 'An arts and crafts program that my father mentioned, and.'",
        "'speaker_0': 'With youth.'",
        "'speaker_3': 'They built and they painted these first.'",
        "'speaker_0': 'Murals.'",
        "'speaker_3': 'And began the mural movement. Today, there is a supposed mural movement going on that.'",
        "'speaker_0': 'Fails to acknowledge this history. And we are also experiencing.'",
        "'speaker_3': 'In one of the cultural historic.'",
        "'speaker_0': 'Districts.'",
        "'speaker_3': 'Five points, the art washing that is currently happening. And I really hope that if this passes that it is not considered a.'",
        "'speaker_0': 'Target for.'",
        "'speaker_3': 'Lawma. We need to be responsible. We need to protect.'",
        "'speaker_0': 'Our murals.'",
        "'speaker_3': 'And our visual heritage. But we cannot.'",
        "'speaker_2': 'Allow.'",
        "'speaker_3': 'This to happen like it did in five points.'",
        "'speaker_0': 'Thank you. Thank you. All right. We're going to go ahead and transition. I believe the rest of our speakers are on the virtual platform. Next up is Christine Spargo.'",
        "'speaker_2': 'Hi.'",
        "'speaker_9': 'Hello.'",
        "'speaker_0': 'Hi. Go ahead.'",
        "'speaker_9': 'Hi. My name is Christine. All right. Christine Sprague and I am a resident at 1165 Lappin Street. So I'm house in the designated area. I'm currently serving as the president of the Lincoln Park Neighborhood Association, which acquired the grant back in 2016.'",
        "'speaker_9': 'And I am here in support of the. Historic cultural designation just in the time I've been involved with the association the entire time, but not in the.'",
        "'speaker_5': 'Actual cultural.'",
        "'speaker_9': 'District process. But just in going back on my notes, I counted over 15 in-person meetings. For the community that were held, as well as numerous door knocking and firing opportunities that happened. So I think there's been a lot of opportunity for lots of great feedback and I appreciate the council considering this.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, we have Anthony Garcia.'",
        "'speaker_5': 'Hello.'",
        "'speaker_9': 'Recording in Progress.'",
        "'speaker_1': 'Performing Arts Center on seventh in Santa Fe. I was born in the what is called the agrarian neighborhood on seventh and Tampa, but I lived also at 1111, Santa Fe and on 10th and Kalamazoo as well. I lived in a Denver that was incredibly segregated, north and south somewhat.'",
        "'speaker_1': 'I remember when I was a kid working out, walking down on first and and Broadway and some kids pulled up, white kids pulled up in a pickup truck and they yelled at me to go back to where I came from, which kind of stumped me because I thought they meant the West Side, because that's the world I'",
        "'speaker_1': 'knew. That West Side neighborhood that we lived in was actually a place where there was some elements of protection that existed there for us in a very in a racist world. The the neighborhood by the time I got to the seventies, as I was growing up, the the the arts, the cultural movement began to grow should they'",
        "'speaker_1': 'outgrow, which I'm a part of. We had one of our first spaces was at the Denver inner city parish. And Manuel Martinez, as you heard, he's very modest. He doesn't mention that he studied with the great David Siqueiros, one of the great three great muralists of Mexico, bringing that tradition from its origin point to to Denver.'",
        "'speaker_1': 'Now we talk, as Lucia was saying, we talk about the great muralist movement here in Colorado, in Denver, and we forget that it actually began in in Denver and it began in Lincoln Park, La Mullica Park. One of these days, we're going to walk by that mural in Longmont, and we're going to say that mural is Emmanuel'",
        "'speaker_1': 'Martinez. That should be a landmark for our city. I think we have a way. We forget sometimes how important we are in that national movement, that the West type blowouts was not only significant by what it changed here, but it's about how it influenced the national dialog taking place among Chicanos.'",
        "'speaker_1': 'It was where it began. A spirited stand was developed in order to influence all these other people. So I would offer that this is really a story about community culture and social justice and how those come together. But also it's about a question of place who belongs here and who doesn't.'",
        "'speaker_1': 'When those murals went up, when the theater performed in the parks, it was a conversation that said We actually belong. This is a ratification of that concept. The video.'",
        "'speaker_0': 'All right. I think we might have lost Tony and. Oh, there we go. We've got you, Tony. Sorry about that. I think we had something in our. Channel eight that interrupted you. So I'm sorry. Go ahead and finish your comments, please, sir.'",
        "'speaker_0': 'Can you hear us? Tony. All right. I think we've maybe lost the audio feed for Mr. Garcia, unless. Tony, can you hear us? Okay. We'll go ahead and move to our next speaker and see if we can figure out the audio issue that we're having here.'",
        "'speaker_0': 'But thank you, Mr. Garcia, for your comments. Our next speaker. We're going to go ahead and try to shift to our next speaker, Jessie Parris. All right. I'm not quite sure we're going to try. We're going to get our.'",
        "'speaker_0': 'Okay. It's saying that the Zoom feed has been denied for some reason, but I think we've got our next speaker up here, so we'll go ahead and try to continue on here. So go ahead, Jesse. We've got Jesse Paris up next.'",
        "'speaker_0': 'Go ahead, please. And I know we've I believe we have you unmuted on our side, but we're going to go ahead and just take a quick second. Just hang on for a second, Jesse. We're having a. Oh, there we go.'",
        "'speaker_0': 'Uh huh. Go ahead.'",
        "'speaker_9': 'Just recording in progress.'",
        "'speaker_1': 'I'm represented for Flextronics to move for self defense. Positive action can move for social change as well as the Unity Party of Colorado. Front line Black knows and I will be the next mayor of Denver in 2023. I am in favor of the preservation of Lincoln la la la llama Lincoln Park.'",
        "'speaker_1': 'So my I am a West High graduate. I graduated from West High in 2005 with two diplomas, one from West High and one from the Denver Center International Center for International Studies. And yeah, I am very familiar with the history and the culture of the West Side of Denver, so I am definitely in favor of this.'",
        "'speaker_1': 'Please pass this tonight. This is a long time coming. The only thing I'm concerned about is the fact that. This being a cultural district. The second after five points, which is the first culturally black district in Denver. This will be the first culturally Hispanic or Latino district in Denver.'",
        "'speaker_1': 'The essence of the significance of this would be more rapid gentrification of the area. Five Points is not. Affordable anymore. They're rapidly gentrified out of it. So though it has a cultural significance of historical significance and designation. It does not mean that the neighborhood, the people that made the neighborhood what it is, can still afford to live'",
        "'speaker_1': 'there. So I would hate to see that happen one week apart in the surrounding area of Lincoln, part of the neighborhood of Lincoln Park. But. That aside, I am in favor of this rezoning for my preservation tonight. Please pass this.'",
        "'speaker_1': 'This is a long time coming, as heard from the numerous speakers tonight. This will be the first of its kind in Denver or the second of its kind in Denver of this sort. So please pass this. The first vocal minority of people of color communities in Denver.'",
        "'speaker_9': 'Recording in progress.'",
        "'speaker_1': 'Fact in history from the history books it needs to be incorporated. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Laura Gomez. All right. It doesn't look like we have Laura there. We're going to go ahead and go to our next speaker, Alexis Prieto. All right. Our next speaker, we don't seem to have Alexis, Aaron or Leo.'",
        "'speaker_0': 'Okay. It seems like we lost some of our virtual participants. We'll go ahead and go a layup, though. Zachary Lovato. No. Okay. Elvia a regular. All right. Our next speaker is Tess Storti.'",
        "'speaker_8': 'I thank you, counsel. And I just want to acknowledge that we are on these stolen occupied land of the Arapaho, Ute and Cheyenne and and that we still see the the history of colonization and and extraction capitalism going on in this city today.'",
        "'speaker_8': 'And I just want to thank all of the organizers and everyone who worked on this. It's a really historic moment. And and it's really beautiful to see in the city that has not historically represented this type of preservation or action for people of the global majority.'",
        "'speaker_8': 'And so. I. I just am I really I was I've just been thinking about what some of what the other speakers said. The the comments about, you know, who belongs and who is allowed to to hold on to the ties to the land and to the houses that their that their ancestors lived in and helped create in'",
        "'speaker_8': 'this city. Because we, you know, before long the Lincoln Park. Well, not before, but, you know, alongside the area neighborhood, the oldest neighborhood in Denver existed and through a through federal tax dollars and a bond that Denver voters voted on, that money was used to displace people and build the and build the college campus.'",
        "'speaker_8': 'And there's a lot of that history that feels very feels very relevant today and looks like it may be repeating itself. So I just encourage us to think about. Making more decisions like this that don't require a historic preservation or five years of plus years of organizing, or that this be the norm, that this become the standard'",
        "'speaker_8': 'that is used rather than the exception, because that's what we need in the city. And that's what we would like. And. And it doesn't feel like this is the norm at all. So, you know, it shouldn't take this for people to be able to remain in the spaces that they have helped create in the city.'",
        "'speaker_8': 'So thank you. Thank you. Please pass this.'",
        "'speaker_0': 'In our last speaker this evening is Rosemary Rodriguez. And it doesn't look like we have her in the Zoom platform either. So that is going to conclude our speakers this evening. Questions from members of Council on Council Bill 758 Council Member Sawyer.'",
        "'speaker_0': 'Oh, you know what? I know this is in Councilwoman.'",
        "'speaker_9': 'Torres's district, so if she would like to go first, she's welcome.'",
        "'speaker_0': 'To. All right, we usually do that for commerce, but we can go ahead and do that on questions as well. Go ahead, Councilor Pro-Tem. Thank you so much. Thank you, Councilman Slater. One, if Tony Garcia is still in the zoom, I wanted to see if we could give him an opportunity to finish his comments.'",
        "'speaker_0': 'No. He's gone. Okay. Thank you so much. I do have a couple questions. Both probably for Karen, as well as any Levinsky. And I think we've heard quite a bit and some very specific numbers around outreach that was done.'",
        "'speaker_0': 'So I think my questions were answered throughout the process on what took place there. I am curious, Kara, if you can provide some insight on the custom design guidelines specifically because we got questions over email. How does it provide flexibility?'",
        "'speaker_0': 'That's been mentioned a couple of times. And affordability.'",
        "'speaker_3': 'Yes. So the customized design guidelines are currently in draft form when Preservation Commission couldn't prove or adopt design guidelines for a district that was not in existence. So if this is approved tonight, it will go to the Landmark Preservation Commission tomorrow at their meeting for a discussion item.'",
        "'speaker_3': 'What the customized design guidelines currently in draft form provide flexibility on primarily materials and on fencing, which are two of the things that we found through work with the community, that these are things that are part of the character of Alma Lincoln Park because the proposed historic districts period of significance or the time period that it's important'",
        "'speaker_3': 'goes into the 1980s. Materials like vinyl siding and vinyl windows, premise stone, those are all things that are part of the historic character of the district as we have walked the neighborhood. We would guesstimate about 80 to 90% of the windows have been replaced with things like vinyl windows.'",
        "'speaker_3': 'So it's a lot of flexibility with the types of materials that could be used if they were wanting to make changes. So that's primarily where the flexibility lies as currently drafted.'",
        "'speaker_0': 'Okay. So there's. So the flexibility is what provides for some of the affordability because you have more options to choose from.'",
        "'speaker_3': 'Yes. Yes. Yes. So it does so so that you don't have to go back and replace vinyl windows with wood windows, which would be a more costly thing. So the flexibility provides a lot more affordability in terms of materials that can be used on both contributing or non contributing houses.'",
        "'speaker_3': 'Great.'",
        "'speaker_0': 'Okay. The next question I have is about the impact of designation on property values. Either what you've seen take place in other districts, whether they're and I know property values throughout Denver have just exponentially increased. So if it's hard to tell, I think that's telling as well.'",
        "'speaker_0': 'But I'm interested in what you've seen with other designations.'",
        "'speaker_3': 'So there's been studies on both a nationwide level and on the state of Colorado about historic districts. And they've studied three different districts within Denver, and they basically have found that the property values in historic districts are slightly above the property values of those surrounding it, but very slightly so.'",
        "'speaker_3': 'It's pretty much a stabilizing influence, however, in today's market. The studies have not really looked at something like this that has this amount of exponential growth and rising costs.'",
        "'speaker_0': 'Okay. Um, and then my last question might be actually for Annie. If you can describe a little bit about what kinds of funds owners can tap into if they're if they live in a historically designated area that they could in before.'",
        "'speaker_0': 'Sure, yeah. The primary financial program for residential owners is the state preservation tax credit. So it's a state level credit. It can cover 20 to 25% of qualified rehabilitation costs. So the kinds of things you need to keep the building.'",
        "'speaker_2': 'In good condition roofs.'",
        "'speaker_0': 'Foundations, windows, heating and cooling systems, you know, the basic things that you need in the house can can be eligible for that credit and owners can spread it over ten years. So if they have a relatively small tax credit or tax burden, it's something they can spread over a longer period of time in order to take advantage'",
        "'speaker_0': '. There are other programs that are not tied specifically to the designation, like Debra's Home Homeowner Program, which we did share with owners as we were working on this project to make sure that people knew there were a variety of tools.'",
        "'speaker_0': 'There are also state historical fund grants. The grants are typically best for nonprofit owners, so some of the institutions in the district like Denver A.C Parrish, would certainly be competitive for those single family homes. Less likely, although if it's a highly significant home, there is always a potential for those grants as well.'",
        "'speaker_0': 'They're just a competitive program. Great. Thank you. Those are all my questions. Thank you. All right. Thank you, counsel pro tem Torres. All right. We're back up to Councilmember Sawyer. Go ahead, please.'",
        "'speaker_9': 'Thanks, Madam President. Just had a question for I guess probably this is for Annie around the arts. So we heard a lot of testimony this evening about the murals and how incredibly important they are to the character of the neighborhood.'",
        "'speaker_9': 'But it doesn't.'",
        "'speaker_0': 'Seem.'",
        "'speaker_9': 'Clear that they will be maintained. So how does how does that work? Can you just.'",
        "'speaker_0': 'Tell me a little bit more about that? Sure. I'll do my best. And certainly you could speak with Luca as well, because we've been working with Lucia on project, on efforts around murals in general. So the the I guess the the catch is that in historic districts, in order for something to be designed, reviewed, it has to'",
        "'speaker_0': 'require a permit. And painting doesn't require a permit.'",
        "'speaker_3': 'So there's no sort.'",
        "'speaker_0': 'Of nexus at the city permitting level to review that. But the designation does make the murals eligible for other programs just by virtue of being on contributing buildings in the district. So I mentioned the grant program, so restoration and repair of the murals would be eligible also by becoming contributing buildings in a district.'",
        "'speaker_0': 'Private preservation easements could be put on the buildings now, probably not on the public rec center, but potentially on the on the private properties, working with the owners to put in more intensive protections. And then we're working with Lucia's organization on other ways that we can enhance the protections for murals citywide, not just in this area.'",
        "'speaker_0': 'So it's an evolving conversation, but this is a first step.'",
        "'speaker_3': 'Got it. Okay. Thanks. Thanks so much, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sophia. Next up, we have Councilmember Flynn.'",
        "'speaker_7': 'Thank you, Madam President. I care. I have a couple questions I just need some clarification on because some of the. Material is gives us sort of a different type of district than more traditionally, especially in the use of nonstandard materials and their allowance.'",
        "'speaker_7': 'And so I just want make sure that I understand and that the property owners understand also. So with the houses that have not yet. Had any alterations of any significance from their original state be permitted to use some of the nonstandard materials if they needed to upgrade, say, original windows, would they be permitted to use vinyl windows'",
        "'speaker_7': 'in? I just want to be really clear on this that I understand it.'",
        "'speaker_3': 'Right? So what we discussed with a lot of the community members in the working group was that the importance of things like Windows and Doors was that the proportions stayed the same. So you didn't enlarge the windows, you didn't enlarge the doors, but that the materials weren't particularly important.'",
        "'speaker_3': 'And so that that that's what's currently drafted in the design guidelines. It does, however, call out a few character defining windows that are there are few like leaded glass windows on the front facade. So it's on really readily visible facades, which would be the front or perhaps a little bit corner on the side for those.'",
        "'speaker_3': 'But the currently as drafted, the design guidelines call for the retention of the the size and the proportion of the window, but not necessarily the materials.'",
        "'speaker_7': 'Okay. Would they, for instance, would a replacement window work to be vinyl? Would it have to resemble the original window or could it be, you know, double hung, that sort of thing?'",
        "'speaker_3': 'It currently calls for it to be of a historic operation. So if it was a slider, it could be a slider. If it was a double hung, it should cost for it to be a double home.'",
        "'speaker_7': 'Is there some concern? Is there an added consideration here? If we were to not permit, for instance, windows that could not be operated, if they were if replacement Windows had the same operation as the original, might not be operable, say, by a person who could not stand up or was in a wheelchair.'",
        "'speaker_7': 'Would there be accommodation for that?'",
        "'speaker_3': 'There could be an accommodation. I actually am looking at my manager who does more design review than I do. And so if you can allow Jennifer Capello to answer that question, she might be a little bit better to answer how that would be.'",
        "'speaker_7': 'Thank you. Hi, Jennifer. The reason I ask is because I know that this was a consideration in the in one of the restorations in my district.'",
        "'speaker_3': 'Okay. Good evening.'",
        "'speaker_0': 'I'm Jen Capello. I'm Landmark Preservation Staff Manager.'",
        "'speaker_2': 'So to answer the question.'",
        "'speaker_3': 'Is there accommodation for accessibility? Is that okay? We work closely.'",
        "'speaker_0': 'With the building department on whatever their requirements are. And so our.'",
        "'speaker_3': 'Requirements.'",
        "'speaker_0': 'Typically don't override accessibility requirements, but we try to work on.'",
        "'speaker_3': 'Some common ground so that there can be we.'",
        "'speaker_0': 'Can achieve compliance with the code as well as compliance with preservation.'",
        "'speaker_3': 'Requirements.'",
        "'speaker_7': 'Okay. Flex flexible.'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'Okay. Kara, thank you. And I'm very happy to hear that. By the way, I think this is this is maybe a little a hole in the hole in the wall that might lead to a little more flexibility elsewhere.'",
        "'speaker_7': 'Does including the park itself in the district convey any review powers to landmarks, staff over the Parks Department or the Parks Department to want to do some additional work in the park? I know that we have some districts that include parks like, I believe, Alamo Placid.'",
        "'speaker_7': 'The park is included in that historic district, but I don't think there are any habitable structures there here. We do have one. So is there was there discussion with parks about any potential conflicts or how to resolve those things?'",
        "'speaker_3': 'Yeah. So there was discussion with parks and within the design guidelines, there's intent linkage at the front of these customized design guidelines with the intent that the continued use of the park is paramount and that it's called out within the designation that there are a few contributing buildings or structures.'",
        "'speaker_3': 'So the rec center, there's an amphitheater, an a still a stone wall, and then what was historically known as the neighborhood house. So those are called out as contributing structures. And so if parks would pull a zoning R building permit, that would go through landmark review.'",
        "'speaker_3': 'However, as it's zoned as. OSA. I believe there are not particularly there aren't a lot of zoning permits that are pulled under that zoned district. So Landmark would have review if they made changes to the rec center. But it's really clearly called out in the intent language.'",
        "'speaker_3': 'That landmark is not going to review vegetation. It's not something we have purview over. We wanted to specifically call it out and that it is important that it retains its use as the nature of a park. And that landmark does not want to review changes to their walkways or changes to, if they want to put some change'",
        "'speaker_3': ', a baseball field to a basketball field. That's not something that we want to be reviewing.'",
        "'speaker_7': 'Okay. Oh, thank you for that. By the way, I've always been intrigued by that. Stonewall talked about the one on Osage. Correct. On the west side of the park.'",
        "'speaker_5': 'Is that and.'",
        "'speaker_7': 'How old is that? We know the providence of that structure.'",
        "'speaker_3': 'I believe it's the 1930s I. It could be related to, you know, a key project or some site of sort of public works. But I believe it dates to a 1930s. Okay.'",
        "'speaker_7': 'Last question to you. Zoning, would the designation of this as a landmark district have any significant impact or design restrictions or on the potential for a property owner to add on or. I know there was Annie. I believe you talked about a tandem house, for instance, that sort of thing.'",
        "'speaker_7': 'Could you talk a little more about what you see is the impact on developing a single unit lot under the to use zoning as as a twin unit or a two unit, rather.'",
        "'speaker_3': 'Yes. So Landmark is supportive of things like to use in tandem houses that provide density to a historic district. It would follow the design guidelines for infill construction, which is not something that's really proposed. There aren't many changes proposed in that for the draft design guidelines, but Landmark would be supportive of take them house or EDU, something'",
        "'speaker_3': 'like that. That would provide additional density if the primary structure is a contributing structure. It is unlikely that it would be allowed for demolition. It would go to the Landmark Preservation Commission for their review and they very, very rarely approve contributing buildings for demolition.'",
        "'speaker_3': 'But if they wanted to add a tandem house at the rear, that would be something that would be supported by landmark staff.'",
        "'speaker_7': 'Right. Certainly not talking about any demolition, but about the potential for within the rules to add on, say, in the rear. And I'm supposing that staff has looked at all of the the setbacks and what percentage and how far back in the lot on a historic designated parcel can be built, etc..'",
        "'speaker_7': 'And we're satisfied that tandem house, for example, could be a building for them.'",
        "'speaker_3': 'I mean, that would probably be more zoning in terms of like where it could be placed in the landmark.'",
        "'speaker_7': 'All right. Thank you very much. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilmember Flynn. And seeing no other speakers in the queue. The public hearing is closed. Comments by members of Council on Council Bill 758 Council Pro Tem Tours. Thank you, Madam President. I want to express such sincere thanks to all of the public speakers tonight and the residents and organizations who have worked this effort'",
        "'speaker_0': 'through for for nearly five years. All anyone had to do was connect with the R.A., with the local organizations, to know that this has been a priority and it's been discussed consistently over that entire time. Historic designation is our human attempt to ensure our roots are forgotten, erased, built over.'",
        "'speaker_0': 'And every day in Denver, I see our city disappearing. Our roots are in events, they're in buildings, they're in people and arts and murals. All of these are at play in this proposed district. It is a deeply emotional designation and one that I think we all take really seriously.'",
        "'speaker_0': 'The addition of culture to our landmark criteria opened the door for some long overdue acknowledgment in this case of the birth and impact of Chicano history in Denver. Our effort is supported by multiple neighborhood associations and residents who collaborated and hosted walking tours and community meetings for over five years to shape and support this proposal.'",
        "'speaker_0': 'We are long overdue for this recognition of llama Lincoln Park. We will collectively, as an entire city, miss these homes if they are raised. I would like to actually see the boundaries expanded over time. I think there's a lot more of the neighborhood that could stand to be preserved.'",
        "'speaker_0': 'Buildings and property exist in context. And the context here is the history of the neighborhood. They are hand in hand and there are few tools to capture and retain their importance. Zoning alone doesn't protect historic homes. The loan doesn't protect.'",
        "'speaker_0': 'Murals and it doesn't acknowledge historical roots or culture. Our action here tonight is what protects them. I have heard concern on multiple sides of coins that designation will increase property values or decrease property values. This neighborhood's property values are increasing, which is exactly why this designation is so important because of the funding streams that open up for'",
        "'speaker_0': 'residents to stay in those homes. There's been a lot of effort to ensure that design standards for community developed and with intentional flexibility to ensure updating remodeling can still be done well into the future while still maintaining the character of housing and identity aimed for preservation.'",
        "'speaker_0': 'Tonight, my colleague, Councilman Sandoval, pointed me to two builds in the Potter Highlands historic district that look very different from one another, but both of which comply with the district designation rules as well as design overlay. These things are possible.'",
        "'speaker_0': 'I want to point to a section of Tony Garcia's letters in support tonight, because it was. One of the most compelling things that I read as we seek collectively new solutions for the problems of gentrification, we must also shift our understanding of the people we are displacing and the cultures and histories we are embracing.'",
        "'speaker_0': 'Communities have long histories and their physical presence and emotional resonance comes from the people who call the community their home. The project provides a crucial understanding of who we are and who we have been. It gives us insight.'",
        "'speaker_0': 'We need to move forward to create a future that is more just an equitable, rich and evocative and represents the inclusive and dynamic community building that is so important to neighborhoods that thrive. My thanks to soothe the outro to new said to Museo de las Americas to the Casa Maya, Denver, Inner City Parish, Chicano murals of Colorado'",
        "'speaker_0': 'and Manuel Martinez into for you. And thank you to the applicants Fatima Allison, Felix, Mary and Kathy and everyone who provided support tonight and thrilled to vote yes. And I asked my colleagues to support tonight's cultural historic district in llama Lincoln Park.'",
        "'speaker_0': 'Thank you. Thank you, counsel pro tem Torres. Next up, we have Councilmember Sandoval.'",
        "'speaker_8': 'Thank you, Madam President. It is my honor to support this application tonight. I was thinking back to my work in Council District nine in the Lamar Lincoln Park neighborhood, and when I started in there working for Councilman Monteiro, it was just Lincoln Park.'",
        "'speaker_8': 'The park was not named La Alma. And I remember doing research, reading article after article about the history of the West Side, the marches that happened in the West Side, learning about Emanuel and his mural and La Alma the soul.'",
        "'speaker_8': 'And I think that that resonates the most with me tonight sitting here. So it is my honor to be up here and be able to vote on this. I was a council aide and we worked on adding the honor to Lincoln Park officially to make it the whole entire neighborhood, LA on the Lincoln Park and make officially'",
        "'speaker_8': 'the park llama. And it is my great pleasure to support this cultural district. I want to work on one in my neighborhood for the Orthodox Jewish community, and I think this paved the way to how to do it, especially the design standards that are more equitable.'",
        "'speaker_8': 'And I think of what Ian Tafoya said in his comments about Blueprint Denver and working on equity. And I remember when you held it up to talk about equity, so thank you for doing that because tonight we have outcomes from that work that you're doing.'",
        "'speaker_8': 'So thank you for all the sponsors and thank you for all being here with us in person and those who are virtual. And you have my support. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Sandoval, Councilmember Flynn.'",
        "'speaker_7': 'Thank you, Madam President. And thank you, Councilwoman Sandoval, for what you just said, because this city has such a rich history and it's a lot of it is on the west side. And it's just my pleasure to support this tonight.'",
        "'speaker_7': 'And it's long overdue. The this la alma neighborhood has such is so deep in history from before before the white settlers came along. And it has a rich history that is also very sad. It was this is not in this district boundary, but just to the west of it where Camp Weld was located in the in the'",
        "'speaker_7': 'Hunter subdivision from where the Colorado volunteers set out for Sand Creek. So there's a lot of a lot of terrible Colorado history associated here as well. When I about 15 years ago, when I was at the newspaper and RTD was starting its West Corridor Light Rail project, I had the opportunity to produce a series on the corn'",
        "'speaker_7': ', the history of that west corridor. And it started right where the tracks diverged from the RTD main line, and they went right through the north part of this neighborhood. And one of the most profound experiences I had in learning about the history, the human history of this city and the rich history of LA and the Lincoln Park'",
        "'speaker_7': 'was when I went down to the Western History Department of Denver Public Library and looked at the criss cross directories. And I remember around the turn of the century being so moved by the diverse population of this neighborhood.'",
        "'speaker_7': 'And I know that the staff report spoke to this in in in just in general detail. You could you would see Mexican names. You would see Eastern European. You would see a synagogue next to a a a Latino church.'",
        "'speaker_7': 'And it was just very rich and it's all gone. All of that is gone. Star Bakery is gone. You know, a lot of the foundation of this neighborhood is gone. The the railroad, the Burnham yard is gone. But we can't forget.'",
        "'speaker_7': 'What they produced here. And this will go a long way to preserving that history. And I think it's long overdue and I'm happy to support it. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. And I'll go ahead and add a few remarks here. I want to thank the community members and advocates who shared their stories with us tonight. That becomes your history and culture when people are able to share stories and the history of the area.'",
        "'speaker_0': 'And your love and your passion for your neighborhood came through tonight. And it was hard for me not to too to say, well, you're repeating some things, but really you didn't because you all gave such personal stories about why this area is so important and why we should vote to make it a historic and cultural district.'",
        "'speaker_0': 'And I'm very, very honored, having been here in person, listening to the stories both in-person and virtual, to support this tonight and want to congratulate Council Pro-Tem Torres, because this is a huge accomplishment and a huge left. And I know exactly how you were able to accomplish it because you had the community walking beside you with you'",
        "'speaker_0': 'every step of the way. And I'm happy to support this, this evening. All right. We will go ahead, Madam Secretary. Roll call on Council Bill 758, please.'",
        "'speaker_2': 'Torres. I black. I.'",
        "'speaker_6': 'CdeBaca. I. Clerk.'",
        "'speaker_5': 'I.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_7': 'I.'",
        "'speaker_6': 'Hines.'",
        "'speaker_1': 'I.'",
        "'speaker_6': 'Cashman. I can. Age. I. Sandoval.'",
        "'speaker_8': 'I.'",
        "'speaker_6': 'Sawyer. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_6': '11 Eyes.'",
        "'speaker_0': '11 eyes counsel build 20 1-758 has passed there being no further business before this body. This meeting is adjourned.'"
    ]
}