{
    "A proclamation in recognition of Paul A. Hindman, Executive Director of Urban Drainage and Flood Control District, upon his retirement.": [
        "'speaker_0': 'Thank you. Thank you. Communications. Madam Secretary, do we have any communications.'",
        "'speaker_7': 'Then, Mr. President?'",
        "'speaker_0': 'Proclamations. We have three proclamations this evening. Councilman Castro, will you please read Proclamation 804?'",
        "'speaker_12': 'Thank you, Mr. President. I would be honored to as proclamation number 16 dash 0804 in recognition of Paul, a Heineman executive director of Urban Drainage in flood control district upon his retirement. Whereas Paul Heineman holds a Bachelor of Science degree in agricultural engineering from Colorado State University and a master's degree in business management from the University of'",
        "'speaker_12': 'Colorado at Denver. As a professional engineer licensed in the state of Colorado, he has over 37 years of experience in the field of water resources, both in the private and public sector. And. WHEREAS, Mr. Heineman began his esteemed career with the Urban Drainage and Flood Control District on January seven, 1985, as a project engineer for the maintenance'",
        "'speaker_12': 'program. He has held a variety of positions rising through the ranks to become executive director of the district in 2008 and has decided to retire effective September 16, 2016. And. Whereas, in over his 31 years with the district, he served with dedication and his legacy will forever be remembered through the numerous projects that were completed during his'",
        "'speaker_12': 'time with the district, which include the Goldsmith Gulch, the Storm Sewer Pipe Material, Technical Memorandum, Lakewood Gulch and the University Mexico Storm Sewer, and where, as Mr. Heineman said, unwavering commitment to the district and the safety of every Colorado resident was witnessed firsthand in September 2013, when many counties in the metro area suffered historic flooding.'",
        "'speaker_12': 'These same floods also displayed the great work that has been done in Mr. Heineman this time, much of which goes underappreciated until it is needed. And. Whereas, through his leadership, responsiveness to citizens and elected officials, volunteer work within the community and dedication to improving policies, procedures and best practices for flood mitigation.'",
        "'speaker_12': 'Mr. Heineman has helped strengthen a culture and infrastructure that will continue to protect residents and property for decades to come. Now, therefore, let it be proclaimed by the Council of the City and County of Denver, Section one, that the Council of the City and County of Denver honors the work of Paul Heineman and expresses its sincere appreciation'",
        "'speaker_12': 'for his outstanding career of service to the people of the city and county of Denver, the seven counties served by the Urban Drainage and Flood Control District and the state of Colorado. Section two. That the clerk of the city and county of Denver shall attest and affixed the seal of the city and county of Denver to this'",
        "'speaker_12': 'proclamation, and that a copy be transmitted to Mr. Paul Heineman and the Urban Drainage and flood control district.'",
        "'speaker_0': 'Thank you. Councilman, your motion to adopt.'",
        "'speaker_12': 'Yes, thank you, Mr. President. And I move that proclamation. 804 be adopted.'",
        "'speaker_0': 'It has been moved. Let's see here. It's been moved and we get a second.'",
        "'speaker_8': 'I'm trying.'",
        "'speaker_0': 'You can see it. We got Ortega for a second. Comments by members of Council. Councilman Cashman.'",
        "'speaker_12': 'Thank you, Mr. President. First of all, I do want to again mention I want to thank Councilman Lopez for actually bringing this forward. And I'm sorry he's unable to attend and wish his family well. And I know he would be expressing his admiration for Mr. Hyman's work.'",
        "'speaker_12': 'And Councilman Lopez served as chairman of the Urban Drainage Board for a while and is a fan. I know that for sure. So for those who don't know the urban drainage and flood control district, one of the least cool names for an organization I think I've ever heard was formed in 1969 to work on essential drainage and'",
        "'speaker_12': 'flood control projects along the front range. The area urban drainage looks at is over 1600 square miles. Includes the city and county of Denver, the six counties that surround us. Parts of it I think 33 cities and towns and affects 2.8 million people.'",
        "'speaker_12': 'So when I first started on council over a year ago and then President Herndon made the appointments to various boards, I got word that I had been appointed to the board of the Urban Drainage and Flood Control District, an organization that I knew nothing about.'",
        "'speaker_12': 'And I thought Urban drainage. What is this going to be about? And I was very unimpressed. And then I started talking with friends who have interest in that area. And universally the word came back that this was an organization, the Urban Drainage and Flood Control District, that was held in the highest esteem for the work that it'",
        "'speaker_12': 'does and the importance of the projects that it does in saving lives. And then as I got began serving on the board and got to know more intimately about the work the board did, it is a totally nonpolitical organization.'",
        "'speaker_12': 'It is one of the most efficient deliverers of service that I think I've seen in my time on council. They they look to the jurisdictions that they serve to tell them what needs to be done. And then they design and engineer the projects and go to outside sources to actually do do the construction.'",
        "'speaker_12': 'The work they do has literally saved lives throughout throughout our area. And as was mentioned in the proclamation, all you need to do is to look back at the flood was 1965. I think that the Platte River flooded.'",
        "'speaker_12': 'And you look at Boulder, the Boulder area a couple of years ago and this is serious business. And we've talked a lot about our drainage needs in this city recently. And I need to say this and this is a difficult thing to say.'",
        "'speaker_12': 'So I had we had a vote on a drainage issue recently, and I personally have come to have the utmost respect for Mr. Heineman in serving on the board and watching him carry himself. He is deadly serious about the work that his organization does and feels a commitment to the communities that he serves.'",
        "'speaker_12': 'And we ended up on opposite sides of an issue. And I had to vote in a way that Mr. Heineman was not pleased with and would have recommended against. And I was so happy that that meeting for that vote ran till about two in the morning, because I noticed about midnight that before we took our vote that'",
        "'speaker_12': 'that that Mr. Heineman had to leave the building. And so when it came time for me to place my vote, I didn't have to look him in the eyes. So. You know, that's the way this job goes sometimes.'",
        "'speaker_12': 'And it was no reflection on my opinion of my friend. So with that, I would just offer my congratulations on a wonderful career. And those are going to be very big shoes to fill. And thanks and enjoy your time with your grandkids.'",
        "'speaker_0': 'Thank you. Councilman Cashman, Councilman Gilmore.'",
        "'speaker_9': 'Thank you, President Brooks. You know, Paul, it's been an honor getting to know you. I kind of got to know a little bit about your work even before I was elected, because I was always kind of researching what we could do about the Montebello channels.'",
        "'speaker_9': 'And so, you know, your steady leadership and your commitment to protecting lives and property always with not enough money to really do all of these projects. And so being creative and thinking outside the box and going for different grant dollars is so important.'",
        "'speaker_9': 'And, you know, you're not just going to leave a, you know, small hole in this organization. I mean, for a lot of intents and purposes, you are this organization. And so I know that transference of leadership is something that you've been working really hard on, and we're going to be proud of the next leader.'",
        "'speaker_9': 'But no, that will be missing you and hopefully living vicariously through your adventures and your grandchildren and all of the different things I hope you get to do. So thank you for your service. Paul. Thank you.'",
        "'speaker_0': 'President Brooks Thank you, Councilwoman Sussman.'",
        "'speaker_5': 'Thank you, Mr. President. I'm so happy to be a part of this proclamation for you. I sort of felt the same way when I was assigned to urban drainage about five years ago and but came to also discover how much I didn't know about urban drainage and how much I would like to know about urban drainage.'",
        "'speaker_5': 'And one of the most special things that you did for us, Paul, was the lectures before the meeting began. He would give us classes in hydrology 101 before the meeting while we were eating a delicious lunch. By the way, I always would like to recommend that to all of the professors I had before.'",
        "'speaker_5': 'And so I got to learn all these cool words like outfall and drop structure and occlude and capillary. Not not to be confused with hilarity. And my favorites were Cone of Depression and Cone of Influence, which I often feel like describes the work of a councilwoman.'",
        "'speaker_5': 'But it has to do with water. And I have always been so grateful to have learned as much as I did about urban drainage. And that doesn't sound very sexy, but it's so important to our community. And the work that you done with urban drainage is something that you are going to.'",
        "'speaker_5': 'They are big shoes to fill and thank you very much for a wonderful experience serving on your board.'",
        "'speaker_0': 'Great Councilwoman and Councilman Clark. I apologize. I'm sorry.'",
        "'speaker_4': 'Thank you, Mr. President. Well, unlike some of my colleagues, I was very well aware of who the urban drainage and flood control district was before I got here, because I'd spent 17 years of my life working down on the South Platte River, and this is just a one of a kind organization and under your leadership has really'",
        "'speaker_4': 'done amazing things. So you will be sorely missed. You know, one of the things that when you when you play and you work down by the South Platte River, there are a lot of organizations who have some touch on that and have some authority and some control.'",
        "'speaker_4': 'And that is a hardworking river. And it serves a lot of different things. And one of the frustrations for me was always as I was trying to work on making the river fun and engaging and safe place for kids to come and learn was to run into these big organizations with a lot of resources who would say'",
        "'speaker_4': ', Well, that's not the primary function of this river. This is that this river's primary function is to convey water, to get water from point A to point B or to do this or to do that. And one of the things that was just amazing to run into urban drainage and flood control was that you guys totally got'",
        "'speaker_4': 'it. Was that yeah, that wasn't your primary objective. And you're here to keep keep the city safe and to convey that water in a storm event. But you absolutely understood, like I would say, no other organization working down there that is governmental, that that didn't have to be exclusive, that it didn't just have to be that that's'",
        "'speaker_4': 'the one thing this river is going to do. And so anybody who has been down to the South Platte River and seen the $30 million worth of new improvements that have happened in the last 4 to 5 years under your leadership, none of those projects were possible without.'",
        "'speaker_4': 'You. And without you guys, they just weren't. And you were. You just had this amazing ability to always come to a project and say, hey, this is what we have to get done. But you know what? We can do it like this.'",
        "'speaker_4': 'And then look at all the benefits. Look at. Look at what can happen. And look at now. Today, all of the kids who are down there and experiencing the river and all the wildlife opportunities, that is possible because of urban drainage and because of your leadership.'",
        "'speaker_4': 'And so as a city, we are in your debt and you will be sorely missed. And and I would say that the river has no greater friend than you. So thank you for everything they've done. Thank you for your commitment and your work and enjoy what you're doing next.'",
        "'speaker_4': 'But I hope you'll continue to be a friend of the river in Denver, even in retirement. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I'd like first to ask that my name be added to the proclamation. And then I want to also thank Paul for his years of service with urban drainage and all the important work that you've done throughout the city of Denver and neighboring jurisdictions.'",
        "'speaker_8': 'I had the benefit of serving on urban drainage for some time and worked with your predecessor, Scott, and your former colleague Bill DeGroot on a number of projects, some of which are on the South Platte River. But that important work would not happen without the important role of urban drainage.'",
        "'speaker_8': 'I wish you guys would have been the lead agency on the project that Councilman Cashman talked about just a few minutes ago. It might have been a different project, but, you know, that's water under the bridge, I guess, at this point.'",
        "'speaker_8': 'But I just wish you well in your retirement. And as someone said earlier, there will be some big shoes to fill and just thank you for your service. I see that some of your colleagues are here and hope that when you get a chance to speak, maybe you can just acknowledge them as well.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_0': 'Thank you. Madam Secretary, roll call.'",
        "'speaker_7': 'Cashman I 20 start sorry. Cashman can each. I knew Ortega I Sussman.'",
        "'speaker_5': 'I Black.'",
        "'speaker_7': 'High Clark Espinosa. Flynn I Gilmore I Herndon High. Mr. President.'",
        "'speaker_0': 'I close voting. Announce the results just.'",
        "'speaker_7': 'Sorry. One moment. Yeah.'",
        "'speaker_0': 'Total Vice 12 Eyes Proclamation 804 Passes. Now, Councilwoman Kathryn, do you have anyone that you'd like to bring up?'",
        "'speaker_12': 'I like to think about it as a little room full of people. I'd like to invite Mr. Heineman to say a few words.'",
        "'speaker_4': 'Thank you very much. First of all, I'm glad that motion passed. And I don't want any of you to confuse me. I'm Paul, and there's a Paul, and we both have blue striped shirts on. But I work for urban drainage.'",
        "'speaker_4': 'And you're with Denver. You know, I've been at urban drainage and flood control district for over 30 years. And as all of you said, it is a great organization and I have just been blessed to have been a part of that and to work with the city and county of Denver on, as you've all said, numerous projects'",
        "'speaker_4': 'to help the citizens of Denver be protected when when a flood does happen to protect people, property and the environment. I've had the pleasure to serve with in the last eight years as executive director with four of you on my board.'",
        "'speaker_4': 'Councilman Cashman, Councilwoman Gilmore and Councilman Lopez, who are on the board right now, and Councilwoman Sussman, who was and Councilwoman Ortega, I do remember back when I was working in the Design Construction Maintenance Program that you were on our board as well and and did many projects in Denver.'",
        "'speaker_4': 'And our partnership with Denver through the years is just been amazing. We we always want it wanted to serve and do what city and county of Denver wanted us to do, not what we wanted or thought or directed to do.'",
        "'speaker_4': 'And that has turned out some fabulous projects on Lakewood Gulch, where Gulch, West, Harvard, South Platte, River, Cherry Creek. And I think in the proclamation of one of the ones Councilman Cashman mentioned was Goldsmith Gulch. And I was the project manager on that.'",
        "'speaker_4': 'And any of you who have been with city and county Denver for a while know that was a long, tedious process to get that done. But we did. And more than 150 households are now protected and are not in a hundred year flood plain because of that project.'",
        "'speaker_4': 'And that is probably the one in my career that I am the most proud of because that's what this is all about, is to protect people. And I again am just so grateful to have been a part of that.'",
        "'speaker_4': 'And I am humbled by the people that I've worked with, both with Denver and and at my organization. So thank you very much for this. This is this is the high this is the highlight of my career. Thank you very much.'"
    ],
    "A proclamation congratulating the Denver Outlaws for winning the 2016 Major League Lacrosse (MLL) Championship.": [
        "'speaker_0': 'Excellent. Councilman Herndon, will you please read Proclamation 805?'",
        "'speaker_6': 'Yes, Mr. President, I am excited to read Proclamation 805 congratulating our Denver Outlaws for winning the 2016 Major League MLB, the cross shaped championship. Whereas The Denver Outlaws kicked off their inaugural season on May 22, 2006, and are an organization committed to not only winning Major League lacrosse championships, but to growing new lacrosse fans and to making'",
        "'speaker_6': 'a positive impact on Denver communities. And. Whereas, since their inaugural season, no team has appeared in more Major League lacrosse championship games than our Outlaws. And. WHEREAS, on August 21st, 2016, the Denver Outlaws rallied to defeat the Ohio Machine 1918 after trailing by seven goals at halftime to earn the franchise's second Major League lacrosse championship and return'",
        "'speaker_6': 'the Steinfeld trophy to Denver. And. WHEREAS, Denver, Denver native Eric Law was named MVP of the championship game after scoring the game winning goal with just 13 seconds left. And. WHEREAS, Head coach BJ O'Hara acknowledges that fan support has had a meaningful impact on the team, helping carry them through a challenging season and ultimately to the team's'",
        "'speaker_6': 'second championship in three years. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council congratulates. Mr. Pat Bowlen, owner of the Denver Outlaws. Head Coach B.J. O'Hara, President Mac Freeman, Director of Sales and Marketing, Ted Sing and the entire Denver Outlaws team and staff for winning'",
        "'speaker_6': 'the 2016 Major League Lacrosse Championship and bringing the Stanford Cup back to Denver. Section two that the clerk of the city and county of Denver will attest and affix the seal of the city and county of Denver to this proclamation and then a copy be transmitted to the Denver Outlaws franchise.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Your motion to adopt.'",
        "'speaker_6': 'I move that proclamation 805 be adopted.'",
        "'speaker_0': 'It has been moved in second to comments by members of council councilman herndon.'",
        "'speaker_6': 'Thank you, Mr. President. And I said this a couple of council meetings ago. Name the last team to win a major championship in Denver and everybody scream Broncos. I was like, You're wrong. And I'm so excited about our Denver Outlaws because if you're familiar with Major League, the Cross, every team, with the exception of our outlaws, are'",
        "'speaker_6': 'on the East Coast because there is this perception mentality that lacrosse is an East Coast sport. Since 2006, when the Denver Outlaws joined the Major League Lacrosse League. Only one year had we not had the highest attendance for a single season game more championships appearances than any other team.'",
        "'speaker_6': 'This is a team that is committed to winning. We have a fan base that still supports their teams and is exciting to know that they are back bringing the Steinfeld trophy back to the mountain west to the mountain time zone.'",
        "'speaker_6': 'And I was we have the photo of their pitcher, which is just remarkable after they won. And so it's great to have our MVP, a Denver native here as well. So kudos to the team. Congratulations, Iowa. We did this two years ago.'",
        "'speaker_6': 'I got to hold the Steinfeld trophy. It is heavy and I'm excited about taking a photo after this proclamation holding and again can kudos to our team. Kudos to the franchise and really excited and I look forward to doing this proclamation every time.'",
        "'speaker_6': 'I wish I could give you a parade, but the very least I could bring for the proclamation. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Thank you, Madam Secretary. Roll call.'",
        "'speaker_6': 'Herndon, I.'",
        "'speaker_7': 'Oh, sorry, Mr. Herndon.'",
        "'speaker_6': 'I.'",
        "'speaker_7': 'Can. I can eat. I knew Ortega Sussman, Black Eye Clark Espinosa. Flynn, I. Gilmore, I. Mr. President.'",
        "'speaker_0': 'I. Please close the voting, announce results.'",
        "'speaker_7': '12 Eyes.'",
        "'speaker_0': '12 eyes. Proclamation 805 has been adopted. Councilman Herndon, is there someone that you would like to call up?'",
        "'speaker_6': 'Yes, Mr. President, I'd like to invite Ted Singh, director in sales and marketing for the Denver Outlaws, as well as our championship game MVP, Erick La.'",
        "'speaker_4': 'Thank you guys for having us.'",
        "'speaker_0': 'Wow. That is a big trophy.'",
        "'speaker_2': 'Just want to say thank you, Councilman, for all the kind words. It's pretty cool to be a Denver homegrown boy and being able to stand up here and be named Most Valuable Player, the championship game, something that you never would've thought ever happen in your life.'",
        "'speaker_2': 'And to bring another championship back home to Denver that thrives on championships and winning. And and I think any of this would be done without our owner, Pat Boone, and and all the things that he's done, not only for us as the Denver outlaws, but he was a major contributor and helping Major League lacrosse grow and kind'",
        "'speaker_2': 'of helping our vision of bringing across the main stage and and like you said, bringing the cross that's been conceived to such an East Coast sport and bring it out west and be one of the local guys that that can say that that we're the champions and we're the best team in the world is nothing but an'",
        "'speaker_2': 'honor.'",
        "'speaker_0': 'So thank you all. Thank you.'",
        "'speaker_12': 'I just wanted to add a few things kind of for those who kind of haven't followed our season this year. This team started like, like every year we, we start with.'",
        "'speaker_10': 'The aspirations to win a championship. Two years ago, we certainly were excited to win our first championship this year. Started off not so well for us. We.'",
        "'speaker_12': 'We got off to a two and six start and there were no thoughts of, you know.'",
        "'speaker_10': 'This trophy coming back to Denver at that point.'",
        "'speaker_12': 'But it's the.'",
        "'speaker_2': 'Testament of.'",
        "'speaker_12': 'The team, the coaches and the players. They believed in.'",
        "'speaker_0': 'Themselves and they kept.'",
        "'speaker_4': 'Fighting and they kept winning game after game.'",
        "'speaker_12': 'After game until it became a reality of us winning eight.'",
        "'speaker_10': 'Straight.'",
        "'speaker_12': 'Games and then certainly winning another championship and bringing it back to Denver. So we're extremely excited for.'",
        "'speaker_10': 'Where we're at with them with another championship and hopefully.'",
        "'speaker_12': 'More to come and being back here next.'",
        "'speaker_10': 'Year again for another proclamation. So thank you guys so much for having us.'",
        "'speaker_0': 'Congratulations. Ten trophies is impressive, I'm telling you. Okay. Last proclamation of the evening council. Martell, will you please read Proclamation 806?'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver and AECOM Technical Services, Inc. for on-call engineering services. Approves a three-year $2.5 million contract with AECOM for on-call professional services including traffic, transportation, bicycle and pedestrian, multimodal, parking, civil, water resources, survey, geotechnical, material testing, construction management, environmental, and various mobility-related services (201629353).  The last regularly scheduled Council meeting within the 30-day review period is on 9-26-16.  The Committee approved filing this resolution by consent on 8-11-16.": [
        "'speaker_0': 'Okay. Great. We have each for a vote for 626 and new for question in 759. All right. Madam Secretary, I think we will start with Ortega's bills in a block that we'll deal with. And Councilman Ortega. I will let you start to.'",
        "'speaker_0': 'Talk about what you want to do with this.'",
        "'speaker_8': 'Thank you. These are on call contracts. We have 12 of them. Each of them are $2.5 million. They total $30 million. And we have gotten into a practice in the city of using on call contracts, some of which may never even be utilized.'",
        "'speaker_8': 'So I think one of the things that is important for this body to see is how many of them are being utilized, how frequently are they utilized? What's the total amount that each of them have spent and to know annually how much money are we going to spend on these various contracts?'",
        "'speaker_8': 'My first year that I came back to counsel, we had 15 $4 million in contracts, and I learned that in a given year we were only going to be spending $2 million in IT contracts. We spend more way more than that now.'",
        "'speaker_8': 'But I think to ensure that we're getting the information that we need, it's important to. You know, use this platform to be able to ask for the information. And so yeah, and I routinely do that when we have these put forth on consent calendars as all of these are tonight.'",
        "'speaker_8': 'But it's not routine information that we get. I have asked that we include that on these on call contracts on a regular basis, but we don't always receive that. So I'm calling these out to vote no as a just using the bully pulpit as a way to start insisting that this kind of information be made available on'",
        "'speaker_8': 'a regular and consistent basis. Each of these contracts tonight are for traffic, transportation, bicycle and pedestrian, multimodal parking, civil water resources survey, geotechnical material testing, construction management, environmental and various mobility related services. You know, it's not clear if any of these are directly related to our Denver Wright process, which is going on, which is looking at a'",
        "'speaker_8': 'variety of planning efforts. We've got four different plans going on. We do have contracts with companies that are working with the city as consultants. And I, if I remember correctly, that equaled somewhere in the ballpark of $9 million.'",
        "'speaker_8': 'So I'm not sure how this interfaces with that. So I'm just calling them all out to vote no tonight. Thank you, Mr. President.'",
        "'speaker_0': 'Okay. Thank you. You know, we need to put this on the floor. So, Councilman Gilmore, will you please put these 12 bills on the floor for adoption?'",
        "'speaker_9': 'Yes, Mr. President. I move in a block that resolutions 575, 71, five, 72, five, 73, five, 74, five, 75, five, 76, five, 77, five, 78, five, 79, five, 80 and 581 be adopted.'",
        "'speaker_0': 'It has been moved and seconded by Councilman Flynn. Councilman Flynn, do you ever.'",
        "'speaker_4': 'Can I just a point of order or procedure? With the new system, we were told that we can only do one block vote per meeting, so we might have to do all 12 of these separately.'",
        "'speaker_7': 'We're going to go ahead and do this as a bloc. We can do a consent, vote for other items. It will work.'",
        "'speaker_4': 'Out. It will. Okay. I just wanted to raise Resa.'",
        "'speaker_0': 'Thank you. Always a stickler for procedure. I like it. We got that. We got that taken care of. And I wanted to give Angela Casey us the opportunity to respond as well.'",
        "'speaker_5': 'Yeah, hi. Angela Casey is from Denver Public Works. And I want to just to confirm with Councilwoman Ortega that we have heard the council loud and clear on this issue. We have created a report and will be rolling that out and that will it will provide the information that you're looking for.'",
        "'speaker_5': 'All of the information that you mentioned this evening is.'",
        "'speaker_13': 'Is included in that.'",
        "'speaker_5': 'Report.'",
        "'speaker_8': 'And will we get that beforehand or that will always come after?'",
        "'speaker_5': 'This is something that will that we are we can give out monthly. We can give out quarterly. We can give it out at any time. Great.'",
        "'speaker_0': 'Okay. Thank you. Thanks for the clarification, Councilman Espinosa.'",
        "'speaker_2': 'Yeah. I just I wanted to thank Councilwoman Ortega for bringing up those concerns. And as Angela had mentioned, several have these sort of similar concerns from time to time. And so I will be abstaining because there's technically nothing wrong with the contracts.'",
        "'speaker_2': 'So it's not worth me voting no. But it is sort of it did strike me and it struck me as odd several times in from this day as to get, you know, it's a situation where you got, you know, 15 or 12 Swiss Army knives.'",
        "'speaker_2': 'And now rather than use the process to sort of find the right contractor for anything, it just seems like we just throw out this massive saying exactly. Worded contracts and then suddenly now you're picking and choosing it through a different means.'",
        "'speaker_2': 'And so I just would like to have better resolution on that.'",
        "'speaker_5': 'Just just for the record, I would like to just let you know that we do do a mini bid process for almost all of these contracts. So, I mean, this isn't something that we just arbitrarily throw out against the wall.'",
        "'speaker_5': 'Like we do have a process for each one of these bids.'",
        "'speaker_2': 'No, and I'm comfortable with that process. But the thing is, is when you do a specific task order or whatever the work order is for that, you then subsequently pay to each individual contractor. What is the criteria that you use to sort of allocate which contract goes to which of these several different providers doing the same thing'",
        "'speaker_5': '. They each bid.'",
        "'speaker_13': 'On each.'",
        "'speaker_5': 'Project?'",
        "'speaker_2': 'Okay. So it's it's a seven bid process. This is like a pre-approval. Okay.'",
        "'speaker_0': 'Thank you, Angela. So we are going to vote now on this. Madam Secretary. Rocco.'",
        "'speaker_7': 'Ortega. Nope. Sussman.'",
        "'speaker_5': 'My black eye.'",
        "'speaker_7': 'Clark. All right. Espinosa.'",
        "'speaker_2': 'Staying.'",
        "'speaker_7': 'Flynn. I. Gillmor, I. Herndon. Cashman. I can. I knew. Mr. President.'",
        "'speaker_0': 'I. Please close the voting and announce the results.'",
        "'speaker_7': 'Ten eyes, one nay, one abstention.'",
        "'speaker_0': 'These 12 bills are adopted. Councilwoman Sussman, I'm sorry I missed you on.'",
        "'speaker_5': 'Okay.'",
        "'speaker_0': 'Did you want to add anything to this or.'",
        "'speaker_5': 'Well, let's a little out of order, but I will. When you're running a huge organization like the city, very often you have to get your. Yeah. You have to be prepared to be able to use contractors. And so the process for vetting possible vendors is an absolute, absolute necessity to be timely in your responses to what you'",
        "'speaker_5': 'need and then to have the when you do need their services to have it bid again, I think is a very good example of good stewardship of the city budget and I understand the interest in seeing what is spent.'",
        "'speaker_5': 'I am happy to see that they're going to send that back. That's all I want.'",
        "'speaker_0': 'Thank you. Thank you. Council on Assessment and council members. If I if I don't see you up on this new system, please just wave your hands in the air with them like you just don't care. Okay. Now we're going to pull up Resolution 547, Councilwoman Black for a comment.'"
    ],
    "A resolution approving a proposed Automated Photo Red Light - Photo Radar Traffic System Management Program Agreement by and between the City and County of Denver and Xerox State and Local Solutions, Inc. Approves an agreement with Xerox State & Local Solutions Inc. in the amount of $6,417,923 with a contract term through 9-3-21 for the provision of services for both the Photo Red Light and Photo Radar programs (201627552-00).  The last regularly scheduled Council meeting within the 30-day review period is on 10-3-16.  The Committee approved filing this bill at its meeting on 8-31-16.": [
        "'speaker_5': 'It's a much needed sidewalk they're partnering with See Dot, who's picking up most of the tab. So thank you very much.'",
        "'speaker_0': 'Okay. Great. All right. Now we are going to go to the bills for introduction.'",
        "'speaker_7': '759 was that one of them?'",
        "'speaker_0': 'Oh, I'm sorry. You're right. 759 Resolution. Councilman Flynn, what would you like to do with that thing?'",
        "'speaker_4': 'Mr. President, I'd just like to put this up for a vote.'",
        "'speaker_0': 'All right, Councilwoman Gilmore, would you please put Resolution 759 on the floor to be adopted?'",
        "'speaker_9': 'Yes, Mr. President. I move that resolution 759 be adopted.'",
        "'speaker_0': 'Great. It is moved in second to Councilman. Councilman Flynn.'",
        "'speaker_4': 'Thank you, Mr. President. We have such a lengthy agenda tonight, and this is a topic that we've debated quite thoroughly. And I've had the benefit, and I want to thank the traffic and the police staff who met with me to talk about this issue.'",
        "'speaker_4': 'And we're at the point now where I just wanted to vote. No, I don't oppose. I'm sorry. This is the photo red light and the photo speeding radar van contract because they're packaged together unlike previously. I just want to make it clear I do not oppose the photo speeding van.'",
        "'speaker_4': 'In fact, I wish we had more of them. I wish we had them all in my district. As a matter of fact. But at the risk of snatching victory from the jaws of defeat, I don't want to go on and on and debate this again tonight.'",
        "'speaker_4': 'I just want to make note that I believe that having advocated with the staff unsuccessfully, that we follow a new guidance from the Institute of Transportation Engineers. And I do understand their reasons after meeting with them this afternoon.'",
        "'speaker_4': 'I just want to register my no vote in in in protest of that and and continue to advocate that we adopt a practice that in some other locations, particularly in California, where this new guideline has been has been codified in their state law that has reduced red light running, reduced accidents and enhanced safety without having to while'",
        "'speaker_4': 'reducing punitive fines. In other words, we can get compliance, we can reduce accidents without without fining people over it. So with that, Mr. President, I will forego talking about all the material that I've emailed folks over over time and just continue to urge the the traffic engineering staff to work on this.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Councilman Flynn. I really appreciate that. Thank you.'",
        "'speaker_4': 'I knew you would.'",
        "'speaker_0': 'We also have. Oh, councilman new. Go ahead.'",
        "'speaker_4': 'Well, question is Steve Hershey come up. Steve, if you could, could you address the national standards for especially the yellow light situation and the length of time and how we manage the length of time of those red lights and of the young lives in particular, and any national standards that you have.'",
        "'speaker_4': 'Sure, Councilman. Currently, the city and county of Denver has adopted the Federal Manual of Uniform Traffic Control Devices. That is a federal manual that comes out of Washington. It's adopted by sea dogs, also adopted by the city and county of Denver.'",
        "'speaker_4': 'In the manual, it advises that cities or counties or states use an adopted practice to calculate yellow and all red times. We've adopted the city standard, and the city standard is a formula which uses speed, grades and other factors to determine how long yellow times should be in California.'",
        "'speaker_4': 'They have their own mutes. The federal government allows the state to adopt their own multi-city in California has done that. Colorado has not. So we felt it was in our best interest to keep our practices consistent throughout all the intersections in the city and to follow the guidance in the manual of uniform traffic control devices from the'",
        "'speaker_4': 'federal government. So that's the process that we are currently using. You'll be continuing to evaluate this. Yes. Currently, we have a study going on that's looking at violations at a myriad of other intersections around the city. We are following what's happening when we adjust yellow times.'",
        "'speaker_4': 'What happens to compliance initially and then also what happens to compliance over time so we can get an understanding of is it an immediate reaction? Are we immediately seeing compliance? But then drivers are drifting back to old bad habits or is this a sustainable thing?'",
        "'speaker_4': 'And currently we have some data to support that. It does seem to bounce back and the drivers do seem to violate. But we're continuing to study that and we've made that commitment to Councilman Flynn that we would not only continue the study, but that we would be upfront and share all of that data with him.'",
        "'speaker_4': 'Yeah. Thank you, Steve. Thank you, Mr. President. Thank you.'",
        "'speaker_0': 'Thank you. Yep. Thank you, Steve. You may want to sit up here just in case. Steve, I think you might want to come to the front desk. We got some more questions. Council Councilwoman. Councilman Espinosa.'",
        "'speaker_2': 'No questions. I just wanted to segment support. I mean, explain again. Did he call now for a vote? Yes. Yeah. Why? Once again, I'll be abstaining because there's technically nothing wrong with the contract. However, Councilman Flynn did bring this up last year, and I'm not quite satisfied with the fact that we don't have a we didn't have'",
        "'speaker_2': 'a better answer at committee on on on why we haven't further pursued these real. What he has is really hard data on the benefits of extending these these yellow light times. So in support of the fact that the research that you guys are doing and the transparency you've you've offered, I won't be voting no, but I will'",
        "'speaker_2': 'be abstaining from this vote. Thanks.'",
        "'speaker_0': 'Thank you, Councilman Cashman.'",
        "'speaker_12': 'Thank you, Mr. President. I also want to lend my support to Councilman Flynn for the hard work he's done in bringing up this issue, as I understand it. Councilman, the issue has to do with where? You'd like to see the yellow lights timed pretty much in conjunction with the speeds that people are actually driving, whereas our traffic'",
        "'speaker_12': 'engineers want the yellow lights timed according to the speeds as as our speed limits are signed. And for me and I'm taking the time to talk about it, because traffic in the city and county is the most frequently mentioned issue to me by my constituents.'",
        "'speaker_12': 'And I think we need to address this issue in a two pronged manner. The if people are driving too quickly, then we need to employ whatever traffic calming measures that we can, whether it's electronic signs telling you how fast you're driving, whether it's striping, narrowing lanes or whatever.'",
        "'speaker_12': 'But we need to address it to control the speeds. For me, the red light cameras are to control safe passage and safe stopping at intersections. So I think I think he's right on the money. And I hope you will continue to to look at this.'",
        "'speaker_12': 'In addition, I just wanted to bring up I know a number of us were surprised in committee to find out that in the entire city and county of Denver. I don't know what people listening and watching on TV I think we're doing, but we've we don't have dozens or hundreds of these cameras.'",
        "'speaker_12': 'We have four we are monitoring four intersections in the city and county of Denver with our 685,000 residents and millions of visitors every year. We have, I believe, five photo radar vans that we kind of shift around the city.'",
        "'speaker_12': 'We have I don't know how many trailers, speed trailers with the signs that tell you how fast you're going and urge you to slow down. So I think we really need to if we've decided that this is an effective program, I think we need to look at a substantial expansion of this program.'",
        "'speaker_12': 'People are driving like lunatics in the city. We have too many people. We can't our roadways aren't handling it. People are cutting through our neighborhoods at speeds far exceeding what they should be driving. So I just wanted to give that a little bit more time so people understand the scope of what we're doing here and maybe will'",
        "'speaker_12': 'let us know what our constituents think we ought to be doing with this. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Steve. You can have a seat. Thank you for being up here. All right. Madam Secretary, roll call.'",
        "'speaker_5': 'Flynn.'",
        "'speaker_4': 'No.'",
        "'speaker_7': 'Gilmore. Herndon. Cashman. Kennedy. I knew Ortega. Sussman.'",
        "'speaker_5': 'I. Black. All right. Clark.'",
        "'speaker_7': 'All right. Espinosa.'",
        "'speaker_2': 'I'm staying.'",
        "'speaker_7': 'Mr. President.'",
        "'speaker_0': 'I. Please close the voting, announce the results.'",
        "'speaker_7': 'Ten eyes, one knee, one abstention.'",
        "'speaker_0': 'Ten eyes, one day, one abstention. Resolution 79 has been adopted. We're going to the bills for introduction now and we're going to start off with Council Bill 760 with Council.'"
    ],
    "AS AMENDED a bill for an ordinance amending Chapter 27 of the Denver Revised Municipal Code concerning housing, establishing permanent funds to support city affordable housing programs, adopting an affordable housing linkage fee applicable to new construction to be effective October 1, 2017, and dedicating a portion of the citys existing property tax revenue capacity to the funding of affordable housing programs beginning with 2017 property taxes to be collected in 2018. Approves creating a permanent fund for affordable housing programs, adopting an affordable housing linkage fee, and dedicating a portion of the citys existing property tax revenue capacity to funding affordable housing programs. This bill was approved for filing by Councilmember Herndon.  Amended 9-12-16 to change the composition of the Affordable Housing Advisory Committee.  The change would remove one of the mayors appointments to the advisory committee from an at large appointment to a requirement that the appointment be a non-profit affordable housing developer; thus, resulting in two slots on the committee": [
        "'speaker_0': 'Thank you. That is duly noted. And we will have a courtesy public hearing on that. Thank you. All right. We we're going to go to Council Bill seven. I'm sorry. 626 Bill for introduction. And I'm going to call on Councilman Herndon to kick off, make a comment on this bill.'",
        "'speaker_6': 'Thank you, Mr. President. First, I would like to say that was not in the script. Should 626 go on to second reading? I would like to request a one hour courtesy public hearing on that. And then, Mr. President, I'd like to offer a comment and then overview.'",
        "'speaker_6': 'And Councilman Ortega has an amendment to offer as well.'",
        "'speaker_0': 'Go read it.'",
        "'speaker_6': 'I just read you and I. Do you want to have it ordered, published, and then comments? Which would you prefer, Mr. President?'",
        "'speaker_0': 'You know, no one has. You know, let's it let's put it this order. It published, but no one has asked to vote for this yet.'",
        "'speaker_13': 'But yes, I.'",
        "'speaker_6': 'Did I.'",
        "'speaker_8': 'And we had a request for a vote on the other one as well.'",
        "'speaker_0': 'Okay. So Councilwoman Gilmore. Yes, Mr. Parker, will you please put 626 in order? Publish?'",
        "'speaker_9': 'Yes, I move that council bill 626 be ordered published.'",
        "'speaker_0': 'All right. It has been.'",
        "'speaker_5': 'Oh, wait.'",
        "'speaker_7': '1/2. Yeah.'",
        "'speaker_0': 'It's been moved in second to comments.'",
        "'speaker_7': 'Something happened.'",
        "'speaker_0': 'Oh.'",
        "'speaker_7': 'I'm sorry.'",
        "'speaker_0': 'Okay.'",
        "'speaker_7': 'Because she made the motion. It's moving only.'",
        "'speaker_0': 'There you go. There you go. Okay. Sort of publishing this on the floor. Councilman, do you want to make your comment?'",
        "'speaker_6': 'Yes, Mr. President, I am. I'm excited. I'm making progress. I got a second this time is you've got to add some levity to this, because what we're both doing, both bills are moving forward to creating funds for affordable housing.'",
        "'speaker_6': 'Typically, when there's disagreement among council, one bill goes one way and another one goes and it goes the opposite. So I think it's important to recognize whichever Bill gets the majority of council on second reading is going to create funds for affordable housing, and that is a good thing.'",
        "'speaker_6': 'We all recognize the dire straits we have for those trying to find all different types of housing stock. And I appreciate all the work that my other colleagues, Councilwoman Kennedy, Councilman Brooks and all the stakeholders have been a part of this for so long.'",
        "'speaker_6': 'They're doing because I wouldn't have the bill if it wasn't for the work that you all done. And so that's why I always try to start off conversations by saying this. But as I would start this conversation, I would hear I would hear comments like it does.'",
        "'speaker_6': 'It's a great start, but it's not enough. We should do more. Can we do more? I believe that we can. I believe that we should do it immediately. And that is the genesis for this alternative bill. And I think not getting the second was actually a blessing in disguise because I had the opportunity to continue to have'",
        "'speaker_6': 'conversations with my other colleagues. And I appreciate Councilman Espinosa, Councilwoman Ortega having conversations with me about how we could create a bill that I believe does even more to allow that. My original bill that didn't get a second, just ask for a contribution from the general fund and then have a conversation later on 90 to 120 days'",
        "'speaker_6': 'when I was asking the bill before you, what it actually does is creates the linkage fee, creates the mil, but it's delayed. It is delayed a year and that's intentional. It's intentional because I believe that as a body we can come together and say, how can we create more funds sooner than the 150 approximately million over ten'",
        "'speaker_6': 'years who most people will say that doesn't do enough. So I would like to take the time as a committee of the whole to evaluate and fully vet all of the other funding possibilities to do more money faster.'",
        "'speaker_6': 'And so people will ask me, Well then where do you expect to do January one, 2017? Because neither one of these bills appropriates funds. We can't. David Roswell did a great job explaining that and committee. The mayor released his budget today, putting 5 million towards the Affordable Fund and a proposal you're going to hear about later on'",
        "'speaker_6': '. Additional revenue will come in, the amount of 50 million total for year one in the form of a mil and in a linkage fee. What I am proposing is that as a council, as we go through the budget process, we go back to the administration and say we would like to see 20 million come from our general'",
        "'speaker_6': 'fund coffers in year one. So I would love to start year one with a significant amount, $20 million. And then as a body, we take this time to fully vet other options that we can have more money, quicker for affordable housing.'",
        "'speaker_6': 'And should everything option we vet, nothing come to fruition, which I don't believe that will happen. But should that happen, then we have the mill and the linkage fee that will kick in the following year. But as my time on council, I know what a creative financing city this is and how we have found ways and found'",
        "'speaker_6': 'money for the priorities that we care about. And I do believe as well, that is funding affordable housing is an absolute priority. Everybody says that. It does give me pause that we were only allocating 5 million out of our general funds for 2017.'",
        "'speaker_6': 'I believe 20 million would be a great statement. I believe we have the fiscal ability to do it as well. And that, Mr. President, is an overview. This is on first reading. I would love for this bill. I would love for both bills to go so we can hear from the public.'",
        "'speaker_6': 'So there are options to speak on. I suppose we could certainly do the committee work right now and kill one bill versus the other. But I do believe we have two viable alternatives to ensure that we move forward with funds for affordable housing starting on day one.'",
        "'speaker_6': 'And I would certainly ask that my colleagues would support and moving this to second reading and for one hour our public hearing. I can certainly say more, but I am sure there will be other comments. And so thank you, Mr. President, for that overview.'",
        "'speaker_6': 'And Councilwoman Ortega is going to make a amendment as well for our advisory committee that we call. And I appreciate some of the committee members who caught that. So it's coming from you. And I look forward to that, to the dialog.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilman Herndon. So point of order. We have several folks in the queue to make comments. I think it's appropriate that we do the amendment first. And if the amendment passes, we order published as amended, and then we can make comments over the overall bill.'",
        "'speaker_0': 'Okay, everyone. Mr. Mayor. Okay, great. Councilman Ortega, you're a member.'",
        "'speaker_8': 'Mr. President, I move that council bill 1666 be amended in the following particulars on page 17, strike the line for and substitute the following language. Four in five nonprofit affordable housing developer.'",
        "'speaker_0': 'It has been moved. And the second. All right. Comes by members of council. Councilman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. This amendment would change the composition of the Affordable Housing Advisory Committee. The change would remove one of the mayor's appointments to the advisory committee from an at large appointment to a requirement that the appointment be a nonprofit, affordable housing developer, thus resulting in two slots on the Committee for Nonprofit Developers in order to'",
        "'speaker_8': 'equal the number of for profit housing developers on the committee.'",
        "'speaker_0': 'All right. Any other members of council want to make a comment on this council?'",
        "'speaker_13': 'Thank you, Mr. President. This amendment takes the body of 11 that is dramatically changed from the original bill. And I do want to thank Councilman Herndon for his kind and professional introduction, as well as for the committee work.'",
        "'speaker_13': 'But this is an area of the bill that is 626 is dramatically different than the stakeholder requests we had throughout the process. Our original proposal to the community stakeholders was a 15 member body and we spent the better part of two different meetings a couple of months apart, hearing lots of feedback from those stakeholders about the membership'",
        "'speaker_13': 'of this body. And repeatedly, both industry representatives, as well as kind of nonprofit advocates, said they cared more about representation than they did the small size of the body. And so, for example, some of the seats that got struck from this body include the Housing Authority, the Urban Renewal Authority, and there is no expert on homelessness on'",
        "'speaker_13': 'the body in this bill that we are discussing right now. Bill 626, sponsored by Councilman Herndon, Ortega and Espinoza. I'm going to keep referring to the bills because I'm afraid it will get confusing if we don't. So I am going to support this amendment because it adds affordable housing expertize back in.'",
        "'speaker_13': 'But I want to make clear that it in no way is sufficient to meet the expectations we heard from the stakeholders. This body still lacks homeless expertize. It lacks expertize from the Housing Authority and the Urban Renewal Authority who have significant responsibilities in this area.'",
        "'speaker_13': 'And it is not enough to cure the insufficiencies in the governing body. So although I'll be supporting the amendment, I just want to make clear that it in no way endorses the governing body that's in this bill. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. I'm looking across to see if there are any other comments on this particular amendment, not the bill as published. Okay. Yeah.'",
        "'speaker_2': 'Elvis. Yes, I would like to respond to that, actually.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_2': 'So, yeah, you know. Yeah. What we've done is we've created a smaller, more nimble and responsible group to actually hammer out some very hard questions that supposedly had been raised over the course of the last year, just with stakeholder groups, not with actual council members, aside from those who voluntarily showed up at those meetings.'",
        "'speaker_2': 'And so the thing is, is that there's a large body of work with a huge amount of input, including homeless advocates and other sources that have been specifically written out in this amendment. But what I do want to say is Denver's road home is not going away with these bills.'",
        "'speaker_2': 'And the advocates that that exist out there, the resources that the city has already has still maintain. And I firmly believe that the appointments that council will subsequently approve on the body, Wolf, will add to adequately represent and address the breadth, the entire breadth that this fund is meant to address.'",
        "'speaker_2': 'So it's just it's sort of shameless to sort of sort of, you know, pander to certain groups and say that we didn't include what we need is actual a Denver solution. We need real, real results driven body. And what we can't have is an all inclusive body.'",
        "'speaker_2': 'We need adequate representation, just like you elected 13 of us to represent 600,000 of you. We have 11 to represent a body. I mean, a group of special specialists that need to address this issue citywide. And so trying to capture it all and have a good working group and with adequate mean, you know, with adequate attendance, a'",
        "'speaker_2': 'body of 23 just gets unmanageable. The intent to sort of capture everybody, I mean, this is what while we not getting rid of Denver's road home, what we are getting rid of with the subsequent bill as amended in in both cases is the air show which attempted to sort of be this catchall and address everybody's needs.'",
        "'speaker_2': 'And we didn't do it right the first time. And we do need the actual working group that is something that is manageable and that we can we can actually get the work product that is necessary. So I think we have good representation from both the funders, the banking industry and the nonprofits and the developers, both for profit'",
        "'speaker_2': 'and nonprofit. And that's the ideal sort of mix. If there's if there's amendments that you want to put forward to address that, I'm happy to entertain it. Thanks.'",
        "'speaker_8': 'President.'",
        "'speaker_0': 'All right.'",
        "'speaker_8': 'I don't know how to weigh in on this, are you Brooks?'",
        "'speaker_0': 'But. You can weigh in right now, Ortega.'",
        "'speaker_8': 'All right. So I think it's important to note that the mayor will still make this appointment so it doesn't take his authority away. It just changes it to being one of the nonprofits. And, you know, my expectation is we would have one nonprofit that probably works with the homeless community and one that works with the broader community'",
        "'speaker_8': '. The other thing is DACA, the Denver Housing Authority, and the Denver Urban Renewal Authority already have automatic input into the city because they're part of ongoing conversations. I mean, Dora doesn't bring anything before this body that isn't already run through the administration.'",
        "'speaker_8': 'So they're already sort of embedded in in decision making processes and giving input. So I think this request to lower the numbers so that it is an effective body that can get the work done, that needs to happen in that time frame is really important.'",
        "'speaker_8': 'The other thing that I want to mention about this bill is it also calls for a comprehensive plan to be created that looks at all of the funding sources. So, for example, we have $600,000 that's going to be in the 2017 budget for the Office of Hope.'",
        "'speaker_8': 'It's still not clear to me exactly what the Office of Hope is going to be doing. That's different from the Office of Economic Development that will be doing housing. And the Office of Hope is housing opportunities. So housing is an inherent piece of what that office is going to be doing.'",
        "'speaker_8': 'So the comprehensive plan is asking that the city present to city council a plan that looks at how all of the various funding sources that go into housing are going to be allocated. And I think that's very critical so that it ensures that the decisions that are being made on which projects get funded is based on criteria'",
        "'speaker_8': 'and not simply political decisions. So that's why I am supporting this bill tonight in the amendment. Thank you.'",
        "'speaker_0': 'All right. Thank you. Seeing no other comments. Madam Secretary, a roll call on the amendment.'",
        "'speaker_7': 'Ortega.'",
        "'speaker_5': 'Ortega Sussman I Black Eye Clark.'",
        "'speaker_7': 'Espinosa. Flinn Gilmore. Herndon. Cashman. Carnage. I knew. Mr. President.'",
        "'speaker_0': 'I. Please count the voting us or close the voting unless the results.'",
        "'speaker_7': '11 eyes. Zero nays.'",
        "'speaker_0': '11 eyes. Zero nays. But on the amendment passes the statute.'",
        "'speaker_5': '12.'",
        "'speaker_0': 'Okay.'",
        "'speaker_6': 'Ms.. Mr. President, I just got some of the vote that was 11 was 12. And so I can I can hold that vote for later on if I can.'",
        "'speaker_7': 'You didn't you didn't vote. Council President.'",
        "'speaker_0': 'I have it on here as voting.'",
        "'speaker_7': 'You do? Yeah. I'm going to add it.'",
        "'speaker_0': 'Okay. You want to add me as voting? Okay, great. Councilwoman Gilmore, would you please put Council Bill 626 as amended on the floor for publication?'",
        "'speaker_9': 'Yes, Mr. President. I move that council bill 626 as amended, be ordered published.'",
        "'speaker_0': 'All right. It has been moved in second to comments by members of council. Councilwoman Kinney.'",
        "'speaker_13': 'Thank you, Mr. President. If I may, I would like to start with a couple of questions. First of all, for David Broadwell. Councilman Espinosa just mentioned that both bills, regardless of whether which one passes, would eliminate the I.'",
        "'speaker_13': 'Can you please clarify if the bill in front of us 626 indeed eliminates the H0.'",
        "'speaker_4': 'The first david broadwell, assistant city attorney, the original bill 625 which we'll be discussing in a moment, does switch off the the iho make it no longer applicable after January one. This one, 625 does not touch the inclusionary housing ordinance at this time.'",
        "'speaker_4': 'It eliminates that language in this version of the bill such that you have the delayed implementation of the of the linkage fee until next year, the delayed implementation of the bill until next year. But in the meantime, the inclusionary housing ordinance remains in place.'",
        "'speaker_4': 'Now, there may be an effort to come back next year and do something with that ordinance in conjunction with with further discussions of the entire matter from this year to next year. But the bill in front of you right now doesn't touch the inclusionary housing ordinance 626 and leaves it in place for the time being.'",
        "'speaker_13': 'Thank you. My next question was for the Department of Finance. If the CFO may come forward, please.'",
        "'speaker_0': 'And while you're asking that question, I want to to direct all of city council members to the comparison of the alternative housing fund bills, this document that was created by David Broadwell, so that folks can go back and forth and not get confused by council bill 626 and 625.'",
        "'speaker_13': 'Thank you. Please introduce yourself.'",
        "'speaker_3': 'Good evening. Brendan Hanlon, the city's chief financial officer.'",
        "'speaker_13': 'Thank you, Brendan. Can you please explain a little bit? One of the things that the sponsor mentioned is that both of these bills create funds. And so I have two questions for you. First of all, does the bill create any funds that will be generated in 2017 as written?'",
        "'speaker_3': 'I don't believe so. Over and above the 5 million, it has already been identified in the proposed 2017 budget.'",
        "'speaker_13': 'So the bill itself doesn't create any new funds in 2017.'",
        "'speaker_3': 'Not in 2017.'",
        "'speaker_13': 'Okay. My second question, so and I just want to clarify, it does turn the linkage fee on in October of 2017, but that doesn't result in funds right away. Is that right?'",
        "'speaker_3': 'It wouldn't be immediate. We're expecting some amount of delay for implementation at this point in time. So my guess is that those funds would not be delivered until you might get some in in December of 2017. But probability suggests that maybe it's January or February.'",
        "'speaker_13': 'Awesome. Okay. Thank you for explaining that. Can you also talk a little bit about the property tax? So on the surface, it may look like both bills turn the property tax on in the exact same way. But can you please clarify whether that's the case and in particular what the impact to other city services is in this'",
        "'speaker_13': 'bill?'",
        "'speaker_3': 'Sure, I'll I'll explain. Bill 625 first, the original proposal for affordable housing. So that proposed activating leveraging a half mil starting on January 1st, 2017. That would generate about $6.64 million in 2017, which would be dedicated towards affordable housing.'",
        "'speaker_3': 'The new proposal, 626 proposes activating a mil half mil in 2018. This this is based on the premise, though, that we would have sufficient capacity within our revenue growth constraints to program those funds. Otherwise you would be essentially using funds from either the general fund or human services in programing that programing those for affordable housing.'",
        "'speaker_3': 'The reason I'm bringing up the the revenue cap is because to the extent that we see reassessment value of about 6%, which is the maximum amount that we can retain underneath that underneath that revenue provision, you would have those available funds.'",
        "'speaker_3': 'But I should note that in reassessment years, we have used those funds to program services for the General Fund for Human Services and for other purposes that are already identified in the formulas that currently exist.'",
        "'speaker_13': 'So can I say that back to you and council?'",
        "'speaker_3': 'Sure. Yeah, that was a lot of mechanics.'",
        "'speaker_13': 'That was very thorough. I just want to make sure I'm understanding so. The original proposal. We know that we have capacity to use new mills. The original proposal uses new mills. It does not compete with any existing service.'",
        "'speaker_13': 'Correct. If property values continue to rise in Denver and are reassessed at that increased value, then it's unlikely that we will have new mills in 2018, in which case this proposal would be using existing mills that are currently funding other programs.'",
        "'speaker_3': 'That's that's a good way of saying it would use the value of existing mills to to carve out this dedication in 2018.'",
        "'speaker_13': 'And can you just say very in plain English what that means?'",
        "'speaker_3': 'So so so that would mean we would have a choice or this this bill would preemptively make that choice for us to say we're not going to use the funds from those mills for other city services. It shall be used for affordable housing.'",
        "'speaker_13': 'So it could result in cuts to base service levels or to other, you know, programs increases due to inflation.'",
        "'speaker_3': 'We wouldn't be able to leverage those funds for other city services.'",
        "'speaker_13': 'Okay. Thank you. And then I have one other question for another department. Is the Office of Economic Development able to come forward, please? I want to ask you about the language in this document that relates to the plan.'",
        "'speaker_13': 'So I have a lot of admiration for Councilwoman Ortega's raising of this housing plan topic because it's one that's near and dear to my heart. Councilman Brooks and I spent a lot of time talking with the administration, and so I wanted to ask whether or not you all have had some discussion about going about doing housing planning'",
        "'speaker_13': 'differently in the future in general. And then what I want to ask you is whether or not you feel comfortable with the exact language we have before us today. So if you want to just address whether or not you've heard some of Councilwoman Ortega's concerns and whether you've had some conversation about that.'",
        "'speaker_4': 'No, absolutely. My name is Rick Padilla. I'm the director of housing for the OED. Yes, we have had we have heard Councilwoman Ortega's concerns, and we have done a lot of preliminary planning in terms of how we would look at implementing, whether it's whatever the amount may be in 2017, including preparing for whether it's an 11 or'",
        "'speaker_4': '23 member body, preparing a business plan, preparing a product term sheet. So we have really looked at how do we address those issues.'",
        "'speaker_13': 'And I mean, maybe I'll ask Andrea to come forward. So there is some existing plans that this bill and that the Office of Economic Development have committed to for the 2017. And for that for these funds, the request from Councilman Ortega has been for a broader approach.'",
        "'speaker_13': 'And so can you just share what the mayor's position is on that conversation as of tonight?'",
        "'speaker_4': 'Evan Dreier, Mayor Hancock's deputy chief of staff, to want to make sure I understand the question, broader approach toward a comprehensive housing plan. The mayor is committed to taking a serious look at a comprehensive housing plan, not just a serious look, but how would we do that together?'",
        "'speaker_4': 'I think we're going to ask you all, though, if we could delay action on an amendment or a proposal that speaks to a compassionate, comprehensive housing plan tonight so that we have a little bit of time between now and second reading to develop that thinking.'",
        "'speaker_6': 'A little bit more.'",
        "'speaker_13': 'Thank you very much. I'll withhold my comments for now, but thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Black.'",
        "'speaker_5': 'Thank you, Mr. President. The bad news is that we have a serious housing crisis and we have imperfect solutions. The good news is that everyone up here is in support of a fund. And as Councilman Herndon said, one way or another, we're going to come out with something.'",
        "'speaker_5': 'Again, I also want to thank Councilwoman Kenney. Councilman Brooks Dreier, the mayor's office and all the stakeholders for all their hard work. I do support a fund, and I think we all also agree that we would like to have more money in the fund.'",
        "'speaker_5': 'I'm going to support both bills tonight moving forward to Second Reading next week and I look forward to the public comment next week. But I am in favor of more time for the Council to delve more deeply. I would personally like to hear from objective experts.'",
        "'speaker_5': 'We've heard from housing advocates and we've heard from developers, and our job on the council is sort of to weigh them all. And I would like to hear from some objective experts, like some economists, because I'm concerned about some unintended consequences of adding costs to market rate housing.'",
        "'speaker_5': 'And if we cause market rate housing to become more expensive around the city, we're actually exacerbating the problem. I'm also concerned about deterring development in parts of our city that actually need more development. We know that Montebello needs a grocery store and for developers to develop in certain parts of the cities, it's less attractive financially for them'",
        "'speaker_5': 'to do so, and I want to make sure that we're not deterring that. And I also am very interested in exploring more carrots and less stick. I'd like to look at some incentives. And lastly, I know we talk about marijuana.'",
        "'speaker_5': 'Money is certainly not unlimited, but. Hearing from my own constituents, they aren't satisfied that marijuana money goes into the general fund. They would like to know that it's going to some common good. And I'd really like to have a bigger conversation about where marijuana money is going in 2015.'",
        "'speaker_5': 'The city collected $29 million in marijuana revenue. 9 million of it went to enforcement, regulation and education, and 20 million went into the general fund. I think it would be a great common good for that marijuana money to go find affordable housing.'",
        "'speaker_5': 'And I think that's something that we could really sell to our taxpayers. I know we'd have to make up the general fund. We'd have to make that money up elsewhere. But that's the conversation I'd like to have. I just think be a really great thing to tell our constituents that we're using that money for something for our'",
        "'speaker_5': 'community. So thank you to everyone. Look forward to hearing more next week. And I know one way or another we're going to come out with a new affordable housing fund.'",
        "'speaker_0': 'Thank you, Councilwoman Black. Councilman Herndon, you were on there.'",
        "'speaker_6': 'I wasn't surprised, but I'm happy to wait. If other people had questions in the queue. Okay, great. Either way.'",
        "'speaker_0': 'Yep. Councilwoman Sussman.'",
        "'speaker_5': 'Thank you very much, Mr. President. One of the things that was new to me just today was this this question about whether we would be able to attach the mill levy next year as we are today. And I'd like to.'",
        "'speaker_5': 'Brenda, could you come back up so I could make sure I understand this? We have a cap on how much of a mill levy we can do. Correct.'",
        "'speaker_3': 'There is a revenue limitation on our property taxes as it was contained in ballot measure two way 6%. So to the extent that we exceed that, we have to credit mills to stay underneath that cap, much like how Tabor worked in the past.'",
        "'speaker_3': 'There is a limit.'",
        "'speaker_5': 'Yes. Okay. So right now we know that we would be able to attach this mill and not surpass the limit. Right.'",
        "'speaker_3': 'In 2017.'",
        "'speaker_5': '2017. But in 2018, as if values go up on on our on what we take in, we may not be able to attach the mill levy. So to find the money, we would have to dip into our general fund that had already been is being spent on other needs, right.'",
        "'speaker_3': 'It depends on that reassessment value in 2018 that really drives the conversation. And we don't have numbers as to what that looks like at this point in time. So that's the big uncertainty at this point is to the extent it from my calculations, if we were to grow by that 6% revenue limit, we would have sufficient capacity'",
        "'speaker_3': 'to fund that half mill. But that value has typically been programed to other city services in those reassessment years. But to your point, if we are under that 6% amount, then you would be carving from the base budget, that base property tax revenue in order to program it.'",
        "'speaker_5': 'Right. So right now we know that we could assess this mill levy in 2017, but next year, we're not sure we'd be able to. We'd have to sort of rob Peter to pay Paul to ensure the the money that the mill levy could bring this year.'",
        "'speaker_3': 'Right. It could happen. It just depends on those reassess.'",
        "'speaker_5': 'It's not a sure thing next year as it is this year.'",
        "'speaker_3': 'Correct.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'Right. Councilwoman Kennedy, I'm going to go pop on to Gilmore. Councilwoman Gilmore.'",
        "'speaker_9': 'Thank you, President Brooks. You know, I have had a lot of careful consideration, and I've heard passionately from stakeholders, development, community and families and service providers for District 11. And I, unfortunately, will be voting against 626 tonight. And the reason is because we have an overwhelming need in our communities in specifically Montebello and Green Valley Ranch.'",
        "'speaker_9': 'We have to act now. Families are struggling in our city, and when families are struggling, our children are at a far greater risk for many adverse circumstances. That, especially for African-American young men, can change the trajectory of their entire lives.'",
        "'speaker_9': 'And housing is a foundation for our families. And this past months, my council office, we've been helping families who are on survival mode. They can't find places to live. They're Section eight vouchers. There's no place for them to go.'",
        "'speaker_9': 'And we're just trying to keep them where they're at. And there's one woman who really put it home for me. She has five children. She was in a housing situation with her husband and her five children that they were going to be evicted.'",
        "'speaker_9': 'And she came into my office and she has her little kids with her. And she's telling me this story and she's sobbing and for, you know, a child to see their mom in that sort of situation, that's an environmental stress that that child will never forget that experience with their mom.'",
        "'speaker_9': 'And we have to do something now. We cannot wait another year. Montebello, where I live, is one of the most diverse communities in Denver, combined with Green Valley Ranch. The community that I'm part of, I'm very, very proud to say, is over 76% people of color, 76% people of color, African-American and Latino.'",
        "'speaker_9': 'And the statistics show that people of color have been disproportionately affected by housing and how it affects their families. And the median income in Montebello is a little bit more than $44,000. In my opinion, we need to give the Office of Economic Development the opportunity to set up right, to do this right, and to start out slow'",
        "'speaker_9': 'and be strategic and make sure that we're setting up a great foundation for us to build this fund even bigger. But at the end of the day, I have to be able to go back to my constituents and say that we are hearing them, we're hearing their cries, we're hearing their pleas, and we're making sure that we're'",
        "'speaker_9': 'doing this for our families in our community. And that reason I will be voting against 626 because we need to do something now. Thank you, President Brooks.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. I'm going to skip down from her neck in each and go to Councilman Cashman.'",
        "'speaker_12': 'Thank you, Mr. President. This evening I'll be supporting the original Bill 625 to expand the inventory and the opportunities for affordable housing in Denver. I want the pot of money to be larger, and we'll continue to work for that outcome.'",
        "'speaker_12': 'We'll hear about the length of time that locks in the development impact fee in Bill 625. And I want that to be shorter. And we'll continue to work for that outcome, no matter how large a piece of the pie we carve out this evening.'",
        "'speaker_12': 'We're not going to solve this problem on the short term. But by starting this program now, we can begin to bring a new funding stream into reality and begin the process of a more aggressive approach to affordable housing now.'",
        "'speaker_12': 'I recognize that the development community is not happy with the new impact fee and feels already overburdened by the Gallagher amendment, which slants the majority of property tax toward the commercial sector. I take no issue with that concern and I think it's valid.'",
        "'speaker_12': 'I also recognize that homeowners are not pleased to take an additional hit on their property taxes because they already feel overburdened by continued cost of living increases that are outpacing increases to their income. We are simply in a situation where our needs as a city are exceeding our current level of funding capacity, and we're asking everybody to'",
        "'speaker_12': 'take a bigger bite. It's an important issue and we're asking everybody to take a bigger bite. While I appreciate the mayor's willingness to carve $5 million out of our general fund revenues to give this program a quicker leg up, I would ask my colleagues to temper their enthusiasm to dig into our city's budget reserves.'",
        "'speaker_12': 'I understand we're currently comparatively flush in excess of our statutory requirement for budget reserves. But I also remember that during our recent downturn, we were forced to reduce funding for critical services and when some five years without hiring a police officer.'",
        "'speaker_12': 'I don't want that to happen to us again. It put us in a bad position that I'd like to protect against. I'd also urge my colleagues to be patient in their call to use, quote, that marijuana money. While 20 million did go into our general fund and I share the desire of many of my colleagues to see'",
        "'speaker_12': 'that that money are used in a more transparent manner. My preference would be if we're going to single that particular stream of money out and to pinpoint it, I'd like to see it earmarked for critically needed mental health and drug treatment services.'",
        "'speaker_12': 'Finally, I want to sincerely thank Councilman Herndon and Espinosa and Councilwoman Ortega for their hard work on this issue, because I think the fact of their I've seen it happening, that the fact that they're proposing this alternative ordinance and raising a number of very important issues is is going to make the original bill far stronger.'",
        "'speaker_12': 'And I look forward to the discussion in the next couple of weeks to making it even stronger yet. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Cashman, I. I see all sponsors on here except for the bottom. Councilman knew someone to go to him, and then we'll take it from Councilman Neal. Okay.'",
        "'speaker_4': 'Thank you, Mr. President. Like all the major issues this year, I've always enjoyed serving my constituents to find out how they feel about issues. And I did that with this bill. And I've had over 500 responses so far.'",
        "'speaker_4': 'The survey is still going on, and it's very interesting results. There's no question all the residents who are responding agree with us that there is a crying need, a significant need to have for affordable housing, not only in terms of funding, but also in the number of units that we need to produce.'",
        "'speaker_4': 'You know, much more than probably what the mayor's proposing. Also there, there's a real confusion about the sources of revenue. There's a there's so much confusion. And what troubles me the most about my survey is that 20% of the residents say we need more information.'",
        "'speaker_4': 'We need to know more about what this program's all about. And I looked and I as I listened to that and thought about it and. Last Friday morning, we had a very good little discussion with Jonathan Rose, who is a real developer of affordable housing, is very smart, intelligent man.'",
        "'speaker_4': 'And everyone was discussing there how much we need to educate the public, understand how to communicate to the public using social media videos or whatever. And I'm not sure we've done that. I went back and looked at our website and looked at the OED website.'",
        "'speaker_4': 'I could barely find affordable housing on the website I found I saw a permanent fund. There it was. And we're still talking about the same number of units, 600 units a year and not anything more than what's being projected.'",
        "'speaker_4': 'So I really I'm going to support I really want to support both bills tonight because we really need another more discussion and especially about what we're going to be doing and the amount of money we need to to make a real difference in affordable housing.'",
        "'speaker_4': 'I'm not sure the food we've been talking about $15 million for a whole year. I don't see how we've done anything better than they're still talking about 600 units rather than more than that. So I think we really need to have a much more in-depth discussion over this next week, two and two from both bills.'",
        "'speaker_4': 'So I'll be supporting both bills tonight. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Noon. Councilman Herndon.'",
        "'speaker_6': 'Thank you, Mr. President. Brendan, because you want to ask a couple of follow up questions. I want to make sure a person may ask this question. So when it seems as if people will say, well, 628 I'm sorry, 626 will cut services in a future budget cycle which you said it depends and that and but but you'",
        "'speaker_6': 'were making that conversation off of some assumptions. So I was hoping if you could talk about some of those assumptions so I can make sure I understand it.'",
        "'speaker_3': 'So so what I was representing before is that if we maximize that, that, that revenue cap so that 6%, if we have 6% or more reassessment growth in 2018, there would be sufficient revenue available to dedicate a half mil as part of that conversation.'",
        "'speaker_3': 'That said, before I even go to an alternative from that, we have typically used that reassessment value to be programed for other city services in the general fund in our Human Services funds. So I just wanted to make sure that that was clear, like, like we did last year.'",
        "'speaker_3': 'We use those funds for city services. So that would be a tradeoff if we were to use the that that capacity in 2018 for affordable housing. What I was representing is my second part though is let's say that it came in something underneath 6%.'",
        "'speaker_3': 'Well, then that revenue cap wouldn't be maximized and there would be you would have to convert some mills that were based on reevaluation, but some that were based off of just the existing mills that we've already have on our books at this point in time.'",
        "'speaker_3': 'So it really depends on what that reassessment level is. I was not trying to suggest that we would be cutting services due to that tradeoff, but it is a is a competitive environment in the 2018 budget to either program, those revenues for city for city services that are not affordable housing or for dedicating it to affordable housing'",
        "'speaker_3': 'solely.'",
        "'speaker_6': 'Correct. Well, whether you allocate a mill next year or you allocate a mill this year, you're taking away money that could go to something else that will now go towards affordable housing.'",
        "'speaker_3': 'So the plan from 625 is a half mil this year. There is we have not proposed in the 2017 budget process that you see in the book an alternative that we'd say, well, it's either a half mil for affordable housing or you could have done this.'",
        "'speaker_3': 'You're right, there is not an option or an alternative there that is not contained in the budget process. That is more likely a situation in the 2018 budget in terms of the funding for affordable housing in and of itself.'",
        "'speaker_3': 'You're right that the value of a mill in 17 and what we would probably see in 18 is around the same value. There could be a few hundred thousand dollars worth of difference. So in terms of the value created that would be dedicated to affordable housing for a value of half of mil, it would be about the'",
        "'speaker_3': 'same.'",
        "'speaker_6': 'Correct. So and this is what I would make sure that I'm understanding whether you allocate a mill, a half a mill this year or next year. That's a half a mill that you no longer have to go toward something else.'",
        "'speaker_6': 'Correct.'",
        "'speaker_3': 'It is.'",
        "'speaker_6': 'Okay. And there are a total of essentially, I understand that question, how much money did we get? And this past year from marijuana revenue, the 3.5%.'",
        "'speaker_3': 'The 2016 number from this past year? Oh, I believe that was the that was the number that Councilman Black stated in 2015. I don't remember it off the top of my head, but I'll I'll say that she's done her research.'",
        "'speaker_3': 'And I believe she had stated it was a total of 22 million. I'm sorry, 29. I don't I didn't have that with me.'",
        "'speaker_6': 'Sorry. And so that was just from the 3.5%.'",
        "'speaker_3': 'That is not just from the 3.5% annual rate.'",
        "'speaker_6': 'That's from the special rates. What I'm getting at the 3.5.'",
        "'speaker_3': 'The 3.5% special rate, I believe, was about seven, $8 million.'",
        "'speaker_6': 'Seven, $8 million. And so we have a latitude as a council to increase that all the way up to 15. Not that I'm suggesting that we do that, but with that is the flexibility that the Council has.'",
        "'speaker_3': 'I believe when the special rate was passed, it allowed a ceiling of 15%.'",
        "'speaker_6': 'Okay. Quick questions about our general reserves. So the mayor's proposed budget, I believe he brings down the general fund revenue to 15.2%.'",
        "'speaker_3': 'The general fund, the proposal would be proposed to stand at 15.2% effect.'",
        "'speaker_6': 'If this bill moves forward and has the conversation about taking an additional money out of the reserves, assuming the administration doesn't want to take from anywhere else the additional 15 million, what would that take our reserves to?'",
        "'speaker_3': 'So I believe that the the proposal that's in front of us funds $20 million total. If you assume that the 5 million that is already contained in the 2017 budget counts, against that, you would be looking to fund $15 million.'",
        "'speaker_3': 'We would move from 15.2% to 14.1% and.'",
        "'speaker_6': 'Reserves 15.2 to 14.1. And I do want to correct one of my counsel. There's not statutory requirements for budgets, a policy in 10% in recessionary times, 15% in good times.'",
        "'speaker_3': 'It is not statutory. It's financial policy. And it's something that the bond ratings look at when we review our credit rating. Absolutely.'",
        "'speaker_6': 'So to go 15, an additional 15 million would take us to 14.1. We program the budget every year to bring us down to 15%. Correct.'",
        "'speaker_3': 'That is typically our target. It's hovered around 15.1. 15.2, I think last year was 15.3.'",
        "'speaker_6': 'So last year, 2016, our budget revenues, our reserves ended up even though we programed it to 15%, we ended at what percent.'",
        "'speaker_3': 'We ended last year, I believe it is at 24.2%.'",
        "'speaker_6': '24.2. So and this year was 19%.'",
        "'speaker_3': 'Right now, our year end forecast for our reserves for 2016 is 19.3%. Okay?'",
        "'speaker_6': 'So we're consistently doing better than we have. And not to imply that that is would ever remotely continue on to that type of level. But we have we're you know, we're making a couple of assumptions of doom. So I like to make some assumptions of, hey, we're doing really well.'",
        "'speaker_6': 'And I guess my last part. Thank you, Brian. And Mr. President, comment, you know, the the the mill linkage fee a year from now is if as this body cannot come up with more money quicker and I certainly can't guarantee that that is something that we will do.'",
        "'speaker_6': 'But we had this conversation about marijuana that we weren't comfortable with the legislation and we took 120 days and this body came up with Maryland marijuana legislation. So I believe I am I am confident and comfortable that this will not even be an issue.'",
        "'speaker_6': 'But it's certainly a realization and a possibility. That's why I just wanted to point out, where do you allocate a mill next year or a half mill next year or half mill this year? There is less money in the pot and that's a policy choice that we make because affordable housing is important.'",
        "'speaker_6': 'But I'm willing to make that to know that we can do more sooner. Figures present.'",
        "'speaker_0': 'All right, Councilman Espinosa.'",
        "'speaker_2': 'Brendan, the how many available mills do we have this year? If we wanted to capture.'",
        "'speaker_3': 'For the the general fund and human services. His funds, I believe it's 11.400. They're available this year. I'm sorry. I was talking about the total.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_3': 'Johnson. Yeah, 1.3 million. That would be underneath that that 6% cap.'",
        "'speaker_2': 'And about how much money would that generate?'",
        "'speaker_3': 'That's approximately 17.3 million.'",
        "'speaker_2': 'So we could put a bill for infrastructure, for arterial paving, additional police. Actually, we have those both in there. Do you know what those numbers are? And I apologize. I just got back at 3:00 to.'",
        "'speaker_3': 'Sure. I believe the arterial paving. So that's the 37 position. Street crew and capital funds is about $7.78 million in total. The police officers that we've added in terms of authorized strength, I think are about four and a half, $5 million.'",
        "'speaker_3': 'But that's without.'",
        "'speaker_2': 'Equipment. Yeah. So we could add we could pay for those with an additional 1.3 and now we liberated $17 million into that. We've added $17 million into our general fund.'",
        "'speaker_3': 'That's the prerogative of counsel to to respond to the mayor's proposed budget.'",
        "'speaker_2': 'And that would be more we wouldn't get into that. So how much while you answered this, said the 8 million. I mean, last year we we allocated $8 million out of our budget where we're allocating $5 million this year.'",
        "'speaker_2': 'Is that correct?'",
        "'speaker_3': 'That's correct.'",
        "'speaker_2': 'Okay. Question for Evan. So at the last council presentation on this, you stated that the mayor was going to allocate $9 million to this and now it's five in the budget. What happened?'",
        "'speaker_4': 'I don't recall the $9 million figure.'",
        "'speaker_2': 'Oh, was I? What was the $9 million? How is that? My wrong. No. All right. I stand corrected then. No problem. The. The question for I regarding the Nexus study, when was that finalized?'",
        "'speaker_5': 'Sure. So this is I'm Laura Fortensky with the Office of Economic Development. We have the final Nexis study uploaded as part of your documents for tonight. It was submitted to the city on September 8th last week in conjunction with the bill.'",
        "'speaker_2': 'Yeah. So I just that's that's going to be crucial information in my final comments. But yeah, literally last Thursday is when we finalized the next US study, even though the bill was submitted. Well well, essentially the same time.'",
        "'speaker_5': 'But will note that there were almost no changes between the final draft and the public review draft that was submitted to council as part of a committee meeting in July. So there were some final touches put together in the final draft that was submitted to council for your review.'",
        "'speaker_5': 'But it did not have substantive changes since the last public review draft that was submitted earlier this summer.'",
        "'speaker_2': 'But so, I mean, that's what the part is. The narrative that I'll go into subsequently later and thank you for whoever produced this fine timeline is is that really literally if we hadn't delayed, we are spending eight weeks hammering out this affordable housing bill as a body with the draft version of the Nexus study.'",
        "'speaker_2': 'When we actually delayed it, when we were actually going to fast track it even faster. One of the things the key points in in the bill that we're doing, that Councilman Herndon and Councilwoman Ortega and I are sponsoring, is to buy the time for council to be involved in that discussion, not just as reported by John Murray'",
        "'speaker_2': 'in the in the Denver Post Council President Mina Council President Brooks, Robin Kennedy and the mayor. I mean, that is we're the body of council. We're the ones that are going to be passing this legislation. And I believe that there are better tools that we can actually come up with at this time, because the need is very'",
        "'speaker_2': 'clearly stated in the declaration portion of this ordinance. Yet even you can actually. Here's a question I can't ask you. Did you not state at that last meeting that this was a modest and balanced approach and that's what you attempted to do, even though the declaration makes it very clear that there's a pressing need for affordability that'",
        "'speaker_2': 'we have lagged behind on? That is correct. Yeah. And so we have the political will on this body and that actually I'm going to stay off the comments until the questions have been answered. Thanks.'",
        "'speaker_0': 'Okay. Thank you. Guess when. Espinosa Councilwoman Ortega, thank you.'",
        "'speaker_8': 'I have a couple of questions for Brandon. So the first one is just asking for clarification on whether or not we have. Utilized. Or I should say, expended the obligation to the. So under Denver Road Home, we built new units we and the mill levee, the DHS mill levee was utilized to I don't remember if it was'",
        "'speaker_8': 'for the service side or it was actually for the Hart cost side. But we obligated those dollars for 20 years. So has that been exhausted? Have we read? What have we done? Anything different with the those particular meals that were obligated for that housing that was done by Denver at home?'",
        "'speaker_3': 'I don't have that information with me tonight, but I can follow up with my staff on that.'",
        "'speaker_8': 'Okay. That would that would be good to know because it lets us know kind of where we're at and what's still available. So you indicated that we're 1.3 meals under the 6% cap. And initially these housing conversations started at the possibility of utilizing a full meal.'",
        "'speaker_8': 'Right. I'm not sure why we didn't stick with that full meal and ended up just being a half meal. But my question to you is whether or not the administration intends to utilize the remainder of that 1.3 mil if we're using half of it for housing.'",
        "'speaker_3': 'So that 8/10 of a mil is not programed in the 2017 budget.'",
        "'speaker_8': 'Okay. All right. Let me go on to my next question. How? How far? So every year the administration draws down on the reserve fund. What is the expectation of how far that's going to be taken down to by the end of 2016?'",
        "'speaker_8': 'I mean, I heard the conversation earlier, but.'",
        "'speaker_4': 'Our current.'",
        "'speaker_8': 'Is asking directly would we anticipate to draw that down to.'",
        "'speaker_3': 'Our current year end forecast for the reserve balance for 2016 is 19.3%.'",
        "'speaker_8': 'Okay. Okay. You've answered all my questions. Thank you. Sure.'",
        "'speaker_0': 'Thank you. Can someone can reach us? I see that you're up.'",
        "'speaker_13': 'Yup. Thank you. Brendan, one more question. So I want to do some different math. Councilman Herndon asked the question about if you took the entire 15 million and you know, what would the reserves go down to? And your answer was 14.1%.'",
        "'speaker_13': 'If members of this body wanted to honor our adopted policy to maintain reserves of 15%. Can you walk me through the math of what would have to happen for this body to fund $20 million of affordable housing in 2017?'",
        "'speaker_13': 'Sure. I want to really keep emphasizing this bill does not fund $1 in 2017. It will require a different action and that different action will occur in the context of a budget that has already been proposed. So I want to just clarify how or whether we could stay at 15% reserves and what that would look like.'",
        "'speaker_3': 'So I would assume that the Council would then propose to draw down and move from 15.2% reserves to 15 even that would draw it make $2.6 million available.'",
        "'speaker_13': 'So we've got five plus 2.6, right. Okay.'",
        "'speaker_3': 'So that would mean another $12.4 million would have to be identified out of the existing proposed budget.'",
        "'speaker_13': 'Okay. Thank you for that clarification. I see we have others chiming in. And so I'm just going to go ahead and just make a few of my comments now, which is that I also appreciate that there is a desire to continue the conversation for more sources, and there is no reason why those conversations can't continue with the'",
        "'speaker_13': 'two sources that we have in front of us. Dedicated. This city has a five year housing plan. We did not adopt it as a council, but it is a city plan. It has been guiding the department. We got briefed on it.'",
        "'speaker_13': 'We all had one on ones. And that plan number one goal is a dedicated revenue stream, not a one time, not a scraped from the reserves, not a, you know, out of the couch cushions in a good year.'",
        "'speaker_13': 'It's a dedicated fund. The mayor held a housing task force. Every letter we've received talks about permanent revenue. Permanent revenue. This bill puts that at risk. It puts it at risk by putting it in competition. So we don't we will have certain certain competition for 2017.'",
        "'speaker_13': 'We will either be competing with our reserves or we will be competing with other services, period. That's what we have. We have $7.6 million. We do not have 15. We don't have 20. So you'll either be competing with our own reserve policy and our bond ratings or you'll be competing with other services.'",
        "'speaker_13': 'So be very clear. 2017, not more money, not free money. Not easy money. Competing money 2018 and beyond. We risk not certain, but we risk competing with other services. We also will lose money on the linkage fee side.'",
        "'speaker_13': 'Even if you adopt the same linkage fees in 2018, there will probably be less development occurring because of natural rhythms of cycles. So you will capture less of that of that development due to the natural downturn that comes right.'",
        "'speaker_13': 'We all hope it's not deep. We all hope it's not long lasting. But I think we've all been around long enough to know that it comes. You also will lose one year of CPI index on the linkage fee rate.'",
        "'speaker_13': 'So every year the the the the original bill 625 has the has the index on the linkage fee index to CPI, which means that if you start the base a year later, you lose the CPI for an entire year.'",
        "'speaker_13': 'Those are real dollars. So in reality in reality, this bill competes with 2017 with other uses in policy. And in 2018 it will be less money, it will be less money because it will miss an entire year of CPI.'",
        "'speaker_13': 'So those are the realities. We can continue to debate all the other potential sources. There is a timeline in front of folks and maybe we can wait and talk more about that on the other bill. Happy, too, to defend the public process and acknowledge that no process is perfect.'",
        "'speaker_13': 'But this council, this council has been briefed on this concept since early last year. Since July of last year. So this council was not the last one to hear about these two sources. They were not the last ones to give input.'",
        "'speaker_13': 'They have been briefed for over a year. And I realize that these things are hard and we need to keep debating them. And I'm happy to keep doing that. We'll keep doing it probably for a couple more hours.'",
        "'speaker_13': 'But I would ask that we make a prudent decision tonight and vote down this bill in favor of the later bill so that we can both responsibly fund 2017 and so that we can put in a permanent ground game, not just a first quarter Hail Mary, but a permanent, slow growing, permanent ground game for decades to come'",
        "'speaker_13': '. Mr. Leader. Bill, thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. Appreciate the football analogies. Councilman Clark.'",
        "'speaker_4': 'Thank you, Mr. President. Brendan, can you come back up? First of all, I just want to commend you. I was sitting here watching you answer all of these budget questions, pulling numbers out of thin air. My favorite moment is when you got the question about 1.3 mills and you're like, Oh, that would be approximately $17.3 million in'",
        "'speaker_4': 'my brain. Approximate would have rounded to a round million. So it's just very impressive. And taking all the questions and I apologize because you answering my questions must feel a little bit like talking to a kindergartner about this.'",
        "'speaker_4': 'So I apologize in advance. Walk me through total revenue. Let's not talk about Mills and let's assume that we can capture the mill in either year. So making some general assumptions that may or may not be true, total revenue coming into the city if we capture the mill in 17 versus capturing it in 18 at that point'",
        "'speaker_4': 'in 18, are we capturing the same amount of money? Total revenue.'",
        "'speaker_3': 'So it depends. I'm sorry to start with that explanation. I don't like doing it, but I have to. It depends on the reassessment values in 2018. So let's just let's just imagine a situation, though, where there are there's no reassessment growth at all.'",
        "'speaker_3': 'It's just flat. There's no growth. If you just held the mills constant, the $6.5 million that we're estimating that the mills are worth in 2017 would be the same value that would be collected in 2018.'",
        "'speaker_4': 'But but if assuming we still have the ability to capture that half mill rate, there is some lost revenue by capturing it in 18 versus 17, even if the mills total mill rate is the same at that point.'",
        "'speaker_3': 'It would be it would be small in terms of the overall value of a half mill at that point in time.'",
        "'speaker_4': 'And. Okay.'",
        "'speaker_3': 'I'm a man. Am I answering your question?'",
        "'speaker_4': 'I hope so. Yeah, I'm still trying to wrap my brain around it. And then my other question is in terms of, you know, lost capacity. Right. So if we capture if we were to capture the full 1.3 this year, is that then 6% growth based on that new floor or is that still an 18 still based I'",
        "'speaker_4': 'mean, do we permanently move that up when we capture them at the point at which we.'",
        "'speaker_3': 'Get it is a new base that that 6% is calculated off of.'",
        "'speaker_4': 'So that the total potential revenue to the city if you capture in 17 is 6% above what's captured versus not capturing at all. We go to 18 and our even even if we were to still have the opportunity to take 1.3.'",
        "'speaker_4': 'You're working from a lower floor. Hmm.'",
        "'speaker_3': 'I'm doing the math, and I'm trying to. To to make sure I'm following. Maybe one more. Say one more time for me.'",
        "'speaker_4': 'I'm just in search of the 6%, which is the anti spiking provision rate. So that 6% is set every year based on what we actually capture. So if we capture it.'",
        "'speaker_14': 'From the half year or.'",
        "'speaker_4': 'Whatever we capture this year, that moves the floor and 6% goes up from there. Correct. In terms of the other mills that were already authorized by voters and whether we capture them or not. Right. Moving to 18 and we haven't captured those, that's 6%.'",
        "'speaker_4': 'So our ceiling is based on lower floors.'",
        "'speaker_3': 'Based on a lower base.'",
        "'speaker_4': 'Absent the mills different, total revenue is slightly lower at some level because.'",
        "'speaker_3': 'If you want to take into consideration the difference in the base, it would be incrementally different. Yes.'",
        "'speaker_4': 'Thank you. Thank you very much. Thank you, Mr. President.'",
        "'speaker_0': 'All right, Councilwoman Sussman.'",
        "'speaker_5': 'Thank you, Mr. President. First of all. When we're not in public hearing, we don't have question period and then comment period, do it. We can do both of those at the same time. Right. We don't separate them out.'",
        "'speaker_5': 'Yeah, I just want to make that clear. Also, I wanted to say that one of the things that it's pleasurable for me up here is that we all want the same thing. We want to find as much affordable housing as we can in the best way we at West Best Way We Can and in the work that'",
        "'speaker_5': 'Councilman Cornelius done and Councilman Brooks has happened over several years, and it wasn't done just by Councilman Brooks and Councilwoman CORNISH and the mayor. It was done by lots of people, and there were lots of opportunities for council to engage in those meetings and talk about it.'",
        "'speaker_5': 'It's very difficult tonight to have a very complex bill come at this time. It would be nice to have more time to consider a bill. And again, you know, I find us doing a lot of committee work on the on the dais, and that's uncomfortable.'",
        "'speaker_5': 'I really appreciate what Brendan has done and trying to explain to us about what the differences are. I need to put it all in a pencil and a pencil myself. It's unfortunate that I probably have only one week to do that to see what the differences between 626 and 625 and wish that the the ideas had come'",
        "'speaker_5': 'a little sooner in the in the process. But I will be putting this forward for next week to give myself a little bit of time, although I am still very much in favor of the original 625 Bill. Thank you.'",
        "'speaker_0': 'Thank you. Councilman. Assessment. Councilwoman. Councilman. New.'",
        "'speaker_4': 'Question, say, on the property tax assessment. You know what? We've I guess we estimate, what, about $360 million in property tax this year for the city? Right.'",
        "'speaker_3': 'I believe that's a across all sources.'",
        "'speaker_4': 'Across all sources. And so for an assessment, what what percent would it have to be to get the, say, ten or $15 million in additional tax?'",
        "'speaker_3': 'Just raw from the assessment in and of itself, you needed to.'",
        "'speaker_4': 'Say we're going to say we're going to that we're going to generate additional tax because of the assessments are going to.'",
        "'speaker_3': 'Go up. I'm not texting on my phone. I'm like calculator really quickly because I do not want to state the wrong number.'",
        "'speaker_1': 'I'm guessing three or 4%.'",
        "'speaker_3': 'So. Well, that's a cross that's all across all funding sources. So probably which wouldn't all be available in order to fund this proposal.'",
        "'speaker_4': 'If we don't run into 6%, then we would have.'",
        "'speaker_3': 'All right. Well, let's just let's just say that we use the value of our general fund at this point in time. So that's $180 million that is currently being proposed in the 2017 budget. At this point in time.'",
        "'speaker_3': 'Again, remember, the half mil is not in that general fund estimate. You would need 12.7% growth. In order to collect $15 million more in the next year. So that would be well in excess of the the anti spiking provision.'",
        "'speaker_3': 'That was the easiest math for me to do right now.'",
        "'speaker_4': 'All right. So it's not a proportion of the increase in property tax only. So the assessments go up 4%. We're not going to generate 4% more in property tax.'",
        "'speaker_3': 'We would because that is under the anti or the revenue limit and to to pay only for the affected funds. And I'm sorry, I'm getting into like a big time property tax inside baseball here because.'",
        "'speaker_4': 'If we don't run into the cap, then we could we have that money available to, you know, 4%. It's like 12 to $15 million.'",
        "'speaker_3': 'With if you had growth rate of 4%, that would be within the cap.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'Thank you very much. All right, Councilman Flynn.'",
        "'speaker_4': 'Brandon.'",
        "'speaker_3': 'I think I'm just going to stay up here.'",
        "'speaker_4': 'As much as you want to rest on those hard pews out there. Couple of questions now. The mayor's budget came out today and I know this isn't a budget hearing, but just just to clarify segments, the next question, you would probably know that the first two pages I would look at would be the police academy class.'",
        "'speaker_4': 'Thank you very much. 100 new officers, the way I read it and in academy next year. Thank you. And but the second one thing I would look at would be schedule 100. Right. And in last year's budget, we thought that we would end this year with an unassigned fund balance of $191 million, give or take.'",
        "'speaker_4': 'And I see that we actually are now projecting about $60 million more than that. Is that am I reading.'",
        "'speaker_3': 'That correctly for the revised 2016 budget?'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'So I think that was the 196 that you mentioned. 191 191. You could compare that against to 51. So that's.'",
        "'speaker_4': 'Exactly right.'",
        "'speaker_3': 'That's right.'",
        "'speaker_4': 'Okay. So in 2012, I just want to make sure I understood that correctly. In 2012, the voters passed to a which allows us to increase up to our maximum lawful mill levy, which is what it's 20, 22 point something.'",
        "'speaker_4': 'Right. And where are we now?'",
        "'speaker_3': 'We are at I believe it is 80, 17, 18.'",
        "'speaker_4': 'Mm hmm. Okay. And just a devil's advocate question. You said that we have under the the growth that 6% in the growth and the cap for the cap on growth, we could go up 1.3 mills. Correct. But this budget only recommends point five.'",
        "'speaker_4': 'Because the voters.'",
        "'speaker_3': 'Contained the point five yet. But yes, it would if the 625 was correct.'",
        "'speaker_4': 'Okay. Because the voters told us in 2012 that we we may go up to our lawful maximum. Why are we not taking advantage of that from year to year?'",
        "'speaker_3': 'So I think we've tried have been be been sensitive to the fact that we've seen such large valuation increases in previous years. Last year the average was 26%. Having gone to community meetings, I've I've met folks who have had 50 to 100% valuation increases and that's just on residential property.'",
        "'speaker_3': 'So we've been trying to be sensitive to that.'",
        "'speaker_4': 'Okay. Very good. So that will preserve our cap, our capacity for down into the future years where we can use and those inactive mills for other purposes down the line as opposed to once we hit our maximum, then we're done with to a correct.'",
        "'speaker_3': 'Correct. We have that ability to manage those.'",
        "'speaker_4': 'Okay. I appreciate that you said that because 26% was exactly how much my own property tax was. Thank you. Sure.'",
        "'speaker_0': 'Councilman Espinosa. Okay.'",
        "'speaker_2': 'I think I have a question. I don't know who it's for, but again. I thought I saw a commitment to 9 million and maybe it's maybe my my years are wrong or what have you. But it was reported in the Denver Post that the this is a quote the plan did called for devoting about $10 million to'",
        "'speaker_2': 'the new program next year, but has been increased to $15 million by drawing on reserves, including 1.5 million in proceeds from the city's special 3.5 sales tax on recreational marijuana sales, which was mentioned in the committee. What but does anyone want to address that?'",
        "'speaker_2': 'I mean, tell me how that how that got reported to the public and what that means.'",
        "'speaker_4': 'Councilman. I think that originally we were not proposing the $5 million in the 2017 budget, but in response to, I think, input and feedback from City Council, we went ahead and proposed our proposing $5 million from a couple of different sources in the 2017 budget.'",
        "'speaker_4': 'It is our hope that City Council would pass 625, which would essentially provide another $10 million also in 2017 for a total of $15 million.'",
        "'speaker_2': 'Okay. So it's the the $10 million is the blend of the linkage fee and the 6.73 million and property tax. Correct. So 3.7. So about a third is from the developer fee and a in three quarters is from mean two thirds is from the property tax on property.'",
        "'speaker_4': 'For what would be year one of the program contemplated in.'",
        "'speaker_2': '625. Yes. And that's based on sort of record levels of development right now. Okay. So we do we expect that ratio to maintain at one or two thirds or actually decrease on the development side.'",
        "'speaker_4': 'Over time, over ten years, over the first ten years of this program. It's pretty close to even. Property tax.'",
        "'speaker_2': 'Three. Linkage fee. So on a.'",
        "'speaker_0': 'Jump in real quick council can each.'",
        "'speaker_13': 'Can can I help answer your question Councilman Espinosa the reason the figure is so low for year one is because projects that are already in the pipeline, that have already passed site review and building permit, even if they haven't broken ground yet, won't be required to pay the fee.'",
        "'speaker_13': 'So a whole bunch of the projects, even though the ordinance goes into effect January 1st. But if you think about it, the first six months of the year, the construction that you see around town, we'll have gotten site review and permits six months prior.'",
        "'speaker_13': 'So we are only applying the fee to folks who have not yet gone through that gate. And we do have CPD here if you have any questions about that. But this is this number is a one time delay due to the start up of when new projects are are brought into the system.'",
        "'speaker_13': 'But due future years it will be based on the total development cycle. But but this year's delay is this year's amount is lower not because of the development cycle. It's it's because of the start up delay that most of the construction you see got its permit earlier.'",
        "'speaker_2': 'Do we have to maintain these sort of astronomical records of developed square footage to maintain that 5050 ratio? Or what what what is the sort of amount of development relative to what we're producing today? To maintain that ratio.'",
        "'speaker_13': 'We may want to ask Justin to come up. The the answer is that the department did a 15 year look back and they chose not the most conservative estimate and not the most aggressive estimate. They chose what they called the average estimate of of development activity to to achieve the development revenue that we have projected.'",
        "'speaker_4': 'Justin Sykes The Budget Management Office. Yes, we worked with the assessor's office to pull data historically on how much new development has there been in Denver. And then we use that 15 year lookback period average. And so the linkage fees that are in the proposals are based on the average amount of new development over the past 15'",
        "'speaker_4': 'years, which includes two economic up cycles as well as two economic down cycles. And so working with CPD, working with the assessor's office, that seemed to be a good balance on which to base the revenue estimates.'",
        "'speaker_2': 'And that's great because again, what I had heard overwhelmingly was that it wouldn't be that from the from the from the people, at least in my district. And I think similar numbers are represented in councilman news is that the expectation was is that the public meeting that the development community actually bear a greater burden in this in'",
        "'speaker_2': 'this fund? Not a they weren't looking at a balanced approach. I understand why, but it just seems like that has been. Well, actually, I'll just go into my comments because that's where I that's where I started in the development committee is not going to I hear this, but who do I credit for this public and council process'",
        "'speaker_2': '? Timeline developed for CB 625 that was presented here on our dais.'",
        "'speaker_13': 'I'm not taking any credit, so I know what shots I'm taking.'",
        "'speaker_2': 'Okay. No, this is this is wonderful. This is great because you did my work for me. But if you look at this, the thing that I started with, the very, very first item and it's dated July 2015 and it states one on one conversations with returning council members and newly elected members on the concept of exploring the'",
        "'speaker_2': 'property tax and linkage fee as a permanent funding source for affordable housing. That's where we were in July of 2015, actually, before I was sworn in and I in that meeting because I did have that one on one, I clearly stated why only 15 million knowing full well that we had greater need than 15 million.'",
        "'speaker_2': 'And I also asked for it to. I don't care whether that blend is as long as it's weighted towards the development community. That was not a public meeting, it was one on one, but it is documented here. And I thought it was important to to because one of the things that hasn't happened, the only thing that was'",
        "'speaker_2': 'decided since that moment in July of 2015 is what the blend was. We've always been talking about up to one mill and a linkage fee, but it was all remaining TBD. The Nexus study was in its formative stages.'",
        "'speaker_2': 'It hadn't been contracted yet at that point in time. But yet also in this document is the mayor's State of the City speech on 720 when we were all sworn in. Which states? Denver's Hancock says $15 million goal for new affordable housing fund.'",
        "'speaker_2': 'And so anybody who's been paying attention knows that that's all we've been talking about is $15 million and 600 units per year. 6000. Anybody else who knows this need knows that that is woefully deficient and doesn't come close to addressing the need that we have as a city.'",
        "'speaker_2': 'And so my issue is with how this proposal just maintains the status quo. And that is what 626 is intended to do, is actually have that discussion that I don't feel council has been proactively involved in, despite the constant briefings over the last year because we've been updated on the status of that thing.'",
        "'speaker_2': 'In general, generalizations are made about the comments from the stakeholders, but we don't have a robust solution. We just are going to generate money and we're going to spend money the way we always have. Another thing in this timeline is July 13th, as as Laura mentioned, which is when the draft nexus study came out, we were actually'",
        "'speaker_2': 'promised that in in late spring, July is is a healthy part of the summer. I was expecting it in May and this is a full two months later. And then on July 17th was this draft ordinance. And so, you know, a lot of us, you know, yeah, I'm a affordable housing former practicing architect in affordable housing.'",
        "'speaker_2': 'My the company I used to work for Northeast Denver housing is an advocate proponent of this, a 6 to 5 and probably not in favor of 6 to 6 because of the political process that has lined up all the usual suspects in generating support for this on the assumption that more money fixes more problems.'",
        "'speaker_2': 'But the problem is our solutions and how woefully they've been able to address the problem thus far. So more money doesn't in this case fix more problems. What we need is more creative solutions to actually get units into into a covenant, either short term, long term or permanent.'",
        "'speaker_2': 'But we we don't even talk about that because that's all deferred to some other board to have a discussion at some point in time. And why aren't we having that discussion about how do we actually do legislation and guide this process so that we're actually generating ample amounts of resources to actually creatively incentivize the industry to generate'",
        "'speaker_2': 'units or convert existing units into affordable. Those are all things that were discussed at the stakeholder meetings but aren't part of this ordinance. And so that's one of those aims of this 11 member panel is to finally vet those solutions and hopefully find something that would offset the need for a linkage fee.'",
        "'speaker_2': 'But if not, we'll go right back to this linkage fee. I mean, it's in the bill exactly the way it is right now. In 6 to 5, it's in six, two, six. And I happy with that. No, I'm sorry.'",
        "'speaker_2': 'Development community. I wish it were all higher across the board, especially in multifamily rental and yes, sorry of apartment lobby, but I would rather have that discussion and let the industry know that I stand firmly with the idea that we should put more money and more resources into this thing, but let the industry come out with systems'",
        "'speaker_2': 'and approaches and bring those to the city council modeled on the last five years of data. And I want that because the city generated that gentrification report. I represent Northwest Denver. No area has been greatly impacted by gentrification in Northwest Denver and losing affordable units.'",
        "'speaker_2': 'And they're getting displaced. It's displacing families. And so let's look at it. Let's see what's being proposed. Let's model it based on the last five years and see if we would have gotten different outcomes in northwest Denver. That's that should be fairly simple for a group of professionals.'",
        "'speaker_2': 'And the amount of money that we can put towards this, especially given the data is there the so it's it's and it's frustrating you hear me talk about the I show in my frustrations there and yes my bill our bill doesn't kill it right now because I don't want to create this sort of 12 month of 13'",
        "'speaker_2': 'month open window where we don't have a linkage fee. We have delayed property taxes and we don't have an IATO. Well, it would be good in a lot of ways. I actually think we would get a lot of.'",
        "'speaker_2': 'Permit requests for a bunch of projects that would then try to circumvent a linkage fee, which is three times the amount of this mean an h o fee, which is three times the amount of the proposed linkage fee.'",
        "'speaker_2': 'So what this represents right now is a very significant discount to what somebody would have to pay if they were doing multifamily for sale product. And it's distributing that among every square foot that's being built in the city, whether it's single family, duplex, multifamily, commercial and and and not.'",
        "'speaker_2': 'And so it's a good idea. It's but it's it's it's not strong enough. It is a modest and balanced approach. I mean, but we could have had that conversation back in July. Let's go half a mill and get the other half of the $15 million from the public.'",
        "'speaker_2': 'And it seems like all we did was spend a year vetting that. I mean, you know, writing the legislation and getting the proof to get that outcome when in fact, we have a Nexis study that says we could slap a very, very substantial fee on the development industry, you know, in the $7 range that we keep saying'",
        "'speaker_2': 'about Seattle, and then you generate millions, tens of millions of dollars more, which is actually what you need for this. So we have Brendan explaining that we could we could actually generate $17 Million, putting 1.3 in a bill for 1.3 mills and capturing it for arterial paving and sidewalks, extra police and some community planning staff to actually'",
        "'speaker_2': 'address the needs that I keep hearing about. You know, why is 38 not paid? Why is Colfax in crummy condition, you know, nor federal I mean grants there see that stuff and we don't go in there but oh so it's just it's just it it is a it is a sort of very calculated political process.'",
        "'speaker_2': 'And, yes, that's what I'm here for as an elected official now. But I still don't I still buy it. You know, we don't we shouldn't be in this business to sort of score points. We should be in this business to really aggressively handle the outcomes, especially when this day, as members of this dais, all sort of almost'",
        "'speaker_2': 'the majority, I think, feel that this is not going far enough because the tools aren't there. It's just more money. And I'm sorry, but everybody right now pays in the federal who pays an income tax is already paying for the affordable housing programs that we have in the city through federal grants, through the state, and through this'",
        "'speaker_2': 'through through HUD, into the state. And so now we're going to charge property taxpayers a portion of this amount while they're still going to have their federal income tax going to something else. I mean, that's what we're doing is we're offsetting losses in federal revenue.'",
        "'speaker_2': 'There's been losses in federal sources that we've relied on in years past that are going away. But so rather than and we're filling it up a little bit more than we were, and so that's what I'm saying, is the status quo has created an issue, I mean, has created an issue, but has not been able to adequately'",
        "'speaker_2': 'address the situation. And this solution is just a slightly higher amount. And we're going to continue addressing the situation as we have been and we don't really have tools. And so we need a year in a very focused effort, just like we did having having talks, but not to justify a 5050 modest and balanced solution.'",
        "'speaker_2': 'We can fund that through our existing general fund or through an extra mil. And then capturing that saving. I mean, that that net increase I mean, what Brandon just said is we had a we have 9 million in net, we're at 19, 19% and change.'",
        "'speaker_2': 'So even if we were to draw down a 1.1 and maybe I'm screwing up my, my, your my CFO skills, we would still not we would be at at 18 and change and and we would still be well in excess of our 15.'",
        "'speaker_2': 'Now you can't budget that way, but that's that's relative to our actual spending. So let's look at I mean, that's his job. Look at your actual spending and say, well, is there actual savings here that can in fact pay for this without a tax increase?'",
        "'speaker_2': 'But even if we do, let's do a tax increase for the things that people paid. I mean, that we were sold when we did to a. Because I was sold on improved paving through streets and a whole bunch of other needs that were being neglected during a recession that still seem to some, to some degree beginning neglected'",
        "'speaker_2': 'and capture that money for those resources, mean for those needs and then use that surplus or not surplus, but additional revenue to then fund this to the degree that we're talking about, which isn't $15 million or $10 million, it's 2020 plus.'",
        "'speaker_2': 'And that's right now. So I'm rambling.'",
        "'speaker_0': 'So, gentlemen, you got Joe and Clark still waiting and just wanted to make sure we still got another bill on the floor that you can get comments to as well.'",
        "'speaker_2': 'All right. I did have a messy sketch.'",
        "'speaker_6': 'Here of what I.'",
        "'speaker_2': 'Want to say, so I'll go through it real quick. People of color were mentioned, and that's what I'm saying. They have been disproportionately it was stated that they have been disproportionately affected, but they've been disproportionately affected by the status quo.'",
        "'speaker_2': 'Again, I've said it before, this just perpetuates the status quo and a lack strength, credit, creativity and guidance to do the much more. Much more than satisfied the political narrative of 150,006,000 units, which falls woefully short of the need.'",
        "'speaker_2': 'In the future. The political right now these days has the political will to do more and actually existing. On this day, I said, I've got a nice scratch, this girl. So yet the sponsors of this moderate and balanced proposal are trying to kill the debate by kill it by putting this measure on the floor and trying to'",
        "'speaker_2': 'kill it right now. I just asked that my colleagues move both for the benefit of Denver and its citizens. We need to be talking about real, real digging deep and finding solutions. And that's all that's all I'm looking for and doing because I can I'm happy to put this on tape right now, just like I would have'",
        "'speaker_2': 'done on the show had I been sitting at the dais here. It's not sufficient. And this we're going to be having this thing and there's a lot of talk about this is just a baby stepping. It's a foot in the door.'",
        "'speaker_2': 'And and now you got the justification. Now you've got the need. Now it's stated in the legislation on both of them, unprecedented level of property, population growth in the housing of the city has not kept pace with demand.'",
        "'speaker_2': 'So I don't know. I just urge my colleagues to move both and let us continue to have a discussion about how we actually can address true affordable housing needs, get the funding to the people that are doing the work and figuring out incentives to capture our are proposed upcoming legislation and and mobilize our industry to actually find'",
        "'speaker_2': 'ways to deliver units faster than we can because the units that we fund right now aren't going to go on market next year. There's a design process, a permitting process and a construction process, but yet there are units out there that we could capture, but we don't have the mechanism right now.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Councilman. Councilman Clark.'",
        "'speaker_4': 'Thank you, Mr. President. Mr. CFO, can I ask one more question? You had mentioned the bond rating. Our bond rating. And one of the things that they look at is that percentage of reserves. So is that is there a magic number in there?'",
        "'speaker_4': 'I know we've set a policy at 15. Is there a magic number on that side at 15 or is higher always better than lower as a general rule?'",
        "'speaker_3': 'They've affirmed our policy as strong financial management practices as well as the level itself. Back in 2007, when we established the Department of Finance, we did a blue ribbon task force that reviewed our fund balance policy because we got into conversations like this often about it, can we go below a certain level?'",
        "'speaker_3': 'And they established that policy to maintain a strong financial position that the credit rating agencies to look at for some sort of certainty. So that way they know that we're properly managing our reserves. So there isn't an absolute number.'",
        "'speaker_3': 'Believe me, I've asked about that in passing conversation because if the number, you know, 15 needed to be higher than that as we grew as a city, I would certainly be advocating for that as well. But they have continued to affirm that 15% is a strong financial position.'",
        "'speaker_4': 'So they've affirmed that 15 is strong, but they haven't told us that 14 would not be there.'",
        "'speaker_3': 'There's not there's not an equation that they would they would advocate for.'",
        "'speaker_4': 'Perfect. Thank you very much. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Clarke. And I'll just make a closing comment on on the bill that's on the floor as amended. You know, I have said this before. I said this over and over again, and I'll say it again, having been a part of a more open, inclusive, thorough process, both folks who are for against and everybody in'",
        "'speaker_0': 'the middle. And I'm so glad that councilwoman can each took time to put this thorough outreach process down. You know, Councilman Councilman Herndon said, you know, let's let the council get the opportunity to do this. Councilman Espinosa said, we haven't had the opportunity to get in.'",
        "'speaker_0': 'How we do business on this council is when we will deal with large issues. A couple council folks lead them. So for Sidewalks Councilman Clark, Councilman Cashman or Lena for short term rentals, you only have one partner and we didn't have a partner council assessment led that process.'",
        "'speaker_0': 'That's how we do things because we can't be experts or or passionate about everything. We let other council folks take the lead and we never get upset about that. That's just how we do business. And so I think it's important for the public to know that and clear for the folks up here.'",
        "'speaker_0': 'There was a comment that kind of irked me. It was called someone said usual suspects. These weren't usual suspects. These are called experts, both on the development side, on the on the affordable housing side. And so these are people that we go to to get advice.'",
        "'speaker_0': 'We are not experts in here, but there are people in our community that we trust. And we've had many public meetings where where community folks have gotten the opportunity to to share their opinion and most of the public meetings.'",
        "'speaker_0': 'The theme was, you're not doing enough. And gosh, I, you know, as a leader, really believe that. But there's this deal called fiduciary responsibility up here. And we have to know with the money that we have that we can actually build the units that we can actually deliver.'",
        "'speaker_0': 'No one in here can build 20,000 units. No one. But I know that if we can ramp up on a moderate and responsible plan, we can do that. I won't be supporting 626 because I've been a part of this thorough process, because I have been at the table when others who have been invited did not come and'",
        "'speaker_0': 'didn't show up. And I really believe that 626 is just another effort to go another year. We're going to come back to the table. No one's going to agree because someone at the end of the day is going to be unhappy.'",
        "'speaker_0': 'And we're going to be right here where we were on marijuana at a six, seven vote. We're in the exact same place and someone will not agree. So I will not be supporting this. I'll be supporting the bill next time.'",
        "'speaker_0': '625. I will say this. This bill and this discussion in this conversation has helped us all think about a bigger, bolder vision in the future. But the question is, what are we going to do today? That's the question.'",
        "'speaker_0': 'What are we going to do today? And so we all agree that we need to be bigger. We need to be bolder. And everyone out here is going to get that opportunity because you're all on record. So what are we going to do today?'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_6': 'Herndon, I.'",
        "'speaker_4': 'CASHMAN No.'",
        "'speaker_7': 'Kennedy No. Knew Ortega.'",
        "'speaker_5': 'Sussman All right, black eye.'",
        "'speaker_7': 'CLARK All right. Espinosa, I. FLYNN Hey. GILMORE No, Mr. President.'",
        "'speaker_0': 'No. And that's the voting. I close the voting, announce the results.'",
        "'speaker_7': 'Seven eyes, five knees.'",
        "'speaker_0': 'Seven eyes, five knees. Counsel Bill 626 has been ordered published counseling can each. Will you? You've caught out 625. What would you like to do with this bill?'",
        "'speaker_13': 'Thank you, Mr. President. I would like to request a combined public hearing of one hour combined with Council Bill 626 on September 19th, 2016.'"
    ],
    "A bill for an ordinance approving a Service Plan for the creation of Denver Connection West Metropolitan District. Approves the service plan for the Denver Connection West metropolitan district in Council District 11. The Committee approved filing this bill at its meeting on 8-9-16.": [
        "'speaker_0': 'Ten? Okay, ten, 10 minutes. So we'll be back here at 940. Thank you. We have three public hearings this evening. Speakers should begin their remarks by telling council their names, their cities of residence, and if they feel comfortable doing so, their home addresses.'",
        "'speaker_0': 'If you're here to answer questions only when your name is called, come to the podium, say your name, and let the council know that you are available for questions. Speakers will have 3 minutes unless another speaker has yielded his or her time, which would result in a total of 6 minutes on the presentation monitor on the wall'",
        "'speaker_0': '. When the yellow light comes on, you will have 30 seconds to conclude your remarks. And when the red light appears, your time is up. Speakers must stay on topic of the hearing and must direct their comments to council members.'",
        "'speaker_0': 'Speakers are prohibited from using profanity, profanity and making personal attacks to council members. Councilman Gilmore, will you please put Council Bill 585 on the floor?'",
        "'speaker_9': 'Yes, Mr. President, I move that council bill 585 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved in session. It the public hearing from council bill 585 is open. May we have the staff report. Academia and John Carter, Department of Finance.'",
        "'speaker_2': 'I'm going to do a staff report for the Council Bill.'",
        "'speaker_0': '0585 for.'",
        "'speaker_2': 'The approval of the service plan for Denver.'",
        "'speaker_0': 'Connection. What Metropolitan.'",
        "'speaker_3': 'District? A couple of slides to give an overview of the District's purpose.'",
        "'speaker_0': 'In the related development quickly. The first site here, the proposed district and development is located in the northeast part of Denver. The boundaries are roughly east of Chambers Road, west of Kenya, and south of Green Valley Ranch Boulevard, or 48th Avenue.'",
        "'speaker_0': 'The site is about 115 acres.'",
        "'speaker_2': 'It's planned for 700, roughly.'",
        "'speaker_3': '700.'",
        "'speaker_0': 'Residential units and about 40 acres of open space. This is a rendering here you have east of chambers and south in Green Valley Ranch.'",
        "'speaker_6': 'The residential properties. Excuse me?'",
        "'speaker_0': 'The development is also proposing to gain 700 units of residential properties. This is a break out of the mix of those properties and units and the starting price points. Those ranges from 236,000 to about 312,000. And you can see the breakout of the units here on the slide.'",
        "'speaker_0': 'Couple examples of what the renderings of those units would look like. Both the single families and then some.'",
        "'speaker_2': 'Of the townhouses.'",
        "'speaker_0': 'And connected units. And then a little bit of a break out of the open space that the district would be funding and some of the amenities there and the development. This is a rendering of that. Couple of highlights.'",
        "'speaker_0': 'Again, about 40 acres of 115 acres will be roughly it will be dedicated open space. You have a ten acre park on the southeast side here. And then a highlight what they're calling the hub center, which is at a community center slash recreation center with a pool and community space.'",
        "'speaker_0': 'So it'll be.'",
        "'speaker_4': 'Kind of a drawing center.'",
        "'speaker_0': 'For the developments. All these amenities will be funded by the district and maintained by the district as well going forward. And then finally, just to wrap up kind of the purpose of the district and the financing, the district will coordinate a standard with most metropolitan districts in Denver, will coordinate the manage of financing, acquisition, construction and maintenance'",
        "'speaker_0': 'of the public infrastructure and services for the developments. And these include a couple items as listed below. The total cost of those improvements are about $55 million, although the district will only be funding 20 million of that and will be taking out debt for about 20 million of those 55.'",
        "'speaker_0': 'The mill levies will be 40 mills proposed for debt and ten mills, throwing them with a cap of 50 mills. I'm here to answer questions and you also have members from the development team here and answer questions as well.'",
        "'speaker_0': 'Thank you. We have two individuals to speak tonight. I'm going to have them come to the front row. Maryann McGrady and Russell Johnson. Go ahead. You have 3 minutes.'",
        "'speaker_4': 'Mr. President, members of the council. My name is Robert Johnson. I'm with Village Homes. I'm here to answer any questions that.'",
        "'speaker_14': 'You might have.'",
        "'speaker_0': 'Okay. Yeah. Thank you. Thank you.'",
        "'speaker_5': 'Good evening. It's Marianne McGinty with Maggie Becker. I'm the attorney for the applicant here to answer questions.'",
        "'speaker_0': 'Thank you. All right. This concludes our speakers. Are there questions from members of council? And I want to give a little bit of time to get our screens caught up. Any questions for members of council? Councilman Ortega.'",
        "'speaker_8': 'I just want to ask what what the proposed height is for. The. Is there a height limitation? And if so, what is the maximum height?'",
        "'speaker_4': 'There is a high limitations, 35 feet. I don't think we're proposing.'",
        "'speaker_14': 'We get that high.'",
        "'speaker_4': 'Most of our units are typically two story homes. So under 25. Great.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Flynn.'",
        "'speaker_4': 'Thank you, Mr. President. Maybe the gentleman could answer. Looking through this went through it so quickly. I want to make sure I didn't miss anything. Is there any commercial use within the district or is it all residential and open space?'",
        "'speaker_4': 'There is no commercial use to the existing PD that's in place that we're following.'",
        "'speaker_14': 'Did not allow for any commercial.'",
        "'speaker_4': 'Okay. Thank you. The the mill the proposed mill levy that will apply since it applies to residential property, it will be at the lower ratio of assessment. Correct. Okay. Right there, nodding behind you. That's it. Thank you. That's all.'",
        "'speaker_14': 'Did you get it? Did you get your answer? Even though I didn't say anything. Okay.'",
        "'speaker_4': 'Okay.'",
        "'speaker_0': 'All right. Thank you. Any other questions from members of council? This concludes our core questions in the public hearing from counsel. 585 is now closed. Comments by members of Council. Councilwoman Gilmore.'",
        "'speaker_9': 'Thank you, Mr. President. You know, this has been a plot of land that has never been developed in the the Gateway Green Valley Ranch neighborhood. And so it is east of chambers and on a great corner. And we're really excited to have Village Homes as a partner in the community.'",
        "'speaker_9': 'There's no way that the city would at this point in time, be able to put something like this together and, you know, the developer pays their way. And so one of the great amenities that's going to come out of this development is the widening of Green Valley Ranch Boulevard from two lanes to four lanes.'",
        "'speaker_9': 'And then there'll be a Signalized intersection at Memphis. And so that's something that a lot of community members, for as long as I've lived in Monticello over 20 years, have always wanted to know when that was going to happen.'",
        "'speaker_9': 'And it just took the right, you know, economic climate and I think the right set of partners to make sure that this happened. Village homes never gave up. I think that there were a couple hiccups along the way.'",
        "'speaker_9': 'You know, to to see this site and really develop it in a way that in modern day terms, you would have walkability to retail, to Councilman Flynn's question around that retail component. But it just didn't make sense right at that point in time to have that element included in.'",
        "'speaker_9': 'And so we're going to have the residential and the parks and and the amenity piece of it. And so I would ask that all of my colleagues can just consider voting for this piece of legislation. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore. Councilman Espinosa.'",
        "'speaker_2': 'I just wanted to sort of add, in my past life, as in the affordable housing business, we did a lot of NSP work. Neighborhood Stabilization Project. I don't even remember. In the end, it's interesting because we did a lot of the units just north of Green Valley Ranch on Memphis in the Parkview area.'",
        "'speaker_2': 'And what it was what was sort of difficult in that recession and post-recession time was that we were there were units that had been in foreclosure, and and they were being sold back on the market for a fraction of what it would cost to build them.'",
        "'speaker_2': 'And it looked like it was going to be a long time coming before you would have the sort of economy where that area south and that sort of all that acreage could get developed. And so now it's it's it's it's it's good for those, those people that could withstand that that that hit because that area got really'",
        "'speaker_2': 'devastated during the housing crisis. I mean, the the recession and I mean, where people lost half of the value of their homes. So it's telling me that this this area has come back. It's also speaks to the affordable housing issue.'",
        "'speaker_2': 'Right. Because those units were incredibly affordable during that recession. And now we're these are still modest homes but and attainable. But they're they're starting to creep.'",
        "'speaker_0': 'But it is generally.'",
        "'speaker_2': 'A good thing for all those neighbors that had survived and sustain themselves through that recession. So I just I'm just glad to see having been familiar with it and just glad to see it happening. Thanks.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Herndon.'",
        "'speaker_6': 'Thank you, Mr. President. I just wanted to echo the comments before before I took over on District eight, I represented District 11. And so I am very familiar with this property and the movement moving forward. So I'm glad to see this come to fruition.'",
        "'speaker_6': 'And I wholeheartedly support this, encourage my colleagues to do so. And I think it'll be a great addition to far northeast. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. That concludes our our comments from members of council. Madam Secretary, roll call.'",
        "'speaker_4': 'But.'",
        "'speaker_7': 'Gilmore. I'm sorry. Gilmore, I. Herndon, I. Katherine Can each new Ortega.'",
        "'speaker_5': 'SUSSMAN Black tie. Clark All.'",
        "'speaker_4': 'Right.'",
        "'speaker_7': 'ESPINOSA Hi.'",
        "'speaker_4': 'FLYNN Hi, Mr. President.'",
        "'speaker_0': 'Please close voting. Announce the results. I'm here to advise council bill 585 has passed.'"
    ],
    "A bill for an ordinance changing the zoning classification for Geneva Court and Martin Luther King Jr. Boulevard. Rezones property at Geneva Court and Martin Luther King Boulevard from R-MU-20 (Former Code: residential, mixed use) with waivers to M-MX-5 (master planned, commercial mixed use, 5 stories) in Council District 8. The Committee approved filing this bill at its meeting on 8-3-16.": [
        "'speaker_7': 'Ortega was that I also was a candidate for vice.'",
        "'speaker_0': 'Yeah. Thank you. Congratulations. Councilwoman Gilmore, will you please put Council Bill 430 on the floor?'",
        "'speaker_9': 'Yes, Mr. President. I move that council bill 430 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved in a second. Councilman Herndon, we need a motion to postpone.'",
        "'speaker_7': 'Wait. We need 1/2.'",
        "'speaker_0': 'Okay.'",
        "'speaker_7': 'All right. So do I. See.'",
        "'speaker_6': 'Let me know when you get ma'am sector.'",
        "'speaker_7': 'Okay.'",
        "'speaker_6': 'Good. Yes. Thank you, Mr. President. I move that final consideration of Council Bill 430 with its public hearing be postponed to Monday, October 3rd, 2016.'",
        "'speaker_0': 'Comments by Members of Council Councilman Herndon.'",
        "'speaker_6': 'Thank you, Mr. President. At the request of community planning and development, they need to postpone this public hearing in order to meet the notice requirements. They do apologize, but all parties were notified. So I ask that my colleagues support this postponement.'",
        "'speaker_0': 'All right. See no other comments, Madam Secretary, roll call.'",
        "'speaker_6': 'Herndon i.'",
        "'speaker_7': 'Cashman can eat new Ortega I. SUSSMAN My black.'",
        "'speaker_5': 'Eye.'",
        "'speaker_4': 'CLARK All.'",
        "'speaker_7': 'Right. ESPINOSA Hi, Flynn. GILMORE Hi. Mr. President.'",
        "'speaker_0': 'I. Please close the voting and announce the results.'",
        "'speaker_7': '12 eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification for 3705 Shoshone St. & 1945 W. 37th Ave. Rezones property at 3705 Shoshone Street &1945 West 37th Avenue from PUD #181 to U-TU-B, DO-4 (urban, two unit, 4500 sq. ft. minimum lot size, Design Overlay-Side Interior Setback) in Council District 1. The Committee approved filing this bill at its meeting on 8-3-16.": [
        "'speaker_0': '12 eyes. For Final Consideration Council Bill 430 and this public hearing will be postponed to Monday, October 3rd. Councilwoman Gilmore. Will you please put Council Bill 519 on floor?'",
        "'speaker_9': 'Yes, Mr. President. I move that council bill 509 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has. Let's see here. It has been moved and second it. Public hearing for council bill 509 is open. May we have the staff report?'",
        "'speaker_1': 'Hey, good.'",
        "'speaker_3': 'Evening. Cortland Pizer with Community Planning Development here to present the proposed rezoning for 3705 Shoshone Street in 1945 West 37th. So this rezoning proposal is in Council District one in the Highland neighborhood. And specifically at the northwest corner of 37th AV and Shoshone Street as shown on the slide here.'",
        "'speaker_3': 'There are actually two properties here, one single family home fronting Shoshone streets and the other, which appears to be the backyard of that house but is actually a separate parcel with a greenhouse and a carriage house on it.'",
        "'speaker_3': 'Fronting 37th. The applicant is requesting rezoning to remove the existing old code.'",
        "'speaker_1': 'PUD.'",
        "'speaker_3': 'And is requesting to rezone from that pad to YouTube with the DOH for overlay. So YouTube stands for Urban Neighborhood to unit. The B indicates a 4500 square foot minimum lot size. The deal for is the side interior setback design overlay.'",
        "'speaker_3': 'This is an overlay that's commonly mapped throughout this neighborhood and allows for some flexibility inside yard setbacks when certain conditions are met regarding lot with. The existing zoning for the site. PD 181. Surrounding zoning on three sides matches the district that the applicant is requesting.'",
        "'speaker_3': 'YouTube with the deal for overlay and there's also another PD across Shoshone Street to the east. So a few words about the existing old code. It was adopted in 1985. Like a lot of PDAs that were created in this era, it was written very narrowly to a specific development proposal.'",
        "'speaker_3': 'In this case, the development proposal at the time was to maintain use of the single family home fronting Shoshone or allow for it to be converted to a duplex. And then the carriage.'",
        "'speaker_1': 'House was allowed to have a commercial use.'",
        "'speaker_3': 'Established, which was a neighborhood bakeshop and that was the reason for the establishment of the pad at the time. The existing land use we already mentioned for the site itself being single, family, residential and then with the green house and now Carriage House, which no longer has the bakeshop located in it.'",
        "'speaker_3': 'So it's not being used to. The north is the Potenza lodge and it's a rather large parking lot that's directly adjacent to the site and runs up to the lodge that fronts 38th AV to the south and to the west is single family residential into the east is the corporate offices for the Trino Foods.'",
        "'speaker_3': 'So here's some images to accompany the land use map. So the top two are of the site itself, the one on the left being of the home. And then you can see in the the one at the top right showing what would be.'",
        "'speaker_6': 'The backyard of the home. But is that separate parcel.'",
        "'speaker_1': 'That contains the.'",
        "'speaker_3': 'Carriage house? And what you see in the foreground is a rather large greenhouse. It's also located on the property. To the north is the Potenza Lodge. This is a photo taken from the Lott line looking towards the lodge so you can see the parking lot that serves the lodge dominating that photo.'",
        "'speaker_3': 'Here's the LA Perino Foods corporate headquarters, the portion of which that's directly adjacent or excuse me, across Shoshone street from the site and then a couple of single family residential uses. So here's one to the south and then one to the west across the alley.'",
        "'speaker_3': 'In terms of information on notice, we followed our standard procedures for notification notification throughout for each step of the planning process. The Planning Board public hearing was held back in July and planning board recommended approval by a vote of 10 to 0.'",
        "'speaker_3': 'The registered neighborhood organizations listed at the bottom of the slide were notified throughout the process at all required points and we have received no public comment on this particular application. The five standard review criteria for rezonings apply and we'll go through each of these briefly, starting with plan consistency.'",
        "'speaker_3': 'The three relevant plans for this application are Comp Plan 2000 Blueprint Denver and the Highland Neighborhood Plan. Can't plan 2000 has three strategies listed here on the slide, more detail provided in the staff report, but the finding was consistency with the strategies that are listed here.'",
        "'speaker_3': 'Blueprint. Denver Street Classification Recommendations for Shoshone and 37th is undesignated local for both of those streets. And Blueprint. Denver identifies this as an area of stability and the land use recommendation is single-family and part of the definition of single family and blueprint.'",
        "'speaker_3': 'Listed here in the slide is that single family homes are the predominant residential type. So the predominant type, not the only.'",
        "'speaker_1': 'Type. The proposed.'",
        "'speaker_4': 'YouTube.'",
        "'speaker_3': 'Zoning would allow single family urban.'",
        "'speaker_1': 'Houses, but it would.'",
        "'speaker_3': 'Also allow to use duplexes and tandem.'",
        "'speaker_1': 'Houses. So a little bit.'",
        "'speaker_3': 'Broader than just the strict interpretation of single family, but that is allowed for in Blueprint Denver. The 2010 comprehensive rezoning is relevant here because a two unit district rather than a single unit district was chosen for this general area.'",
        "'speaker_3': 'That's because of the historically the zoning was are to throughout this particular neighborhood.'",
        "'speaker_4': 'And YouTube.'",
        "'speaker_3': 'Was chosen as an equivalent district. You do find a mix of low to moderate density residential types throughout the area, although single family is the predominant residential.'",
        "'speaker_1': 'Type.'",
        "'speaker_3': 'And the Highland Neighborhood Plan does have some recommendations that are a little bit broader than just single family. And those are listed here on this slide. So the site itself shown in the little red box there within sub area 13 of the Highland Neighborhood Plan and the goal stated for sub area 13 by that plan is to'",
        "'speaker_3': 'improve and stabilize residential areas by preserving existing housing stock and encouraging homeownership. And the land use recommendation is low density residential, which is single family and low to moderate density residential, of which the YouTube district is a good fit.'",
        "'speaker_3': 'So the finding is that there is consistency with our adopted plans and that the first criteria is met. The slide summarizes the remaining criteria. The uniformity of district regulations is met by virtue.'",
        "'speaker_1': 'Of the fact that this.'",
        "'speaker_3': 'Particular proposal would rezone out of an old Code PD and into the Denver zoning code. And furthermore, the requested zoning matches the surrounding neighborhood parcels. It advances the public health, safety and welfare by implementing adopted plans. The justifying circumstances are a changed or changing condition, the most relevant of which being that the bakery has been closed for'",
        "'speaker_3': 'several years. The PD doesn't allow for it to be the carriage house to be used as anything other than a bakery. And so it no longer serves its purpose. The consistency with neighborhood context, zone district purpose and intent is also met and more details are in the staff report on that.'",
        "'speaker_3': 'So CPD recommendation is approval based on finding that all.'",
        "'speaker_1': 'Of the review criteria were met.'",
        "'speaker_0': 'Thank you. We have one speaker this evening. Zach Slover can come up to the front. You have 3 minutes.'",
        "'speaker_4': 'Hi. I'm Zach Sloan with generator real estate and owner representative.'",
        "'speaker_0': 'And it answer any questions. All right. This concludes our speakers call on questions for members of council. Give some time to. All right. Here we go. Public hearing for council five or nine is closed. Councilman Espinosa comments.'",
        "'speaker_2': 'No, it's just this was this could have been a contentious little bit of property. But it's the right zoned district, isn't it? It's it's endorsed by a endorsement from the community. So I'm happy to support this rezoning.'",
        "'speaker_0': 'Nice. Councilman, Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I just want to share with my colleagues that the property owner came and met with me. Gosh, I want to say about 6 to 8 months ago, because they had an interest in wanting to separate these out.'",
        "'speaker_8': 'And under the PD, they have always been two separate properties. They have two different addresses and they paid taxes on them separately. But for the purpose of being able to, you know, sell part of the property so that it could be used as income for this elderly couple, they couldn't do they couldn't do that.'",
        "'speaker_8': 'They had to go through this process to be able to sell it as a separate parcel, even though it's functioned in that way since the PD was adopted. And so I had referred her over to CPD staff, and that's what began this process.'",
        "'speaker_8': 'So I just wanted to share that background. And I think this is inappropriate. It's unfortunate there was a different way to solve this without having to go through the rezoning, given the background that I just shared with you.'",
        "'speaker_8': 'But I was around when it was originally proposed as a PD, and for a long period of time the NEUMANNS actually operated that bakery. It was some of the best food in town and people would line up to go sit in that backyard, which was a beautiful backyard with flowers and whatnot, but they just couldn't keep keep'",
        "'speaker_8': 'the business going. And so I just want to encourage my colleagues to support this.'",
        "'speaker_0': 'Thank you, Councilwoman, with no other comments. Madam Secretary, roll call.'",
        "'speaker_7': 'Espinosa. Hi. Flynn I Gilmore by Herndon I Cashman can each new or new Ortega I Susman.'",
        "'speaker_5': 'Black I Clark.'",
        "'speaker_4': 'Hi.'",
        "'speaker_7': 'Mr. President.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2541-2731 W. Holden Pl., 2602-2660 W. Holden Pl., 2516-2610 W. 13th Ave., 2646-2746 W. 13th Ave., 1260-1280 N. Decatur St. and 2775 W. 13th Ave. Rezones properties at 2541-2731 West Holden Place; 2516-2746, 2775 West 13th Avenue; and 1260-1280 North Decatur Street from I-MX-5, UO-2, I-A, UO-2 (industrial and light industrial, mixed use, 5 stories, use overlay allowing billboards) and C-MU-30 with waivers and conditions, UO-1 (urban center, multi-unit, 30 stories, use overlay allowing adult businesses) to C-MX-8, UO-1 (urban center, mixed use, 8 stories, use overlay allowing adult businesses) in Council District 3. The Committee approved filing this bill at its meeting on 8-3-16.": [
        "'speaker_0': 'I Please closer the voting and announce the results.'",
        "'speaker_7': '12 Eyes.'",
        "'speaker_0': '12 eyes. Counsel Bill 509 has passed. Thank you. Regulations for the final bill tonight. Councilwoman Gilmore, will you please put Council Bill 563 on the floor?'",
        "'speaker_9': 'Yes, Mr. President. Council Bill. 563 should be placed upon final consideration and due pass.'",
        "'speaker_0': 'It has been moved. And second, you have the second. There it is. It has been moved. And second, it up and up. Then can you please bring in the staff report?'",
        "'speaker_14': 'Yes. Thank you, Mr. President. Members of Council Curt Upton, Community Planning and Development tonight. This rezoning is a legislative proposal from Councilman Paul Lopez to rezone some property in the Sun Valley neighborhood. So obviously, we're in Council District three in the Sun Valley neighborhood and just southeast of the Decatur Federal Light Rail Station, almost about a quarter'",
        "'speaker_14': 'mile at 13th Avenue in Decatur Street. So the existing zoning is a mixture of industrial zone districts and a former Chapter 59 or old code mixed use District two north of 13th Avenue. There's two overlays in place in this rezoning area.'",
        "'speaker_14': 'South of 13th Avenue is the U. Oh two overlay, which is a billboard use overlay. North of 13th Avenue. There's a yellow one overlay, which is an adult use overlay, and that's those both of those overlays are in place today.'",
        "'speaker_14': 'So the proposal is a little over eight acres. Again, this is a legislative rezoning initiated by Councilman Lopez to implement the recently, recently adopted Sun Valley neighborhood slash Decatur Federal Stationary, a plan to move away from the existing industrial zone districts.'",
        "'speaker_14': 'There's a variety of barriers with the industrial zone districts for establishing the vision of the neighborhood. And the billboard overlay, again, that's located south of 13th Avenue, is proposed to be removed. The Adult Use Overlay, which is currently in place today north of 13th Avenue, is proposed to be retained.'",
        "'speaker_14': 'Initially it was proposed to be removed, but there are some legal issues with removing it which we could get into later in the presentation if you have any questions on that. So I'll get into the existing land use context.'",
        "'speaker_14': 'There's a variety of land uses in the district today. There's some residential vacant land surface parking and some industrial land uses as well as office or nonprofit uses as well surrounding as is quasi public, obviously with a public park and some utility infrastructure directly to the northeast in terms of an Excel substation.'",
        "'speaker_14': 'This gives you an idea of the scale and the character of the existing buildings. Low scale, primarily one and two storey buildings. And again, sort of the transitioning residential mixed in with industrial warehouse character today. So in terms of process, we did do this a little differently from our standard process, although we did notice it as we'",
        "'speaker_14': 'do all map amendments. But we did meet with the Sun Valley Community Coalition, hosted us for a variety of meetings on six different occasions out in the neighborhood, and that was attended by myself, the councilmen and the council and staff, as well as a variety of stakeholders to discuss and answer questions on this proposed rezoning.'",
        "'speaker_14': 'The Planning Board did recommend unanimous approval of this. However, there is some opposition out in the community. Sun Valley Community Coalition is in support of this. They did vote to support this rezoning. However, there is a nonprofit organization in the in the proposed rezoning area called Earth Links that provides a variety of important services for the neighborhood'",
        "'speaker_14': '. And they are concerned that the increase in height could negatively impact their urban agriculture slash community garden facility. This was a topic that was discussed a few times in our meetings out in the community, and there are some some additional letters in the packet from small from a small business owner that is very much in support of'",
        "'speaker_14': 'the increased height. And the Sun Valley Community Coalition is in support of this increased height as well. There's also some additional letters that have been submitted from organizations outside of the rezoning area and outside of the neighborhood that are also in opposition to this because of the potential negative impact on the Earth links, property and operations.'",
        "'speaker_14': 'So with that, I will get into consistency with adopted plans for a blueprint in Denver. This is an area of change and is classified as transit oriented development. As you all know, both of those are areas of change.'",
        "'speaker_14': 'Our areas where we're trying to direct growth in the city transit or in development is also an area we're trying to direct growth in terms of mixed use development, higher intensity development, multi storeys and pedestrian friendly design. The street classifications for 13th Avenue and Decatur Street are both mixed use collectors.'",
        "'speaker_14': 'Mixed use collectors also recommend mixed mix of uses, higher intensity, multistory developments and pedestrian friendly street frontages. We also have the Sun Valley neighborhood and Decatur Federal Station area plan. These were recently adopted in 2013. They align also with Blueprint Denver in designating this area, which is the red polygon is the rezoning area.'",
        "'speaker_14': 'But all of the pink area on this map is designated as Transit Warrior Development, with the same recommendations as Blueprint Denver. Again, higher intensity uses to take advantage of the light rail station, multi stories, multistory development and mixed use development with pedestrian friendly design features.'",
        "'speaker_14': 'The Sun Valley Neighborhood Plan also has recommended heights map and this location. All of it falls within the eight storey maximum height recommendation for the plan. There are other designations throughout the area that range from three stories and up to 12 stories in the station area.'",
        "'speaker_14': 'This image is of 13 Avenue and gives you a sense of what the proposed vision is at build out of the station area. Again, this is more of the pedestrian friendly streets and multistory mixed use development. This is another shot looking west from the river and again, gives you a sense of the transit oriented development, character and'",
        "'speaker_14': 'scale that's articulated in the Sun Valley Neighborhood Plan and that the proposed zone district of CMCs eight is intended to help facilitate. So with that, we do find that the proposal of mixed use development CMCs eight of up to eight storeys is consistent with all of our plans.'",
        "'speaker_14': 'It's consistent with Blueprint Denver. It's specifically consistent with the recently adopted Sun Valley Neighborhood Plan Indicator, federal stationary plan that calls for mixed use development of up to eight storeys with a pedestrian friendly design features. It does further the uniformity of district regulations for the public health, safety and welfare and meets our justified circumstances criteria.'",
        "'speaker_14': 'Obviously, the Carter Federal Light Rail Station is in place. There's changing conditions and there's multiple plans calling for a redevelopment of this area. Denver Housing Authority has also completed an extensive visioning effort and master planning effort for their Choice Neighborhoods application with the Sun Valley Eco District.'",
        "'speaker_14': 'And so for those reasons, we do feel it meets our changing circumstances criteria. It's also consistent with the neighborhood context zone, district purpose and intent. The district, again, is intended to encourage pedestrian friendly, mixed use development of up to eight storeys, and that's the character that's articulated in the adopted plans.'",
        "'speaker_14': 'And so with that, I'll be happy to take any questions on this case. Thank you.'",
        "'speaker_0': 'Thank you. All right. I'll be I'll call the first five speakers. You can come on this front row and we'll start with Caitlin Cronin. Caitlin Cronin, Phil Cassar, Gaia Summers. Sorry if we have some of the spelt wrong read Silberman.'",
        "'speaker_0': 'And Carol McLean. You guys can all come to the front in that order. So we'll start first with Kathleen Cronin.'",
        "'speaker_5': 'Thank you. Thank you, Councilman Brooks and members of the council. Yeah, my name is Kathleen Cronin. I'm the executive director of Earthlings. And while I actually physically live in Aurora, Colorado, all my waking hours are spent at 2746 West 13th Avenue in Denver, where Earthlings is in the packet.'",
        "'speaker_5': 'I think that you were looking at in the and the overview that Mr. Upton was doing. We're located basically right at the corner of Current 13th Avenue in Decatur. The plan that's under consideration or possibly going to be put into effect actually moves 13th to a block to our south.'",
        "'speaker_5': 'But at the present time, we're at the corner of 13th and Decatur. Our concern basically has to do with the potential shading of our garden. We have occupied this space now for about two years. We've owned it for three years and we've put approximately $1.1 million into this property.'",
        "'speaker_5': 'And one of the major things that we do in our program is working with homeless adults in and gardening and workshop program. We're a micro employer of folks and we have a 70% or better success rate at getting folks into housing if they've been working with us for a year or more.'",
        "'speaker_5': 'So we we we know that what we do is significant and we know that what we do works. There's plenty of studies that talk about the benefits of working in Earth and in fact, various organizations from other justice communities or social services communities come to talk to us about how to establish similar programs in other locations.'",
        "'speaker_5': 'The worry is if we go to eight stories around us from our south and our east, we will basically close off about two thirds of our potential gardening space. That will leave us with about 2000 square feet to garden, as opposed to the 8000 square feet that we have available to us.'",
        "'speaker_5': 'We are a central piece of the Food Access Coalition for Sun Valley. We moved there with the intention of being able to provide locally grown food, which was part of the plan that's being referred to here. And we feel that we're trying to help in that.'",
        "'speaker_5': 'And that means and that this change to eight stories right in our area would well possibly affect us negatively. I would like to point out that as the city, we have kind of a suggestion or a plank, if you will, we wish to be a sustainable city.'",
        "'speaker_5': 'And I've been told over and over again by Mr. Upton and others that there is no protection for sun access in the city under the zoning code. And I would just ask that this council consider at this time that this is an opportunity to perhaps provide some access for discussion.'",
        "'speaker_0': 'Your time is.'",
        "'speaker_5': 'Up. Thank you very much.'",
        "'speaker_0': 'Appreciate it. Thank you. Next up, Phil Kasper.'",
        "'speaker_6': 'My name is Phil Kasper. I've been a resident of Sun Valley for virtually 30 years. I guess you might call me the face of gentrification, but. 90% of the property owners in the rezoning parcel signed to have their properties zoned before Councilman Lopez chose to go ahead and bring this as a legislative action.'",
        "'speaker_6': 'And we appreciate the fact that it did so. It's taken a longer process. The planning for this community to increase its residential use goes back to the Fairview Community Land Trust that was established in 2000. One was supported by Mayor Webb, but because of zoning, we couldn't do anything in the neighborhood.'",
        "'speaker_4': 'This is appropriate.'",
        "'speaker_6': 'To be considered tonight because of the problem with the inability to house the working class. I would highly recommend. That you pass this tonight. And I highly recommend that when you consider affordable housing, you consider making it permanently affordable, whether it is rental or ownership.'",
        "'speaker_6': 'Make it make it so that someone that buys a subsidized, built house does not get to capture as much of the appreciation as someone that buys it just straight off the market. And again, I, I appreciate your support on making this change in Sun Valley.'",
        "'speaker_6': 'We can be part of the solution.'",
        "'speaker_0': 'Thank you, Casper. Guy Summers.'",
        "'speaker_14': 'But they are the.'",
        "'speaker_5': 'Hi towns. I was homeless and I walked by.'",
        "'speaker_0': 'Excuse me. I'm sorry.'",
        "'speaker_8': 'And so.'",
        "'speaker_0': 'Can you say it's.'",
        "'speaker_5': 'Beautiful?'",
        "'speaker_0': 'Can you say your name for the record, please? Stating guy.'",
        "'speaker_5': 'Guy Summers. Thank you. Sorry. Stating love, hope, courage and community in many languages. And I went into this amazing place. Earthquakes is in a food desert and also serves many homeless angry people. Sorry, some of the plants grown there are sold.'",
        "'speaker_5': 'We need sun to grow them. With the funds going. How's the homeless population? The bee hives. We have eight of them. The bees will leave these hives, which without the flowers we could grow, which will also result in a financial loss.'",
        "'speaker_5': 'If the eight story buildings are built to the east or the south of 27, 46, West 13th Avenue, which is Earthlings property, our garden will be cut in by more than half. I have spoken to senators and mayors about financial help to aid us, the disabled, the seniors and the homeless.'",
        "'speaker_5': 'There is no funding for us, but earthlings and its garden towers. Please use your hearts, not people's wallets. When you vote tonight, please do not pass this change. Thank you.'",
        "'speaker_0': 'Thank you, Miss Summers. Reed Silverman.'",
        "'speaker_6': 'Good evening, council members. My name is Reed Silberman. I'm the owner of Ink Monster Graphic Design and Printing.'",
        "'speaker_2': 'Also the.'",
        "'speaker_0': 'Proud.'",
        "'speaker_2': '2016 SBA, Colorado Small Business Person of the Year.'",
        "'speaker_4': 'I do mention.'",
        "'speaker_2': 'This because Sun.'",
        "'speaker_4': 'Valley was a very big part of the reason I was even nominated for this award. So thank you for allowing me to express my opinion on the matter of the Sun Valley CMC Zoning. I feel very strongly about this point considering my property.'",
        "'speaker_0': '2721 West Holden Place.'",
        "'speaker_4': 'Is one of the properties Earthlings would like to prevent from.'",
        "'speaker_0': 'Being rezoned in line with the development.'",
        "'speaker_4': 'Plan. Since I purchased the building, I have put a tremendous amount of sacrifice.'",
        "'speaker_0': 'Time, money, commitment into.'",
        "'speaker_4': 'This building and into this neighborhood.'",
        "'speaker_0': 'I am formally requesting that my property.'",
        "'speaker_2': 'Be zoned to see a max eight as it calls out.'",
        "'speaker_0': 'In the approved development.'",
        "'speaker_4': 'Plan. I would like to point out that everyone who purchased property in Sun Valley area in the past five years already knew these properties were intended to be rezone to CMCs eight, as it was clearly stated in the station area plan, which is now and has final approval.'",
        "'speaker_4': 'A large.'",
        "'speaker_0': 'Motivating factor for purchasing my property.'",
        "'speaker_4': 'In 2012, one year.'",
        "'speaker_0': 'Before Earthlings was knowing and in favor of.'",
        "'speaker_4': 'The new.'",
        "'speaker_0': 'Development plan and the rezoning to see a max eight. It is hard for me to understand how somebody could purchase property in and invest in renovation, knowing they'll have to dispute new zoning down the road. Think Monster took.'",
        "'speaker_4': 'Loans, not.'",
        "'speaker_0': 'Grant from the Fed and SBA to move Ink Monster to this enterprise zone.'",
        "'speaker_4': 'For job creation.'",
        "'speaker_0': 'And economic development in Sun.'",
        "'speaker_4': 'Valley. All in. I have just about $1,000,000.'",
        "'speaker_0': 'Invested into this particular.'",
        "'speaker_4': 'Property. You can see the cost breakdown in your packets.'",
        "'speaker_0': 'That I provided also.'",
        "'speaker_2': 'Before and after.'",
        "'speaker_4': 'Pictures of what I have done to renovate and.'",
        "'speaker_0': 'Make this property what it is. Since we moved to Sun Valley, we have more than doubled in size from 6 to 18 full time paid employees ink masters, creating.'",
        "'speaker_4': 'More jobs, bringing tax revenue.'",
        "'speaker_0': 'To the city, educating youth.'",
        "'speaker_4': 'And is growing very.'",
        "'speaker_2': 'Quickly.'",
        "'speaker_0': 'We are heavily involved in the community by producing community events including the Sun Valley, Denver Days, Neighborhood BLOCK Party. For the second year in a row, we work with.'",
        "'speaker_4': 'Fresh Start in the Rudy Rec Center during.'",
        "'speaker_0': 'Thanksgiving and Christmas, as well as.'",
        "'speaker_4': 'I provide internships.'",
        "'speaker_0': 'Through his YMCA program and always its workforce program. I also give Sun Valley Youth motivational tours of our facility and encourage them to follow their passions and dreams. I understand Earthlings opposition of the rezoning, and I can deeply appreciate it.'",
        "'speaker_0': 'However, it is my understanding that almost every residential and commercial property owner is aware of and in support of the new CMHC zoning and has been aware of the possible change for many years, especially considering most of us are on the Pillar committees for the Sun for the Valley Development Plan.'",
        "'speaker_0': 'Mr. Silver, you are out of time. Okay. Thank you. Thank you. Col McLennan.'",
        "'speaker_5': 'Could in a council members. My name is Carol McLennan. I live at 2 to 4 to Ivanhoe Street, but I'm the president of the board of directors of Earthlings, and I'm speaking tonight in that capacity. I just wanted to make three points briefly.'",
        "'speaker_5': 'We've submitted probably more information than you'd like from us talking about our own investments, etc. But I wanted to clarify that when we bought the property, we did that with full knowledge of the Decatur Federal Station area plan.'",
        "'speaker_5': 'We met with CPD specifically because we had this kind of strange IMX five zoning at the time and wondered if that was something that was going to be a problem in the future. We knew there might be some consideration for rezoning, particularly with the I.A. properties, but maybe ours, maybe not.'",
        "'speaker_5': 'We did a fine analysis of the Decatur Federal Station area plan, and that's included in your packets. And yes, we knew that the maximum building heights could be eight stories, but throughout the plan it talked about 2 to 8.'",
        "'speaker_5': 'And as you've seen, there are many, many policies that made us feel as though we could be part of this tiered, we could contribute to the community, and that we could provide a service not only to our participants but to the Sun Valley community.'",
        "'speaker_5': 'And we have done that. Our packets indicate we put another $550,000 into the property since we moved in two years ago, 130,000 of which is with a CDBG grant from the Office of Economic Development. We knew that we had a gym when we bought this property, and we were thrilled and surprised that speculators hadn't jumped in and'",
        "'speaker_5': 'bought it before we did. What we didn't know was how much that property was going to help us fulfill our mission even more than we anticipated. We are close to services that our participants need bus stops, the bike and pad trail, the medical center and the Health and Human Services less than a block away.'",
        "'speaker_5': 'Our participants who come to us are low income people who have been homeless. They come and stay with us week after week for an average of two years. And when they come to us, they work, they make products, they are creative, they are productive, and they are adding to the community.'",
        "'speaker_5': 'And we've made incredible connections in that community. Our board voted to stay and to get a permanent home so that we wouldn't be gentrified out of yet another community in a few years. We want to be there. We are good friends with our neighbors.'",
        "'speaker_5': 'We support Reid and all and all the other properties around us. I know we disagree on this issue, but we're asking you to look at the full array of policies that are in that plan, diversity being one of them, and ask you to consider rezoning just a couple of these properties other than eight stories, maybe five stories'",
        "'speaker_5': ', so that we can do what we do, provide services for those who need the services the most, where they are available, and make this an example of what you can do to be inclusive and diverse and every tod across the city.'",
        "'speaker_5': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Our last speaker is Jean Ann Granville. Janine Granville. I'll get it right.'",
        "'speaker_5': 'Hi, I'm Jean Granville. I'm representing the Sun Valley Community Coalition, the registered neighborhood organization. I'm also the executive director of Fresh Start, a nonprofit that is located in and owns property at 2715 West Holden Place, which is also included in the application for rezoning.'",
        "'speaker_5': 'I just want to reiterate that we did have numerous meetings and are very grateful for Councilman Lopez, his staff, and for Curt Upton with the Planning Department for keeping us part of this process throughout its tenure. And I really appreciate to above that we did review the application and voted on it in our June 7th general monthly'",
        "'speaker_5': 'meeting, and it was by a majority vote in favor. It was noted at the time, prior to the vote, that the zoning application was consistent with the Decatur Federal Station area plan that had been passed in 2013, and many of the impacted property owners had participated in that planning process and wanted to see it move forward.'",
        "'speaker_5': 'It was also noted that this was an excellent opportunity for the affordable housing that we've all been really concerned about. Concerns that were expressed by Earthlings, I think, have been met with a tremendous amount of sympathy and empathy.'",
        "'speaker_5': 'They are a vital part of our community since they have moved in. They have provided leadership and services beyond just their own mission, but to contribute to the development of the neighborhood. While it's not an easy solution, and frankly, we have no easy idea of what that solution might be.'",
        "'speaker_5': 'We really do hope that Earthlings can get whatever assistance it needs as the plans start to unfold, that they can continue to be part of our neighborhood and to thrive as we all hope. So thank you very much.'",
        "'speaker_0': 'Thank you so much. This concludes our speakers questions by members of council. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I have a couple of questions about the. The role that our food policy and food coordinator in the city plays. We've had a series of public meetings that took place around the city that asked for input on the role of food sustainability in this city and the importance of it.'",
        "'speaker_8': 'You know, we all know that California doesn't get the water they used to. And so a lot of our produce no longer comes from California. And a lot of these conversations were about how we need to be taking some initiative to create food sustainability right here in our own community.'",
        "'speaker_8': 'So when we have organizations and entities that are doing that, I think we need to do everything possible to try to protect those important elements within our neighborhood, particularly when they are providing service to the very neighborhoods that they are within.'",
        "'speaker_8': 'So that's one issue in terms of understanding the interface between the plan that has been put together by Blake Angelo and the zoning applications that we have coming forward across the city, not just in this neighborhood, because some of the input that came out of some of those meetings was we need to be seeing developments very similar'",
        "'speaker_8': 'to our own park across the street where we have flower gardens, but we're growing food in between the flowers. And I'm not sure where exactly that food goes, but looking at those kinds of opportunities all across the city.'",
        "'speaker_8': 'So I'm asking our city staff if that issue even came up in terms of the interface between our food policy plan, if you will, and in this particular development, because of the impact to a particular business in the neighborhood that plays that very role.'",
        "'speaker_14': 'Yeah. Yes. I mean, the the Sun Valley, Decatur Federal Stationary Plant I'll speak to that was very much support of of the idea of, you know, healthy foods, growing foods, you know, supermarket access, eliminating food deserts and all those sorts of things.'",
        "'speaker_14': 'And so that's why there was this discussion in the community that the issue is for this location. It's very close to the light rail station. And so we also have recommendations in multiple documents throughout the city to take advantage of these prime locations that are very close, you know, within the quarter mile of a light rail station'",
        "'speaker_14': 'to target it with additional redevelopment and density and mixed use development. And so there's a very clear map in the plan that shows this area as eight stories. And so for those reasons, while, you know, there was a lot of sympathy and there was a lot of value of the community garden idea and the Earth Links idea'",
        "'speaker_14': ', the plan was very clear. It should also be noted that the the existing zoning today on the surrounding properties from Earthlings would allow up to 70 feet in height. So this change would would bump that up to 110 feet, which is eight stories.'",
        "'speaker_14': 'So there would be some additional height, but there is a would be potentially impacts today with the current zoning with heights that are not built out as as high as they could go today.'",
        "'speaker_8': 'So the basically what you're saying is the stationary plan basically trumps the food policy plan.'",
        "'speaker_14': 'I guess I wouldn't say that. I guess for for this zoning case, we have to look at adopted plans blueprint, Denver and the and the station area plan. And while there is some recommendations that are consistent with the food plan that you're talking about for this particular location and this particular proposal, we feel that this zone district'",
        "'speaker_14': 'is appropriate.'",
        "'speaker_8': 'So let me change the focus now on proximity to Fairmont School. So is that directly across the street? We're looking at a map. Is it half a block away or across the street from the boundaries of where this new zoning is proposed?'",
        "'speaker_8': 'I was looking at the map and I couldn't tell if it was across the street from the edge of the school property or if it's half a block away.'",
        "'speaker_14': 'But it's right across directly. It's just north.'",
        "'speaker_8': 'So we're talking about eight stories that would be directly across the street from.'",
        "'speaker_4': 'You know.'",
        "'speaker_8': 'The. Because it seems they were rezoning, too, right?'",
        "'speaker_0': 'I've seen several folks say no. Anybody want to clarify?'",
        "'speaker_14': 'I'll pull up the map here.'",
        "'speaker_0': 'The way you have to. You have to you have to you have to come to the mic, actually.'",
        "'speaker_13': 'Point of order, Mr. Chair. I don't know that our staff realizes we don't. We don't any more see the presentation that you're giving. Yeah, we can open the same PowerPoint, but we have no idea what side you're on, and there's no slide numbers.'",
        "'speaker_13': 'So please try to describe the slide you're on when you reference it so that we can follow.'",
        "'speaker_0': 'Yeah. Thank you. Thank you for that. Councilwoman Kurt, can you give 2 seconds for us?'",
        "'speaker_14': 'Yeah.'",
        "'speaker_0': 'Okay.'",
        "'speaker_6': 'So 12th Avenue North Side is a full row of homes with short, mostly short lots. And then on the corner of Decatur and 12th and there's a community garden. And then opposite that on the alley is a church that's all residential for about eight lots.'",
        "'speaker_6': 'And there's vacant I a property that has been hasn't been developed. It's been demolished for 20 years. Okay. And then the rest of the properties that are all signed on to be resolved.'",
        "'speaker_0': 'Thank you. Uh, Curt, did you want to show something to the council or.'",
        "'speaker_14': 'Well, I guess I just. I moved back to the. The location slide in the presentation, which is an aerial photo.'",
        "'speaker_0': 'What is what?'",
        "'speaker_14': 'What slide is that on. It's the blue.'",
        "'speaker_4': 'I.'",
        "'speaker_14': 'Think.'",
        "'speaker_1': 'It's what.'",
        "'speaker_0': 'Page do you have a page or the.'",
        "'speaker_14': 'Numbers on here.'",
        "'speaker_0': 'Like what? Slide for everyone, for city council.'",
        "'speaker_14': 'For this location at the top of the slide and 2014 aerial photo at the bottom left. So if you can see hold in place there it's actually the school property is to the south of of that it's you can't it's kind of off of off of the screen.'",
        "'speaker_14': 'So while it's not directly adjacent, it is in proximity to the school property.'",
        "'speaker_8': 'So the school property, just to be clear, the school property is across the street from the edge of what this new boundary will be.'",
        "'speaker_14': 'Well, there's not. So if you look at the aerial photo, if you see hold in place on the aerial photo, right. If you look down, there's an alley there and there's another block of properties there. And then to the south of that is the school.'",
        "'speaker_14': 'So it's probably about a block or two from the rezoning area.'",
        "'speaker_0': 'Councilman, Councilman Lopez, you want to get in?'",
        "'speaker_1': 'Thank you, Mr. President. Councilman Ortega, if you look at the slide, this is proposal. I don't see the numbers on the slides proposal. And you see the blue was that CMC's proposed that that southern edge is buffered by homes, it's buffered by structures.'",
        "'speaker_1': 'When you go south, the 12th, 12th is the property line at the school. Okay, so you have that buffer between the CMC in the school that's probably you're looking at probably. 200 feet max, probably maybe 250. I don't know.'",
        "'speaker_1': 'It it goes from it's almost like a. Isosceles triangle. All right, it just. Narrows out to the east, but it's thicker on longer on the west side. It's if you look.'",
        "'speaker_8': 'There, you could see looking at.'",
        "'speaker_1': 'It. 12th Avenue, south of 12th Avenue is a fair amount, is it doesn't? So to answer your question, it doesn't. But Fairmont is just a half a block north of it in some places, and it's like probably maybe 100 feet.'",
        "'speaker_8': 'Just one other further clarifying question. Okay. Does the rezoning in any way, shape or form propose maintaining the grid system of the current roads? Or. You know, the area is a little restricted to get in and out of.'",
        "'speaker_8': 'And so if we're proposing higher density, but we're not doing anything to improve the infrastructure. Are we are we creating more problems down the road that this neighborhood's going to have to deal with? I mean, I, I think we're looking at a similar situation where we've re zoned the whole Foch Street corridor with very, very high densities'",
        "'speaker_8': ', and we've got one road into that site. And so are we going to be dealing with some of those kinds of challenges? And did those issues come up in the conversation about this rezoning?'",
        "'speaker_14': 'Yeah. So there is a plan as part of the the adopted stationary plan to reconfigure some of these streets and reintroduce more of a grid system in this area. And I believe Public Works is looking at 13 Avenue as an early project of realigning 13th Avenue to improve the connectivity in the area.'",
        "'speaker_14': 'So yeah, there is a plan to improve the street infrastructure and add more connectivity than there is today.'",
        "'speaker_8': 'But those will be separate conversations about how that happens and when that happens. Correct. Or was that part of this process?'",
        "'speaker_14': 'It's not part of the rezoning, but the rezoning is consistent. I guess I would say the rezoning doesn't prevent that from happening in the future. It's consistent with the circulation plan that's in the adopted plan. Okay.'",
        "'speaker_8': 'Thank you. I have no further questions.'",
        "'speaker_0': 'Okay. Councilman Lopez.'",
        "'speaker_1': 'Thank you, Mr. President. If you stay up there and just so I can address one of these questions, if I may, that we are talking about the 13th Avenue realignment realignment, some of those streets. I mean, here's the thing.'",
        "'speaker_1': 'You really got to look from a further height, from a higher standpoint to look at the whole neighborhood. There's going to be a lot of questions of how we realign, because it's not just this site that I mean, it's also the DHEA properties in the Casitas and stuff that are you know, we're going to look at increasing'",
        "'speaker_1': 'density as we go in the future, creating more opportunities for affordable housing. My my question is, there's a couple of properties trying to figure this out here. There's there's a property just south of 13th Avenue that is west of the Garden and I'm sorry, east of the things properties.'",
        "'speaker_1': 'And then just north of Pink Monster. That is not part of the plan. Can you speak to as to why they are not part of the rezoning?'",
        "'speaker_14': 'Yeah. So they came in earlier on a different schedule than this rezoning and they were already approved for Max eight. So that's why on the proposal slide that you're mentioning, there's that little sort of notch that's missing.'",
        "'speaker_1': 'Can you speak also to a little bit more the community process I want and, you know, intended future use? And this is something that perhaps I don't know, somebody from the neighborhood association can speak to as well, too.'",
        "'speaker_1': 'So if you can kind of talk a little bit more about the community process, what that was like, what the how we addressed some of these questions. And if you want to come out to the to the podium to talk about, you know, the intended use and what the plan will be, what's envisioned there, I think that'",
        "'speaker_1': 'kind of clears up this. Description of it as being, quote unquote.'",
        "'speaker_5': 'You're asking for the intended use for the already zoned for property.'",
        "'speaker_1': 'The vision for the future.'",
        "'speaker_5': 'Use for the already zoned property for the.'",
        "'speaker_1': 'Post.'",
        "'speaker_5': 'O for our our larger proposal.'",
        "'speaker_1': 'Zoned and then proposal.'",
        "'speaker_5': 'Well, I think that is part of the whole the Carter Stationery, a federal stationery, a plan. The whole idea of it is is to try to really activate as much as we can around the light rail station. And as has happened in other parts of the city and counties, we are seeing much more density around those areas'",
        "'speaker_5': '. And we are very committed in Sun Valley to be a neighborhood that really is affordable, that continues to be family oriented as it is now, and to be one that is affordable and to be more of a mixed income.'",
        "'speaker_5': 'I think that the ACM x eight zoning that was allowed, I think back almost a year ago that was passed by council, it was one step to try to provide a parcel that could be a future theater, as well as also house arts and other kinds of of activities or amenities.'",
        "'speaker_5': 'So we have really ambitious plans, but we think that with the leadership of the Denver Housing Authority who is steward stewarded much of the choice neighborhood planning that those plans can actually come to fruition.'",
        "'speaker_1': 'If I. If I may. Thank you. If I may. Mr. President. Chris. I'm sorry. Chris are. Go, Casper, if you want to come up as well to. Come on. Who are you calling up? Phil? Phil? Yeah. Do you want to come up to the podium, please?'",
        "'speaker_1': 'On the Cater Federal Stationery Up plan and the Sun Valley Neighborhood Plan. Simple question. When's the first time that you all sat down to talk about plans for these areas?'",
        "'speaker_4': 'The response?'",
        "'speaker_6': 'The Sun Valley neighborhood hasn't had a neighborhood plan for 40 years until recently. And the. Attempted to get a neighborhood plan to increase housing going all the way back to 2001. But the city wasn't ready because the transportation infrastructure was in the planning works and it was delayed and delayed at the expense of generations of kids in'",
        "'speaker_6': 'a very bad neighborhood for a very, very long time. And I don't think that most of these council people could be considered to be part of the reason for that. There are I know Debbie has always gone to bat for this community, and I've said it before in this in this council room, that there were a lot'",
        "'speaker_6': 'of council people that were complicit to a crime against all those kids for all those years. It's time to make.'",
        "'speaker_0': 'This a healthy.'",
        "'speaker_6': 'Family neighborhood. And this is the zoning that's going to do it. So. I think that it should be supported. Now, are there any questions I'd be glad to answer? Yeah.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Okay. Thank you. Okay. You, Councilman Espinosa. Hey, Phil. Phil Kobach.'",
        "'speaker_2': 'So it's good to see you again. It's been a long time. There's a slide in the deck that shows the Sun Valley neighborhood planning a vision for 13th Avenue. Were you part of that planning process that developed that?'",
        "'speaker_6': 'Yes. I'm going all the way. Yes.'",
        "'speaker_2': 'So does this.'",
        "'speaker_6': 'Property owner for 25 years.'",
        "'speaker_2': 'Does this rezoning alone do what's necessary to get that vision implemented?'",
        "'speaker_6': 'Could you repeat that?'",
        "'speaker_2': 'Will this rezoning alone do what's needed to make that vision for 13th Avenue come to fruition?'",
        "'speaker_6': 'Well, it will need. It'll need the support from council. It will also need a lot of resources that that will come from federal sources and and hopefully state and city and local and and developers. It needs to be a mixed community with ownership and rental, but it does not need to be a party place.'",
        "'speaker_2': 'You know, when there was a discussion with the community and and Kurt might be able to answer this as well. Was there discussion about this vision and how infrastructure rezoning could and should perpetuate that vision? And what that because there's a specific character that's rendered here that isn't just inherent in the reasoning.'",
        "'speaker_2': 'And so all.'",
        "'speaker_6': 'Discussions and our discussions were complete with infrastructure changes, the character of the of the streets, the different types of housing placement of different types of housing, including grocery services. Access across the river, actually pedestrian bridge and possibly expansion on and on, stuff like that.'",
        "'speaker_6': 'And. I'm talking about a community that had to fight 15 years to get a laundry facility.'",
        "'speaker_2': 'Yeah. No, the reason why I'm asking is that if you says you have this vision, so you know this neighborhood, you've been there really long time. This 13th Avenue, this zone is is considerably wider than the existing 13th Avenue.'",
        "'speaker_2': 'And while there's a street, a tree lawn on both sides of 13th Avenue, as depicted here, there's also this sort of healthy sort of cafe breakout space that is certainly doable. A cmcs eight is a use by right but you would have to voluntarily not build to.'",
        "'speaker_2': 'And the other thing is is we first have to widen the ride away to to capture both to vehicle travel lanes, to bike lanes into on street parking lanes. And so to implement this vision. One of my frustrations is we have this great vision that we worked a long time with Sun Valley residents and a lot of'",
        "'speaker_2': 'the people that just testified on both sides of this thing and in how the problem is, is that should we be using when we get in the legislative process, should we have codified ways to implement this vision? As part of that rezoning piece?'",
        "'speaker_2': 'I don't sense that it's in there. So was there any discussion about doing that?'",
        "'speaker_6': 'Not directly. I will say with that depiction there, what we have is an old 13th Avenue and a new 13th Avenue and the old 13th Avenue will see much less traffic and the bicycle lanes in the parking that is depicted there may not all be exactly the same.'",
        "'speaker_6': 'However, what will be the property is being consolidated into one ownership. So the entire property on the north and south side of what is holding today and. 60% of the property on what is 13th today has been accumulated by by one controlling entity so that they can it's being planned for cut through to realign it, which has'",
        "'speaker_6': 'been the city's design for 15 years, while 13 years they brought it to us 13 years ago. This community didn't like it. Well, the community that was there has gone for the most part.'",
        "'speaker_2': 'Is that a private party or is that a public entity that it's.'",
        "'speaker_6': 'A partner in the neighborhoods? The development group that's working with the FHA.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_2': 'Okay. So they are working with the. Yes. Okay. So thank you. Thanks, though. Thanks. Question for anything else? No, thanks. Okay. Thanks. Appreciate that. It's for somebody from earth Linx that mentioned the 80% shadow coverage of the late.'",
        "'speaker_2': 'And thanks for mentioning the heights, because that's one of the things that struck me about Cinemax. Five I mean, IMAX five is, is very healthy. So when you did the study that came up with the 80%, what height was used in that analysis?'",
        "'speaker_5': 'That was the eight stories.'",
        "'speaker_2': 'So 110 feet or. Yes. Okay. And then what was the percentage of coverage at 70 feet?'",
        "'speaker_5': 'It's much less we we only lose about 25, 25 by 100. Square feet of our garden, so we lose much less when we had done that study before we moved in.'",
        "'speaker_2': 'That's 2500 square feet.'",
        "'speaker_5': 'You said so it's right by the back alley of our I don't know if you're familiar with our spot, but we have a lot of gardens over there. So we would lose some. But we we were willing to take that risk when we moved in.'",
        "'speaker_2': 'Okay. And so how many square feet did you say you would lose in the eight cm x eight scenario?'",
        "'speaker_5': 'We lose all of our two lots on our east side and we would lose half of our current south north garden. So we would have one north garden left. I'm estimating right now we would have about 50 feet by 50 feet left.'",
        "'speaker_5': 'That's currently gardened.'",
        "'speaker_0': 'Yeah. So.'",
        "'speaker_2': 'Okay. Do you have you ever talked about partnerships? I mean, I know it's dedicated parkland, but we do have gardens of sorts. Have you ever talked with using about with with Denver parks or any other city agency about that space between you and Rudy?'",
        "'speaker_2': 'That's great. Solar access and not exactly a ballfield.'",
        "'speaker_5': 'We have not talked to Rudy. No. You know, our history, we have done gardening offsite from our location. We're very anxious to be able to be owners and continue to live where we are and not be subject to the whims of other landlords.'",
        "'speaker_5': 'Yeah, but we have not had an opportunity to speak with Rudy directly about that.'",
        "'speaker_2': 'And did you ever have any conversations about potential 70 foot, 75 foot height limits on the CM eight zoned district, at least for a portion to sort of protect the existing development?'",
        "'speaker_5': 'We had talked to Councilman Lopez and Mr. Upton from planning, and at one time it looked that that was maybe a possibility, but that that has changed.'",
        "'speaker_2': 'Any reason why you maybe, Curt?'",
        "'speaker_5': 'Well, I'm sure they could speak for themselves. I can't really speak for them.'",
        "'speaker_2': 'Great. Thanks.'",
        "'speaker_5': 'Thank you. Kirk.'",
        "'speaker_14': 'Yes, Councilman. So we did discuss that as part of the community dialog, an option to restrict heights. And part of the challenge is that it's not Earthlings property that where they're requesting necessarily the height reduction, the real impact is the surrounding properties that they don't own.'",
        "'speaker_14': 'Right.'",
        "'speaker_2': 'And so but it's not a taking if you're capping a portion at 70, which is their current.'",
        "'speaker_14': 'Yeah. Yeah. Essentially agreed it's not a taking but there there were some voices that felt that that was limiting their rights or their potential rights in the future and therefore that you know that. We were sort of picking winners and losers where the plan was very clear.'",
        "'speaker_14': 'So so for those for those reasons, because there are property owners surrounding the Earthlings facility who want the eight stories. And the plan is very clear that says eight stories, one of the issues. So that being one issue, another issue is as if it was taken off or adjusted in the legislative city initiated rezoning.'",
        "'speaker_14': 'There could be a scenario where those private property owners move forward with their own rezoning and CPD internally as a team, we thought about that and because the plan was so clear for eight stories, we would recommend probably recommend approval for those as well.'",
        "'speaker_14': 'And so for those reasons, plus, again, a lot of stakeholders discussion around this issue. Again, we met out there about six times. We landed on implementing the plan as it was written.'",
        "'speaker_2': 'So the struggle that I have is that the pride growing season are really when the solar angles are pretty high. So you don't need that much of a step back in order to sort of move in a story off of a seven story and or a six story and still maintain a good I mean, maintain the solar'",
        "'speaker_2': 'access that you're providing. So. I mean, you're still you could still do eight stories in 110 feet. It's just it's just, you know, it's step back for a distance to sort of maintain that access. I didn't I don't think that's a huge ask.'",
        "'speaker_2': 'But so back to what I was showing with Phil Kasper, though.'",
        "'speaker_0': 'This is so I think, Councilman Lopez, do you want to speak to this as well? Because you said you had to.'",
        "'speaker_1': 'Yeah, I do. So so two points in the discussion because, you know, of course, you know, with a legislator resigning my office myself and, you know, particularly were very, very instrumental and right at point zero with these discussions in the talks with are things early on and looking at those properties to the south and potentially looked at'",
        "'speaker_1': 'an idea of having a smaller.'",
        "'speaker_4': 'Height, a.'",
        "'speaker_1': 'Lower height, but the property owners immediately to the south that were adjacent to those two earthlings, once they realized that everybody else was eight except for theirs, were absolutely opposed to it. It was they felt there was a property rights issue and therefore not knocked down with that either.'",
        "'speaker_1': 'One of the companies, I think, feel that that's Margie that there's not one of those houses isn't it. Yeah. You and that. So they were opposed to it, number one. It's not it's not everything's property. And second, just as a point of order, we already determined that, you know, solar access is not a viable or a legal'",
        "'speaker_1': '. Factor in a zoning such as this. So yeah, that's where the conundrum exists. And so we can chase down that rabbit hole all we want. But at the end of the day, the community in our community process is very thorough, had discussions with folks all over the neighborhood, particularly with earthlings, particularly with the property owners to the'",
        "'speaker_1': 'south who are opposed to that. And these are folks who have been these are some of the only property owners, only residential property owners in Sun Valley.'",
        "'speaker_2': 'Yeah. Now, my issue, I mean, my concern is, is, is multi-layered in that and I'm sorry we didn't bring this up in committee, but the when we do, I did mention that when we're doing a legislative rezone, we should be doing that.'",
        "'speaker_2': 'We should sort of try to leverage our position such that we actually are sort of pushing for the outcomes that are are being that had already been shared and negotiated and and and adopted. In some cases. There's a GDP here and a smaller rate plan and others in other investments.'",
        "'speaker_2': 'And so, you know, how do we how do we sculpt? When the city's doing legislative rezoning something to get the outcomes that have been shared. So back to that graphic, though, because this is to my colleagues, I'm going to bust this out again.'",
        "'speaker_2': 'I've done it. Haven't done this in a long time. This is the existing 13th Avenue that's been depicted here. It's two lanes in a parking width, you know, stall space wide. You know, is there. I know this is sort of public works, but how do you compel future development here to sort of render get to this rendering'",
        "'speaker_2': 'when that's the right of way? And if we grant this new zone district, you can build CMCs aid as you use to go right to the property line tomorrow, I mean, the day after it's adopted.'",
        "'speaker_14': 'Yeah. So you're correct. Public Works is studying this street specifically in 13 day Avenue. I think that there is some additional right of way beyond what's shown in the pavement there. So while this this concept drawing is not engineering exact, there is, as you mentioned, an approved general development plan that does specify the lanes and the rights'",
        "'speaker_14': 'of way widths for 13 avenue and all that the circulation system in place. And so when, when projects come in to development services, they will be checked against that general development plan that's in place that will provide some protection of that system as it develops.'",
        "'speaker_2': 'Yeah, but we don't have any design guidelines or standards for this area. That's correct. Okay. All right. Thanks. Further questions.'",
        "'speaker_0': 'Okay. Councilman Cashman. Thank you.'",
        "'speaker_12': 'Thank you, Mr. President. So, Curt, were zoning to a maximum of eight storeys, is what the proposal is, right? Yes, but we're not. We don't know that it's going to be eight storeys. They can build anything outside storeys.'",
        "'speaker_12': 'It's the usual deal. We have no development plan. We don't know what building is going where at this point. Correct. Okay. So. Is it? Going to cripple the neighborhood plan. If we were to zone as earthlings, who's asking, you know, some five stories around that plot?'",
        "'speaker_12': 'Is that creating some sort of a problem to realizing the goals of that neighborhood?'",
        "'speaker_14': 'So. So in the scenario that the proposal came in for less than eight stories, you're saying would it be inconsistent with the neighborhood plan?'",
        "'speaker_12': 'No. I mean, I understand the neighborhood plan says it wants eight there. Yeah. So it would be inconsistent. But I'm wondering to what degree you think it would. Really affect the goals of the neighborhood because we don't know what they're getting anyway.'",
        "'speaker_12': 'They may get three stories in these eight story districts, or they may get eight. But I guess. Where I'm coming from is. And I don't know the neighborhood as as well as Phil or as my friend Councilman Lopez.'",
        "'speaker_12': 'But we keep talking about how important affordable housing is in Denver. And then we zone 100 acres of Arapahoe Square with no affordable housing. And we talk about food deserts and the need for local food plan. And I'm just wondering if.'",
        "'speaker_12': 'Maybe it doesn't make sense to try to accommodate something like this. It may not. I'm just asking. Mm hmm.'",
        "'speaker_14': 'Well, I think I mean, I think it's a it's a good point. We did discuss this issue in our neighborhood conversations of if eight stores was even feasible on these parcels. And so that was something that we discussed.'",
        "'speaker_14': 'And we did find an example of a similar block size that could fit eight storeys, as in this proposed rezoning area. But I think the larger issue is that this is a very recently adopted plan. This rezoning area is very close to a light rail station.'",
        "'speaker_14': 'And we only again, we only have so many of those available throughout the city. And because there are property owners involved and as the councilman mentioned, owner occupants of some of these residential properties who would like to take advantage of the plan that was recently adopted.'",
        "'speaker_14': 'And if we were to go in a different direction and recommend a different height and those private property owners came in at a later date and asked for the zoning, consistent with the plan, we would have probably our hands tied to recommend approval because the plan is so clear in this area.'",
        "'speaker_14': 'So again, I think for those reasons, that's why we came to any story recommendation for this.'",
        "'speaker_12': 'Some neighborhood plans now. Governance, zoning. Because that's not my experience. I mean, their neighborhood plans are recommendations. We hear that over and over and over again. And then we see situations where the neighborhood wants one thing and their plan says one thing and CPD recommends something else.'",
        "'speaker_12': 'So.'",
        "'speaker_14': 'So certainly. I mean, they're not. Not all neighborhood plans are regulatory, and this one isn't regulatory. So I kind of agree with that. But one of our criteria for recommending approval or denial, as you know, for rezoning cases is consistency with adopted plans.'",
        "'speaker_14': 'And so that was the point I was making. Just to clarify.'",
        "'speaker_12': 'Sure. No, I understand that. And it it it is a conundrum. I have respect for for the neighborhoods self-will. Without question, but operations like earthlings are just going to be subject to getting pushed farther and farther and farther away as we gentrify every square inch of land in the city until they don't exist.'",
        "'speaker_12': 'So what's in the best interests of the city, you know, is what I'm trying to figure out. So that's all my questions. Thank you, Mr. President. Thank you, Curt.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Councilman Clark.'",
        "'speaker_4': 'Thank you, Mr. President. It was mentioned earlier that somewhere in the plan calls for 2 to 8 stories from what I've seen. It looks like it's just identified as eight. Can you speak to that?'",
        "'speaker_14': 'Yeah. So whenever we have height recommendations and this goes for all of our plans, including this plan, it's a maximum, right, a maximum height. But we put in a range meaning that we don't want to be unclear, that if that if there was an eight stories recommendation in place and someone for whatever reason wanted to come in'",
        "'speaker_14': 'with five stories or three stories or some other height recommendation that we wouldn't necessarily not support that because the market could be at the time that that height just wasn't feasible. And so we usually recommend ranges of heights up to a maximum for those reasons.'",
        "'speaker_4': 'But there's nowhere in the plan that calls out the what the zoning should allow as anything less than eight.'",
        "'speaker_14': 'There's nothing specifically in the plan that says we should not support something less than eight, if that's what you're just.'",
        "'speaker_4': 'Thank you very much. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. All right. Any more speakers here? And I see none. A public hearing for counsel. Bill 563 is now closed. Comments by members of council. Hmm. Councilman Lopez.'",
        "'speaker_1': 'Thank you, Mr. President. I, I wanted to start by thanking everybody who came out tonight to testify for the bill. You know, it's a good day. When we got Sun Valley on the agenda in the city council, especially this neighborhood.'",
        "'speaker_1': 'And it is one of the poorest neighborhoods, the poorest neighborhood in Denver and one of the poorest in the state. And it has always had that stigma and it's always been the stigma of not. Mile High Station, mile High Stadium or a light rail or, you know, the Platte River and the amenity of the Platte River.'",
        "'speaker_1': 'But as this industrial area or as as a small island of poverty and projects surrounded by industry, surrounded by a barrier of I-25, surrounded by the river as a barrier, not as an amenity, sort of, you know, kept a far from Mile High Stadium.'",
        "'speaker_1': 'Any opportunities up north? No one ever thought of 13th Avenue as an opportunity to create economic development and jobs for the neighborhood. Nobody ever looked at real lining the streets in the neighborhood to make them safer until we started.'",
        "'speaker_1': 'And I say we should say until the community in Sun Valley really started pushing the idea of the neighborhood plan. The idea and its advocates. And that goes for folks who don't live in the district and the neighborhood as well.'",
        "'speaker_1': 'I think EarthLink is a very important partner. And, you know, I've sat down with the members of earthlings to look at those ideas very early on, that we look at the idea of possibly taking it down a notch on that south side, given with the caveat that given that the property owners are okay with it, and I'",
        "'speaker_1': 'resent the fact that this is labeled as some kind of gentrification. The folks who have lived south in those lives, those properties in question. Are not a gentrifying force. These are the only property owners. And they're not McMansions.'",
        "'speaker_1': 'They're not high scale owners. These are neighborhood folks who have lived here, and you could shake your head all you want. These are neighborhood folks who have lived here since before I was even born, before my mom was even born, when it was not popular to live in this side of town.'",
        "'speaker_1': 'They dealt with the violence. They dealt with the poverty. They dealt with the stigma. And if we really want to go after affordable homelessness, we build units, folks. That's what this area is intending to do. That's what this rezoning is intending to do.'",
        "'speaker_1': 'And not to build duplexes, but to build units, enough units, so that we can tackle this issue of affordable housing without being pointed at and saying those are the projects that kids from the projects. That's the worst thing that we've done in this city as we've clumped all the projects together.'",
        "'speaker_1': 'East Village. Westwood Homes. Columbine. The Casitas. The worst thing that we could have done is say, but Mala, we have units for poor folks because that stigma lives on. And Sun Valley has probably there's no other neighborhood than Sun Valley that's been hit with that stick more.'",
        "'speaker_1': 'We want to fix that. We want to create that opportunity. The answer is mixed income, mixed use, industrial. Does this create this creative new the zone districts out there that allow you to live up top, work on the bottom.'",
        "'speaker_1': 'Right. And we want to hold that accountable. And for me, when we when I look at this rezoning, it. Absolutely. Look, this is something that I have said, especially when we had the Westwood plan up in front of us, that these are not these plans are not, and nor should they ever be intended to sit on a'",
        "'speaker_1': 'shelf and say, look at this architect. Look at the architects we paid a bunch for and the planners who we paid a bunch for. Look at their work. It's going to sit on this dusty shelf in the city.'",
        "'speaker_1': 'We don't want that. These plans are intended to be implemented. Right. And that is one of those that's the intent here. We don't want that. Finally, finally, after 40 years, this neighborhood has a neighborhood plan and a path forward, and it's going to sit on some dusty shelf.'",
        "'speaker_1': 'It's meant to be implemented. And we want to create this opportunity. We want to create this density. We want to create affordable and affordability here right at the light rail station. It is an alignment of a lot of our values.'",
        "'speaker_1': 'The Anti-Poverty, Safe Streets, access to transit, Sun Valley is where it's at. And when you when you zoom back and you look at all the property south, you look at the Casitas, you look at what's in store and what the vision is for legacy.'",
        "'speaker_1': 'This is a neighborhood that's going to be transformed without requiring poor people to leave. Which is what gentrification does. Gentrification and community development are two separate conversations, two separate things. Gentrification requires an aristocracy to push out people that are poor.'",
        "'speaker_1': 'You replace people who are poor with this aristocracy, this gentry. That's the. That's where gentrification comes from. That word. The gentry. There's a displacement. There's no displacement. What we want to create is this implementation of plan. So, ma'am, I absolutely feel you when you when you tell me, look, we this is our home.'",
        "'speaker_1': 'This is our home. This is our hope here. We want to be able to establish that. We want we want to give her things. I when I look at this, I want to give earthlings the same bargaining chip that every other property owner does get with this rezoning.'",
        "'speaker_1': 'Without that, I think it's an injustice. I think you could do a heck of a lot more than the opportunity is there. Now. Is this solve the whole problem of Sun Valley? Absolutely not. This is solve the problem of food deserts.'",
        "'speaker_1': 'Absolutely not. Right. But it does put a step in the right direction. And I don't want us to have to be put in this weird position where we have to choose. Do we choose closing a, you know, you know, hindering an opportunity to lift us out of a food desert or creating more affordable units for folks that'",
        "'speaker_1': 'really, truly need it? You want both? It's the matter of figuring out how we do that. And we can't do that by limiting somebody's property rights. She? Legally. We can't do that. So when we look at this reasoning, it is illegal for me to be able to say, Well, I'm opposed to this because it creates more shade'",
        "'speaker_1': '. That is not a legal reason for us to do it. We can't. So in you know, in closing my closing remarks, I just I'm I want to implement what the residents of Sun Valley have worked so hard decades for to do.'",
        "'speaker_1': 'It's a start implementing that plan. And as a councilman, that's why this is a legislative rezoning. So it's not for developers, it's for the residents. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Thank you, Councilman Lopez. And we're glad you're you're here. Councilwoman, can each.'",
        "'speaker_13': 'Thank you, Mr. President. I just wanted to briefly address the criteria, which is what we're required to judge zoning on. And I think that the criteria is fairly clear in this case, that there is a strong case for the rezoning.'",
        "'speaker_13': 'But it does not mean that I'm not very empathetic. I want to thank Earthlings for having me out and touring me and some of the neighboring properties as well, for showing me some of the important opportunities. And also just should have said this.'",
        "'speaker_13': 'First, thank you to all of you for staying on. What's the late and long night? So I appreciate all of your presence. So I guess the thing I want to say is that based on the plan, based on the criteria, I just don't have a basis to vote against this rezoning.'",
        "'speaker_13': 'But I you know, here are a few problem solving suggestions and hopes because I think that we have some time these projects take a little while to go from concept to construction. So I don't know what that is for each of the neighboring properties.'",
        "'speaker_13': 'But you know, hopefully you have at least three years until that shade arrives, perhaps more depending on the economy and financing and all the things that have to come together to make a tall building come to fruition. So, you know, one idea is that, you know, I don't you know, I don't know if you've had a chance'",
        "'speaker_13': 'to go to see a place like, oh, my gosh, it's late. It just escaped me. The grow house, the mind meld of the at large seats grow house, you know, an indoor space aquaponics. There's a whole bunch of ways to grow inside structures, but and there's a cost involved.'",
        "'speaker_13': 'So you have me committing right now to say that would be the kind of ideas invested in your current space already may need to invest more to be able to keep, you know, the next generation of food growth.'",
        "'speaker_13': 'You know, we have a marijuana industry that tells us all the time that they would like to be better neighbors. And we know that some of them are in this vicinity. And so they know a lot about indoor growing and structures.'",
        "'speaker_13': 'And so maybe there is an opportunity there to connect an industry that wants to and should be doing better as neighbors, to think about how you might be able to use space, you know, with artificial light or other things.'",
        "'speaker_13': 'There is the opportunity for rooftop gardens. So if your neighbors I understand that that for your neighbors to use their rooftops, that puts you at the mercy of the landlords in the same way that you have not wanted to be.'",
        "'speaker_13': 'But there's also we have a homeless, you know, housing toolkit that helps to pair folks who are service provider experts with housing experts. And so maybe you have your own three, five or even eight storey housing with rooftop gardens, and you can pair through this toolkit process that the city has to really bring expertize together.'",
        "'speaker_13': 'These are all really long term ideas and they're all really expensive, and I don't offer any of them lightly as solutions, but I do believe that the service you provide is essential. I think it's as essential as the rest of the neighborhood plan.'",
        "'speaker_13': 'And I want you to know that I'm committed if I can make introductions. You know, Susan Powers is a person who's always talking about podium growth. You know, how could you build over parking lots and things like that?'",
        "'speaker_13': 'So we have some creative folks. And so if we can help introduce you to them and make those partnerships so that we can make this time matter, I don't want you to feel like the testimony has fallen on deaf ears.'",
        "'speaker_13': 'So. So my obligation is to vote with the criteria. But the education you've provided, the perspective you've brought is important. And I'm here and dedicated to helping to make whatever's possible. You know, explore that with you. So thanks for thanks for your time tonight.'",
        "'speaker_13': 'And to the neighbors, congratulations on, you know, the long process of moving a plan towards fruition and lots lots more work to do we know and the infrastructure we're we'll probably be here next on that but we're aware of that as well.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each Councilman Espinosa.'",
        "'speaker_2': 'Oh, yeah. You've always had a tough row to hoe are earthlings because the as my colleague Robin Can said, Councilwoman Canete, sorry, the justification is there. You know, obviously we're not compelled to the justification for IMAX is also thought of there as a use by right but you know it's my frustration and why my line of questioning'",
        "'speaker_2': 'is there is a lot of public investment that has gone on for decades in Sun Valley and then more recently on this revisioning and in the future on implementing those plans for the river and for Sun Valley and.'",
        "'speaker_2': 'And in the stadium. And when council's involved, I would have liked. I'm just sorry, Paul. I would like to see more sort of agreements sort of hammered out either through the administration or whatnot, on how this vision can be brought forward.'",
        "'speaker_2': 'You know, my frustration is we create these neighborhood plans in any one of these individual property owners could have come to the council and initiated their own rezoning application on their individual process parcels and gotten them through on the same criteria.'",
        "'speaker_2': 'I mean, you could have rubber stamp this thing and just on your plot and your plot and your plot, and it would have been the same justification, the same things for each individual. So when the council's leading that as a legislative move, I my my expectation from us and is that we're we're actually doing we're going the'",
        "'speaker_2': 'extra step to move towards that that long term vision because I'm you don't have to look any further than my neighborhood of Jefferson Park to go. We have got zero. Zero new mixed use development that wasn't fought for by the neighborhood.'",
        "'speaker_2': 'So everything that's happened since 2010 has been residential, pure residential. That's not true. There's now a new building at 25th and Elliot going up, but that's a main street zone district and they can't actually know they could do you.'",
        "'speaker_2': 'Right.'",
        "'speaker_3': '100% residential.'",
        "'speaker_2': 'The that's it. Very minimal square footage in all the redevelopment of that community. And so when when we create this zone district and we don't have other regulating tools in place, we're sort of at the whim of the of the market in the industry.'",
        "'speaker_2': 'And hopefully those agreements are being hammered out with the FHA and that whatever vision is going to that's out there is going to come to fruition. But that's just my just general disposition is that, you know, we have spent a lot of public money getting these neighborhood plans to this point and all this documentation.'",
        "'speaker_2': 'We actually had all the formative legwork to go the next step, which is to sort of more compelling regulations. And instead we went the rezoning, which, like I said, any property owner could have done and made this exact CPD would have made the exact same case.'",
        "'speaker_2': 'So, I mean, there's no again, there's no compelling reason why the I mean, the criteria is met, but it's just I just it's so I feel for you earthlings know, like I said, you would have been facing it in a different format as well.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Clark.'",
        "'speaker_4': 'Thank you, Mr. President. I actually had the opportunity to work on the Federal Decatur stationary plan before I was on council as a stakeholder. And it's one of those plans that I always think back to now whenever we're embarking on any kind of plan in the communities that I serve today, because the community outreach and engagement was'",
        "'speaker_4': 'so robust and so creative and there was just so, so many community members involved and their voices being heard and engaged in that process, like maybe no other plan I've ever seen. And, you know, I think that the the plan is pretty clear on this.'",
        "'speaker_4': 'And unfortunately, you know, I mean, and I've also had the opportunity to go and visit with earthlings and just phenomenal work being done over there. So it is one of those rock and a hard place kind of things.'",
        "'speaker_4': 'But at the end of the day, the the volume of community input that went into that plan and the engagement and the buy in of that community. And then, you know, as Earthlings mentioned, coming in and knowing that that plan was there, being able to look at that plan and take a calculated risk.'",
        "'speaker_4': 'And to be honest with you, it may still pan out just fine because as you've heard somebody, just because they have eight story zoning doesn't mean that they build eight storeys. But as my colleagues have pointed out, the criteria that we are tasked with looking at with this is clear.'",
        "'speaker_4': 'And this is is well within that criteria. And also, you know, I think on top of that, I think why we have the criteria that does this lineup with neighborhood plan, especially neighborhood plans that are as new as they are, is to respect the fact that this is what the community decided was the vision for this area'",
        "'speaker_4': '. And that is is is bigger than individual land uses. And so, again, my my heart goes out. I hope that we can find some creative solutions. And some of this may, you know, resolve itself as buildings get built.'",
        "'speaker_4': 'But this is the vision. And a clear roadmap was laid out. And it clearly meets the criteria that we're faced with as this community continues to grow into a plan that had so much engagement and buy in. So I will be supporting this tonight.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, President Pro Tem Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. A lot of my comments have have been shared by my colleagues. You know, Earthlings could have chosen to not want to be included within the boundaries. But that wouldn't have solved the problem. The the the height would have.'",
        "'speaker_8': 'Been there from adjacent properties and that would have still had the same impact on Earthlings had you chosen to go that route. This Saturday, I had the opportunity to go over to the Delta Center at 34th and Eudora and they have an incredible facility which is much larger than the grow house, which is in the O'Leary neighborhood'",
        "'speaker_8': '. And they're doing hydroponics and aquaponics. And I really believe this is the direction that food sustainability needs to move towards because, you know, otherwise we're reliant on just so many days of sunlight to to grow our food in in this city.'",
        "'speaker_8': 'And so I, too, am committed to working with you all to find a more long term solution. I think it's incumbent on us as a city to be looking at supporting more of these types of projects. And, you know, I firmly believe that we need to be incorporating food sustainability into all of our developments, that we should'",
        "'speaker_8': 'be having more solar gardens, we should be having, you know, more green space that requires gardening as opposed to grass or, you know, other types of of vegetation. But. The other thing I want to mention is that once this up zoning passes, the pressures will be incredible for developers to want to purchase and assemble enough land to'",
        "'speaker_8': 'be able to do more development. And as much as you all want to retain affordability and retain that neighborhood feel of the Sun Valley community. I think those pressures are going to be real. Just like we've seen at all the other TOD sites where land is being assembled and resold.'",
        "'speaker_8': 'So those of you who are property owners, I would just strongly encourage you to, you know, to drive that train and not let it be driven by somebody else. If if that's the destiny that you all want for the neighborhood is to really dictate what that development is going to look like, what it's going to feel like'",
        "'speaker_8': ', how it interfaces with the properties to the south and the school. And, you know, I think the school is going to be an even more important asset in that neighborhood as you have more bodies that would would move to the neighborhood, whether it's, you know, some of the Todd land that's that's closer to the rail stop that'",
        "'speaker_8': 'will be developed or whether it will be any of these parcels. So I think the the challenges will come with as the city works with you to widen that street. Obviously, if this zoning goes through tonight, it more likely will those of you who are property owners, the city will have to be paying more for that land'",
        "'speaker_8': 'to widen that street because of the change in the zoning. So those are just some inherent issues that are real that we'll be dealing with down the road. Like many of my colleagues have shared. I think because this has been part of the overall plans for this area.'",
        "'speaker_8': 'And, you know, Sun Valley is one of those communities that, as Phil Kasper said earlier. There's been lots of requests to have attention paid to this neighborhood. I can remember when we had many of the single family homes on 13th Avenue who couldn't get a loan to do fix up work on those homes because of the industrial'",
        "'speaker_8': 'zoning that they had. And so people were kind of stuck, you know, at the mercy of of trying to find some other way to get their homes improved because banks wouldn't lend to them. And so this neighborhood has dealt with many challenges over the years.'",
        "'speaker_8': 'And I think the changes that are yet to come will will absolutely benefit the neighborhood, the opportunities to get a nearby grocery store. The fact that you currently have such great access to the light rail station at Federal Boulevard and in.'",
        "'speaker_8': 'What is that, 14th avenue? Yeah, um, just. Just add to the opportunities for the people who live in the neighborhood and, you know, I know you need to create that synergy and have more, more bodies in the neighborhood.'",
        "'speaker_8': 'But I think it's important for this to move forward. And I'm going to be voting for it tonight. But I am absolutely committed to working with earthlings in trying to find another way to still keep that food sustainability available.'",
        "'speaker_8': 'And I just want to commend you for your work that you do with the homeless population as well, because that is such an important element of us as a city trying to find tools and solutions to helping get people back to work.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega, Councilman Cashman.'",
        "'speaker_12': 'Thank you, Mr. President. I wish I had an answer to all these a rock and a hard place deals that come before us. And I think I could as far as meeting the criteria that were charged with addressing, I think I could make a dying swan grasp at impacting an agricultural use in a negative manner.'",
        "'speaker_12': 'May not be me meeting the health and welfare of our community. For me. Feel like Simon Legree Earthlings knew what the possibility of what they were getting into. The main thing is, I would like to. Strengthen our cities attention to small area plans.'",
        "'speaker_12': 'Rather than Chip added Because I've had small area plans in my district, Chip Dad and development take place that the neighborhood majority voice spoke against. So that is a major element in it as far as gentrification or not gentrification.'",
        "'speaker_4': 'If it.'",
        "'speaker_12': 'I could get a written contract that whatever is going to happen on this plot of land is going to benefit the current residents and their families for generations. I'd be saluting this in a New York minute. But my what I've been seeing unfolding in our city.'",
        "'speaker_12': 'Is. That's not the case. I have the same worries for Globeville, Elyria, Swansea, you know, and the changes that are coming to those neighborhoods. If this is going to benefit them, absolutely. Without question. I hope that be the case.'",
        "'speaker_12': 'For me, the guiding factor is a clear neighborhood process, a clear neighborhood plan. But this is not a yes vote I'm going to be happy about, not 100%. Thank you, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilman Cashman. Councilman Espinosa, you back up?'",
        "'speaker_2': 'Yeah, just this is just dovetailing on what Councilman Cashman said and specifically, actually what Councilman Clark said. He said that this is a community vision. When he was recounting his experience with the Decatur station. And and so I want.'",
        "'speaker_2': 'What? Also I wanted to comment to my colleagues is that yeah, those, those plans are just what you said in the way you said it about that vision and it's implemented in the plan. But somehow we end up just looking at that map.'",
        "'speaker_2': 'There's a there's all those pictures and there's a lot of words in there that talk about a lot of things. But we end up just looking at the map and and if it says eight and the purple is shaded the right shade, the justification is largely there, and then the rest is sort of boilerplate stuff.'",
        "'speaker_2': 'So to what I mean, sorry, Councilman Catherine, you know, I'm starting to think that we need to figure out what the tools are to actually capture the rest of that plan. Yeah. More robustly in these decision making processes.'",
        "'speaker_2': 'Thanks.'",
        "'speaker_0': 'All right. Thank you. Councilman Lopez, you're back.'",
        "'speaker_1': 'Yeah. Just really quickly, I think it bothers me to hear folks on this say that they have questions about the community process. I think it won. We've had it. I think we've been working on this for, what, eight months per.'",
        "'speaker_1': 'Close to eight months. Started out with community. Countless community meetings read. We had meetings in your shop. Had meetings in your facility. To her the site. Fact that we started this the the actual vision for this community plan.'",
        "'speaker_1': 'Federal to Cater Station plan since, what, 2001? They say that there's a lack of community process as such a misnomer is so incorrect. It's community that brought this to my desk. And so I assure you that that is the case.'",
        "'speaker_1': 'And secondly, you know, got to go back to the dictionary and look at gentrification. So it is that this placement. Is the fact that so many people in this city, if they look like my skin color, they walk into a bank.'",
        "'speaker_1': 'Chances are they're going to get the night alone. Discrimination is rampant, especially for folks in this neighborhood. The fact that somebody has an industrial use and simply wants to put in a windows in their house or, you know, try to find financing so they can stay in their house.'",
        "'speaker_1': 'That's a big deal. And yet, you know, we're going to say, well, we want to limit their property rights because we want to grow for five months out of the year to help homelessness. Which is a good and very noble cause.'",
        "'speaker_1': 'But we got to step back and look at the big picture. Is the fight in the homeless? Is it going to be right here in that parcel at this particular rezoning? The fight to close the food desert in Sun Valley, is it going to be on this particular rezoning?'",
        "'speaker_1': 'There's so much more that's going to take place in. And you know, if you really want to implement the plan and have this customized zoning that Rafael Espinosa love so much about. Right. Then that means your property is going to get taken and you got to give it up.'",
        "'speaker_1': 'That's just a matter of fact. In the streets in Sun Valley. That's the question that we have. If we're going to widen some of these streets, if we're going to align them, that means that some property is going to get taken.'",
        "'speaker_1': 'I would love to see you there being the first one to say I'm in. Because I tell you what, it's going to sting when you see the price and what that's going to cost you. So for me, you got to step back.'",
        "'speaker_1': 'You got to look at the bigger picture. You got to look at the neighborhood plan. You got to look at what's there and what's being implemented. And yes, there was a community process and all poor people are getting pushed out for the sake of.'",
        "'speaker_1': 'Hipsters are gentrification. This is. Taking it from an industrial use to something that's a little bit better, especially for those residents on that side. Thank you, Mr. President. I support this, obviously.'",
        "'speaker_0': 'Thank you, Councilman Lopez. There are no more comments. I have some thoughts on this, but I will save them all because I'm so grateful that you're sitting in those hard seats at midnight and you all have worked really hard on this whole neighborhood.'",
        "'speaker_0': 'And sometimes the decisions go like you want them to, sometimes they don't. And I would just ask that you would stay in it. The fact that you showed up and we got to hear your perspective. You may not feel it, but it has helped this conversation and helped our future success on small area plans, amending plans, working'",
        "'speaker_0': 'on station area plans. And so I appreciate all of your involvement with that. Madam Secretary.'",
        "'speaker_7': 'Raquel Lopez. I knew Ortega. I Sussman. Black eye, Clark. All right. Espinosa. Flynn. I. Gilmore, i. Herndon.'",
        "'speaker_6': 'I.'",
        "'speaker_7': 'Cashman.'",
        "'speaker_4': 'Yup.'",
        "'speaker_7': 'Can each.'",
        "'speaker_5': 'By.'",
        "'speaker_7': 'Mr. President.'",
        "'speaker_0': 'I please close the voting, announce results?'",
        "'speaker_7': 'Lebanese love.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_0': 'No, no, no. It's a Lebanese because a settlement is not here.'",
        "'speaker_5': 'To be true.'",
        "'speaker_0': 'But, yeah.'",
        "'speaker_1': 'It didn't work.'",
        "'speaker_0': 'LOPEZ It's good. That's why we have you here.'",
        "'speaker_1': 'Just for the record, it didn't show up. Okay. Computers.'",
        "'speaker_0': 'Okay, let me get through this. 1212 I's council. 563 has passed. There is some pre adjournment announcements. The first one is Councilwoman Black, Councilman Lopez, myself. We need to get a hat for the CSU ram.'"
    ]
}