{
    "A resolution approving a proposed Contract between the City and County of Denver and Smith Environmental and Engineering, Inc. concerning providing environmental engineering design services at Denver International Airport. Approves an on-call contract with Smith Environmental and Engineering, Inc. for $1 million and three (3) years, with two (2) one-year optional extensions, to provide environmental engineering design services at Denver International Airport in Council District 11 (202157834). The last regularly scheduled Council meeting within the 30-day review period is on 7-18-22. The Committee approved filing this item at its meeting on 6-15-22.": [
        "'speaker_0': 'Thank you. I'll do a recap here. Under Resolutions, Council member Sawyer has called out Resolution 706 for a vote under bills for introduction. Council member Ngige has called out Bill 709 for comments under Bill's for final consideration. No items have been called out under pending.'",
        "'speaker_0': 'No items have been called out. Madam Secretary, would you please put the first item on our screens? Thank you. Councilmember Cashman, will you please put resolution 706 on the floor for adoption?'",
        "'speaker_3': 'I move the council resolution 20 2-0706 be adopted.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Comments by members of Council Council Member Sawyer.'",
        "'speaker_7': 'Thanks, Madam President. I just wanted to call this out for a vote. It's an airport contract that's on call. For those of you in the audience who are wondering what that means, I regularly call out on call contracts for agencies that do not have a solid reporting structure on how they use the money that has been called'",
        "'speaker_7': 'out. I believe that my constituents wants us to have better oversight of the dollars that are being spent in our community. And so every usually every week I call out at least one on call contract that's coming through.'",
        "'speaker_7': 'There's a second one that's coming through that's from the Department of Transportation and Infrastructure. I have not called that one out because Dottie has gone ahead and made some significant changes in partnership with Jezebel, which is everything's an acronym in the city, ah, which is our small business section of our economic development department.'",
        "'speaker_7': 'And they have made some really good changes to their reporting structure, but none of the other agencies have followed suit at this point. So I'll continue to call these out until hopefully some change.'",
        "'speaker_4': 'Has been has.'",
        "'speaker_7': 'Been created around here, I think.'",
        "'speaker_0': 'Thank you. Councilmember Sawyer. Madam Secretary, roll call on Council Resolution 20 20706.'",
        "'speaker_4': 'CdeBaca, I. Torres.'",
        "'speaker_6': 'I.'",
        "'speaker_4': 'SAWYER No black eye.'",
        "'speaker_1': 'Clark All right.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_3': 'I. Hines I.'",
        "'speaker_4': 'Cashman. I can h. I. Ortega. I. Sandoval. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results one day.'",
        "'speaker_4': '12 hours.'"
    ],
    "A bill for an ordinance amending Ordinance No. 1291, Series of 2021 concerning the Transportation and Mobility Special Revenue Fund.   Amends Ordinance 21-0291 creating the Transportation and Mobility Special Revenue Fund to expand allowable revenue received into the fund and memorialize certain intended revenue sources for the fund. The Committee approved filing this item at its meeting on 6-14-22.": [
        "'speaker_0': '12 ays Council Resolution 20 2-706 has been adopted. Madam Secretary, would you please put the next item on our screens? And wanted to let members in the chambers here know that we've opened up our overflow meeting room. It's directly as you walk out these doors, I believe we're using for 32.'",
        "'speaker_0': 'It's to the right. And so if you feel more comfortable with a bit more space, we have our overflow open. And I would also ask any members of the public who are standing against the back wall. We would ask that you find a location to sit for our fire code.'",
        "'speaker_0': 'Thank you, councilmember kenny. We have Bill 709. Please go ahead with your comments.'",
        "'speaker_7': 'Thank you. Council President. Sometimes history is really exciting, like when the avalanche win the Stanley Cup and it's on the front page of every paper and there's a picture of it. But sometimes history unfolds over very long periods of time.'",
        "'speaker_7': 'I did a whole review of history, how the city went from zero local dollars for affordable housing in 2011 to at least $30 million a year today and three quarters of $1,000,000,000 by 2030. That was over 11 years.'",
        "'speaker_7': 'You had to really be paying attention to understand history. And sometimes history is like even less in the under the radar or more under the radar and harder to track. And so this very exciting, historic bill is creating Denver's first ever special revenue fund for transportation and mobility.'",
        "'speaker_7': 'It's actually not creating it. It already existed as of a few months back, but it's actually cementing in it the city's commitment to put dollars in every year. So just check with me here. There has never been a dedicated source of funding for transportation mobility in the city's history.'",
        "'speaker_7': 'We thought that was something the federal government funded. Oops, not really. Maybe a little bit the state government. So we increasingly as a city, whether it's affordable housing, whether it's transportation, whether it's climate, we have had to step up and fill these gaps.'",
        "'speaker_7': 'And over the course of several years, a group of community advocates from Gender Streets, Partnership, Bicycle, Colorado, Colorado Public Interest Research Group and other really dedicated advocates kept coming to council members like Councilman Clark and Councilwoman Black and I saying we need dedicated revenue for safety of mobility and for climate transit, gets people out of cars.'",
        "'speaker_7': 'It is a climate saver. Bikes and PEDs have no impact on the climate at all. So every mobility change we make is good for our climate, but we are not funding it. And so so we created this fund with two sources incremental increase in the cost of parking on our streets.'",
        "'speaker_7': 'Right. Those parked cars have an impact on our climate, and now they're mitigating some of that impact by investing in this fund. And secondly, some of the fees that are fines that are paid for people who park in bike lanes and things like that.'",
        "'speaker_7': 'So those two sources under this language that we're putting in this bill today are committing our city to putting those incremental dollars into this fund each year to be doing the right thing for climate and doing the right thing for safety in our community and options for people.'",
        "'speaker_7': 'And so it's $16 million. It's a start. It is something we need to continue to invest in and grow just like we grew the housing fund over those 11 years. I hope 11 years from now we're talking about three quarters of $1,000,000,000 here, too.'",
        "'speaker_7': 'That'll be up to the next generation of council members. But in case you missed it, it's the Stanley Cup of Transportation and Mobility for where we are today. So I'm really excited. Nobody's called it out. It's a pretty tortured analogy, but thanks for entertaining me tonight.'",
        "'speaker_7': 'I'm excited and it's going to be in our consent agenda, but y'all should know about it. So thank you.'",
        "'speaker_0': 'Thank you very much. Councilmember can teach your passion is almost equivalent to the avalanche winning the Stanley Cup. But just as important, if not more so, I will I will venture. So thank you for that. And that concludes the items to be called out this evening.'",
        "'speaker_0': 'All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote. Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Cashman, would you please put the resolutions for adoption and the bills on final consideration for final passage on the floor'"
    ],
    "A bill for an ordinance amending Chapter 48 of the Revised Municipal Code of the City and County of Denver to repeal the fee on composting and implement a volume-based pricing system for trash, including recycling and composting services at no extra charge, to facilitate improved waste diversion and its related environmental benefits. Amends Chapter 48 of the Denver Revised Municipal Code to repeal the fee on composting and implement a volume-based pricing system for trash, including recycling and composting services at no extra charge, to facilitate improved waste diversion and its related environmental benefits. The Committee approved filing this item at its meeting on 6-7-22.": [
        "'speaker_0': 'Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted. We will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating to virtual participants.'",
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'We're going to go ahead and get started here first with council members sharing amendments that they may have to the bill, and then we'll go to the staff report. Council Member State Abarca, will you please go ahead with your comments?'",
        "'speaker_4': 'Can you hear me?'",
        "'speaker_0': 'Can you hear me? Yes. Yes, we can hear you.'",
        "'speaker_4': 'Thank you. It is my intent to offer an amendment tonight to this item that automatically rebates people living in.'",
        "'speaker_6': 'A specific.'",
        "'speaker_4': 'Type of nest neighborhood based on our 2016 gentrification study, so that folks who are in those neighborhoods do not have to jump through any eligibility testing, requirement hoops. We know that this is a big barrier to people accessing our different resources in the city, specifically rebates, for example, with property tax rebates.'",
        "'speaker_4': 'We know that eligibility testing is a barrier many people don't overcome to absorb the benefits of those rebates. And so what this would do is it would take the information that we provided that we paid for in our 2016 study about neighborhood change and income attributes of households in our neighborhoods.'",
        "'speaker_4': 'And it would. Automatically give those folks a credit on their trash bills simply because we already know the data based on those 20 2013, I believe, was the latest data sets, those data sets. And that is what my amendment would do tonight.'",
        "'speaker_0': 'Did you have something additional council member say to Baca to add?'",
        "'speaker_4': 'No, that's that's the gist of them.'",
        "'speaker_0': 'All right. Thank you. Councilmember Herndon, please go ahead with your comments.'",
        "'speaker_3': 'Thank you, Madam President. It is my intent tonight to offer a technical amendment to this item that doesn't change anything. There is a reporting requirement for the volume based draft proposal. My technical amendment will codify it, so it will put it in the code.'",
        "'speaker_3': 'There's no misunderstanding that that is required. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Herndon. Councilmember Flynn, please go ahead with your comments.'",
        "'speaker_5': 'Thank you, Madam President, I. I have the intent of offering an amendment tonight that would change the effective date from next January to October to push it back to October 23. After hearing the data, the input from Doddy at the committee a few weeks ago about the vacancy, the high vacancy rate and the inability of the solid'",
        "'speaker_5': 'waste crew not through no fault of their own, by the way, very hard working crew, but their inability to meet the current schedule that the ambitious addition of weekly recycling that requires 22 additional operators in addition to trying to make up a 28% vacancy when we've only managed to hire 7% in the last five months is an'",
        "'speaker_5': 'obstacle to effectively starting this program and could, in my view, cause it to fall on its face and be the source of many, many more complaints than we already get about the existing program. I don't support the fee at all in any case, but if it were to pass, I would want to see it succeed.'",
        "'speaker_5': 'And I believe this is a necessary delay so that solid waste can staff up to a close to 100%. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Flynn. Councilmember Ortega, please go ahead with your comments. Thank you, Madam President. I intend to bring an amendment forward tonight. And this is an amendment that was discussed last week as a compromise to my compromise that did not pass.'",
        "'speaker_0': 'And this would basically require that anything above 5% that is being recommended as a fee would have to come to the city council for approval. So that's the essence of what that would do. Thank you. All right. Thank you.'",
        "'speaker_0': 'Councilmember Ortega. Councilmember Cashman, will you please put Council Bill 22, Dash 0685 on the floor for final passage?'",
        "'speaker_3': 'Yes, ma'am. I move that council bill 22 685 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. The one hour courtesy public hearing for Council Bill 22, Dash 685 is open. Speakers may offer comments on the item directly or as I think we may see, speakers may offer comments on the item directly or as well on the attended amendment.'",
        "'speaker_0': 'The council member spoke about and before we dove into the speakers, may we please have the staff report?'",
        "'speaker_1': 'Good evening, council president. Good evening. Members of council and the public listening in here today. My name is Adam Phipps. I'm the executive director for Denver's Department of Transportation and Infrastructure. Before I jump in, I want to take a quick minute just to thank a members of council here.'",
        "'speaker_1': 'This is our fifth opportunity to present this proposal to you in the last couple of months. And in that couple of months, we've received an incredible amount of good feedback, suggestions, ideas, and working with our partners here on the dais.'",
        "'speaker_1': 'We've worked to an ordinance tonight that I believe will successfully leave Dottie to a much greater diversion right here in the immediate future. So thank you for that. Secondly, I want to remind everybody that this is not something that came to be without a lot of attention.'",
        "'speaker_1': 'We started the community outreach, the public engagement process over 20 years ago around what we wanted to do with a volume based trash pricing system for the city and county of Denver. A lot of public outreach, a lot of great ideas, a lot of good commentary.'",
        "'speaker_1': 'And I appreciate that thoughtful process. Thirdly, I want to recognize that for ten, four, nine out of the past ten years, this council body has identified that solid waste management and increasing our diversion rate as a priority for the city and county of Denver.'",
        "'speaker_1': 'Tonight, I'm excited for that to be in front of you for a final vote. With that, I'm going to bring up my project manager for this effort, Jessica Holley, to walk you through the staff report.'",
        "'speaker_6': 'Hi, everyone. Jessica Lolly, Daddy's project manager for this program. Thanks, Adam, for the introduction. So I'd like to start off by saying that our collective commitment to the environment is having an impact. Since we started tracking our greenhouse gas emissions in 2005.'",
        "'speaker_6': 'We've seen improvements in the commercial building sector in transportation, but we've actually seen 0% decrease in our emissions from waste over the last 15 years. The city has a sustainability plan. It's over a decade old as a solid waste master plan from 2010, recently renewed.'",
        "'speaker_6': 'And all of those things call for reducing how much we send to the landfill, which for these customers, the hundred 80,000 single family homes and apartments of seven units, we send about 180,000 tons the landfill each year. The city recently updated its emissions reduction reduction goal to align more with climate science, saying that we are aiming to'",
        "'speaker_6': 'reduce our emissions by 100% by 2040, and that includes waste, because waste truly does have an impact on those emissions. It's not just what comes off of the landfill, but it's also everything that it took to extract those resources, transport them, you know, the whole production process, transporting them again.'",
        "'speaker_6': 'And then if it's unfortunate enough to end up in the landfill, it is emitting greenhouse gases from there as well. So waste does matter. But those emissions for waste from waste are something that we can control. We can and should take action on them.'",
        "'speaker_6': 'High or low diversion rates are a proxy for how seriously cities take the issue of climate change. Our low diversion rate, how much we recycling campus, does not reflect Denver's commitment to this issue. It actually harms our our green reputation.'",
        "'speaker_6': 'Our customers need the tools, the infrastructure, the expanded services to put this commitment into action. So where does Gunvor stand with its waste? As I've said before, our residential waste diversion rate is at 26%. Comparing that to the national average of 34%, we're doing we're much lower than our comparable cities.'",
        "'speaker_6': 'So everything every city that you see on this screen are cities who are equivalent to Denver and also do not include construction and demolition diversion in their diversion rates. So volume based pricing is a nationally recognized, successful strategy at getting residents to increase their recycling and composting.'",
        "'speaker_6': 'So why is it specifically going to work for Denver? We've seen it work for other cities, so mainly because Denver needs to drive behavior change for one, unlike many residents in Denver. Solid Waste Management Services do not pay a direct fee for their trash.'",
        "'speaker_6': 'There's no connection for them between how much trash they generate, what it costs to provide our services, and the cost of that has to the environment on top of that. Our compost program is optional and fee based and therefore we are not incentivizing our residents to do the right thing or disincentivizing them.'",
        "'speaker_6': 'Secondly, like I said, Denver's diversion rate is at 26%. That number has only increased 1 to 2% over the last 20 years. But when we look at an average trash cart in Denver, 50% of what's going into that is compostable material.'",
        "'speaker_6': 'It's all of your yard debris with their grass and your leaves. It's all of your food waste. And that content is significant because that's what it takes to increase diversion. For Denver, we want to give the customers that, you know, feel burdened or feel a barrier with our current fee based system, the infrastructure that they need to'",
        "'speaker_6': 'do the right thing. Thirdly, compost takes direct action at fighting climate change. Not only are we removing food from the landfill where it emits methane, we're actually finished. Compost can be applied to parks, gardens, agricultural land, and it sequesters carbon from the atmosphere, increases water retention in the soil, and it just improves overall soil health.'",
        "'speaker_6': 'So I've been speaking to our customers, the 180,000 homes, and I just wanted to point out that the commercial sector is doing better than us. As far as recycling and composting goes, they're at a 37% diversion rate as opposed to our 26%, and that's not including construction and demolition debris.'",
        "'speaker_6': 'So these are the items that I want to highlight in our proposed ordinance, removing the fee for compost service, replacing it with the volume based service fee, establishing that the revenue that we earn from this program can only be used to provide the service.'",
        "'speaker_6': 'We're adding language to require Dotti to provide an affordability program in the form of an instant rebate and then also adding language surrounding compliance. How does this look for a Denver resident? Well, basically, the smallest trash card costs the least.'",
        "'speaker_6': 'Vermont, the largest trash cart cost the most per month. And the recycling compost carts will be included at no additional cost. So really, the price of the trash cart incentivizes maximizing your use of your recycling your cycling compost carts.'",
        "'speaker_6': 'I also want to make note that these are the lowest rates in the Denver metro area and also some of the lowest rates across the country. These are the services that are included in those rates. So something that our residents and all of you I think are really excited for is weekly recycling.'",
        "'speaker_6': 'We will see about a 2000, a little over 2000 tons per year increase in recycling with weekly recycling to capture the excess cardboard that we're seeing overflow into the trash with their current biweekly collection. We'll also be expanding compost service to all of our customers.'",
        "'speaker_6': 'So another 150,000 homes and then everything else on the screen are services that solid waste already provides. An important piece of this is the affordability program, which is an instant rebate provided in partnership with Denver Human Services. Eligibility will be based on income and number of people in the household, so residents will be eligible for 50, 75'",
        "'speaker_6': 'or 100% off, depending on where they fall on that scale. These applications will be available prior to rollout so that the first invoice that residents receive reflects what they can pay. And then we are also adding some efficiencies with Denver Human Services programs where they're able to auto enroll customers into our program based on information that they'",
        "'speaker_6': 'already know from other local programs. So I'm going to speak to the education and outreach for this does pass. Salaries will be hiring a new program manager to manage the $3.8 million annual education budget for this program. There will be multiple multilingual education pieces on how to recycle and compost video, digital print card signage, truck signs.'",
        "'speaker_6': 'There will be paid partnerships with community organizations who will be helping us do outreach on recycling and composting, but also on the expanded services and new fee. There will be direct, multilingual customer education on billing services rebate program, including print and digital communications.'",
        "'speaker_6': 'There will also be increased information for compost customers on how to proposed and reduce contamination. We will be participating in many community events, whether that's through our community based orgs or asking ourselves. And then throughout all of these things, we will be promoting the rebate program and assisting residents with applications.'",
        "'speaker_6': 'And that's the end of my presentation.'",
        "'speaker_7': 'All right.'",
        "'speaker_0': 'Thank you for the presentation. We have 33 individuals signed up to speak this evening. We have one hour as a courtesy public hearing. So I would ask that folks withhold their applause because that's going to take time from other speakers, because as soon as the first speaker starts, I begin timing.'",
        "'speaker_0': 'And we have 60 Minutes allocated for the courtesy public hearing, and then we'll go into questions from members of council on this. And then as you heard prior to this presentation, we have four different amendments to the bill that we also have to make.'",
        "'speaker_0': 'And so we want folks to also know that you have 3 minutes. But if for whatever reason you don't feel like you need to use your full 3 minutes, please see that to the next speaker because then that will allow us to hear from more folks.'",
        "'speaker_0': 'And so we are going to go ahead and get started with our first speaker, and that is Kevin MATTHEWS in chambers here. We've got Kevin MATTHEWS after Kevin MATTHEWS, Margaret, at ten zero, followed by Brian Lomax. Go ahead, please, sir.'",
        "'speaker_1': 'Thank you. My name is Kevin MATTHEWS. I am speaking as a member of 350 Denver this evening, and I am a resident of Congress Park. And speaking in favor of the expanded waste services measure this evening and wanted to point out that 350 said in a letter a few weeks ago supporting this measure.'",
        "'speaker_1': 'The first time I heard about this proposal was four years ago, and I know some people have been working on it a lot longer than that. I hope that a few of you recognize the problem with that timeline.'",
        "'speaker_1': 'According to the IPCC, we need to cut emissions in half by 2030. When it comes to climate justice. For every million metric tons of organic waste that decomposes, 469 metric tons of greenhouse gases are released. Composting can reduce those emissions by more than 50%.'",
        "'speaker_1': 'The potential for municipal composting can remove 1.4 gigatons of emissions by 2050, which is like taking over 3 million gas powered cars off the road. For my own part, my household has already enrolled in the home composting program, which we pay the yearly fee for, and I'll be very happy to have that here go towards trash instead'",
        "'speaker_1': 'of getting composting and recycling for free. Since we've joined the program, the amount of trash that we actually throw out is very small. The bag, a small bag a week. I know there are concerns about people not being able to navigate the proper program.'",
        "'speaker_1': 'I'm not that bright. I figured it out. I think the rest of the Denver residents can figure it out as well. I also know there's concerns about the cost of the program. Denver Homeowners have gained over $200 billion in equity in the last ten years and now have $400 billion of collective wealth.'",
        "'speaker_1': 'I think we can manage it in surveys. Even 80% of Denver ANC members, that bastion of progressive change, supported this policy. This may not be the most perfect policy as no policy ever is, but we cannot wait any longer.'",
        "'speaker_1': 'Please support this measure this evening.'",
        "'speaker_0': 'We can't.'",
        "'speaker_1': 'Wait. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Margaret. Attention.'",
        "'speaker_4': 'Excuse me.'",
        "'speaker_1': 'All right, we'll.'",
        "'speaker_0': 'That evening.'",
        "'speaker_1': 'Madam President.'",
        "'speaker_6': 'And members.'",
        "'speaker_1': 'Honorable members of Denver City Council.'",
        "'speaker_0': 'My name is Margaret Atencio.'",
        "'speaker_6': 'I live in Denver. I was born.'",
        "'speaker_0': 'In Denver 75 years ago. So I've.'",
        "'speaker_6': 'Seen a lot of changes.'",
        "'speaker_0': 'In this town. My my father was a city attorney, an.'",
        "'speaker_6': 'Assistant city attorney for 42 years.'",
        "'speaker_0': 'For Denver County. And for ten of those years, he was the counsel for city council. And my father used to say something to me. And each of my siblings, he said, Always live in Denver because as long as you live.'",
        "'speaker_4': 'In Denver, you.'",
        "'speaker_1': 'Will always have good water.'",
        "'speaker_0': 'And free trash pickup. And he he said that again and again over the years, and he meant it. I feel that installation of this program would be a dire.'",
        "'speaker_1': 'Dire.'",
        "'speaker_0': 'Hurt to many people, including myself. And I'm on Social Security. There are many people in Denver that are on Social Security or in the.'",
        "'speaker_1': 'Lower income.'",
        "'speaker_6': 'Brackets.'",
        "'speaker_1': 'Of this town.'",
        "'speaker_0': 'And I don't see many.'",
        "'speaker_1': 'Of them here at this point in.'",
        "'speaker_0': 'Time or people that are on Social Security. Basically.'",
        "'speaker_6': 'I. I am.'",
        "'speaker_4': 'Interested in.'",
        "'speaker_0': 'Sustainability. But believe me, I am I am more interested in human sustainability. Denver has always been a town with a heart, and we have been a.'",
        "'speaker_1': 'Good place to live.'",
        "'speaker_0': 'We've tried to do good over the years and as much as we can. We've got various things. But every time we've done wonderful things for our community, for life, like the zoo or the Botanic Gardens, we've taken votes and we voted those.'",
        "'speaker_1': 'Funds through.'",
        "'speaker_0': 'Agreements of all the.'",
        "'speaker_1': 'People, not a few people that say you will from now on.'",
        "'speaker_0': 'Be paying this.'",
        "'speaker_1': 'And this and this, no matter.'",
        "'speaker_6': 'If it takes if it comes during a period of economic.'",
        "'speaker_0': 'Problems that we have now with gasoline, with food, with baby formula, I want you to think about it. Think about it with your hearts as well as your economy and think sustainability. Think about human.'",
        "'speaker_1': 'Sustainability. And I would like to.'",
        "'speaker_0': 'Congratulate everybody here who is here for the St Patrick's Day parade. And thank you. Thank you. Our next speaker is Brian Lohman, and then he will be followed by Rosario CdeBaca.'",
        "'speaker_1': 'Good afternoon to council members of the community. Everybody at home. My name is Brian Bouma. I'm a resident of Council District nine, owner operator of Cut the Plastic Environmental Litigation Solutions. And I represent Waste No More. Denver The complimentary citizen ballot initiative being voted on this November to bring recycling and composting to festivals, commercial properties of eight'",
        "'speaker_1': 'units or more corporations across the city and construction sites. The first thing I want to say is that I am very disappointed that this is a courtesy hearing when we charge our citizens money. We should have a full blown hearing and let everybody have the chance to speak.'",
        "'speaker_1': 'And I know that I don't stand alone in thinking that we should have more than an hour to discuss this as the public. But I'm going to make my answers really easy. Whether you're listening to the avalanche game on public radio or on the radio or in person at the arena, they talk about recycling and being responsible'",
        "'speaker_1': '. When we go to festivals like Five Points Jazz Festival. Volunteers are already working to divert at that festival. This year, 75% of our consumed material to recycle and compost. Households are the worst offenders in our county. For those who should have access to having free recycling and composting and the education systems, not just by the city, but'",
        "'speaker_1': 'by the schools, by the corporations, by the citizen groups all across the board that to save our planet, we need to do better. As we see in our state legislature with an enhanced producer responsibility for manufacturers, composting and recycling is a reality.'",
        "'speaker_1': 'Styrofoam has been banned in the state in the next couple of years. We won't have any more of that nuisance product being sold in our stores. There might not be enough education happening. Councilman Flynn, I saw your post the other day and I'm glad that they included in the presentation.'",
        "'speaker_1': 'But as a society, we're learning and we might make a few years of not getting it 100% right. But we need to establish the infrastructure and the processes, just like waste. No more will be for 31 million consumers in Denver.'",
        "'speaker_1': 'We need the 190 roughly thousand houses to get on board and on track as well. Thank you for your time.'",
        "'speaker_0': 'Thank you. Our next speaker is Rosario CdeBaca.'",
        "'speaker_6': 'Good evening, President and Honorable Council Members. Thank you for the opportunity to speak. And my name is obviously debacle. I live at 3570 West Evans Avenue in southwest Denver. I just want to share, you know, one kind of little indignity when I got the property tax bill.'",
        "'speaker_6': 'It would have been wonderful. It would have been very nice if the city had included notice that it intended to start charging fees for trash services, something that I've never had to worry about because it was included in the services provided by the city.'",
        "'speaker_6': 'And you know, I voted for all the bonds, everything that the city has ever asked. I have voted. And but there was no no this no mention. And I you know, in this meeting, they realize that it's the press.'",
        "'speaker_6': 'You the management has been trying to work on this matter for, what, ten years? It would have been a great courtesy for taxpayers to be told that things were changing. And, you know, I do my best to be a good neighbor.'",
        "'speaker_6': 'I live in a very busy intersection. I pick up the trash for the storm drain. And Kevin will tell you, I'm out there shoveling snow on both sidewalks and breaking up the ice so that cars don't lose traction.'",
        "'speaker_6': 'And so I unite with what Margaret was saying. You know, there are many of us who are on fixed incomes. Except for that, I still work part time as a union organizer. And the reason I worked as a union organizer is because I believe in treating people with respect and with dignity.'",
        "'speaker_6': 'My mother worked in the fields and I volunteered to organize forces that Travis when I was only 14. So I'll be 70 next year. And I am not stopping when I see that there is. Abuse in dignity and equality.'",
        "'speaker_6': 'Denver is going through a rapid gentrification process, and the demographics are changing fast. And so I don't know if it's calculated measures to drive seniors like myself who are working very hard to still live in Denver or people of color because five points.'",
        "'speaker_6': 'Swansea. And now, you know, in my neighborhood, I mean. We're beginning to feel like we're just getting in the way. My husband and I raised five children. So I understand the frustration of people with residential trash. But do you know how many diapers?'",
        "'speaker_6': 'One baby generates. I mean, there are things that perhaps I don't know. How many of you have babies? Have children. Babies generate a lot of trash.'",
        "'speaker_0': 'Thank you. That's the time we have a lot of for each speaker. And so. Yeah.'",
        "'speaker_6': 'So, Holly, I just want to add that please consider that Denver is a great city, but these can have a very racist and a just.'",
        "'speaker_0': 'And we're going to have to move on. Thank you. Robert Bailey or Sara Taylor Ryman is our next speaker, followed by Robert Bailey. Just right here at the podium. There's a mic right there. So can you just speak normally ahead, please?'",
        "'speaker_6': 'Hi. Good evening. Members of council. My name is Taylor Ryman and I am a resident of District ten and a member of Denver's Sustainability Advisory Committee, a council on the Zero Waste Committee. But I'm only here speaking for myself.'",
        "'speaker_6': 'I'm also a public service professional, so I share your love for service. I first learned about pay as you throw systems in 2015 when I studied abroad in Hong Kong. My small group of students was tasked with studying the local waste issues and proposing something that might address them.'",
        "'speaker_6': 'Hong Kong at the time was facing some imminent landfill closures, and so the issue was rather pressing. But we ended up deciding to propose with pay as you go, and that's kind of was my introduction to it as an idea.'",
        "'speaker_6': 'Fast forward to today and writing these talking points and I decided to go back and Hong Kong actually just finally passed approval of the pay as you throw scheme. I don't know how much influence my little ragtag group of garbage gremlins had on that decision, as the political will was in a lot of flux and there was'",
        "'speaker_6': 'a lot of other issues there. But I digress. I thought it was really cool. I'd like to urge your support for expanded waste services for the following reasons. The service structure has proven successful in many communities. The fee schedule is lower than most, and it would be a great help towards meeting Denver's diversion goals.'",
        "'speaker_6': 'Some cite the equity issues, which I think are totally valid and how this would impact low income communities. And the plan does outline an affordability program that would of course adjust the fee based on your AM I, but that doesn't solve all of our problems.'",
        "'speaker_6': 'My greater concern, though, is how the equity issues with the current system and the fact that some people pay for services that they don't have access to and that high contributors to the landfill stream are essentially subsidized for their wastefulness.'",
        "'speaker_6': 'Since everybody pays through sales and property tax to fund our trash collection, we all don't get equal access. And people who throw out more garbage are, again, just being subsidized for for that and creating this program. And the fee structure would justify current discrepancies in who pays for trash collection and who gets the service.'",
        "'speaker_6': 'It would expand the services that we offer, equalize access, and provide accountability and incentives for high generators to reduce their garbage. I don't think education alone will be successful unless there's an incentive component. Plus, why spend more resources on educating people on how to divert their waste when some will not have the diversion options needed to act'",
        "'speaker_6': 'on education, on the education that we advance? Since trash is again currently paid the way it is, people don't think twice about throwing trash away, but away as a place and trash is a resource. It's a buried issue, pun intended, and creating a fee structure that incentivizes recycling and compost would make the issue of wastefulness more visible'",
        "'speaker_6': 'and an accessible matter and could drive positive behavior change. Make your point.'",
        "'speaker_0': 'Our next speaker in chambers is Robert Bailey, followed by Madeline Singer.'",
        "'speaker_1': 'Hello. Thank you for having me here today. I appreciate it very much. First of all, just to add a little bit of credibility, I've been composting and recycling every day. I've been filling up bins every day for 14 years.'",
        "'speaker_1': 'Bills from GFL. I believe GFL does some of the recycling sorting for Denver. My June bill here only $900. Only $900. It's a business. They want as much money, as much volume as they can get. They're in cooperation with the packaging industry.'",
        "'speaker_1': 'The more the better. Generally, we decide between more money or more green. It's generally one or the other. It's not both. Sometimes it's both, but generally not. Volume based trash service is is is a perfect example. Volume based trash service will have the exact opposite of green.'",
        "'speaker_1': 'The problem with recycling is that too much? There's too much trash. It makes no sense to have big diesel trucks pick up all this trash, take it to a sorting center, and then have big diesel tractors, put it into big diesel trucks and then take it to the landfill.'",
        "'speaker_1': 'This makes no sense. It's much less green to do it that way. It's much more green to take your trash directly to the landfill. This is trash, by the way. I know there's a recycle logo on this. The reason is, of course, because the recycle industry wants that recycle logo on there and it takes four times as'",
        "'speaker_1': 'much energy to recycle this as it does to not recycle it. Well, driving 40 miles is not more green to driving ten miles. It's more volume. There's plastic, there's glue, there's there's wax. Makes no sense. But see, the thing is, people are going to be putting this in the recycle bins and then we're going to be paying'",
        "'speaker_1': '$30 million for GSL to sort that and then haul it to the landfill. Let's talk about the money for a second. Does everybody realize is this a typo? Is the Department of Transportation, are you guys still here? Is this what you guys give 20 cars in a row, a ticket?'",
        "'speaker_1': 'You are you you call a street street sweeping the streets. Don't get swept. You're financial predators. Is this is this real? Is this fine? $1,000 is if if you have profit in your recycle, is is this a misprint or is this real?'",
        "'speaker_1': 'Is it $1,000? Is it $1,000 or is this a misprint? Does everyone know that there's $1,000 fine from the Department of Transportation? If you have trash in your recycle, I guarantee you I can find you. Fill up a recycle, I'll find trash in every one of them.'",
        "'speaker_1': 'I just went out and took a picture of the first recycle bin. There's food waste in there, so there's $1,000 fine. And then right here, they will leave your house. If you don't pay the the Department of Transportation $1,000, they will leave your house.'",
        "'speaker_1': 'That's the money part of it. This is all about the money. It's a big money grab here. This is education and outreach. Okay. That should say propaganda. Okay. It's all about demonizing the landfill. Okay. I would recommend having a picnic at the landfill, but there are no problems with the landfill.'",
        "'speaker_1': 'The methane is captured. It's turned into electricity. Thank you very much for having me today. Appreciate it very much.'",
        "'speaker_0': 'Thank you. Our next speaker is Madeleine Singer.'",
        "'speaker_4': 'Dear members of the Denver City Council. Good afternoon. My name is Madeline Singer, and.'",
        "'speaker_6': 'I'm a rising 10th grader at East High School. I strongly urge the passing of the Expanded.'",
        "'speaker_4': 'Waste Service proposal because the proposal encourages people to.'",
        "'speaker_6': 'Cycle and compost. There are.'",
        "'speaker_4': 'More than 220,000.'",
        "'speaker_6': 'Tons of waste from Denver homes each year, according to the Denver gov. Org. The proposal will not only make recycling and composting easier, but will force people to think about whether the item they're throwing away should be put in a certain bin.'",
        "'speaker_6': 'This will make dendrites more conscientious about climate change. I talked to my neighbor today and she was really enthusiastic about the proposal and would pay the fee but wants to know whether what she's recycling will actually be recycled and reused.'",
        "'speaker_4': 'The city plans to double the recycling and.'",
        "'speaker_6': 'Composting rates by 2032. When we hit that goal, it will be equivalent to removing the greenhouse.'",
        "'speaker_4': 'Effect of more than 600,000 cars from the atmosphere. Why would we not take the equivalent.'",
        "'speaker_6': 'Of 600000 hours worth.'",
        "'speaker_4': 'Of greenhouse gases.'",
        "'speaker_6': 'Out of the environment? This is a huge step toward decreasing climate change, but we can always do more. As a young person, I urge you to vote yes on the proposal because not only will it affect my generation, but future generations to come.'",
        "'speaker_6': 'Thank you for your time.'",
        "'speaker_0': 'Thank you. We're going to go ahead and move virtually to Lawrence Murray.'",
        "'speaker_1': 'You. Me? Yes. Yes. Yes. Yes. I agree. My name's Mark Murray, and I'm from Bob MONDELLO. And the subject I have here is trash. The OR volume based pricing is still a tax. Inflation is fed by the interest rate hikes as hikes, food hikes, rate hikes, medicine hikes and now I city which the hike up taxes would'",
        "'speaker_1': 'be nice if the city would consider the tax paying citizens more than inflation. It seems to be getting really attention already. The main reason I presume the city is looking at this is consideration for climate change. Yes, please consider that.'",
        "'speaker_1': 'So I have another idea to consider. The city wrap issuing building permits to mandate all new.'",
        "'speaker_3': 'Commercial construction.'",
        "'speaker_1': 'Of solar systems as well as all or all part of its energy generation and for all affordable new housing, the same requirement. That would be a significant positive impact on the environment, as well as providing savings for homeowners to avoid the new trash tax.'",
        "'speaker_1': 'You will not consider my suggestion. I will not support suggested tax hikes. On another note, GREGORY Let's return to the requirement for certain city employees, such as police officers and firefighters, to live in the city they serve in.'",
        "'speaker_1': 'Thank you very much. I'm then. You do.'",
        "'speaker_0': 'Our next speaker is joining us in chambers, Muhammad Khan.'",
        "'speaker_6': 'Good evening, everybody. Council members and everybody who's here in support of expanded reserves. Please raise your hand. Thank you all for coming here. My name is Bob McCone. I work in District ten and I am right down the street, Beneke and Spear and I live on Sixth and Sheridan and I have.'",
        "'speaker_1': 'Another property in Clayton, which is on Bruce Randolph and Garfield.'",
        "'speaker_6': 'So I heard a lot of things here and I actually.'",
        "'speaker_1': 'Had a script that I was going to talk about, but I'm going to try answering some of the questions. So people talked about, you know, the trash used to be free in this city. Water used to be a fly parade in Denver until 1991.'",
        "'speaker_6': 'And now we pay for water by each thousands of gallons we use. And nobody backs an eye on that. Denver Water launched their light reduction program a couple of.'",
        "'speaker_1': 'Years ago and.'",
        "'speaker_7': 'They're even.'",
        "'speaker_1': 'After it dead. Their hype.'",
        "'speaker_6': 'Their rates and everybody was happy. I'm happy as a homeowner that owns two homes. I would rather pay $3 extra per thousand gallons of water versus being $18,000 per water line replacement. So this is and the other thing I heard here is, you know, we.'",
        "'speaker_1': 'Have grass here that we drive around.'",
        "'speaker_6': 'The country, momentum, glass open the recycling facility in Denver, and they don't have enough.'",
        "'speaker_1': 'Glass to run their facility. So they are bringing grass from.'",
        "'speaker_6': 'Outside the state to for further facility needs. Similarly, Ball Corporation is an aluminum can manufacturing company here in Golden, Colorado.'",
        "'speaker_1': 'That could that we use.'",
        "'speaker_6': 'The land that we use the aluminum that we are recycling. It's all about closing the loop, keeping things local. That's where all the pipes are coming from. I have also heard about contamination issues. Believe me, I live on Chagrin Boulevard.'",
        "'speaker_6': 'My trash bins are right on schedule Boulevard. There are people walking by and they throw this stuff in the trash bins. I have not seen contamination and I am the one who gets in my dumpsters.'",
        "'speaker_1': 'Every single day.'",
        "'speaker_6': 'Checking what is in there because I want to be responsible.'",
        "'speaker_1': 'Citizen. However.'",
        "'speaker_6': 'When I forgot to put the recycle.'",
        "'speaker_1': 'Bin out to the curb.'",
        "'speaker_6': 'One time, I had to wait for weeks in order to catch up on my recycling. There was recycling in my house.'",
        "'speaker_1': 'There was boxes.'",
        "'speaker_6': 'Full of recycling just because I wanted to do the right thing and not want to put it.'",
        "'speaker_1': 'In the trash. I think.'",
        "'speaker_6': 'Weekly recycling would be.'",
        "'speaker_1': 'Very helpful there.'",
        "'speaker_6': 'And last thing I want to talk about is the equity piece of this program. As a homeowner who owns two properties, it is not fair for me that my coworkers who live in a condo across the street pay for my free recycling and trash.'",
        "'speaker_6': 'It is only equitable that I paid $9 a month.'",
        "'speaker_1': 'It's not the most amount of fresh.'",
        "'speaker_6': 'And last thing I would say is I ran a case study.'",
        "'speaker_1': 'At our office.'",
        "'speaker_6': 'In two years. We went from zero recycling to 100% zero waste. It is doable. We just have to educate it and we.'",
        "'speaker_1': 'Have to provide the means. Thank you, everybody.'",
        "'speaker_0': 'Thank you. Where our next speaker is, Claire Harris joining us virtually. Can you hear.'",
        "'speaker_4': 'Me? Is my.'",
        "'speaker_0': 'Microphone working?'",
        "'speaker_1': 'Yes, yes, yes. Yes.'",
        "'speaker_4': 'Okay. I want to agree with the man who mentioned having solar panels and all those things. Also, I agree with Kevin about adding another fee. I can afford it, but I live in a neighborhood where that's.'",
        "'speaker_0': 'A big expense.'",
        "'speaker_4': 'For my neighbors. But I have another point that I haven't heard so far.'",
        "'speaker_0': 'I'm opposed to it because.'",
        "'speaker_4': 'I'm going to read from what I wrote somewhere else. Most plastic recycling is dumped somewhere else.'",
        "'speaker_0': 'It's a.'",
        "'speaker_4': 'That's great. But what I read is.'",
        "'speaker_0': 'That most of that actually.'",
        "'speaker_4': 'Ends up in the ocean or in a foreign country. We don't really end up with recycling, producing, recycling. I think educating citizens about all the ways to divert, compost, reuse, etc., to prevent disposable of extra waste, that's something that's education.'",
        "'speaker_4': 'But also the biggest issue is to stop.'",
        "'speaker_0': 'Having so much plastic. At the source. So.'",
        "'speaker_4': 'To me, the goal would be less PAC. Doing more use of paper using actually recyclable.'",
        "'speaker_0': 'Plastic or.'",
        "'speaker_4': 'Taking. In fewer recyclable. A fairer place to contain insurers from restaurants. Bags. So. Working on the song verse. And there's a beginning of where plastic.'",
        "'speaker_0': 'Waste is.'",
        "'speaker_4': 'Rather than trying to get at that at the end of it, to find a way to use the waste or reuse it. This is not this is not efficient. The problem is we produce so, so darn much waste.'",
        "'speaker_4': 'I Denver. I love that we charge for plastic bags. The other walk out in Denver across the street from me. No charge but soap in a toy for a kid. Anyway, that. My point is that I think we need to start with education and then.'",
        "'speaker_0': 'With looking at the.'",
        "'speaker_4': 'Sources of plastic and packaging and try to work with that. That's that's a way bigger way to start working with plastic and the other aluminum waste, etc.. Can it work?'",
        "'speaker_0': 'Okay. I miss Harris. Were you finished with your comments? I saw that you turned your camera off, but I wanted. You had a few more moments. I am.'",
        "'speaker_4': 'I was finished. I just wanted those points.'",
        "'speaker_0': 'Thank you. Thank you. Thank you. Our next speaker is Adam Meltzer. Followed by Nick Campion. Go ahead, please.'",
        "'speaker_1': 'Evening. City Council names Adam Meltzer. I am in District six in Denver. I was in Councilman Cashman's, Earth Day remarks to the event. And even though I spoke to a handful of attendees about what neighborhood associations in Denver do in relation to our environment, I realize that the impact I would have talking to a dozen people at'",
        "'speaker_1': 'a sparsely populated neighborhood event is minimal compared to the power of the city council and elected officials have. I want to focus on three points here. The first is the faults of representative democracy. The second is the unwillingness of the middle class and our fellow Democrats to pay for their landfill waste.'",
        "'speaker_1': 'And the third is why we consistently make wrong decisions around action oriented climate issues. Yesterday I realized that there was a fault, a representative democracy system that we work in. People who have the loudest voices don't always have the best interests of the community in mind.'",
        "'speaker_1': 'They may just have the best interests of themselves. I am fully aware that as a middle class white male, I can afford to pay for the privilege of filling our landfills with trash, creating methane, exacerbating the climate crisis we live in.'",
        "'speaker_1': 'But I don't. My family of four fills less than a half of a 35 gallon roll up in. Of waste per week. The rest is recycling compost. People are unwilling to pay even if they can, unwilling to change their behavior because they don't have to.'",
        "'speaker_1': 'There's no financial disincentive. I hope that tonight when the council vote, you consider the impact of your decision. A no vote means that we keep delaying progress on climate issues around waste. A no vote means we keep accepting the status quo and the consequences of adding more greenhouse gases into the atmosphere.'",
        "'speaker_1': 'A no vote means we keep denying our impact as single families while redirecting blame at other sources. A yes vote and a yes vote means we're willing to stand up and take action to address the climate crisis at a cost that makes us uncomfortable.'",
        "'speaker_1': 'A yes vote means we show. Denver writes that the city council is willing to make tough decisions that will benefit their communities, even though the community might not see the benefit.'",
        "'speaker_3': 'I don't think that I'm a minority with my perspective.'",
        "'speaker_1': 'I think that I'm part of the silent majority. There are neighborhoods in Denver where my perspective is a minority, and I guess I would expect council members to vote to reflect the opinions of your constituents. If you didn't, you'd risk being not elected again.'",
        "'speaker_1': 'But here's the problem the endless circle of inaction, creating toothless policies, talking and talking, but not doing enough to address our climate crisis. Eventually, we'll all pay. But it won't be just about money.'",
        "'speaker_0': 'Thank you. Our next speaker is Nick Champion.'",
        "'speaker_1': 'Hello, council members. My name is Nick Campion and I'm a member of the Sustainability Sustainability Advisory Council, Zero Waste Committee and Women's Sustainability. I'm a writer in District seven. And I support the expanded we services proposal. Tackling the climate crisis is a yes and situation.'",
        "'speaker_1': 'Yes, we need to reduce concrete waste, construction waste, and yes, we need to electrify our transportation. And yes, we need to improve our presidential waste diversion by providing free weekly recycling, encompassing or charging for trash, space and usage.'",
        "'speaker_1': 'Denver is the Mile High City and with a sad 26% waste diversion rate, are we trying to build mile high levels and low hanging fruit? Pretending that we have impacted. Sorry about any fruit that we can have impact on this rate through residential residents by implementing the Waste Services proposal.'",
        "'speaker_1': 'And yes, education can help increase the diversion rate, but changing the system is more effective than education for me. I tried years to convince my parents to compost. I sent them videos and websites about composting and local services that would provide them composting, but they never paid to sign up.'",
        "'speaker_1': 'Then I finally bought them a composting tumbler, and it was magic. And now they're composting advocates. They have less stinky trash and have healthy dirt for their gardening. There's pulling carbon out of that in the sphere. I was the cheese that cheese my parents to compost and helped the planet.'",
        "'speaker_1': 'Denver needs to change its residents mindsets too. How can I compost and recycle more? And how can I sell less trash and landfill? City Council Council needs to throw the broken system into the bin, probably preferably the composting recycling bin and become a city leader in composting recycling.'",
        "'speaker_1': 'In order for us to be the environmentally friendly city we want to be. We need every Denver resident in single family homes and multifamily buildings. Summer, a few unions, composting and recycling. In order to achieve this, we need to provide weekly recycling and composting for free.'",
        "'speaker_1': 'And I'm a renter. My taxes. Through my taxes, I pay for single family, house, trash and recycling, and I pay for trash recycling in my apartment. That's not a fair system. With the proposal a fix, this problem creates a new source of money in the general fund, which can be used to tackle other climate related issues in'",
        "'speaker_1': 'the entire city. I understand this can be an inconvenience for some residents, but are inconveniences such as large trash bins for free are a major reason why we are in this climate crisis. Cities such as Denver need to be on the front line of tackling climate change to set an example for other cities in Colorado, the country'",
        "'speaker_1': 'and the world. The climate crisis is getting worse and Denver can take immediate action now. Trees, greenhouse gas emissions through the expanded waste services proposal and I and many others in this room that support it. So to end my talk, can all the guests in the room like that support the expanded food service proposal?'",
        "'speaker_0': 'Our next speaker is me, Brzezinski, and it just says me is the first name. Okay. All right. So here's the key. If I.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_7': 'Just because you are eating at work and.'",
        "'speaker_0': 'Your first name.'",
        "'speaker_7': 'Please. Katrina.'",
        "'speaker_0': 'Katrina. Okay, great. We'll correct that for the public record.'",
        "'speaker_7': 'Thank you. Hi, I'm Katrina. Courtesy. As we all know now from Denver, District 11 was.'",
        "'speaker_4': 'Days ago more. Thank you. I wanted to thank you specifically.'",
        "'speaker_7': 'For you and your team listening to our needs and making things.'",
        "'speaker_4': 'Happen that are in.'",
        "'speaker_7': 'Line with our community's requests and goals. I know today is just going to be the same. So while there are many things I'm super passionate about and of course, as I'm.'",
        "'speaker_4': 'Sure you can tell.'",
        "'speaker_7': 'The environmental impacts is one of them. I'm actually here to talk about our optics. And I got to tell you, they're not great. They are not great right now. We are thought as a relatively green city, and with that it's due to great marketing.'",
        "'speaker_7': 'And I believed it until I moved out to the suburbs. And there I saw our trash cans and they're overflowing with recycling. And I started to understand the numbers. We're lagging behind when it comes to our waste. Where I live, we are fully reliant on the Denver system to work for us.'",
        "'speaker_7': 'And I have to tell you, it isn't working. It is not working.'",
        "'speaker_4': 'And.'",
        "'speaker_7': 'You know, we need things delivered to us. Things are getting better. How important are these? Denver Thank you so much. Stacy Yay! Costco.'",
        "'speaker_4': 'But the overflowing recycling has.'",
        "'speaker_7': 'More to do with the fact that the system as it is, is not keeping up with our demand.'",
        "'speaker_4': 'And the easiest way to do this is to have our system fixed.'",
        "'speaker_7': 'And we're talking about fixing it today. Unfortunately, if we miss one day of recycling, our cans are overflowing and people are just going to pick throwing it out instead of holding on to it for an entire month and then hoping that the neighbor next door has room in their ben.'",
        "'speaker_4': 'To put it in.'",
        "'speaker_7': 'So that is going to really impact our current recycling percentages to double simply easily by just doubling the amount of times that it's picked up. And that brings us closer to the national average.'",
        "'speaker_4': 'Actually, it would probably just help us far.'",
        "'speaker_7': 'Exceed those numbers. Also, I have been doing backyard composting for.'",
        "'speaker_4': '12 years now. I'm a.'",
        "'speaker_7': 'Proud homeowner in GR and I run a small business where I teach.'",
        "'speaker_4': 'People how to grow their own food and with that.'",
        "'speaker_7': 'It includes healthy soils and a conversation about composting. I would love to have better exit.'",
        "'speaker_4': 'Access as well.'",
        "'speaker_7': 'So the proposed system, one where I can have a place to dispose of the branches and the types of food scraps that just don't work in our backyard, tumblers and small scale systems.'",
        "'speaker_4': 'And with this.'",
        "'speaker_7': 'If we normalize our weekly service and have the composting normalized, it's going to increase the equity of healthier soils, which means healthier foods. So these two pieces are going to help align our marketing with the fact that Denver is a green city.'",
        "'speaker_7': 'It's going to send a clear and strong visual message that we're green. When you see recycling and green beans out everywhere for compost every single week, we can. Fix this problem and have a clear visual cue that Denver does, in fact care live up to its Green City moniker.'",
        "'speaker_7': 'I know you care. I do too. Thank you for voting yes and supporting our expanded Ways Services.'",
        "'speaker_0': 'Next speaker is Beth Burchfield. And after we have Sherry Shelton Butler.'",
        "'speaker_4': 'Thank you. City council members. My name is Beth Burchfield. I'm a local entrepreneur. I'm the board chair for Women in Sustainability, and I'm a homeowner in District one. I'm here today to urge you to support the proposed expanded waste services for Denver in the over 9000 other communities across the country with similar services.'",
        "'speaker_4': 'Waste diversion rates for 2 to 3 times higher than Denver's dismal 26%, which is way lower than our national average of 32%. To echo what Katrina said, Colorado is known for our love of the outdoors. Yet our policies and diversion rates don't really reflect our caring for the planet.'",
        "'speaker_4': 'Since when is Denver comfortable being below average of anything? I feel like the only thing we should be below average on is obesity rates and unemployment. As I mentioned, I'm an entrepreneur and my company collects and delivers sustainability feedback.'",
        "'speaker_7': 'I concern.'",
        "'speaker_4': 'Citizens consistently. We see that compost and recycling requests are at the top of those lists. The data not only shows that this is what people in our community want, but would also have a tremendous environmental impact with organic waste, such as food scraps and yard waste, are thrown into the landfill.'",
        "'speaker_4': 'They emit methane, which is 84% more potent than CO2. I don't know if any of you have been out to any of the landfills, but I personally went out to one a couple of years ago. And after you see the volume and the impact that one landfill has, it's impossible to look away from that problem, and it's'",
        "'speaker_4': 'really important that we do something about it. You have an opportunity today to really help Denver take a huge step forward and go from below average to a potential leader in sustainability, which is much more reflective of the amazing city we call home.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Sherri Shelton Butler. Followed by Ryan.'",
        "'speaker_7': 'Call Madam President and.'",
        "'speaker_6': 'Members of the commission here. I want to thank you for this. My name is Sherry Shelton Butler.'",
        "'speaker_7': 'I live in Littleton. I support this 125%. I want you to know that I got involved.'",
        "'speaker_6': 'With this eco cycle because I have.'",
        "'speaker_7': 'Invented an apparatus that washes plastic in the dishwasher, your zip top.'",
        "'speaker_6': 'Plastic bags. So it took me down a research channel.'",
        "'speaker_7': 'To find out that.'",
        "'speaker_6': 'The state that I love. Colorado is the 20th worst state in recycling.'",
        "'speaker_7': 'You heard a lot of statistics here and they are all things that I would have brought up, so I don't need to bring them up again.'",
        "'speaker_6': 'I really urge you to to listen to the statistics and make the step forward. It may not be the exact step. I agree with kind.'",
        "'speaker_7': 'Of coming in with some some meeting in the middle. But to make this step forward so that we can protect our state, our planet.'",
        "'speaker_6': 'And the promotion of proper waste.'",
        "'speaker_7': 'Management is far cheaper than the remediation.'",
        "'speaker_0': 'Thank you. Thank you. We're going to move virtually now. Ryan, call.'",
        "'speaker_1': 'The City Council. I was hoping to join you all in person tonight, but I'm a bit under the weather. Anyway, it's no surprise that I'm joining all the folks dressed in green to express my support for the expanded Waste Services Policy and eco cycle.'",
        "'speaker_1': 'We just celebrated our 46th year anniversary, and I have the privilege of working with some of the absolute best zero waste policy experts and educators every day. So I brought to them the concerns that you all raised and thought that tonight I'd focus on the intersection of zero waste, education and policy.'",
        "'speaker_1': 'Recycling. Experts everywhere agree that education alone will not move the needle the way that volume based pricing for trash does. One recent study analyzed 500 cities and found that volume based pricing adds, on average, 10 to 11 percentage points increase to overall waste diversion.'",
        "'speaker_1': 'In comparison, education programs alone only add 1 to 3 percentage points. The best way to boost diversion of raise is through policy change and education. Still, education is needed every step of the way to make policy changes effective.'",
        "'speaker_1': 'Based on decades of experience. We support voting and plans not either or continuously heard that Denver has done nothing for recycling education. That's simply not true. Eco cycle help do education and outreach for the city in 2017 and 2019.'",
        "'speaker_1': 'Canvased on recycling and compost. Teaching folks the how and why of zero waste. And let's not forget about the Denver's 2019 quarter million dollar grant in partnership with Coca-Cola and the recycling partnership and the statewide erase the waste effort.'",
        "'speaker_1': 'Despite these educational efforts, our residential waste diversion rate has only moved from 23 to 26% in the last three years. Also, if you haven't been on the Waste Extravaganza tour with the Cancer Office, I would highly recommend it to our landfill recycling center and a compost facility seeing operations in-person and hopefully this.'",
        "'speaker_1': 'Getting rid of some of the misinformation that you might be you might hear and you learn from experts along the way. Education never stops. Now, I've looked at diaries zero waste education and outreach plan. For implementing this policy initiatives.'",
        "'speaker_1': 'My colleagues, based on best practices, we believe that as a comprehensive as anyone could ask for. It's very robust and well thought out plan. Of course, the criticism that I've heard is that the plan wasn't delivered five years ago.'",
        "'speaker_1': 'Still, I've said this sentiment every time I've addressed you all. But again, while the best time to plant a tree was 30 years ago, the second best time is now. In fact, this policy, if this policy hopefully passes policy implementation is the ideal time to engage residents with education and outreach.'",
        "'speaker_1': 'We're looking for our biggest bang for your buck. On improving residential waste collection and expanded waste service. That policy has it all. It's a proven testing approach, approach that will increase our recycling composting rates and reduce our greenhouse gas emissions.'",
        "'speaker_1': 'Passing this policy tonight, we can move forward in becoming a more sustainable and equitable city. Please don't wait. Vote yes on expanded waste services. Thank you.'",
        "'speaker_0': 'Thinking. Changing, changing. Our next speaker is Sonya Hanson.'",
        "'speaker_4': 'Hello. My name is Sonia Hansen. I'm here to enthusiastically support a transition to expanded police services in Denver as I find myself in a transition. I'm a lifelong Coloradan and ten year resident of Council District ten, where I am part of the one third of Denver to subsidize waste services for those in single family homes and complexes'",
        "'speaker_4': 'of less than eight units. I am also a part of the population who benefits as a free rider from that subsidy. Since I recently purchased a house in District six, this proposed policy corrects the imbalance and establishes greater equity by allocating services to those who actually pay for them.'",
        "'speaker_4': 'Treating waste as a metered utility just like water, which has been metered in Denver since 1991. It's a basic conversation conservation principle that works. If we use less, we pay less. I'm actually so impassioned by this topic because I completed my master's thesis on improving waste diversion in Denver and have been advocating ever since for Denver to'",
        "'speaker_4': 'meet its waste diversion goals. I am also a public servant who works in recycling. Increased education was suggested as an alternative to policy change at last week's city council meeting. Instead, education is most effective when it complements robust policy.'",
        "'speaker_4': 'Education is indeed a powerful tool in reducing contamination and waste streams, but it does not increase recycling behaviors and thus waste diversion to the extent achieved by unit or volume based pricing. Also, copy as you throw. In fact, research indicates that 80% of the factors influencing pro-environmental behaviors do not stem from knowledge or awareness.'",
        "'speaker_4': 'That's starting to 28. Similarly in information, intensive campaigns are applicable only when a lack of supportive attitudes and a lack of knowledge are the barriers. And that is usually not the case that those are the only barriers. That's data from McKinsey More 2021.'",
        "'speaker_4': 'On the other hand, a variable fee system increased recycling by an average of 8 to 11%. It's the single most important factor in contributing to higher levels of recycling. That's data from Sue Moss, 1996. Pay, as you throw, has continued to deliver since the 1990s as the most viable, commonly accepted and proven policy tool for diverting valuable'",
        "'speaker_4': 'resources from the landfill. And it's been implemented by municipalities of all sizes around the world. The 2020 Climate Action Task Force, made up of diverse Denver stakeholders, made it their number one waste recommendation for good reason for council action.'",
        "'speaker_4': 'Frisco, Colorado, recently joined the 9000 plus municipalities already harnessing this policy, along with local leaders Durango and Loveland. Like Denver, Frisco faces real world civic challenges, inflation and affordable housing included. But seize the critical timing of doing the right thing for health equity for current and future Coloradans.'",
        "'speaker_4': 'Job growth in Colorado itself. Frisco's plan combines education with policy to reduce contamination and increase participation. Education alone won't move the needle. Thanks so much for your time and for your yes vote.'",
        "'speaker_0': 'Thank you. Kristina miller. Can you see me? Hi. Can you hear me? Is it working? We can hear you. Okay. Go ahead. Okay, great. Great. Thank you.'",
        "'speaker_4': 'My name is Dana.'",
        "'speaker_6': 'Miller, and I have been.'",
        "'speaker_4': 'Involved in the sustainability world around Denver for the last few years. I including co-founding Grow Local Colorado. And I also served on the Denver Sustainable Food Policy Council. I'm excited to be here to support this initiative and really can't find anything else to say other than the wonderful things that other people have said.'",
        "'speaker_4': 'So please vote yes and I'll feed my time to the next speaker. Thank you.'",
        "'speaker_0': 'Zan Fussell.'",
        "'speaker_1': 'My name is Van Fussell. I am the founder and director of Calm Post Colorado, and I also serve on the Denver Sustainability Advisory Council as well as the US and Colorado Composting Council and am testifying in support of expanded services.'",
        "'speaker_1': 'As many in the audience know, Colorado's waste diversion rates that's recycling compost are below the national average. In Denver, we only recycle encompass about a quarter of our waste, despite the fact that over 40% of this landfilled waste could be composted or upcycled into other bio resources at the landfill.'",
        "'speaker_1': 'These organic resources leach methane gas into our atmosphere, a potent greenhouse gas that's causing climate change. I started Compost Colorado in order to make composting more accessible to households and businesses across the metro area. And while I'm proud of these efforts of my team and the environmental activists here in organizations working to divert waste from the landfill'",
        "'speaker_1': ', I recognize that few things will impact our diversion rates more than the policy here today. This policy this policy will rapidly accelerate composting recycling rates in our community. For several years, this council has heard from countless tenacious environmental activists advocating for a more sustainable resource management policies such as Extended Waste Services.'",
        "'speaker_1': 'These experts, such as the Denver Sustainability Advisory Council, have scrupulously researched the best policies for our community to adopt. I'm very proud to work alongside these informed and passionate heroes fighting not just for a more sustainable Denver, but for a more sustainable world in a country where democratic institutions are withering away.'",
        "'speaker_1': 'I'm still hopeful and confident that at least at the community level, our community officials, you counsel listened to our community listen to these experts. It is because of these volunteers, these activists on green, these heroes that I'm confident that this body will listen and will pass expanded waste services.'",
        "'speaker_1': 'Thank you so much for your time. I greatly appreciate it.'",
        "'speaker_0': 'Our next speaker is Alex Truelove.'",
        "'speaker_3': 'City Council. Thanks for having me here so you can hear and see me. All right. My name is Alex Truelove. I'm a Denver resident and also the legislation and advocacy director for the Biodegradable Products Institute, which is North America's leading certifier of compostable materials, products and packaging that hundreds of member companies worldwide.'",
        "'speaker_3': 'As you might guess, I'm particularly interested in improving access to the collection and processing of compost because of how much potential it provides compared to how little we take advantage of it. So just to zoom out, the U.N. estimates that in food.'",
        "'speaker_1': 'Waste and loss for.'",
        "'speaker_3': 'A country, it would be the third largest emitter of.'",
        "'speaker_1': 'Greenhouse gas emissions after the US and China.'",
        "'speaker_3': 'Number three, it's that huge. And as others have alluded to, composting food.'",
        "'speaker_1': 'Waste avoids those methane emissions created by landfilling, which are unfortunately almost entirely that captured.'",
        "'speaker_3': 'Across the previous.'",
        "'speaker_1': 'Speaker. And on the back end.'",
        "'speaker_3': 'If regenerative agricultural practices like compost application cover cropping, no. Till we're used on crop and pastureland around the world, we would sequester more than our total global annual carbon dioxide emissions. True. In other.'",
        "'speaker_1': 'Words.'",
        "'speaker_3': 'This is an extremely low tax effective. And based on my years in environmental policy, I sincerely believe relatively cheap climate solution.'",
        "'speaker_1': 'Living a few years waiting. Like many of you I've seen through my work and privileged positions, cities and communities.'",
        "'speaker_3': 'Across the country embrace these value based systems that give.'",
        "'speaker_1': 'Residents greater access to resettlement and compost while also taking low income residents into account. And I've seen people adapt to those.'",
        "'speaker_3': 'Systems and I've seen the systems work. So I hope that this time Denver steps up to meet the challenge. Please vote.'",
        "'speaker_1': 'Yes. Thanks for my time.'",
        "'speaker_0': 'Thank you. We're going to go ahead and transition back in chambers. Our first speaker back in chambers is Sebastian and Andrews, followed by Courtney Zurcher.'",
        "'speaker_1': 'Hi there, Council. Long time no see. Good evening. The first time I spoke to you was on climate, and the last time I spoke to you was on climate. The last time I spoke to you was in favor of passing Proposition two on to the Denver 2020 November ballot.'",
        "'speaker_1': 'And that was made me a very proud Denver. All of you voted to pass climate action on the ballot in Denver, turned it around and by a 25 point margin said yes. In the time of pandemic and financial instability.'",
        "'speaker_1': 'We still want climate action, even at the expense of a few bucks per year. I was so proud of my city council and I was proud of you for another reason. I was proud of you because you all promised to adhere to the Climate Action Task Force recommendations in 2020.'",
        "'speaker_1': 'Now, I do not expect all of you to remember that report in its entirety, but I would I would expect you to remember that promise. I'll admit I had to reread the report myself, and I found that on page 97 it says The task force recommends that council adopt a volume based draft proposal by the first part'",
        "'speaker_1': 'of 2021. Suffice to say, this proposal today is already coming a year late than you passed. It does not make sense that Denver residents currently pay for best. A 2020 Princeton study found that municipal compost reduces waste emissions by roughly 50%.'",
        "'speaker_1': 'This doesn't even include the carbon dioxide that is captured by the plants and trees that will grow on increased Denver compost. I understand this proposal has equity concerns. Just like I understood them when I helped draft the Climate Action Task Force Recommendations report.'",
        "'speaker_1': 'But for years, Denver families living in larger buildings of eight or more units have had the burden of paying for commercial trash services on top of paying for the rest of Denver services. And nobody threw up their arms then.'",
        "'speaker_1': 'I would love to consider Denver a leader on climate. I would love to consider all of you climate leaders. I would love to consider all of you people who care deeply about the future that you leave for Denver's kids and your kids.'",
        "'speaker_1': 'I would love to consider you all people whose legacy is built on a better world and leaving an earth for our children. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Courtney Zurcher, followed by Elisabetta Stach. When you can correct me, when you come up and introduce yourself and then Brandi Moore. No, go ahead.'",
        "'speaker_4': 'Thank you. Hello, everyone. My name is Courtney Zurcher. I am a Denver resident and I am here today to speak in favor of the expanded waste services. Why is this important to me? Soil health matters. Diverting waste from landfills matters.'",
        "'speaker_4': 'Our community's voices matter. I am morally compelled to speak today about the disparity between the potential composable organic matter that should be collected in Denver versus the actual compostable organic matter that's collected and diverted from landfills. Today, soil health matters because it is linked to human health.'",
        "'speaker_4': 'Diverting waste from landfills is important because organic matter breaking down in landfills is not only an opportunity cost of building nutrient bioavailable bioavailability, but it is also important to water retention in our soil. And it also a lack of composting leads to an enormous amount of unnecessary greenhouse emissions.'",
        "'speaker_6': 'When these compostable organic materials.'",
        "'speaker_4': 'Go to landfill and I'm speaking specifically about methane here as a member of the community who is aware of our soil health crisis, I am here to remind us that the that composting is a simple and natural, multifaceted solution that we should be focusing on our way.'",
        "'speaker_4': 'Our waste diversion rate in Denver is dangerously low at 26%. It's lower than Austin, Texas. It's lower than Boulder, Colorado. It's lower than Salt Lake City, Seattle, Portland, Longmont and many other cities. The list goes on. Los Angeles, Gainesville, Portland.'",
        "'speaker_4': 'And this is counting. As I said, it's going on. So why do we why do these other cities have better waste diversion rates than Denver? A major reason is because the times of policy cities that I've mentioned are beating Denver, Colorado, to enacting policies for recycling and composting.'",
        "'speaker_4': 'When policy says to compost and to recycle, more composting and recycling happen. So again, I want to thank you for your time and this is very important. So cheers.'",
        "'speaker_0': 'Thank you. Our next speaker is Elisabetta. Justin. Yes. Go ahead, please. Hi. My name.'",
        "'speaker_6': 'Is Elizabeth at.'",
        "'speaker_0': 'The.'",
        "'speaker_4': 'Start. I am on the.'",
        "'speaker_6': 'Board of directors of the multifamily.'",
        "'speaker_0': 'Building where I live.'",
        "'speaker_6': 'We have 77 households in a building and on Capitol Hill. I'm here to urge you, of course, to pass the expanded.'",
        "'speaker_7': 'Waste Services bill under consideration.'",
        "'speaker_6': 'Today. As dwellers of a multifamily building, we have to pay extra for waste collection and recycling.'",
        "'speaker_0': 'While most.'",
        "'speaker_7': 'Households.'",
        "'speaker_6': 'In the city only have to pay.'",
        "'speaker_7': 'For their.'",
        "'speaker_4': 'Taxes, in addition to our taxes, our homeowners spend about $781 per month on trash and recycling, plus another $400 per month on composting. Together, we spend $14,000 on.'",
        "'speaker_7': 'Waste services.'",
        "'speaker_4': 'Last.'",
        "'speaker_6': 'Year alone in addition to our taxes.'",
        "'speaker_4': 'We don't we don't think paying.'",
        "'speaker_0': 'A fee for service is.'",
        "'speaker_4': 'Is wrong. In fact, we are all for it.'",
        "'speaker_0': 'But we think it should be applied equitably and equally.'",
        "'speaker_6': 'Across the city. But the current system is completely upside down in Denver.'",
        "'speaker_4': 'Because it is exactly the smallest households in the most efficient housing.'",
        "'speaker_6': 'Types stacked multifamily buildings that subsidize the services for single family.'",
        "'speaker_4': 'Homes. To add insult to injury, many who live in multi-family units are often exactly the people who can't afford the least to subsidize single family more affluent homes. Also, we should be incentivizing.'",
        "'speaker_0': 'Efficient, high density.'",
        "'speaker_6': 'Living, not penalizing it.'",
        "'speaker_4': 'As this current system does. One trash.'",
        "'speaker_6': 'Truck makes a.'",
        "'speaker_4': 'Stop at our building and collects waste from 77 households. A second trash truck or recycling truck collects the recycling for the same 77 units.'",
        "'speaker_6': 'That's two stops by a trash truck.'",
        "'speaker_4': 'These are if these households in our building were instead in single family detached homes, the collection would require 77 truck stops.'",
        "'speaker_7': 'For waste and.'",
        "'speaker_4': '77 truck stops for recycling. Not. That's a total of 140 154 stops. Instead of the two stops that is needed to service our building and I. And don't forget that each individual house would need its own recycling and trash containers that needs.'",
        "'speaker_6': 'To be provided.'",
        "'speaker_4': 'So this all means that more time, more staff, more fuel, more trucks, more resources need to are needed.'",
        "'speaker_6': 'To service single family homes then multi-family homes.'",
        "'speaker_0': 'Yet we are subsidizing single family homes.'",
        "'speaker_4': 'I mean, this is.'",
        "'speaker_6': 'Completely upside down.'",
        "'speaker_0': 'So thank you. That's the time. We have a lot of have our notes. I think you've got the most.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Randy Moe.'",
        "'speaker_6': 'President Gilmore, council members.'",
        "'speaker_4': 'Thanks for. Me be here. My name is Brandy Mo, and I live in the Ruby Hill neighborhood in Denver. I spent the first.'",
        "'speaker_6': 'Half of my adult life working as a social.'",
        "'speaker_4': 'Worker, and now I work in the recycling industry, and I've learned a few things during my career.'",
        "'speaker_6': 'One human.'",
        "'speaker_4': 'Behavior.'",
        "'speaker_6': 'Is immensely difficult to change and to Denver's recycling and composting rate is kind of embarrassingly low. You might be thinking, well, she's biased.'",
        "'speaker_4': 'She she works in the recycling industry. And sure, I might be a little bit biased.'",
        "'speaker_6': 'But I can tell you that most.'",
        "'speaker_4': 'People are absolutely floored when they hear that.'",
        "'speaker_6': 'Denver's recycling rate is just 26%.'",
        "'speaker_4': 'And we can do better like we really can. We just need to make.'",
        "'speaker_6': 'Decisions that foster positive change. Recycling experts.'",
        "'speaker_4': 'Agree that the best way to boost waste diversion is through policy.'",
        "'speaker_7': 'Change and.'",
        "'speaker_4': 'Education. Your vote this evening can support positive change in our city. As I mentioned, human behavior is immensely difficult to change. Shifting to a volume based pricing model will be.'",
        "'speaker_6': 'Tough in the beginning.'",
        "'speaker_4': 'Change can be and usually is tough.'",
        "'speaker_6': 'But it's going to be worth it.'",
        "'speaker_4': 'When our neighborhood was eligible to receive the green compost cards, I was so excited. It took a while to reconfigure our waste system in our house, but after we did, we were amazed at how much of our trash could be composted.'",
        "'speaker_4': 'Eventually, we reduced our black trash cart to.'",
        "'speaker_6': 'The cute 35.'",
        "'speaker_4': 'Gallon container, and at this point, we fill up the smallest trash cart.'",
        "'speaker_6': 'Once, about every month we are able to recycle and compost so much.'",
        "'speaker_4': 'Of our waste. Please consider voting yes this evening.'",
        "'speaker_6': 'Change can and usually is tough. We know this. But this change is worth it.'",
        "'speaker_4': 'Let's make Denver a leader in waste diversion. Denver deserves it. Thanks so much.'",
        "'speaker_0': 'Thank you. And that concludes the time for our one hour courtesy public hearing. We're going to go ahead and then move into questions from members of Council on Council Bill 22, Dash 685. And so I would ask council members, if you have questions to pose to the Dottie team members who presented.'",
        "'speaker_0': 'We'll go ahead and get you transitioned into the Q. Give us a second here. Councilmember Ortega. Thank you, Madam President. I have a few questions that I want to ask of our team. So let me just start with the first one.'",
        "'speaker_0': 'So on slide 19, it talks about the diversion rate, and I'd just like to know what year it was that we actually got rid of all the dumpsters and went to the single where we moved into the roll out barrels because we used to have a lot of people that would come.'",
        "'speaker_0': 'Most of them were on the edges of our city, and people would dump into our dumpsters that either had to pay in neighboring counties, or a lot of times it was contractors that knew where the dumpsters were. And they would basically, instead of having to go out to a landfill to dispose of their waste, they would drop'",
        "'speaker_0': 'it in our dumpsters. So that slide did not reflect any of the diversion that we saw happen as a result of moving to the dumpsters. So I'm just trying to figure out what year did that happen? Because I would like to see that included in the slide because it it's like a missing piece that made a huge'",
        "'speaker_0': 'difference in terms of a lot of the waste that ended up in our landfill from what our trash trucks had to pick up.'",
        "'speaker_6': 'Can I get that number back to you? Unless someone else from Daddy knows that answer. I'll get it back to you.'",
        "'speaker_0': 'I know it was after 2011, but I don't remember which year it was. And Jessica, could you introduce yourself with the apologies?'",
        "'speaker_6': 'Jessica Lally, daddy's project manager. I will get that answer to you. Okay.'",
        "'speaker_0': 'Let me just move on then and whenever you can get that, that would be much appreciated. Do you have that at that council?'",
        "'speaker_1': 'Adam Phipps We've got it. I believe it was in 2015, but we're working to confirm that right now. Okay.'",
        "'speaker_0': 'Thank you. I would just suggest updating that information because I think that's really important piece that was left out of that slide. Let me move on to my next one. I'm just curious to know what changes have been made to the billing system.'",
        "'speaker_0': 'I've actually had some people call my office that have had problems with the billing system online. They went to 311 and wanted to make their payment through 311 and they were told that 311 can't take payments. So I don't know, like if if changes have been made and if they have, what are those changes?'",
        "'speaker_0': 'So that if we're rolling this program out, we're not continuing to have some of those issues and challenges with people who will be expected to pay online. And then we have some people I walk every morning with a friend of mine who after she retired, she just said, I don't want to have anything to do with computers'",
        "'speaker_0': 'anymore. She has a flip phone so he doesn't not have connectivity to be able to pay a bill online. So what are we doing for customers like her? So I'm not sure who wants to answer that one, but.'",
        "'speaker_0': 'And I think this may apply to a lot of our folks in our community who are not connected either by choice or sometimes it's cost.'",
        "'speaker_1': 'So councilwoman and VIPs with. We certainly encourage the people of Denver to do online payments and leverage that technology if they can. It saves us both money from a mailing standpoint, but also the environmental impact here. Regardless of that, any payment that's needed for any service rendered by body is collectible.'",
        "'speaker_1': 'In in a person transaction at our wastewater facility or in our web facility will ensure that this is an allowable use of that service as well.'",
        "'speaker_0': 'So not everybody has that mobility. And I know wastewater is not easy to access, so I appreciate that in-person is another option. I think that's good. But for people who may be mobility challenged, is there a different way I can imagine?'",
        "'speaker_0': 'You know, a lot of our seniors who are choosing to age in place may have that challenge as well.'",
        "'speaker_1': 'Yet we can certainly accept him by track as well. So if there is a mobility impairment, that options is available as well.'",
        "'speaker_0': 'Okay. I have a few of these. Madam President, if I can just keep going. And then when you feel like you've got people lined up waiting, I'll get put in the back of the queue. All right. So question about the company that currently handles the composting for Denver.'",
        "'speaker_0': 'Are we going to continue to work with that company for where the waste goes to? And was was this rebid or will it be rebid? Because we I don't want to just pursue presume that it's a sole source contract without our normal RFP process that we normally do.'",
        "'speaker_0': 'And given that this is anticipated to be a new program. I'm just curious how all of that is being expected to be handled.'",
        "'speaker_1': 'Yeah, let me defer to my operational team on that one.'",
        "'speaker_3': 'Art Media Director of Solid Waste Management. The current company we use is called A-1 Organics. We do have a contract in place with them. We have made contact and are working on the additional material that it's going to be delivered to them if this ordinance passes.'",
        "'speaker_3': 'So we are planning to have that company continue to serve as our compost material.'",
        "'speaker_0': 'So did we do an RFP or will we do a new or a PAM, assuming they're not the only company in the city or the metro area? Because it's my understanding they're not in Denver. Is that correct?'",
        "'speaker_3': 'They are not. The contract was already in place. If I'm not mistaken, the contract stipulates stipulate that they will handle all of our compost material from the city, whether as 30,000 customers or 180,000.'",
        "'speaker_0': 'And how long have they had the contract with the city? Oh, started composting. And what year?'",
        "'speaker_3': 'I don't have that information. I can certainly get it and get back to you today.'",
        "'speaker_0': 'I'm asking this because I know that we routinely put our contracts out to bid and just to assume we're rolling into a new one. I'm not saying anything about the quality of work they've done, but I'm just challenging the practice of what we normally do and whether we're doing that with this one council.'",
        "'speaker_1': 'One thing I can certainly confirm there is that there are procurement requirements within the city in County Denver that would prohibit us from a sole source contract, unless that was the only vendor that was able to provide that service.'",
        "'speaker_1': 'And we well documented that. So as we look at ensuring that we're getting adequate value for any of our contracts, we'll certainly be in compliance with that program. And that would apply for this service as much as it would anything else.'",
        "'speaker_0': 'Yeah. And I guess if there are others in the metro area that are closer than Kingsburg, you know, it may be who, especially when we're talking about transport, distancing and emissions and where we know that greenhouse gas emissions come more so from vehicles than they do our waste stream.'",
        "'speaker_0': 'So that becomes an important part of this conversation. So thank you for answering that question. Let me go on. I have a couple more. And then, Madam President, after I ask this next to, I'm happy to be put to the back of the line.'",
        "'speaker_0': 'So in the slide that it talked about weekly inspections for illegal dumping. We didn't do this when people were illegally dumping in our dumpsters. And we're basically seeing lots, a lot more waste that was being put in our dumpsters, that was being taken out to our landfill.'",
        "'speaker_0': 'Where were the staff come from that will do that because we're challenged today to have enough drivers and we still need 22 more to ramp up this program. Where will those workers come from that will do that?'",
        "'speaker_1': 'Certainly, Councilwoman. And to further clarify the previous comment you made in regard to dumpsters. We didn't confirm with the team it was a phased out process where we eliminated dumpsters starting in 2015 and concluding in 2017 for this enforcement aspect.'",
        "'speaker_1': 'And this will be performed by inspectors that will be included in the hiring process as we step up for the implementation of value based pricing. And so those inspectors will be expanded within the service.'",
        "'speaker_0': 'So that that cost is built into the fee schedule?'",
        "'speaker_1': 'That is correct.'",
        "'speaker_0': 'So how many inspectors then? Well, we have total.'",
        "'speaker_3': 'We'll have.'",
        "'speaker_1': 'One inspector at a minimum in each district. I believe it will put us at a total of six inspectors when we're fully staffed.'",
        "'speaker_0': 'Okay. And what role will complaints play in the process? I mean, a lot of times neighbors don't like their neighbors. We've had incidents where, you know, dog complaints, trash complaints could I think in Councilman Gilbert's district, where she recently passed a new piece of legislation to deal with complaints about trash and how that was, you know, adding'",
        "'speaker_0': 'to people getting put on foreclosure lists and things like that. So just curious about how that how complaints play into that.'",
        "'speaker_1': 'Good. Good question, Councilwoman. Each complaint that we receive through our customer service will be investigated by one of these inspectors. That inspector will first start with a robust educational campaign to make sure that the resident understands what is allowed or what isn't allowed.'",
        "'speaker_1': 'And then we'll follow up with enforcement down the line if we can achieve compliance with education.'",
        "'speaker_0': 'And I know we have some people who don't have room in their yards and their trash bins sit in the alley. I know that's the case for one of my trash bins. And I often have people who are dumping their waste, their their animal waste in my trash bin.'",
        "'speaker_0': 'And, you know, how do you factor in something like that if it's dumped into a recycling bin or, you know, something like that, where the inspection the inspector may be getting complaints or they may see that happening. And so all of this then will lead to how does that play into penalties?'",
        "'speaker_0': 'And then came the penalties lead to a lead on a property.'",
        "'speaker_1': 'Yeah. So a series of the questions are so similar to the previous answer. I'll start with education. Right. And so when we make contact with that resident, whether there's a report of a lack of compliance with what's allowed or not, or we notice that on our routes when we speak with them, we'll try to understand what the'",
        "'speaker_1': 'limitation is, what the barriers, the lack of understanding, or is it maybe a fellow resident that is dumping illegally into their bins? If that's the case, we certainly would not pursue any type of fine or fee associated with that and certainly would never take that to the point that we're looking at only needing a piece of property'",
        "'speaker_1': 'because a neighbor is inappropriately using another trash can.'",
        "'speaker_0': 'Okay. So then assuming it is somebody that is just hasn't quite got it in terms of what race goes into which bin, what is the penalty for. After the education is done, the inspectors had to go out to that home maybe more than once.'",
        "'speaker_0': 'What is the cost of that? Fine.'",
        "'speaker_1': 'I'll emphasize this one more time, that compliance is our goal, and we really do want to achieve that through education. If that's not the case, the rules and regs will determine what the fine is associated with a first time offense, which will likely be somewhere in the neighborhood of about $40.'",
        "'speaker_0': 'That's for a first offense. And if they're a repeat offender, is there a max that it could go up to?'",
        "'speaker_1': 'The rules of regs are not finalized at this time. Again, we're not looking to financially penalize somebody that's attempting to be compliant. And so we'll try to close compliance as low as possible to achieve that compliant.'",
        "'speaker_0': 'Okay. And if you have somebody that just. Those are like this program. They're not going to do it. They're going to put their trash wherever they put it and they start getting fined. Is there a max and can that fine then lead to a lead on the property?'",
        "'speaker_1': 'Just kidding. I do not believe so.'",
        "'speaker_0': 'Okay, so. So we're just talking about the fees then that lead to the lane, not the fines.'",
        "'speaker_6': 'Correct. The fines for contamination have nothing to do with the lane process. Okay.'",
        "'speaker_0': 'Just want to clarify that.'",
        "'speaker_6': 'We would take away their recycling and compost carts if they are not using them. Okay.'",
        "'speaker_0': 'Great. Thank you. I'll get that put to the back of the line and do have a few more. Thank you. Thank you. Councilmember Ortega. Councilmember Hines.'",
        "'speaker_3': 'Thank you, Council President. I just have one question that I don't believe was in the slide, but certainly a lot of people ask, why isn't this covering 100% of households?'",
        "'speaker_1': 'So, Councilman, in regards to why does this not apply to residences that are that house more than eight families? Is that the question?'",
        "'speaker_3': 'Yes, sir.'",
        "'speaker_1': 'So we're working within the establishment of solid waste ordinances as as it exists today. Those are not where we're able or seeing the greatest opportunity to affect change of those commercial properties or those mobile resident properties or have recycling have in most in many cases, composting available today.'",
        "'speaker_1': 'And our goal here is to simply provide that on the residential level, that gets us to a diversion rate that's more comparable or even better than than our system comparisons.'",
        "'speaker_3': 'Uh, so it's not because of a state law that precludes us from competing with private trash vendors. That's what I was hoping you wouldn't say so. I'm confused.'",
        "'speaker_1': 'But yes, we as a municipality cannot compete with commercial vendors. State statute as your reference. Thank you for that recollection, Councilman.'",
        "'speaker_3': 'I apologize, Director, that I was asking you a question I knew the answer to. But but I wanted to for you to say it. So perhaps someone who's more familiar with the state law can go into little more detail on what the what the preclusion is.'",
        "'speaker_3': 'Why why we're tackling seven and fewer units. And I am and I'm not asking for speculation, but may be why is the state law that way? That seems really weird to me and to a lot of other people.'",
        "'speaker_3': 'So. So if if there's a way to describe it without just, you know, speculating, I'd be curious to know what the answer is.'",
        "'speaker_1': 'Yes, certainly, councilman, I am not an expert in that state statute. I'm not sure that we have anyone here who represents that perspective. I don't believe 711.'",
        "'speaker_3': 'Guys doing their job is going to go the Oracle.'",
        "'speaker_6': 'Service guys do or mayor's office. So you've correctly described it. The state statute precludes us from serving personal multifamily properties over a certain number. Again, without speculating, that was certainly something that was lobbied for to keep the private sector from having to compete with the public sector for moving forward on our services.'",
        "'speaker_3': 'Okay. Yeah. I mean, I think that's compelling because otherwise why while I commend the director for his answer, I think that state statute is is a you know, unfortunately, we have to live with the the laws of the state and federal level.'",
        "'speaker_3': 'And but why? There's a citizen initiative also that's considering tackling the rest. How can the citizen initiative override the state law? And we can't.'",
        "'speaker_4': 'So the state law prohibits us from providing those services to commercial and multifamily properties.'",
        "'speaker_6': 'It doesn't preclude us from legislating requirements for how that services provided, which is what there was no more ballot measure would propose to do.'",
        "'speaker_3': 'Okay. Thank you. Thank you. Council president.'",
        "'speaker_0': 'All right. Thank you, Skye. And thank you, Councilmember Hines. Councilmember Flynn.'",
        "'speaker_5': 'Thank you, Madam President. Councilman Hines, I was going to address that very point that for the folks who were talking about the fact that large multi-family and commercial subsidizes single family and small residential, that is the that is right at the feet of the state legislature decades ago to carve out the that market for the private hauling'",
        "'speaker_5': 'industry. They prohibit the city from serving the folks who live in high rises or large apartment complexes so that the private hauling industry has a part of the market just for themselves. So if it's not that we don't want to serve you, it's that we can't.'",
        "'speaker_5': 'I would like to ask you a question, and I don't know who would answer it. Maybe Margaret or Jessica, or if there's somebody from Human Services here. But with regard to the rebate program, I've had several constituents really reach out to me and ask, will the Denver renters and homeowners who receive the Denver based senior and disabled'",
        "'speaker_5': 'property tax refund that's at the city level separate from the senior homestead exemption that applies to anyone, regardless of income. Will those people be included automatically in the rebate program? Because otherwise I was asked to please maybe introduce and promote an amendment that would make that very clear.'",
        "'speaker_5': 'I know that that program is run I believe it's run by Department of Human Services. So it ought to be on their radar. And folks who are in that program ought to be automatically in it. Are they?'",
        "'speaker_6': 'So thank you. Council member Jeff Galloway, that is project manager. So unfortunately, Denver Human Services isn't here with us today, but I can answer that question they will be offering to everyone who applies for the property tax relief program this year that they are eligible for our instant rebate program and offering to automatically enroll them in our'",
        "'speaker_6': 'program as they've already provided everything we need from them for the property tax program. So we are definitely doing that with across all local DHS programs.'",
        "'speaker_5': 'Thank you. And I was told I think Jason Gallardo touched to me before the meeting because I had asked that question earlier today that there are actually very few households that are in that program. We ought to maybe want more widely advertised that program, probably fewer people doing that than doing composting right now, and they deserve this'",
        "'speaker_5': 'break. I think my next question might be for you also. You spoke during Jessica. You spoke during the presentation about construction and demolition. Let me find a slide, 37% diversion from commercial. And here it is. Commercial wage, 20, 20, 37% diversion, not including construction and demolition recycling.'",
        "'speaker_5': 'So can you be a little more specific? We have three categories that we've measured at the landfill. I believe we have Denver's program. Which is about I think we said 18% of what goes to the landfill comes from our program.'",
        "'speaker_5': 'It was 30 about 32% of what goes to landfill comes from, you know, waste management and and Republique or whatever the name of that is now, the private haulers. That's about 32% of what is dumped. And then construction and demolition makes up about 50% of what is dumped at the landfill.'",
        "'speaker_5': 'So when you said the 37% diversion of commercial waste, you're only referring. This is going to sound weird to the 37% of the 32% of the total dumping at the landfill.'",
        "'speaker_6': 'Referring to apartment complexes greater than the units and businesses that we don't service.'",
        "'speaker_5': 'Okay. So what is the what do we know? Is the diversion or do we know the diversion by a construction and demolition sectors? I say that because I know that Portland has a very high rate of diversion, and it may be, in fact, due largely to the fact that they mandate a diversion from demolition of buildings that'",
        "'speaker_5': 'they can't all go to. The landfill has to be recycled, reused, etc..'",
        "'speaker_6': 'I don't have the breakdown by material right now.'",
        "'speaker_3': 'Okay.'",
        "'speaker_6': 'I.'",
        "'speaker_5': 'All right. That would have been president.'",
        "'speaker_7': 'I have that available to answer. Councilman Flynn.'",
        "'speaker_0': 'Okay. Go ahead, Councilmember.'",
        "'speaker_7': 'The Solid Waste Master Plan has a sustainable resource management plan update that came out just a couple of months ago. And table one of that plan indicates that our diversion from construction and demolition debris is 36%. So it is very similar percent to the commercial commercial 37 as the slide indicates.'",
        "'speaker_7': 'And the number for construction and demolition is 36% diversion, 10% higher than our residential rate.'",
        "'speaker_5': 'Okay. But of course, the volume is 50% that goes to the landfill in the first place. So 46% of what goes to the landfill, another 36% is diverted somehow.'",
        "'speaker_7': 'Okay. Actually, construction and demolition is 36%. I'm sorry, it's not 50%. Construction demolition is 36% of the landfill and 36% is it diverted. So about a third of a third.'",
        "'speaker_5': 'Okay. We were told earlier the construction demolition was 50% and large multifamily and commercial waste was 32 and residential was 18.'",
        "'speaker_7': 'Grace Rink maybe the best person to call up to clarify. I will just say this resource plan update just came out a couple of months ago. We began these briefings before this plan came out. So it may very well be that the data was updated as the new version came out.'",
        "'speaker_7': 'I thank you. Councilmembers Grace Rink, Executive Director of the Office of Climate Action, Sustainability Resiliency. And my apologies, Councilman. I don't recall ever saying 50% or hearing of it because.'",
        "'speaker_4': 'It's the as councilwoman.'",
        "'speaker_7': 'Can you just said in our most recent report, construction and demolition debris is 36% of the city's total waste. And and oddly, 36% of that is diverted. Okay. Not 50%.'",
        "'speaker_5': 'All right. Thank you. That's all I have right now.'",
        "'speaker_0': 'Okay. Thank you. Grace and Councilmember Canete and Councilmember Flynn. Next up, we've got Councilmember Herndon.'",
        "'speaker_3': 'Thinking I'm present. My questions are for Dottie. I just want to go a little bit into the diversion number that people seem to keep bringing up the 26%. How often is that number recalculated? Is it an annual number like Denver's conversion rate is 26.'",
        "'speaker_3': 'We calculate this annually should this program pass. How? With the frequency of updating that number. I'll start with that.'",
        "'speaker_6': 'Thanks to school Ali. Program manager. Project manager. It is annually. Continued to be annually.'",
        "'speaker_3': 'So you said earlier going back it will come down next. So what is the expectation or goal should this path.'",
        "'speaker_6': 'To exceed the national average. But we know that by expanding comp of service to the rest of the city, with at least 70% of them composting, the projections put us at about 40% diversion.'",
        "'speaker_3': 'So over what period of time?'",
        "'speaker_6': '2424. I believe that I can send you that projection.'",
        "'speaker_3': 'So our expectation is in one year of this program, we will go from 26 to 40%. Diversion, right?'",
        "'speaker_6': 'I can send.'",
        "'speaker_7': 'You the.'",
        "'speaker_6': 'Details on the data and how our projected tonnage increase would increase our diversion rate that high. With 70% of the city participating in compost at least.'",
        "'speaker_3': 'So what if we don't hit that number?'",
        "'speaker_6': 'Great question. It's not our intent. If we don't.'",
        "'speaker_1': 'Do so, Adam flips with. So, Councilman, if we don't achieve that objective, which is 2024, given that we have pushed back the rollout here by about three months, we'll have to look at an exact date and we can follow up with that.'",
        "'speaker_1': 'If we don't achieve it, education is the key with any new program, any new policy we recognize will be a learning curve there. But we also recognize that we need to push ourselves, we need to push the community.'",
        "'speaker_1': 'And so if we don't get there within our timeline, we'll continue to educate and reevaluate our educational tactics to ensure that we're reaching all aspects of the community. We'll look if we see neighborhood discrepancies so that we can ensure that we tailor our outreach specifically to that individual community so that we can ultimately get to that goal'",
        "'speaker_1': 'if we don't achieve it right off the bat.'",
        "'speaker_3': 'And I ask that question because is this something that's going to continue in perpetuity? The yeah, the feat. Because if our goal is to increase and we're not at the rate that we want, we still continue to charge for trash.'",
        "'speaker_1': 'So it's a good question, Councilman. So let me answer the first part of that. So we do have budgeted within the annual financial plan with the Special Revenue Fund an educational component. So we certainly would anticipate a robust educational program continuously throughout from from here on, we recognize that there will be new constituencies, new folks in Denver'",
        "'speaker_1': ', folks that are that are growing, that are aging, that might need different assistance, whatever help we want, ensure that engagement is there. And so we certainly believe through previous evaluations of pay as you throw or volume based pricing trash programs that with a proper amount of education, you can have substantive change and meet those objectives.'",
        "'speaker_3': 'Okay. So when during the presentation it was mentioned we had been in the twenties for years up until this point. What have we done as a city to raise that number? I, I hear I heard education. So help me understand prior to this proposal what Denver has done.'",
        "'speaker_1': 'Yeah, let me let me make one point and then handed over to Ms.. Rink here. I can tell you what we have done is we've disincentivized, we charge for composting right now. In fact, if you choose the lower sized carts moving forward with this volume based pricing, you pay less than if you're a customer today.'",
        "'speaker_1': 'And so we disincentivized to include composting. If you recall the graphic from the presentation, approximately 50% of Denver's revenues on a weekly basis is composed of oil. And so we've disincentivized it. And so what we're hoping to achieve here is not only a continuation and expansion of education that we've done to date, but also providing those alternative'",
        "'speaker_1': 'options and recognizing that there's an impact based on the amount of trash that each family produces. But, Councilman, if it's agreeable to you, I'd like to turn it over to Mr..'",
        "'speaker_3': 'And before Grace comes up to talk about the education piece. I absolutely agree with you, Adam. We have disincentivise it, so why don't we simply just stop charging for compost?'",
        "'speaker_1': 'Well, we also. So that would remove the disincentivise. And yet we now also want to go further and incentivize. So if you reduce the amount of waste that you send to the landfill that's cost, the service is going to be the lowest.'",
        "'speaker_1': 'If you do not make a substantive change there, you chose the largest cost you. The family will see that largest cost as part of the program. So, again, we're not only trying to remove the barrier of just incentivizing it with a paid compost program, we also want to make sure that folks understand that there is value to'",
        "'speaker_1': 'reducing the amount of refuge that they create.'",
        "'speaker_3': 'Why do we charge for composting in the first place? This may not you may I know your found out. You may not know the answer to that. When we first brought composting to the city wide charge, if we knew that was going to disinvite some folks.'",
        "'speaker_1': 'You know, Councilman, I do not know the answer to that. I can speculate that, but I'm not sure.'",
        "'speaker_3': 'Fair. Thank you. Great.'",
        "'speaker_7': 'Hello? Excuse me. I just wanted to add a couple pieces of information. So, first, in the year 2000, Denver's recycling rate was below 10%. So it has increased 1 to 2% every year for 20 years. So it has been increasing.'",
        "'speaker_7': 'We would just like to increase it faster. And I would like to think that, or at least the way I look at the numbers, I think that the education program to date for both recycling and composting has had an effect.'",
        "'speaker_7': 'I would argue it has flatlined. And so this is a change that we need to bring to the program to in order to really drive change. So right now, we have actually succeeded in collecting about 60% of the recyclable materials in our homes today.'",
        "'speaker_7': 'So the recycling education is getting to people. They're hearing it. I suspect that perhaps because they don't have weekly recycling, many people are having to put some of their recyclable material into their weekly trash in order to get it out of their house or they're holding onto it for the extra trash pickup.'",
        "'speaker_7': 'Now, with composting, we have succeeded in recruiting or are transforming 15% of our customers into paying customers who are willing to pay into the composting program, even though they could otherwise have that taken away for free in their black garbage can.'",
        "'speaker_7': 'So I think that education has worked. We just aren't seeing enough of a change. And I agree with Adam when he says that in addition to providing the tools that the people need, the infrastructure to put our education into action.'",
        "'speaker_7': 'Right, they need that compost cart. And then what goes along with that? The complementary piece is the incent, the financial incentive to then downsize their trash part to this size that really works for their household and only pay that amount in order to have that trash taken away.'",
        "'speaker_3': 'So here's what I'm not hearing. I keep hearing we have educated, but what have we done? Like I hear education specifically. The city has invested x millions of dollars to flier x number of neighborhoods. And from that, from September to December, we did see an increase.'",
        "'speaker_3': 'We did not. This is how we adjusted an impact of that. I have not heard how we have impacted it from that.'",
        "'speaker_7': 'I hear what you're saying.'",
        "'speaker_3': 'That's what I'm trying to get.'",
        "'speaker_7': 'I hear what you're saying. And I think that because I am not a marketing professional and I don't know that any of us are. I don't know that I can draw that direct line to say, because we fly to this neighborhood or because we ran this program, we saw an X percent uptick in recycling or composting.'",
        "'speaker_7': 'I just as a I don't want to fall back on the fact that we're government agencies, but we are a government agency. We we educate, we make people aware. But we don't have that data that I think you're looking for, which shows that direct correlation.'",
        "'speaker_3': 'Thank you, Grace. And and thank you, Madam Chair. Madam President. And that is my problem, because we have not. Sorry. That was a comment. Thank you. I'm good.'",
        "'speaker_0': 'Thank you, Councilmember Herndon. And thank you for the staff members who answered. We'll get to the comment section here pretty soon. Councilmember Ortega, I've got you back in the queue, but I haven't heard from our other. Okay, great.'",
        "'speaker_0': 'Thank you. Councilmember Kinney, please go ahead with your questions.'",
        "'speaker_7': 'Thank you. Council president. We had a couple speakers, Lawrence, and I am just looking for the other named Clare Harris, Lawrence Murray and Clara Harris. And I think it's always important to hear the feedback from those with concerns about the program.'",
        "'speaker_7': 'And they both asked us could we be requiring more of commercial folks and of people who build buildings? And I think that's a really important question. Before we ask something of our residents, what are we asking of our businesses and builders?'",
        "'speaker_7': 'And so, Grace, I was going to ask if you could please address this idea that, you know, the concern was why aren't we requiring solar panels? Why aren't we requiring more of builders? And so could you please talk about what we are doing in that regard?'",
        "'speaker_7': 'Because I think it's really important for folks to know this is not the only requirement we're talking about. We have others. So can you just describe a few of those requirements for those speakers who wanted to hear more about that?'",
        "'speaker_7': 'Certainly, you're right. This is definitely not the only policy that we're pursuing. And so I'll speak to two. First, you've just asked about in our Speaker House about really new construction requirements. And we will we are hoping to come back to council later this year with our first introduction of solar ready electrification ready requirements for new construction'",
        "'speaker_7': 'in the code. So this is something that this. It has been working on for a couple of years. It takes some time to get into the building code, but we were there last year. In November, the council already passed the energize Denver building performance policy, which will require all of our large commercial buildings 25,000 square feet and'",
        "'speaker_7': 'larger, as well as some other requirements for smaller commercial buildings to get as close to net zero as possible by 2040 with significant reductions required by 2030. So we are we're absolutely working on I want to add my Midwestern roots.'",
        "'speaker_7': 'I say soup to nuts. We're trying to do all of it.'",
        "'speaker_6': 'I'm trying to do all the different things.'",
        "'speaker_7': 'And managing emissions from waste is certainly one of them. But so, so is managing emissions from buildings and homes as well as for transportation. And then can you just mention one other ordinance, the Green Roofs Initiative and what that requires, please?'",
        "'speaker_7': 'Sure. The green roof the green roof ballot initiative back in 2016 was transitioned or evolved into the green building ordinance, which now requires that all new construction buildings have to meet certain energy requirements or put vegetated roof on their building or I'm sorry, onsite solar, but it also requires the same of any existing building that is replacing'",
        "'speaker_7': 'the roof. And so that I'm able to tell you that 95% of the buildings that are going through that requirement have chosen the energy efficiency option. And so they're all working on reducing the energy usage in their buildings because of that ordinance.'",
        "'speaker_7': 'So between the green building ordinance, the energize Denver for large buildings and then the upcoming building code, is there any piece of our built environment that won't have some sustainability requirement once we finish that building code update? I mean, there are get no so there are within energize Denver.'",
        "'speaker_7': 'There are some requirements that we're still working on for special types of buildings like manufacturing and agricultural buildings. But yes, the built environment, we are covering it with policies between all three of those. Some everybody's covered by something.'",
        "'speaker_7': 'Yes. Okay. Thank you for that. And then really quickly, there were several questions from councilmembers about diversion rates. And this particular slide deck tonight did not have the historical line graph with the diversion rates in it, but I have emailed that to all councilmembers in response to those questions because I had it handy and you were asking'",
        "'speaker_7': 'about it. So for council members, that is in your email box, that slide that shows the historic diversion rate. So if there are follow up questions for the staff, it is now in front of us. So just wanted to to answer that.'",
        "'speaker_7': 'And with that I will pass it back to I don't know if our vice chair is taking over, but it looks like Councilman Ortega is next in the queue or.'",
        "'speaker_1': 'Oh.'",
        "'speaker_7': 'Councilman Clark has the has the mic.'",
        "'speaker_3': 'Thank you. Thank you, Councilmember. I think we have customer receipt, tobacco got ends and so Councilmember Ortega already had a chance. If we can go to Councilmember Silver.'",
        "'speaker_4': 'My line of questioning was the same as Councilman Herndon. So those questions get answered. Thank you.'",
        "'speaker_3': 'Take care of your backup.'",
        "'speaker_0': 'So let's see. Grace or. So I'm not sure who needs to answer this. But let me just go back to the billing question for a minute. So we're talking about collections of $33.5 million, basically with this new program.'",
        "'speaker_0': 'Right. So today's trash service is $27 million roughly? I don't remember that. I heard Councilman Herndon ask this question, but what would it cost just to add composting if we paid for that for all of the households? Same as we do with the rest of our services.'",
        "'speaker_0': 'And I'm assuming you all would still look at weekly service for all three bins.'",
        "'speaker_1': 'So, Councilwoman, the change in cost between what you see between the general fund appropriation today and the $33 million number you just referenced is representative of both the weekly recycling as well as citywide composting. I don't have the numbers available to me that delineate the costs between those two programs.'",
        "'speaker_1': 'Looking to my staff to see if they may, I believe we do have it. So give us just one moment, Councilman.'",
        "'speaker_0': 'So. Well, while you're doing that, let me just ask. So I guess sort of getting back to the question that Councilman Herndon raised, I, I couldn't understand why, number one, we didn't start with education and then roll that out similar to the way we did with the recycling.'",
        "'speaker_0': 'And as you heard, we've continued to get more and more people to participate in the recycling. So I'm so that's why I'm asking the question, how much would it cost just to do that? Because essentially what we're doing is saying, well, we're going to collect a new $33 million, 33.5 roughly today.'",
        "'speaker_0': 'It costs us 27 million. But that 27 isn't like automatically being folded into this program. And one of your slides showed that some of that some of what we collect today would be put into a number of other programs.'",
        "'speaker_0': 'And there's like a difference of $12 million that would be left supposedly returning back to the general fund. So if we're returning that much money, why wouldn't we just add composting and do everything we can to start getting everybody to be composting?'",
        "'speaker_0': 'Same way we did with recycling.'",
        "'speaker_1': 'So let me first invite my finance director, Zack Carter, to the answer, the delineation number, and then I'll tackle this. Okay. Thank you, counsel. Good evening. Decorative financial director for Dottie. So I understand the question correctly is the cost of rolling out compost citywide as the general fund activity?'",
        "'speaker_1': 'We currently invest about 1.9 million for the paid service appropriated for compost service. To expand that out to the full city would be about an additional $4 million. We're looking at about 6 million total to have a full compost service provided by the general fund.'",
        "'speaker_0': 'And that would be taking away the program for people who are paying for it today and just covering it for everybody.'",
        "'speaker_1': 'That is correct. And consistent with the cost of rolling out citywide recycling on a weekly, weekly basis.'",
        "'speaker_0': 'Okay. So that's why the numbers don't make sense to me. I mean, I get the the the push that if people are paying that, they're going to be more encouraged to recycle and compost. Again, we've raised the recycling party's participation rate, but we've not.'",
        "'speaker_0': 'We so some people have chose to pay right today and others feel like, you know, my trash service has always been part of my taxes, so why should I be paying for that? And then since there's such a significant cost difference between just adding that versus rolling out all of the trash service into a new fee structure'",
        "'speaker_0': ', which I'm assuming will be set up as a as an enterprise fund. Help me understand why we didn't start with that.'",
        "'speaker_1': 'So, Councilman, I'm struggling to follow the question completely, but let me make a few clarifying points here. One, the numbers I believe you're referencing here, speak specifically to 2023. Where is.'",
        "'speaker_0': 'Yeah, I looked at that as well as the projections over the next six years to 2034.'",
        "'speaker_1': 'That's correct. And so certainly next year, we will experience some expenses that relate to one time implementation. And next year we'll wait to determine what the cost to the city is for the affordability program. We don't have a certainty around that cost because we don't know who's going to subscribe to that now, and we want to make'",
        "'speaker_1': 'sure we do not shortchange it. Now, to add additional information to the question is, what am I not answering there, Councilwoman?'",
        "'speaker_0': 'Well, we're adding more cost to the program because we're including the affordability program. We're also saying to our drivers, if you have, you know, people on your routes that are, you know, in in an area where you've got topography, that requires steps for people to get their trash bins down the steps.'",
        "'speaker_0': 'And I know in some of our neighborhoods, they literally have to take them down the alley to this to the side street and then bring them to the front. And we're saying if they're elderly and they can't get their their trash bins down, three of them.'",
        "'speaker_0': 'Right. We'll have our driver stop in the middle of the street and our driver will go do that. And I'm concerned about the workman's comp claim. So we will see if we're asking our drivers to do that when it snows.'",
        "'speaker_0': 'And if, you know, we're talking about elderly folks who can't take their trash bins, more than likely, they have an. Had a chance to remove the snow on their sidewalks. So it's some of those kinds of things that I've been told in the briefings that that's something that we're going to do.'",
        "'speaker_0': 'And in fact, we're adding to emissions in the middle of the street by by forcing them to stop and asking them to go do that, take three bins, you know, bring them down, probably take them back. So I'm just not understanding why we didn't just start with that.'",
        "'speaker_0': 'And given that we're only talking 4 to $6 million instead of $33 million per program, because now what we want to do is create a separate fund just for all of our trash services.'",
        "'speaker_1': 'So yeah. So Councilman, first of all, I want to clarify the service that we would provide to any resident that's mobility impaired is provided today. And so any increased risk to that is is incremental. And so certainly not a concern that I have that I have now as it relates to would there be a different way that'",
        "'speaker_1': 'we can propose how we manage waste it? Certainly we could look at a less aggressive we could certainly look at a more aggressive. What we're bringing forth to council today is what our recommendation is based on review of peer cities, based on actual results over the last 10 to 20 years on how we achieve the goals that'",
        "'speaker_1': 'we've set out. And so that's where the recommendation that's for council today was developed.'",
        "'speaker_0': 'Got it. Okay. So on the fees, is that intended to be done through the wastewater? So when the wastewater bills go out, somehow now will include billing for trash service with wastewater. We used to see wastewater bills with our water bills, right?'",
        "'speaker_0': 'Yeah. So how are we looking to do that?'",
        "'speaker_1': 'Yeah. So we were working towards a single consolidated bill for the utility services that you receive from the city and county number of be inclusive of what you were traditionally used to in wastewater in Denver water bill as well as this volume based pricing service.'",
        "'speaker_0': 'So we're going to include water, wastewater and trash. These all in one bill.'",
        "'speaker_1': 'Just the utilities provided by the city and county of Denver.'",
        "'speaker_0': 'So wastewater and the trash and.'",
        "'speaker_3': 'Trash, correct.'",
        "'speaker_0': 'Okay. And is wastewater absorbing any of the costs associated with the billing system?'",
        "'speaker_1': 'So the billing system will.'",
        "'speaker_0': 'Mailing out the notices.'",
        "'speaker_1': 'So both programs will be hit with that expense. So we will appropriate the appropriate amount of expense for any billing system to the wastewater fund. And we were appropriate the of the right amount of expense to the SRF for this solid waste, as we're calling.'",
        "'speaker_0': 'It, a special revenue fund, not an enterprise fund.'",
        "'speaker_1': 'So wastewater is an investment?'",
        "'speaker_0': 'No, this one, we're not calling it an enterprise, but.'",
        "'speaker_1': 'It is not are we not calling it an investment? It is a spectrum.'",
        "'speaker_0': 'Okay. Let me see. I think I have a couple more, so. When I had my briefing, I was told that we were going to start the billing notices in October. So the program would would start January, but it was based on, you know, starting to get the bins out to everybody in October.'",
        "'speaker_0': 'I don't know how that has changed since that briefing, because I believe there was an agreement that the program would be moved to January. Now, so has has that timeframe changed of when those notices go out and when people would start getting their bins?'",
        "'speaker_1': 'So we certainly are continuing to propose a phased roll out. And consistent with what we have referenced before, the timeline will certainly shift as a result of the initiation date of the ordinance.'",
        "'speaker_0': 'Okay. So what I'm getting at is I was told that people will start getting their bins, you know, in that phased out system that you just mentioned. But everybody would start getting their notices, their bills, and some people would then basically have theirs credited.'",
        "'speaker_0': 'But when we were having the conversation, it was going to be an onus put on the household to have to contact the city, to say you need to, you know, credit me. So has that changed?'",
        "'speaker_1': 'So that onus will not be on the customer to contact us? I think we will be doing that automatically.'",
        "'speaker_0': 'So we're automatically tracking who's getting the bin.'",
        "'speaker_1': 'Sort.'",
        "'speaker_0': 'Of bills. So we're not starting to notify anybody who hasn't received the bins. They're not going to get a bill until they get the paper.'",
        "'speaker_1': 'That is correct.'",
        "'speaker_0': 'Okay. That's. Thank you for.'",
        "'speaker_1': 'That. And Councilwoman. Just to clarify, if you receive a bill and you do not have a bill, you will get a credit for the fact that you do not yet have a bin or that bin service is not yet available for you.'",
        "'speaker_1': 'I want to make sure I'm answering that question here.'",
        "'speaker_0': 'So it's tracking whether they get the credit and making sure that they haven't received the bin.'",
        "'speaker_1': 'The same team that's tracking whether or not they've received a bin and whether or not bin service is available yet.'",
        "'speaker_0': 'Okay. So my last question is about the annual costs that are projected starting in 2023 and 33.5 million. It shows 6.5 ranged from 6.5 to 7 million as an annual cost just for the trucks. I know we approved something like 15 trucks, if I'm remembering correctly, that came through here.'",
        "'speaker_0': 'I don't know. I want to say about a month ago. Yeah. And just curious if we're going to be buying new trucks every year and how that fits into that batch that we just approved. Are we are we moving to electric electric trucks?'",
        "'speaker_0': 'Are we, you know, just continuing to buy the same trucks we've been buying? Because if we're making that very clear to the people we're buying them from and technology keeps changing, I want to make sure we're continuing to move that needle on the emission side.'",
        "'speaker_1': 'Yeah, so good. Good question, Councilwoman. So the purchase the lease purchase that this body saw approximately two or three months ago was for replacement of the existing fleet. Today, that is not included within its volume based pricing within the line item for the annual budget.'",
        "'speaker_1': 'What we're anticipating is that replacement of approximately 14 trucks a year. Moving forward, the average service life for a solid waste vehicle industry standard is four years. We are far we are nearly double that with the fleet in Denver right now.'",
        "'speaker_1': 'So we certainly have a backlog that we are looking to not only catch up with and address, but we also have just started the process for initiating a heavy duty electric vehicle study so that we can ensure that when the technology exists, we as a city are one of the first to market.'",
        "'speaker_1': 'We we were the one of the first to roll out an all electric sweeper. And we see a lot of promise in our total vehicle technology for the heavy duty market. And we're beginning that study just, in fact, in the last week.'",
        "'speaker_0': 'Thank you, Adam. I have no further questions. Madam President. All right. Thank you, Councilmember Ortega. Councilmember Flynn.'",
        "'speaker_5': 'Thank you, Madam President. I don't know who should answer this question, but on slide 24, which is in the appendix, it says and I remember reading about this in a couple of months ago in Denver. Right. I think had an article online.'",
        "'speaker_5': 'And the first bullet says about weekly recycling that there's been a high demand from customers and city council, that we go to weekly recycling throws. And I was puzzled when I read the article and then when I see this in the presentation, because in seven years that I've been here, I have never had any constituent ask me'",
        "'speaker_5': 'for weekly recycling. And I thought, Well, do they cut the telegraph lines to Southwest Denver? Maybe I just did not get the news. But I have had a lot of constituents who have said, you know what, I fill up my cart every two weeks and I have more I could put in there.'",
        "'speaker_5': 'Could you give me a second card? Or better yet, could you give me the 95 gallon purple card? Because we seem to default to the 65 gallon cart when when somebody gets a new card, they get 65. Or my neighbor, for whom I got a second card, he got a 35 gallon one.'",
        "'speaker_5': 'You know, we should always be if we want to encourage recycling, we should always give out the 95 gallon. So have we actually documented who it is that's demanding weekly recycling? I have never had anyone ask me for weekly recycling.'",
        "'speaker_1': 'So, Councilman, I certainly understand that that's not something that you may be hearing from your constituents within your district. I can say this from a citywide sample. When we went out to do our public engagement for this effort, it was something we certainly heard from a city wide perspective.'",
        "'speaker_1': 'And so in regards to documenting those individual conversations, I'll defer to my communications team on that. But do we keep hearing it myself as well?'",
        "'speaker_5': 'I mean, do we keep a log or anything? Like who? Who are these forms? I can say accurately that I have had near unanimous opposition to this proposal. And I can say that I've had only one constituent that has told me they support it.'",
        "'speaker_5': 'And she's sitting in the room here, and I'll acknowledge that. But everyone else I've heard from has said weekly recycling is a waste of resources, driving twice the number of twice the amount of mileage, twice the number of trucks around the city every week instead of every other week is a waste, and it will offset any gain'",
        "'speaker_5': 'in lowered emissions from the landfill. By doing that, because we're just driving twice as much with diesel trucks around the city.'",
        "'speaker_3': 'And why did.'",
        "'speaker_5': 'We or did we evaluate keeping the biweekly recycling? Because unlike compost, it won't rot. It won't draw maggots. It will sit there for the second week giving the 95 gallon cart or two cards to customers, the few customers who actually would need we.'",
        "'speaker_3': 'Who.'",
        "'speaker_5': 'Would benefit from weekly recycling? What was our evaluation on that? Because it seems to me it's a waste of resources.'",
        "'speaker_6': 'Councilman Flynn. My name is Margaret Mather and deputy manager here. I just wanted to address a few of your comments and questions. First of all, we do keep a log and a record of public comments that we get.'",
        "'speaker_6': 'And we actually look at that and we map it. We have a top concern so that that helps us direct how we can better serve our customers. So we we do have a record and a log of comments we get.'",
        "'speaker_6': 'But then we also I know council, our council members get comments and then they will then get fed to us. And so we know that we have heard, you know, maybe not every council member, but we have that has been a big comment that we've had.'",
        "'speaker_5': 'Margaret, how did we reach out to people in order to see what they've what they wanted? Because we've heard a lot from from people who are organized, the Climate Action Task Force, it's in their recommendations. But I have a feeling that Rosario and Margaret didn't know that people were asking, Do you want weekly recycling?'",
        "'speaker_5': 'I have a feeling that folks in Brentwood and and Marlee and Harvey Park had no idea that we were asking the folks in the green shirts what they would like to see, what was more outreach to the broader neighborhoods on this.'",
        "'speaker_6': 'And I know that we did do a citywide outreach effort, I think specifically to talk to the weekly recycling, though, part of the benefit of the reroof that we did in breaking the city up into districts and aligning our solid waste teams.'",
        "'speaker_6': 'So we have a supervisor who is responsible for a district and that's a trash district that doesn't align with our city council districts, but that we have our staff out in the field. They talk to people, they connect with them.'",
        "'speaker_6': 'And a big concern that we hear is carp management. And so the idea that you're going to now bring more carts and again, this is dependent on the part of the city you're in, in the neighborhood, and that's why we really try to tailor our our service.'",
        "'speaker_6': 'But the last thing a lot of people want is a bigger bean in another bean. And, um, and Director McGwire did it and his team did an analysis of the weekly recycling. And, you know, the thing we need to remember is we're not changing the tonnage.'",
        "'speaker_6': 'What we're doing is changing what Bennett goes into. And when you do weekly recycling more, that gets into the recycle bin. And maybe you don't need to take your card out every week if you don't fill up the weekly recycling.'",
        "'speaker_6': 'But it is not double the trucks. That's not the way that the math works out. And I don't know, Director, you want to.'",
        "'speaker_5': 'Let me ask you this. Would we have a way should this pass in our analysis of whether it's successful or whether it's falling short, whether it's exceeding goals? Would we have a way of determining? Because I would contend that giving 95 gallon purple cards one to most households would suffice for biweekly and not need weekly pickup.'",
        "'speaker_5': 'Most households won't need a weekly pickup. If we gave them the 95 gallon card, would we have a way if this were to pass? To report back to council in the two year or five year review. How often are households?'",
        "'speaker_5': 'Are they putting it out every week? That and if they are, I mean, will we know, you know, 50% of the houses put it out every week, 25% put it out every week or whatever. And will we know how much is in those cards?'",
        "'speaker_5': 'If I were to do it, it's just me and my wife were empty nesters, so if I were to put it out every week, you'd be picking up half every week of what you could wait the second week to pick up a full car.'",
        "'speaker_4': 'Right.'",
        "'speaker_6': 'You don't have to bring the card out if it's not.'",
        "'speaker_5': 'Yes, that's. And that's what I'm getting at. Will, we know in the reports that you might give.'",
        "'speaker_0': 'Us, we.'",
        "'speaker_1': 'Are.'",
        "'speaker_5': 'Are people putting it out every week or are they not? Because I would suggest that if they're not, then it was pointless then to do weekly pick up if people are still putting it out every other week.'",
        "'speaker_6': 'So part of the modernization of our system that we're going through right now is also adding some software, some software that will be in the truck so we can we'll know when we've picked up the car. We're going to know we're going to be collecting a lot more data.'",
        "'speaker_6': 'Now, we're not currently weighing weighing the bin. So we're not going to be able to tell it. You know, we're not going to have that type of data, but we will know the number of households that use the weekly recycling.'",
        "'speaker_6': 'We'll know the number of households that use compost. And that's the more data that we'll have and that will report in our we.'",
        "'speaker_5': 'Will know that when a truck picks up a car, does it somehow register that I've done one, I've done two, I've done three. So if we have 100 customers and they only pick up from 75, we would know that.'",
        "'speaker_6': 'That's information that the drivers collect. So that is part of the information. And since we're moving to a billing system, we're going to have to have more data and more data on our customers. And and that is part of the system that we're putting together right now.'",
        "'speaker_6': 'But I did just want to bring up that point that we do hear a lot from the community asking for weekly recycling. We understand council hear.'",
        "'speaker_7': 'Is a lot.'",
        "'speaker_6': 'From people wanting weekly recycling. And our number one issue in a lot of areas is what to do with the carts. And I think the idea of having one more cart in a lot of areas would be problematic.'",
        "'speaker_1': 'Or one.'",
        "'speaker_5': 'Larger cart, which might suffice. I think I have a 65 gallon purple cart and I've had it filled enough that they'd prop the lid up. And so maybe a 95 gallon cart for me would suffice every other week, probably for most households, probably for Rosario and Margaret for.'",
        "'speaker_5': 'Certainly. Thank you. Thank you. That's why I have.'",
        "'speaker_0': 'Madam President. Thank you. Councilmember Flynn. Councilmember Kenny.'",
        "'speaker_7': 'Thank you. Council President I wanted to just clarify one very important point that came up in the questions and answers from Councilwoman Ortega. So I think she was asking some questions about Slide 16 from the appendix about actually I'm sorry, slides 17.'",
        "'speaker_7': 'And in passing she mentioned that there would be $12 million left over in return to the general fund, but that is not what this slide shows. So I wanted to ask if someone from the team can please refer to the fact that so so it's a 25.'",
        "'speaker_7': 'I'm going to ask the question and then ask you to two to fill in. But it's a out of $25 million, about 13 ish million is programed in this slide that will stay in the general fund in 2023, which means $12 million doesn't show up as a line item, but it is not true that those dollars are'",
        "'speaker_7': 'unspoken for. So can you please talk about why those $12 million are staying in the general fund and what they will be used for and how we're going to work through that? And you know, if we need someone else from the team to answer as well.'",
        "'speaker_7': 'But can you just clarify that, please?'",
        "'speaker_1': 'But yes, Councilwoman, so the $12 million are not programs because they are identified for the affordability program. And so because we do not know the extent of which households will ultimately pursue the affordability program, we're not going to shortchange it by putting a budget number in here right now.'",
        "'speaker_1': 'So what you see as a remainder is, a, to be determined. And once we know what our applications are, where we end up with the affordability program, we'll know what dollars and to what extent are available for repurposing.'",
        "'speaker_1': 'At that point, those dollars would be eligible to be repurposed. Councilwoman, does that address the question?'",
        "'speaker_7': 'Yeah, I just wanted to clarify. And, you know, the councilwoman can chime back in as well. But can I just follow up with one more question, which is that so to the to the to the idea that we should just make compost free or that we should just provide, you know, improved.'",
        "'speaker_7': 'Services without this fee. I just want to clarify, is there extra money in the budget to do either of those things?'",
        "'speaker_1': 'No, Councilwoman, there is not.'",
        "'speaker_7': 'So what would have to happen if we wanted to do these magical things and provide more services with no fee?'",
        "'speaker_1': 'We'd have to expand our appropriation to solid waste management within the daily budget.'",
        "'speaker_7': 'Okay, so there is no extra money sitting there waiting to be used for these free services if we were to go a different direction.'",
        "'speaker_1': 'No, there is not.'",
        "'speaker_7': 'Okay. Thank you for clarifying. I appreciate it.'",
        "'speaker_0': 'If I may add, on the flip side, if we then create a new fee, then we're adding that much more. We're adding we're creating $33 million. And then you're saying of this 25 that we collect today, then 12 million of that is what's remaining.'",
        "'speaker_0': 'But part of that will go towards the affordability program and, you know, the billing system and the education and the things that are on this slide.'",
        "'speaker_1': 'There are onetime costs that are associated with what you see on this slide in front of you right now. Moving forward, there will be costs to the General Fund for Solid Waste Management that are outside of those services that we provide to households.'",
        "'speaker_1': 'So for example, they keep Denver beautiful programing. Councilman Flynn, I appreciate your interest in that program. Our graffiti program, where we keep the city clean and free of graffiti, as well as the affordability program. And so you see those costs continue to be a general fund supported item moving forward with the passing of volume based trash passing'",
        "'speaker_0': '. But if you look at slide 31, slide 31 takes you from 2023 all the way to 2030 and shows what your admin costs are, your waste collection vehicles. And we go from 33.5 million in 2023, up to 38 point.'",
        "'speaker_0': '2.3 in 2030.'",
        "'speaker_1': 'So those are.'",
        "'speaker_0': 'Ongoing costs continuing to be added to the program.'",
        "'speaker_1': 'Specific to the special revenue fund. And so these don't these costs do not include the affordability program. They do not include our graffiti program. They do not include I keep them or beautiful program they don't include.'",
        "'speaker_0': 'So these are all part of the new program, the new fund that is is being collected from the fees to continue trash service of regular trash recycling and composting.'",
        "'speaker_1': 'And education and other components that are related to volume based price. Okay.'",
        "'speaker_0': 'Thank you. All right. Thank you. Councilmembers Kenny and Ortega. I had a couple of questions, Adam. Are there requirements within city buildings within this building, within the Taylor building in Montebello? Are there requirements for there to be composting offered in those city facilities?'",
        "'speaker_1': 'I'll defer to Jessica Lally for that question.'",
        "'speaker_6': 'We do provide service to city facilities, including fire stations, municipal buildings and libraries.'",
        "'speaker_0': 'So there is currently composting available at the Taylor Building. For city employees who have their offices within the area. Taylor Building Is there composting currently provided?'",
        "'speaker_6': 'As those buildings reach out to the Solid Waste Team? We've expanded our services to them. And so I'm not sure if that building has it, but any buildings that have reached out to us, like Denver Human Services or libraries, we've added compost to their collection.'",
        "'speaker_0': 'Can you tell me the number out of all of the city buildings that are city assets, how many of those currently today provide composting? I can send recycling.'",
        "'speaker_6': 'Certainly get that to you.'",
        "'speaker_0': 'But you don't have it now.'",
        "'speaker_6': 'Not at this moment.'",
        "'speaker_0': 'Okay. Well, I will let you know right now that there is no composting service unless I've missed it, but I'm pretty sure I haven't at our own city owned facilities in Montebello. And so that is concerning, but we'll go ahead and move along.'",
        "'speaker_0': 'How long has composting been available in the city and county of Denver? What was that year again that we started it? Yeah.'",
        "'speaker_7': 'I'm sorry. I'm just looking for a note. But we believe that the city started the composting program as a pilot that was grant funded in 2014 and then it was moved to the city budget, I believe, in 2016 or 17.'",
        "'speaker_0': 'Okay. So we.'",
        "'speaker_7': 'Didn't see the budget as it.'",
        "'speaker_6': 'Was at the moment.'",
        "'speaker_7': 'That the ordinance was passed to create a special revenue fund to expand the composting service beyond the pilot stage.'",
        "'speaker_0': 'Okay. So we'll even give you a 2016, 2017. How many customers do you currently have in the Montebello community who are participating in composting?'",
        "'speaker_7': 'I like to just go.'",
        "'speaker_6': 'For that data. It's very few. Most importantly.'",
        "'speaker_0': 'It's 126 customers in Montebello. Do you have how many are participating paying for composting currently in Green Valley Ranch?'",
        "'speaker_6': 'I apologize. I need to pull up the data. Okay.'",
        "'speaker_0': 'It's 294. My follow up question is if composting has been available since 2014, 15, 16, 17. Where was the marketing plan around it? Who was the company that either Kasper or Dotti or Solid Waste? Who was the marketing company that we had an RFP with a contract with to market and increase those composting customers?'",
        "'speaker_0': 'Who was that company?'",
        "'speaker_6': 'Well, I would only say that.'",
        "'speaker_7': 'Kessler does not have a contract for that.'",
        "'speaker_0': 'Okay. So cancer doesn't have any marketing company to increase and provide education to constituents to increase these numbers. Dottie, who is the vendor that you used for marketing and outreach income person?'",
        "'speaker_1': 'I don't have that information about what we'd have to look back historically to see what we leveraged and specifically who we leveraged or if we did that service in-house for marketing.'",
        "'speaker_0': 'Okay. All right. Thank you. I appreciate the answers to those questions. The public hearing is closed. We're going to move to our Amendments Council member Herndon. We're going to go ahead and start with your motion to amend. We don't have Councilmember Hearn.'",
        "'speaker_0': 'Councilmember Cashman. Can I get you to go ahead and read or make the motion? We're on page seven.'",
        "'speaker_3': 'Yes, I've got you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_3': 'Yes, ma'am. I move that council bill 22 685 be amended in the following particulars. One on page nine, line 27, strike section eight reporting the manager of transportation and infrastructure shall report in writing to City Council by February one, 2025 and every two years thereafter regarding the operation of the program and replace that with Section eight, a'",
        "'speaker_3': 'new Section 48 of Chapter 48 of the Denver Revised Municipal Code shall be created by adding the language as follows Section 40, Dash 49 reporting the manager of Transportation Infrastructure shall report in writing to City Council by February one, 2025, and every two years thereafter regarding the operation of the program.'",
        "'speaker_0': 'All right, thank you very much, Councilman Cashman, for making that motion. Yes, Councilman, do you.'",
        "'speaker_1': 'Have a.'",
        "'speaker_5': 'Copy of the item? I don't have a copy digitally or or on paper.'",
        "'speaker_0': 'Is that available to us? Mark Page, I believe, sent out the script for the meeting tonight a little bit after four.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'We're on page seven. And so it would be the exact language there. We're going to go ahead and go to Councilmember Herndon for we're going to go to questions or comments on this amendment, and we're going to first go to Councilmember Herndon.'",
        "'speaker_3': 'Thank you, Madam President. And thank you, Councilman Cashman, for reading that. As I said before, this is just a technical amendment that codifies the reporting requirement for Ms.. So this is more than likely the easiest amendment we're going to have tonight.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_0': 'Agreed. Thank you. Councilmember Herndon. Councilmember Flynn, did you have any follow up questions? Are you good? Okay. All right. Very good. I don't have any other members in the queue for questions or comments on this amendment. Madam Secretary, roll call on the amendment to Council Bill 22, Dash 685, please.'",
        "'speaker_0': 'CdeBaca, I. Sandoval.'",
        "'speaker_4': 'Sandoval.'",
        "'speaker_0': 'Sandoval.'",
        "'speaker_4': 'By Torres. I. I. Black tie, Clark.'",
        "'speaker_3': 'All right.'",
        "'speaker_4': 'Sorry. Flynn. I Herndon. I Haines. I Cashman. I can each i.'",
        "'speaker_1': 'Ortega, i.'",
        "'speaker_4': 'Sawyer, i. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, to close the voting and announce results. 13 813 IES Council Bill 20 2-685 has been amended. Councilmember Ortega, your motion to amend. Thank you, Madam President. Council Members I move to amend Council Bill 20 2-0685 as follows On page six Line one strike article and Ad Perin article.'",
        "'speaker_0': 'If the adjustment results in an increase that is less than or equal to 5% of the fee, if the adjustment proposed by the manager results in an increase that is greater than 5% of the fee. City Council approval fee ordinance shall be required.'",
        "'speaker_0': 'Thank you, Councilmember Ortega. It has been moved and we've got a second there. Questions and or comments by members of Council on this amendment. Councilmember Ortega. So the purpose of this amendment, it would limit the authority of the manager to increase fees beyond 5% and instead would require require city council for any increase exceeding 5%.'",
        "'speaker_0': 'For example, based on the fees in 48 dash, 40 to 5% be an increase exceeding $0.46 per month on the smallest bean and a dollar six per month on the largest bean would require city council approval. So that's just a breakdown of what those numbers would look like.'",
        "'speaker_0': 'All right. Thank you, Councilmember Ortega. We've got a few members in the queue here. Councilmember Sawyer.'",
        "'speaker_7': 'Thanks, Madam President. I just, I guess, need a little clarification about how this amendment, if approved, would function in the real world. Right. So if there is a situation where like this year, the cost of doing business has gone up at least 8% and potentially is anticipated by the end of the year to be looking at more'",
        "'speaker_7': 'like 11% if the cost of the trash service passes and and is at that same 11% rate and council says no to the to the proposed more than 5% growth in the fee. How then are we going to pay for.'",
        "'speaker_6': 'The trash service?'",
        "'speaker_0': 'Is that question for me or you asking that of the folks from Dottie?'",
        "'speaker_7': 'What I'm asking you, I mean, I guess but it was probably a question for financier Dottie at the end of the day, like, I just don't understand.'",
        "'speaker_0': 'First of all, this is based on them having to come back and show that there's justification for an increase.'",
        "'speaker_7': 'Sure, I understand.'",
        "'speaker_0': 'And they they can do that below the 5%. What this is asking for is anything above the 5%. And just to be clear, this was a an amendment that was proposed last week. It was shared with me by one of our colleagues, actually, a couple of our colleagues.'",
        "'speaker_0': 'But when mine didn't pass and I didn't vote for it, they chose not to support it tonight, and you'll probably hear from them. So this was, again, a compromise to what I was bringing forward, which I thought was a compromise that was asking for the fees to be approved by council in general.'",
        "'speaker_0': 'But this is making that 5% threshold a requirement where council would then have approval authority, very similar to what we do today with other fees that we still have that power over some of those over time. Council has abdicated that authority to the manager of agency.'",
        "'speaker_7': 'Sure. I totally understand the purpose of it and the intent of it. I am asking for clarity around what will happen, like not in theory, what will actually happen if this amendment passes to the trash services because it's a fee.'",
        "'speaker_7': 'So it has to be zero. It has to be revenue neutral. So like, is there a I guess I'm asking Finance or Dottie or Kaser? I'm not sure who I'm asking. There are a lot of hands on the.'",
        "'speaker_4': 'Pot, but like, what is the what's the plan for.'",
        "'speaker_7': 'If worst case scenario this were to pass and it were above a 5% price growth and council said no.'",
        "'speaker_1': 'Councilwoman Adam Phipps with Dottie. What I will say is we're proposing the amendment. We're proposing the ordinance without that cap so that we don't end up in that scenario. That's where Dottie's position is on this.'",
        "'speaker_7': 'Got it. Okay. Thanks.'",
        "'speaker_0': 'Thank you. Councilman Sawyer. Councilwoman Greenwich.'",
        "'speaker_7': 'Thank you. Council President. I will just pick up with my comments where we're left off. I will not be supporting this amendment tonight. We always are exploring ways to find common ground with colleagues. And we made that attempt last week and we didn't find it.'",
        "'speaker_7': 'And so the amendment last week was struck down. And I would urge folks to vote no on it this week. I would like to just add a little more coloring in of the lines to add to what Director Phipps said, which is that here's here's how I see the risk.'",
        "'speaker_7': 'This program is required to provide essential services to residents and including things that this council has prioritized, such as education. So daily, sir, you know, a weekly service with all the bins getting picked up and education to make sure that they're used properly is really important to this council.'",
        "'speaker_7': 'If if the cost of providing that service requires an increase and this council because of fear of political reprisal or fear of pressure, bulks at paying for what the program costs. Then the program is faced with having to cut services or somehow find another way to compensate and make sure that the service is not compromised.'",
        "'speaker_7': 'That's the risk of putting this in a political process versus a technical process. I think it's important for us to monitor and use our oversight powers to make sure we read those cost of service studies. When the agency does them to make sure that they are being responsible, that they are being lean, that they are making sure'",
        "'speaker_7': 'that they are going to service the increases as a last resort, that they try to find efficiencies to try to find rebates from the state and grant funding and all those things they do today. They need to keep doing that and we need to stay on them.'",
        "'speaker_7': 'But I am I don't think it's best for us to subject an essential city service to kind of political process that could compromise it, you know, in a future in a future situation. So I will be voting no tonight, and I would urge my colleagues to do the same.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Khanna, each Councilmember Flynn.'",
        "'speaker_5': 'Thank you, Madam President. I was supportive of the amendment. I was supportive of the amendment that launched last week that attempted to keep the power to set the rates with this council. We've abdicated and ceded.'",
        "'speaker_1': 'A.'",
        "'speaker_5': 'Lot of fees to the agencies that are now on autopilot. Oddly enough, I would cite many of the same factors that Councilwoman Kennedy just responded. But I would suggest that listening to our constituents and what they want. Is a good thing.'",
        "'speaker_5': 'Responding to their needs and desires is why we're up here and we shouldn't put this on autopilot. And to Councilwoman Sawyer, I think the reason the response of this council to say an 11% if there had to increase by 11% and we didn't want to do that.'",
        "'speaker_5': 'I think what we would have to do then is suggest to the agency that they restructure the service, that they come back to us. Perhaps it would it would be the case as I got it got out in my questioning that the recycling program isn't necessary every week.'",
        "'speaker_5': 'Maybe we could go back to every other week, and that would provide the savings that we wouldn't need an 11% increase. But without the pressure of having to come back to us for permission to raise the fee above 5%, that's all gone.'",
        "'speaker_5': 'And we don't have to respond to what our what our struggling families are saying out in the neighborhoods. They'll just get hit with a with an 11% increase in this. In the example that was that was suggested down the other end of the dais just now, I think it's a good thing that it has to come back'",
        "'speaker_5': 'to the council if it's over a certain amount. That's why we're up here. And so I will support this amendment. And I would ask that my colleagues do that, that they approve it also.'",
        "'speaker_0': 'Thank you. Councilmember Flynn. Madam Secretary, roll call on the amendment, please. CdeBaca, I. Sandoval. No.'",
        "'speaker_4': 'Torres. I. Black.'",
        "'speaker_3': 'Clark No.'",
        "'speaker_0': 'Schwinn.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Herndon No. Hines No.'",
        "'speaker_4': 'Cashman can reach me.'",
        "'speaker_0': 'Ortega, I. Sawyer. No, Madam President, I. Madam Secretary, close the voting. Announce the results. Eight NIS. Five Eyes. Five Eyes. The amendment to Council Bill 20 2-685 has failed. Councilmember Flynn. Your motion to amend.'",
        "'speaker_5': 'Thank you, Madam President. Looking through the script. All right I move the council bill 20 2-6 85 be amended in the following particulars on page nine, line 32. Strike January and replace with October.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. It's been moved and seconded. Thank you. Questions or comments by members of Council on this amendment? Council Member Flynn.'",
        "'speaker_5': 'Thank you, Madam President. That might be the shortest amendment I've ever proposed. There are several reasons to pursue this change. The effect of it would be to push back the start to October rather than January next year. My concern is that when we were presented this in committee, we were told that in January this year there was'",
        "'speaker_5': 'a 35% vacancy rate. 35% of the positions in solid waste were vacant and that by the beginning of June there was down to 28%. And that's after a really remarkable, commendable period of aggressive recruitment and hiring. I think we were paying sign up bonuses where we as a $4000 to $5000, I might sign up.'",
        "'speaker_5': 'And so we closed we filled 7% of the open positions at that rate of hiring and council and commission. I did have a discussion about this this afternoon. And and she has some optimism about future hiring that I hope is true, but I can't rely on it.'",
        "'speaker_5': 'But at that rate of hiring in five months, we filled 7% of the vacant positions. It would take 20 more months to reach 100% of staffing for the current level of service, not even accounting for the 22 additional operators we need to hire to go to weekly recycling.'",
        "'speaker_5': 'And so one of the biggest calls and complaints we've had from constituents since January is that their their trash and recycling and compost, not so much compost, but mostly trash. And recycling has not been picked up on their new assigned day.'",
        "'speaker_5': 'I think Adam and our assortment is here. Still here. Thank you. I think, Art, that your folks are doing an incredible job under very difficult circumstances. When they go by my house and I happen to be home, I go out and I thank the driver for probably holding him up a little bit from completing the rounds, but'",
        "'speaker_5': 'I let them know that they're doing a great job under difficult conditions. I believe that by starting this program, especially weekly recycling too soon, we are setting it up to fall flat on its face and that by giving it those extra months to October rather than January, we will give them the time to do the hiring.'",
        "'speaker_5': 'And I would expect the department to welcome that breathing space. They probably won't admit it, but I'm hoping they feel it better that I'm doing this as a favor to them and I would ask for support. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Flynn. Councilmember Clark.'",
        "'speaker_3': 'Thank you, council president. You know, with with respect to my colleague, you know, we've been in the trenches working with the department. And this to my knowledge, you have not reached out and asked for this delay. That's not something the department is asking for that we have talked this through and talk this through.'",
        "'speaker_3': 'There is no need to further delay coming out of committee. There were members who pushed for later implementation date and we were proposing originally, which the department was ready to to to implement that. And those members made a strong argument for that.'",
        "'speaker_3': 'And that's already led to the move to a January one implementation. So we've already had this conversation. We've already determined the original date put forward should be moved to January 1st for a lot of reasons that I'm not going to relitigate here.'",
        "'speaker_3': 'That made sense. The bill was altered to address those concerns. Further delay is not needed. It will cause additional logistical and financial issues. I've talked to the folks in the department who do this as their job. Instead of me trying to do them a favor, talked to them and heard from them.'",
        "'speaker_3': 'And this is sticking with the January one date is is the right way to go on this, you know, in addition to making sure that that is operationally what works and working closely with those folks. You know, we have heard tonight and we continue to talk about the urgency when it comes to the need to take action'",
        "'speaker_3': 'on climate. We cannot wait any longer and just pushing this out arbitrarily after we've already talked through and made a further delay and waited decades after talking about this and and years and months after continuing to talk about this to implement.'",
        "'speaker_3': 'I think that this is extremely detrimental for us. On top of which, pushing the implementation that then puts the implementation straddling right in the middle of when there is a new administration coming in. There will be. Change over with staffing.'",
        "'speaker_3': 'I think for all of those reasons and more, this is a bad idea. I will be voting no and ask my colleagues to also vote in all and vote this amendment down tonight. Thank you, Council President.'",
        "'speaker_0': 'Thank you, Councilmember Clark. Councilmember Ortega. Thank you, Madam President. I'll be brief. I will be supporting this tonight. I think there are a number of aspects that we've talked about that I'm not going to, you know, elaborate on or be repetitive about, but I just don't believe this is baked yet.'",
        "'speaker_0': 'And for that reason, I will be supporting this amendment to delay the implementation. Some of us have tried to address some of the concerns that we've heard from neighbors. And overwhelmingly, the input that I have received from people that have reached out to my office have been in opposition to this.'",
        "'speaker_0': 'Yes, I have heard from people who support it, but overwhelmingly the people I have heard from do not support this fee. So some of us have tried to figure out how do we make sure that we're reflecting that input that we've heard from our constituents?'",
        "'speaker_0': 'As you know, you're all my constituents, but a lot of them are concerned about the cost implications. And at this time, when so many people are struggling with all the other things that they've been hit with as a result of of COVID and, you know, more fees and other increases yet to come with other services.'",
        "'speaker_0': 'And so we'll be seeing one from Parks and Rec before too long. So these are yet more fees being imposed on our our citizens. And when you look at it, you know, one household is bearing the brunt of those ongoing costs.'",
        "'speaker_0': 'So and this will be a cost that will be in place forever. As someone asked earlier. So it's not something we're doing just to get it ramped up and then, you know, have it on its feet and then incorporated into the general fund.'",
        "'speaker_0': 'It's something we're going to put in place that we can continue to raise the fees just like we did with our wastewater fees. So I'll be supporting this tonight. Thank you. Thank you. Councilmember Ortega. Madam Secretary, roll call on the amendment, please.'",
        "'speaker_0': 'CdeBaca.'",
        "'speaker_4': 'I. Sandoval.'",
        "'speaker_6': 'No.'",
        "'speaker_4': 'Torres.'",
        "'speaker_0': 'No.'",
        "'speaker_4': 'Black. No.'",
        "'speaker_3': 'Clark No. Flynn All right.'",
        "'speaker_0': 'Herndon No.'",
        "'speaker_3': 'HINES No.'",
        "'speaker_4': 'Cashman Can each name Ortega? Sawyer now, madam President.'",
        "'speaker_0': 'I, Madam Secretary, close the voting and announce the results.'",
        "'speaker_4': 'Nine nays for ice.'",
        "'speaker_0': 'Four eyes. The amendment fails. This is the Second Amendment to Council Bill 22, Dash 685, which has failed. Councilmember CdeBaca. Your motion to amend.'",
        "'speaker_4': 'And move that council bill 20 2-6 85 be amended in the following particulars on page seven Line 27 After customers add such rules and regulations shall provide for a full and automatic rebate to any owner or occupant of eligible property located in a neighborhood identified as at risk or susceptible to gentrification.'",
        "'speaker_4': 'In the 2016 study conducted by the Denver Economic Development and Opportunity Agency, entitled Gentrification Study Mitigating Involuntary Displacement if the owner purchased such property prior to 2013.'",
        "'speaker_0': 'Think, think, think, think.'",
        "'speaker_4': 'Ding, ding, ding, ding, ding.'",
        "'speaker_0': 'Never say to. Thank you for reading that amendment. And I see that it has been moved and seconded questions or comments by members of Council on this amendment. Council Member Sayed Abarca, did you want to explain it a little bit more?'",
        "'speaker_4': 'Yes. In 2016, we paid for and conducted a study about involuntary displacement and the study aimed at understanding our neighborhoods on a census tract basis. It deeply analyzed household income, years of ownership, years of change, and it identified our most vulnerable neighborhoods, places where gentrification had not yet occurred.'",
        "'speaker_4': 'Places where it had started occurring. Places where it was already completed. And so what I'm aiming to do with this amendment is protect the areas that have not yet experienced gentrification at the time of the study, its likely low experience of gentrification early stage at this point.'",
        "'speaker_4': 'But what we do know is that those household incomes have been steadily, deeply. And therefore, we don't need to put those owners or residents through entitlement testing. We know who they are. We know where they live. We know what they can afford based on that study that we already paid for.'",
        "'speaker_4': 'And it would be a conservation of resources, and it would help the residents to not have to jump through any hoops in order to obtain this rebate.'",
        "'speaker_0': 'Thank you. Council members say to Barker. Council member Sawyer.'",
        "'speaker_7': 'Thanks, but the President just quick question for our Legislative Council is this. Allowable under TABOR because I know exemptions are not allowed under state, but the taxpayer bill of Rights under state law. So does this count as an exemption?'",
        "'speaker_7': 'Would this be.'",
        "'speaker_6': 'Legal?'",
        "'speaker_1': 'Thanks, councilman. So I'm not sure about TABOR does regulate in terms of whether we can exempt certain people from being able to pay the fee. TABOR does have some restrictions regarding whether it's a tax or a fee in terms of who has to pay it.'",
        "'speaker_1': 'Councilman said about this amendment suggesting that we had a group of people qualify for the rebate. General, at any time the government determines that one group of people is not up to something and another group of people are locked out of something.'",
        "'speaker_1': 'As long as that's not a protected class, they can do so for a legitimate purpose. But that classification has to be rationale added to that purpose. The problem classification, the more tenuous you make that classification the purpose. And so you risk not being rational that maybe what you're getting at from a tamer perspective that's more on what'",
        "'speaker_1': 'you're charging. This is about the rebate and who gets the rebate.'",
        "'speaker_7': 'Okay. So let me make sure I understand what you just said clearly. So, because this is a specific class of people that we know is facing pressures of gentrification and displacement, and we have the data to prove it.'",
        "'speaker_7': 'And we and we are considering automatically qualifying them for the rebates at 100%, not automatically exempting them from paying for the service that is rationally related to a legitimate government purpose and therefore would withstand any sort of state or federal constitutional challenge to the law.'",
        "'speaker_1': 'Sort of. So what I'm saying is that because this is about a rebate, it's about equal protection instead of TABOR, and because this is about a rebate, what you have to do is ensure that the people that get the rebate, that that class of people is rational, pointed at the purpose of why you're giving the rebate.'",
        "'speaker_7': 'Okay. Is one study. Done in 2016 sufficient for us to make that determination.'",
        "'speaker_1': 'Whether so that's sort of up to the body, whether the group of people identified in the study should get the rebate because that furthers the purpose that the body believes that's up to the council.'",
        "'speaker_4': 'Okay. I would add that our entire minority business approaches and social equity licenses, those are all grounded or based on justified by a single point in time study of the demographic data. And so this would be no different.'",
        "'speaker_4': 'It was, in fact, the purpose of conducting this study so that we could build policies that were protective in response to this data.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer. And say to Baka Councilmember Kenny.'",
        "'speaker_7': 'Thank you. Council President I guess I'll just follow up with a quick question to our council based on the prior questions. If a individual has a home valued at $1 million in Westwood, would they be exempt from the fee under this amendment?'",
        "'speaker_1': 'Thanks. Councilman Ken Trabuco, assistant city attorney. Again, because the amendment is being specific about neighborhoods identified in the 2016 study, I'm not sure. But if statutes in 16 study did classify them as at risk and.'",
        "'speaker_6': 'The answer is yes.'",
        "'speaker_7': 'Okay. So, you know, I will just posit that the the neighborhoods in question here point to Globeville area, Swansea, Westwood and perhaps East Colfax. And so I just want to clarify. Just. Just say it back to you so that if a person owned $1,000,000 home in one of those neighborhoods that's identified in that study, they would be'",
        "'speaker_7': 'exempt from the fee.'",
        "'speaker_1': 'If the person owned if the person on a mandatory home that's identified in those neighborhoods and they purchased at home prior to 2013 then. Yes.'",
        "'speaker_6': 'Okay.'",
        "'speaker_7': 'Even if it's worth $1,000,000.'",
        "'speaker_1': 'As long as it's an independent study and I gotcha.'",
        "'speaker_7': 'I gotcha. So let me just say the inverse then. If you are an individual who makes has a home, you know, worth, you know, the median, let's say, of 400 and some thousand dollars, aside from our momentary little bubble we're in, or you're a homeowner earning $70,000 a year, perhaps as your income and you happen to be'",
        "'speaker_7': 'in a neighborhood not listed, would you be exempt from the fee?'",
        "'speaker_1': 'That the amendment does not change the rules and regulations that Daddy may promulgate that they were given, I think gave a presentation so that I still promulgate rules and regulations that allow a rebate based on am I. So potentially, but under the language of the amendment, they wouldn't qualify under the language of the amendment.'",
        "'speaker_7': 'I'm just going to move your comments because they're they're together on amendments. And so let me just state that this amendment absolutely would treat two homeowners with very different incomes, the same if they are in a neighborhood. And it would actually advantage wealthy homeowners who could be exempt just because of where their houses.'",
        "'speaker_7': 'And would continue to have those wealthy homeowners be subsidized by more moderate income homeowners who happen to live in another neighborhood. I believe that makes us very vulnerable to a challenge of rational basis by treating similarly situated homeowners so very differently and potentially so inequitable based only on geography.'",
        "'speaker_7': 'I agree with the underlying goal of mitigating the impacts of this to those who are struggling to make ends meet. And I will just review what our income thresholds are. If you are a household of one earning less than $50,000, you are eligible for a rebate under this program to help you with your fees.'",
        "'speaker_7': 'If you are a household of three of three people and you earn less than $63,000 as a household, you are eligible for a rebate under those program. These are some of the highest income thresholds we have for an assistance program to help with some of the lowest fees and costs of any utility.'",
        "'speaker_7': 'These utilities cost less than Denver Water, less than Xcel, and they have much more generous rebates. And so just to be very clear, we have a mechanism built into this ordinance that mitigates the impacts to families who are struggling.'",
        "'speaker_7': 'We do need to find them. We do need to work with them to help make sure they're signed up. And we need to be very thorough and fund that. It's why we have a program that is funding nonprofits that are based in these very neighborhoods.'",
        "'speaker_7': 'That is a major target of the nonprofits we'll be partnering with to have them do the outreach as trusted partners, not government employees, not DHS staff. But these partners will be out there on the ground in communities that already know and trust them to get folks signed up for these rebates.'",
        "'speaker_7': 'So we are working to mitigate that in a way that is fair and equitable and will be much more likely to stand up in court than this amendment. So I do urge people to vote the amendment down, both based on the inequities it could create, as well as based on the legal risk it could put us to'",
        "'speaker_7': '. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember, can each council member say to Baca.'",
        "'speaker_4': 'Thank you. I just wanted to point out that it does not change the rest of the proposed income eligibility program. It's in addition to it, and it does an automatic rebate to households that we already know qualify under those for those income brackets.'",
        "'speaker_4': 'And we know that based on the study that we did. And so we're specifically putting in the house being purchased before 2013 because when the study was conducted, if you go back and read it, what you'll see is that they assessed each census block to see how far along gentrification was.'",
        "'speaker_4': 'And these were areas where the census blocks suggested that gentrification had not even started yet in that particular area. And so that is why the 2013 date is important, because that means that it would be consistent with the data that we had at the time of the report.'",
        "'speaker_4': 'And so it would automatically give them those people their rebate without them having to jump through hoops. It does not remove the other pieces of the program. Anyone else anywhere in the city who qualifies under the income eligibility requirements could also obtain this benefit.'",
        "'speaker_4': 'It removes a barrier simply for people who we already have studied and know do not need to be studied again or put through any income testing processes.'",
        "'speaker_0': 'Thanking Council member CdeBaca. Next up, we have Council Pro-Tem Torres.'",
        "'speaker_4': 'Thank you, Madam President. Just asking for clarification, Anshul. Is that what the language is that's drafted in front of us? Because it read as though it applied to whole neighborhoods and didn't have that discernment.'",
        "'speaker_1': 'That's.'",
        "'speaker_4': 'I can't hear people.'",
        "'speaker_1': 'Operating in their neighborhoods as identified in the study.'",
        "'speaker_4': 'Angel. Can you repeat that? I couldn't hear you on Zoom.'",
        "'speaker_1': 'So the answer to your question is yes, it would apply to homeowners and occupants of eligible property if they're located in a neighborhood identified in the study. So it would it would allow a rebate to people within a certain geographical area.'",
        "'speaker_4': 'Everyone in a geographical area, meaning the neighborhood or the census block or the property.'",
        "'speaker_1': 'B it would be the neighborhood as defined in the study. The study used neighborhood boundaries.'",
        "'speaker_6': 'Okay. If it's.'",
        "'speaker_4': 'If it's not able to be as specific as property. Councilman CdeBaca I get what you're.'",
        "'speaker_7': 'Aiming for, and if it is, if it doesn't accomplish that, it can't.'",
        "'speaker_4': 'Support it. I do appreciate, I think, what you're trying.'",
        "'speaker_7': 'To zero in on, which is making it less burdensome for.'",
        "'speaker_4': 'Low income households to apply to qualify for the instant rebate. And I think that's a commendable thing to try to apply to.'",
        "'speaker_7': 'To amend for. I just worry that it's not going.'",
        "'speaker_4': 'To achieve that. And looking at the study as well and some of the neighborhoods that.'",
        "'speaker_7': 'Are growing in displacement, vulnerability aren't even on this map yet.'",
        "'speaker_4': 'Westwood and Sun Valley don't even trigger on this map yet because they didn't have the data. So it also misses quite a bit. So I unfortunately, I can't support it right now.'",
        "'speaker_0': 'Counsel Pro Tem Torres. Next up, I have Councilmember Ortega. I just want to ask a question of our folks either from daddy or cancer. I understand the expectation is to identify organizations in these neighborhoods. We may have some areas that don't have a neighborhood eye.'",
        "'speaker_0': 'I'm thinking about some of the properties in Councilwoman Black's district where they might be eligible. And so part of my concern is if you're not already in the Denver human service system, it makes sense. They're going to reach out to people that are in their system, that have case managers and whatnot.'",
        "'speaker_0': 'That's going to be easy for them to reach those individuals. But for neighborhoods that don't have an active organization that that have affordable housing, where families that may also have some language barriers are not going to otherwise know about this.'",
        "'speaker_0': 'I'm a little concerned that we're going to be missing some people. So is there another way besides just community based nonprofits in Denver, Human Services trying to get this word out? I'm hoping that, you know, there will be some firing with various languages because depending on where you're at in our geography, languages vary.'",
        "'speaker_0': 'And so what what are some of those other approaches to address this so that we don't have people finding themselves in a situation where. They just didn't know about this. They're getting leans on their property. You know, that's the extreme right, which is what we don't want to see happen.'",
        "'speaker_0': 'But if we can figure out how to do all of that education upfront, and that's why that piece becomes really, really critical at the front end. You know, some of us would have liked to see that before we just adopt this.'",
        "'speaker_0': 'And I get through probably wanting the fees to pay for some of that cost. But help me understand how else we reach some of these families.'",
        "'speaker_6': 'Certainly. Thank you, Councilwoman Jessica Lolly, daddy's project manager. So in addition to the community based organizations doing that outreach for us, we will also be mailing a number of things directly to the home, you know, communicating the new fee, expanded services.'",
        "'speaker_6': 'The affordability program will absolutely be a highlight of that. Educational materials are all going to be provided at least English and Spanish. We have translation services for whatever whatever the other languages needed are.'",
        "'speaker_0': 'So will there be robust folks available either through 311 that can have direct contact to the program so that as people have language issues or more questions, that if they're not understanding the flier, we have people that will be able to answer the questions at the other end.'",
        "'speaker_6': 'Our three on one staff will be fully equipped to answer and think about this program and direct them to the right place for help.'",
        "'speaker_0': 'Thank you. All right. Thank you. Councilmember Ortega. Madam Secretary, roll call on the amendment. Please see the Baca I. Sandoval.'",
        "'speaker_4': 'No, Torres. No. Black. No.'",
        "'speaker_3': 'No.'",
        "'speaker_0': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'HERNDON No, no. Cashman When can each man.'",
        "'speaker_0': 'Ortega I.'",
        "'speaker_4': 'Sawyer.'",
        "'speaker_0': 'Madam President, may, madam Secretary, close the voting and announce the results? Ten days. Three eyes, three eyes. The amendment to Council Bill 20 2-685 has failed. Councilmember Cashman We need a motion to publish as amended, please.'",
        "'speaker_3': 'And with the Council Bill 20 2-0685 be placed upon final consideration and do pass as amended.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Council Bill 20 2-685 is on the floor for final passage as amended. Comments by members of Council on Council Bill 20 2-20685. Council Member Clerk Thank you.'",
        "'speaker_3': 'Council President First of all, I say thank you to the whole team who worked on this. So many people across Dottie and Castor and the entire city and the mayor's office who worked really hard on this for a really long time.'",
        "'speaker_3': 'So I want to say thank you so much. Thank you to the members the members of council who worked directly on this. For those of you who supported the direct work on this along the way, and for the ones who have just been real champions for waste, diversion and sustainability up here on on council.'",
        "'speaker_3': 'And I also want to thank you I know we don't have a lot of people in green still left without talked most of you but I really want to say thank you to everyone who came tonight virtually took time out of their day to come speak.'",
        "'speaker_3': 'And to those of you who are still hanging around here and thank you so much for for being here tonight. In the fall of 2019, we put together a citywide task force that was charged with putting forth an action plan for how we tackle climate change as a city.'",
        "'speaker_3': 'We knew that that work would not be easy. We knew that the recommendations that would come forward would touch pretty much every aspect of life in our city. And we knew that it was critical to have a plan and to start enacting that plan immediately.'",
        "'speaker_3': 'In the aftermath of that task force, we took bold action. We acted as councils before us, had not and stood in that space. We chose to rise to the challenge of tackling this emergency head on. But with that action, we only brushed on the surface of what we were called to do.'",
        "'speaker_3': 'In that plan, it's not enough to turn and to celebrate the first bucket of water that we took to put out the fire while the building still burns. We have to continue to do the hard work each and every day until the fire is put out.'",
        "'speaker_3': 'Tonight, we have in front of us another recommendation from that task force action plan. That also was a recommendation from all the other places. I won't relitigate that slide, but from that plan is what I'm focused on. We rose to the challenge.'",
        "'speaker_3': 'The task was put in front of us while drafting a proposal to protect those who are least able to pay through a first in the nation affordability program that is more robust than any affordability program for any other program in the city.'",
        "'speaker_3': 'Additionally, this proposal will literally divert tons and tons of material from the landfill or otherwise sit and produce methane for hundreds of years. This program will ensure that we are not needlessly burying the 75% of our waste dream that could be reuse and recycle and burying it in the ground and instead make sure that we're being responsible'",
        "'speaker_3': 'stewards of those resources for generations to come. We can do all of that through this program that costs a fraction of what citizens in any other city in Colorado pay. We can't stand by and watch while we continue to use materials at an unsustainable rate and contribute to the warming of the planet that has already led to'",
        "'speaker_3': 'droughts, fires and human suffering across the planet and right here at home in Denver. It's irresponsible for us to throw things out that can be reused and recycled, and the city cannot continue to have these reusable and recyclable and compostable materials to the landfill where we are then complicit in the destruction of our home.'",
        "'speaker_3': 'Every city that has implemented a plan like this has seen their diversion rate go up. People recycle and compost more when the recycling and the composting are free. And when you're held accountable to pay for what you send to the landfill, nearly every other city in the United States has a paid trash service, and our fees are'",
        "'speaker_3': 'a fraction of what residents have to pay in these cities. And as I already mentioned, we have a robust rebate program for low income folks. So this will be one of the most affordable trash utilities in America. We must take bold action on climate change.'",
        "'speaker_3': 'We cannot afford to continue to bury reusable, compostable and recyclable, recyclable materials in the ground when we have the opportunity to reuse and recycle them. And the time for action is now. I'll be voting yes on this proposal tonight.'",
        "'speaker_3': 'And I implore all my colleagues on this council to please vote yes as well. Thank you, Council President.'",
        "'speaker_0': 'Thank you. Councilmember Clark.'",
        "'speaker_3': 'Councilmember Herndon thinking i'm president. I want to echo Councilman Clark's sentiments, thanking all those who came and spoke and spoke on this issue. I did want to give a shout out to Madalyn, the rising 10th grader at East.'",
        "'speaker_3': 'I wanted to applaud her for coming out. I love. I love when our young people come out and show share their passion for the issues.'",
        "'speaker_1': 'That are going to impact them longer than just about anyone else in the room.'",
        "'speaker_3': 'No one here is denying the challenge that in us as a city need to step forward and commit bold action. That's not what I'm hearing. I'm hearing. Have we done all.'",
        "'speaker_1': 'That we can before we take the easy.'",
        "'speaker_3': 'Way out? In the midst of a global pandemic, gas prices rising, everyone's wallets shrinking. Should we as a government be a little more sensitive to the plight of our everyday citizens? If there was no other way to move forward to do this, I would wholeheartedly be encouraging.'",
        "'speaker_3': 'Like, absolutely, let's move forward. But I sat here and asked us, what have we done as a city to educate? And there was no answer. Yes, 1 to 2% incrementally over time. I do think that's because people have become more aware of the importance of sustainability, not anything we have done as a city.'",
        "'speaker_3': 'So yeah, we're taking that as a reason to only go to the example that's going to hit people the hardest in their pocketbooks. Because I think about Denver water use only what you need. Every time I open up my bill, I see that that is stuck with me.'",
        "'speaker_3': 'I think about that when the thing is running and I certainly turn it off because I'm not using anymore. That's education and it does make a difference. We've done it as a city to be a smart ass parks and RECs campaign to encourage and educate people.'",
        "'speaker_3': 'We have not done education. People say education doesn't work. What education have we done? Nine. I would first want to do that. First, you demonstrate that that doesn't work. I will be your champion for the next more important step.'",
        "'speaker_3': 'But I'm not suggesting we don't do anything. I'm a no on this bill because I don't believe we have done the outreach that we should do first when it comes to that. But while we're waiting, let's do something crazy.'",
        "'speaker_3': 'Let's stop charging for composting. Let's make recycling weekly. I heard a conversation about, hey, what about the cost? This body approves the cost. We don't have to wait till budget season. I would approve a supplemental next week. To do that, to cover the cost of composting and weekly recycling.'",
        "'speaker_3': 'You would have my support because that's not impacting the people of the city even a greater burden than they're going through right now. Let's do the work that we should be doing first, as well as to add a new setting and education.'",
        "'speaker_3': 'And education. Some catchy slogan Don't waste your waste. Something that just sticks higher. Company who are a lot smarter than I am. And let's do that before we suddenly hit people with this big. Because you can't do it on your own.'",
        "'speaker_3': 'I just find it. I cannot believe that we as a city couldn't do it the better way. I think it's irresponsible for us not to go that route as opposed to just we're now going to charge you for trash.'",
        "'speaker_3': 'So I encourage my colleagues to vote no and then turn around and work with Dotty to find ways to find funding to make composting free. Recycling weekly or other ways that don't impact.'",
        "'speaker_1': 'Member citizens in their pocketbook.'",
        "'speaker_3': 'I'll be a no, and I encourage my colleagues to do that as well. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Herndon. Councilmember Sawyer.'",
        "'speaker_7': 'Thanks, Madam President. I just want to echo the sentiments of both of my council members in saying thank you for all of your hard work. You know, whether or not this passes tonight, you all have done an extraordinary job of community outreach, of pivoting and making changes based on councilmember requests.'",
        "'speaker_7': 'And I'm really appreciative of all of your all of the work that you guys have done in a lot of different areas. So thank you very much for that. And personally, I can speak to the conversations I have had with District five residents about this.'",
        "'speaker_7': 'I regularly receive requests from my residents for weekly recycling. And when we first started talking about this, gosh, I think it was like maybe 18 months ago. I mean, it was really like four years ago before I was even elected, but 18 months ago that we really started to kind of have conversations about potentially moving this forward'",
        "'speaker_7': '. And so, you know, I sent I sent a survey every year to my community members to 20, I think like 4000, 24,000 households with a survey asking, you know, what are your priorities? What do you want to see your representative advocate for?'",
        "'speaker_7': 'And I will tell you, climate change issues and addressing climate change concerns was number four, behind only crime and safety, traffic and infrastructure and housing affordability, climate and safety. And this was over a thousand responses that we received.'",
        "'speaker_7': 'That's pretty extraordinary. And so I am in support of this tonight. Is it perfect legislation? No. But offering free composting, offering weekly recycling, offering an affordability program in recognition of communities that are struggling every day just to make ends meet right now offering.'",
        "'speaker_7': 'This is thoughtful legislation in a way that we sometimes don't.'",
        "'speaker_4': 'See thoughtful.'",
        "'speaker_7': 'Legislation. This has been vetted. It is extraordinarily thoughtful legislation, and I am absolutely in support of it and very grateful for all of that outreach and work that you guys did to get this done. So. Thanks so much.'",
        "'speaker_0': 'Thank you. Councilmember Sawyer, Councilmember Hines.'",
        "'speaker_3': 'I thank you. Council President. Councilmember Herndon, you are wasting your branding talent by being here on council. Since Councilmember Herndon gave a shout out to someone in the audience. I would also give a shout out to Jasmine Barkow, who sat right close to where Evan Dreier is now.'",
        "'speaker_3': 'I first learned of Pei's. You throw from eco cycling, specifically Jasmine back in 2017. I have been aware of this topic here in Denver since 2017. So Councilmember Sawyer's points is before I was even a candidate. Let's do it.'",
        "'speaker_3': 'I'm so happy to be here today where we can actually vote on this. We can have the discussion. We can have a vote. So I came to Colorado and here's my prepared statement. I came to Colorado for nonprofit start up, and I stayed for that rugged outdoor lifestyle.'",
        "'speaker_3': 'That's right. I stayed in Colorado because of access to our lovely planet. My first stop was in Boulder when I lived in a single family home. The trash bin was so small that effectively had to be recycled to ensure that my waste left the home each week.'",
        "'speaker_3': 'So I was shocked to learn that Denver had a deplorable deplorably low diversion rate. So many of us care about our relationship with the Earth, but for some reason that relationship ends when it comes to trash. Some of this is possibly because of the disconnect between waste and where it goes.'",
        "'speaker_3': 'It's an operational feat that our city hall is a way trash for hundreds of thousands of people each week. It's a logistical marvel that bins get collected like clockwork, even if we miss collections by a day or two.'",
        "'speaker_3': 'The sheer size of the engine required is impressive. But our relationship, our personal relationship with trash ends, when we put it in the bin, we don't see the landfills. We don't see the impact of trash for a planet or a wildlife.'",
        "'speaker_3': 'I think those organizations that are helping with outreach and education now, because we're recently getting more awareness about what happens to our trash. I'm excited that this particular program will help Denver kids with additional education. So how can we address climate change?'",
        "'speaker_3': 'As MISMO said, human behavior is difficult to change. So it's an important it's important that we align our city services in a way that encourages people to do the right thing. There are many of us who want to do the right thing, but currently can't because of our city's limitation.'",
        "'speaker_3': 'I want to compost. I could pay extra and and I actually sometimes use my neighbor's compost because we I live in a high rise with 55 units. And I think I don't know, at least a quarter of us have composting as well.'",
        "'speaker_3': 'But wouldn't it be better with economies of scale if we just had it on a more systemic level? But then there are also some of us who don't currently want to change waste collection. But a systemic change can help those folks understand what we that we can help our planet and still live a healthy and reasonably trouble'",
        "'speaker_3': 'free life. I do want to touch more specifically on concerns in District ten. Perfect ten residents have a concern that's prevalent in our district since the vast majority of my constituents live in large multi-family buildings. Effectively, as a couple of people have already said, District ten residents pay for trash collection but do not benefit from it.'",
        "'speaker_3': 'A lot of District ten folks are the people who are subsidizing the fees for the single family residents and for small unit buildings. This has been in multiple testimonies tonight, including from one single family homeowner who who believes it's unfair that that this person benefits from a system that others subsidize but cannot use.'",
        "'speaker_3': 'At the end of the day, we must do everything we can to save our habitability on our planet. Yes, this bill doesn't apply to 100% of all of Denver. Still, I would far prefer to move forward with 60% of our city, then act on 0%.'",
        "'speaker_3': 'Also, regarding the other ways we can help, we could help our planet. Let's do those two. Passing. This doesn't mean we can't immediately focus on addressing those other causes of greenhouse gases. And we are working on on other things like mitigating transportation's detrimental effect on our climate.'",
        "'speaker_3': 'Like the 50 to 80 trail and shared streets. Shared streets to get people out of cars entirely. Thank you for working on that study or EB incentives or more in the infrastructure or encouraging development that creates 15 minute neighborhoods so car trips can be limited or eliminated.'",
        "'speaker_3': 'We can, I would say, rock walk, but I'm going to say we can roll and chew gum at the same time. We can do this. We can do transportation work. We can do all the things at the same time.'",
        "'speaker_3': 'So I'll be voting yes for this. I hope my colleagues do as well. And happy St Patrick's Day.'",
        "'speaker_0': 'Thank you. Councilmember Hines. Councilor Pro-Tem.'",
        "'speaker_7': 'Torres.'",
        "'speaker_4': 'Thanks the president. And just a huge thanks to all the.'",
        "'speaker_7': 'Speakers tonight and everybody who's been engaged.'",
        "'speaker_6': 'As we've been.'",
        "'speaker_7': 'Navigating this through committee. One of the speakers tonight pointed to a pretty key issue.'",
        "'speaker_4': 'That those who can't afford this should pay for it. Eventually, we'll all pay. But next time, it won't be about money.'",
        "'speaker_7': 'That that really hit home for me.'",
        "'speaker_4': 'We can't keep waiting on this. I appreciate the reality that Brian brought to the discussion that.'",
        "'speaker_7': 'We may have to adjust and accommodate.'",
        "'speaker_4': 'Over a few years.'",
        "'speaker_7': 'Everything to extending an adjustment.'",
        "'speaker_4': 'This proposal has made great strides to not overburden low income households in a way that I haven't seen before in a steady program or fee based structure. Denver's bigger, and it has just a huge growing divide. Those who can pay should pay.'",
        "'speaker_4': 'My grandmother passed away last month. She was on a fixed income, Social Security income. She would have qualified for the full 100% instant rebate. So this program started tomorrow and she was alive. She would experience no change from today.'",
        "'speaker_4': 'Our lowest income households will have options, but it does put a huge onus.'",
        "'speaker_7': 'On the city to ensure that.'",
        "'speaker_4': 'They are not having to jump through major hoops to figure it out. The median household income in District three for Villa Park was just over 38,000. Westwood 34,000. Lincoln Park 34,000. And Valverde 35,000. Perhaps half of these neighborhoods will qualify, and we need to make sure that they get signed up correctly and appropriately.'",
        "'speaker_4': 'And because I remember I remember correctly when composting was first rolled out, it actually wasn't available in our district. So it isn't a surprise that we have some of the lowest numbers. But what it does not mean is that it's not something we don't care about in our district or that we would struggle to adjust to and'",
        "'speaker_4': 'champion.'",
        "'speaker_7': 'We weren't given the early.'",
        "'speaker_4': 'Opportunity to do that. I think as a city we've definitely dropped the ball. On encouraging composting when it was made available citywide or outreach needs major work everywhere, though not just in this program area, and it's honestly where community based organizations have stepped in.'",
        "'speaker_4': 'Groundwork, Denver revision and perhaps have been more successful. What I don't want to see, Dottie, is that we lean on our.'",
        "'speaker_7': 'CBOs to help the city.'",
        "'speaker_4': 'In things that are as is our responsibility. Signing up rebate, qualifying households. I think they can be more successful than.'",
        "'speaker_7': 'Us in engaging on deep.'",
        "'speaker_4': 'Educational efforts. But environmental stewardship is not a new concept in District three or community cares deeply about environmental justice and and wants to step up to that plate. I think avoiding this only further protects households that can pay $9 a month but doesn't want to.'",
        "'speaker_4': 'So I'd rather have a more sophisticated system and not charge our lowest income homes. And I think this accomplishes that.'",
        "'speaker_7': 'I will be supporting tonight and I also support knowing that.'",
        "'speaker_4': 'The outreach that we have to do is significant.'",
        "'speaker_0': 'Thank you, Madam President. Councilmember Flynn.'",
        "'speaker_5': 'Thank you. I couldn't hear over that echo. If I could just take 1/2 to say something I should have said at the start of the meeting for folks who are in the room, have been here for a long time, they might have noticed the doors to the chamber.'",
        "'speaker_5': 'I just wanted to point out that late last year we named this room for the late councilwoman Cathy Reynolds, the longest serving council member on this body. And just over I guess over the weekend or before Friday, they painted her name on the door.'",
        "'speaker_5': 'This is the Cathy Reynolds City Council chamber. And I just want to make note of that. Thank you. I should have said at the beginning, but first of all, on this, I want to I want to dispel a false dichotomy that could easily get baked into the discussion unless we push back on it.'",
        "'speaker_5': 'Supporters of this proposal believe that it is needed in order to increase Denver's diversion rate from the landfill. And that creates that that a fee is needed to increase the diversion rate. And that creates a false impression that if you don't support the fee, then you must not support increasing diversion from the landfill.'",
        "'speaker_5': 'That is untrue. All of us who will end up opposing this program the based on the fee. We also believe that we need to increase diversion. We simply believe that the fee is not a necessary tool to achieve that, that in fact, it is a deleterious factor to our cost burden households.'",
        "'speaker_5': 'Until and unless, as Councilman Herndon said, we do the public education that has never adequately been done. Repeal the compost fee. Provide 95 gallon recycling cards to our households by default rather than the smaller ones. No wonder people want weekly recycling their fill in the smaller carts given the bigger cart.'",
        "'speaker_5': 'It costs less money, lowers our carbon footprint, and doesn't burden our struggling families with higher costs to live in this city. I disagree with one of the speakers who said that if we oppose this, we must want the status quo.'",
        "'speaker_5': 'We don't want change. We do want improvement. We just don't find that the fee is required to do that, especially at this time. But if we go ahead and institute the fee, followed by robust education, mandating diversion through that initiative that's on the ballot, mandating diversion through large from large multi-family commercial businesses, we will end up with'",
        "'speaker_5': 'a higher diversion rate, but and some folks will declare victory by giving credit to the fee, when in fact the real reason will be the changes that will be made by the Citizens Initiative should it pass to mandate a diversion from the biggest contributors to the waste stream, which is large multi-family, commercial and construction demolition.'",
        "'speaker_5': 'Also, with regard to the many remarks we heard about the large multifamily subsidizing single family and small multifamily, I need to make something very, very clear about the nature of this town. The portrayal of single family households as being affluent may be true in some neighborhoods, but in southwest Denver and I suspect in some of the other'",
        "'speaker_5': 'districts of which I'm not overly familiar in southwest Denver, they tend to be much more humble. We have some we have some pretty high valued homes in some areas of my district, but they tend to be much more humble.'",
        "'speaker_5': 'I've been in Margaret's home. I've been in Rosario's home in Brentwood. They came down here from Brentwood and 1940s, postwar neighborhood, wood frame bungalows that very well could be ground zero for gentrification. Part two. They came down to testify about the hardship this will cause them as fixed income seniors.'",
        "'speaker_5': 'They are not among Denver's affluent. Many of whom in fact, do live in luxury multifamily developments. They live in high rises downtown and elsewhere. So let's not make this about class warfare, please. There are poor households in many of our single family neighborhoods.'",
        "'speaker_5': 'As Councilwoman Torres just outlined in her district, just as there are wealthy households in multifamily neighborhoods and high rise condos in the modern luxury apartments in this town. So let's let's be clear on that. And even with that inadequate public education on this, many of our customers in the residential trash program already are doing what we ask'",
        "'speaker_5': 'of them. My constituents have expressed frustration to me that after recycling sometimes with two bins and composting, they're going to be charged now after doing the right thing. I've heard from seniors who put out their trash cards only once, only once every several.'",
        "'speaker_1': 'Weeks.'",
        "'speaker_5': 'Because they generate so little and recycle so much. It's not an incentive to do better if you're doing all that you can and you still have to pay. There is no opt out here. I've had constituents who have been doing what we asked of them tell me that they're now going if they're going to be charged for'",
        "'speaker_5': 'the black card, no matter what they do, they might as well just toss everything in it and not even bother recycling or composting. A few weeks ago in committee, I showed my slideshow tours of the apartments and commercial dumpsters in my district.'",
        "'speaker_5': 'They were overflowing with more than half of the waste in them being recyclable or compostable. I cannot ask the people who already are largely doing the right thing by filling one or two recycle bins to pay up to 252 bucks a year.'",
        "'speaker_5': 'While we are not mandating diversion from the 82% of the market that throws such an enormous amounts of needless waste into the landfill. I cannot ask people who are struggling with eight and a half percent inflation. $5 a gallon gas.'",
        "'speaker_5': 'The prospect of higher utility bills through Excel's upcoming time of day pricing, plus more fees potentially on this November's ballot to pay up to $252 a year. For this, large families with lots of kids will be hit the hardest.'",
        "'speaker_5': 'I believe this is a terrible thing that we're doing tonight to the struggling families of this city. Most of them are already doing the right thing with recycling. And if we remove the fee from composting, more would join them.'",
        "'speaker_5': 'We often talk up here about how expensive it is to live in this city. Yet here we are, adding to the cost burden for many of my struggling families. My vote tonight is with them. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. Councilmember Cashman.'",
        "'speaker_3': 'Thank you, Madam President. Let me start a thank Ms.. Attention, Ms.. CdeBaca, for being here. And I wanted to comment that no matter how this go goes or what you hear or how individuals vote, I believe your request for a heart is is taking place in all of us.'",
        "'speaker_3': 'I know. I know it is with me. And I've talked to almost everybody on the dais and I believe it is with them. I have. I'll thank Dottie and Casa.'",
        "'speaker_5': 'And the mayor's office.'",
        "'speaker_3': 'And all my colleagues, just about. I have struggled with this vote as much as any I've had on city council. That said, I want to be clear that I do not struggle with the science. I believe that climate change is not only an existential threat, but a clear and present danger.'",
        "'speaker_3': 'We're not trying to ward off its effect. Its effects are already upon us. We see it with ever increasing high temperature swings. The intensity of our storms are forest fires. The flooding is a new to to us. I spent.'",
        "'speaker_3': 'If you don't think climate change is upon us. I spent several days this past week at the Colorado Municipal League conference and spoke to the police chief in La Habra, a 900 person municipality in the San Luis Valley, spoke with the city manager of Alamosa and he was the mayor of Kersey out on our Eastern Plains and'",
        "'speaker_3': 'talking to them about not having enough water. I spoke with our friends in Boulder County about the fires and the devastation they're trying to recover from. And then I sat and spoke with our colleagues from Denver about our air that is is falling behind clean air guidelines on a far too regular basis.'",
        "'speaker_3': 'That said, I certainly do struggle with adding a fee to the program being proposed. I don't believe that we will have the full cadre of drivers that we need when this rolls out. We won't have all the bins on implementation day.'",
        "'speaker_3': 'We have not put forward the education that we need to put forward. There is no question that we have pitfalls that need to be addressed. The our financial situation, our economy is having historic problems. I pay the same gas prices y'all pay.'",
        "'speaker_3': 'I pay the same increase in grocery fees and all that. But the news about climate change gets equally as bleak every day. The studies. Our science is becoming more and more urgent. The time frame for for mitigating climate change is getting shorter and shorter and shorter.'",
        "'speaker_3': 'One of my colleagues I have respect for my colleagues, but my good friend, Councilman Flynn, spoke at one of our last sessions about the small percentage of change that Denver will make in the greenhouse gases in the worldwide atmosphere.'",
        "'speaker_3': 'If we pass this program and I never do math on the fly, but I'll trust his math. But while Denver's reduction in global greenhouse gases may be a small percentage related to what the world must do, it will be 100% of what we can do in reducing our landfill contributions for 180,000 Denver households.'",
        "'speaker_3': 'If people participate as ardently as they can in Denver, we're not an island. You know, I certainly saw this at the CMO conference. Denver is high profile. In our state, it's our high profile in our country and we're nationally recognized.'",
        "'speaker_3': 'So while our individual contribution may be renewed on one level, people are going to follow us. Whatever we do, we see it. And we saw it recently in the gun bills that we passed and watched our friends in the front range follow us.'",
        "'speaker_3': 'If we move forward with this bill, people will follow us and our contribution to reduce climate change will be magnified if we fail to lead. If we fail to act, it will give justification for some people to not act.'",
        "'speaker_3': 'And again, we reduce our efforts to control climate change. And. I know that again, as has been emphasized, it's going to be a rocky ride. I believe it's going to be a rocky ride rolling this out. I do.'",
        "'speaker_3': 'I don't believe it's going to be smooth. It reminds me a few years ago some lives in Juneau, Alaska, and he got sick. And my daughter and I, right at the beginning of the pandemic, had to fly up there.'",
        "'speaker_3': 'If you have ever flown into Juneau, Alaska, on a good day, it'll get your attention or scare the pants out of you. It was bad weather. It was snowing and we were bouncing and we had to get there.'",
        "'speaker_3': 'And I feel the same urgency about the climate. We got to get there. The people I talked to around the state of Colorado, this is not something we can delay. I think I don't want to carry on too long.'",
        "'speaker_3': 'In short, I think it we're serving our citizens better. By acting now, then waiting a year or two years. We don't know what our timeframe is. As I was talking with one of our colleagues who will go nameless at the conference and we we were talking about getting older.'",
        "'speaker_3': 'And I think it applies to this discussion. And this fellow's a golfer. And he said, yeah, you know, you know, you're on the back nine. You just don't know what hole you're on. And I believe that's where we are in climate change.'",
        "'speaker_3': 'And everything that I read tells me we're heading towards 16, 17 and 18. We do not have time to mess around. I think we're better served by passing this. The pain there is definitely going to be pain for some of our families.'",
        "'speaker_3': 'There's no question. I'm not going to minimize that. I'm not going to minimize the impact. But if if we wait and think and think of the economic impact we're all going to feel when Colorado ski areas don't have the snow and they're worried about it.'",
        "'speaker_3': 'I talked to people from Breckenridge. They're worried about the declining snowpack. And when the tourist dollars stop flowing in to to our general fund, what's the pressure going to be on our families then? Like I say, I have not heard I disagree with some of my colleagues.'",
        "'speaker_3': 'I have not heard anything set up here that I think is is is silly or not worth consideration for sure. But after a great deal of consideration, I will be supporting this bill. I will be all over Dottie to get those drivers.'",
        "'speaker_3': 'I mean, we're all in this together. It's for real. I've got a bet with Mr. May here. He's going to owe me dinner, and I will guarantee that. But, I mean, we're all going to need to pitch in.'",
        "'speaker_3': 'The education has got to be there. And the last thing I wanted to I'm not going to call out but call on is our mayor. We happen to have a mayor who is. A spectacular speaker. If you have not heard him at the annual Martin Luther King event, he will get your attention.'",
        "'speaker_3': 'He is a great cheerleader. You'll see him. If you are out there at the AB celebration, he will get you riled up. He needs to step up and be our voice. You know, those of us who are somewhere around my age will remember when Jimmy Carter, first person I ever heard of that they cared about climate change'",
        "'speaker_3': ', you know, put on a sweater and turn your thermostat down. And people did. And people did. And I keep saying last thing, I promise this will probably, probably be. But as to what is the motivation? You know, we.'",
        "'speaker_3': 'I like to guard the lawns to be green. But Denver water, as Mr. Khan said, changed from flat rate to charging for what you use. And so we figured out a way to not use so much. We'd like to be warmer in the winter and cooler in the summer, but we pay more.'",
        "'speaker_3': 'To excel. So we figured out a way to do that. You know, we want to eat better at the grocery stores, but we have a budget and we figured out a way to do that. I remember before climate change was ever mentioned, my father was all over us.'",
        "'speaker_3': 'Turn the lights off and turn the heat down to keep the build down. Okay. And I believe that that motivation will work. Thank you. That's all I have. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Cashman, Councilmember CdeBaca.'",
        "'speaker_4': 'Thank you. I commend everyone who spent time working on this issue and climate crisis issues in general. This is something I'm very passionate about. I'd like to thank the Elders, specifically those who spoke tonight, as well as elders whose ancestors were probably the more harmonious with the planet of all of us.'",
        "'speaker_4': 'We don't often get diverse perspectives on an issue that's been so dominated by conversations rooted in white savior ism and is so deeply rooted in colonization and capitalism generally. I speak to you as someone who spent many years trying to convince environmentalists that environmental justice is different and will be the only way we can heal our planet'",
        "'speaker_4': '. We're a country that was once stewarded by indigenous people who lived in harmony or non exploitative relationship with our mother Mother Earth. When this land was stolen to extract its resources in service, in service of capitalist profit, our ancestors were punished and killed for their spiritual and practical relationship with this planet.'",
        "'speaker_4': 'Our planet presented only one opportunity to colonizers and capitalists, and that was profit. From living in harmony with the land. My ancestors were forced onto the most poisoned land among us due to others dis harmonious relationships with the land.'",
        "'speaker_4': 'We've historically suffered the consequences. So we certainly want and expect changes to just not in a way that ignores us in a continued fashion. I heard a commenter say people don't bat an eye out water cost increases. I strongly encourage that person and all people to learn about the racist history of water rights in this city.'",
        "'speaker_4': 'Today, people do bat an eye at cost increases of all natural resources, including and especially water. We just don't pay attention to them in these conversations. We literally have people who can't and will not even take advantage of our free trees because of the costs associated with watering them that they cannot afford.'",
        "'speaker_4': 'This is not different. People want to do the right thing. We need to make the right thing to do. Free the right thing here. Is an example of perhaps reimagining public safety in our city and our budgets. A public safety budget should prioritize paying for behaviors that make us all safer from the harms of continued planet degradation'",
        "'speaker_4': '. We're literally doing the thing that put us in this situation to begin with. We're putting a price on doing good for each other and our Mother Earth. There's no dispute here about what we want to do. We all know we need to divert waste from landfills.'",
        "'speaker_4': 'We just do not agree on how we do this. Those of us who can afford to pay should, including those who are disproportionately responsible for waste generation, including the corporations and developers. Coming from someone who was raised in poverty.'",
        "'speaker_4': 'I don't struggle personally with upcycling or recycling. I'll use the month for ten different things. I'll go to the segment before I buy anything new. I'll shop in my friend's waste piles and make things brand new. And most of my neighbors will and do as well.'",
        "'speaker_4': 'What's not okay is pretending that we're doing some magnanimous or righteous thing while ignoring those who literally do not have two pennies to rub together. Those people exist here in Denver. The blatant denial that those people exist is the problem with this proposal and the privileged advocacy that ignored all of the ways to make this more doable'",
        "'speaker_4': 'and more enjoyable for everyone, because this cannot feel like punishment if we're going to do it right. Healing our planet requires us to feel joy and connection while we're doing it. Have you ever tried to make something grow?'",
        "'speaker_4': 'Well, if you have, then you know that joy and loving intention matters. We cannot punish people for not being able to afford to do this. We need to remove the cost entirely. Leans on. The poor are not in alignment with the spirit of healing our planet and should in no way be a part of a proposal that'",
        "'speaker_4': 'so many people feel so good about. I agree that the taxpayer and voter should have a voice in this, and fortunately, at least the most important component they will get to vote on with the waste and the more ballot initiative.'",
        "'speaker_4': 'I agree that we should be ashamed of all of our dirty little secrets in Denver that contradict popular false narratives about how green we are or how liberal we are, or even how welcoming we are. There are metrics that are appealing, like being the types that are important for us to pay attention to, like being the top'",
        "'speaker_4': 'six city, displacing Latinos and the second top city gentrifying or displacing all people. Those are important to factor in here. The green cans as a visual cue that were somehow superior won't be enough to grandstand the other visual cues of more trucks on the roads picking them up.'",
        "'speaker_4': 'So, yes, please. Let's listen to the speaker who talked about one stop for several households versus individual stops. That was a great argument for returning to dumpsters where we can all do this as a collective and be as efficient as she points out we should be.'",
        "'speaker_4': 'I hope we search for a better visual cue of planet and community health. One that's not just green plastic bins. I hope that everyone who wants to make our metrics match our values does all that they can to make sure that our recycling doesn't just get dumped into other sacrificed communities.'",
        "'speaker_4': 'I hope that everyone here who wants to talk about leadership takes it upon themselves to stay connected to the body so that you as an individual can help monitor homes that are struggling to pay and pay yourself for them, or raise funds for those people or help them get enrolled in the rebate program.'",
        "'speaker_4': 'Because we certainly do not have the staff capacity in the city to do the basic things, let alone an extra eligibility testing program. Above all, I hope everyone in here takes this same passion to the corporations and the developers generating the largest share of waste in our city.'",
        "'speaker_4': 'This is tough for me tonight, living in the most polluted zip code, in a zip code in America that also happens to be one of the most vulnerable to involuntary displacement. Every fee matters. I don't want to support an ordinance that makes the most vulnerable an afterthought as usual.'",
        "'speaker_4': 'I don't want to ignore those who act and actually not build collective wealth in this city because there are a bunch of us who have not built collective wealth. I do not want to support a policy that will put leans on people's homes if the fees go unpaid.'",
        "'speaker_4': 'And I don't want to support an ordinance that doesn't have a plan for assessing impacts. I don't want to support a proposal that didn't try to just give us free composting to begin with. I really think that's where we should be beginning if we want to change behavior.'",
        "'speaker_4': 'And I'm not sure where I will be on this vote tonight at a time like this. I'm just not sure another new fee will serve our residents as intended. That's it for my comments. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember CdeBaca, Councilmember Sandoval.'",
        "'speaker_4': 'Madam President. Just want to thank all the speakers and everyone who's worked on this ordinance. I don't think it's easy when we talk about. Implementing any fee in the city and county of Denver, especially in a place where I was born and raised and it's getting more expensive to live.'",
        "'speaker_4': 'But as I was contemplating and thinking about this ordinance and thinking about hearing from my constituents, Albert Einstein popped into my head and Albert Einstein said, We cannot solve our problems with the same thinking we use to create them.'",
        "'speaker_4': 'And in Denver, we do not charge for trash, and we have not. And so I believe that we have to come up with new solutions to come to face the issues that are plaguing our world. We are in the middle of a crisis with our planet, and I hope that we can all live by the same that'",
        "'speaker_4': 'our indigenous people taught us that my grandpa, who is native to this non Navajo, that we are stewarding this for the next seven generations. So with this vote I will be voting for the next seven generations and my generation will be impacted by the fee.'",
        "'speaker_4': 'And I will do everything possible in Council District one to ensure that we do what we can to make sure people are using the smallest black container. So that's $9 a month. So it's not 200 and some dollars, as my colleague, Councilman Flynn said.'",
        "'speaker_4': 'So with that, I hope my colleagues vote yes and vote with the next seven generations of Democrats. Thank you.'",
        "'speaker_0': 'Thank you. And Councilmember Sandoval. Councilmember Kinney.'",
        "'speaker_7': 'Thank you. Council president. I first learned of this policy from members of the community. They educated me on their desire for us to do this differently. These community members hassled. The mayor's office went from agency to agency. When Councilman Clark got elected, they started to hassle him.'",
        "'speaker_7': 'This policy was actually born of community, and I want to thank first and foremost that community, the speakers who are here tonight. As of today, council has received more than 300 emails in support of this policy. Unfortunately, our email filter continues to eat the vast majority of them.'",
        "'speaker_7': 'I uploaded hundreds last Monday and we got hundreds more today that I didn't have time to upload. But that support has come from every district, every one, every single district in this city. The Climate Task Force, Food Policy Council, all the community leaders from groups like ECOSOC or Cobourg, Sierra Club, dozens of organizations, 350 that signed on'",
        "'speaker_7': 'letters, just that community is what brought us this policy. This isn't the city doing something to the community. This was the community demanding that the city do something for the climate and the city. Taking a minute, but responding.'",
        "'speaker_7': 'That's what this represents. I want to thank the city folks that were involved, my dear partner, Councilman Clark, Grace and the cast, your team, Adam and everybody at Dottie, the mayor's office that was involved, my own aides, Teresa and Jamison, who educated dozens of residents with questions.'",
        "'speaker_7': 'So thank you to all the parts of the team that responded to that community demands and helped bring us here today. So I want to start with a quote from Jane Goodall. You cannot get through a single day without having an impact on the world around you.'",
        "'speaker_7': 'What you do makes a difference, and you have to decide what kind of difference you want to make. Every single week. Denver influences the behavior of 100,000 180,000 households. We give them a signal that is more powerful than any flier, than any tweet or any ad on a bus.'",
        "'speaker_7': 'Our signal tells them that we will charge them nothing to throw away an unlimited amount to the landfill. And our signal tells them that if they want to do the right thing, they have to pay up. Our actions speak louder than any of our words could.'",
        "'speaker_7': 'And in America, our dollar incentives speak louder than any advertising campaign we could ever launch. Our policy and our fee structure educate our residents very clearly. Every single day, our message is heard. And our residents have responded to the education we have done perfectly.'",
        "'speaker_7': 'They have thrown things in the landfill because it's free and they have not taken up composting because it costs something. Those results speak for themselves. They are the education program we've implemented over 20 years. So just to highlight a few things that we've discussed tonight, this question of equity.'",
        "'speaker_7': 'So I'm not just a champion for this policy for climate. I just have to say that I've spent more of my career to chagrin or some championing policies that fight income inequality. I sponsored the minimum wage with the administration.'",
        "'speaker_7': 'I sponsored the housing fund. I sponsored a number of things. I would not support a climate policy that I thought exacerbated or didn't take into account income inequality. It would go against every other piece of legislation I've ever run.'",
        "'speaker_7': 'That's not who I am and that's not where I come from. And I just you know, Councilman Torres said this more eloquently than I ever could about how this policy breaks new ground in considering and centering actually residents with the with the lowest income who are involved in this policy.'",
        "'speaker_7': 'Right. Who are involved in this customer base. But I really want to reference what other speakers said. Elisabetta, who lives in a condominium and described how her residents right are subsidizing the cost avoided by higher income median income homeowners and duplex residents.'",
        "'speaker_7': 'We had renters who live in apartments describing the inequity of our current system. So not only does this policy that we're voting on tonight center equity through the rebate program, it actually undoes some inequity in our current system.'",
        "'speaker_7': 'And I'll reference my comments and all the math I provided last week of how that subsidy works. The other thing that is built into this policy, it's a small piece, but I want folks to know about it is based on the inspiration of Councilwoman Gilmore and all the work to protect HRA residents.'",
        "'speaker_7': 'This bill includes a prohibition on fining residents for leaving bins on the right of way. It's the city's right of way. It's not the right of way. And they have no business charging fines and penalties to people for using the right of way, even if they think it's a day later than it should be.'",
        "'speaker_7': 'That's not their business. And this bill makes that clear and it protects them from any fees or penalties or fines for leaving bins on the right of way. I'm proud that that little piece is in there. A little piece of equity built in.'",
        "'speaker_7': 'I believe in science. And I do know that everyone up here believes in the science of, you know, the climate is changing. We don't have any climate deniers here, but climate science isn't the only science involved in this policy.'",
        "'speaker_7': 'There is empirical research right behind this policy. There is you know, we have some criticism here of weakly recycling. Here's the real math. Cities that do weekly recycling tend to see a 3 to 5% bump in recycling tonnage.'",
        "'speaker_7': 'Let me just quantify that. This was mentioned in passing in the presentation. We had 44,000 tons of recycling in last year. Okay. A 3 to 5% bump would be one 1300 to 2200 additional tons tons taken out of the landfill and recycled.'",
        "'speaker_7': 'That's math and that is science. And it is real. And it is documented from cities who've done weekly recycling. That's science. And I believe it. And it's behind this policy. We've also been sent empirical research and we've heard testimony tonight on folks like from Ryan Call and Sonya Hansen that documented the wide range of peer reviewed research'",
        "'speaker_7': 'that compared education only campaigns in the climate context to those that had economic incentives built in every study by real scientists of these policies, including in the waste context, found that economic incentive motivated more behavior change than education.'",
        "'speaker_7': 'That's real science. I believe in science, and it's behind this policy. Now, that said, I believe it is our job to listen and respond. I appreciate it. Councilman Cashman acknowledging the need to have hearts and understand and those who described our obligation to respond, monitor and adjust this policy where needed to ensure that its heart stays centered'",
        "'speaker_7': '. And I also appreciate the concerns our colleagues have raised about better and different education. So it is important for our agency implementing this to do the things that have been asked of them. Right, to prioritize hiring and to do something fundamentally different with education.'",
        "'speaker_7': 'You've heard that message. Councilman Clarke and I have requested and invited ourselves to a monthly briefing on implementation to ensure that we carry that message that you all have raised forward. So we want higher profile education, more values based education, and more education that links these things to climate than we've seen from Daddy in the past.'",
        "'speaker_7': 'We want something unlike what you've done in the past. That's the expectation, and we'll be around to help you deliver. But really, tonight, the decision's up here. We're faced with a simple question Should we take action to reduce the climate impacts of our customers solid waste habits right away?'",
        "'speaker_7': 'Should we or should we not? I want to just close with one more quote, which is from Greta Thunberg. Everything needs to change and it has to start today. Everything needs to change and it has to start today.'",
        "'speaker_7': 'Not some things need to change, not just other things need to change. Not just bigger things need to change. But everything's. We in Denver were part of everything. The climate does not care if greenhouse gases come out of a tailpipe or a smokestack or a cardboard box in a landfill.'",
        "'speaker_7': 'It is agnostic. Our waste is part of everything. And tonight it appears, based on my accounting, that we do have the votes to do something and to do a reduction in greenhouse gases. And I'm excited to vote yes to be a part of that tonight.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Kimmich. And seen no other speakers in the queue. All Fine. I'll finish out our conversation tonight with my comments. I do want to thank the community members who spoke this evening, who sent us emails, who spoke at community meetings.'",
        "'speaker_0': 'I'd like to thank my colleagues for all the work that you have done to find compromise and try to get us to this place. And this proposal and vetting process has been very challenging and difficult for my constituents and me.'",
        "'speaker_0': 'I co-founded a nationally recognized science based nonprofit over 26 years ago. I have a degree in zoology and chemistry, and I've worked as a wildlife biologist for state agencies. I understand the science and I feel the same urgency as the speakers and my colleagues.'",
        "'speaker_0': 'I would be an easy yes vote on this if it was only my voice and and my values I was voting on tonight. But that is not the case. As the elected representative for District 11, I must consider and bring forward the concerns, feedback and voice of my constituents who I represent.'",
        "'speaker_0': 'To be clear, we are going to have to do something like this sooner than later. There are going to be additional policy discussions around climate. But as I have attended and participated in many community meetings in regard to this topic and in listening, truly listening to my community, it is clear that because of a lack of education'",
        "'speaker_0': 'and outreach, along with inflation and the cost of living, I have had overwhelming opposition to this in my district. The gravity of climate change insists that we must have our constituents along with us on this journey. The current education plan shows that there are many gaps in the overall lack of education.'",
        "'speaker_0': 'Montebello in the past had the highest water usage in the city. I know that because Denver Water came to my prior nonprofit and asked us to help star an education campaign to mitigate the water usage. Turns out the city allowed developers to build homes in Montebello, a historic African-American community, without requiring them to amend the soil, which'",
        "'speaker_0': 'is very, very sandy. In order to conserve water. But Denver water created an education campaign. Use only what you need and through ongoing educational programs. We started to fix that high water usage through different tactics and techniques, by working together as a community.'",
        "'speaker_0': 'In communities of color, decades of systemic injustices have contributed to a lack of access and knowledge in regard to climate change education. To me, not including a robust educational campaign contributes to those systemic injustices and purposely leaves low income people and communities of color behind and out of the process.'",
        "'speaker_0': 'The composting participation map shows a clear delineation between the far Northeast District 11 and the rest of the city. The horrible effects that COVID had on our residents, either through lack of access to health care, food or housing insecurity, loss of employment.'",
        "'speaker_0': 'Not to forget family members, illness or death. Simply put, we have been dealing with life and it shows there hasn't been the participation. And with no coordinated or consistent marketing for composting or recycling. We unfortunately only have 126 customers in Montebello and 294 in GRT for composting.'",
        "'speaker_0': 'I'm proud to say that my family and Montebello are one of those customers, but I also recognize the privilege that we have in order to pay that $9 a month. I have heard from older adults, families and others in my district who are struggling to pay their mortgage, their car note to buy groceries, to pay for gas'",
        "'speaker_0': ', asking me. I've got to decide between buying medicine for my food for my child or food. How am I going to pay for this cost? We still don't have a good, solid answer for my constituents that are asking me these questions.'",
        "'speaker_0': 'The cost of inflation in this country has increased dramatically. Many of my constituents are feeling the financial burden of these unprecedented inflation pressures. City Council should hold off on the passage of this plan until Dottie and Casper can clearly articulate at least the year one goals which they couldn't do tonight.'",
        "'speaker_0': 'Thank you, Councilman Herndon, for that question. If we can't do it in the public hearing and explain that, how are we supposed to explain it to our constituents and get them involved other than charging them a fee? I'd like to see us build out a comprehensive outreach and education plan.'",
        "'speaker_0': 'I firmly believe that we need this education campaign and that we should wait for a new administration to set this up so that it can be rolled out properly. So we're not dealing with staff from the end of a mayor's term leaving mid-stream in the rollout of this program.'",
        "'speaker_0': 'I ask my colleagues to think about what I have shared with them. I share with Council member Kenny that I do believe you have the votes to pass this tonight. Either way, I am committed to representing my constituents, carrying their voice forward and and making sure that we ensure that we are mitigating our trash and that we'",
        "'speaker_0': 'are working. To mitigate all of the negative effects of climate change. But to be honest, this all started with the Industrial Revolution. And if we really think that we're going to flip this on a dime in the next 3 to 5 years.'",
        "'speaker_0': 'I would ask us to have a reality check because there are so many constituents who are living in our city that are worried about staying in their home, worried about paying for everyday items that a lot of the folks that spoke to tonight maybe don't have that same fear or that same reality.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 22, Dash 685, please.'",
        "'speaker_4': 'CdeBaca I'm very reluctant. No. Sandoval. I. Torres, I. Black. Hi.'",
        "'speaker_3': 'Hi.'",
        "'speaker_0': 'Flynn?'",
        "'speaker_5': 'No.'",
        "'speaker_4': 'Herndon?'",
        "'speaker_3': 'No.'",
        "'speaker_0': 'Haines.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Cashman. Kinney. I. Ortega. No.'",
        "'speaker_0': 'Sawyer. Madam President, no, madam Secretary, close voting and announced results. Five Nays. Ayes, Ayes Council Bill 20 2-685 has passed as amended our pre adjournment announcement on Monday, July 25th Council will hold a required public hearing on Council Bill 22, Dash 637 changing the zoning classification for 4710 North Stuart Street in Berkeley and a required public hearing'"
    ]
}