{
    "A resolution approving a proposed Contract between the City and County of Denver and B & M Construction, Inc., for construction of tenant space at Ellie Caulkins Opera House.\n (INFRASTRUCTURE & CULTURE) pproves a four-month $591,201.04 contract with B & M Construction, Inc. for construction of approximately 5,400 square feet of new tenant space on the third floor of the Ellie Caulkins Opera House (201627352). The last regularly scheduled Council meeting within the 30-day review period is on 7-18-16.  The Committee approved filing this resolution by consent on 6-16-16.": [
        "'speaker_1': 'Madam Secretary, please. First of all, you know the results. Ten tonight, final consideration of 437 has been postponed to the end of the public hearings tonight. All right. Our last one, 428. Councilman Espinosa, would you like for us to do with that?'",
        "'speaker_8': 'I just have some questions.'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_8': 'I don't know who if it's Lisa, somebody or somebody else. And I apologize again to my colleagues for not asking this as intended at the council, but where are these tenants currently located? Does anyone know?'",
        "'speaker_1': 'And you.'",
        "'speaker_8': 'And how many are there?'",
        "'speaker_4': 'Good evening. I'm in front of Denver Arts Venues Project Manager.'",
        "'speaker_9': 'Currently these are different. Divisions within our.'",
        "'speaker_1': 'Office are in three.'",
        "'speaker_9': 'Different locations. Some of us temporary.'",
        "'speaker_4': 'Temporarily relocated during the McNichols renovation, and this will consolidate all of our shared business services into a single office space. So it'll be a lot more efficient. Just as a side note, we're also rearranging this is current storage space, so we're rearranging that storage to make it more efficient as well.'",
        "'speaker_4': 'It's UN built out core.'",
        "'speaker_9': 'Space value engineering during the original renovation of the Lake.'",
        "'speaker_8': 'Hawkins. So, you know, it's.'",
        "'speaker_4': 'Haphazard right now, storage. And so we're making that much.'",
        "'speaker_8': 'More efficient as well. Where's the storage? Because it looks like the renovation is happening on the third floor. Where was the storage?'",
        "'speaker_4': 'It's the other half of the third.'",
        "'speaker_9': 'Floor, back of back of house.'",
        "'speaker_1': 'Space. I mean, it's.'",
        "'speaker_8': 'Looked at the plans and looks.'",
        "'speaker_4': 'Going up 12,000 square feet total in that storage area, the back of house area. And the office space that we're renovating is about.'",
        "'speaker_8': '5400 square feet.'",
        "'speaker_4': 'So the storage will take up the remaining square footage.'",
        "'speaker_8': 'Okay. And there are four directors offices there in an open office space? That's correct. What directors are they.'",
        "'speaker_4': 'Are executive director or deputy director or director of finance.'",
        "'speaker_9': 'And our director of marketing. And there is.'",
        "'speaker_8': 'A fifth office for our new hire.'",
        "'speaker_9': 'Newly hired chief operations.'",
        "'speaker_8': 'Officer. Okay. And is this a temporary or is this a permanent location? So no going back to mechanical. Correct. All right. Thank you.'",
        "'speaker_1': 'You got them? Yeah, I think I remember. Any other questions for 28 CNN? All right. Those are all the bills and resolutions that were called out. So all of the bills for introduction our order published were ready for the black vote.'",
        "'speaker_1': 'Councilman Brooks, we make the motion for us tonight.'"
    ],
    "A bill for an ordinance changing the zoning classification for 3800 Franklin St. (NEIGHBORHOODS AND PLANNING) Rezones property at 3800 Franklin St. from U-SU-A1 (urban, single unit, 3000 sq. ft. lot) to U-RH-2.5 (urban, row house, 2.5 stories) in Council District 9. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 5-25-16.": [
        "'speaker_9': 'Cole neighborhood. Did I get that right?'",
        "'speaker_1': 'No, you didn't, actually.'",
        "'speaker_8': 'Northeast Denver.'",
        "'speaker_4': 'That's brainwashing.'",
        "'speaker_9': 'All right. We'll carry on. The property is.'",
        "'speaker_8': 'Just over 12,000 square feet, and the.'",
        "'speaker_9': 'Owner's requesting zoning that would allow for residential infill development. Row, house variety. And the specific request is you are age 2.5.'",
        "'speaker_7': 'And we'll talk.'",
        "'speaker_9': 'A little bit more about that zone district. But first, some planning context for you. This is an image from the current planning process, which is the 38th and Blake Station area height amendments process. And you can see that various building heights ranging from 16 right at the platform tapering down to the lower scale existing residential areas in'",
        "'speaker_9': 'the Cole neighborhood are being contemplated and the idea is to step down and taper down from the greater heights to the lower heights.'",
        "'speaker_0': 'And you see at the Franklin Street.'",
        "'speaker_9': 'Which is just next to the highlighted property in yellow, is about where that transition takes place from the going down 853 down to the lower scale, two and a half storeys. So this property has been part of this.'",
        "'speaker_9': 'It's important to consider this larger planning context as we now have a public review draft of the 30th oblique stationary height amendments on the project website at which is Denver gov dawgs 38 Blake And this is in fact some of the graphics that were produced to look at this height.'",
        "'speaker_4': 'Progression and tapering.'",
        "'speaker_9': 'And this shows what could become the, the recommended.'",
        "'speaker_4': 'Heights in the.'",
        "'speaker_9': 'Amended plan. We're looking from the intersection of 38th. And Franklin, looking north northwest in the property, is just off to the right. It would be just.'",
        "'speaker_7': 'Behind the sidewalk here. You can see that.'",
        "'speaker_9': 'The the three and five stories relate more to this lower scale. And then in the background, you see more the the 12 and the 16. And so this is an attempt to be respectful and in terms of height and intensity down to the lower scale.'",
        "'speaker_9': 'And with this context in mind, here is the existing zoning today of the site and the area to the north and.'",
        "'speaker_8': 'To the east and to the south is a usou.'",
        "'speaker_9': 'A one or a single unit with 3000 square foot minimum, which allows for the urban house as well as the accessory dwelling unit. Some of the surrounding zoning to the West there is a lower skilled mixed use that you AMCs to and you mix two X as well as PD 17, which is a property just to the'",
        "'speaker_9': 'south which has that artist live work studio. And then there is also you are each three acre west across the Franklin Street, the requested zone district. You are each 2.5 promote safe, active, pedestrian, skilled residential uses and development and reinforces desired residential patterns such as shallow front yard setbacks, tapered building heights on the sides, and a limitation'",
        "'speaker_9': 'of one story in the rear 35% of the lot. And this is intended to fit in well within established residential areas in urban neighborhood context. Existing land use. You see much of the surrounding area to the northeast and south as single family residential, but there is multi-family mixed in.'",
        "'speaker_9': 'But this is at an intersection where it's been established as a mixed use node for some time.'",
        "'speaker_4': 'And the. Commercial block buildings that you see here.'",
        "'speaker_9': 'On the West. Our about turn of the century. And in fact, the white building was recently renovated and had boarded up windows for years and is now a beautiful.'",
        "'speaker_4': 'Renovated office building.'",
        "'speaker_9': 'So we.'",
        "'speaker_0': 'Also see.'",
        "'speaker_9': 'Industrial, the purple color, which is intended to become transit oriented development as we now have the rail station open and 30th. And Blake is active and busy with with transit riders. Here's a look at the station located in the center image you see or excuse me, the here's the property, the subject property at the site at 3800'",
        "'speaker_9': 'FRANKLIN Today, it's a vacant lot. At one time, it was parking for what used to be the Elks Lodge here in this renovated office building to the west. North. We have single family homes as well as to the.'",
        "'speaker_8': 'East.'",
        "'speaker_4': 'And to the south.'",
        "'speaker_9': 'This is the PD I mentioned with the it's actually a a historic church. It was converted to a residence as well as the live work operation, I believe, a photography studio today. The rezoning process has included public outreach to the Arnolds listed here, and applicant outreach to these registered neighborhood organizations has resulted in an initial letter of'",
        "'speaker_9': 'opposition from one resident expressing concern of the potential for too many units on this site. However, two letters of support suggesting that this is an appropriate infill opportunity.'",
        "'speaker_0': 'And as all of the written.'",
        "'speaker_9': 'And posted notice requirements have been met leading up to the Planning Board and to the hearing this evening at the Planning Board in April, there were two residents that spoke in favor of this rezoning application, including the resident just to the south across the street, and feel that this would be a positive investment for the community and'",
        "'speaker_9': 'an appropriate scale and use of this particular location. Let's look at the review criteria, beginning with consistency with adopted plans. Plan 2000 encourages infill development that is compatible with surrounding neighborhood character and context and providing for a range of housing types and prices.'",
        "'speaker_7': 'Blueprint Denver.'",
        "'speaker_9': 'Shows a future land use concept of single family residential. And defines residential areas as including a variety of housing types and is not intended to be 100% single family, but recognizes that that is the predominant. A residential type.'",
        "'speaker_9': 'So the question remains where and in what locations might other housing varieties be appropriate?'",
        "'speaker_8': 'And so we.'",
        "'speaker_9': 'Look also at other indicators in Blueprint Denver as well as the the land use context, which I'll cover shortly. This is also in an area of stability which can be is defined as maintaining area character while accommodating some new development.'",
        "'speaker_9': 'So one of the important indicators when determining where a. Variety of housing types besides single family could be appropriate. We look at street classification. The Franklin Street is a residential collector, and collector streets serve to connect neighborhoods and provide a balance between mobility and property access.'",
        "'speaker_9': 'But overall, move more. More person trips, including vehicle trips, bicycle and walking. Then a local street, which provides more direct access to two homes and properties. And then 38th Street is a local street providing access to. Two individual home sites and occasional businesses.'",
        "'speaker_9': 'So can we look at the mortgage? 2.5. Can the intent of this zone district, which is to promote the pedestrian skilled residential development to fit into this urban neighborhood context with these design standards that that help it blend into its surroundings.'",
        "'speaker_9': 'The review criteria Tues would be met as you are. Each 2.5 would result in uniform application of district building, form, use and design regulations and would further public health, safety and welfare by implementing recommendations in Plan 2000 and Blueprint.'",
        "'speaker_9': 'Denver. Justifying circumstance would be a change or changing condition of the property and its surroundings. These are listed here at the bottom of the slide that this is a vacant property, former surface parking area, and it needs to be put to beneficial use.'",
        "'speaker_9': 'And has has been really in a state of decline for some time. There have been recent updates to the commercial building to the West as new commercial office use. In fact, the same owner developer that is submitting this application actually renovated that building.'",
        "'speaker_9': 'And the neighborhood is very, very pleased with the outcome of that. And then the 30th employee commuter rail station opened recently. And so we have a very.'",
        "'speaker_4': 'Active rail station and many folks.'",
        "'speaker_9': 'Starting to use transit. With just a few minutes away from Denver, Union Station. And then as I mentioned earlier, that current 30th and Blake Hyde amendments planning process is at an advanced stage. And finally, we look at the consistency with neighborhood context and zone district purpose and intent.'",
        "'speaker_9': 'Urban neighborhood context is characterized as primary residential with a range of smaller scale uses. These can range from residential to even mixed use and commercial. This is within a street grid pattern that supports walking pedestrian and vehicle mobility and a strong presence of alleys.'",
        "'speaker_9': 'The Zone District you are. Each 2.5 promotes the safe and active residential uses reinforces desired neighborhood character consistent with the pedestrian scale and orientation in this neighborhood context. And the CPD has found that all review criteria have been met and we recommend approval of this.'",
        "'speaker_9': 'Application and planning board has also recommended approval. With about 10 to 1. Thank you.'",
        "'speaker_1': 'Thank you. All right. We have one speaker signed up. Sam Legare.'",
        "'speaker_4': 'Evening. It's Sam Ledger, and I'm the owner. Happy to answer any questions that any of you may have.'",
        "'speaker_1': 'Thank you. All right, that concludes our speakers. Now, time for questions. Do we have any questions from members of council? Councilman Espinosa.'",
        "'speaker_8': 'Sam, since you're a micro. Yeah. Sorry, Sam, since you're up there once again, you didn't have any designs at plan. I suspect at this point you also don't have any. Is that correct?'",
        "'speaker_4': 'We have not done any planning for the site.'",
        "'speaker_8': 'Great. So, Tim, I've got questions for you. What was the zoning prior to the 2010 rezoning?'",
        "'speaker_9': 'I'm going to have to get back to you on that.'",
        "'speaker_8': 'Okay. Wouldn't it have been single family if we went? US? You mean you want a one? Maybe our one and certainly not more than our.'",
        "'speaker_9': 'I didn't document that. I'll have to get back to you. All right.'",
        "'speaker_8': 'And then you noted that this was a mixed use node for some time as some sort of justification. But this stone district is not a mixed use zone district, correct?'",
        "'speaker_9': 'No. But it contributes to the mixed nature. How so? At this node, the properties to the West are have been commercial or public use kind of off and on, depending on the decade.'",
        "'speaker_8': 'And did that contribute to the the mixed use nature of that area.'",
        "'speaker_9': 'The buildings to the west, on the west side of Franklin at this node. Mm hmm. As well as the PUD, which originally was a church and then now a live work unit. So we see a variety of uses of small scale node mixed use.'",
        "'speaker_8': 'And so I'm just as a surface parking lot, would that not support the mixed use known as as is and its current sort of nonconforming situation? It did at.'",
        "'speaker_9': 'One time, but it's no longer needed for that.'",
        "'speaker_8': 'Purpose. Okay. It is needed for what?'",
        "'speaker_9': 'The parking.'",
        "'speaker_8': 'No, this when we move this from a single unit zone district to a higher density zone district. What's that? What's the logic there? What are we looking for?'",
        "'speaker_9': 'That in the blueprint. Denver Single-Family residential definition there can be predominantly single family homes, but a variety of housing types as well as smaller scale complementary commercial uses or mixed uses. And so we look at the street classification, which is this residential collector along Franklin, Right.'",
        "'speaker_8': 'But we also look.'",
        "'speaker_9': 'At land use context.'",
        "'speaker_8': 'Of that opportunity. According to Blueprint. Denver in the area of change across the street, correct? I mean, we already have existing. Buildings that are commercial, the ability to develop three storey multifamily housing across the street from this area's stability.'",
        "'speaker_8': 'So Blueprint Denver, does it direct? Does it suggest that that new development should occur in areas of stability or areas of change? Or does is it agnostic on where new development should occur?'",
        "'speaker_9': 'It suggests that you can maintain the area character while accommodating some new developers.'",
        "'speaker_8': 'So if we don't have a design, how do we maintain area character with this? Zone district.'",
        "'speaker_9': 'As I mentioned in the staff report in the presentation you are each 2.5 is intended to be consistent with existing character of an urban.'",
        "'speaker_8': 'Neighborhood. So once again, this comes up, this is garden court form allowed in this zone just as it is. And so the opposition letter concerned about the potential of number of units. Do we have as a city any sense about the number of units that we could occupy and put place on this site in a garden court'",
        "'speaker_8': 'for?'",
        "'speaker_9': 'They have not submitted a plan, so I have not conducted that analysis.'",
        "'speaker_8': 'It could be quite a few, considerably more than an S2 A-1 density. So then in I'm sorry, I just have to to ask, based on your presentation, you stated under the justice variance circumstances that this area is declined for some time.'",
        "'speaker_8': 'What is what do you mean by decline?'",
        "'speaker_9': 'I mean the specific piece of property that.'",
        "'speaker_8': 'So nice addition.'",
        "'speaker_9': 'Of the pavement is in decline and the the maintenance of the property is.'",
        "'speaker_8': 'Has not been kept up as a. But I mean you could develop it in the current zoned district and that would be essentially an improving. Could you go to the slide that has the number five under just different circumstances?'",
        "'speaker_8': 'So the next slide. If so, this is justified. You are age 2.5. If we were oddly, you know, reasoning to you are mean to the existing zone district. Which of these criteria here are these these characteristics? I mean, what are these called?'",
        "'speaker_8': 'Which of these things would not apply to the current zoning district?'",
        "'speaker_9': 'Well, let's be clear. If the applicant was. They already have a current zoning that allows for single family homes and their request is for you. RH 2.5 And that's our analysis. And so they could either choose to develop under the current zone district or if granted approval, then they could pursue.'",
        "'speaker_9': 'Development under RH two.'",
        "'speaker_8': 'It's just that these are sort of boilerplate responses. I mean, justifications for any sort of zone district in the stationary plan you showed, the massing are very well considered, you know, juxtaposition of the sue characteristic with the adjacent three storey commercial and then subsequent five and 12 or what have you.'",
        "'speaker_8': 'So you have a stationary plan that sort of allies itself with the I mean the overlays fairly nicely with this blueprint. Denver areas of change or stability. And we're clearly in an area of stability, the single family and we use these criteria to justify moving to a zone district in an area that is identified as an area'",
        "'speaker_8': 'of stability. But I can tell you, as a representative of Northwest Denver, once you once you put in the sort of density that a garden court form in an hour, 2.5, you've changed the character of that block. And so if the balance of the block is askew, there is going to be intrinsically I mean, you can put'",
        "'speaker_8': 'you can you change the quality of life that those residents have come to expect. Those those residents that live in a, quote, unquote, area of stability are now severely destabilized by something that could be built here. Certainly, he could build urban home forms, but the developer has made no attempt whatsoever to convey what he intends to build'",
        "'speaker_8': '. That's correct. And so, you know, I, I just wish we compelled in this sort of ask where there's an area of stability. There's the current zone district meets all the criteria that this this that you're attempting to justify this change, you know, without a change in doing that, doing know, just developing redeveloping in an ESA form, you'",
        "'speaker_8': 'know, allowable sue forms would do everything you were asking for improving this site and and and it's just I don't see how it makes how this rest this attempt to rationalize why it's acceptable to take an area that is clearly urban house.'",
        "'speaker_8': 'I mean, urban house forms in a small, lot zoned lot neighborhood and block that is clearly outside of an area of change and and put a high density potentially high density for such as the garden court on that.'",
        "'speaker_8': 'And so I'm bringing that up because you know council a new is now facing it. I've been facing it for some time this urban house thing. So I think that I want to go back to that slide, though, and the one that says five.'",
        "'speaker_8': 'So. Does. How how does the u. R h. 2.5 promotes safe and active residential uses any different than the current you.'",
        "'speaker_9': 'Well, they would be similar in that the form encourages vehicle loading and access from the rear, the alley and porches and entrances facing streets or garden court. But walkable and not interrupted by multiple?'",
        "'speaker_8': 'No. How is how does it do it any more than the current?'",
        "'speaker_9': 'They're very comparable, I would say, and that's just 2.5. RH 2.5 is intended to be compatible with.'",
        "'speaker_8': 'So how does now let's get into the next one then. How does this Joan district versus the skew A which is very consistent one very consistent with the forms that you see on the balance of the block. How does this you are each 2.5 reinforce the desired neighborhood character?'",
        "'speaker_8': 'They both do. Councilman how?'",
        "'speaker_9': 'As listed here, they they promote a form that is walkable, that has entrances, that activates the street parking to the rear along alley and the scale lower to the rear, reinforcing the patterns that we see throughout neighborhoods.'",
        "'speaker_8': 'So is the is the massing part of the neighborhood character or not? The height of the buildings, part of the neighborhood, character or not?'",
        "'speaker_9': 'It is. And there can be some variety to it as we read.'",
        "'speaker_8': 'So are you allowed to. Are you are you restricted to the same forms in a you are 2.5 on massing that you are in a us, you know. And so is it higher, considerably more massive or not?'",
        "'speaker_9': 'It is. Again, as Blueprint Denver suggests, there can be variety, including smaller apartments, townhomes. And yes, it's slightly higher. Row home slightly higher density and blueprint.'",
        "'speaker_8': 'Is now.'",
        "'speaker_9': 'Coverage densities not exact density.'",
        "'speaker_8': 'So what is pedestrian scale orientation is it S2 is in pedestrian scale and orientation the same for S2 zone district is it is for RH 2.4.'",
        "'speaker_9': 'I would say they are similar. And both compatible in an urban neighborhood context.'",
        "'speaker_8': 'Okay. Thanks for the question.'",
        "'speaker_1': 'Questions.'",
        "'speaker_8': 'Thank you, Mr. President. Tim, let me ask you a couple questions real quick. Tell me about the letters of support that you got here.'",
        "'speaker_9': 'Yes. One letter of support or I'll start with the letter of opposition came. When did you.'",
        "'speaker_8': 'Get a letter of support from the neighborhood?'",
        "'speaker_9': 'The R.A. we didn't get a letter collectively from, and there were more volunteered by individuals in the neighborhood.'",
        "'speaker_8': 'Who were they?'",
        "'speaker_9': 'There were three residents. And boy, if I need to call them by name, I may not be prepared to their names at the moment, but three call residents. One initially presented a letter of opposition. And. Just concern about increasing density.'",
        "'speaker_9': 'This came following a presentation to the neighborhood where we talked about the 30th and Blake Hyde amendments as well that.'",
        "'speaker_8': 'It did that that person change from opposition to support. Did you say the applicant reached out.'",
        "'speaker_9': 'To this individual and had a conversation and I believe their position.'",
        "'speaker_8': 'Let me let me let me ask the applicant real quick. So can you tell me about the folks in the neighborhood who may be supporting this?'",
        "'speaker_4': 'Yeah, we had several letters of support, one from the neighbor to the south who saw us through the building across the street. And then we had one from the neighbor behind us. Behind this project. Mm hmm. That was supporting it.'",
        "'speaker_4': 'We had one letter that they were concerned about parking, and we would talk to them about that. And even the you are 2.5 requires parking on the site. Okay. So they were so.'",
        "'speaker_8': 'Neighbors in the call. The neighborhood. You've done work before there and you talk about the the work that you've done across street.'",
        "'speaker_4': 'Yeah. We renovated the old Elks Lodge at 3801 Franklin and converted it into office space. And we had. Ten or 15 of the neighbors come in and just love what we did on the corner, that the corner has just been not active.'",
        "'speaker_4': 'It's been a vacant parking lot in a vacant, boarded up building. And a lot of the neighbors, you know, it was it was getting trashed and spray painted and they wanted to see something happen there. And they still do.'",
        "'speaker_4': 'The the building turned out great across the street. All the neighbors loved it. They're supporting a project, a five unit townhome project at 3811, Franklin, which is directly across the street from this project.'",
        "'speaker_8': 'What's that? What is that zone? They didn't. They didn't come in for a rezoning, did they?'",
        "'speaker_4': 'It's zoned you are you RH three A so it's okay and that's directly across the street. So this is actually a lower zoning that we're going after. That's right across the street.'",
        "'speaker_8': 'Thank you, Tim. Can you can you give just to set the context? Because, you know, I don't think folks really know where this is and understand the the larger movement afoot that is supported by the neighborhood to dramatically increase the heights in the neighborhood, because this is less than a two minute walk from the 38th and Blake'",
        "'speaker_8': 'Station. Eli. So can you kind of talk about the heights just I mean, not long, certainly.'",
        "'speaker_9': 'I've gone back to the planning context slide. I hope it's still on your monitors.'",
        "'speaker_8': 'Yeah.'",
        "'speaker_9': 'And this is one of the graphics that have been shared as part of the 30th and Blake Hyde Amendments process. And as I mentioned, there is now a public review draft of that Hyde Amendments plan. It primarily addresses heights.'",
        "'speaker_4': 'And.'",
        "'speaker_9': 'These are height increases that are proposed above what today is a maximum recommendation of eight and in some places 12 storeys, we see up to 16. And then what we've tried to work through very carefully with quite a bit of stakeholder and resident member input is how to transition fairly quickly over the course of of two or'",
        "'speaker_9': 'three blocks from six storeys down to the established residential scale of two and a half storeys. And that's why we spent considerable time and resources on producing these street level view graphics. There are some other views that were generated to really try to strike the right balance between the TOD opportunity and the respecting the established residential areas'",
        "'speaker_8': '. Great, Tim. And could you put your clicker if it go there on? Sam said across the street was the five. The three story. The three story, yeah. Just put your clicker on that just so that folks can see that.'",
        "'speaker_8': 'Okay, great. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Burks. Councilman Ortega.'",
        "'speaker_6': 'I have a question for Mr. Laker, if you wouldn't mind coming forward. Can you tell us what you plan to do with the site? So what is it that you will do with the new zoning that you couldn't do with the current zoning that's on the site?'",
        "'speaker_4': 'Part of the outreach that we did with the with the neighborhood organizations was a for you know, they want affordable housing in this area for sale product. And so we do plan to provide a for sale product, whether it's row home or townhome style.'",
        "'speaker_4': 'The current zoning just does not allow for any sort of affordable single family homes. The cost of the you know, the land up there right now is so high that you'd be looking at an eight or $900,000 single family home on this site.'",
        "'speaker_4': 'You could do four of those. If we change the zoning, we could.'",
        "'speaker_9': 'Probably get eight units.'",
        "'speaker_4': 'Give or take. You know, we haven't done the planning, but that's our estimate. And it would all have garage parking. And with that, we could get them to be a little more affordable and 50 or better, in my opinion.'",
        "'speaker_6': 'So when you say affordable, what kind of price range are you talking about?'",
        "'speaker_4': 'You know, depending on the size, you're probably looking at 300,000 on up, depending on the size. And again, we haven't done site plans. And and, you know, for now you're.'",
        "'speaker_6': 'Looking more at townhomes as opposed to.'",
        "'speaker_4': 'We're open to either one at this point. Like I said, we haven't spent the money on architects and designs until we know that we can.'",
        "'speaker_9': 'We have that opportunity.'",
        "'speaker_6': 'And in your mind, is that the max number that you could get on the site is eight.'",
        "'speaker_4': 'I think right around there. Yes.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman, I'll take a couple minutes. Hop over. You get to Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. I'm just wondering what.'",
        "'speaker_1': 'He makes of.'",
        "'speaker_4': 'Now here. Thank you. You've obviously had been thinking a little bit about your property, numbers of units and so on. Any thoughts as to style of architecture at all? One in your daydreams or chats with your people what what you're thinking?'",
        "'speaker_4': 'Yeah. I mean, we've you know, the area, in my opinion, is is lacking again, an affordable for sale product. There's a lot of apartment buildings going up. There's there's really no single family home development in the area. We're.'",
        "'speaker_4': 'You know, as far as specifically as far as what we're going to be building, I just, you know, probably a two, two and a half story town homeless, some rooftop patios, you know, something that's going to be inviting and want people to live there.'",
        "'speaker_4': 'You know, right now the current uses a vacant parking lot and it the neighbors hate it. You know, it doesn't do anything for the city. And as far as style of architecture, reminiscent of what's around or you really have no clue at this point.'",
        "'speaker_4': 'Yeah. I mean, we're our our our goal is to blended into the neighborhood. Okay. Thank you. I appreciate the answer.'",
        "'speaker_1': 'Thank you. Calvin Cashman. Councilman, that's M.G. Baca.'",
        "'speaker_8': 'So it sounded like Councilman Brooks knows about three neighbors that support the project. Is that correct?'",
        "'speaker_4': 'Yes.'",
        "'speaker_8': 'So what did you share with those three neighbors about the size, the number of units and the number of parking spaces?'",
        "'speaker_4': 'We haven't shared anything with them.'",
        "'speaker_8': 'Who they just.'",
        "'speaker_4': 'Support. They support reactivating that corner.'",
        "'speaker_8': 'So but they don't know anything at all about how you intend to reactivate the corner.'",
        "'speaker_4': 'They know that we plan to change the zoning to a you are age 2.5 which allows for townhomes or row homes.'",
        "'speaker_8': 'Do you know what? Do they know what that means as far as density is concerned and height and massing?'",
        "'speaker_4': 'Yes, they do. Or they probably wouldn't support it.'",
        "'speaker_8': 'But you don't you don't know how big this is. You don't know how many number of units to sell or know how many car parking spaces there are. You know, roughly that they're going to start at 300,000 and go up.'",
        "'speaker_8': 'But you don't know any specifics. But you're the three neighbors do. Is that correct?'",
        "'speaker_4': 'That's not what I said now.'",
        "'speaker_8': 'So what do they know about the grades 2.5 and what it allows?'",
        "'speaker_1': 'Councilman, I'm not sure if the applicant can tell what the neighbors know. I think he answered your question. I think your point is made, though. It's getting.'",
        "'speaker_8': 'No, he stated that they know what this allows. But you do they know that you're.'",
        "'speaker_1': 'Asking him what the neighbors know, which I'm not really sure he can actually express. So. Do you have a question for him? And I would also ask if we could not if we would not be disrespectful, in my opinion, if we disagree with what the answer is and just ask a professional question and get a professional answer'",
        "'speaker_8': '. Well, I again, you know that I represent District one and that my district I toured you specifically was 83% Latino, Hispanic when I moved there and 50% Spanish speaking. And if you go there today, you don't see that population.'",
        "'speaker_8': 'And they got fed a line of crap about what the potential of development was going to be and how inclusive that would be. This is not an inclusive property. When we re zoned this level, it wasn't inclusive as four units.'",
        "'speaker_8': 'It's not going to be inclusive. It's eight plus or minus and it's going to be plus. And this is this is what happened in Jefferson Park. This is own district. These forms, these townhomes, row houses were manipulated using the guard garden court form to isolate a woman by the name of Gail Wheeler.'",
        "'speaker_8': 'Again, I toured you. I drove you by her house. And so I'm sensitive to this form and what is allowed. And these developers that come in here and tell us, I don't know what the proforma on this project is.'",
        "'speaker_8': 'You don't go into development business without knowing some sense about what the capacity is before, during and after your proposed rezoning. I don't buy it. Thanks.'",
        "'speaker_1': 'All right. So then no more questions. We are moving to the comment period. Councilman Brooks Sierra.'",
        "'speaker_8': 'Hi, everybody. Well, I do know this neighborhood because I live up the street and I do know that we've seen work from this developer, an adaptive reuse mentality. I do know that there were several other developers that were going to develop this site and give them something that the neighborhood did not want.'",
        "'speaker_8': 'I do know that this individual came and presented Sam in front of the whole neighborhood, which the whole neighborhood is a lively, inquisitive bunch. And I do know that there were there is no one from the whole neighborhood who's very active in this room right now.'",
        "'speaker_8': 'And I do know that three neighbors next to this property was supported. So I will be supporting this not based on those reasons, but based on the criteria in which we do this in the in the city and county of Denver.'",
        "'speaker_8': 'And I also know that we've had we've had meetings meetings of groups of 300 people of. Neighbors, architects, developers about dramatically increasing the density in this neighborhood because without density, there is no affordability, without increasing the supply, without requiring affordability.'",
        "'speaker_8': 'You know, there is no attainable housing. And so this is a different context than the rest of the city. This is a context of the city where folks will come in and say, if there are design standards, if there are affordability measures, we will support density.'",
        "'speaker_8': 'That's what I know. So I'll be supporting this project.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilman Espinosa.'",
        "'speaker_8': 'So the criteria is basically met by any zoning district. There's a very low, low threshold. So I go back to the small area plans, stationary plan, anything else? Blueprint, Denver. And it clearly, clearly calls this out area stability.'",
        "'speaker_8': 'If we were talking about any property inside of the Massena study or where we've already re zoned to a higher density, you're not seeing me question this, but this is injecting a portion of what we have planned out and discussed for the stationary plan and putting it across the street.'",
        "'speaker_8': 'And if you go back to that slide, which I will call up because it's up there, you can all look at it. You see the green. That is the area where this three story is supposed to go. And you see that it blankets this gray area, which is a bunch of single family, one and two storey, two'",
        "'speaker_8': 'and a half storey structures with some non-conforming in the middle interjected throughout. And when you put this level of density on that corner, there are now six houses that are sandwiched between the potential development of that with rooftop decks and, and, and, and forms that go far into the lot, far deeper into the lot than anybody ever'",
        "'speaker_8': 'expected. And that is forever destabilizing for that block, which is an area of stability and is seeing existing single family homes and has been for a long time the longtime affordability there. And we're replacing this figure. But the good news is we're not losing any structures in the process.'",
        "'speaker_8': 'So this is great for that aspect. But we don't have a proposal. And so we we're just going on blind faith and there are good developers and you may be one of them, but the fact that you can't come to me and say, this is what we intend to do, I just.'",
        "'speaker_8': 'I don't. I expect more from our development community. They have the capacity. The tools, SketchUp tools, are free. The spreadsheet is Excel. I mean, this is not rocket science. I mean, this is easy money in these areas. And to invest the minimum amount to do that little bit of due diligence to help us and the layperson in'",
        "'speaker_8': 'the neighbor understand the impact of what you're doing before we just randomly justify going against this stationary plan and the stated proposed massing and the blueprint Denver areas of stability in areas change the circumstances. I mean, the criteria is not met.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilwoman Black.'",
        "'speaker_5': 'I just have a brief comment. This particular person who has applied for this rezoning, along with everyone else who has done it, have followed the rules to apply for a.'",
        "'speaker_2': 'Rezoning which don't require.'",
        "'speaker_5': 'Plans. So I really feel that it is unfair to hold them to that standard when it is not part of the rules that they have to comply with to file for the rezoning.'",
        "'speaker_2': 'So I appreciate the fact that you did come here and you did meet with people and that you did do what you were told to do. And I will be supporting it. So thank you.'",
        "'speaker_1': 'Thank you. Councilman, back. Councilman, mosey back up.'",
        "'speaker_8': 'I just want to say when there's direct plan support, again, you won't see me. QUESTION But there are two plans that clearly indicate something other as the future of this property. And yeah, you're not required in a rezoning application to put forward any idea or any notion about how you want to develop.'",
        "'speaker_8': 'But we as counsel only have to hear your rezoning request. We do not have to grant it. And that has been reiterated time and time and time again. So even if Planning Board comes back with a unanimous recommendation that this meets the criteria, we again are not obligated.'",
        "'speaker_8': 'That is a recommendation to to this council. And that power to make this change rests solely on us. And if we don't honor and respect the small area plans that we have and ask and compel developers to justify why the change is worthwhile, we will never get a developer coming in and justifying why that change is worthwhile'",
        "'speaker_8': '. Thanks.'",
        "'speaker_1': 'Thank you. Councilman Espinosa Council Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. I'm not where Councilman Espinosa is, but I'm not more than a shade away from it. It is frustrating it. I believe that when a developer purchases, purchases a piece of land and gets to this point in the process, they know very close to what they're doing.'",
        "'speaker_4': 'And so when to repeatedly have people come and say, I don't know. I don't know. You got a little bit closer, sir, and I appreciate that when the numbers that you think you're going to do, I. I think you probably have more that you would share with your buddies across the coffee table.'",
        "'speaker_4': 'You are not required by ordinance to do that. I think it helps this body make decisions. I think it helps establish relationships with community, etc.. I do believe that while I agree with my colleague Councilman Espinosa's evaluation that the bar, the justifying circumstances probably fit a variety of zones, including the existing one.'",
        "'speaker_4': 'I think yours probably does as well. What's more persuasive to me is that you've done work in your community and there's no one here in opposition to you. So those things combined. I'll support this, but I very much share Councilman Espinosa's frustration at having people give us less than their full truth.'",
        "'speaker_4': 'So with that, thank you. Appreciate it.'",
        "'speaker_1': 'Thank you. Councilman Cashman and Councilwoman Ortega.'",
        "'speaker_6': 'I was going to make similar comments to Councilman Cashman just made. You know, as a city, when we did Blueprint Denver, it was designed to look at the edges of neighborhoods and where development made sense, to be able to encourage that.'",
        "'speaker_6': 'But where we have single family character that is designated as areas of stability, then. Our our expectations and the goals of Blueprint Denver was to protect those single family neighborhoods. And that's the expectation of neighborhoods as well. This is a corner lot that, as you said, people in the neighborhood want to see activated.'",
        "'speaker_6': 'I'm not sure that eight units is the solution. I know the numbers have to work. The map has to work. And I see we have a couple of people from the whole neighborhood here. And had the neighborhood really been in adamant opposition?'",
        "'speaker_6': 'I know they would be speaking up and speaking in opposition. So that's the only thing that gives me some comfort that it's something the neighborhood supports. But I am concerned that as you begin to encroach into the single family, family fabric of the neighborhood with one project, then it won't be long before we see more coming in'",
        "'speaker_6': 'and wanting to buy up single family homes. We've seen that happen throughout my neighborhood. It's happened in many neighborhoods across the city where, you know, the zoning affords something higher density than what currently exists there. And so you have this, you know, sort of effect where where that starts happening.'",
        "'speaker_6': 'I think the fact that you have a reputation with the neighbors of doing quality work and you have a working relationship with them, that gives me some comfort in the fact that we don't have anybody here from Cole, which I know is a very active neighborhood, not speaking in opposition.'",
        "'speaker_6': 'So it's it's one of those where, you know, it's it's it's kind of that fine line because it is in an area of stability, although it's a parking lot, not a single family home. If it were a single family home, I probably would not be supporting it.'",
        "'speaker_6': 'But the fact that it's a lot, you know, gives me a little bit more comfort as well. So I will be supporting this tonight. Thank you.'",
        "'speaker_1': 'Councilwoman Ortega. Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. One, I get the the line of questioning and the the concern with not creating plans, I think. In the last year or so, I think we've seen a few rezoning applications that have come up and been kind of coy and broad with what can be done and not specific and won't ask questions just'",
        "'speaker_7': '. Well, we don't know yet. We've seen them. We actually postponed one of them until, uh, until more communication was taking place. This is in District five, so. I think there's an inherent issue with and a growing issue because of Denver's growing population.'",
        "'speaker_7': 'And you have the the pressure of affordability and the lack of affordable units. And then the flipside of that is you don't want to you know, you don't make anything affordable by. By making it rare, right? You make it affordable by making plenty.'",
        "'speaker_7': 'And that's what creates affordable affordability. That's just basic economics. However, you know, what we're being asked to do on this dais isn't to pick that fight or battle that fight right now. That is a rule change that, you know, it's a legislative change, potentially charter, potentially municipal code, potentially zoning text amendment, who knows?'",
        "'speaker_7': 'But that that that's where the problem lies. It's not here that uncertainty is what the rules are. Just the rules of the day are. And I don't believe in punishing somebody by denying a rezoning based off of a world that I expect that they have no idea.'",
        "'speaker_7': 'I'm expecting it. Those aren't rules that are applicable today. The rules in which you have filed this application for rezoning are still standing, and this is what we have to consider. However, that other issue looms. I do believe that that's an issue that we need to revisit.'",
        "'speaker_7': 'And it's much more than just a blueprint committee because, you know, granted, it's not representative of the entire city, but. In this particular rezoning, it's met all the criteria. They have community support and neighborhood support. You know, Denver changing.'",
        "'speaker_7': 'It is these edges that are going to change because as we are hurting for more product and more affordability and folks are looking for more units, that's where they will happen. You can't just I mean, it's not like we can manufacture land like we can money or diamonds.'",
        "'speaker_7': 'Yes, ladies, I said diamonds are manufactured. They are not rare. But that didn't make any sense. But today, I mean, I think, yes, I will support this moving forward, because those are the rules in which you were asked to apply towards.'",
        "'speaker_7': 'There we go. Knowing that in the parking lot sits this issue. I think we need to straighten out. As Denver grows. So I do support this rezoning. I do believe it's met that criteria and should move forward under those rules.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilman Espinosa Baca.'",
        "'speaker_8': 'Yeah. So I just think it's and thank you, colleagues, for humoring me on this. But it's it's good to me. It's a good sort of learning point of inflection or something for this council, because if this were a contested rezoning, we just created some potential issues.'",
        "'speaker_8': 'You know, making a distinction of parking lot versus if this were a home. That's not that's not how we balance. That's not how we're supposed to review these things. But that's also what I'm speaking to, which is this is an area of stability.'",
        "'speaker_8': 'These are single family homes on that side of the street. And so if we took them square that this developer is asking for and we and we just moved it for lots to the north. It's the same exact ask, but now it's for single family homes.'",
        "'speaker_8': 'Affordable, single, probably affordable, single family homes that are going to be lost for whatever development potential, plus or minus, is being requested. And again and so and just to say that we're somehow punishing a developer when we make this sort of decision.'",
        "'speaker_8': 'No. No right now that has usou. It has a real world value based on the underlying zoning that is there. And maybe that property owner did ask for an exorbitant amount of money and it's under contract for that amount pending this rezoning.'",
        "'speaker_8': 'But that's that's at risk. You know, that's part of the development game. But he's not going to pay and he's not going to pay you 2.5 prices because it's only got U.S. zoning. And that's a different development potential and different value.'",
        "'speaker_8': 'And this is all part of that calculus. And so there is you know, if he bought it as part of a package with an adjacent, this is all this sort of thing that we don't need to go into or consider or anything at all.'",
        "'speaker_8': 'We have to look at it relative to the plans and the criteria, and we can see it two different ways. I get that. But I've got two plans. I got Blueprint Denver calling this an area of stability and I've got a stationary plan that shows no change in the zone district.'",
        "'speaker_8': 'And I've got a guy asking me to give him additional development rates, significant numbers of units, less parking means more need for parking than the sue and going that's going to impact that sue zone district permanently. That is now destabilizing an area of stability.'",
        "'speaker_8': 'Now, again, it's not a requirement on his ask, but there's no penalty for him bringing forward an idea as part of his package. And if he had that and we're sitting here weighing what it is that he's trying to do relative to the context, we would have a better understanding.'",
        "'speaker_8': 'And then it would be even better if he went 141 step further and got in a covenant with those neighbors and said, This is what I'm agreeing to build. And I'll hold it. This designed to this design for the next ten years so that you know, that's not because we can't dictate what he does and doesn't do'",
        "'speaker_8': 'even after we resign. But those are the sort of things that when you're going into an area of stability and you're going outside of the boundary defined in a stationary plan, we should ask. I do. No one's compelled to do it.'",
        "'speaker_8': 'But good developers and I believe you probably would do this, but no one asked. I'm asking. It's too late now. But, you know, I don't see how this meets the criteria for zoned district change in this area of stability.'",
        "'speaker_8': 'And outside of that stationary envelope that was defined. Thanks.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilwoman Sussman.'",
        "'speaker_2': 'I'm going to try to jump in here.'",
        "'speaker_5': 'With.'",
        "'speaker_3': 'I've had a very.'",
        "'speaker_2': 'Similar conversation today with a constituent that, in fact, it's like deja vu all over again of why why can't we know how many pieces of property are going to be developed before we make decisions about whether the zoning happens or not?'",
        "'speaker_2': 'And I think we're in a stage of transition between the old 59 coat 59 and this new form based zoning. And we kind of want what we some of what we had before with very specific details about how many how many pieces of living units are going to be and and the meaning of form based zoning, which'",
        "'speaker_2': 'is really designed as to get good design, good architecture, architectural design, to have buildings communicate with each other, to make people places, to not be so prescriptive about the the specific things that.'",
        "'speaker_5': 'We used to have.'",
        "'speaker_2': 'Like far floor area ratio and dwellings per acre and setbacks and parking ratios because those are very difficult to regulate because they are there. And they also prohibit the development of what has become very popular in new urbanism.'",
        "'speaker_2': 'So I think it's good to raise these questions. You know, why don't why can't why don't we make a plan? But it may not be exactly in keeping with what form based zoning needs. And perhaps we can have that conversation further about how we might bring our old concepts of what we do with zoning versus the new'",
        "'speaker_2': 'urbanism concepts which what we do. The form based zoning has a lot to do with the design of buildings, the design of neighborhoods, and is meant to implement community plans in ways that have been found to be much more effective than old kinds of zoning codes have.'",
        "'speaker_2': 'But it bears it bears a conversation because we've heard these concerns before. Just wanted to say that.'",
        "'speaker_1': 'Thank you, Councilman Sussman, in the comments to 77. Councilman Espinosa.'",
        "'speaker_8': 'Just I want to go on record that it's it's very disconcerting to me that we don't know the underlying zone district. And I'm sorry for not asking sooner because I mean, some of those families probably have been there for a predating the 2010 legislative reason.'",
        "'speaker_8': 'And so to me, that matters as well on what people bought into what they should be expecting versus now what we're about to the change we're about to impose on them, whether they know it or not. Thanks.'",
        "'speaker_1': 'Thank you, Councilman Espinosa. And the comments to 77 on Madam Secretary Rocco Brooks.'",
        "'speaker_3': 'Espinosa. No. Flynn. Hi. Gilmore. Hi. Cashman. Kennish. Lopez. Hi, Ortega. Susman. I black eye. Mr. President.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Councilman Ortega. Thank you. Got more? Madam Secretary, please call the very nice results tonight.'",
        "'speaker_3': 'One nay.'",
        "'speaker_1': 'One nay. Tue seven has been placed on final consideration and does pass. All right. The next one is council bills. 320 and 321. Councilman Brooks, excuse me. Will you please put Council Bill 320 on the floor for final passage?'",
        "'speaker_8': 'Thank you, Mr. President. I put Council Bill 320 to be placed on the floor for final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. Now, Councilman Brooks, I understand you have an amendment to offer this evening so that the speakers may address the amendment during the comment period. Could you please describe your amendment now?'",
        "'speaker_8': 'Yes. Thank you, Mr. President, and thank Abe for catching this. I think most of us would have missed this. But, you know, I want to say to the audience and folks who are here that when we were contemplating short term rentals in our six month, 16 month discussion around Raffles Square, we didn't even talk about it.'",
        "'speaker_8': 'And so we passed our short term rentals bill and we didn't get a chance to actually put that into this bill. And so that's what I will be reading into Into the Record tonight. So at this time, the filing of Council Bill 320 City Council had not yet approved Council Bill 261 dealing with the Denver zoning code'"
    ],
    "Approves Text Amendment #9 to create the new D-AS-12+ and D-AS-20+ zone districts as well as a new Design Advisory Board for the Arapahoe Square neighborhood in Council District 9. \n\n (NEIGHBORHOODS AND PLANNING) Approves Text Amendment #9 to create the new D-AS-12+ (downtown, Arapahoe Square, 12 stories+) and D-AS-20+ (20 stories+) zone districts as well as a new Design Advisory Board for the Arapahoe Square neighborhood in Council District 9. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 5-11-16.": [
        "'speaker_8': 'allowances for short term rentals as accessory to primary residential uses where residential uses are currently allowed assets. The new legislation allowing short term rentals was not included into the Text Amendment language for the new proposal proposed. Square Zone districts recently adopted Council Bill 261 applies to the new Arapaho Square Zone districts.'",
        "'speaker_8': 'The amendment represents the filing of tax amendment language with the Denver city clerk and adds a role to the use table that's important. So the used table has now been added on page 8.10 ten to match the row added in the tax amendment for short term rentals.'",
        "'speaker_8': 'To clarify that short term rentals would be permitted use with limitations in the proposed new Arapaho Square Zone districts. If the amendment passes, it will not require a delay in the hearing or vote that is scheduled for tonight.'",
        "'speaker_1': 'So the combined public hearing for council bills 320 and 321 is now open. Speakers may address either or both bills, including the amendment. Councilor Brooks. Councilman Brooks will offer later this evening at the conclusion of the public hearing, council will vote separately on each bill and on the amendment.'",
        "'speaker_1': 'May we have the staff report?'",
        "'speaker_9': 'Thank you. Council President Herndon and members of council. Good evening. I'm a barge with the Department of Community Planning and Development. I'm joined by Elise Hoke, who is a key staff member on the project that led to the proposed text and map amendments that are before you tonight.'",
        "'speaker_9': 'I will mention that during question and answer, if you have detailed questions about the reasoning for the little amendment that Councilman Brooks just read into the record regarding short term rentals, I'd be I'd be happy to go into the detail.'",
        "'speaker_9': 'And before I tell you about the proposals for a proposed square in in greater detail, I'd like to ask Councilman Brooks to be kick us off and tell us a little bit about how we got here.'",
        "'speaker_8': 'Yep. Thank you. A this has been an incredible 18 month process and the package in front of you all for council today in the public is a process that involved a lot of hard work and dedication by a technical task force from the community.'",
        "'speaker_8': 'And so you will see neighborhood presidents on board. You will see developers, you'll see architects. And in my mind, will go down as one of the most informed, well-informed and credible group that I've had the pleasure to working on.'",
        "'speaker_8': 'You know, in dealing with zoning, the new zoning for a proposed square will implement the Northeast Downtown Neighborhoods Plan, recommendations for active high density mixed use district that will be downtown Denver's next great neighborhood. As stated in the Downtown Neighborhoods Plan, northeast downtown areas plan.'",
        "'speaker_8': 'In addition to accommodating a high level of development capacity, the zoning also promotes quality design and an active pedestrian realm. Examples include requirements for upper storey setbacks to reduce visual mass and scale while increasing sky exposure. A variety of permitted building forms to allow flexibility and encourage diverse range of designs in the area.'",
        "'speaker_8': 'Building forms that incentivize active facades by allowing greater height requirements for windows and pedestrian entrances to activate the street. Prohibitions on non-active uses. We want active uses in Rebel Square, so please, if you want to come down there, please activate your users for the majority of the building's frontage.'",
        "'speaker_8': 'And so with that, those kind of high level. I also want to say one thing and I'm really excited for this. Zoning does allow for point towers, which formerly were not allowed in the city of Denver. But to get more micro, we will have our staff and a lead us off.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_9': 'Thank you very much, Councilman Brooks. And on at and I will go into a little bit more detail, but as you can probably tell that there's a lot of detail here. And so we'll save really diving too deep in until we get into the questions if there are particular things you'd like to know about.'",
        "'speaker_9': 'And I think you'll hear in the public testimony from some of our task force members that Councilman Brooks Spokes spoke about. He was also on the task force who we owe a lot of gratitude for to to for guiding this process through.'",
        "'speaker_9': 'So the the purpose of the text and map amendments is to implement plan recommendations for a context and form based regulatory system in Arapahoe Square that includes creating two new form base zone districts. The text amendment also would enable a new design advisory board.'",
        "'speaker_9': 'I'll just note that that Design Advisory Board will use design standards and guidelines that are separately adopted from a text amendment using a different process that I'll talk about more in a minute. And the MAP amendment would create the zone district mapping that provides the height transitions that the Northeast Downtown Neighborhoods plan, particularly talks about in the'",
        "'speaker_9': 'Arapahoe Square area, and map those two new zone districts. So the process has been extensive and has been going on for over a year and a half now. The task force met more than ten times during the development of of these proposals.'",
        "'speaker_9': 'These were three hour long meetings that were. Open to the public. So we really dove deep and worked through the design issues that you'll see in the proposals and looked at alternatives and then arrived at the task force recommendations.'",
        "'speaker_9': 'We also hosted a public open house in March that was well attended. We've had office hours for the public to drop by and speak with us 1 to 1. We've taken this for the official planning board hearings to the planning board a number of times for informational items and to neighborhood organizations, both in the Arabo Square area'",
        "'speaker_9': 'and also ANC Zoning and Planning Committee as well. I will note that if the text and map amendments are adopted tonight, the ordinance makes the effective date of both August 23rd, and there's a reason for that. Throughout the process, we've told stakeholders and participants, property owners and developers, we're most interested in knowing exactly when they would have'",
        "'speaker_9': 'to comply with any new regulations. And what we told them is we won't make it any sooner than six months after we've published a public review draft of everything that's proposed. And so to keep that promise. That's why we would delay the effective date until until late August.'",
        "'speaker_9': 'So in terms of what we've heard from the public, I'll just tell you a few things. First off, there's a lot of excitement regarding the future of Arapahoe Square. You hear that word potential a lot when Arapahoe Square comes up.'",
        "'speaker_9': 'You know, it's a it's the next great place potentially if we do things right in terms of promoting a pedestrian oriented neighborhood and promoting quality human scale design, that's context sensitive. We also heard that part of that is being flexible, that this is a place where a lot of different kinds of design could be appropriate as long'",
        "'speaker_9': 'as it's pedestrian oriented and human scaled. And so we've heard from two neighboring Arnaud's, Curtis Park neighbors and Enterprise Hill that they support the project. They've provided letters of support. We've also heard, though, a diversity of opinions on building height in the area and in particularly the height of the Pointe Towers that Councilman Brooks mentioned and on'",
        "'speaker_9': 'always. We'll tell you more about what a point tower is in a moment, as well as how heights transition to surrounding neighborhoods, which, of course, is a topic for tonight and in particular, height transitions. In Curtis Park, just outside of Arapahoe Square.'",
        "'speaker_9': 'And I'll tell you more about this when when we put a map on the screen. But just to note that the task force and the bill sponsor both recommended that we take a portion that we were originally planning to include in the MAP Amendment out, you know, a little area of Curtis Park pending a request for further'",
        "'speaker_9': 'study of appropriate heights there. We've also heard a diversity of opinion on view opinions on vehicle parking requirements. The proposal includes no vehicular parking requirement for those two new downtown Arapahoe Square Zone districts that the text amendment creates.'",
        "'speaker_9': 'That's consistent with the approach for the downtown Core Zone District, which starts right across the street here. And that's been in place for for quite a few years. And in that time, the market has really provided parking where where the markets are fit.'",
        "'speaker_9': 'And so looking at the very rich transit resources in Arapahoe Square and the fact that it's becoming more and more a part of downtown Denver, there is no minimum vehicular parking proposed in the zone districts. I will turn it over to on a list to tell you about the text amendment portion of the proposals and walk you'",
        "'speaker_9': 'through the criteria. Before I do that, I just wanted to mention the separate design standards and guidelines. And as I said earlier, those are not adopted by city council. This is a document that. So Arapahoe Square is one of the few places in Denver outside of a historic district that has these separate design standards and guidelines that'",
        "'speaker_9': 'that inform a more case by case review of designs that that come in. And we are proposing to update that existing system. We've written completely new and updated designs, terms and guidelines that work integrally with the zoning enabled by the text amendment.'",
        "'speaker_9': 'And those design centers and guidelines will inform the work that this new Design Advisory Board will do, looking at projects on a case by case basis in Arapahoe Square. So you all know what zoning does. You talk about it every day.'",
        "'speaker_9': 'The prescriptive rules that that shape development. Just to tell you a little bit more about design standards and guidelines, they work with zoning. It's a it's a process that goes on alongside zoning that's more performance oriented, oriented and more qualitative.'",
        "'speaker_9': 'So they can address a higher level of detail, but tend to make less definitive statements than zoning. So zoning has lots of numbers in it. It's very quantitative. If the height limit is 200 feet, a 205 foot building is too tall.'",
        "'speaker_9': 'Design sessions and guidelines first start with design principles and then down to intent statements and then specific standards and guidelines that talk about the results that we're looking for and some strategies that would be appropriate to get those results but aren't as prescriptive the design advisory board.'",
        "'speaker_9': 'It's their job to interpret them because some interpretation is necessary. Did this project meet those standards and guidelines? So that's how that works. And I'll turn it over to him. At least now we're going back to the zoning now, so she'll tell you about the proposed text amendment.'",
        "'speaker_5': 'Great. Thank you, Abe, and good evening, members of council. So as Abe mentioned, we are developing two different zone districts and the primary difference between these two zone districts is the difference in height, as called for by the Northeast Downtowns Neighborhood Plan to create a transition with greater heights closer to downtown and lower heights closer to the'",
        "'speaker_5': 'surrounding neighborhoods of Curtis Park within both of these zone districts. Three different building forms are permitted. We have the general, the general with height incentive and the point tower. All of these building forms have standards that address the building siting, such as build to requirements, pedestrian entries, as well as transparency requirements.'",
        "'speaker_5': 'Ground floor active uses and so forth. Once we move beyond the general, which is kind of that baseline, what you must do, we move along to the general with height incentive. And as the name would indicate, when you use this building form, you get an increase in height of approximately four or eight storeys.'",
        "'speaker_5': 'And what you're doing here is you're creating an enhanced facade design by minimizing the visibility of structured parking. And so with the intent to create a very pedestrian oriented neighborhood, we do not want parking to dominate that public realm.'",
        "'speaker_5': 'And so that's what the general with height incentive aims to do. Additionally, we have the Point Tower with which Albert Brooks made mention that this is a new building form that we have yet to see in Denver. And really what this aims to do is reduce the building floor play above a height of five stories or less'",
        "'speaker_5': 'to 10,000 square feet. So what you're producing is a tall and slender building that retains sky exposure, minimizes impacts of shadows of the surrounding area, and also can be a contributing feature to the Denver skyline that we've grown to love.'",
        "'speaker_5': 'As you'll know, all of these building forms do have an upper story setback, which was a direct recommendation of the Northeast Downtowns neighborhood plan. And then they also have nuances that call out different key streets, such as Walton or Curtis, with differentiation of build to standards, to acknowledge the the place of that.'",
        "'speaker_5': 'In addition, I do just want to point out that we did have local design firms that have developed with in Denver and Arapahoe Square specifically to test the viability of all of these building forms. So while we've done a lot of internal modeling, we've also wanted to go out to the private sector and ensure that this proposal'",
        "'speaker_5': 'is buildable. Move on. Moving along, I will step through the consist the review criteria for a text amendment. And so with that we have consistency of adopted plans furthering the public health, safety and general welfare and informing that we have a uniform application of district regulations.'",
        "'speaker_5': 'I'll first start with comp plan 2000, which really calls for zoning that provides flexibility for future needs. In that we're creating three different building forms that provide flexibility within each of them, as well as providing opportunities for quality, infill development and ensuring that we have vibrant urban centers.'",
        "'speaker_5': 'So with Arapahoe Square being at the edge of the downtown core, enabling for those great opportunities to happen. We also want to focus our design standards and put our efforts towards those new and evolving districts, as Arapahoe Square certainly is, and targeting specific design concerns to structured parking and those negative impacts with appropriate controls and incentives.'",
        "'speaker_5': 'Moving forward into Blueprint Denver, we want to ensure zoning changes to implement design requirements and ensure that quality design is not only provided to the neighborhood within but the surrounding areas, and also to ensure that we facilitate appropriate uses and densities for the areas that are appropriate, especially within areas of change.'",
        "'speaker_5': 'Moving along to the downtown area plan. That's where we really started acknowledging Arapahoe Square as this neighborhood and this opportunity to become this cutting edge, densely populated, mixed use area for Arapahoe Square that provides not only a range of housing types, but also can become the Center for Innovative Business and Office uses.'",
        "'speaker_5': 'And therefore, there was a call to revise the land use regulations to ensure that this vision was realized. Most recently, we have the Northeast Downtowns Neighborhood Plan, which was adopted in 2011. And as you can see here on the right, we have a series of diagrams that are clipped out from that plan.'",
        "'speaker_5': 'And this is where the concept of the five story datum, as well as the points are highlighted in this. The plan calls for enhanced urban design to occur through a mix of building forms. And as a result, we have those three different building forms for property owners to choose from.'",
        "'speaker_5': 'We also want to have variations in building height. So depending on what type of building you are choosing to use, you'll have a different height allowances for that exchange. We also have this concept of point towers emerging through the 2011 Northeast Downtown Neighborhood Plan.'",
        "'speaker_5': 'We also want to ensure that the buildings are in visual interest and ensure that pedestrian scale for the public realm. So while we might have higher buildings, they still need to be pedestrian friendly and intended to promote that human scale design that's so important.'",
        "'speaker_5': 'It also specifically calls out the implementation of the stadium or this upper storey setback is called out in the text amendment at a maximum of five storeys. However, this can occur at a lower height and minimizing the visual impacts of parking.'",
        "'speaker_5': 'So that's where these different concepts of general with heightened sense of endpoint tower really minimize the visibility and impacts of structured parking. And as a result, we find that the proposed tax amendment is consistent with all of these plans.'",
        "'speaker_5': 'Moving along, I'm going to hand it back over to Abe to talk about the mapping of these districts.'",
        "'speaker_9': 'Thanks, Don. I'm almost done. We just have the map amendment to get through. First, I want to illustrate the geographic scope of the of the study. You know, where were we looking? And so we looked at anywhere that is within the Arabo Square neighborhood, as defined by the Northeast Downtown Neighborhoods Plan.'",
        "'speaker_9': 'That's the purple boundary on the map here. Then there is also Arabo Square already has its own special zone district, and this predates the 2010 code update. It was B8 A and now it's called DHS. And that's the kind of pink color that you see on the map.'",
        "'speaker_9': 'So interestingly, that special zoning doesn't cover the whole Arapahoe Square neighborhood, but does reach outside the neighborhood some. So anywhere that either was within the neighborhood or had that zoned as that existing zoning we looked at. And then I mentioned that Curtis Park height transition discussion earlier that regards the area that's in the dashed line there, which'",
        "'speaker_9': 'is a portion of that existing DHS zoning that's outside of Arapahoe Square, where we originally proposed to map existing zone districts there. That would create the height transition recommended in the Northeast Downtown Neighborhoods plan. And in that particular area, there was just a lot of discussion about how that might not be appropriate.'",
        "'speaker_9': 'And there, you know, folks felt fairly strongly on both sides. In the end, the task force unanimously told us, told staff that they would like to leave that area outside of the proposed map amendment pending further discussion of of what was appropriate there.'",
        "'speaker_9': 'So when we go to the map showing the proposed map amendment that that area is is missing. And so what we're proposing is to take those two new DHS 12 plus and 20 plus zone districts that with those three building forms that on a list described and map those across the area.'",
        "'speaker_9': 'That is the Arapahoe Square neighborhood proper, excepting just a couple of little areas. One is an existing planned unit development that may opt in later. The other is a historic building with open space zoning right now. And then outside of the Arapahoe Square neighborhood, if I just go back to the previous slide, the areas that are outside'",
        "'speaker_9': 'of that purple boundary we are in consultation with the task force, have proposed to map existing zone districts that are that are on the books now to accomplish the height transitions recommended by the neighborhood plan. And these these match exactly the height map that we'll see in the plan in just a moment.'",
        "'speaker_9': 'So it's an eight story district eight in the ballpark area just outside of Arapahoe Square and five and three story district stepping down into the portions of Curtis Park that that remain in the in the proposed map amendment.'",
        "'speaker_9': 'So looking at the review criteria for the MAP amendment, the first being consistency with adopted plans. The same plans apply here as to the plans that on at least describe for the text amendment and many of the same objectives and statements apply as well.'",
        "'speaker_9': 'But I'll just add from comprehensive plan 2000 that it seeks to conserve land by promoting infill development at sites where services and infrastructure are already in place. Places like Arabo Square. And Blueprint Denver then also has the the land use maps that we can look to for appropriate future land uses in the area.'",
        "'speaker_9': 'And it maps the whole area considered for the map amendment as an area of change. And the concept land uses are mixed use and transit oriented development. So most of the area is designated as mixed use. And then a smaller area near the light rail on Welton Street is designated as transit oriented development.'",
        "'speaker_9': 'When you look at the descriptions of those two land forces, they sound somewhat similar. It's about a variety of things happening that are pedestrian friendly with relatively high densities. And then there's the street classifications set forth by Blueprint.'",
        "'speaker_9': 'Denver are also consistent with this idea that those those kinds of streets serve a relatively high and mixed high intensity and mixed land uses surrounding the streets. Most of the streets on the downtown core side of Broadway are designated as downtown Access Streets, and there are also mixed use arterials and main dash collector streets in the in'",
        "'speaker_9': 'the area the northeast downtown neighborhoods plan land use map carries forward the blueprint land use map and so it it looks the same here mixed use and transit oriented development it describes them in the same way the neighborhood plan goes goes a step further though and maps appropriate heights in in Arapahoe Square and the vicinity with the'",
        "'speaker_9': 'objective of creating a transition from the downtown core towards the neighborhoods. And so in Arapahoe Square proper the within the purple boundary on that first map we looked at it maps 20 stories with an additional ten stories allowed for tall slender point tower.'",
        "'speaker_9': 'So it specifically calls out point towers and says how much taller they could potentially be in that area closer to downtown. Then at a point, somewhere between 21st and 22nd Street, it it says that the height should transition downward within Arapahoe Square and provide for a maximum of 12 storeys, with an additional eight storeys given as an'",
        "'speaker_9': 'allowance and a tall, slender point tower building form. And then outside of Arapahoe Square, it recommends building heights ranging from 3 to 8 stories stepping down towards the neighborhoods. And so that's exactly consistent with what you'll see in the mixed use zone districts that we're proposing outside of Arapahoe Square, the same heights.'",
        "'speaker_9': 'So clearly, the Department of Community Planning and Development finds that the review criteria for both the text and the map amendment have been met, including consistency with adopted plans that they further the health, safety and general welfare that they result in regulations that are uniform across the district.'",
        "'speaker_9': 'On April 20th, Planning Board considered both the text and map amendments, and they unanimously recommended approval of both. And so Community Planning and development staff recommend City Council approval of Text Amendment Number nine, finding that the applicable review criteria have been met.'",
        "'speaker_9': 'Community Planning and Development Staff also recommend City Council approval of Map Amendment Number 2016 EIS 00035 finding that the applicable review criteria have been met. Thank you.'",
        "'speaker_1': 'Thank you. Thank you both. All right. We have seven speakers and I'm just going to go ahead and call seven and you can make your way up. They are Keith Pryor, Joel Noble, Craig Sutley, Richard Farley, Amy Harman, Bryce McCarty and John Desmond.'",
        "'speaker_1': 'So you seven can come on up to your the front pew and Mr. Pryor, you can begin your remarks when you are ready. And 3 minutes for each of those speakers.'",
        "'speaker_7': 'Good evening, counsel. Thank you, Mr. President. This has been Keith Prior, 2418 Champ. I live in Curtis Park and I'm adjacent to literally a block away. Not even that.'",
        "'speaker_8': 'From.'",
        "'speaker_7': 'Some of this zoning change. I was not on the task force. I am a neighbor. Abe and staff did a phenomenal job with the task force and including neighbors like myself in the Open House process, in the discussions, taking our feedback, taking our concerns, working with the design review committee and process, and really making this process work'",
        "'speaker_7': '. I thought the neighbors were heard. Part of that was removing the piece that is controversial for Curtis Park, which we are going to be having a discussion further. I am on the side that I would like higher heights directly across the street from me, other neighbors, that it would be more appropriate for lower heights.'",
        "'speaker_7': 'So. Well, we'll have that discussion and bring that back to you in the future. But moving this forward is critical because Arapahoe Square, as you know, is a city of parking lots. It has had the existing zoning that is of downtown, which really has not brought the the sense of what could be built.'",
        "'speaker_7': 'And that's why this area has remained undeveloped, because the actual value of what people think their land's worth and what you can actually build on that land has always been at odds. And so by now, having this process, bringing the planning process and working with the landowners and really getting our heads around what is actually buildable in'",
        "'speaker_7': 'this area and making that more contextual, more sustainable, more actually in line with predictability that allows people to then match the develop or the development potential for this area with that of the land values that the owners currently have.'",
        "'speaker_7': 'So I think with this process and having it so inclusive, you will see after this amendment hopefully a lot more development coming in on this given now knowing what people can actually put on these lots. And I think with the point tower option, it really does give us that density that is so desperately needed in the lack'",
        "'speaker_7': 'of housing options that we have in the city. And so it also allows for a really nice mix of allowing businesses which activates during the day, residents activating during the night. And it just really brings hopefully some opportunities for everyday services as well as like dry cleaners, not only restaurants but just, you know, like I said, the'",
        "'speaker_7': 'dry cleaners and other things, Kinkos that Curtis Park neighbors desperately need. So I really highly encourage you to support this as the neighbors as myself went in support. So thank you very much.'",
        "'speaker_1': 'Thank you, Joe Noble.'",
        "'speaker_8': 'Good evening, counsel. My name is Joel Noble.'",
        "'speaker_9': 'I live at 2705 Stout Street.'",
        "'speaker_8': 'And I'm here tonight representing Curtis Park neighbors. I was the immediate past president of Curtis Park Neighbors and now serve on the board of directors from Curtis Park Neighbors. I was the designee to the task force. And Curtis Park neighbors, as you see in your packet, has sent a letter of support for this process.'",
        "'speaker_8': 'This is a very good, inclusive process.'",
        "'speaker_9': 'To take.'",
        "'speaker_8': 'What was recommended in the Northeast downtown neighborhoods, plan and apply it in zoning and then to apply it in zoning. Required Writing New Zone Districts. As you'll read in the Northeast Downtown Neighborhoods Plan. The zoning that was called for was very different than one that we have on the books.'",
        "'speaker_8': 'It called for this datum line. It called for point towers. It called for shaping the mass and hiding the parking. So all that was our guide in doing this zoning that you see tonight.'",
        "'speaker_4': 'I'd like to.'",
        "'speaker_8': 'Speak a little more generally. How is it that we're rezoning such a large area without controversy and increasing density? How are we doing this? And the answer is, we did a small area plan. We did a neighborhood plan.'",
        "'speaker_8': 'We took all the time that it took to find that community consensus. And once that community consensus was built and documented in the plan and adopted by city council, we didn't waste a lot of time in then pursuing changing the zoning.'",
        "'speaker_8': 'We struck while the iron is hot. Choose your metaphor. We built on the consensus that was already there, and we know a good thing when we see it. We're copying the process that was followed in Cherry Creek, in Cherry Creek.'",
        "'speaker_8': 'They did a small area plan. They got the consensus and then they followed up with a legislative rezoning. In that case, that also involved writing new zoned districts and was also facilitated by Mike Hughes. And that was also a fantastic process.'",
        "'speaker_8': 'So we stole him as well. So I would I would encourage you not only to support this, but also to strongly consider when you do neighborhood plans, when you do stationary plans or any sort of small area plan in the future, and you find that community consensus, take that opportunity to then follow it up with the zoning'",
        "'speaker_8': 'process like this. There's nothing like having that community consensus built in. People will appreciate it when the zoning happens and people will appreciate it when the development happens enabled by that zoning. I'll be happy to be here for any questions.'",
        "'speaker_1': 'Thank you, Craig. Simply.'",
        "'speaker_4': 'Hello Cancer Council.'",
        "'speaker_0': 'I'm here representing Enterprise Hill.'",
        "'speaker_4': 'Which is also centered around Clemens historic district, which is just to the. I guess you'd call it the southeast of Mirabeau Square, including probably the farthest three blocks of Arapahoe Square. This process was, as Elvis was saying, approximately 18 months.'",
        "'speaker_4': 'You're going to 16 was 18 ago that we started. And Mr. Hughes did do a fantastic facilitating job with a very diverse group of people, having a developer or landowner across the table from a a neighborhood person who cares about his historic district more than anything else was a unique situation that I wish it would have been'",
        "'speaker_4': 'happening maybe six months or a year earlier so we wouldn't have a couple of buildings that wouldn't even come close to this design guideline. They're getting ready to break ground, but I think everything's great. This is awesome. I think the more places that the city can do things like this and involve the neighborhoods along with the the'",
        "'speaker_4': 'landowners and the developers, the better off our city will be. And hopefully not only Cherry Creek North, but this Arapahoe Square can be a an example of how to do this going forward. So thanks a lot. And I hope you guys supported it possibly.'",
        "'speaker_1': 'Could you say your name for the record?'",
        "'speaker_4': 'Craig Simply and I'm at 2120 Glenarm place is my address.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Bridget Farley.'",
        "'speaker_4': 'Mr. President, members of council, I'm Richard Farley. I live at 2500 Walnut Street, just on the edge of Arapahoe Square. And, you know, in speaking in favor of both the ordinance and the Design Advisory Board, I was a member of the Citizens Advisory Committee that crafted this the ordinance and the design standards and guidelines.'",
        "'speaker_4': 'And, you know, I'm amazed at what a thorough process it was. The staff did a terrific job. We met for ten times or it seemed like we met about 100. And there was a lot of good dialog, a lot of of give and take.'",
        "'speaker_4': 'There was comments from the the the audience of folks who knew about the the the effort and through the public involvement process. And it resulted in really a well researched, well-considered ordinance with design standards and guidelines. It creatively deals with street level activity, scale and variation of large buildings, unique areas in the neighborhood like 21st Street and'",
        "'speaker_4': 'end Broadway and parking requirements and parking design. Design being is embedded in the ordinance since. If you want to receive some of the high the height that is allowed in the in the ordinance, you have to line the parking levels or parking structure with other uses so that, you know, if you go from 12 storeys to 20'",
        "'speaker_4': 'storeys, if you want that extra extra eight storeys, it's it's not given to you. You have to earn it by making the parking levels behind other uses, preferably residential, but it could be office. I think that that's a a pretty major incentive.'",
        "'speaker_4': 'It's not easy to get incentives into the form based code. And I think that the transitions to adjoining neighborhoods were well addressed, not only with Curtis Park but with the Ball Park neighborhood in Clemons Park. You know, I think that the the parking is also creatively addressed by eliminating the parking requirement of the larger structures.'",
        "'speaker_4': 'And larger developments are going to require parking through through both market and by the lenders. So they're not going to be it's not going to be on under part. But the smaller projects could very well be forced to provide more parking than they need.'",
        "'speaker_4': 'We had several you know, had two developers tell us that that the that the real small ones could be forced to provide.'",
        "'speaker_1': 'Mr. Farley.'",
        "'speaker_4': 'You're doing your thing. That's what I'm saying. I thoroughly support this. The ordinance and the design standards guidelines and the Design Advisory Board.'",
        "'speaker_1': 'Thank you, sir. Amy Harmon.'",
        "'speaker_5': 'Good evening. I actually am delighted about the experience we had with this task force. I am a real estate developer. I'm representing myself as a landowner, as a founder of the Community Coordinating District, which happens to be a metropolitan district for which it was the last time I was here.'",
        "'speaker_5': 'The last time Mary Hancock served on the council. And so fun to be back. But at that time, I think but the most exciting thing about this proposed square task force has been for me is just that it really embraced the history of all of these planning efforts that have happened for many decades, frankly, and included many'",
        "'speaker_5': 'people, both, you know, the example of Dick Farley, who's just a wonderful professional that we all really appreciated his perspective. And then very new planners, new owners, new council people, and in general, just the strong commitment to process, but then the participants desire to really maintain that opening for flexibility.'",
        "'speaker_5': 'So I was struck earlier by some of the topics earlier this evening where people were wishing for aspects of the old zoning code. And now here we are with a new form based learning code. I think we got it right in Arapaho Square.'",
        "'speaker_5': 'I think that we have a lot more to do in this area because it really is a large area. I think we need to start focusing on the heartbeat aspect of it, which is not about the planning in the building.'",
        "'speaker_5': 'It's about what the people are going to do moving forward. And it was just a real delight to be a part of such a diverse and smart and committed group of people that really through the years have had their differences but have come to be friends and I think respected peers in the neighborhood.'",
        "'speaker_5': 'So thank you so much.'",
        "'speaker_1': 'Ms.. Herman, can you could you say your name for the record?'",
        "'speaker_5': 'Amy Harman.'",
        "'speaker_1': 'Thank you for the contact.'",
        "'speaker_4': 'Thank you, Mr. President. I appreciate the time to speak tonight. I am Bryce, the account, the founder of our unit. We are a real estate development technology company focusing on two things sustainability and affordability. As I'm sure you guys are aware, the built environment consumes 70% of the electricity on the grid.'",
        "'speaker_4': 'And so we feel like it's the responsibility of ours to build our buildings as sustainable as possible. Obviously, looking out for low hanging fruit first having a sustainable envelope, sustainable mechanical. So solar production, obviously battery storage. So our buildings are not peaker buildings on the grid.'",
        "'speaker_4': 'And then user engagement, engaging our users in our buildings to be more energy efficient. And the only affordability side, we start every project asking ourselves, what is the price point that we think is market rate affordable for this location?'",
        "'speaker_4': 'And we design backwards from that. And there's really no magic trick, right? The only as as a private entity, the only tools that we have to to fix to try to fix affordability is density, right? Density and size.'",
        "'speaker_4': 'So obviously our use are smaller, which is great because when you make them smaller, they're inherently more energy efficient because they take less energy to heat and cool and then density or be able to be more dense on the site.'",
        "'speaker_4': 'And what always drives density these urban locations is parking, right? Parking is is expensive. Expensive to build. You know, either we have to buy the land and put it on the land or we have to build underground structure or.'",
        "'speaker_7': 'Or stack.'",
        "'speaker_4': 'Structure. So it's expensive. And for us to get it under the thousand dollars per month on the rental side, parking is the one is the one that that that we have to be willing to give up for.'",
        "'speaker_1': 'That unit, not.'",
        "'speaker_4': 'That all our units will be zero part, but we would like to be able to provide units in the nines by break under $1,000, and those will not have a parking spot. So with this new proposal, we have those weapons available to be able to to fix some of these issues.'",
        "'speaker_4': 'So obviously, we're in favor of this proposal. And I appreciate. Thank you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'John Desmond.'",
        "'speaker_0': 'Thank you, Mr. President.'",
        "'speaker_4': 'Members of council. I'm John Desmond. I'm executive vice president of the Downtown Denver Partnership. And my address is 511.'",
        "'speaker_8': '16th Street.'",
        "'speaker_4': 'Denver. And I'm speaking on behalf of the Downtown Denver Partnership this evening, which strongly supports the zoning map and text amendments, as well as the design standards and guidelines. And I also was the partnership representative on the Technical Task Force, and I'll try not to repeat to many of my other colleagues comments, but I'm very supportive of'",
        "'speaker_4': 'what they've all said. The partnership's been heavily involved in advocating for the improvement of Arapahoe Square for many years. Together with community planning and development, the partnership co-manage the 27 downtown area plan, which is adopted by council and which featured Arapahoe Square prominently as one of its seven transformative projects and even on a lease talked about that'",
        "'speaker_4': 'earlier. We were also partners with the city in developing the Northeast Downtown Neighborhoods Plan, which again previous speakers talked about and went into much greater detail on Arapahoe Square. And then in the last year the partnership has been very involved with and helped fund plans to redefine 21st Street, which one runs through the heart of Arapahoe Square'",
        "'speaker_4': 'as a signature pedestrian and bicycle oriented street.'",
        "'speaker_8': 'That will serve as its.'",
        "'speaker_4': 'Future spine. So we're very.'",
        "'speaker_8': 'Emotionally invested in this plan.'",
        "'speaker_4': 'And we we believe, as outlined in the various plans, that this the amendments and the standards and.'",
        "'speaker_8': 'Guidelines are consistent with the goals and.'",
        "'speaker_4': 'Strategies from these plans and will greatly help foster a proper and appropriate and unique mix of high quality, well-designed developments and uses that complement both downtown and the adjacent neighborhoods and in particular in building on Councilman Brooks's comments earlier, we want to commend the plan for the thoughtful design review provisions.'",
        "'speaker_4': 'The encouragement of active ground floor uses.'",
        "'speaker_8': 'The height, transition and massing requirements, the special considerations for developments adjacent to historic districts.'",
        "'speaker_4': 'And the flexibility in developing building forms and parking options, all of which will make this a vital, memorable and welcoming district that will set standards for quality, sustainability and pedestrian oriented design for the entire city. And based on that, we strongly urge that you support the package of amendments this evening.'",
        "'speaker_8': 'Thank you very much.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Now time for questions. Any questions of members of council? Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. Hello. Hello. Thank you. Hey, if you don't mind. Abby. You remember our chat a couple of weeks ago by the elevator? Yes. I'm guessing this will be more productive. Let's see. So you talked in your presentation about open space and pedestrian oriented and doing things right.'",
        "'speaker_4': 'How will those elements unfold in this zoning?'",
        "'speaker_9': 'So, you know, a lot of the project, of course, looked at, you know, what's it going to make to make this a great place for pedestrians? A start with the open space question because it's a little more specific and there was a lot of discussion early on at the task force level.'",
        "'speaker_9': 'You know, how important is open space like courtyards and plazas and that sort of thing for the future of Arapahoe Square? And I think that, you know, the task force discussion was a little bit mixed on that with some task force members having concerned that, excuse me, hopefully that's not me.'",
        "'speaker_9': 'There was some concern that the existing character of the neighborhood, you know, and the local social services providers would make it somewhat counterproductive to provide like those privately owned open spaces, at least in the near term. And so the discussion went to, okay, we're not going to literally require those places as part of the zoning.'",
        "'speaker_9': 'And we looked at potentially incentivizing them. Ultimately, the main incentive we had to work with was height. And there was so much discussion regarding the need to do something about the visibility of parking in the neighborhood, particularly structured parking and of looming over the street and reducing that human scale that the task force wanted to concentrate the'",
        "'speaker_9': 'incentives there. So you get more height by limiting the visibility of structured parking as opposed to providing open space or doing other things. So where we landed is that open space is enabled. You know, you're you're allowed to provide it.'",
        "'speaker_9': 'There's a greater build to range provided on certain streets, including 21st Street, which is especially appropriate place for open space. And then in the separate design sessions and guidelines, which you're not adopting tonight, there's a lot of discussion about the quality of open space.'",
        "'speaker_9': 'So when you do provide space, when when the building is not built to the sidewalk edge, which is one way of activating the pedestrian space, then you are providing something that is that is highly activated, whether it's like what we've called an enhanced set back in the design terms and guidelines, that would be you're maybe providing a'",
        "'speaker_9': 'few extra feet along the sidewalk and either using it to expand the literal pedestrian through use area or for cafe seating or other really active things. Or if you're providing courtyards that they be highly activated. High level of transparency that real usable entrances to the buildings are located on those courtyards, that they're well-lit so that they're they're'",
        "'speaker_9': 'not leftover spaces. They're they're spaces that contribute to the to the pedestrian realm. So that was a lengthy answer. So I'll be quick on just the other things that we discussed with regard to pedestrian orientation. So we're moving forward.'",
        "'speaker_9': 'The many of the pedestrian oriented requirements that apply in urban center mixed use districts now, including the street level transparency requirements, the new street level active use requirements, which were introduced into the code last summer. And then on top of that, there's a lot of discussion in the design standards and guidelines about where entrances are located, how'",
        "'speaker_9': 'parking is accessed when you provide it, that it's ideally provided from the alley. In some cases, that's not possible because of the uses and the and the building configuration, but if so, that it's provided from sort of the long end of the block instead of the short end of the block, which is already very broken up by'",
        "'speaker_9': 'the alley being there so that those curb cuts don't have such an adverse effect on the pedestrian experience and the design terms and guidelines also talk about streetscape. And since we don't have a streetscape plan for the area that would say, you know, there should it should all be blue light fixtures or anything like that.'",
        "'speaker_9': 'What we talk about is that the streetscape just providing, you know, regular street trees that are sited in a way that helps them thrive and doesn't get in the way of pedestrian movement between parallel parking, say, and the sidewalk.'",
        "'speaker_9': 'And so there really are a lot of details of the pedestrian experience that are addressed by the proposals.'",
        "'speaker_4': 'So we're not requiring any open space. We are incentivizing it. Do we have any similar developments to look at that might give us a clue how other projects have played out, what we might look forward to?'",
        "'speaker_9': 'So you're asking how much open space do you think we'll get considering that we're not requiring it? Sure. I think interestingly, we probably will get some and there is not a specific open space requirement in Arapahoe Square now.'",
        "'speaker_9': 'And there aren't in most of Denver some districts. There are several projects that have been working their way through the development review process and are approved or near approval right now. One of them I know actually is pulling back from a corner along 21st Street in order to provide a very sort of obvious entry into the multifamily'",
        "'speaker_9': 'project there. And so is providing a kind of open space and in front of the building as part of their program.'",
        "'speaker_4': 'And how many acres are we rezoning here to get.'",
        "'speaker_9': 'The exact acreage? I don't know. Unless on a lease knows, you know, this would be the entire area on the other side of 20th from here to Park Avenue and then between essentially Welton and the alley between Larimer and Lawrence and mixed.'",
        "'speaker_4': 'Uses thousands of new residents probably downtown.'",
        "'speaker_9': 'There could be, I would guess, that the neighborhood could be built out into thousands of residential units in the future.'",
        "'speaker_4': 'Thank you. Mr. Farley, if you don't mind. And I'd like to just recognize Mr. Farley for his lengthy contributions to our city, both as an employee and on the other side. You've started talking about parking. And I wonder if you could talk about parking and no parking and reduce parking and how it makes sense or not in'",
        "'speaker_4': 'this case? Well, we discussed that a lot. And it seems that where we came down on that was that the the market in the lenders are going to require, you know, a lot of parking in the larger projects.'",
        "'speaker_4': 'They're going to require at least, you know, one space per unit, maybe more. Some of them require to we did not want to encourage over parking. We did not want to somehow force developers to build a lots of parking levels that in 20 years it may not be needed, or that the kind of cars we drive in'",
        "'speaker_4': '20 years are tiny cars instead of F-150s. So it seems to me that we just did not want to force parking into the equation, and we don't think that that's going to impact adjoining neighborhoods. Mm hmm. The like I say, the smaller developers often find that only a half of their of their residents require parking because so'",
        "'speaker_4': 'many of them, millennials and others are, you know, now using Uber, they're using they're bicycling, they're doing all sorts of stuff and they're trying to avoid buying cars and the you know, the costs related to that. And how are you defining smaller projects, approximately?'",
        "'speaker_4': 'I'm sorry. How are you defining? What would a smaller project look like to you as far as numbers? Oh, I would say under 50 units. Okay, great. Thank you, Mr.. Good evening. Can you talk to me? You are going to provide rentals for under $1,000 a month.'",
        "'speaker_4': 'That's our goal with with the proper density. And those units will have alternative modes of transportation. So we we provide, obviously, bike sharing. We're working on doing our own electric car sharing program or our projects that the tenants will be able to reserve the car through the through the app.'",
        "'speaker_4': 'How how large would a $999 a month? Yes. So these would be studios ranging about about around 300 square feet. Okay. So micro units, was that a fair? So technically, we don't use that that term because technically a migraine is 300 square feet and below.'",
        "'speaker_4': 'That's the technical definition. And because we're in a green technology in our yes, we actually call them smart units because we can show people who can live just as well and in a well laid out unit. And how do how does what you're talking about compare to what the market is offering now in that size range?'",
        "'speaker_4': 'So so right now for comparable, you know, traditional class-A apartment building, they're building a few studios. And the ones that they're building are about 650 square feet, at least 505 or 600 square feet. And those are renting up to 14 $50,000 a month.'",
        "'speaker_4': 'And so your yours will be aimed at what am I? So we 80% and below. I'd like to be obviously as I can go under, that'd be great. But 80% of I am I. And last. You're not out of the ground yet.'",
        "'speaker_4': 'No. So I forgot to mention.'",
        "'speaker_9': 'Sorry, I was.'",
        "'speaker_4': 'Trying to put in 3 minutes. That's okay. I'm just. I assume you're saying that's your aim? Yeah, we bought a we bought a property last year at 20 to 50 shampoo, right. Sort of middle block. So we own a parcel.'",
        "'speaker_4': 'And do you think it's realistic by the time you would be out of the ground and open that you'll be able to offer something under a thousand a month? Yes. Okay. Thank you. That's all, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Cashman, Councilwoman Ortega.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_6': 'I have a question for the same speaker that just walked away.'",
        "'speaker_1': 'This is look, you're still in.'",
        "'speaker_6': 'Over here.'",
        "'speaker_4': 'Oh, excuse me.'",
        "'speaker_6': 'So, Councilman Castro, next part of my question. But what I wanted to know is if for your particular development and I was really excited to hear that somebody is looking at bringing something in at a more affordable price point, although they are small units.'",
        "'speaker_6': 'Yes. Do you anticipate going after any type of subsidies, incentive dollars, housing, tax credits, any of that kind of stuff to target a lower income population?'",
        "'speaker_4': 'No, that's a good question. The one tool that we found is with with Freddie, Fannie and Freddie. So they actually are promoting workforce housing and we fit that criteria there. Their workforce affordable price for that location is about $1,044 a month.'",
        "'speaker_4': 'So we we fit that criteria. And because of that, we get better terms on our debt for permanent financing. So I think that's a that's one tool that we're you.'",
        "'speaker_6': 'Know, you're not having a problem financing a unit of that size.'",
        "'speaker_4': 'No, because, again, the nice thing is when you take three or four square foot off the unit per square foot, it's comparable to to a 650 square foot studio. You just made it smaller. So the overall prices lower.'",
        "'speaker_6': 'Okay. Thank you. My next question is either for Abe or Dick Farley. So given the work that you did with the neighborhood, I want to hear a little bit about the discussions as it related to any of the shelters in the area.'",
        "'speaker_6': 'Looking at the boundaries, I'm not sure how many or which ones of the large shelters are actually in this area and were they part of the process and do they know their property was resumed if they're in there and I can't tell from the map which ones are actually in.'",
        "'speaker_9': 'There are several that are in. I think probably most of the ones you you'd think of are within the within the boundary for the map amendments.'",
        "'speaker_6': 'So how far north does it go? Does it include lumber?'",
        "'speaker_9': 'It goes. So on the north side, it goes halfway between Lawrence and Larimer. So to that alley. Okay. So the ballpark historic district is not in, but everything just just on this side is is in. And we did have a member of the task force from the Colorado Coalition of the Homeless who represented their interests on the'",
        "'speaker_9': 'task force. We didn't have a lot of active participation from the other social service providers. You know, we certainly heard, not surprisingly, that, you know, some residents, both of Arapahoe Square and of of surrounding neighborhoods, are concerned with the concentration of social services there, which is, you know, relatively near its maximum in terms of what could realistically'",
        "'speaker_9': 'be there with zoning requirements regarding separation and and the exact location of those services in terms of, you know, whether or not those uses were appropriate or what the future holds for them. The task force, I think, felt that that really was part of a bigger city wide conversation, that it didn't really make sense to just look'",
        "'speaker_9': 'at it from the perspective of that one neighborhood. And I know Councilman Brooks, as you know, had a lot of discussions regarding elevating that conversation more to a citywide level.'",
        "'speaker_6': 'So their properties are included. And the ones that I can think of, given the boundaries that you described, are the Denver Rescue Mission. Salvation Army has, I know at least one, possibly two locations down there. Clearly, Koch has a number of them.'",
        "'speaker_6': 'Samaritan House is included. I think the only one that's not is step 13, which is on the river street. So the vast majority of them would be and I don't know that CCH had direct dialog with, with all the others.'",
        "'speaker_6': 'And so I would just say that I think of a reach out to them would be really important for them to know that their property has been resolved. I don't know that it makes any difference in terms of what their core operations are, but I think it would be really important for them to know that they've been'",
        "'speaker_6': 'included in this. You know.'",
        "'speaker_9': 'Sure. Yeah, that's that's a really good point. I'll mention that, you know, we also did twice do mailings to all the property owners that we have on record in the area, both at the outset of the project to get them involved and then more recently to say, look, there's a proposal on the table at this point, you'",
        "'speaker_9': 'know.'",
        "'speaker_6': 'Great. Thank you.'",
        "'speaker_7': 'Thank you, Councilwoman. Yeah, Councilmember. It's funny you ring in. You indicated.'",
        "'speaker_8': 'I just wanted to respond. I just wanted to respond to that because, you know, we worked on this for a little bit. The first thing I'd say is that the existing zoning under DHS allows we're just mapping. And so there's a there's certain allowable uses there and there's nothing that we switched.'",
        "'speaker_8': 'The other thing I'd say is there are a number of providers who came to the meetings and attended the meetings and every provider was notified. So if there's a learning conversation that we can have, I mean, we are certainly welcome to that.'",
        "'speaker_8': 'We certainly had a lot of different viewpoints come through that meeting. And we, you know, we weren't addressing uses, we were doing zoning. And so but I appreciate I appreciate the question, but I think this zone district encompasses every provider, you know, homeless provider in that area.'",
        "'speaker_6': 'Thanks.'",
        "'speaker_7': 'But Councilman Espinoza.'",
        "'speaker_8': 'I don't even know if we can do this, but is since there are height incentives, are there any affordability incentives?'",
        "'speaker_4': 'Christian.'",
        "'speaker_9': 'Thank you, Councilman Espinosa. And I just calculated the acreage for Councilman Cashman. So it's about 100 acres. And in terms of your affordability question, there are not specific incentives for provision of affordable housing. It certainly was very much a part of the discussion in terms of, you know, again, kind of like the open space.'",
        "'speaker_9': 'Should there be requirements? Should there be incentives? And ultimately, the task force, I think, really deferred to the to the Northeast Downtown Neighborhoods Plan, which says that design incentives, which were really the ones that we had to work with, like giving additional height, were best used to incentivize design features.'",
        "'speaker_9': 'So that's what we're doing better. Quality design gets you better height, not affordable. Housing gets you gets you more height. And also just a feeling that, you know, you know, we know that there's this bigger citywide conversation regarding affordable housing that's really gathered a lot of steam.'",
        "'speaker_9': 'And, you know, we're on the verge of some major proposals that will apply citywide. And so the task force really deferred to that effort with regard to specific requirements for affordable housing.'",
        "'speaker_8': 'Did you? Yeah. Let me let me respond to it, because there is another effort afoot, obviously, at 30th and Blake, where we're looking at affordable housing. You know, what we learned nationwide when we're looking at incentives is that depending on where your base is and where the entitlement is, is really what incentivize.'",
        "'speaker_8': 'So, for instance, you know in at 30th and Blake the base is really low in that the height of the entitlement that we're asking for is at 16. So there are folks going from 3 to 16 and that would incentivize them.'",
        "'speaker_8': 'The base in this district is already at 150 feet in some areas. And so the, you know, incentivizing that was not the greatest. And so we we had a conversation around that and it just didn't make sense. And I didn't feel like we had a low enough base to to do that.'",
        "'speaker_8': 'But I mean, obviously it was a part of the conversation. It was something that we had as a as a task force.'",
        "'speaker_7': 'Councilman Flynn.'",
        "'speaker_8': 'I know. And actually.'",
        "'speaker_7': 'Councilman Spence, I'm sorry. Go ahead and finish our question.'",
        "'speaker_8': 'So can you guys go to the slide that shows the upper story setbacks? And I actually.'",
        "'speaker_9': 'Have a slide that we didn't show, which will show a little bit more detail about how that works. There are there are a series of slides here.'",
        "'speaker_8': 'So. This is good. The thing is, is that this depiction shows a real, real simple you know, it's very simple imagery to sort of explain the upper the concept of upper story setbacks. But the the depictions in the in the other graphics really convey the character, a character about the nature of these setbacks.'",
        "'speaker_8': 'And I want to sort of because I'm I mean, the next question is going to be to explain to me how the design standard, once again, how the design standards, the and the zoning are sort of how they relate.'",
        "'speaker_8': 'Okay. So the other depiction sort of shows more architectural sort of sense of meaning, character. Again, that's that's real simple. Like, you can't obviously you can't build well, so you can't build anything, anything that even vaguely looks like that.'",
        "'speaker_8': 'Right? Because there's no openings. There's no vertical, horizontal or articulation of the facade. There's no transparency on the ground level. So go back to the other renderings that we're showing and sharing with the public. So now the runway shows the little orange landing.'",
        "'speaker_9': 'Let me see. Okay. Do you want to use this? Yes.'",
        "'speaker_8': 'Because this sort of shows and conveys some sort of notion about what this place could be and how those setbacks impact the design of the structures. And so I would like to know how true to the zoning these models are are, because this is sort of the the concern about the existing zoned districts is we've conveyed a'",
        "'speaker_8': 'real, real architectural power, I mean, tangible architectural examples. And that then the people, the layperson sort of feels that that adequately reflects the development potential. But in reality, there's a lot of relief shown here that actually isn't in the zone requirement.'",
        "'speaker_8': 'And the cause. And then I want to speak to that. But a first need to understand how this how this sort of both depicts the zoning and relates to this design standards, because there's some very healthy cornices on the buildings and at those each one of the setbacks, that is not a requirement, if I understand what I've'",
        "'speaker_8': 'read. Correct.'",
        "'speaker_9': 'So yeah, that's a good question. These graphics are very similar to graphics that are used in the building form tables and the proposed zoning for the for these three building forms. And all three of the building firms, of course, meet the zoning standards.'",
        "'speaker_9': 'And you will see that, you know, like this building right here, you can see where I'm pointing. Mm hmm. And this building here that those those orange areas are the required setback areas. And those two buildings. That's they're showing the bare minimum of setbacks.'",
        "'speaker_9': 'Like that's the minimum that could meet the setback requirement. This one here, you'll see that the orange is the bare minimum needed to meet the setback requirement. But there's a there's more design there. There's a more creative thing going on.'",
        "'speaker_9': 'It's not this area that's not marked in orange is not specifically required as a setback. And then you said mentioned on those those other graphics that just sort of showed sort of the block buildings that didn't have any windows or things like that.'",
        "'speaker_9': 'Those were just to illustrate different creative approaches for using the setback standard and not any of the other requirements. But so on these graphics, there is the build to requirement in the zoning regarding the position of the buildings, the transparency requirement in the zoning, regarding the transparency.'",
        "'speaker_9': 'The zoning requires that there be street facing entrance on each building, and the design signs and guidelines then, you know, are really are a unique thing here, which is taking something that that you're right. You know, you could if you if you try to go for the bare minimum and you just provide the transparency and you only'",
        "'speaker_9': 'do what you'd absolutely have to do for the upper storey setback, perhaps we're not getting where we need to go for a district like Arapahoe Square. But the design serums and guidelines are an opportunity to have a more detailed discussion.'",
        "'speaker_9': 'Okay. How are you working within the zoning to meet the objectives that we've set forth for Arapahoe Square? And so, for example, there's a whole section on the the street level and the street level definition. And while it doesn't necessarily say that the only way you can provide the pedestrian, comfortable street level is to put a cornice'",
        "'speaker_9': 'right above the first level for for that sense of enclosure, it talks about a whole range of strategies and says, oh, you have to do something. So so these buildings, you do have to do this higher level of design quality in Arapahoe Square through that process.'",
        "'speaker_9': 'There's a lot of different ways you could do it, though. So I couldn't tell you that this is exactly how it would play out with any existing building.'",
        "'speaker_8': 'But it would it is it's it is in Cbd's belief because of the wind, the opening stack, the way they're sort of talked about in the design guidelines and standards. And there are horizontal projections and there are some pilasters and things like that.'",
        "'speaker_8': 'General sense is, is that this does convey something that would meet that.'",
        "'speaker_9': 'Yes. Well, I'm not a member member of the design advisory board, so it's not for me to for me to decide. But yeah, as staff, we wanted to show buildings that we thought met the full package. You know, these are graphics that are in the zoning, but, but the buildings are going to have to go through the'",
        "'speaker_9': 'separate design review. And we wanted to show things that were consistent with the intent.'",
        "'speaker_8': 'So then can legally what is the so you have a section 13.1 .6. 2a5c, which is. Wall design elements. Mm hmm. How does that section relate to the design guidelines, the standards, and which one takes precedent legally when there is conflict?'",
        "'speaker_9': 'Yeah, that's a really good question. So what Councilman Espinosa is referring to is that so there's the base transparency requirement. And then in this zone district, like other mixed use zone districts, there are transparency alternatives to provide some flexibility.'",
        "'speaker_9': 'We've listed a pretty limited range of them here in this district. And actually the the only two that we've listed are the art and like display cases. So while design is one that's a transparency alternative that's available in other mixed use districts, but not this one.'",
        "'speaker_9': 'But I would say, you know, it would be a good example that that if it were one of the alternatives, the zoning sort of attempts to kind of set forth a very bare minimum of what you're going to have to do with this wall that would otherwise be blank in terms of design to qualify as an alternative'",
        "'speaker_9': '. And I think design review really can it is very appropriate to add an extra layer on to that. Okay. We you definitely have to meet the bare minimum. That's what zoning says. Now, how does this respond to this particular situation?'",
        "'speaker_9': 'Is it actually meeting the intent? You know, is it is it really substituting for transparency or not? And that's that's appropriate.'",
        "'speaker_8': 'So we don't get to that section through the Das zone districts. Is that correct?'",
        "'speaker_9': 'Right. Yeah. So that it's probably in there because it just happens to be on the same page as something that we that we did adjust. But it's not one of the available alternatives.'",
        "'speaker_8': 'Good. Because there's obviously some control. I was looking at some conflict between the the design and I was going to ask you, how do we rectify those those conflicts with that? So I would. Well, no, we can't even do that.'",
        "'speaker_8': 'So then that's it. Thank you for those answers. I would actually then like to talk to Dick Farley and Joel Noble on a couple of items. I want both of your guys his opinion on this. So, Joel, first, I want to thank you for mentioning the effort that it took to get here in the number of steps'",
        "'speaker_8': ', just as a point of privilege, I guess I'm going to say that is why I advocated for a 15 FTE, one and a half million dollars for CPD staff specifically to do this process in those areas that are sort of most quickly being impacted by this level of development.'",
        "'speaker_8': 'And then also then having that resource to get other areas this level of scrutiny, because we have valuable places that need to be considered. There's a lot of really great ideas here, but you only get there through all those steps that you just talked about.'",
        "'speaker_8': 'So thank you for mentioning that. And because that's important and crucial. So on the design standards, I know we're not talking about that, but there are. Can't even read my own chicken scratch. Enhanced setback language would. What about those enhanced setbacks and this is to both to you would not wear how would those not comport to existing'",
        "'speaker_8': 'zone zero setback zone districts would those all I mean would those those notions those those those strategies, would they be how closely are they able to be carried over to other existing zero setback zone districts? I think Mr. Farley might be better equipped as an architect to speak to that.'",
        "'speaker_4': 'Well, you do have a bill of his own. That's part of this district. 0 to 10 feet. And within that, you're, you know, 70% of your building facade that faces, you know, a primary street. Actually, before.'",
        "'speaker_8': 'You do that, can you explain to the to the people what the concept is on these enhanced setbacks, actually, that are part of that that are now going to be incorporated into the Stone District.'",
        "'speaker_7': 'Council? Why don't you make sure that your questions are.'",
        "'speaker_8': 'Answered before we. Okay. Because I don't know, just to do my colleagues all understand what an enhanced setback is and everyone. Okay. Never mind. Go ahead.'",
        "'speaker_4': 'Well, I'm not sure I do. The enhanced setback, as far as I know, is part of the build. Whose own? 0 to 10 feet there are in the design standards and guidelines. There are, you know, sort of a lot of standards and guidelines that encourage you to set back further the setback an additional three or five feet'",
        "'speaker_4': 'from the build to zone in order to get a larger sidewalk. Those are encouragements in the in the design standards and guidelines, in fact. Well, actually, they're more than that. There are some standards in there. I don't think you I don't know if you have a copy of the design standards and guidelines to go along with it'",
        "'speaker_4': '. But if that's what you mean by enhanced setbacks, then we're trying to encourage the development to push back a little bit and make that useful space for the public, rather than trying to create two courtyards that are largely private.'",
        "'speaker_8': 'Do you guys believe that the incentive is there, that this will get captured and to the degree that is desired?'",
        "'speaker_4': 'I'm sorry. Repeat that, please.'",
        "'speaker_8': 'Is the incentive there to do that, that you that the task force believes that this that this enhanced set back will get rid of? I said it better the first time. So there's there's there's a I believe there are features here that are generally desired at the pedestrian level.'",
        "'speaker_8': 'Do you feel that there is a sufficient enough incentive that this will this will be utilized to the degree that is desired for this zone district?'",
        "'speaker_4': 'Yeah, I think so. I think within the dialog, the design standards and guidelines within the Design Advisory Board, I think that we can achieve more of a ground level open space and step back. That means something.'",
        "'speaker_8': 'Okay. The reason. So now back to that original question, because there's there there's a lot there's there's just enough in here that I think would speak. And it speaks to the pedestrian environment regardless. I mean, any sort of urban or Main Street ish zone district, I think it has direct applicability.'",
        "'speaker_8': 'But I don't I didn't work on hammering those out. You guys did. Do you feel like they do actually have portability to others zoned districts that have zero mean similar setback requirements?'",
        "'speaker_4': 'Well, if you redo those districts, I suppose they have portability.'",
        "'speaker_8': 'But and that's why I'm asking, because the next thing is, you know, in a later meeting, I'll probably ask CPD, hey, what about a text amendment that actually captures this sort of language citywide because we have these own districts throughout.'",
        "'speaker_8': 'Yeah. So I think.'",
        "'speaker_9': 'Can I just just add a little bit of technical detail? Things stick so the the enhanced setbacks, the anticipation that word enhance setbacks doesn't exist in the text amendment. It's a concept in the in the separate design standards and guidelines.'",
        "'speaker_9': 'It's really like, what do you do when the building is not right at the sidewalk edge and the the build to range is 0 to 10 on on a lot of streets in Arapahoe Square, which is consistent with urban centers, own districts.'",
        "'speaker_9': 'But there are some specific streets that are identified in the plan and that we talked about at the task force level, especially 21st Street, which has this whole separate plan going on for it. That'll be like the the district's linear park is the way it's shaping up that those are places where we could say, oh, actually the'",
        "'speaker_9': 'build to is 0 to 20. So that's what the zoning says. So now there's some real space that you have to work with there. And what the design standards are talking about, design parents and guidelines are talking about is what do you do when you use that space?'",
        "'speaker_9': 'And I think what's what's different here, I mean, this is this is potentially portable. But there's a key difference is that we have a higher comfort level in increasing the build to range because we've got the design review process to look case by case at what's happening in that space and and ensure that it's meeting the intent'",
        "'speaker_9': 'of engaging the street, which is what the build two standard is is supposed to be doing.'",
        "'speaker_8': 'Thank you. I mean, that that answer just speaks to everything that we were just talking about. And thank you for that announcement on further questions.'",
        "'speaker_7': 'Thank you, Councilman. Go to Flynn and then Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. Abe And maybe since Kara is here, maybe she could weigh in on this also. But in looking at the the map amendment, I noticed a couple of carve outs and one of them is the 20th Street Gym, which is a Denver historic landmark building.'",
        "'speaker_4': 'But there's another Denver landmark building, the savage candy company that is included in the map amendment and also the Paris Hotel, which I'm surprised to learn is not a Denver landmark but is a national register property.'",
        "'speaker_9': 'Karen may be able to save me here. I believe the Paris Hotel is actually in the ballpark. Historic district for me. May call up on this map.'",
        "'speaker_4': 'Okay. I don't think that it is, but.'",
        "'speaker_9': 'And sorry.'",
        "'speaker_4': 'In any case, I was wondering what is the impact of the map amendment and the text amendment together on those? Well, obviously nothing on the 20th Street, Jim, but on the Sandwich Candy Company and on other perhaps eligible buildings within the Map amendment, how will this impact those?'",
        "'speaker_9': 'Sure. So the savage candy company, as you said, is a locally designated historic landmark. That means that the landmark design guidelines also apply to that building. Now, right now, the that existing Arapahoe Square design review actually spills over outside of Arapahoe Square into areas that are also designated historic districts.'",
        "'speaker_9': 'That's a little bit awkward because when there's like vacant ground or when there's buildings that are able to be torn down because they're not contributing, there might be some question about how the two guidelines interact to guide review of a new building, but we're fixing that by making sure there's no overlap between historic districts and the robust'",
        "'speaker_9': 'square design review. There will still be overlap with the The Savage Candy Company and anything else that's designated in the future. It's a little different, though, because those buildings are, you know, the they obviously are essentially contributing buildings.'",
        "'speaker_9': 'They can't be torn down. So we're not talking about new construction there. We're only talking about additions and other things that might happen on those buildings, in which case we would defer completely to the landmark review process, which is really what has a lot to say about the treatment of an existing important building.'",
        "'speaker_4': 'Okay. And you just kind of touched on or opened up the door for my other question, which was I noticed that we're giving a floor area premium for. For rehabilitation of landmarked buildings. But is there also an opportunity to give floor area a premium for rehabilitation of eligible buildings?'",
        "'speaker_4': 'It doesn't seem that that's that's addressed here. But might that encourage the preservation of some eligible buildings that aren't landmarked currently? Right. To get to give that floor area premium for that?'",
        "'speaker_9': 'Sure. One thing I'll note is that where you're looking at that floor area premium that's in the existing DEA zoning, not one of the new zone districts, and that actually that zone district only exists in there now in order to apply to the area that isn't proposed for the MAP amendment.'",
        "'speaker_9': 'Like if we had included that area, that zone district would have been struck from existence. Essentially, it's it's, you know, one of the districts that predates the 2010 form based zoning approach. That's why it has a floor, a ratio standard in it.'",
        "'speaker_9': 'And those premiums so that district doesn't will only apply essentially in this area that was continued to apply in this area here that was left out. Now, could we be doing that sort of thing in the new zone districts?'",
        "'speaker_9': 'Yes, potentially it is kind of goes back to the questions about affordable housing. And, you know, what we're trying to incentivize and and the the task force discussion that really ended up emphasizing the the streetscape and the visibility of structured parking as being what was most important to use the limited incentive power that we had available on'",
        "'speaker_9': '. There are some challenges with regard to giving premiums for eligible buildings and that sort of thing. It's primarily because until something is designated as a historic landmark, it can be torn down. And so you can see the difficulty with giving a big premium for preservation of a building that could be torn down three years later.'",
        "'speaker_9': 'Right. And so typically, most cities say, no, the premium is available only if it's designated.'",
        "'speaker_4': 'Okay. Thank you. That's all.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Catherine, back up.'",
        "'speaker_4': 'Thank you. Thank you, Mr. President. Nice to see you again, pal. Affordability. So we're building 100 acres with no affordable housing. So how large is the Gates property? Uh, I. I'm remembering about 40 acres or so. Is that true?'",
        "'speaker_4': '40 acres? Yeah.'",
        "'speaker_9': 'You know, so much. About half the size. Little less than half the size.'",
        "'speaker_4': 'So last time we discussed this affordable housing. Maybe not last time, but a few months ago, we were told that the city has like 100,000 income burdened families right now. And every time we talk, we're we're talking about affordable housing being our great challenge.'",
        "'speaker_4': 'And I love everything I'm hearing about this project. But that and since that's what I personally believe is our city's greatest challenge to give up 100 acres. I'm looking around the city trying to find where we're going to put anything approaching the number, the amount of affordable housing we need to solve the problem.'",
        "'speaker_4': 'Can you help me with that?'",
        "'speaker_9': 'Well, you know, in Councilman Brooks may have something to add, but, you know, just to know that fairly soon, ideally, you know, as the citywide approach to affordable housing moves forward, there actually will be have requirements that apply in Arapahoe Square along with, you know, everywhere else where new development is occurring.'",
        "'speaker_9': 'And what exactly that looks like. Councilman Brooks could probably tell you more about that. We did talk about, you know, affordability a lot as part of the discussion. And it really came down to, you know, once we kind of passed the point where it was clear that the task force didn't want to go in the direction of'",
        "'speaker_9': 'like literally saying you have to provide 10% of the units or whatever it's going to be that the discussion was really, let's make sure that we don't make it too expensive to develop. Let's make sure that we allow for the variety of projects like the projects that Mr. Lockhart was talking about, that might be more likely to'",
        "'speaker_9': 'provide some relatively market rate, affordable housing. And then if, you know, of course, the IHS, which may not be doing much now because so much rental is being built but does apply there now.'",
        "'speaker_4': 'Yeah, no, I understand. And I think you're alluding to your council's begun consideration of linkage fees. You know, developer impact fees. So if we don't get any affordable housing on these hundred acres. Perhaps as time goes on, we're able to arrive at that some sort of fee of that nature.'",
        "'speaker_4': 'That still permits development, but brings us some dough in to incentivize elsewhere.'",
        "'speaker_7': 'Right.'",
        "'speaker_4': 'But I'm looking for the ground where that's going to be built with the number of units that we need in the city. And I'm just having a hard time finding out where that is. So, yeah, that's that's just where I'm at right now.'",
        "'speaker_4': 'Thank you for your answer.'",
        "'speaker_1': 'Thank you. Councilman Cashman and Councilwoman Ortega.'",
        "'speaker_6': 'Well, I just want to add that I think by creating a higher density area and in creating a higher in best use opportunity, it. You know, I can remember way back when, you know, the city took a trip with a whole bunch of people with the I can't remember if is the chamber or the partnership.'",
        "'speaker_6': 'This was like 15 years ago. Everybody went to Vancouver and came back and, you know, everybody was kind of raising their hand saying, yeah, we need density in Denver and this is where we're going to have affordability. But guess what?'",
        "'speaker_6': 'That's not how it happened. Where we have seen density, we have not seen affordability. And unless we have the conversation and make it a priority, in my experience, in the absence of public policy, you you get nothing. You don't get the affordable housing unless there's public financing that goes along with it.'",
        "'speaker_6': 'It's why when we did the inclusionary housing ordinance, we set a policy for ensuring that affordability was a value that this city wanted to see with anybody building more than 30 units. And we're going to see the density in this area comparable to what's in our downtown.'",
        "'speaker_6': 'You know, the central business district. But we're placing no value and we'll see all these other pieces come through piecemeal. But we're being asked to make this commitment right now. Without that key element, knowing how critical affordable housing is for this city.'",
        "'speaker_6': 'And I think it's it's a missed opportunity. I think we have really missed the boat by not ensuring that it was, in fact, a part of what was brought forward for this council to be able to incorporate into the changes that were being asked to do now, because it's the thing that always gets left out or left'",
        "'speaker_6': 'off. And it's why we have people that are on the outside of the looking glass, you know, wishing that they could be part of all the great things that are happening in the city of Denver. But they're the families having to move away because they can't afford to live in the city.'",
        "'speaker_6': 'So I just I'm concerned that we haven't done that yet. And I hear that that's still part of the conversation. But, you know, I equate this to what we did with I-70. We gave away all the land underneath I-70 as part of an IGA, which was our only leveraging point.'",
        "'speaker_6': 'And now if there are things that we need and want for those neighborhoods, it's a hell of a lot harder to make damn sure we're taking care of those needs. And so I'm just struggling a little bit with this.'",
        "'speaker_6': 'I mean, I think the need to expand our downtown is critical. Having some big box retail is is vital to our city. Every major city you go to has, you know, some of that as part of the element.'",
        "'speaker_6': 'You know, they're incorporated into the housing developments, their incredible mixed use opportunities all across the country. But I'm just concerned we're missing the boat on that piece.'",
        "'speaker_4': 'Thanks to.'",
        "'speaker_1': 'You. Thank you. Councilman. Councilwoman. Okay, we're still on questions. Councilman Espinosa, I'm happy with you. Councilman Lopez, you got a question?'",
        "'speaker_7': 'Yes, I have a question on on particular in regards to affordability. Not maybe the city attorney's office. I could chime in on it. Can we? I think those are valid points. But can we negotiate terms of affordable housing availability units, any kind of mandates in this particular ordinance?'",
        "'speaker_6': 'But not.'",
        "'speaker_4': 'David Broadwell, assistant city attorney. I don't know if this is responsive, but you have no authority to impose rental restriction requirements as part of your regulatory authority under state law. So nothing could have been embedded in this ordinance that would have limited the rentals on any rental properties.'",
        "'speaker_4': 'They're going to be built in the area being resold tonight, currently under the Cho, which may be about to change in the near future. But currently any for sale housing would be fully subject to the Cho if something were to happen rapidly before before anything else happens to that ordinance.'",
        "'speaker_4': 'So you you have and you all know this you have extreme limitations on what you can do in terms of controlling with your police power rentals and apartment complexes. And as Councilwoman Ortega just alluded to years ago, we adopted a policy for requiring inclusionary units in for sale projects.'",
        "'speaker_4': 'Right. So those are the general public policies that guide development in any reason the property, including this free zone property, those are the limitations, those are the considerations and it's already been mentioned and it's for another night because of the limitations we face under state law.'",
        "'speaker_4': 'We're trying some new things that will be coming to this council very soon that will apply to this property when construction occurs in this property and will apply to properties all over the city that will address the issue of affordability on a global basis.'",
        "'speaker_4': 'But, you know, not to be any more redundant than that and others on council may want to comment. I know Councilman Brooks and both are heavily involved with what's coming, which will have applicability to this territory as well as other properties around the city.'",
        "'speaker_7': 'Thank you, Mr. Broadway Council President. Thank you.'",
        "'speaker_1': 'Okay. Okay. All right. So I think you had an answer for comments or did I want to get the comments or did you have a question you have questions or you want to answer? Or do you want to?'",
        "'speaker_2': 'If there is a question about how a future linkage fee might work in this area, I'm happy to answer that now or in the comment period, I felt like there was an implied question, so I'm happy to shed some light on that, if that's helpful.'",
        "'speaker_8': 'I have a question regarding that and not necessarily the linkage fee, but. I know at some point we talked about the possibility for a buildout option. Do you do we have any notion about what that would what that would be?'",
        "'speaker_8': 'Because then it would be directly applicable to development, new development in this area if there were such an option.'",
        "'speaker_2': 'So, Mr. President, with your. Thank you, Mr. President. So the way that a typical linkage fee in the one that we're anticipating would work is it's charged per square foot of development. And generally speaking, every city that we've modeled in our anticipation is that we would replicate is would have a build alternative.'",
        "'speaker_2': 'So it would basically be a conversion probably again by square foot. So for every thousand square feet, you're responsible 4.1 units perhaps. So it's it's some kind of a formula that actually creates responsibility. And so the way that it works is it's an option.'",
        "'speaker_2': 'So your default requirement is to pay, but there is an option to build. I think the way that we've discussed this with the Office of Economic Development is that if you were to build units in a situation like this, you're getting credit for those units instead of paying the fee.'",
        "'speaker_2': 'There's no subsidy from the city, but it's also probably a very small number of units. It's not near the 10% that you might get in an inclusionary project. So why is it better for the city? It's better for the city because every single development is contributing, but they're contributing a much smaller amount.'",
        "'speaker_2': 'So it's spread more evenly across the real estate market. And so in a case like this, what may happen is you may have some properties that pay the fee, you may have some properties that choose to build the units and they have no subsidy.'",
        "'speaker_2': 'And it's maybe just a small number of units. You may have other projects, however, where they actually seek to maybe they're having a hard time making their performance work. And Councilman Brooks has had several of these projects in the Wellston corridor where they may actually choose to seek out some subsidy.'",
        "'speaker_2': 'Maybe they were required to build three or four units, but if they build 20 units, they're able to get a loan from the Office of Economic Development. So there is an opportunity for us to come in later. So you may be we're obligated to build three or four units, but with a loan from OSD, you're able to'",
        "'speaker_2': 'get to ten or 20 units. And ultimately what we have the opportunity to do is not just receive linkage fees, but we actually have the opportunity to spend them. So that's one opportunity that may happen is the layering.'",
        "'speaker_2': 'That's only if you go above what the base requirement is. So the other thing I would state is that this this whole regime would then replace the inclusionary housing ordinance. So that would no longer apply on the for sale side to new projects going forward.'",
        "'speaker_2': 'But it would have similar length of affordability and contracts and things like that. So the only other thing I might add is just that when we think about this site as compared to a gate site or other sites, one of the challenges I have as a policymaker is this is not one landowner, right?'",
        "'speaker_2': 'So most of those other really big sites involve a single landowner. I think one of the most important opportunities for affordability in this area will probably be either through that layered subsidy approach with buildings that need maybe some assistance getting over the finish line and are willing to entertain affordability to help do that or for acquisition of'",
        "'speaker_2': 'actual properties, you know, for for affordable workforce housing perhaps or affordable for sale housing even. So those are those are all possibilities, but they become much more about layering the alternatives within the policy than they can be about the upfront.'",
        "'speaker_2': 'Set aside that some of our bigger projects have done when they have a single landowner, and that single landowner has decided to enter into an area wide plan, we don't have a single landowner here, so it makes it harder to do the same outcome.'",
        "'speaker_1': 'Thank you, Councilman King. All right. So, colleagues, I want to bring us back to this and see if there any more questions. And I want to get to comments which I know won't be brief. And then the reminder, there's another public hearing.'",
        "'speaker_1': 'So being respectful of people's time, I hope we continue to move forward. So see, no other questions, no club hearings, not closed comments. Councilman Brooks.'",
        "'speaker_8': 'Thank you, Mr. President. And I just want to take a little bit of time and thank some of the people in this audience who are still still sitting in these chairs and paid for parking, hopefully. So, you know, I have a ticket, a thank you for your leadership on this.'",
        "'speaker_8': 'You've been great. And Sarah Showalter, wherever you are taking care of your baby. I hope you. Thank you. You've been great as well. And Elise, you've been awesome. Thank you for your leadership. Very sharp. Really cut your teeth on Arapahoe Square is really fun to watch you make use.'",
        "'speaker_8': 'Left. But he has been an incredible facilitator. He did a great job. This is not an easy bunch. I remember one meeting in particular where, you know, John Noble, you know, Dick Farley was Chris's last name from planning board.'",
        "'speaker_8': 'Smith. Chris Smith. Incredible. We're just into this crazy zoning matter where it was and it was incredible debate and we actually had that several times. And so but developers and, you know, property owners, this was this was incredible, I will say, is probably one the one of the times I just walked into the room and said, I'm'",
        "'speaker_8': 'I am learning so much each time I come here because people just brought their expertize. And so thank you for everyone who was on the task force. I really appreciate it. And I also want to thank a person who did not who's not here with us and who did not see this through, but was very instrumental on'",
        "'speaker_8': 'the Northeast Downtown Neighborhoods Plan in 2010 and 11. And that's Carl Madison. This was something that was super important to her, cause I read her notes as I got in her office, and I am more connected to her than everyone else.'",
        "'speaker_8': 'I just want to give Carlene Madison a shout out. Wherever you are. Let's just talk about affordable housing just for 1/2, because I think one thing I think those are good points made by councilwoman can teach, especially one of the reasons we have not seen our appeals court take off is this many different landowners who are not'",
        "'speaker_8': 'really connected and there's not a real vision and brand for Arapahoe Square. But the current situation, the current housing situation in Arapahoe Square, no one is really talking about that. Well, let me talk about it real quick. Colorado Coalition for the Homeless, 200 plus units right across the street right off of park have Saint Francis these are'",
        "'speaker_8': 'these are these are permanent affordable housing units. Housing first program Saint Francis 200 plus units. Colorado Coalition for the Homeless will have another 150 units offer. Broadway Brant Snyder is building 223 units from 30 to 60% i and those are just the larger projects.'",
        "'speaker_8': 'The Denver Housing Authority has over 4 to 600 units of affordability. And so there's a current base in this area that I think is very important for us to consider when we're talking about affordability in the city. And so, you know, I want my colleagues to know it wasn't by lack of effort trying to figure out how'",
        "'speaker_8': 'do we think about mixed income housing, which is called for in the downtown northeast downtown neighborhoods plan? We don't have a lot of market rate units in this area currently. We don't have a lot of mixed income units, workforce housing units currently in this area.'",
        "'speaker_8': 'And that's what we do want. But, you know, until you're in the lab, in the lab to me means 16 months with this group of individuals trying to think of creative ways to make this happen. It's really not that easy.'",
        "'speaker_8': 'And at 30th and Blake, we're trying to make this happen and it is hard and it's a lot of hard work. We think we can come to a conclusion. The other thing I want to say is there are current entitlements under under the current DHS zoning under FHA that are pretty similar to what we just mapped.'",
        "'speaker_8': 'And that's important for folks to realize. What we did was we added incentives. What we did is, is we added design standards and guidelines, which I feel like is going to help this area and going to help the issues that we're seeing citywide of people throwing up anything they want to in in certain districts.'",
        "'speaker_8': 'And the other piece that I just want to give a lot of credit to the staff and to the task force is we had it wasn't just like we came up with these ideas and said, okay, I hope somebody builds it.'",
        "'speaker_8': 'We brought architects in and we brought developers in and we had them test everything that we put forward. And so I feel confident in this plan. I feel like there's going to be some real opportunities for all types of housing in this district.'",
        "'speaker_8': 'And I think we're going to get some beautiful developments in this district. So I'll be supporting this. And not only because I feel like it's the future of what we need to be doing in these small area plans and and mapping districts and put in design standards and guidelines.'",
        "'speaker_8': 'But because of the experts you see in the audience from our community who actually did the hard work. To make this a reality. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilman Espinosa.'",
        "'speaker_8': 'Yeah. Yeah. Just because we talked about it, I wanted to throw out what I was thinking. This is going to be gross oversimplification on the math, but it speaks to something that it's too late for this, but it's something that we should be thinking because we're working on these things.'",
        "'speaker_8': 'And so we shouldn't be. We should be more holistic when we when we approach it, because we have been throughout the 14 month process, we have had an affordable housing issue and we've been looking for solutions and we've been talking about things.'",
        "'speaker_8': 'And so this gross oversimplification actually uses the graphic that's on your screens and up on the wall. As you can see, the majority of the you know, the largest chunk is that 20 story plus. And so if I were Jesus and this is not again, this is gross oversimplification, but if it's 100 acres and it's been uniformly'",
        "'speaker_8': '12 developable stories, that's 1200 acres of potential development. Again, gross oversimplification. I know. And if you just made a 1% requirement, you would have 500,000 and you took that 12, 12, 1200 acres. You'd have 500,000 square feet of affordability if you just had a 1% on that.'",
        "'speaker_8': 'And then if that's roughly equivalent or close to where we end up with a developer fee, suddenly it starts to go, well, wait a sec, maybe we should do our build too, because the delta between getting money to do that versus what our requirement is compels us.'",
        "'speaker_8': 'And rather than have concentrated developments with those people in the 380 square foot units or those people in the Saint Francis Center, we could actually have these things mixed into this Arapahoe Square development just more organically. I mean, it's not organic because it's we're compelling it by zoning, but we're making it really one of those things that'",
        "'speaker_8': 'is very difficult to not choose because there is economy of scale. One of the reasons why you go in, you take that incentive to go to 12 and go into a point tower and stuff like that is because once you've hit certain thresholds, it just makes its starts to get cheaper to keep repeating yourself.'",
        "'speaker_8': 'Floor after floor after floor, your vertical transportation systems are already and your smoke exhaust systems are already and pressurized air pressurization system, all this stuff that goes into these buildings to make them tall, you know, doesn't it starts to pay off.'",
        "'speaker_8': 'It starts to reduce costs as you go up. And so there was certain that's unfortunate. We're not talking about till now. And so that's not going to. But but it is something that I wish we were thinking about.'",
        "'speaker_8': 'We didn't just that that was one of those maybe it was one of those models that you guys tested and go, well, wait a sec. If a developer in fact fee is at $2 a square foot, which on a $300 square foot construction project is is is, you know, is still a little one and a half percent'",
        "'speaker_8': 'and do that right. But you get it. That's actually far less than 1%. Never mind. But, you know, I don't know where we're going to end up being, but I know we modeled 7% and we modeled 1%. I mean, one mill, you know, all these different things we could maybe have said, is there a sweet spot where'",
        "'speaker_8': 'we compel development in this area to at least consider capturing affordability in their incentive to go up? And so it's just a missed opportunity, but it's not one we thought about really until now. And it's in this discussion about linkage fee and Mills is is is something that we weren't really was a notion up until recently.'",
        "'speaker_8': 'So it's too late. But I just wanted everyone to sort of recognize that this is a long, big area with a lot of potential. And there there might be a way going forward for us to think about when we do zone districts, how we might actually make that close, that gap so that we're actually getting more mixed'",
        "'speaker_8': 'use developments akin to the Verde in New York City rather than single one offs here, there and everywhere even. But there's things there, too. Anyway, I do want to thank everyone that was involved, because this is this is as you probably figured out, my time on council is sort of my ideal.'",
        "'speaker_8': 'I wish I had 14 months in in an army of CPD. And because I do have an army of community and people that would want to get involved with this so that we could do this in District one.'",
        "'speaker_8': 'But this is a great thing, and I thank you all for being a participant in that. So thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. So I recently were with a number of my colleagues and others and in the business community in the city, went on an urban exploration voyage to Brooklyn and saw how they're dealing with a lot of issues.'",
        "'speaker_4': 'And people ask me what my takeaway was from that when I got back, and what my take away from that trip was, is I came back very convinced that the need for in substantially increased density, inappropriate places. And at the same time I came back with a commitment to increased efforts of historic preservation, inappropriate places.'",
        "'speaker_4': 'This project meets for me all the requirements of increased density. I might even think that if there was anything I'd do different, it would be to go higher. And I appreciated Attorney Broadwell reminding us of the limits that we have on what we can do to affect affordability.'",
        "'speaker_4': 'You know, we can't force rental affordability. We can do it. Or our ordinances for affordability on purchased properties is limited. I get that. But my constituents and everybody I talk to around the city, they're not really interested in those details.'",
        "'speaker_4': 'They're they're interested in the fact that their parents can't downsize because there's nowhere for them to go locally. Their kids can't buy in Denver for. There's nowhere for them to go. Our teachers can't buy in Denver because they're not making enough.'",
        "'speaker_4': 'The crisis that I hear from everybody is affordable housing. And I have nothing but respect for the task force that created this plan because I believe that they did everything they could within the current realities to create this proposal.'",
        "'speaker_4': 'I just can't give up with if I was hearing anything. From people across the city, from people who want to move here about anything but affordable housing to to get zero is never a good number for me, you know.'",
        "'speaker_4': 'So to get as close to zero as we're getting in a hundred acres with literally within walking distance of of one of our largest employment zones in the city. Proximity to rail. I just can't do that. So unfortunately, while there's so much about this that I love, I'm not going to be able to support this tonight.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Captain Burke's my hop over and go to Councilman Lopez. Cosmo Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. I am going to support this moving forward. I share my same the same sentiments as my colleague, Councilman Cashman in a lot of places. Why not go higher? And especially where density is needed. You look at where we're at in this particular area and that, you know, that's that's a great opportunity.'",
        "'speaker_7': 'Yes. It's a lot of acreage. And, you know, here's the thing. We're going to need the units. You know, in order to affect a lot of different things economically, you need those units. And it is unfortunate and that we have are and are limited in terms of any kind of doing anything about affordable housing when it comes'",
        "'speaker_7': 'to rent control and and things like that. Right. I think when you look at and it's exactly what I asked our assistant city attorney, David Broadwell, that Telluride ruling looms over our head like a big dark cloud. And there's really nothing we can do on the city level about that.'",
        "'speaker_7': 'You know, except to try to build more units. And try to allow density in areas where it's appropriate. So, you know, A, is the status quo in this area acceptable? Absolutely. No, it is completely underdeveloped. And I just hope that we, as we are as as the plan has been fulfilled, as those sites are being built upon'",
        "'speaker_7': ', and as we break ground and put cranes in the air. But that perhaps. It's not just for sale development, that it's also other uses particularly. Housing for folks who. Basically are on our street and call that neighborhood home as well, too.'",
        "'speaker_7': 'So having said that, I do support this moving forward. I think it's a step in the right direction. It's something that's been, as Councilman Brooks said, talked about since I remember Carter Madsen sitting in this chair and talking about Arapahoe Square and setting that vision.'",
        "'speaker_7': 'So let's move forward. I'm supportive, Mr. President. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez. Councilman Brooks, back up.'",
        "'speaker_8': 'I just wanted to end on a note that was, you know, positive and make sure that all the folks who were involved in this project really know how groundbreaking it is and how it's it's us as a city in a direction where we're going to be able to repeat this in other small areas.'",
        "'speaker_8': 'So I want to say that. And then the last thing I want to say around affordability is, you know, in in the NHL, there's this there's this there's this loophole in downtown area and districts where you are incentivized to build higher.'",
        "'speaker_8': 'And we incentivize you to, you know, to get affordable housing. And that loophole was never taken advantage of in this district, which I find interesting. And we had this conversation in our. In our task force. And so, you know, I think it's once it gets to this stage now, now I feel like a staff person, you know'",
        "'speaker_8': ', because we went through this with 18 months. But once it gets to this stage, I think it's easy to to criticize and to say what could have been. And but until you go through the process and you sit through the meetings, until you weigh all the evidence, until you show the data, it's it's a challenge.'",
        "'speaker_8': 'And I think this group did a tremendous job and came together and was very successful. And so I just want to thank everybody involved.'",
        "'speaker_1': 'Thank you, Councilman Brooks. I will just simply and then I'll go to Councilman Brooks for the offer. His amendment. I mean, you all sincerely should be applauded for this. This is remarkable. And I think, Joy, you hit on the head.'",
        "'speaker_1': 'No argument. You're going higher and denser and no complaints whatsoever. And I think it's a testament to all the work that you put together. So it's it's unfortunate we have Monday morning quarterbacking going because I think it's yeoman's work and it's easy for us to sit here at the end and say, wait and consider this.'",
        "'speaker_1': 'And I appreciate Councilman Kenny's kind of letting us know about the linkage fees. And I agree with her reasoning for why I think it's a challenge here. So I think this is a great thing to be celebrated, and I hope that we can move this forward.'",
        "'speaker_1': 'Councilman Ortega.'",
        "'speaker_6': 'I thank you. So this this area, a large part of it was part of my old district, District nine, back when I served. And many of those lots were vacant then. So, you know, it's been an underserved part of the city for a very, very long time.'",
        "'speaker_6': 'And I think it is important that the changes move forward. My hope is that we can get there with the kind of tools that are needed that will ensure that we have some affordability. I know to be able to build, you know, it takes some subsidy, whether it's creating a special district, looking at tax increment financing.'",
        "'speaker_6': 'I'm not sure all all the various tools that you all have discussed and looked at, but many of those are financing tools that require council's approval. And my hope is that as part of any of those discussions, it includes how affordable housing.'",
        "'speaker_6': 'And in my mind, when you look at what exists in in this neighborhood. We actually saw a significant amount of affordable housing disappear in this part of the city, while at the same time we've seen more higher density housing that has come in to the area.'",
        "'speaker_6': 'Yes, a number of the projects on Walton have included affordability. But if you look at how many units were in this neighborhood that the Denver Housing Authority had, a number of those were replaced with some of the redeveloped sites that DHB owned in that area.'",
        "'speaker_6': 'So the Curtis Park Homes that was redeveloped with more affordable units. Some of those residents were allowed to come back, but it really served a different income level of population. Yes, we have shelters or nonprofits that run homeless housing development in that area.'",
        "'speaker_6': 'But I think when we start addressing the affordable housing needs, in my mind it's looking at the teachers and the police officers and people who really want to live in this city that can't afford to do that. And so I think on the very low end, we've done a good job addressing those needs.'",
        "'speaker_6': 'But I think, you know, it's looking at the different areas of the image scale that many of us have been trying to figure out how we can incentivize and encourage development to include other income levels so that more people who want to live in this city can afford to do so.'",
        "'speaker_6': 'So I'm going to be supporting this tonight because I think it's really important that these changes happen in this area. I just hope that by creating a higher and better use that the land prices don't become so outrageously expensive.'",
        "'speaker_6': 'We cannot afford to do some affordable housing in this area. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Carson.'",
        "'speaker_4': 'Thank you, Mr. President. Look, I don't think that these are public hearings. We're supposed to hear a staff presentation. We're supposed to hear comments pro and con from the public comments and questions from city council. I don't believe questions.'",
        "'speaker_4': 'These are not coronations. I don't believe that bringing up objections are Monday morning quarterbacking. I think it's my job. I could sit here and just yell Yahoo! But the people I'm representing aren't sitting at home right now feeling Yahoo!'",
        "'speaker_4': 'They have the questions that I've presented, and so I'm going to retain the right to express my opinions pro or con. It shows no disrespect to the people working on this. I think they've done a wonderful job. The people that I represent are interested in change.'",
        "'speaker_4': 'They're interested in us figuring it out. We haven't figured it out yet. A lot of people have done yeoman's work to attempt to figure it out. But I'm not going to sit here and be insulted for representing my constituents.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Cashman. You know the comments on 320. All right, Councilman Brooks, we got you. Would you like to offer your amendment to counter Bill 3 to 0?'",
        "'speaker_8': 'Yeah. Thank you, Mr. President. Move that council bill 320, be amended in the following particulars. On page one, line 27, strike two, numbers 0214 and replace. Replace it with 0214, dash 001 and on line 27. Strike the date of May 24, 2016 and replace it with the date June 27, 2016.'",
        "'speaker_1': 'Got it. It has been moved and seconded. So council members, we're now any comments on the motion to amend? CNN. All right. We're voting on the motion to amend. Madam Secretary, welcome.'",
        "'speaker_3': 'Brooks Espinosa. Flynn Gilmore. Cashman can each. LOPEZ All right. Ortega, I. Black eye, I. Mr. President.'",
        "'speaker_1': 'All. Ma'am. Secretary, please close the voting and now the results.'",
        "'speaker_3': 'Nine eyes, one abstention, nine.'",
        "'speaker_1': 'Eyes, one abstention, 320 has been amended. So now, Councilman Brooks, we need a motion to place it on final consideration and do pass as amended.'",
        "'speaker_8': 'Thank you, Mr. President. I placed council bill 324 sorry. 321 to be placed on final consideration and do pass through. Three 2324 and do pass as amended.'",
        "'speaker_1': 'Got it moved. Second. Any comments? Any more comments? Councilman Espinosa.'",
        "'speaker_8': 'I'm going to. You're going to hear me pass. And I'm going to wait to hear what my colleague Paul Cashman, is going to vote. And the reason be. And if. Sorry, Paul, but if he doesn't support it, I'm going to abstain.'",
        "'speaker_8': 'And it's not to do anything that you guys did or didn't do because the criteria is going to be there. But it is because this I do feel like this is something that can and should be captured if we can.'",
        "'speaker_8': 'So thank you.'",
        "'speaker_1': 'Thank you, Councilman. That's another. Any other comments? 320 as amended. CNN. I'm Secretary Rocco.'",
        "'speaker_3': 'Brooks. I. Espinoza. Yes. Flynn I. Gillmor I. Question can each.'",
        "'speaker_9': 'Lopez, i.'",
        "'speaker_3': 'Ortega I. Black eye.'",
        "'speaker_8': 'Espinosa abstain.'",
        "'speaker_3': 'Mr. President. High.'",
        "'speaker_1': 'Now. Secretary, please close the building. And as a result.'",
        "'speaker_3': 'It is one nay, one abstention.'",
        "'speaker_1': 'Eight I's, one nay, one abstention. 320 has passed as amended. All right, so now we've got 321. Councilman Brooks, please be accountable. 321 on the floor for final passage.'",
        "'speaker_8': 'Thank you, Mr. President. I put Council Bill 321. To be placed upon final consideration and due pass.'",
        "'speaker_1': 'It has been moved and second to any comments. 3 to 1. See none. Madam Secretary, welcome.'",
        "'speaker_3': 'BROOKS Hi, Espinosa.'",
        "'speaker_4': 'FLYNN Hi.'",
        "'speaker_3': 'Gilmore Hi, Catherine. Can each.'",
        "'speaker_7': 'LOPEZ Hi.'",
        "'speaker_3': 'ORTEGA By black.'",
        "'speaker_5': 'Eye.'",
        "'speaker_8': 'ESPINOSA Abstain.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_1': 'Hi. Madam Secretary, please, for the vote. Now, the result?'",
        "'speaker_3': '881 nay, one abstention.'",
        "'speaker_1': 'Eight eyes when they want abstention. 321 has been placed on final consideration and does pass. All right. We got our last public hearing. 395. Councilman Brooks, will you please put out the bill? 394 395 on the floor for final passage.'",
        "'speaker_8': 'Thank you, Mr. President. I put Council Bill 394 doing 95 on the floor for final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. Public hearing is now open through 95. May we have the staff report?'"
    ],
    "Approves the designation of 1899 York Street as an individual structure for preservation in Council District 9. (NEIGHBORHOODS AND PLANNING) Approves the designation of 1899 York Street as an individual structure for preservation in Council District 9. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 5-25-16.": [
        "'speaker_8': 'No. I mean.'",
        "'speaker_5': 'Good evening. My name is Karen. I'm a landmark preservation planner with community planning and development. This is for 1899 York Street Ghost Rose House. It is named after the first owner, Allen and Ghost and after Ryan Rose, who saved this property from demolition.'",
        "'speaker_5': 'It is a owner supported designation. So the ordinance was passed in 1967 for the purpose of designating, preserving and protecting, fostering civic pride, stabilizing and improving the esthetic and economic viability, and promoting good urban design. There are currently 337 individual landmarks and 52 historic districts in the city and county of Denver.'",
        "'speaker_5': 'This application actually started as a certificate of non historic status about a year ago after there was concern from historic Denver and members of the public. The certificate of non historic status was withdrawn. There was a zone layout amendment and the lot was split and the current property was purchased by Ryan Rose for the purpose of preservation'",
        "'speaker_5': '. And he is the one who submitted this landmark designation application. He understands that as a property is designated, it's designated as is. There's no need for improvements or any requirements that are that are required to be done. And he understands that any permits would require going through design review and that demolition is discouraged.'",
        "'speaker_5': 'Brian Rose is also really excited because this opportunity of being landmarked provides the opportunity for a historic preservation tax credits, which would allow for a 20% credit for any work that would be considered qualified or would meet the Secretary of the Interior standards.'",
        "'speaker_5': 'We are currently at the public hearing. It was the application was submitted in April. It went before the Landmark Preservation Commission in May. The Neighborhood and Planning Committee at the end of May. And the effective date would be the end of this week.'",
        "'speaker_5': 'All of the applicable posting and notices were put out by community planning and development, and all of the registered neighborhood organizations were notified. So this is 1899 York Street. It is on the corner of York and 20th. It's right across the street from City Park.'",
        "'speaker_5': 'It's currently zoned gr03. The applicant is Ryan Rose, and the period of significance for this particular property is 1906 to 1911, which is the time period in which Alan Ghost resided in the House. In order for a property to be designated, it has to maintain its historic and physical integrity and meet one criteria out of two of'",
        "'speaker_5': 'the following categories history, architecture and geography. And it has to relate to a historic context or theme in Denver history. For this particular property, it meets the physical and historic integrity. There have been minimal changes to the property.'",
        "'speaker_5': 'There was quite a bit of deferred maintenance from the previous property owner and is currently being worked on. The roof has just recently been replaced. There's been minimal other changes, which would really just be the garage door on the on the garage.'",
        "'speaker_5': 'Overall, it has really excellent integrity. The property also meets the criteria of history under C, having a direct and substantial association with a person or groups of persons who had influence on society. And this is primarily for Alan M Ghost.'",
        "'speaker_5': 'He was a very prominent developer. He had the AMA a m ghost company. He developed properties throughout Denver. This particular one is the Parkside Edition, which he purchased in the 1880s. He didn't really begin development on this particular property until the early 1890s in the 1800s due to the Silver Christ crash.'",
        "'speaker_5': 'This particular property was was built in 1906 as a way of selling the park site edition, which wasn't really selling. And so he intentionally built this as a showcase property to help sell his development. The property also meets architecture as a mission revival style.'",
        "'speaker_5': 'It has the shaped parapet, stucco siding, broad overhanging, eaves exposed rafter tails and arched openings, which are all strong characteristics of the mission style architecture. It is also designed by noted architects Wagner and Manning. That's a noted architectural firm.'",
        "'speaker_5': 'Wagner died in 1910 and Manning continued designing for the next several decades. They are noted for a variety of works, including the Saint Thomas Episcopal Church, which is in Parkville, and it is already a Denver landmark, as well as the Grand Avenue Methodist Episcopal Church, which is part of a current landmark landmark district.'",
        "'speaker_5': 'And then the Moffitt Mansion, which has since been demolished. It also needs. It also meets geography as having a prominent location and being an established or familiar visual feature of the contemporary city. This house is located in a prominent corner on York Street and on the corner of 20th.'",
        "'speaker_5': 'It was intentionally sited to be across from City Park. It was built as a showcase. It was noted in a lot of Denver newspapers of the time that this is one of the finest buildings that was built and it was intended to be noticed by the community then and is noticed now when you drive down York Street'",
        "'speaker_5': 'directly across from City Park. It also needs to relate to a historic context or theme. So it relates to early 20th century architecture, development and growth of Denver and then specifically the park site addition. At the Landmark Preservation Public Hearing.'",
        "'speaker_5': 'Prior to the public hearing, we received six letters of support and then we received two additional letters after the public hearing was held at the public hearing. The owner spoke for his allotted 10 minutes and then there were three speakers who are all in favor of the designation.'",
        "'speaker_5': 'The Landmark Preservation Commission reviewed it and they found that it met its historic and physical integrity, that it also met the criteria of history architecture as an embodying a architectural style and as the work of a recognized architect.'",
        "'speaker_5': 'And three having a prominent location are being an established visual feature of the city, as well as relating to historic context and theme. The Landmark Preservation Commission unanimously voted to recommend this forwarding on to City Council.'",
        "'speaker_1': 'All right. We've got two speakers. Ryan, Rose, Becca. Dear. Ciao. Sorry if I got that wrong. Mr. Rosen can go ahead and begin your.'",
        "'speaker_4': 'Good evening, counsel.'",
        "'speaker_9': 'I'd like to thank historic Denver and everybody involved in saving this property from demolition. I would also.'",
        "'speaker_8': 'Like to thank Kara.'",
        "'speaker_9': 'For all her support and help with getting this property designated. I'm Ryan Rose, the owner occupant of 1899 York Street. I am not a house flipper. This is my primary residence and I intend on staying there and doing all this work to bring this home back to its original glory.'",
        "'speaker_9': 'Ironically enough, this is the third home I've purchased from this decade. This house is very special. It was truly built by artisans and designed by an architect. I'm very thankful that this is saved from demolition. I would also like to comment on the historic tax credit and how essential.'",
        "'speaker_8': 'It is for.'",
        "'speaker_9': 'Historic homes and how grateful I am for it. As an example, restoring the tile roof cost $30,000 in that roof the last 100 years. I could have replaced it with an asphalt roof, which would have cost about $12,000 and will only last 10 to 15 years.'",
        "'speaker_9': 'So it's a great incentive to kind of balance a little bit some of those cost effects. But also it's important to be a steward of historic properties and a steward to the historic context of Denver by making these choices and honoring these homes that will last hopefully 100, 200 years longer versus the current developments which are not'",
        "'speaker_9': 'showing age very well. So. Yeah, I, I sorry. I lost my momentum there. That that's all I have to say. Thank you for everybody's time.'",
        "'speaker_1': 'Thank you. Thank you, dear. Ciao. Thank you. There. I'm sorry. I apologize.'",
        "'speaker_5': 'So good evening.'",
        "'speaker_2': 'Mr. President, and members of City Council. My name is Beckett Kershaw. I'm the preservation and research coordinator with Historic Denver, and.'",
        "'speaker_5': 'I live at 1515.'",
        "'speaker_2': 'Vine Street, so right around the corner from 1899.'",
        "'speaker_5': 'York. And for those of you who are maybe still listening at home.'",
        "'speaker_2': 'Historic Denver's a private nonprofit advocacy group dedicated to championing Denver's built environment. And tonight, we would like to offer support for this local historic designation of the Allen M Ghost House. In February 2015, Historic Denver received a notice that the previous owners of 1899 Dirk had submitted an application for a certificate of non historic status.'",
        "'speaker_2': 'This residence, which Kerry mentioned, sits across from City Park on a well-traveled thoroughfare, is an impressive structure and one which merits further conversation with the community and the owners. Further research indicated that the home was designed by the architect Harry Manning.'",
        "'speaker_5': 'And was built for one.'",
        "'speaker_2': 'Of Denver's most famous real estate developers, Alan Ghost. These details, combined with the home's prominent location across from City Park, made it clear candidate for local landmark designation. The City Park neighborhood was active and supportive, supporting the preservation of this building.'",
        "'speaker_2': 'And after several meetings with historic Denver, our board and other neighbors, the previous owners agreed to withdraw their application.'",
        "'speaker_5': 'Ultimately, they sold it to.'",
        "'speaker_2': 'The current owner who is demonstrating his commitment to preservation with this designation application.'",
        "'speaker_5': 'Excuse me.'",
        "'speaker_2': 'The successful preservation of the home along York Street serves as an important anchor for this entire block adjacent to City Park and the surrounding neighborhood. Together with the recent renovation of the former Loop restaurant, which no one saw coming, least of all me and the Parkside Manor, this block retained its historic Parkway character, which serves as the'",
        "'speaker_2': 'transition between the park and the residential neighborhood to the West. This designation also allows the owner to qualify for historic tax credits to rehabilitate this building and make it a stunning example of the mission revival style once more.'",
        "'speaker_2': 'Historic Denver would like to congratulate the new owner of his the ghost house on this step forward. And we encourage City Council to approve the landmark application to ensure the preservation of this most deserving historic building.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers. Time for questions of counsel. Counsel?'",
        "'speaker_8': 'Yeah. Thank you, Mr. President. Just one question. Maybe, Carrie, you can answer it. And it has to do with the historic tax credits. I think I ask this question in committee, but I want to ask it again, because I think it's an important subject.'",
        "'speaker_8': 'Tell me the limits that we have in our state for the state. Historic tax credits.'",
        "'speaker_5': 'So the tax credits on a it's different for between residential and commercial. The commercial has been recently increased and it's not a program that's run through the city and county of Denver. We only administer the smaller commercial tax credits as well as the residential, and those are capped at 50,000.'",
        "'speaker_8': 'Okay. $50,000 in, I believe the commercial statewide is 275.'",
        "'speaker_5': 'It's from my understanding, it is higher than that. The problem is that there's a cap to how much is allowed per year. So it's sort of on a first come first service serve basis.'",
        "'speaker_8': 'Okay, great. So and that's all about resources at the state. If we wanted to increase our capacity, that'd be we had to find some place in the budget for that to happen. But just wanted to just want to highlight that.'",
        "'speaker_8': 'Thanks.'",
        "'speaker_1': 'Thank you, Counsel Brook. You know the questions. 395. Councilman Flynn.'",
        "'speaker_4': 'Thank you. Kara, maybe could you tell me what the effect of the zone lot splitting was? I see that. What is the status and what's the. The prospects for that the remainder of the lot, which is that the sliver on the south side.'",
        "'speaker_5': 'Right. So. So it is a small sliver on the south side. In fact, that owner was one of the people who came and spoke at the LPC hearing and he wanted to ensure that the designation of this particular property wouldn't affect his.'",
        "'speaker_5': 'And when he said no, he was very supportive of it. So it's my belief that they are my understanding that they are intending to build something there. I think it's going to end up being pretty narrow, but they.'",
        "'speaker_4': 'Can they build something there. Do we know that?'",
        "'speaker_5': 'I believe they can, yes. I haven't spoken to him directly.'",
        "'speaker_4': 'All right. Thank you. That's all.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Any other questions? 395. CNN Public Enemy is not closed. Time for comments, Councilman Brooks.'",
        "'speaker_8': 'Yeah. Thank you, Mr. President. District nine is in the house tonight. This is exciting. And I'm glad that the. This is an owner supported designation. I'll just say this. I'm so supportive of this. This neighborhood is I think Facebook was going crazy around, you know, supporting this property and supporting properties like it.'",
        "'speaker_8': 'And so I for the City Park West neighborhood. But I do think there's a larger issue statewide. Some states don't have caps on their historic tax credits. And, you know, I think if there was enough support, I think statewide to start seeing commercial and and residential uses to have I'm not saying no caps, but a higher threshold'",
        "'speaker_8': '. We may be able to save some of these historic buildings and have a lot more adaptive reuse. And it just would just encourage to keep the historicity in this city. And so I just you know, I just wanted to make those comments and encourage anybody at the state to take that on.'",
        "'speaker_8': 'I do know that it does require more of our budget and there's only so many resources. And we do have TABOR in this state which limits our resources, but is something that's really important in other states are taking full advantage of.'",
        "'speaker_8': 'Thank you. I'm supportive.'",
        "'speaker_1': 'Thank you. Councilman Brooks. Councilman Espinosa.'",
        "'speaker_8': 'I just wanted to thank you. It's actually the Ghost Rose House. And I'm glad that we're attaching your name and that I assume it's going to appear in the record as being the Ghost Rose House because, well, they you know, Allen and Ghost put it on the on the planet.'",
        "'speaker_8': 'You're going to keep it there. And so just thank you for having the wherewithal and the ability and desire to do that, because I know on behalf of thousands of preservationists in District one. Thank you.'",
        "'speaker_1': 'Thank you, councilman. That's knows it. Any other comments? 395 The Nonmembers secretary.'",
        "'speaker_3': 'Brooks.'",
        "'speaker_8': 'I.'",
        "'speaker_3': 'Espinosa Hi. Flynn Hi. GILMORE Hi. Catherine.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_3': 'Can each. Ortega I black eye. Mr. President.'",
        "'speaker_1': 'All right. Madam Secretary, please, because voting now the results nine eyes, nine eyes, 395 have been placed on Fox's iteration and do pass. All right, colleagues, we got 437 that resolution. So let's first get that on the floor.'",
        "'speaker_1': 'Councilman Brooks, could you please have resolution 437 order adopted?'",
        "'speaker_8': 'Yes, Mr. President. I put resolution. I make Resolution 437 adopted.'",
        "'speaker_1': 'All right. We'll catch up with. Take that. I'll defer to Gabby. Did you have a response for us now?'"
    ],
    "Approves the Mayoral reappointments of Charlie Brown, Cheryl Cohen-Vader, and Ronald Younger to the Metro Wastewater Reclamation District Board of Directors for terms immediately and expiring on 6-30-18, or until  successors are duly appointed.  (GOVERNANCE & CHARTER REVIEW) Approves the Mayoral reappointments of Charlie Brown, Cheryl Cohen-Vader, and Ronald Younger to the Metro Wastewater Reclamation District Board of Directors for terms immediately and expiring on 6-30-18, or until  successors are duly appointed. The Committee approved filing this resolution by consent on 6-16-16.": [
        "'speaker_5': 'I did. And so I think, Councilman, until you would like me to read the current members of the board. Yes, please. Okay. So there are eight. And they are Charlie Brown, Ronald Younger, Sheryl Crow Invader, Andrew Johnson, Barbara Pols, Peter Berlin, Steve Garcia and Sally Vander Loop.'",
        "'speaker_1': 'Councilman, I take it you have come?'",
        "'speaker_6': 'Yes, I do. So I understand that the three that are up tonight are for renewal because they expire in a couple of weeks. There are a number that are scheduled to expire in 2017. And I would like to forward the conversation with the administration that because city council has always had a representative on this board that we'",
        "'speaker_6': 'should advocate to continue to do that. Councilman Flynn's predecessor, predecessor, served on that board for gosh, I can't even remember how many years he was the council representative for many years on this board. And then we had Charlie Brown serving representing city council.'",
        "'speaker_6': 'And it was a way to make sure that city council knew what was going on. It's not to say the administration doesn't always share things with us, but by having a representative, I think it's it's just another way to ensure that's part of the discussion when we have retreats and, you know, just general discussions about the current'",
        "'speaker_6': 'conditions of the city. So I am okay voting for these to move forward. But I think it's important that we have the conversation with the administration to advocate for a city council member, seated city council member on this board.'",
        "'speaker_1': 'Thank you. Councilman. I'll tell you, Councilman Lopez. Oh. Saying those comments. Okay. Think you can come up with any of the comments for three seven? Seen none. Madam Secretary, welcome to Ortega.'",
        "'speaker_6': 'I.'",
        "'speaker_3': 'Black eye. Brooks.'",
        "'speaker_8': 'I.'",
        "'speaker_3': 'Espinosa.'",
        "'speaker_8': 'I'm going to ask for a repeat of what the motion is again.'",
        "'speaker_1': 'The councilmen. It's the resolution that's on the floor.'",
        "'speaker_8': 'Pass.'",
        "'speaker_3': 'Flynn I. Gillmor I. Cashman Canete, Lopez, I. Espinosa.'",
        "'speaker_4': 'Hi.'",
        "'speaker_3': 'Mr. President. All right.'",
        "'speaker_1': 'Madam Secretary, please close Winehouse's results tonight. Ten Eyes for 37 has been adopted due to the Independence Day holiday Council will not meet next week. Our next meeting will be Monday, July 11th. We wish everyone a safe and happy 4th of July weekend.'",
        "'speaker_1': 'See, you know the business before this body. This meeting is adjourned.'"
    ]
}