{
    "A proclamation honoring Michael Eugene Somma for 35 years of service to the City and County of Denver.": [
        "'speaker_0': 'Thank you, Councilmember. Seeing no other announcements. There are no presentations, there are no communications. We did have one proclamation that was scheduled to be read this evening, but I believe we're going to postpone it. Councilmember Flynn, if you could put it on the floor and then Councilmember Sandoval asked you to make your motion to postpone it after'",
        "'speaker_0': 'we get it on the floor. Councilmember Flynn, you want to I think we'll forgo the reading of it and just move that it be adopted so that we can postpone is I believe our Madam Secretary would like us to do that, correct?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_1': 'All right. I move that the proclamation 20 dash 613 be adopted.'",
        "'speaker_0': 'Q It's been moved and seconded. Councilmember Sandoval, your motion to postpone.'",
        "'speaker_12': 'I would like to make a motion to postpone. Proclamation 20 06130613 to be moved to July 20th. Monday, July 20th.'",
        "'speaker_0': 'Thank you, Councilmember. I see that that has been seconded. And so, Madam Secretary, roll call on the phone.'",
        "'speaker_9': 'Sandoval.'",
        "'speaker_12': 'I.'",
        "'speaker_9': 'Sawyer, I. Torres, I. Black All right. CdeBaca, I. Flynn. I. Gilmore. Herndon.'",
        "'speaker_1': 'Hi.'",
        "'speaker_9': 'Hi.'",
        "'speaker_8': 'Hi.'",
        "'speaker_9': 'Cashman.'",
        "'speaker_1': 'All right.'",
        "'speaker_9': 'Can each I. Council President.'",
        "'speaker_0': 'I am secretary. Please close voting. Announce the results. 12 hours 12 as proclamation 613 has been postponed to July 20th. All right. That brings us to the bills for introduction. Madam Secretary, will you please read the bills for introduction.'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver, on behalf of itself and the Denver Workforce Development Board and Eckerd Youth Alternatives, Inc. to provide one-stop operator and comprehensive services specific to employment and training as required under Denvers Workforce Innovation and Opportunity Act (WIOA) funding. Approves a contract with Eckerd Connects for $2,500,000 and through 6-30-21 to provide one-stop operator and comprehensive services specific to employment and training as required under Denvers Workforce Innovation and Opportunity Act (WIOA) funding and other special state revenue or grant-funded workforce initiatives, citywide (OEDEV-202054623-00). The last regularly scheduled Council meeting within the 30-day review period is on 6-29-20. The Committee approved filing this item at its meeting on 6-3-20. Pursuant to Council Rule 3.7, Councilmember Herndon called out this item at the 6-15-20 meeting for a one-week postponement to 6-22-20.": [
        "'speaker_0': 'Okay. Thanks for the help. And then, Madam Secretary, first up, you put four, eight, eight on our on our screens and this one is for a vote. So, Councilmember, can you please vote Council Resolution 488 on the floor?'",
        "'speaker_9': 'Yes, I move that council resolution.'",
        "'speaker_10': '20 dash 48 be adopted.'",
        "'speaker_0': 'And Q has been moved and seconded questions or comments by members of Council Councilmember CdeBaca.'",
        "'speaker_4': 'Thank you, Mr. President. And real quick, before I explain pulling this out for the second time. For those of you who don't understand what's happening when we get bills sent to us, everything is on what they call a consent agenda.'",
        "'speaker_4': 'It comes from the mayor's office. And that means the consent agenda means an automatic yes vote from the whole block. And so unless we call things out individually, then we don't vote on them separately from the consent block.'",
        "'speaker_4': 'So it's important to watch what people call out and what they're asking about it. You can call out for questions, questions and a vote or just comments. I called this out for the second time last week. I called it out because it's a $2.5 million contract with a company called Eckerd Connects.'",
        "'speaker_4': 'This is for our work for Workforce Innovation and Opportunity Act. And this is a company out in Clearwater, Florida, that we're outsourcing our workforce to workforce development to because we can't find somebody in Denver who can do it.'",
        "'speaker_4': 'This is a company in Florida who had a $77 million contract with the state of Florida, and they were going to revoke their contracts because of their negligence with with foster youth. And so I called this out again to vote no on it, and I hope my colleagues will also vote no on this one.'",
        "'speaker_0': 'Thank you, Councilmember Councilmember Gilmore.'",
        "'speaker_7': 'Thank you, President Clark. Is Tony Anderson here from Dito or is there anybody from Dito? Okay. Well, so one of the workforce development centers that this contract would staff is the Montebello Area Taylor Building and Eckerd. I don't agree with an out of state vendor.'",
        "'speaker_7': 'We need to do better on this. But we are also in the middle of a pandemic and a lot of folks that represent Denver International Airport that worked out there, they are out of work. And with this contract, I talked to Tony Anderson on Friday and conveyed to him my dismay that there was a local provider here'",
        "'speaker_7': '. Apparently their bid was much higher than Edwards bid. And city council is never asked to to put information in to, you know, ask questions during the RFP process so we don't have a say on what qualifications they're asking for a business.'",
        "'speaker_7': 'And so this contract is for a one year amount. And I talked to Tony Anderson from our Denver Economic and Development Office and told him that we need to start now looking at that RFP process for next year, because we need to make sure that local nonprofits I can list them out.'",
        "'speaker_7': 'Struggle of Love Montebello Walks Montebello 2020. There's a whole list of organizations that could do some of this work, but the RFP process doesn't allow them to qualify or to apply because there are certain capacity levels. And so I talked to Tony and told him that now we have a little bit of time to start building up'",
        "'speaker_7': 'that capacity of local nonprofits so that they're ready to apply for this when this comes available next year. And my dilemma in voting for or against this is that we have people right now in Montebello, in Green Valley Ranch and Stapleton that need help in securing employment.'",
        "'speaker_7': 'And so those are some of the hard decisions that, you know, this could possibly take three or four more months that we wouldn't have a service provider at the moment below RFP, Taylor and at other workforce development centers.'",
        "'speaker_7': 'And so trying to weigh what the best choices are and so just wanted to share and that Tony was totally willing to convene the community to talk with the community, identify what the gaps are and that we help them build their capacity.'",
        "'speaker_7': 'And that actually could be some of those funds that we divest from DPD. We could actually provide technical assistance, training software so local nonprofits can actually apply for and get this 2.5 million right here in the community. And so I just wanted to share that.'",
        "'speaker_7': 'President Clark, thank you.'",
        "'speaker_0': 'Thank you. Councilmember Councilmember Hines.'",
        "'speaker_8': 'Thank you, Mr. President. Is there. There's no one here to talk. Okay. So one of the thoughts that I have is by voting no on this, you know, we impede the ability of people who are not employed right now to get jobs.'",
        "'speaker_8': 'I would say Councilmember Herndon did ask for this to be delayed from last week to this week so that we could get answers to questions. And if no one's here, then makes it tough for me to get answers to those questions.'",
        "'speaker_8': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmembers said walking back up.'",
        "'speaker_4': 'Yes, thank you, Mr. President. And just want to explain to people, because we use a lot of things you don't a lot of jargon. RFP is a request for proposal when the city needs a job done. We put out an RFP and let companies respond to it.'",
        "'speaker_4': 'In Denver, for this contract in particular, we had a local trusted entity, Emily Griffith, apply, and because their price was higher, we have a habit in Denver of taking the lowest bid. The price that they say that they're charging is the bid.'",
        "'speaker_4': 'And because their price for being a local trusted agency was a little bit higher. We choosing to race to the bottom and pick the lowest bid to serve our most valuable people in this city right now. And yes, in a pandemic, it's more important now than it was before, because there are many nonprofits who could step in'",
        "'speaker_4': 'now that couldn't step in before. And three months is nothing to them with the $2.5 million contract. They could do this.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Hines, you back up?'",
        "'speaker_8': 'Yes, Ms.. President. Mr. Mayor, is are we required by charter or law or anything to take the lowest bid? Is that is that one of our requirements as a city?'",
        "'speaker_4': 'Sky sought mayor's office. So there are with certain contracts. I would have to look at this. This is federal dollars.'",
        "'speaker_13': 'Flowing to us from the federal government. So there are certain conditions.'",
        "'speaker_4': 'Attached.'",
        "'speaker_5': 'To these funds. The bid we.'",
        "'speaker_4': 'Received from Emily Griffith was actually eight times higher. So it wasn't a small difference. It was a quite significant difference.'",
        "'speaker_8': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember. All right.'",
        "'speaker_1': 'Look at video.'",
        "'speaker_0': 'If we could, please. Thank you. Councilman CdeBaca, you welcome.'",
        "'speaker_4': 'Yes, thank you. And just a reminder, that's how we had private prisons running our halfway houses because their bid was lower, significantly lower. It's hard work to fulfill these bids and to do them right and to do high quality workforce development and track outcomes and do longitudinal studies.'",
        "'speaker_4': 'And so I think when you are considering what we're investing in it, the price tag shouldn't be the only thing driving our behavior.'",
        "'speaker_0': 'Thank you, Councilmember. Madam Secretary, roll call on 488.'",
        "'speaker_4': 'CDEBACA No.'",
        "'speaker_1': 'Flynn All right.'",
        "'speaker_7': 'Gilmore I. Herndon High.'",
        "'speaker_8': 'Hines No.'",
        "'speaker_9': 'Cashman I can change my. SANDOVAL. Hi. Sawyer. No. Torres, I. Black Eye Council President.'"
    ],
    "A bill for an ordinance approving a proposed Intergovernmental Agreement between the City and County of Denver and Denver Health and Hospital Authority d/b/a Denver Health Medical Center to provide for the availability of reimbursement of agency funds in accordance with the FEMA COVID-19 Grant. Approves an intergovernmental agreement with Denver Health and Hospital Authority to provide for reimbursement of funds in accordance with the FEMA COVID-19 Grant. The last regularly scheduled Council meeting within the 30-day review period is on 6-29-20. The Committee approved filing this item at its meeting on 6-2-20.": [
        "'speaker_0': 'All right, Madam Secretary, please close voting. Announce the results. 3999993 is council bill. A resolution for Haiti has been adopted. Council Member Can you please put Council Bill 495 on the floor for introduction?'",
        "'speaker_9': 'Yes, Mr. President. I move that council bill 495.'",
        "'speaker_5': 'Be.'",
        "'speaker_9': 'Introduced.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Questions or comments by members of Council. Council members member are welcome.'",
        "'speaker_4': 'Thank you. Mr. President. Called this one out because of the recent ordeal in the media with Denver Health. We know that they gave incredible bonuses to their upper level management while cutting, furloughing their employees and not treating them well throughout COVID.'",
        "'speaker_4': 'We know that they are attempting to unionize and from their leadership there has been union busting efforts misinformation, harassment and intimidation. And since we are the entity right now that will allow them to collect their dollars from federal money, I think we should put out some kind of requirement that they stop the harassment and intimidation before we'",
        "'speaker_4': 'allow them to take taxpayer money, federal dollars, to reward their bad behavior. So this is first introduction. This is first reading. And what that means with us is we get to read these twice. This is on introduction tonight.'",
        "'speaker_4': 'I always give a heads up on introduction of the thing that I'm going to vote no on or yes on later on down the road on the second reading. And so this is a heads up that this is coming to us next time for final consideration.'",
        "'speaker_4': 'And we need people to put pressure on the individuals up here to vote a particular way or get the behavior that we're asking for from Denver Health. So heads up and no today and and no next time as well.'",
        "'speaker_0': 'Thank you, Councilmember Customer.'",
        "'speaker_9': 'Thank you very much. I share Councilwoman CdeBaca.'",
        "'speaker_10': 'Concerns with the free speech, freedom of association and right to organize of the workers of Denver Health. And I think it is critical that Denver health support those workers and give them their right to organize, create a framework, labor, harmony as a way to create a framework for those workers to be able to organize without intimidation.'",
        "'speaker_10': 'And that is the type of agreement that the management can and should enter into. They are also our safety net health provider. This particular grant is to reimburse them for PPE.'",
        "'speaker_5': 'Both those health providers.'",
        "'speaker_10': 'As well as their patients, need that PPE. So for me, this is not the vote to to do, you know, a bigger conversation. I absolutely respect and honor my colleagues decision, but I stand in perfect solidarity with those workers.'",
        "'speaker_10': 'And I believe that if they need our support, we will continue to be there for them. And I do want to deliver the PPE that they and their patients need while those workers exercise their right to organize. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Councilmember Sayed, if I can you back up.'",
        "'speaker_4': 'And just a challenge to my colleagues who have not spoken to the workers on the front line PPE. They were not getting it and they have not all gotten it. Some of them have been wearing the same mask for weeks.'",
        "'speaker_4': 'They had a gallon pitcher to wash their hands at their stations with. And so talk to the workers before you make your decision on this, because the workers are telling us what is really going on and not what we want to hear.'",
        "'speaker_0': 'Thank you, Councilmember. All right, Madam Secretary, roll call on 495.'",
        "'speaker_9': 'See tobacco?'",
        "'speaker_4': 'No.'",
        "'speaker_1': 'Flynn All right.'",
        "'speaker_9': 'Gilmore I.'",
        "'speaker_1': 'Herndon I.'",
        "'speaker_9': 'Know.'",
        "'speaker_1': 'Cashman I.'",
        "'speaker_9': 'Can. Sandoval, I. Sawyer. No. Torres, I. Black Council President.'",
        "'speaker_0': 'All right, Madam Secretary, please close voting up the results.'",
        "'speaker_9': 'Three days. Nine eyes.'"
    ],
    "A bill for an ordinance authorizing a cash transfer from the City Council Special Revenue Fund to the General Fund and making an appropriation in the General Fund.  Approves a cash transfer of $143,146 from the City Council Special Revenue Fund and an appropriation in General Fund Contingency to meet a portion of City Councils 2020 mid-year reduction target. The Committee approved filing this item at its meeting on 6-2-20.": [
        "'speaker_0': 'Nine eyes, three nays. Accountable for 95 has been introduced. Ladies and gentlemen, if you could, please, so that we can get through the rest of these. Thank you. Councilmember Canete, will you please vote count about 504 on the floor.'",
        "'speaker_9': 'Yeah, I move that council bill 20 20504 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Questions or comments from members of Council Councilmember CdeBaca.'",
        "'speaker_4': 'Thank you, Mr. President. Can you clarify what this is for real quick before I make my comment?'",
        "'speaker_0': 'I'm sorry. Who are you directing your question to?'",
        "'speaker_4': 'To you.'",
        "'speaker_0': 'You called out.'",
        "'speaker_4': 'It's the special revenue.'",
        "'speaker_0': 'So this is part of our.'",
        "'speaker_5': 'This is our.'",
        "'speaker_4': 'Furlough.'",
        "'speaker_0': 'No, this is not. This is part of your budget. Anything you didn't spend last year, if we don't vote on this, it goes into the general fund. This puts it back in your office budget for this year.'",
        "'speaker_4': 'Okay. And so does this have any connection to the dollars that we were supposed to sequester? Will we have to sequester this once we get it back?'",
        "'speaker_0': 'No, this is moving in. Councilmember Gilmore has our budget and she's flagging me as I'm going to. We'll let her answer that in case.'",
        "'speaker_7': 'Thank you, President Clark. Councilwoman CdeBaca, this transfer is a portion of the special revenue fund that was allocated for the 4% sequester from the central office. And then it's a portion of Councilwoman Torres, my office, Councilwoman Sandoval's office.'",
        "'speaker_7': 'The 4% that city council was sequestering was $7,979. And so this is a portion of some of those offices using their special revenue fund to use that for the 4% sequester. So like your office isn't included in this because I believe your office well, you aren't participating, but so the other offices there may be taking that 4%'",
        "'speaker_7': 'out of their services and supplies. And so we won't see that come forward.'",
        "'speaker_4': 'Awesome. Thank you very much. I wanted to clarify that because as you all are looking at your budgets, take a look at what city council budget is for us to operate 13 offices. There's a reason why some of you don't get callbacks or responses on email, and it's because our executive branch of government keeps our branch of'",
        "'speaker_4': 'government. That's supposed to be the check and balance starved so that we can't respond, so that we can't do these things. And so we were asked by the administration, even though we're not required to furlough, we were asked to furlough and to set aside budget cuts.'",
        "'speaker_4': 'And this is part of what some of those offices had decided to give or not give up. I chose not to because our office receives the highest volume of everything that happens in this city, and we need more staff than we currently have.'",
        "'speaker_4': 'We don't need to be cut. And so I wanted to explain that to you all and make sure that you understand that balance. Government requires balanced budgets and independently elected branches of government should have can measure its size budgets.'",
        "'speaker_4': 'So pay attention to that as you guys are scanning this information because it's critical. Thank you.'",
        "'speaker_0': 'Thank you. And I apologize. Thank you, Councilmember Gilmore, for stepping in there, Councilman Hines.'",
        "'speaker_8': 'But thank you, Mr. President. Just to echo Councilmember CdeBaca point, the woman in the front to the BlackLivesMatter shirt, I'm sorry that I did not respond to you. There is me, one person who is sick and one person who took voluntary furloughs this past week.'",
        "'speaker_8': 'And so and that's it. That's that's all we got. So just to councilmember said about this point, we are we are very lean and we try to do as much as we can with what we have. But but we are very lean.'",
        "'speaker_8': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember. All right. Madam Secretary, roll call on 504.'",
        "'speaker_9': 'CdeBaca, I.'",
        "'speaker_1': 'Flynn I.'",
        "'speaker_7': 'Gilmore I.'",
        "'speaker_1': 'Herndon High.'",
        "'speaker_9': 'Heights.'",
        "'speaker_8': 'High.'",
        "'speaker_6': 'Cashman High.'",
        "'speaker_9': 'Can I.'",
        "'speaker_12': 'Sandoval, I.'",
        "'speaker_9': 'Sawyer I. Torres I. Black I. Mr. President. Hi.'",
        "'speaker_0': 'Madam Secretary. Please go to voting and note the results.'",
        "'speaker_9': 'To.'"
    ],
    "A bill for an ordinance approving a proposed Sixth Amendatory Agreement between the City and County of Denver and State of Colorado Judicial Department, to pay for personnel to provide a school based gang prevention program. Amends an agreement with the Colorado State Judicial Department by adding $75,807.82 for a new total of $999,637.73 and six months for a new end date of 6-30-20 to continue the work of the Gang Reduction Initiative of Denver (GRID) program, citywide (SAFTY-201100301; SAFTY-201952991). The last regularly scheduled Council meeting within the 30-day review period is on 6-29-20. The Committee approved filing this item at its meeting on 6-3-20.": [
        "'speaker_0': 'Advise by his council. Bill 504 has passed. Councilmember candidate, will you please vote? Council Bill 508 on the floor.'",
        "'speaker_9': 'Yes, Mr. President. I move that council bill 20 20508 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Questions or comments by members of council is called up by two members. So, Councilmember Gilmore, you wanna go first on this one?'",
        "'speaker_7': 'Sure. Thank you, President. Clerk. We talked about this last week when it was on first reading, and I was very supportive of school board director Tate Anderson and Jennifer Bacon in ending the contract with the Denver Police Department for police officers to be within our schools and in learning more about this contract.'",
        "'speaker_7': 'There's no way I can support it. This will put two full time probation officers within Denver public schools, and there's no place for probation officers to be within our schools. If it was shared that, you know, we have a long history of kids who are having maybe issues at home, being bullied at school.'",
        "'speaker_7': 'We take away the very things that give them joy. Maybe, you know, hanging out at recess with their friends, being able to go to afterschool programs, even being in gym. And that was a question that I posed last week.'",
        "'speaker_7': 'Shouldn't these students be in school? They should be in their class. They shouldn't have that added stigma of when you're out of class, everybody else knows you're going to see your probation officer. That is not the sort of system that I want to support that I will support anymore.'",
        "'speaker_7': 'And so that's why I'm voting against this. Thank you, President.'",
        "'speaker_0': 'Council member. Councilmember CdeBaca.'",
        "'speaker_4': 'Thank you, Mr. President. Called it out again because I don't believe we need probation officers in schools. I don't believe that this is the way we should be doing gang reduction and intervention. And I think we need a new model.'",
        "'speaker_4': 'There's not enough pieces of data to prove to us that this program has worked over the years, and the fact that none of the data is public is the problem. And so I'm a no again.'",
        "'speaker_0': 'Thank you, Councilmember Councilmember. Sorry.'",
        "'speaker_10': 'Thank you. I have to echo exactly what both of my fellow councilmembers just said, but I do share a concern when the DPS contract for Saros was canceled. What they did was they they gave it a year rate.'",
        "'speaker_10': 'So it's canceled as of end of June 2021. And the reason that they did that was to have some lead time to prepare responsibly for what comes next. And I'm and not having had a conversation in committee on what comes next here, if it were not to pass, I'm wondering if it's possible, if my councilmembers would be'",
        "'speaker_10': 'willing to have an entertain a discussion about potentially re referring this to committee to have a discussion about whether it's worthwhile to move this forward or put a different end date on it or something like that, so that there's the potential to ensure that there's an ending that makes sense as opposed to just canceling it without something'",
        "'speaker_10': 'filled in. If not, that's okay. I don't support it, but I just wanted to put it out there as a potential option on the table. So thanks.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Torres.'",
        "'speaker_9': 'Thank you so much, Michael. Thanks for coming up. If you can answer a couple questions that I have about this contract, what funding source funds it?'",
        "'speaker_1': 'Great question. Council President Clark, Members of Council Michael Sapp, Department of Safety. This is a contract with the Colorado State Judicial and we contract with them to fund our two FTE positions in probation.'",
        "'speaker_9': 'So the state passes funding to us that we then employ two folks.'",
        "'speaker_1': 'That is correct.'",
        "'speaker_9': 'And do they operate in the capacity of probation officers?'",
        "'speaker_1': 'Yeah. And I actually I have colleagues here who administer the program. We we consider it. And more peace officers. And. Yeah. Yeah, that's right. So. So. So. It's more than just this. This is actually. And this is the honest to God truth.'",
        "'speaker_1': 'Our ability to try to in that school to prison pipeline. Because this contract is embedded with a network of community providers like struggle of like the Dream Center, nonprofits that do the work every day, that can go into the home, assess a family, need to understand is a is a is a child are a chore because they'",
        "'speaker_1': 'don't have food or they don't have a good family structure. This this contract goes above and beyond to provide those services. And that's because it's a part of the grid network. And so that that's the more than just probation officers.'",
        "'speaker_1': 'And and if folks have if folks have questions or need more clarification on the scope of work, I have folks here from state judicial that can answer that question on their scope.'",
        "'speaker_9': 'So my my my problem with this is that the timeline has already it's coming up next week for the end of this contract.'",
        "'speaker_1': 'Yes. Councilman, I'm glad you brought that up. I actually think commit, commit, Councilman Sawyer, for that suggestion. This contract that you all are voting on, it's not a new contract. So this doesn't this isn't the alternative to sanral's.'",
        "'speaker_1': 'This is paying for. Scope of work from January one through June 30th. So this is just to pay off our invoice.'",
        "'speaker_9': 'And I get that we're we're being asked to fund something that's already been happening. And for a contract to come through that after the work has started puts us in a difficult position. I know one of the great staff members among the council districts, they're more often in line and and that both has me concerned for the'",
        "'speaker_9': 'state of those schools as well as the state of this contract. I'm. I'm troubled that we're being asked to approve a contract when it's already over. You are already need to pay the invoices. This is paying people's salaries, right?'",
        "'speaker_9': 'What happens if.'",
        "'speaker_1': 'There's a reason for that? And I appreciate Councilman CdeBaca calling this out, because we do need more context with the grant, with the great wealth, with these programs, especially in light of the SRO conversation. But because of the coronavirus, we were actually in conversations to take this contract to city council back in February.'",
        "'speaker_1': 'And the goal was because we reached that million dollar threshold, we were going to split the two contracts out. Right now we're at we're asking you all to fund the two FTE. We were going to split the great program in the gun case, probation officer, into two separate contracts.'",
        "'speaker_1': 'But we're going to do an RFP, we're going to do a sole source contract and the pandemic hit. And that's honest to God, truth. And so it delayed or delayed our efforts. And then with school calls end, we really are probation officers really had until like January.'",
        "'speaker_1': 'It's about mid-March until the stay at home orders hit. And so that that's. And in that sense, that's kind of why the contract is here today.'",
        "'speaker_9': 'And will you correct me if I'm wrong about the the role of the Greeks staff members? The one that I spoke to did not verify that they do probation work. They're doing curriculum directly with teachers in the classroom.'",
        "'speaker_9': 'So they're not pulling kids out to have a probation meeting with kids. It's curriculum within the school district's curriculum. Am I correct.'",
        "'speaker_1': 'That? Yeah. I'm actually going to bring my colleague up from the state to talk about the great program.'",
        "'speaker_13': 'Good evening. Araceli Raskin, probation supervisor. I supervised Miss Deborah Garcia Sandoval, who has been in in in the school district since 2011, 2012. When we started, we've been in 40 different schools, and total numbers of students that we've impacted is 9523 students.'",
        "'speaker_13': 'In response to Councilwoman Torres's question is we do not pool. And I think there was some miscommunication information last week. We don't pull the children out of the the school. And it's an extracurricular activity. This is actually part of their regular curriculum throughout the the day we get credit, we get the National Great Program.'",
        "'speaker_13': 'The model is has been given credit to be a certified program. So they get their social studies credit. And this is up to the point of teaching the curriculum. We've developed the relationships with the schools. Sometimes schools call us because maybe they have some bullying issues going on or some type of different for one reason or another'",
        "'speaker_13': '. So that's why they they reach out to us, the probation officer in that capacity, Ms.. Garcia Sandoval, is not there as the role of the probation officer. She's there delivering this curriculum that she's been trained in. And if you look at the great model, that's the best concept is its most effective one.'",
        "'speaker_13': 'It's part of the school program we've tried doing like afterschool programing and it just doesn't work. And we also do part of this is also the great officer does a lot of stuff with the families and in the summer we've been in, I believe you guys received an email earlier today and I know you've heard a lot'",
        "'speaker_13': 'of information, but I just want to reiterate reiterate that we are in in different districts all over the city. We have Council Gilmore's school district nine schools. The store is nine schools. We were recently in. Mr. CASHMAN'S School District.'",
        "'speaker_13': 'Mr. FLYNN So another six schools. So out of these 40, 40 schools, we've seen a lot of positive results. And I would just encourage you guys and to support this program because it is beneficial to the community and to the students.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_9': 'I'll just end with me.'",
        "'speaker_0': 'Ladies and gentlemen, please. This is the councilmembers turn to ask questions, please. Councilman Torres's homework.'",
        "'speaker_9': 'Just a commentary. Just knowing Miss Deborah, having met her and worked with her for a number of years. She's an incredible individual. Where I feel like we're put into a corner is approving a timeframe that's nearly done. And I'd like to make sure that we're looking at both the curriculum, some of the testing and feedback that you've'",
        "'speaker_9': 'gotten. And I know that you did testing that was done by Temple University. I'd like to see the results of that and what was asked and how timely it's been before we consider a renewal.'",
        "'speaker_1': 'Councilwoman tours are happy, too, to provide that information to you. Happy to provide that information to you.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you. Anything else, Councilmember Torres? Thank you. Councilmember Hines.'",
        "'speaker_8': 'Thank you, Mr. President. So for, uh, for the people in the audience, we have talked about how this is a strong mayor city and we have limited authority. One of the things that is a limitation of city council is we either say yes or no to this contract.'",
        "'speaker_8': 'We can't amend it. So what Councilmember Sawyer is considering is is referring it back to committee so that we could then talk about it and potentially bring amendments. So just to say, you know, like that's that's part of our our frustration and to Councilmember CdeBaca is point about private prisons.'",
        "'speaker_8': 'We had that conversation. We said, can we amend it? Can we change the terms? And the answer was no. So we ultimately said no to private prisons in the city. So.'",
        "'speaker_1': 'You know, Councilman Hines, I normally I normally don't disagree. I'd like to reserve my disagreements in private, but I respectfully disagree. I think that what we're seeing here is a paradigm between executive and the legislative branch and the power that you all have.'",
        "'speaker_1': 'We're standing here for two FTE positions and you have the power to vote that contract down and you have the power to call the executive branch back in to a committee meeting. Well, we can work on language together.'",
        "'speaker_1': 'And so that's the beauty ness of our city that doesn't quite honestly get talked about. And I would hope that we're such a divided country right now. US versus them, you've got to pick a side. Yeah, I'm a black man.'",
        "'speaker_0': 'Well, ladies and gentlemen, ladies and gentlemen, ladies and gentlemen, we let everyone have their time at the microphone.'",
        "'speaker_1': 'Please. But I can take it, though. I'm a black man for my bill. I've been called an Uncle Tom because I work for the Department of Safety, and I'm good with it because it takes people in the system to fix the system.'",
        "'speaker_1': 'And that's all I'm trying to do.'",
        "'speaker_0': 'Yeah. Ladies and gentlemen, please. The microphone blowing out my self.'",
        "'speaker_1': 'Sounds good. So, Councilman Hines, that's all I'm saying. And I respect you, sir. We've been on. We demonstrated together. I just. I just want to this some point figure out how do we heal to Councilwoman Sandoval point? How do we deal?'",
        "'speaker_1': 'How do we come together? I'm looking to try to get us there. That's all I want to say.'",
        "'speaker_0': 'The ladies and gentlemen, please are you have more.'",
        "'speaker_8': 'I just one one more comment. I think I would echo Councilmember Torres his point about when we get contracts at the end of it passing us, that doesn't really sound like collaboration. That sounds like.'",
        "'speaker_1': 'We're going to need.'",
        "'speaker_8': 'It and we're going to like it.'",
        "'speaker_1': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilmember CAVANAUGH.'",
        "'speaker_1': 'Councilman Hines, that's fair. And I and I own that. We can do better. We will do better. We got hit with a pandemic and that and then that. I own it and I own that. And I accept that we could have did better.'",
        "'speaker_0': 'I think. Councilmember Cashman.'",
        "'speaker_1': 'Thank you, Mr.. Mr. President. Michael. So we're being asked tonight to pay for the past six months of work, correct? Correct. Okay. So when would were we looking to get a contract? I'm assuming you would like this program to continue.'",
        "'speaker_1': 'So I'm wondering when that contract was going to come before us. Yeah. And that's why I like Councilman Sawyer's proposal of getting this contract through, paying for invoice, and then going back to the safety committee, which he chair and having a dialog around what a sole source contract looks like, what an RFP contract looks like.'",
        "'speaker_1': 'What does it look like to have probation officers in our schools? Because the reality is the reality is, is that there are young people, unfortunately, that do bring guns into our schools. And so I want to have that conversation.'",
        "'speaker_1': 'Sounds good. Please allow. This is my time to ask questions. Yes, please. Yeah. So that sounds good. So. So I'm looking forward to that conversation, right? Because we do want to come back to city council. I do want to have a conversation in committee with what the future of the great what the future of our gun case'",
        "'speaker_1': 'probation officer looks like moving forward. Well, if I can clarify with my my colleague, Councilman Sawyer.'",
        "'speaker_0': 'What I hear.'",
        "'speaker_1': 'Mr. Sharp saying is that you wanted to approve this and then go back to committee. Is that correct? Or do you want to just send this whole this contract back to committee rather than approve it?'",
        "'speaker_10': 'That's actually why I rang and again and I'm right behind you in the queue because I wanted to ask whether like how exactly we would do this because of the fact that this is I don't I don't want people who've done work to not get paid.'",
        "'speaker_10': 'We if we've if people have done work, they need to get paid for the work that they have done. It's not fair for us to withhold money from people who have done a hard day's work or hard six months work for political reasons.'",
        "'speaker_10': 'That's not okay. So if that's what we're talking about doing here, then that's not acceptable to me. So then I think that what we need to do is support this contract and then have a conversation about how we come to safety committee and, and, and have this conversation about how we make this change moving forward.'",
        "'speaker_10': 'If that's what if that's the option here based on the situation we've been put in, which I'm going to go on record as saying is not okay. Yeah, I get it and I get all the things. But it's it's also not okay that people have done a hard day's work and that we're not going to we're talking'",
        "'speaker_10': 'about not paying them for it.'",
        "'speaker_1': 'Yeah. So. So. So. Councilwoman Sawyer.'",
        "'speaker_0': 'Ladies and gentlemen, this is time for council to ask questions. And for the person out there, I please ask that you keep your comments. We. We listened to you. Please let us listen to them. You are. Mr. Sapp, did you have anything that I just.'",
        "'speaker_1': 'I just wanted to say. I just wanted to say for the record, too, Councilman Sawyer. Councilman Cashman. Councilman Torres, I apologize for putting this branch in this particular situation. I own it, too. Councilwoman Gilmer, we've got to do better and we must do better.'",
        "'speaker_1': 'And so we hear you. And I think we get these contracts, too, so we can pay our invoices. And we have the difficult conversation in committee about what the future of Grid looks like. In particular, these two probation contracts.'",
        "'speaker_0': 'Councilmember Cashman, do you have follow up to your answer from Councilmember Sawyer or from.'",
        "'speaker_1': 'Councilman Sawyer's position is clear to me. And I would just tell Mr. Sharpe that we need to get this thing to safety as soon as possible. And if this does pass tonight, which is as much heartburn as it presents.'",
        "'speaker_1': 'Being asked to either pay people who've already done work or not. I'm inclined to pay them. But excuse me if this is my time on the dais. Excuse me. This is my time.'",
        "'speaker_0': 'Ladies and gentlemen, please, please, please. Councilmember Cashman, the floor.'",
        "'speaker_1': 'Is trying to do the work you want us to do. Thank you. You had your turn. So.'",
        "'speaker_0': 'Michael. I will. Ladies and gentlemen, please.'",
        "'speaker_1': 'Please.'",
        "'speaker_0': 'Councilmember Cashman.'",
        "'speaker_1': 'Ready when you're ready. We will work with you and get it on the agenda right away. But my. I'm not going to be blackmailed again. Yeah, okay. So if. When now.'",
        "'speaker_3': 'We're gonna. Hades and gentlemen.'",
        "'speaker_0': 'Ladies and gentlemen, please.'",
        "'speaker_1': 'Not not not paying people who have done work for. Come in, please. Unfortunately. Unfortunately, unfortunately. Well, while I understand.'",
        "'speaker_0': 'Ladies and gentlemen. Well, I.'",
        "'speaker_1': 'Understand. Well, I understand the heartburn that this creates there. There's not an option to ask Mr. Sapp to pay out of his pocket for the work that was done. I. But. All right. I think I think I think it's I think it's fair to say I think it's fair to say that the frustration shouldn't be directed at'",
        "'speaker_1': 'Councilman Cashman, Hines said. All right. I can take it.'",
        "'speaker_0': 'Yup. Can't remember Kashmir. Anything further?'",
        "'speaker_1': 'Oh, no. We'll get we'll get this matter on the safety agenda. Thank you for that. If you will be in touch with staff tomorrow to get that set up. Councilmember Flynn, fingers are present. Michael what happens on July 1st with this program?'",
        "'speaker_1': 'It comes to a conclusion. I mean, at least the contract stuff's right. So what happens to the program? The program, the great program will carry on. The two FTE positions will no longer. They will pretty much cease. All right.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. All right. Have a number of council members back in the queue. Councilmember CdeBaca.'",
        "'speaker_4': 'A couple of questions. So this. So last week you told us when we mentioned other nonprofit organizations that are doing this work, you mentioned that they are doing the work just under. You guys are paying them out of your professional services budget and not out of a contract.'",
        "'speaker_4': 'Is there not a way that you guys could pay out of your professional services budget rather than a contract that implies that we had some kind of approval over this?'",
        "'speaker_1': 'Yes. Yes, yes.'",
        "'speaker_4': 'Second question. Second question. Considering this was for the last five months and we've been in quarantine for months and schools have been canceled since March. What did we pay them to do exactly?'",
        "'speaker_1': 'Great question. So I'm asking. I'm answer your first part and then I'm as shot calling our chief probation officer to answer your second part. So, yes, so part of part of this program is paid out of out of our professional funds.'",
        "'speaker_1': 'That's circle of impact, empowerment, the drink center. And a lot a lot of times those organizations, for example, struggle to love. I know they've worked with Councilman Gilmore to provide full PPE gear to folks of Marbella Grande Valley Ranch.'",
        "'speaker_1': 'We're always looking for providers and to kind of help fill those voids. And so I do I do echoed the sentiment around how do we how do we increase that bench of nonprofit providers to help close those gaps, particularly in Globeville or Swansea or Marbella or the southwest quadrant of our city?'",
        "'speaker_4': 'Well, I've shared this concern here because, you know, I went to a school that was, you know, the only school that had metal detectors at the time. You know, we had excessive amounts of cops in there. I, I taught I ran programing for students at that same school.'",
        "'speaker_4': 'And when we had situations where kids were wrongly accused of having a gun. No amount of surveillance in their school, no amount of sorrows or probation officers working with them or curriculum that they received helped us get the data and information to exonerate them.'",
        "'speaker_4': 'It you know what it all did? It helped fast track their case and criminalized them with records that they carried for the rest of their life.'",
        "'speaker_3': 'And. And so.'",
        "'speaker_4': 'And so if we have a curriculum here, I don't know what it looks like. And I don't 100% believe that gang reduction is done through curriculum. If we have a curriculum, why don't we just pay for the curriculum and give it to our teachers for them to implement?'",
        "'speaker_4': 'Perhaps that's where Sean can explain to us what they were doing for the last six months. So when COVID hit.'",
        "'speaker_0': 'I'm sorry, could you just introduce yourself with.'",
        "'speaker_7': 'Our Sean Penn?'",
        "'speaker_4': 'With probation? When COVID hit and the schools closed, we pulled that.'",
        "'speaker_10': 'Position and we no longer were funding it through the city. So in the information.'",
        "'speaker_4': 'That Michael sent you on the budget, you could see there was like that. I think it was around $23,000.'",
        "'speaker_10': 'That was unused because I didn't feel I.'",
        "'speaker_4': 'Agree with you. It was not it didn't feel ethical by any means for us to be still receiving money when we could not do the curriculum.'",
        "'speaker_7': 'And so.'",
        "'speaker_0': 'Ladies and gentlemen, please, please, please.'",
        "'speaker_10': 'So the other.'",
        "'speaker_4': 'Piece about this program in this curriculum.'",
        "'speaker_10': 'Is that none.'",
        "'speaker_4': 'Of these kids are on probation. These are elementary school kids that were in there trying to do a curriculum.'",
        "'speaker_0': 'Ladies and gentlemen, we cannot hear the answer to the council members question.'",
        "'speaker_4': 'I think I'm not asking about the curriculum at this point. At this point, if you canceled the posting and we've been in quarantine and schools been canceled and this contract was supposed to have been executed and completed by next week and we're signing it today.'",
        "'speaker_4': 'Can you explain to me what this $75,000 is paying for? It is paying for the other position. That is the intensive supervision for our youth that have picked up handgun cases. So those kids are they are probation kids.'",
        "'speaker_4': 'We are working with community agencies, partnering with them to help slow that progression into division of youth services and out-of-home placement. And we have seen a tremendous increase in our success rate with that population, which I can share that data since you had asked for some more back, but it's retroactive.'",
        "'speaker_4': 'You're saying that that one person did the work between now and quarantine, starting now, that one person we we have still been actively supervising those handgun case kids on probation all throughout quarantine. We have been conducting home visits.'",
        "'speaker_4': 'We have been doing Zoom Skype similar to what the rest of the world is doing. They were still all receiving therapy.'",
        "'speaker_0': 'Ladies and gentlemen, we cannot hear the answer to the question. The council member has.'",
        "'speaker_4': 'Continued that position, continue to go because we couldn't just stop the services for those youth. It was the in-school position that did the curriculum, the great curriculum that we suspended those services due to COVID. So the $75,000 is not for two FTE, as I mentioned earlier, it is for two FTE up until was it March and then'",
        "'speaker_4': 'it's just the remainder is for the one. So. We entered into this under the guise that we had a contract. And so we started the services and we worked knowing that the contract was going through the process. And so that's kind of where we are today.'",
        "'speaker_4': 'And so just a quick question for Mr. Sapp. During COVID, we processed many contracts that were non-covid related, including multimillion dollar contracts for entertainment companies while all of their events were being canceled. And so can you explain to me why this didn't get on that laundry list of things to do that was being sent to us by'",
        "'speaker_4': 'the mayor during COVID?'",
        "'speaker_1': 'Yeah, I mean, that's a great question, Councilwoman. And I can I could say everything that comes to my head, and I just I want to be completely transparent. We missed the mark and. Ladies and gentlemen, please. Thank you.'",
        "'speaker_1': 'And so, yeah, I can give you a whole laundry list I can give you.'",
        "'speaker_0': 'Ladies and gentlemen, we cannot hear the answer to the question. Please.'",
        "'speaker_7': 'I'm good.'",
        "'speaker_0': 'You're good to Councilwoman. Thank you, Councilmember Gilmore.'",
        "'speaker_7': 'Thank you, President Clark. So we're elementary schools. The only schools that these fees are located in.'",
        "'speaker_13': 'No middle middle school curriculum as well. So the main a majority is elementary school. But I can list all the names of the schools.'",
        "'speaker_7': 'Could you please? I think that.'",
        "'speaker_13': 'The audience misunderstands what the great program is. I feel like they're giving us a lot of misinformation.'",
        "'speaker_7': 'Please list out the school.'",
        "'speaker_0': 'Ladies and gentlemen, we can't hear the question.'",
        "'speaker_7': 'Please list out the schools in District 11 that these two individuals who are state of Colorado employees that I can assure you they have been paid. They are not waiting for city council to vote on this before those employees get paid.'",
        "'speaker_7': 'And I would just appreciate you listing out the schools in District 11.'",
        "'speaker_13': 'Please tell me the names of the council people.'",
        "'speaker_7': 'Stacy Gilmore, District 11. Oh, okay.'",
        "'speaker_13': 'So District 11, sorry, I have them by name. Gilmore eight schools. MLK Early College. Middle School. Strive Montebello. DCI Montebello. Oakland Elementary, Florida. Pitt. Waller Elementary, Florida. Pitt Waller Middle School. KIPP Northeast Middle School.'",
        "'speaker_1': 'And Then Vista Academy.'",
        "'speaker_13': 'And Vista Academy.'",
        "'speaker_7': 'Thank you. So I have never been contacted by a parent, by a student, by anyone associated with this program telling me they saved our family. They made a difference in our lives. And if this program is supposed to be the be all, end all, it's missing the mark.'",
        "'speaker_7': 'Because I can tell you, for the last nine months, we have dealt with serious. Serious. And Michael, you know this. We've been at the vigils together in Green Valley Ranch with what's been happening at Martin Luther King in GR so and were asked to retroactively vote on this.'",
        "'speaker_7': 'You could have brought this to us in October or November, December. And we could have and we could have through our committee process of asked these questions of gotten your data, the evaluation, how much of a difference this makes.'",
        "'speaker_7': 'And it's so disrespectful. Like, we're not even respected as a councilperson that you're going to trust us to ask these questions. It's brought to us when it's almost up and then we're expected. I mean, I don't even have enough information now because if you're telling me January, February, March, we had two lefties on an April, May and'",
        "'speaker_7': 'June because of COVID. We had one left. I've looked through all the documentation. I don't know what those lefties are paid. I don't have a pro-rated amount of anything. I mean, I. I will defer my time. President Clark, I'm still a no on this, and I'm not quite sure how we refrain.'",
        "'speaker_7': 'This back to committee is going to make a difference because it's retroactive. I would suggest that the Department of Safety eat this cost.'",
        "'speaker_0': 'I don't remember Councilmember Hines.'",
        "'speaker_1': 'Well.'",
        "'speaker_0': 'Did you have a question in there or did you?'",
        "'speaker_7': 'I'm good, thanks.'",
        "'speaker_8': 'Will you please list the schools in District ten? Chris Hines.'",
        "'speaker_4': 'You might as well read all of them. Oh, can.'",
        "'speaker_13': 'I read them all? And that way, Councilwoman Sandoval, I have Horace Mann, Middle School, Travis, the Sunnyside Stripe Middle School.'",
        "'speaker_12': 'Can you see that one more time? The palm tree vista.'",
        "'speaker_13': 'Horace Mann, Middle School. Trey Vista and Sunnyside Strive Middle School.'",
        "'speaker_1': 'We can send you all.'",
        "'speaker_13': 'Yeah. Councilwoman Torres. And this is one of our bigger districts that we've been in. CMS, Castro Elementary, Kepner Monroe, Cheltenham. Eagleton, who we have a very well established restorative justice program with the relationship with them as well. Farnham Elementary.'",
        "'speaker_13': 'Kellogg Elementary. Fairview Elementary. But see, Gilmore, I already read them. Or do you want me to repeat? Okay. Councilwoman CdeBaca White Middle School and Summer Academy. Garden Place Elementary. Whittier Middle School. Harrington International Academy. Columbine Elementary. Barrett Elementary.'",
        "'speaker_13': 'Gilpin Montessori Cole and Bruce Randolph. And we also do a lot of summer programing there as well. In that district, uh, Councilman Flynn Force Elementary. Johnson Elementary. Henry Middle School, Coons. Miller Creative Arts Academy, DST College View Middle School, DST College View Middle School.'",
        "'speaker_13': 'I think we had four different semesters. Council man had. HENDREN Herndon sorry. Smith Elementary Academy. Stegman Elementary. Um, Councilman Clark, Guardsman Elementary and College View Elementary Summer School. And like I said earlier, we had just gotten into a new school with Councilman Cashman's at Ellis Elementary.'",
        "'speaker_8': 'So no, there's no Hines in there at all.'",
        "'speaker_4': 'No Polaris.'",
        "'speaker_1': 'I think I think that's the one I think that that's the the beauty of of if we get these contracts through tonight and we we go back to safety committee this like we were able to add a school in Councilman Casamance district.'",
        "'speaker_1': 'If there are schools in District ten or District five that you all say, hey, you know, you might want to look at that school. They have this. They can, they can go into those schools.'",
        "'speaker_8': 'So. Mr.. Mr.. Sepp, I want to thank you you very much, sir. You are in the messenger. I mean, you know, like it's thank you for accepting accountability. You are the messenger. If if this were to be voted down the to FTE and then the one FTE, they've already gotten their paychecks, right?'",
        "'speaker_1': 'Yeah. I'm a bring city attorney. I'll bring an Adam Hernandez up this too.'",
        "'speaker_8': 'Like we're not going to go take money out of their.'",
        "'speaker_1': 'Account right now. Okay. I'm a big I'm going get you guys a legal illegal and to. Oh, absolutely. Actually, so I can speak to that. I'm sorry.'",
        "'speaker_8': 'Okay.'",
        "'speaker_4': 'So, yes, they have been paid through judicial in funds that are reserved, because generally when we'd get grants or contracts with the city, it takes a while for them to be approved and go through the process.'",
        "'speaker_10': 'So Judicial has some reserved funds in order to.'",
        "'speaker_4': 'Pay people so that when the contract comes through, we ritually ask for.'",
        "'speaker_10': 'That money to be reestablished back.'",
        "'speaker_4': 'Into judicial budget. So we were under the impression, based on the letters we got from the previous director and ongoing, that this was in the process. So yes, we in good faith continue to do that work in hopes that we could you know.'",
        "'speaker_10': 'We're all in a in a in a budget situation. And that's kind of where it is.'",
        "'speaker_4': 'If these positions are not funded, those two people will be laid off next Tuesday.'",
        "'speaker_10': 'So.'",
        "'speaker_0': 'Yeah.'",
        "'speaker_8': 'But the but the contract ends on the 30th, which is in a week or. Yes. So they're either laid off next Tuesday or in a week?'",
        "'speaker_12': 'Yes. So either way, you're right.'",
        "'speaker_7': 'Yeah.'",
        "'speaker_0': 'Okay, gentlemen, please.'",
        "'speaker_8': 'Yeah. Thank you.'",
        "'speaker_4': 'And originally, we were told the.'",
        "'speaker_10': 'Contract would go a year, and then it was.'",
        "'speaker_4': 'It was changed to the six months, which is.'",
        "'speaker_10': 'You know, where we're at now. So I apologize. I was thinking of the previous.'",
        "'speaker_8': 'No, it's fine. So, Mr. Sapp, I thank you for your indulgence and your willing to willingness to, you know, drop in your or fall on your sword. I know that we have had contract discussions with safety in the past, particularly like community corrections.'",
        "'speaker_8': 'So this isn't the first time. And and again, I'm not. You are just the messenger. This isn't the first time. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember Councilmember Sandoval.'",
        "'speaker_12': 'Thank you, Mr. President. So, Sapp. How come this wasn't brought to us? Like in December or January? COVID hit. March 16, Wright and DPS let out of school. I'll never forget it was Friday the 13th and it was my daughter's last day of her senior year ever.'",
        "'speaker_12': 'So why wasn't this brought to us in January? Why wasn't this brought to us in February? So I'm having a hard time. I understand COVID hit all of our lives, right? And we did our best to get this working.'",
        "'speaker_12': 'Why is this here now? Why wasn't this even done? When we first started meeting, we had Zoom meetings and we didn't have committee. I will admit that, but I just don't understand why we're here now. When COVID like you could have been here in December.'",
        "'speaker_1': 'I totally agree, Councilwoman. And I will say I will say this. So this just to give more context and be completely transparent, we had the manager of our grid office resigned on December 14th. At that point, we went into transition mode where we really began in January looking at how we could reimagine the great contract and the'",
        "'speaker_1': 'State Garden probation contract. And so we spent time in the laboratory in January and February trying to figure out what, like I said earlier, what a potential RFP or sole source contract could look like. And then all of that requires conversations with the state.'",
        "'speaker_1': 'And so I'm not I'm not here to lay anyone under the bus. But sometimes those conversations, it takes a little long for emails that go back and forth. It was our it was our intent to be in safety committee in mid-March on these two only two FTE positions.'",
        "'speaker_12': 'Not I guess I get how bureaucracy works, right? Yeah. I'm not new to too bureaucracy. I'm not new to red tape and I'm not new to how slow things move and then how quick we have to act. Right.'",
        "'speaker_12': 'That's why I feel like we're being asked as this was moving along while all these conversations are happening. But yet at the same time, when I'm doing outreach, it's really important that we do what I call in my office back work.'",
        "'speaker_12': 'So if my staff were having these conversations with people, I would say, you need to reach out while these conversations are simultaneously happening so that we're better prepared. And that's just something that we've all learned that through the process.'",
        "'speaker_12': 'And this is something that we just like when we first got up here in August. All of a sudden we were supposed to like boat on the industrial prison complex without any information. And so there has to be a better way where you can set us up for success with giving us information.'",
        "'speaker_12': 'Because the two schools that you just listed. I just have to say, man, Travis, that it's not horsemen anymore. It used to be it used to be a junior high school, but now is turned into a elementary school that has that has toilets that are for junior high schools, not elementary school kids.'",
        "'speaker_12': 'It's right next to the Craig Newham projects. My lowest income neighborhood and then to Vista, Sunnyside is like one of the most failing neighborhood schools in these two areas. So these. The fact that it's in these two schools.'",
        "'speaker_12': 'Mm hmm. Means that we're targeting our most vulnerable.'",
        "'speaker_4': 'Low income.'",
        "'speaker_12': 'People in my district. And so had you not read out that to me, that should have been something that he. Sandoval wanted you to know. We're bringing in this contract. Here's where these people are. Here's who the families were helping.'",
        "'speaker_12': 'So then I could have been better prepared, appear to have more resources. But learning about this right now at the last hour and that it's in true Vista and Sunnyside Prep. Gives me great pause. And so with that, I can't support something like that.'",
        "'speaker_12': 'And it's so.'",
        "'speaker_0': 'Councilmember, did you have a question in there that I would like to respond.'",
        "'speaker_12': 'Or I just that my question was, I don't understand why they weren't here in December.'",
        "'speaker_0': 'And I just want to make sure that you're okay. He's responding.'",
        "'speaker_12': 'Yeah.'",
        "'speaker_1': 'I. I just. These contracts go back. Our relationship with state. Your district goes back to 2011.'",
        "'speaker_12': 'Yeah, for sure.'",
        "'speaker_1': 'And they predate a lot of the councilmembers here. And it's not lost on me that, um, the previous body, there were actual resolutions congratulating the great these programs for the work that they're doing in the schools. I get the equitable representation and I think that if we, if we get the opportunity to go back to the safety'",
        "'speaker_1': 'committee, this like what we're doing with the curfew amendment, um, looking at ways to not just target far north these, not just target southwest Denver, but look at it really from an equitable lens, just a geographical equitable lens.'",
        "'speaker_1': 'I think that we can shift where we are in some of our schools so that we're not targeting our schools. And that's why I do applaud Councilman CdeBaca for calling it out, because we're having these conversations now. I prefer to have them on in committee, but nevertheless, we're here now, and so we get an opportunity to do'",
        "'speaker_1': 'it right this time and that and that's us.'",
        "'speaker_12': 'And I totally respect you. I would be there if I had the information. You know me well. I know we we have a long history together and you know me well that if there is something to give accolades to, I will give it.'",
        "'speaker_12': 'But in this situation, we are not given the information to be able to give the accolades that are needed. So now we're up here questioning. So yes, I worked I was the chief of staff for Councilman Espinosa. I wrote his talking points.'",
        "'speaker_12': 'I know what he said. I worked in Judi Montero's office. I know what she said. I helped her get there. But it was always we had a little bit more information to help them get there. And when we didn't, we we had to have it out in committee, which we haven't had the luxury of doing because of'",
        "'speaker_12': 'COVID. But it's a new things have to shift. Like I keep talking about our zoning, right? Our zoning, our landscape has changed. And so we can't go back in time. All we can do is do better. And so now we have to just we have to have a lesson learned.'",
        "'speaker_12': 'Thank you. Thank you.'",
        "'speaker_0': 'Can't remember Councilmember Torres.'",
        "'speaker_9': 'What I'm. Struggling with is. The impression that we're being given of great versus grid versus the gun offender program. Great is valued in my district by my principals and my teachers. They actually appreciate it. And it's not probation work.'",
        "'speaker_9': 'It's not a cop coming in in uniform. It is working on conflict resolution tactics. On bullying. On upstander versus bystander. I know this. And what I want to see is more of that and less of its association with criminal justice system.'",
        "'speaker_9': 'So that's what that's what I'm hoping for, the separation of these contracts and more clarification of the rules and. I'm getting the reach out from folks, mostly the educators, who are saying this is something that we appreciate in our school and it's an elementary school.'",
        "'speaker_9': 'But I need to hear more of that. If you're if you're as heavily involved in my district, the same. The same question that I asked in October of the SRO presentation is how you're working your way out of my district.'",
        "'speaker_9': 'And that's what I also want to know. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember. All right, Madam Secretary, roll call on 508.'",
        "'speaker_4': 'CDEBACA No.'",
        "'speaker_1': 'FLYNN All right.'",
        "'speaker_9': 'GILMORE No.'",
        "'speaker_1': 'Herndon, I think to.'",
        "'speaker_9': 'Hynes. No Cashman, no can each pass. Sandoval.'",
        "'speaker_12': 'No.'",
        "'speaker_9': 'Sawyer. No. Torres. No. Black. I can eat. No. Council president.'",
        "'speaker_0': 'By secretary. Please close voting out the results. Okay. Secretary. Are we missing somebody?'",
        "'speaker_1': 'Yes.'",
        "'speaker_9': 'Councilmember Cashman. I'm sorry.'",
        "'speaker_0': 'Cashman we didn't get your button.'",
        "'speaker_1': 'Didn't come up on my screen.'",
        "'speaker_12': 'Screen is stuck.'",
        "'speaker_1': 'I'm a no, but it didn't come up.'",
        "'speaker_9': 'It's a no.'",
        "'speaker_0': 'That was a four I's. Eight names comfortable. 508 has failed. All right. That concludes the items to be called out this evening. Our bills for introduction are ordered published, except for Bill 536, which will be voted on after its hearing.'",
        "'speaker_0': 'Council members remember that this is a consent or block vote and you will need to vote. Otherwise, this is your last chance to call an amount for a separate vote. Customer Can you you pleased with the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_5': 'I move that.'",
        "'speaker_9': 'The resolutions be adopted and bills on final consideration be placed upon final consideration.'",
        "'speaker_10': 'Do pass in a block for the following items of all series of 2024.'",
        "'speaker_9': '9525.'",
        "'speaker_10': '526 527 528 529.'",
        "'speaker_5': '523 502 512. 532 548 499 515 516 507.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Madam Secretary, Roll Call Black CdeBaca.'",
        "'speaker_9': 'I. Flynn, I Gilmer.'",
        "'speaker_7': 'I.'",
        "'speaker_1': 'Herndon, i.'",
        "'speaker_8': 'I.'",
        "'speaker_7': 'Cashman.'",
        "'speaker_9': 'I can h ry Sandoval. Hi, Sawyer. I Torres. I Council President.'",
        "'speaker_0': 'Bye, Madam Secretary, please close voting in the results. 12 hours, 12 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight there will be a 30 minute courtesy hearing on Council Bill 536, submitting to a vote of the registered electors of the city and county of Denver, a proposed'"
    ],
    "A bill for an ordinance submitting to a vote of the registered electors of the City and County of Denver at a special municipal election to be held in conjunction with the coordinated election on November 3, 2020, a proposed amendment to the Charter of the City and County of Denver to give City Council the authority to consent to certain mayoral appointments. Submits to the voters of Denver the power for City Council to confirm Mayoral departmental appointees. The Committee approved filing this item at its meeting on 6-9-20.": [
        "'speaker_0': 'Please refrain from profane or obscene speech. Correct your comments the council as a whole and refrain from individual or personal attacks. Council member can each where you please for council bill 536 on the floor.'",
        "'speaker_9': 'Yes, Mr. President, I put Councilor Bell 536. Uh.'",
        "'speaker_5': 'Sorry. On the floor in order. It's not on the floor. Thank you.'",
        "'speaker_0': 'It has been moved and seconded. Courtesy public hearing for Councilor Bill 536 is now open. Are we getting a staff report from a council member from CPD? What are we doing on council members, staff report or are we going straight into hearing?'",
        "'speaker_10': 'We can go straight into hearing unless everyone is dying to hear a staff report yet again.'",
        "'speaker_0': 'Yet again. Okay. From your code of battery, you're going to.'",
        "'speaker_10': 'Have to do a just a quick overview of it for everyone to hear it.'",
        "'speaker_0': 'Okay. Well, you do that. A quick overview. Sounds good.'",
        "'speaker_10': 'Absolutely. Okay. So this is a this so this would be a proposal that would be referred to the voters in November 2020. It covers 14 mayoral appointments, the 11 positions that are the mayoral cabinet, which are specified in the city and city charter of Denver.'",
        "'speaker_10': 'Those positions are sort of like the what I would call the quote unquote, major cabinet positions of the city of Denver. So that's the heads of things like the airport parks and Rec, Finance, General Services, Human Services, Department of Transportation and Infrastructure, Department of Community Planning and developments, things like that.'",
        "'speaker_10': 'The quote unquote, big ones. And then it also includes the three heads of safety. So that's fire, sheriff and chief of police. The reason that it includes the three heads of safety is because Councilwoman CdeBaca had originally, back in October, proposed that the city and county of Denver have an elected sheriff.'",
        "'speaker_10': 'Well, the proposal had a lot of support from the community. It did not have as much support from the administration. And so that is a yeah.'",
        "'speaker_5': 'You're not shocked to hear that.'",
        "'speaker_10': 'That is that this is a compromise that straddles sort of it bridges the gap between the two. So having the three heads of safety also be included under this proposal is a way to bridge that gap where it allows city council the ability to approve those 14 positions.'",
        "'speaker_10': 'So it gives you the people a voice through your elected city council representatives. This is a best practice across the the most of the strong mayor systems across the United States of America. Denver is the only strong mayor system in the state of Colorado that does not do this.'",
        "'speaker_10': 'So it's you know, there's lots of discussion that we've had about it. I urge you to go back and look over. If you look online at our committee presentation, Councilman CdeBaca and I did two Tuesdays ago at our finances.'",
        "'speaker_10': 'Yeah. Yep. It's worth watching to just sort of fill yourself in on a lot of the different ins and outs of it. But the proposal would allow us, as a city council, a majority, seven members, to approve these 14 positions.'",
        "'speaker_10': 'If the if the appointment is not approved, then that's it. Then they're not then they're not approved. And then the mayor would have to either find someone else to approve the position, into the position and appoint, or they would have to whoever the mayor is would have to come back to us and have discussions about why it'",
        "'speaker_10': 'is that we, as the Council, did not support at seven members. And then, you know, if it was an issue of, you know, questions that couldn't be answered or something like that, then then maybe it would move forward after a discussion or, you know, maybe not, but it would require a seven member approval of council in order'",
        "'speaker_10': 'for those appointments to go to move forward. Councilwoman CdeBaca, do you have anything else you you want to fill out?'",
        "'speaker_4': 'Two quick things. There are two ways that something gets on the ballot that you vote on. And one is through a citizen led ballot initiative where citizens have to collect 9000 signatures, valid signatures to get it on the ballot, or by getting seven of us to vote on something to refer it to the ballot.'",
        "'speaker_4': 'This is the one way that we can help you to govern. This is an important change because there are no salary caps on appointments, there are no job descriptions. There are no ways for us to fire any of them.'",
        "'speaker_4': 'Should we find them in trouble for something? This doesn't give us the power to fire them, but at least, at least gives us the power to say yes or no if we know that somebody's being appointed as a clan member or something.'",
        "'speaker_4': 'You know, it gives us one mechanism that's important for us to be able to have some kind of balance. And this is one of many charter changes that we're hoping to put in front of you. And so this will be the first one tonight that you guys get to weigh in on.'",
        "'speaker_10': 'Yeah, I think that's great. And I think, you know, if there's anything that we've heard tonight, it is that the community is crying out for transparency and accountability from your government. And thank you. This is not a perfect solution, but it is one solution that is a best practice across communities across the United States of America.'",
        "'speaker_10': 'It is a way that is rooted in research. It's a way that is rooted in best practice. It is something that is done already. It is something that makes sense for our community. It is a way to create partnership and to create buy in, right.'",
        "'speaker_10': 'So this is a way for city council members and the community through your city council members to create collaboration and a sense of collaborative ness that, in case you had not noticed, does not really exist in our community and in our government right now in a lot of ways.'",
        "'speaker_10': 'And so what this can do is change that narrative in a more positive way, in a more collaborative way. And I think that that's really important to keep your eye on and to remember. So that's the goal here.'",
        "'speaker_10': 'That's what we're doing here. And we look forward to your comments. Councilman said about could you have anything else to add?'",
        "'speaker_4': 'Let's hear the.'",
        "'speaker_10': 'All right. Yes.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Tonight, council. Sorry. We're sorry. Okay. Tonight council has received 31 written comments by people who are not here, but submitted them as one of our options during COVID. So 31 written comments on council. At 536, there were 30 submitted comments in favor of the bill and one submitted comment in opposition of the bill.'",
        "'speaker_0': 'All members of Council that are present have certified that they've read each of the submitted comments. So do any members need more time enabled in order to read the written testimony? Because if so, then we need to go to recess so everybody can read.'",
        "'speaker_0': 'Please work in if you do. Looks like everybody's good. Okay. Seeing none. Council Secretary let the record reflect that all written testimony both in favor and in opposition of Council Bill 536 has been read by each member of council and all written testimony will be submitted to the official record of the hearing.'",
        "'speaker_0': 'We have 11 people signed up to speak on this item. So first up is Dennis Brookfield. Dennis. Brookfield. Brookfield. All right, Katie Leonard. Katie Leonard. This is Jamie Titus. James Titus.'",
        "'speaker_1': 'So my name is James. I filled out in favor of this bill. I think the strong merit system, the amount of power that Mayor Hancock currently has in this system, in this system and in the city is abhorrent, especially when it comes to those three safety branches.'",
        "'speaker_1': 'It seems pretty self-evident that the current, the way things are currently laid out, that the city council is fairly weak. There are I believe this is a time in which I can ask questions regarding this, or I can only say if it's.'",
        "'speaker_0': 'Still just public comment. Your feelings about this bill, I mean, you could pose a question that someone might try to answer later, but.'",
        "'speaker_1': 'Well, it's not accurate. If you would like to answer my question, I would ask you, which is, does is there anything in this that affects people being grandfathered in? If there is somebody who is currently a head of department, do they have to go through a new approval process in order to be appointed?'",
        "'speaker_0': 'And so people won't answer right now you'll throw it out there and people can answer once we get to comments.'",
        "'speaker_1': 'So you can just keep them. Well, contingent upon that question. I would I would say that that is something that needs to be added as another charter or should be adjusted. And I would also request commitments from all of you, all of you who want to get reelected, to not approve the reappointment of the sheriff of the'",
        "'speaker_1': 'city who has instituted domestic terrorism on our city. So I would really appreciate anybody who can commit to not approving an appointment. I would also be in favor of extending this power more so that you have that you can't just say no.'",
        "'speaker_1': 'Because I'm also curious about what happens, who stays in that position, like who is a sheriff, who is the head of a department if that appointment is turned down, if an appointment is repeatedly turned down over some course of time, I don't know how long that would take, but I would hate for some interim goon to stay'",
        "'speaker_1': 'in there for some long amount of time while things continue to go to set. So again, I'm for this, but I think those are all important questions that people that need to be addressed. And I would I demand your commitments on that.'",
        "'speaker_1': 'In relation to your reelection. Thank you.'",
        "'speaker_0': 'Thank you. Next up is. And he can wait.'",
        "'speaker_1': 'Hello. Um, just want to speak to you guys about, uh, checks and balances tonight. If we're actually going to be a actual government that supposedly protects people, we should be able to not have our city become what is almost a dictatorship.'",
        "'speaker_1': 'Like when there are no checks to power, when people can be put in the places of power they have no like job descriptions or anything like that. That's ridiculous. I can't become an educator.'",
        "'speaker_6': 'In a university.'",
        "'speaker_1': 'If I don't have a masters degree. It should be the same in our city. You should have actual experience with safety and how you should be questioned. You should be like, I think it's so ridiculous that we don't have it.'",
        "'speaker_1': 'I know the history goes a long time. Back to Mayor Speer. That's the reason why we have such mayor power in this city. It goes back historically a long time, but we know that that power even back then was used for corruption.'",
        "'speaker_1': 'So you as the city council, we look to you guys and that is why I'm in support of this. And I think all of you should be in support of this, too. Another thing I want to speak on with this is, um, I don't think this is enough, but it is a start.'",
        "'speaker_1': 'And we believe that all of you can help hold the mayor accountable. Like the mayor has done many messed up things, like when you put the home in, like the sorry, the real estate owners and the gentrifiers in charge of the housing department, like.'",
        "'speaker_1': 'That's ridiculous. Well, there are other things I could go on and on and on about with, but I don't have the time. But I. I just want to come in front of ya and have it be said. Many people, like even your commenters, there's only one or two people.'",
        "'speaker_1': 'I assume that one was sent in by the mayor. I can neither confirm nor deny, but, uh, I think that is the case. But as we look to all.'",
        "'speaker_6': 'Of you to keep power.'",
        "'speaker_1': 'In check on the mayor, we hope that you use this.'",
        "'speaker_6': 'Power wisely. And we hope that you.'",
        "'speaker_1': 'Can do what needs to be done.'",
        "'speaker_6': 'Like if.'",
        "'speaker_1': 'You see somebody unfit, please.'",
        "'speaker_6': 'Make sure that you.'",
        "'speaker_1': 'Stop these unfit people from taking positions of power. Shouldn't have a dictatorship in our city. It's unacceptable. God like I want to do more. Like I could go into AIDS department. But you already.'",
        "'speaker_6': 'Know very well enough.'",
        "'speaker_1': 'Y'all have people in there. And I think the best example I could take from was what just happened earlier. If we're letting that type of incompetence, that's the thing go around and that's the shit that they're giving you.'",
        "'speaker_1': 'I think the mayor needs some checks and balances.'",
        "'speaker_0': 'Next up is Jason Ball. Jason Ball.'",
        "'speaker_1': 'Hello. My name is Jason Ball. I live in.'",
        "'speaker_6': 'District three.'",
        "'speaker_1': 'And two times in a row. I got to go after Kenny, so. All right. So, yes, of course.'",
        "'speaker_6': 'I'm in favor of this bill. I believe that, you know, I'm a history teacher in District three.'",
        "'speaker_1': 'And I teach children about civics and.'",
        "'speaker_6': 'The American governments. And it's kind of seems ridiculous that our own city doesn't really model.'",
        "'speaker_1': 'These same values.'",
        "'speaker_6': 'Of so-called American democracy, of checks and balances, a legislative branch that can actually hold the executive accountable. And this is what our own federal government supposedly does, where it's like, okay, cool, you can make appointments as the executive.'",
        "'speaker_6': 'That's how it should work. If it's good enough for the federal government, it should be good enough for Denver. And as Kenny had mentioned in our history.'",
        "'speaker_1': 'The reason that we have such a strong mayor.'",
        "'speaker_6': 'Government is when the city and county was created in the early 1900s during this administration. And yeah, well, he did a lot of things make the city pretty. He was, according to historians, notoriously corrupt and did some shady things.'",
        "'speaker_6': 'And we have seen this continue in our current mayor administration, where you can kind.'",
        "'speaker_1': 'Of choose to pick the people that you want to to go.'",
        "'speaker_6': 'Through with your agenda. And I'm sure as city council members, it must.'",
        "'speaker_1': 'Be frustrating because I know a lot of people who come here.'",
        "'speaker_6': 'They'll move from different parts of the country and think you have more power than you do. And a lot of times people will say, you have this power and you'll be like, well, unfortunately we don't. So for me, this is kind of a no brainer.'",
        "'speaker_6': 'Why would you not want to give yourselves more power to hold the male mayor accountable, to kind of give the citizens of Denver an actual vote to decide for themselves by voting yes on this? You're not committing to it.'",
        "'speaker_6': 'You're letting the people of Denver decide. So that should be a pretty big no brainer for me. So vote yes on this and I certainly support it. Thank you.'",
        "'speaker_0': 'Thank you. Next up is Blair Step. Blair step. All right. Next is Tesla. Tesla. All right, Kristina Shulman.'",
        "'speaker_4': 'Firstly, I'd like to thank Councilwoman Sawyer and CdeBaca for opening this to public opinion. My name is Christina Shulman, and I am a social worker in the Denver community and live in the university area. Transparency in government and stakeholder input is the foundation of this country.'",
        "'speaker_4': 'I hate to I hate to reference this colonial period, but the American Revolution occurred in part because the people had no say and no look into what their monarchs were doing. And I hate to quote a white male colonialist, but it seems that some of you only respond to those types of people.'",
        "'speaker_5': 'He famous, he more.'",
        "'speaker_4': 'Famously proclaimed, Give me liberty or give me death. But he also said this The liberties of the people never were nor ever will be secure when the transactions of their rulers may be concealed from them. While we are not under a monarchy today, we are under a strong mayor system with all sorry, transparency and governmental appointments is'",
        "'speaker_4': 'necessary for the people to feel seen, to feel heard, and to trust that their thoughts and values will be reflected in those in charge of calling the shots. If we allow the mayor's appointments to go unvetted by the council, we are opening the door for corruption and nepotism.'",
        "'speaker_4': 'Councilman Cashman is my specific district councilman and while I understand the question posed concerning the whispers surrounding the potential deterrence of applicants, that deterrence should be the big red flag in and of itself. It is a privilege. It is a privilege, not a given right to hold office in this country, to hold the power to make decisions'",
        "'speaker_4': 'that could directly or indirectly affect the people they serve. And that includes you all. So if we're boring you or if you're tired, we're just getting started. So feel free to resign. We need leaders that are not only qualified for their positions, but also are willing to show up for their agencies in a way that represents and'",
        "'speaker_4': 'reflects the values of the public they serve.'",
        "'speaker_13': 'As the Council to vote yes on Bill.'",
        "'speaker_4': '2005 36 to show your constituents, the people that give you this privilege, my clients and your fellow Denver rights, the people that you live next to you, the people that you passed on the street, that you will give them merely the opportunity to ensure that you will take your responsibility to the public seriously, your privilege of having'",
        "'speaker_4': 'a seat in public office seriously, and the checks and balances of power in our government. Seriously. Thank you. Thank you.'",
        "'speaker_0': 'I don't think that Chairman Sekou has stuck around. I don't see him. No. Rosie Dupree. Rosie Dupree. No. And I don't see Jesse Perry's stuck around either. No, Jesse. I see. Okay. That concludes our speakers on this item.'",
        "'speaker_0': 'Are there questions for members of Council on item 536? Council member took us.'",
        "'speaker_9': 'To the speaker's point. Did we clarify whether or not retained appointees would need to be reconfirmed?'",
        "'speaker_10': 'Yes. So the way. Kirsten, do you want to take this or do you want me to? You want me to take it? Okay. So. So, yes, the wording is that if an if a if an appointee is going to be retained and maintain their position as an appointee for the same position under a new mayor.'",
        "'speaker_10': 'Right. So a new mayor is elected and there's an appointee who's an a current appointee who's going to maintain that position moving forward. Then they would need to be reappointed. If there is an appointee who is going to stay in their position just until a new appointee takes over that position just to cover the time period, then'",
        "'speaker_10': 'they are no longer the appointee in that position. They've moved to an interim appointee. And this does not specifically cover interim appointees because that's that's a temporary position. So then they do not need to be reconfirmed. Do you do you need to clarify anything that I have said there or was that good?'",
        "'speaker_0': 'That was.'",
        "'speaker_9': 'Well, I'm confused. I've never heard of an interim appointee being different from permanent appointee. What about? I guess I'm looking to Kirsten Legal.'",
        "'speaker_10': 'Kirsten Crawford Legislative Council. There are circumstances where we have have interims fill a position if someone, for example, resigns. This bill is intended to apply to permanent appointments and it's not uncommon drafting. You know, we have to look to other jurisdictions as far as when a new mayor comes in.'",
        "'speaker_10': 'The question is really whether the nomination and the bill moves forward in a reasonable and timely manner. So if someone's holding the position and the new mayor's intent is to have the person resign and fill it, the question is, you know, what period of time is reasonable?'",
        "'speaker_10': 'The standard for reasonableness is what an objective person believes. So there's case law on that. And, you know, certainly there are there could be a situation where someone thinks it's unreasonable and they're just filling it with an interim to avoid the process.'",
        "'speaker_10': 'And we would have to deal with that when it comes. But we shouldn't draft further unreasonableness, in my opinion.'",
        "'speaker_9': 'Got it. Thank you.'",
        "'speaker_10': 'And actually, there was a question from one of the speakers about whether there was like how that worked. And just so everyone knows, it is written into the charter amendment. So it would be written into the charter that a mayor is required to fill the positions in a timely, reasonable and timely manner.'",
        "'speaker_10': 'So what that does is it's not you can't put a time period on what a reasonable and timely manner is. It can't you can't say like six months is a reasonable and timely manner, but you can say, are they is the mayor doing some sort of action that shows that they are trying to fill the position versus'",
        "'speaker_10': 'are they not doing any action and just using this interim position as a as a holds position and not actually taking action to try and fill that position with a permanent position, permanent person who would have to go through the appointee process.'",
        "'speaker_10': 'Confirmation process. Does that answer your question?'",
        "'speaker_9': 'Yeah, I'm answered.'",
        "'speaker_0': 'And Councilmember CdeBaca, did you also want to help answer that question? Is that what you're flagging me for?'",
        "'speaker_1': 'Well, just.'",
        "'speaker_4': 'To add on to the question from the audience about. Basically getting rid of the sheriff. So we don't currently have a sheriff. And that would actually be one of the very first appointees that we would be able to have this power over, because it's between now and November that this would happen and it's unlikely for us to'",
        "'speaker_4': 'have a full blown sheriff process before November. So this might be our first chance to have this power, and that would be the first one.'",
        "'speaker_0': 'Thank you. Thank you, Councilmember. Councilmember Torres, you all good? Okay. Councilmember Flint.'",
        "'speaker_1': 'Thank you, Mr. President. And I want to thank Councilwoman Sawyer for clarifying one of the sections that was giving me some heartburn, which was when the 30 day shot clock starts.'",
        "'speaker_9': 'You're welcome.'",
        "'speaker_1': 'So I would like to I would like to make a record here, because there's been a lot of confusion about our contracts and approval process with a 30 day shot clock. When it was adopted in 1982 or three or so.'",
        "'speaker_1': 'It was always understood by the city attorney's office that the 30 day shot clock started when the bill or contract was filed Thursday noon for the Monday meeting. And when I came on council five years ago, I found that the city attorneys have interpreted that differently along the way.'",
        "'speaker_1': 'And they start the clock when they file, when they bring the bill to us, and it goes through committee, which shortens our time. And so I want to make a record here that the way I am reading this, Councilwoman Sawyer and Councilwoman CdeBaca, the intent is that now that the wording says it used to say that the'",
        "'speaker_1': 'shot clock started when the mayor made the right reading, the recommendation of council when he gave us a letter. I am appointing this person to that position that started the clock and the wording now is much more precise and much more acceptable that it starts 30 days, starts when the resolution is filed for action by the Council'",
        "'speaker_1': '. It is my. Interpretation of our rules that the resolution is not filed.'",
        "'speaker_0': 'For action by the Council when it comes.'",
        "'speaker_1': 'To a committee. It's filed for action by the council on noon Thursday for Monday. So that will give us that extra time. And I want to I just wanted to bring that out and asked the two sponsors, is that your interpretation of this or are you interpreting that the clock starts when it comes to committee?'",
        "'speaker_4': 'Committees are not required. So I would interpret it that way. No.'",
        "'speaker_1': 'You would.'",
        "'speaker_4': 'No, I would not. Committee is a.'",
        "'speaker_5': 'Courtesy.'",
        "'speaker_1': 'Right.'",
        "'speaker_4': 'So I would not.'",
        "'speaker_9': 'Interpret it that way.'",
        "'speaker_1': 'So the clock will start Thursday noon when it's filed for Monday action. Thank you, counsel.'",
        "'speaker_10': 'And sir. That's correct. And it is written that way in the final draft, specifically because of the conversation you and I had about that. Right. And to clarify it exactly in here so that it will live on in our charter, clarified exactly like that.'",
        "'speaker_1': 'Okay. Could I ask our legislative counsel if the city attorney's office agrees with that?'",
        "'speaker_10': 'Yes. Kirsten Crawford, legislative counsel. And John worked on this.'",
        "'speaker_5': 'So I'm speaking for John. But John drafted.'",
        "'speaker_4': 'It just.'",
        "'speaker_10': 'The way we're representing here. So, yes, when it gets filed the Thursday before.'",
        "'speaker_1': 'Okay. So thank you. And then, Mr. President, my next my next proposal will be that we interpret contracts that the clock starts with.'",
        "'speaker_0': 'We will have to say that one for another day. Councilmember. All right. Anything else on this bill? Councilmember Flynn.'",
        "'speaker_1': 'No, just a comment when we get the comments.'",
        "'speaker_0': 'All right. So no other questions. The public hearing for Council Bill 536 is closed. And now we'll move into comments by members of council. Council members Sawyer and CdeBaca. I'll let you guys YouTube decide how you would like to go first or for comments or do you want to defer?'",
        "'speaker_10': 'Well, I have said most of what I already need to say.'",
        "'speaker_0': 'So got that.'",
        "'speaker_10': 'As I will defer my time and if I want to jump in at the end, I will thinks.'",
        "'speaker_4': 'I've said my piece. If you care about defunding the police or any department in this city, it's coming under the leadership. Their budgets come under the leadership of their appointees. And so if this is one place that we can at least try to get some different people making decisions about our budget, then let's do it.'",
        "'speaker_4': 'Let's try it.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Hines.'",
        "'speaker_8': 'Thank you, Mr. President. Folks, this is what democracy looks like, and I want you to keep coming. By the way, this is your house. And so please keep coming. Keep stay engaged. But speaking of democracy, I am also amazed at how well educated and informed our speakers have been tonight, specifically on city politics, which is an interesting'",
        "'speaker_8': 'beast. And my dog will be really unhappy because he has appeared in over 12 hours. But anyway. But but speaking of democracy, there is a there is a disconnect between perceived democracy in the city and actual democracy in the city.'",
        "'speaker_8': 'Just as as the people have have said, we need three functioning branches of government here in the city. And and and the way we learned it from Schoolhouse Rock was that we would have three equal branches that would keep each other in check.'",
        "'speaker_8': 'So now what we have in Denver and you know it, which is amazing, it's amazing that that that you were that educated and that engaged. So this, I believe, helps it. It doesn't make that three equal branches of government, but it helps modify some of that actual power towards some of the perceived power.'",
        "'speaker_8': 'And so I'm I'm really excited about it. Councilmember CdeBaca talked about how the appointees have no salary caps. This is a subset of all the mayoral appointees. But if you look at all the mayoral appointees, which is approximately 60, it kind of it fluctuates a little bit.'",
        "'speaker_8': 'The the the budget for the entire legislative branch, from Mr. President to the receptionist to all of us electeds and our aides, is less than the budget for the mayoral appointees. So the previous conversation about how we are, where we are, we we're very lean that is to councilmember said about this point there are no salary caps'",
        "'speaker_8': 'for the appointees and this helps us balance that power to make sure that our perceived government is in line with our actual government. So I am excited to refer this to you to vote on in November. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember Councilmember Cashman.'",
        "'speaker_1': 'Thank you, Mr. President. Yes. Ms.. Shulman mentioned during comments when this was first brought up, I was considering the idea that good candidates might be concerned with subjecting themselves to that public process. But thinking about it further. I have a hunch that should this pass tonight and get to the voters and should the voters adopt this?'",
        "'speaker_1': 'I have a hunch it may be the last time you even hear about this, because it doesn't entail a big process. When the mayor makes an appointee, the appointees go on to our consent agenda. And if there is no problem, it just gets passed on with the rest of the bills.'",
        "'speaker_1': 'And I think it's really no loss of power for a good mayor who is really concerned with putting the best possible candidate for a position. But if if we are presented with a mayor who's trying to do favors and put people in positions that they're not the best qualified for.'",
        "'speaker_1': 'You know, we talk a lot about the salaries of our cabinet people. And there there are comparatively a drop in the bucket in our city budget. I often wish we could pay more and when there's a position open, I want absolutely the best individual in the country to fill these positions.'",
        "'speaker_1': 'I mean, Denver's at a time where there's so much going on. We need real visionaries. But I think what's going to happen. Should this pass is a mayor is going to be forced to involve council early in the process rather than, you know, no executive wants to look bad and put someone up that's going to get voted'",
        "'speaker_1': 'down by council. So I think there will be conversations about if there is anybody that that's got stuff that might concern council, I think there'll be discussions ahead of time. So, you know, it might be maybe somewhere down the line there'll be a brouhaha and the Mayor will put someone up and there'll be a big discussion on'",
        "'speaker_1': 'council. But I think most of that will get done during the nomination process. So I appreciate my colleagues bringing this forward and I do look forward to supporting this.'",
        "'speaker_0': 'Thank you, Councilmember Councilmember Torres.'",
        "'speaker_9': 'Thank you, Mr. President. First, I want to thank Jason Ball. Thank you for being here representing District three. I appreciate your work, your activism, and we've had good conversation and thank you for being an educator. This will be an easy vote for me, I think, Councilman Sawyer, for shepherding it since last October.'",
        "'speaker_9': 'So remember, you voted in people last May and June who came here to change things and they started doing that right away. I also want to make sure, you know. Only 39% of Denver voted in the last election.'",
        "'speaker_9': 'So democracy is in November. That's where it actually hits the road. And whether or not you vote and others vote in this city for this and for everything else that's on the ballot. I'll leave it at that. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Councilmember Sandoval.'",
        "'speaker_12': 'Thank you, Mr. President. So first, I'd like to just thank all of you for sitting here. I can't remember the last time we had a packed chambers. I think it was the pit bull ban. I think there were more people here talking about pit bulls than I have heard in a long time.'",
        "'speaker_12': 'So I asked you all to show up when things were happening, and I didn't expect it to look like this. But here you are. It's 1015 and you are still here. So I'd like to thank all of you for your activism.'",
        "'speaker_12': 'And I, too, will be supporting this to push this to the ballot. And that's going to be at the ballot. From what I understand, it's going to be three pages. So you all need to look at all of the state initiatives.'",
        "'speaker_12': 'You need to look at these initiatives. And when you're talking about defunding the police department, I need you guys to look at the Gallagher amendment. I need you to understand what Gallagher amendment and TABOR does to our coffers at the state and at the city level, because we don't have money like other states have.'",
        "'speaker_12': 'We have taxes like other states have, but we don't have money because the way that the Gallagher amendment and the TABOR amendment collide makes it super challenging for us to get money into our coffers and to pay for all of the things that you all are calling for, the reforms that you are calling for.'",
        "'speaker_12': 'You all need to get educated on what's on the ballot. So that's my little spiel for the Gallagher to D.D. Gallagher, I think is the term of it. I know I'm quite sure they just passed it. It's on the state.'",
        "'speaker_12': 'But if you have more questions, feel free to give me a call. I have a cool PowerPoint presentation that I got at the Latino Leadership Institute last year when I graduated from Do You, and they broke it down in five slides.'",
        "'speaker_12': 'I've been asking questions about Gallagher and Tabor my whole life and they broke it down in five slides. So if you want that by PowerPoint, contact my office council district one. I will gladly share it with all of you.'",
        "'speaker_12': 'And as for this bill, as Councilwoman Tori said, thank you, Councilwoman Sawyer, for pushing this forward and bringing something this type of dialog to this council. I think it's needed right now more than ever. So I appreciate you for your effort and doing the hard work to do outreach.'",
        "'speaker_12': 'It's really hard to do things citywide, so thank you for your steadfast leadership.'",
        "'speaker_0': 'Thank you. Council member. Council Member.'",
        "'speaker_1': 'Flynn Thank you, Mr. President. I do share some of the concerns about that were expressed by one of the speakers and several of the members about whether a process like this results in perhaps not the best candidates coming forward because of jeopardizing a position elsewhere or whatnot.'",
        "'speaker_1': 'And I want to recall that both that the community was upset with the processes for finding a new superintendent when they ended up with only one finalist and also the president of the University of Colorado system, when they ended up again with just one finalist because other finalists withdrew because there would be a public process.'",
        "'speaker_1': 'The answer to that isn't that, well, somebody if they can't get seven votes, then we don't want them anyway. I don't want someone who can just get seven votes. I want someone who can get a substantial number of votes up here.'",
        "'speaker_1': 'There's always pros and cons to every measure that we consider up here. On balance, I believe this is a good proposal and I'm very happy that to have the shot clock issue clarified so that there won't be any dispute about when we start and when we have to act.'",
        "'speaker_1': 'And so with that, I'm satisfied. Mr. President. Thank you.'",
        "'speaker_0': 'Thank you. Councilmember Councilmember Hines.'",
        "'speaker_8': 'Thank you, Mr. President. Councilmember Torres, thank you for urging people to vote in November. If you haven't turned in your ballot, you can vote right now. So just wanted to add that. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilmember. Councilmember Sandbach a perfect segway.'",
        "'speaker_4': 'I was going to add that democracy happens in November, but if you live in Denver, it also happens in May and in June. If there's a runoff, our elections don't happen. In in November for our city council races.'",
        "'speaker_4': 'So keep your eyes open. It's very different. That's why we have low voter turnout and our ballot will be long in November because these things that we refer will go on the November ballot. But follow us on any social media, Candy, said Abarca.'",
        "'speaker_4': 'We will create ballot guides for all of you to be able to share and disseminate and explain things so that we break it down and it's not hard. Just check the boxes.'",
        "'speaker_0': 'Thank you, Councilmember. All right, I go. Thank you all so much for being here. Thank you for sticking with us and echo what many have said and and and vote right now. We have an election going on. All right.'",
        "'speaker_0': 'With that, Madam Secretary, roll call on 536.'",
        "'speaker_9': 'Sawyer. I. Torres. I black.'",
        "'speaker_4': 'I. CDEBACA Heck yes.'",
        "'speaker_1': 'Flynn All right.'",
        "'speaker_7': 'Gilmore I. Herndon. I can.'",
        "'speaker_8': 'Pass.'",
        "'speaker_9': 'Cashman. I can. I. Hines.'",
        "'speaker_8': 'I.'",
        "'speaker_9': 'Council President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting in the results.'",
        "'speaker_9': 'Two of us.'",
        "'speaker_0': 'I believe. I just want to clarify the record. I believe that was 11 Eyes and one. Heck yes, I believe is what I heard. Constable 536 has been ordered published on Monday, July 20th. Council will hold a required public hearing on Council Bill 520, changing the zoning classification for 5061 Perry Street in Regis.'"
    ]
}