{
    "A resolution approving a proposed Agreement between the City and County of Denver and Aramark Correctional Services, LLC to provide meal services at the Denver Detention Facility and Denver County Jail. Approves a contract with Aramark Correctional Services, LLC for $9,000,000 and through 6-30-23 to provide services of preparing and serving meals at the Denver Detention Facility and Denver County Jail (SAFTY-202158720). The last regularly scheduled Council meeting within the 30-day review period is on 7-19-21. The Committee approved filing this item at its meeting on 6-16-21.": [
        "'speaker_0': 'Councilmember Sawyer has called out Bill 572 for a vote. Under pending, no items have been called out. The first item up is Council Resolution 655. Councilmember Hines, will you please put Council Resolution 655 on the floor for adoption.'",
        "'speaker_2': 'And move the Council Resolution 20 1-0655 be adopted?'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Questions or comments by members of Council. Council. Member State of Abarca.'",
        "'speaker_1': 'Thank you, Madam President. I caught this one out for a separate vote because Aramark is known for many of the things we just heard in public comment, including serving spoiled food to inmates. And we've heard from people inside of the department, as well as outside of the department who really do not want us to support this contract'",
        "'speaker_1': '. And so I'm going to stand with them this evening and vote no. And I encourage my colleagues to vote no as well. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember CdeBaca. We have Councilmember Hines. You're up.'",
        "'speaker_2': 'Thank you, Madam President. There's someone from safety here. I'd like to ask. Basically that. Oh, thank you. The question I have is, um, we certainly want our, our guests in our jails to eat, right? If we say no to this contract, does that mean that we will not have a way to provide food for our inmates?'",
        "'speaker_0': 'Thank you. Councilmember Hines, we have Vince Lane from the sheriff's department here. So we'll go ahead, Vince. Go ahead. And you can answer that question.'",
        "'speaker_3': 'Good evening, Counsel and Councilmember Hines, I appreciate your question. No, it doesn't mean that we currently provide food services internally. And certainly if this contract were to not move forward, we would continue to provide that service as an internal service provided by sheriff's department staff.'",
        "'speaker_2': 'Thank you. And thank you for all you do. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Haynes, and thank you, Vince, for being here as well. We've got Council Pro-Tem Torres.'",
        "'speaker_1': 'You're up next. Thank you, Madam President. Chief line, were the complaints that have been made about.'",
        "'speaker_0': 'Spoiled.'",
        "'speaker_1': 'Food, were those in Denver, how is that kind of complaint or.'",
        "'speaker_0': 'The quality of the of the food.'",
        "'speaker_1': 'Overseen.'",
        "'speaker_0': 'Within the jail?'",
        "'speaker_3': 'Thank you, counsel. Council woman Torres I'm not familiar with any complaints at all related to Aramark from Denver. They don't currently have a contract with us, so they're not providing that service with DSD currently. So I'm not familiar with any Denver based complaints.'",
        "'speaker_3': 'To answer the second part of your question, we have put some what I would refer to maybe as some guardrails in place to ensure that appropriate oversight. Excuse me. Is main is maintained throughout the term of the contract.'",
        "'speaker_3': 'I'm one of those things that we've done is assigned an executive level of our command team, which is the major who currently oversees as the facility administrator, the county jail, where the vast majority of our food service functions occur.'",
        "'speaker_3': 'And part of his ancillary roles moving forward will be to oversee the contract and ensure that all things related to the contract and all things, quite frankly, related to food service are maintained. You know, meeting extremely high standards.'",
        "'speaker_3': 'That's one of the things that we've put in place. We also will have regular inspections and audits done. Some of those inspections and audits will be done by the Denver Department of Public Health and Environment. And in fact, I believe Danica Leave from DDP.'",
        "'speaker_3': 'She is also on the call here and can speak specifically to the inspections that will be done by DDP as well. In addition to that, we maintain a couple of different accreditations here at DSD. One of them is the American Correctional Association and the other is the National Commission on Corrections Health Care.'",
        "'speaker_3': 'Both of those sets of standards require specific things be met related to food service. Those two processes come along with multiple audits and inspections to ensure that those standards are being met. So in addition to inspections being done by our own staff that work in the accreditations area, regular audits will be done by those two entities as'",
        "'speaker_3': 'well to make sure that we're continuing to meet those standards. In addition to, you know, executive command oversight inspections and accreditation, we also have a very formalized complaint procedures internally here at DSD, so that anyone in our custody that has any issue with anything related to food service, they can file those complaints by means of a grievance'",
        "'speaker_3': '. And then we have a specific unit that reviews every one of those grievances and then makes assignments so that we can provide adequate responses to the inmates and that we can correct any issues that we find, any services that we provide.'",
        "'speaker_3': 'So that gives you an idea of the various types of oversight or guardrails that have been put in place to ensure that those high level of standards that we expect our continue to be maintained throughout the term of the contract.'",
        "'speaker_1': 'Thank you. And I do have one question about the price adjustments section of the contract. Is that something that you can answer cheaper or is there somebody else?'",
        "'speaker_3': 'We actually have two two other people on this evening that might be able to help with that. Troy Bratton is on from the city attorney's office that may be able to answer that. And then also we have Ian Dougherty on from finance that may be able to assist with that.'",
        "'speaker_3': 'So if either one of them are are suited, perhaps they can make it known that they can answer that question for you.'",
        "'speaker_0': 'All right, we've got them both in the queue. And so it's Trey or Ian, either one of you.'",
        "'speaker_1': 'And I'll just ask the question. The bill request goes through. Looks like it's June 20, 23 with.'",
        "'speaker_4': 'Uh.'",
        "'speaker_1': 'Extension years. Just wondering for the 9 million that's presented how the price adjustments are contemplated within that contract amount.'",
        "'speaker_3': 'Hi, this is Troy. Troy Brown from the city attorney's office. I'm going to go ahead and defer to an on on one and finance. Then I can ask answer any legal questions that might come up. But I'll I'll leave the pricing questions to the finance.'",
        "'speaker_3': 'Certainly. Thank you, Troy. Thank you, Councilmember Torres, for this question. In terms of the price adjustments. I believe with the way the contract is set up, with the terms ending midyear gives us some flexibility in if we need to request additional funds due to the due to the CPI increases that we we have that flexibility, we'll be'",
        "'speaker_3': 'able to use our our typical methods for, you know, youth analysis and projecting expenditures in order to be able to in order to meet those needs. But we we believe that that we'll be able to do that with minimal impact.'",
        "'speaker_1': 'So just and maybe it's a non-issue. But I was just I found it interesting. And when I ask the question, the price adjustment arrived at INS June 30th, 2022, but the contract goes through 2023, so it'll be adjusted within that first period of time.'",
        "'speaker_1': 'And just wanting to see that the 9 million covered a price adjustment. So you're contemplating a CPI and of a standard CPI.'",
        "'speaker_3': 'I? Yes, I believe if memory serves me, that is actually.'",
        "'speaker_2': 'Written into the contract.'",
        "'speaker_1': 'Okay. Okay. Nothing further. Thank you, Madam President. Thank you. In.'",
        "'speaker_0': 'Q All right. Thank you, Councilmember Pro-Tem Torres. Up next, we've got Councilmember Flynn.'",
        "'speaker_3': 'Thank you, Madam President. Chief Line. I don't know if you are the person to address this. Or maybe Troy. Section six of the contract deals with termination. I want to expand a little bit on the earlier questions, the accreditation we have from the American Correctional Association and the other accreditation that they contain.'",
        "'speaker_3': 'They include standards for food service and food quality. The termination section of the contract, section six, we can terminate this upon a breach or default of the agreement, and that would include the scope of services, any breach in those food service standards that would imperil our accreditation.'",
        "'speaker_3': 'Is that the case? I'm just a little concerned that we don't have the right to terminate other than for breach or default. This is from the city attorney's office. That's correct. Counsel then slammed the scope of work as incorporated into the contract.'",
        "'speaker_3': 'So any breach of any of the standards in the scope of work would also give us the ability to terminate the contract as well under that termination clause. And, you know, our standard clauses allow for legal remedies administratively and through litigation.'",
        "'speaker_3': 'So the scope of work is incorporated into the contract as well. Okay. So Chief, could you expand a little bit on what you call the guardrails? I read the memo that you sent out earlier last week about how we are going to ensure that Aramark which serve food in this in our two facilities.'",
        "'speaker_3': 'That does not result in the kinds of complaints that we've seen with some of aramark's, other correctional facilities contracts around the country. How are we going to avoid that? Councilmember Flynn, thank you for that question, sir. I'd like to defer to Danica Lee from CHP.'",
        "'speaker_3': 'I believe she's on the phone as well and can help answer that question specifically about the inspections and audits that'll be conducted by by the health department. All right. Thank you.'",
        "'speaker_0': 'Great. Thanks for joining us, Danica. Go ahead.'",
        "'speaker_1': 'The first thing. Thank you, Madam President. And good evening, counsel. Thank you for that question, Councilman Flynn. So we already conduct inspections in all these venues, the jail settings, and know part of what we do is respond to complaints, conduct inspections and take enforcement actions as needed.'",
        "'speaker_1': 'In terms of being able to avoid complaints. That's a very difficult thing to control for. But what we can do is make routine assessments, conduct inspections, assess for any issues, follow up on complaints will receive them, and then conduct three inspections is needed to verify compliance.'",
        "'speaker_1': 'And so that's a system that we use that you're likely familiar with in many different regulated food settings across the city, in Turkey, in Denver. And I'm happy to respond to any more specific questions, though.'",
        "'speaker_3': 'I thank you, darling. I didn't mean to imply that we would we avoid complaints. I think complaints are probably inevitable under any contract or under any condition. But how do we how do we handle them? How do we determine that they're legitimate?'",
        "'speaker_3': 'I know that Aramark serves over 400 correctional facilities around the country, and we've heard about some serious problems in some of them. So I don't want to be one of those one of those that has the complaints. I want to make sure that we have a mechanism in place so that we can actually terminate the contract if'",
        "'speaker_3': 'there is a breach. And I know that there's a period to cure a 30 day period to cure, but that's why I wanted to be clear. You also did EPA. She also does inspections right now under the the in-house program, do you not?'",
        "'speaker_1': 'That's correct. We do conduct inspections of whoever is in that role.'",
        "'speaker_3': 'Preparing and serving food. We had complaints about food quality under the in-house program.'",
        "'speaker_1': 'I'm not aware of any recently. Certainly going back in past years and visiting four or five years ago, I can recall a few, but nothing consistent or anything that's on my radar right now.'",
        "'speaker_3': 'Okay. Chief Lyon, can you elaborate on that? Are you aware of food service complaints under the sheriff's department program? Councilman Flynn, thanks for that question. And yeah, I can elaborate on that a little bit. It's not uncommon for us to get complaints from those in our care about either the quantities, if they believe that the quantities are'",
        "'speaker_3': 'too small, or perhaps they believe their meal was too cold or things like that. So we do occasionally get complaints like that, and when we get those complaints, they're typically done by means of a grievance. Those grievances that are forwarded to our grievance and incident response team, they then review those grievances to determine who's the best person'",
        "'speaker_3': 'to respond to those grievances, and then they get cataloged, farmed out, and reporting is maintained relative to those grievances so that we can respond to those. And if we have continued grievances, we can look into those things. There's also a procedure in place to elevate those to higher levels of command.'",
        "'speaker_3': 'So it's also not uncommon, although not frequent, for grievances to eventually arrive at my desk at each level. In the grievance process, we have the ability to investigate and we can go down, we can interview the inmates, we can take a look at the food quality and quantity ourselves and then make appropriate adjustments if we need to'",
        "'speaker_3': '. So that's part of the internal complaint procedures, if you will, that we refer to as a grievance process for the inmates to follow if there are complaints. Okay. And of course, under the current program, we can't fire ourselves.'",
        "'speaker_3': 'Right. But we can terminate the Aramark contract. Are you. Are you aware of how our complaints have been handled before as a as a resulted in corrections to how we prepare our food under the current program? Yes, sir, I am.'",
        "'speaker_3': 'Typically, they are handled at the lowest level. If a if a deputy happens to get a complaint or receive a complaint from an inmate about an issue, there's some discretion at that level for them to take immediate action.'",
        "'speaker_3': 'If the inmate is complaining about some sort of food that they're served, then they can show it to the to the deputy and make that issue known. The deputy can can take some steps to remedy that right there on the on the scene and either or address the issue.'",
        "'speaker_3': 'Thank you. That's what I was driving at, because when you say they can file a grievance, that sounds like it's a very long process that would take longer than breakfast or lunch. So things can be resolved on the spot.'",
        "'speaker_3': 'Can they be resolved on the spot under this contract as well? Yes, sir, they can. The grievance process and complaint process won't change whatsoever. And if an inmate has a complaint, that can be acted upon immediately. Okay. Thank you.'",
        "'speaker_3': 'That's all. Madam President.'",
        "'speaker_0': 'All right. Very good. Thank you, Councilman Flynn. And thank you, Chief Lane and the team for being here to answer the questions this evening and not seeing any other hands raised. Madam Secretary, roll call, please.'",
        "'speaker_1': 'CdeBaca. Oh, no, Clark.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Hines, I.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Can I? Sawyer. No. Torres. I. Black I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary. Close the voting and announce the results.'",
        "'speaker_1': 'Two names. Nine I's.'"
    ],
    "A resolution approving a proposed Amendatory Agreement between the City and County of Denver and Colorado Village Collaborative to increase funding for Safe Outdoor Space (SOS) sites. Amends a contract with Colorado Village Collaborative by removing the restriction that 60% of funds within the contract scope be expended only on a singular second Safe Outdoor Space (SOS) site. No change to contract amount or duration (HOST 202158824-01). The last regularly scheduled Council meeting within the 30-day review period is on 7-19-21. The Committee approved filing this item at its meeting on 6-16-21.": [
        "'speaker_0': 'Nine I's Council Resolution 21, dash 20655 has passed. The next item up is Council Resolution 667. Councilmember Hines, will you please put Council Resolution 667 on the floor for adoption?'",
        "'speaker_2': 'A move the council resolution 20 10667 be adopted.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Questions or comments by members of Council. Council Member Sawyer.'",
        "'speaker_1': 'It's not. I'm president and called out this resolution so I can vote no. I voted no on the original contract, so I want to maintain consistency. The original conversation around the website started in response to the CDC guidance and the pandemic.'",
        "'speaker_1': 'They were sold to us as temporary and a temporary solution. But now the conversation has changed towards making them more permanent solution in our city. And the vast majority of residents in District five have made it clear that they don't want urban camping.'",
        "'speaker_1': 'Over 80% of voters in the city made it clear that they don't want urban camping. So I'm an alternate. Thanks, Mr. President.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Zoya. And not seeing any other hands raised. Madam Secretary, roll call, please.'",
        "'speaker_1': 'Sawyer? No. Torres. I. Black. I see tobacco. I. Clark.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Hines, I.'",
        "'speaker_1': 'Cashman. I can eat. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close voting and announce the results.'",
        "'speaker_1': 'One day, ten Eyes.'"
    ],
    "A bill for an ordinance amending the local open meetings laws to authorize electronic participation and electronic meeting methods during emergencies and making other conforming amendments. Modernizes open meeting laws to allow for use of emerging technology. The Committee approved filing this item at its meeting on 5-18-21.": [
        "'speaker_0': 'Ten Eyes Council Resolution 20 1-0667 has passed. The next item up is Council Bill 572. Councilmember Hines, would you please put Council Bill 572 on the floor for final passage?'",
        "'speaker_2': 'A move the council bill 20 1057 to be placed upon final consideration and you pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Councilmember Sawyer. Your motion to postpone.'",
        "'speaker_1': 'I move that final consideration of Council Bill 20 1-057 to be postponed to Monday, July 19th, 2021.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Questions or comments by members of Council. Council Member Sawyer.'",
        "'speaker_1': 'Thanks, Madam President. This is our remote meetings ordinance. It's an as most of you know, we tested council's hybrid meeting technology today. It needs a little bit more work. So we're going to postpone the final reading of this ordinance to get tech services and Channel eight a little more time before we head back into chambers for our'",
        "'speaker_1': 'meetings. We're super close, but just not quite there yet. So it's not a positive.'",
        "'speaker_0': 'Very good. Thank you. Council Member Sawyer And we continue to work on it. So appreciate everybody's patience. Madam Secretary, roll call on the postponement.'",
        "'speaker_1': 'Sawyer, I. Torres. I lack. I. CdeBaca. I. Clark.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'All right, I.'",
        "'speaker_1': 'Cashman. I can. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_1': '11 Eyes.'",
        "'speaker_0': '11 Eyes Final Consideration of Council Bill 20 1-057 to has been postponed to Monday, July 19. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote.'",
        "'speaker_0': 'Otherwise this is your last chance to call in an item for a separate vote. Councilmember Hines, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'"
    ],
    "A bill for an ordinance repealing the cannabis consumption pilot program ordinance. Repeals Chapter 6 Article VI of the Denver Revised Municipal Code to end the cannabis consumption pilot program. The Committee approved filing this item at its meeting on 6-8-21.": [
        "'speaker_2': 'That's a president and move that council bill 20 10466. Be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and we've got a second there. Thank you. The required public hearing for council Bill 466 is open. May we please have the staff report? And I see we have Abbey here with us.'",
        "'speaker_1': 'Thank you. Council President Gilmore. And good evening, members of council. My name is Abby Borchers and I'm a policy analyst with the Department of Excise and Licenses. I'll be presenting some information on Council Bill 20 1466. Council Bill 20 1466 proposes to repeal Chapter six Article six of the Denver Revised Municipal Code.'",
        "'speaker_1': 'This section of the code governs the Cannabis Consumption Pilot Program, which was created by an initiated ordinance approved by Denver voters in 2016, also known as I 300. The initiated ordinance created a cannabis consumption permit issued by excise and licenses, allowing the permit holder to allow cannabis consumption in a designated consumption area.'",
        "'speaker_1': 'On July 1st, 2017, excise and licenses adopted rules governing marijuana designated consumption areas. In 2019, the Colorado State Legislature passed House Bill 19 1230, creating a state framework for regulating social consumption of marijuana and adopting two types of marijuana hospitality licenses.'",
        "'speaker_1': 'After this bill was passed in 2019, the State Licensing Authority adopted comprehensive rules governing marijuana, hospitality businesses. And then in April of this year, Denver City Council passed Council Bill 20 1217, which adopted the state's marijuana hospitality licenses and related rules, offering a more robust framework for regulating social consumption of marijuana, as well as better opportunities for'",
        "'speaker_1': 'business owners and consumers. The marijuana hospitality program renders the cannabis consumption pilot program obsolete. One key similarity between the programs is that like the cannabis consumption pilot program, the marijuana hospitality program allows consumers to bring their own marijuana to licensed marijuana hospitality businesses to consume on the premises.'",
        "'speaker_1': 'But there are also several differences between the programs. First, under the cannabis consumption pilot program. Sales of marijuana were not allowed at licensed consumption establishments under the new marijuana hospitality program. Small sales of marijuana will be allowed at licensed marijuana, hospitality and sales businesses.'",
        "'speaker_1': 'Second, unlike the cannabis consumption pilot program, the marijuana hospitality program allows for indoor smoking and vaping at licensed marijuana hospitality businesses in compliance with odor and ventilation requirements. Third, while temporary event permits were available under the cannabis consumption pilot program, the state's framework for marijuana hospitality does not allow for temporary event permits.'",
        "'speaker_1': 'And finally, the cannabis consumption pilot program did not allow for consumption on a mobile licensed premises such as a tour, bus or shuttle. While the Marijuana Hospitality Program does. By Charter within the first ten years after approval, any voter approved initiated ordinance can only be amended or repealed by a two thirds vote of city council and only'",
        "'speaker_1': 'after a public hearing is held. Of the ordinance will require nine affirmative votes. And I just wanted to add, there's only one active cannabis consumption license in the city, and that license will be converted into a marijuana hospitality establishment automatically.'",
        "'speaker_1': 'Um, thank you. And I'm available to answer any questions.'",
        "'speaker_0': 'All right. Thank you very much, Abbie, for the staff report. Tonight, council has not received any written testimony on Council Bill four, six, six. And it doesn't look like we have any individuals signed up to speak this evening either.'",
        "'speaker_0': 'And so we will go ahead and entertain questions from members of Council on Council Bill 466. All right. It doesn't look like we have any questions from members of council. The public hearing is closed. Comments by members of Council on Council Bill 466.'",
        "'speaker_0': 'Seen none. A quick reminder, we are going to need to have seven affirmative votes tonight to pass this to repeal it. And so we will go ahead and not seen any comments. Madam Secretary, roll call on Council Bill 466, please.'",
        "'speaker_1': 'Black. CdeBaca.'",
        "'speaker_3': 'I live.'",
        "'speaker_1': 'Clark.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Hines, i.'",
        "'speaker_1': 'Cashman. I can. I. Sawyer. I. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_1': '11 days.'",
        "'speaker_0': '11 I's Council Bill 20 1-0466 has passed. Thank you, Abby. And the excise and licensing folks for joining us this evening. We're going to go ahead and move on to our second hearing now. Councilmember Hines, would you please put Council Bill 516 on the floor for final passage?'"
    ],
    "A bill for an ordinance to amend Chapter 59 (Zoning) of the Denver Revised Municipal Code relating to the Denver Zoning Code and to amend and restate the Denver Zoning Code. Amends the Denver Zoning Code by making numerous changes to correct, clarify, and make minor substantive changes to all articles of the code as part of regular code maintenance and upkeep. The Committee approved filing this item at its meeting on 5-4-21.": [
        "'speaker_2': 'I yes. Council President. I move that council vote 21 zero 516 be placed upon final consideration and do pass.'",
        "'speaker_3': 'Again, I think.'",
        "'speaker_0': 'And I want to clarify the motion. Councilman Hines. We need to have it be placed upon final consideration and do pass as amended.'",
        "'speaker_2': 'It hasn't been amended yet. So I'm I think that's next. I don't I don't think we have to put it on for consideration before we can amend it. Amend it. But I don't think that I don't know. Just a parliamentarian question.'",
        "'speaker_0': 'I suppose we can go ahead and bring our council secretary Makhija up into the queue. Do you want to go ahead and address that?'",
        "'speaker_1': 'Members of Council Makhija here. I have placed this to be placed upon final consideration and do pass as amended as it was amended at our previous meeting and it has not been voted on. That amendment did pass at our last meeting, so we are going to want to place this on the floor as amended at this meeting'",
        "'speaker_1': ', whether the next amendment passes or not.'",
        "'speaker_2': 'Wonderful. Thank you. Council secretary and for the recollection of the last meeting. So I apologize. I move the counsel bill 21.0516 be placed upon final consideration and do pass as amended.'",
        "'speaker_3': 'Second.'",
        "'speaker_0': 'Thank you. You've got the motion and we have the second. Councilmember Herndon, your motion to amend.'",
        "'speaker_3': 'Thank you, Madam President. I move that council bill 20 120516 be amended in the following particulars on page to line 29 strike subsection two of this ordinance and replaced with subsections two and three of this section two on page four.'",
        "'speaker_3': 'Line three add a new subsection three that reads as follows And please bear with me. Number three notwithstanding subsection one of this, Section two, if requested by an applicant, a formal site development plan application submitted under 12 .4.3 of the Denver Zoning Code may be processed to completion under the provisions of the 2018 Denver Zoning Code, including'",
        "'speaker_3': 'the amendments found in clerk filed numbers 2018 0204 2018 0414 2018 Dash 0532 2019 0046 2019 0058 2019 0075 in 2020 0090 and the Corrections Parentheses Together The November 12, 2020 Denver Zoning Code Parentheses If a site development concept plan application was filed with CPD between September one, 2019 and February ten, 2021, and the application proposed a'",
        "'speaker_3': 'specific use type no longer listed in the use and parking tables of the March 31, 2021 Denver's Zoning Code, a formal site development plan application process under the provisions of November 12, 2020. Denver's zoning code pursuant to this Section 2.3, shall be subject to the following requirements.'",
        "'speaker_3': 'One If the formal site development planning application has not received approval by the Development Review Committee on or before 4:30 p.m. Mountain Standard Time, May 1st, 2023. The application shall be void once a formal site development planning application becomes void.'",
        "'speaker_3': 'All new site development plan applications will be processed under the Denver Zoning Code. Then, in effect, no extensions of time will be granted to the site. Development plan must meet all the standards and requirements of the November 12, 2020.'",
        "'speaker_3': 'Denver's Zoning Code and an applicant may not substitute standards and requirements of the November 12, 2020 Denver Zoning Code, with those set forth in any subsequent amendments to the Denver Zoning Code three a formal site development plan approved under the provisions of November 12, 2020.'",
        "'speaker_3': 'Denver's zoning code, if requested by an applicant, may be modified or amended applying the November 12, 2020. Denver's Zoning Code. If the application for a modification or amendment is approved by 4:30 p.m. Mountain Standard Time, May 1st, 2023.'",
        "'speaker_3': 'Any application for modification or amendment to such formal site development plan approved under the provisions of the November 12, 2020 Denver Zoning Code that does not receive approval by May one, 2023, must comply with the Denver Zoning Code.'",
        "'speaker_3': 'Then, in effect, according to section 12 .3.7 of the Denver Zoning Code, no extensions of time will be granted. My apologies to the translator.'",
        "'speaker_0': 'No worries. I think we got it. Thank you for slowing down a little bit on it. And again, we have I think you it has been moved and seconded. Councilmember Herndon, would you like to explain the amendment before we open up the hearing?'",
        "'speaker_3': 'Yes, ma'am. The purpose of this amendment is to allow certain projects to be processed under the version of the Denver zoning code prior to the enactment of the group Living Amendment to the Code. Specifically, this amendment applies to projects meeting two criteria.'",
        "'speaker_3': 'The project submitted a site development concept plan between September 1st, 2019 and February ten, 2021, and the project proposed a use that was no longer listed in the Denver zoning codes used in parking tables after enactment of the group Living Amendments to the Code.'",
        "'speaker_0': 'All right. Well, thank you, Councilmember Herndon. The required public hearing for Council Bill 516 is open. Speakers may offer comments on either or both Council Bill 516 and the amendment. After the conclusion of the public hearing. Council will vote separately on each and may we get a staff report.'",
        "'speaker_4': 'Hi. This is Tina Axelrod. I need to share my screen. And there it is. Started. Hey. Good evening, everyone. My name is Tina Axelrod and the sending administrator and I sit in the city's community planning and Development Department to dove into the substance of the Council bill in front of you, which is the 2021 bundle of Denver'",
        "'speaker_4': 'zoning code text amendments. I'll be speaking briefly about what this project is and give a very brief summary of certain high. High visibility amendments. Talk about our community outreach and the public comments we have received. Go through the review criteria analysis that we apply to our text, amendments to the zoning code, and then share CPD's recommendation for'",
        "'speaker_4': 'your action tonight. This is part of a regular cycle of code maintenance that we do to the Denver zoning code. This code is a complex animal, as you just heard in that description, and it must be regularly updated and maintained.'",
        "'speaker_4': 'To that end, CPD brings forward on its own initiative a bundle of text amendments on a regular 2 to 3 year cycle. And the focus of that bundle is typically to correct, clarify and update the zoning rules. Most of the bundle text changes that are before you this evening come from firsthand experiences with administering the code by'",
        "'speaker_4': 'CPD, planning, permitting and inspection staffs. We also gather input on any potential conflicts with other city agencies or issues with enforcement and administration. And certainly we hear from our customers on a regular basis too, on what's working or not working, what's clear or not clear in our code.'",
        "'speaker_4': 'And that's what we seek to address in this bundle of tax changes. The 2021 bundle includes nearly 170 proposed changes that generally fall into four categories. First is the correction of miscellaneous publication errors. These are very low hanging fruit and typically are non substantive.'",
        "'speaker_4': 'Those are the typos, the errors in the outline, summary numbering and formatting. A second bucket of changes were changes relating to our assigned code. Again, primarily corrections and clarifications to existing provisions. Though I'll walk through some minor policy changes as well.'",
        "'speaker_4': 'As many of you know, our sign code is a harks back to A to many decades ago and it's challenging to keep up with current business practices, but that's what we try to do in this bundle. And then probably the largest category of changes that you'll see in the 2021 bundle really were changes identified by our residential'",
        "'speaker_4': 'review staff as really critical or necessary for improved day to day administration. A lot of clarifications, corrections and minor changes. And when I say residential review, this is the world of one and two family dwellings. Anything with three or more dwelling units inside the structure is actually considered commercial and goes to our commercial review teams or productive'",
        "'speaker_4': 'teams. So you'll see a lot of these one or two family changes. And then there's always the catch all bucket of changes that have been identified as high priority, primarily again aimed at clarification and ease of administration of this of this code.'",
        "'speaker_4': 'So I wanted to take a few moments just to spotlight some key bundle items that have garnered attention through public comments or questions that we've received. As you can see here, it's a relatively short list that I'll take a little time to walk through it.'",
        "'speaker_4': 'Everyone is interested in anything that has to do with accessory dwelling units and the city of Denver, and the bundle does include some changes. We have to distinguish between changes to what we have as a separate building form or set of building and development standards for a detached structure on a lot that could contain an accessory dwelling'",
        "'speaker_4': 'unit and use and then a different set of requirements that hone in on just the operation of an accessory dwelling unit use. So first, I'm going to talk about the building porch changes. What you'll see in the bundle are a set of changes, again, mostly directed from customers and clients on what was working or not working, what'",
        "'speaker_4': 'was very complex to understand what seemed to be working at cross-purposes within the code. And the first one was a requirement that made the side interior setbacks for certain detached eighties structures in small neighborhoods larger than what was actually required for the main house.'",
        "'speaker_4': 'And this change just brings those setback requirements in line so you can build your detached structure at the same distance from your sidelines as the main house. The second is that there was a criteria that said if you're building a taller, detached structure in your rear yard and it was likely to contain the detached accessory dwelling unit'",
        "'speaker_4': 'use that you had to push that structure to the southernmost side step back line that was originally intended to address a speculative possible impact on so their access. But as we've learned through the years of administering that standard, it didn't really succeed in its original intent.'",
        "'speaker_4': 'There would still be shadows if it were so that a portion of the structure touched the southernmost line. Then if it were centered in the lots and that the leading the standard just allows greater flexibility and siting and we still have controls over the overall bulk as it sits close to those sidelines.'",
        "'speaker_4': 'And I'll show a little bit more on this one in just a moment. And then in terms of controlling the scale of a detached accessory dwelling unit building, there's really no changes in the current allowance. But we did have some conflicting standards that needed some cleanup and clarification.'",
        "'speaker_4': 'So at the end of that effort, we deleted one standard that seemed to address how large the actual unit can be inside the detached structure and kept three others that controlled for the same outcome. It was one too many and it led to endless.'",
        "'speaker_4': 'Conflicts of standards within the code and confusion among our architect and other developer clients. This is an illustration of that first change I highlighted regarding just changing the minimum size setbacks so it would match what you can, where you can put your main house on these particularly smaller, narrower lots.'",
        "'speaker_4': 'So in the middle you can see what's being proposed with the change. You can you can go to three feet just like the primary dwelling unit, as opposed to having to push it in an additional two feet. And then on the right is where you can put a garage that is generally a same or larger footprint that'",
        "'speaker_4': 'can actually go a lot lines, a lot line. So again, we just wanted to match those two allowances that seem to make the most sense. And then in terms of the change regarding whether you have to push the structure to the southernmost line, we took a look at this.'",
        "'speaker_4': 'We took a look at a lot of cases to look at the resulting form. And what we saw is with the current requirements, often where we're getting these odd, ugly shaped reforms in an effort to meet meet the standard, which said push it to the southernmost limit and in order to get the maximum space within the structure'",
        "'speaker_4': 'for an upper story. We might get something that looks like a wedding cake step in. And what we're suggesting now is just a little more flexibility to move the structure side to side. It ends up actually being further away from the neighboring property with this change, then without it and we get a more regularly shaped and habitable'",
        "'speaker_4': 'space under the resulting building envelope. As I mentioned, there's another distinct set of ADU restrictions in the zoning code that just addressed the use, whether it's inside a detached structure or inside the main house. And here's where we had to make some changes.'",
        "'speaker_4': 'We had a very impractical maximum limit on the size of an ADU unit when it was located inside the house. And this was a legacy of how we regulated accessory uses of any variety. So your home office or your.'",
        "'speaker_4': 'Whatever your other. I can't think of any other assets or uses now inside the home, but typically it'd be like a home business. We had this general rule that capped it at 20% of whatever the primary dwelling unit size was or 300 square feet.'",
        "'speaker_4': 'When you're talking about an actual habitable living space of an independent dwelling unit, 300 square feet is very small. So what we've changed is to try it again. It has to be secondary to the size of the main unit.'",
        "'speaker_4': 'So no more than 75% of the gross floor area of the primary dwelling unit or 864 square feet, whichever is greater. And that really brings an inside the house, Adu, to the same maximum limits on the scale of the use that we allow currently for an ADU use and a detached structure.'",
        "'speaker_4': 'So your basement adu use can now be essentially the same size as if you built it in a detached structure. There's a couple other cleanups that get really technical but are listed below. I'm going to keep going here.'",
        "'speaker_4': 'The other main topic where a more substantive policy change was made was in the parking provision and requirements for affordable housing projects in the city of Denver. These parking ratios and buy ratio, I mean, the formula for figuring out the number of spaces, given the number of units of affordable housing, haven't been revisited in over 12 years'",
        "'speaker_4': '. In the meantime, we have a lot more experience with actually seeing affordable housing projects built not just in the city of Denver, but all up and down the front range. So in wanting to keep up to date, we also had the fortune of having two different studies released in the last months of 2020 that looked at the'",
        "'speaker_4': 'very question of how much parking was appropriate for affordable housing. And those studies both provided data on the on two critical points the overall car ownership of households living in these very affordable housing units, and also the parking demand generated by the project in total for parking on site.'",
        "'speaker_4': 'Looking at those studies, looking at our own experience inside the city of Denver, we wanted to take the opportunity during this bundle to bring our parking ratios into alignment with the 21st century and the recent development history. So the changes are an update to the alternative parking ratio for very affordable units.'",
        "'speaker_4': 'And that ratio, again, yields the number of parking spaces per dwelling unit. And then a second change that would update the 20% reduction of required of of required parking when the developer chooses to build the affordable units on site per our linkage fee current linkage fee ordinance.'",
        "'speaker_4': 'So the table summarizes the change. The first one again, currently we have in the main street zone districts only and there the change proposed was to broaden this allowance to all zone districts applies when you're providing housing instead of 40% ami again based on experience in those studies, we've increased the range of this particular reduction to reach'",
        "'speaker_4': 'housing that provides units to households at 60% AMI and below. And here's the section of change in the alternative ratio went from point to five parking spaces per unit 2.10 per unit. So this is a reduction in the minimum required parking that a developer may choose to use.'",
        "'speaker_4': 'It still requires some parking. It doesn't take it entirely away. And most of that parking is intended to serve employees, service providers and then capture the very low car usage rates by residents. And then the second change was primarily an expansion of the applicability of a 20% parking reduction from just being from being applied in all zoned'",
        "'speaker_4': 'districts except the Main Street to now including the Main Street zones and the proposed change. And again, this is just for the onsite build alternative choice. We gave a 20% reduction that has not changed at all in the bundle.'",
        "'speaker_1': 'Oops.'",
        "'speaker_4': 'And then that another bucket of of multiple changes in this text amendment package was those fine updates that referred to and generally just reflecting current sign trends and practices and needing to clean up and catch up with where our business customers in the city were headed with their sign designs.'",
        "'speaker_4': 'So all the pictures on the side here are now signs that we see everywhere that weren't clearly allowed under the Denver zoning code. And now with the changes generally, these are all types of water signs temporary when signs cannot be signs, menu board signs that were not clearly addressed or allowed or were just outright prohibited that have'",
        "'speaker_4': 'now been changed and clearly allowed. That's what all these words say, essentially. And then just obviously there were a lot more minor policy changes and clarifications and corrections that you'll see in the red lines. Just looking at a few across the remaining articles, I've listed them here.'",
        "'speaker_4': 'None of these are probably earth shattering in most people's view, but again, addressed a gap or a need for clarification. Like How do I assign a building form? This whole code is supposed to be form based. What if I have an existing structure?'",
        "'speaker_4': 'What building form do I choose? And now we actually put into the code what we've been practicing up the code for 11 years now. Gee, you know, shading devices are a hot item on buildings. Now we get vertical and horizontal things that people are calling shading devices and are they allowed to encroach into the sides or front'",
        "'speaker_4': 'or rear setbacks? We've clarified that because we're seeing a lot of things that were never, never addressed. Yeah, we were missing some standards and industrials out of things that we didn't have any standards for accessory buildings. Well, that was a real surprise to many of our industrial customers.'",
        "'speaker_4': 'So we've added those back in our Use Limitations article. We did make some changes to short term rentals. Again, just putting more clearly into the code, what we've been telling our customers over the past five, six years with short term rentals and a critical one was that the licensing ordinance stated that a short term rental must occur'",
        "'speaker_4': 'in a dwelling unit as defined by the Denver zoning code. But the Denver zoning code didn't say that, so now it does. And then finally we looked at opportunities for process streamlining to help our customers and where we saw some justification.'",
        "'speaker_4': 'And one place where we did remove what we call a zoning permit with informational notice process was for offenses that are more than four or six feet height, depending on where they're located on the lot. And that was based on a study that showed that the vast majority of those requests were were granted.'",
        "'speaker_4': 'And with no comments raised or comments that were generally not even on point to to what was being asked for, for input. And then everyone loves carriage lots in Denver. They're those weird interior block lots. We had a lot of rules and interpretations and clarifications that were off the books.'",
        "'speaker_4': 'We put them on the books now for help with transparency for those lucky folks who own a piece of or an entire carriage lot in Denver. This slide just summarizes the schedule and public outreach. We did go to IMC ZAP Committee.'",
        "'speaker_4': 'We had office hours. We did a slew of information items. We had several opportunities to comment on drafts that were released publicly. The planning board did have its hearing on April 21st and recommended approval of the entire bundle package.'",
        "'speaker_4': 'We went through Luti. We're here today and if all goes well, the bundle revised code will become effective on July 1st. We did receive comments. Generally, they fell into, again, a few critical areas of interest to the community.'",
        "'speaker_4': 'Those changes I described to the ADOS garnered a lot of comments and all unanimously, unanimously in support of the bundle changes. Where things diverged was most of our commentators wanted more revisions. That is this. That is the scope of an upcoming planning services project.'",
        "'speaker_4': 'And we're just not in the scope of a bundle to go much further than we did in the interest of clarification and corrections, as opposed to major policy changes on the affordable housing parking changes that I described. Again, we received overwhelming support.'",
        "'speaker_4': 'There was one brief letter in your packet signed by 72 different Denver area affordable housing advocates, nonprofits and businesses. We got separate letters of support from the state dollars agency. Of course, internally host is very supportive of the change, as is Dora.'",
        "'speaker_4': 'And then there were some changes in the code that I did not get into deeply. That just clarified some general rules that we have been applying consistently over the last few years on what you can build on a settlement that was too small for a duplex, but big enough for a single unit structure or too small to'",
        "'speaker_4': 'host a structure with the ADU unit. What could you do? There was a lot of pushback and give and take between customers, and we just needed to get this very clear on paper. This captures a current policy, doesn't say it will never change.'",
        "'speaker_4': 'Would we have an upcoming ADU project? This could change, but we just cemented the current policy which says if your lot is too small for a duplex or you're lots too small for a detached adu structure per the current code, you cannot build those structures on such small lot.'",
        "'speaker_4': 'And then we got a slew of comments and mostly questions about changes to our set back exceptions. Again, most of our changes were not substantive, but we did reorganize, rename, clarify, and those were those types of comments were answered by staff.'",
        "'speaker_4': 'Each and every one. Okay. Well, before you now you have to consider whether there's this whole bundle of text amendments meets our review criteria that city council has to hold it up against in terms of making amendments to the Denver zoning code.'",
        "'speaker_4': 'These are all found in the Denver zoning code section 12 .4. 11. We have, of course, the all important consistency with adopted plan. So does this bundle represent a path forward that's consistent with our adopted comprehensive plan to 2040?'",
        "'speaker_4': 'As explained in more detail to staff, report STEP did find that the bundle represents principles and advance the goals of that comprehensive plan, including working across multiple agencies on some of those changes, such as the parking for affordable housing, some of those substantive changes certainly further adopted goals regarding around affordable housing, and then just overall providing greater'",
        "'speaker_4': 'clarity and predictability of zoning standards help sustain and grow Denver's neighborhood businesses. It helps to know the rules. Blueprint. Emperor has an explicit policy and strategy that states to that insurers. The Denver Zoning Code continues to respond to the needs of the city while remaining modern and flexible, and the checklists of further policies, we believe, are advanced'",
        "'speaker_4': 'by both the substantive and non substantive changes of the bundle. We do have to hold up all text amendments to for consistency or at least no impediment to the equity goals of blue print. Denver and a bundle like this that provides greater clarity and fixes errors in the city's existing zoning rules.'",
        "'speaker_4': 'This has a mostly neutral impact on furthering these equity goals that neither impedes but also probably does not on a scale, substantially advance those equity goals. But where we did get into substance as opposed to the majority of corrections and clarifications, certainly the changes addressing affordable housing and ADU use met some of those equity concepts by expanding'",
        "'speaker_4': 'opportunities for more flexible, affordable housing, citywide enabling providers to increase the range of affordable housing offered and allow more opportunities for use as an alternative housing type. So in some CPD staff finds that the proposed bundle of texts amendment is consistent with adopted plans.'",
        "'speaker_4': 'Secondly, it will further the public health, safety and welfare of the citizens of Denver, primarily by providing that transparency, clarity and predictability in these substantial rules that govern land development in the city. And by removing or at least chipping away at some of those regulatory barriers to planned and desired private enterprise and redevelopment.'",
        "'speaker_4': 'And then thirdly, these bundle amendments will result in uniformity of district regulations and restrictions. They will be applied equally and uniformly to similar buildings and land uses within each of the zone districts. Accordingly, CPD staff recommends and respectfully request the City Council to adopt and approve this text amendment.'",
        "'speaker_4': 'With that. I'm happy to take questions.'",
        "'speaker_0': 'All right. Well, thank you very much, Tina, for the great presentation. And tonight, counsel hasn't received any written testimony on Council Bill 516. And we have eight individuals signed up to speak this evening. And our first speaker is Mary Coddington.'",
        "'speaker_0': 'Go ahead, please, Mary.'",
        "'speaker_1': 'That evening council, I'm Mary Coddington. I'm speaking tonight on behalf of the Neighborhood Development Collaborative in favor of the adoption of the text amendments. And I'll keep my comments brief this evening. As you well know, our housing supply is not meeting the current housing demand in either the overall quantity or at the price points that are needed'",
        "'speaker_1': '. And as a community, we have to use every tool available to us to manage our resources and ensure they're reaching as many people as possible. And by having enshrined parking minimums that overshoot the actual need for parking money thrown away that could be used to house more people or improve the critical wraparound services that are needed for'",
        "'speaker_1': 'low income and very low income residents. The proposed parking changes allow affordable housing developers the opportunity to build what's needed. Several in D.C. members not only operate in transit rich Denver neighborhoods, but also in places further away from great transit access.'",
        "'speaker_1': 'And they recognize that properties that aren't near public transit options will need more parking, even if it's above the minimum required by the code. And the mission based housing providers are in the business of serving their residents and pursuing the best possible outcomes for those residents.'",
        "'speaker_1': 'And they're motivated to develop their properties in ways that are supportive, whether that means a few more parking spots or slightly fewer. So that flexibility is really, really important. And just lastly, I would like to thank RTD as well as SHOP works in Seattle for their research into this issue and CPD for being really responsive to the'",
        "'speaker_1': 'changing needs in the city and to you council members for your work to make sure that the policies continue to evolve and meet our changing needs. Thank you so much.'",
        "'speaker_0': 'Thank you, Mary. Our next speaker this evening is Christian Pritchard. Go ahead, please.'",
        "'speaker_3': 'Good evening, council members. My name is Christian Pritchett with Blue Line Development for Affordable Housing developer based out of Missoula, Montana. I'm here to speak in support of the text amendment, specifically the changes to the parking ratios required for affordable housing as it's currently written.'",
        "'speaker_3': 'Denver zoning code requires a high degree of variability in parking ratios for affordable housing, ranging from zero spaces per unit in some downtown zone districts up to 1.25 in other areas in the city. Some of those zone districts allow for reductions to parking and others don't.'",
        "'speaker_3': 'That high degree of variability creates a lot of inconsistency on the viability of affordable housing developments across these swing districts when housing would be an otherwise allowable use. Denver's alternative ratios have not been updated in the past 12 years, and in that time, the cost of development has skyrocketed.'",
        "'speaker_3': 'In their most recent estimates, Denver's Department of Housing Stability estimates the funding gap of each unit of affordable housing is roughly $37,000, which translates to about the cost of a single parking space in an operating garage. This is this is money that we're spending on parking when we could otherwise be creating housing with those dollars.'",
        "'speaker_3': 'And a good example of this is the charity's house development, which is a 36 unit affordable housing project that would be owned by a community outreach service center in Denver. This project is ready to go with investors, ready to sign on the dotted line and put $5.7 million of private equity into this element by housing formerly homeless'",
        "'speaker_3': 'individuals. Under the current zoning code, we are required to provide 23 spaces of parking, even though our research shows that we need less than four spaces at this development. So we would urge you to pass this text amendment tonight so that projects like this can get done and and this project would start construction and be under development'",
        "'speaker_3': 'next month if this were to pass today. So thank you very much for your time.'",
        "'speaker_0': 'Thank you. Our next speaker is Brian Ross Burt.'",
        "'speaker_3': 'Good evening, counsel. Thank you so much for your time this evening. My name is Brian Ross for I'm the executive director of Housing Colorado and I'm a Denver resident. I live in Park Hill. Housing. Colorado believes that safe, stable and healthy communities are built upon the foundation of housing.'",
        "'speaker_3': 'We're a nonprofit membership organization working with the housing community to educate and advocate for the building and preservation of housing for low to moderate income Coloradans housing. Colorado is a unified voice of nearly 300 organizations and 6000 individuals across the state who represent diverse housing interests.'",
        "'speaker_3': 'I'd like to highlight tonight the letter of support that is included in your packet, which demonstrates the overwhelming support across the affordable housing industry that has come out in favor of a change to the parking requirements for supportive housing in Denver.'",
        "'speaker_3': 'The list includes the Denver Housing Authority, Volunteers of America, the Delores Project, Enterprise Community Partners, Colorado Maker, Housing Partners, and many more, including Housing Colorado. Many of these organizations have experience seeking to develop affordable housing in Denver. That doesn't make it past the vision stage because of the high parking requirements needed.'",
        "'speaker_3': 'Parking that RTD and Fox Total Shop Works report their reports demonstrate is unneeded and unutilized once it's built. This part of the Denver code, specifically the section with alternative ratios, has not been updated in over 12 years. Housing needs, transportation options and parking demand all shifted since then.'",
        "'speaker_3': 'To me, this proposal is much more than simply building more affordable housing units. But it will ensure that projects can be built, can build beautiful spaces in which individuals and families can heal and grow healthier. This change to the Denver code might allow for a courtyard to be built, for more staff positions to be filled, all in'",
        "'speaker_3': 'the hope of giving people the tools and resources they need to move toward stability. Parking continues to remain a significant barrier to the creation of more affordable housing in Denver, and ensuring that our unhoused neighbors have housing options that are affordable and attainable is important.'",
        "'speaker_3': 'I hope you will vote in favor of the text amendment bundle and the parking shifts for housing targeted at those making the least amount of money in our city. Thank you for considering this change to parking requirements to ensure the zoning code has consistency across the city and better needs meets what is truly needed so we can'",
        "'speaker_3': 'ensure the building to build as much housing as possible here in Denver. I appreciate your consideration of this change.'",
        "'speaker_0': 'Thank you, Brian. Our next speaker this evening is Lindsey Sentance. And you're going to have to unmute, Lindy.'",
        "'speaker_6': 'I'm. Wendy sent in, and my city of residence is Arvada. I served as vice president of program operations for Volunteers of America or VOA. And I'm glad to speak in favor of this amendment or portion of this text amendment.'",
        "'speaker_6': 'Well, view is statewide. Most of our housing and services are within the city of Denver, where we provide human services of many kinds, including food insecurity and emergency shelter and much more affordable housing, though, is a major aspect of our work, both nationally and in.'",
        "'speaker_6': 'Colorado Valley is one of the largest nonprofit providers of affordable housing. Quality, affordable housing. We currently operate 25 affordable housing communities across the state. Ten properties, just over 800 units are in the city of Denver. I'm passionate about housing and especially for the lowest income people and those without homes.'",
        "'speaker_6': 'Our people deserve a safe and dignified and accessible housing. It's highly unusual for very low income people and those who are homeless to pay for a car, much less the ongoing cost of vehicle ownership. VOA has a Denver project currently in the planning stages, and we're very excited about it.'",
        "'speaker_6': 'A reduction in the parking requirements would allow us at that location to build more units. We could also include a small green space, and then the children would be out on the playground and. Instead of looking at an empty parking lot.'",
        "'speaker_6': 'VOA, for one, has the bandwidth and the vision to have at least one affordable housing project in the pipeline on an ongoing basis. We just broke ground on one for seniors in Fort Collins and we just leased up one in Durango, a new one, if we're to have any hope of meeting the need in Denver for a'",
        "'speaker_6': 'decent place for everyone to live. We need projects coming in, coming online at a regular pace. And parking is important only when someone has or plans to have a car. But housing is essential for everyone. Please vote in favor of the amendment and or the bubble.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Jennifer Cloud.'",
        "'speaker_1': 'Thank you, city council for the opportunity to speak with you tonight. I'm the vice president of housing development at the Colorado Coalition for the Homeless. And you've been hearing the technical numbers, parking demand and parking utilization rates from the last few speakers.'",
        "'speaker_1': 'And I echo all of those sentiments. I just wanted to take a moment tonight to share a real life example of why this vote truly matters. I want to share the story of Katie, who lived a remarkable life.'",
        "'speaker_1': 'She was presidential appointee to the Small Business Administration and organized events around the world, meeting dignitaries and celebrities publicly. Katie functioned at the highest levels of government, but privately she struggled with a substance use disorder. And after suffering a traumatic brain injury while on a work assignment, Katie was no longer able to keep her job, and her'",
        "'speaker_1': 'life began to fall apart when she lost the support of her family and her marriage fell apart. Katie had no place to go. She said, I lived in 24 places in 24 months. But then she had a turning point thanks to housing that met her needs.'",
        "'speaker_1': 'Katie moved into one of six properties that provided safe, stable housing so she could focus for energy on her recovery. Today, Katie is thriving in permanent supportive housing at one of the coalition's apartment homes and is giving back to her community.'",
        "'speaker_1': 'Katie runs a peer to peer support network for people experiencing homelessness and mentors her neighbors and sponsors. Other struggling others who are struggling to recover from substance use and behavioral health issues. Housing is the basis for every member of our community to thrive, and Katie is just one of many examples of individuals who have turned their lives'",
        "'speaker_1': 'around by gaining stability through housing first. Many of our homeless residents like Katie don't have a car when they move into an apartment. Most folks need a house first before other pieces of their lives can fall into place.'",
        "'speaker_1': 'Folks are moving into our buildings, are exiting homelessness. And I know you have the data, but I'm here to tell you anecdotally, they simply don't have cars at the rate that market rate. Residents have cars. In my role as the VP of Housing Development at CCH, I worked incredibly hard to make finance to make the financing work'",
        "'speaker_1': 'at the lowest AMI affordable housing developments. And it's not without challenge. This change would truly open up opportunities for more housing by alleviating the need to build high levels of parking that just sit empty on our properties. So I urge you to support this text amendment bundle and the standardization of parking for affordable housing that's within it'",
        "'speaker_1': '. Thank you so much for your time. Have a good night.'",
        "'speaker_0': 'Thank you, Jennifer. Our next speaker is Kinsey Hastert. Go ahead.'",
        "'speaker_1': 'Good evening. Thank you. Council President Gilmore. My name is Kinsey Hastert, and I am the state and local policy director for Enterprise Community Partners. I am a Denver resident, but I'm here tonight to voice Enterprise's support for the 2021 Text Amendment bundle, and particularly provisions to make parking minimums for development of affordable housing consistent across the city'",
        "'speaker_1': '. Enterprise works nationally and here in Denver to increase the supply of high quality, affordable housing, advance racial equity, and build resilience and upward mobility. We do so through advocacy, place based programmatic engagement and capital investments. Given Enterprise's national scope.'",
        "'speaker_1': 'I wanted to briefly share how this update is in line with some other models around the country. A 2018 report from my National Enterprise colleagues examined proven local strategies for expanding the supply of affordable homes and addressing cost challenges.'",
        "'speaker_1': 'These included reducing or even eliminating parking requirements. This has proven particularly effective in cities similar to Denver, with transit rich areas where large amounts of parking are just not necessary and where land values are prohibitively high. For instance, New York City offers both density and parking incentives through its modernize, zoning rules and the adoption of an inclusionary'",
        "'speaker_1': 'housing program which lowers costs and reduce barriers to the construction of affordable and senior housing, in part by reducing parking requirements throughout the city. Seattle City Council approved legislation to provide developers with more flexibility in deciding how much parking to include in areas with frequent transit, in turn enabling the city to reduce parking requirements for rental and'",
        "'speaker_1': 'income restricted housing, among other benefits. And in 2016, Washington, D.C. undertook efforts to reduce parking minimums, lessening requirements for multi-family housing development, and cutting parking minimums, perhaps for mixed use developments near metro streetcars or bus lines. And while access to and reliance on public transit is a consideration for many cities, others seek to simplify or eliminate requirements'",
        "'speaker_1': 'entirely. Portland has gone through iterations to eventually eliminate residential parking requirements, including one step that specifically Waze waived excuse me parking minimums for projects providing affordable housing. And just last month, the Minneapolis City Council voted unanimously to remove parking minimums for new commercial and residential buildings to help reduce the cost of housing development.'",
        "'speaker_1': 'These are just some of the models from across the country, and we urge Denver to be another by eliminating inconsistencies in parking requirements for buildings up to 60% nationwide. As you've heard, this will better meet the needs of residents and really will go a long way toward helping new affordable units that are so desperately needed by residents'",
        "'speaker_1': 'to come online. Thank you for your time and hope you'll support the text amendment bundle this evening.'",
        "'speaker_0': 'Thank you. Our next speaker is Casey Slade.'",
        "'speaker_1': 'Hi, I'm Cassie Slayton. I'm one of the principal owners for with Foxtel Transmission Group. And we work all around the state, including Amnesty County of Denver. Our firm partnered with Shop Works Architecture to research parking demands on a variety of affordable housing types across the front range, front range to determine whether the current code requirements are warranted'",
        "'speaker_1': 'or if these parking requirements are too high. Based on our anecdotal evidence, we identified several properties that included supportive housing across the city, setting recommendations from hosts to ensure we included all of the most appropriate properties. To explore parking ratios.'",
        "'speaker_1': 'We surveyed 19 properties with an average am I between 30 and 50%? Our findings surprised even the members of our team. And below and I will list some of the key takeaways of this reporting. One bedroom housing in Denver, which is 30% or less.'",
        "'speaker_1': 'Am I roughly 88.8% of residents own a car? This equates to one vehicle for 12 units. For all of the affordable housing properties that we studied. Up to 60%. Am I 50%? Am I? The average vehicle ownership was 29% of residents, which equates to one vehicle per six units.'",
        "'speaker_1': 'The current code requires an average of one parking space for two units, which is 3 to 6 times more than the actual parking demand that we found in our study. We also found that the data showed that the properties, proximity to quality, walking and biking facilities as well as transit services deeply impacted the vehicle ownership.'",
        "'speaker_1': 'Luckily, RTD was actually selling the same thing at the same time that we were able to look at their city as well. And our findings mirrored what they were finding for low income housing. The 19 properties have been built in the last six years and they had a total of 883 parking spaces.'",
        "'speaker_1': 'The study found that only 461 of those spaces were utilized. This means that there was a surplus of two 422 spaces. Right now, a parking space costs on average about $22,000 per space. If you equate this out with the 422 unused spaces, that's about $9.28 million that was spent on unused parking.'",
        "'speaker_1': 'If that money was applied towards supportive housing, we could have had an entirely separate 40 unit apartment building. I believe that the point one parking ratio included in this tax amendment bundle would more than meet the need of the residents and the staff that work at affordable housing buildings.'",
        "'speaker_1': 'And I'm in favor of the tax code. I'm happy to elaborate. If you have any questions on the data. If you need a copy of the report, I can make it available for you. Thank you for your time and consideration.'",
        "'speaker_0': 'Thank you. Our last speaker this evening is Laura Rosberg.'",
        "'speaker_1': 'Hello. Thank you. Council President Gilmore. I'm Reverend Laura Rutherford. I'm a resident of Denver. I currently work at CHOP Works Architecture, but before that, I worked at the Delores Project, a homeless shelter and supportive housing development here in Denver.'",
        "'speaker_1': 'I just wanted to say, as somebody who's done a lot of work on this, I'm around if y'all have any questions. Last week I visited Sanderson Apartments, a supportive housing development, and I counted five cars out of the 30 spots that they had to build.'",
        "'speaker_1': 'And so I encourage you to vote yes. I thank you all for considering this. And I'm here if you have any questions. Thank you.'",
        "'speaker_0': 'All right. Very good. Thank you to all of our speakers for joining us this evening. And that concludes our speakers questions from members of Council on Council Bill 516 or the amendment. And I see we've got Councilmember Hines, you're up first.'",
        "'speaker_2': 'Thank you. Council President. I have a question about the affordable housing buildings. Do they ever move back to market rate once they've been constructed or are they forever affordable housing?'",
        "'speaker_0': 'Very good question. We've got our. Folks here tonight. And I believe we had Joel Jennings Golic or Kyle Dalton here to answer any questions.'",
        "'speaker_4': 'Councilwoman, we also have some folks.'",
        "'speaker_1': 'From coast here. Um.'",
        "'speaker_4': 'I believe I see Angie Nelson and Megan Yost here, so I.'",
        "'speaker_1': 'Think folks would be best to answer the question. On some members. This is Meghan Young. I can weigh in on this particular question. So when we contribute, get financing to a supportive housing project in particular, but affordable housing in general, the minimum length of affordability on a covenant that's reported is 60 years.'",
        "'speaker_1': 'Very often it is the case of some of these buildings to restrict them for 99 years. So for an extremely long period of time, we will be holding these affordability restrictions. And that on non intergovernmental agreement D3 projects where they are restricted in perpetuity.'",
        "'speaker_2': 'Got it. Okay. That's that's great news. I mean, I was trying to figure out why there might be parking requirements at all. And I was thinking perhaps they would go from affordable back to market rate and that would make the the.'",
        "'speaker_2': 'That the property more difficult to to to use if it has point one space. The only other question that I have is I did the city consider eliminating parking minimums entirely?'",
        "'speaker_4': 'I'm going to I'm going to say let me go on camera there. Generally, we were prepared to go take that leap yet. We have a separate project on expanding affordability in the city that's ongoing. This was in direct response to the data we had at that time, though, as you've heard in testimony, we have a number of'",
        "'speaker_4': 'tier cities that have taken this point further and either eliminated parking or of course, we have certain urban contexts in the city that do not have minimum parking requirements. So we've dabbled in that already in Denver for different reasons.'",
        "'speaker_4': 'But at this point, with the bundle trying to contain the bundle to sort of us a smaller spectrum of clarifications, updating where we had strong policy support and clear public policy support for changes. We felt this was grounded in those studies and was something we could bring forward.'",
        "'speaker_4': 'I don't know that we would have necessarily had the same backing for a bundle to bring forward a total elimination.'",
        "'speaker_2': 'Yeah. I think downtown core D.C. does not have any parking minimums. And as of July 19th, this body gets to decide if Golden Triangle abolishes its parking minimums.'",
        "'speaker_4': 'So we also have the 38th and Billy Blake Station area now at zero through an overlay. So there's a number of places.'",
        "'speaker_2': 'Yeah. At the point one seems to be really low and almost we're just almost there. So that's that's all I have. Thank you. Thank you for bringing this forward. And thank you, council president for all our thanks for all you do.'",
        "'speaker_2': 'Thank you. Council president.'",
        "'speaker_0': 'All right. Right on. Thank you, Councilmember Hines. Up next, we have Councilwoman Sawyer.'",
        "'speaker_1': 'Instead I'm president to find out what wanted to ask about some of the since your zoning administrator wanted to ask him about some of the expanded decision making power that's included in this text amendment. For those I mean, administrators, can you just kind of talk me through what is what's expanding here?'",
        "'speaker_4': 'There really is no expansion of the zoning administrator authority that's contained in this particular ordinance. There is another ordinance coming up on July 12th that does provide expanded authority for the zoning administrator on temporary uses. So I just want to make sure we're not confusing the two bills that are out there.'",
        "'speaker_4': 'Okay. So in the bundle.'",
        "'speaker_1': 'And again, I.'",
        "'speaker_4': 'Don't I if there was something specific you saw, I appreciate a heads up, but generally what you see in.'",
        "'speaker_1': 'Terms of.'",
        "'speaker_4': 'Zoning administrator authority in red lines in the funding amendment is authority that already exists, but it's now being clarified and codified on the face of the code. So the zoning administrator always had the final word on determinations and decisions of how the code applied to a specific property.'",
        "'speaker_4': 'You can see in the code that we've made it clear that when it comes to defining a zone lot, which is the development site for a particular project, the zoning administrator has the final word on determining that. And that's always been the practice.'",
        "'speaker_4': 'And if anyone has an issue with that, there is there's a variety of appeals that could be taken or a reconsideration. So that's now clearly on the face of the code, trying to think of the other ones in the bundle.'",
        "'speaker_4': 'There was a determination that was clarified. When somebody is doing repairs and maintenance on their structure, whether they've crossed a line into voluntary demolition, which would make that structure and any changes have to fully comply with the code, that's sort of where that line is.'",
        "'speaker_4': 'When you have a structure that doesn't fully meet the code, it sits in a setback, for example, when you're doing substantial work. At a certain point, we call that voluntary demolition, even though you're not bringing the whole house down and you have to fully comply.'",
        "'speaker_4': 'So it was in the bundle is some clarification on my ability to look at a case by case scenario of where someone says, I'm not voluntarily demolishing it, I'm just doing some basic repair of replace and it's not.'",
        "'speaker_4': 'So we just put it out there very clearly. The zoning administrator will have the final say and can take into consideration your arguments, but will determine with what side of the line it falls on. I'm trying to think of the other 170 changes where there might be some clarity over zoning administrator authority.'",
        "'speaker_4': 'I think I got a question sort of out of record here about whether there were some changes that shook City Council Authority and gave it to the zoning administrator in this bundle. And I can say now that is not the case in this ordinance.'",
        "'speaker_1': 'Tina, thank you. I don't mean to interrupt you, but I don't want you to have to go on and on about not go 372 pages. So that's great. I guess my question to that is, what is a what are the sort of appeal opportunities that a resident has if, you know, you as zoning administrator in your role'",
        "'speaker_1': 'makes a determination and it's something that they just agree with. There is always an.'",
        "'speaker_4': 'Avenue for appeal from a final zoning decision made by an administrative official. So that would be me and any of the staff doing plan, review and making decisions every day in applying this code. And that is called an administrative appeal.'",
        "'speaker_4': 'And the code clearly speaks to it in Article 12 and those appeals where you're essentially saying, no, you're wrong. And and I'd like somebody to decide whether you were right or wrong. Go to the Board of Adjustment. And that is distinct and very different from the variance case that also goes to the board.'",
        "'speaker_4': 'The criteria simply whether the board finds the administrative official aired in their application of the code to a particular in a particular decision.'",
        "'speaker_1': 'Okay. So the so is there no so there's no other criteria that they look at. The only decision is of the Board of Adjustments and an appeal is based on whether they believe you or not. You as zoning administrator, that your decision is on an administrator was incorrect.'",
        "'speaker_4': 'Correct. Using they step into my shoes essentially and and apply the code is and there's a presumption that the administrative official was correct in applying the code. And to overcome that presumption. And appellant needs to show by a preponderance of evidence that that.'",
        "'speaker_4': 'That that decision was deemed an error and that the code was misapplied.'",
        "'speaker_1': 'Okay. So how much would that cost someone who's a resident who disagrees with the zoning administrator's decision?'",
        "'speaker_4': 'I can't tell you exactly off the top of my head, because it's it's all governed by the Board of adjustment and they have their own fee schedule. I've got to get it somewhere in the hundred to 200 to 300 mark.'",
        "'speaker_4': 'Somewhere around there. I really don't know.'",
        "'speaker_1': 'I do. Most people do, you know. Most people do. They show up with an attorney that they also hirers. There are other areas. What does that look like?'",
        "'speaker_4': 'It varies. We've had all flavors of appellants show up with or without counsel. You know, we don't get that many in a year. It's less than a handful in any given year.'",
        "'speaker_1': 'Okay. And why do you know by any chance? And if you don't, this is it's totally fine. But I'm just curious how many decisions get overturned in that appeals process.'",
        "'speaker_4': 'In my own personal experience as zoning administrator over the last five years now. Yeah, five years. There's probably been a handful of appeals and I don't recall that any were where any of the staff or administrative decisions were overturned.'",
        "'speaker_4': 'And that's to the best of my recollection.'",
        "'speaker_1': 'Okay, great. Thank you so much. Really appreciate that information. Thanks, Madam President.'",
        "'speaker_0': 'Thank you. Councilman Sawyer, we have Councilman Flynn up.'",
        "'speaker_3': 'Thank you, Madam President. Tina or anyone else can answer this also. But with regard to affordable housing, our redefining that it looks like we're defining that in the draft here. As dwelling units are constructed under an affordable housing agreement to provide income restricted units under an agreement with the city, so that there's actually a a covenant of'",
        "'speaker_3': 'sorts that that guarantees are available, that these would be rented to people. I think if I read in the presentation correctly 60% and below or what was the other ones, 40% below, something like that. Is that the case?'",
        "'speaker_4': 'Well, actually, we don't have a definition of affordable housing in the zoning code and in those provisions, but we would expect evidence from the applicant of some variety and and most notably would be some kind of deed restricted or proposal for deed restricted units like the kind that Megan talked about.'",
        "'speaker_4': 'But I could imagine maybe there's other avenues by which you could build affordable housing that doesn't have city participation, for example, that would still qualify for the parking reduction. I got the cue from Annalise turning on her video to let her speak a little bit more to that point from a definitely a more educated perspective than I'",
        "'speaker_4': 'can provide. So anyways, talk from our planning services that.'",
        "'speaker_3': 'Might be helpful. I'm looking at the presentation here on my other screen and we're we're all zoned districts. The proposal is 60% of our mind blow would be just one parking space for every ten units is the way I'm reading that.'",
        "'speaker_3': 'So that's why I need to know what is the definition of affordable housing to which this would apply. The reason I'm asking, frankly, is that right across Sanderson Gulch from the Sanderson Apartments, there is a and a market rate apartment complex that nevertheless rents units for very affordable pricing.'",
        "'speaker_3': 'And I'm wondering if that were built today, if this would apply, because the fact is that there's 114 units in Orchard Glen and they are routinely so parked up that it spills out onto Mexico Avenue and has caused a significant parking problems on the street.'",
        "'speaker_3': 'And so they don't seem to have the same ratio of some of our actual income restricted projects like Sanderson, which is housing for the chronically homeless population which which doesn't have they don't have vehicles. Generally.'",
        "'speaker_1': 'I can't speak to the particulars of that case, but generally speaking, the definition or the applicability is within the table of the Parkin section. And so it is we would need proof that those units are being rented to folks earning less than 60% of the area median income.'",
        "'speaker_1': 'If we were not able to provide that proof, then they would not be eligible for that parking reduction there.'",
        "'speaker_3': 'So they would still if somebody were just going to build an apartment complex and they can't just come in and say this is going to be affordable housing, I want to just build one parking spot for every ten units that wouldn't fly.'",
        "'speaker_3': 'They would actually need to provide what it sounds like. They would actually have to enter into an affordable housing agreement with the city to restrict those units to 60% and below.'",
        "'speaker_1': 'I one piece to just clarifies that it might not necessarily be an affordable housing agreement with the city. There might be some other form of deed, restriction or covenants. There's plenty of affordable income, restricted units throughout the city where the city is not a partner in regulating that.'",
        "'speaker_1': 'But there's some other entities, but it's the one you have to say, I'm providing affordable housing and therefore I get this lower parking ratio does need to meet the affordability threshold.'",
        "'speaker_4': 'And this is different than what you know, what rents you choose to lease your older property for. Because I do with the household income of the renters, we need to know that it's the renters who qualify, not your rent.'",
        "'speaker_4': 'Right?'",
        "'speaker_3': 'Right. Okay.'",
        "'speaker_4': 'Megan, Megan's kind of popping her head up to I don't know if you had anything more to add, Megan, on what affordable housing evidence would look like.'",
        "'speaker_1': 'Yes. I just wanted to make a note that there are Section three properties that are that are not city funded. The Section eight properties that are not city funded but do carry deed restrictions associated with them. So I just wanted to say that the world of restrictions is not just city funded or city participating, but to the'",
        "'speaker_1': 'extent that the city is participating in those projects, there will be a covenant or deed restriction on those properties.'",
        "'speaker_3': 'Okay. So to qualify for this reduction, there would have to be some sort of enforceable mechanism, either an affordable housing agreement or some kind of deed restriction, something running with the land. And I just want to make sure that we're not opening up the door to somebody, just coming in, say, I'm building up.'",
        "'speaker_3': 'These are going to be affordable. I promise. You know, and then I have a situation like I have on Mexico Avenue.'",
        "'speaker_4': 'No, that's not what this is about. Okay.'",
        "'speaker_3': 'Thank you. That gives me a little more comfort. Appreciate.'",
        "'speaker_0': 'All right. Very good. Thank you, Councilmember Flynn. And not seeing any other hands raised for questions. The public hearing is closed. Comments by members of Council on the amendment. Council member Kimmich.'",
        "'speaker_1': 'Thank you. Council President I just wanted to thank all of our speakers who came to engage in those who gave comments through the process and also to the staff. I was considering whether I.'",
        "'speaker_4': 'Should file a.'",
        "'speaker_1': 'Bill like this for some pieces on the parking and affordable housing. I didn't know about all the issues with the 82 design, but I'm very pleased to see some of those because I know that the barriers for that product and for that approach are really mounting in some areas that really, like the West area with the West'",
        "'speaker_1': 'Renaissance Collaborative pilot, are really struggling to just kind of overcome the code issues. So thank you for a really common sense package of changes. I heard from one project so far that unfortunately did not receive tax credits in the last round, but folks are looking at that site for other things and may be able to do up'",
        "'speaker_1': 'to 20 additional units than they would have without these changes on parking. That is, you know, we don't have a lot of game changers in housing. It's just expensive and hard, it feels like. But anything that can change the game to the tune of 20 homes means a lot.'",
        "'speaker_1': 'And that may not be possible for every site. But I hope for those that it can that this will be, you know, changing the game and housing more people. So I'm really excited to support the package and hope my colleagues do the same.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Kimmich. And likewise, I want to thank the staff and our public speakers tonight and not seen any other hands raised for comments. Madam Secretary, roll call on the amendment, please.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Can I? Sawyer, I. Or else I. What? I. See the. I.'",
        "'speaker_3': 'For I. When I.'",
        "'speaker_1': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results, please.'",
        "'speaker_1': '11 nine.'",
        "'speaker_0': '11 ays Council Bill 20 1-0516 has been amended. Madam Secretary, Roll Call on Council Bill 21, Dash 0516 as amended.'",
        "'speaker_1': 'Black. I. Peter Barca. I can't. What?'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'When?'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Can I? Sawyer, I. All. I. Madam President.'"
    ],
    "A bill for an ordinance approving and accepting the park building plan for the Rosedale Maintenance Facility in Rosedale Park pursuant to the provisions of Sections 39-210 and 39-211 of the Denver Revised Municipal Code. Approves the park building plan for the Rosedale Maintenance Facility in Rosedale Park in Council District 6. The Committee approved filing this item at its meeting on 6-8-21.": [
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results. 11 911 I's Council Bill 20 1-0516 has passed as amended. Thank you, everybody, for joining us for that second public hearing. And now we're on to our third.'",
        "'speaker_0': 'Councilmember Hines, would you please put Council Bill 649 on the floor for final passage?'",
        "'speaker_2': 'EU Council President. I move that Council vote 20 10649 be placed upon final consideration and you pass back it.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The required public hearing for Council Bill 649 is open. May we please have the staff report? And I see we have Mike Pritchard here. Go ahead, please.'",
        "'speaker_3': 'Yes. Thank you very much. Thrilled to be here today. Sorry. This always happens to me. I'll just. Starting to scream screen. That's the problem.'",
        "'speaker_0': 'No worries.'",
        "'speaker_3': 'Yes, but my name is Michael Bouchard and I am with Denver Parks and Recreation, Planning, Design and Construction. And we are pleased to bring before you tonight the park building plan approval request for a new office building at the existing maintenance site in Rosedale Park.'",
        "'speaker_3': 'So just as a quick refresher, we are required for structures over 3000 square feet to bring a formal park building plan request before council, when we are proposing to do a new structure or a renovated structure for that matter.'",
        "'speaker_3': 'And so this one occurs at an existing maintenance facility that we have located in Rosedale Park, which is in District six of Denver. Actually a lot of luck. And for us as Denver Parks and Recreation, it's really an equity issue, making sure that our staff have adequate resources, adequate facilities, adequate restrooms, ADA accessibility, really wanting to provide'",
        "'speaker_3': 'to our maintenance staff the same level of resources and facilities that the staff at the Webb have and some of our other office sites around the city. So really an equity issue for us wanting to do right by our field staff so they can continue the great work that they do taking care of our parks.'",
        "'speaker_3': 'This is the existing maintenance site at Rosedale, located across the street from Rosedale Park proper. And as you can see, it did, but it's a community garden located just to the south of it. And then Rosedale Park proper to the south.'",
        "'speaker_3': 'And so it sits already in a pocket. It's set back from the street, away from any residential uses. And so our intent here is to enhance this site, provide the office space required, as well as some additional side improvements that you'll see here shortly.'",
        "'speaker_3': 'So Project Background is a new office building to support Parks Maintenance staff funded in part by 2017, Elevate Denver Bond as well as part of legacy finance. And there's much, much more information that we'd be happy to share.'",
        "'speaker_3': 'A link to our website. If you want more detail, you can see an elevation here. This is the view from the street. I would add one of the things that this project does is actually, we think helps to clean up visually the views into the maintenance sites.'",
        "'speaker_3': 'Maintenance sites are not necessarily the prettiest things to look at. There's frequently lots of vehicles, lots of materials, lots of stuff going on. One of the things that this project does is actually situates this new office building along the street frontage establishes that that elevation along the street, and it essentially screens a lot of that back of'",
        "'speaker_3': 'house use from people who are walking or just driving down Logan Street. The added benefit of this is that it also increases security. We have a lot of issues with security in our maintenance sites, lots of people breaking in because they can see right through the fence and say, hey, I want to go take that truck or'",
        "'speaker_3': 'that piece of machinery. So by establishing the street presence, we essentially screen a lot of that back of house and reduce the security issues we have and really just create a better scenario both for our elevated and staff and the operations there, but as well as park users and residents driving by.'",
        "'speaker_3': 'This is a view from inside. So part of the proposal is that we actually create a courtyard inside the facility and create some outdoor spaces for our staff to go out and have lunch. You can see some picnic tables here, some areas where they can just go out and frankly enjoy the parks that they spent so much'",
        "'speaker_3': 'time maintaining.'",
        "'speaker_0': 'Michael, I'm going to ask you to pause for a second. I think you're slides are off from what you're telling us. And so we're seeing an exterior view of the maintenance office, not the interior. Is that correct?'",
        "'speaker_3': 'You let me break. I'll come back to that. Thank you. This is an exterior view, but from the interior of the site. And the point here is just that, you know, yes, we're creating an office facility for our maintenance staff and a functional facility for operations.'",
        "'speaker_3': 'But we're also creating places for people. You know, these are these are these are human beings and making the place where they can go and eat lunch. So this picnic table here is is that kind of space. I'll talk a little bit more about the site layout in a minute.'",
        "'speaker_3': 'We have done some community outreach. We presented to the R.A. back in March. We've had extensive discussions with the adjacent community garden and are actually going to do some good neighbor improvements for them. Help keep.'",
        "'speaker_0': 'Mike. I think we lost your audio. Unless it's my connection. You might need to turn your camera off, Mike, so you get better bandwidth for your audio.'",
        "'speaker_2': 'I think he's gone.'",
        "'speaker_0': 'Yeah. All right. We'll go ahead and see if we have another. Parts rep that we can bring up into the presentation here. Hey, Steve, do you want to go ahead and take it over?'",
        "'speaker_6': 'I'm not as knowledgeable about the project. Mike is on.'",
        "'speaker_0': 'That Mike back. So, Mike, we're going to ask you to go ahead and not have your camera on so that we can give the full bandwidth to your audio.'",
        "'speaker_1': 'But you do have to unmute.'",
        "'speaker_3': 'One of those days. I'm just glad to be back. You can see the site plan here, as I mentioned, and the building sits along the street screens, views from the adjacent park and the roadway. It says water quality because of the new paving.'",
        "'speaker_3': 'We're actually renovating the existing historic structure back to its original use as vehicle storage and really just making a, you know, frankly, a 21st century maintenance facility for our staff out there. This is the approval timeline. We were at Luti on June 8th.'",
        "'speaker_3': 'First reading last. I'm sorry, Mary council the 15th first reading last week final reading a public hearing tonight and that closes the formal presentation from us. Happy to take questions. Answer anything that you guys might like to know about our proposal.'",
        "'speaker_0': 'All right. Great. Thank you so much for the staff report. And we'll go ahead and ask you to take down the screen sharing here. And council has not received any written testimony on Council Bill 649, and we do not have any individuals signed up to speak this evening.'",
        "'speaker_0': 'And so I would welcome any questions that we might have from members of Council on this one. All right. Not seen any questions by members of council. The public hearing is closed. Comments by members of Council on Council Bill 649.'",
        "'speaker_0': 'Council Member Hines Thank you.'",
        "'speaker_2': 'Council President We just in the last week had the opportunity to go by the maintenance building. I think I have to use air quotes around it at sinking gardens. And if this maintenance building is anything like that one, we need to we we need to we need to fund more maintenance on our maintenance buildings.'",
        "'speaker_2': 'That's all I was going to say. Thank you, council president.'",
        "'speaker_0': 'All right. Thank you, Councilmember Hines, and should have called on you first, Councilmember Cashman, since it's in your council district but didn't see your hand raised. So. Go ahead, sir.'",
        "'speaker_3': 'Yeah, that's just fine. Thank you. Council president. Yeah. I just want to thank the Parks Department for coming up with a unique design that preserves the views from Harvard Gulch Park to the East. It does a nice job of closing in the yard, as Mike said, but I especially appreciate the roof angles go a long way to'",
        "'speaker_3': 'preserving the sunlight in the community garden to the south, which is a beloved part of that community, as we all know, or our residents love the community gardens. And this design, I think, respects that historic presence. So I think it's a be a nice addition to Rosedale Park and I certainly look forward to approving this.'",
        "'speaker_0': 'Very good. Thank you, Councilman Cashman. And I'm not seeing any other hands raised. I'm happy to support this one this evening as well. Madam Secretary, roll call on Council Bill 649, please.'",
        "'speaker_3': 'Cashman by.'",
        "'speaker_1': 'Can each.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Sawyer. I. All right. I. Black. I. Peter Barca, I. But.'",
        "'speaker_3': 'I. When I.'",
        "'speaker_1': 'Granted.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Time I.'",
        "'speaker_1': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced the results. 11 911 I's Council Bill 20 1-0649 has passed our pre adjournment announcement on Monday, July 26. Council will hold a required public hearing on Council Bill 21, Dash 0526 changing the zoning classification for 4012404040 46 and 4058 North Fork Street in Globeville.'"
    ]
}