{
    "A resolution approving a proposed Eighth Amendatory Agreement by and between the City and County of Denver and CenturyLink Communications, LLC f/k/a Qwest Communications Company, LLC to increase maximum contract amount and extend the term to cover maintenance and technical support to the Citys 911 phone switches and supporting systems.\nAdds $500,000 and one year to a contract with CenturyLink, LLC for a new total of $3,471,588.50 through 12-31-18 for maintenance and repair of Denver 911 telephony systems at 303 West Colfax Avenue and 950 Josephine Street in Council Districts 9 and 10 (TECHS - CE76017).  The last regularly scheduled Council meeting within the 30-day review period is on 1-2-18.  The Committee approved filing this resolution by consent on 11-21-17.": [
        "'speaker_1': 'I'm sorry, Councilwoman Kinney each has called out for a vote Council Bill 1319 regarding the Affordable Housing Property Tax Revenue Fund. Under pending, no bills have been caught out that I get everything. I just want to make sure.'",
        "'speaker_1': 'Okay, great. Let's pull up 13, 13. And actually, Councilwoman Black, why don't you put 13 on floor 13, 13.'",
        "'speaker_5': 'Until I move that council bill?'",
        "'speaker_8': '1313 adopted.'",
        "'speaker_7': 'Resolution.'",
        "'speaker_1': 'All right. See it has been moved in second it. Go ahead, Councilman Fuller.'",
        "'speaker_7': 'Thank you, Mr. President. This is similar to last week when we killed a resolution for a contract that had the wrong amount in the contract document. It was correct in the description that we were given. But the dollar amount is is wrong in the contract.'",
        "'speaker_7': 'And I found this yesterday afternoon. I find it it's easier to read our contracts for Monday night than it is. It's less painful than watching the Broncos. So that's. That's how I spend my Sundays.'",
        "'speaker_1': 'Except that they want less. I heard yesterday. I heard. I just want to make sure.'",
        "'speaker_7': 'Probably because I wasn't watching keys. But this is this is a very important contract for the operation and maintenance of our 911 system with CenturyLink. And so I'm sure that the, the new version will be brought forward and you know, we can file that right away and get it done.'",
        "'speaker_7': 'But the difference was about $54,000. And but it needs to be correct. Otherwise the auditor would catch it and send it back to us. So I would I thank Councilwoman Black for putting this on the floor, and I ask that we vote no and the administration resubmitted.'",
        "'speaker_1': 'Okay. Um, any other questions? All right, Madam Secretary, it's been over the second it roll call.'",
        "'speaker_7': 'Flynn No.'",
        "'speaker_6': 'Gilmore no. Herndon, no. Cashman, no. Kenny Lopez No. New, no. Ortega No. Susman No. Black. Clarke. No. Espinosa.'",
        "'speaker_4': 'No.'",
        "'speaker_6': 'Mr. President?'",
        "'speaker_1': 'No. Police was voting and thus results 13 days. All right. 13 days. 13. 13 has failed. All right. Can you please put 1324 up, Madam Secretary and Councilman, who what would you like to do with 1324?'"
    ],
    "A bill for an ordinance authorizing a transfer of cash from the Excise Tax Base Account for an increase in appropriation to the 2017 General Fund Contingency and subsequent supplemental appropriations to the Affordable Housing Property Tax Revenue Fund and the City Attorney. Appropriates $9,451,397 to the 2017 General Fund Contingency due to excess revenue derived from the recent settlement surrounding hotel lodgers tax revenue; appropriates $4,058,171 to the Affordable Housing Property Tax Revenue Fund; and appropriates $5,393,226 to the City Attorneys Office for legal fees associated with the settlement.  The Committee approved filing this bill by consent on 11-21-17.": [
        "'speaker_1': 'All right. Thank you, Councilman Nu, if there are no objections for members of council. We'll go ahead with this one hour public hearing on Monday, December 18th. This is for Council Bill 1324 regarding minority and women business enterprises and small business enterprise legislation.'",
        "'speaker_1': 'So that is done. Thank you, Councilman. New Madam Secretary, can you please put up 1319 and Councilwoman Black, will you please put 1319 on the floor?'",
        "'speaker_5': 'I move that council bill 1319 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. It has been moved and seconded comments by members of council council and can each.'",
        "'speaker_5': 'Thank you, Mr. President. Council Bill 1319 is a bill that accepts funds from the Lodgers Tax and allocates a portion to the housing fund. It takes the right source and it dedicates a portion of it to the right overall use, which is affordable housing.'",
        "'speaker_5': 'The majority of these funds backfill linkage fee dollars, and the majority are going to expenditures that were already planned. However, a portion of these funds are not yet for planned or allocated uses over the course of the past several months.'",
        "'speaker_5': 'I have done my best to ask very specific questions about some of the ways that we are doing on allocated housing, funding, decisions and processes. And I have been unable to get answers to some of those questions in order to be consistent with the votes of conscience.'",
        "'speaker_5': 'I have taken the past several times. These things have come before me because these things are still unanswered. I can't vote for these funds tonight. I expect that the bill will probably pass anyway and I highly respect my colleagues.'",
        "'speaker_5': 'I don't take issue with your decision, but for me, when questions go unanswered, I can't then vote for the bill to move forward. So with that, I'll be voting no tonight. Thank you, Mr. President.'",
        "'speaker_1': 'All right. Thank you. Councilwoman, can each councilman take.'",
        "'speaker_8': 'Thank you, Mr. President. As you all know, we are waiting for a housing plan to come before us. And that plan is supposed to be a guide for how we spend our housing funds in this city. Not just the $15 million fund that was created a year and a half ago, but all of our housing funds.'",
        "'speaker_8': 'And I attended a housing advisory committee meeting last week where there was discussion about various aspects of the plan. And I became very concerned about the appearance that we are making decisions before the Housing Advisory Committee has even had an opportunity to adopt the plan to ensure that their voice, their input is very much a part of'",
        "'speaker_8': 'what that plan needs to contain to ensure that we are targeting those dollars where our greatest need exists. And you all probably read the article about a an expectation that there would be city dollars allocated to a community land trust.'",
        "'speaker_8': 'I commend our foundation community for wanting to do that and for stepping up to the plate. We have a community, the Globeville, Luria, Swansea community that's been working on a community land trust. And this presentation last week sort of presumed that the community efforts would be negated by a citywide effort.'",
        "'speaker_8': 'And in my experience, you know, over the last 30 plus years, I've been on council and have seen development opportunities happen, not just here in our city, but in other cities across the country. It's when you have community buy in and you've got a bottom up, as well as a top down commitment to funding to make things'",
        "'speaker_8': 'happen. And in this case, it didn't appear as though there was any commitment whatsoever to the community component of this land trust. And so I am sharing some of the same concerns that Councilwoman Kenney is sharing. She and I have been tracking and following what's happening with our housing programs.'",
        "'speaker_8': 'And I know when I had asked some questions early on about the $15 million that we had for 2017 and learned that it had all been allocated to various projects. Decisions are being made and, you know, the need exists.'",
        "'speaker_8': 'I don't question that we shouldn't be looking at where those needs are, but I don't know that any of that is taking into account the recommendations that are coming out of the draft plan for the housing fund, for the housing plan that ensures that we're prioritizing where those dollars need to be spent the greatest.'",
        "'speaker_8': 'So I'm not sure if I'm going to vote for this bill tonight, but I am expressing my concerns about how decisions are being made before we have clear guidance on where we're prioritizing those dollars. So I think it's critically important that we follow the lead of.'",
        "'speaker_8': 'For roots in our community. You have been doing housing in this city for years and years that have been sitting on this housing advisory committee and giving guidance and recommendation to the city. And so I'm just sharing the same frustration and concerns.'",
        "'speaker_1': 'Thank you. Yeah, thank you. Councilman Ortega. Councilman Espinosa.'",
        "'speaker_4': 'Yeah. Thank you, Councilwoman Kennedy, for calling this out for a separate vote, sort of people who can see the the why do you see me scrambling here and highlighting things? This was the bill that sort of got me going, not sitting in.'",
        "'speaker_4': 'Think of any more. I don't scrutinize these things in real time the way I was accustomed to. And so this one called out I mean, raised some alarm bells for me. So I'm glad you guys bought Councilwoman Commission.'",
        "'speaker_4': 'Ortega put some additional light on it. Because of that, I will be abstaining from this vote because I'm not comfortable on either side. It's not lost on me that on night where we're going to be approving, and rightly so, 1349, which puts $2.6 million into building 180 affordable units out in Stapleton, this is $4 million without without'",
        "'speaker_4': 'that specificity and specificity specifically to, you know, with no specificity in the plans to address some glaring affordable housing and gentrification pressures that we are putting by pumping hundreds of millions of dollars into Globeville or Swansea. I have been consistent in my message to the administration, to Eric at the the Director of Office of Hope that without'",
        "'speaker_4': 'specificity for that community, where we are making this much investment in everything but the people that are there and have to endure the pressures that come with this level of investment would be a failure of that plan. So with that, I won't vote no, but I will be abstaining from this vote.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'All right. Thank you. As well as Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. President. I have a great deal of sympathy with the arguments that council members can each and Ortega put forward, but I would still urge my colleagues to approve this appropriation. It is the money. The funds are unexpected funds that came from a settlement with the online booking agencies that were not collecting the full lodgers'",
        "'speaker_7': 'taxes on the on their on their online bookings. And so we have this sudden influx of money. And what this ordinance does essentially is it appropriates it into the housing fund and it doesn't speak to how eventually it might be spent.'",
        "'speaker_7': 'But I think it's still prudent to park the money there for the time being. My heart is with is with the arguments that the two council members on my on either side made. But I would still ask us to approve the appropriation pending other decisions as to how it's spent.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_4': 'Councilman Espinosa Yeah, I just want to say I agree wholeheartedly with that investment in affordable housing and putting that money towards this. But just because this money would go to the you know, otherwise, my understanding is this would go to the general fund, which we can appropriate at a later date.'",
        "'speaker_4': 'You know, once we have that plan in place with the specificity and actions that the community has been calling out for, this is sort of a just a a straightforward push back as far as I'm concerned with the the the the lack of specificity and solutions.'",
        "'speaker_4': 'And for me, in in the in the plan thus far. So with that, I think at some point, just like we can say no to correct errors, I think we need to learn to say no to specific requests without clear direction on how that's going to be utilized things.'",
        "'speaker_1': 'Okay. Thanks. You know, I'll be supporting this. You know, obviously we're no longer in an affordable housing need. We're in a desperate crisis, and we need to get funds any way that we can. However, Councilwoman Kenny Rogers has brought up some points, obviously, that need to be addressed.'",
        "'speaker_1': 'And I would just look to the administration to hear the concerns that are going on in city council to begin to meet with some of these council members to help us figure out how we can agree on some of the specificity needs to be happening around the use of these funds or else every bill that comes before'",
        "'speaker_1': 'us, this is what's going to happen. So I'll be supporting this, Madam Secretary. It's been moved. The second roll call can each.'",
        "'speaker_0': 'Lopez I.'",
        "'speaker_6': 'Knew.'",
        "'speaker_5': 'ORTEGA No.'",
        "'speaker_6': 'Sussman I black.'",
        "'speaker_5': 'Eye.'",
        "'speaker_6': 'Clark All right, Espinosa. Flynn.'",
        "'speaker_7': 'I.'",
        "'speaker_6': 'Gilmore i Herndon. I Cashman.'",
        "'speaker_9': 'Reluctantly, I Mr. President.'",
        "'speaker_1': 'I closed voting results tonight.'",
        "'speaker_6': 'Two nays. One abstention.'",
        "'speaker_1': 'Tonight, as soon as one abstention, 319 passes. All right. I believe these are all the items that need to be called out. All of the bills for introduction to Order publish. We're not ready for the block votes. A resolution that bills for final consideration.'",
        "'speaker_1': 'Council members remember that this is a consent or block vote and you will need to vote. Otherwise, this is your last chance to call on an item. On a separate vote, though, tonight, Councilwoman Black is making the motions.'",
        "'speaker_1': 'I'm going to ask Haslam and Gilmore to offer the block vote so that computer technology experts can continue to access the computer issues she is experiencing. Is that all right, Councilwoman Gilmore?'",
        "'speaker_5': 'Yes. President Brooks. Okay.'",
        "'speaker_1': 'And Councilman, we did just please put the resolution for adoption in the bills for final consideration, for final passage on the floor.'",
        "'speaker_5': 'Well, do I move that resolutions be adopted in bills and final consideration be placed upon final consideration and do pass in a block for the following items. 1355 1327 1336 1137 1329 1337 1338 1342 1354, 1184, 1278, 1330 1331, 1332, 1343, 1344, 1345, 1346, 1347, 1349, 1422, 1353, 1296, 1297, 1301, 13, 15, 13, 16, 13, 17 1318'",
        "'speaker_5': '1309, 13, ten, 13, 11, 13, 12. 1196 1211 1264.'",
        "'speaker_1': 'All right. I think she got it. Madam Secretary, do you concur? Yes. All right. It's been moved and seconded. Madam Secretary. Roco.'",
        "'speaker_6': 'Black eye. Clark Espinosa, Flynn, I. Gilmore, I. Herndon, I. Cashman can eat Lopez. All right, new Ortega I. Assessment I. Mr. President.'",
        "'speaker_1': 'I. Please salsa following announced results.'",
        "'speaker_6': '13 Eyes.'",
        "'speaker_1': '13 Eyes. The resolutions have been adopted and the bills have in place a full and final consideration and do pass. Tonight, there will be a required public hearing when Council Bill 1076 Changes on reclassification classification of 1400 1404 1408 West 37th Avenue and Highlands and require a public hearing on Constable 1143.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1400, 1404 and 1408 West 37th Avenue in Highland. Approves an official map amendment to rezone property located at 1400, 1404, and 1408 West 37th Avenue from TU-B2 DO-4 to U-MX-2x (urban, two-unit to urban neighborhood, mixed-use) in Council District 1.  The Committee approved filing this bill at its meeting on 10-31-17.": [
        "'speaker_1': 'Speakers must stay on the topic of the hearing and must direct their comments to council members. Please refrain from profane, profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_1': 'Councilwoman Black. Will you please put Council Council Bill 1076 on the floor?'",
        "'speaker_5': 'I move that council bill 1076 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. It has been moved in second in the public here for 1076 is now open. We have the staff report. You're not, Scott.'",
        "'speaker_11': 'I'm not. I am Sarah White with CPD. And I'm actually going to be filling in for Scott on this first hearing. So I'm going to do the best I can.'",
        "'speaker_1': 'All right. Thanks, Sarah.'",
        "'speaker_11': 'So tonight, the request is at 1400 1404 and 1408 West 37th Avenue to go from YouTube to with the DEO for overlay to um, x to x. We are in district one in the Highland neighborhood. We're generally at the southwest corner of 37th Avenue and Mariposa Street, near the Navajo Arts District, a block south of 38th Avenue'",
        "'speaker_11': '. The property is a little over 6000 square feet, currently has a collapsed building on it. That was formerly a restaurant use and the applicant is requesting rezoning to allow them to redevelop the site. So the current zoning is the urban two unit zoned district with the Geo four overlay and the requests to go to the urban mixed'",
        "'speaker_11': 'use to ex district. Like I said, the subject site is YouTube too with the video for overlay to the north, south and east are that matching YouTube to zoning and immediately to the west is the um x three with the you are one and you are two overlays that generally aligns with the Navajo Arts District.'",
        "'speaker_11': 'This site. This map currently shows the site as mixed use, but it is currently vacant after the building had collapsed. To the north is generally a mix of residential uses as well as to the south and the east and to the west.'",
        "'speaker_11': 'Along Navajo is a mix of residential and entertainment and cultural commercial uses. These are some pictures of the surrounding building form and scale. So you can get a sense of the type of residential that's in the area and as well the kind of character that exists on the Navajo Arts District, a block to the West.'",
        "'speaker_11': 'The process so far. Planning Board heard this item September 20th with a90 vote recommendation of approval where three people spoke in favor land use. Transportation Infrastructure Committee moved it forward on October 31st. Public Comment. So far, we did receive a letter of support from the Highland United Neighborhood Association and an additional 23 letters of support from the'",
        "'speaker_11': 'public on this matter. So moving into our five review criteria for rezoning. The first consistency with adopted plans will be reviewing comp plan 2000 Blueprint, Denver, the Highland Neighborhood Plan and the 41st and Fox stationary plan for consistency here.'",
        "'speaker_11': 'The request generally aligns with several strategies that are outlined in the comprehensive plan related to infill and environmental sustainability. And those are detailed further in your staff report. Blueprint. Denver designates this parcel as neighborhood center in an area of change.'",
        "'speaker_11': 'However, you can see that the mapping here from Blueprint Denver probably there was an error in mapping that we didn't catch so that that neighborhood center area of change probably should extend actually on either side of Navajo instead of the full block between Navajo and Mariposa.'",
        "'speaker_11': 'So the argument could be made that this site is actually supposed to be designated as single family duplex area of stability. Either way, though, the request is going to be consistent with the recommendations. So if we were evaluating it under the neighborhood center area of change that's requested to serve everyday shopping service entertainment needs of neighborhoods and'",
        "'speaker_11': 'allows a mix of uses which the are IMAX two X does do and then for single family duplex, the description calls for moderately dense areas that's primarily residential but with some complementary small scale commercial uses. And generally the you're max two X District is our least intensive mixed use district.'",
        "'speaker_11': 'The X on the end indicates that there are some additional use restrictions and the intent of this district is to be applied embedded in residential neighborhoods. Given that that sensitivity to the intensive uses. So either way, especially given that there was an existing commercial use on the parcel, the request would be consistent with Blueprint Denver.'",
        "'speaker_11': 'Additionally Blueprint. Denver has our street classifications. Both streets Mariposa and 37th Avenue are local streets, which is consistent with the intent of where you are. Max two X is to be applied. The Highland Neighborhood Plan, which is from 1986, has various strategies for the neighborhood.'",
        "'speaker_11': 'One is to promote infill development on vacant land or abandoned structures which this zone district would allow to happen. Encourage a mixture of residential types and costs. Promote development. Infill development should be compatible and character providing appropriate buffering below traffic generators so that you a mixed two district two x district generally will provide those character defining features'",
        "'speaker_11': '. And additionally, there is some language about the adjacent 13th Navajo and strategies to reinforce and strengthen the retail area and encourage new compatible uses. This is also part of Sub Area 13 in the Highland Area plan, which generally talks about improving, stabilizing the residential areas, encouraging the re-use of vacant or abandoned commercial structures which the rezoning is'",
        "'speaker_11': 'intending to do, and discourage further industrial and commercial encroachment. So once again, applying a mixed use district where we already have an established or previously established commercial use. So it is not a further encroachment of commercial. And then this site is outlined in red on your side.'",
        "'speaker_11': 'So it's at the very, very edge of the 44 x 41st and Fox station area plan. So this does call for single family or single family duplex. And again, for the reasons that it was consistent with the blueprint single family duplex recommendation.'",
        "'speaker_11': 'Given that the intent of this Mike's district is to be applied in these areas, would you find that the request is consistent with the 41st and Fox stationary plan? The second criteria uniformity of district regulations. The request would result in the uniform application of the annex to zone district.'",
        "'speaker_11': 'It would further the public health, safety and welfare one to the implementation of adopted plans and also would facilitate redevelopment of a abandoned and crumbling site. The identified justifying circumstance is changed or changing conditions. They've identified redevelopment in the Highland area and the Navajo Arts District and the collapse of the structure on the site all as the'",
        "'speaker_11': 'changed or changing conditions that would encourage redevelopment here. And the request is generally consistent with the, um x two zone district purpose and intent to promote embedded mixed use within neighborhoods. So given that the request complies with all five review criteria, staff does recommend approval.'",
        "'speaker_11': 'Thank you.'",
        "'speaker_1': 'All right. Thank you, sir. We have two speakers this evening called the first two speakers up to the front row, Paul, Stan and Chairman Sekou. Mr. Stan, your first.'",
        "'speaker_0': 'Thank you. My name is Paul Stan. I live at 1444 Massey Street in Denver, and I'm here to answer any questions council may have regarding the rezoning. I'm the applicant for the project.'",
        "'speaker_1': 'All right. Thank you. You can have a Caesar. The chairman say coup.'",
        "'speaker_10': 'Good evening. My name is Chairman Sekou. I represent the Black Star Action Movement for Self-defense Advocacy Group for poor, working, poor, homeless and senior citizens. We support this change in zoning for a couple of reasons and based on experiences recently.'",
        "'speaker_10': 'There is a component part that we may want to consider when we talk about this region rezoning changes and rebuilding neighborhoods and whatnot. And that becomes a question of public safety. And in that, as we go about developing these areas and people are more inclusive in these vacant areas, areas we need to talk about and think about'",
        "'speaker_10': 'how these plans are consistent with the manpower base for the police department to do a safe job and make sure these areas are secure. Because as more people come in to develop areas. Also you have the element of desperation of people who, quote unquote, in the category of criminals.'",
        "'speaker_10': 'They come in, do things that you normally wouldn't do when you have a building. Nobody there. So we need to think about that and make that a part of the zoning changes to make sure that we're able to, as we do this development stuff, is planned so that the things that people need to make this thing work'",
        "'speaker_10': 'are in place so that we don't develop areas that are unprotected. So that's one, too. We support this rezoning because what it represents for poor, working, poor and homeless people, it's an opportunity to go to work. And as we go about doing these things in a neighborhood plan.'",
        "'speaker_10': 'But the godmother suggested Debby Ortega We be consistent in making sure that this not only develops the area, but also the people in the area so that poor people can come up with a job with economic benefits so that they can afford the development and be a part of the development as a vibrant member of the community'",
        "'speaker_10': 'and then not left behind so that they're actually a part of how this thing works. So I see the time is running out. So I would be remiss if I didn't mention this in relationship to tying this together.'",
        "'speaker_10': 'So work with me. I got this. Thank you, all of you. Who participating in making that situation happen at the Dice Square situation. Outstanding job. Outstanding job. Those phone calls got the attention of Chief White and the commander there.'",
        "'speaker_10': 'And the person who was doing that stuff is gone because there was overwhelming force by the police department interviewing every person in that building and now is secure. We thank you very much for your participation. Outstanding. Outstanding. And this.'",
        "'speaker_10': 'You taught me this. I keep it out of the press.'",
        "'speaker_1': 'I gave it out to press. Could we got to stay on the hunt?'",
        "'speaker_10': 'Great job topic. Great job.'",
        "'speaker_0': 'You smile enough to work with me. Thank you, Mr. Cooper.'",
        "'speaker_1': 'Okay. We that ends our speakers for the evening for this public hearing. Are there any questions for members of council? Councilman Flynn.'",
        "'speaker_7': 'Thank you, Mr. Stan, the applicant. Just a quick question. You purchased this property earlier this year. And just if you could briefly describe what your intent is.'",
        "'speaker_0': 'Our intention is to finish removing the structure that's on the site and to create five townhomes.'",
        "'speaker_7': 'Hmm. Okay. Thank you. Mm hmm.'",
        "'speaker_1': 'Great.'",
        "'speaker_8': 'So townhomes can be either for sale or for rent. Can you just clarify if the expectation is for them to be for sale or for.'",
        "'speaker_0': 'Where they're going to be for sale? The price range is probably going to be in the 4 to $500000 range.'",
        "'speaker_8': 'Great. That's affordable for that neighborhood, which is ironic to say.'",
        "'speaker_0': 'Yeah, that's true.'",
        "'speaker_8': 'Thank you for.'",
        "'speaker_1': 'Okay. Oh. Councilman Espinosa. Yeah.'",
        "'speaker_4': 'Oh, I'm sorry. I wasn't going to ask any questions, but I. I feel like I probably should, just based on the two questions, ask you a few to sort of get some context for my colleagues. So you you actually purchase this from a developer that was proposing the different projects, is that correct?'",
        "'speaker_0': 'Yeah, I think he was proposing a high end restaurant, I think Parisian. And I think that the owners were from Aspen or something else.'",
        "'speaker_4': 'And then you actually heard some concerns from the community about that transition and ended up in a dialog with the neighborhood as well.'",
        "'speaker_0': 'Yeah, I could explain a little bit. We worked extensively with with the neighborhood groups, with the honey group for that negotiation happen over a ten month period of time. We had several meetings together, architect shared various plans, various concepts with them, and we finally arrived at a resolution that everybody was happy with.'",
        "'speaker_0': 'I think it will be memorialized in a member event. It is memorialized in a member memorandum of understanding. And once the Council bill is signed, we will deed restrict the property for 25 years based on our negotiations with the local neighborhood.'",
        "'speaker_4': 'So that was really I appreciate those answers to just provide my colleagues some context because all the some very hard work that you did and some and I appreciate you entering into that dialog and coming to that sort of conclusion is part of why, you know, you can stand here today with the support of honey in 23'",
        "'speaker_4': 'letters of support and not a single voice in opposition to the project. None of that would have been even known if we had just sort of followed our normal protocol. So thank you for answering those questions.'",
        "'speaker_0': 'Thank you for your kind words. We believe in working very close to the neighborhood and making sure it fits within the context of the neighborhood, and that we've listened to the concerns that everyone in the neighborhood. Great.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Okay. See no other speakers this. This concludes the public for 1076 is now closed. Now comments from members of council. Councilwoman Espinosa.'",
        "'speaker_4': 'So that was it. I'm glad I got to ask the questions of the applicant. I just want to reiterate that this is this was a very robust dialog that occurred over some period of time. And I just want to thank the developer for engaging in that conversation and and in getting to the terms that you entered with'",
        "'speaker_4': 'the community. I think that creates the win win that makes this application more appropriate and consistent with the adopted plans than the even the base zone district does. So thank you for that. And with that, I'll be voting in support of it.'",
        "'speaker_1': 'All right. All right. Thank you, Councilman Espinosa. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. This is in my neighborhood. It's just a few blocks away from where I live. And Honey is a very active neighborhood association. So if there was any contention, this room would be filled. So the fact that there aren't any residents here really is a testament to Mr. Stand's work in the community.'",
        "'speaker_8': 'And I just want to share with you all that Mr. Stan worked with Ray Super, who is one of our downtown developers that did one of our first housing projects that actually included affordable units. This was a for sale development at 15th and Blake before the inclusionary housing ordinance was adopted.'",
        "'speaker_8': 'And they, you know, just recognized the importance of just stepping to the plate and figuring out how to how to fold that in. And later, the inclusionary housing ordinance followed. And as you know, we had 10% at 80% of the Amari for anybody doing more than 30 units, which I'm sorry to say, no longer exists for new'",
        "'speaker_8': 'development in this city. I think it was one tool in our toolbox that would have been great to keep along with what we've recently adopted. But I just want to speak to the character of Mr. Stan in the work that he has continued to do in our community.'",
        "'speaker_8': 'So good job. Thanks.'",
        "'speaker_1': 'All right. Thank you, Councilwoman. I take it, Councilman Espinosa, you back?'",
        "'speaker_4': 'I just wanted to add one one bit of the. One bit of the ammo you mean the covenants that that I think matter the the covenant will mean the deed restrictions will require that the units face both Mariposa and 37.'",
        "'speaker_4': 'And those are sort of sort of logics that are consistent with where we're heading with on the side home task force. So the neighborhood and the developer came to an agreement that actually sort of starts to address many of the concerns that we get in other more use by right situations.'",
        "'speaker_4': 'So thank you again for for that.'",
        "'speaker_1': 'All right. Excellent. It has been moved in second. There's no speakers. Madam Secretary Roca.'",
        "'speaker_6': 'Espinosa. I. Flynn. II. Gilmore. Herndon. Cashman. Canete. Lopez. New Ortega by Sussman assessment black Clark. All right. Mr. President.'",
        "'speaker_1': 'I. Police was worrying us results.'",
        "'speaker_6': 'Sorry.'",
        "'speaker_5': 'There's one missing.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2812, 2814, 2816, 2821, 2828, 2830, 2836, 2840 and 2842 West 25th Avenue in Jefferson Park. Approves an official map amendment to rezone property located at 2812, 2814, 2816, 2821, 2828, 2830, 2836, 2840 and 2842 West 25th Avenue from G-MU-3 UO-3 to G-MS-3 (general urban, multi-unit to general urban, main street) with waivers in Council District 1.  The Committee approved filing this bill at its meeting on 10-31-17.": [
        "'speaker_1': 'This should be just 112 voice. All right, 12 eyes can spell. 1076 has passed. Congratulations. All right, on to the last public hearing of the evening. Councilman Black, will you please put Council Bill 1143 on the floor?'",
        "'speaker_5': 'Yes, I move that council bill 1143 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved. Looking for a second. Great. It's been moved and seconded. Public hearing for council and for three is open. We have the staff report. Sarah FuckUp.'",
        "'speaker_11': 'So tonight I am here to present 28, 12, 28, 14, 2016, 28, 21, 28, 28, 28, 30, 28, 36, 28, 40 and 28, 42 West 25th Avenue. The proposal is to reason from GMU three, Euro three to James three with waivers.'",
        "'speaker_11': 'This application is sponsored by Councilman Espinosa. Again. We are in District one, this time in the Jefferson Park neighborhood. You can see the map here. We are just east of the 25th and intersection and commercial node and we're about two blocks east of federal.'",
        "'speaker_11': 'And just some context here on the north side of the block, immediately to the west of that one parcel was a recent rezoning, which was very similar. And we'll see that on the zoning map as well. So the property in total is a little over 30,000 square feet, has single family and duplex structures and associated accessory structures'",
        "'speaker_11': ', and the request is to rezone to allow neighborhood mixed use. So again, rezoning from GMU through with you three overlay, two gyms, three with waivers. A reminder that the Gems three zone district is the general urban context Main Street with a three storey maximum height, and there are several waivers that are part of this request.'",
        "'speaker_11': 'So one, the request is to wave out the drive thru forms which generally would be allowed in the GMC Zone districts and also to waive in the urban house and duplex forms with the appropriate residential use restrictions. And the reasoning for this being some of the street level active use waivers are waiving out residential we'll still talk'",
        "'speaker_11': 'about in a second. And waiving in the urban house and duplex forms would mean that the existing houses and duplex would not become non-conforming. So that's the purpose for waiving in those use forms. So the rest of the waivers are all applicable to the street level active use requirement.'",
        "'speaker_11': 'So this is generally the front of the building for 75% of the width of the lot and then for a minimum depth of 15 feet. So these following waivers are only going to apply to that 75% of the width, 15 foot depth.'",
        "'speaker_11': 'So to waive out certain incompatible primary uses from our street level active use requirements. So right now, those are those are pretty broad. All that you can't do is a carwash parking and mini storage. So the request is to waive out residential and then some other kind of higher intensity uses like utilities, automobile services and others, and'",
        "'speaker_11': 'also waiving out some incompatible accessory uses. So the zoning in the area, the subject site and surrounding to the northeast and south is all GMU you three and directly to the west along the the whole kind of grouping is G three and again those two properties immediately to the west on the north side were recently rezoned from'",
        "'speaker_11': 'GMU three to GM's three. Earlier this year. So the site is currently a mix of single family and two family residential generally, as is with Jefferson Park, the surrounding is a mix of single family two unit low skill multifamily, and then to the west is the commercial node at 25th and Elliott.'",
        "'speaker_11': 'So you can see here the top picture is an example of one of the houses on the subject property. The bottom picture is an example of the character that you see at 25th and Elliott. The top picture is an example of some of the multi-family that is being built in the neighborhood.'",
        "'speaker_11': 'That example is further north on 26th. And again, another example, excuse me, of the 25th and Elliott commercial note. So the process so far, planning board heard this matter on October 4th and voted unanimously, unanimously to recommend approval.'",
        "'speaker_11': 'We also had several speakers in favor. The committee moved this forward on October 31st. All of the appropriate notification has been done and a letter of support from the Jefferson Park United Neighbors. R.A. was submitted with the application.'",
        "'speaker_11': 'And then onto our five review criteria. So we have three plans to consider consistency with your comprehensive plan 2000 Blueprint Denver and the Jefferson Park Neighborhood Plan. The request is consistent with several strategies and comp plan related to quality infill development.'",
        "'speaker_11': 'Focal points in neighborhoods promoting mixed use development. Blueprint. Denver calls this out as a single family residential area of stability. But we are proximate to the neighborhood center that is surrounding Elliot and 25th. Additionally, Blueprint Denver has language in it that says the boundaries of our land use.'",
        "'speaker_11': 'Building blocks are not fixed and some areas are in a strict state of transition. So in areas where you're on a border, there may be some wiggle room. And in this case, we do find it appropriate to evaluate the request under the neighborhood center area of change recommendation.'",
        "'speaker_11': 'For our waivers that are requested here. You may be familiar with CPD's waiver policy of only supporting waivers of conditions when they are a bridge to a future text amendment. And that policy comes out of this language from Blueprint Denver, which was before our current code and had kind of called for the abolishment of waivers and conditions'",
        "'speaker_11': 'in general, or to gradually reduce how much we use them. So that policy came out of Blueprint Denver here. And usually when we have waivers and waivers that CPD is supporting, again, it's a bridge to a future text moment and we like to get as close to the future solution as possible.'",
        "'speaker_11': 'And a reminder, when we say bridge to future text amendment, it means that we have acknowledged that there's a problem. There will be a text amendment in the future to solve that problem. But in the meantime, before we get to that, we can add waivers or conditions to rezoning to kind of take care of that in the'",
        "'speaker_11': 'meantime. And so what we're talking about here is kind of it's a conversation that's happening in the city at a lot of different levels and that's related to street level, active uses and mixed use buildings. Currently, even in our mixed use zone districts where we have street level active uses, you can have a 100% residential building and'",
        "'speaker_11': 'the thought is that maybe there is a need to have some sort of zoned district or overlay or something to account for these neighborhood skilled areas that probably were the planned direction calls for mixed use. And we want to have a way to at least require some of that ground floor residential to provide that character that the'",
        "'speaker_11': 'plans are calling for. Now, this case is a little unique because we know it's a really big question. It's a city wide question, and it's not ideal to evaluate these waivers on a case by case basis, because we know it affects different areas in the city differently.'",
        "'speaker_11': 'But in this case, the we've figure that the waivers do a good job to tackle the issue now and knowing that this will be a much larger conversation as we move forward with NPI, with Blueprint Denver and the kind of policies that might come out of those planning process to help us guide how we might solve this'",
        "'speaker_11': 'problem in the future. So at this time, we do think that the waivers proposed are appropriate to address this issue and it is consistent with the blueprint. Denver Plain Language regarding waivers and conditions. Looking to the Jefferson Park neighborhood plan.'",
        "'speaker_11': 'The plan has some overall framework, goals and recommendations about maintaining enhancing the character of Jefferson Park, creating focal points within the neighborhood, calling out West 25th and Elliott as a focal point and also calling out West 25th Avenue, generally as a principal neighborhood corridor.'",
        "'speaker_11': 'So acknowledging that properties along 25th are special, they should maybe should have a different character. And then we do have sub areas in the Jefferson Park plan. Again, we have language here that specifically says that boundaries between the sub areas are not absolute and that characteristics overlap subquery boundaries.'",
        "'speaker_11': 'So we do have the properties on the boundary between the 25th and Elliott Sub area and the core residential sub areas. And given this language and the support that we've received from the neighborhood, we do find it appropriate to evaluate the request under the 25th and Elliott Sub Area recommendations.'",
        "'speaker_11': 'Which include recommendations that neighborhood commercial Siberia should include older buildings that will be carefully restored and vacant lots developed in a manner that reinforces the historic character of the neighborhood commercial district. Strengthen the neighborhood retail center to support the neighborhood, encourage new construction to be mixed use with residential and retail.'",
        "'speaker_11': 'So again, we have plain language here specifically calling for mixed use and that new buildings in this area should be compatible in scale and character with the existing buildings. So the proposed GM's three zone district does have transparency build to requirements that do help to maintain the character of the existing 25th Elliot commercial node and again, the'",
        "'speaker_11': 'three storey height limit. So given all of that, we do find that the request is consistent with adopted plans. It will result in the uniform application of the GMC three zone district with the exception of the proposed waivers.'",
        "'speaker_11': 'But given that the waivers are consistent with CPD's waivers policy, we do find it meets this criteria. It furthers the public health, safety and welfare by allowing additional mixed use development that is pedestrian in nature. Encourage people in the neighborhood to have more neighborhoods serving retail.'",
        "'speaker_11': 'So we do find that it is consistent with the furthering public health, safety and welfare criteria. The identified justifying circumstances is that the land or its surrounding environs has changed or is changing to such a degree that redevelopment should be encouraged.'",
        "'speaker_11': 'We know that there's been a significant amount of redevelopment in Jefferson Park and a lot of new residential units. And so that means there are more residents, which means that there is a strain on the existing neighborhood serving commercial.'",
        "'speaker_11': 'So allowing some more area to redevelop into neighborhoods serving commercial would be in the benefit of the neighborhood. So we do find that this criteria has been met. And the request would be consistent with the purpose and intent of the GMES three zone district.'",
        "'speaker_11': 'So given that we find all five criteria have been met, would you recommend approval of the proposal?'",
        "'speaker_1': 'All right. Thank you, Sarah. We have five speakers this evening. I'm going to ask all the speakers to come on that front row there. Justin Potter, Jay Edwards, chairman, say COO. I'm sorry all of you guys still come up, but unless Nathan Johnson, you're first.'",
        "'speaker_1': 'Actually, Mr. Johnson and then Sean Booker is last. All right, Mr. Johnson, Nathan Johnson's first.'",
        "'speaker_9': 'Thank you. I am the owner of the piece of property. That's the slice of land on the north side of West 25th Avenue. I'm in support of the new zoning. For the simple reason that the balance of the block is basically being transformed in this process.'",
        "'speaker_9': 'And I'm also in support of the concept of live, work and play. We are looking for environments where we can combine those uses, have a holistic neighborhood that allows for both residential uses, commercial uses and recreational or retail type uses.'",
        "'speaker_9': 'And I think the zoning will provide that enhancement to the neighborhood. Thank you.'",
        "'speaker_1': 'All right. Thank you, Mr. Johnson. Justin Potter.'",
        "'speaker_4': 'I thank you for taking this under consideration. I'm speaking on behalf of Jefferson Park, United Neighbors, the R.A. for the neighborhood. We started this process probably about a year ago. The developers came to us and expressed interest of potential rezoning going to commercial.'",
        "'speaker_4': 'Similarly to what happened on the north side and the neighborhood at the time was open to it. We definitely feel that there's a need for expand and commercial in the neighborhood. And we've we're seeing a lot of the slot homes go in.'",
        "'speaker_4': 'And we kind of felt that we would rather work with a developer to get something that we wanted instead of having additional slot homes built that could have been built there. As I mentioned, we we worked on this for about a year.'",
        "'speaker_4': 'We've had multiple meetings in the community outreach, the newsletter and whatever else, and solicited a lot of feedback from from the neighbors and ultimately decided to take a vote to have Councilman Espinosa file for the his own request on our behalf.'",
        "'speaker_1': 'So thank you, Mr. Potter. Jay Edwards.'",
        "'speaker_7': 'Thank you, counsel. My name is Jay Edwards with Dublin Development. We have contracted an assemblage within the proposed new block here. And originally, you know, at the JMU three zoning, we were planning on 12 to 14 townhomes and then the discussions with the neighborhood.'",
        "'speaker_7': 'We've been very active in Jefferson Park. We've office in Jefferson Park and love the neighborhood and talking with John and other members of the neighborhood. We all felt it would be better to go with a mixed use type project where we can bring more affordable, more attainable condos.'",
        "'speaker_7': 'So we're looking at, you know, right now 28 to 30 condos with approximately 5000 square feet of retail on the ground floor to bring, you know, strengthen the retail presence in the neighborhood. Obviously, with the added density in the last few years in Jefferson Park, there's not enough retail to support the neighborhood.'",
        "'speaker_7': 'So we're in support of the zoning change. Thank you.'",
        "'speaker_1': 'All right. Thank you, Mr. Edwards. All right, Chairman Sekou. But to say chairman looks different.'",
        "'speaker_10': 'Okay. Terrorist who likes our action movement. Self-defense. Poor, working, poor, homeless people starting to talk like Kelly. We support this for same reason as we support the last one key component include the police in this in terms of manpower.'",
        "'speaker_10': 'What they're going to do is security's there. This one's bigger than the last one. And this, this. What she was talking about with all these layers of stuff that folks got to do in order to get this thing done.'",
        "'speaker_10': 'That last person I just talked to my son before he could put a shovel in the ground. This thing started in February and it took him $25,000 before he even got started. Hear me now in terms of development, that's crazy.'",
        "'speaker_10': 'All right. When it takes 5 minutes to approve this stuff. A rezoning thing. $25,000. Eight months later. Are you kidding me? Now, of course, I'm not a very patient guy. I'm a revolutionary. I believe in this. Doing things immediately.'",
        "'speaker_10': 'Get it done, be finished with it, and be efficient. And do the things we need to do to protect the community interests. So we have to learn and find some process. Think outside the box, because I don't know how long it took you to get this.'",
        "'speaker_10': 'You said you start a year. I don't know how much money is spent do this, but it's going to take five, 10 minutes to prove this. That's crazy. They don't make the system. All right. So somewhere along the line, we've got to tweak this process, all right.'",
        "'speaker_10': 'To make it more effective and cost less so that even a small developer can get involved in this kind of process. A mom and pops kind of develop, you know what I'm talking about doing. You know what I'm saying on the construction thing.'",
        "'speaker_10': 'So I understand Paul and folks of his doing the social development and then the combination with the commercial economic development and we combine the two into socio economic development, then we make this thing work in a better way so that we can move this thing on down the road and have a community that's moving effectively so that'",
        "'speaker_10': 'we can provide the housing that's necessary not only for the middle class, but also for poor, working poor people, because we need a hurry up kind of process to tell for our needs because we are under bridges. We in cardboard boxes.'",
        "'speaker_10': 'So if you can't do this for middle class people, you know it's going to take us forever. So this top down thing, bottom up thing, trickle down whoop to do what they know. That's got to stop. That's got to stop because it's not working for the people.'",
        "'speaker_10': 'And that means everybody, regardless of what station you in, with you on the top to bottom. Low to middle. Cut the red tape. Cut the layers. Not deregulate, but cut the unnecessary stuff that she's talking about. Because this is crazy.'",
        "'speaker_10': 'I mean, for real. Well, maybe not. Maybe I'm just crazy. That's all I got.'",
        "'speaker_1': 'Thank you, Miss. Miss Siku. All right, Shun. Book. Book out. Did I say that right?'",
        "'speaker_4': 'Yes, sir. All right. I don't know how.'",
        "'speaker_0': 'I follow that, Mr. Sekou. Thank you, counsel. Thank you for. Let me speak. My name is Shawn.'",
        "'speaker_4': 'Book out on the co-owner of Double in Development with Jay Edwards.'",
        "'speaker_0': 'We're here in support.'",
        "'speaker_4': 'Of the reason we're very active in Jumpstart. We've built 36 townhomes.'",
        "'speaker_0': 'We have a condo project at Pershing right now, and we'd like to.'",
        "'speaker_4': 'Do this project as well. It's going to bring smaller, more affordable units in Jefferson Park, as well as retail, which is which is much needed. So thank you.'",
        "'speaker_1': 'Thank you, Mr. Berger. All right. This concludes our speakers questions by members of council. Councilman Flynn.'",
        "'speaker_7': 'Thank you, sir. Sir, could you talk me through again when Blueprint says that we ought to eliminate waivers and conditions? What are the criteria under which CPD would nevertheless find this in conformance with something that seems to be directly opposed to using waivers and conditions?'",
        "'speaker_7': 'And how do you evaluate that against any other situation?'",
        "'speaker_11': 'So we get requests from from you guys, from the public, from our internal departments for things that did to amend the zoning code, as you all know. And when we get a request, we we talk about it internally.'",
        "'speaker_11': 'We talk through it with the requesting party to understand it. And then as long as everyone agrees that it's a worthwhile endeavor in the future, it gets put on our list of future text amendments. That is a long list.'",
        "'speaker_11': 'And so we have we're always constantly trying to evaluate our work program to decide how to tackle those. And it is because of that long list that that we get to this recommendation on waivers. So even though Blueprint said eliminate them, we know realistically right now that that probably isn't isn't going to happen.'",
        "'speaker_11': 'But we do have this policy to to have a better, more strategic way to approach them, because in the past, when we've done waivers and conditions, they're they're very, very specific. They they vary widely across the city. They're very difficult and time consuming for our development services to administer, especially over time as things change.'",
        "'speaker_11': 'Then you have more rezonings just to get out of very restrictive waivers that were maybe applicable 20 years ago but aren't now. So it's kind of this whole world. And with this one, like I said, it's a little tougher to evaluate the specifics of this waiver because we know it's a really big question, but it's a question'",
        "'speaker_11': 'that keeps coming up again and again. It keeps coming up in 30th. And Blake, it comes up in Berkeley, it comes up in Jefferson Park, all in slightly different context, with slightly different requests. But we know it's going to be something that we're going to have to address.'",
        "'speaker_11': 'And like I said, we don't know how that may be. We don't know if it maybe new zone districts overlays, combination amending or current zone districts. So all of that is TBD. And so the waivers that are proposed by Councilman Espinosa, we think, are a really rational way to approach it right now for a site specific neighborhood'",
        "'speaker_11': 'serving retail. Mm hmm. Does that answer your question?'",
        "'speaker_7': 'Yeah, it does. And I'm very happy to hear that, because, frankly, I, I, I favor more use of waivers and conditions. I know it makes more work. It's harder to enforce, but. But that's your job. And a city is a messy place.'",
        "'speaker_7': 'A city is a place that needs flexibility. And and sometimes I cringe at the need for uniformity when specificity and flexibility and site specific conditions are are required. So I'm very happy to hear that explanation. Thank you.'",
        "'speaker_1': 'All right. Thank you. Councilman Flint, councilman as well. You have a question on your own, Bill?'",
        "'speaker_4': 'Not really. I should I was just going to offer myself I should probably gone out there and just signed up to offer myself up to answer any questions because I did author of the waivers that you're considering today.'",
        "'speaker_1': 'Great. Thank you. Thanks for that clarification. All right. Seeing no other speakers, the public hearing for Council Bill 1143 is now closed and now we'll open up with that comes from the council sponsor himself, Councilman Espinosa.'",
        "'speaker_4': 'I don't know where to start. It was it was a long process. It started with three properties. It's now seven properties and completes the totality of of of properties between our central business district at 25th and Eliot and the remaining properties on the blocks that haven't been developed.'",
        "'speaker_4': 'This is an area that has undergone radical sort of deviation from the plan recommendation. And, you know, in Sarah's presentation she had a mapped so sub area that was white that was supposed to be single unit to unit scale development.'",
        "'speaker_4': 'And that's where you see the lion's share of slot home flavors that we're coming up with in Denver. And so when you're faced with that, which is more of the same, which is getting a wholesale different I mean, getting an address citywide through the slot home task force because the nature of the outcomes that you're getting, you'",
        "'speaker_4': 'know, is there a way to, you know, the community basically asked, is there any way to to to to get an improved outcome? And this is a situation where, fortunately, the developer and the community and the business district basically put their heads together, having seen what was previously zoned across the street and said, that's something we can'",
        "'speaker_4': 'we can adapt to. And getting getting all those people and the additional property owners sort of to the same place took some heavy lifting. But I think everybody that was involved to the patients, the conversations you had, the patients you had and sort of the the community sort of emphasis and, you know, pushing me in the direction'",
        "'speaker_4': 'with you. And so my hope is that, you know, you know but and that I should acknowledge Sarah was was this is this is this was tough sledding. You know, she talked about the whole landscape of the nature of these sorts of the nature of this sort of these sort of waivers that we're putting on the the'",
        "'speaker_4': '. For active use requirements. You know, that was you know, that was not you know, I went in there just like any other developer making this request and trying to to to make make it very clear how consistent this was in all the parameters that they that were required to, to, to consider.'",
        "'speaker_4': 'And I think that she she did a very, very professional job when maybe I wasn't the most professional individual in in maintaining the city's position. And because of that, the waivers that that that we finally authored and put I finally authored and put forward, I was really pleasantly surprised at how well-received that was by the planning board'",
        "'speaker_4': 'and the comments that were made there. You know, that sort of made it very clear the need for the city to to carry on that conversation about appropriate uses and appropriate restrictions and limitations on ground floor. So yeah, so long, long story short, I'll wrap it up.'",
        "'speaker_4': 'The real impetus for these waivers was when the prior rezoning across the street occurred that one had an M.O. you in covenant, much like the prior rezoning tonight, which put these similar limitations on on redevelopment of those properties.'",
        "'speaker_4': 'And it put it gets you in a weird gray area, which is if the community is is in support of the recognizing the change of conditions in the development pressures that exist, and they're trying to get different outcomes in their central business district through a zoning change.'",
        "'speaker_4': 'But the zoning change actually allows the exact same form that they're trying to, to, to, to address the only way to, to, to reconcile the two, which is that the change is appropriate because it can capture these other things.'",
        "'speaker_4': 'But the change also allows the one thing that they're trying to avoid is to actually put constraints. And I don't think it's appropriate necessarily in that situation to put it on a developer agreement, especially when we're talking about a significant area.'",
        "'speaker_4': 'And waivers were in fact the right way to address the growth and redevelopment of that area. To that point, though, I did share with my colleagues a couple of images and and one of them is a slot home in Jay.'",
        "'speaker_4': 'It is one of your projects. So I'm not a I'm only sharing it with you because it's a recent slide home. But it is my concern. It touches on it's the the one on Eliot Street. And. And then a project at the corner of 44th and Tennyson, which is a is a mixed use zone district.'",
        "'speaker_4': 'I don't know if it's Main Street or not, is it? The good news about the one at 44th and Tennyson is that you're not allowed to do that kind of development. That ground floor activation rules have changed substantially, and now this one goes one step further.'",
        "'speaker_4': 'So my point is, is that throughout this conversation with the community, is that they or they have high expectations that that the nature of your development, your redevelopment of this area not only has the sort of mixed use components and the in the affordability that you're trying, you know, the units that you're the project that you're you're'",
        "'speaker_4': 'proposing in, you're working on the architecturally that it resonates with the human scale. And these are things that zoning can't, can't do, but it is sort of beholden to mean it is your responsibility as developer and architect and your team.'",
        "'speaker_4': 'And so it's fine to do projects that that net profit. But please, this neighborhood has been good. Very good for your bottom line. Maybe this project has been a little bit challenging in that regard. But but you know, my to the degree that you can please continue to have that dialog that you've already had with the neighborhood'",
        "'speaker_4': 'on the design side and voluntarily commit yourself to sort of getting the best sort of outcome that you can physically. And and it's not just to you, it will apply to anybody that develops in that area as well if it goes through.'",
        "'speaker_4': 'But so my comments my my the whole point of my commentary, though, is that this was this was wrought by the community. I'm happy to be in a position to have used my prior background as an architect to sort of articulate how we might shape that and bring it forward, because this is a community derived solution where'",
        "'speaker_4': 'it's a win win win between developer bid and neighborhood. And once again, just like the prior rezoning, the reason we're not here with sort of massive opposition at the scale of this re rezoning and they noting the close proximity to even single family residential is because everyone's rowing in the same direction and let's just keep up that'",
        "'speaker_4': 'momentum. With that, I'm going to support this rezoning because I have faith in everybody involved. Thanks.'",
        "'speaker_1': 'All right. Thank you, Councilman. And, you know, I just want to just let the public know we do have legislative rezonings where council members will support a rezoning for the larger community that is a not a quasi judicial matter.'",
        "'speaker_1': 'So a councilmember supporting the rezoning can actually vote on it and obviously comment it. We've received a couple of comments about that. So I just wanted to let folks know that. All right. So see, no other comments has been moved and seconded.'",
        "'speaker_1': 'Madam Secretary, roll call.'",
        "'speaker_6': 'Espinosa. I Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_6': 'Gilmore, i. Herndon, Cashman.'",
        "'speaker_5': 'I can eat new Ortega.'",
        "'speaker_6': 'Sussman Clark. Clark All right, Mr. President.'",
        "'speaker_1': 'I please cause very nice results.'",
        "'speaker_5': 'I see. Sorry.'",
        "'speaker_6': 'There's a.'",
        "'speaker_5': 'Couple.'",
        "'speaker_1': 'One missing, one hanging fire. Oh, we got it. 12. There it is. 12 eyes. Council Bill 1143 has passed. Congratulations, everyone. Thanks for the hard work and seeing no other business before this incredible body that we have here extended your.'"
    ]
}