{
    "Colorado Lottery presents Denver Parks and Recreation the 2016 Starburst Award for Vanderbilt and Johnson-Habitat Parks.": [
        "'speaker_1': 'Partner in making this all happen. Thank you, Mr. President. Members of council. Mr. President, a quick aside, it's great to see you behind the wheel. You were missed and I'm happy for you. And I'm happy for your family.'",
        "'speaker_1': 'And by the way, Councilman Clark, you would never say this, but it was your vision back in 2009 that started this whole thing. And you used the phrase for the first time nature in your own backyard. And that's where this all comes from.'",
        "'speaker_3': 'So members of council understand, you know, where the genesis of.'",
        "'speaker_1': 'This park is. Projects like this happen because of relationships and because of partnerships and because people take the words me.'",
        "'speaker_7': 'And myself.'",
        "'speaker_1': 'And I, and they replace them with we and us. And let me name.'",
        "'speaker_6': 'Real quickly the names, because I will get the hook here in about 30 seconds. Colorado Lottery, Great Outdoors. Colorado City and County of Denver EPA.'",
        "'speaker_1': 'Denver Trout Unlimited Urban Drainage in Flood Control District.'",
        "'speaker_6': 'Gates Family Foundation, Johnson Family Foundation and Quick Family Foundation.'",
        "'speaker_1': 'That's how these things happen, Councilman Clark. And these are real numbers. We're actually up to $35 million of projects on the river right now. Nine project sites either built, being.'",
        "'speaker_3': 'Built or being.'",
        "'speaker_4': 'Envisioned. This is the place.'",
        "'speaker_1': 'Where I used to take my trash with my dad in the early 1960s, one of seven landfill dump sites along the river. And this was ours and it's not there anymore. And we.'",
        "'speaker_6': 'Have truly a premiere magical.'",
        "'speaker_3': 'Site and I'll finish.'",
        "'speaker_6': 'By echoing every project. At the end of the day has a skipper, and the number one skipper of.'",
        "'speaker_1': 'This project has been Mike Bouchard.'",
        "'speaker_3': 'And it's important that you all know that it's an honor to be here tonight, and I'm just a little bit pleased. Thank you all very much.'",
        "'speaker_1': 'Thank you. Thank you so much. There are many residents who watch this Channel eight, and many of them just found out that the lottery helped fund many of our parks every year. So I hope folks know that it's it's amazing.'"
    ],
    "A proclamation observing September 15 through October 15 as National Hispanic Heritage Month in the City and County of Denver.": [
        "'speaker_1': 'It's a great project. Thank you, guys. Okay. Communications. Madam Secretary, do we have any communications?'",
        "'speaker_2': 'None. Mr. President.'",
        "'speaker_1': 'We have one proclamation this evening. Councilman Ortega, will you please read Proclamation 909?'",
        "'speaker_9': 'Absolutely. I'd be happy to. Proclamation number 909, observing September 15th through October 15th as National Hispanic Heritage Month in the city and county of Denver. We're, as Americans, observe National Hispanic Heritage Month from September 15th through October 15th by celebrating the histories, cultures and contributions of American citizens whose ancestors came from Spain, Mexico, the Caribbean and Central'",
        "'speaker_9': 'and South America. And. Whereas, Colorado's history, culture, economic and civic like have been shaped by the end, influenced by the contributions of people of Hispanic descent over many generations. And. Whereas, Denver is home to a large, vibrant and growing population of Latinos, whereas Latinos represent 32% of Denver's population.'",
        "'speaker_9': 'And. WHEREAS, The city and county of Denver has benefited from many contributions made by inspiring Latino leaders, including the recent recipients of the Denver Public Library, Latino Community Service Awards pilot Castro, Reno, Frank Priscus, Marlene de la Rosa, Luis Torres and the Colorado Latino Hall of Fame will be including Dr. Jose Vigil, Rad Tafoya, Salazar Family Foundation'",
        "'speaker_9': ', Honorable Federico Pena, Susan Cordova, Casimiro Barela at their October 18th event. And. Whereas, Latino residents have contributed immensely to Denver's culture and economic mosaic as laborers, service workers, chief executive officers of companies, large and small performers, artists, musicians, athletes, city employees and political leaders at all levels of government.'",
        "'speaker_9': 'Government as exemplified by Secretaries Federico Pena and Ken Salazar. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one. The Denver City Council, in recognition of National Hispanic Heritage Month, Please, pays tribute to the generations of Hispanic people who have positively influenced and enrich the lives of all people in the'",
        "'speaker_9': 'city and county of Denver. In Section two that the city clerk of the city and county of Denver affix the seal to the city and county of Denver to this proclamation.'",
        "'speaker_1': 'Thank you, Councilman. Or take your motion to adopt.'",
        "'speaker_9': 'I move for the adoption of proclamation number 909.'",
        "'speaker_1': 'It has been moved and seconded comments from the Council Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Mr. President. I thought it was important to bring this forward. I'm not sure that council has been doing this historically. I know when I served on the council before we did this on a regular basis, just to draw attention to the fact that there have been many contributions.'",
        "'speaker_9': 'And although that has occurred, there are still many challenges and disparities that exist within our communities. Some of the very neighborhoods that we have been struggling to help people keep people in their housing or we're seeing gentrification and displacement happen.'",
        "'speaker_9': 'And the work that was done by Councilwoman Kennedy. And you, Mr. President, in creating a dedicated funding stream for affordable housing, is really vital to keeping people in the city who have helped build this city, you know, whether it's laborers, you know, as I mentioned, Mayor Federico Pena, who played a big role in the building of DIA'",
        "'speaker_9': 'and the huge economic engine that that is for our entire not just metropolitan area, but this entire region. So. I would just ask that my colleagues support this. We don't have anybody here to speak to accept this tonight.'",
        "'speaker_9': 'But I think in light of one of the other bills that we have on our agenda tonight, there is a huge correlation between many of our Native Americans and our Latinos. Many share both both cultures, both heritages. And I'm excited about that bill that is is before us tonight.'",
        "'speaker_9': 'But I just want to take this moment tonight and acknowledge the many, many contributions that Latinos have. Mexicanos have have played throughout the city and county of Denver over many, many generations. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Ortega. Councilman Lopez.'",
        "'speaker_3': 'Thank you, Mr. President. And thank you, Councilman Ortega, for it. She tapped me on there, but she really wrote this and move this forward. And I'm glad I'm glad to co-sponsor this with Councilman Ortega. And I agree. I think, you know, it's important to celebrate.'",
        "'speaker_3': 'It's important that we have a proclamation. But it's it's not just a cute we're talking from this dais. And what we're trying to really exhort is that, you know, the celebration of our people and of the contributions of their people, their celebrations of our our history, our own, all of our history together.'",
        "'speaker_3': 'And how that you know, how that fabric was worn. You know what I can say and I'm glad you brought up I'm glad we're talking about real issues because. We don't celebrate Hispanic Heritage Day by popping open a corona.'",
        "'speaker_3': 'Or by going to eat a taco salad bowl, we celebrate the Hispanic community, the Latino community by our actions and not just as as council members or elected officials are appointed officials whose constituency is Latino. Right. But we honor them by by making sure that this community is not invisible.'",
        "'speaker_3': 'That when we walk by these buildings and construction sites, we see the people that build them. When we walk through these hallways and whether they are lawyers or clerks or council members or janitors, that we see them and we acknowledge people.'",
        "'speaker_3': 'Right. And we honor that. And I would say the same thing for our Asian American, our Muslim, our African-American, our our Anglo American brothers and sisters. It is, you know, this month just really highlights the history. Right. And there are so many different people from different cultures that make up this Latino group, just to say Latinos really'",
        "'speaker_3': 'are a huge umbrella term. But. We do it in our actions. And, you know, if I mention a couple, I mean, it's just really the tip of the iceberg and how we affected on city council. It's, it's, it's understanding zoning and how zoning affects culture.'",
        "'speaker_3': 'Our signing code in our community mural ism is a big deal. And if you don't think it is, think of Orozco or Rivera, you know, mural ism is throughout our neighborhoods. So having a sign code that doesn't make it illegal to have a mural that has your sign on it right in our sign code, that's just zoning'",
        "'speaker_3': '. Right. When you look at affordability and you look at small businesses, there's different ways in which we touch this and how culturally we have to all become aware. Right. And so this is one of those things where, you know, it's not necessarily is it's what our officers.'",
        "'speaker_3': 'Right. Or in our data collection as a city, when they make us check a box that says white, black or other. And I said, Well, you're a mexican, all right? She got on. Great. But are you black or are you white?'",
        "'speaker_3': 'Well, I'll Mexican. Are you black or you're white? Okay, if you're going to make me pick, I'm going to put indigenous. Because. Just because I have a last name that's Spanish doesn't mean I'm from Spain. If you have a notice and you look in the mirror and look like a Spanish dude.'",
        "'speaker_3': 'Right? But it is our actions in in our policies. But it's all of us, all of our partners, everybody in this city that provides us services that government falls short in doing or cannot do or relies on that is truly celebrating Hispanic Heritage Month.'",
        "'speaker_3': 'It's looking at our own actions and every single day it's making sure we do not see human beings as somebody other than human beings that they're in. They're not invisible, that they live and breathe in our city no matter what they look like or what their last name is.'",
        "'speaker_3': 'So in that, I proudly support this proclamation and.'",
        "'speaker_1': 'Are moving forward. Thank you. Thank you. Councilman Lopez. Councilman Espinosa. I swear it wasn't some sort of conspiracy, but there were a lot of names mentioned in that. And I also wanted to sort of say, because I'm sort of sensitive right now as we approach a general election about some of the things that have been said towards'",
        "'speaker_1': 'many minority groups in our country. And, you know, when you dropped names like Ken Salazar and more particularly to Denver, Federico Pena. What's important is that when you know he's synonymous with our airport, that's not a Latino airport.'",
        "'speaker_1': 'That's Denver's airport. And it's a it's a it's a it's the place on the map in this country and that sort of vision, you know, the sensitivities, whatever, you know, his upbringing was, you know, to sort of have that vision and.'",
        "'speaker_8': 'And bring forward.'",
        "'speaker_1': 'And marshal the political muster, whatever it takes to get to that to to implementation and reality and realization in the things that we do as individuals with our backgrounds to move this country and our and our and everybody forward.'",
        "'speaker_1': 'You know, I don't wasn't prepared, right, to talk, but what I'm getting at is that we don't make these decisions. I have a Hispanic heritage. Yeah. And that shapes who I am and where I stand on my principles and who I but I work for everybody.'",
        "'speaker_1': 'If you saw who was spearheading my campaign, it wasn't a huge Latino outpouring that said we want you elected. It was it was a large group, a very wide cross-section of Northwest Denver. And I'm glad that in the end, we had huge support from from across the the area.'",
        "'speaker_1': 'But I'm working for everybody. And yeah, my heritage matters because it is a is a perspective. But I think that we all bring it into sort of dismiss or disregard anybody in this country for where they come from.'",
        "'speaker_1': 'Is, is not how we we get to a great place. And so I'm happy to support this proclamation. But when we think about the people that that were mentioned, they're all doing great things for everybody in this city, in this country.'",
        "'speaker_1': 'And that's what I'm here for, is to do my best for you. So thank you for bringing this forward. Thank you, Councilman. Councilwoman Gilmore.'",
        "'speaker_8': 'Thank you. President Brooks. I wanted to say thank you to Councilman Ortega and Councilman Lopez for bringing this proclamation forward. You know, being a fourth generation Coloradan with family from Trinidad and from New Mexico, it's amazing the diversity of our Latino communities in Colorado.'",
        "'speaker_8': 'And really, you know, I used to always ask my grandparents, where did we exactly come from? And they were like, we've always been here. We didn't come from anywhere else. And so this is our home. And so from that perspective, I'm honored to, you know, support this proclamation tonight and that we continue the conversation about all of'",
        "'speaker_8': 'the many accomplishments that folks from our multiple, you know, diverse and inclusive Latino heritage have provided and continuing, I think, to provide the opportunity to make sure that their voices are heard. The one thing that I feel like I can do is at least open the door or pull out a seat at the table and make sure'",
        "'speaker_8': 'that folks are able to communicate exactly their own experiences. And if that's the least that I can do, I think I'm doing a pretty good job. So thank you. President Brooks.'",
        "'speaker_1': 'Thank you. And I'll just make a couple of comments in saying that, you know, what strengthens proclamations like these and is allies? Allies are different people, groups and and African-Americans. You're mentioned in this, Councilman Lopez, have intertwined relationships with Latinos and native people from the African Aztec alliances that used to happen.'",
        "'speaker_1': 'And I, I, I stand with this proclamation. But more importantly in this city is so important. We recognize what people have done in this city. I always say this because a lot of people don't believe it when they come to Colorado, but Denver is 50% people of color and it has a rich history and we need to'",
        "'speaker_1': 'talk about it and we shouldn't be ashamed to talk about it. Matter of fact, we should celebrate it. And so thank you, Councilman Ortega, for putting this forward. And I hope that we can begin to celebrate all of us amazing people's heritage, especially Hispanic and Latino.'",
        "'speaker_1': 'So with that, Madam Madam Secretary, roll call Ortega I.'",
        "'speaker_2': 'But I. Clark by Espinosa. Flynn, i. Gilmore. I. Herndon. Cashman. I can eat. Si. Lopez. I knew. Mr. President.'",
        "'speaker_1': 'I please close voting, announce the results.'",
        "'speaker_2': '12 eyes.'",
        "'speaker_1': '12 eyes for commission narrow. Nine has passed because when I take it you do not have anyone to bring up. But thank you for bringing this forward. All right. We have a resolution. Madam Secretary, will you read the resolutions?'"
    ],
    "A bill for an ordinance designating the second Monday of October of each year as Indigenous Peoples Day. Approves an ordinance designating the second Monday of October of each year as Indigenous Peoples Day.  The Committee approved filing this bill at its meeting on 9-14-16.": [
        "'speaker_1': 'Okay. Thank you, Councilman. Now, can we bring up Council Bill 801? And Councilman Clark, will you put will you put council will 801 on the floor for passage?'",
        "'speaker_4': 'Thank you, Mr. President. I move that council bill 801 be placed upon final consideration and do pass. Thank you.'",
        "'speaker_1': 'It has been moved and said Councilman Lopez.'",
        "'speaker_3': 'Thank you, Mr. President. I, I wanted to call this bill out because it's not like the others. Normally, in a block vote, these are routine bills and resolutions at that. Move, move forward. What is this council bill? You know, one is not necessarily routine.'",
        "'speaker_3': 'And I wanted to call this out because this is an important marker, this important milestone in our history as a city council bill. You know, one is an ordinance designating the second Monday of October of each year as Indigenous Peoples Day.'",
        "'speaker_3': 'And this is in perpetuity unless and this is an ordinance. Last year we had a proclamation and that proclamation and in our proclamations they're non-binding, although we proclaim and as a city council, we, we, we vote on it and we proclaim and they're very celebratory in nature, which does not take away from last year, which I think'",
        "'speaker_3': 'was incredible. It was a very important step. It was unanimous and it was received with a great deal of love and and gratitude. And we were honored. And I think I could speak for the majority of council that day.'",
        "'speaker_3': 'This is a tremendous honor that we felt in our community and our council right here. Being here and hearing the prayers and having the people here is was beautiful. So this particular bill approves this ordinance, and this is the first time.'",
        "'speaker_3': 'In Denver's history. That we will have a Denver an indigenous people stay. And we did this because our community. Is important. Our city owes our very founding. To the indigenous peoples in Denver. And I do this because our history books erase such history.'",
        "'speaker_3': 'And history is told through the eyes of the victor. And when you look at history, when you study history, when someone talks about the history of Denver, it always begins with the gold rush. And how it was subtle.'",
        "'speaker_3': 'Bye bye. Settlers and folks heading west looking for gold along the confluence of the Platt and Cherry Creek. And I was going to say this earlier with the Platte River and the importance of the Platte River and what that means when we honor the Platte River and when we're trying to rehab that Platte River and bring it'",
        "'speaker_3': 'back to life and not let it be something where we dump things in. But something that we celebrate is because that very confluence of that Platte River and Cherry Creek is where our city was founded. And it was founded by the Arapaho and Cheyenne people.'",
        "'speaker_3': 'That's where their camp, their seasonal encampments were. That's why it was on the map that way. That's why it was a great place to build a city. So we owe it. To the founders of our city. The true founders of our city.'",
        "'speaker_3': 'Our history, we owe them. But we also know that in the course of history, especially as folks pushed westward, that there had been. A. Forced removal. Of historic discrimination and violence. And I'll read this. Whereas for as the seasonal encampments where the city and county never hereby recognizes the historic discrimination and violence inflicted upon indigenous peoples throughout'",
        "'speaker_3': 'the Americas and the subsequent forced removal from ancestral lands. And the deliberate and systematic destruction of indigenous peoples, communities and culture resulting in high poverty rates. Disparities in education, health and socioeconomic status. And. Whereas, we as a city recognize that.'",
        "'speaker_3': 'And that is very important for us as a society, as we recognize our wrongdoings. We recognize is we recognize where where we went wrong. And it's not an empty apology. It's not. Or we'll name a team after you.'",
        "'speaker_3': 'War mascot will be. An Indigenous person. That's not the way you want it. You want it by making it no longer invisible. That history is no longer invisible. But that history is not just no longer invisible in our communities, but in our textbooks.'",
        "'speaker_3': 'So, you know, I know that as we move forward, this is something we hope that DPS will take up. Begin to teach. And. We want to recognize that there's also vast contributions in that education as we look forward towards the future.'",
        "'speaker_3': 'And that's the science, the knowledge, the philosophy, the arts, the culture. And through these contributions, our city has developed. Our state is developed. We do this not in opposition of anything. Not in spite of anything. We do this for.'",
        "'speaker_3': 'Our community and our city in support of our community. In our city. Support of that that indigenous culture. And I could proudly say that today. Was the first day. Now we do so. And in saying that, I want to acknowledge and recognize our our American Indian Commission.'",
        "'speaker_3': 'I mean, Goa was here. I mean, we're flying. Arthur received it last time, you know, for for working with me on this and going back and forth, our city attorney or assistant city attorney, David Broadwell, my staff, our community, our city staff, but most importantly and above anything else, our community.'",
        "'speaker_3': 'This isn't something that was just thought of this last year. This struggle has been going on for four decades. It's taken marches in the street just to be seen. It's taken civil action. It's taken civil disobedience. As a matter of fact, I sat in the same pews as we were being arraigned for what we believed.'",
        "'speaker_3': 'What we wanted to honor and see in the B.C.. And now it feels good to be opposite. To be able to have this bill in front of us. And, you know, to be able to read this and vote on this not as a bloc, but it's independent vote.'",
        "'speaker_3': 'And I want to save some of the umph for next. Monday on the 10th. Although this bill is being voted on today. And I hope my colleagues will vote to move it forward, to pass it on final adoption.'",
        "'speaker_3': 'But on next Monday, the 10th, we will have a proclamation celebrating our first Indigenous Peoples Day officially in Denver, Colorado. So with that, I. I support this bill moving forward, Mr. President. And I would be honored if my colleagues join me in a yes vote to making this become law.'",
        "'speaker_1': 'Well said, Councilman Lopez, Councilwoman Canete.'",
        "'speaker_5': 'Thank you, Mr. President. I spoke in support of this at committee. And once again, just wanted to thank Councilman Lopez for this important proclamation of our intention as a city to change how we honor this state. And I really especially think that it's important, not just in terms of recognizing history going backwards, but also to have more'",
        "'speaker_5': 'attention on Native issues moving forward, disparities, whether those be in terms of income, employment or homelessness in our city so that we just like the earlier proclamation. Think of this as a call to action. And just I can't help but note that it's special, I think, to have the Hispanic Heritage Proclamation on the same day as this'",
        "'speaker_5': '. These are two distinct cultures, but they come together in mestizo and the mestizo space of of of Latin and and and indigenous peoples who are sometimes melded in their backgrounds. So. So I think that this is a fitting combination to have these tonight.'",
        "'speaker_5': 'And I will be happily voting in support of this. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Espinosa, I saw you click in. I did, but I. I'll reserve my comments. Okay, great. We have. Let's see. No other comments. Councilman Ortega.'",
        "'speaker_9': 'Sorry, is shown on my screen. I'm not sure why it's not on yours. Thank you. I just wanted to make a few brief comments as well and thank Councilman Lopez for his efforts in working with the community to bring this forward.'",
        "'speaker_9': 'And I know this is something that has been in the works for a very long time. So thank you for your efforts. I just. Think that it's important also to mention the role that our Native American community played in.'",
        "'speaker_9': 'You heard me talk about DIA earlier. When we were moving forward with the construction of the highway, one of the things that happened was we worked with some of the tribal leaders to do a ground blessing on the site.'",
        "'speaker_9': 'As you all know, that used to be part of the old Sand Creek Massacre corridor. And I thought it was extremely important for Denver to do that. And the interesting thing about the event was the media wanted to know when and where it was going to take place.'",
        "'speaker_9': 'And I worked with Mayor Webb at the time to ensure that that happened. I didn't attend it. We made sure the media didn't know when and where it was because it was, you know, a very traditional sacred event that needed to take place and to, you know, pray for the lives of of the souls who were lost'",
        "'speaker_9': 'in that massacre. The other thing that Councilman Lopez talked about was the the history of where Denver started. It started with our Native American community right at the at the core of the Confluence Park. The city acknowledges that to the degree of seeing a number of the the parks, I mean, not the parks, but the roads down'",
        "'speaker_9': 'in the lower downtown and platte valley area named after some of the tribal leaders. We want to wynkoop a little raven. I remember when the naming of little raven was being proposed. Our public works department was recommending that that be called 29th Street.'",
        "'speaker_9': 'And I just you know, I was the councilperson of the district at the time. And I said, how do we make these decisions about what streets, what we're naming our streets? And I said, What other names did you look at?'",
        "'speaker_9': 'And they mentioned Little Raven. And this was when they were bringing through the committee process to do the official naming. And I said, I want it named Little Raven. And so when when that official, you know, name was put up on the street, we actually had some of the tribal leaders from the Cheyenne tribe there, and they'",
        "'speaker_9': 'actually were given a street sign that they were able to take and put up on display in their community. So just being part of so many of the things that have happened in this city is exciting. I worked at the state capitol when the Commission in Indian Affairs was created in George Brown's office.'",
        "'speaker_9': 'The lieutenant governors, it's been part of that office. I worked there and had the benefit of going to a peace treaty signing ceremony between the U.S. and the Comanches, who had been at war with each other for for 100 years.'",
        "'speaker_9': 'And a lot of these things, as Councilman Lopez said, are not written in our history books. You know, you in and one of the things that's occurring and those of you who have not taken the time to talk to your elders and record some of the history so that you pass it on to, you know, our children'",
        "'speaker_9': 'is is so important. I know in in New Mexico on some of the reservations, there are people actually doing filming, too, now of some of the elders to make sure that that history is documented and passed on, because it isn't translated in many of the history books you get in your public education system.'",
        "'speaker_9': 'So I again, just am happy to support this and again commend Councilman Lopez for his efforts in our Indian commission and the work that you all have done with our entire entire community. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Lopez, I see you back up.'",
        "'speaker_3': 'Yeah. You know, I wanted to really emphasize the 10th, Monday, the 10th and proclamation that will be here in the quarters we'd love for. And I wanted to make sure the community because we do have community folks, I want to make sure that we come back on the 10th because we would like to give not only the'",
        "'speaker_3': 'proclamation, but a copy of the bill over. Right. And and ceremoniously and also just for the community. I know this Saturday I didn't mention this, but the Saturday is going to be, in addition to all the events, a rally at the Capitol at 1130.'",
        "'speaker_3': 'I mean, 130, 130. You mean marches coming from all over the city and they're going to be here. Good celebration of all directions, all nations. And that that's really when you when you look at the what it really means is all directions all nations for went.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Madam Secretary.'",
        "'speaker_2': 'Raquel Lopez.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'New Ortega I Black High Clerk by Espinosa.'",
        "'speaker_1': 'By.'",
        "'speaker_2': 'Flynn. Hi Gilmore I Herndon in Cashman. I can eat. Mr. President.'",
        "'speaker_1': 'I please close voting in US results.'",
        "'speaker_2': '12 eyes.'",
        "'speaker_1': '12 eyes conceal. 801 passes. Thank you. Thank you. Thank you. You don't get many claps for votes anymore. Thank you. All right. We are moving to the Bloc votes. All other bills for introductions are now ordered published. Councilman, clerk, will you please put the resolutions for adoption and the bills for final considerations?'",
        "'speaker_1': 'Consideration for final passage on the floor.'",
        "'speaker_4': 'Thank you, Mr. President. I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in a block for the following items. 539 811 816. 812. 813. 814. 820. 821. 822. 800.'",
        "'speaker_4': '815. Eight 1724. 761 797.'",
        "'speaker_1': 'All right. It has been moved. And second, it councilmembers. Please remember that this is a consent or block vote and you will need to vote I or otherwise. This is your last chance to call out an item for a separate vote.'",
        "'speaker_1': 'Madam Secretary, roll call.'",
        "'speaker_2': 'Black. I Clark.'",
        "'speaker_4': 'II.'",
        "'speaker_2': 'Espinosa, i Flynn, i Gilmore. I Herndon I Cashman. I can eat. I knew.'",
        "'speaker_4': 'I.'",
        "'speaker_2': 'Ortega, I. Mr. President.'",
        "'speaker_1': 'I. Please close the voting. Announce a results.'",
        "'speaker_2': '11 Eyes.'",
        "'speaker_1': '11 Eyes. The resolution resolutions have been adopted and bills have been placed on final consideration and do pass. Tonight there will be a required public hearing for Council Bill 430 Changes on a classification of four Geneva Court and Martin Luther King Jr Boulevard.'"
    ],
    "A bill for an ordinance changing the zoning classification for Geneva Court and Martin Luther King Jr. Boulevard. Rezones property at Geneva Court and Martin Luther King Boulevard from R-MU-20 (Former Code: residential, mixed use) with waivers to M-MX-5 (master planned, commercial mixed use, 5 stories) in Council District 8. The Committee approved filing this bill at its meeting on 8-3-16.": [
        "'speaker_11': 'Okay, I'm on the second slide now. I think you've got numbers now, don't you. On your slides.'",
        "'speaker_1': 'No, no.'",
        "'speaker_11': 'Okay. I'm sorry.'",
        "'speaker_1': 'Just like this. Like less. Okay, great.'",
        "'speaker_11': 'So this is in Council District eight in the Stapleton neighborhood. I'm moving on to the next slide in the Stapleton statistical neighborhood, as I just said. The location slide shows you that it is in Southeast Stapleton at the intersection of Martin Luther King Jr Boulevard and Havana Street across from Bluff Lake.'",
        "'speaker_11': 'You can't see Black Lake in this, but southwest of the Denver City jail. So moving on to the request, it is about 0.83 acres or 36,000 square feet. The property itself is vacant. The applicant is requesting the rezoning to redevelop the property into a financial services dental office and hairdresser land use.'",
        "'speaker_11': 'So the again request is to rezone from r emu 20 with waivers to master planned context, mixed use five stories. So moving on to the current waivers, they relinquish the right to some civic land uses, including gallery, museum, boarding school, university or college.'",
        "'speaker_11': 'Some commercial land uses including animal sales, banking and financial services, medical or dental office and clinic, and the right to construct offices over 2500 square feet or aggregated over 5000 square feet of office space. So moving on to the context, again, the existing zoning is arm you toe with waivers.'",
        "'speaker_11': 'There is a Stapleton general development plan in this for the South Area adopted in 2001. The land use is vacant. This property itself is surrounded by residential, small scale residential and some commercial under development now. So looking at the context map zoning, you see that there's marks five to the north, there's mmx5, which is the mixed use'",
        "'speaker_11': 'zone district where they're applying for to the east and to the south and then to the west. The RMU, Tony, with waivers. Moving on to land use. The surrounding land uses are a mix of low density multi-unit and single family.'",
        "'speaker_11': 'And the blue on the map that you see on this slide is a daycare center. I would point out that the to the south, the triangular parcel, there are two restaurants underdeveloped there. And just south of our subject site is the site where the new King Soopers is being developed.'",
        "'speaker_11': 'They're being built just. So looking at building foreman scale, this gives you an idea of the existing buildings in the area. The day care center is the top photo. The the grassy field is the vacant property we're talking about.'",
        "'speaker_11': 'The lower right photo is some townhomes and single family homes directly across Geneva court from our site. And then all the steel girders in the bottom picture are the King Soopers under under construction. So moving on to process, an informational notice of a complete application went out to City Council and all of the affected renos on March'",
        "'speaker_11': '24th. Our planning board held a hearing June 1st on this and was duly noted, duly noticed electronically with a sign posted on the property and planning board voted 9 to 1 to recommend approval. And then we were on to the Land Use Transportation and Infrastructure Committee on August 3rd.'",
        "'speaker_11': 'They passed this item on to the Council for this public hearing. These are the RINO's that were notified and to date we have no public comment. So review criteria, you're very familiar with consistency with adopted plans, uniformity of district regulations, furthering the excuse me, public health, safety and welfare, justifying circumstances and consistency with neighborhood context and zone'",
        "'speaker_11': 'district purpose and intent. So the plans that apply to this property plan 2000 Blueprint Denver, the Stapleton Development Plan and the Stapleton redevelopment of the General Development Plan for the South Area adopted in 2001. So what I wanted to get into first was the sort of evolution of the location of this town center site.'",
        "'speaker_11': 'On the bottom left is the of the town center. Location side is the original location in the Stapleton Development Plan in 1995, which was going to be at 26th Avenue and Havana Street. Then by the time we did the GDP in 2001, the town center had moved slightly north and Martin Luther King, coming in sort of from'",
        "'speaker_11': 'the west in that middle picture, was going to divide and the town center was going to be in the center of that divided Martin Luther King. That was a little north of 26th Avenue. Then by the time we did, too, in 2002, when Blueprint Denver mapped the area, the town center had moved north to Martin Luther King'",
        "'speaker_11': 'and Havana Street, and Martin Luther King had not dipped south to connect to 26th Avenue like that center picture had envisioned. So there has been kind of an evolution of the location of the town center. I should note, though, that when we approved the zoning in 1995 for most of South Stapleton, the GDP very deliberately said the'",
        "'speaker_11': 'zoning should rule, and that's what we have adhered to since then. The GDP has not been amended. So I can't plan 2000. We have several strategies that we think this application conforms with telling us to promote the development of sustainable communities and centers of activities where shopping jobs, recreation schools are accessible to encourage quality infill development that'",
        "'speaker_11': 'offers opportunities for different densities and amenities to encourage development of focal points in communities where none exist, and to support development of neighborhood serving business centers. So I'm on to Blueprint Denver. Blueprint Denver land use concept is single family residential, and it's an area of change.'",
        "'speaker_11': 'The single family residential is described as primarily residential, with some complementary land uses such as parks and schools and some employment base that is definitely smaller than the housing base. Future ST Classification and Blueprint Denver. Martin Luther King is a mixed use arterial where we want to provide a high degree of mobility and.'",
        "'speaker_11': 'These streets are located in our higher intensity mixed use areas. 31st Avenue and Geneva are both under designated local streets. So I'm on to Stapleton Development Plan. This site is in District three in the Stapleton Development Plan. It is a to be an urban neighborhood, moderate density, significant natural amenities, as all of the Stapleton neighborhoods have, and'",
        "'speaker_11': 'strong ties to original Aurora as this is directly adjacent to Aurora on the east. So those key elements from that district, from the Stapleton Development Plan, that it's predominantly residential, that it has that district center, town center, that all Stapleton town centers have transportation elements and have either an elementary school or a neighborhood center of some kind'",
        "'speaker_11': '. That's the one of the unique elements of this town center is that they they wanted us to develop urban design guidelines for the correctional facility on Smith Road as it's directly adjacent to the north of this area. So moving on to the GDP, the GDP and the mixed use zoning in the chapter, former Chapter 59 required general'",
        "'speaker_11': 'development plans. I'm sorry, the mixed use zoning required general development plans. So the GDP was based in the Stapleton Development Plan. There were 2155 acres in that general development plan, and it was generally shaped as most of Stapleton is, by the open space, walkable neighborhoods, mixed use town centers and neighborhood centers, regional retail and all different variety'",
        "'speaker_11': 'of land uses from residential all the way to industrial. And as I said before, specifically, the land use concept laid out in the general development plan, talked about the land uses may change and evolve over time, but would remain consistent with the mixed use zoning.'",
        "'speaker_11': 'So again, the mixed use zoning, the RSU 20 was put in place. It was primarily residential, but it was along some heavily traveled streets. And the mixed use concept of combining residential and neighborhood serving retail was present in the GDP.'",
        "'speaker_11': 'So I'm moving on to the land use slide from the general development plan and you see the red circle on the map there. It's a difficult map to read, but it was called residential on the general development plan.'",
        "'speaker_11': 'And then on the zoning map from the general development plan, we see that the site itself is the arm you tow with waivers zoning. And then the Street Network. I just wanted to point out again that the Street Network for as far as Martin Luther King Boulevard is did not develop the way the general development plan envisioned'",
        "'speaker_11': 'it. It did not split into two one ways, and it did not go just to the south and join 26th Avenue. It ended up actually pretty much being aligned east and west. So the master plan context under review criteria consistency with neighborhood context and zone district purpose and intent master plan context is intended for large redeveloping areas'",
        "'speaker_11': 'that are redeveloping in phases over time. And as I said before, the range of land use is ranged from single unit multi-unit, mixed use, large town centers, small town centers, transit oriented development, commercial, all the way to industrial land uses as we are developing a whole new community and the master plan mixed use zoning is intended to'",
        "'speaker_11': 'provide that flexibility for these master plan communities and to respond to market opportunities over time. And the zoning regulations were written to support these phased developments, allowing a variety of developments so it does the master plan mixed use five story does promote new town centers with mixed use neighborhoods that are five stories in height.'",
        "'speaker_11': 'So with that, staff believes that all of the criteria are met, that this proposal is consistent with the adopted plans, that it furthers the uniformity of district regulations by moving into a standard zone district from a custom zone district that, in adopting in implementing our plans, were furthering the public health, safety and welfare, that the justifying circumstance'",
        "'speaker_11': 'of changed conditions has been met, and that this project is consistent with the neighborhood context and zone district purpose and intent. With that, staff recommends approval.'",
        "'speaker_1': 'Thank you. Miss Lucero, we have one speaker tonight. I'm going to ask that person to make their way forward. Tyler Carlson. You will have 3 minutes. Please introduce yourself.'",
        "'speaker_6': 'Telecast. I'm a principal at Evergreen Development, so I'm the applicants and don't have a formal presentation. Just want to thank Theresa and staff for her help working through the zoning process. She's been great. And I want to thank the neighbors who are here.'",
        "'speaker_6': 'We've been working collaboratively with them over the last several months to make sure that the project we're doing here, which is basically a second phase of this bridge town center, is beneficial to them and the rest of the surrounding neighborhood.'",
        "'speaker_6': 'The impetus behind this request is really to remove the Byzantine waivers that are on it, which preclude financial services and a dental office. And we have leases with both of those use categories and we are leasing to them specifically to keep less intense uses in this buildings or service oriented uses versus the heavy restaurant mix we have'",
        "'speaker_6': 'in the town center immediately south. So we think this is a win win. It also cleans up the zoning for the overall parcel. And I want to thank everyone for their time and here to answer any questions.'",
        "'speaker_1': 'Great. Thank you.'",
        "'speaker_6': 'I also live in Stapleton and I work in the city in county of Denver, too. Sorry.'",
        "'speaker_1': 'Great. Thank you. All right. That concludes our speakers. Are there any questions for members of council? Councilman Herndon.'",
        "'speaker_6': 'Thank you, Mr. President. Three To start with you, the planning board. Nine The one who's the one and why?'",
        "'speaker_11': 'That was Don Elliott, and he had an issue with the location of the town center over time. He didn't.'",
        "'speaker_8': 'Believe that.'",
        "'speaker_11': 'Because Blueprint Denver didn't have a town center on the north side of Martin Luther King Boulevard. He didn't believe that this proposal conformed with Blueprint Denver.'",
        "'speaker_6': 'Okay. Fair enough. And could you go back to the slide where you showed the different zone codes?'",
        "'speaker_11': 'Yes, let me get to that.'",
        "'speaker_6': 'And my question is that parcel north of Martin Luther King, it has to zone codes, it has to the east, the x five, which is what the applicant is trying to go to, into the west. It has the RMU.'",
        "'speaker_6': 'And my question is why that is the case. You would think that that should be either or. And I'm curious why it's split.'",
        "'speaker_8': 'That's it.'",
        "'speaker_11': 'That's it?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_11': 'Why? There's Army 20 with waivers.'",
        "'speaker_6': 'Parcel to the north. That's two different zone codes. So they are amused on the west. And then the next five was the applicants trying to go to is to the east. And I don't know if you know why that that is the case.'",
        "'speaker_11': 'Why in 2010 maybe we didn't write down the Army 20 because it had waivers.'",
        "'speaker_6': 'Okay.'",
        "'speaker_11': 'And the one to the north, it doesn't have waivers because it had a site plan that already governed it. So we didn't want to. We also did not reason. Site plan or PBGC, as we call them, plan building groups, because we didn't want to have to take back our approval of a site plan that was already approved'",
        "'speaker_11': 'and use.'",
        "'speaker_6': 'And you said this, but I want to make sure that this is understood. The current zoning right now, the RMU does allow commercial uses.'",
        "'speaker_11': 'As it's mixed.'",
        "'speaker_6': 'Use and which commercial uses could and actually actually, Theresa Tyler, I can call you up because I'm sure you've studied this a lot more, Tyler, if you want to come up. Thank you, Theresa. What can the. You don't even have to come here right now.'",
        "'speaker_6': 'You could have currently bought the property and done what to it. Currently. Yeah. The both categories allow for commercial retail, both allow for drive thru uses, both allow for actually high density residential. The only difference between the two categories is the waivers which limit you preclude you from doing financial services, medical, dental, that list that Theresa provided'",
        "'speaker_6': '. I don't know why in the world it is so weird, but anyways, it is what it is and we're trying to remove it. But yeah, you could. The exact same building we're trying to build, you could do the only difference, as I mentioned the neighbors earlier this evening is if this was to not pass the waiver stuck'",
        "'speaker_6': ', that I have to backfill my leases with the dentist office in the bank with more restaurants because that's the only the other viable use category and we both don't want to do that. But that's more intense uses by their homes.'",
        "'speaker_6': 'Correct. And that's why I, I think sometimes when people see are they think residential and I appreciate you bring up that point entirely. One more for you. And since none of them have signed up to speak against, I am assuming and I we've met with them that they are comfortable moving forward.'",
        "'speaker_6': 'But if you wanted to Tyler one, I appreciate the conversations you've had talking with the neighbors and their concerns and I'll speak a little bit to that during the comment, if you just wanted to talk about how those conversations have gone forward, they've gone great.'",
        "'speaker_6': 'I mean, it's it's a great group of neighbors who have normal concerns that anyone would have I would have if this was happening across the street from my house. They haven't been relating to the rezoning. It's really related to access.'",
        "'speaker_6': 'And we've tried to work through that with traffic staff to varying degrees of success, you know, which is a challenge for all of us, because I think we'd all like maybe a different access program than engineering's allowing to occur.'",
        "'speaker_6': 'But again, that doesn't concern the rezoning. But we continue to you know, we're doing some additional buffers. We're asking to be planting some trees on their side of the street to help mitigate some of the impact. We did something similar when we did the Sprouts on Colfax, where we had similar commercial adjacencies right next to neighborhoods.'",
        "'speaker_6': 'So we're trying to be good neighbors. And I live not too far away so they know where to find me. Great. Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Herndon, Councilman Espinosa, this might be a question for either Teresa or the city attorney. And this question really wouldn't have mattered at the time that it came to plan, Candy. But now that we've approved the linkage fee, if this plan set were to go for permitting after January 1st, is this still covered by the'",
        "'speaker_1': 'Stapleton housing plan or does this now fall under under the linkage fee? And the reason why I'm asking is one of those waivers allows a substantial, considerable more amount of redevelopment on this means of development on this site than the 2500 or 5000 square foot limitation.'",
        "'speaker_1': 'You know, this is a nearly 40,000 square foot site, TMX five. That's this can be a far more substantial project in what was originally codified.'",
        "'speaker_11': 'I'll defer to the city attorney.'",
        "'speaker_4': 'Mr. President? David Broadwell, Assistant City Attorney. The rezoning doesn't affect the fact that the language in the new linkage fee ordinance exempts out the entire Stapleton geographic area by virtue of the fact that it remains under the original development agreement adopted in the in the early 2000.'",
        "'speaker_4': 'So this rezoning doesn't affect the fact that the applicability of the linkage fee at all, that the the property remains exempt until the development agreement goes away.'",
        "'speaker_1': 'So why wouldn't we require somewhere in the process that that when we're granting so right now that the entire property parcel that's being redeveloped I mean re zoned has a 5000 square foot commercial limitation. Now obviously under residential, it could be substantially higher than that.'",
        "'speaker_1': 'But if it were to get developed commercially, every square foot of development in excess of 5000 square feet is in fact now not part of that redevelopment or.'",
        "'speaker_11': 'If it's an office, is it 5000 square feet?'",
        "'speaker_1': 'So any commercial use.'",
        "'speaker_11': 'Commercial uses don't have that.'",
        "'speaker_1': 'But now we're exempting that for the other waived uses that were so interesting. Yeah. Is that all your questions? Yeah. Okay. All right. Any other questions for members of council? A public hearing for council bill 430 is closed.'",
        "'speaker_1': 'Councilman Herndon.'",
        "'speaker_6': 'Thank you, Mr. President. I appreciate the questions and I appreciate the community from coming out. And this show that I have so few people coming out demonstrates Tyler's ability to work with the neighbors. I am so familiar with this area.'",
        "'speaker_6': 'If the U.S. went down a little further south, you would have seen my house, my first house at 26 in Fermanagh and 28 when I put down an offer on that. And I remember those signs that talked about the East Ridge Town Center coming and it's finally here and it's really exciting.'",
        "'speaker_6': 'Those pictures need to be really updated, particularly at the town center because it's coming. And I appreciate I'm excited to see the full parcel north of Martin Luther King as well. And I appreciate Tyler and Evergreen recognizing the community in the sense because as he said, he could have done more active uses where you could have had'",
        "'speaker_6': 'restaurants, where you could have things going on and like 9:00 at 10:00 at night, right across the street from the neighbors. But I think he recognized there's a way to do commercial as well as take the neighbors into consideration.'",
        "'speaker_6': 'I think that's a testament to you, Tyler, as well as you being a resident and being very familiar with the community. I appreciate neighbors coming through because we have spoken in length about their concerns, not particularly the zoning, but particularly on egress and access.'",
        "'speaker_6': 'And we've we're continuing to have those conversations. And I, I appreciate you being here. We're going to continue those conversations to make sure we can ensure that you can have your your concerns warranted, as well as making sure that the parcel that's going to be developed can be successful as well, too.'",
        "'speaker_6': 'So this is something that I, I certainly support. I hope my colleagues will. I, I just find those earlier photos very interesting. I couldn't imagine Martin Luther King dipping down to 26th Avenue now the way that is in those original when you think about how it is now.'",
        "'speaker_6': 'But this is something I certainly do support and I would encourage my colleagues to do so as well. Thank you, Mr. President.'",
        "'speaker_1': 'Yeah, thank you, Councilman Herndon. I will say one thing about this, not particularly this development, but I expect Tyler to do well with the neighbors because and in 2012, with the former sunflower site and you mentioned it, but now the sprouts that's on Colfax in a food desert, that was one of the most complex issues in working'",
        "'speaker_1': 'with neighbors. And still to this day, the folks over there are really excited about that grocery store. So I hope this works out for the Stapleton neighborhood as well. We this has been moved in second. Madam Secretary, roll call.'",
        "'speaker_2': 'Herndon. I Cashman. Kinney. Lopez knew Ortega. My black eye. Claire. Espinosa.'",
        "'speaker_4': 'Flynn I.'",
        "'speaker_2': 'Gilmore, I. Herndon, I guess again, I sorry, Mr. President.'",
        "'speaker_1': 'I please close the voting and thus the results.'",
        "'speaker_2': 'One moment. Ten eyes. One day.'",
        "'speaker_1': 'Ten eyes. One constable for 30 has passed. Congratulations.'",
        "'speaker_2': 'Lopez did wear you and I vote yes. Okay. Well, clean it to a 12.'",
        "'speaker_1': 'No, no, no, no. 11 eyes. One.'",
        "'speaker_2': 'There should be 12 eyes when they.'",
        "'speaker_1': '11 eyes were missing one specimen. It passed, though we do know that. So Council Bill 430 has passed. Congratulations. There is no pre adjournment announcements except that we forgot a hat again for Councilman Clark. Come on. Actually, let's go.'",
        "'speaker_1': 'He should be wearing a cowboy hat because they lost the border war to the lamb. Can't see it. No other business before this body. We stand adjourned a.'"
    ]
}