{
    "Approves a contract with Sasaki for $3 million through 05-01-19 for land planning at Denver International Airport and assistance with various services related to the planning and development of land on the airport (201524391).": [
        "'speaker_1': 'Councilman Flynn, what would you like for us to do with this?'",
        "'speaker_5': 'Thank you, Mr. President. I just have a brief question for probably George at the airport. Go ahead. George Merritt and I was able to prep him beforehand. So in the scope of services, Mr. President, for this consulting contract, for planning and development of land.'",
        "'speaker_5': 'One of the scopes of service is to engage in planning for development in the runway clear zones. And I just want to get out get out here. What are we thinking of building in the clear zone of the runway?'",
        "'speaker_5': 'What kinds of development do we envision in a clear zone of a runway?'",
        "'speaker_7': 'Thank you, Councilman. So just for a clarification, the clear zone is this area around our periphery where airport property is actually the airport owns property in Adams County. And prior to the amendment, what we what we saw is this effectively a moat for economic development.'",
        "'speaker_7': 'So in terms of what we're going to develop on this, that's that's part of why we're doing this ongoing contract is certainly going to look all over the airport. But we couldn't really do economic development planning prior to the voters approving this amendment in November.'",
        "'speaker_7': 'So part of what we're going to be looking at with this contract is what sort of economic development will make sense in those clear zones.'",
        "'speaker_5': 'Okay, George, we're not. Are we actually talking about the entire perimeter clear zone? We're not talking about the clear zone off the ends of the runways, or are we?'",
        "'speaker_7': 'So this will be looking, you know, at we'll look at different nodes. I don't have a specific answer for where we would be looking or where we wouldn't. You know, certainly right off the end of the runway may not be, you know, you're not going to build a a 50 storey tower there.'",
        "'speaker_7': 'The FAA would certainly have something to say about that. But where as we do this on call and planning will be, we'll be examining different places that make sense, probably building. My guess would be building out from where there's already development.'",
        "'speaker_5': 'Okay. Can I request then that when you get when you start talking about development in an actual runway, clear zone, that you let us know because I don't even know if we should be building a one storey building in a runway clear zone.'",
        "'speaker_7': 'You know, that makes sense.'",
        "'speaker_1': 'Thank you. Absolutely.'",
        "'speaker_5': 'That's all, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Councilwoman Ortega.'",
        "'speaker_6': 'I have a couple of questions. George, if you could stay there. First of all, is this part of the 15,000 acres that was approved or is this different from those 15,000 acres that the voters gave us the green light to move forward and do development on?'",
        "'speaker_7': 'It's a good question. So just a quick note. It's 1500 acres, but we've got a lot of land. The 1500 acres is a is a pilot program where we can actually pull what sort of withdraw acreage as we do economic development and we have a lease going forward to do development that is not specifically related to the'",
        "'speaker_7': 'airport. We actually will notify Adams County of what of the amount of acreage that will be pulling out of that pilot program. And sort of you can think of it as a as a bank and we're making a withdrawal.'",
        "'speaker_7': 'So technically, yes, if we if we decided important distinction that I didn't know before is in the clear zones. Our agreement with the in the in this idea is that we would in the 1500 acres we split the tax revenue 5050 in the clear zone that's actually in Adams County, 100% of the tax revenue would go to'",
        "'speaker_7': 'county.'",
        "'speaker_6': 'Okay. My second question is about a contract that we did. I want to say some time last year that involved multiple players, different companies that were looking at doing planning for Aerotropolis. How is that different from this?'",
        "'speaker_7': 'I believe you're referring to a seat on Aerotropolis study. Am I? If I'm thinking of the one that was presented?'",
        "'speaker_6': 'I'm not sure. There were lots of different companies that were part of looking at development of land, and I couldn't remember. I can't remember now if it was just specific to on or off airport land.'",
        "'speaker_7': 'So a couple of different things and hopefully this will answer your question. One is recently commissioned a study, an aerotropolis study that specifically looked at areas around the airport, across the region. And this was with a key to making sure that we were doing infrastructure planning that made sense across our boundaries, you know, as a region.'",
        "'speaker_7': 'And that is one study we have had previous planning contracts that we that we have basically started very high level that will advise certainly what Szaky is doing on this contract. As we get more and more granular, we just we have not been able to do a level of planning when we're talking about specific to the big'",
        "'speaker_7': 'contract. You know, prior to this, without without the amendment being passed by voters, we were specifically we could not do this sort of.'",
        "'speaker_6': 'So one of the one of the firms I remember was trailer that was part of a group of organizations that were looking at sort of planning for the future development. And that's where I was trying to understand how is this different from that.'",
        "'speaker_7': 'So so you want to. Good evening. My name is John Potts. I'm your development director in real estate and through the chair. The tribute to him Hill contract was what we would call the phase two effort, and it did a fairly high level of land planning.'",
        "'speaker_7': 'With the advent of the 1500 acres, we felt it was incumbent to do an additional drill down for the on an urban design basis. And so that is why we're asking the council to psyche contracting.'",
        "'speaker_6': 'So the work from tribal and teach to him Hill is done.'",
        "'speaker_7': 'It has been done. There was work done prior to that. That was phase one. The tribal work was phase two. This will be the third and final phase.'",
        "'speaker_6': 'So if any of us want to look at what they did, what came out of that, we could just contact George to look at that.'",
        "'speaker_7': 'Yes, ma'am. That would be the best. Some of the work that came out, it was quite, quite voluminous, thousands and thousands of pages and it was inch of.'",
        "'speaker_10': 'In draft form.'",
        "'speaker_7': 'But we do have it. If you'd like to see it, we can arrange for that.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilman Ortega. Councilman Espinosa.'",
        "'speaker_4': 'Sorry. Just a quick question. So the contract says that the deliverable is a master plan based on the task order, scope, scope of services. But in the tab, in the scope of services, there actually isn't a master plan or draft plans listed.'",
        "'speaker_4': 'Am I missing something there?'",
        "'speaker_7': 'No, sir. There is a task the it is a task order contract, but the first task order is for a master plan. We specifically asked for a deliverable of a master plan and that will be documented with several different documents.'",
        "'speaker_7': 'So we'll have a small scale maps for the entire 9000 acres. We'll have the one, two, 300 or one ish to 200 maps for the more village size developments. So is.'",
        "'speaker_4': 'That under Amendment I mean, exhibit A of the contract.'",
        "'speaker_7': 'Exhibit A and then task order one outline.'",
        "'speaker_4': 'I've got onboarding and assessment, I've got visioning, I've got establish define scope of work and schedule for task order one. But the deliverable is the schedule in the meeting minutes.'",
        "'speaker_7': 'There should, there should be a master plan deliverable in the in the task order. And what we'll do as well as part of the we when we styled the task order, we wanted input from the planner that was doing the work.'",
        "'speaker_7': 'And so we'll be asking that planner to help us implement the best way to do that work, the best way to produce that master plan.'",
        "'speaker_4': 'I'm just wondering if I'm looking at the right agreement. Um, because, yeah, there's no mention of a master plan other than in the deliverables of the agreement. Yes, but by reference to the exhibit. Let's see. All right. I'm sorry.'",
        "'speaker_4': 'I'll keep searching for it. Thanks.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman, to take you back up.'",
        "'speaker_6': 'Yes. I just wanted to clarify. How many total acres are we talking about? So there's the 1500 from the original voter approval. And then this is asking to look at additional land for planning. This isn't the green light to go ahead and do any kind of development.'",
        "'speaker_6': 'Is this only land in Adams County or is any of it in Denver County as well?'",
        "'speaker_7': 'No, it will be the 1500 acres from the Ojai Amendment. Plus, it'll take a look at the residual of the 9000 acres. But for sure, the the heavy drill down will be on the 1500 acres that will be focusing on over the next few years.'",
        "'speaker_7': 'But we do want a comprehensive master plan that will advise us and guide us as we move forward to develop that through the development process. Those lands that look like they will be more than 15 or 20 years out, we'll probably do scenario designs on those.'",
        "'speaker_7': 'So that will. Put in place alternate land uses if if a given condition exist, the land use could do this. But if a given condition exist, it may be appropriate that it be this okay?'",
        "'speaker_6': 'And all of this is within the purview of what FAA allows. Denver to do on airport land?'",
        "'speaker_7': 'Absolutely. Yes, ma'am.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you. I also want to tell you, you know, the questions or comments on 258. CNN. Thank you. We'll go to the next one, Madam Secretary. 25 seven, council on the new. Would you like for us to do this?'",
        "'speaker_10': 'I'd like to make a comment. Please. Go ahead. I'd just like to thank the Department of Environmental Services for their assistance and working with US ordnance and strafing it. I'm so pleased that I see that technology is being emphasized to help control orders and as well as the inspections and the follow up and notification process and the'",
        "'speaker_10': 'strong rules and regs they are providing too. So I really want to thank them very much for working with me on that and helping strengthen that. They've done a great job and look forward to to helping control those orders, which have been a big, big issue with residents, especially related to marijuana.'",
        "'speaker_10': 'So. Thank you very much. The only problem I have is we've been on great tours at Red Rocks in the mountains where I'm having a hard time explaining why I'm excited about going on the odor tour Friday. So, so, but thank you so much for all that you do with this audience.'",
        "'speaker_10': 'I really appreciate it. Thank you.'",
        "'speaker_1': 'Councilman, New York Councilwoman Canete.'",
        "'speaker_9': 'Thank you, Mr. President. I, too, am very excited to see this ordinance moving forward. But I would. I've had some questions from the community and I just thought would be helpful on the record, if I may invite the Department up to answer your question about timeline.'",
        "'speaker_10': 'Good evening, Greg Thomas with Department of Environmental Health.'",
        "'speaker_9': 'Thank you. So there's a couple different things that happen after this bill is passed. There's regulations that come, then there's an effective date and then there's a date by which things really have to be in place. Can you just very briefly just clarify for the public that timeline so they understand when they can start to expect that'",
        "'speaker_9': 'new technology will be installed, particularly in the covered industries that are required to do installations regardless of complaints.'",
        "'speaker_10': 'Right. So over the rest of the spring and summer, we will will be developing rules or regulations that really kind of get more at the details of stuff that is not in the ordinance. And that will involve consulting with industry stakeholders, with community stakeholders, and start to identify what we expect to see in an odor control plan'",
        "'speaker_10': '. So right now, this rule is scheduled to be heard by the Board of Environmental Health in September. And so assuming that the end of September this is all passed, then that will trigger a 90 day clock for affected industries to submit an order control plan.'",
        "'speaker_10': 'So let's say December 31st, 2016, is when the plans will be due. And for certain facilities like marijuana facilities where we've done inspections in the past, we've been tabulating as we've gone along, how many facilities have some kind of odor control?'",
        "'speaker_10': 'And it's about 55% of the 250 to 275 facilities we've inspected have odor control. So for those, they will likely submit a plan. They were either already operating or they will be operating when they submit that plan. And it is just assumed they will be continuing to operate and maintain.'",
        "'speaker_10': 'And we will capture that and track that as part of our inspection process that we do each year for facilities that do not have odor controls. They will submit a plan saying laying out, here's our plan, here's our schedule, here's any challenges we have.'",
        "'speaker_10': 'Maybe from a budgeting and procurement and installation standpoint, we will review all the plans that are submitted within our department and then approve them. And so there can be certain situations where somebody is really running into some logistical issues and we'll be kind of use our discretion to really work with them to make sure that it's implemented'",
        "'speaker_10': '. I would say if we were how to pick a target date, everything will be implemented pending, maybe a few really complicated facilities by July 1st of 2017.'",
        "'speaker_9': 'And I appreciate that explanation. I think that some community members have, you know, heard this is the law won't go into effect until July 1st, 2017. Nothing will be done until July 417. And what I hear you saying is that action will have to have been taken probably by the end of this year or early next year'",
        "'speaker_9': '. Progress will have to be happening. And this is the furthest out date for some of those more complicated industries. So action will certainly be occurring before then. Exactly. And I think that's important for our community to understand. Thank you very much.'",
        "'speaker_9': 'No further.'",
        "'speaker_4': 'Questions. Welcome.'",
        "'speaker_1': 'Thank you. Councilman Leach, any other questions or comments? Two, five, seven CNN Maps. Let's go to the next 1 to 91. Councilwoman Ortega, what would you like for us to do with this?'",
        "'speaker_6': 'I'd like to ask for a vote on this, please.'",
        "'speaker_1': 'Certainly. Councilman, can you make the motions for us tonight?'",
        "'speaker_9': 'Yes, Mr. President.'",
        "'speaker_1': 'Will you please put to 91 that's as amended, I believe, on the floor? No, to 91 on the floor for final consideration and do pass.'",
        "'speaker_9': 'Yes, Mr. President. Thank you. I move that council bill 291, as amended, be placed upon final consideration and do pass.'",
        "'speaker_1': 'Is been moved. We need a second council. Thank you. Moved and seconded. Comments. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I'm sorry I was not able to be here last week for some of the additional amendments that were brought forward. And I certainly appreciate efforts to further to make further changes to the ordinance that work to address some of the impacts to the neighborhoods.'",
        "'speaker_6': 'I think there's been a lot of good work that's been done on the part of the committee with input from both industry and neighborhoods. I know Councilwoman Kennedy took the lead in trying to compile comments and input from everybody.'",
        "'speaker_6': 'I am just really. I don't know, frustrated, disappointed that we were not able to address any of the pending applications. And when you look at how many of those pending applications are nonconforming users, it's it's concerning. And we're allowing the pending to continue to go into neighborhoods that are already saturated.'",
        "'speaker_6': 'And when we started this conversation about trying to move an ordinance forward and out of committee, it was to deal with the issue of saturation, because we had been told that what? Is being produced by the industry today is already meeting the market demands and we had heard there were some pending applications.'",
        "'speaker_6': 'I started asking some questions about how many, where were they? And, you know, we have since gotten a complete list and we have maps. And there the majority of them are going back into the saturated neighborhoods. And the people who live in those communities came to these meetings over and over and over asking for some relief.'",
        "'speaker_6': 'Yes, the odor ordinance will help to some degree. That doesn't deal with the image and the stigma that these neighborhoods have of being, you know, the target areas for where many of the grow facilities are. I think we have a lot of very responsible operators in this city, and I certainly appreciate their participation in this process with'",
        "'speaker_6': 'us. I think most of the people who have been coming to the meetings are the folks who are committed to following the rules. We know we've had some who, you know, our excise and licensed department and our police department have had to, you know, kind of rein them in to some some degree where they're not following the'",
        "'speaker_6': 'rules, but the saturation and the impact to these low income and minority neighborhoods is what I think. We have not done a good job in trying to grapple with, particularly as we're putting more facilities and more licenses into their neighborhoods.'",
        "'speaker_6': 'So for those reasons, I, you know, again, appreciate the efforts of everyone, but I will not be supporting the ordinance tonight because I don't think we really did anything to address the impact. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilwoman Black.'",
        "'speaker_8': 'You, Mr. President, I commend Councilwoman Kennish on her persevering, perseverance and willingness to compromise and incorporate other priorities. I think she did address the saturated communities and the information we got last week. Councilwoman Ortega shows that there is one pending application going into Globeville and two into Elyria Swansea.'",
        "'speaker_8': 'So it's not an overwhelming number. I think Councilwoman Canisius proposal is not perfect, but it's a compromise and it greatly restricts the industry protecting neighborhoods in the future. And it requires community engagement. The omnibus omnibus bill requires needs and desires.'",
        "'speaker_8': 'We've got a new odor ordinance that will be implemented next year and it establishes a procedure for complaints. We're going to greatly limit where they can go in the future and capping the number. But I think it's very important that we also honor those businesses that followed the rules that the city established when applying for their licenses'",
        "'speaker_8': 'before the end of the year. As a council, we are committed to monitoring this industry and looking forward in the future to having a council committee that will address future issues. None of us have taken this conversation lightly.'",
        "'speaker_8': 'It's not perfect again, but I think it's a really good compromise. I also want to thank Ashley Kilroy and her amazing team and Stacey Locks and her amazing team who really answered all of our demands. And we really appreciate that.'",
        "'speaker_8': 'So thank you, everyone. And I will be supporting it.'",
        "'speaker_1': 'Thank you, Councilwoman Black. Councilwoman Canete.'",
        "'speaker_9': 'Thank you, Mr. President. I could not improve upon the summary that my colleague, Councilwoman Black, just gave of the bill. In the ways that it does reduce impacts to saturated neighborhoods, particularly the distancing requirements from residential areas, was in direct response to testimony about proximity of cultivation to residential areas.'",
        "'speaker_9': 'I think there's good news and there's bad news in the fact that this is only the next chapter of marijuana policy. It is not the last. So if you don't like this bill and you wish that different things were happening, then perhaps it's good news that that it's not the last chapter.'",
        "'speaker_9': 'If you believe that there are some really important priorities of this city that we can and should be spending an equal number of meetings and in equal amount of time on. And perhaps you think it might be good that we're closing this chapter for now and it's bad news that it's not going to be closed forever.'",
        "'speaker_9': 'But whether it's good news or bad news, it is just the next chapter. And what I've learned from my time, both serving on this council for five years and observing it in the ten prior, is that is that these chapters tend to be short.'",
        "'speaker_9': 'One of the things we don't probably acknowledge enough up here on the dais is how much the market impacts and creates some of the conditions that we are doing our best to intervene with. We have no idea what the technological evolutions will be, what the market changes will be, what the state has to bring.'",
        "'speaker_9': 'And so we will certainly be dealing with forces beyond just this council, and we will do our best to continue to try to respond to mitigate them in the ways that we have in this bill with distancing requirements and other pieces.'",
        "'speaker_9': 'I will say that I have more emails right now and I went back, if you count one per party, one per person. I have more emails opposing this bill from the industry than I do from residents. Okay. That is because of the fact that 60% of the spaces that are currently being used for cultivation will no longer'",
        "'speaker_9': 'be available in the future. People are concerned that they won't be able to move. You know, they're skeptical that there will ever be a potential for new businesses to come in. And we've dialed down cultivation by 15. We've put a stop to all new medical.'",
        "'speaker_9': 'These are big limitations. And I think that the the actors who know the industry the best actually have expressed the greatest number of concerns, maybe not as vocal and visible as the communities, but I think that's telling. I think that's telling in terms of the fact that there are real impacts from this bill.'",
        "'speaker_9': 'I absolutely respect my colleague and I and I really respect the constituents who feel like it's not enough. And for you, the fact that this is only the next chapter is important. We will continue the conversation regarding resources.'",
        "'speaker_9': 'We don't have a lot of visibility of how marijuana resources are improving our city. They're in our budget, they're making things possible. But we could put more light on that. And I stand with my colleague, Councilman Brooks, in his multiple calls from this day as for greater responsibility from the industry, greater engagement with your communities, greater investment'",
        "'speaker_9': 'in their improvements, and greater connection to them as good neighbors. The owner odor ordinance is just one piece, and although that was the most prominent piece that folks brought up in the beginning, once we solved that, other pieces emerged.'",
        "'speaker_9': 'That's human nature. You solve one thing and you move on to the next. And so they have a high bar to meet to be like other industries, right? If that's the goal is to be on par with other industries, then they need to be making the kinds of contributions and positive efforts that other industries are making.'",
        "'speaker_9': 'I want to do one last thank you, not just to the staff on the data production and the charts and the updated information, but to the drafter. Our assistant city attorney David Broadwell and last week to Mali because this is the most amended bill I've worked on in my time in council.'",
        "'speaker_9': 'Five amendments proved that it was a collaborative process. So I want to thank for those who who cannot support the bill tonight, but who see that there is some progress in here. I thank you for those acknowledgments when you make them.'",
        "'speaker_9': 'And I hope that we will get to seven tonight so we can move on to the next chapter and to move on to the other problems the city is facing. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Kenney. Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. Just to reflect on some of the remarks already made, but not to compound them, I would note that from the original bill, all of those amendments and all of those changes moved only in the direction that the residents in the neighborhoods were seeking.'",
        "'speaker_5': 'Now, surely there will be many in the neighborhoods who say that could have gone further than that. But I have to say that with the amendments that were approved that were offered by Councilwoman Ortega on first and by Councilwoman Gilmore and by Councilman Espinosa and also.'",
        "'speaker_5': 'So the ratchet down that councilwoman commissioned, I worked out, I would have to say to the residents in in Overland and Hearth, Ma and Valverde and Globeville, Swansea, Elyria, that this bill has only changed in your direction and would that it could have gone further for you.'",
        "'speaker_5': 'But we have what we have now for a final vote. And thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Councilman Espinosa.'",
        "'speaker_4': 'Yeah. Just sort of re articulate what I was mentioning last time, which was throughout this process, we heard a lot of public comments from constituents and people who live in those overly saturated neighborhoods. And what capping I mean, what denying the pending would wouldn't do is change those existing businesses and how the impact that they have good'",
        "'speaker_4': 'or bad in their communities. And I'm I'm going to be supporting this because we did incorporate the community outreach plan requirement. It's a licensing requirement that that creates an opportunity for dialog and to improve the outcomes on those businesses and those over particularly in those overly saturated areas.'",
        "'speaker_4': 'Because the more businesses you have, the more of these plans you'll have in place and the more potential there is to to capture some positive outcomes. And so I want to so I want to thank everybody that worked on that, because it was people from both sides making their case, stating what their needs were, stating what needed'",
        "'speaker_4': 'to be addressed, and creating this avenue for the potential. Those things can be so. The concerns that every community that is impacted by a business like this can actually have a chance to sort of articulate a possible better way forward is now in there.'",
        "'speaker_4': 'It's admittedly amorphous, but it's probably the right way to to to do this in a very granular way and address the impacts for each one of these operations in the immediate location that they're at. And I think the industry Kristen, Cedarburg, MiG, I think members of focus points, a lot of the residents who are articulated from Globeville'",
        "'speaker_4': ', Swansea, Elyria who articulated their concerns because that's that testimony is going to be the road map for what are the potential solutions, what are the needs of these communities and how can they be met. Had to do does go back to those hours of testimony and go, what can we do to help address these things?'",
        "'speaker_4': 'So I'm going to be supporting this bill because thank you, Councilwoman Kennish, for listening to these amendments and incorporating them as appropriate. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilman Lopez.'",
        "'speaker_10': 'Thank you, Mr. President. I appreciate a lot of the work that's been done, particularly from from your office and then also from excise in license. I appreciate the different input that the representatives from the industry have had in this whole process, and I extremely appreciate Councilwoman CNOOC's work.'",
        "'speaker_10': 'To try to find a better solution than the moratorium. In this caps. And it's true there are steps in the right direction. There are, you know, the the distance from. A thousand foot distance from residential foreclosure. That's an important thing.'",
        "'speaker_10': 'And I do honor and respect that movement. I do honor and respect that, including inclusivity of that. However, I think. When I think of Mary Ann Swans here, and I do think of Globeville, I think of some neighborhoods like Val Verde, and there are some of those neighborhoods that are on that list.'",
        "'speaker_10': 'And there are a lot of neighborhoods that are on that list that, you know, folks are either fine with it or that we just didn't get any response from from those neighborhoods, particularly those neighborhoods in the north, particularly Elyria and Swansea.'",
        "'speaker_10': 'We did have residents that had said enough was enough over here when you look at. Where these licenses are in a vast majority of them over land O'Leary and swans here and again overland folks would weren't opposed to it but you know Larry and swans here, they came out in full force.'",
        "'speaker_10': 'You were not happy about yet another issue in their community that they feel doesn't allow them to move forward. And I think of these neighborhoods and not just for this particular issue. And certainly not a cause and effect.'",
        "'speaker_10': 'But historically, these neighborhoods have always been struggling. They're struggling for the city to correct bad decisions, the highway going through it. The pollution. The fact that there's still a food desert after 30 years of trying not to be a food desert.'",
        "'speaker_10': 'There are areas that the city has neglected. And they continue to. You know, now we have identified that neglect and have identified that opportunity to correct it and head the other direction. It. We can't cherry pick it. And I know that there are other neighborhoods that ranked higher in terms of licenses.'",
        "'speaker_10': 'And you're asking, what is a person on the west side? These neighborhoods are far from it. Care about that? Well, because there are sister neighborhoods that have very similar challenges. And we need folks who aren't necessarily living in those neighborhoods or drive through those neighborhoods every single day to listen and take action.'",
        "'speaker_10': 'Yes, there are only maybe three licenses. Right. But that's on top of a multitude and the majority and those neighborhoods combined in the city. And we made those points. And this has nothing to do with Councilwoman Canete, his work.'",
        "'speaker_10': 'But when I made those points during our public hearing, there was a lot of sneering and snickering and laughing. And that turned me off. And it's not just that, but as a city, we really want to improve this corridor.'",
        "'speaker_10': 'We've got to do it across the board. And we got to do it in a way that's serious. And what is the cultivation and some of these license do? What is it got to do with it? Well, these are areas that struggle physically for the infrastructure, but also socially and education.'",
        "'speaker_10': 'Some of these schools underperform. And some of these parents. And it wasn't something about some things that just about the history of marijuana or nothing like that. There there needs to be other outlets and other focuses and other uses in these communities.'",
        "'speaker_10': 'And an overabundance of marijuana, both in production and in sales, in licenses doesn't take us into that, doesn't take us in this step in the right direction and has nothing to do with some kind of scare of marijuana.'",
        "'speaker_10': 'It's just an.'",
        "'speaker_4': 'Overabundance and a lack of other uses.'",
        "'speaker_10': 'And that's why I'm basing my vote tonight. I'm not going to support the bill, not because it doesn't address it, just there. There needs to be a focus on that. And I know Councilwoman Cannings took that into account very seriously.'",
        "'speaker_10': 'But just for my own decision, I think that we should do more. And, you know, I would have loved to see those two neighborhoods, at least Elyria, Swansea incorporated into it in that those three licenses. Those pending licenses not be allowed to move forward in that neighborhood to give it a good step in the right direction.'",
        "'speaker_10': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Councilman Cashman.'",
        "'speaker_7': 'Thank you, Mr. President. I have total respect for my colleagues on the dais who will vote against this bill this evening. I understand that point of view. I will be supporting this bill. Everybody I don't know anyone on council who has not been thinking of Globeville, Elyria and Swansea and the other areas heavily impacted by this industry'",
        "'speaker_7': '. There are complex issues involved. We look at at times incomplete and contradictory data as we try to make our decisions. I felt it was important for the licenses to go through. We've never. Stopped. An industry of pending licenses before when there are people following the rules.'",
        "'speaker_7': 'Thousands, millions of dollars invested. I understand this is marijuana, but so what if we have a developer who's bought land, started building a ten story building and he gets two floors out of the ground and we decide, you know what?'",
        "'speaker_7': 'We've just got too many people. The roads are getting too crowded. We just don't want to put any more pressure on our infrastructure. So we're not going to give you a permit to continue. I don't think we can go down that road.'",
        "'speaker_7': 'This bill, I mean, has for me is an amazing bill. We are capping locations for stores and grows the bill caps the locations at 469. It's a lot. As of a couple of weeks ago, there were 2193 places in the city and county of Denver to buy alcohol.'",
        "'speaker_7': 'We continue to license them at an average of about seven a month. There are some locations I know my colleague, Councilman Lopez, has had success in fighting some licenses, but most neighborhoods just wave them on, bring them on, bring them on.'",
        "'speaker_7': 'It's a different discussion, perhaps at one level, but at the one level, it's I think at the heart of what we're talking about, which is public health. And I think we need to really have a discussion as to what we're doing here.'",
        "'speaker_7': 'How do we really protect the public health? Councilwoman Cannick said this is not the end of this discussion. There's a lot more work to be done. I've asked recently for a listing of where our marijuana tax dollars are going and it's not available.'",
        "'speaker_7': 'There are general figures of this percentage going to this industry, but I've asked city staff to begin putting that together. So, I mean, I hear there's $40 million going to school construction and there's a certain amount of money going to offset to mitigate the impacts of legalization.'",
        "'speaker_7': 'But where that's going? There's not a book that you can go line by line and add up and come up with your total dollars. This is an ongoing discussion. A lot more work to be done. I will support this bill this evening.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Cashman. Councilwoman Gilmore.'",
        "'speaker_6': 'Thank you, Mr. President. I wanted to clarify regarding the amendment that I proposed and is now included in this bill, which included a conversation about the the top five statistical neighborhoods for both cultivation facilities and stores, and to really stay data driven and to stay objective about how we are regulating this industry, the statistical neighborhood lists, and'",
        "'speaker_6': 'how they are generated. They were provided by the Office of Marijuana Policy. And so they're not subjective lists. They are not cherry picked lists. They are lists that are driven by data and it's numerical data. And so I just wanted to make that clarification on how the neighborhoods are chosen and the list of neighborhoods that was the'",
        "'speaker_6': 'list of neighborhoods that were, you know, when councilman, clerk, when in my absence, the list of neighborhoods that he listed out for us and shared those neighborhoods can change with the 2017 lottery. And so they are not set in stone, they are objective, and they are based on data.'",
        "'speaker_6': 'This is a starting point for a much broader and deeper conversation about zoning, about quality of life, about environmental concerns in our neighborhoods. I have to be honest. You know, I heard loud and clear from Globeville, Elyria, Swansea.'",
        "'speaker_6': 'I also heard loud and clear from the Monticello community, the warehouse district that is zoned high density industrial warehouse. I don't represent that district. That portion of Montebello is a responsibility of my colleague, President Herndon, but it's still my community.'",
        "'speaker_6': 'And so weighing the different options of where industry is going to relocate or locate in communities, I have to applaud my colleagues for having a very robust conversation that was down to the nitty gritty of what this will do as far as, you know, intended and unintended consequences for neighborhoods.'",
        "'speaker_6': 'And so I felt important to share that. And today I also sat down with with folks from Denver Public Schools to talk with them about how they are paying attention to their call for new schools, especially charter schools, who are responsible a lot of times for securing their own building.'",
        "'speaker_6': 'And what is that communication plan between Denver Public Schools Excise and Licensing and the Office of Marijuana Policy so that everybody is going in with their eyes wide open as far as a charter school, a new school, locating into a neighborhood and are so excited about doing their work within the community.'",
        "'speaker_6': 'But they might be looking at a space that is very. Close to an existing cultivation facility or and I know that the stores those stores are covered. But, you know, having that back and forth communication, I think, is very important and and really, frankly surprised that it's not as robust as I think that it could be.'",
        "'speaker_6': 'But this is an opportunity for us to move forward. And so I just wanted to, again, reiterate that this is a starting point for a much broader conversation. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilman Brooks.'",
        "'speaker_4': 'Check. Check. Thank you. Thank you, Mr. President, I. I just wanted to just make a couple of comments. You know, I think we're all tired of talking about this for weeks upon weeks. But this is this is an important decision that we're making tonight.'",
        "'speaker_4': 'So I just wanted to make a couple more comments and thank my colleagues all for working really hard on a very complex topic. I don't know if I've been on the know end of something so much than this, but, you know, for me, I think 63 stores in Global or Swansea, 63 locations is a lot.'",
        "'speaker_4': 'And I think that's one of the reasons why you saw a lot of those folks come out. Even in Cole and Clayton as well. And so I you know, I've said this before, Councilwoman, can each in the bill gets to a lot of the issues and it's the residents.'",
        "'speaker_4': 'The thousand foot requirement to the residents in these facilities really hit my issue with the the pending applications even even if it's three four on my list. That puts us at 67 is still an incredible impact to a neighborhood.'",
        "'speaker_4': 'And so I'll be voting no on this. I want to make it clear point right now to my colleagues that on some of these bills, Councilwoman Canete, you know this the H, the H0 revisions, the camping ordinance, all these bills that we've done in the past, some of us made a commitment to say, you know what, this'",
        "'speaker_4': 'isn't the end of the story. We're going to keep working hard on this. And I really hope that my colleagues commit to that because I'm turning my attention to the budget. We're heading into budget season. And, you know, I really think that these communities, if this is what we're going to say, you know, we're going to vote'",
        "'speaker_4': 'in this direction. I think these communities deserve a piece of the revenue that's coming in to improve sidewalks, to improve bus stops and improve some of these things. And so I hope that I can have the support of these colleagues in here to find out a funding mechanism to make sure that this neighborhood gets the quality, design'",
        "'speaker_4': 'and basic infrastructure needs that it deserves. I'll be voting no. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks, any other comments to 91 as amended? I will chime in briefly. I will just say this bill, in my opinion, fails communities and the worst part about it. It fails the communities that are some of the most disenfranchized and neglected communities that we have here in Denver.'",
        "'speaker_1': 'When we passed these rules a couple of years ago, when I was part of that, and it was very difficult to see what was going to happen. But now two years have passed and we've seen the effects of it.'",
        "'speaker_1': 'And we're going to pass some laws, in my opinion, that will continue to move us in the wrong direction. And I recognize the steps that council members have taken to amend this bill. But simply because we've taken steps towards the right direction does not make the bill right.'",
        "'speaker_1': 'And I'm glad Councilwoman Gilmore brought up Mom Bella, because we keep hearing about Globeville. Swansea, which is certainly a community that has an overabundance, but so does Mom Bello. So does Northeast Park. And it is just troublesome to me that we're going to continue to pass legislation that impacts that.'",
        "'speaker_4': 'And the.'",
        "'speaker_1': 'What I think from the long view is that there should be concerns from this body about when any industry is overwhelming a particular portion of our limited industrial area, because when you have that one industry dominate, what you're creating is a bubble.'",
        "'speaker_1': 'And bubbles burst. And what type of status or position are we going to be in as a city should that happen? And I think that is something that we have the ability to prevent. But unfortunately, I can't support this bill for those following reasons.'",
        "'speaker_4': 'Councilman Espinosa Yeah, it's almost a point of privilege, but. To term communities. And I think it relates specifically to Greece Globeville, Swansea, Elyria, early swans here to term it Disenfranchized is sort of it strikes me because this is a proud community, one that wasn't disenfranchized when it was conceived and it was a meatpacking community, an Orthodox European'",
        "'speaker_4': 'community, and it thrived and it there still persist a very strong, healthy community there. The reason why it's gotten stigmatized and depressed is what happened in 1956 in the construction of I-70. So I'm just going to they're going there because it matters.'",
        "'speaker_4': 'We're going to widen. There's this effort to widen I-70, and we put $1,000,000,000 investment in the stock show. We're putting $2 billion in this in this highway and this disenfranchisement that has occurred there. The reason why this property has declined and it's been an opening for this is because we severed that community with that highway.'",
        "'speaker_4': 'And so it was it was a strong community. And with the bones are there and it's always been an industrial community. And so I'm the reason why I was supporting the bill and wrote the language that I did is that industry doesn't have to be detrimental.'",
        "'speaker_4': 'The industry can be community builder. It worked where I grew up in Golden with the Cougars industry, but the reason why this area struggled is because what we an error we made some 50 years ago. And so I just had to say that things.'",
        "'speaker_1': 'In other comments to 91 as amended. Seen none. Madam Secretary, welcome.'",
        "'speaker_3': 'Black. Hi, Brooks. No, Clark.'",
        "'speaker_7': 'All right.'",
        "'speaker_3': 'Espinosa. Flynn. Gilmore. I Cashman. I can eat Lopez. No new Ortega?'",
        "'speaker_6': 'No.'",
        "'speaker_3': 'Mr. President?'",
        "'speaker_1': 'No. Madam Secretary, please thoughtfully announce the results.'",
        "'speaker_3': 'Seven eyes, five NIS.'",
        "'speaker_1': 'Five NIS, 291, as amended, has been placed on final consideration and does pass. Customer continued your chimed in there. Is that okay? All right, let's go. The next one, Madam Secretary. 293 Councilman Black, would you like for us to do this?'",
        "'speaker_8': 'Thank you, Mr. President. I'm calling this out for a separate vote. This bill states that it would only go into effect if 291 failed, which it did not. But we need to vote it down. It would have extended the moratorium for another 30 days.'",
        "'speaker_1': 'Got it. Councilwoman, can we please put it to 93 on the floor for final consideration and do pass?'",
        "'speaker_9': 'Thank you, Mr. President. I move that council bill 293 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. Any other comments, Councilman Black?'",
        "'speaker_8': 'No, thank you.'",
        "'speaker_1': 'All right. See no other comments to 93. Madam Secretary, roll call.'",
        "'speaker_3': 'Black eye. Brooks.'",
        "'speaker_8': 'No. Sorry. No, no. Black.'",
        "'speaker_3': 'Black.'",
        "'speaker_8': 'Example? No.'",
        "'speaker_3': 'No.'",
        "'speaker_4': 'No.'",
        "'speaker_3': 'Brooks.'",
        "'speaker_4': 'No.'",
        "'speaker_3': 'CLARK.'",
        "'speaker_10': 'No.'",
        "'speaker_3': 'Espinosa No.'",
        "'speaker_5': 'Flynn No.'",
        "'speaker_3': 'Gilmore No.'",
        "'speaker_7': 'No.'",
        "'speaker_9': 'Carnage no.'",
        "'speaker_3': 'Lopez No. New? No. Ortega No. Mr. President. No.'",
        "'speaker_1': 'Manchester police closed voting as a result.'",
        "'speaker_3': 'Zero I's 12 inches their eyes.'",
        "'speaker_1': '12 News to 93 has failed. I believe that was it, Madam Secretary. So we are now ready for the block votes. All of the bills for introduction are order published. Councilman, can we please put the resolutions on the floor for adoption in a block, please?'"
    ],
    "Approves a text amendment to the Denver Zoning Code to amend the provisions of the Airport Influence Overlay (AIO) District to allow multi-unit residential uses between 62nd & 64th Avenues in the AIO District and to make related conforming amendments. (NEIGHBORHOODS AND PLANNING) Approves a text amendment to the Denver Zoning Code to amend the provisions of the Airport Influence Overlay (AIO) District to allow multi-unit residential uses between 62nd & 64th Avenues in the AIO District and to make related conforming amendments. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 3-16-16.": [
        "'speaker_4': 'The proposal maintains the navigation easement requirement. The text amendment also cross-references some requirements that lie outside of zoning, and those are listed here. They include an amendment to Chapter five of the Denver Revised Municipal Code regarding noise disclosure at the time of sale and building code amendments to require the use of noise mitigation construction techniques which were'",
        "'speaker_4': 'just approved in the block vote prior to recess. Our review criteria requires consistency with adopted plans, which I'll talk about now, beginning with comprehensive plan 2000. The plan guides us to conserve land by reducing sprawl and creating more density at transit nodes, encouraging mixed use, transit oriented development and encouraging land use policies, or excuse me, ensuring that'",
        "'speaker_4': 'land use policies and decisions support a variety of mobility choices. The proposed tax amendment is consistent with this guidance from comp plan 2000. Moving on to Blueprint Denver. The map here is zoomed into the area between 56th and 64th avenues.'",
        "'speaker_4': 'The area where the A0 text amendment would add multifamily is shown between the two dash lines. Blueprint. Denver was updated for consistency with the 61st and pinion stationary plan and calls for a combination of mixed use open space, commercial corridor and transit oriented development in this area north of 64th, where the amended overlay would continue to prohibit'",
        "'speaker_4': 'all residential. The land use is employment and south of 56 where the overlay does not apply. The land use of single family, residential and mixed use. Blueprint. Denver identifies the entire AOE area as an area of change and provides some guidance on how overlay districts should be used, stating that overlays can apply to areas where there are'",
        "'speaker_4': 'similar objectives, but where the base zoning varies, which is consistent with the situation that we have here. And the finding is consistency with Blueprint Denver. Moving on to the 61st and Pioneer Station area plan. That plan has recommendations to support transit use by generally allowing for a mixture of uses as well as higher density housing.'",
        "'speaker_4': 'At the Neighborhoods and Planning Committee. The question was raised regarding whether the text amendment is consistent with the 61st and Panya stationary plan, given that it would continue to prohibit single family dwellings. The plan does have some language that accommodates single family units.'",
        "'speaker_4': 'But the plan stops short of specifically recommending a single unit residential as a land use. The plan allows for single unit residential only in the area identified as mixed use residential, which is highlighted in the circle here and is outside of the area that would be substantively affected by the amendment, which is highlighted by the dashed area'",
        "'speaker_4': 'here. But the intent of the mixed use residential category can be met with or without, including single unit residential uses. Since that land use category calls simply for a variety and mix of residential types. So wrapping up the guidance here from the 61st in Kenya stationery plan, the plan further states that strong transit ridership is tied to'",
        "'speaker_4': 'minimum residential densities of 30 units per acre or more and encourages a diversity of housing sizes, types, unit sizes and configurations. And the finding is that the proposed amendment is consistent with this plan. Finally the Gateway Concept Plan from 1919.'",
        "'speaker_4': 'The in the interest of ensuring that the Gateway area would be a quiet place to live. The 1990 plan calls for no residential development north of 65th Ave, stating that that area should be reserved for business and commercial uses.'",
        "'speaker_4': 'The Gateway Plan notes the serious problems in the past that were caused by the noise at the old Stapleton Airport and uses this as further justification for prohibiting residential north of 65th. The text amendment is consistent with this guidance because it would allow residential users only up to 64th.'",
        "'speaker_4': 'So that covers the plan consistency criteria in number one, moving on to criteria and number two, uniformity. The text amendment will result in uniform regulations that apply to all new development within the airport influence overlay area. And on the third criteria, health, safety and welfare.'",
        "'speaker_4': 'The proposal implements adopted plans by enabling multi-unit residential while maintaining reasonable limitations that protect current and future airport operations. And so the finding is consistency with numbers two and three as well. Planning Board held its hearing on this matter on March 2nd and recommended approval.'",
        "'speaker_4': 'And so wrapping up the staff recommendation is that the Denver Zoning Code Text Amendment number seven be approved finding that the applicable criteria have been met.'",
        "'speaker_1': 'Thank you, Mr. Houser. We have one speaker tonight, Mr. Ferd Belz.'",
        "'speaker_10': 'Good evening for Dallas, 1125 17th Street in Denver and come with LC and writer ink and we own about 150 of the 384 acres in the Penn Station area. I'm here asking for your support this evening. It's really consistent with the station area plan and the vision to make this a true mixed use development.'",
        "'speaker_10': 'It was actually kind of an oddity that residential is only allowed up to 62nd because the vision is for the whole 384 acres all the way up to 64th to be mixed use. And that's our plan. And we're moving forward with that.'",
        "'speaker_10': 'And with the approval of this this evening, we will be also coming to rezone our site in the not too distant future to the new zoning code so we can take full advantage of it. So again, just ask for your support and I'm here to answer any questions if you have any later.'",
        "'speaker_10': 'Thanks.'",
        "'speaker_1': 'Thank you, Mr. Valens. That concludes our speakers. Time for questions from members of council. Councilwoman Ortega.'",
        "'speaker_6': 'First, will you come back to the microphone? I have a couple of questions. So the first one is how many additional acres does this put into the site for, including more residential?'",
        "'speaker_10': 'It put approximately 40 acres on a gross basis and probably about 32 on a net when you take out roads and some of the other public areas.'",
        "'speaker_6': 'Okay. And why do we need 40 more acres when we already have 300 plus that can be developed?'",
        "'speaker_10': 'It's an interesting development in terms of what's envisioned. Really what's envisioned is a complete mix of uses. So as you get farther away from the station, we felt it was important to continue to have residential so that we can provide a variety of housing, whether higher density close to the station and probably less dense away from the'",
        "'speaker_10': 'station. So it can be a mix of those types of housing.'",
        "'speaker_6': 'So earlier reference was made of the 1990 noise plan that would you know, in all of the negotiations, I think I'm the only one around that was. That was here when we actually approved the annexation of Adams County land to be used for DIA.'",
        "'speaker_6': 'I think Councilman Flynn, maybe. I don't know what that was from. So in his role as a reporter, I think he may be familiar with some of this as well. But clearly, 56th Avenue was that dividing line. And we were asked some time ago to approve extending that to 62nd to allow for, you know, the inclusion of'",
        "'speaker_6': 'more acres, to allow the development of more residential. So that's I'm struggling with why we need an additional 40 acres when we've already added and penetrated into the noise contour because it's my recollection that it originally was 75 was the noise contour.'",
        "'speaker_6': 'And this is the second time we will have encroached into that area where we drew that line saying we're not going to be putting people in a situation where they're going to have to deal with the noise from planes.'",
        "'speaker_6': 'And, you know, I mean, the big difference is if you're a single family, you get to sue the city. But I guess if you're multifamily, it's it's a little bit different. And so help me understand why why the need is there to do that.'",
        "'speaker_6': 'I'm struggling with that.'",
        "'speaker_10': 'So I can't speak to the noise contours. My understanding is that the defining noise contours actually 60 and were actually it is north of this 64th I think the gateway plan spoke to a 65th Street or avenue divider that I think was driven by the noise contours.'",
        "'speaker_10': 'I think there are people are from the airport that could speak more directly to the specificity of the noise contour. However, I think the other distinction is. We have a real stop. And so there has been change conditions since 1990.'",
        "'speaker_10': 'And I think some of the vision for the city and their policies about putting housing and density and mixed use around real stops is really what drove our station area plan. And I think we're really driving this to make residential an opportunity to be mixed use throughout the entire development.'",
        "'speaker_6': 'So other than Stapleton, this is probably the only one that has this amount of acres. I don't remember how many acres there are. Stapleton. Maybe, councilman. And how much?'",
        "'speaker_10': 'Tens of thousands.'",
        "'speaker_6': 'Okay. So so it's even more than stable in totality. And that's a pretty massive development that we've been able to see built out over a course of time. So I guess just understanding the history and having been here and knowing how.'",
        "'speaker_6': 'I mean, part of why we moved the airport was because we were getting sued by Adams County and Parkview because of noise issues. And, you know, we were trying to address the noise problem. And, you know, we went to a site that was so far away that we weren't going to be building any housing within, you know'",
        "'speaker_6': ', a certain area. And we've already encroached into that once before. So we're doing that again. And I'm just struggling with that. So I'm just trying to, you know, bring some history to the table here. So thank you for sure.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. George, I hate to put you on the hot seat again, but I don't see anyone else here from the airport who can handle this. Or maybe Cortland could answer this. But during the development of this overlay, did the planning office or the airport take into account where the current noise contours are and where'",
        "'speaker_5': 'the future ones will be? I'm looking at two maps. The current noise contours from the 2013 noise report. But that, of course, only includes the runway 25 departure. And there's going to be a second runway there south of Pioneer Boulevard.'",
        "'speaker_5': 'So we need to take into account that one. So did we look at those 60 and 65 LDN contours?'",
        "'speaker_7': 'Yes. So and forgive me, I'm going to speak zoning, which is always dangerous for me. But the current conditions on this property are were were with the multifamily to 62nd and single family to 56 were were came about after a 99 1999 noise study that was done.'",
        "'speaker_7': 'And then in 2000, this area was was zoned when the city went through the zoning code update that we this this area was sort of set aside as an as the airport overlay. And so the the that those conditions still existed.'",
        "'speaker_7': 'But you have to rezone in to to if you want to build. So the those current conditions were based on a 1999 NOI study that we did. There was a second noise study that the airport did in 2004 that showed had some different assumptions in the study and showed the noise contours further north and that there were'",
        "'speaker_7': 'some zoning done in the city around High Point and other places that were based on that noise study that if you if you look on our website, that's the current noise study that I think you're looking at. I would say to, you know, to specifically answer your question to Councilwoman Ortega's point, we get nervous any time we'",
        "'speaker_7': 'start to get housing moving towards the airport. That's what we worked closely with, with this applicant and and with planning and and pushed for this mitigation effort on building codes to to strengthen that. And this is only multifamily with an eye towards you know we as single family housing tend to be outside more it's a little more'",
        "'speaker_7': 'subject to noise issues. And so they were more sensitive then. But certainly we're cognizant of those issues. We push for the building code mitigation to mitigate some of that noise, those noise issues as well.'",
        "'speaker_5': 'All right, thank you, Cortland. You have anything to add to that?'",
        "'speaker_10': 'No, I think that was a.'",
        "'speaker_4': 'Pretty accurate summary as to the situation. Did you have remaining questions.'",
        "'speaker_5': 'Only to observe that the that the land I'm looking at the the recommended noise contours and the 65 LDN contour actually ends significantly east of Tower Road and is north is about 70th Avenue. The 60 LDN doesn't extend farther south than about 69th Avenue.'",
        "'speaker_5': 'And I would note that north of 64th there already is excuse me, substantial commercial development already in place. So it's so if you are south of 64th Avenue, it does look like you are out of the both of the 60 and the 65 LDN contour.'",
        "'speaker_4': 'And that's how it appears that the map that I'm looking at as well. Okay.'",
        "'speaker_5': 'Thank you. That's all.'",
        "'speaker_1': 'Thank you, Councilman Flynn. Councilman Espinosa.'",
        "'speaker_4': 'Yeah. I wish I sort of understood how you get in a situation where you sue the city for living next to an airport. Must have been. We expanded Stapleton an odd ways or something, but here you are, very eyes wide open in this case where there's an airport there.'",
        "'speaker_4': 'And I don't know what we can do fundamentally to change the fact that people don't realize that they're moving here. That said, back when the airport was conceived and discussed and brought to life, I think there was some sort of notion that the future of travel would be sort of subsonic.'",
        "'speaker_4': 'I mean, supersonic and suborbital, you know, flights around halfway around the world, which I think sort of implied jet I rocket propelled travel and some of these like runways were deliberately long to sort of capture heavier planes with with burdened with these sort of equipment.'",
        "'speaker_4': 'Is there some some jettisoned idea about the future of DIA that would maybe would maybe result in a louder aircraft than what we are accustomed to and do will if we get there in the future? Are we opening ourselves up to the Stapleton scenario again?'",
        "'speaker_7': 'So let me take a couple of points on that. There there's a couple of distinctions I want to make about noise in airports. So it's at 65. That's actually the point where the FAA that's sort of the cliff that where the FAA, if there's a noise recorded above, above that the federal government actually comes in and will'",
        "'speaker_7': 'do mitigation on houses and actually start spending money. So we obviously want to stay very far away from that. And so we traditionally we've zoned at 60.'",
        "'speaker_4': 'Which is supersonic there.'",
        "'speaker_7': 'So there's a separate issue. To your point about the future, it's not so much louder aircraft. I think aircraft engines are getting quieter. But what we worry about is where from a runway standpoint, we are half built. We have six runways we want to go to for full buildout.'",
        "'speaker_7': 'And certainly we want to protect the asset that this community invested in less than a generation ago. And so we're certainly have have a mind to that. As we as we look toward encroachment right now, it is more about, you know, the risk of what what do you do as we go to do a study and a'",
        "'speaker_7': 'survey to build out our our runways? And we do that. Forgive me, environmental assessment. We have to go and knock on residences door at some point and say, you know, how do you feel about having a runway coming near you?'",
        "'speaker_7': 'And the the obvious answer to that is probably not that great. So we're we're very wary of encroachment. But again, on this particular issue, as you know, because this applicant has been cognizant of of of our concerns and worked with us, done some noise mitigation in the building, worked very hard.'",
        "'speaker_7': 'And we've worked very hard with Councilwoman Gilmore throughout this process. You know, they they are doing their best to recognize that.'",
        "'speaker_4': 'Is there some sort of covenant that we can have, you know, these buyers and future renters sort of to acknowledge that the D.R. is not at its full buildout.'",
        "'speaker_7': 'And that that's actually in there. So we've pushed for that as well. Great. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Espinosa. Councilwoman Gilmore.'",
        "'speaker_6': 'Mr. President. Thank you, Mr. President. Jill, could we have you join us up here from community planning and Development to talk a little bit about the building code and what will be required of anyone who builds within this area.'",
        "'speaker_6': 'And then maybe a little bit about the noise mitigation and the navigation agreements as well. Certainly. Thank you, Councilwoman Gilmore, Jill Jennings, Garlic Deputy Director, Community Planning and Development. So earlier tonight, you passed an amendment to our 2016 Denver Building and Fire Code to put a new section in called Aircraft Noise Reduction.'",
        "'speaker_6': 'And this requires, regardless of which, zoning code you're in, a new residential multi-unit dwelling or school educational use to be subject to these restrictions. If you're located within the airport influence overlay. And there are essentially two different methods which you can use to show compliance.'",
        "'speaker_6': 'The first being a prescriptive method, essentially a cookbook approach that says, here are the things you need to do in order to document compliance with this section. And we anticipate multi-unit dwellings will likely take that path. The second option is a method to which requires an acoustical professional to come on during the design process and provide various'",
        "'speaker_6': 'calculations and methods to document compliance with certain standards. We believe schools will take advantage of this, but some multi-unit dwellings may as well. We based these methods off what's in place in the city of Aurora. They've had construction noise mitigation requirements for well over ten years, and so we worked closely with Aurora, as well as with the'",
        "'speaker_6': 'airport and the property owners to develop these requirements. And I will note that with the passage of our 2015 Energy Code, some of the requirements may seem like they're a little low because with that new code, insulation requirements have gone up.'",
        "'speaker_6': 'But you can do trade offs within that energy code. So this guarantees a minimum level of requirements for insulation and windows to ensure that they're protecting against noise. And so that review will happen as projects come in for building permits.'",
        "'speaker_6': 'They'll have a customer will have to submit required plans and specifications to show compliance. And then in terms of the easement, I'll actually turn that over to airport staff.'",
        "'speaker_9': 'So we have evacuation easements built into this code provision that will essentially ask owners to waive claims for noise. At the airport, we also have a noise disclosure requirement. So any owners have to sign that. They acknowledge that they're next to an airport and there will be noise.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Gilmore. And the questions. 183. Seen none. Public hearings, not closed comments. Councilwoman Gilmore.'",
        "'speaker_6': 'Thank you, Mr. President. You know, I've lived in District 11 for about 20 years, and we have been waiting very, very patiently to see what was going to happen out around 61st and Pena and with the TOD and with the developments.'",
        "'speaker_6': 'And, you know, it's an exciting time in District 11 and currently we in Montebello in Green Valley Ranch, High Point in Parkfield do not have retail. I could not go buy a pair of shoes in my district. I could not buy a purse.'",
        "'speaker_6': 'I could not buy a jacket in District 11. And so really realizing the opportunity with a TOD Station, a transit oriented development station. Right in our neighborhood is transformational for the community. And we are literally right now talking about two blocks that would allow us to fully realize the TOD Station and have the density that would encourage'",
        "'speaker_6': 'the mix of retail that we need, the mix of entertainment opportunities, possibly a movie theater, sit down, restaurants, places where people could truly live, work and play close to home. And, you know, it's great right now living in Monticello, we go to Stapleton.'",
        "'speaker_6': 'Northfield. I love Stapleton Northfield. It's great. But we would also like that in District 11. We deserve the residents and my community that I represent. We deserve places that we can go right in our community and having it along a TOD station, a stop is even better.'",
        "'speaker_6': 'And you know, noise technology on aircraft are improving every day, folks that are going to move out to the area. It's no secret that DIA is the biggest economic engine of, you know, the state. And so, you know, folks are excited, actually, to be able to come a little bit closer to the airport.'",
        "'speaker_6': 'They're going to be at that Tod station. And when you really look at it, I was out there at the station party on Saturday and you can see those two blocks. I mean, we are talking about two blocks here.'",
        "'speaker_6': 'They would encourage multifamily development for us to truly realize this dream. And so I asked my colleagues to join myself in supporting this and really building a TOD station that we can be proud of. And that will be a model for not only this area, but the rest of the city.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilwoman Gilmore. Councilman Espinosa.'",
        "'speaker_4': 'Yeah. I want to thank Councilwoman Gilmore for bringing this to us because, you know, having worked out there in Green Valley Ranch for for the last four years, prior to being on council, one of the things that frustrated me is, is, is that urbanist is that there was a ton of single family development that was still going'",
        "'speaker_4': 'on. And that's our most resource intensive development pattern that we can have. And, you know, sprawl, sprawl, sprawl. I mean, we've we've seen it happen. And in this in Denver, where every place where we build a highway, there's a ton of infill at that low density.'",
        "'speaker_4': 'And this is an area where we just invested in this commuter rail. We have the purple pipe system going down chambers and other areas out there. And we have to build new road networks in this process. So we could be doing multi-modal ways that mean pathways and those work better when we have a significant uptick in density'",
        "'speaker_4': '. You know, the Stapleton redevelopment that's going on out there has some of the most the whitest streets, and it's the most car friendly area in Denver. And if we're really going to try and capture affordable but vital living, it's it isn't continuing with urban and suburban sprawl.'",
        "'speaker_4': 'It is trying to capture a healthier density so that we can get a mix of uses and a mix of housing types and and whatnot. So this is I'm glad to see a dense redevelopment opportunity. I mean, development opportunity come right around one of our new TOD stations that has a direct link with downtown in our in'",
        "'speaker_4': 'a huge employer out at the airport. So and I'm glad to see that boundary expanding because it's a chance to get a mixed community, mixed mixed scale, mixed everything right in the city and county. Denver So thank you, Councilwoman Gilmore, for taking that vision and expanding it and taking that opportunity, because it's vital if we're going to'",
        "'speaker_4': 'capture, you know, a diverse population in Denver to have these opportunities in very affordable parcels, too. These are great opportunities for the city. So thank you.'",
        "'speaker_1': 'Thank you, Councilman Espinosa, Councilwoman Greenwich.'",
        "'speaker_9': 'Thank you very much, Mr. President. I think that this is an important piece of good transit oriented development. But where we expand the potential for housing, it raises the question of how that housing is going to contribute to the need for affordability.'",
        "'speaker_9': 'And while I agree with Councilman Espinosa that these parcels begin today at an affordable level, what we know is that the rate of change in Denver means that some neighborhoods that used to just be market affordable can quickly change over time as they become hot, as our population pressures increase.'",
        "'speaker_9': 'And so the best way to ensure long term affordability is through restrictions that keep that property affordable, you know, for 20, 30, 40 years into the future. I raised this because I've been asked it from constituents what we are doing as a city to help ensure more affordability in this site.'",
        "'speaker_9': 'And what I, I just want to share publicly what I've shared with those constituents and with the developer of who owns some of the land in the area of this station. But all of it, I believe, in the expansion that we're talking about today is that this is a tricky area to do restricted affordable housing.'",
        "'speaker_9': 'There is not a great demand among the tax credit finance folks who tend to find affordable housing to put tax credit projects in this area right now because it's not hot yet. Right. This is this old trickle we get about not wanting to put more affordability where it's affordable, but knowing that if you don't do it today'",
        "'speaker_9': ', it can be hard to get for tomorrow. We're also in a moment where we're in a transition between areas of policy and housing right today. If you build new affordable rent or if you build new rental housing, there is no policy in place to help capture any of that for affordability.'",
        "'speaker_9': 'But we have a very concrete proposal on its way to this council in the next six months to have a fee on new development to help to put those fees towards affordable housing. And so should we pass that package of policies then?'",
        "'speaker_9': 'In fact, most of the development that occurs in this area, residential or commercial development, could be paying a fee to help towards affordability. Now, that's not quite enough. It means that these projects in the future might be contributing to affordable housing.'",
        "'speaker_9': 'But what we really need is land to build that affordability. I've been asked about ideas such as land banking and things like that. That's tricky to do when you have one landowner. Typically, land banking involves buying a parcel and holding that parcel for future affordable development in the next five years or so.'",
        "'speaker_9': 'Here, we don't have small parcels for sale. We have large parcels owned by single landowners. So some of our traditional tools are not in place or not good fits for this site, but I think that it is critical that we continue to strive towards not just maybe generating funding for affordable housing from this development area, but from'",
        "'speaker_9': 'actually using the funds both those generated in that area, as well as potentially funds from other parts of the city to continue to work towards affordability. If I had a more concrete solution today, I would certainly have advocated for that before approving more residential.'",
        "'speaker_9': 'But because we're in a time of transition, because this area is one, that financing is a little harder to know what's going to happen in three or five years. I feel comfortable that we as a city can continue to work on this while many other phases of this project go forward.'",
        "'speaker_9': 'Right? There will be rezonings, there will be future development approvals and I think that the dialog will be there. In part, I want to just toot the horn of one of the developers that is already working to get a 4% tax credit project for the workforce out in this area.'",
        "'speaker_9': 'So in some ways they're already leading with that commitment. If we're able to, you know, figure out all the government pieces to make that work, that's a pretty good evidence of commitment, and that helps to kind of create a place for us to go in the future while we figure out whether or not the financing realm can'",
        "'speaker_9': 'evolve a little bit and whether or not we get a more settled housing policy adopted by this council. So all of that is a very long way of saying that I wouldn't be comfortable expanding more housing in this area without knowing that more affordability is possible and coming.'",
        "'speaker_9': 'I believe that it is, and that we are going to have to be working to be creative and figuring out how to do that. I'm committed. I hope the city is committed. I know the developer has expressed their commitment and with that I'm comfortable moving this forward for all the reasons described.'",
        "'speaker_9': 'And I want to thank Councilwoman Gilmore, who's been a very, you know, diligent sponsor in making sure that we were all educated and briefed on this. So thank you, Councilwoman Gilmore. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman. And each. Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. I think in the context of Denver International Airport compared with former Stapleton Airport. There's really no comparison to be made in saying I am near the airport. I recall visiting people in Park Hill and and maybe this was a little bit of a ginned up memory, but I can recall that you can actually'",
        "'speaker_5': 'wave to the passengers in the jets that were landing on runway one, runway eight. And you could wave. You could see them in the window and you could wave to them. So to say, I lived I'm close to DIA because you can see it in the distance.'",
        "'speaker_5': 'Is is everything is relative. The distance from the corner of the northeast corner of this 64th and tower that we're talking about from the nearest end of a runway is equivalent to being at Monaco and Alameda. It's a relative distance from the threshold of Stapleton's old runway 35 left, which is to say people at Monaco and Alameda'",
        "'speaker_5': 'probably wouldn't have said they're too close to Stapleton. So I don't I just want people to understand that because we're approving a two blocks additional of residential and multifamily at that, that it is still not near the airport in the sense that homes were near Stapleton, literally across the street, that you can actually wave to the passengers'",
        "'speaker_5': '. So. Mr. President, I will be supporting this tonight. And I see this as a very good leap forward for my my diagonally distant district 11 from southwest Denver to northeast.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Flynn. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I appreciate the conversation that we've had on this tonight. I thought it was important to just share some of the the history and why the then council felt that it was important to create those those buffer boundaries.'",
        "'speaker_6': 'I have friends that live both in Green Valley Ranch and in Marbella. And when they want to go shopping, typically they go to the retail that is on Tower Road, which is not in Denver County. And, you know, one of the things that I campaigned on when I ran for reelection to come back onto the council was'",
        "'speaker_6': 'that we need to be doing everything we can to try to keep retail in Denver and encourage people to shop in Denver. And I know this site will, in fact, do that. I was questioning why we need 40 more acres when we have 300 acres to do this development.'",
        "'speaker_6': 'But, you know, if there is one place where it does make sense to have density, it's it's, in fact, in this area. I know Councilwoman Gilmore worked very closely to ensure that the noise mitigation was very much a part of the work that move this project forward.'",
        "'speaker_6': 'And in really appreciate that because I think the people who will be living in the development will also appreciate that. Um, and I know technology is changing. We had a briefing, I think a year or two ago talking about some of the changes that will reduce the noise on some of the jets that fly in and out'",
        "'speaker_6': 'of DIA. So, you know, I think that will help significantly as well. So I will be supporting this tonight. I think the investment that the city has made in doing the transit stop, which was not included when RTD moved to build the DIA train out to the airport, the city made the investment to allow that to happen'",
        "'speaker_6': 'and that should have been enough to really kind of negotiate further on the affordability of housing. And that is an important issue that I hope we will make greater strides in addressing, because when you look at how much development will be there, to do it without any affordability within the development would be a shame.'",
        "'speaker_6': 'When we did Stapleton, because they asked for $300 million of tax increment financing, we were able to get a serious commitment of affordable housing to be built on that site. And knowing that this site alone is bigger than Stapleton really means that we should take greater strides in working with the developer to address that.'",
        "'speaker_6': 'And I'm committed to working with Councilwoman Kenney or anybody else that wants to further that agenda, because I think it is important. We don't want to have people who have to work at DIA or who will work at DIA to have to live further.'",
        "'speaker_6': 'Away. Like folks in the mountain community do, we want them to be able to live close to the airport where they work or be able to work on the site and live close by when all of the commercial development happens there.'",
        "'speaker_6': 'So with that, I'll be voting for this tonight. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Ortega. In other comments. One 8339 Madam Secretary, roll call.'",
        "'speaker_3': 'Gilmore I question can eat Lopez. I knew Ortega black Brooks I. Clark Espinosa.'",
        "'speaker_1': 'Flynn, I.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_1': 'I. And got it. Thank you, Madam Secretary, please for the very nice results. 1212 AIS 183 has passed. On Monday, May 23rd, Council will hold a required public hearing counter bill to 17 Changing the zoning classification. 5104 Dallas Street required people carrying Council Bill 219 Changing the zoning classification 4353 North Cherokee Street and a required Public Hearing'",
        "'speaker_1': 'Council Bill 249 Changing the Zoning Classification four 3250 South Colorado Boulevard. Any protest on county bills 217 to 19 or 249 must be filed with the council offices no later than noon on Monday, May 16. Seeing no other business before this body, this meeting is adjourned.'",
        "'speaker_4': 'In private sphere. And that means that interesting frontages ones that attract us, that are transparent, that allow for that flow of in and out, are incredibly important to the way that we experience our street. And a lot of there's actually a whole lot of active uses along the mall, about 11,000 feet of things like shops, retail, restaurants'",
        "'speaker_4': 'and bars that have really active and pleasant frontages. But we still have about 30% of them that, despite having active uses, don't have what we would characterize as being a high quality frontage. So there's a low hanging fruit there.'",
        "'speaker_4': 'There's opportunities to just increase that experience naturally and have it more congruent with the functions that are that are attached to them. We know actually that part of this also takes place in affecting inside and outdoor activities. Like I mentioned and during this meeting, the street test, we know that about 90% of the businesses we surveyed, you'",
        "'speaker_4': 'could see all the little dots here said that business was as good or better. During this meeting, the street test. So Principle five is about supporting a wider network of investment. This is about existing initiatives. Brad mentioned some of it.'",
        "'speaker_4': 'This is about inviting public institutions. The non typical set, the non typical players of that are still vital to the cultural and civic assets of the city. How do we invite them to say, Hey, the 16th Street Mall can be your playground, your canvas?'",
        "'speaker_4': 'The partnership's already been working with the Botanical Gardens to some extent on this on the garden block. But how do we do more to not only invite these cultural institutions, but also everyday civic society, people that are interested in contributing and that can catalyze with their input to create a better street and a better city.'",
        "'speaker_4': 'And we see there's a lot of potential all at all through downtown to invite actively invite these institutions much more actively to not only collaborate in concert with the things that are happening along the 16th Street Mall, but maybe again, also use it as a canvas or an outlet or a satellite of of their location.'",
        "'speaker_4': 'It's incredibly important to to think beyond the the physical boundaries of the street. It's not just about from building frontage to building frontage for us. It's also about policies. Right. How do we rethink maybe some of the limitations?'",
        "'speaker_4': 'Liquor licensing, like, for example, having to put big barricades around restaurants that serve alcohol. Can that be changed? Maybe in certain areas. Can we encourage more mixed use development and and program adjacent underused sites, at least some parts of the day.'",
        "'speaker_4': 'So, you know, I think that. Then go back. You know, it's nice to be able to. Denver has got fantastic weather. It's incredible to be outside as much as you can in many places. But again, does it have to be behind bars?'",
        "'speaker_4': 'Literally, when you're when you're drinking, I don't know. We'll think about that. I've been in Europe for too long. Maybe so. I'm a little optimistic about the potential of that and what that can provide. But again, it's just that more open, free flow life that can exist coexist with different interests and and really make sure that we'",
        "'speaker_4': 'can get that coexistence. That's a key word about lingering about.'"
    ]
}