{
    "A proclamation celebrating the Denver Art Museum and their special exhibit - Star Wars and the Power of Costume.": [
        "'speaker_3': 'None, Mr. President.'",
        "'speaker_0': 'Communications. Do we have any communications?'",
        "'speaker_3': 'None. Mr. President.'",
        "'speaker_0': 'We have one proclamation this evening. You might have heard it for the last five, 10 minutes. Councilman Lopez, will you please read Proclamation 149?'",
        "'speaker_5': 'Do we have a proclamation? I think we do have Republican nation, so absolutely. I mean, make sure that the screens are queued. All right. Proclamation 17 149 celebrating the Denver Art Museum and their special exhibit, Star Wars and the Power of Costumes.'",
        "'speaker_5': 'Nicely done and nicely recognizes the value of inspiring creativity and critical thinking in children and all residents. And. WHEREAS, The Denver Art Museum shares and embodies its value by serving the Denver region year round, but family programing, performance opportunities and school tourism on its collections as well as special exhibitions.'",
        "'speaker_5': 'And. Whereas, Star Wars and the Power of Costume, an exhibition created by the Smithsonian Institute Traveling Exhibition Mission Service. A new Lucas Museum of Narrative Art in consultation with Lucas films, limited highlights and celebrates the creativity, artistry and craftsmanship that goes into every costume and the creation of every character.'",
        "'speaker_5': 'And. Whereas, The Denver Art Museum is the sole venue in the Rocky Mountain region for Star Wars and the the power of costume, a unique journey onto the into the Star Wars universe, bringing the iconic characters to life through a dramatic presentation of more than 70 original costumes from the films from Princess Leia, his famous white robe'",
        "'speaker_5': ', the queen armor, dollars, elaborately detailed gowns, chewbacca's giant feet to Darth Vader's imposing black armor. It's all fun and games until somebody gets forced choked over there. Whereas the Denver Art Museum has taken this traveling costume exhibition and added additional costumes and more material to create an immersive experience.'",
        "'speaker_5': 'Exclusive to this Denver showing including Emperor Palpatine's fingernails. Costume sketches and studio spaces to provide more context to the process of creating Star Wars costumes. And. WHEREAS, The Denver Art Museum and its partners, including the Mountain Garrison of the 501st Legion.'",
        "'speaker_5': 'The Mandalorian Mercs Costume Club and the Rebel Rebel Legion Mountain Base are staying on target to engage the public with costumes and creativity, whereas the possibility of successfully navigating the entire exhibit is approximately 50 to 80 to one.'",
        "'speaker_5': 'We have a good feeling about this now. Therefore, be it proclaimed by the Council of the City and County of Denver, Section one of the Council hereby proclaims February 13th as Star Wars costumes day in the city and county of Denver.'",
        "'speaker_5': 'Looking at you arriving Section two, the council urges all families to now witness the power of these fully operational, city sponsored cultural institutions by attending this exhibit and participating and participating in festivities which run through April 2nd, 2017.'",
        "'speaker_5': 'Section three that the Clerk of the city and County of Denver saw test and affects to see seal of the city and county of Denver to this proclamation and that copies be transmitted to the Denver Art Museum, the Smithsonian Institution Traveling Exhibition and Service.'",
        "'speaker_5': 'Lucas Museum of Narrative Arts. Lucasfilm Ltd. The Mountain Garrison of the 51st 501st Legion, The Mandalorian Mercs Costume Club and the Rebel Legion Mountain Base. And may the force be with you.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Your motion to adopt.'",
        "'speaker_5': 'Thank you, Mr. President. I move that proclamation 149 series of 2017 be adopted.'",
        "'speaker_0': 'It has been moved. And second, it comments by members of Council Councilman Lopez.'",
        "'speaker_5': 'Yeah, I am very proud, actually, in all seriousness, of when we can't be serious about this right there. It seems pretty serious to me. I am very excited about this costumes. This has been going on since November and it's been at the Denver Art Museum and it is one heck of an exhibition.'",
        "'speaker_5': 'If you get the opportunity to do this from now until April 2nd, go see this exhibition. This is the original Star Wars costumes here in Denver. A lot of them are original sketches. And it is it is a great it's a great show.'",
        "'speaker_5': 'It's it's awesome that it's here in Denver. And, you know, I had the opportunity of seeing this twice already, and I wouldn't mind a third time. And really, you can spend a whole afternoon, you know, just listening to the different exhibits and just seeing them.'",
        "'speaker_5': 'And those of us who grew up in the seventies and eighties and I can we can even say up to now, right, with the new movies that have been out, it's a multigenerational experience. You could take the kids, you know, those of us who are big kids can go over there and check it out.'",
        "'speaker_5': 'But it's I'm very excited. That's here in Denver. And sadly, I got to say this. We we actually were I took my daughter to see it the day that Carrie Fisher had passed away. And it just had it just had what a coincidence that that same day we had tickets for she had passed.'",
        "'speaker_5': 'And so it was pretty incredible to see, to walk in and actually see her white gown and to see her costumes and to see a little tribute to her after it. But this is definitely quite an experience. I urge my colleagues to go check it out.'",
        "'speaker_5': 'The folks in the in the room, in the council chambers to go check it out. This is very rare that it's here. And I just wanted to make sure that we are celebrating it, honoring it, welcoming it to Denver so that, you know, in hopes it can come again.'",
        "'speaker_5': 'So. Mr. President, I. I fully support this proclamation and I hope my council colleagues do, too. You will support this initiative?'",
        "'speaker_0': 'We all do. All right. Thank you, Councilman Lopez. Councilman Espinosa. Yeah, I just wanted to say that. Yeah, it's an impressive it's an impressive collection of actual costumes and wardrobe. But coupled with there's a lot of information there about the making of the costumes and there's an impressive display of textiles and sort of the the science and'",
        "'speaker_0': 'engineering and everything, the creativity that goes into the actual making of the costumes. So there is a lot a lot of information there. And I strongly encourage fans and non-fans and whatever degree of interest that you have in the franchise that is Star Wars to go check it out because it is it is quite educational on top'",
        "'speaker_0': 'of being very familiar. And actually it'll add layers to the to the story making that you probably didn't even you never would have been aware of. But there's a lot of thought that goes into into what's going what's going on, on set and in creating these characters and it comes through in this presentation.'",
        "'speaker_0': 'So I just really do stress that no matter what your interest is, do check it out because it's quite an impressive curated piece. Thanks. Thank you. Catherine Espinosa and sitting in for Councilwoman can each layer.'",
        "'speaker_1': 'Mr. President. You know, Councilman Lopez, I imagine, has been dreaming about this day, his entire council career, and no one will be surprised that he's a fan. But I might not have been known as a fan. This is not the first time I'm in this way.'",
        "'speaker_1': 'I could just tell you, but I actually had the pleasure of attending the opening event where Kristoff and many others spoke. And one of the things that I think was really great to learn about is that this is a traveling exhibit in terms of the costumes, but no other museum to date has done the curation of the'",
        "'speaker_1': 'additional artifacts about the sketches and all of that. And so Denver was unique. And that's that's how this museum has operated with so many of its shows, is it takes art that may be very familiar to you because you learned about it in a class or in this case, you saw it in a movie.'",
        "'speaker_1': 'But it goes deeper. And and you know what Councilman Espinosa said about going around and into the creative process. And I think that that's really important because one of the things that I think that show does is it shows you the way that art is around you and is every day and hopefully inspires right kids to think'",
        "'speaker_1': 'about that. Art isn't just a painting or it isn't just a sculpture, but that there are many ways to express yourself and many ways to bring something to fruition from your vision. And that to me is, is where art is bringing the daily into, you know, the lives of the folks seeing the show.'",
        "'speaker_1': 'So and then, you know, I just want to say, you know, since it is, you know, the year that we lost Carrie Fisher for for an entire generation, I think, of young girls and young women. I think to see an action hero, right.'",
        "'speaker_1': 'As a as a female. And I think that that's one of the things that that I love and that many of the women of my generation love about that series. And so so for me, that was my chance to give her a little tribute today.'",
        "'speaker_1': 'So but but I just want to commend the staff and the folks who did the research and putting all of it together because it was very intricate and, you know, may not hit the art world in the same way as, you know, a monet exhibit.'",
        "'speaker_1': 'But my guess is the technical knowledge and the sorting of those things probably took as much, if not more research and work than our traditional art shows that we think about. So kudos to all your team.'",
        "'speaker_0': 'Thank you. Councilman, can each. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I don't know anybody who is not a Star Wars fan. I also had an opportunity to go to the opening night and have a bunch of pictures on my phone that I was able to take of the exhibit.'",
        "'speaker_8': 'The economic opportunity that I think it created for our city to encourage not only people who live in Denver, but throughout the metro area to come and see the exhibit and to really feel that close to something that they saw on television for, you know, at least a couple of decades is is pretty exciting.'",
        "'speaker_8': 'And so I am, first of all, wanting to ask that my name be added to the proclamation. I don't think I had a chance to reply. And I just want to say that a friend of mine that actually went with me to the exhibit, I haven't seen every single one of the series and she's got them all'",
        "'speaker_8': '. So we're going to do some binge watching so that I can get caught up to make sure that I am up to speed on all of these. And I just want to say to Darth Vader in the back, may the force be with you as well.'",
        "'speaker_0': 'All right. Councilman earned it.'",
        "'speaker_9': 'Thrilled. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'No. There. There are few things that last a test of time. And so I was checking the day May 25th, 1977, is when Star Wars debuted. And to think.'",
        "'speaker_5': 'All this ten years later, how it still just.'",
        "'speaker_0': 'Captivated generations for.'",
        "'speaker_6': 'That. And it's just truly a remarkable thing.'",
        "'speaker_5': 'And it would just if we could have had our.'",
        "'speaker_6': 'Students from DFA play some Star.'",
        "'speaker_5': 'Wars music, that just would have been even more.'",
        "'speaker_0': 'Fitting for that. And so I.'",
        "'speaker_6': 'I'm a huge fan and I would.'",
        "'speaker_5': 'Just like to say I'm excited to see this and take my son.'",
        "'speaker_0': 'And this is not the.'",
        "'speaker_6': 'First time we've had a stormtrooper in chambers. I wanted to make sure we all remember that. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman.'",
        "'speaker_10': 'Thank you. I I'm so pleased to have such a wonderful art museum in District ten and just a nationally read National Resource. And to have this exhibit, like Robin said, is so unique. This is so unique to Denver in the United States.'",
        "'speaker_10': 'So I'm so proud that Christoph and his staff are just providing such unique shows. And an educational event for kids is the only issue I had with the exhibit. Everybody had a wonderful time. The only issue is I enjoy the exhibit, but I enjoyed it without my wife, so I'm eagerly looking forward to seeing it again very'",
        "'speaker_10': 'soon with her. I was told this for sure was going to happen. So anyway, thank you so much for bringing this to Denver and congratulations.'",
        "'speaker_0': 'Thank you. Councilman knew Councilman Lopez back up.'",
        "'speaker_5': 'Yes, I am. And thank you, Mr. President. I wanted to make sure that I gave a big thank you to Christoph and his team, Frederick and Jeremiah. I think it's really, really great work on your behalf. And I think, you know, when we look at the art museum, we go look at a lot of a lot of'",
        "'speaker_5': 'the. Usually easel art and a lot of different things that are out there, you know, very typically well atypically do we have an exhibit like this? And this brings so many different people to the art museum. And while they're at the art museum, if they come and see this, they're still able to see the other exhibits in'",
        "'speaker_5': 'the art museum. And that's one of the important things is when you get it, when you come and see this exhibit, you're also able to check out the rest of the floor is the art museum in the Frederick C Hamilton building.'",
        "'speaker_5': 'All that. It's such an amazing institution. And I also wanted to give a shout out to to Rodolfo and Councilwoman and each his office who probably late at night did this little scroll here unbeknownst to us. And it was quite a surprise and a welcome surprised and and thank you to Darth Vader and the stormtroopers.'",
        "'speaker_5': 'Right thank you. Thank you for coming out to Denver.'",
        "'speaker_0': 'CC and know.'",
        "'speaker_5': 'Of hope you enjoy some of the finer things.'",
        "'speaker_0': 'See no other comments. Madam Secretary Rocha.'",
        "'speaker_3': 'Lopez.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Knew Ortega Susman by Black Eye. Clark I Espinosa.'",
        "'speaker_0': 'Vote I do.'",
        "'speaker_6': 'Flynn I.'",
        "'speaker_3': 'Gilmore, I. Herndon High Cashman. Kenny. Mr. President.'",
        "'speaker_0': 'I please call voting and as a results.'",
        "'speaker_3': '13 Eyes.'",
        "'speaker_0': '13 Eyes. Proclamation 149 has passed. Councilman Lopez, if might there be someone you want to bring up to a few people?'",
        "'speaker_5': 'So why don't I at this point invite our director of the art museum, Krista Christoph Hedrick, and then we can have Darth Vader and stormtroopers if you want to come up to the podium as well.'",
        "'speaker_0': 'Yes.'",
        "'speaker_10': 'Green Bay, members of the city council. Thank you very much. That's truly a great honor. And I speak for all of us here at the Denver Art Museum who are very honored to be recognized today. We brought some of our friends with us some less some more heavily breathing.'",
        "'speaker_10': 'And it should be noted that the individuals join us from the Mountain Garrison, from the Rebel Legion and the Mandalorian costuming groups here in our area. So it's talent from the region. I'm getting actually always a little scared if I have these guys next to me because I know that I'm if I'm not in handcuffs, I'm part'",
        "'speaker_10': 'of the dark side. I think I'm not. I'm a proud director of a wonderful museum. And you already said it all. I feel I don't have anything to add to this, but it was a wonderful journey for us, a wonderful endeavor, really, to dove deep into the treasures of Skywalker Ranch and to find more than 300 additional'",
        "'speaker_10': 'drawings, maquettes, scribbles, notes to highlight the creative process behind the costumes, but as well, really behind creating characters that still resonate with us in a tremendous way. I want to say at this point as well, a very heartfelt thanks to you, members of the Denver city councils, but as well to the voters of the metro area and'",
        "'speaker_10': 'worldwide, community leaders support this community. Cultural scene will continue to flourish thanks to the renewal of the Scientific and Cultural Facility District last November, which of course makes all the difference and makes helps us to bring. Nationally and internationally acclaimed programs, world class programs to the community.'",
        "'speaker_10': 'I'd like to thank Councilman Lopez for his keen interest in Star Wars and the power of costumes at the Denver Art Museum. But as well, many thanks to the other members of the Council for supporting us and come back with your kids, with your grandkids.'",
        "'speaker_10': 'It is definitely a three, at least if not for generation pleasure. In the meantime, after so many years and with the new film just coming out, our just came out a few weeks ago, I think it really shows how much in the story is and how wonderful this is the purpose of our time.'",
        "'speaker_10': 'I would like to make a very brief note and thanks to our own District ten Councilman No. For his continuous support of the Golden Triangle cultural community and with this exhibition. Exactly. As Councilwoman Keech said, we are continuing this exploration, this dove deep into human creation, trying to find out and lay out what it is that makes'",
        "'speaker_10': 'us special and what art is and how many layers, how many costumes, no pun intended, we actually can find for art and what it happens when we look a little deeper and when we look. How do these amazing characters get created?'",
        "'speaker_10': 'Thank you very much. Thank you for having our team here today, but thank you as well for the great support that we always get from the city and county of Denver. Thank you.'",
        "'speaker_0': 'Thank you. That that one right there is he's a little bit too in character. I mean, he just kept staring at that. We welcome you guys. Everything okay? Okay. I just want to make sure we're good.'",
        "'speaker_5': 'You're lucky to still be alive.'",
        "'speaker_0': 'All right, I did it. All right. Thank you, Councilman Lopez, for bringing that forward. And Chris of Denver Art Museum, we're lucky to have this treasured asset in our community resolution. Madame Secretary, will you please read the resolutions.'"
    ],
    "A resolution for approving a proposed Agreement between the City and County of Denver and David Evans and Associates, Inc. for on-call professional engineering services. Approves an on-call contract with David Evans and Associates, Inc. for $4 million for three years to provide comprehensive engineering services to support various Public Works capital projects, and general engineering services in connection with the planning, design, and construction of various projects citywide (201631684). The last regularly scheduled Council meeting within the 30-day review period is on 3-6-17. The Committee approved filing this resolution by consent on 12-13-16.": [
        "'speaker_4': 'And when it whenever these on call contracts come up, I get questions from constituents about what's this about? Why don't we get to hear about this? And I don't believe there's anything crooked that goes on with these on call contracts.'",
        "'speaker_4': 'I understand that they're a part of our city process, but there is some concern about getting regular updates on how the money is spent, etc.. And the second factor on this particular group is that there is a group of folks very concerned about one of our large projects that's going to get underway soon, the plant, the Park'",
        "'speaker_4': 'Hill Drainage Project. And they wanted to know if this money is some sort of backdoor way, these contracts of spending on that. So I'd like to bring this up and just get the issues out and hear from our folks at Public Works.'",
        "'speaker_4': 'So I'd like to ask Angelica Sias if she could come up and answer a couple of questions.'",
        "'speaker_0': 'Yeah, and I think we got a team for this because there are many contracts with these on call.'",
        "'speaker_4': 'Absolutely.'",
        "'speaker_0': 'And then, Councilwoman Ortega, do you want to just wait until they respond and then you have some questions as well? Okay. Okay. Go ahead.'",
        "'speaker_4': 'Angela. I'd like I'd like to start just by asking you if you would explain what these on call contracts are all about.'",
        "'speaker_1': 'Okay. What I'm going to go ahead and do is I'm going to go ahead and defer to Michael Sheehan and Deb Turner. Deb Turner is actually the person who's overseeing these particular on call contracts. So I'll bring her up and have her explain these.'",
        "'speaker_4': 'In and that they're in line with the general process of on call contracting.'",
        "'speaker_1': 'Yep. And so one correction I do want to make to what you said earlier. This is not $56 million in on coal contracts. These are 4 million up. These are for capacity of up to $4 million each over the next three years.'",
        "'speaker_4': 'Right. But the capacity we'll.'",
        "'speaker_1': 'Be spending $56 million over. Usually we don't go to the maximum amount. This is just so we have some wiggle room and who we can ask to do different projects.'",
        "'speaker_4': 'Thank you for that.'",
        "'speaker_1': 'Could have been council members. And I'm a entering supervisor in public works capital project management, transportation, and these are on calls. We generally use these for contracts under $500,000. To procure engineering services for things like intersection designs. I know.'",
        "'speaker_1': 'Signal design, small roadway projects that we get throughout the year. General rehab projects like the Bill O'Reilly Rehab. Small roadway. Or an intersection of projects like 56th and Dunkirk. We do median design, small bridge designs, even structural rehab of drainage and bridge facilities with these.'",
        "'speaker_1': 'We also open this up to other people and public works. And I think the Parks Department, Arts and venues, a lot of people use these contracts. But anything over $100,000, we generally mini bid. So we have a minimum of three bids on those, usually, sometimes more.'",
        "'speaker_1': 'Most of our contracts are, I think, under $100,000. So this is how we generally use these. Do you have any questions on that?'",
        "'speaker_4': 'And when will council find out how these monies are spent?'",
        "'speaker_1': 'I know you want to. So so we have a long awaited report coming to you. And I know that we've we've done some vetting and we've vetted it through the mayor's office and through our department. And so you should be seeing a regular report starting the by the end of this week.'",
        "'speaker_1': 'And what we're going to do is we're going to send that report around, as is to all the on call contracts that we have currently, their capacity, how much has been used. And what we'd like to do is offer one on one briefings to the council members to explain the on call contracting process and how that all'",
        "'speaker_1': 'works and how you can read this report so you understand how what we're actually reporting on.'",
        "'speaker_4': 'So do I understand then that we will hear about on a regular basis every dollar that you spend on these on call contracts. Correct. Thank you, Michael. I think you're the one that will answer this. So as far as the whether or not these contracts are associated with with the plot to Park Hill project, can can you'",
        "'speaker_4': 'explain.'",
        "'speaker_6': 'The plat to Park Hills being publicly procured separately from these on calls that are too big for the on calls because they go well over the limits of the on calls. So for example, City Park Golf Course is an active design for build procurement at this time and we anticipate that will come through City Council in Q3'",
        "'speaker_6': ', 39th AV Greenway and Park Hill, that's also in an active design build procurement, which will come through City Council for approval in Q4 of this year. And then thirdly, we also have a program management selection to supplement our staff with resources required to implement those large projects that will come through City Council for review and approval in'",
        "'speaker_6': 'Q3.'",
        "'speaker_4': 'So if somewhere along the line you decide you need on call assistance with that, would that be new money or is is that.'",
        "'speaker_6': 'Now it's all part of the existing plan at the Park Hill budget. All these projects that come through the on calls are either a come through the budget book or they come through our various customers. As Angela referenced in Arts and Venues, Parks and Rec Art Museum, we do projects for we're doing projects for National Western Center'",
        "'speaker_6': 'and we work with our our team of city attorney's office and contracts folks to evaluate what can fit within the on call versus what needs to be publicly procured.'",
        "'speaker_4': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Yep, no problem. Thank you, Councilman.'",
        "'speaker_10': 'You just used the question. So all the on call money that we're seeing here now is budgeted in the 2017 budget. Right. Or or will be in the subsequent budgets for three years.'",
        "'speaker_6': 'Keep in mind that 56 million in capacity will we'd have to really be pushed over utilize out of all the existing nine that expire this fall, only one is close on capacity. The remaining eight have significant capacity remaining.'",
        "'speaker_10': 'So it was all part of the budget discussion that we had for this year. Yes. All right. Thank you.'",
        "'speaker_0': 'Great County Councilwoman Sussman.'",
        "'speaker_1': 'Mr. President.'",
        "'speaker_0': 'No. No.'",
        "'speaker_1': 'Now is it?'",
        "'speaker_0': 'No, it's okay.'",
        "'speaker_1': 'I think part of the you know, we did get some requests about on calls. It was a confusion between NG calls and the project itself. And I think we had some questions about how the citizen might be able to find a description of the project on which an on call might be used.'",
        "'speaker_1': 'Because I know on call work is work you need at the time you need it, but it is about a project. And I know when in an RFP we will put a description of the project. And how does a how does an average citizen find out a description of the larger project for which an on call might'",
        "'speaker_1': 'be used? Hi, Angela can see us again. So we do have a website which lists all of the all of the projects that are in progress on dimmer. Gov. So if you go to Denver gov dot org forward slash DPW and there is a box that says I believe it's like construction, planning and construction if you go'",
        "'speaker_1': 'there that lists all of the projects that are in process now. So this isn't specific to on call projects, but it is all of the construction projects that are happening in this fiscal year. I think that's really important because I think I heard on those emails that that was what people wanted to know was what, what construction'",
        "'speaker_1': ', what, where can I read about these construction projects? And I, I knew that they were on the website. Thank you very much.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Sussman, Councilman Espinosa. And I apologize. I was writing my questions as one of the answers was, you've already said this. I'm going to ask to repeat it. So how is overlap handled with the PDP?'",
        "'speaker_0': 'I mean, Platte, Park Hill contractors, are they preferred because of their familiarity should result in savings or is there no overlap?'",
        "'speaker_6': 'Actually, the answer to that question is they're typically precluded because they can't sit on both sides. In other words, they can't represent us, the owner, and then pursue the project. So we review them on a case by case basis.'",
        "'speaker_6': 'But generally, most of the folks who have supported the preliminary engineering for the plant, the particular precluded from pursuing the project, said are out advertising right now.'",
        "'speaker_0': 'Okay. You know, are there bright lines preventing work within the boundaries of the plants of Park Hill scope and area and the National Western Center? So that that money doesn't come in, that that money for those projects comes out of stormwater or they're dedicated revenue and not out of public works funds.'",
        "'speaker_6': 'I can tell you it's been vetted very closely as National Western defines their program and how they're going to move forward with it. That's we're waiting on that information, but others are looking at that very closely to make sure there's no conflict there.'",
        "'speaker_6': 'And we anticipate watching it very closely.'",
        "'speaker_0': 'I would just to maybe make our job a little bit easier when reviewing these sort of subsequent updates is identify those that are sort of within those boundaries so that we're not trying to, you know, identify intersections and things like that or roadways and trying to make that delineation ourselves.'",
        "'speaker_0': 'If there's something that is in that sort of work perimeter where the PDP, you know, plant to Park Hill or some of these other larger funded projects or so we can make that so we can if we have versions about that overlap.'",
        "'speaker_6': 'Understood in our program resource office where we track all these projects we're actually working right now, they'll be able to load them all into gear so we can identify the location of each project with the reports.'",
        "'speaker_0': 'Yeah, and I think you're getting you can get where my concern is is we've already dedicated a healthy amount of our budgets and fees to those projects. And if and we want our public works money sort of going elsewhere.'",
        "'speaker_0': 'Interested. Thanks. Thank you. Councilman Espinoza. Councilman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. As you know, I routinely call out the call contracts because I don't think we get enough detailed information upfront. And I do appreciate the fact that Angela came over and met with me and provided some information in writing based on some questions that I submitted.'",
        "'speaker_8': 'But I think we need to make sure that we're getting more information so that when either we get them on a consent calendar or they come to committee, we know upfront and don't have to have you all come out in and be expected to answer the questions here.'",
        "'speaker_8': 'It should be part of that contract request form that gets filed with City Council on the front end. And Councilman Flynn and I have had some conversations about this to ensure that not just with on call contracts but with other bills that get filed, we're getting more information so that we're not scrambling, trying to get the information'",
        "'speaker_8': 'on on a monday when in some cases the bills only have the details that are attached on Thursday afternoon. So it doesn't give us a lot of time when the agencies have been working on some of these contracts or ordinances for months and months.'",
        "'speaker_8': 'And then we're expected to scramble. And, you know, I just have to say that I'm I'm not happy that we changed our process, taking away one week from our review of what used to be two reading ordinances, and now it's a one reading proclamation.'",
        "'speaker_8': 'And that was a resolution that was done to expedite the contracting process. But, you know, in. In that procedure, we get shortchanged. And I think we need to make sure we're getting a lot more information. One of the questions I have for you, Michael, if you wouldn't mind coming to the podium.'",
        "'speaker_8': 'Is where would something like the Washington Street design fall? Would that be a separate project? Would that be something that would fall within this for the design work? This is the widening of Washington Street in the Globeville neighborhood.'",
        "'speaker_8': 'And for those of you who are not aware, we've got Xcel Energy that's going to be doing a pipeline, a gas pipeline down through the Globeville neighborhood. We. Councilman Brooks and I've been encouraging that this happen on Washington Street and not through the residential neighborhood.'",
        "'speaker_8': 'But, you know, having having that design work would be really important. And I don't know where something like that would fall, whether it's a non-call or whether it's going to be a separate bid project because of the cost.'",
        "'speaker_0': 'This is I may be able to take this because there's another one in my district just like it and it's bright and boulevard. And I believe it's a separate project, just like what we doing at Park Platte to Park Hill in City Park, because it's so large, it's a 60, $60 million project, correct?'",
        "'speaker_1': 'If it's an over $500,000, well, generally same as a heartbeat or an RFP out so that the general engineering community can bid on it. So yeah, that one is definitely large enough. It's its own separate project.'",
        "'speaker_8': 'Okay. I have no further questions or comments.'",
        "'speaker_0': 'Okay. Thank you. Thank you. Councilman Ortega. Uh, Councilman Flynn? Yes. Okay.'",
        "'speaker_6': 'I just make sure that I'm clear on. Since Councilwoman Ortega brought up Angela, maybe you could address this. The administration under the charter, the way it is now, the list that you sent us this afternoon, nearly every one of these projects you could put out individually in a separate contract, because they're all well below the half million'",
        "'speaker_6': 'dollar threshold in the charter that has to come to us. Now, you did say I believe that or Michael, maybe you said it, that if a task order is more than $100,000, you'll seek many bids among the among the folks who are all who already have the on call.'",
        "'speaker_6': 'What do you do when the estimate is over half a million dollars.'",
        "'speaker_1': 'That would go out for a hard bid?'",
        "'speaker_6': 'That would go out for Harbert. But would it come back to us then? Yes, that's what I thought. Okay. Thank you very much.'",
        "'speaker_0': 'All right. Thank you, Councilman Flint. Councilman Espinosa, you back up? Yeah. One more sort of question related to the the the way council in Cashman sort of observed that this might. This seems like a $56 million request when the request for services went out, the RFP, RFQ, I don't know what it is.'",
        "'speaker_0': 'When that went out, was it done as 14 separate RFP or was there one call?'",
        "'speaker_1': 'There was one.'",
        "'speaker_0': 'So I think that's sort of important to sort of state. We knew we had $56 million worth of total capacity that we're going to allocate, mean that we're going to approve or disapprove tonight. Doesn't mean you're going to spend it.'",
        "'speaker_0': 'But we did treat it when we went out and asked for people to send their their qualifications in once. And under that big umbrella. And now we're talking about 14 different contracts. But it is one big ask.'",
        "'speaker_1': 'So when we do these on call contracts, this doing it this way saves us public works from anywhere from 60 to 120 days in actually getting the work done and out on the street. So this is this is an efficiency for us.'",
        "'speaker_0': 'And I agree. And I think that's important that we do that as a city to sort of, you know, recognize efficiencies when we can. But I do want to sort of when we go back and we're looking at and we're approving 14 bills that are all essentially the same language with different names, it still looks like $56'",
        "'speaker_0': 'million.'",
        "'speaker_1': 'So that's again, we we rarely go up to that 56 million. And in the time that those contracts are open, it just allows for flexibility as the contractors are bidding for getting work.'",
        "'speaker_0': 'Thank you. All right. Thank you. All right. So no one, this isn't you're not putting this on the floor, Councilman Cashman?'",
        "'speaker_4': 'Yes, I do want to put it on the.'",
        "'speaker_0': 'Floor for a vote. Okay. Councilman Espinosa, would you please move the resolution, resolutions 1276 through 1289 on the floor for adoption? You're not going to let me do a range. So are there. I move that resolutions 1276, 1277, 1278, 1279, 12, 80, 12, 81, 12, 82, 12, 83, 12, 84, 12, 85, 12, 86, 12, 87, 1288 and'",
        "'speaker_0': '1289 be adopted in a block. All right. It has been moved in second it any comments? Any more comments? Councilman Cashman.'",
        "'speaker_4': 'Thank you. Yeah, I just wanted to say, I do not believe there is any monkey business or malfeasance going on with these contracts. However, I'm going to take the opportunity to vote no tonight to encourage the follow through on the reporting and detail that I hope will be coming across.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega.'",
        "'speaker_8': 'I just want to add that I appreciate the fact that we are going to be getting a report, but that's different from getting detailed information with each bill that gets filed up front. So, you know, it'll be great that we look at things in the RIRs, but I'd like to see it up front before voting.'",
        "'speaker_8': 'So I know exactly what those details entail. So for that reason, I'm going to be voting down to nine as well.'",
        "'speaker_0': 'All right. Thank you, Councilman Ortega. Councilman Espinosa, I just want to sort of preface my comment. I will be voting in in favor of the contracts tonight, but I just wanted my colleagues to know that I've already going to formulate a request for sort of more granularity of prior years on how this money was used, sort of'",
        "'speaker_0': 'to paint a picture and then appreciate the sort of efforts to sort of track this going forward as well. So thank you. All right. It's been moved and seconded. Madam Secretary, Raquel Cashman.'",
        "'speaker_3': 'Can each Lopez. New Ortega?'",
        "'speaker_8': 'No.'",
        "'speaker_3': 'Sussman.'",
        "'speaker_1': 'Black eye.'",
        "'speaker_3': 'Clark. All right. Espinosa. Hi, Flynn.'",
        "'speaker_6': 'Hi.'",
        "'speaker_3': 'Gilmore. I heard in.'",
        "'speaker_0': 'High.'",
        "'speaker_3': 'Mr. President, I.'",
        "'speaker_0': 'Politicals voting announce results.'",
        "'speaker_3': 'Sorry. I'm just looking to make sure everyone feels like a council member with. Tennis, tennis.'",
        "'speaker_0': 'Tennis Tuesdays Resolutions 1276 through 1289 have been adopted in a block. We've taken off Council Bill 49. This includes all the items that are called out. All of the bills for introduction are ordered published. We're now ready for the block votes on resolutions on final consideration, except for council bills 56 and 58.'",
        "'speaker_0': 'The two are companion bills and bills to be scheduled for a required public hearing later this evening. Council. Council will vote to pass companion Bill 56 after the conclusion of the public hearing on Council Bill 55 approving the amendment to the Saint Anthony Urban Redevelopment Plan for the Sloan Sloan's BLOCK three project to authorize the creation of'",
        "'speaker_0': 'two sales tax increment areas. And Council will vote to pass the companion bill 58 after the conclusion of the public hearing on Council Bill 57 approving an amendment to the St Anthony's Urban Redevelopment Plan for the Sloan's BLOCK nine project to authorize the use of property tax increment financing.'",
        "'speaker_0': 'Councilmembers. Please remember that this is a consent or block vote and you will need to vote. Otherwise, this is your last chance to call out an item for a separate vote. Councilman Espinosa, will you please put the resolutions for adoption and the bills on final consideration for on the floor for final passage?'",
        "'speaker_0': 'Thank you, Mr. President. I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in a block for the following items. 17 007400750034003500850108 12 0500 70 700 70 800 49 and zero zero 51.'",
        "'speaker_0': 'All series 70. All right. It has been moved and seconded. Madam Secretary Rocha.'",
        "'speaker_3': 'Black Eye Clark by Espinosa, i Flynn I Gilmore, i Herndon I Cashman can eat Lopez. I knew Ortega i Susman. Mr. President.'",
        "'speaker_0': 'I.'",
        "'speaker_3': '13 eyes.'",
        "'speaker_0': '13 Eyes. Resolutions have been adopted. The bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 55, which approves the amendment to the Saint Anthony Urban Redevelopment Plan for the Sloan's Lake BLOCK three project to authorize the creation of two sales tax increment areas and a require'"
    ],
    "A bill for an ordinance authorizing and approving an amendment to the St. Anthony Urban Redevelopment Plan to add the Sloans Block 3 Project and to Create the Sloans Block 3 Sales Tax Increment Areas. Approves an amendment to the St. Anthony Urban Redevelopment Plan for the Sloans Block 3 Project to authorize the creation of two Sales Tax Increment Areas to provide funding for the preservation and redevelopment of the historic Kuhlman building and auditorium into new affordable housing, retail and restaurant space and townhomes in Council District 1. The Committee approved filing this bill at its meeting on 1-24-17.": [
        "'speaker_0': 'Speakers will have 3 minutes unless another speaker has yielded his or her time, which would result in a total of 6 minutes. On the presentation monitor. On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must director comments to council members please refrain from profane and obscene speech'",
        "'speaker_0': '. Direct your comments to council as a whole and and refrain from individual or personal attacks. We really don't like those. Okay, Councilman Espinosa, will you please put Council Bill 55 on the floor? Thank you, Mr. President. I move that council bill 55 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and it the public hearing for counsel, bill 55 is open. May we have the staff report? Tracy Huggins, it's good to see you.'",
        "'speaker_7': 'Good evening, Mr. President. Members of City Council. My name is Tracy Huggins. I am the executive director of the Denver Urban Renewal Authority here this evening to request of City Council your consideration of an amendment to the St Anthony Urban Redevelopment Plan to add the Sloan's BLOCK three project and to create the Sloan's BLOCK three sales tax'",
        "'speaker_7': 'increment areas. The scene at the Urban Redevelopment Area was established following City Council approval in July of 2013 and is comprised of approximately 32 acres generally bounded by Stewart Street on the west west Colfax Avenue on the South Perry Street on the East and West 17th Avenue on the North.'",
        "'speaker_7': 'The majority of the urban redevelopment area was occupied by the Saint Anthony Central Hospital campus prior to its closure. The redevelopment of the former hospital campus is primarily supported by two metropolitan districts, which use additional property taxes levied on the property to finance a variety of infrastructure improvements.'",
        "'speaker_7': 'Even with the use of metropolitan district financing, there was concern that the key objectives of the redevelopment plans could go unrealized without potential gap financing to support catalytic projects along West 17th Avenue and along West Colfax Avenue. In particular, the Colfax Parcel or BLOCK seven was challenged by difficulty in attracting new neighborhoods, serving retail to a largely'",
        "'speaker_7': 'blighted stretch of West Colfax and the anticipated extraordinary cost to support structured parking to meet the urban design objectives of Main Street zoning. The potential gap financing for the common parcel or BLOCK three was driven by a desire to preserve a 1939 structure that requires extraordinary abatement and renovation, including a complete replacement and mechanical systems historically served'",
        "'speaker_7': 'by the main hospital. Central Plan. With those concerns in mind. City Council approved the Urban Redevelopment Plan, which encompasses the nine blocks noted in this diagram. Council also approved the creation of a property tax increment area that is coterminous with the metropolitan district boundaries.'",
        "'speaker_7': 'Any property tax increment generated within the property tax increment area can only be utilized on approved projects. To date, council has approved two projects within the urban redevelopment area. Thus the BLOCK seven West Project, which will be the future home of the Alamo Drafthouse Theater.'",
        "'speaker_0': 'Miss Hawkins? Yes. Our, uh, you know, illumination has gone there, so if you could tell us the pages that you're on, that'd be helpful.'",
        "'speaker_7': 'Do you? The pages of.'",
        "'speaker_1': 'What?'",
        "'speaker_7': 'Mr. President, of this. So do you see this on your. On your screen?'",
        "'speaker_0': 'Some of us do. Does everybody have one? This one's on.'",
        "'speaker_8': 'The back.'",
        "'speaker_7': 'One. I will not be offended at all if you choose to turn around and look at your monitors instead of facing me.'",
        "'speaker_0': 'Okay. I think. I think some of us have enough.'",
        "'speaker_1': 'Yeah. They're not on there.'",
        "'speaker_0': 'Yeah, we have.'",
        "'speaker_7': 'Just like you have the slide slides. So I actually. Maybe I can do this. I believe I am on slide four.'",
        "'speaker_0': 'Okay, great.'",
        "'speaker_7': 'Do you want to give me a head? Not if you're. If you're with me on slide four, make sure we're synched up.'",
        "'speaker_0': 'Is that three or four on an hour's, guys? Four. Okay.'",
        "'speaker_7': 'So far, so good on slide four. Yeah.'",
        "'speaker_0': 'Okay. Go ahead.'",
        "'speaker_1': 'All right. All right.'",
        "'speaker_7': 'So, to date, council has approved two projects within the urban redevelopment area, the Sloan's BLOCK Seven West Project, which will be the future home of the Alamo Drafthouse Theater and the BLOCK seven East Project, which includes the redevelopment of the existing Raleigh Office Building and the construction of new retail along Colfax.'",
        "'speaker_7': 'Those projects were approved by City Council in January of 2015. The project, being considered this evening through an amendment to the Urban Redevelopment Plan, is the redevelopment of BLOCK three, which is generally bordered by West 17th Avenue, Perry Street, West 16th Avenue and Quitman Street.'",
        "'speaker_7': 'This launch block three project site covers an entire block within the urban redevelopment area and includes the existing vacant former nurse's dormitory, the Coleman Building and auditorium building. So I'm now on Slide six. So still with me?'",
        "'speaker_0': 'Yup.'",
        "'speaker_7': 'All right. So the BLOCK three project would include the following components. Rehabilitation of the 44,000 square foot historic Coleman building, a former nurse's dormitory into multifamily, affordable housing rehabilitation of the auditorium attached to the Coleman building into a 5000 square foot retail and or restaurant space.'",
        "'speaker_7': 'Construction of a new 2200 square foot single storey retail building. Construction of approximately 25 new market rate townhomes. Construction of a 4300 square foot public plaza, as well as the installation of streets, utilities and public space within the site, as well as storm drainage facilities for block three and adjacent blocks.'",
        "'speaker_7': 'So I'll touch on each of those components briefly. As far as the affordable housing, as part of the implementation of the previously negotiated affordable housing plan for the Saint Anthony site, the six story Coleman building will be redeveloped to include 49 affordable units.'",
        "'speaker_7': 'The building amenities will include an onsite leasing office community room with an entertainment area and kitchenette, as well as a fitness center. The building will have 30 reserved surface parking spaces and an additional 15 reserve parking spaces in the existing parking garage that is located on BLOCK five.'",
        "'speaker_7': 'This slide and I'm now on slide number eight provides a breakdown of the unit mix in the Coleman building. As you can see, of the 49 total units, three will be studios. 37 will be one bedroom, and the remaining nine units will be two bedroom.'",
        "'speaker_7': 'This slide also provides the expected expected rents for the various types of units, as well as the current income guidelines for persons at 60% of area median income. Or am I? I will note that this project did receive 4% low income housing tax credits through their application to the Colorado Housing and Finance Authority.'",
        "'speaker_7': 'So the income will be limited to 60% of AM I. On Slide nine, we show the retail, restaurant and Public Plaza components of the project. As I noted previously, it will include new retail, restaurant and public spaces. The renovated Coleman Auditorium building will include 5000 square feet of retail and or restaurant space.'",
        "'speaker_7': 'There will also be new construction at the corner of West 17th Avenue and Perry Street to provide an additional 2200 square feet of retail and restaurant space, along with a new 4300 square foot public plaza. These uses will be supported by approximately 32 parking spaces on block three.'",
        "'speaker_7': 'This project will also include for sale housing by virtue of the sale of approximately 25 for sale market rate townhomes. These townhomes will be three and four stories and will will face West 17th Avenue, Quitman Street and West 16th Avenue.'",
        "'speaker_7': 'Each townhome will have either one or two garage parking for their homeowners. The Urban Redevelopment Plan authorizes Jerry to finance projects within the urban redevelopment area by use of tax increment financing. The plan amendment will authorize the use of property tax increment financing as well as to add the loans.'",
        "'speaker_7': 'BLOCK three sales tax increment areas. Doris Gaff has done a thorough underwriting of the project and has reviewed the redevelopment budget and performance submitted by the developer and believes there is a financial gap in the project of approximately $6.5 million.'",
        "'speaker_7': 'This amount is subject to change based on the final pricing of those 4% low income housing tax credits. This financing gap will be addressed by reimbursing eligible costs through sales and property tax increment generated by the redevelopment of the property that is block three as well as amounts from the broader property tax increment area.'",
        "'speaker_7': 'Following redevelopment, the site is anticipated to generate approximately $120,000 per year in net property tax increment and approximately $95,000 per year in net sales tax increment. This amount of increment being generated from block three alone would not be sufficient to repay the entire $6.5 million financing gap in the project.'",
        "'speaker_7': 'Therefore, the incremental tax revenues from block three will be supplemented by taking an amount from the property tax that is generated through the development of blocks one, two and four of about $850,000 per year. And those amounts, again in combination will be used to reimburse the developer for those eligible expenses over a period not to exceed 25'",
        "'speaker_7': 'years. In approving the Saint Anthony Urban Redevelopment Plan, City Council found the Urban Redevelopment Plan to be in conformance with the Denver Comprehensive Plan 2000 and its applicable supplements. Accordingly, any amendment to the Urban Redevelopment Plan must be in conformance with the Urban Redevelopment Plan objectives in order to maintain the continuing conformance with comp plan 2000.'",
        "'speaker_7': 'The general objectives of the Saint Anthony Urban Redevelopment Plan are to reduce or eliminate blighted conditions and to stimulate the continued growth and development of the urban redevelopment area. The proposed project meets the following objectives of the Saint Anthony Urban Redevelopment Plan to eliminate the present and growing factors which contribute to blight in the urban redevelopment area'",
        "'speaker_7': '. To renew and improve the character and environment of the area and its surroundings by preventing or ameliorating economic, physical and environmental deterioration. To encourage residential retail and commercial development and redevelopment that is socially and economically inclusive and from which the urban redevelopment area and its environs can draw economic strength to encourage and protect existing development within and'",
        "'speaker_7': 'immediately adjoining the area by creating conditions from which these areas can draw new economic strength to more effectively use under to more effectively use underdeveloped land within the area to encourage land use patterns within the area where pedestrians are safe and welcome to promote a diverse mix of dense housing options to encourage re-use of existing buildings where'",
        "'speaker_7': 'appropriate, including adaptive reuse. To promote a diverse, sustainable near neighborhood economy, including mixed use and commercial development opportunities within the urban redevelopment area, and to improve access to healthy transportation options and existing parks. In approving the proposed amendment to the Urban Redevelopment Plan.'",
        "'speaker_7': 'There are a number of legislative findings that city council must make. Those include the finding that the Sloan's BLOCK three project is located within the Saint Anthony Urban Redevelopment Area and will promote the objectives set forth in the Saint Anthony Urban Redevelopment Plan.'",
        "'speaker_7': 'Also, finding that a feasible method exists for relocation of displaced individuals and families and business concerns. The project area contains no residences, therefore no individuals or families will be displaced. Additionally, due to the vacancy of the site, no business concerns will be displaced as a result of the project.'",
        "'speaker_7': 'Asking council to find that written notice of this public hearing has been provided to all property owners, residents and owners of business concerns in the resolution setting this public hearing. City Council requested Dura to undertake this task. Written notice was mailed first class mail to all known property owners, residents and owners of business concerns in the Saint'",
        "'speaker_7': 'Anthony Urban Redevelopment area. That mailing was undertaken on January 13, 2017, which is at least 30 days prior to this public hearing. Council must find that no more than 120 days have passed since the first public hearing before City Council on this plan amendment.'",
        "'speaker_7': 'Tonight is the first public hearing before Council on this plan amendment. The statute also requires that two years must elapse before council consider an urban redevelopment plan amendment if they previously failed to approve an Urban Redevelopment Plan amendment for this project.'",
        "'speaker_7': 'This is the first consideration by City Council of this planned amendment for this project. Also, the plan amendment contains no property that was included in a previously submitted plan amendment that was not approved by City Council. As such, the requirement to wait at least 24 months since any prior public hearing is inapplicable.'",
        "'speaker_7': 'Must find that the plan amendment is in conformance with the Denver Comprehensive Plan. To that end, on January 18th, 2017, the Denver Planning Board, unanimously, with one abstention, found that the proposed amendment to the St Anthony Urban Redevelopment Plan conforms to the Denver Comprehensive Plan and applicable supplements.'",
        "'speaker_7': 'And a letter to the. To this effect has been submitted as part of the record of this hearing and is requesting that city council concur with the planning boards finding. The St Anthony Urban Redevelopment Plan is amended by the proposed amendment will afford maximum opportunity consistent with the sound needs of Denver as a whole for the rehabilitation'",
        "'speaker_7': 'or redevelopment of the area by private enterprise. The development team of Trail Brake Partners and Copland Company are the developers and private development entities who intend to undertake the redevelopment project. Council must find that the city and county of Denver can adequately, adequately finance and agreements are in place to finance any additional city and county of Denver'",
        "'speaker_7': 'infrastructure and services required to serve development within the Sloan's BLOCK three project area for the period during which the incremental sales taxes are paid to the authority. The plan allows for cooperative agreements between the city and borough to address additional infrastructure requirements and city services should they arise.'",
        "'speaker_7': 'The Urban Renewal Authority has notified Council must find that the Urban Renewal Authority has notified the boards of each other taxing entity whose incremental property tax revenue would be allocated under the Urban Redevelopment Plan, and that an agreement has been negotiated governing the sharing of incremental property tax revenue.'",
        "'speaker_7': 'This amendment to the Saint Anthony Urban Redevelopment Plan invoke certain new statutory requirements. Recall that the original plan was approved in 2013, and now that we are coming forward in 2017, there are provisions of House Bill 15 1348 governing urban renewal activities that now require that City Council before City Council can approve a new urban renewal plan'",
        "'speaker_7': ', or in this case, an amendment to an existing plan. You must find that an agreement has been entered into between Doura and the affected taxing districts in regard to the allocation of property tax increment to the project. There are three other property taxing districts.'",
        "'speaker_7': 'Those being Denver Public Schools. The Urban Drainage and Flood Control District. And the South Sloan's metropolitan districts that I mentioned at the beginning of this presentation. To satisfy these new statutory requirements. Dura has negotiated agreements with these three taxing entities.'",
        "'speaker_7': 'First, I'll speak to the school funding agreements between Durham and DPS in recognition of the proposed number of residential units expected to be delivered across the entire Saint Anthony Urban redevelopment area, including those blocks which do not have any direct involvement.'",
        "'speaker_7': 'During negotiating an agreement with Denver Public Schools, which provides that $2.5 million will be paid to DPS over a ten year period to address the impact the Saint Anthony redevelopment will likely have on their ability to provide services to the children in the area.'",
        "'speaker_7': 'The payment to DPS will be made from incremental property taxes generated from blocks one, two and four and will be paid first before any reimbursement to the BLOCK three project. As the BLOCK three project was part of the original evaluation that DPS made.'",
        "'speaker_7': 'In looking at the redevelopment of the entire area, they are finding, they being DPS, that there is no additional impact as a result of us bringing forward the BLOCK three project and they have acknowledged the same in an agreement with the Urban Renewal Authority.'",
        "'speaker_7': 'With urban drainage and flood control. They also were notified of the proposed amendment to the redevelopment plan to add the BLOCK three project. Following that notification, urban drainage evaluated the impact the project would have on their services and determined that the BLOCK three project would have minimal service impacts and have agreed to allow the full available amount'",
        "'speaker_7': 'of property tax increment generated by their mill levy to be allocated to the project. This again was memorialized in a letter agreement between urban drainage flood control and the Urban Renewal Authority and finally with the loans metropolitan district.'",
        "'speaker_7': 'At the time, the St Anthony Urban Redevelopment Plan was approved, including the creation of the seven block property tax increment area. Dura and the South Sloan's Lake Metropolitan Districts entered into a cooperation agreement under which Defra agreed to pay over to the Metropolitan District any amount of property tax increment generated by their mill levy.'",
        "'speaker_7': 'So in closing, Dora is very pleased to be working with the city and the developer to bring forward this project. The redevelopment of this site, the adaptive reuse of an existing historic building, the addition of addition of new retail offerings and a mix of housing options will create a truly mixed use.'",
        "'speaker_7': 'Mixed income development on this block. This loans block three project advances many of the urban redevelopment plan objectives. And we are asking for your favorable consideration of this amendment and will be I will be happy to answer any questions you may have at the appropriate time.'",
        "'speaker_0': 'Thank you, Ms.. Huggins. We have two speakers this evening. When I call you names, if you would please come to the front. Cameron. Cameron. Bertrand and Doug. Elements. Cameron. You'll be first, Mr. Burch, on the 3 minutes. Thank you very much.'",
        "'speaker_0': 'Hi. I am Cameron Bertrand and I live at 1145 Gaylord Street in Denver. I also work for TFG, South Sloan's Lake One LLC, which is the current property owner of the site. So I just wanted to come up and add my support to the passage of adding this project to the urban renewal area, but also as the'",
        "'speaker_0': 'developer of the St Anthony's site. Just take a moment to say that in some ways this is the culmination of a story that started back in 2013 when the council created the urban renewal area. And I think this is just the kind of project that we hoped would come forward.'",
        "'speaker_0': 'Historic preservation, environmental remediation, affordable housing, open space. It's a great outcome if you haven't been out to the site in a while. It's changed a lot. There are people living there and people shopping there and people eating there.'",
        "'speaker_0': 'And I think the variety of housing and neighborhood services that we wanted to see come about through the redevelopment of St Anthony's is really happening. And so in closing, I guess I would just thank everybody on City Council, your staff and in particularly the city and county of Denver staff, especially the public works and in this case'",
        "'speaker_0': 'also community planning and development. A project like this doesn't often go off this well this fast. And really three and a half short years, the place has really transformed. And I credit that to the partnership with the city.'",
        "'speaker_0': 'Finally, I would just like to say thanks to Trail, Brake and Coble, it's always great to work on Denver projects with Denver developers and the Denver Urban Renewal Authority for all their work not only on this project but throughout the city.'",
        "'speaker_0': 'Anthony site. Thanks. Thanks so much. Available for questions if needed. Thank you, Mr. Bertram. Doug Alliance.'",
        "'speaker_6': 'Hi. Good evening. My name is Douglas Honowitz and I live at 99, 63 East 29th Avenue in Denver. And I'm here on behalf of Trailer Park Partners and Cable Joint Venture Partnership, known as Sloan's BLOCK three LLC. Catchy name that is the applicant and redevelop her for the purposes of the discussion here this evening in Sloan's BLOCK'",
        "'speaker_6': 'three project. I echo what what Cameron was saying there this is tonight is really a culmination of years of work from a lot of people, both in the public and in the private sector, really trying to bring forward a terrific vision.'",
        "'speaker_6': 'And I appreciate council's consideration of the matter. The project that has been designed and that's being presented tonight is, is is really thoughtfully put together to try to realize some of the items that were contained in the general development plan for the St Anthony's area, in total from the urban redevelopment plan that was put in place back'",
        "'speaker_6': 'in 2013. And from our understanding of conversations over the years with the community members that were there historically and that have subsequently moved into the area, the vision really is to deliver upon a mixed use, mixed income project that serves the housing needs and the the services for this neighborhood in total from the work of the Borough'",
        "'speaker_6': 'Community Groups, City Council and OED Jafa, who has been actively involved in it and others tonight we can realize that vision. Restoring an old building and putting it back into use. That's a connection to the past and very important past of St Anthony's here.'",
        "'speaker_6': 'This is one of those key pieces of the project, the hospital in total that's being saved and reused to continue to serve the community of Denver to mixed housing options for sale for and for rent and restaurant and other other services to the area.'",
        "'speaker_6': 'We just really think it's going to be a catalytic project that is respectful to the neighborhood boundaries, strengthens the relationship with the park. And we just we're excited to be bringing it forward and very much appreciate your consideration of it tonight and look forward to your support of this measure.'",
        "'speaker_6': 'Thank you very much. And likewise, I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you, Mr. Leno. It's all right. This concludes our speakers. Now, are there questions for members of council? All right. Public hearing from counsel Bill 55 is now closed. Comments from his counsel, Councilman Espinosa. Yeah, I just I'm glad that Cameron is here.'",
        "'speaker_0': 'Doug here with Tracy. I want to thank you, Cameron. I know early in my time in office, we had talks about the balance of this property and what it would be. And there was a question about the life of the Coleman building and what was going to be viable there.'",
        "'speaker_0': 'And we knew that we needed partnerships. And you established how that could be, but we still needed to find a developer willing to follow through. And when I met Doug and he came forward with this concept for affordable housing, it sort of filled a big it was it was filled a big void that was very much in'",
        "'speaker_0': 'need. And so I really I want to thank you for for bringing this forward being and everybody, Doug in our dialog and Tracy for helping see this through because we had good public meetings, we got good output and I mean good input and we're at a place on this development which is which is well, I'm heartened by'",
        "'speaker_0': 'this phase three. I'm not going to lie. I wish I wish it wasn't going to beat out the, you know, two blocks that are still sitting there vacant. And I wish we could have sort of built that sort of collaboration and seen those things through, particularly in BLOCK Two, because I thought we we had a good dialog'",
        "'speaker_0': 'leading up to that. But anyway, I do I probably shouldn't have mentioned that, but I do I do think that there is a nexus for the future and the vision you guys had put forward. And it is missing those two pieces.'",
        "'speaker_0': 'And I look forward to someday moving forward on that. But in the meantime, I think this is a great proposal and I think the city and the team for persevering and making it happen. So to Doug, Tracy and Cameron, thank you very much.'",
        "'speaker_0': 'Looking forward to supporting this. Thank you, Councilman Espinosa. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I just want to go back to when these two gentlemen started this project with a lot of community meetings with the Sloan's Lake neighborhood. I attended a number of those at the old St Anthony's Hospital when the building was still there.'",
        "'speaker_8': 'And to see the progress that's been made in this short time frame and the fact that you're here tonight and there aren't any residents from the community, you know, testifying, says a lot about the important work that you have done with the Sloan's Lake neighborhood over these years.'",
        "'speaker_8': 'So first, I want to say congratulations and I'm happy to support these bills tonight. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Ortega. Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. Affordable housing, affordable housing, affordable housing. Thank you for what you're doing.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Castro and Councilman Lopez.'",
        "'speaker_5': 'Thank you, Mr. President. I also wanted to extend my support for these for this bill. You know, it's been a long time coming. And, you know, I grew up just south of the hospital. My sister was born at the hospital.'",
        "'speaker_5': 'Broken nose at the hospital, not at the hospital, but, you know, ended up there. They didn't do a good job, obviously. But I'm pleased to see it develop. I, you know, had a meeting, a good meeting with Dora and Rose Cameron with the development side to really talk about the affordable housing and, you know, the effort that'",
        "'speaker_5': 'was made there. But the need in the future to really think about when we look at affordable housing and look at units that they are not just one bedrooms, that they are two, two and three bedrooms, because that's when we talk about families.'",
        "'speaker_5': 'Right. We can call one bedrooms, affordable housing anywhere in the city. But when you really look at the need that's out, there's two bedrooms. So when we look at developments, we look at it from look at it with opportunity to create those two bedrooms.'",
        "'speaker_5': 'So here's the here's the deal on West Colfax. We've seen such a lack of of development and such. And it's been really hard and a lot of hard work with the West. Colfax did kind of pushing that forward.'",
        "'speaker_5': 'And I think it's about time. It just saddens me that we can't do more. The retail side of this site to really bring that out. You know, I think Councilman Herndon, this is something that you and I have both talked about in the past.'",
        "'speaker_5': 'But when we look at the edges of this city, we have we are competing with our regional neighbors. They're building Belmar. We're building residential. So it's a it's important for us to be able to keep those Denver dollars and the Denver tax base in Denver and to really support those projects that do that and add a good'",
        "'speaker_5': 'quality of residential to the neighborhood. So here's to it moving forward. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Lopez, it has been moves in Sacramento. Secretary Roll Call.'",
        "'speaker_3': 'Espinosa. Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Gilmore. I. Herndon.'",
        "'speaker_0': 'I.'",
        "'speaker_3': 'Cashman. I can eat. Lopez. I knew Ortega. Sussman Black. All right. Clark. All right, Mr. President.'",
        "'speaker_0': 'I police close voting announce the results. 3939 Council Bill 55 has passed. Congratulations. All right, but we are not done. Councilman Espinosa, will you please put Council Bill 57 on the floor? Yes, Mr. President. I move that. Oh, God, I got it.'"
    ],
    "A bill for an ordinance approving a proposed Cooperation Agreement for Sloans Block 3 Sales Tax Increment Areas in the St. Anthony Urban Redevelopment Area between the City and County of Denver and Denver Urban Renewal Authority. Approves a Cooperation Agreement with the Denver Urban Renewal Authority (DURA) for the Sloans Block 3 Sales Tax Increment Areas within the St. Anthony Urban Redevelopment Area in Council District 1.  The last regularly scheduled Council meeting within the 30-day review period is on 2-27-17.  The Committee approved filing this bill at its meeting on 1-24-17.": [
        "'speaker_0': 'That's my bet. Six 5656 And I move that council bills 56 to be placed upon final consideration and do pass. It has. Now. There we go. It's been moved in. Second it. The public hearing for council bill 56 is now open.'",
        "'speaker_0': 'Has a staff report.'",
        "'speaker_6': '57.'",
        "'speaker_0': 'Oh, I see, I see. Okay, so this is I'm sorry, four, four members of council. We're going to vote on 56 as part of this companion bill, and then we're going to go to the public hearing for 57.'",
        "'speaker_0': 'So we're going to this is the part of the companion bill has been moved and second it. We don't have any comments by members of council. Madam Secretary, roll call.'",
        "'speaker_3': 'Espinosa, i Flynn I Gilmore, i. Herndon. High Fashion. I can eat. Lopez. I knew Ortega. Sussman Black Eye. Clark. Hi, Mr. President.'",
        "'speaker_0': 'I please close voting, announce results.'",
        "'speaker_3': 'See Councilman Herndon's.'"
    ],
    "A bill for an ordinance authorizing and approving an amendment to the St. Anthony Urban Redevelopment Plan to add the Sloans Block 9 Project. Approves an amendment to the St. Anthony Urban Redevelopment Plan for the Sloans Block 9 Project to authorize the use of property tax increment financing (TIF) to provide funding for development to include approximately 176 units of income restricted permanently affordable senior and disabled housing, up to 20,000 square feet of ground floor medical office and clinic space, 6,500 square feet of senior activity center, a publicly accessible 5,000 square foot amenity deck and 125 parking spaces in Council District 1. The Committee approved filing this bill at its meeting on 1-24-17.": [
        "'speaker_0': '13 Ice 13 Ice Council 56 has now been approved. All right, Madam Secretary, we've got onto Council 1257.'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'All right, Councilman Espinosa, will you please put Councilor 57 on the floor? Yes, Mr. President. I move that council bill 57 be placed upon final consideration and do passed. It has been moved in second. It published here for council 57 is open.'",
        "'speaker_0': 'May we have the staff report? The circuits.'",
        "'speaker_7': 'You made. Hello again. Tracy Huggins, the executive director of the Denver Urban Renewal Authority. And Mr. President and members of council, this is a new and separate public hearing on another project, but it is all related to the same urban redevelopment area that I just described, complete with its history.'",
        "'speaker_7': 'So with your permission, may I go past those slides as opposed to having to repeat them again?'",
        "'speaker_0': 'You have all of my permission.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_7': 'So with your permission, let's.'",
        "'speaker_1': 'Fast forward to.'",
        "'speaker_7': 'Slide.'",
        "'speaker_1': 'Four.'",
        "'speaker_7': 'And again, I'm now going to ask that you you don't you don't have the same this presentation. It's a continuation of the one that you had previously.'",
        "'speaker_0': 'So we'll work as long as you put it up on the screen.'",
        "'speaker_7': 'The and forgive me for being presumptuous because I have now added to the list of previously approved projects. BLOCK three. Mm hmm. And now the project that we are bringing forward, is that on block nine?'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'With again, within the same urban redevelopment area. And this project area is the the portion of block nine. Again, BLOCK three was the entire block. This is just a portion of block nine, generally fronting West Colfax Avenue between Quitman and Perry streets.'",
        "'speaker_7': 'This Sloan's BLOCK nine project site has had several previous uses, including a used car lot, a cell phone store in the Yeshivah School dormitory. This is a picture of the former used car lot, the cell phone store and the dormitory.'",
        "'speaker_7': 'I do, just as I said in council committee, want to be fair to the owners of those properties. They did not look just like that before they were closed and and boarded up. But you can see just how quickly properties, once those uses have been taken away, can begin to change on the site.'",
        "'speaker_7': 'And this is all. And those those private previous uses have since been demolished to allow for the development of the BLOCK nine project. And the BLOCK nine project is also known as Vida at Sloan's Lake, and it will include a new 217,000 square foot building consisting of a seven story tower with 112 units of senior rental housing'",
        "'speaker_7': 'at 60%, ami a five story tower with 64 units of senior rental housing with affordability at the 30, 40, 50 and 60% AMI levels. A 20,000 square foot community health clinic on the main level and a senior activity center and rooftop community amenity space.'",
        "'speaker_7': 'There will be 125 parking spaces. 109 of those will be below grade with 16 spaces above grade and on the surface. This is a very busy slide and but it is intended to show the unit count the levels of affordability.'",
        "'speaker_7': 'If you can see this slide, you'll see on there that there is a section that says V to 9%. A section that says V to 4%. And then the total. The reason for that is this project was successful in applying both for 4% and 9% credits from again, from the Colorado Housing and Finance Authority.'",
        "'speaker_7': 'Lot of information on here. And there are representatives from D who are here who will be able to speak to this. But the long and the short of it is that there are 175 tenant units. All of these are one bedroom units.'",
        "'speaker_7': 'There is one unit that is a two bedroom, and that will be for the the project or the site manager. And again, you can see that the rents here are for those persons at between 30 and 60%. Am I included in here is a footnote that says although the AMI thresholds show a mix of up to 60%'",
        "'speaker_7': 'AMI, in reality the household served by senior and disabled subsidy are at or below 30% AMI. So this is intended to be a project that is a very deep level of affordability. As I mentioned previously, this project was successful in procuring low income housing tax credits from from Chiapas.'",
        "'speaker_7': 'They are also bringing other forms of assistance to this. Even with that, they still have been able to demonstrate to the satisfaction of the Urban Redevelopment Authority or the Urban Renewal Authority that there is a $5.5 million financing gap that is expected to be addressed through property tax increment generated by that broader seven block property tax increment'",
        "'speaker_7': 'area as the project is to be undertaken, owned and operated by the Denver Housing Authority. The property will be largely tax exempt. Therefore, we are not requesting council to approve a property tax increment area for this project. Instead, the property tax increment generated by the redevelopment of blocks one, two and four a gain of approximately $850,000 per'",
        "'speaker_7': 'year will be used to reimburse VHA for eligible expenses over a period not to exceed 25 years. Again as council found the urban redevelopment plan to be in conformance with comp plan and its applicable supplements. We are also needing to make sure that any project continues to meet those objectives of the Urban Redevelopment Plan.'",
        "'speaker_7': 'Again. I would prefer not to have to walk through all of those components which this project is in clear conformance with the Urban Redevelopment Plan objectives. So instead of going through each of those, what I would call out is that there is a different finding here as opposed to the project, the BLOCK three project, which is the'",
        "'speaker_7': 'encouraging of high and moderate density development where appropriate, including structured parking. As you can see, this is a fairly dense development on this site. I will, however, go through each of these legislative findings because I do think that is a key component in making sure that we have met the requirements under state statute.'",
        "'speaker_7': 'So we are asking that council find that the Black Nine Project is located within the Saint Anthony Urban Redevelopment area and that it will promote the objectives set forth in the Saint Anthony Urban Redevelopment Plan. Again, need to find that a feasible method exists for relocation of displaced individuals and families and business concerns.'",
        "'speaker_7': 'At this point, there are no residences or businesses on the site. Therefore, there are no requirements for and for us to undertake relocation. Written notice of this public hearing was made to all known property owners, residents and owners of business concerns in the entire Saint Anthony Urban Redevelopment Area on January 13th of 2017, which again is at'",
        "'speaker_7': 'least 30 days prior to this public hearing. Statute requires that no more than 120 days have passed since the first public hearing before City Council on the Plan Amendment. And tonight is that first public hearing. Statute also requires that two years must elapse before council consider can consider an amendment to the plan.'",
        "'speaker_7': 'If you previously failed to approve the Urban Redevelopment Plan amendment for this project, same as with the BLOCK three project. This is the first consideration by Council of an Urban Redevelopment Plan amendment for this project. Finding that the project is in conformance with the Denver Comprehensive Plan.'",
        "'speaker_7': 'We also took this plan amendment to Planning Board on January 18th, 2017, with the same result where Planning Board voted unanimously with one abstention, to find that the proposed amendment to the St Anthony Urban Redevelopment Plan conforms to the Denver Comprehensive Plan and its applicable supplements.'",
        "'speaker_7': 'And a letter to that effect has again been submitted to you as part of this hearing. The Saint Anthony Urban Redevelopment Plan, as amended by the proposed amendment, will afford maximum opportunity consistent with the sound needs of Denver as a whole for the rehabilitation or redevelopment of the same art scene at the new Urban Redevelopment Area by'",
        "'speaker_7': 'Private Enterprise. Again, the Denver Housing Authority will be the developer of the BLOCK Nine Project, and their mission includes the provision of affordable housing for special populations, including the elderly and the disabled. We must find that city and county of Denver can adequately finance and agreements are in place to finance any additional city and county of Denver'",
        "'speaker_7': 'infrastructure and services required to serve the development within the Sloan's BLOCK nine project area for the period during which incremental taxes are paid to the authority. And again, the plan allows for such cooperative agreements to be put in place between the city and Duryea to address those additional infrastructure and services needs should they arise.'",
        "'speaker_7': 'And the Urban Renewal Authority has notified the boards of each other. Taxing entities whose incremental property tax revenue would be allocated under the plan and has in an agreement has been negotiated governing the sharing of incremental property tax revenue.'",
        "'speaker_7': 'So very similar to what we had discussed previously. There are as a result of bringing forward this amendment after the applicability of House Bill 1348, we now are required to enter into agreements with those three taxing entities. Those, again, are Denver Public Schools, urban drainage and flood control.'",
        "'speaker_7': 'And this out of South Sloan's Lake metropolitan districts. Again, we we have already negotiated an agreement with DPS, the school funding agreement, where we will be paying DPS in total $2.5 million over ten years from the property tax increment generated from blocks one, two and four.'",
        "'speaker_7': 'And again, they're scheduled. Annual payment will be made in priority above any repayment to block three or block nine. This is probably a good time to say that the remaining amount of the property tax increment coming from blocks one, two and four after we've made that annual schedule payment to DPS, is expected to be generally applied 5050'",
        "'speaker_7': 'between BLOCK three and BLOCK nine. Our goal is to try to repay those obligations at or about the same time. Since there is no additional student impact contemplated from the BLOCK nine project, DPS was willing to accept the previously negotiated agreement as full satisfaction of the redevelopment impact from the St Anthony's Urban Redevelopment area, including that of'",
        "'speaker_7': 'BLOCK BLOCK nine. Similarly, we noticed urban drainage and flood control of the of the BLOCK nine project. And again they concluded that the BLOCK Nine Project would have minimal impact on their services and have determined that there should be no change in the way that the property tax increment from blocks one through seven would be addressed, even'",
        "'speaker_7': 'as we are using a portion of that for BLOCK Nine and similarly for the South Sloan's Metropolitan District, same agreement is in place that we have already agreed that any amount of incremental property taxes attributable to the R.M. Levy will be paid over to them upon receipt by URA.'",
        "'speaker_7': 'We are so pleased to work with the city and DHL on this on this exciting project. It isn't very often that we have a public public, public partnership in in the works here. That is exactly what we have with DHS being the developer, bringing forward the much needed affordable housing for this special population in this area, as'",
        "'speaker_7': 'well as being successful in bringing back a medical presence on this site following the departure of the of the the hospital. So, again, happy to answer any questions. I realized I went through that fairly quickly, but so much of it would have been a repeat of what I said previously.'",
        "'speaker_7': 'Hopefully I didn't miss anything. Happy to answer any questions you may have.'",
        "'speaker_0': 'Thank you. Thank you for the condensed report. Government can get something done. That's awesome. All right. We have two individuals this evening speaking, Cameron Bertrand and Ryan Tobin. Cameron, you're up first. Mr. Bertrand Excuse me. Hello again, everybody.'",
        "'speaker_0': 'Cameron Bertrand 1145. Gillard Street, Denver. Also here again, as the property owner, I would just echo what I said previously about everyone's help and seeing this come about. It's particularly nice in this instance where we're using tax increment to bring forward this level of affordability but also bring health care back to the state.'",
        "'speaker_0': 'I just echo what Tracy said. This is something that was set forward as a goal by Denver many, many years ago. And being here tonight is a is a nice feeling. I would I would add two things to this.'",
        "'speaker_0': 'One is I would think, Darrell, one more time for the Main Street coalition, which was an EPA grant that they got in Denver got and those funds were really instrumental in bringing about this project. On the early days, when it wasn't sure would happen.'",
        "'speaker_0': 'I think they have been unfailing partners in a complex, long conversation. And finally, something that you may not know, but the dormitory that was on this site previously was housed, the kids from the Yeshivah Haim Torah Jewish Boys School, and they've been in the neighborhood for 50 years this year.'",
        "'speaker_0': 'And this project enabled them to use the proceeds from the acquisition of that building to build a new dorm and recommit and stay in the neighborhood for another 50 years. So oftentimes projects like this can have a disrupting effect on the historic members of a community.'",
        "'speaker_0': 'And in this case were not only able to add almost 200 units of new affordable housing, but we were able to keep the folks who've been there recommitted to the neighborhood. So I think that's a nice add to this one.'",
        "'speaker_0': 'Thanks. And again, to the question. Yeah, thank you. Mr.. Ryan Tobin.'",
        "'speaker_6': 'Thank you, Mr. President. Ryan Tobin. 2515 Lawrence Street, Denver, Colorado. Here on behalf of Denver Housing Authority, as you heard, where the developer of this fun project. But as everybody has mentioned, these projects don't happen overnight. So we're very excited about narrowing in on actually closing and breaking ground on this, which will happen sometime in July.'",
        "'speaker_6': 'So we still have our work ahead of us, but this is the first big step for us to make our advancements forward in this program. And so we're happy to be here. Excited about the project and delivering that in the Sloan's development, because it's an amazing area for us to be a part of.'",
        "'speaker_6': 'We always look at having affordable housing solutions within the context of larger developments that are happening so that we do have that affordability that happens within these neighborhoods. And this is a special one where we're able to boast almost 20% of the total units that we'll be meeting that 60% and below EMI with our participation in this'",
        "'speaker_6': 'project. So I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you, Mr. Tobler. All right. This concludes our speakers. Are there any questions for members of council? All right, Councilman Espinosa. I do have a question just because, Cameron, you touched on it, but it's probably it's really a question for all of you.'",
        "'speaker_0': 'And I don't know. I mean, I don't expect you to answer. You have the solution now, but there is a historic Orthodox Jewish family tradition. Do or or, you know, tradition of resonance in this area. And one concern with all of this new development in the size of the units to what Councilman Lopez was saying before, is'",
        "'speaker_0': 'that our new housing isn't doesn't captured the size of households that those Orthodox Jewish families are. And my concern is there is a 50 year history of the yeshiva there. Do you guys, through developers, do DHEA have the tools to do housing preservation for those sorts of family units and family sizes?'",
        "'speaker_0': 'You know, if you don't have the answer here today, I'm challenging you guys to be willing to sort of come back to my office with those ideas, because that's a conversation I've had with the Orthodox Jewish families in the community, along with the sort of historic Catholic families, the larger Catholic families in that community.'",
        "'speaker_0': 'And so as development is pushing for, you know, putting greater and greater pressure in there, it's it's not promoting those sort of households. And it becomes a real difficult equation for the development and subsidy teams. But I do I don't have those answers.'",
        "'speaker_0': 'And so I'm throwing it out there for you guys to consider, because I do want to see the issue there in 50 years to be thriving as well as it has for the last 50 things. Sorry, it's not really a question.'",
        "'speaker_0': 'Rhetorical. I guess the public here for Council Bill 57 is close, comes by the council because when as often as we can I'm so sorry I asked that question, but I didn't want to put it in my comments.'",
        "'speaker_0': 'But once again. Yes. This this was a I'm not going to deny this is a step above and beyond what I think. You know, ESG and company came in here a bit off, you know, bit off, you know, for this redevelopment to figure out how to capture additional development outside of your seven blocks and to then bring'",
        "'speaker_0': 'both health care, deep affordability for seniors, which there is a large senior population in this area. So once again, this is using all those resources that we have as a city, using the the skill set the master developer has to to sort of bring entities together and actually get the outcomes that really sort of, you know, help'",
        "'speaker_0': 'create can maintain the diversity of this neighborhood. So I, I just want once again, I want to commend you all for what you've done and the outreach that you've you've had and throughout this process. And so, again, Cameron, Ryan and Tracy, thank you, guys.'",
        "'speaker_0': 'Happy to say thank you because when. Espinosa Councilman Creech.'",
        "'speaker_1': 'Thank you, Mr. President. I just wanted to add my thank you to this team. This was a very long conversation. And I guess there's two milestones that I want to just note, which is one. Urban renewal projects in Denver had long included some affordable housing through the advocacy.'",
        "'speaker_1': 'A lot of this council, not by policy but by advocacy, including from Councilwoman Ortega and her first terms in council before these terms that she's serving now as well as other champions. But it was a newer tool to actually use it to finance entirely affordable projects in this way.'",
        "'speaker_1': 'And Mary Crest is an example of one of those up and also in Council District one. And I think this is another great example where there used to be this feeling there's just not enough increment created to fund an affordable housing piece.'",
        "'speaker_1': 'But you know, both with a little bit of flexibility in the in the state law and with these larger sites being able to bring an entire affordable housing project to bear as part of a mixed income community rather than just a few units as part of a building is a really long trajectory.'",
        "'speaker_1': 'And in a just, you know, for those who may be newer in council, I just want to note that this is a more recent phenomenon and it's a big deal because it brings you a much larger quantity of units.'",
        "'speaker_1': 'And that's what this that's what this vote tonight represents, is, is, is 176 units. You know, it's not 17 or, or a handful that we got in the inclusionary approach. So so I just wanted to note that and thanked her for the work that they've had to do to kind of get to this different model rather than'",
        "'speaker_1': ', than thinking about these as how much increment is generated right here on this parcel. Right? So, so it took some creativity and flexibility and then to the development team, you know, Cameron this we talk about block nine as if it was a neat block just waiting to be purchased.'",
        "'speaker_1': 'Right. And that's of course not what occurred here. There were many parcels owned by different owners. And for some of us, we felt really strongly that this site would not be complete without more than what was on the seven blocks that you had.'",
        "'speaker_1': 'And we pushed you and we we we asked you to do more. And you did. You went out and and you saw the opportunity. And I think that I hope and I believe that you saw that we that this complemented the entire site.'",
        "'speaker_1': 'And so it wasn't just because council was asking and because the community was asking, but there was a value to having that Colfax piece completed and and bringing together the entire Colfax frontage. So so I think there is a win here for this entire community in terms of the wholeness that it has with this.'",
        "'speaker_1': 'There's certainly a win for the seniors and the disabled folks who will be seated here. And you once asked me, do you realize how much work this is? And let me just publicly say I acknowledge how very difficult this was to get to this day.'",
        "'speaker_1': 'And I appreciate the effort as I know the community does, because much of this, you know, is coming from the residents of the community who were seeing change. They were seeing gentrification, they were seeing displacement. And they wanted to see a significant outcome here.'",
        "'speaker_1': 'And this is one piece of that. We know that some of these residents will come from the north side and west side, you know, where there may be other redevelopment activities. So it will be a chance to keep some folks in a nearby community.'",
        "'speaker_1': 'And that is I just want it for our residents and our public who say, how are we doing things to help displacement. New housing can be a tool to fight displacement if you have a place to bring folks who may be getting redeveloped into a nearby neighborhood.'",
        "'speaker_1': 'And so that's that's what this project represents as well. So why don't you make sure that was on the record for our residents who are always asking that question and just to say thank you to the entire team as well as DHS and OED.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each councilman do.'",
        "'speaker_10': 'Congratulations, community? This project is going to be great and special. We couldn't do without the partners, you know, with our door and the Denver Housing Authority. It is just unbelievable what our partners do for our city, you know, and especially Dura Joshi, you and your staff bring in that expertize and the support.'",
        "'speaker_10': 'I don't know how we would do without you. It's just fantastic. And the whole role that the Denver Housing Authority plays for our whole city, it's just, just very, very rewarding. And we appreciate everything that you're doing. Congratulations on this project.'",
        "'speaker_10': 'I'm looking forward to see all the affordable housing like councilwoman initiative.'",
        "'speaker_0': 'Thank you. Thank you, Councilman new Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. I want to seriously add my profound thanks to be able to sit through two public hearings without having to beg, connive, encourage. An affordable housing component is really a wonderful experience. I know it was difficult to put all the pieces together, but certainly addresses maybe the most profound crisis our city faces.'",
        "'speaker_4': 'I would echo what Councilman Espinosa and Lopez were talking about in the need for larger units. And I would encourage can I beg plead that you do what you can in that direction because it is important to preserve these communities.'",
        "'speaker_4': 'But for what you've done here. Thank you. Thank you. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Cashman. I think that begging, conniving and pleading happened to three years ago. Thank you, guys for how hard you guys have worked on this. It's exciting to see this project come to fruition and with that kind of secretary.'",
        "'speaker_3': 'Raquel Espinosa. Hi, Flynn. Hi Gilmore. Herndon Cashman. Kenny Lopez.'",
        "'speaker_6': 'All right.'",
        "'speaker_3': 'New Ortega Sussman. Black Clark. Mr. President.'",
        "'speaker_0': 'I please close to voting and announce the results. 3913 EIS Council 57 has passed. Congratulations. All right. On Monday, March. Oh, yeah, that's right. We got a we got to do 58. Councilman Espinosa, will you please put the companion Bill 58 on the floor?'"
    ]
}