{
    "A bill for an ordinance concerning the Airport Facilities of the City and County of Denver; authorizing the incurrence of the Interim Note Subordinate Obligation under the General Subordinate Bond Ordinance in a maximum aggregate principal amount not to exceed $700,000,000 in connection with a note purchase agreement to be entered into for the purposes of defraying the costs of certain approved projects, and providing other details in connection therewith; providing the maximum rate and other terms and other details of the Interim Note Subordinate Obligation, which shall be evidenced by a note purchase agreement and a note; authorizing the execution of certain related agreements; ratifying action previously taken; providing for other related matters; and providing the effective date of this ordinance.  Authorizes the Manager of Finance, Chief Financial Officer to issue City and County of Denver, for and on behalf of its Department of Aviation, Airport Subordinate Interim Note Obligations, in a principal amount not to exceed $700 million for the purpose of providing interim funding f": [
        "'speaker_1': 'Thank you. I'll do a quick recap here. Under resolutions, no items have been called out under bills for introduction, no items have been called out under bills for final consideration. Council member Seydou Barker has called out Council Bill 21 Dash 1388 for a vote and Council Member Black has called out Council Bill 21 Dash 1182 for a'",
        "'speaker_1': 'vote under Pendine. No items have been called out. Madam Secretary, would you please put the first item on our screens? Councilmember Commish, will you please put Council Bill 1388 on the floor for final passage?'",
        "'speaker_4': 'Yes, I move that council bill 21, Dash 1388 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It's been moved and seconded. Comments by members of Council on Council Bill 1388. Council members say to Barker.'",
        "'speaker_4': 'Thank you. Just want to go on record voting.'",
        "'speaker_1': 'No for this item. All right. Thank you. Madam Secretary, roll call on Council Bill 1388, please.'",
        "'speaker_5': 'CdeBaca.'",
        "'speaker_3': 'No.'",
        "'speaker_5': 'Clark.'",
        "'speaker_6': 'All right.'",
        "'speaker_5': 'FLYNN Apologies. Herndon.'",
        "'speaker_6': 'Hines All right.'",
        "'speaker_5': 'Cashman. I can't.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Ortega. I. Sandoval. I swear.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Torres.'",
        "'speaker_3': 'I. Black eye.'",
        "'speaker_5': 'Madam President. Hi.'",
        "'speaker_1': 'Madam Secretary. Please close the voting and announce the results.'",
        "'speaker_5': 'One eight and Eyes.'"
    ],
    "A bill for an ordinance amending article XI of chapter 24, D.R.M.C., to ban the sale of flavored tobacco products and accessories. Amends Article IX of chapter 24, D.R.M.C., to ban the sale of flavored tobacco products and accessories. The Committee approved filing this item at its meeting on 11-17-21.": [
        "'speaker_1': 'Ten Eyes Council Bill 21 Dash 1388 has passed. Madam Secretary, please put the next item on our screens. Councilmember Kinney, will you please put Council Bill 1182 on the floor for final passage?'",
        "'speaker_4': 'Yes, I move that council bill 21, dash 1180 to be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved and seconded comments by members of Council on Council Bill 1182. Councilmember Black.'",
        "'speaker_3': 'Thank you, Madam President. I just wanted to call this out for a separate vote tonight so it wouldn't be on consent. Last week I said my piece about the bill, but I hope that my fellow council members will consider defeating this bill because it will not prevent kids from getting their hands on vaping products, but it will'",
        "'speaker_3': 'shut these businesses down. They have leases, they have employees, they have bills, and they are willing to come to the table to work with us to address the real problem. So I encourage.'",
        "'speaker_5': 'People to.'",
        "'speaker_4': 'Vote no.'",
        "'speaker_1': 'Thank you. Councilmember Black, we've got Councilmember Clark. You're up next.'",
        "'speaker_6': 'Thank you, Madam President. I voiced last week my disappointment that we were not able to find a way to use more of a scalpel when dealing with this issue, especially as it came to finding a way to allow for stores to operate with real controls around 21 and over.'",
        "'speaker_6': 'We found a way to navigate that with marijuana, and I do believe that we could find a way to do that when it comes to tobacco as well. I want to express my thanks to the sponsors for all the work that went into getting us here and doing this and taking it on and the approach that they'",
        "'speaker_6': 'took, I think I wish we would have tackled. We have a lot of holes. I think this has made clear in our tobacco licensing, our tobacco, the penalties around what happens when this does get from retailers into the hands of kids, which I think we all are very committed to resolving.'",
        "'speaker_6': 'And so it is my sincere hope that we will continue to tackle those issues, that we won't just leave that on the table and say we have seen these holes in these gaps and we need to close them.'",
        "'speaker_6': 'We need stiffer fines, stiffer regulations around licensing when it comes to selling to minors and continue to work on those things because those things are are not getting fixed by this. Right. Those things will still exist. And all of the retailers who will can sell tobacco products with almost no consequence compared to marijuana, virtually no consequence.'",
        "'speaker_6': 'It just can't be flavored tobacco. So we still have huge gaps. If what we're really committed to is keeping tobacco out of the hands of kids and keeping kids from getting addicted to nicotine. And so I sincerely hope that we will continue to tackle those and in so doing, start to create the framework that didn't exist enough'",
        "'speaker_6': 'for enough council members to be able to see a pathway, I believe, for how we could regulate and have stores responsibly serving 21 plus. And so I think I believe we can get there. But I also believe that not enough people saw that pathway with we were close, but not enough people saw that pathway with the other'",
        "'speaker_6': 'things unresolved and that maybe if we can resolve those things, then we can get just one or two more people to the point where they can see that, okay, with these penalties, with this threat of loss of license, then there is a pathway to create.'",
        "'speaker_6': 'What does that look like when it comes to entry into stores? ID check and keeping and keeping kids safe while also allowing adults more choices. And so it is my sincere hope. Again, I think we missed an opportunity to do all of that.'",
        "'speaker_6': 'But that's it's a lot. There's a lot to bite off what you bought off already, but it is my sincere hope that we will get there. What I think we have to get there on the rest of closing those gaps.'",
        "'speaker_6': 'If we're really committed to, you know, serving our kids and protecting our kids best because those gaps are still there. This does not fix that. And it is my hope that through that, that we can really see a way to create that framework where we can get to the amendment that didn't pass when it comes to 21'",
        "'speaker_6': 'plus stores. So I know that this is a big vote and there is this moment. This is also now, thanks to the amendment that Councilman Cashman brought forward and this body approved, not going to be implemented until June, July.'",
        "'speaker_6': 'Sorry you even told me beforehand and I messed it up again. July of 2023, which also provides some time. Right, that even if this passes and I believe that the votes are there to do that tonight, it was pretty clear from the voting last week in terms of the amendments that the votes are there to pass this'",
        "'speaker_6': '. And so there are two different ways you could say, well, we really need that in there, so let's vote no on this and then let's solve that, and then we can vote yes on it once we've solved that.'",
        "'speaker_6': 'It would appear that the will of this body is to approve this and then put time in and is my hope that in that time that we can solve that because I think it can be solved is going to take some hard work and lots of people at the table, not just at city council meetings, but, you'",
        "'speaker_6': 'know, really working through what does that look like. And and I do think that the the intent and the heart of what this bill is getting at is really important. And I think that all of us agree about that.'",
        "'speaker_6': 'And Brian, almost everybody out here to agrees to that. And so I would have preferred to do it the other way. But I do believe that the heart, the intent is there. And thanks to the amendment, time is built in with the ticking clock that I think is is going to keep a lot of people in this'",
        "'speaker_6': 'room hot on our heels to try to solve those other problems and see if we can get if we can get to a place where we could pass an amendment that does carve out a place for responsible owners, true protections, real consequences that allow the door to be opened for adults and close to kids.'",
        "'speaker_6': 'So that's what I hope we will do that hard work between now and July of 2023. Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Clark. Councilmember Keech.'",
        "'speaker_4': 'Thank you. Council President. I know most of my colleagues made their extensive comments last week, but it was getting late. And so I did not. I want to just, I think, respond to some of the final communications that I've received from folks and just explain why I'll be supporting this bill tonight and some of my fears or'",
        "'speaker_4': 'concerns. I guess the first thing I want to point out is that, you know, the conversation that was led by the sponsors, I think, used a very particular frame in emphasizing stores and purchases to use. But that was never intended, I don't believe, to be the sole purpose of the entire bill.'",
        "'speaker_4': 'It was a point that was being made and I think very early in one of this, you know, first or second committee meetings, I raised the fact that there is this point here about access because a market has.'",
        "'speaker_4': 'Is flooded with attractive products. It's not just about where youth are purchasing their tobacco. And I think the sponsors themselves shared additional data on the fact that these products are being accessed in many places, not just at the retail place, and that this is about restricting access to these products in the markets.'",
        "'speaker_4': 'And I know that those that are opposed have stayed very stuck on the fact that this is about buying it at stores. So limiting purchases at stores to those who are 21 and over may limit some access to those at stores, but it will not limit the accessibility of these products in the overall market, which is what'",
        "'speaker_4': 'the legislation really and truly I think is designed to do. And then the second piece is it's designed to make this very addictive, very expensive product less appealing. And I will get back to that point later. But I do think that that is why, for me, this bill is not just about kids, and it's not just about'",
        "'speaker_4': 'the purchases they make in stores. It's about how appealing we want to make highly addictive profits, products, you know, to profit major corporations. And whether we want to give people an easier path towards moving away from those products by making them less appealing.'",
        "'speaker_4': 'And I think there is a public health benefit to our youth, to our adults, as well as to our overall health care system. I've made those points previously in terms of the costs that we all bear. So if you're more likely to keep smoking because a menthol cigaret is more appealing to you, then we are all more'",
        "'speaker_4': 'likely to keep paying the health care costs for your smoking related illnesses through higher insurance or if you're uninsured, through uncompensated care. That's just a bit of a review of the things I've shared previously that this bill, I don't believe, was ever only about purchases by youth in stores.'",
        "'speaker_4': 'And therefore, to me it is about a much bigger set of public health impacts that a yes vote is going to provide tonight. I want to respond to those who've written to me about Prohibition. This is not prohibition.'",
        "'speaker_4': 'If you take your tobacco through cigarets, cigarets will remain available. If you take your tobacco through a vape product, that products will still be available. This is about restricting a particular type of product. And, you know, the marijuana comparison is an interesting one because, yes, marijuana is legalized, but our legislature has passed bill after bill about potency'",
        "'speaker_4': ', about, you know, product type, about limiting certain things. And I think that that is an example of regulating a product. I agree that prohibition is not an effective strategy. And if this were prohibiting either of these products, then I would agree.'",
        "'speaker_4': 'But they are not prohibiting them. They are saying that we are making a public health decision to reduce the attractiveness of these products. And I will say that another difference is, you know, marijuana users are not pretty much, you know, using a product designed to create cancer, the number of chemicals.'",
        "'speaker_4': 'And I will just say that, you know, I know we've talked about vaping as a harm reduction claim, but there are still multiple chemical products in in vaping products. And we did have vaping related illnesses prior to this pandemic.'",
        "'speaker_4': 'And so there's there's I think the research is not quite clear yet that there are no health impacts from vaping in particular. You know, I've seen counter evidence. So, so I just want to be clear that I am not voting for prohibition tonight.'",
        "'speaker_4': 'I'm voting for product limitations, just as we have voted for product limitations for other types of products in the state of Colorado. I want to just comment really quickly. I'm disappointed that the extension passed, perhaps if it had been shorter.'",
        "'speaker_4': 'But what it was interesting is the sponsor of the amendment for the extension presented it as a proposal to allow businesses more time to adjust. I'm concerned that I now hear about the timeline being provided as one to go back to the drawing board and have the same conversation over again.'",
        "'speaker_4': 'And that would be, I think, a poor use of our public policy resources. And so I am concerned about that mixed message. Right. Is this about more times for businesses to adjust or is this about we're going to spend millions more dollars lobbying from large tobacco companies who, by the way, are funding a massive amount of lobbying'",
        "'speaker_4': 'here? And and are we going to just, you know, debate this again? I hope that that's not the case. And, you know, I think that, you know, encourage those who, you know, they counted the votes. The votes were not there to take a different path.'",
        "'speaker_4': 'Let's not make this a campaign issue. Let's not let's not extend the. Certainty of this, right. This is a definitive vote today and it means that these products will become legal on a date certain. And that is what we should be planning for.'",
        "'speaker_4': 'Our agency should be planning for it. Businesses should be planning for it. So I'm just I'm deeply concerned to hear that this timeline is about taking additional bites at the apple. That's not how it was presented last week.'",
        "'speaker_4': 'So with that, I want to just say that the bill may not be perfect. It does have a timeline that I don't agree with. It's a little longer than I think it needs to be. I don't appreciate the differentiation between different types of cigars, but in net this will reduce the attractiveness of these products and access to'",
        "'speaker_4': 'these products will, you know, will measure over time and we'll see. I also think that we will see additional communities continue to debate these issues and perhaps the state of Colorado. And so I welcome this step forward in reducing access to cancer, causing addictive products in various forms, be they smoked or vaped.'",
        "'speaker_4': 'And I am thankful to the sponsors for helping bring a complex conversation to the Council, and I hope that my colleagues will join me in voting. Yes. Thank you.'",
        "'speaker_1': 'Thank you. Council Member Each Council. Part time tourist. Thank you, Madam President. Just a really quick.'",
        "'speaker_4': 'Comment about.'",
        "'speaker_1': 'Why I'll be voting in.'",
        "'speaker_4': 'Favor of.'",
        "'speaker_5': 'This proposal tonight. It really is about public health. And we make those kinds of decisions not based on positions of.'",
        "'speaker_1': 'Power or who contributes to the tax base. It really is about.'",
        "'speaker_5': 'Harm and.'",
        "'speaker_1': 'And what we can do at a local level.'",
        "'speaker_5': 'To chip away at that harm. Communities across the country are doing this. Will it happen at the state? Likely.'",
        "'speaker_4': 'This conversation isn't bound.'",
        "'speaker_5': 'To end here.'",
        "'speaker_4': 'But our kids aren't.'",
        "'speaker_1': 'Property.'",
        "'speaker_4': 'Owners. They're not business owners.'",
        "'speaker_5': 'But they are the ones who are also telling us we need to make this less accessible to them. They were the ones who came to us about changing it from 18 to 21.'",
        "'speaker_4': 'And it's part of my.'",
        "'speaker_1': 'Responsibility as well for West Denver.'",
        "'speaker_4': 'To make sure.'",
        "'speaker_5': 'That I'm hearing that and responding to that. So I appreciate everybody's commitment and passion to this. This is incredibly complicated, but public health decisions tend to be.'",
        "'speaker_1': 'As we've.'",
        "'speaker_4': 'Experienced over the last two.'",
        "'speaker_5': 'Years.'",
        "'speaker_1': 'So thank you all.'",
        "'speaker_4': 'So much for your input, for attending meetings.'",
        "'speaker_5': 'For emailing us and I look forward to voting in support of the bill tonight.'",
        "'speaker_1': 'Thank you. Thank you, Counsel Pro Tem Torres. And I'll go ahead and round out with my comments before we before I call the vote. This has been quite a process, and I really want to thank both of the bill's sponsors.'",
        "'speaker_1': 'I share some of the comments of Councilman Clark around. I would have preferred us to look at a regulatory path first instead of going right to the end market. We have successfully in Denver regulated marijuana and alcohol and we want to keep kids safe, but we also want to allow adults to be adults.'",
        "'speaker_1': 'If we're talking about the public health risk. Then I think every food article that we possibly could consume could become part of a ban at some point in time if we really want to talk about the broad public health concerns.'",
        "'speaker_1': 'And so with that, you had to really think also about addiction and recovery. And if anybody knows, if you're a good addict, you're going to find your drug of choice. You're going to figure out where to get it.'",
        "'speaker_1': 'It might not matter how much it costs or if it's too expensive. You might take other means to acquire that. And I'm concerned about that. I'm concerned that we have an exemption for one product, but we didn't do an exemption for another product.'",
        "'speaker_1': 'And we don't have to rehash that entire conversation from last week. But it is concerning and especially when folks can go to Aurora or Commerce City and buy products and what's to stop them from bringing them back in to Denver and selling them at a park?'",
        "'speaker_1': 'And then what are the other unintended consequences from what we're doing tonight? What is that going to look like from a broader vantage point? And so I have a lot of unanswered questions. And so with that, I will be a no on this tonight, because I think that we do need to look at the regulatory path and'",
        "'speaker_1': 'fix that and then really delve into the unintended consequences as well. Madam Secretary, roll call on Council Bill 1182, please.'",
        "'speaker_3': 'Black No.'",
        "'speaker_5': 'CdeBaca I.'",
        "'speaker_7': 'Clark Now. Hines Hi. Cashman Now.'",
        "'speaker_5': 'Kenny Ortega.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Central. I swear.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Taurus. I Clark.'",
        "'speaker_6': 'I'm sorry, Madam Secretary. Usually we can see the vote tally. What is the vote tally? That if.'",
        "'speaker_5': 'You're not. I have three knees.'",
        "'speaker_6': 'I.'",
        "'speaker_5': 'Madam President.'",
        "'speaker_1': 'May, Madam Secretary, please close the voting and announce results.'",
        "'speaker_5': 'Three nays, eight US.'",
        "'speaker_1': 'Ayes Council Bill 21 Dash 1182 has passed. That concludes the items to be called out this evening. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote I.'",
        "'speaker_1': 'Otherwise, this is your last chance to call out an item for a separate vote. Council Member Canete Will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_4': 'Yes, I knew that resolutions be adopted and bills and final consideration be placed upon final consideration and do pass in a blog for the following items. 21 Dash 1418 21 Dash 1419. I'm going to just say the numbers 1391, 13, 92, 13, 93, 13, 94, 13, 96, 1404, 1409, 14, ten, 14, 13 1373, 1374, 1378, 1385, 13'",
        "'speaker_4': ', 86, 14, 21, 13, 70, 13, 87, 13, 55, 13, 89, 1390 0999.'",
        "'speaker_1': 'All right. Thank you, Councilmember Kinney. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_3': 'Black eye.'",
        "'speaker_5': 'CdeBaca. I can't.'",
        "'speaker_6': 'All right.'",
        "'speaker_5': 'Hi.'",
        "'speaker_7': 'All right.'",
        "'speaker_5': 'Catherine. All right. Kenneth, i. Ortega. I. Sandoval.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Sawyer.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Torres. I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close voting and announce results.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4124 East 18th Avenue in South Park Hill. Approves a map amendment to rezone property from U-SU-C to U-SU-C1, located at 4124 E 18th Avenue in Council District 8. The committee approved filing this item at its meeting on 10-26-21.": [
        "'speaker_1': 'Tonight we have one public hearing for those participating in person. When called upon, please come to the podium on the presentation monitor. On the wall you will see your time counting down for those participating virtually when called upon.'",
        "'speaker_1': 'Please wait until our meeting. Host promotes you to speaker. When you are promoted, your screen will flash and say Reconnecting to meeting. Please don't leave the meeting. You will be reconnected and will need to turn on your camera if you have one and your microphone you'll see your time counting down at the bottom of your screen.'",
        "'speaker_1': 'Once you finished speaking, you will change back to participant mode and see your screen flash one more time. All speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so.'",
        "'speaker_1': 'Their Home Address. If you've signed up to answer questions, only state your name and note that you are available for questions of council. Speakers will have 3 minutes. There is no yield enough time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted.'",
        "'speaker_1': 'We will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating to virtual participants. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech.'",
        "'speaker_1': 'Direct your comments to council as a whole and please refrain from individual or personal attacks. Council Member Keeney Will you please put Council Bill 1227 on the floor for final passage?'",
        "'speaker_4': 'Yes, I move that council bill 21, dash 12 at 1227, be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. It has been moved and we've got a second there. Thank you. Councilmember Hines. The required public hearing for Council Bill 1227 is open and we have Val Herrera here for the staff report. Go ahead, Val.'",
        "'speaker_4': 'Good evening, Madam Council and city council members. My name is Valerie PEREIRA. I'm an associate city planner with community planning and Development. And I'll be presenting a rezoning case for the subject property located at 4124 East 18th Avenue.'",
        "'speaker_4': 'My applicant, Mr. Patino, actually decided to join us in person this evening. So with that, I'll get started. The subject property is located within Council District eight. Councilman Herndon's district. Located in the South Park Hill neighborhood. The subject property is currently 8744 square feet with a zone width of 35 feet.'",
        "'speaker_4': 'The request is for urban a single unit C1 to allow for a detached accessory dwelling unit in the rear of the lot. For zoning, the site and the surrounding properties to the north, east and west are currently, you see, allowing urban houses with a minimum zone lot of 5500 square feet to the south.'",
        "'speaker_4': 'The zoning is USCG, which has a minimum zone area of 7000 square feet, one and a half block to the west of City Park. And to the south is 17th Avenue Parkway. The site is a single unit residential land use with some two unit and multi-unit existing uses in the neighborhood as well as open space and public'",
        "'speaker_4': 'housing. Public. The subject. Property is mid-block without access. There is an existing primary single unit structure and a detached garage accessory structure currently on the lot. Nearby properties are shown on the top and bottom of the screen. Top is going to be classified as multi-unit residential and the bottom photo is single unit residential.'",
        "'speaker_4': 'In terms of process. This MAP amendment went to planning board on Wednesday, October 20th, where the item was recommended approval on the consent agenda. The rezoning was then move forward to final hearing of city council by the Land Use Transportation and Infrastructure Committee on Consent on October 26 and is being heard today.'",
        "'speaker_4': 'To date, staff has not received written input from any of the registered neighborhood organizations that were sent notice. So now we'll move into the five review criteria of the Denver zoning code. The first is going to be consistency with adopted plans, starting with Plan 2040.'",
        "'speaker_4': 'Staff found that the rezoning is consistent with several strategies shown from the plan 2040. Starting with equity and environmental resiliency specific to ensuring equity affordability and inclusivity. The for that vision elements staff found this rezoning to be consistent with the goals listed here that encourage increased development of housing use units close to transit, a greater mix of'",
        "'speaker_4': 'housing options in every neighborhood for all individuals and families, and ensuring that every neighborhood provide a complete range of housing options. In speaking to the climate and the environmentally resilient vision element, staff found this rezoning to be consistent with the goal listed here that encourages promotion of infill development where infrastructure and services are already available.'",
        "'speaker_4': 'Getting into Blueprint Denver's Land Use and Transportation Plan Blueprint Denver maps this area as urban context and residential low, which consists of predominantly single and two two unit uses on smaller lots and allows for ideas to be thoughtfully and appropriately integrated where compatible.'",
        "'speaker_4': 'Getting into the East Area plan that was adopted in 2020. We've got affordable housing policy issue one, and that is to stabilize residents at risk of involuntary displacement. South Park Hill has the least diverse housing mix in the entire plan area at 80% single unit residential, and that's excluding right of way from the total land area.'",
        "'speaker_4': 'Looking at the economic policy e for to expand diversity of housing types and affordability to support households of different sizes, ages and incomes in all neighborhoods. South Park Hill, which is predominantly single unit residential, is considered unaffordable, according to the Housing and Transportation Index.'",
        "'speaker_4': 'In this area, the housing and transportation costs for a typical household in Denver would exceed 45% of its income. Looking at criteria two and three staff found that this rezoning is consistent with adopted plans. The proposed rezoning will result in uniform application of zoned district building form, use and design regulations, and it will further public health, safety'",
        "'speaker_4': 'and welfare through implementing adopted plans and facilitating increased housing density. Looking at criteria number four, staff found that the proposed rezoning is justified through a city adopted plan. And finally, criteria number five, the context zone, district purpose and intent of USC.'",
        "'speaker_4': 'One are all appropriate for this particular location given the surrounding area and the adopted plan guidance. The existing use you see in this area covers parcels with high variation in widths and sizes. The application proposes to retain the same underlying as zone district because there is not planned direction for change in lot sizes from the from what's'",
        "'speaker_4': 'existing in the area. And with that, given the finding that all review criteria have been met, staff recommends approval of the rezoning. Just a reminder approval of a rezoning is not approval of a proposed specific development project. And with that, I'm happy to take any questions you'll have.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'All right. Thank you, Val. We have two individuals signed up to speak this evening, one in chambers and one online. Our first one in chambers is Tory Patel for now. Go ahead.'",
        "'speaker_7': 'Hello. I'm Tory Patino. I'm the homeowner. Homeowner at 4124 East 18th Avenue. I think Ms.. HERERA did a good job describing the criteria. We have a.'",
        "'speaker_0': 'Large.'",
        "'speaker_7': 'Loft and a detached or detached garage on the back. We plan on taking that down and moving the garage towards the alley and putting an 82 behind that fit it fitting within the specifications that are required.'",
        "'speaker_1': 'All right. Thank you. Our second speaker is Jesse Perez joining us online.'",
        "'speaker_7': 'Yes, my name is Tom Perez and I'm representing for black sites a more positive outlook on life and social change as well as the Unity Party of Colorado. Well, I'm black. No. And I'll be the next November 2023.'",
        "'speaker_7': 'I'm in favor of this rezoning for my as in previous rezonings of this type. I support edibles, especially growing units all across the city. I would love to see them in every single district in the city. This meets all five of the criteria for to see what adopted planned uniformity of this regulations as far as public health'",
        "'speaker_7': ', safety and wellness, justifying circumstances and consistency with neighborhood concepts, purpose and intent. So with that being said, I'm in full support of this rezoning tonight. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers questions from members of Council on Council Bill 1227. The public hearing is closed. Comments by members of Council on Council Bill 1227. I don't see anybody. So I'll go ahead and chime in.'",
        "'speaker_1': 'I do believe that this meets all of the rezoning criteria and will be happy to support that this evening. Madam Secretary, Roll Call on Council Bill 1227, please.'",
        "'speaker_3': 'BLACK Hi.'",
        "'speaker_5': 'CdeBaca. Clerk.'",
        "'speaker_6': 'All right.'",
        "'speaker_5': 'Hi, Cashmere. I can eat. I'm Ortega. I Sandoval. I swear.'",
        "'speaker_4': 'I.'",
        "'speaker_5': 'Torres.'",
        "'speaker_3': 'I.'",
        "'speaker_5': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_5': '11 Eyes.'",
        "'speaker_1': '11 Eyes Council Build 21 Dash 1227 has passed. Thank you very much for being here. Our pre adjournment announcement on Monday, December 13th Council will hold a required public hearing on Council Bill 21, Dash 1365, designating the East Seventh Avenue Historic District Steel Street Extension as a district for preservation and a required public hearing on Council Bill'"
    ]
}