{
    "A bill for an ordinance clarifying and amending the authority of the Office of the Independent Monitor. An ordinance clarifying and amending the authority of the Office of the Independent Monitor and expanding the appointment process for the Citizen Oversight Board to include City Council appointments. The Committee approved filing this item at its meeting on 1-30-19.": [
        "'speaker_0': 'No items have been called out and under pending. No items have been called out. All right. Looks like we got them all. Madam Secretary, if you could please put the first item on our screens. And, Councilwoman, can you go ahead with your comment?'",
        "'speaker_4': 'Thank you, Mr. President. This is the bill to update and clarify the powers of the Independent Monitor and the Citizen Oversight Board that works with the Independent Monitor on independent oversight of police and sheriff. We're going to hold our substantive comments until next week on this bill.'",
        "'speaker_4': 'But I wanted to, for transparency to the community and my colleagues, let them know that an amendment will be coming next week on a very tiny technical issue, which is we did not get this staggering quite right for the members of the Citizen Oversight Board.'",
        "'speaker_4': 'And so you'll see an amendment. We wanted to just give you time to absorb it, so we'll send it to you this week. But it will basically just ensure that we have a chunk of members kind of expiring in an irregular cadence rather than having a big chunk at once and then none for a year.'",
        "'speaker_4': 'So we didn't get that quite right. And I'm sorry we didn't catch it sooner, but transparency just wanted folks to know if anyone who's listening or watching needs to see the amendment. We will have it available through my office.'"
    ],
    "AS AMENDED a bill for an ordinance changing the zoning classification for 805 West 38th Avenue in Globeville. Approves an official map amendment to rezone property from I-B UO-2 to C-MX-20 (industrial in the former zoning code to urban center, mixed-use), located at 805 West 38th Avenue in Council District 9. The Committee approved filing this item at its meeting on 1-29-19. Amended 2-11-19 to clarify the boundary of the proposed rezoning on Galapago Street.": [
        "'speaker_4': '720337 7712 or contact the city council main office and we can have them get it to folks as well. So we'll talk with you more about the bill next week. Thank you.'",
        "'speaker_0': 'Thank you. Madam Secretary, are you pleased with the next item on our screens? And Councilman Cashman, will you please put Council Bill 42 on the floor?'",
        "'speaker_7': 'Yes, Mr. President. I move the council bill 19 Dash 004 to be ordered published.'",
        "'speaker_0': 'It has been moved. Can I get a second? Moved and seconded. Councilwoman, suspend your motion to amend.'",
        "'speaker_4': 'Thank you, Mr. President. I move that council bill 19 zero zero 42 be amended in the following particulars. This is going to be fun. Together with the West, one half of that portion, a vacated Galapagos Street described as follows.'",
        "'speaker_4': 'By the way, insert this in the following after line 13 on page two, that part of Galapagos Street, more particularly described as follows commencing at the northwest corner of Lot five BLOCK 43 Viaduct addition to Denver City and county of Denver, thence southerly along the east, right of way line of Galapagos Street, a distance of 71.55 feet'",
        "'speaker_4': 'to the true point of beginning thence. Along a non tangent curve to the right with a radius of 48 feet, a length of 110.43 feet, and a delta of 131 degrees, 48 minutes and 37 seconds with a cord of 87.64 feet, which deflects 114 degrees, 5 minutes and 41 seconds to the right from the aforementioned course to'",
        "'speaker_4': 'a point on the West, right of way line of said Galapagos St, thence southerly along said west right of way line of Galapagos St to the north to right of way line of the valley highway. Thence easterly along said north the right of way line of the valley highway to the said east right of way line of'",
        "'speaker_4': 'Galapagos St thence northerly along the said east right of way line of Galapagos Street to the true point of beginning. You're welcome. On page two, omit lines 24 through 38, and on page three, omit lines one and two.'",
        "'speaker_0': 'Thank you. Councilwoman Sussman. Now, can you say that five times fast?'",
        "'speaker_4': 'Yes, I.'",
        "'speaker_2': 'Can. All right.'",
        "'speaker_4': 'So the northwest corner of the the amendment.'",
        "'speaker_0': 'Did we get the amendment moved and seconded? No, we got it on the floor. Yes. Yeah.'",
        "'speaker_5': 'Yes, we did. Okay.'",
        "'speaker_0': 'All right. It's been moved and seconded. Are there questions or comments by members of council or Councilwoman Sussman?'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'Thank you, Mr. President. The purpose of this amendment is to clarify the boundary of the proposed rezoning on Galapagos Street. The amendment does not substantively change the proposed ordinance.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Councilman Flynn.'",
        "'speaker_1': 'Thank. Mr. President, I just want to express my gratitude that the amendment uses the term Valley Highway. Yes, we don't hear that very often anymore.'",
        "'speaker_4': 'It also sounds like it was written by Shakespeare.'",
        "'speaker_0': 'Thank you. Jasmine Flynn. Seeing no other comments or questions. Madam Secretary, roll call on the amendment blank.'",
        "'speaker_5': 'All right. Brooks.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'Espinosa, I. Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'Gilmore. I earned it.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'Cashman. I can eat. Lopez. Right. New Ortega by Cessna. I Mr. President.'",
        "'speaker_0': 'All right. Madam Secretary, please close voting in the results. 3913 is council bill 42 has been amended and now Councilman Cashman, will you please put Castro 42 on the floor to be ordered published?'",
        "'speaker_7': 'Yes, Mr. President. I move that council bill 19 dash 004 to be ordered published as amended.'",
        "'speaker_0': 'It has been moved and seconded. Any questions or comments? Nope. All right, Madam Secretary, roll call.'",
        "'speaker_5': 'Black Eye.'",
        "'speaker_2': 'Brooks I.'",
        "'speaker_5': 'Espinosa, i. Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Gilmore. I. Herndon, i. Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'Can I. Lopez.'",
        "'speaker_0': 'Hi.'",
        "'speaker_5': 'New Ortega. I. Susman, i. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting and announce the results. 1313 I as Constable 42 has been ordered published as amended, and that concludes the items to be called out this evening. All other bills for introduction are ordered published and we are now ready for the block vote on resolutions and bills on final consideration.'",
        "'speaker_0': 'Council members remember that this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call an item for a separate vote. Councilman Cashman, would you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_7': 'Yes, Mr. President. I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass on a block for the final items. 19 Dash 006 218 Dash 1330 619 Dash 005 919 Dash 006 119.'",
        "'speaker_7': 'Dash 006 719. Dash 006 819. Dash 006 919. Dash zero zero 6018. Dash 1370 619. Dash 006 318. Dash 1420 119 003 519. Dash 003 919 Dash 004 519. Dash 0054 and $19 0008.'",
        "'speaker_0': 'All right. Thank you, Councilman Cashman. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_5': 'Black eye. Brooks, i. I. Flynn, I. Gilmore, i. Herndon, i. Cashman, I. Can eat i. Lopez. I knew Ortega I. Assessment i. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting. Announce the results. 1313. I. As the resolutions have been adopted and bills have been placed upon final consideration and do pass tonight, there will be a required public hearing on Council 18 Dash 1477 changing the zoning classification for 1709 and 1717 Washington Street A required public hearing on Council Bill 18'"
    ],
    "A bill for an ordinance changing the zoning classification for 1709 & 1717 Washington Street in North Capitol Hill. Approves an official map amendment to rezone property from G-RO-5 to C-MS-5 (general urban, residential-office to urban center, main-street), located at 1709 & 1717 Washington Street in Council District 10. The Committee approved filing this item at its meeting on 12-11-18.": [
        "'speaker_0': 'Council is reconvened. We have three hearings this evening. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses. If you are here to answer questions only when your name is called, please come to the podium, state your name and note that you are'",
        "'speaker_0': 'available for questions of council. Speakers will have 3 minutes and there is no yielding of time on the presentation monitor. On the wall you will see your time counting down speakers, mostly on the topic of the hearing and must direct their comments to the council members.'",
        "'speaker_0': 'Please refrain from profane, profane or obscene speech. Direct your comments to council as a whole and please refrain from personal or individual attacks. Councilman Cashman, will you please put Council Bill 1477 on the floor?'",
        "'speaker_7': 'Yes, Mr. President. I move the council bill 18 Dash 1477 to be placed upon final consideration, and.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 1477 is open. May we have the staff report?'",
        "'speaker_10': 'Thank you, Mr. President. And Council Scott Robinson with Community Planning and Development. This is a request to rezone 1709 and 1717 Washington Street from gr05 to C and as far as property is located in Council District ten in the North Capitol Hill neighborhood, also known as the uptown area, it's at the northwest corner of 17th Avenue and'",
        "'speaker_10': 'Washington Street. It's about 12,500 square feet, and it's currently a parking lot. The request is to rezone, as I said, from zero five, which is general urban neighborhood context, residential office, five story maximum height to CMC five, which is Urban Center Neighborhood Context Main Street zoning.'",
        "'speaker_10': 'Again, with a five storey maximum height request is to reason the property to position it for redevelopment. You can see the surrounding zoning in this map to the north and east is the same grade five across 17th Avenue to the south is CMS five, the requested zone district.'",
        "'speaker_10': 'And then across the alley to the west is see me eight and see annex eight. So eight stories zoning across the alley to the west. You can see the mix of uses in the North Capitol Hill neighborhood are pretty varied.'",
        "'speaker_10': 'There's single unit residential, multi-unit, residential office, retail, mixed use and quite a few parking lots around the area. The subject property is on the bottom right photo and then you can see some of the other surrounding properties in the other photos there.'",
        "'speaker_10': 'This one to Planning Board on December 5th, 2018 received a unanimous recommendation of approval. There was no public comment at that meeting and went to the Land Use Transportation and Infrastructure Committee on December 11th, 2018. In your packet, you should have seven letters of support from surrounding property owners and business owners, as well as a letter of'",
        "'speaker_10': 'support from the Uptown on the Hill Register Neighborhood Organization and a letter stating They're not taking your position from the Capitol Hill. United Neighbors are now. In order to approve a rezoning, the city must find that these five criteria have been met.'",
        "'speaker_10': 'The first criterion is consistency with adopted plans. There are three plans that apply to this property. The first is Comprehensive Plan 2000, as described in the staff report. Staff has found the proposed rezoning is consistent with these four strategies from campaign 2000, mostly relating to infill development, mixed use development and creating areas for neighborhood serving retail, which'",
        "'speaker_10': 'would be consistent with the proposed CMS five zone district. The second plan is the blueprint. Denver from 2000 to the concept land use designation for this property is urban residential, which calls for primarily residential at higher density, but with complementary commercial uses scattered throughout.'",
        "'speaker_10': 'It's in an area of change, which is an area where the city is determined. We want to channel additional growth. And 17th Avenue is a mixed use arterial, which calls for higher intensity, mixed uses development along it, which means it's an appropriate place for those complementary commercial uses in the urban residential area.'",
        "'speaker_10': 'And Washington Street is a residential collector, again, calling for somewhat higher density, more intense development. So staff finds it's consistent with the recommendations of Blueprint Denver. The third plan is the Uptown Neighborhood Plan from 1986. The plan calls for encouraging mixed use and housing development encouraging compatible development with the surrounding character concentrating retail uses along 17th Avenue'",
        "'speaker_10': 'between Sherman Street and Clarkson Street, which includes this property and saying users along 17th Avenue should be pedestrian oriented, which seems five Main Street zoning. Zoning is intended to create pedestrian oriented, pedestrian friendly development, so staff finds the proposed rezoning consistent with the adopted plans in the first criterion.'",
        "'speaker_10': 'That the second criterion is uniformity of district regulations. Staff finds the proposed rezoning, which would result in the uniform application of the CMC five zone district. The third criterion is to further the public health, safety and general welfare of the city.'",
        "'speaker_10': 'Staff finds the proposed rezoning would do so by implementing the city's adopted plans and facilitating the redevelopment of the parcel in a pedestrian friendly manner and serving the community. The fourth criterion is justifying circumstances. Staff finds the proposed rezoning justified by the changing and changing conditions in the area.'",
        "'speaker_10': 'There's been quite a bit of development and redevelopment in the uptown area over the last few years, an increase in the residential population, creating an increased need for community serving retail that would be allowed under the proposed CMS five zone district.'",
        "'speaker_10': 'And the fifth criterion is consistency with neighborhood context, zone, district purpose and intent. Staff finds the proposed rezoning would facilitate development consistent with the description of the urban center neighborhood context and the purpose and intent of the CMS five zone district, which is intended to apply primarily along collective arterial streets where a building scale of 2 to'",
        "'speaker_10': '5 storeys is desired. As I mentioned, 17th Avenue is an arterial, Washington street is a collector. The current zoning already allows five stories. There's CMS five zoning across the street on 17th. So this is an area where the CMC five zoning is appropriate and staff therefore finds all five criteria are met and recommends approval.'",
        "'speaker_10': 'I'll be happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. We have three individuals signed up to speak this evening, so if you're signed up to speak on this item, I'd ask that you come up to this first bench so that you can step right up to the microphone when I call your name as your time will start to elapse.'",
        "'speaker_0': 'First up, we have Bill Ferguson.'",
        "'speaker_2': 'Good evening. I'm the owner of this property and thank you for considering this rezoning request. I've owned the Avenue Grill Restaurant across the street for the last 33 years. 32 or three years. And the De Avenue Grill Building is currently zoned CMC five and of just for an odd reason.'",
        "'speaker_2': 'What's commonly known as the Avenue parking lot across the street is zoned gr05. So the request is to to maintain the Main Street character of 17th Avenue to allow the a greater sense in meet the want needs of the neighborhood, which is a very pedestrian friendly, very community friendly neighborhood.'",
        "'speaker_2': 'And to allow retail on the ground floor of what is now commonly known as the Avenue Grill parking lot. So I believe that if we consider the dynamics of my neighborhood, that we would all agree that the pedestrian friendly Main Street nature of 17th Avenue in Washington would definitely accommodate retail on the ground floor of the what'",
        "'speaker_2': 'is now a05 designation to accommodate a CMC fine. So I appreciate your time this evening and I'd encourage you please to consider this rezoning request.'",
        "'speaker_0': 'And if you have any.'",
        "'speaker_2': 'Questions, I'm available to answer any of your questions. Thank you very.'",
        "'speaker_0': 'Much. Thank you. Next, Bruce O'Donnell.'",
        "'speaker_3': 'Thank you. Council President of members of Council. I am Bruce O'Donnell, 386 Emmerson Street, Denver, Colorado. And I'm the owner's representative on this application. And as has kind of been explained, the current road zoning only allows residential and office uses and actually prohibits the the activated ground floor pedestrian oriented uses that's available in the Main Street zoning'",
        "'speaker_3': '. And so the purpose of this zoning is really just to achieve that. We are keeping it the five stories. We have five story zoning today and we're not asking for a height increase with the going to the CMC five.'",
        "'speaker_3': 'And as was stated, we've had unanimous approval at Planning Board and part of the discussion there was that it's hard to have a main street if only one side of it has main street zoning. And so it makes perfect sense to see that both sides of 17th Avenue have Main Street zoning on this block.'",
        "'speaker_3': 'As was stated, we worked with both Chan and Uptown on the Hill and have support from Uptown and Chan didn't think it was a significant enough change to even take a position. And then we also in your packets there are letters of support from neighboring property owners.'",
        "'speaker_3': 'So with that, I want to formally request the City Council vote to approve Council Bill 18 dash 1477, rezoning 1709 and 717 Washington from zero five to CMC five. And Mr. Ferguson and I are both available to answer any questions.'",
        "'speaker_3': 'Should you have any? Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pierce.'",
        "'speaker_3': 'Good evening, members of council. My name is Jesse Paris. I'm representing for Denver Homeless Outlaw Black Star Action Movement for Self-defense and Positive Acts of Commitment for Social Change. And I'm also an at large candidate for 2019. We are against this.'",
        "'speaker_3': 'This neighborhood has been rapidly gentrified. I see it every day. I was born and raised in this neighborhood and I don't even feel safe or like I belong in this neighborhood. And to see that you guys are sitting up here accepting this rezoning for a property that clearly has been gentrified, the whole neighborhood has been gentrified, and'",
        "'speaker_3': 'you just want to make these yuppies more happy. We're not standing for this. We need a attainable, affordable housing right now. This bottom level could be used for that. It cannot. It could be used for that instead of this commercial use.'",
        "'speaker_3': 'But it already meets all the criteria. So we already know you're going to go through with this. So I just ask you not to go through with it, but already know you're going to go through with it. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council?'",
        "'speaker_8': 'Councilman Ortega Thank you, Mr. President. CRUZ Would you mind coming to the microphone, please? I'm just curious. It sounds like a pretty minor change. Realizing that the code has to be changed in order to. Just codify what the current.'",
        "'speaker_8': 'Character of the site is of the property. How long did it take you to get through the zoning application process?'",
        "'speaker_3': 'Oh, boy. I'd have to double check that. I think we probably did the pre-op back in maybe even April or May, so probably in the 9 to 10 month.'",
        "'speaker_4': 'Okay.'",
        "'speaker_3': 'Range.'",
        "'speaker_8': 'All right. Thank you. Thank you. Appreciate it. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Seeing no other questions. The public hearing for Accountable 1477 is closed. Are there any comments by members of council company? Yes, sir. Looking forward to seeing the redevelopment of this property. 17th Avenue should become a quiet, quiet street.'",
        "'speaker_0': 'Boy was so much a development with housing development and some of the best restaurants being created too. So I'm really proud to support this and I encourage my colleagues to support this. And I know Mr. Ferguson will create a great project there that the neighborhood will be proud of.'",
        "'speaker_0': 'Thank you, sir. Thank you, Councilman. Now seeing no other comments. I'll just add thank you to staff for putting together the staff report for us. I think this clearly meets the criteria. And because of that, I will be voting to support Secretary Roll Call on Council Bill 1477.'",
        "'speaker_5': 'New Black II.'",
        "'speaker_2': 'Brooks II.'",
        "'speaker_5': 'Espinosa. I Flint. I Gilmore. I heard it.'",
        "'speaker_0': 'Hi.'",
        "'speaker_5': 'Cashman. Hi, Kenny Lopez. Hi, Ortega. Hi. Hi, Mr. President.'",
        "'speaker_0': 'I am secretary. Please close voting announce results.'",
        "'speaker_5': '13.'"
    ],
    "A bill for an ordinance designating 5001 Packing House Road, the Armour & Company Administration Building, as a structure for preservation. Approves an individual Denver landmark designation for property located at 5001 Packing House Road in Council District 9. The Committee approved filing this item at its meeting on 1-15-19.": [
        "'speaker_0': '813 IES Council Bill 1477 has passed. Councilman Cashman, will you please put Council Bill 1539 on the floor?'",
        "'speaker_7': 'Yes, Mr. President. I move the council bill 18 dash 1539 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Has been moved and seconded. The public hearing for Council Bill 1539 is open. May we have the staff report?'",
        "'speaker_4': 'Good evening. My name is Karen with Community Planning and Development and we are here for 5001 Packing House Road. It's also known as the Armor and Company Administration Building. Landmark Designation was established in 1967, which provides you the authority to designate properties within the city and county of Denver.'",
        "'speaker_4': 'Approximately 4% of the structures in the city are designated, or about one in 25 buildings. For this particular property, the owner is the city and county of Denver and it is in the National Western Center, as you can see, as highlighted on the map in red.'",
        "'speaker_4': 'If you look down towards the bottom of the map, you can see the outline of the stadium arena. That is also a Denver landmark. This particular property is in an area of change with its current zoning as I am x five with a use overlay of two.'",
        "'speaker_4': 'There is plain support for the designation in both the National Western Center Master Plan and the Elyria Swansea Neighborhood Plans, which both call out for the designation of historic structures. Specifically the designation of structures within the National Western Center.'",
        "'speaker_4': 'And as you can see, the red box down there at the bottom is the stadium arena. And the small diamond up at the towards the top is the property that we are looking at for a property be designated per ordinance.'",
        "'speaker_4': 'It needs to meet a designation criteria in at least two of the following categories history, architecture and geography, and to maintain its historic and physical integrity. And then the LPC needs to consider how it relates to a historic context or theme.'",
        "'speaker_4': 'So for this particular property, it meets two criteria under history one under architecture and three or two under geography. In the first under history, it has a direct association with the historical development of the city, state or nation.'",
        "'speaker_4': 'This particular property is strongly associated with the meat processing facilities at the Denver Union Stockyards. The armor building was the administration building for the Armor and Company. The in this particular area, the meat packing processing plants had a huge amount of authority and power within the city and county of Denver, and the industry was incredibly strong.'",
        "'speaker_4': 'They oftentimes not only owned the meat processing plants, but they also owned some of the yards, they owned the cattle, they owned the ranches. So this is one of the last remaining buildings that's associated with the meat processing plant, which was so intrinsic to the development of the city and county of Denver.'",
        "'speaker_4': 'It is also significant under history for having a direct and substantial association with a person or groups of persons who had influence on society. So this particular building is associated with a couple of different groups. The first is the Gephardt family.'",
        "'speaker_4': 'The Gephardt family is the is the family that started the armor company. Henry and then his son, Charles, were the two that were the instrumental members of the Gephardt family within the armor packing industry. Henry founded the Colorado Packing and Provision Company, and then he was really instrumental in the Denver Union stockyards.'",
        "'speaker_4': 'He was an executive of the Western Stock Show, and he present he helped produce the National Western Stock Show. It was then passed onto his son, Charles Gephardt, and he was there when the Armor Company ended up purchasing what had initially been the Colorado packing and provision company.'",
        "'speaker_4': 'And then they allowed the Gephardt family to continue to run the business. And this is the building that was constructed for the administration of it. But since so much else has been lost, this is the one of the buildings that's associated with the Gephardt family.'",
        "'speaker_4': 'This property is also associated with the the neighborhood that surrounds it, that the meatpacking and the meat processing was one of the stable positions that could be gained by the immigrants who came over. And so it is primarily blue collar employment for the immigrants who are primarily Russian, Slavic and Eastern European, east from Eastern European countries at'",
        "'speaker_4': 'this time. And so the meat processing plants provided stable employment for the populations that lived in the neighborhood. And so this is a representative of the ability to maintain and live in that community was through the meat processing plant and so it provided stable employment for the population.'",
        "'speaker_4': 'The property is also significant for its architecture, for embodying distinguishing characteristics of an architectural style or type. And this is a neoclassical style. It was constructed in 1917, and it can be seen through its cobbled cornice at the top.'",
        "'speaker_4': 'From the simple geometric designs on the brick walls. The very regular and symmetrical form. And in the fenestration pattern. And then the one story porch. Oftentimes on a neoclassical, you'll actually see a two story porch. In this case, it's a slightly stripped down version with the one story classical columns.'",
        "'speaker_4': 'And then finally, it's significant for its geography for promoting an understanding and appreciation of the urban environment by means of a distinctive physical characteristic or rarity. In this particular instance, it's rare for being the sole remaining building that's related to the meatpacking industry of the swift and armor plants that had been demolished.'",
        "'speaker_4': 'And so as you look at the 1961 Sanborn map, you can see the arrow that points to the the one admin building. All of those other buildings that are on there were associated with the with the with a swift in armor plate or with this with the armor plants.'",
        "'speaker_4': 'And they have since been demolished. And so this is the a rarity for being one of the only remaining meatpacking industry plants in the city. And finally, it's a significant under geography for making a special contribution to Denver's distinctive characteristic.'",
        "'speaker_4': 'This isn't something that is used or is there aren't many properties that are designated under this. It's the designation that is what makes Denver. Denver and the National Western Stock Show and the Denver Union stockyards are intrinsic to the character of Denver, and they have defined Denver as a major livestock hub since the early 20th century.'",
        "'speaker_4': 'And so this building is strongly associated with the intrinsic nature of Denver's history. After meeting all of the criteria, a property still has to maintain its historic and physical integrity, which is basically does the property look like what it used to look like?'",
        "'speaker_4': 'And as you can see from these pictures, it is remarkably intact. Underneath the boarded out, underneath the boards, there are the windows that still remain. So overall, there are minimal changes that have occurred to this building on the right hand side, which is actually a little hard to see.'",
        "'speaker_4': 'It's behind some bushes on one of the windows have been turned into doors. But overall, other than the painting of the brick and the boarding up of windows, but the windows there are still underneath. It has a remarkably good integrity and staff, as well as the Landmark Preservation Commission, found that it maintained its historic and physical integrity'",
        "'speaker_4': '. And finally, the Landmark Preservation Commission considered how the structure relates to historic context or themes. And they looked at how it is associated with the development of the meatpacking industry in Denver, the growth of ranching in the livestock industry, and then with the National Western Stock Show and found that it was related to multiple historic contexts in'",
        "'speaker_4': 'Denver's history. When the commission reviewed that, they found that history under one A and one C, architecture under two A, geography three B and three C, that it maintained its historic and physical integrity. And they found that it was eligible to be a Denver landmark.'",
        "'speaker_4': 'They voted unanimously, eight zero. And I'm happy to answer any questions you may have.'",
        "'speaker_0': 'Thank you very much. We have three individuals lined up to speak this evening. So if you've signed up to speak on this item, ask you to come up to the front bench. When I call your name, step up to the podium and your time will begin to elapse.'",
        "'speaker_0': 'First up, we have Eric Anderson.'",
        "'speaker_3': 'Good evening, councilmembers. My name is Eric Anderson. I'm the design manager for the mayor's office of the National Restaurant Center. This is a very important building to our new campus. It sits right.'",
        "'speaker_7': 'In the middle of all the things that.'",
        "'speaker_3': 'Are going to happen.'",
        "'speaker_10': 'And we're really looking forward to seeing a new use here. So I'm here to answer any questions regarding the site or the building itself.'",
        "'speaker_0': 'Thank you. Thank you very much. Thank you very much. Next up, John Olsen.'",
        "'speaker_3': 'Thank you very much, council members. My name is John Olsen. I'm the deputy director of Historic Denver. I'm here to absolutely support this as a designation up at the National Western Center, part of the National Western Stock Trail.'",
        "'speaker_3': 'I'm here as a part of of being with this historic Denver, which, of course, you're very used to seeing me from that standpoint. But I'm also here from the point of view of the National Western Citizen Advisory Committee.'",
        "'speaker_3': 'And in our conversations with the community members and with History Colorado and with the National Western Center, this was one of those buildings that was identified very early on as being very important to the site. We're talking about a very exciting development that's going to happen to the National Western Center and a national Western Stock Show area'",
        "'speaker_3': '. But we want this to be part of Denver. And this is something that is a part of Denver. It's associated with Denver. The community members have associated with this with the meatpacking industry because they have a large history with the meatpacking industry.'",
        "'speaker_3': 'A lot of the descendants still live in the Globeville, Elyria, Swansea area. So from that standpoint, this is going to be very exciting. This is going to be a piece that's going to integrate, I think, very well with the development that's going to be going there.'",
        "'speaker_3': 'And it's really going to show what we're all about here in Denver that we're forward thinking when it comes to agriculture and urban ideas. But we understand and identify the importance of our past and the reasons why this location was so important to Denver.'",
        "'speaker_3': 'So thank you very much.'",
        "'speaker_0': 'Thank you. And next up, Jesse Pearce.'",
        "'speaker_3': 'Jesse Paris Black Starts a movement for self-defense. Deborah Thomas Out Loud and positive commitment for social change. And I'm also now large candidate for 2019. We are actually in favor of this. Abbie reminds me of a time when Denver was such a humble place to live and it was a cow town and you could travel through the'",
        "'speaker_3': 'town in 10 minutes. Now try to. It takes over an hour. So, yeah, we're definitely in favor of this. It should have been done already, but yes, we're in favor of this. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council? Councilman Flynn. Thank you, Eric.'",
        "'speaker_1': 'Could you tell us from the standpoint of the National Western Center project, how does the landmark designation fit into the plan overall?'",
        "'speaker_3': 'If you go back to the master plan that was approved 2015, there were four structures.'",
        "'speaker_7': 'That were historically significant.'",
        "'speaker_3': 'That we thought at some point needed to be kind of kept.'",
        "'speaker_10': 'And talked about and make sure that we we.'",
        "'speaker_3': 'Were clear about what they wanted to be before we did anything else. And this was one of them. Very important. Of course, the 1909 Stadium Arena Building was the first one.'",
        "'speaker_10': 'And then and then we also had the livestock exchange building.'",
        "'speaker_3': 'Which will be moving forward hopefully soon. And then, of course, the Denver Coliseum, which is to be determined at a later date.'",
        "'speaker_1': 'TBD. Yes, thank you. I just want to make sure that folks understood how this fit into the overall plan.'",
        "'speaker_3': 'We've been looking at this for a long time.'",
        "'speaker_1': 'Yes. Okay. Thank you. That's all, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Flynn. Councilman Brooks.'",
        "'speaker_2': 'No, it's okay.'",
        "'speaker_0': 'You're good. Councilwoman Ortega.'",
        "'speaker_8': 'I'm not sure who can answer this. I'm just trying to clarify. Is this the the residence that Tom Anthony lived in? It is. Okay. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega, seeing no other question, the public hearing for Council 1539 is closed. Comments by members of Council Councilman Brooks.'",
        "'speaker_2': 'Yeah, thank you, Mr. President. It's it's nice to have a landmark designation where everyone is in support of designating this. So I think all parties and I think the National Lessons Center for for taking the lead on this and making this easy over this 250 acre redevelopment.'",
        "'speaker_2': 'So we've been talking about this for a long time, and it's always been a priority and a value from the residents in the area to make sure that these properties are historically designated and that they capture the fabric of the context in the neighborhood.'",
        "'speaker_2': 'And so I'm excited to support this and I hope my colleagues will do the same. Thank you.'",
        "'speaker_0': 'Thank you very much. Councilman Brooks. Seeing no other comments, Madam Secretary, roll call on Council Bill 1339. Yeah.'",
        "'speaker_5': 'Brooks.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_5': 'Black tie. Espinosa I flinch.'",
        "'speaker_0': 'I humor.'",
        "'speaker_5': 'I Herndon I cashmere.'",
        "'speaker_0': 'I.'",
        "'speaker_5': 'Can each Lopez I knew Ortega I assessment i. Mr. President.'"
    ],
    "A bill for an ordinance designating 637 Galapago Street, the Samsonite House, as a structure for preservation. Approves an individual Denver landmark designation for property located at 637 Galapago Street in Council District 3. The Committee approved filing this item at its meeting on 1-15-19.": [
        "'speaker_0': 'I. Madam Secretary, please close the voting in results. 1313 accountable. 1539 has passed. Councilman Cashman, will you please put Council Bill 1542 on the floor?'",
        "'speaker_7': 'Yes, Mr. President. I move the council bill 18 dash 1540 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 1542 is open. May we have the staff report?'",
        "'speaker_4': 'Good evening, councilmembers. My name is Jenny Button Borg and between planning and development. And tonight I'm here to present to you and 637 Galapagos Street Landmark Designation Application. The application was submitted by the owner of the property who's here with us this evening, Eric Kratzer and Meghan Hinman.'",
        "'speaker_4': 'Arthur, this is in the Lincoln Park neighborhood in Council District number three, Councilmember Paul Lopez. According to Blueprint Denver, this is an area of stability and the current zoning is you are age three A and you oh three.'",
        "'speaker_4': 'Kerry did most of the robust background on landmark preservation tonight. So this is going to be kind of a stripped down version. But the landmark designation criteria for this property is met in that it meets the designation criterion in at least two of the following categories history, architecture, geography.'",
        "'speaker_4': 'It maintains its historic and physical integrity, and it relates to a historic context or themes. So Landmark Preservation staff in the Landmark Preservation Commission find that the structure meets the required criteria for designation. Specifically, it meets history a to have direct association with the historical development of the city, state or nation history.'",
        "'speaker_4': 'See having direct and substantial association with a person or group of persons who had influence on society and architecture. A It embodies distinguishing characteristics of an architectural style or type, and I'll go into those in more detail here for history.'",
        "'speaker_4': 'A The property was built in 1890 by Elizabeth Malone, who was the mother of Thomas Malone, pastor of St Joseph's Church, from 1886 to 1894. Saint Joseph Church is kitty corner from this property, and it's believed that the home served as the rectory for Thomas Malone when he was pastor of St Joseph's Church in 1900.'",
        "'speaker_4': 'The Schweitzer family moved in and resided there until 1921, and during their residency they started and expanded the Schrader Trunk Manufacturing Company, which became the renowned Samsonite luggage company. Their trademark Samsung luggage was named after the Hebrew strongman Samson and known for its strength and durability.'",
        "'speaker_4': 'You can see here on the screen the image of the Schrader brothers standing on top of their luggage to illustrate its strength. The company expanded many times over the years, and evidence of their factory presence still exists. And the image you see on the screen here and the ghost signage at 1553 Platt Street.'",
        "'speaker_4': 'The property also meets history. See, the traders were Eastern European Jewish immigrants who came to Colorado via England in the late 1800s. The patriarch, Isaac Schrader, first landed in Central City, and as the family grew, they moved to get the Galapagos address in 1900.'",
        "'speaker_4': 'Isaac ran several small businesses in Denver, including a luggage shop. His son Jesse, helped transition the business into the luggage manufacturer. Schrader Truck Manufacturing Company in 1910. You can see him on the screen here indicated with the Green Arrow and the larger Schrader family in front of their home in 1905.'",
        "'speaker_4': 'Isaac died in 1916 and the family investors, his life insurance money into the company, which was a pretty good deal. As I mentioned, the well-known marketing of the suitcase is strength. So here's the actual photo of the Schrader brothers standing on top of that suitcase.'",
        "'speaker_4': 'Jesse was the president of the company from 1910 to 1960, so this was very much a family run business in Denver for quite a period of time. The property also meets architecture aid and embodies, excuse me, distinguishing characteristics of the Italianate style.'",
        "'speaker_4': 'It is in the row house form. Characteristics of this style are tall, narrow windows, decorative brackets and a flat roofed cornice. Prominent two story bay window. Some of the more unique pieces of this property are the polychrome rusticated rhyolite stone and sandstone, red sandstone and yellow limestone facade.'",
        "'speaker_4': 'It is very much unique to the block and quite imposing. There's nothing else like it there. This is a 3000 square foot two story residence and some of the other unique aspects of the property are the nine ornamental sunburst motifs and the lintels on the front facade.'",
        "'speaker_4': 'The property is found to maintain a high degree of physical and historic integrity related to the structure's period of significance from 1890 to 1921. There have been some alterations to the property, including two windows, doors and both front and back porches.'",
        "'speaker_4': 'But despite these changes, the building is clearly identifiable as an exemplary Italianate that maintains its character defining features. So if you look at these photos, the first is a 1905 again of the family with the home in the background.'",
        "'speaker_4': 'An 1890 Sanborn map, which was the year the property was constructed, shows that there's no front porch. But then in 1903, a Sanborn map shows a one storey wood frame porch with slate tin roof. And we can I believe this is what you see in the 1905 family of the photo here.'",
        "'speaker_4': 'If you fast forward to 1977, you can see that front porch altered again. Looks like it's more of a craftsman style. So sometime between 1905 and 1977, that change took place. In the 1980s, there was a rehab that removed that front porch.'",
        "'speaker_4': 'And so the image that you see in 2018 is more of what the building would have looked like originally when it was constructed in 1890. The property also relates to a historic context or theme here. It relates to Denver's economic development and growth at the turn of the 20th century, associated with an increase in population due to'",
        "'speaker_4': 'immigration and the importance of immigrant workers to Denver's economy. The Schweitzer family exemplifies this as Eastern European Jewish immigrants who settled in Denver and contributed to the economic growth of the city through their family business. In terms of the Comprehensive Plan 2000 and Blueprint, Denver 22.'",
        "'speaker_4': 'The proposed designation is consistent with these plans. Again, this isn't an area of stability and blueprint. Denver identifies landmark designation as a tool to reinforce areas of stability. So in summary, the proposed designation meets three designation criteria in two categories history A and C, architecture A.'",
        "'speaker_4': 'It maintains its historic and physical integrity and relates to a historic context or theme. So Landmark Preservation Staff recommend approval for designation of 637 Galapagos St and happy to take any questions that you may or may have.'",
        "'speaker_0': 'Thank you very much. We do have three individuals signed up to speak this evening. So if you're signed up to speak on this item, please come up to this front bench when I call your name. Step up to the podium as your time will start to elapse.'",
        "'speaker_0': 'First up, we have Eric Trotter.'",
        "'speaker_2': 'Good evening. I'm the property owner. So I'm here to support the application. Of course. The thing that really interested me in starting this process was a conversation that I had with my neighbor across the street who'd been living there for 40 years.'",
        "'speaker_2': 'She once knew a 100 year old woman who lived in the neighborhood who told her the story of the Samsonite family, the shredders living in the house. My wife and I felt that this building probably should have been designated a long time ago and that it was probably just missed.'",
        "'speaker_2': 'And it also seemed like we were on the verge of like losing the story. As soon as we were aware of the story was pretty easy to begin doing a little bit of research and discovering discovering the story of the Schwitters being in the house.'",
        "'speaker_2': 'But we were pleased to sort of discover all of this, go through the the designation application process. I started this about two years ago, and I'm really pleased to be here today. I'm here to answer any questions that you might have.'",
        "'speaker_0': 'Would you mind just stating your name for the record?'",
        "'speaker_2': 'Erik Crotzer.'",
        "'speaker_0': 'Thank you very much. Next up, Jonathan.'",
        "'speaker_3': 'Hello. John Olsen, again, deputy director of historic Denver. I wanted to start off, I'm remiss by thinking in my last comments about the property on the National Western Center to thank the National Western Center staff, including Sean Snow, who is still in the in the room today, as well as Eric Anderson, who you heard from, as well'",
        "'speaker_3': 'as the leadership of Gretchen Hollar and Brad Buchanan. So without their leadership to move that forward, that would not have happened. So thank you very much for that. In terms of this building, this is a wonderful story. It's a wonderful building that has you know, a lot of people would overlook that.'",
        "'speaker_3': 'So it's wonderful that the that the owners were able to dig up not only that story, but be able to celebrate that in the neighborhood. And we at Historic Denver are always glad when we see people really loving the places that they live and wanting to recognize that.'",
        "'speaker_3': 'And there's many, many ways that you can recognize that. But one of the ultimate is to be able to designate that building so that other generations beyond us will not only have that story, but will have that that piece of history that will still be thriving as a part of our growing Denver.'",
        "'speaker_3': 'So it's it's something that I'm very proud to say thank you for the owners to to do that effort and go forward with the designation. And I hope that you will reward that effort by voting for it to be designated so that it'll be a piece of Denver's history from this point on.'",
        "'speaker_3': 'Thank you so much.'",
        "'speaker_0': 'Thank you. Next up, Jesse Pearce.'",
        "'speaker_3': 'Jesse Paris represented for Denver Homicide. Low black stars are more for self-defense than positive action. Commitment for social change. And I'm also an at large candidate for 2019. We are in favor of this. We need more historical designations such as this throughout the city.'",
        "'speaker_3': 'We need to preserve the city's history and for future generations. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of Council on this item? All right. Seeing no questions. The public hearing for Constable 1542 is closed. Comments by members of Council Kelsey Lopez. Yeah. Thank you.'",
        "'speaker_0': 'When this was brought to our attention, as it came through the process, I had no idea the history. I had decided as a young man to walk by this building all over the time, and there was something absolutely distinct.'",
        "'speaker_0': 'Here's the thing about his historic buildings. You know, when you see one, right, and he and they are part of your childhood, they're part of your memory. They serve as landmarks in your community. And this was always one.'",
        "'speaker_0': 'Every time we would down the street is like there's a house is right. It's just stone house, right. And it almost looks like a small castle. But no, I'm happy to see this come before this council and happy to support it, encouraged my colleagues to do the same thing.'",
        "'speaker_0': 'You know, on on the West Side, we hadn't concentrated too much on on preserving a lot of things like this over the years. And when we catch them, I think it's important because it tells the history of of a complete Denver and that west side, that very proletarian history that we have.'",
        "'speaker_0': 'But also I think of this and I think of my grandfather. My grandfather worked for Samsonite when he was retired. And so seeing that and seeing this come up in a in a neighborhood not too far from where he bought a house is actually pretty cool.'",
        "'speaker_0': 'So. Mr. President, I support this and encourage everybody to do the same. Thank you. Councilman Lopez. Councilman Espinosa.'",
        "'speaker_2': 'You know, I just wanted to use this time to thank you, Mr. Crotzer, and your wife, for following up on that story, learning the history of the property and bringing it to our attention and and then securing it for future generations through the landmarking process.'",
        "'speaker_2': 'So just thank you very much for recognizing the value that it has has served, it is serving and will serve in the future. So thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman Cashman.'",
        "'speaker_7': 'Yeah, thank you, Mr. President. I probably should nail this down during questions. Either Jen or our historian, Councilman Flynn will probably know from my career as a journalist, I remember I think the Samsonite factory was on the east side of Broadway, around the Gates factory.'",
        "'speaker_7': 'And so I was never aware until this came up about the Schwitters home. And it's it's a beautiful piece. I'm glad you're bringing it forward. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Cashman. See no other comments. I'll just add a big thank you to all of our staff and our owners today. It's pretty exciting night to be able to designate two new structures in Denver for historic preservation.'",
        "'speaker_0': 'I'm excited to support this one, to make it two for two. Madam Secretary, roll call on Council Bill 1542. All right.'",
        "'speaker_5': 'Black Eye. Brooks Espinosa. Hi. Flynn. Hi. Gilmore. I. Herndon. I cash, man. I can each nigga. I just. I. Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close voting. Announce Results.'"
    ]
}