{
    "A proclamation honoring the University of Denver Pioneers Hockey team for their 9th National Championship Victory.": [
        "'speaker_1': '. You can compost it and so appreciate the work on the proclamation and we're going to go ahead and move on then in the agenda. Councilmember Cashman, would you please read Proclamation 20 to Dash 440 for us?'",
        "'speaker_2': 'Thank you, Madam President. I'm really excited to read Proclamation 22 does zero for 40, honoring the University of Denver Pioneers hockey team for their ninth national championship victory. And my proclamation won't be as long as Councilman Black will be equally as important and heartfelt.'",
        "'speaker_2': 'And before I read that, we're going to play a short video from the recent chapters.'",
        "'speaker_0': 'Thank you. Thank you.'",
        "'speaker_3': 'That.'",
        "'speaker_0': 'And here we go.'",
        "'speaker_5': 'The final college hockey game of the season is underway. It's so important for both of these teams. They can score. They can defend. On the borderline here. They come back strong on the pocket to keep that up. He carried behind the net.'",
        "'speaker_0': 'Lucky, though, that big step Father Jerry got to get.'",
        "'speaker_5': 'Fire in front of the fire. They're tough game. Denver's got their swagger at this time.'",
        "'speaker_0': 'He takes the lead.'",
        "'speaker_5': 'What made Rizzo Mazur Rizzo, Minnesota state his absolute stop.'",
        "'speaker_0': 'Next year will break their tie with North Dakota tied Michigan.'",
        "'speaker_5': '39. That's going to turn the countdown is on question time while the staff. Graduation from two University of Denver camp demonstrates the drill. I'm. All right.'",
        "'speaker_3': 'Good luck.'",
        "'speaker_2': 'All right. If you missed that game, it was definitely one for the ages. So let me read the proclamation again honoring the University of Denver Pioneers hockey team for their ninth national championship victory. Whereas the University of Denver was founded in 1864 as Colorado's seminary and is the oldest independent private university in the Rocky Mountain region.'",
        "'speaker_2': 'The school changed its name. The University of Denver in 1880 moved from its original downtown location to its familiar 125 acre campus at Evans Avenue and South University Boulevard shortly thereafter. And. Whereas, in 1949, the Du Arena, a former World War Two surplus drill hall from Idaho, was reassembled in Denver with the addition of an ice plant'",
        "'speaker_2': 'giving the university the ability to properly field an ice hockey team for the first time. The team hit the ice for their first game in December of that year, losing to the University of Saskatchewan. Wait for it 17 to nothing.'",
        "'speaker_2': 'Denver would lose its first nine games before recording the school's first victory against Wyoming on January 27 of 1950. And. Whereas, over the past 72 years under coaches Vern Turner, Neill, Sally Murray Armstrong, Marshall Johnston, Ralph Backstrom, Frank Sheraton, George Gwozdecky, Jim Montgomery and David Carle.'",
        "'speaker_2': 'The Mighty Dew Pioneers have developed a nationally renowned hockey program, assembling a combined record of 1499 wins 988 losses and 170 ties, winning 15 regular season conference championships and 17 conference playoff championships. And. Whereas, about 75 pioneers have gone on to play in the National Hockey League, including such well-known names as Keith Magnuson, Kevin Dineen, Matt Karl'",
        "'speaker_2': ', who was the 2006 HOBEY Baker winner as NCAA Player of the Year, Paul Stastny and Will Butcher 2017 HOBEY Baker Award winner and where as going into this year's NCAA tournament, the players had won Frozen four national championship titles in 1958, 1960, 1961, 1968, 1969, 2004, 2005 and 2017, leaving them one behind University of Michigan, who led'",
        "'speaker_2': 'with nine titles. And. Whereas, the 2000 to number four ranked pioneers won tournament games against University of Mass, Lowell 3 to 2 and Minnesota Duluth 221 before defeating the previously no. I will repeat the previously number one ranked University of Michigan 322 in overtime to advance to the championship final.'",
        "'speaker_2': 'And. Whereas, The Pioneers made a strong Minnesota State team who led one zero through two periods until D2 exploded in the third, with five players scoring five unanswered goals for an historic 5 to 1 victory, giving the PIOs their ninth title, putting them in a tie with Michigan for most NCAA championship wins, and making coach David Karl'",
        "'speaker_2': 'the fourth youngest coach to win a Frozen four title. And. Whereas, the University of Denver has sent yet another player into the NHL as forward Bobby Brink, a 2022 Hubie Baker finalist who led the nation this year in points and assists, signed with the Philadelphia Fliers just a few days after the Frozen four victory.'",
        "'speaker_2': 'Now, therefore, let it be proclaimed by the Council of the City and County of Denver, Section one, that the Council of the City of Denver City and County of Denver congratulates the University of Denver Pioneers hockey team on their ninth national championship and declares today, April 18, 2022, to be University of Denver Pioneers Hockey Day in the'",
        "'speaker_2': 'city and county of Denver in section two that the clerk of the city and County of Denver shall attest and affixed to seal of the city and county of Denver to this proclamation and copies be transmitted to David Carr.'",
        "'speaker_2': 'David Karl, coach of the Mighty, Mighty University of Denver Pioneers. Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Councilman Cashman. And I'd like to also welcome Councilman Herndon to the meeting this evening. Councilmember Cashman, your motion to adopt?'",
        "'speaker_2': 'Yes, ma'am. I move that proclamation. $22 0440 be adopted.'",
        "'speaker_1': 'Thank you. It has been moved and seconded comments by members of Council. Councilmember Cashman.'",
        "'speaker_2': 'Yeah, thank you again, Madam President. It is truly an honor to represent the University of Denver on Denver City Council. You know, in my my years as a journalist, I not only followed the university, but their hockey program.'",
        "'speaker_2': 'And while with any long established program, there have been some ups and downs along the way. This is truly year after year after year. Top of the Heap nationally recognized program. And you know, where people spend so much time paying attention to our professional sports teams, to those that do carry on muscle.'",
        "'speaker_2': 'But, you know, to look at athletes that are there for the love of the sport, I'm sure some hope to advance to the pros along the way. None none of the guys that you saw on the ice in the picture earlier are making $27 million a year.'",
        "'speaker_2': 'If they are, I think you're violating some NCAA rules, aren't you? And so I think the level of hockey that they put forth year after year is it's worth the price of admission if you haven't been to a do you game.'",
        "'speaker_2': 'I advise you to get over to the campus. You will feel that your money is well spent. So I just want to congratulate I know we have a couple of players here and the entire do you team, the coaching staff, the athletic department for once again bringing home the trophy to Denver and giving us just one more'",
        "'speaker_2': 'reason to be proud that the university holds the the name of the city and county of Denver in its name. Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Cashman. And I don't think you're going to have any problem with this proclamation passing unanimously. Madam Secretary, Roll Call Cashman.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'I. Ortega.'",
        "'speaker_6': 'Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_6': 'Sawyer.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'Torres. I. Black.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'CdeBaca.'",
        "'speaker_3': 'I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Herndon. I hate.'",
        "'speaker_2': 'I.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announced the results.'",
        "'speaker_6': '13 Eyes.'",
        "'speaker_1': '13 Eyes. Proclamation 20 2-440 has been adopted. Councilman Cashman, we've got 5 minutes for the proclamation, acceptance. And so we'll let you invite up who's going to do that?'",
        "'speaker_2': 'Thank you, Madam President. I'd just like to note that that proclamation would be a shut out you. Very nice. I know we have a contingent from due. I hope someone will come up and make a few comments. Just come up to the mic, guys, and introduce yourself, if you would.'",
        "'speaker_2': 'We have a couple of jacks here. I'm Jack Caruso. I'm detective on first and foremost. We obviously thank you guys for having us today. It's been a pretty crazy week or so and obviously filled with excitement and a lot of fun.'",
        "'speaker_2': 'We're just more than pleased to be here and thank you, guys. Yeah. I just wish you were honored and grateful for your guys's proclamation for us. And it's been a great week, and we're super excited to celebrate if you guys.'",
        "'speaker_2': 'Thank you very much. And I hope you never underestimate how much it means to us as individuals and to the city as a whole. That level of accomplishment, it shines a light on everybody and it means a whole lot.'",
        "'speaker_2': 'Thanks for your hard work. Absolutely. Thank you. Thank you. Thank you. You betcha.'",
        "'speaker_1': 'Thank you. Yeah. Well, thank you so much and congratulations again. And to note proclamation 20 2-441 has been placed on consent this evening, as Councilmember Sawyer had mentioned in the announcements. Madam Secretary, would you please read the bills for introduction?'"
    ],
    "A resolution approving a proposed Third Amendatory Agreement between the City and County of Denver and Integral Recoveries, Inc. to amend provisions and extend the term. Amends a contract with Integral Recoveries, Inc. to add two (2) years for a new end date of 2-1-2024 to continue collecting restitution, delinquent fines, costs, and fees for Denver County Court. No change to contract amount. (COURT-202262767). The last regularly scheduled Council meeting within the 30-day review period is on 5-9-22. Councilmember Kashmann approved direct filing this item on 4-14-22.": [
        "'speaker_1': 'No items have been called out under Pendine. No items have been called out. Madam Secretary, if you would, please put the first item up on our screens. And I'm thinking we might need to move.'",
        "'speaker_3': 'Nope.'",
        "'speaker_1': 'We've got him coming right back in. We've got resolution four, two, one on the floor. Councilmember Cashman, we know you're headed back to your seat, but I know that you wanted to make a comment on resolution for two one this evening, sir.'",
        "'speaker_2': 'Thank you for your patience, Madam President. Yeah. We had this bill come before us last week. County court brought a bill forward to extend a contract for collections that's within to grow. That's been in place for a little bit.'",
        "'speaker_2': 'And to reinstate collections on amounts $300 and under that had been put on hold due to some programing issues. This council decided that it wasn't ready to reinstate the 300 and below provision, with some concerns that the collection of fines be equitably undertaken and not unfair to any certain groups.'",
        "'speaker_2': 'So the Court all of us received a letter from Kristen Wood, court executive this past week, bringing this matter back with simply an extension of collections over that limit and promising to participate in an equity assessment and working with our partners at the Office of Financial Empowerment and Protection to be sure that if it is decided that'",
        "'speaker_2': 'they would like to move forward in the future, that there will be more information which we might base our decision. So I agreed to direct file this, and I'm comfortable with a two year extension of the existing contract with no additional provisions.'",
        "'speaker_7': 'All right.'",
        "'speaker_2': 'Thank you, Madam President.'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver and Frontier Airlines, Inc. concerning a use and lease agreement which includes the preferential leasehold of 14 gates at Denver International Airport. Approves a use and lease agreement with Frontier Airlines, Inc. for rates and charges and for 10 years for preferential leasehold of 14 gates at Denver International Airport in Council District 11 (202055453). The last regularly scheduled Council meeting within the 30-day review period is on 5-9-22. The Committee approved filing this item at its meeting on 4-6-22.": [
        "'speaker_1': 'Thank you, Councilmember Cashman. And we're going to go ahead and move on then. Madam Secretary, would you please put the next item on our screen and we're going to go to Council Member State Abarca. If you go ahead with your comments on Resolution 375, please.'",
        "'speaker_8': 'And and is it possible to just lump these two together? Three, seven, five and three seven, six? There? Yes.'",
        "'speaker_1': 'Okay. Several comments. Yes.'",
        "'speaker_8': 'Catalina. Just a couple of questions I had asked in an email about if the new expansion plans for Frontier took into consideration the ACL lawsuit, that alleged or settlement that was won because Frontier was not providing lactation opportunities, lactation rooms to their pilots and flight attendants.'",
        "'speaker_8': 'And you said in the email that we don't have to build for Frontier, but you said Frontier was trying to build special units. Can you Tom, can you explain a little bit more how they're addressing the settlement and how will be kept up to date on how the plans evolve to make sure that they meet those requirements'",
        "'speaker_8': '? Sure.'",
        "'speaker_6': 'Carolina Flores, manager.'",
        "'speaker_8': 'Of legislative affairs at an.'",
        "'speaker_6': 'International airport. Thank you for those great questions. Dunn is not in charge of compliance on behalf of the airlines. However, I did note in my email that Frontier will be building out two nursing spaces for nursing mothers and their space in addition to the seven public facing areas that are available to anyone.'",
        "'speaker_8': 'So is Dan aware of the details in that case? I think that the issue in that case was that flight attendants and pilots who are between flights don't have enough time. Our airport is huge. They don't have enough time to get to the lactation rooms that exist and get back to their flights.'",
        "'speaker_8': 'Is then actually taking a look at how we create facilities that don't create that problem.'",
        "'speaker_6': 'That is a great question. And I.'",
        "'speaker_8': 'Will bring up our senior vice.'",
        "'speaker_6': 'President, of course, expansion. Awesome.'",
        "'speaker_8': 'I just want to make sure that we're very, very attentive to that, because as we try to diversify the workforce, we want to make sure that we're being considerate in that way of different needs. So thank you.'",
        "'speaker_2': 'Good evening. Stu Williams, senior vice president of airport expansion at Denver International Airport. Councilwoman Diaz, answer your question, especially as we've gone through the expansion phase. We have worked to get lactation rooms or nursing rooms closer to where their operational space would be.'",
        "'speaker_2': 'So in the case of Frontier, specifically, as it will be voted on later and what we've displayed to council, we're building a significant back, a house space for their operation. And nursing lactation rooms are actually within the area of all their other backhouse space and only minutes from their gates.'",
        "'speaker_8': 'Awesome. Thank you very much.'",
        "'speaker_2': 'Thank you.'"
    ],
    "A resolution approving a proposed Second Amendment between the City and County of Denver and WSP USA, Inc. concerning additional professional services associated with the Concourse Expansion Program at Denver International Airport. Amends a contract with WSP USA, Inc. to add $27,000,000 for a new contract total of $87,000,000 and 2.5 years for a new end date of 12-31-2024 for additional professional services associated with the Concourse Expansion Program as well as controls & quality assurance work at Denver International Airport in Council District 11 (202262566). The last regularly scheduled Council meeting within the 30-day review period is on 5-9-22. The Committee approved filing this item at its meeting on 4-6-22.": [
        "'speaker_1': 'All right. Thank you, Stu, for the answer in Carolina. And we're going to go ahead and move on. Thank you, Councilmember CdeBaca, for those questions. Madam Secretary, if you would, put the next item on our screens. Councilmember Sandoval, would you please put resolutions three seven, seven through 380 on the floor for adoption?'",
        "'speaker_4': 'I move that resolutions 377, 378, 379 and 380 be adopted in the block.'",
        "'speaker_1': 'Thank you. It has been moved and seconded questions or comments by members of Council. Council Member. Sawyer.'",
        "'speaker_7': 'Thanks, Senate President. As I mentioned in committee, I'm not comfortable moving these contracts forward. I've got two concerns. The first is that once again, the airport is asking us to vote without all the information they told us in December.'",
        "'speaker_7': 'They'd be back in January to provide their CP program information, and they didn't. Now they're saying it will be in May, in two weeks. I hope it is. But without that information, I'm not comfortable voting yes. Additionally, I have a couple of concerns about these contracts because they are extensions to contracts that are already in existence.'",
        "'speaker_7': 'I certainly understand the time crunch at an airport like them in getting this work done, but I also don't think it's appropriate that we're looking at contracts. Two of these five are over $1,000,000,000 at this point. For us not to send those back out to bid is just not acceptable.'",
        "'speaker_7': 'I don't I don't see why Dems should have to get around the contracts bid process than the RFP process that's set forth by our city policies and ordinances. I believe that one is actually Executive Order eight, but I'm not 100% sure.'",
        "'speaker_7': 'But I do think it's important that these contracts go out to bid, that we are keeping an eye on our contractors and that we're getting the best value for our residents. And I can't say in these contracts that we are.'",
        "'speaker_7': 'So I'm going to be a no tonight and also going to be a no on 381. I know it's been called out separately for a different issue, but that is also included in these contracts. Thanks, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Sawyer. Councilmember Kinney.'",
        "'speaker_7': 'Thank you very much. I have really agonized over this same issue that Councilman Sawyer mentioned, which is the lack of competitive bids for this particular set of contracts, as well as the prior one that we did, the Great Hall.'",
        "'speaker_7': 'I actually do understand and agree that Executive Order eight includes an exception for special circumstances. And I do think that that there are circumstances involved in these contracts. And, you know, I'll give you an example of where I myself have faced a decision like this.'",
        "'speaker_7': 'When I was at the Union Station Project Authority many years ago, we had a contractor on site doing pre-development work for the bus station and the rail lines that are now around Union Station. And we had anticipated a long, long developed federal loan that got delayed.'",
        "'speaker_7': 'And we had a choice to make about paying a contractor to stay deployed on the site in spite of the fact that we didn't have the money to finish the project and, you know, sending them home, sending the massive crane and all of this, you know, specialized equipment that they had brought to the site home and then'",
        "'speaker_7': 'rebidding and restarting the project when the federal loan came through. And I remember sitting in that seat and thinking, you know, this is crazy, too, you know? But you start to learn about the cost of taking work down and redeploying it.'",
        "'speaker_7': 'And so I, as a member of that board, made the hard decision to keep the team deployed rather than stopping, rebidding, restarting and voted for that process. Understanding it wasn't an ideal situation. You know, I think that the lesson needs to be, though, that those circumstances have to be really rare.'",
        "'speaker_7': 'And I think that, you know, the Great Hall case was very rare. We had a very strange, you know, situation with the termination of a contractor. We had serious security upgrades that frankly needed to be made. It was an it was it was a much easier case than this one.'",
        "'speaker_7': 'And so I have spent a lot of time, you know, really contemplating. I spent time today with Phil Washington talking about what public competitive contracting brings and what scrutiny this decision had in terms of the performance of the contractor, in terms of raising the risks.'",
        "'speaker_7': 'You know, I wasn't in those rooms. You know, I was in the room when I when I voted on that Union Station situation that I described. And I could see the costs and I could see each of. You know, contractor performance metrics are being weighed.'",
        "'speaker_7': 'I don't have that ability here, but I did get pretty satisfactory answers as to the type of scrutiny that this project went through. And I will say this, we are the third busiest airport, and I do believe the facility needs to continue to expand to accommodate that.'",
        "'speaker_7': 'We perhaps didn't expect to be in this position quite as quickly as we were. But I do have to say, the importance of the project, the scrutiny that it took with, frankly, a contracting method that I'm not totally comfortable with, it was much closer to the line for me.'",
        "'speaker_7': 'This one was I share all that, you know, to say that I am going to be supporting the bill today based on a set of practices and procedures that I understand have been put in place in the airport.'",
        "'speaker_7': 'In terms of the CEO individually signing off on any contract extensions, individually reviewing contract extensions to make sure that it wasn't just that we didn't have ourselves organized in time to put something out to bid. It doesn't count as a special circumstance if you use it over and over again.'",
        "'speaker_7': 'Every city project is urgent and every city project takes time to bid and every city project gets more expensive while materials costs or labor costs go up. So none of those things are unique. What is unique here is the opportunity to save millions without redeployment and some of the urgency of the growth of the airport and being'",
        "'speaker_7': 'able to meet that demand on a short timeline. Those those were some things that were a little bit prompted by the pandemic recovery with domestic travel recovering more quickly than international. Those are some things that are unique enough that I have come to the decision that I was supporting this today.'",
        "'speaker_7': 'But the culture of our airport has to demonstrate its commitment to competitive bidding. And it's not enough to say that we're competitively bidding subcontracts. Primes make a lot of money. Primes control schedule. They control the sequencing of work.'",
        "'speaker_7': 'They control the selection of subs. They matter. So don't bring another of these extensions, you know, to special circumstances in a row is pretty extraordinary. I won't believe you if it happens again. And I hope the those who come after me won't either.'",
        "'speaker_7': 'You have to be committed to competitive bidding and you need to plan ahead for it. So you should be thinking now, right in your capital improvement plan, about what projects you want to be putting out for procurement today to bring to this council in three or six months.'",
        "'speaker_7': 'You know, it's a long process plan ahead. That's the message. So thank you, Madam President.'",
        "'speaker_1': 'Thank you. Councilmember King Beach Kimmich. Madam Secretary, roll call on resolutions 22, dash 37737837, nine and three eight. Please.'",
        "'speaker_6': 'SAWYER. No.'",
        "'speaker_3': 'Torres I. Black eye.'",
        "'speaker_6': 'CdeBaca. No. Clark.'",
        "'speaker_5': 'I. Flynn High.'",
        "'speaker_3': 'Herndon High. High. High.'",
        "'speaker_2': 'Cashman High.'",
        "'speaker_6': 'Kenny Ortega.'",
        "'speaker_4': 'Sandoval, i.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce results.'",
        "'speaker_6': 'Two names.'"
    ],
    "A resolution approving a proposed Second Amendment between the City and County of Denver and Turner-Flatiron Joint Venture concerning additional construction services associated with the Concourse Expansion Program at Denver International Airport. Amends a contract with Turner-Flatiron Joint Venture to add $185,000,000 for a new contract total of $1,125,000,000 and 2 years for a new end date of 12-31-2024 for additional construction services associated with the Concourse Expansion Program at Denver International Airport in Council District 11 (202262567). The last regularly scheduled Council meeting within the 30-day review period is on 5-9-22. The Committee approved filing this item at its meeting on 4-6-22.": [
        "'speaker_1': '11 eyes. 11 Eyes. Resolutions 377 through 380 have been adopted. Madam Secretary, please put the next item up on our screens for us this evening. Councilmember Sandoval, would you please put resolution 381 on the floor for adoption?'",
        "'speaker_4': 'I move that resolution 381 be adopted.'",
        "'speaker_1': 'Thank you. And we have it moved and seconded questions or comments by members of council. I am going to make the first comment. I've called this out because I am going to abstain on this tonight. My brothers, my brother in law excuse me, brother in law is construction company Gilmore.'",
        "'speaker_1': 'Construction is a sub on this particular contract and so I will be abstaining this evening. Councilmember Sawyer, did you have any additional comments to make?'",
        "'speaker_7': 'Thanks, Madam President. I made my comments earlier. This is one of the the previous block, but because you had called it out to abstain, it is just being voted on separately. So I'll be a no on this one as well.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'All right. Thank you. Madam Secretary, roll call on resolution 22, dash 381, please. Oh, I'm sorry. We will go ahead and pause. Councilmember Ortega.'",
        "'speaker_3': 'We're.'",
        "'speaker_1': 'And right before he made that statement, sir, I saw that. I just want to add that I was in Councilman Sawyer's shoes a number of years ago before we started receiving reports from primarily three of our department's public works, which is now known as the Department of Transportation, Infrastructure and Parks and Recreation and Denver International Airport, known'",
        "'speaker_1': 'as Den. We first got reports from Public Works on all their uncalled contracts because we started seeing waves of them coming through where, you know, some of them had very high ticket prices and that was the only time we would see those contracts.'",
        "'speaker_1': 'They would have many bids after that, and we weren't seeing any data on how they were being used, how many were being used, which ones were not being used at all. So. Those reports really have helped significantly. Parks and Rec then followed and we got the first report from then this week on their uncalled contracts.'",
        "'speaker_1': 'And I think if council members have concerns about data that we're not getting, we should express that. But. That has helped tremendously in terms of making sure that we know how those are being used. And there's that tracking system.'",
        "'speaker_1': 'Any of those that are using women in minority businesses, we get that additional data from our Office of Contract Compliance, now known as the SBA. There's all these acronyms for our agencies. It's hard to keep keep track because the names change from time to time.'",
        "'speaker_1': 'But we are now getting the data. And I just have to say that Phil Washington and his team have been doing an incredible job with being very transparent about the projects or being that are being brought before us for approval, as well as answering all the financial questions, which was one of the missing pieces when we had'",
        "'speaker_1': 'the Great Hall brought before us, when some of us got the contract on the Great Hall, the financials were not part of that. How do you make a decision when the heart of the deal are the financials and you don't get to see that?'",
        "'speaker_1': 'That hasn't been the case with these projects that are being brought forward. The expansion of the gates are very important to the growth of the airport. I just flew in on Saturday on a flight that had to wait and sort of fly over a little further north of the airport because the gate wasn't ready.'",
        "'speaker_1': 'And these gate expansions are very critical to being able to get the planes to the gates on time so that people can be, you know, move through the airport. And I also appreciate the work and the discussion that we had at our last meeting about just how all the assets are being tracked.'",
        "'speaker_1': 'And we will be getting a complete report on that. There's an updated management system that is being used to ensure that we're tracking which of those actually have warranties on them. So we're not paying for work that is still warranted and we're taking advantage of of those things when we have any of those assets that break down'",
        "'speaker_1': '. So I just am saying all of this didn't say that with the previous bills that I will be supporting this tonight because I think we have a leader that is being very thorough and attentive to the expectations that we have and wanting to see more information before we're making decisions about what we're voting on.'",
        "'speaker_1': 'Thank you, Madam President. Thank you, Councilmember Ortega, and see no other speakers in the queue. Madam Secretary, roll call on Resolution 22, dash 381, please.'",
        "'speaker_3': 'BLACK Hi. CDEBACA No.'",
        "'speaker_2': 'All right.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_2': 'Hi.'",
        "'speaker_3': 'Herndon. Hi. Hi.'",
        "'speaker_6': 'Cashman.'",
        "'speaker_2': 'Hi.'",
        "'speaker_6': 'I. Ortega. I. Sandoval.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'Sawyer.'",
        "'speaker_7': 'No.'",
        "'speaker_6': 'Torres. Madam President.'",
        "'speaker_1': 'Epstein. Madam Secretary, close the voting and announce the results.'",
        "'speaker_6': 'One abstention. Two nays. Ten Eyes.'"
    ],
    "A resolution approving the Mayors appointment and reappointments to the National Western Center Authority Board of Directors.  Approves the following Mayoral appointment and reappointments to the National Western Center Authority Board of Directors: appointment of Sandra Ruiz-Parrilla for a term effective immediately and expiring 12-31-2024, or until a successor is duly appointed, and the reappointments of Steven McCarthy and Lucia Guzman for terms effective immediately and expiring on 12-31-2026, or until a successor is duly appointed. The Committee approved filing this resolution by consent on 4-5-2022.": [
        "'speaker_1': 'Ten Eyes. Resolution 22, dash 381 has been adopted. Madam Secretary, would you please put the next item up on our screens? Councilmember Sandoval, would you please put resolution three, six, six on the floor for adoption?'",
        "'speaker_4': 'I move that consideration of resolution 366 be postponed to April 25th, 2022.'",
        "'speaker_1': 'Just a moment where I just need you to.'",
        "'speaker_4': 'Please remove that resolution, be adopted.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Very good. Thank you. When we've got it, we'll get it. It's been moved and seconded. We've got that. Councilmember CdeBaca, your motion to postpone.'",
        "'speaker_8': 'I moved that. Hold on. You guys skipped ahead. I move that a 20 2-3 66 be postponed until next Monday.'",
        "'speaker_1': 'Okay. Would you like to give any reasoning or.'",
        "'speaker_8': 'Their sound on it? Yeah. There's some confusion in community and with the mayor's office about one of the appointees. And we just want to get some clarification before we move forward with this one.'",
        "'speaker_1': 'All right. Thank you. And my scripted moved as well. And so we've got it. It's been moved and seconded. We've got council members that Ibaka gave the reasoning behind that. Are there any questions or comments by members of council?'",
        "'speaker_1': 'Not seen any additional. Madam Secretary, roll call on the postponement of Resolution 22, Dash 366 to next Monday, April 25th, 2022.'",
        "'speaker_3': 'CDEBACA Hi.'",
        "'speaker_5': 'Clark All right. Flynn i.'",
        "'speaker_6': 'Herndon Hines.'",
        "'speaker_2': 'I.'",
        "'speaker_6': 'Cashman I. Kenny Ortega I. Sandoval, I.'",
        "'speaker_3': 'Sawyer I. Torres I. Black I.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce results.'",
        "'speaker_6': '13 Eyes.'"
    ],
    "A bill for an ordinance amending the annual salaries of certain appointed charter officers. Amends Section 18-91 of the Denver Revised Municipal Code to adjust annual salaries for appointed charter officers in accordance with limitations set forth in the Charter and applied retroactively to January 1, 2022. The Committee approved filing this item at its meeting on 4-5-22.": [
        "'speaker_1': '13 Eyes. Resolution 20 2-366 has been postponed and will be back in front of council on Monday, April 25th. Madam Secretary, if you would, put the next item up on our screens. Councilmember Sandoval, would you please put Bill 383 on the floor for publishing?'",
        "'speaker_4': 'I move that council bill 383 be ordered published.'",
        "'speaker_1': 'Thank you. It has been moved and seconded questions or comments by members of council.'",
        "'speaker_8': 'Councilmember CdeBaca Yes, I called this out tonight. These are the salary increases for our mayoral appointees because we discovered that this is not required at this time. I think it's inappropriate to do, especially since it will be retroactive at the tail end of this mayor's term.'",
        "'speaker_8': 'I think we should allow the next mayor to come in and make some decisions around pay equity throughout the entire city organization before we give increases that in some places are over 20% increases. When we have employees in the city and county of Denver who can't afford to pay rent and also don't qualify for city benefits.'",
        "'speaker_8': 'We've got major, major structural issues that I think are making it challenging to fill many of our vacancies in the city. And so we should be looking at this more holistically. And so I'm a no on this tonight.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember CdeBaca. Council members will.'",
        "'speaker_7': 'Hear things when I'm president. I think that Councilwoman CdeBaca makes some really good points, and it's something to consider. Absolutely as we look at this contract. However, I also appreciate the testimony that we heard at committee, you know, regarding this situation where we have executive directors who are making less than their than their staff.'",
        "'speaker_7': 'You know, we want to make sure that whoever the next mayor is, they're set up for success. They are going to have to go through a council approval process for all of their cabinet appointees. And the things that we can do to help set that mayor up for success include equal or median, I guess, pay for for'",
        "'speaker_7': 'their executive directors. Like I said, it's not okay that we have a situation where some of our executive directors are making less than their staff members because their their salaries are set by ordinance. So this is always an uncomfortable conversation to have, but I think it is an important conversation to have.'",
        "'speaker_7': 'And I will be supporting it and I. Thanks.'",
        "'speaker_1': 'Thank you. Councilmember Steuer, Councilmember Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. I also agree that these are really important points that are brought up and talking about anyone's salary and having to vote on it is an uncomfortable position for myself. I also want to acknowledge that some of when I was learning about this contract and this ordinance, I did not realize that the appointees listed'",
        "'speaker_4': 'here did not receive a merit increase every year. So although our everyone in the city and county in Denver receives a merit increase, these appointees have been at the same rate this entire time. So someone from I'd say the executive director of Parks and Rec has been making the same entire exact salary for over six years without'",
        "'speaker_4': 'a merit increase. And that does not feel equitable to me. That does not feel fair. And that was something that I gave to consideration as I was thinking about this proposal. And I also did had the conversation, as with the mayor's office, about could the next mayor come in and we do this?'",
        "'speaker_4': 'Could the next mayor come in? We have a general election coming up and we'd have a new mayor in July of 23. And could they come and bring a proposal, an ordinance and undo this proposal? Yes, they could do it.'",
        "'speaker_4': 'Has that happened in the history of Denver? Yes, it has. We did have a mayor that came in and actually reset all of the salaries of our appointees there, the mayor's appointees. And I think we have been playing catch up since then.'",
        "'speaker_4': 'So I gave this contract and this ordinance a lot of thought since I got received my briefing. And although it makes me very uncomfortable to have to talk about other people and have to vote on other people's salary.'",
        "'speaker_4': 'I will be supporting it this evening because once again, these executive directors have not received a salary increase. And at the same time, when I asked if they had to participate in the furloughs that everyone else had to participate in.'",
        "'speaker_4': 'Yes, they did participate in the furloughs. So they participated in the furloughs. And most people got the merit increase in 2021 and they did not. So this is again, I'm going to say it for the record, an uncomfortable conversation to have appeared to be talking about.'",
        "'speaker_4': 'But given that I did give it consideration, I will be supporting it this evening. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Sandoval. Councilmember Cashman.'",
        "'speaker_2': 'Yeah, thank you, Madam President. I looked at this carefully as well. And these posts are the leaders of our departments of the big city government. And we're, as with all big cities, in a position right now where we've got some real challenges that we face and we need the best people possible that we can get into these'",
        "'speaker_2': 'positions. These salary increases do not put these people at the top of the heap compared to other cities. It puts them in the mid-range compared to other cities. And the if you look at the total, I added it up earlier this week and forgot to bring my numbers in with me.'",
        "'speaker_2': 'But if you look at all the dollars that we're talking about, while in some cases the percentage increases are substantial in in face of the leadership that we're asking for and the comparatively low dollars that this bill increases, the total salaries, it's minimal.'",
        "'speaker_2': 'And I'm glad to support this. I'd actually wish we could get our department heads rather than aim for 50%. I'd like to look at 60% and 70% of average. Like I say, I want the best people possible leading the city.'",
        "'speaker_2': 'And, you know, sometimes it helps to show people a little love dollar wise. So that's where I am on this. I will certainly support it.'",
        "'speaker_1': 'Thank you, Councilmember Cashman. Councilmember Herndon.'",
        "'speaker_2': 'Think about the president. You know, I was just asked the question, what were you doing in 2006? Most of us can't remember because it was that long ago these positions in front of us, with the exception of excise and license, because marijuana was added to their job description.'",
        "'speaker_2': 'So you could say 2017 for that individual, that's when they last got a salary increase. And if it was not management. People would be up and like, how could this be possible? But for some strange reason, because they're part of the executive team or the C-suite, it's a it should be questionable.'",
        "'speaker_2': 'And that's absurd. It's absolutely absurd. People should be compensated for the work that they do. We're the third busiest airport in the world, and our compensation for our CEO is paltry. And so for the next mayor, this is actually doing them a favor because we're upping the hours they can choose to keep the people on or they'",
        "'speaker_2': 'can look to hire new people. And it will be a challenge to hire new people if we keep our compensations at the levels that they are for the responsibility that they have. I said this at committee and I second Councilman Cashman.'",
        "'speaker_2': 'I wish this didn't take them to the midpoint. They should be paid. They should be compensated higher. But I'm happy to support this and I hope my colleagues do as well. Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Councilmember Herndon Council Pro-Tem Torres.'",
        "'speaker_7': 'Thank you so much. I'll also be supporting tonight. I think our executive leadership, in addition to the past two years of what we've all experienced, have done a tremendous job. We may disagree on a lot of different individual policies, but overall the work that is loaded upon them is pretty heavy.'",
        "'speaker_3': 'And I do.'",
        "'speaker_7': 'Agree. Councilwoman Sandoval mentioned we have had mayors in the past and coming who have asked their starting cabinet to take pay cuts. That was at a time of recession. We may be looking at that again in a couple of years.'",
        "'speaker_6': 'Who knows what it really looks like?'",
        "'speaker_1': 'But we should be able to attract key folks.'",
        "'speaker_7': 'To these positions for what Denver needs and where it's going. I will say that cumulatively, in terms of.'",
        "'speaker_3': 'Actual.'",
        "'speaker_7': 'Raises, city employees earned an average of 18% since 2016. The average here is at about 16%. So it's not far off from what our employee.'",
        "'speaker_1': 'Structure.'",
        "'speaker_7': 'Also received in that period of time. So I will be supporting tonight.'",
        "'speaker_1': 'Thank you. Thank you. Council Pro-Tem Torres. Councilmember CdeBaca, we have you back up in the queue. Is it okay if I go to Councilmember Ortega? All right. Go ahead, please. Councilmember Ortega. Thank you, Madam President. I just wanted to add, I won't repeat what my colleagues have already said.'",
        "'speaker_1': 'This is being covered by the budgets of the various agencies. So this is not requiring a separate supplemental budget appropriation to cover the cost of these salaries. So I will be supporting it tonight as well for all the reasons that have been expressed earlier.'",
        "'speaker_1': 'Thank you, Councilmember Ortega. Council members say the Baca thank you.'",
        "'speaker_8': 'I just want to thank my colleagues for their comments and also point out for the public that it was a choice of our mayor not to give merit increases annually that could have been done annually. It's a strange time to do that, given what we've just been through and what we're facing.'",
        "'speaker_8': 'Additionally, employees within the city who do receive merit increases do so based on their performance. That is not the case with our appointees. There is no evaluation process, no evaluation system, and often no recourse for staff in an agency when there is poor leadership or when there are things within the agency that they don't approve of.'",
        "'speaker_8': 'So it is a little bit different when we're talking about appointees and merit increases versus regular employees and merit increases. Additionally, when we talk about employees rights in the city and the pay inequity that's happening right here in all of our agencies, we explicitly prohibit our employees from collectively bargaining.'",
        "'speaker_8': 'And so I challenge my colleagues, if you truly do believe people should be paid what they are worth, to recognize that we have to then allow our employees throughout the city, not just a couple of select agencies who are some of the highest, who are led by some of the highest paid appointees on this list to collectively'",
        "'speaker_8': 'bargain. Everybody should have that right. And so still a no on this. And I hope that my colleagues think about the potential for creating equity in pay across our city agencies. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember CdeBaca. Councilmember Hines.'",
        "'speaker_2': 'Thank you. Council President A couple of things that my colleagues have already said about the third busiest airport in the world. It's crazy that our CEO is getting paid 40% less than than industry average. And we've had pay raises for most employees.'",
        "'speaker_2': 'And most employees have had several pay raises since 2016, but not these positions. Two things that haven't been covered so far are a point we just had in our budget and policy conversation this afternoon, an update on our the strength of our city in 2021.'",
        "'speaker_2': 'And and the appointees that we had, the leadership of the various agencies saved more money than we were expecting in 2021. And so I would say that the appointees directly did a better job in in being frugal with our our funds in 2021.'",
        "'speaker_2': 'But also in the same presentation, we learned that we, we collected more sales tax than for. And our income was greater than expected in 2021. So I recognize that 2020 was a tough year for everyone. But but we we found in this afternoon's presentation that 2021 was better than expected.'",
        "'speaker_2': 'And that's in part because of the leadership of our city and creating our recovery stronger than the state and national average. Thank you. Council President.'",
        "'speaker_1': 'Thank you, Councilmember Hines. And not seeing anybody else in the queue there. Madam Secretary, roll call on Council Bill 22, Dash 383, please.'",
        "'speaker_8': 'CDEBACA No.'",
        "'speaker_6': 'Clarke.'",
        "'speaker_5': 'All right.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Herndon, I. Hi. All right. Cashman Can each I.'",
        "'speaker_1': 'Ortega Excuse me, I.'",
        "'speaker_6': 'Sandoval.'",
        "'speaker_4': 'Hi.'",
        "'speaker_6': 'Sawyer.'",
        "'speaker_3': 'I. Torres, i. Black eye.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_6': 'When they. 12 Eyes.'",
        "'speaker_1': '12 Eyes. Resolution 22, dash 383 has been ordered published. That concludes the items to be called out this evening. All bills for introduction are ordered published. Councilmembers remember this is a consent or block vote and you will need to vote I.'",
        "'speaker_1': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Sandoval, would you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_4': 'I move that proclamations and resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in a block for the following items. Zip. 44142138348349350. 351375376382360361364372433365367434320.'",
        "'speaker_1': 'All right. Thank you, Councilmember Sandoval. And we've got that moved and seconded. Madam Secretary, roll call black.'",
        "'speaker_3': 'I CdeBaca. I, Clark. All right.'",
        "'speaker_6': 'Flynn. Herndon.'",
        "'speaker_2': 'I.'",
        "'speaker_6': 'Hi. Cashman.'",
        "'speaker_3': 'Hi, Kenny. I.'",
        "'speaker_6': 'Ortega. Sandoval. I swear, i. Torres. I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, to close the voting and announce results.'",
        "'speaker_6': '13 eyes.'",
        "'speaker_1': '13 eyes. The proclamations and resolutions have been adopted and the bills have been placed upon final consideration and do pass. Our pre recess announcement this evening. Tonight there will be a required public hearing on council bill 20 2-168 changing the zoning classification for 4116 to Cater Street in Sunnyside required public hearing on Council Bill 20 2-169 Changing'"
    ],
    "A bill for an ordinance changing the zoning classification for 4116 Decatur Street in Sunnyside. Approves a map amendment to rezone property from U-SU-C1 to U-SU-B1 (allows for an accessory dwelling unit), located at 4116 North Decatur Street in Council District 1. The Committee approved filing this item at its meeting on 2-15-22.": [
        "'speaker_1': 'We have three public hearings tonight for those participating in person when called upon. Please come to the podium on the presentation monitor. On the wall you will see your time counting down for those participating virtually when called upon.'",
        "'speaker_1': 'Please wait until our meeting. Host Promote you to speaker when you are permitted your screen will ask permission to allow us to promote you. Please accept the promotion. Once you accept the promotion, your screen will flash and say, reconnecting to meeting.'",
        "'speaker_1': 'Please don't leave the meeting. You will be reconnected and will need to turn on your camera. If you have one and your microphone, you will see your time counting down at the bottom of your screen. Once you finish speaking, you will change back to participant mode and your screen will flash one more time.'",
        "'speaker_1': 'All speakers should begin their remarks by telling the council their names and cities of residence and if you feel comfortable doing so, their home address. If you've signed up to answer questions, only state your name and note that you are available for questions of council's speakers will have 3 minutes.'",
        "'speaker_1': 'There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted. We will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating to virtual participants.'",
        "'speaker_1': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_1': 'Council Member Sandoval Will you please put Council Bill 20 2-168 on the floor for final passage?'",
        "'speaker_4': 'I move that bill. 0168 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved and. Seconded. Here. You look. Here. There we go. A moved and seconded. Thank you. Council Secretary. The required public hearing for Council Bill 20 2-168 is open. May we please have the staff report?'",
        "'speaker_6': 'Good afternoon, members of the City Council. My name is Fran Beneficial and senior city planner with Planning Services and today I am going to present an overview of the MAP Amendment four 4116 North the Gator Street. The subject property is located in Council District one with Councilwoman Amanda Sandoval.'",
        "'speaker_6': 'And it is located in the Sunnyside neighborhood. The property owner is proposing to rezone the property to a district with a smaller minimum lot size to be able to build a detached EU. Well, annotated EU is currently allowed under the existing Sony and Hitachi to you is not allowed because the it's is smaller than the minimum 5500'",
        "'speaker_6': 'square feet required in the U.S. you see one on district. Spuriously mentioned the properties currently in the urban single unit C one zone district and as you can see on the map. The properties are completely surrounded by other properties.'",
        "'speaker_6': 'Also shown us you see one. The Kremlin use of the site is single unit residential and it is surrounded by other single unit uses with some two unit multi-unit uses nearby. This slide here shows a couple of images of the existing area with the site of the proposed rezoning on the bottom left and an image that shows'",
        "'speaker_6': 'the residential character of the neighborhood. Now speaking to the process. Information on notice of the application was sent on December eight, 2021. Planning Board recommended approval and consent agenda on February 2nd. Attached is staff report. You can see a letter of support from Sunnyside, United Neighborhood Inc.'",
        "'speaker_6': 'Sunny that was provided by the applicant. The R.A. agrees that you will be a great enhancement to the Sunnyside neighborhood. To date, stuff has not received any other letters of support or opposition for any from any other notes or by the public.'",
        "'speaker_6': 'Now let's take a look at the Denver zoning code. Either of you criteria. The first criterion is consistency with adopted plans. There are three plans applicable to his rezoning Comprehensive Plan 2040 Denver and the Sunnyside Neighborhood Plan. The rezoning is consistent with several of the strategies in comprehensive plan 2040, but I will go just over a couple'",
        "'speaker_6': 'of them as an example. The MAP Amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will also lead to an environmentally resilient Denver by promoting infill development where infrastructure and services are already in place.'",
        "'speaker_6': 'Now looking at live in Denver. The subject properties map is part of the urban neighborhood context. Future places MAP designates the subject property as low residential place type displaced types have predominantly single and two unit uses, and accessory dwelling units are appropriate.'",
        "'speaker_6': 'North Street is designated as a local or on designated street type. The growth area in Denver is all other areas of the city. These areas are anticipated to see a 10% employment growth and 20% housing growth by 2040.'",
        "'speaker_6': 'Lupe in Denver also provides guidance on when it's appropriate to rezone to a southern district with a similar minimum standard size. It's appropriate when a pattern of smaller loads with smaller uses is present in surrounding blocks. Well most of the single unit residential lots contained in the same block and the subject property have a load size consistent'",
        "'speaker_6': 'with the existing use. You see one district on a 5500 square feet or greater on the block to the west of the subject property. More than 50% of the lots are 4690 square feet more consistent with the U.S. You'd be one swing district.'",
        "'speaker_6': 'If you take a look at the block to the north of this subject, property, more than half of the single unit residential lots have a lot smaller than 5500 square feet. The lot sizes contain on the blocks south of the proposed rezoning are more consistent with the U.S. You see one district, an over 5500 square feet, but'",
        "'speaker_6': 'still have a considerable amount of smaller lots in the middle of the block. With that agrees that there is a pattern of single unit residential smaller lot sizes in the in the area. And the applicant's proposal of a district with a smaller lot size is consistent with the future.'",
        "'speaker_6': 'Places Map Blueprint Denver Guidance. And the Blueprint Danvers Guidance for applying for residential future place. Blueprint also includes specific policy recommendations. Housing Policy four focuses on diversifying housing choice through the expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_6': 'Now, if you look at the Sunnyside neighborhood plan, it was adopted in 1993 and it is applicable to the subject. Property plan is silent on residential rezoning specifically. However, the proposed rezoning is consistent with the residential land use goal and housing goal that asked to upgrade the housing stock by encouraging long term residency and increasing home ownership'",
        "'speaker_6': ', the properties restored to a smaller lot size. The property owner will be allowed to build the 32 new building forming the subject site. The residential character of the Sunnyside will be maintained and the housing stock will be upgraded and will allow the property owner to age in place.'",
        "'speaker_6': 'Encouraging long term residency. Stuff also finds that the requested signing meets the next two criteria. The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare primarily through implementation of. Adopted plans.'",
        "'speaker_6': 'As discussed above. According to Blueprint Denver, it is appropriate to respond to a district with a smaller load size than the current district. If a pattern of similar loads with similar uses exists in the surrounding blocks, it is also specifically recommended the city diversify housing choice through the expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_6': 'This plan was adopted after the date of the approval of the existing zone district. Therefore, these are appropriate, justified circumstances for the proposed rezoning. Lastly, the proposal, Tony, is consistent with the urban neighborhood context residential districts and the US up one stone district.'",
        "'speaker_6': 'With that stuff recommends approval based on finding or review criteria has been met.'",
        "'speaker_1': 'Thank you, Fran, for the great staff report. And this evening, we have one individual signed up to speak on this required public hearing. Jesse Perez. Go ahead, please. Jesse, you just have to anew earn.'",
        "'speaker_2': 'Okay. I'm unmuted. Yes, my name is just Mr. Pearce and I'm a presenter for Blackstone at the moment for self defense, positive action command for Social Change, as well as the Unity Party of Colorado, the East Denver Residents Council and Frontline Black News.'",
        "'speaker_2': 'And I'll be the next November 2023. I'm in favor of this reasoning. Some nights, as is usual on these hearings, I'm in favor of the accessory dwelling units, the.'",
        "'speaker_5': '80 youth.'",
        "'speaker_2': 'On my support of 80 use when I ran for City Council at large in 2019, and I will continue to support them as mayor in 2023. So I'm in favor of this rezoning tonight. We need to use all over the city in every district.'",
        "'speaker_2': 'I'm good work. Amanda Sandoval, you got this. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers questions from members of Council on Council Bill 22, DASH 168. Not seeing any questions from members of council. The public hearing is closed. Comments by members of Council on Council. Bill 22. Dash 168.'",
        "'speaker_1': 'Council Member Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. This neighborhood, along with three other neighborhoods, but specifically the Sunnyside neighborhood, is undergoing a neighborhood planning initiative. And part of that is we are asking and requesting that this idea of these lot sizes be added to the neighborhood plan so that these type of rezonings don't have to come before city council anymore.'",
        "'speaker_4': 'Once we get a little bit further along, I'm going to start looking at areas of Sunnyside that don't have a current entitlement for accessory dwelling unit and work on that. But I would say three fourths of Sunnyside actually does have accessory dwelling unit zoning.'",
        "'speaker_4': 'So I appreciate my colleagues supporting this application. It has met all of the criteria and we will be doing as many as much proactive work in District one so that these type of rezonings don't have to come through.'",
        "'speaker_4': 'And that's the point of a neighborhood planning initiative is to call out issues such as these on lights. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Sandoval. And agree that this meets all of the rezoning criteria and happy to support this this evening as well. Madam Secretary, roll call on Council Bill 22, dash 168.'",
        "'speaker_6': 'Please send the vote.'",
        "'speaker_3': 'I swear I Torres Black.'",
        "'speaker_6': 'I see the Barca. Clark.'",
        "'speaker_2': 'All right.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Herndon, I.'",
        "'speaker_6': 'Cashman. All right. Can each.'",
        "'speaker_4': 'I.'",
        "'speaker_6': 'Will take it. Madam President.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2841 North Kearney Street in North Park Hill. Approves a map amendment to rezone property from E-SU-Dx to E-SU-D1x (allows for an accessory dwelling unit), located at 2841 North Kearney Street in Council District 8. The Committee approved filing this item at its meeting on 2-15-22.": [
        "'speaker_1': 'I. Madam Secretary, closed the voting and announced results. 13 Eyes. 13 Eyes Council Bill 20 2-168 has passed. Moving along. Councilmember Sandoval, will you please put council bill 22, dash 169 on the floor for final passage.'",
        "'speaker_4': 'I move that council bill? 169 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. And we've got it moved and seconded the required public hearing on Council Bill 20 2-169 is open and we have Fran with us again for the staff report.'",
        "'speaker_6': 'Afternoon slump in the Philippines city planner with planning services. And today, I'm going to present an overview of the MAP Amendment for 2841 North Kearny Street. The subject property is located in District eight, represented by Councilman Christopher Herndon.'",
        "'speaker_6': 'In the North Hill neighborhood. The request is to rezone to a district that will allow for an AEW while all other forms a new standard would remain the same. This property is currently in the urban single unit de Aix en district, which is which in this location would only allow for a suburban house and an urban house'",
        "'speaker_6': '. Building forms a minimum sample size of 6000 square feet. And as you can see on the map, the properties around it to the north, east and south. Other properties that are also shown is the X well to the west.'",
        "'speaker_6': 'We can see there is a whole block of grade 2.5. The current land use of the site is single unit residential and it is mostly surrounded by other single unit uses, but it has some multi-unit uses to the west.'",
        "'speaker_6': 'You can see here the land use map. There is also a school have a way half a block to a north. In this slide, we can see that the subject property is on the image on the bottom. Right.'",
        "'speaker_6': 'And it gives us an idea of the residential character of the neighborhood. Now speaking to a process. Information on notice of the application was sent on December nine, 2021, and this item was recommended for approval on Consent Agenda Planning Board on February 2nd, 2022.'",
        "'speaker_6': 'To date has not received any letters of support or opposition from the public or from any of the originals. Now moving on to the rezoning criteria, Denver's zoning code has five review criteria, which I will go over. The first criterion is consistency with adopted plans.'",
        "'speaker_6': 'There are three plans applicable to his rezoning. We have comprehensive plan 2040 Blueprint, Denver and the Park Hill Neighborhood Plan. The first gratuitous consistency of the rezoning is consistent with several of the strategies and comprehensive plan 2040. And my amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead'",
        "'speaker_6': 'to an environmentally resilient Denver by promoting infill development where infrastructure and services already in place. Now Blue in Denver says that this subject properties mapped as part of the urban edge neighborhood context. And if you do place this map designates the subject property as law residential place type place types have predominantly single and unit uses and accessory'",
        "'speaker_6': 'dwelling units are appropriate. Kearny Street is designated as a local street. The growth area in Denver is all other areas of the city. And this area anticipated to see a 10% employment growth and a 20% housing growth by 2040.'",
        "'speaker_6': 'Blueprint also includes a policy recommendations. Housing policy number four focuses on diversifying housing choice, the expansion of accessory dwelling units throughout all residential areas. The third plan that is applicable to his property is the Park Hill Neighborhood Plan that was adopted in 2000.'",
        "'speaker_6': 'The plan is silent on residential rezoning specifically. However, the proposed rezoning is consistent with the land use zoning rule and the land use and signing action. Recommendation number three stated in pages 32 and 33 of the plan. The proposed you would maintain the existing integrity of North Hill and increase the mix of housing options in the neighborhood'",
        "'speaker_6': ', which is comprised of single unit, two unit and multi-unit dwellings, thereby consistent with the small area plan. Stuff also finds that the requested signing meets the next two criteria. The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare primarily through implementation of adopted plans.'",
        "'speaker_6': 'The justified circumstance for this rezoning is clear. Since the approval of the existing ESU Dixon District, the city has adopted a comprehensive plan 2040 and Blueprint Denver. I stated throughout this presentation the proposed rezoning to ESU de one X meets the intent of both of these plans.'",
        "'speaker_6': 'Lastly, the proposed zoning is consistent with the urban edge neighborhood context residential district and the ESU. D1 takes on district purpose and intent. With that stuff. Requirements, approval based on finding or review material has been met.'",
        "'speaker_1': 'Thank you, Fran, for this great staff report. We've got one individual signed up to speak this evening, Jesse Paris. And Jesse, I've seen you in the queue. Oh, there you go. Are you unmuted? Go ahead, please.'",
        "'speaker_2': 'Yeah. My name is Justin with Sam Harris, and I represent for Blackstone a movement for self defense, positive action for social change, as well as the Unity Party of Colorado, the East Denver Residents Council on Black News. And I'll be the next mayor of Denver in 2023 and I reside in councilman Herndon's district of dissipates.'",
        "'speaker_2': 'I'm in favor of this rezoning tonight's a support to use. I would love to see any use in every single district in the city, all 11 of them. And this one I support as well. So please pass this.'",
        "'speaker_2': 'I'm pretty sure my councilman would agree this is a no brainer. It meets all five of the criteria of this just to see what adopted plans, uniformity of district regulations for this. Public health, safety and wellness just needs justifying circumstances just to see where neighborhood context zone district purpose in its sense.'",
        "'speaker_2': 'So please pass this to my. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers for this hearing. Questions from members of Council on Council Bill 22, DASH 169. The public hearing is closed. Comments by members of Council on Council Bill 22. Dash 169. Councilmember Herndon.'",
        "'speaker_2': 'Hey, Madam President, I do I do agree with Jesse that the criteria has been clearly met, and I look forward to voting yes. And I hope my colleagues do the same. Thank you.'",
        "'speaker_1': 'Thank you. And do agree with that assessment as well. I'll be happy to support this rezoning this evening. Madam Secretary, roll call on Council Bill 22, DASH 169, please.'",
        "'speaker_6': 'Herndon.'",
        "'speaker_5': 'All right.'",
        "'speaker_6': 'Hines Excuse me. Cashman.'",
        "'speaker_3': 'Can each.'",
        "'speaker_6': 'Ortega. Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_6': 'Sawyer.'",
        "'speaker_3': 'I. Torres, I. Black. I.'",
        "'speaker_6': 'See tobacco.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'Clark.'",
        "'speaker_2': 'All right.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_5': 'All right.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_6': '13 Eyes.'"
    ],
    "A bill for an ordinance designating 3435 Albion Street as a structure for preservation. Approves an individual Denver landmark designation for property located at 3435 Albion Street in Council District 8. The Committee approved filing this item at its meeting on 3-29-22.": [
        "'speaker_1': '13 Eyes Council Bill 20 2-169 has passed. Moving on. Councilmember Sandoval, will you please put Council Bill 22, dash three, four, four on the floor for final passage?'",
        "'speaker_4': 'Yes, I move that. Council Bill three, four, four be placed and adopted.'",
        "'speaker_1': 'All right, we'll place three, four, four on final consideration and do pass and we've got a motion and the second thank you. The required public hearing for Council Bill 22, Dash three, four, four is open. And we have Karen here for the staff report.'",
        "'speaker_6': 'Thank you. Good evening. My name is Karen. I'm a principal planner with Landmark Preservation and Community Planning and Development. And we are here for the designation of three, four, three five Albion Street, which is shown here with the arrow on the property of the overview.'",
        "'speaker_6': 'This property is located in Council District eight in Northeast Park Hill. You very recently approved a rezoning from a P.O.D. to mx2x. This particular property came in as a certificate of demolition eligibility about a year ago through a facilitated stakeholder process with the property owners, the community, historic Denver Landmarks staff, a preservation minded buyer was found and'",
        "'speaker_6': 'Steve Davis has purchased the property. Steve also worked on the Butler House. So that's if you know I'm not on this particular property, you can see on the lower right image this used to be a restaurant and prior to designation the non contributing 2005 addition was removed and so it's now designating the original portion of the structure'",
        "'speaker_6': 'on the upper left photo. Here is an aerial of the property prior to the removal of the demolition of the of that of that wing. And then on the right, you see the landmark boundary, which is on sort of the lower half of the property.'",
        "'speaker_6': 'And so we wanted to show you a site plan of this particular property. Steve Davis, after rezoning is going to do a zonal split to add density to the northern portion of the site. So you can see the white box on the bottom is the landmark portion.'",
        "'speaker_6': 'And then currently under concept review with development services is the plan for the northern portion of the site to add density. So you'll have the house fence, a driveway, and then you'll have the other units that will be fronting 35th Avenue, whereas this will front Albion Street.'",
        "'speaker_6': 'As you know, for a property to be designated according to the landmark ordinance, the structure must meet, maintain its integrity, must be 30 years of age or older. The structure needs to meet at least three out of ten criteria, and the OPC needed to consider the structure's historic context.'",
        "'speaker_6': 'This property meets three of the landmark criteria which we'll go through now. So first, that it has direct association with historic event or with the historical development of the city. This particular property represents the early boom and bust of Denver in the 1890s.'",
        "'speaker_6': 'This area was developed by John Cook Jr as the North Division of Capital Hill. This was the first house that was built on speculation in this particular subdivision in 1889, and building on speculation was new to the city of Denver at that particular time.'",
        "'speaker_6': 'Unfortunately for John Cook JR investors did not follow and there weren't really many other houses built in his subdivision. This is a 1905 based map that you're looking at here, and you can see there aren't very many properties that were constructed in the area.'",
        "'speaker_6': 'The panic of 1893 occurred and the boom abruptly ended. And so this particular property represents the early boom of the 1880s and then the 1893 bust that the city went through. When the silver panic, when the silver was not used anymore.'",
        "'speaker_6': 'And you had the panic of 1893. It's also significant is really being sort of on this property that straddled the urban and rural area of Denver. This is a.'",
        "'speaker_7': '1933 aerial.'",
        "'speaker_6': 'And you can see even at that point, there weren't very many properties there. And so this represents sort of an area when North Park Hill was really on the edge of Denver. Here are a couple of photos of the family that resided there for the longest tenure, the row family.'",
        "'speaker_6': 'They ended up using the house as a small family farm because in the 1920s there weren't enough houses around it and that was the best use of the property. The amenities in the area were really absent for the first few decades and remained that way until the area eventually developed through the postwar era in the 1950s.'",
        "'speaker_6': 'And so it has a direct association with the development of the cities from the 1889 through the 1950s, when the row family left the property. It is also significant for its queen, an architectural style. This can be seen in the steeply pitched roof with a cross gable, the dominant front facing gable.'",
        "'speaker_6': 'Asymmetrical appearance, the two story porch. One of the things that Queen Anne is really known for is its devoid of smooth walls. So you'll see a lot of brickwork, stonework, decorative wood elements, birch boards, spindles on the porch.'",
        "'speaker_6': 'But the Queen Anne's were rather fussy and didn't want to have smooth wall appearances. And so you can see that these are the character defining features of the Queen Anne style. And then finally, it's significant under the Criterion G for promoting the understanding and appreciation of the urban environment by means of its distinctive physical characteristics and its'",
        "'speaker_6': 'rarity. So as you look at this building today with the other properties around it, it's primarily surrounded by two revivals from the twenties and thirties, minimal traditionals from the forties and fifties and postwar housing. And then some recent larger scale development.'",
        "'speaker_6': 'And the stylistic elements that are found in these tend to be more simplified. Whereas you see in the elaborate Queen in, it stands out with its extensive detailing and distinctive characteristics. And then it's also significant for its rarity in Northeast Park Hill, as well as the Greater Park Hill neighborhood.'",
        "'speaker_6': 'There are very few houses of the same vintage in Northeast Park Hill. There's the McCoy house, which was built in 1889, the same time as the Robinson House. But it's a smaller Victorian cottage to the north and this is a better example of a queen in style.'",
        "'speaker_6': 'And then within the Greater Park Hill neighborhood, there are only a handful of homes constructed before the 20th century of this style and vintage. And so it's significant for its physical characteristics and its rarity. In terms of integrity.'",
        "'speaker_6': 'We look at does the property look like what it used to look like? So there are a number of we are all the alterations on this property, but they don't distract from the Queen in styling from the front of the right of way.'",
        "'speaker_6': 'It maintains its original location. The design materials and workmanship are retained, as is the feeling, setting and association. And then the LPC considered the historic context in the period of significance of this property as is appropriate for properties that are designated.'",
        "'speaker_6': 'The historic context context match as well with the criteria for which it's designated. It represents the initial planning and expansion of Denver, the speculation and then economic collapse, the rural area of the nature of the area in the first several decades.'",
        "'speaker_6': 'And then the period of significance extends through the ownership of the longest tenured owners, the Rowe family, which sold in 1953. Overall, it is over 30 years of age. The application needs at least three of the criteria. It retains integrity and the OPC considered its historic context.'",
        "'speaker_6': 'The Landmark Preservation Commission unanimously motion to forward this for your review and CPD staff recommends approval.'",
        "'speaker_1': 'All right. Thank you for the staff report, Kara. And this evening, we have five individuals signed up to speak. Our first speaker is in person in chambers. And it's Steven Davis.'",
        "'speaker_5': 'I'm the buyer. My wife and I, Jan, are buying this.'",
        "'speaker_2': 'Property. I do a lot of work in historic districts and I've worked on many landmarks. And the Bazaar House, as you heard up in the Highlands area. Actually, it's also known for Amanda Sandoval announced her candidacy for the city council.'",
        "'speaker_5': 'True.'",
        "'speaker_3': 'True.'",
        "'speaker_2': 'Anyway, in this process of working with this talk Denver to find or they would find homes that they wanted me to buy they would send me out there to try to wrestle away a contract or with a guy or gal.'",
        "'speaker_2': 'And and so I've had two failures in getting that accomplished. Those homes were ultimately demolished. So it's a it's an unfortunate thing. But on this particular home, for whatever reason, the seller decided to sell or the guy who had under contract and there was a good, you know, sort of exciting thing.'",
        "'speaker_2': 'And so I'm very happy to kind of pursue getting this home restored and brought back to its original glory. It's a it's a nice house. The councilman from District eight had a chance to go through it and see it prior to rehabilitation.'",
        "'speaker_2': 'So he knows what they look like and he has quite a bit of challenges. So I look forward to. Restoring the Robeson House as a new Denver landmark if the city council is able to approve the landmark designation.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_1': 'Thank you. Our next speaker is David Hagan, joining us virtually. Do we still have David Hagan with us? Okay. It looks like we've lost David Hagan and so we'll go ahead and move on. Michael Flowers.'",
        "'speaker_2': 'Michael Flowers. I work with Historic Denver, which is located at 1420 North Street in the old Emerson School. We are a 523 nonprofit dedicated to preserving Denver's unique identity cultural landmarks as workplaces. We fully support this designation of the Robinson House as a landmark staff discuss.'",
        "'speaker_2': 'The House helps tell the history of Denver's development, and it's one of the oldest extant houses in Northeast Parkhill. Robinson House also helps tell the story of the neighborhood from the late 19th century to now, and many still affectionately know it is.'",
        "'speaker_2': 'Kate's restaurant has been a fixture on the spot since 1889, and despite things changing around it with Steve's plan to rehabilitate the House.'",
        "'speaker_5': 'It will have a vibrant.'",
        "'speaker_2': 'Future in the neighborhood, but not always the history in Portland. It's also been valued by the community as well. The raw materials first came to our attention through our 50 Actions 50 Places campaign, which we asked the Denver community to help us identify the next 50 places to take a preservation action for the celebration of our 50th'",
        "'speaker_2': 'anniversary. Not long after receiving that nomination, the former owner of the property applied for a certificate of demolition eligibility. Community members came together to sign a notice of intent to designate. And through that process, the mediation was started to delay the issuance of the CDE.'",
        "'speaker_2': 'And during that time Steve was able to purchase the home and he's developed a plan to rehabilitate the home. But the townhomes on the north side of the property, that density and also landmarked the property. So as I said before, we fully support this this landmark designation.'",
        "'speaker_2': 'And I hope you will, too. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is joining us via Zoom, Tess Dougherty. Do we have tests with us? Okay. We're trying to get you to accept the promotion test since we have you signed up. Well, given another try here.'",
        "'speaker_1': 'Still no acceptance. Okay. We'll go ahead and move on to our last speaker this evening, Jesse Paris. Okay. Go ahead, please, with your comments, Jesse. Jesse, you can go ahead with your comments. It's looking like from our end the just season muted.'",
        "'speaker_1': 'So we'll. Try it once more. Go ahead, Jesse. Are we having an issue with Zoom or anything? All right. Well, we have just in the queue, but I'm not. Hearing from him. Okay. We're going to go ahead and move on then.'",
        "'speaker_1': 'That concludes our speakers this evening for this required public hearing. Questions from members of Council on Council Bill 22, Dash 344 Council Member CdeBaca Thank you.'",
        "'speaker_8': 'Not questions. Just a thank you for saving this little house. This is the house I drive by almost every day, and I have hoped that somebody would see the beauty in it. And I also hope that you guys will add to the history that the first museum for black girls was in that building right in the last'",
        "'speaker_8': 'year or two. And hopefully they blow up and do all the cool things that they're doing across the country. Charlie Billingsley is awesome and fully expect her to go down in history and you guys will have been the first place where she exhibited the museum for Black Girls.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilmember CdeBaca. And not seeing anyone else in the queue will close the public hearing. And any comments from members of Council on Council Bill 22, Dash three, four, four. And thank you, Councilmember CdeBaca, for sharing that history.'",
        "'speaker_1': 'And Councilmember Herndon, do you have any comments?'",
        "'speaker_2': 'Thank you, Madam President. Just I urge my colleagues to support this. I think the criteria has been met. I was in this when it was a restaurant, however long ago it was. And I do appreciate historic Denver and all the parties who came together to save this and be able to do the rezoning so that we can'",
        "'speaker_2': 'still designate the building and still allow for gentle density to happen on that parcel as well just to the north. So thank you all and I look forward to seeing it when it's complete. And thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Herndon. Councilmember Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. I just want to give a shout out to the Davises for being such thoughtful, historic preservationists. I know my predecessor called on you a lot. I know I've called on you a lot. So any time we see these diamonds in a rough, I know that I can call on you and you can go'",
        "'speaker_4': 'out there and use all the skills that you had working on all the projects in Denver. The Bosley House is my favorite. I see Jan walking by my house every day and then I want to go walk by United House.'",
        "'speaker_4': 'So just want to thank you and thank you for the partnership with Historic Denver and also just want to call out the process that when we opened up the historic ordinance, you know, there was a lot of concern of what would happen with that historic ordinance and adding this mediation and this pause to be able to get'",
        "'speaker_4': 'the applicant and other people at the table to talk, which is part of democracy, is talking about what our intentions are, have actually come with good results. So just want to thank everyone for their work. Those are not easy conversations.'",
        "'speaker_4': 'I've been in them as a council aide and as a council member when you're talking about property and property rights and values. So just want to say that thank you to everyone who had a great outcome because this could ended in a different way, which we all know too well in northwest Denver.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Sandoval. And likewise, I think that this meets all of the criteria. I'm very happy to support it and see it once it's restored in all its glory. And so thank you to the property owners for doing that well and Karen for her untiring patience and work on preservation in our city.'",
        "'speaker_1': 'We really appreciate that. Madam Secretary, roll call on Council Bill 20 2-344. Herndon.'",
        "'speaker_6': 'I High Cashman can each i. Ortega Sandoval.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Sawyer I.'",
        "'speaker_3': 'Torres I. Black I. CdeBaca clerk i.'",
        "'speaker_6': 'Flynn.'",
        "'speaker_5': 'All right.'",
        "'speaker_6': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, to close the voting and announce the results.'",
        "'speaker_6': '13 Eyes.'",
        "'speaker_1': '13 Eyes Council Bill 22, Dash 344 has passed. Thank you to the applicants and the members of the community who joined us this evening for our required public hearings, our pre adjournment announcement on Monday, May 16, the Council will hold a required public hearing on Council Bill 22, Dash three, four or five, changing the zoning classification for'",
        "'speaker_1': '6972 North Argon Street and 19300 East 72nd Avenue in DIA, and a required public hearing on Council Bill 22, Dash three five to amend in the far northeast area plan necessary for greenfield site to accommodate market demands since the plan's adoption.'"
    ]
}