{
    "A bill for an ordinance vacating a portion of right-of-way at 3100 Cherry Creek South Drive, with reservations.\n (INFRASTRUCTURE & CULTURE) Vacates land at 3100 East Cherry Creek South Drive in Council District 6. The last regularly scheduled Council meeting within the 30-day review period is on 7-20-15. The Committee approved filing this bill by consent on 6-18-15.": [
        "'speaker_8': 'So I'm going to read this finding, as you said, Charlie, finding a solution for completing the middle section of Cherry Creek South Drive between University and Colorado Boulevard has been quite a challenge for many years. But as Albert Einstein once said, You never fail until you stop trying.'",
        "'speaker_8': 'During the past few months, the residents of Cherry Creek Tower have been able to enter a successful dialog with the city, a process that's been defined by each party's ability to use some old fashioned skills. The ability to listen.'",
        "'speaker_8': 'The willingness to negotiate. The wisdom. To accept compromises that allow each to feel that its legitimate needs will be met. There are many people in this city to thank for supporting Cherry Creek Tower as the association has confronted the ramifications of losing a large number of our parking spaces.'",
        "'speaker_8': 'Among those people are Dennis Araghi, now retired from Public Works and apparently walking around with a golf club in his hands instead of his briefcase. Thanks, Dennis, wherever you are. Dave Hunt, Singer and Public Works is proving equally supportive as our new contact going forward.'",
        "'speaker_8': 'And the civil engineers and landscape architects working with us on behalf of the city have made the process of fleshing out all the necessary details, both a pleasurable and a creative experience. The entire project has a firm direction now, and we would like to express our appreciation for the city's willingness to engage in what I will call'",
        "'speaker_8': 'a creative win win solution to a long standing dilemma. It reminds me of something else that Einstein once said Creativity is intelligence. Having fun? In closing, we'd like to thank Charlie Brown for all his efforts on behalf of the city and its constituents and for the opportunity to be here this evening.'",
        "'speaker_8': 'Thank you so.'",
        "'speaker_7': 'Much. Thank you, Frank. Thanks to all of you. And thank you, Madam President.'",
        "'speaker_0': 'And congratulations, Councilman. Councilman Nevitt. Under bills for final consideration, you called.'",
        "'speaker_4': 'Out Council Bill.'",
        "'speaker_0': '402. What would you like to do with this Bill?'",
        "'speaker_1': 'Yes, ma'am. I need to offer two minor but important amendments.'",
        "'speaker_0': 'Thank you. Councilman Lopez, will you please put this bill on the floor?'"
    ],
    "Refers to the ballot at the November 3, 2015 coordinated election a question concerning the approval of an Amendatory Intergovernmental Agreement with Adams County governing the development and use of certain property at Denver International Airport. (BUSINESS DEVELOPMENT) Refers to the ballot at the November 3, 2015 coordinated election a question concerning the approval of an Amendatory Intergovernmental Agreement with Adams County governing the development and use of certain property at Denver International Airport. The last regularly scheduled Council meeting within the 30-day review period is on    .  The Committee approved filing this bill at its meeting 6-9-15.": [
        "'speaker_1': 'Thank you, Madam President. And move that bill for order to be published. Actually, it's final consideration. Oh, it's consideration. Okay. The place upon final thought. I'll do it again. I believe I move that council bill for it to be placed upon final consideration.'",
        "'speaker_1': 'Do pass.'",
        "'speaker_0': 'Thank you so much. Okay. I need a second. It's been moved and seconded. Councilman Neville, we need a motion to amend.'",
        "'speaker_1': 'Thank you, Madam President. So there are two amendments. And if we could take them in sequence, that would be great. So I move that Council Bill four to be amended in the following particulars on page three, lines six and seven, strike the clerk file reference 2015 Dash 0264 and insert this is important.'",
        "'speaker_1': '2015 dash 026 for a.'",
        "'speaker_0': 'Thank you. It's been moved and seconded comments by members of council councilmen Nevett and then Councilwoman Sheperd.'",
        "'speaker_1': 'Thank you, Madam President. So this this is to change or to update the clerk filing number as a consequence for the. I'm sorry, I'll start again. This is to change the clerk filing number for the amended I.J with Adams County.'",
        "'speaker_1': 'After the original filing of the document on June 18th, there was some back and forth between our attorneys and their attorneys and some clarifying language. No, no substantive changes have been made, but agreements and changes on clarifying language have been added.'",
        "'speaker_1': 'And so we need a new clerk filing number to refer to the updated document. The the changes just to outline them for you. There were four changes. One had to do with notice to the the OCC, the Adams County Group involved with the with the IGR in the airport regarding concessions and leasing activity at DIA, we had'",
        "'speaker_1': 'committed in our in our term sheet and what we had approved at committee and then here last week to give notice to the airport coordinating committee of any new leases and concessions at DIA outside of the terminal complex area.'",
        "'speaker_1': 'But there was some additional language to properly define what the terminal complex area is, and that's now clarified and is illustrated in the amended Iwga Amendment. Number two, or minor change number two has to do with the procedures for the approval of bioscience businesses on development parcels at DIA.'",
        "'speaker_1': 'The Intergovernmental Agreement limits bioscience businesses at DIA that would compete with the Fitzsimmons Medical Campus in Aurora, but includes procedures for waiving those restrictions. And the IGA needed to be clarified regarding what those procedures were on how the RCC would grant a waiver for biomedical businesses at DIA.'",
        "'speaker_1': 'The third minor clarification involved the enforcement of the revenue sharing obligation on the part of Denver, if you recall, were sharing 50% of the tax revenue on the specified development parcels and clarity was added to the proposed IGA that the the the share that Denver would be sharing could not be diverted for any other purpose.'",
        "'speaker_1': 'And then finally, the, the fourth minor change had to do with the rights of third party beneficiaries under the original IGA, the 1988 IGA, that was with Adams County. But there are provisions that grant cities in Adams County that border the airport, special third party beneficiary status, and those were Aurora and Commerce City.'",
        "'speaker_1': 'And the the clarifying language that's been added to the a mandatory IGA ensures that Aurora and Commerce City alone as those third party beneficiaries will continue to enjoy this third party beneficiary status. So those are the that's a that's a lot of palaver for the addition of the letter A to a clerk filing number.'",
        "'speaker_1': 'But that was the the the language that we're adding to the IGA.'",
        "'speaker_0': 'Thank you, Councilman Nevett.'",
        "'speaker_4': 'Councilman Shepard. Thank you, Madam President. Pro Tem, I actually called this out because I wanted to call it up for a vote. So I'm assuming you want to do that after the motions. Want to call it out. Yeah.'",
        "'speaker_0': 'Okay. It's.'",
        "'speaker_3': 'I should work on the amendment first.'",
        "'speaker_0': 'Okay. Yeah. All right. All right. So, Madam Secretary, roll call on the amendment.'",
        "'speaker_3': 'Nevett I. Ortega, Rob Shepherd, i. Sussman Brooks, i. Brown. I thought I can eat lemon pie.'",
        "'speaker_1': 'Lopez All right.'",
        "'speaker_3': 'Madam President. Hi, Ortega.'",
        "'speaker_0': 'Sorry. Still waiting for councilman parts. Thank you, Madam Secretary. Please close the voting and announce the results.'",
        "'speaker_3': '12 Eyes.'",
        "'speaker_0': '12 Eyes. Council Bill 402 has been amended. Councilman Neville, we need a motion to amend.'",
        "'speaker_1': 'Thank you, Madam President. This is the Second Amendment. So I move that council bill 402 be amended in the following particulars on page two, line 20. Strike the quote unquote comma after the word development and insert the following words, quote Without imposing any new tax or increasing any tax rate.'",
        "'speaker_1': 'Comma.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Comments by members of council. Gentlemen never do anything additional.'",
        "'speaker_1': 'Yes, ma'am. So the purpose of this amendment is just to add some clarifying language to the ballot question that we are sending to the voters to assure them that a yes vote on approving the new a mandatory IGA will not result in any tax increase over and above any current tax rates.'",
        "'speaker_1': 'There's a number of other items on the ballot this November that have tax issues in them, and we just wanted to make absolutely sure that the voters understood that, that this would be consistent with those other measures in that it would have no impact on anyone's tax rates.'",
        "'speaker_0': 'Thank you to any other members of council have comments. Madam Secretary, roll call.'",
        "'speaker_3': 'Nevitt Hi. Ortega Rob Shepherd. Susman Brooks Brown.'",
        "'speaker_4': 'I thought I.'",
        "'speaker_3': 'Can eat Lemon Lopez. All right. Madam President, I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': '12 Eyes.'",
        "'speaker_0': '12 Eyes Council Bill 402 has been amended. Councilman Lopez, we need a motion to order. Published as amended. Council Bill 4020.'",
        "'speaker_1': 'Madam President, a point of clarification or publish or or on final consideration is it adopted.'",
        "'speaker_4': 'Or published.'",
        "'speaker_0': 'As amended?'",
        "'speaker_1': 'No, I don't think that's right. I think it should be placed upon final consideration and do pass. Unless there's clarification from council. I'm ah council. City Attorney David Barr.'",
        "'speaker_8': 'Madam President. David Broadwell, Assistant City Attorney. Because his amendments change neither the title nor does the description of the bill. It can be adopted on final consideration tonight if you choose to do so.'",
        "'speaker_0': 'Thank you. State here.'",
        "'speaker_1': 'Thank you, Madam President. I order. I order the order. I move that council bill for all to be placed upon final consideration and do pass as amended.'",
        "'speaker_0': 'Thank you. It's been moved and seconded comments by members of council.'",
        "'speaker_4': 'So. Yeah.'",
        "'speaker_0': 'Councilwoman Shepherd.'",
        "'speaker_4': 'Thank you. So I had asked for this to be pulled out for a vote because I talked about this at great length last week, but I asked a lot of questions of of staff regarding this. And for me, this issue is not just a business deal.'",
        "'speaker_4': 'It's not just a business agreement between the two counties. What we're talking about here is development of 1500 acres at Dig, yet there is no land use or transportation planning moving forward. At the same time as this ordinance and from what I understood last week, there would not be one before the November vote.'",
        "'speaker_4': 'I realize that there are those who will say that this is just an opportunity for this conversation to begin, and I appreciate that sentiment. But land use and transportation is very much in the purview of what the city council does.'",
        "'speaker_4': 'And I cannot feel good about asking voters to vote on something that we don't understand what it is outside of the agreement. The last time I saw some conceptual planning around this issue was in January, which, as we all know, was several months ago.'",
        "'speaker_4': 'So although I certainly think the fact that Adams and Denver will be sharing tax revenue is historic and, you know, very much something, you know, to be proud of. And that's that level of coordination. And I certainly appreciate all of the work that has gone on behind the scenes between the two counties, and everyone has been involved'",
        "'speaker_4': 'in this project. And my vote is in no way intended to disparage that. But I just have to say that I'm not comfortable asking the voters to vote on something when I don't even understand what it is. So I will be voting no tonight.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman, never. Did you have another comment?'",
        "'speaker_1': 'Yes, ma'am. Thank you, Madam President. And before I go to my comment or really ask a question of the folks at DIA, I just want to point out last week we were graced with the presence of two county commissioners from Adams County here for this historic move forward together.'",
        "'speaker_1': 'And today we have again county commissioners Steve OTU Recio. Steve, raise your hands so the Denver voters can understand who their partner is. Thank you so much for being here. This is an amazing thing we're doing together. And I really appreciate you being in the chambers with us.'",
        "'speaker_1': 'So just to I don't know if it would change Councilwoman Sheppard's mind, but to get a little bit more clarity from DIA, I don't know who wants to sort of answer the question. So what is the why is this the proper sequence of moving forward, getting to this historic idea with Adams County?'",
        "'speaker_1': 'Before we do a detailed land use plan.'",
        "'speaker_0': 'Hi. I'm Kim Dan, the CEO of.'",
        "'speaker_6': 'Denver International Airport. We have been working on some planning, as you as you've mentioned, that you have been briefed on. And that work continues that work actually changes with this agreement because it as additional land and it further clarifies what we can and can not do on airport.'",
        "'speaker_6': 'What I would like to say is we are not going to leave the voters without any.'",
        "'speaker_9': 'Idea of what we're going to.'",
        "'speaker_6': 'Do. We have some conceptual decisions that have been made, and we are going to put together a package that will explain to the best of our ability to our citizens what it is we think we could do on airport.'",
        "'speaker_6': 'But in terms of having a really detailed land plan, that that still needs some work.'",
        "'speaker_1': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Lopez, followed by Councilman Ortega, followed by Councilwoman Kennish.'",
        "'speaker_1': 'Thank you, Madam President. I just wanted to also say that this is something I'm glad I'm glad to see somebody from Adams County. I know this has been a lot of work. It's a it was a lot of work to get to this actual point where where we're voting on it.'",
        "'speaker_1': 'You know, it's hard not to see it sometimes if you're really don't if you're not in the mix of things. But when you are, you know. Exactly for some reason or the other, I think a lot of it happened, I think, before even I was conceptualized was there literally there's been a lot of this.'",
        "'speaker_1': 'You know, we haven't had very good relationships with our neighboring counties. There's a lot of things that folks are still bitter over and sour over. And, you know, ask anybody in the legislature and they'll fill you in on it.'",
        "'speaker_1': 'You see it on a daily basis out there. The fact that we have this agreement, this inter, this IG is a very good thing and it's a very good thing with an important neighbor because that neighbor is growing as a city.'",
        "'speaker_1': 'We're growing. You know, there's a lot of folks that, hey, we don't like to see anybody building up this density. Well, we have this area that we believe we're able to develop to help offset offset that, offset that.'",
        "'speaker_1': 'And also because we have so many people calling Denver home, it's a good thing. The other thing, why I feel comfortable voting for this right now, and this is in no way any any fight that I'm trying to pick up.'",
        "'speaker_1': 'My colleague, Councilman Shepard, my neighbor, Councilman Shepard, I as a as a US as commissioners as well, and Denver County, I don't feel comfortable planning for property. We don't know. We can't we don't necessarily have the right to not develop.'",
        "'speaker_1': 'We own it, but we can develop it. And I think it's an act of it's not an act in good faith. If we're already taking that step ahead before the contracts being signed. Right. I would think something was fishy if I was on the Adams County side.'",
        "'speaker_1': 'And then there goes another two decades of distrust with the two counties. I think this is a good opportunity to do it. If there is any kind of zoning change or land use implementation, I would believe it would come to this body individually to vote on right as a separate as a separate entity in and of itself'",
        "'speaker_1': 'and as a separate issue. So I think it's going to be a good thing. You know, at the end of the day, this language going to be on the ballot. So. With that. You know, I'm fully supportive.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Ortega. Thank you, Mr. President. I have a couple of questions. My first one is for David Broadwell. Since you've been here longer than most. When was the last time we actually either updated or adopted a comprehensive plan for the city of Denver?'",
        "'speaker_0': 'For a strategic plan, whatever you want to call it it.'",
        "'speaker_8': 'You mean a comprehensive plan for the entire city that goes back to the early 2000? I think Councilman Rob might actually have the date more readily at our fingertips than I do, but.'",
        "'speaker_0': 'I think it was before this council came on.'",
        "'speaker_8': 'It was an it was in the year 2000. I knew it was a century.'",
        "'speaker_0': 'Yeah. All right. Was it? So I think that's part of what I'm hearing Councilwoman Shepherd raise. And interestingly, today, I met with one of the new incoming council members who is talking about a strategic plan for the city.'",
        "'speaker_0': 'Because we do have so many big projects coming forward and looking at how all of that plays into use of water, making sure that we work towards having a sustainable food source because we know not all of our food will continue coming from California because we can't get all of our Colorado water, the Colorado River water down'",
        "'speaker_0': 'to there before it all dissipates. So I think at some point, this is something that this body needs to begin to talk about. Obviously, we're not going to hold up this bill tonight to do that. But I think it's an important conversation that we need to have, given that as a metropolitan area, we continue to grow.'",
        "'speaker_0': 'And so I appreciate you raising that point. Councilwoman Shepherd, the other question that I wanted to ask was related to the master plan. Kim, if you wouldn't mind coming up to the microphone, please. You. You made mention of some decisions that have been made with regard to conceptual plans, if you will.'",
        "'speaker_0': 'I the word you used was conceptual decisions. But I'm just trying to figure out, is there. An updated DIA masterplan that looks at all of this other than what we've seen in some of the Aerotropolis documents, or is this part of what's been negotiated with Adams County during this last year and a half, almost two year negotiation'",
        "'speaker_0': 'process?'",
        "'speaker_6': 'Councilor one If I could clarify. So when I say we've made some decisions, an example of that would be I think you all have heard us talk in the last couple of years about using the.'",
        "'speaker_0': 'Term Airport City.'",
        "'speaker_6': 'But we don't use that term anymore because we have determined that what we are what we want to do on airport is not build some consolidated development at one point on the airport, but instead we want.'",
        "'speaker_0': 'To develop areas that are contiguous.'",
        "'speaker_6': 'With our neighbors and help to activate off airport development while it activates on airport. So it's decisions like that we have made the actual land use has a lot of work that does have to do with things like utilities, you mentioned and resources then and certainly now that we have the IGA in place and we know the'",
        "'speaker_6': 'area that we can develop, we will be developing a true land use but we do not have an up to date masterplan.'",
        "'speaker_9': 'Or land use plan that reflects this idea.'",
        "'speaker_0': 'Today. And Kim, will you just help clarify that when we talk about the clear zones, that's part of this agreement that is land that we own, that's off airport property, that's in Adams County. And so if I could.'",
        "'speaker_6': 'Clarify, I know it is it is on airport, but it is in Adams County.'",
        "'speaker_0': 'Sorry to say that. I turn that around. So when we talk about doing land use planning, it's conceptually what we want to do. But we have to go through Adams County zoning process, if you will, if we don't have the appropriate zoning to do what we might want to do within Adams County boundaries.'",
        "'speaker_6': 'And I think even more importantly, we would want to do that planning with Adams County.'",
        "'speaker_0': 'That makes sense. Okay. So I was just trying to figure out if there was anything more that is being discussed that might come forward as additional amendments? Or do we think this is it? Because as of last or Thursday before last one bill was actually filed, we thought that was that was it with the negotiations and the'",
        "'speaker_0': 'decision making, that's actually a David Broadwater question.'",
        "'speaker_8': 'I believe, Councilwoman, I am hopeful that this is the final document. There won't be any more tweaks, even clarifications. But I have to say it with this caution. This is has to be approved by six other jurisdictions right on its way to the ballot.'",
        "'speaker_8': 'And they'll be sitting in their city councils and all of those all five of those municipalities. And the Adams County commissioners, the commissioners in particular, have been very hands on in the negotiation. But there is this third party beneficiary status and the municipalities to one degree or another.'",
        "'speaker_8': 'And over the next couple of weeks, they'll be going to each of their governing bodies. And so, you know, unknown whether there's going to be any last minute things that will come up as a part of that approval process, as part of the key complexity of the whole deal is there are lots of parties involved, but we've'",
        "'speaker_8': 'been working diligently and long and hard to reach what we believe is the point of finality here tonight. And that's why confidently I felt like we could bring it forward to you and have you vote on it with a very high degree of confidence that this is it.'",
        "'speaker_8': 'But as you all know, there's a period of time now between now and the statutory deadline when it will actually go to the polls in both counties. And you can never say never, there's a possibility that something might have to be tweaked or changed.'",
        "'speaker_8': 'Non substantive, I'm sure, because as Councilman Levitt indicated, we've got a very firm commitment on all sides to the basic deal point, the term sheet that was given to you several weeks ago, the deal will not change if there's going to be any additional tweaks or amendments is going to be absolutely around the periphery.'",
        "'speaker_8': 'But as we sit here tonight, I don't expect that to occur.'",
        "'speaker_0': 'Thank you. That answers all of my questions, I think. Clearly when my colleagues worked with them, their partner and Mayor Webb subsequently, who work to build out the airport. But Mayor Pena, who worked to put this issue before Denver voters and many of us were out knocking on doors and trying to convince voters both in Denver and'",
        "'speaker_0': 'Adams County to place this on the ballot, that this was, in fact, going to be the economic engine for this region. And it has, in fact, been. I've seen communities both in Commerce City and Aurora grow tremendously, both commercial and residential.'",
        "'speaker_0': 'So there have been some benefit to our neighboring communities. We know that many of the people who work at DIA actually live outside of Denver in in many of those neighborhoods. Those communities. And I think this will continue to be an economic engine for Denver and for neighboring jurisdictions.'",
        "'speaker_0': 'And I am pleased that this, at least for now, limits the development to the 1500 acres. We have restrictions under FAA by which we cannot build within close proximity to the airfield. Those have already been defined in terms of where they're going to be placed.'",
        "'speaker_0': 'And so I think those assurances to the public are already intact. And so I think moving this forward makes great sense. And I am hopeful that we don't have to continue to see tweaks to this, that the work that's been done and the many things that have been part of the give and take on both sides works'",
        "'speaker_0': 'out on behalf of all of the parties that have been involved in this process. So I will be supporting this tonight. Thank you, Madam President. Thank you. Councilwoman Kennish, did you have a comment?'",
        "'speaker_6': 'Thank you, Madam President. I withdraw my name. I'll pass. Thank you.'",
        "'speaker_0': 'Councilman Farr to have a comment on Council Bill 402.'",
        "'speaker_5': 'Yes, ma'am. I think the issue before us is, should there have been more definitive planning to vote on this tonight? And it is my feeling that that we should not have done more definitive planning. Let me explain a different perspective.'",
        "'speaker_5': 'I recall when I served in the legislature, this issue was being embraced by Adams County. I mean, as I mentioned before, it was tough swallow for them. And they were giving permission for the airport to take over their land and they wanted it for an airport.'",
        "'speaker_5': 'The discussion wasn't about economic development on the airport land and having Denver do planning for the airport land. It was about building an airport that in surrounding communities could benefit, but not necessarily right on that airport. That was not to be economic development on the airport land.'",
        "'speaker_5': 'I would feel it's very disrespectful to our adjacent county to go ahead and say, gee, we've already worked all this out. Now we want your permission. We are going to them saying we want to go forth working with you.'",
        "'speaker_5': 'And not only is it legally a good idea, because some people, I believe, up in Adams County were feeling we were getting a little bit ahead of ourselves there and that we just better slow down a bit and start involving them so that as we go forth, everybody is in agreement.'",
        "'speaker_5': 'And I feel very comfortable about this stage of the agreement. I'm supportive of it tonight. And I it is just fine. I would be very uncomfortable if we said this is the deal and here we want you to take it and go sell it to your people.'",
        "'speaker_5': 'That would be arrogant on our part. This is doing it the right way.'",
        "'speaker_0': 'Thank you, Councilman. Okay. Counsel McInnis, your name appeared on the screen again.'",
        "'speaker_6': 'It did. And it was only because I could not resist the opportunity before she leaves office to say. I agree with every word that Councilwoman Fox.'",
        "'speaker_4': 'Oh, okay. Thank you. All right.'",
        "'speaker_0': 'Councilwoman Sheppard.'",
        "'speaker_4': 'Yeah. Just quickly, so, you know, I understand what all of my colleagues are saying, but I think it's respectful for the voters to get to know what what they're voting on. And it's not just an agreement. It will involve a huge land use and transportation plan.'",
        "'speaker_4': 'And how is it going to be paid for? There's a huge question I have. I appreciate Councilman Leavitt's clarification that there won't be any new tax or tax rate, but that still leaves a lot of other fiscal opportunities open and we don't have any of that information.'",
        "'speaker_4': 'So I just don't feel comfortable. Thank you.'",
        "'speaker_0': 'Okay. Thank you, Councilman Brown.'",
        "'speaker_7': 'Briefly, Madam President. Thank you. This is really a first step. Ordinance. This simply puts it on the ballot in Denver. It will be put on the ballot in Adams County. And again, welcome councilor from Adams County. Good to see you here tonight.'",
        "'speaker_7': 'There will be a four.'",
        "'speaker_1': 'Month campaign in Adams County as well as.'",
        "'speaker_7': 'Denver County to sell this to the voters. And if the questions that people will come up with are not answered.'",
        "'speaker_1': 'Then perhaps it won't pass. That's why we have campaigns, and this is what this is all about. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Brown. Any other comments from members of Council see? None. Madam Secretary, roll call.'",
        "'speaker_3': 'Nevett I. Ortega Rob Shepherd. No. Sussman Brooks, i.'",
        "'speaker_1': 'Brown, I.'",
        "'speaker_4': 'But I can eat lemon.'",
        "'speaker_3': 'Lopez All right. Madam President, I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': '11 eyes one ni.'",
        "'speaker_0': '11 Eyes, one ni. Council Bill 402 has been ordered. Published as amended.'",
        "'speaker_4': 'Final, final consideration. Passed the.'",
        "'speaker_3': 'Test as amended.'",
        "'speaker_0': 'October 11, ays one nay council bill 402 has passed. Correct.'",
        "'speaker_3': 'As amended.'",
        "'speaker_0': 'As amended. Thank you. Okay, let's move on. Councilman Fox, you have called out under bills for final consideration council bill 376. What would you like to do with this?'",
        "'speaker_5': 'Please place it on the floor for a vote.'"
    ],
    "Grants a $1.7 million loan to St. Charles Town Company for costs related to the relocation of residents of the Shady Nook and Belmont Mobile Home Parks in Council District 3.       ": [
        "'speaker_0': 'Thank you, gentlemen. Lopez, can you please place Council Bill 376 on the floor for a vote?'",
        "'speaker_1': 'Thank you, Madam President. I move that council bill three 76/3 of 2015 be placed upon final, final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Comments by members of council. Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Madam President. This is an ordinance that lends money to a developer for relocation costs of a project that's very important along Morrison Road. I approve of the project. I even approve of doing this relocation cost. But I am not willing to do is to lend more money to this specific developer.'",
        "'speaker_5': 'In a previous deal we had not only a financial deal with the developer, but there were two subsequent amendments to that deal, both of which were to the benefit of the developer, not the taxpayer. And so I am very picky about who I lend money to, and I'm going to say no today.'",
        "'speaker_0': 'Okay. Thank you, Councilman Lopez.'",
        "'speaker_1': 'Thank you, Madam President. I do have something to say about this council, bill. Yes? This is Saint Charles Holding Company as the developer of the site. Here's the problem. The problem is this site has been blighted for decades.'",
        "'speaker_1': 'And in this site, it's not like it's been empty. There have been folks who are living in these conditions that have been substandard and Denver and it's just not right. And we've talked about it for eight years. We looked at opportunities to what can we do to help improve the living conditions here for folks.'",
        "'speaker_1': 'And there was a lot of unanswered questions and a lot of people who how we had the ability to do it but are afraid to take the risk, afraid to do, afraid to come forward and basically not participate at all.'",
        "'speaker_1': 'That was true up into the point where Saint Charles Town Company and I think Charles Holding Company here said, you know, we'll do it. Will help will help not only improve the conditions here at this site by acquiring it, but will help trigger the Federal Relocation Act with the city.'",
        "'speaker_1': 'The city said, we will do this with you. There are folks who are living there who, because of this development, will be able to finally live anywhere else, be able to get benefits for it, relocation costs. And when all these units are built at 60%, am I going to be able to have first refusal, meaning they get'",
        "'speaker_1': 'the first choice to come back and this is how it should happen. And we can't rely just on VHA or some of the nonprofit folks who are already up. You know, they have their hands full. They don't have enough resources.'",
        "'speaker_1': 'They're begging for money. They're all fighting over the same pot of money, the same federal pot of money. It should we should actually be working with folks who are in the for profit development side that are willing to do this.'",
        "'speaker_1': 'And they've done it before on Alameda and Sheridan with those altos down. I mean, it's a very good project, filled a huge need in this city for affordable housing. That's what this does. And now affordable housing in the kind where you know that nobody takes care of and it's forgotten about.'",
        "'speaker_1': 'And when you complain, you either get kicked out or you just deal with it. Right. But this is the kind of housing these are the kind of units, units that will be maintained that are high quality standard of living, exactly what folks are needing and deserving in this neighborhood.'",
        "'speaker_1': 'And these are the folks that are willing to do the work. They've been doing the work with the community. It takes partnership from the city. This will help finalize those costs, help those folks find a place to live that way.'",
        "'speaker_1': 'They're not on the street while this develops or when they come back. I guarantee everybody is going to be standing there wanting to cut that ribbon. So that's what this is all about. And I urge my colleagues to support it.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Madam Secretary. Roll call. Fats? No.'",
        "'speaker_3': 'Lemon Lopez Monteiro. Hi, Nevitt. Hi, Ortega. Hi, Rob. Shepherd Sussman. Hi, Brooks. Hi, Brown. Hi, Sussman.'",
        "'speaker_4': 'There's no opportunity for me to click on I.'",
        "'speaker_3': 'Okay, I'll do it. Madam President.'",
        "'speaker_0': 'I voted. I call to him. He says, When were you able to vote?'",
        "'speaker_4': 'No, there's no.'",
        "'speaker_3': 'I voted for her.'",
        "'speaker_0': 'Okay. And what was the vote?'",
        "'speaker_3': 'Yes.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': '11 eyes, one nay.'",
        "'speaker_0': '11 eyes, one nay. Council Bill 376 has passed all other bills for introduction or ordered published. We are now ready for the block vote. Councilman Lopez, will you please place the resolutions on the floor for adoption?'",
        "'speaker_1': 'Thank you, Madam President. I move that council resolutions 383, 99, 44, 17, four, 18. All series of two 2015 be adopted.'",
        "'speaker_0': 'Thank you, Councilman. It's been moved and seconded. Madam Secretary, roll call, please.'"
    ],
    "A bill for an ordinance to amend Chapter 59 (Zoning) of the Denver Revised Municipal Code relating to the Denver Zoning Code and to amend and restate the Denver Zoning Code. (NEIGHBORHOODS AND PLANNING) Approves the 2015 Denver Zoning Code Text Amendment Bundle #1 comprised of multiple clarifying changes to the text of the Denver Zoning Code (DZC). IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 5-13-15.  ": [
        "'speaker_12': 'Thank you, Madam President. And good evening. Hours of counsel. I'm Kyle Dalton with the Department of Community Planning and Development. I'm the project manager for this Denver Zoning Code Text Amendment, the 2015 Text Amendment Bundle Number one. I also want to acknowledge that unlike the map amendments, this text amendment endeavors are multi staff projects and I've had'",
        "'speaker_12': 'a vast team helping me out throughout this whole project. A few of them are in the room tonight. I'd like to acknowledge a barge Tina Axelrod and Jill Jennings Gorelick and a number of others who weren't able to be here tonight.'",
        "'speaker_12': 'This text amendment is being promulgated by the Department of Community Planning and Development as part of our ongoing effort to keep the zoning code modern, clear up to date and user friendly. So the Department is proposing this amendment.'",
        "'speaker_12': 'It's the last bundle package we did was 15 months ago, in April of 2014. We periodically review how the code is working and prioritize potential updates in response to feedback that we get largely from customers in the development services experience, reviewing applications and working with folks at the counter and performing inspections in the field.'",
        "'speaker_12': 'We also receive community and neighborhood feedback throughout the year and we also seek to keep the code up to date as industries change around us. So a lot of the updates that are in this package come in direct response to that feedback that we receive from customers and Denver residents.'",
        "'speaker_12': 'It's also an extensive public involvement and process that's involved with all of our text amendments. We kicked it off publicly in February of this year with the Inter Neighborhood Cooperation Zoning and Planning Committee briefing. This is an opportunity for the zoning and planning representatives from many of the registered neighborhood organizations around the city to come together as'",
        "'speaker_12': 'part of and see and talk with staff and dialog about what would go in the amendment before words are even put to paper. So we went out there on February 28th, talked about the issues that we'd heard as potential items and received feedback there, and took that feedback to then develop a summary of the text amendments that'",
        "'speaker_12': 'we posted in March, which we then delivered to at a briefing of the Neighborhoods and Planning Committee of City Council, as well as the Planning Board and Information Item. Then we took all of the feedback that we received in those briefings to produce a red line draft at the end of March, which was published on March 30th'",
        "'speaker_12': ', and also sent out to all registered neighborhood organizations and city council members. Because a lot of folks like to dialog with staff and help and get some better understanding of how a particular amendment would affect them or their project or their home, or is an issue of concern to them.'",
        "'speaker_12': 'We we offer public office hours when we do text amendments. So we held three sessions in the Wellington Webb building at different times of the day, on different days of the week, to be able to attract folks who have different schedules.'",
        "'speaker_12': 'And so we did those in the first half of April of 2015 and then and then we create with that feedback, we, we redrafted and put together a draft for the planning board. We provided notice again to all RINO's and City Council members of a planning board.'",
        "'speaker_12': 'Public hearing produced a new draft for the planning board and held a public hearing at the Planning Board on April 29th. Following that and the feedback we received from Planning Board, we provided notice of a scheduled Neighborhoods and Planning Committee meeting and released a new draft for that committee online on May 7th and then went to the'",
        "'speaker_12': 'Neighborhoods and Planning Committee meeting again on May the 13th. That was followed by a City Council first reading and publication, an email notice of a city council scheduled public hearing that was originally scheduled for two weeks ago. And then three weeks ago, on June the eighth, City Council amended the bill on the floor, ordered it republished, which'",
        "'speaker_12': 'we did. It was republished. A notice was again provided to registered neighborhood organizations and city council members of tonight's public hearing, the final public hearing for this June the 29th. And I'll talk about the amendment in a little bit.'",
        "'speaker_12': 'We also did a number of other outreach components that aren't part of the code, but, you know, help broadcast the word about the text amendment through committees, email newsletters that we invite folks to sign up on, on our website, our Twitter account.'",
        "'speaker_12': 'And we also held a one on one meetings additionally on request with various parties who are interested in our work. In your packets. There were nine written comments provided at the time of the staff report and another one was received over the weekend and uploaded by City Council staff today providing written comment.'",
        "'speaker_12': 'And generally a few of the folks are here tonight who provided written comments. I won't speak for them. Their comments ranged from encouraging some of the content that's in the code to encouraging improved street level active use requirements that you'll see in many of our own districts now correcting the many storage parking requirement corrections to how we'",
        "'speaker_12': 'treat certain kinds of homeless shelters in the code. One comment thanking the city for collaborating on the new marijuana extraction rules. There was a comment regarding the clarifications we're doing on step back encroachments. And then there was comments related to the effective date for pipeline projects, and that's what resulted in the amendment a few weeks ago.'",
        "'speaker_12': 'So let me speak briefly to the amendment. The amended bill or amended the bill that had been originally filed in order to address projects that are already in the review pipeline. And so what that amendment did, the council passed on June the eighth was to allow any formal site development plan application that we receive this week before'",
        "'speaker_12': 'the new code goes into effect. By the end of this this work week, that anyone who's in the door with us with a formal site plan application can can make the choice of whether to remain under the current zoning code or if it's to their benefit.'",
        "'speaker_12': 'And they want to they can have review under the new code that will if they if the code is adopted tonight. And and so that will allow those folks who choose to remain under the current code another six months to go through the review process, get any approvals they might need, and seek that approval by January 4th'",
        "'speaker_12': 'of 2016, and thus avoid the need for a potential rereview of a component of their plan if they've already been in the door with us. So that's in the bill tonight. The Denver Zoning Code Text Amendment Bundle addresses a wide variety of topics the kind of eight groups overall that are addressed in the summary that was included'",
        "'speaker_12': 'in your packet. They include general provisions. The talk about how we identify zone districts, zone lots and number of uses, zone lot. They address the neighborhood context design standards. So these are our building form standards found throughout the code.'",
        "'speaker_12': 'They also have to do with general design standards. So site development standards that apply throughout the different neighborhood contexts such as landscaping, parking. We are proposing a few changes relative to parking, both bicycle and vehicle parking. There are some changes in how uses are addressed in the code, which includes use limitations.'",
        "'speaker_12': 'There are some clarifications to zoning procedures and I'll hit the highlights here in a second. We have changes to the rules of measurement and definitions for how how terms are defined and how things are measured in the code.'",
        "'speaker_12': 'And then we have some clarifications and corrections that we make throughout the entire code. And I'll just hit some of the highlights that address, specifically the comments that you received and and that kind of are getting the most attention that the most substantive parts of this code.'",
        "'speaker_12': 'The first is that we're codifying CPD's practice of providing earlier notification to registered neighborhood organizations when a rezoning or a zone map amendment is submitted. So for about a year now, we've been doing that by policy of the executive director, and that will now be in code that when we receive a complete application upon receipt of that'",
        "'speaker_12': 'application, we will provide notice to the registered neighborhood organizations and city council members. So that's now going to be part of our code. We're updating our bicycle parking standards to add new bicycle parking standards for a few uses that don't have them.'",
        "'speaker_12': 'Today, most users in the city already have a minimum bicycle parking requirement for new development and additions, and this will increase the number of uses that are subject to those standards. We'll also rightsize a couple of the bicycle parking standards that we got wrong that we've learned from five years of experience with the Denver zoning code.'",
        "'speaker_12': 'We're also rightsizing the mini store to vehicle parking requirement, which was accidentally, inadvertently increased throughout most of the city when we converted. One way of measuring parking in the former Chapter 59 old zoning code to the new Denver zoning code.'",
        "'speaker_12': 'So we think we've got that right. Finally, we're proposing changes to street level activation to significantly increase the requirement for street level active uses in our most urban mixed use and main street districts. And this includes new incentives for activation of parking structures, which will add new incentives for folks who want to do the right thing on'",
        "'speaker_12': 'the street level or on all street facing facades to allow them to provide additional onsite parking if they so choose. We have new rules included in this that are companion to a licensing bill that you passed earlier tonight in zoning for how we deal with marijuana extractions, as we've learned from our experience regulating that.'",
        "'speaker_12': 'So those are now in this text amendment bundle. And then we have a variety of organization, graphics and corrections that we've made throughout the code. I'm happy to dialog further, more specifically on any topic that you may be interested interested in talking more about, because we've had so many briefings.'",
        "'speaker_12': 'I haven't teed up all of them here tonight in respect to the future hearings you'll have tonight. But I have a lot more content behind this presentation, if there are any in particular you'd like to dialog further about.'",
        "'speaker_12': 'So there are three review criteria in the Denver zoning code for a text amendment. The first is that it needs to be consistent with the city's adopted plans and policies. The second is that it needs to further the public health, safety and general welfare.'",
        "'speaker_12': 'And the third is that it will result in regulations that are uniform. And we reviewed this, the text amendment against all three review criteria and find that it meets it. It directly implements the comprehensive plan 2000 policies relative to ensuring that we have a Denver zoning ordinance that is flexible, that it comments accommodates current and future land'",
        "'speaker_12': 'use needs, that identifies community issues and targets those concerns with appropriate controls and incentives. So this is directly in line with the city's adopted plans regarding keeping our zoning ordinance up to date. It furthers the public health and safety and general welfare of our residents or land owners or business owners.'",
        "'speaker_12': 'By providing clarity and predictability in our zoning rules, by removing barriers to planned and desired development, and by overall continuing to implement our adopted plans. And then it will result in regulations that are uniform within each zone district.'",
        "'speaker_12': 'And because it's making improvements to how we administer the code, it will help improve the city's ability to administer uniformly the code with projects. So again, we find that it meets all three review criteria. As I mentioned, the planning board held a public hearing on April 29th.'",
        "'speaker_12': 'They took testimony there that unanimously recommended approval of this with three conditions to make some revisions in those earlier drafts, which we had recommended. And all those revisions were made and are included in the draft that is before you tonight.'",
        "'speaker_12': 'And so with that, we recommend that tonight City Council approve this text amendment.'",
        "'speaker_0': 'Thank you, Mr. Dalton. We have three speakers this evening. Signed up to testify on behalf of Council Bill 298. Please come to the front bench right behind the podium when I call your name. The first speaker is Heather Noyes.'",
        "'speaker_0': 'Great. Second speaker. Hey, Hank. Happy, sappy. And the third speaker is Dave Decker.'",
        "'speaker_4': 'Good evening. Can I should I start? Mm hmm. Hi. My name is Heather Noyes. Greg. I live at 4492 Xavier Street.'",
        "'speaker_3': 'I'm a 24 year old resident.'",
        "'speaker_4': 'Of Berkeley Park. I'm a small business owner on Tennyson Street. My business is studio CPG. We're certified WBEZ by the city and county of Denver. I have two children at Skinner Denver Public Schools. I'm active with our R.A. I serve on the City School Goals Committee.'",
        "'speaker_4': 'I serve on DPS Goals Committee. And I tell you this because I care passionately about my neighborhood and our city, and I urge you to vote in favor of the text amendment. Tonight, I want to thank Kyle Dalton and a barge who have spent a significant amount of time in our neighborhood looking at development impacts and listening'",
        "'speaker_4': 'to our neighbors. I want to thank Evelyn Baker, who's walked our streets over there and also spoken with a group of neighbors, and especially Councilwoman Sheppard, who has spent significant time also walking and talking and listening and a heartfelt thanks to you for your efforts.'",
        "'speaker_4': 'I have two issues or items I'd like to bring to your attention with respect to these proposed changes in the zoning code. I do believe it's a huge step forward. However, I believe that activation of impact zone districts at street level, the 40% activation in the bundle, number one, doesn't go far enough.'",
        "'speaker_4': 'It's a baby step. This city is investing millions and millions of dollars in streetscape improvements, starting with Tennyson Street, two and a half million dollars. Brighton Boulevard $47 million, East Colfax, West Colfax, many, many other projects too numerous to mention.'",
        "'speaker_4': 'And I believe that the city should leverage this taxpayer's investment and not allow the automobile to be the dominant use at street level in the max zone. District's 40% activation requirement is great, but that means 60% is left and can be used as parking.'",
        "'speaker_4': 'And I just think this is really unfortunate and a huge, huge missed opportunity. If we're going to make a change, let's do it right and let's really, you know, put a stamp on this and leverage taxpayers investment. My second my second issue and I have a tape measure, but I'm not going to roll it out.'",
        "'speaker_4': 'The depth of activated space is limited to 15 feet. I do not believe that's a functional space. Many people have said there's an economic issue associated with how deep you make an activated space. Councilwoman Sheppard and can each have been in my office 15 feet in my office?'",
        "'speaker_4': 'Gets you two desks, no restroom, no storage, no lobby, nothing in with my retail co-op cohorts and compatriots on Heather Street. Heather, your time. It's just not deep enough. Thank you. That's all I had to say. Thank you very much.'",
        "'speaker_0': 'Thanks for coming. Our next speaker is Hank Saifi. If I didn't pronounce it right.'",
        "'speaker_1': 'Hank, say.'",
        "'speaker_8': 'As extreme as I'm at 250 Jersey Street in Denver.'",
        "'speaker_1': 'And I'm here to support the text amendments that are happening, especially concerning the self-storage parking that we've developed here. And I can answer any questions, but I just support what they've done. Thank you.'",
        "'speaker_0': 'Thank you. Our final speaker is Dave Decker.'",
        "'speaker_10': 'Good evening. My name is Dave Decker.'",
        "'speaker_1': 'I am at 4258 Tennyson Street in Denver. I'm here on behalf of.'",
        "'speaker_10': 'Berkeley, Regis, United Neighbors. It's the R.A. up on that represents Tennyson Street. We've been working on this issue.'",
        "'speaker_1': 'For well over a year. We had a public meeting last February. We had well over 100 people and.'",
        "'speaker_10': 'About 800 written comments, many of which discussed new development, residential and commercial. And what what the kind of the take away from it is. There are some really great things about Tennyson.'",
        "'speaker_1': 'Street, but it could be said about many commercial streets in Denver. They're walkable, they're friendly, they're active. And what we've found with some of the new construction that it's happening is they're turning their backs to the street. They're using it as parking.'",
        "'speaker_1': 'They're putting the windows on the sides and the front doors and the sides of the buildings, but that doesn't activate the street. So what we have this great attribute of our commercial streets and Denver and that they're friendly and they're walkable.'",
        "'speaker_1': 'But in the new construction, people are concerned that we were losing that. So what we did is we we and Heather mentioned this earlier. We we had a meeting with Councilwoman Shepherd and she.'",
        "'speaker_10': 'Engaged the help of the planning office.'",
        "'speaker_1': 'Planner level and Baker. And also we've gotten help from Karl Dalton and a barge. They've done a wonderful, wonderful job educating the R.A. about what can be done. They let us know about this process and we're in full support of it.'",
        "'speaker_1': 'We our board took a vote. It passed 8 to 1 to support this tax amendment, mainly to adding the design standards, to revising the parking requirements, and to require those active, active street users. Again, like Heather said, we strongly support the passage of.'",
        "'speaker_10': 'This amendment and I do appreciate the time.'",
        "'speaker_1': 'I apologize for my appearance. But getting around on crutches in about I'm a little bit more concerned about comfort right now.'",
        "'speaker_10': 'But and if you have any questions, be free to answer them.'",
        "'speaker_0': 'Well, thank you.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'That concludes our speakers. Are there questions from members of council? Councilman Ortega. Thank you. Madam President, I would like to ask Colonel Dalton to come back to the microphone, please. Got a couple of questions for you. In my perusing of the document.'",
        "'speaker_0': 'I didn't see anything that deals with the. The whether there was discussion about. Continuing to do the general development plans, the way they're being done now in in a wounded clarification on whether or not there's a size of a project that requires a general development plan.'",
        "'speaker_0': 'So can you can you speak to that?'",
        "'speaker_12': 'Sure. Yeah. So this text the moment does not propose any changes to the current general development plan rules. As I mentioned, you know, the process started many months ago. And at that time, we are still engaged in a task force with many community members and developers and staff.'",
        "'speaker_12': 'And so we didn't want to preempt the outcome of that process with amendments in this text amendment bundle. So there is nothing in this text amendment bundle to change the world or develop general development plans. I think we'll need to revisit that now that most of the task force work is completed in the future bundle.'",
        "'speaker_12': 'But again, because this started so long ago and that was going on, we didn't want to preempt that work.'",
        "'speaker_0': 'Okay. And then for the parking, I saw that you were adding or the department has added language that makes it more convenient and easier to have bike parking. And I heard the speaker loud and clear, Heather, when you were talking about the concern about too much parking.'",
        "'speaker_0': 'But I guess I'm looking at some of the larger developments where some of these commercial corridors are not on a transportation line. Were there any changes to parking criteria or that was pretty much left intact as well.'",
        "'speaker_12': 'For bicycle parking, specifically.'",
        "'speaker_4': 'For vehicle.'",
        "'speaker_0': 'Not bicycle parking for for cars, for large developments that go into these commercial corridors.'",
        "'speaker_12': 'Yeah. So there are no changes proposed to the minimum vehicle parking ratio, you know, onsite vehicle parking ratios. And as part of this bundle, other than the reduction in the vehicle parking requirement for many storage facilities, which, you know, are sometimes located on those commercial corridors and sometimes not.'",
        "'speaker_12': 'But that's the only change to vehicle parking ratios in the code. We're also clarifying how you can take the existing reductions that are in the code.'",
        "'speaker_4': 'In.'",
        "'speaker_12': 'Alternatives, so you know about making sure folks don't double count reductions or clarifying that. But but there aren't substantive changes to vehicle parking.'",
        "'speaker_0': 'Madam Chair, I have two more questions. May I continue? The next one is about zero escaping under the landscaping. I didn't see that we're encouraging more zero escaping as we were experiencing an unusual year this year because of the kind of rain we had.'",
        "'speaker_0': 'But, you know, in the past few years, we have had some serious watering restrictions. And so I want to know how that particular issue was dealt with or was it not at all?'",
        "'speaker_12': 'Sure. Yeah. It's a great question. That was not part of the scope of this text amendment. So we did not begin a community conversation about adding zero escaping requirements in the code.'",
        "'speaker_0': 'Okay. And then my last question is about whether or not there was anything that came up about allowable locations for food trucks. I know there was supposed to be a task force started to deal with this issue, and that hasn't happened.'",
        "'speaker_0': 'But I don't know if that was something that came up during this process.'",
        "'speaker_12': 'So no. Again, thanks for the question. There are no changes proposed in this text amendment relative to food trucks in particular, I think. You know, when we saw the the resurgence of them a few years ago, we got together with some of the other departments and created a food truck guide to help folks navigate the city's current'",
        "'speaker_12': 'regulations better. And and that really helped folks know where they needed to go and when what the rules are. So there are no changes proposed as part of this text amount to the current rules.'",
        "'speaker_0': 'Well, I'm sorry, I do have one last one. And this is on the national western campus when I had a briefing from the staff person around the language changes or the zoning creating the new campus zoning for the National Western Center.'",
        "'speaker_0': 'One of the things that was talked about was allowing a helipad and I didn't see and hear if that was still in the language. Can you help me determine if that is still an allowable use or is it a conditional use or is it not being allowed after all?'",
        "'speaker_12': 'Sure. I'm afraid I don't know the answer to that question, that the council will take up the matter of National Western Center zoning next week. That's a separate text amendment, so there are separate red lines for it. And I'm not the project manager on that case.'",
        "'speaker_12': 'I'm not familiar with that issue.'",
        "'speaker_0': 'Okay. I was just curious because I saw part of that language included in here. This is probably just some of the base language right in it because it's got all the red lines as part of what we received in the packet.'",
        "'speaker_12': 'Oh okay. For the the bundle. Yeah. No that should not be being adopted as part of tonight's. That's part of next week's agenda.'",
        "'speaker_0': 'Okay. So let me ask the city attorney then, have you seen this? So we've got a whole section in here called Campus National Western Center as part of the bundle. And so I'm just trying to understand, if we're not if we're dealing with the actual adoption of that zoning next week, should it be part of this language'",
        "'speaker_0': 'here tonight?'",
        "'speaker_4': 'No, I'm kind of going to look to Kyle because, again, Lori Strand, city attorney's office, the red line for the bundle should not include red lines establishing the new National Western Center. That's separate. That'll be a separate text amendment.'",
        "'speaker_4': 'So perhaps the red line that was provided to you was incorrect or.'",
        "'speaker_0': 'I'm happy to provide you what I received. I printed this out.'",
        "'speaker_4': 'But what you're proving tonight is and that does not include the language for the north ethnic national western. So that's when you get political.'",
        "'speaker_0': 'Okay. Councilman Ortega, can we move on or what is it that you make up? I was just trying to get clarification. Would you like me to. We're, in fact, including. Or are we just adopting that? National Western Center is a category we're creating.'",
        "'speaker_0': 'I mean, there's some there there.'",
        "'speaker_4': 'So again, we will speak to what was provided. But tonight before you is not that. So if that text is shown on the red line and should not be. That's going to be considered next week as a separate text amendment.'",
        "'speaker_4': 'But Kyle can explain perhaps what was provided.'",
        "'speaker_12': 'Sure. Yeah. I don't have a copy of what you provide these things, but the copy of the red line draft that I have does not include that. And regardless, what the council is adopting tonight is what was filed with the ordinance.'",
        "'speaker_12': 'And what was filed with the ordinance is a clean version. In that clean version, I can assert does not have anything related to National Western Center in it. So if there is a either an error in something staff produced that shows the red line, which is a courtesy to show what's happening but is not what is filed'",
        "'speaker_12': '. My mistake, but is not in the copy of the red line that I have in front of me.'",
        "'speaker_4': 'And, and on the front page of what you provided actually says this is the national western centered public review draft, not the bundle. So this is actually for the National Western think, which is next week at the rural one.'",
        "'speaker_4': 'So it's a different packet that you should have for cattle and it's much thicker than this. You'll know because that's about 700 pages.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman Shepherd.'",
        "'speaker_4': 'Thank you, Madam President. Pro tem. So, Kyle, if you could stay up here. So I was hoping.'",
        "'speaker_0': 'I just want to jump in really quickly. We heard from some audience members that they're not able to hear council comments. So I should have said that before the public hearing.'",
        "'speaker_4': 'So you wouldn't.'",
        "'speaker_0': 'Mind speaking closer to the microphone.'",
        "'speaker_4': 'Thank you. So, Mr. Dalton, just to help put that tonight's conversation in a little bit better context, I was hoping you could expound a little bit on what the street level activation changes actually were, because I think it's imperative in terms of two of the speaker's comments this evening.'",
        "'speaker_12': 'Sure. Thanks. So so here's here's the street level active use. What we're proposing in the text amendment, I'll remind the Council that in the current code we have building form requirements that relate to mixed use and main street districts.'",
        "'speaker_12': 'So where are we already have requirements relative to transparency, how many windows are required and the size and and the location of those. How much of the building is located near the street? In our mixed use of Main Street districts, that surface parking isn't allowed between the building and street in many of those locations.'",
        "'speaker_12': 'So what this is specifically speaking to is the use that's happening inside that building for certain widths and depths. So what we have currently in the code today without this amendment is we address use only in Main Street and we don't address it at all in mixed use.'",
        "'speaker_12': 'So in our Main Street districts today, we have what I've got on the screen now that the ground story within the required build to portion must have at least one primary use other than parking of vehicles. That's the language in the code today.'",
        "'speaker_12': 'It was in the original Main Street when it was adopted in the mid 2000s. There's no dimensions on it. There's nothing other than no parking. So, you know, what we found is folks can provide a postage stamp sized lobby and meet that requirement and then move on and still have parking in the rest of Main Street and'",
        "'speaker_12': 'then again in mixed use or nothing today. So that's the current state of affairs. What's proposed in the bundle is to change that for some of our districts. So we'll be adding new use requirements that apply to the portion of the building frontage, meaning the bill too.'",
        "'speaker_12': 'So that's kind of the width question. And so we'll do that in the main street in our C-Max Urban Center mixed use zone districts that so 100% of the part of the building that's meeting the build to requirement in those districts needs to have what we're calling a street level active use.'",
        "'speaker_12': 'I'll explain that in a second. In the, um ex in the TMX zone districts, we're proposing a 40% frontage requirement and then in all the others we're still not changing the world. So in the urban edge, in the suburban, in the commercial corridor zone districts, no change.'",
        "'speaker_12': 'And then as Heather alluded to, you know, they just mentioned the frontage percentages, which is essentially the width. There would be a minimum, a depth of 15 feet. So, you know, that's the minimum that would be required in order to meet the new code requirement.'",
        "'speaker_12': 'And within that 15 feet and the percentage you couldn't do parking, mini storage, wholesale storage or trade or accessory auto related uses. So you know what the department's proposed. I would agree with the speakers that it's moving the ball forward significantly.'",
        "'speaker_12': 'And these districts that today have none or almost no requirement, while at the same time recognizing that through the bundle, we're taking a citywide approach. We're not taking a street by street, block by block approach to know, you know, where in some places and.'",
        "'speaker_12': 'Some districts, you know, there may be a more appropriate, more stringent requirement that's appropriate. And and so, you know, my colleague, a barge is already working with the Berkeley neighborhood, in particular to work on an overlay district, perhaps for their neighborhood that would increase the requirements there based on their unique needs.'",
        "'speaker_12': 'But on a citywide basis, when we studied where all of those euro zone districts are, where all the TMX, where all the C-Max or all the main street are, we felt that this was the right move to move the ball forward with without unduly burdening accidentally projects throughout the whole city.'",
        "'speaker_4': 'Okay. I thank you. And then I have one more question for Miss Gregg. Yeah. You can come.'",
        "'speaker_2': 'Up here with.'",
        "'speaker_4': 'So, Miss Gregg, I know you were a little bit rushed in your comments, and so I'm not sure you got to say everything that you wanted to say, but I wanted to make sure that you are in support of the changes tonight, because I know you said a couple of them didn't go far enough.'",
        "'speaker_4': 'So I'm not sure if I heard you say that you owe complete support. Yes, that's what I just think. You clarify. I think you.'",
        "'speaker_0': 'Thank you. Any other comments by members of council or questions on the public hearing for council? Bill 298 is closed. Comments by Members of Council Councilman Sesame. Okay. Councilman Shepherd.'",
        "'speaker_4': 'Thank you, Madam President. Pro tem. So I just wanted to say that I am in support of this text amendment bundle tonight, and I want to I want to talk a lot about the process, because that's as important of the story of what we're actually doing here tonight.'",
        "'speaker_4': 'And I know that Ms.. Greg alluded to this, but the Berkeley Regis neighborhood organization has had a profound impact on what these text amendments are included in the bundle, specifically as relates to the street level activation piece of this bundle.'",
        "'speaker_4': 'This is how the iterative process of the code is supposed to work. So in May of last year, the neighborhood organization held an open session for neighbors from the whole community to come in. And it didn't have to have, you know, knowledge in the code.'",
        "'speaker_4': 'You just had to be able to articulate what it was that you liked and what's working in the new code and what isn't. And there was a lot of this is an area that has, under the new code revision and with the rebound in the market, has experienced tremendous growth and change just in the last 2 to'",
        "'speaker_4': '3 years. And quite frankly, a lot of the residents are really reeling from those impacts in a number of ways. But I will really hand it to the neighborhood for being able to be very articulate about, you know, what is working and what isn't working and why and why they'd like to see.'",
        "'speaker_4': 'And so what came out of that was a very nicely spelled out list of of thoughts and possible recommendations that the neighborhood neighborhood would like to have seen in the code. And so working through my office, we were able to have a meeting with officials from Community Planning and Development and literally do a walkthrough with the neighborhood'",
        "'speaker_4': ', which I think took like two or 3 hours, like not just the commercial street, but the neighborhood. And there were several recommendations that came forward. Community planning and development on its own accord acted to already implement some of those suggestions, which happened administratively actually last year.'",
        "'speaker_4': 'This particular one in relation to street activation actually, you know, was determined as a need to be changed in the code and that is why it's coming forward in this bundle of text amendments. But and I know the process took longer, much longer than the neighborhood had wanted.'",
        "'speaker_4': 'I mean, I think that meeting, if I'm not mistaken, with community planning and development, was in probably about August of last year. And here it is July, and we're finally passing the code. And I know it's frustrating for folks that things don't change as quickly as as folks would like, but this is how the process works.'",
        "'speaker_4': 'And I want people to understand that. I mean, I know there's a lot of frustration out there because when the code revision was passed in 2010, nobody could really envision what it would look like as it played out.'",
        "'speaker_4': 'And certainly the way the market has rebounded so quickly and so much has redeveloped in a very short period of time and especially the pressure has been very great on certain neighborhoods. And I know a lot of people are, you know, upset and angry and wringing hands.'",
        "'speaker_4': 'But there are practical solutions, you know, and it starts at that neighborhood level about collecting that data and that input, you know, and then reaching out to council members or community planning and other staff to try to start figuring out how to make those changes in a way that is meaningful and works.'",
        "'speaker_4': 'And this is very much a testament to that. And, you know, I want folks to understand that, you know, the entire city team is open to this and this is how the process works. So, you know, please consider this.'",
        "'speaker_4': 'You know, this is really, in my opinion, at least this piece of it is really, you know, kind of a hats off to the process working well. And I just want other individuals and neighbors and neighborhood organizations to take, you know, to receive assurance that this is how we can affect change and that the code is a'",
        "'speaker_4': 'living document, breathing document, and that it can change and and we can make it work better. We really can. And so I just you know, this is this neighborhood organization. I mean, it's all volunteers, as all of them are.'",
        "'speaker_4': 'But and this particular neighborhood organization has a tremendous amount of expertize among the board in terms of design and development planning. And so was able to have a really informed discussion with city staff about how to make this happen.'",
        "'speaker_4': 'And so I just really want to encourage folks, you know, to, you know, to get beyond hand-wringing and to get to that constructive level because we can make this work better. So I'm definitely in support. And once again, want to thank Berkeley Regents for taking the initiative and helping to make this happen.'",
        "'speaker_4': 'So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Madam Secretary, roll call on Council Bill 298.'",
        "'speaker_3': 'Shepherd Susman, Brooks Brown.'",
        "'speaker_8': 'II.'",
        "'speaker_4': 'But I can eat lemon.'",
        "'speaker_3': 'I Lopez. I never. I. Ortega.'",
        "'speaker_4': 'I rub i.'",
        "'speaker_3': 'Madam President, i.'",
        "'speaker_0': 'Madam Secretary, closed the voting and announced the results.'",
        "'speaker_3': '12 eyes.'",
        "'speaker_0': '12 eyes. Zero nays. Council Bill 298 has passed. Council Bill 345 and 346 approve the zoning map amendments. The Council is required by law to conduct public hearings on zoning map amendments. The council's actions are subject to court review in order to provide a record for court review.'",
        "'speaker_0': 'Testimony is recorded and any items presented to council are marked as exhibits and become a part of the record. Speakers should begin their comments by telling the council their names, cities of residence, and if they feel comfortable doing so.'",
        "'speaker_0': 'Their home addresses. Councilman Lopez, will you please? Please. Council Bill 345 on the floor.'",
        "'speaker_1': 'Thank you, Madam President. I move that council bill 345 series of 2015 be placed upon final consideration to pass.'"
    ],
    "Rezones property located at 99 Quebec Street from O-1 to C-MX-5 in Council District 5. (NEIGHBORHOODS AND PLANNING) zones property located at 99 Quebec Street from O-1 to C-MX-5 in Council District 5. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 5-20-15.  ": [
        "'speaker_0': 'Okay. I need a second from a member of council. It's been moved and seconded. The public hearing for Council Bill 345 is open. May we have the staff report? Good evening, Teresa Lucero with community planning and development. I am trying to get a PowerPoint open here, so give me a second.'",
        "'speaker_10': 'Here we are.'",
        "'speaker_0': 'So this is a map amendment for a property located at approximately 99 Quebec Street from oh one to C-Max five with waivers. The property is located in Southeast Denver in Council District five, in the Lowry Field statistical neighborhood.'",
        "'speaker_0': 'This is an illustration and illustrative plan of the Buckley Annex plan. The purple bubble that you see is the area that we're talking about. You may be familiar with Buckley Annex, but I have to remind you every time that this was a former Air Force facility home to the Air Reserve Personnel Center and Defense Finance and Accounting'",
        "'speaker_0': 'Services with about 3000 employees. In 1993, the Lowry Reuse Plan was created and adopted by the city as city policy. This Air Force facilities were in that plan were shown to continue. In 2000, Denver adopted our comprehensive plan and adopted the Lowry Reuse Plan as a supplement to our plan.'",
        "'speaker_0': 'And again, the Air Force facilities were shown to continue. Blueprint Denver was adopted by the city in 2002, and then in 2005, the Air Force announced they were closing their facilities. So the Buckley Annex redevelopment plan was completed by the Lowry Redevelopment Authority, and it did provide a land use and transportation framework for redeveloping the annex property'",
        "'speaker_0': '. And in 2011, the property was vacated by the Air Force. And 2012, the Air Force completed transfer of the property to the Lowry Redevelopment Authority in 2013. The city adopted a general development plan and a minor amendment to that plan.'",
        "'speaker_0': 'So the map on your screen is a location of the property. It is at the corner of First Avenue and Quebec Street. Quebec forms the eastern boundary. The western boundary of Buckley Annex is Monaco Street. The southern boundary is roughly Bayard Avenue.'",
        "'speaker_0': 'Property itself is about 18 acres. It is vacant except for two existing structures, a small maintenance structure of two stories and a two storey office building that houses the Lowry Redevelopment Authority. Currently on the property, utilities are under construction for the redevelopment.'",
        "'speaker_0': 'Property owner is Lowry Redevelopment Authority. Their proposal is to redevelop into a mixed use development for this property. They are requesting a rezoning from oh 1 to 5 with waivers. This is part of a 70 acre site. To date, about 53% of the site has been resolved.'",
        "'speaker_0': 'Just a little bit about the current zoning. It is a one this is a former Chapter 59 zone district carried forward as it was in the old code. There is no height limit there except if you were within 175 feet of a protected zone district, in which case the height limit is 75 feet.'",
        "'speaker_0': 'The allowed uses, the only residential uses allowed are residential care and shelter for the homeless. Civic and public uses are allowed such as elementary schools, libraries, correctional institutions. The only commercial uses allowed are outdoor arts, recreation and entertainment and surface and garage parking and industrial uses are allowed such as telecommunications, oil and gas production and wholesale trade'",
        "'speaker_0': 'and storage. Light just a little bit about the existing zoning. The gray you see on your screen is former Chapter 59. So the majority of the zoning surrounding our site subject property tonight is Archway with waivers. Archway was a multi-unit zoned district that had a minimum lot.'",
        "'speaker_0': 'Area of 2000 square feet for each zoned. Each sorry. Each dwelling unit. But if you did it planned building group site plan, you were allowed to go down to 1500 square feet for each dwelling unit and much of Lowry was developed in planned building groups.'",
        "'speaker_0': 'That's why I mention it. As you see in this slide, the blue areas are the plan building groups. So the urban center mixed use five storeys urban center context is a multi-unit residential zone district with mixed use commercial land uses.'",
        "'speaker_0': 'Multi-unit residential is located primarily on collectors and arterial streets. Commercial is located on main streets and mixed use arterials. First Avenue in Blueprint Denver's terms is a residential collector and Quebec is a residential arterial. And again, the well, we'll hear hear more about it.'",
        "'speaker_0': 'But the GDP does support a mixture of uses for this portion of Berkeley annex. It is considered a community wide gathering space and a location for a new park. Parkside Retail multifamily single family uses are envisioned and the Scenic Zone District CRM X5 with its broad land use allowance and building form standards, create that pedestrian friendly place'",
        "'speaker_0': 'that we're looking for in town center. So again, the proposed zone district urban center and neighborhood context mixed use with a five storey maximum height. And waivers. The waivers reduce the height along First Avenue. And I probably should have gone.'",
        "'speaker_0': 'Well, I didn't get there yet.'",
        "'speaker_1': 'Okay.'",
        "'speaker_0': 'I'm trying to find where I inserted some. No. I'm sorry. I'm going the wrong way. I want to show you the area where the three stories proposed, which I think is back under the proposal. And I should have pointed that out before.'",
        "'speaker_0': 'So bear with me there. So you see two blue areas. Those are the areas where the waivers would apply to the edges of the property that we're proposing to rezone. And now let me explain what those are. So in those areas on First Avenue in Quebec, the zoning would waive down the heights to 45 feet and three'",
        "'speaker_0': 'stories within 30 feet of the property edge. And then the other waiver on proposed with this rezoning is to reduce the maximum height of the remainder of the area from 70 feet to 65 feet and keep the five storey limit.'",
        "'speaker_0': 'And just for information, the C-Max five does have a 70% build to for nonresidential structures within 0 to 10 feet of the property. For residential structures, only that 70% build two is within 0 to 15 feet on primary street phase and requiring primary street facing entrances and some transparency requirements as well.'",
        "'speaker_0': 'So we've kind of got dry throat. Which. It happens a lot. We've kind of already talked about the existing zoning. It is a mixture of that multi-unit ah to ar1 to the south B three with waivers in the, in the Lowry Town Center and then some single unit to the northeast and south of the property.'",
        "'speaker_0': 'And then of course, Chris Moore Park to the west. The majority of the area is vacant. As I said before, there are two small buildings on the property, a maintenance building and a two storey office building and utilities and roads under construction.'",
        "'speaker_0': 'So a little bit of the surrounding uses are shown on this side. The red is an office use four storey office use. The sort of orange is multi-unit, mid-rise, multi-unit, and then a lower density, low rise multi-unit is sort of the lighter orange.'",
        "'speaker_0': 'And then the yellow, of course, is single family land uses. And this gives you a little bit of an idea of the flavor of the surrounding land uses. The upper right is the four storey office building directly across Quebec Street.'",
        "'speaker_0': 'The Red Arrow shows the existing two storey office building at first in Quebec. The lower right is across Quebec, single family across Quebec. The lower left is the area that is proposed south. While not proposed, it's been approved single family zoning approved on the southern edge of Barclay Annex and then just shot in the middle.'",
        "'speaker_0': 'On the left is some of the roads already being built in the upper left, some of the houses already being built at near first in Quebec. So this proposal was sent to city agencies for their review, and these are the comments provided by them on approval from our asset management.'",
        "'speaker_0': 'Our Surveyor. No comments from Parks and Recreation. No comments from Project Coordination. Transportation reviewed and had. No comments. And wastewater approved the rezoning. So this is the public notice that we sent out for this proposal. March 16th was the first notice of a complete application sent to registered neighborhood organizations.'",
        "'speaker_0': 'You see the list here on the slide Denver Neighborhood Association in her neighborhood cooperation. Lowry Community Master Association. Lowry United Neighbors, Mayfair Park Neighborhood Association and Mayfair Residents Condominium Association. And then 15 days prior to the May 6th Planning Board hearing, there was a sign posted on the property and electronic notice sent to all of the affected'",
        "'speaker_0': 'RINO's. There was a public hearing at that May 6th meeting and planning board did recommend unanimously that City Council approve this rezoning. NAP Committee meeting was held May 20th. Ten days prior to that meeting was electronic notice to registered neighborhood organizations as well.'",
        "'speaker_0': 'And then for this city council, a public hearing notice was sent out on June 5th and signs were posted on the property to these same groups. So at the bottom of the slide, you see the number of letters that we've received or individual responses.'",
        "'speaker_0': 'They were 331 116 in favor of the proposed rezoning and 215 opposed. You know well the criteria for rezoning. Consistency with adopted plans. Uniformity of district regulations. Furthering public health. Safety and welfare. Justifying circumstances. And consistency with neighborhood context and zone.'",
        "'speaker_0': 'District purpose and intent. Well, here's telling you again that planning board unanimously recommended approval. So the pertinent plans for this proposal are Denver Plan 2000, the Lowery Reuse Plan Blueprint, Denver and the Buckley Annex General Development Plan. So comp plan 2000 in the in the Environmental Sustainability Chapter tells us to promote the development of sustainable communities and'",
        "'speaker_0': 'centers of activity where shopping, jobs, recreation and schools are accessible by multiple forms of transportation. The Land Use Chapter tells us to encourage quality infill development that is consistent with the character of the surrounding neighborhood and offers opportunities for increased density and more amenities.'",
        "'speaker_0': 'That Denver Legacy's chapter tells us to identify areas in which increased density and new uses are desirable and can be accommodated. And the neighborhood chapters tell us to modify land use regulations to ensure flexibility to accommodate changing demographics and lifestyles, and to encourage a diverse mix of housing types, affordable units, essential services, recreation, business and employment.'",
        "'speaker_0': 'Home based business schools, transportation and open space networks. Blueprint Denver Adopted in 2002 The land use concept in Blueprint Denver is employment, and again, this was designated prior to the Air Force closing their offices. And the area is an area of change.'",
        "'speaker_0': 'These are the areas that Blueprint says are large vacant development sites which offer the potential to create new neighborhoods that embody the best characteristics of Denver's traditional residential neighborhoods. And I guess I want to emphasize that this is a key concept of blueprint.'",
        "'speaker_0': 'Denver Directing our growth to areas of change and protecting are areas of stability where we want to have some reinvestment but protect the character of those areas. And so the Street Classification and blueprint Denver for First Avenue is residential collector, which provide a balance between mobility and land access and then residential arterial for Quebec Street.'",
        "'speaker_0': 'First Avenue is 60 feet wide. Quebec Street 110 feet wide. Just like you'd like to know that Lowry reuse plan. As I stated earlier, they didn't anticipate the change in use of the property in 1993 when the plan was written.'",
        "'speaker_0': 'So in 2005, when the Air Force announced they'd be closing the plan, didn't address that. So there is little guidance from the Lowry reuse plan for this rezoning. This is the Buckley Annex General Development Plan. Again, the area we're talking about is is highlighted in yellow.'",
        "'speaker_0': 'The orange bubble is the area we're talking about rezoning. This area is considered the community park mixed use center sub area in the general development plan. And the intent of that area is a community wide gathering place that's defined by a significant community park and plaza, new opportunities for park side, retail and multifamily and single family residence'",
        "'speaker_0': 'residences that look on to the parking plaza. New parking for the Fleshman Library to create a synergy between the library and the new Mixed Use Center and a mixture of land uses including residential, retail, office and civic with ground floor uses and urban design.'",
        "'speaker_0': 'Character of build to's, pedestrian entrances on Lowry Boulevard and Pontiac Street ground ground for active users, parking located on the side and rear of buildings and buildings oriented to the park. So the Neighborhood Context Urban Center is generally characterized by that multi-unit, residential and mixed use commercial that we've been talking about, as well as multi-unit residential uses'",
        "'speaker_0': 'that are located along collectors and arterials, as we have been talking about with First Avenue and Quebec Street. There is a general grid, street pattern, detached sidewalks and usually alleys. Buildings are typically consistently oriented and not haphazardly oriented to the street and in different distances.'",
        "'speaker_0': 'So a consistent build to and there is a high level of pedestrian and bicycle use in these areas. So with these characteristics, staff does believe that the mix five conforms to these mixture of uses, the enhanced build to the pedestrian scaled development that the zone district generally espouses, and specifically this IMX five zone district with its location'",
        "'speaker_0': 'on the primarily collector and arterial streets with a scale of 1 to 5 stories. So staff believes that this is that city five is consistent. So we do find that the proposed CM x five is consistent with Blueprint Denver Plan 2000, the Buckley Annex General Development Plan, and that the C IMX five will be a uniform zone'",
        "'speaker_0': 'district and will be administered uniformly except for the waivers on first and third I mean first in Quebec, and that by implementing our plans we are furthering the public health, safety and welfare. So this criteria is also met.'",
        "'speaker_0': 'Justifying circumstance for this rezoning is changed conditions. The land or its surrounding environs has changed or is changing to such a degree that it's in the public interest to encourage the redevelopment of the area or to recognize the changed character of the area.'",
        "'speaker_0': 'KPD finds this criteria has been met because of the changing condition in this case the closure of the Air Force facilities in 2011. The subsequent sale of the property to Library Redevelopment Authority for redevelopment. We did already talk about consistency with neighborhood context and zone district purpose and intent.'",
        "'speaker_0': 'So with that, self recommends approval of this rezoning. Thank you, Ms.. Lucero. We have 32 individuals signed up to speak this evening. So let us begin by calling the first eight speakers up. The first one is Monti Force, John Putnam, Joyce Foster, Cindy Van Size, Hillary Patel, George Swan Milroy, Roy Alexander and Katie McCrimmon.'",
        "'speaker_0': 'If you can all come up to the first bench, first row right behind the podium. We can begin our public hearing. Let me just.'",
        "'speaker_8': 'I have 6.'",
        "'speaker_0': 'Minutes. Yes, you do.'",
        "'speaker_8': 'Okay. Hmm. Good evening. Members of council. I'm Monte Force. I'm the executive director of the Lowry Redevelopment Authority. My address is 7290 East First Avenue. The staff report was very thorough, but I'd like to spend just a little time amplifying what Theresa has said, along with giving you some additional context for the zoning before you this evening'",
        "'speaker_8': '. I believe this was passed out. Everybody have this little flipbook here. I'm going to be referring to that as I go along to help illustrate some of my comments and others that are going to follow me all the way back in 1991.'",
        "'speaker_8': 'Civic and city leaders set forth the vision for the closing Lowry Air Force Base that it would be an urban, mixed use community with a wide range of housing near parks, schools, jobs and retail services, and that people could live, learn, work and play without having to drive everywhere.'",
        "'speaker_8': 'Today, some 35,000 people enjoy that lifestyle, and Lowery has been recognized both locally and nationally as a model for smart growth. We are all aware of community concerns about growth around this city. And in response, I'd like to say that at Lowery, we've been practicing smart growth for the last 24 years.'",
        "'speaker_8': 'And to continue to do so, we've been at this for a little while. In fact, this is the 61st time we have been to City Council for a zoning action to enable the vision for Lowery. Flipping a page too.'",
        "'speaker_8': 'You can see the entire 866 acre Lowry redevelopment and Boulevard one is 70 acres of that shown in the orange box. At this point, about 98% of Lowry is developed or underway. And this mixed use parcel that we're discussing today within the boulevard, one area at 18 acres represents a mere 1% of all of Lowry.'",
        "'speaker_8': 'Flipping a page three. Lowry is noted as an area of change, and more specifically, so is Boulevard one. Blueprint Denver urges development of compact and mixed use neighborhoods and Boulevard one is just that the right kind of development in the right place and at the right time.'",
        "'speaker_8': 'I flip to page six and you'll see an illustrative that depicts a great opportunity for mixed use redevelopment in Denver on the 70 acre parcel in total will have no more than 800 residential units. Approximately 120 of those would be single family detached, 230 row homes and up to 200 are up to 450 apartments.'",
        "'speaker_8': 'In addition, 12% of that housing mix is affordably priced for sale, and rental homes will have no more than 200,000 square feet of commercial and retail space. It include 13 acres of parks or 19% of the site. On page seven, we show in green the proposed CM five zoning, an 18 acre site located on the east side'",
        "'speaker_8': 'of Boulevard One along Quebec and across the street from the Lowry Town Center. This area is the heart of the community. Where people will live, shop, eat and socialize is integral to the mixed use concept of Boulevard One.'",
        "'speaker_8': 'Also note that a little over 50% of Boulevard one has already been zoned shown in blue with single family homes and row homes. Now flipping all the way back to page 12. I'd like to summarize it in a word.'",
        "'speaker_8': 'I'd like to emphasize that Boulevard one is the same. Boulevard. One planning is consistent with the rest of Lowry and the goals of the city. It has the same density, overall density of 11 units to the acre, the same as the Lowry Town Center District.'",
        "'speaker_8': 'The same ratio of for sale homes to apartments at 45 and 55%, respectively. For the last several years, we have publicly represented and adopted by board resolution that there would be a maximum of 800 residential units on this site in the 200,000 square feet of commercial space.'",
        "'speaker_8': 'This has been reflected in the redevelopment plan, the general development plan. The traffic studies, our planning, our engineering, and the improvements on the ground today. The same zoning in some context be three across the street, which is essentially a mixed use zoned direct district under the previous code.'",
        "'speaker_8': 'Along with the CMCs eight zone district that is nearby. We have the same parking ratios. The design guidelines manage our parking according to ratios in the previous zoning code. We have the same traffic volume. That is, the traffic studies that were approved by the city have estimated 9500 daily traffic trips for the Boulevard one development.'",
        "'speaker_8': 'That's the same volume of generated by the former office use on the site. These same traffic studies concluded that the existing street network, along with proposed streets, can accommodate those proposed trips. The same building heights a maximum of 65 feet in a mixed use area and limited on the edges to 45 feet.'",
        "'speaker_8': 'And finally, it's the same vision by the same developer for an urban mixed use community where people can live, learn, work and play. Thank you for your consideration. I welcome any questions you may have for me later, and I ask for your support.'",
        "'speaker_0': 'Thank you, Mr. Force. Our next speaker is John Putnam. And you have 6 minutes.'",
        "'speaker_10': 'Good evening. And thank you, Madam President and city council. My name is John Putnam. I'm an attorney at law firm of Catholic Church, and Rockwell and I represent the Lowry Redevelopment Authority. The Boulevard one rezoning request that you see in front of you tonight is a straightforward application of the MAP Amendment requirements for the City of Denver'",
        "'speaker_10': '. Section 12 .4. 10.7 of the zoning code authorizes city council to approve a map amendment when consistent with the cities adopted. Plans are necessary to provide land for community need not anticipated at the time the city's plan. The proposed CMCs five map amendment with waivers for the mixed use component of Boulevard One meets all of these criteria'",
        "'speaker_10': ', as discussed in detail in the application by Marti and by Teresa. The CM five zoning is consistent with the city's comprehensive plan. The 22 blueprint, Denver and the 2013 General Development Plan for the Boulevard one. Indeed, Lowry is one of the prototypical areas of change towards which the city has planned to direct mixed use infill development like'",
        "'speaker_10': 'the application in front of you tonight. The proposed MAP Amendment would implement 18 separate strategies in the comprehensive plan and 13 of the implementation measures in Blueprint Denver. These include development of mixed use, pedestrian friendly stretch of developed and pedestrian safe development measures in area of change.'",
        "'speaker_10': 'In fact, it's telling that the plan and blueprint Denver specifically call for mixed use development in Lowry as an area of change. Mentioning Lowry 38 times in the comprehensive plan and 34 times in Blueprint Denver probably exceeding any other area of town.'",
        "'speaker_10': 'Aside from Stapleton, the city approved the Buckley Annex GDP in 2013 as recommended by the planning board at that time. Now Section 12 .4. 12.15 of the zoning code provides a quote. City Council may approve a Map amendment rezoning application for property located with an approved GDP area, taking into consideration the approved GDP.'",
        "'speaker_10': 'Thus, the GDP section of the code explicitly addresses the question of whether a GDP is an adopted plan for purposes of rezoning. Council has already answered yes through the code, and any other reading would render this language of the code that the City Council's passed meaningless.'",
        "'speaker_10': 'The proposed CMCs five zoning follows the height, setback, design and other elements of the GDP, and the zoning code contemplates that the forms would be broadly distributed throughout the city. The proposed rezoning is also consistent with the revision of the Library Reuse Plan to provide the sort of mixed use development that Lowry has become.'",
        "'speaker_10': 'It's true that the 1993 reuse plan did assume that the Federal Defense Finance and Accounting Services Facility would remain on the Buckley Annex site. But the federal government has closed that site, and the assumption that the DOD would remain is not a planning direction, is not in the control of the city, and has no bearing on your'",
        "'speaker_10': 'decision today. Indeed, the city's already approved rezoning of four residential parcels at Boulevard, one covering the majority of the site. The current application provides the employment and mixed use element of the Buckley GDP. As Theresa and Monty have mentioned, the proposed MAP amendment also meets the code requirement that it further public health, safety and general welfare of'",
        "'speaker_10': 'the city. Cities Planning has already identified the city's need for employment and housing in mixed use settings in areas of change, such as Lowry. The proposed rezoning would integrate more parks, space, more pedestrian, a bicycle access and break up the old D fast super block.'",
        "'speaker_10': 'Further, the proposed rezoning would provide compatible heights, exceed parking requirements in the city code in most cases, and integrate with the transit roadway and pedestrian connections in the area. Both the Buckley Annex and the CMCs form in the zoning code were designed to enhance pedestrian safety and activity, especially as compared to card dominated suburban forms, including the'",
        "'speaker_10': 'current path along Quebec Avenue. The traffic studies prepared for the GDP showed that the roadways and intersections can handle any additional traffic, and the height limits are below what can currently be built with the O1 zoning and structures like the hangars and nearby apartments in Legacy.'",
        "'speaker_10': 'Lowry. Indeed, as Marty mentioned, councils already approve same x five and CMCs eight Rezonings and Legacy Lowry. The application also thoroughly explains why the requested waivers provide an extra transition from neighboring uses reducing rate from 70 to 45 feet in these areas.'",
        "'speaker_10': 'Finally, the proposed MAP amendment has been subject to all required notice requirements and an exhaustive public engagement process going back years. There have been over 60 meetings and many changes to the proposed Boulevard one plan and rezoning applications to address community comments and concerns.'",
        "'speaker_10': 'For that reason, and consistent with the thorough analysis that was conducted by the Planning Board, resulting in a unanimous proposal that you approve this application, we ask that you follow that lead and approve the application tonight. Thank you for your thorough consideration this evening, and please let us know if you have any questions at the end of'",
        "'speaker_10': 'the public comment. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Putnam. Our next speaker is Joyce Foster, followed by Cindi Van Sise.'",
        "'speaker_4': 'Good evening, ladies and gentlemen. The City Council.'",
        "'speaker_0': 'Madam President. All groups. All of you.'",
        "'speaker_4': 'I had to come here tonight. I had to.'",
        "'speaker_0': 'Share with.'",
        "'speaker_4': 'You my support for this incredible project. Because I sat where you're sitting 24, 20 years ago, 1993 to 2003, when we would sit here to the middle of the night rezoning it. I sat with Councilmember Ortega, Councilmember Brown.'",
        "'speaker_5': 'I sat with with.'",
        "'speaker_4': 'Many of you who.'",
        "'speaker_0': 'Worked for I sat with Councilmember Robb with.'",
        "'speaker_4': 'Councilmember Laman, because you and I sat with with Councilmember Sussman, who was actually working on the project. And we were here and we were listening and we had many, many people from the community who were petrified. And we were we were unsure of what to do, but they were petrified.'",
        "'speaker_4': 'They were.'",
        "'speaker_0': 'Fearful.'",
        "'speaker_4': 'All of these homeless people that were going to occupy. LOWRY Well, fear not. As soon as my term ended in 2003, we moved. My husband and I moved to Lowery. My son David and his wife Ali were already there.'",
        "'speaker_4': 'And shortly after we moved there, my son Danny, his wife.'",
        "'speaker_11': 'Becky.'",
        "'speaker_4': 'Moved there. And then a couple of years ago, my daughter Debbie moved there. A few years ago she moved there. So we are actually all in walking distance. There's about a mile and a half that separates our home.'",
        "'speaker_4': 'So I am walking distance to all six of my grandchildren and I think that's pretty, pretty wonderful. People are concerned now about density. We moved to Lowry because of density. I walk to my doctor's appointments. I walk to my physical therapy appointments.'",
        "'speaker_4': 'I can walk to the gym. Sometimes when I go, I walk to the restaurants. We have a love, a ton of wonderful restaurants, and I look forward to many more restaurants. It is the community that we determined would be wonderful.'",
        "'speaker_4': '20 years ago. It is the economic engine. DIA is one economic engine. Lowrey is an economic engine and Stapleton is an economic engine. Whatever we did, we did right. And we did with trepidation and we did with common sense and a thoughtfulness.'",
        "'speaker_4': 'When I was on City Council, I was assigned to the Dr. COG board and I sat there for eight years and we wanted transit and we built transit. We're never going to have transit in Lowry unless we have density.'",
        "'speaker_4': 'So if the more density we have, the sooner perhaps we can start applying for the dollars for transit. It's a walk. It's a walkable community. It's a bikeable community. And many of my friends, some are retired, but some are not.'",
        "'speaker_4': 'They actually walk to their offices and I tease them. I said, how's the traffic walking to your office today? You know, and it's it's it's marvelous. It's just simply marvelous.'",
        "'speaker_0': 'You're going to, I'm sure, hear horror stories about, you know, what's going to happen.'",
        "'speaker_4': 'You know, there's going to be too many people and everything. To me, it's a blessing.'",
        "'speaker_0': 'It's an absolute blessing.'",
        "'speaker_4': 'We have affordable units in Lowry like we had promised the community, like we had promised the federal government. We don't know who lives where. We don't know who has what money, where. Because we're all integrated.'",
        "'speaker_0': 'This project works.'",
        "'speaker_4': 'It truly works. And I'm just I'm just thrilled that I that I can be there. And I hope that I stay there for a long time getting older here.'",
        "'speaker_0': 'But it works.'",
        "'speaker_4': 'I'm not going to be here much longer. We're going to leave after I finish speaking because we haven't eaten. So I won't be here for it. Any questions? If you may have some, but just know that I wouldn't have spent my Monday night when I could be doing many other things which I cherish tonight, which I cherish'",
        "'speaker_4': 'these days, my Mondays. But I respect all of you for sharing your time, for working so hard, so endlessly for the people of Denver. And because we really do appreciate.'",
        "'speaker_0': 'The hard, tough decisions.'",
        "'speaker_4': 'That you make every single week. And some people love you and some people hate you, and it can be all in one night and but continue to do what you're doing and just know that this citizen of Lowry is very excited about the potential project.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'Thank you. Cindy.'",
        "'speaker_5': 'Good evening. I'm Cindy Vanderslice. I live in Kress, more to 15 Crime Area Street. I know many of you on the board and it's nice to see all of you. I come here as a conscientious objector to this zoning application, and I come here because I don't want Lowry to become another Cherry Creek.'",
        "'speaker_5': 'I see the building that has destroyed the community of Cherry Creek, the, the parking there, the the the traffic in that area. The families that that are watching their communities being destroyed by big, tall buildings. And I and I don't want our Lowry to have had that happen.'",
        "'speaker_5': 'I love the Lowry development. I love what it is. My brother lived there. I love this little township. And I think that that Lowry deserves to continue to have that. But we have 800 units going up in that area right now.'",
        "'speaker_5': 'And we have another zoning that you're asking for, four, five storeys more. That's putting in another 600 plus cars in that area alone, plus the 150 that you approved a couple of weeks ago in the Kress Mercy, a Cedar Monaco area.'",
        "'speaker_5': 'The streets in the infrastructure in that area do not support that extra population. We have building going up on Colorado Boulevard between eighth and ninth and 10th at the old C.U. campus. We have building going up on eighth Avenue and Jersey.'",
        "'speaker_5': 'We have. As I mentioned, the whole Cherry Creek area. This area is been way overbuilt. And yes, you want tax dollars to come in to Denver and yes, you want to prepare for the future of residents coming into Colorado.'",
        "'speaker_5': 'But let's not destroy what we have right now. I live on the extension of First Avenue that goes west and it turns into crime area, and then it goes on to Third Avenue, which can go straight down into Cherry Creek or go straight ahead to the north onto Sixth Avenue.'",
        "'speaker_5': 'I have busses. I have cars. I have speeding trucks and people coming down that street. We have over 30 kids in our neighborhood right now that can be run over by extra traffic, trying to avoid the excessive traffic jams that we have on Quebec, Monaco, Colorado Boulevard, Sixth Avenue, Alameda, and my community.'",
        "'speaker_5': 'I thank you all. And I hope that you think about the excesses that are happening.'",
        "'speaker_0': 'Thank you. Our next speaker is Hilary Patel, followed by George Swan and Hillary. You have 6 minutes.'",
        "'speaker_4': 'Thank you and good evening. My name's Hillary Patel. I live at 2385 Glencoe Street in Denver. I'm the director of Public Relations and marketing at the Lowry Redevelopment Authority. I've served in this role for 15 years. As Monty said, we've been walking the talk at Lowry on Smart Growth since the early 1990s.'",
        "'speaker_4': 'Just last month, Lowry was named one of the top five neighborhoods in Denver by 50 to 80 magazine. It's the walkability mix of uses and overall vibe that sets Lowry apart. Today, 35,000 people live, work and go to school at Lowry.'",
        "'speaker_4': 'There are over 100 employers there. It's a three square mile area. It's a town of the size of many towns. Our diverse community offered many different perspectives during the planning for Boulevard One. Some of these are reflected in the more than 60 planned changes that have been made in response to citizen comments in the more than 60'",
        "'speaker_4': 'public meetings we've had since 2007. Most people got much of what they wanted, but not all of what they wanted, including the Redevelopment Authority. In our experience over the years, that's a pretty good place to end up because it says that all of the balance, the interests have been balanced during the planning.'",
        "'speaker_4': 'There are about 20 neighborhoods surrounding Lowry, again, which is a three square mile area. We've worked with all of them over the years. Our Community Advisory Committee was established in 1994 to provide broad community input to our board of directors.'",
        "'speaker_4': 'All of our 61 rezonings to date have been deliberated both by our Community Advisory Committee and approved by our Board of Directors before we even began the city process. Today, in terms of outreach, 6000 households receive our monthly newsletter like this one that covers the zoning application you're reviewing tonight.'",
        "'speaker_4': '3000 people have registered for email updates about Boulevard one. Our homebuilders get about 50 emails after each update. I receive emails and phone calls every day from people interested in living or opening a business at Boulevard One. Is one of great Denver's great neighborhoods because it is walkable, bikeable and transit friendly.'",
        "'speaker_4': '2570 people per day ride the bus at Lowry. That's enough to fill 50 busses per day. We actually have five RTD routes that serve Lowry and 44 transit stops that serve the community. There are miles of multimodal streets and sidewalks at Lowry, connecting 800 acres of public parks and open space.'",
        "'speaker_4': 'We'll have 75 bike racks at Boulevard One alone. You know, we're all experiencing Denver's rapid growth. New people, perspectives and ideas bring new vitality to our city, business startups, restaurants and cultural amenities that we all enjoy. Growth also brings change and things like traffic, but the answer to traffic concerns is not to build more low density, primarily'",
        "'speaker_4': 'single family home neighborhoods where people have to get in their cars and drive to do everything. The better, smarter approach is to build neighborhoods where homes, offices, retail, schools and parks are within walking and biking distances, where different people are coming and going in different ways at different times of day.'",
        "'speaker_4': 'This disperses traffic. Tonight, zoning application supports this medium density, urban placemaking and is consistent with the same vision in the Denver Comprehensive Plan and Blueprint. Denver Lowry is a local and national model for smart growth, and the same planning appearance planning principles are being applied at Boulevard One.'",
        "'speaker_4': 'This is the right kind of development in the right place at the right time. Thank you.'",
        "'speaker_0': 'Thank you. Next up is George Swan, followed by Milroy Roy Alexander.'",
        "'speaker_8': 'Okay. Thank you, Madam Chair. And Council members. My name is George Swan. I live in Lowrey at 180 Poplar Street and. I'm here to talk about this. This application. First thing I went online. And I see there's 83 pages in this application with pictures and all that sort of thing.'",
        "'speaker_8': 'But I was looking for a table that would simplify the information because we hear all about densities and numbers, you know, but there isn't anything about what was it five years ago, three years ago, what is it now?'",
        "'speaker_8': 'What's a projection? There's nothing really that makes sense. I don't know why that is. I then went online and I looked at the design guidelines of Boulevard One, and maybe that's what they're referring to in the 2013 that this was approved on January 2014.'",
        "'speaker_8': 'The design guidelines of Boulevard one, it's 108 pages long. And when you read it, it makes me feel good. They talked about the community park and they talked about the plaza. But when I look at the application and I see they're talking about a five story building and I drove up and down that Quebec street and I'",
        "'speaker_8': 'imagined, you know, what would that look like if there were five storey buildings all along that street? And I see there's a waiver, you know, to try to reduce that from 70 to 65 feet. And there's a waiver over at First Avenue, says they're going to reduce it to three storey buildings.'",
        "'speaker_8': 'But if you look at the read block in the application, if you look at that red block going to marks five. Correct me if I'm wrong, but I think this is really kind of a limit. Like you can't go over five stories.'",
        "'speaker_8': 'Is that right? But I would I went to the Lowry Redevelopment Authority building and I walked in and I said, you know what? What is it that they're going to build in this red area, this red zone? And they told me the only person I saw there was one.'",
        "'speaker_8': 'There were a couple of people that had more information that I could never get in touch with them. But the person that I talked to said that there are no plans. That the zoning is simply going to allow the developer to invite developers in there.'",
        "'speaker_8': 'So I know this isn't the last word for the residents. If they're going to put up some obnoxious five storey buildings along the whole wall, at least there'll be a chance at the Lowry Development Authority public meetings and at the planning, development and the Council.'",
        "'speaker_8': 'Maybe I don't know how that quite works. But five storey buildings aren't going to work.'",
        "'speaker_0': 'Mr. Swan, your time is lapsed.'",
        "'speaker_8': 'The time is up. Okay. How can I just say one more word about the community park? You can there you.'",
        "'speaker_0': 'Can be invited back, but there's other people here. 3 minutes are up. Thank you. Mr. Alexander, followed by Katie McCrimmon.'",
        "'speaker_1': 'Members of the council. Good evening. My name is Roy Milroy Alexander. Board chair of the LRA and former CEO of Colorado Housing and Finance Authority. My wife and I live at 7603 East Sixth Place in Lowry. We've been there for the last 15 years, and our 26 year old son is also a Lowry resident.'",
        "'speaker_1': 'We are extremely proud of the Lowry community. And as an NRA board member, I take my governance role and our governance role just as seriously as I did the chapter for over 22 years. Our board deliberate, deliberates freely and considers all voices, all opinions, as we seek always to lead and to oversee the operations of the authority'",
        "'speaker_1': 'to our own high standards of performance. As is the case with this particular application, we work with our many shareholders and we exercise due care in the conduct of our responsibility and decision making, all in order to build the great community that Larry is today.'",
        "'speaker_1': 'We believe that the proposed zoning for the Boulevard One CMCs site that's before you is proper. We have weighed an abundance of neighborhood input that has strengthened the quality of the plan that's before you and with our community in mind.'",
        "'speaker_1': 'The board took that extra step to cap limits on residential and commercial that Monte Force and others have have mentioned so far. For all our efforts over the last 24 years and in the life of Lori. Lowry has been recognized locally and nationally as an excellent model for smart growth.'",
        "'speaker_1': 'And having those same principles that made us successful over the years be an integral part of this plan. At Boulevard One, we're not about to change that reputation. Our plan recognizes the various development factors that have to be considered today, including demand and including community concerns.'",
        "'speaker_1': 'And we also think about the future. But but this plan also helped us stay grounded in the past of Lowry, which we are very proud of. We are excited and proud to be developing this last parcel of community into a smart and you've heard live, learn, work and play neighborhood.'",
        "'speaker_1': 'And I support the proposal and we recommend your approval. Thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, Katie McCrimmon. You have 6 minutes.'",
        "'speaker_4': 'Thank you. My name is Katie McCrimmon. I live at 200 South Kearney Street and I'm a representative of the Kress Moorpark neighborhood. We're one of three R nos in Crest Moore and which I know, you know, is immediately to the west of the Berkeley Annex site.'",
        "'speaker_4': 'Our neighborhood voted to oppose what we think is an inappropriate proposed zoning change for Berkeley Annex. And before I share my comments with you, I want to read some comments from Jon Fisher, who is the head of one of the other across Arnaud's, which also opposes this zoning change.'",
        "'speaker_4': 'And John could not be with us tonight. Honorable Denver City Council members I am John Fisher, President of XMR Park Homeowners Inc first filing and I address you in that capacity as well as in my individual capacity as a Denver resident living in close proximity to Lowry and the Boulevard one development.'",
        "'speaker_4': 'And in each capacity, I urge you to deny the requested zoning because it does not fit the character of the overall development of Lowry, nor is it consistent with the surrounding neighborhoods. I also address to you in regard to the rezoning of 195 South Monica Parkway a couple of weeks ago, and I feel compelled to clarify a'",
        "'speaker_4': 'few misunderstandings which might have played a role in the outcome of that hearing. Since these issues were raised by council during deliberations, first being that many more residents of surrounding neighborhoods were opposed than in favor, as is the case here as well.'",
        "'speaker_4': 'Second, that Chris Moore is, in fact, closer to the development than Hilltop, and that is the case again here tonight. Third, that Chris Moore is, in fact, contiguous to this development. And again, that is the case here. Again, as this is just across, Monica, from the development and forth and critical to the issues at hand that we'",
        "'speaker_4': 'were in favor of limited development that was consistent with the character of surrounding neighborhoods. And so here again are many representatives of surrounding neighborhoods in favor of limited development, but not overdevelopment, as this is proposed tonight and which the requested zoning would permit.'",
        "'speaker_4': 'For almost one year, I was a member of the Lowry Committee, a community advisory committee, and the as the GDP for Boulevard one was developed at each and every meeting concerned nearby residents spoke articulately, thoughtfully and sometimes passionately about their concerns regarding density.'",
        "'speaker_4': 'I'm going to skip ahead to a few of my comments because I'm running out of time. We increase our stand with our neighbors in Lowry, Winston Downs and throughout East Denver in demanding zoning that fits our neighborhood. We call on you tonight to postpone this hearing.'",
        "'speaker_4': 'It is totally inappropriate for a lame duck council. And I'm sorry, I just have to say, what is the truth to be voting on on this very important matter when you could postpone for just a couple of weeks and give people the sense that they're truly being represented?'",
        "'speaker_4': 'Am I out of time? No. Oh, I have more time. I saw the green light. Okay. Oh, that was just 3 minutes. Okay. If you choose to vote yes tonight and not to delay this decision, we will remember the choices you make as public servants.'",
        "'speaker_4': 'I know that you care deeply about the legacy you leave behind. You can choose to be like the great leaders in Denver's history. Mayor Spear, who launched extensive efforts to beautify Denver and turn our city into what he called back then even a world class city.'",
        "'speaker_4': 'George Cranmer, who built our spectacular park system and created Red Rocks and the Winter Park Ski area. Emily Griffith, a visionary who understood the value of education for people of all ages. Federico Pena, who imagined a great city.'",
        "'speaker_4': 'And Wellington Webb, who added 100,000 people to our city during this tenure, but did so in a careful and considered way. Without turning every quiet Denver neighborhood into a mecca for developers. That is how we feel now. We feel that we are under siege with development and we are not able to handle all this excess traffic.'",
        "'speaker_4': 'After you voted to support 195 South Monaco and then this will be immediately across the street voting on big decisions after the elections does not pass the sniff test. It's not how we do things in Denver. I urge you again to please delay and not vote on this tonight.'",
        "'speaker_4': 'You have a choice. You can do what we think is the right thing and delay this hearing. Or you can make the wrong choice and once again do what lobbyists tell you to do. We as citizens feel powerless at times.'",
        "'speaker_4': 'We tried to meet with several of you regarding the 195 South Monaco issue. We were denied access and yet we saw lobbyists sitting on your couches in your office and spending time with you. And citizens need to feel that they have a stake in these decisions.'",
        "'speaker_4': 'So we ask you to please deny this and delay.'",
        "'speaker_0': 'Thank you. Our next round of eight speakers are the following. Jim Postman. Kent Lund. Ellen Torres. George Kerwin. David Stanky. Elisabeth Lund. I don't know if this is Mary or Mary Nelle Wolf. Mary. Okay. And Rochelle Newman, if you can all make your way up to the front.'",
        "'speaker_0': 'Our first speaker again is John Holzman. You have 3 minutes.'",
        "'speaker_8': 'Good evening, council members. I am Jim Hartman. 2120 BlueBell Avenue in Boulder. And I'm also a Lowry property owner. I'm part of the ownership group at Hangar two, which is one of the very successful mixed use projects in legacy.'",
        "'speaker_8': 'Lowery has some of those fine restaurants that were talked about earlier. And I'm also a member of the Design Review Committee for Legacy Library, as well as Boulevard One. And I've been an architect and sustainable property developer in the metro Denver area for 35 years.'",
        "'speaker_8': 'I strongly support the approval of this Map amendment tonight. I think it's the right thing to do. This is, as has been said, a great example of smart growth. And Denver needs smart growth. We've been national leaders in that for many decades.'",
        "'speaker_8': 'We should continue with this example of really good development and opportunity at this part of Denver. So I urge you to support the request. And thank you very much.'",
        "'speaker_0': 'Thank you. Next speaker, Kent Lund.'",
        "'speaker_10': 'It evening council. My name is Kent one, two or three South Pontiac Live in Park Heights Subdivision, just south of the area we're talking about tonight since 2000. And just quickly, I wanted to introduce in the record a petition that the Park Heights neighborhood presented to the Denver Planning Board for the hearing on May six, as I'",
        "'speaker_10': 'understand it, doesn't necessarily transfer through, but there are about 82 homes in Park Heights. There are, by my count, about 78 or 79 signature, all in opposition to this to this rezoning change. And as was stated earlier, it's too much.'",
        "'speaker_10': 'It's Cherry Creek. We're in favor of of reasonable development, low heights, low density or lower density setbacks. We're concerned about the traffic. We've heard some people pooh pooh the traffic. That's a big issue on crack. It's a dangerous situation.'",
        "'speaker_10': 'And the concerns that my neighbors focused on were the overall density, the lack of adequate parking, the building heights that we've been talking about, the lack of adequate setbacks and traffic safety. And so I was struck by what what you said, Councilperson Sheppard, about how the process should work.'",
        "'speaker_10': 'Our neighborhood and others have been very active going to our our councilperson this last minute. And we appreciate you meeting with us. The input has been there. We hope it does work that way. They hope there is a flexibility to do this in a smart way.'",
        "'speaker_10': 'We don't need Cherry Creek. And thank you very much. We respectfully urge you to deny this zoning change. And I'll present this for the record.'",
        "'speaker_0': 'Thank you, Mr. Lund. Elaine Torres. Followed by Greg Kerwin. Mr. KIRWIN.'",
        "'speaker_8': 'Here I am, tourist. But I'd be happy to speak with you.'",
        "'speaker_0': 'Are you? Are you?'",
        "'speaker_8': 'I'm Greg Kerwin.'",
        "'speaker_0': 'Okay. Hi.'",
        "'speaker_8': 'Good afternoon. Good evening. So I live at 200 Carney Street in the Crest Moore neighborhood just a few blocks from Buckley Annex. And first, I agree that tonight in this lame duck session, you should do the right thing and postpone this vote to the new council sworn in after July 20th.'",
        "'speaker_8': 'You owe it to Denver voters to give the new council members a voice on this important issue which will shape the future of East Denver. Now, Teresa Lucero pointed out that on a 2 to 1 ratio, 215 letters were sent opposing this.'",
        "'speaker_8': 'They would fill up this whole room if they came. Why aren't they here? They saw how the council treated people three weeks ago from Chris Moore, who did fill up the room and kept you till 230 in the morning.'",
        "'speaker_8': 'Did the council listen to the neighbors? No. Council knew better. It was arrogant. It told them, you're going to take this density because every neighborhood has to do its part to stop urban sprawl on the front range. Why are neighbors upset?'",
        "'speaker_8': 'Why are residents upset with this particular zoning? Because they see CMC's five urban center zoning as a beachhead. Do you remember the chart that Teresa Lucero put in front of you, surrounded by single family homes, not C-Max five.'",
        "'speaker_8': 'What is C-Max five? It's what's sprouting up all over Cherry Creek. And as you've heard several times, that's what people are afraid of. Once this zoning, this beachhead is planted in the middle of Loughery, developers will be lining up at KPD, asking to rezone the nearby parcels.'",
        "'speaker_8': 'And you know what they're going to say? Look, you have this urban category now in LOWRY. We should be able to do it, too. We should get to tear down old homes and Mayfair just north to add this intensity that Denver needs.'",
        "'speaker_8': 'That's why most East Denver residents are horrified. They're horrified by the new canyons of tall buildings in Cherry Creek, and they don't want to see that spread further east. And we heard you talk three weeks ago about how you think you can't consider traffic.'",
        "'speaker_8': 'I think you're legally wrong about that and exposed to a legal challenge. But the city streets cannot accommodate the traffic, and that's what people are worried about. The LRA cannot explain to you why x five is the appropriate zoning.'",
        "'speaker_8': 'Now, it was interesting to hear about mixed use and the urban intensity with the text amendments that you heard before this hearing. Urban center zoning is four near the city center and near major streets. They're asking for 18 acres of S.M. X five, ostensibly to build 450 apartments.'",
        "'speaker_8': 'It doesn't match. They don't need five storey buildings to add 450 apartments to 18 acres, along with some commercial space. It's way over the top. But why are people afraid? Because by changing the zoning on this tonight, you will create enormous permanent pressure on the surrounding neighborhoods, destabilizing them because there will be a wave of future zoning'",
        "'speaker_8': 'requests based on this CMCs five zoning. Madam Chair, do I still have some time? Yes, you do. So I sent you. I'm a lawyer. I sent you a detailed letter explaining why, as a matter of quasi judicial decision making, which is your job tonight, you're not here as politicians.'",
        "'speaker_8': 'Why? It doesn't fit the zoning code categories. In brief, it is not consistent with adopted plans. It is remarkable to me to see the LRE saying the GDPR never brought before this council in the supposedly 61 times they've been here is an adopted plan.'",
        "'speaker_8': 'And I urge you to seek guidance from the city attorney about whether the 2013 GDP is an adopted plan. It was only adopted by the Denver Planning Board, not by the City Council. You're committing legal error to rely on that and that that's the plan that the LRA is handing to you.'",
        "'speaker_8': 'As a lawyer, I'm offended by that kind of freedom with the zoning code when that's not what the zoning code tells you. I hope that you will follow the law tonight instead of making decisions as politicians, adding your own personal views and your personal biases, because that's what you're called upon to do.'",
        "'speaker_8': 'The last thing I'd like to do very briefly, Christine O'Connor could not be here tonight. I have handed up a chart which is six pages long, where she goes through in great detail responding to inaccurate statements from the developer of the LRA.'",
        "'speaker_8': 'And I want to highlight a few of those. First, on page one under height, the LRA says the maximum building height is 65 feet, like with the rest of Lowery. 65 feet is not the maximum height in the rest of Lowrey.'",
        "'speaker_8': 'Under the Lowrey design guidelines, it's 45 feet, except in the town center, which is quite small, where it is 62nd, and this is under planning process. The argument is that the plan mirrors adjacent land, uses drive Quebec and look east where these are going to be and you will see single family homes not adjacent land uses that'",
        "'speaker_8': 'match Cemex five. There's one office tower there, but you will create destabilizing pressure to have those existing buildings torn down and densify it if you approve this. Third on page one, because the proposed CMC's five with waivers was discussed at most of these meetings.'",
        "'speaker_8': 'That is completely false. The LRA never held any public meetings with neighbors to discuss the CMCs five zoning. They were at very preliminary stages to discuss things like the GDP. Turn to page four of Christine O'Connor's comments at the top of the page.'",
        "'speaker_8': 'The argument is that the city's land use plans include the Buckley Annex GDP. I've already commented that that's a legal error and you're making a mistake to rely on that GDP as an adopted plan under density. On page four, she mentions the LRA telling you their density is 11.4 units per acre.'",
        "'speaker_8': 'Then why do they need five storeys on 18 acres of CMCs five for that kind of density? The C-Max five is way out of whack with what they say they're trying to do. The number six necessity of this zoning choice.'",
        "'speaker_8': 'They say that seems.'",
        "'speaker_0': 'Fair when your time is lapsed. Thank you. Our next speaker is David Stankey, followed by Elizabeth Lund.'",
        "'speaker_7': 'Good evening, Madam President. Council. I'm David Stankey. I'm with Infinity Home Collection. I'm a homebuilder in Denver, Colorado. I'm here tonight in support of Cinemax five zoning for the Lowry Boulevard. One project. My company, Infiniti Home Collection. We've been building continuously in the city of Denver since about 2001.'",
        "'speaker_7': 'We've built almost 2000 high end production homes in the city. We've always focused on building special homes in special places. And one of the beauties of our business is we're continually learning and designing for today's home buyers. They're a little more diverse, a little more informed, and quite a bit more forward thinking than any other generation.'",
        "'speaker_7': 'I've had the pleasure of knowing they aspire to live in the city here city, Denver, actually, most of them already do live in the city. That's their desire. Boulevard one is exactly the type of neighborhood that reflects and fulfills their desires.'",
        "'speaker_7': 'Mixed use is what should be created on such a special piece of land. Today's homebuyers desire good schools, services, entertainment, amenities all within reasonable walking distances of their homes. They don't like to drive. They actually prefer to walk, ride a bike, take an override.'",
        "'speaker_7': 'Whenever that wherever they need to go, they welcome diversity of product. They appreciate the urban nature of community. They love the parks. They love connectivity to all the great Denver venues. They crave simple gathering spaces, be it a pocket park or coffee shop, boutique store, restaurant, wine bar, yoga class, whatever.'",
        "'speaker_7': 'That's that's where they're connecting to all of their neighbors. Today's consumers are also looking for high performance homes that incorporate. Smart, energy efficient, sustainable qualities that you really care about our planet. They embrace the conscious efforts of a developer whose energy guidelines are strict and consistent throughout.'",
        "'speaker_7': 'They welcome new technology, obviously, and they love fresh architectural styles to demonstrate their desire to live in Boulevard One. We currently have a waiting list of over 150 people for 18 lots. That list is in addition to a master list of about 1500 people who have expressed serious interest long before we started our first home.'",
        "'speaker_7': 'This diversity of our product offering is reflective of the diversity in today's active buyers their traditional young families, their young couples, their single women, their single parents, the new grandparents. They're empty nesters and they're millennials. Millennials have nowhere to go.'",
        "'speaker_7': 'They are renting. They've got high student loan debt. They're the next generation and the biggest generation. They're the ones that are looking for those rentals in great neighborhoods with with this type of zoning. They're moving up. They're moving down the movement across, but everybody's looking for something special in their lives.'",
        "'speaker_7': 'I strongly encourage you to support this, and thank you very much for your time today.'",
        "'speaker_0': 'Thank you, Mr. Stanky. Elizabeth Lund, you have 6 minutes.'",
        "'speaker_11': 'Thank you. I do have a hard copy of a PowerPoint, and I would ask that it be distributed to the council members prior to my speaking because I would like to address it. Have you look at it while I'm speaking?'",
        "'speaker_11': 'If you would.'",
        "'speaker_0': 'What does it look like?'",
        "'speaker_4': 'It sounds like this we have. Thank you.'",
        "'speaker_11': 'Thank you very much for allowing me to be here today and to speak to you. My name is Elizabeth Lund. I live at 203 South Pontiac Street, which is in a little subdivision of Lowery called Park Heights. We have lived in Park Heights since 2000.'",
        "'speaker_11': 'My family and I, it's about 80 homes or so. It's a small neighborhood. It's so small we don't have our own R.A. But we did sign a petition, which my husband actually referred to a little while ago, to express our concerns about this application.'",
        "'speaker_11': 'Our concerns are largely related to safety and density and other neighborhoods. Other arenas went along with our petition and they adopted it at their meetings. So this petition has very wide neighborhood support among many neighborhoods in this area.'",
        "'speaker_11': 'If you would, please look at the first page of my PowerPoint presentation, my hard copy. Sorry that it's not the most professional looking, but we did the best we could. So the first page is what we thought the The Buckley Annex would look like in 2008 when the LRA was working on it.'",
        "'speaker_11': 'And it appeared to be a nice mix of businesses, restaurants, apartments, all different types of homes. And so we thought that that would work. Page two The guiding principle that we thought we had at Lowry was to keep young families in Denver with smart new urbanism.'",
        "'speaker_11': 'And we think that's great. We are all for Smart, New Urbanism. And the Tom Markham was the executive director of LRA for a long time, and he also felt that it was important that the development was compatible with the surrounding areas.'",
        "'speaker_11': 'Page three is some of the success that we've had at Lowry and that we've enjoyed. We really like the fact that we have 184 Colorado trust homes. We like that we have apartments, townhomes, row homes, fancy dancy million dollar homes and schools and businesses.'",
        "'speaker_11': 'We've got it all. We like it and we want the same thing to keep on working. But we're afraid with this development. It is not. It's just too much. It is urbanism on steroids. It's not smart development. 90% of the 18 acres that you have before you today in the application is surrounded by single family townhomes, apartments'",
        "'speaker_11': ', homes, a library and future row houses and single family homes that have not yet been built. And we don't feel that the staff has presented this accurately to this city council. On page six, there is a diagram of the surrounding neighborhoods and to orient you.'",
        "'speaker_11': 'Monaco Parkway on the left, Quebec on the right, the big white stuff on the far right corner with all that blocky stuff. That is what we're talking about today. That is the application. Park Heights, where I live, is immediately south of this development and there are houses to the right of it on Quebec.'",
        "'speaker_11': 'If you turn to page eight, that is the east side of Quebec. Those are the types of houses that will be next to this development. And then page nine is my neighborhood, Park Heights. This view is looking across from Boulevard one to where Park Heights is.'",
        "'speaker_11': 'We think that the staff pictures failed to convey this area appropriately. For example, on page ten, this is a copy of the staff presentation that Kopec building on the far right top. That is a four story building, but it has a huge setback of 100 or so feet and it is only near the northeast edge of this'",
        "'speaker_11': 'application. Most of this is surrounded by residences, the setbacks and this is on page 11 that were originally planned for Quebec, were supposed to be 35 feet. All of a sudden they disappeared. And as much as we like to walk to places, Quebec is a very, very dangerous street.'",
        "'speaker_11': 'I have told our teenage driver that he may not turn left on Quebec from where we live. It is too dangerous. Quebec is overburdened. On page 12 is another picture of what we thought we were going to get with this development.'",
        "'speaker_11': 'Again, this is from the 2008 Buckley Annex redevelopment plan. Page 13 has a quote on it about the urban center and neighborhood context. Urban centers such as this are supposed to be along major corridors at transit station areas and near and around downtown.'",
        "'speaker_11': 'This is taken from Denver's own website. If you'll look at the the source below.'",
        "'speaker_0': 'This.'",
        "'speaker_4': 'Link where time is.'",
        "'speaker_11': '12 that says Explore zoning.'",
        "'speaker_0': 'Your time is lapsed, miss.'",
        "'speaker_11': 'I got 15. The very last page. This land is the Lowry Town Center. The one.'",
        "'speaker_0': 'You're. Your time is lapse. Will you please. Will you please sit down? Okay. Our next speaker is Mary Nell Wolf, followed by Rochelle Newman.'",
        "'speaker_4': 'Good evening members of council I'm Mary now Wolf and I live at 4501 East Sixth Avenue Parkway and what has been referred to tonight as the lame duck council. I want to tell you, I appreciate it, because during those 61 appearances that Lowery has been here, you have all the history.'",
        "'speaker_4': 'During the 33 years that I have lived in our part of Denver, we have seen tremendous growth and change. We have had two of the largest city infill projects in recent memory and now the explosive resurgence of people wanting to move closer to the city center.'",
        "'speaker_4': 'Anticipation of this led me to volunteer for a variety of neighborhood based task forces over the years, including the Community Advisory Committee at Lowery. I have been working on the redevelopment of Lowry since Pat Schroeder served in Congress.'",
        "'speaker_4': 'So suffice it to say, it's been a long time. As with anything new, there will be those who like what was done and those who deplore any change. Lowry is no exception with sensitivity to this credo. We made every effort to hold numerous public meetings on every topic possible.'",
        "'speaker_4': 'Reaching consensus was always the goal, and although that wasn't always achieved, we feel that we have the majority of the community in agreement with the decisions which were made and are currently being proposed. The redevelopment of Boulevard one is no exception to the controversy which changed in genders.'",
        "'speaker_4': 'However, the planning of Boulevard One has incorporated a mixed use approach which will not only benefit the new residences but integrate well into the existing neighborhoods. It provides parks a full range of housing options, office space, restaurants and businesses, all with this sensitivity to traffic patterns and restricted building heights.'",
        "'speaker_4': 'And if I may, I would like to point out that this is adjacent to the former Crest Moore Downs, now LAX at Lowry, which has six high rise buildings of seven floors each. It is no secret that the city of Denver is challenged by too much traffic with little help from mass transit but more convenient public options'",
        "'speaker_4': '. And we have tried very hard to create an environment where people can live, work, learn and play. And we have sought to lessen the impacts of traffic and provide all forms of modality throughout the parcel, as well as sensitivity into integrating onto the existing streets.'",
        "'speaker_4': 'I ask you tonight to approve the application for Boulevard One, a nationally recognized and award winning example of how to incorporate the old with the new, and to keep our city and neighborhoods a vibrant, a vibrant place for all.'",
        "'speaker_4': 'Thank you very much.'",
        "'speaker_0': 'Thank you, Rochelle Newman.'",
        "'speaker_4': 'Hi. My name is Rachel Newman. And I'm Rachel. I'm here as a Lowry resident and as a community representative who volunteers on the Lowry Redevelopment Authority Board of Directors. I've lived in Lowry since 2004, having moved from LoDo when my husband and I decided to start a family.'",
        "'speaker_4': 'At the time I was an employee of one of the nation's largest homebuilding companies. So I had researched communities all across the Denver area before deciding on Lowry. Lowry was the ideal neighborhood for us because of its emphasis on family lifestyles such as schools, parks and open spaces, as well as restaurants and historic buildings.'",
        "'speaker_4': 'The history of the community blended with modern amenities and the convenient city location were and remain priorities for us. I perceive Lowry, both Legacy Lowry and the Boulevard one parcel, which is designed with the same standards as legacy as having the appropriate density.'",
        "'speaker_4': 'Lowry is incredibly residential, but with scale, which you would expect this close to downtown. Some people are comparing Lowry to Cherry Creek, and I just don't see anything close to Cherry Creek's density overcrowding or parking issues here in Lowry.'",
        "'speaker_4': 'I do not believe that there's a traffic traffic problem overtaking our neighborhood. I perceive an incredibly positive community on the whole. Contrary to what opponents of this project are saying. We on the LRA board carefully balance our obligations to the cities of Denver and Aurora and our community.'",
        "'speaker_4': 'I listen to every comment from the community and we as a board spend good portions of every meeting carefully considering and debating each one. That is our obligation, and that is what we do. We're committed to continue working with the community to ensure that Lowry exceeds the expectations that so many of us have for this great community'",
        "'speaker_4': '. 35,000 people work, live, play and learn at Lowry. This diverse community is an important part of Denver. Yet we have created a unique character and lifestyle, thanks in large part, in my opinion, to the open spaces in this characters.'",
        "'speaker_4': 'What is being proposed for this parcel is Boulevard one. Boulevard one is the last part of Lowry's planning process. This application is the heart of Boulevard One. It provides the amenities that make the single and multifamily residential components so attractive.'",
        "'speaker_4': 'And that's what will make Boulevard one occupy the same esteem as does Legacy Lowry. I sincerely hope you'll approve this rezoning application. I thank you for your time.'",
        "'speaker_0': 'Thank you. Our next eight speakers are Jamie Fogel. Bob Moody, Kathleen Ruby, Dick Marshall. Mark Belge. Peter Benson, Jane Harrington and Brian Wert.'",
        "'speaker_1': 'Hello. Good evening, Madam President and council. My name is Jamie Fogle, live at 2876 Paris Street, Northwest Denver. I'm a landscape architect and associate with Design Workshop who helped author the redevelopment plan in 2007 and continue to work in Lowry and Boulevard one.'",
        "'speaker_1': 'Lowry is a community defined by choices. These choices include a mixed use town center, the first housing types, multiple schools, churches, library and numerous recreational amenities, all of which connect pedestrians to the extensive network of open space. These diverse destinations and choices draw people out of their homes to circulate in the larger Lowry community.'",
        "'speaker_1': 'And the spectrum of these great public spaces will now be better connected to Boulevard One, having personally contributed to the planning and landscape architecture in various parts of Lowry for the past 17 years, my, me and my colleagues have clear understanding of what makes a great, vibrant community.'",
        "'speaker_1': 'We are a firm focused on inclusive and comprehensive design and led the planning efforts for Boulevard One. We know Lowry and what it stands for healthy and vibrant neighborhoods with a wealth of choices boulevard one will complete the hole in the proverbial donut.'",
        "'speaker_1': 'LOWRY And we'll be the most complete neighborhood with access to mixed use and urban style living, integrated with over 13 acres of parks and open space. This will be a great thing from a community planning perspective. When you pass through a Lowry neighborhood and see people outside moving on sidewalks, engaging with each other as neighbors, enjoying themselves'",
        "'speaker_1': 'in outdoor community spaces or supporting a town center, it's a sign of a healthy place. Boulevard One's Plan. Evolution has spanned many years with extensive public input. This culminated in a plan that respects the edges by mirroring similar land uses, reduced the densities by 33% and connects the local neighborhood street network, boulevard ones block pattern and scale'",
        "'speaker_1': ', building heights, street widths, interspersed parks and open space and moderate development density are consistent with a local neighborhood center in an area of change, with a desire to transform transition into a complete neighborhood. Some have compared Boulevard One's development plan central to the well-established regional retail destination, Cherry Creek North.'",
        "'speaker_1': 'While they both have a mix of commercial residential streets and parks, the comparison is more apples to Oranges Boulevard. One maximum square commercial square footage will be 200,000 square feet, while Turkey North and the mall are over 2 million square feet and as a result, have much higher traffic congestion associated with the Regional Attraction Boulevard.'",
        "'speaker_1': 'One will create additional amenities opportunities for small and medium sized businesses to flourish, new street networks and diverse parks that provide additional choices for the residents. The proposed Annex five zoning will allow for development to give people diverse destinations and choices which results in a healthy and vibrant neighborhood.'",
        "'speaker_1': 'I believe in this plan and support the rezoning of this section of Boulevard One. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next is Bob Moody. Mr. Moody, you have 3 minutes.'",
        "'speaker_6': 'Thank you. Mm hmm.'",
        "'speaker_8': 'Madam President, members of the council. Thank you for having me tonight. My name is Bob Moody. I live at 122 South Locust Street. Many of the comments I make before you tonight are the same as those I made in testimony before you in support of the rezoning of Monaco and Cedar and myself, my wife, and several of'",
        "'speaker_8': 'our neighbors. Thank you for that support. We have lived on Chris Moore Park for 18 years. We enjoy our park setting and have eagerly awaited the redevelopment of the Air Force Finance Center, a not particularly pretty sight when surrounded by barbed wire fences.'",
        "'speaker_8': 'That in itself generated as much or more traffic than the proposal that is before you. We are the Chris Moore neighbors closest to the redevelopment and wholeheartedly support it. We already utilized Lowry's many amenities restaurants, shopping and recreation.'",
        "'speaker_8': 'Opponents argue that the redevelopment will harm our existing neighborhoods. But those of us who utilize Lowry's amenities believe it's a huge benefit. My background is in commercial real estate development, finance, and I believe the plans being presented by the Redevelopment Authority are sustainable and marketable.'",
        "'speaker_8': 'Denver is a landlocked city and in order to thrive, has to be willing to embrace increased densities. I'm old enough to have been part of the no growth ballot initiatives of the eighties and was always amazed by those who wanted no outward development but fight density.'",
        "'speaker_8': 'Well, folks, then, as now, you can't have it both ways. There is no magical balance between growth and stagnation, and cities that refuse, for whatever reason to grow, are faced with the suburban flight that so adversely affects so many of our cities today.'",
        "'speaker_8': 'When it comes to rental properties, which the opponents do not favor, I suggest they read up on the ongoing debate over construction defects and the erm the effect the current law has on for sale product. I was involved in the defects fight for too many years and today's venue is not the place to rehash that ongoing battle'",
        "'speaker_8': '. But in the meantime, we have more and more rentals. Also more and more of my generation. Or forgoing their single family homes for the convenience of rental accommodation. I have seen the propaganda of the neighborhood associations. I visited their website, which is full of half truths and innuendo.'",
        "'speaker_8': 'I continually see scare tactics about five storey, 100 foot high apartment complexes proposed for Boulevard one. I've looked at the plans, I've read the literature, and I've asked the questions. 100 foot high apartments are not part of this proposal.'",
        "'speaker_8': 'But the misinformation continues. The LRA plans have been vetted. The plan is reasonable. Lowry and Boulevard one are a welcome addition to the Denver fabric. The completion of the Lowry redevelopment is an exciting opportunity for Denver, and I encourage your support.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Kathleen Ruby, followed by Dick Marshall. Good evening. Thank you, Madam President. Members of council. My name is Kathleen Ruby, and my address is to 95 Oneida Street, Denver. I'm here today to ask you to support the zoning application for Boulevard One.'",
        "'speaker_0': 'My husband and I have lived in Mayfair Park neighborhood for over 20 years. Currently, I serve on the board of directors of Mayfair Park, and for approximately 16 years I have been active on numerous Lowry Redevelopment Task Forces and community committees.'",
        "'speaker_0': 'I believe the development of Lowry has immeasurably benefited Mayfair Park and all of us Denver. We now have a vibrant community with restaurants, shopping and gathering places. The Boulevard one development is directly south of Mayfair Park, adjacent to our southern border along First Avenue.'",
        "'speaker_0': 'It is the completion of the Lowry vision and an excellent example of infill development for Denver. Many community members, including myself, worked for several years on the planning of Boulevard One in a way that will provide additional retail, dining and employment opportunities, along with much needed housing for the residents of Denver.'",
        "'speaker_0': 'The planning process involved multiple task forces comprised of area.'",
        "'speaker_4': 'Residents and numerous community meetings.'",
        "'speaker_0': 'Ironically, opponents to this rezoning are expressing the same concerns about transportation, traffic and density that the surrounding neighborhoods did back in the 1990s.'",
        "'speaker_4': 'When the Lowry.'",
        "'speaker_0': 'Redevelopment began. They have a limited view of what should be included in the development, and I believe that is wrong from a planning and.'",
        "'speaker_4': 'Civic responsibility.'",
        "'speaker_0': 'Viewpoint. From Jennifer Moulton to today we have worked to. Build a city that has all forms of housing products and a planning boulevard one, as with all of Lowry. Affordable housing was a priority. Lowry has always been committed to provide housing opportunities for all, and the fact of the matter is, density is required to meet that goal'",
        "'speaker_0': '. Few may be aware that there are over 700 units in the Lexus at Lowry Apartments along the southwest border of Boulevard One, and they include approximately six, seven story buildings which have been there for over 40 years. As with any change, there is always fear of the unknown.'",
        "'speaker_0': 'And for those of us that went through those initial years with the real Lowry redevelopment, we learned that change is not always the negative we anticipated, but instead a positive experience with the collaboration and concessions made by both the LRA and the neighborhoods.'",
        "'speaker_0': 'Lowry has become an award winning, desirable community. My husband and I enjoy and spend a great deal of time in Lowry shops, offices, libraries and restaurants. We cannot imagine living here without them and Boulevard one will only add more of these amenities.'",
        "'speaker_0': 'The requested zoning for the completion of Boulevard One is appropriate and I urge you to support it. Thank you, Miss Ruby. Dick Marshall.'",
        "'speaker_7': 'Thank you, Madam President. Members of the Council. First, I'd like to thank you for all of your service, particularly those that are about to leave this office. I think you do a great job in representing all of the diverse interests that come before you.'",
        "'speaker_7': 'And I appreciate your dedication as a citizen and resident of Denver. I'm Dick Marshall. I live in Congress Park. I'm a landscape architect with over 40 years of practice in the city and city and county of Denver and have worked on a number of city and county projects as well as in other Denver neighborhoods.'",
        "'speaker_7': 'I am currently a member of the Lourey Design Review Committee, have been for about 15 years and currently serve on the Legacy Lowry Committee as well as on the Boulevard One Design Review Committee. As you've heard many times tonight, Lowry has been a phenomenal success and is one of the most successful national models of redevelopment of an'",
        "'speaker_7': 'abandoned tract of federal land and is now a thriving, economically viable, mixed use community that a lot of people enjoy and live in. Boulevard one is poised to extend those successes across Qubec with even higher goals for energy conservation, connectivity, walkability and design quality.'",
        "'speaker_7': 'The current mixed use proposal represents a great opportunity for a diverse mix of residences, retail and commercial uses. Today's residents, as evidenced by Infiniti's experience of having 100 and some reservations for 18 lots, is testimony to the fact that that is exactly the kind of product that people are looking for as buyers of housing today.'",
        "'speaker_7': 'They love the mixed use environment in which they can live, work, shop and play. I believe many who have already signed up to live in Boulevard one are attracted by this exact mixed use vision. The mixed use guidelines, coupled with the waivers to transition heights along the edges and the maximum placed on the overall development help safeguard'",
        "'speaker_7': 'the character of the existing community of Lowry Boulevard, one and the other surrounding neighborhoods. Further, the enhanced design guidelines and the rigorous design review process, which I might add, is conducted in public open meetings, ensure the highest quality outcome for this exciting neighborhood.'",
        "'speaker_7': 'The guidelines were actually rewritten and strengthened. Anticipating Boulevard one coming online and that was done with the participation of several existing Lowry residents. I strongly concur with the planning staff recommendation of the proposed rezoning to TMX five with waivers and respectfully ask you to approve this request.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. Mark Bell, Chief.'",
        "'speaker_1': 'Thank you. My name is Mark Bachi. I'm a Lowery resident. Lowery board member since 2002. I'll thank Madam President, city council members for taking the time this evening to listen to all the voices to the outgoing members of city council.'",
        "'speaker_1': 'Thank you for your many, many years of service and the fact that you're actually fulfilling the balance of your terms and having this hearing here this evening. So. Well, thank you for running through the finish line. There's no issue we've dealt with in the last 14 years that's drawn more planning, more neighborhood input than the issue before'",
        "'speaker_1': 'you tonight, particularly this piece. We had to balance the interest of four separate people on a very narrow strip of land here to satisfy the interest of Mayfair of the folks at Park Heights, the folks across the street and Quebec, as well as the folks across from across Moorpark.'",
        "'speaker_1': 'And the plan that we came up with is truly inspired. It does more than I could possibly imagine to balance those interests. It really reflects the best of what Larry has to offer. So we've had a very spirited and loyal opposition.'",
        "'speaker_1': 'Many folks have been consistent contributors for all the 14 years I've been on these boards, and I'll thank them for their comments. The library redevelopment of board does not have the luxury of cherry picking or only dealing with the facts that are pertinent to us.'",
        "'speaker_1': 'We have to deal with all the factors. We have a fiscal responsibility to fill out a plan that pencils out and meets all the requirements of Lowrey and what we're tasked with doing. We've done that. We've done an inspired job doing it.'",
        "'speaker_1': 'We've taken it as seriously as anything we've ever done. We'll ask you for your support, and thank you for said support.'",
        "'speaker_0': 'Thank you, Mr. Beattie. Next speaker Peter Benson, followed by Jane Harrington and Brian Wurtz.'",
        "'speaker_8': 'Caribbean Council members Peter Benson of Cobble Urban Homes 5291 East Yale Avenue. Our company, Couple Urban Homes, focuses on unique residential urban infill communities and walkable neighborhoods. We look at lots of varieties of sites throughout Denver and build in some newer infill developments in a lot of older neighborhoods where you can walk in and be a part'",
        "'speaker_8': 'of the community. We're very proud to be a builder in Boulevard One, where to start our first homes, hopefully in the next 60 days or so. But, you know, when you look back at the history of Lowry, there's lots of talk about walkable neighborhoods.'",
        "'speaker_1': 'The Elyria has.'",
        "'speaker_8': 'Actually been doing it for a couple of decades. So there's not just a pipe dream of here and hoping it will work the done it and executed it. And we look forward to being part of the next phase of that.'",
        "'speaker_8': 'That's a the aura has met the right balance for a greater Bond neighborhood and boulevard one to have involved lots of variety of residential plans, commercial retail parks, amenities and yes, density. Density is an integral, important and positive part of the urban and a vital urban neighborhood.'",
        "'speaker_8': 'Cities and towns throughout Colorado are begging landowners and developers to to zone the property for mixed use development. And many times they're forcing it upon landowners. The market's not really ready for it. You've got a great opportunity.'",
        "'speaker_1': 'Here where you have all the ingredients in place.'",
        "'speaker_8': 'The residents desire it as shown by the interest. We have another builders, the you've got a.'",
        "'speaker_1': 'Very willing.'",
        "'speaker_8': 'And visionary developer willing to do it and the market's ready for it. So I encourage you to vote tonight in favor of the rezoning. Thanks.'",
        "'speaker_0': 'Thank you. Jane Harrington. Good evening. My name is Jane Harrington. I live at 2264 Holly Street in Denver. I'm the executive director of the Lowry Community Land Trust, now known as.'",
        "'speaker_6': 'The Colorado Community Land Trust. We are created by the Lowry Redevelopment.'",
        "'speaker_0': 'Authority to fulfill their requirement.'",
        "'speaker_10': 'For affordable.'",
        "'speaker_6': 'Homeownership. We have 186 homes at Lowry that are.'",
        "'speaker_0': 'All still owner occupied and still affordable after ten years.'",
        "'speaker_6': 'And we are.'",
        "'speaker_0': 'We'll be developing more and Boulevard.'",
        "'speaker_1': 'One.'",
        "'speaker_6': 'Without any advertising, without even knowing our unit mix or our design. Yet we have people calling to be on our.'",
        "'speaker_0': 'Interests list for those.'",
        "'speaker_6': 'Units as we have a waiting list for all of our homes at Lowry.'",
        "'speaker_1': 'Um.'",
        "'speaker_0': 'Shortly after, one of our homeowners bought her unit.'",
        "'speaker_8': 'At.'",
        "'speaker_0': 'Lowry, she called me one morning and she said.'",
        "'speaker_6': 'I am so excited. I walked over to my favorite bagel store. I'm having a cup of coffee, having my bagel before I go grocery shopping and walk.'",
        "'speaker_0': 'Back to my house.'",
        "'speaker_6': 'Never having to use her car. That is what our homeowners are experiencing at Lowry. They work in the vicinity.'",
        "'speaker_0': 'Their children are educated in the area.'",
        "'speaker_6': 'And they can do without their car on many, many occasions. We are looking.'",
        "'speaker_0': 'Forward to bringing more folks to Lowry from the area, many.'",
        "'speaker_6': 'That are already working at Lowry.'",
        "'speaker_0': 'And we urge you to approve this zoning. Thank you. Thank you, Brian WERTZ.'",
        "'speaker_7': 'Good evening. I'm Brian Word. I reside at 250 Eudora Street in Denver. I have been a member of the LRA's Community Advisory Committee since its inception in 1994. Much of what I'd like to say has been very well stated already, so I won't do that.'",
        "'speaker_7': 'But I want to restate, having participated in all of it, that the development of the GDP for Boulevard One is the result of some several dozen meetings over a period of about five years. And I want to assure you that it was the most intensive planning process that has occurred in all of Lowry.'",
        "'speaker_7': 'The result of the one of the results of the GDP was a significant modification that Hillary mentioned earlier, some 60 different changes. The application before you this evening is in full conformance with the GDP. And I would like to encourage your support.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you. Our last eight speakers are the following. Troy Moore. Adam Sexton, Don Home. Rick. Jeff Willis, Marcus Bochner, Virginia White, John D Rungs and Kevin Yoshida.'",
        "'speaker_4': 'Hello.'",
        "'speaker_1': 'Good evening. Council members. Madam President, my name is Troy Moore. I live at 507 Magnolia Street in Mayfair Park. I kind of come to you tonight wearing three hats. One, I am the Mayfair Park Kano president. I am also the Jaden Court and Lowry president, and I'm also an investor in the Lowry area.'",
        "'speaker_1': 'I want to start by saying that we absolutely support this zoning request. It's very, very important to keep this momentum going. The hard work done by all the staff, including the CAC committee, Monte Hillary, the past city council members, everybody who has led up to this point now is very, very important.'",
        "'speaker_1': 'We must not look back. We must continue to go forward. I understand that we have a lot of opponents that are worried, nervous, scared. I believe that a lot of that will work out itself once this development is constructed, as did the original Lowry area.'",
        "'speaker_1': 'It's a beautiful community. We welcome what is going on now. Just so you know, our neighborhoods connect directly with this new development of Boulevard One. Before, we used to look at a berm on First Avenue, and now we have streets that actually connect.'",
        "'speaker_1': 'And with that, we want to embrace our new neighbors. We are very happy for this diversity that's going to be happening to the south of us. It is enhanced our neighborhood to an incredible excitement of new construction folks wanting to come in and purchase older homes and remodel, add on great build new ones.'",
        "'speaker_1': 'And this is the type of activity that Denver is promoting. And we love it. We want to welcome our streets. We want folks to use them. They all belong to the city. We are not a gated or walled community.'",
        "'speaker_1': 'We welcome everyone and I want to thank every one of you, city council members and the ones that are departing. Thank you for your tenure. Thank you for your hard work. It is not an easy job what you do.'",
        "'speaker_1': 'I can hardly public speak and I can only imagine what you go home at night having to absorb with everyone. So thank you again very, very much and to all the staff member for the city and county of Denver.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_0': 'Next speaker, Adam Sexton.'",
        "'speaker_7': 'Good evening. Thank you for your time and for a very lengthy evening. I'm going to try to abbreviate my my way does it. It's just similar to what has been said. But my name is Adam Sexton. I live at 904 Spruce Court and Lowry.'",
        "'speaker_7': 'I'm here tonight in support of the rezoning application. I followed redevelopment and Lowry keenly as my job brought me there. In 2009, we brought a new school to Lowry Community, which is currently educating more than 650 students, more serving more than 450 families.'",
        "'speaker_7': 'And when we came to Lowry, there were about 300 students with the school last year, my wife, two children, age seven and four, and I moved to Lowry from Washington Park to be closer to the school, to work and to be in a community that we had admired for some time.'",
        "'speaker_7': 'I will say that there was trepidation in moving from a very old, established neighborhood like Washington Park to Lowry, but it has exceeded all expectations. We have we walk cycle to to school, to work dinner parks, library and couldn't be happier.'",
        "'speaker_7': 'And so I think Lowry is very unique. I don't think we should strive to be like other neighborhoods. I think there's character diversity. The mixed use makes Lowry a really special place, and there's a quality of life in Lowry that I think that Boulevard one will only enhance.'",
        "'speaker_7': 'And I do hope that you do pass this. Thank you very.'",
        "'speaker_0': 'Much. Thank you. Done. Can you pronounce your last name for me?'",
        "'speaker_10': 'Daniel. Daniel Hambrick.'",
        "'speaker_0': 'Oh, my goodness. Okay. Thank you so much.'",
        "'speaker_10': 'And good evening, counsel, and thank you for this evening. My name is Daniel Hambrick. My family and I live at 6400 East Fourth Avenue. We support the rezoning application as submitted by the LRA. I'm a business owner and a resident in East Denver.'",
        "'speaker_10': 'Although we live in Kress for most of our time is spent in Lowery. Our children go to Lowery. We work with the local businesses. We shop and eat there often. We truly enjoy what Lowery has offered and will continue to offer with this new phase.'",
        "'speaker_10': 'I strongly believe that this phase will complete the neighborhood. The proposed mixes, densities and combination of uses is exactly what this area of Denver needed. I feel LRE has taken into account everyone's opinions and concerns. The plan has been carefully balanced and we look forward to this project actually moving forward.'",
        "'speaker_10': 'Please support the application and thank you for your time.'",
        "'speaker_0': 'Thank you. Mr. Jeff Willis.'",
        "'speaker_1': 'Council members. Thank you. My name is Jeff Willis. I live at 364 Ash Street. I know you've had lots of comments tonight, so I promise to be brief. I am a resident of the near nearby hilltop neighborhood and I'm also president of Berkeley Homes.'",
        "'speaker_1': 'Berkeley Homes is a privately held Colorado homebuilder. We've been building in the Denver metro area for over 30 years. We built in Lowry's East Park neighborhood and have just started construction on homes and Boulevard one. We have recently begun meeting with potential homebuyers and one of the aspects that is particularly attractive to them about Boulevard one is'",
        "'speaker_1': 'the mixed use component of the neighborhood. They want to be able to leave their cars at home and walk to shops and restaurants. This includes buyers of all types and demographics, from singles to families to empty nesters. The lower community and the Lowry Redevelopment Authority have been very successful over the past two decades in creating a wonderful'",
        "'speaker_1': ', vibrant community that integrates mixed housing types, whether it's single family homes, townhouses, condos or apartments, with opportunities for residents and others to work, shop and eat. As a nearby resident and as a builder within Boulevard One, I am in support of the CMA s five zoning request and encourage the City Council to pass the zoning application this'",
        "'speaker_1': 'evening. I believe it is fully within the character and use of the existing and future Lowry neighborhood. This will be a great amenity to an already great community. Once again, thank you for your time.'",
        "'speaker_0': 'Thank you. Our next speaker, Marcus Portner. You have 6 minutes.'",
        "'speaker_1': 'Good evening. Council President. Council members. My name is Marcus Bochner. I'm in her office at 72/91 Avenue in Lowery. I'm a consultant to the Lowery Development Authority. I live in Hilltop and also office in Lowery. I am here to say it's an honor to present to the duly elected member city council.'",
        "'speaker_1': 'We appreciate your support and listening to this long hearing. I have been asked as one of the final speakers in support of this application to summarize the 60 plus meetings that we've had on this project, the over 140 letters of support that were sent in, and the 25 speakers that have spoken tonight.'",
        "'speaker_1': 'This image that is in front of you is an image of Lowery, and you don't have to see. It's the entire 1800 of acres of Lowery. And all of those piece of papers represent individual rezonings that have been filed on this site.'",
        "'speaker_1': 'These are the 6061 rezoning applications that have effectuated the creation of this great neighborhood. It represents hundreds and hundreds of community meetings and the collaboration through a very tried and true process of 20 plus years of a CAC, a board and voluntary community input into this process.'",
        "'speaker_1': 'Finally, this image is more illustrative of an area of change than words could ever describe. These 61 rezoning applications the comprehensive plan, the blueprint, Denver. They are the basis of this application. On top of that base, LRA was asked to do a multi-year planning process that resulted in a general development plan that was unanimously approved by Denver'",
        "'speaker_1': 'City Council. From there, we have already done three. Zoning is approved by this summer City Council for Boulevard one, and this application was approved unanimously by Planning Board one month ago. In addition, I think the one thing that I just want to bring back to what we're focusing on tonight is what's right before you.'",
        "'speaker_1': 'Remarkably, we have all agreed, I think all the speakers have agreed that mixed use and a mix of uses at this site is appropriate. There has definitely been some discussion about the the height, what should be here. Some have said it should be lower than five heights.'",
        "'speaker_1': 'But everybody has come back to a mixed use. We believe five stories is entirely appropriate. Immediately across the street is a 60 foot office building and there is be three zoning and Cemex eight is at the Lowry at the hangar.'",
        "'speaker_1': 'This urban context zoning is already in. LOWRY This is not the beachhead. It is already in. Lowry. So I think the one thing to remember, when you have a five storey mixed use zone district, there are only two contexts.'",
        "'speaker_1': 'It's in the code. There are only two contexts for a five story mixed use, suburban or urban. This is not a suburban project. We are developing 70 acres of infill urban development. In many ways we are creating the context.'",
        "'speaker_1': 'We believe this is the right zoned district. Finally, and I will say, I think this is the first 3 minutes. Is that right? Sorry. I think that it's important to go back through that. This 70 acre site is urban context.'",
        "'speaker_1': 'Suburban context has the street, then a sea of parking surface lots and then the building. That's not what we're trying to create here. It's not what this Denver City Council in this city has worked so hard to create in successful mixed use projects.'",
        "'speaker_1': 'We are emulating this growth and the proper urban form and thus we believe that urban center is the right zoned district for this site and help effectuate the vision we have for Boulevard One. Lastly, in closing, I have to say beachhead is an interesting term for me for a former Lowry Air Force base, that the term was'",
        "'speaker_1': 'used a number of times tonight. But I think in many ways it was used as a precedent. This will be precedent setting. We have said it, and I'm sorry if we've said it too many times. 61 Zoning the comm plan blueprint.'",
        "'speaker_1': 'Denver, the GDP. That's the precedent. That's what's in front of you. This is the last, almost last zoning that says entire site and then it will be built out. Nobody's coming back to rezone other areas. This is the development and we will turn and transition to an area of stability.'",
        "'speaker_1': 'With all of that, I will say this is the gathering place. This is the heart of Boulevard One. We respectfully request your support for this rezoning. Thank you very much.'",
        "'speaker_0': 'Thank you. Virginia White, followed by John DeRose and our final speaker will be Kevin Yoshida. Hi. My name is Virginia White. I live at 255 South Kearny Street. And I'll keep this brief because I think I'll get home early tonight.'",
        "'speaker_0': 'Considering the last meeting, uh, the folks from the redevelopment agency stated that the Transportation Development had no comments. Did they consider the impact of all the developments that are going up? Build and transportation will follow is putting the cart before the horse.'",
        "'speaker_0': 'Please, I ask you to please oppose this. Thank you. Thank you. Ms.. White.'",
        "'speaker_4': 'John Tyrone's.'",
        "'speaker_1': 'Good evening, John. Drugs. I live at 40 Kearny Street, west of the proposed rezoning, and I thank you for listening. I was first involved in the community outreach for this eight years ago, a process that had its ups and downs.'",
        "'speaker_1': 'Citizens from all over the area packed places and could get a seat. The community weighed in at that time and they were less than satisfied. I will say that I asked Mr. Force what what happened to this? Because this is what the community thought they were getting after the process that went on for over a year and'",
        "'speaker_1': 'several meetings and there was tons of participation. And nobody's here now. Who is involved for the most part. And I think that's because they were worn down because they didn't they didn't see this after the Air Force wasn't involved anymore.'",
        "'speaker_1': 'The Air Force required that the community get together and weigh in. And we did. And Marty, I don't know where I don't know where we went with this.'",
        "'speaker_0': 'Can you address.'",
        "'speaker_1': 'I want to I want to stress that like people have said, we we have no quarrel with nor do members of the community have any quarrel with a mixture of land uses this location. That's why some of these sketches that were made reflected what was going to be what was going to happen.'",
        "'speaker_1': 'It was not five storey urban core. Marcus. Describe this perfectly that. We have. Ah, they have proposed to have an urban center. That's what the zoning is. Urban center land in this area, in a suburban area. Just a month ago, rezoning for the Crest Moore Project was approved.'",
        "'speaker_1': 'It was a suburban context. This Lowry's across the street. The thing is, that boulevard one is not Lowry. It is not. Lowry. It was. Lowry was conceived when the base closed. And then all of a sudden we had a closed finance center.'",
        "'speaker_1': 'And we had a Lowry Town Center that was where the density was confined to. That's where the original buildings were. It made perfect sense. Now we no longer will have a town center. What we have is activity moving out of the town center onto this 70 acres.'",
        "'speaker_1': 'I just. I hope for the best for Lowry as a result of this. Please deny it. Thank you.'",
        "'speaker_0': 'Thank you. Our final speaker is Kevin Yoshida.'",
        "'speaker_1': 'Thank you. My name is Kevin Yoshida.'",
        "'speaker_8': 'I'm an architect and consultant to the Library Redevelopment Authority. I'm also.'",
        "'speaker_7': 'An architect that serves on the Larry Lowry Design.'",
        "'speaker_1': 'Review Committee. And just wanted to make a few points about continuity, the foundations of what you approve here tonight. The LRA has always been great stewards.'",
        "'speaker_7': 'Of those conversations and maintained design consultants that that work with the decisions made here through the design review process, through the design guidelines and apply best practices throughout all the execution of the rest of the project. I'm here obviously in favor of the rezoning and just want to thank you and and express my appreciation for your leadership'",
        "'speaker_7': 'in responsible growth in the city and to balance those conversations that voice concern and fear in favor of the active, vibrant city that is envisioned by many of its residents and this body. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of council. Councilwoman Kennish.'",
        "'speaker_6': 'Thank you. Madam President, I was hoping that someone could and probably the staff, but perhaps the the Redevelopment Authority explained to me more about the waivers. So, for example, pieces of our code in some some zone districts include step backs, you know, to protect the street edge.'",
        "'speaker_6': 'And I was just curious if you could say more about the origination of the waivers, and is that because it's an entire building that's height is limited versus versus just the first few floors in terms of the.'",
        "'speaker_0': 'The waivers are proposed on First Avenue and put back in those specific areas. There is a legal description for those areas and there are 30 feet wide. So from the property line, back 30 feet, the height will be 45 feet and three stories.'",
        "'speaker_0': 'So that could be a building that could be a portion of a building, but the height will be 45 feet. And three stories for those portions. And I don't know if is that getting you.'",
        "'speaker_6': 'Described what the waiver is. I wanted to understand better its origins and why it's necessary as compared to what what the edge of the buildings are required to be under the zone district on itself. Like are there step backs in the zone district that would have applied so.'",
        "'speaker_6': 'So if someone can just help me understand the origin and, and evolution.'",
        "'speaker_0': 'You can talk about the origin and health and the condition. Would you like? Mr..'",
        "'speaker_6': 'Yes, that would be great.'",
        "'speaker_0': 'My understanding is the origin was the GDP. Okay. Through that public process.'",
        "'speaker_6': 'I would like to hear from the development authority. That would be helpful. Thank you. Thank you, Madam President.'",
        "'speaker_8': 'As we were developing the heights on Boulevard One, the original plans called for taller buildings. And we have now, in fact, at one point there were 12 storeys and they went to eight and then went to five. But then trying to respect the edges adjacent to neighborhoods, we said, let's limit further.'",
        "'speaker_8': 'Two, three stories in the way we did. That is by doing a step down from the five stories to the three stories on the edge. Is that.'",
        "'speaker_6': 'Right? So so was it a result of process or. Yes. It wasn't the original proposal.'",
        "'speaker_8': 'It wasn't in the original proposal.'",
        "'speaker_6': 'Okay. So it was the result of a process? Yes. And then my second question, Madam President, if I may, is also for the Redevelopment Authority. We had some speakers ask about why 18 acres for only 400 units of apartments.'",
        "'speaker_6': 'But I wanted to ask you that that question. Why is 18 acres necessary? And is it just apartments that are going in this area?'",
        "'speaker_8': 'No, we need 18 acres. Again, the entire 18 acres will not be five stories, but we can't today tell you exactly where a five storey building will be versus a three storey building. And it is mixed use. It is not just apartments, it is commercial as well.'",
        "'speaker_8': 'Retail primarily. There might be some office, but primarily the retail. We have a limitation on apartments of 450. In our plan, the a portion of the site is already set aside for what's called the Buckley Annex Housing Consortium, which is building affordable rentals.'",
        "'speaker_8': 'That is not on this parcel, which is 80 units. So the most you could have in apartments on this site would be 370 if we put all of the apartments on the site. But basically we need the flexibility to create the different buildings and the forms in accordance with the code, but not having necessarily the entirety.'",
        "'speaker_8': 'The site is five stories.'",
        "'speaker_6': 'Great things. And my last question, I was just looking at the image on page seven. I don't have it's hard to go back to the presentation. I think the GDP picture was in there. But is is the rebuilding of a street grid part of this overall site in terms of internal transportation?'",
        "'speaker_6': 'Yes. For dealing north and south.'",
        "'speaker_8': 'Right. There's there's it's limited in what we can do because the grid on the outside of the site is limited on the south side. In fact, there's there's no ability to connect to the south side. But to the north side, we have connected at every opportunity where there's an existing street as well to the east and west'",
        "'speaker_6': '. Great. Thank you, Madam President. Those are my questions.'",
        "'speaker_0': 'Thank you. Councilwoman finished.'",
        "'speaker_4': 'Councilwoman Robb.'",
        "'speaker_6': 'Just a quick follow up on the height issue and money. I think you're probably the person to address it in the points that you made. Sort of summing up how this matches the law revision. You said that the 65 feet was or 4 to 5 stories was similar to the rest of Lowery.'",
        "'speaker_6': 'However, we're hearing and testimony tonight that that's not the case. Can you expand a little bit on that? Are there. I did hear Marcus say there were CMCs eight for the hangar. But, you know, where is there other comparable height on Mallory?'",
        "'speaker_8': 'The the heights of six is six feet in the design guidelines for legacy Lowery. And at the time we were going through that process, the architects and consultants that we had working with us said five additional feet, 60 to 65 would accommodate a lot of different building forms that were being precluded from 60 feet, which was previously'",
        "'speaker_8': '. So we put together a proposal in the redevelopment plan, and then following in the GDP, we said 65 feet. The new code wasn't even in place at the time. We came up with 65 feet. But to honor the 65 feet that we said we would not go beyond is why we asked for the waiver from 70 to'",
        "'speaker_8': '65. There are buildings directly across the street, one office building that's 63 feet. I believe that's directly across the street. There are buildings off site of Lowry, the Lex, an apartment building, seven story buildings. I'm not sure what their height is, but it's probably in the 70 foot range.'",
        "'speaker_6': 'Okay. Thank you. That was that was very thorough. Madam President, I'd like to explore a little bit what constitutes a city plan. And don't go so far, Monty. You might be the right person, though. I bet there are a lot of people in the room who can answer this.'",
        "'speaker_6': 'Remind me how the LRA board is appointed. As I recall, the mayor appoints the members and council confirms them. Am I correct? Okay. You probably want to go back to the mic and. And how is the CAC chosen?'",
        "'speaker_6': 'Is it still in existence? I was familiar with it when I worked in District five.'",
        "'speaker_8': 'Yes, it's still in existence and is also mayoral appointees both by the city of Denver and Aurora.'",
        "'speaker_6': 'And both groups were involved in the Berkeley Annex redevelopment plan, which was the basis of the GDP. Yes. Okay. And then if I could ask the city attorney, maybe, Karen, analysts, in terms of our responsibilities in determining determining conformance to city plans, how how should we be interpreting that?'",
        "'speaker_6': 'Because we've heard varying testimony today legally.'",
        "'speaker_9': 'Karen Harvey Velis with the city attorney's office legally adopted plans includes not only the comprehensive plan blueprint, Denver, the transportation plan, but also plans adopted by various agencies. And this case, it also includes a general development plan which was enabled by the own zoning code and approved by the planning board.'",
        "'speaker_8': 'So all of those are plans adopted by the city.'",
        "'speaker_6': 'And as I recall, through city ordinance zoning and even prior to that it was city council while I served on it that gave the planning board the ability to approve general development plans.'",
        "'speaker_0': 'That's correct.'",
        "'speaker_9': 'The planning board in a lot of instances now and then before that, the DRC had the approval of city council or had the authority from city council to adopt general development plans.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Rob. Councilman Brooks.'",
        "'speaker_12': 'Thank you, Madam President. Actually, my Colfax sister.'",
        "'speaker_10': 'Just answered or asked my question around.'",
        "'speaker_12': 'The GDP. So thank you, Karen, for answering that.'",
        "'speaker_0': 'Thank you, Councilwoman Lehman, followed by Councilman Fox.'",
        "'speaker_5': 'I would I don't I'm not sure anybody here can answer my question. But my question is, I would like to know from public works how the city will deal with the impact of the increasing traffic as a result of this development.'",
        "'speaker_5': 'Hi. Angelica Casey is with Denver Public Works and the developer has worked with our traffic engineering division. We did.'",
        "'speaker_6': 'We completed an analysis and.'",
        "'speaker_4': 'Study.'",
        "'speaker_5': 'And found that there would be additional trips added to this area, but it would not be anything that.'",
        "'speaker_4': 'The current configuration wouldn't be able to handle.'",
        "'speaker_0': 'Thank you. Councilman Lehman was your. That's answered. Thank you. Councilman Fats, followed by Councilman Brown.'",
        "'speaker_5': 'Thank you, Madam President. I need a refresher course, and I don't. Of the developer, Theresa would be the one to give it to me. I need help and some of the emails that I received. There were discussions about inadequate parking, and I need to be reminded what the city minimum is and why this point there referred to'",
        "'speaker_5': 'a .75 why that I why I should look upon that as good.'",
        "'speaker_8': 'There was concerns about the new zoning code and the ratios of parking being too low for this location. And we at one point had actually put waivers in the zoning application to raise the parking ratios in this zoning application.'",
        "'speaker_8': 'But the planning department didn't feel it was appropriate type of waiver in this case. So what we did as the developer is incorporate parking standards into our design guidelines that are compatible with the previous zoning code. For instance, in apartments under the CM five, I think the ratio would be .75 per unit and our design guidelines require'",
        "'speaker_8': '1.5 spaces.'",
        "'speaker_5': 'If I may clarify then, Madam President, you are planning to build the 1.5?'",
        "'speaker_8': 'That is correct.'",
        "'speaker_5': 'Thank you. That's that's good news.'",
        "'speaker_0': 'Thank you. Councilman Potts, Councilman Brown.'",
        "'speaker_1': 'Thank you, Madam President.'",
        "'speaker_7': 'Monte questioned the number 30 speaker next to the last speaker, turned to you and said that this is not Larry. He's an opponent. And then another opponent held up this rendering, this seven year old rendering, saying that this.'",
        "'speaker_7': 'Was, I presume, what it was supposed to look like. So we have to the opponents are kind of confusing their message tonight. And can you help clarify, especially the one that turned to you and said that this side is not?'",
        "'speaker_8': 'Larry, I don't I don't have the image that you're referring to. So if you could see it. But this is still what we were planning. This is an image from our redevelopment plan on the community park area, which indeed is still the plan and vision that we have for this site.'",
        "'speaker_7': 'Okay. And how about the charge that this is not Lowry that decided it's Lowry?'",
        "'speaker_8': 'I mean, I don't know how else to respond. As I started my comments tonight, we have comparable density to other areas of. Lowry We have comparable and it's the same parking ratios. The traffic generated on this site is the same traffic that would been generated on the site when it was the DFS Center and had 3000 employees'",
        "'speaker_8': 'on the site. It has comparable heights in the town center area. We have 60 foot tall buildings and we're seeing 65 foot buildings here, not the entirety of the site. We ratchet down the heights of the buildings on the perimeter adjacent to neighborhoods that are either single family detached or attached.'",
        "'speaker_8': 'So I would say it is Lowry is a continuation of what we started at Lowry and intend to finish.'",
        "'speaker_1': 'Great. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Brown, Councilman Kennish.'",
        "'speaker_6': 'Thank you. Councilman Brown reminded me of a question I forgot to ask, which was about the density. You know, there is this mention of 11 per acre and but I guess the question is, is that for the entire Buckley Annex site, it's an average.'",
        "'speaker_6': 'It's not that no single acre will exceed 11. So can you clarify what that how how much of the site that applies to you and whether it applies to every single spot in the site or whether it is an average.'",
        "'speaker_8': 'It's an average of the entirety of 800 units on the entirety of the site. So obviously there will be parcels that have higher density than 11. But we also are already building single family detached homes that have much lower density than 11.'",
        "'speaker_6': 'Okay, great. Thank you for clarifying that.'",
        "'speaker_0': 'Thank you. Are there any more questions from members of council? CNN. The public hearing for council bill 345 is closed. Comments by members of council. Hill from assessment.'",
        "'speaker_4': 'Thank you. Thank you, Madam President. I thank my council fellow council people for all the good questions that you asked. I thought they were right on point and glad to clear up a lot of things. And I this was a little bit of a trip back in time because I started working on Lowry two years before the'",
        "'speaker_4': 'Lowry Redevelopment Authority was formed. I, too, started when Pat Schroeder was in office. And I want to thank my cohorts, Mary Nell Wolf and Kathleen Ruby and Brian Wert, as a speaker mentioned that people were gone because they were tired of it.'",
        "'speaker_4': 'These people have never gotten tired of it because they are still working very hard to make sure that the this development is is something that we can be proud of. When I when we were first working on the Lowry base conversion in the nineties, we it was a very scary thing.'",
        "'speaker_4': 'And I think that was that was well said by I think it was Kathleen that said that it was very scary. And there were folks who said, we don't want anything here, and there's going to be a lot of traffic and let's put a fence up and just make a park out of it.'",
        "'speaker_4': 'But we had there was a concept working its way through a city planning literature called New Urbanism. We didn't know what that was, but it was New Urbanism, but sort of a new old urbanism that recommended that we once again develop embedded commercial areas in our residential zones like our original cities.'",
        "'speaker_4': 'Had Denver had them and has them dotted all over our residential areas, although many went away in the fifties and two seventies when there was an idea to completely separate residential areas from commercial areas. But you are very familiar with the ones remaining the South Pearl Street, South Gaylord Street, 22nd and Kearny.'",
        "'speaker_4': 'And there's one just up just a block from me in Hilltop. And now we know that having those amenities among in a residential area is good for us. It produces opportunities for not only people to walk some of the time and maybe not use their cars so much.'",
        "'speaker_4': 'But even more importantly, it creates a sense of community. It is a way for people to keep eyes on the street, to meet each other on their way to and fro, and to create community when they are there.'",
        "'speaker_4': 'And it was a tough it was a tough sell at the time. And thankfully, we had great city planners at the time. But we see how it is worked and how Lowry has become one of the most favorite places of the people in Denver and certainly the people who did move there.'",
        "'speaker_4': 'Two weeks ago, I voted against the building of a multi-unit structure just in Chris Chris Moore Park. That's because I thought it didn't fit there. I still don't think it fits there. But more importantly, the neighborhood had been designated as an area of stability.'",
        "'speaker_4': 'As described in Blueprint, Denver zoning rules went through a very public process, and I felt there was an interpretation that made me feel like we should remain faithful to that public process that created the zoning rules in the first place.'",
        "'speaker_4': 'I am going to ask my fellow council people to vote for this rezoning tonight, because this zoning is in an area of change. And so my point of view is still consistent with the notion that this is what a public process that created the zoning that we have says.'",
        "'speaker_4': 'And this is an area of change. I think it was well demonstrated that they've had 61 rezonings in the last 15 years. And so obviously it's an area of change. And we also had someone say that we should maybe delay this for two more weeks or so.'",
        "'speaker_4': 'You heard that the plan began in 2007, and that's eight years ago. And there are people on this council who were part of that process, and there are citizens that were part of that process and have been a part of that process.'",
        "'speaker_4': 'And I think eight years is plenty long of a time to come to some conclusion about some zoning. And I don't know what two more weeks would do. Also that there are many council people here. I did like Councilwoman Foster's notion that Councilwoman Ortega was here at the at the beginning and Councilman Brown was here at the'",
        "'speaker_4': 'beginning. And so and I can't remember it was Councilwoman Fox, perhaps two people who have grown grown up with this project and know a lot about it and know a lot about the feeling about it. I think the plan is very sensitive to the adjacent neighborhoods.'",
        "'speaker_4': 'I don't think that came out very clearly. I had considered asking a question about it, but I thought, I know the answer, so why ask the question? Park Heights is a single family neighborhood. The homes that are going to go up against Park Heights are single family homes.'",
        "'speaker_4': 'Mayfair Park is single family home, neighborhood. The heart, the buildings that are going to go up against Mayfair Park are single family homes. On Quebec. There is a town center across the street and some office buildings. It's true.'",
        "'speaker_4': 'Down south there's a few single family homes. They're much farther back. They're putting the town center on the area that is across from the town center and across from some office buildings. And on the Crest Moore side, which has a park and then single family homes, they're putting single family homes.'",
        "'speaker_4': 'And the the higher, more dense areas are in the middle. Someone suggested that they're going to put five storey homes all along, a five storey building saw along Quebec. The waivers create three storey buildings along Quebec. It's very important that people get the right information.'",
        "'speaker_4': 'I've been a little distressed with some of the wrong information that has been going around. So those are just some of my thoughts about this project. I'm thinking this will be the last zoning of Lowry and because I don't think we have any more property left at Lowry to rezone.'",
        "'speaker_4': 'And I urge my fellow council people to vote for this rezoning.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Councilwoman Robb.'",
        "'speaker_6': 'Thank you. Madam President, I was thinking that maybe I could just be quiet tonight and listen. And I will say that Councilwoman Sussman made a very good case, but we were somewhat challenged, I believe, by testimony, to consider this in a quasi judicial way.'",
        "'speaker_6': 'So I want to go on record saying that I believe there are changing conditions in this rezoning. In an area of change, a major employer left the area and further that major employer generated as many traffic trips. If I understood the staff report as the new development, will I see this as consistent with the Lowrey vision, with'",
        "'speaker_6': 'the comp plan, with Blueprint Denver? It indeed is not like a rezoning we heard a few weeks ago. I had some question about the height I thought I'd go to. I got a fair answer again in terms of the plan.'",
        "'speaker_6': 'The illustration that that was presented that morning force looked at it. Councilman Brown's request shows five stories, it looks.'",
        "'speaker_0': 'Like to be along the.'",
        "'speaker_6': 'Park in three stories along Quebec. And it looks like the crescent in Bath, England, to me, with the building sort of right around the park. So that's my quasi judicial thinking on it, in the way I'm going to be making my decision in supporting this.'",
        "'speaker_6': 'But I would also like to take a little privilege as the representative for Cherry Creek.'",
        "'speaker_4': 'To say that this.'",
        "'speaker_6': 'Is not Cherry Creek. You are talking about 800 units on 70, 70 acres. We haven't had a rezoning in the numerous controversial rezonings I've had in front of this council in Cherry Creek on more than an acre. And you add them all up and you might get eight acres, and that's an exaggeration.'",
        "'speaker_6': 'So I did not find that a persuasive argument. I agreed with Rachel Neumann and Jamie Fogel on that one. And by the way, let me in my remarks it say in that same list of top five Denver neighborhoods and 50 to 80, Cherry Creek was number three.'",
        "'speaker_6': 'So if we do this rezoning, maybe Lowry can stay at number five.'",
        "'speaker_0': 'Thank you, Councilwoman Robb. Councilman Ortega. Thank you, Madam President. First, I want to thank all of the residents, neighbors for coming out tonight and for all of the letters and emails that we've received on this issue. One of the things that that I struggle with is the fact that we we have some developments that have come forward'",
        "'speaker_0': 'that include the waivers, yet others that have come before us, where they're they tell us we were discouraged or not allowed to include waivers. So to know tonight that we had waivers on the height, but not waivers on the parking.'",
        "'speaker_0': 'I don't understand that thinking of our planning department in, you know, picking and choosing when and who and where these waivers get to be included. And that makes it confusing for everybody. I think for the developers, it makes it confusing for the neighbors who are trying to ensure that the right kinds of things are, in fact, included'",
        "'speaker_0': 'in a zone change. So that's that's frustrating. I'm just expressing that frustration with the process. So we had eight people opposed that spoke tonight and 23 who spoke in favor. This is drastically different than the kind of feedback we got from the application we saw two weeks ago.'",
        "'speaker_0': 'I think this project is going to be an asset to this location. I think it will absolutely fill in a vacant site that, as everybody has indicated, is an area of change. And I appreciate the sensitivity that the Lowry Redevelopment Authority played in, you know, buffering the edges and reducing the height to make it more compatible with'",
        "'speaker_0': 'the adjacent areas that they, you know, buffer up next to. And I think this is going to be an overall good project for this location. So I will be supporting it tonight. Thank you. Thank you, Councilwoman Fox.'",
        "'speaker_5': 'Thank you, Madam President. There was a comment about the appropriateness of relying on the GDP. Just a question about how it fit in. I want to make it clear, as I state my preference, that no one plan was one that I relied on.'",
        "'speaker_5': 'The whole process, including the testimony tonight, was what I based my decision on. And the answer about the parking was very important to me. And so if there is a question that was alluded that that could be a legal question.'",
        "'speaker_5': 'I am not basing my vote on that. You all brought me the facts that I'm basing my vote on tonight, and I will be supporting it.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_4': 'Right.'",
        "'speaker_0': 'Madam Secretary, roll call, please.'",
        "'speaker_4': 'SUSSMAN Hi.'",
        "'speaker_1': 'BROOKS Hi. BROWN Hi.'",
        "'speaker_0': 'Fats.'",
        "'speaker_3': 'I carnage. Layman. Lopez Never. I. Ortega, I rob. I shepherd. Madam President.'",
        "'speaker_0': 'I. Madam Secretary closed the voting and announced the results.'",
        "'speaker_4': '12 Eyes.'",
        "'speaker_0': '12 Eyes Council Bill 345 has passed. Councilman Lopez, will you please please counsel Bill 346 on the floor.'",
        "'speaker_1': 'Thank you, Madam President. I move that council bill 346 series of 2015 be placed upon final consideration and do pass.'"
    ],
    "Rezones property located at 301 South Cherokee Street from I-B/UO-2 and C-MX-16/UO-2 to PUD/OU-2 in Council District 7. (NEIGHBORHOODS AND PLANNING) Rezones property located at 301 South Cherokee Street from I-B/UO-2 and C-MX-16/UO-2 to PUD/OU-2 in Council District 7. IF ORDERED PUBLISHED, A PUBLIC HEARING WILL BE HELD ON THIS ITEM.  REFER TO THE \"PENDING\" SECTION OF THE FUTURE COUNCIL MEETING AGENDAS FOR THE DATE. The Committee approved filing this bill at its meeting on 5-20-15.  ": [
        "'speaker_0': 'I need a second. Thank you. It has been moved and seconded. The public hearing for Council Bill 346 is open. May we have a staff report? Tourism. Sara With Community Planning and development, just getting the PowerPoint loaded. So this application is located at 301 South Cherokee.'",
        "'speaker_0': 'The proposal is to rezone the property from IP you oh two and CMA 1602 to PWD you 002 property is located in southwest Denver in the Baker Neighborhood Council District seven, near the directly adjacent to the Alameda station and the Broadway market place two blocks west of Broadway, two blocks east of I-25 and the Platte River.'",
        "'speaker_0': 'The property is 19,000 square feet or nearly half an acre. There is an existing general manufacturing use on the property. Councilman Nevitt is requesting rezoning of this property to restore the land used to conformity and to allow the business to expand.'",
        "'speaker_0': 'So again, the proposal is to rezone from IP you oh two and connect 16 year old to two PUD. You are to the scenic 16 zone district is the base zone district. These days when we do parties, we base the beauty on an existing zone district.'",
        "'speaker_0': 'So the Cinemark 16 is that district. The beauty changes that we make would add the manufacturing fabrication and assembly land use to the allowed land uses in the Puti would alter some building form standards on Alameda Avenue, a build to and it would change the build to from zero to 15 to 0 220 to accommodate the existing'",
        "'speaker_0': 'building and allows some existing parking to continue there. So we already talked a little bit in the last application about the urban center context. It is that mixed use, slightly denser area where we are seeing multi-unit, commercial and in this case industrial land uses.'",
        "'speaker_0': 'In this case the mixture is sort of horizontal rather than vertical. We've got a couple of five storey buildings on either side of this property that are responding to the TOD. But we have also area plans that say we want to hold on to this use.'",
        "'speaker_0': 'So it is truly a diverse mixed use area. So again, the current zoning is Cmmc 16 0202 is an overlay that allows billboards. This is part of the Denver Design District General Development Plan. There is a view plane from Washington Park that would limit heights here to actually about 6 to 7 storeys.'",
        "'speaker_0': 'There are four existing 1 to 2 storey structures on the property surrounding zoning. See them x five and see well see them x 16 in the Broadway marketplace industrial to the west along the railroad tracks, the x five is a five story residential property I was talking about a little earlier.'",
        "'speaker_0': 'Just to the south. In the CMC, 16 is another five story residential property under construction directly adjacent to the to the transit center. The land use isn't industrial, it's an existing business. Again, we're adjacent to the Alameda station, we're adjacent to Broadway Market Place and to TOD Multifamily.'",
        "'speaker_0': 'These are the photos of the area. The top right is alameda avenue on the north side. The red arrow is the buildings themselves. The bottom on the right is the Kmart. Across the street, the light rail station bottom left.'",
        "'speaker_0': 'The middle left is the five story residential to the south of the property. The top left is the five story residential directly across Alameda. This was seen at planning board a public hearing on May 6th at NAP committee on May 20th.'",
        "'speaker_0': 'And of course, today, the all of these public hearings were duly, duly notified by electronic notification and for planning board. And this hearing signs posted on the property the RINO's notified were the baker, his neighborhood association, Santa Fe Drive Redevelopment Corporation in her neighborhood cooperation.'",
        "'speaker_0': 'Denver urban resident. The Association and Denver Neighborhood Association. There have been no letters or public comments on this proposed rezoning. So the criteria, consistency with adopted plans, uniformity of district regulations, furthering the public health, safety and welfare. Justifying circumstances.'",
        "'speaker_0': 'Consistency with neighborhood context. And then there are some pretty review criteria. The relevant plans are a comprehensive plan. 2000 Blueprint Denver, the Baker Neighborhood Plan, the Alameda Station Area Plan, and the Denver Design District General Development Plan. All of this is is summarized in your staff report.'",
        "'speaker_0': 'I don't want to get into specific standards or every single one of these plans says hold on to this industrial. We are with this party trying to do two things, which is why it ended up a party. We're trying to encourage tod development in this site that's directly adjacent to a TOD station, but also to hold on'",
        "'speaker_0': 'to existing employment and an existing business that are city policies in our plans tell us we want to hold on to. So that's what all of these plans are saying. Redevelop high density housing. But a hold on to that employment center.'",
        "'speaker_0': 'The station area plan calls for it to be employment. The GDP says existing industrial. We're holding on to that in this area of this sub area of the GDP. So staff believes this proposal is consistent with the adopted plans that by basing our Pudi on an existing zone district, we are not affecting the uniformity of district regulations'",
        "'speaker_0': 'as the majority of the standards will be c IMX 16 standards. And that by planning this rezoning, according to our adopted plans, we are furthering the public health, safety and welfare. Justifying circumstances on this one is also changed conditions.'",
        "'speaker_0': 'We are trying to accommodate the change at the transit oriented development, but also hold on to an existing land use. So we do believe that the changed conditions has been met. We did talk a little earlier about the neighborhood context, the urban center neighborhood context that we believe this this area meets and the zone district purpose and'",
        "'speaker_0': 'intent. The main pretty criteria that staff looks at is unique and extraordinary circumstances. We believe that this is a unique circumstance where we are trying to accommodate the TOD as well as an existing industrial development. So we believe the PD criteria are met and with that, staff recommends approval.'",
        "'speaker_0': 'Thank you. Thank you, Ms.. Lucero. Madam Secretary, how many speakers do we have signed up this evening? None. We have no speakers. So let's go to questions from members of council. First up is Councilman Ortega, followed by Councilman Kennish.'",
        "'speaker_0': 'Thank you, Madam President. I'm just trying to understand. So this is an existing operating business that's been there for how long? Over 35 years. Okay. So as zoning got changed in 2010, it's been a consistently operating business. So has been they they're grandfathered in.'",
        "'speaker_0': 'But under the CMA zoning, it didn't factor in that they became non-conforming. And the business license to expand, they can't expand. That's exactly right. There should be some other way than having to go through a whole rezoning process.'",
        "'speaker_0': 'But I appreciate the fact that Councilman Nevitt is the applicant as opposed to making the owner be the applicant for this. So I appreciate that. I was just trying to understand what do they manufacture their pharmaceuticals? Okay. All right.'",
        "'speaker_0': 'Thank you. Clearly, this is not an incompatible industrial use with residential. So one of the things that I didn't say that I maybe should say is the definition of this general manufacturing land use is that it doesn't require toxic, hazardous or explosive materials or produce them.'",
        "'speaker_0': 'So it is an operation that has little noise, odor, vibration, glare, pollution and therefore minimal impact on surrounding properties. That's the definition of general manufacturing and the zoning code. Okay. Thank you, Theresa Hilton. In fact, I'm sorry, Councilman Kinney.'",
        "'speaker_1': 'There often.'",
        "'speaker_6': 'You know, we're on the mind of. Thank you, Madam President. Just one quick question. Why not? I am ex zoning.'",
        "'speaker_0': 'We started at IMX, but the IMX didn't really accommodate the Todd next door, so we sort of found ourselves.'",
        "'speaker_6': 'Just one observation. I don't think we got the IMX zoning right. We generally it hasn't benefit for almost any manufacturer. It's limited some of the types of manufacturing that I think truthfully are compatible. And so we may we need to look at that further because we continue to not use it for use.'",
        "'speaker_6': 'Is that it by name, industrial mixed use should be appropriate for us. So I think we need to work on that a little more. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Any other questions from members of council? See? None. The public hearing for counsel Bill 46 is closed. Comments by members of Council Health Benefit.'",
        "'speaker_1': 'Thank you, Madam President. As the Lord giveth so the Lord taketh away. You do have me to thank for the fact that we have a third public hearing tonight after the long public hearing. But you also have me to thank for the fact that there is not one single person here to testify.'",
        "'speaker_1': 'So I want to get some credit for that. Indeed, Councilwoman Ortega put her finger right on it. What we're doing here is really correcting an error of enthusiasm. Back in 2008, 2009, we did a station area plan and in conjunction with a general development plan there, there's a big landowner here that owns the vast bulk of Broadway'",
        "'speaker_1': 'marketplace. And we got very excited about the future of this site and wanting to, in the 2010 zoning code update, the new zoning code set the table for our station area plans. And so when we set the table for this area, we set it with CMCs 16.'",
        "'speaker_1': 'The only problem was that in the back and forth of the writing of the different C-Max districts, the s m district manufacturing isn't allowed. Use the e m x. The manufacturing isn't allowed. Use the U.S. manufacturing allowed used not in the CMCs.'",
        "'speaker_1': 'And so we inadvertently zoned to a non-conforming use this pharmaceutical manufacturer. That would all be okay if they didn't want to make some changes to their building. And so they find themselves in a in a, in a pinch that was not of their own making.'",
        "'speaker_1': 'And so we're correcting it here. We're still leaving the table set for the ambitions that we have for this site, but we're allowing this high quality manufacturing good employer to remain there and do what they need to do to.'",
        "'speaker_1': 'Be successful for as long as they can be there. So. Thanks very much.'",
        "'speaker_0': 'Thank you. Councilman Levitt, Councilman Brooks?'",
        "'speaker_12': 'Yeah. Just 2 seconds, Madam President. Just want to thank Councilman Nevitt for his problem solving ability in getting this done. And, you know, I want to say to this council who's been receiving a lot of criticism in the media and even tonight that none of you are lame and none of your ducks.'",
        "'speaker_1': 'I am very grateful to.'",
        "'speaker_12': 'Be serving with you. And thank you.'",
        "'speaker_1': 'For your incredible hard work on this council. Thank you.'",
        "'speaker_0': 'Oh, thank you. All right. Madam Secretary, roll call, please, on council. Bill three, 4 seconds.'",
        "'speaker_3': 'Councilwoman Shepard.'",
        "'speaker_4': 'Oh, I just said. Oh, I.'",
        "'speaker_0': 'Just saw you. I'm sorry. Thank you.'",
        "'speaker_4': 'WOMAN Brooks. Thank you so much. I know council president pro tem just said it, but I wanted to say to thank you.'",
        "'speaker_0': 'Oh, God. Are you back in the queue?'",
        "'speaker_1': 'Yeah, I just. I just want to ask one question of Kelly Valez, and that is whether this was the shortest rezoning in history.'",
        "'speaker_3': 'Pretty sure. Yeah.'",
        "'speaker_13': 'Man.'",
        "'speaker_1': 'Guy looks skeptical. It won't be if you keep talking.'",
        "'speaker_0': 'All right. Are we ready to vote?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Okay. Madam Secretary, roll call on Council Bill 346.'",
        "'speaker_3': 'NEVITT Hi. Ortega. Hi, Rob Shepherd.'",
        "'speaker_4': 'I.'",
        "'speaker_3': 'Brooks Brown. I forgot. I can reach Lehman. Hi, Lopez.'",
        "'speaker_1': 'Hi.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '11 eyes. We have.'",
        "'speaker_0': '11 eyes. Council Bill 346 has passed. On Monday, July 27th, there will be a required public hearing on Council Bill 385, changing the zoning classification for 3540 East 31st Avenue. Any protests against Council Bill 385 must be filed with the council offices no later than Monday, July 20th.'",
        "'speaker_0': 'See no other business before this body? This meeting is adjourned.'",
        "'speaker_10': 'Denver eight. On TV and online. Stay connected to your community, your city, your source.'",
        "'speaker_4': 'You are watching Denver. Eight TV's Your City, your source.'",
        "'speaker_0': 'That concludes our speakers. Are there questions from.'",
        "'speaker_4': 'Members of council?'",
        "'speaker_0': 'Councilman Ortega. Thank you. Madam President, I would like to ask Colonel Dalton to come back to the microphone, please. Got a couple of questions for you. In my perusing of the document. I didn't see anything that deals with the.'",
        "'speaker_0': 'The whether there was discussion about. Continuing to do the general development plans the way they're being done now in in a wanted clarification on whether or not there's a size of a project that requires a general development plan.'",
        "'speaker_0': 'So can you can you speak to that?'",
        "'speaker_12': 'Sure. Yeah. So this text the moment does not propose any changes to the current general development plan rules. As I mentioned, the process.'"
    ]
}