{
    "A proclamation in observance of the Fifth Annual Indigenous Peoples Day in the City and County of Denver.": [
        "'speaker_0': 'Thank you, Madam Secretary. The communication has been received and filed. We have one proclamation being read this evening. Councilmember Torres, will you please read proclamation one one, three, one.'",
        "'speaker_4': 'Thank you. Council President in observance of the fifth annual Indigenous Peoples Day in the city and county of Denver. Whereas the city, the Council of the City and County of Denver recognizes that the indigenous peoples have lived and flourished on the lands known as the Americas since time immemorial, and that Denver and the surrounding communities are built'",
        "'speaker_4': 'upon the ancestral homelands of numerous indigenous tribes, including the southern ute and Ute mountain ute tribes of Colorado. And. Whereas, the tribal homelands and seasonal encampments of the Arapaho and Cheyenne peoples along the banks of the Cherry Creek and the South Platte River confluence gave bearing to future settlements that would become the birthplace of the Mile High'",
        "'speaker_4': 'City. And. Whereas, Colorado encompasses ancestral home lands of 48 tribes, and the city and county of Denver and surrounding communities are home to descendants of approximately 100 tribal nations. And. WHEREAS, on October 3rd, 2016, the Council of the City and County of Denver unanimously passed Council Bill 16, Dash 801, officially designating the second Monday of October of'",
        "'speaker_4': 'each year as Indigenous Peoples Day in Denver, Colorado. And. Whereas, the Council of the City and County of Denver continues to recognize and value the vast contributions made to the community through indigenous peoples knowledge of science, philosophy, arts and culture.'",
        "'speaker_4': 'And through these contributions, the City of Denver has developed and thrived. And. WHEREAS, the city and county of Denver all acknowledges that the role of women within the indigenous community is a sacred role and all encompassing and central role to the aspects of indigenous culture, life and knowledge, and is vital to the health, wellness and safety of'",
        "'speaker_4': 'indigenous communities. And. Whereas, many outstanding Indigenous women have organized, led, local and national proactive efforts addressing COVID 19 health and education, preparedness and response, missing and murdered Indigenous people, awareness and native specific homelessness advocacy. Now, therefore, be it proclaimed by the Council of the City and County of Denver that the Council celebrates and honors the cultural and'",
        "'speaker_4': 'foundational contributions of indigenous people to our history, past, present and future, and continues to promote the education of the Denver community in these historical and contemporary contributions of indigenous people of the city and county of Denver does hereby observe October 12th, 2020 as Indigenous Peoples Day, and that the Clerk in the city and county of Denver shall'",
        "'speaker_4': 'a test and affix a seal to this proclamation, and that a copy be transmitted to the Denver American Indian Commission and the Colorado Commission of Indian Affairs.'",
        "'speaker_0': 'Thank you, Councilmember Torres your motion to adopt.'",
        "'speaker_4': 'I move that proclamation 20 dash 1131 be adopted.'",
        "'speaker_3': 'Second, second.'",
        "'speaker_0': 'It has been moved. And second term I think we got. Councilman Hines and then Councilwoman Ortega in comments by members of council. Councilmember Torres.'",
        "'speaker_4': 'Thank you so much. Declaring the second Monday in October Indigenous Peoples Day was championed by my predecessor, now Clark Lopez, when he was on council. It is both about recognition and visibility, not just here in Denver, but nationally.'",
        "'speaker_4': 'Two years ago, this country elected the first indigenous women ever to Congress, and today an indigenous woman is running for office in Arizona. And she's shared something that I'd like to share with you. In her words, quote, My late grandmother, Katherine Jose Maria, was born here in Arizona in 1918.'",
        "'speaker_4': 'Although our people were here first, my grandma was not considered a U.S. citizen at her birth because she was awesome. She was not born with the right to vote in 1924, when my grandma was six years old. Congress passed legislation that granted Native Americans US citizenship but did not necessarily give them the right to vote.'",
        "'speaker_4': 'Voting laws were controlled by states and Arizona law explicitly denied natives that right. In 1939, she turned 21 the legal voting age, but was not allowed to cast a ballot in 1948 when she was 30 years old. To Fort McDowell.'",
        "'speaker_4': 'Yavapai tribal members and World War Two veterans attempted to register to vote in Maricopa County. After returning home from the war when they were denied, they sued the state for violating their constitutional rights. The Arizona Supreme Court agreed.'",
        "'speaker_4': 'In 1948, the decision in Harrison V Living finally guaranteed Native Americans the right to vote in Arizona. However, being given the right to vote did not mean that Native Americans were able to vote. State government workers, still US natives and other people of color to take literacy tests.'",
        "'speaker_4': 'Subjected them to intimidation tactics. Or simply denied them entry when they tried to cast a ballot. It wasn't until the rise of the civil rights movement and the resulting Voting Rights Act of 1965, that federal law finally protected my grandmother's ability to vote.'",
        "'speaker_4': 'It is my honor to present this proclamation this year and remind everyone in Denver that our ability to vote was and is hard fought for. Thank you so much, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Torres. And seen no other hands raised for comments by my colleagues. I want to acknowledge and thank you for bringing this forward and the many women families who have suffered for. Centuries. And us acknowledging what has transpired and setting the intention to do differently.'",
        "'speaker_0': 'I appreciate that. And we can just continue that work together and moving this forward. Thank you for the work on this and especially the land acknowledgment that I hope that we can start to incorporate into our meeting because words matter and the way in which we use those words matter and the consistency and the intent also matters'",
        "'speaker_0': '. And so thank you for for that and the initiative. Councilwoman. Madam Secretary, roll call.'",
        "'speaker_4': 'Torres. I.'",
        "'speaker_1': 'Black. I see tobacco.'",
        "'speaker_2': 'I. Clark.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Hands.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Cashman.'",
        "'speaker_2': 'I can reach.'",
        "'speaker_1': 'I. Ortega. I. Sandoval. I. Sawyer. I.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'",
        "'speaker_0': '13 Eyes. Proclamation 113. One has been adopted. We have 5 minutes for the proclamation. Acceptance Council member Torres will start the five minute timer. Would you please introduce who you'd like to bring up to accept this proclamation?'",
        "'speaker_4': 'Thank you. Council President I would like to introduce Dr. Christy Nelson. Dr. Nelson was recently organized an indigenous collective of community members via Zoom, social networking, focusing on education, community building and support, physical and mental wellbeing and response to the COVID 19 pandemic.'",
        "'speaker_4': 'She is an assistant professor at the Madrid College of Education at the University of Denver. Dr. Nelson blends critical theory and indigenous perspectives and methods to explore long term impacts of pre-college access programs. She strives to challenge the status quo of higher education for native students and their communities.'",
        "'speaker_4': 'I also welcome Danielle C Walker, who is a multitalented writer and artist who lives in the Green Valley Ranch community. She's an active member of the Denver American Indian Commission since 2019. This past July, she published her book Still Here A Past and A Past Present Insight of Native American People and Culture.'",
        "'speaker_4': 'And she was a featured artist at the Denver Mesa Art Museum Web page. Danielle is also the co-creator of the Red Road Project, an art and media project documenting words and visuals of inspiring and resilient stories of Native America.'",
        "'speaker_4': 'And they are both here. I see. They want to unmute. Hello. You have the floor for about 5 minutes.'",
        "'speaker_1': 'I will go first, Daniel, if you don't mind.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Ghazi. I am honored to be given the space to address the council and the audience in attendance today. I wanted to start by just doing a little bit of recognition in terms of the history of indigenous communities here in Denver.'",
        "'speaker_1': 'So in 1956, through the Indian Relocation Act, Denver was identified as one of those relocation sites through the Relocation Act. Young native folks were given the opportunity to seek education and job opportunities. However, this was a very systematized approach to dislocating and removing indigenous people from their traditional homelands as they gathered here in the now Denver area'",
        "'speaker_1': '. 60 years later, I'm very honored to know that Colorado Rises, which stands for Reclaiming Indigenous Spaces. Educational Sovereignty is really the epitome and the lived experiences of all of our past generations. I'm very honored to be able to have the space to honor the family that I have, the people that have taught me how to engage with'",
        "'speaker_1': 'our communities. And I'm so honored to be able to work with so many great folks across the state of New Mexico. I'm sorry, Colorado. Sorry. I'm from New Mexico. Again, I really do appreciate the space and time and again, I just passed this on to Danielle.'",
        "'speaker_1': 'And Chris wash day and Apache is a pro Honda and you'll see Walker immediately. Denver wanted my papa Lakota a Taha Standing Rock Sioux tribe. I greet you all from the bottom of my heart. My name is Daniel C Walker and I live here in Denver.'",
        "'speaker_1': 'I am from the Standing Rock Sioux tribe and am identify as Papa Lakota. I'm honored and humbled to be here with you all today. Our on to Indigenous Peoples Day as we acknowledge all of our indigenous communities in the nation.'",
        "'speaker_1': 'But I specifically wanted to address and acknowledge our missing and murdered indigenous women, girls and to spirited people. While violence plays, plagues many communities across the country and the world, I wanted to specifically recognize the missing and murdered indigenous women, girls, and to spirit people on these lands.'",
        "'speaker_1': 'Indigenous women are ten times more likely to be killed than the national average in the United States. And of the several, several thousands of documented, we know there's more than this, but documented cases of missing and murdered indigenous women and girls and two spirit people in this country.'",
        "'speaker_1': 'There's only been about 100 cases that were included in the US Department of Justice missing persons lists. Four out of five indigenous women experience violence in their life, while one out of two half of us experience sexual violence in our lifetime.'",
        "'speaker_1': 'It's not even a matter of of of us thinking, how could this happen to us? It's a matter of kind of thinking, when is it going to happen to us? And so we need more awareness on this epidemic that not only plagues us here in the United States, but many indigenous communities around the world.'",
        "'speaker_1': 'And we just need more resources. And any time I have a platform to speak about this and bring awareness, I do feel a major. Thank you very much. Gratitude to be here. Thank you.'",
        "'speaker_0': 'Thank you very much, Christine and Danielle, and the important perspective and words that you brought and Councilwoman Torres for sponsoring this proclamation. Any any final words, Councilwoman?'",
        "'speaker_4': 'No, thank you.'"
    ],
    "A bill for an ordinance enacting an interim zoning regulation to allow certain temporary unlisted uses in Former Chapter 59 zone districts due to the COVID-19 disaster emergency. Approves an interim zoning regulation to allow certain temporary unlisted uses in former Chapter 59 zone districts due to COVID-19. The Committee approved filing this item at its meeting on 9-15-20.": [
        "'speaker_3': 'Yes, Madam President, I move the council bill to 0-0965 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved. Thank you. The required public hearing for Council Bill 20 dash 20961 is open. Maybe please have the staff report.'",
        "'speaker_1': 'Good evening, counsel. My name is Tina Axelrod. I'm the running administrator for the city of Denver in the Community Planning and Development Department. And going to. Share my screen to get get us to the presentation tonight. And.'",
        "'speaker_2': 'Right.'",
        "'speaker_1': 'We're here this evening. This item is for an interim zoning ordinance sponsored by Councilwoman Sandoval. And essentially this is a temporary ordinance that addresses zoning authority in direct response to the COVID public health emergency. This ordinance will only apply during the pandemic and will sunset automatically upon expiration of emergency public health orders.'",
        "'speaker_1': 'The crux of it is that this ordinance will allow the city to permit COVID related temporary uses anywhere in the city and not just on land zoned under the Denver zoning code. The kinds of emergency uses at particular issue right now include temporary managed campsites for our homeless population, also known as safe outdoor spaces, and the temporary'",
        "'speaker_1': 'expansion of outdoor patios and spaces associated with restaurants and bars in direct response to the economic implications of the COVID quarantines and public public health orders. There's nothing. Administrator has been given authority in the Denver zoning code to determine whether a proposed temporary use that isn't clearly listed or allowed in the code can nonetheless be permitted.'",
        "'speaker_1': 'It's been in the Denver zoning code since 2010 when the code was first adopted, but it's been used very sparingly since in those ten years, determinations have been issued to allow temporary outdoor holiday decorations, temporary telecom towers, temporary tiny home villages, which some of you are familiar with, because we just recently or within the last year or'",
        "'speaker_1': 'so, codified that use into the code and then the two COVID related temporary uses that are still pending or have been granted allowance under the Denver zoning code. So in this ordinance right now, we we've got two zoning codes in the city of Denver.'",
        "'speaker_1': 'The newer one Denver zoning code, adopted in June 2010, does give a thority to the zoning administrator to recognize and permit temporary uses and activities that are otherwise clearly allowed. But our older code that still applies to sometimes referred to as former Chapter 59 does not have that same authority.'",
        "'speaker_1': 'So while the zoning administrator has approved numerous temporary uses on Denver's zoning code zone land, none of those uses were allowed on all codes homelands lands, in particular the temporary tiny home villages. And to a large extent, the temporary outdoor patio expansions.'",
        "'speaker_1': 'Even when there is an avenue to allow some of the city's unorganized owned land, for example, the temporary outdoor patios. It was through a different path and different authority. And typically many more limitations will apply. For example, while we were able to extend the temporary outdoor patio program to all coach owned lands, it was much more restrictive'",
        "'speaker_1': 'than what we could allow on Denver's zoning programs. Just one example of that is that if you were on all codes down land, you can have your temporary outdoor space, but you could not take up required parking spaces.'",
        "'speaker_1': 'Even if no one was coming to drive to your restaurant, you could not take up those parking spaces. That's just one example. So the ordinance.'",
        "'speaker_2': 'Will.'",
        "'speaker_1': 'Work to allow the zoning administrator to make a conscious and deliberate decision every time she makes a determination under the Denver zoning code to allow an unlisted use to also allow the use on all code so land. Remember, this is in response to the COVID emergency only.'",
        "'speaker_1': 'And it's not. It is bookended by criteria and parameters. Essentially, the determination has to find that the unlisted use is similar to other permitted uses in the zone districts at issue, both in character and external and external impacts that the proposed use is consistent with the code and zoned district intents, and that allowing the use is necessary'",
        "'speaker_1': 'to preserve or advance the public health, safety and welfare. The zoning administrators are also allowed to attach conditions and limits on any unlisted use determination to mitigate potential impacts. So both the tiny home village temporary use and the the temporary outdoor patio expansion program came with conditions and limits on those uses to mitigate potential spillover effects on'",
        "'speaker_1': 'surrounding properties. When this authority if this authority is used under the pending ordinance, the zoning administrator would have to specify which code zone districts to allow to use and also does provide an allowance to bridge the two codes and give the zoning administrator authority to apply standards that Denver's zoning code landowners enjoy to code zone property landowners'",
        "'speaker_1': ', for example, that that same limitation on whether or not you could use required parking spaces for your temporary use. With this ordinance in place, I could allow the patio expansion to take up otherwise required parking that during this pandemic is certainly not being used.'",
        "'speaker_1': 'Of note is that allowing temporary uses under COVID or other circumstances has no impact on the legal status of any permanent land use that's also located on the same property. This highlights some of those provisions in these next few slides that I just talk through.'",
        "'speaker_1': 'Section one is the general grant of authority and the bottom line allowance section to list those criteria of findings that would need to be made. Section three further specifies the requirements for the zoning administrator to allow such use to design all code zones.'",
        "'speaker_1': 'Land in section four is the automatic sunset when the COVID emergency is over. But obviously the question comes up naturally. What lands are we talking about in the city of Denver when we say all code zone lands? Here is a very simple table and story about what percentage, whether we're talking acres or total number of assessor or'",
        "'speaker_1': 'ownership parcels, is comprised of all codes on lands as far as acres, which does not include all the land under DIA. It's about a little over 20% of total acreage zoned in the city of Denver. We're looking at a number of parcels.'",
        "'speaker_1': 'We're talking about approximately 24% of all assessor parcels in the city of Denver are zoned still under the old code. And to bring that home visually. The orange in this slide on the map shows those old code zone lands that remain in the city.'",
        "'speaker_1': 'There's quite a sprinkling across all the city council districts, but you could see obvious concentrations along the eastern boundary and southwest boundary of the city. Tonight. In order to adapt this ordinance, Council must find that the ordinance ordinance is consistent with adopted plans, that it advances the public health, safety and well for welfare, and that it will'",
        "'speaker_1': 'be uniform in effect across all zone districts. This ordinance. Oops. Staff does fired is consistent with the goals and strategies from our four key comprehensive plan elements. It would advance several equitable, affordable, inclusive element goals to provide a complete range of housing options in every neighborhood of the city, helping to prevent displacement of residents and businesses during'",
        "'speaker_1': 'this emergency. It would also have found a strong and authentic neighborhood element goals by ensuring a mix of housing targets and supporting businesses that create vibrant centers and corridors in our city. It would also advance, connected, safe and accessible places an economically diverse and vibrant plan goals by maintaining active streets and supporting bars and restaurants and other'",
        "'speaker_1': 'local businesses. The ordinance is consistent with many blueprint goals aimed at created at creating affordable housing options for people experiencing homelessness. In addition to supporting local businesses. The ordinance is directly consistent with two of the three Blueprint Denver Equity Concepts.'",
        "'speaker_1': 'This ordinance would permit emergency shelters and campsites and outdoor patios in former Chapter 59 zone districts and provide additional opportunities for residents and businesses to stay in their neighborhoods to maintain employment and sustain their community infrastructure. It also helps maintain and expand housing and jobs diversity through the city.'",
        "'speaker_1': 'I like from the housing an inclusive Denver plan. This ordinance is consistent with one of the fundamental values stated in the city's housing plan to support housing as a continuum from homelessness to homeownership. Regarding consistency with the second and third criteria, staff finds that adopting this ordinance will further public health and safety and welfare by allowing temporary'",
        "'speaker_1': 'uses such as emergency shelters and camps in all zone districts across the entire city. So that. So that housing is provided for our most disadvantaged populations, and also that allowing temporary commercial uses like the outdoor patio expansions, can also maintain and support businesses during this public health emergency universe.'",
        "'speaker_1': 'The uniformity of district regulations will result in processes and regulations. This ordinance will result in processes and regulations for temporary uses that will be generally uniform within each zone district in which the use is granted while allowing for necessary flexibility.'",
        "'speaker_1': 'During this state of emergency. With all that CPD recommends that the City Council adopt this interim zoning ordinance based on findings that all review criteria have been met. At this point, I'm happy to take any questions before topic.'",
        "'speaker_0': 'All right. Thank you so much for your report, Tina. And council did not receive any written testimony on Council Bill 20 Dash 0961 and two night for our public hearing. We have five speakers who have signed up. And so we'll go ahead and go through our speakers and then we'll get to questions by members of council.'",
        "'speaker_0': 'And so our first speaker who we have signed up is Jason Hornick.'",
        "'speaker_3': 'Hi there. My name is Jason Armagnac and I live at 4989 Decatur Street and I am on the board of the Chafee Park Neighborhood Association. But I'm speaking tonight only for myself, and I thank you for the opportunity to do so.'",
        "'speaker_3': 'I'd just like to voice my support for the temporary ordinance to open up the former Chapter 59 plans for emergency uses such as safe outdoor spaces. I don't think that we should let an asterisks in the code prevent us from properly and equitably responding to a crisis.'",
        "'speaker_3': 'I think it's a great idea. I applaud the initiative and I hope that Council will find similar common sense solutions to other equity issues that may arise from the Chapter 59 situation, because our zoning code is only as complicated as we make it.'",
        "'speaker_3': 'My respect and gratitude to you all. Thank you again, and I yield back the rest of my time.'",
        "'speaker_0': 'All right. Thank you, Jason. Next up, we have Tanya Wilson. All right. Go ahead, Tanya.'",
        "'speaker_2': 'Hello.'",
        "'speaker_1': 'Thank you so much. I became aware of this earlier this afternoon. So I've jotted down my thoughts and put this together as quickly as I could. But I found that the timing was very interesting. There has been very little discussion in City Council about former Chapter 59 until very recently, I would say early September, when an organization'",
        "'speaker_1': 'of neighbors from across Denver got together and really started digging into the group Living Proposed Text Amendment Change Number seven. But of course, it caught my attention because I saw this is chapter 59. And again, it hasn't come up very often.'",
        "'speaker_1': 'And I'm curious about why this is coming up just now, why it's coming up so quickly, why there hasn't been a lot of communication about this and why it's coming up so late in the agenda tonight. But that's another story.'",
        "'speaker_1': 'What I'm not clear on what is the problem that this is trying to solve and why it's coming up now? My understanding is that the Central Park neighborhood and Lowry do have extended outdoor spaces today. So it doesn't seem it's focused on that, but perhaps it's just focused on.'",
        "'speaker_1': 'Temporary camping sites.'",
        "'speaker_2': 'So if that's the city issue that.'",
        "'speaker_1': 'They're trying to solve, it doesn't seem that the city's issue is lack of land available even in the regular zoning code. It's a lack of public interest in having these sanctioned camp and camping sites near homes, people's homes or and or their businesses.'",
        "'speaker_1': 'So I am not in support of this at all. There hasn't been a lot of clarity. There hasn't been a lot of promotion of this so that the constituents in Denver can even understand what this is. And it doesn't seem that there is actually a problem to solve.'",
        "'speaker_1': 'And the idea of having temporary emergency camping sites doesn't seem equitable. It's just temporary. And those are my thoughts with very short notice on this coming up tonight. Thank you so much for your time.'",
        "'speaker_0': 'All right. Thank you, Tanya.'",
        "'speaker_1': 'Next up, we have Adam Astrof.'",
        "'speaker_3': 'Oh. Denver City Council. My name's Adam Ashraf. I live at 361 LRT and I'm speaking on behalf of myself and Yimby Denver. We support this change and thank you very much for bringing this forward. You know, we're definitely going through unprecedented times both in the budget and people's lives and safe outdoor spaces, while, you know, not not'",
        "'speaker_3': 'necessarily not really housing, you know, are going to be a vital component of us allowing to keep all of the people in our city safe, especially over the winter, with the provision of services, restrooms, you know, waste disposal, all of the things that, you know, we need to make sure that the camps can be safe and also'",
        "'speaker_3': 'definitely for expanding for restaurants as well. That's that's really great. And, you know, making sure that we have one zoning code in our city. Zoning has operated in the past by creating arbitrary delineations between types of housing like single unit versus multi-unit.'",
        "'speaker_3': 'And those arbitrary delineations were used to enforce discrimination and to disinvest in certain neighborhoods. You know, I got to live in District nine for part of my time in Denver, and you could certainly see that there. So thank you very much.'",
        "'speaker_3': 'For know, making sure the entire city is going to participate in supporting, you know, our all of our communities here and making sure that we have a single zoning code. And it's great to see that it's it's so easy to adapt chapter 59 to deal with our current problems.'",
        "'speaker_3': 'So thank you, City Council, please vote yes.'",
        "'speaker_0': 'All right. Thank you, Adam. And our final speaker is Jesse Paris. Hi, Jesse.'",
        "'speaker_3': 'He was a councilor. Good evening, Council President Gilmore. My name is Jesse Pierce. I represent I must allow for self defense, positive action, commitment for social change and accountability. Colorado and Ohio. Primaries. And I will be the next mayor in 2023.'",
        "'speaker_3': 'We are in favor of. In terms of this ordinance code, which you push from. Nine states outdoor spaces spaces like no house with crisis and sweep. People like trash is not the solution. So we support safe outdoor spaces.'",
        "'speaker_3': 'Like I stated during general public comment, I toured one of these demonstrations and I met them and I love to see them in all areas and districts of the city. Thank you.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Jesse.'",
        "'speaker_0': 'That concludes our speakers for tonight. Questions from members of council. Councilman Ortega.'",
        "'speaker_2': 'Thank you, Madam Chair. Madam President, my first question is for Tina. So, Tina, you mentioned in one of the slides in your deck, the tiny homes. And as you know, we have a current lease on the space where the existing tiny homes is at.'",
        "'speaker_2': 'How would this language change affect that particular location and that lease?'",
        "'speaker_1': 'It would it would not affect that location or place. That tiny home village is operating under permits that were issued under the Denver zoning code. And in the interim, since it was first stood up, we have actually codified and clarified that use as allowed on the face of the zoning code so they won't need to rely on'",
        "'speaker_1': 'a listed use determination by me. They can come in now as a buy right use.'",
        "'speaker_2': 'Thank you. I wanted to just get that on the record for the listening audience. The next and final question that I have is about how this might be used if we were in the middle of a natural disaster, which some of us might consider.'",
        "'speaker_2': 'But how would this apply to recreation centers or other city buildings if we wanted.'",
        "'speaker_1': 'To.'",
        "'speaker_2': 'Temporarily place people in those kinds of facilities? As you know, it's not unusual in the world communities when it snows and people are stranded to stay in gymnasiums and whatnot. So can you just speak to that piece of of this and how this applies?'",
        "'speaker_2': 'Sure.'",
        "'speaker_1': 'This ordinance would apply only if there's a temporary some private property. It could include city owned property, though city is subject to its own zoning code, but will only apply where a proposed use is nowhere else allowed on the basis of the code.'",
        "'speaker_1': 'So we do allow homeless shelters to be set up in emergencies in the zoning code. There are allowances specific specifically for temporary shelters in the face of an emergency, as well as some authority to waive some of the conditions and limits on those shelters to sort of get out of the way when you have to react quickly'",
        "'speaker_1': 'and stand up temporary shelters. So this ordinance wouldn't stand in the way or hurt or deter our already existing authority under zoning and other rules to set those up. But what it would do is where there's a proposed shelter or housing option that is ahead of the code and it's never been considered by the code, like those'",
        "'speaker_1': 'managed campsites, which are very similar to the tiny home village where we hadn't anticipated those would provide an avenue to temporarily allow such a use with whatever limits or conditions make sense and get them up quickly without necessarily having to go through an entire text amendment process, which takes months.'",
        "'speaker_1': 'And we can issue determinations after consultation in a matter of days or a few weeks.'",
        "'speaker_2': 'Thank you, Tina. I have no further questions.'",
        "'speaker_1': 'Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilwoman Ortega. Councilwoman Zoya.'",
        "'speaker_1': 'Madam President. Tina, I do have a question. I think one of the speakers, Asit, and it's a it's a great question that I think a lot of the public is probably asking. So I would I think it's probably just worth answering in Lourey and Stapleton, which are Chapter 59, most of which is covered by Chapter 59, there'",
        "'speaker_1': 'are businesses right now that are using outdoor spaces and parking lots. So how is it how is that possible if we are having this conversation right now? As I kind of hinted at during my presentation, there was a way to get some temporary outdoor patios with those old code zone lands like we see in South Stapleton and'",
        "'speaker_1': 'Lowry. It was just through a different door and it was a much narrower door that came with a lot more limitations on it. I can get pretty technical, but we allowed them as a instead of an unlisted temporary use, we allowed it as an unlisted assessor to use, which is a necessary use as a use that's secondary'",
        "'speaker_1': 'or incidental to the main use on the property. So for a restaurant, that outdoor patio is technically an accessory use. But with accessory use comes this whole host of strings attached that we couldn't unwind, even though we could allow some expansion of those outdoor patios.'",
        "'speaker_1': 'So for example, that outdoor patio in Lowry or South Stapleton has to be on the same zoned lot as the restaurant, whereas under Denver's zoning code, if you had a willing property owner a couple of doors down that's off your private property that you control, you can still set up your patio there as long as you meet'",
        "'speaker_1': 'all the other code requirements. More significantly, if you have a parking lot and you're in Lowry or Stapleton, and it's just for you, and the zoning code says you shall have a minimum of ten spaces for your restaurant use.'",
        "'speaker_1': 'You have to maintain those. You can't take away any of those tents to expand your patio and on the old code zoned land. So if you had ten spaces required and that's all your parking lot had and you wanted to expand your patio onto your parking lot, you were out a lot and a lot of people took'",
        "'speaker_1': 'advantage of that under the greater allowance and the Denver zoning code if they have a parking lot available. So it felt artificially constrained given the circumstances of the COVID emergency and the change in traffic to our businesses. And it felt unfair.'",
        "'speaker_1': 'People are doing it and making do, but they'll hit a wall at some point that they wouldn't otherwise hit if we were allowed to extend the Denver zoning code allowance to them. Okay. So do you have any example, a concrete example of a business?'",
        "'speaker_1': 'Just because I would think like if there wasn't if what we haven't heard from is a any business owner who has emailed our office and said we cannot do what we want to do because we have come up against a zoning issue that has not allowed us to do something.'",
        "'speaker_1': 'So I guess I'm just wondering, you know, have you can you give us an example of of a situation where where CPD has run into a business owner who has not been able to do something because of this?'",
        "'speaker_1': 'Well, business, I can certainly tell you, of dozens of sites that have been taken off the board for housing options in the city because of this mismatch of of codes and land businesses. You're right, we haven't bumped into them as much with the outdoor patio expansion program, which is really the only temporary use on the table now'",
        "'speaker_1': 'that we've spent a lot of time and energy on. But I also have to say, as part of the expanded outdoor patio program, whether it's in Lowry or downtown, under the new zoning, under Denver's zoning code, we didn't require a permit and we're not inspecting.'",
        "'speaker_1': 'So. We've just tried to get out of the way and let public health and right of way and licensing deal with any potential problems. So I have to say, for all I know, I don't know what's happening out there on the ground, but.'",
        "'speaker_1': 'That's okay right now. Yeah. Got it. Okay. Thank you. So then in terms of the housing challenges that have clearly come up around this, are there as you look into, I guess, other potential options for housing? Are there going to be conversations with the council members or as if we were to vote in favor of this and'",
        "'speaker_1': 'grant you this right as the zoning administrator does, then that give you the right and ability to make decisions in our council districts without coming and having discussions with council members about what is happening on the land in our council districts.'",
        "'speaker_1': 'Sure. Well, I want to assure the entire city council that whether it's whether it was a temporary tiny home village three years ago or today, a managed campsite in response to a public health emergency, there will still be a community participation outrage and and plenty of communications as as as people in the audience might know.'",
        "'speaker_1': 'But we've been soliciting from the council members ideas, thoughts, anything about land that might be available for manage campsites across the city. But out of that, there's been little that we can move forward with. But as we find sites, all the council members are brought into the conversation and if they're they pass the viability smell test from'",
        "'speaker_1': 'multiple city perspectives internally. But yeah, but this wouldn't stop that process from happening. It would just open up the availability of land outside the 75% that's zoned under Denver's Denver zoning code into play. And we have had many parcels of land put on to list of potential sites that hatch essentially be filtered out first thing because it'",
        "'speaker_1': 'was the ranch domain, including many land owned by our faith organizations in the city. Okay. Thank you. No, no more questions.'",
        "'speaker_0': 'All right. Thank you. Councilwoman Swire. Councilman Sandoval.'",
        "'speaker_1': '18 of these questions for you. Thanks for your presentation. So if you have a parcel and you're a property owner or a business owner and former Chapter 59, doesn't it say in that zoning that you're not allowed to have any of these accessory leases?'",
        "'speaker_1': 'So although I haven't received necessarily emails from my planned unit development, which is Chapter 59 and District one, they have inquired because it explicitly says they can't do this. Is that correct? Some of the old code zoning out there is what we would call custom zoning that had a lot of traditional limits and conditions placed on them'",
        "'speaker_1': 'that were totally one offs. So there might well be certain prohibitions buried in the text of their applicable zoning, like a PD, for example, which is or zoning with waivers and conditions that might put out of play altogether certain temporary or accessory uses.'",
        "'speaker_1': 'And I can't override that. But typically for temporary uses, there's a general reference in most of the custom zoning that just looks back to former Chapter 59, the book, and says, you can do any temporary use allowed in the block.'",
        "'speaker_1': 'And that would allow me to link up even to these old code zone lands that have custom zoning. Okay. Thank you.'",
        "'speaker_2': 'All right.'",
        "'speaker_0': 'Thank you, Councilwoman. The public hearing for Council Bill 20 0961 is closed. Comments by members of Council. Councilman Sandoval.'",
        "'speaker_1': 'Thank you, Madam President, and thank you for your presentation. As I was exploring this idea of sponsoring this amendment, the conversation of equity was at the forefront of my mind, and I would like to provide equity throughout the city and county of Denver.'",
        "'speaker_1': 'And although one of the speakers said that they have not heard about chapter former, Chapter 59, I have been a in city council not elected, but I've been in working in city council since 2012. And I have thought about Chapter 59.'",
        "'speaker_1': 'And when you're a council aide, you don't have the bully pulpit, you're not able to speak about it. And I've only been elected for a year and I am giving great consideration to Chapter 59. I give lots of consideration to zoning.'",
        "'speaker_1': 'That's why I have, instead of three planners or three council aides who do policy and constituent work. I have a full time planner in house in my office because I do give a lot of consideration to all of the zoning, because I believe that zoning impacts people in ways that we don't understand.'",
        "'speaker_1': 'And I'd like to create solutions to the problems that we see. So as I was thinking about this, sponsoring this bill, particularly as I said, it was due to the inequity that I see in former Chapter 59 and to build a bridge.'",
        "'speaker_1': 'That's the kind of work that I would like to do in Council District one and throughout the city is build bridges so that we have equity. And as it was mentioned, this is related to COVID. And I know that we've had several discussions about making this a permanent solution as we attempt to tackle Chapter 59 in our'",
        "'speaker_1': 'future. During our budget our budget hearings, I asked Laura Allegretti, who's the director of Community Planning and Development, if it is on their work plan to talk about Chapter 59 and bring it into the Denver zoning code. That's something that not everyone on council would be excited about to work on.'",
        "'speaker_1': 'But in my little brain, I'm like, Oh, I can create, I can solve problems, I can have, I can help. And so that's what I hope that we all do in this. And I'd ask all my colleagues to vote in favor of this.'",
        "'speaker_1': 'It met the criteria that Tina laid out, and it helps those who cannot understand zoning in a way, and it creates equity across the board in Denver. And so that's of the utmost importance to me. So I would ask my colleagues to please support this, and that's it.'",
        "'speaker_1': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman Zoya and or excuse me. Thank thank you, Councilwoman Sandoval, and your leadership in sponsoring this. Up next, we have Councilman Hines.'",
        "'speaker_3': 'Thank you, Madam President. I wanted to thank all the staff who worked on this. I certainly want to thank my colleague, Councilmember Sandoval. I understand that there may be concerns. This is temporary, and I look forward to seeing how this behaves in the wild, so to speak, during COVID, so that we can see if it does merit'",
        "'speaker_3': 'making it permanent. So thank you very much.'",
        "'speaker_0': 'Thank you, Councilman Hines. Seen no other comments by my colleagues. Madam Secretary, roll call.'",
        "'speaker_2': 'Black Eye CdeBaca. I a.'",
        "'speaker_1': 'Clerk.'",
        "'speaker_3': 'All right.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Hines.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_1': 'I can. I. Ortega. All right. Sandoval. I. Sawyer. I.'",
        "'speaker_4': 'Torres. I. Madame President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce results. 1313 Eyes Council Bill 961 has passed. Congratulations Councilwoman Sandoval for sponsoring this hour pre adjournment announcement on Tuesday, October 20th. Council will hold a required public hearing on Council Bill 933, approving the 1840 Grant Street Urban Redevelopment Plan, the creation of the 1840 Grant Street Urban Redevelopment Area'"
    ]
}