{
    "A resolution approving a proposed Amendatory Agreement between the City and County of Denver and Axon Enterprise, Inc., f/k/a Taser International, Inc., to extend the term, increase the maximum contract amount and add additional terms and conditions for body worn cameras, supporting equipment, software, and data storage and Tasers for the Denver Police and Denver Sheriff Departments. Amends a contract with Axon Enterprise, Inc., formerly known as Taser International, Inc., by adding $15,996,615.10 for a new total of $22,097,650.10 and five years for a new end date of 12-15-25 to purchase body worn cameras, supporting equipment, software, and data storage and Tasers for the Denver Police and Denver Sheriff Departments (202054764). The last regularly scheduled Council meeting within the 30-day review period is on 12-21-20. The Committee approved filing this item at its meeting on 11-18-20. Pursuant to Council Rule 3.7, Councilmember CdeBaca called out this resolution at the 11-30-20 Council meeting for a one-week postponement to Monday, 12-7-20.": [
        "'speaker_2': 'Thank you, Madam President. I have a few outstanding questions and a couple that will reiterate from the safety committee. Is there anybody on the call who can answer questions on this contract?'",
        "'speaker_0': 'Mm hmm. We have, I believe, Laura Walker and Chief Payton.'",
        "'speaker_2': 'Got it. We did some digging after safety committee and are concerned about the use of the body cameras and when they will be turning on. And I'm wondering when there will be opportunity, if this is passed tonight for the public and for city council members to weigh in on how the new equipment is utilized and recorded and'",
        "'speaker_2': 'made available.'",
        "'speaker_0': 'All right. Thank you for that question. We'll go ahead and let either Laura or Chief Payson chime in.'",
        "'speaker_1': 'Councilwoman, thanks for the question. There's a policy that was done with community input on release of body cam footage so the upgraded cameras would follow the same policy.'",
        "'speaker_2': 'Will you be reopening that policy after this summer's events?'",
        "'speaker_1': 'We continuously look at policies and procedures for improvement, and we would do that with all policies that dictate performance of officers. What?'",
        "'speaker_2': 'Can you make a commitment that you will be responsive to? The report out from the Independent Monitor's office in a couple of weeks regarding body cameras and the policies surrounding the Tasers.'",
        "'speaker_1': 'So I'm sure if tasers are addressed in the monitors report. But we are looking forward to that report we have signed as well as the executive director of Public Safety requesting this. We consider ourselves a learning organization and we look forward to what the monitors report has and what we can improve upon.'",
        "'speaker_2': 'Great Segway research doesn't really show us that body cams curtail violence and they don't really change officer behavior. And so I'm wondering how DPD is planning to use the body cam footage to identify ingrained police behavior and where training has failed?'",
        "'speaker_1': 'Well, the purpose of the body cam is about accountability. You can identify the officers performance. Overwhelmingly, the body cam footage not only in Denver but across the country has led to meaningful change, has led to meaningful correcting behavior, as well as holding individuals accountable for their own actions.'",
        "'speaker_1': 'And that's what we would expect to see moving forward.'",
        "'speaker_2': 'And Denver doesn't have a good policy, a uniform policy that lets the public know when video footage will be available or released. And so now I'm wondering when we, as the public and members of council can expect such a policy to be crafted by DPD rather than going with a case by case basis decision making that we've'",
        "'speaker_2': 'been going with.'",
        "'speaker_1': 'So again, you know, this original policy was crafted with input from the community. There's also additional layers with SB 217 that we are in compliance with and will be in compliance with in the future. We're talking about this camera compared to the last camera.'",
        "'speaker_1': 'We believe that the policies that are in effect give that level of transparency, particularly with the Office of Independent Monitor, who has access and reviews, body would body worn camera footage on a regular basis.'",
        "'speaker_2': 'And the transparency is a huge gap that we have here in Denver. And I'm wondering, when you became chief, we were expecting a report detailing when an officer points a firearm at someone. And I imagine that this is data that's captured on the excessive amount of body cam footage that we must have stored somewhere.'",
        "'speaker_2': 'But no report has been released. And so I'm wondering when the public can expect that data and that report.'",
        "'speaker_1': 'Great question. And actually a great segway into how we have worked with our community. Pointing a firearm and documenting that as part of comprehensive reporting is how we worked with the Use of Force Committee on or in June of 2020.'",
        "'speaker_1': 'We amended our policy and have begun collecting that data as we announced at that time frame. And just like we do with all use of force data, again, part of that that use of force, a committee of diverse community members from all across our city helped us craft.'",
        "'speaker_1': 'We report out on that on or before February 1st of the following year. So all of that data, just like you can go back and look at 2019 data or 2018 data, it is prominently posted. And that was a suggestion from the use of force committee from a committee member that we have followed through with.'",
        "'speaker_1': 'And I do want to point out that and give credit to our community, because the use of force policy done in conjunction with our community is as strong and as progressive as any in the nation, and it is fully complies with the eight Can't Wait, which includes what you're asking for in the comprehensive reporting.'",
        "'speaker_2': 'We're definitely past eight. Can't wait as a general public where we're eight to the abolition now. But I am curious about two things. Where in the escalation of force do tasers fit with respect to pepper balls and the tear gas?'",
        "'speaker_1': 'So again, that policy is online, it's open.'",
        "'speaker_2': 'You describe it.'",
        "'speaker_1': 'Is. As far as the use of force policy that is available online, that was designed in conjunction with our community, talks about usage with defensive resistance, active aggression and aggravated active aggression for each.'",
        "'speaker_2': 'Do we use Tasers first or do we use pepper balls and tear gas first?'",
        "'speaker_1': 'There is not a used one before another. Our goal in all of this and is clearly stated in the policy manual, not only in the use of force section, but throughout is the goal is verbal de-escalation is to get voluntary compliance before having to use any type of force.'",
        "'speaker_1': 'The less force used is good for everybody. Would love to get to a position where no force is used. That's good for our community and it's good for our officers.'",
        "'speaker_2': 'Does every officer read that policy manual?'",
        "'speaker_1': 'Yes. And we have a a system, an electronic system that requires signoff upon completion.'",
        "'speaker_2': 'How many pages is it?'",
        "'speaker_1': 'The use of force policy manual?'",
        "'speaker_2': 'Yep.'",
        "'speaker_1': 'I don't have the exact number of pages.'",
        "'speaker_2': 'So when I download it, it's over 800 pages. And when I've asked different officers about different sections in that policy manual, it doesn't seem. Like it is something that every officer reads from cover to cover. And so beyond the sign off that they've read it, what other kind of quiz or testing is involved to make sure that'",
        "'speaker_2': 'they've read it and know the content within it?'",
        "'speaker_1': 'So there is the academy that has tests, both quizzes and major tests that are associated with the policy manual. There are all updates are pushed out electronically to indicate adherence and knowledge of the particular policy. Any time something has changed, for example, the changes that were made with regards to your initial question on comprehensive reporting that goes'",
        "'speaker_1': 'out and each officer or supervisor is required to then read that and then sign off acknowledging that they know and understand the changes.'",
        "'speaker_2': 'I'm very concerned with just the signoff and not the the content knowledge. That seems to be the priority. I'm wondering also if this contract has any kind of clause in it that does not allow this company to. Transfer over data if it is purchased by another company.'",
        "'speaker_1': 'How we monitor and protect people's data. We do not allow in our contracts for folks to just to sell data to a third party.'",
        "'speaker_2': 'That's not exactly what I'm talking about. Say, for example, we collect all of this data. We have a full database of body cam footage, and then one day Palantir buys Axn. They buy the the data service. They buy all of the footage.'",
        "'speaker_2': 'Even though it belongs to us, they have access to it. I didn't see anything in our contract that would trigger. A renegotiation of the contract if the company is purchased or a termination of the contract.'",
        "'speaker_1': 'That would be a city attorney question.'",
        "'speaker_2': 'Is there a city attorney on the line to speak to that?'",
        "'speaker_1': 'And so, I mean, this is Steve Horn with the Denver City Attorney's Office. And my recollection of reading the contract is, of course, as you mentioned, the data belongs to the city. And as with all of our contracts, we can terminate at any point in time.'",
        "'speaker_1': 'The language is clear that it belongs, that the data belongs to the city. And so what I think you're describing is a scenario where if Axon were to be acquired by another company in that company attempted to access the city's data, that would be a breach on their part.'",
        "'speaker_2': 'And we have a commitment from the city not to collaborate and share data with entities like ICE. Correct.'",
        "'speaker_1': 'I believe that we have an ordinance not to provide certain information concerning citizens in the city. And so I'm not sure if if you're where that intersects with this contract.'",
        "'speaker_2': 'I want certain verification that this contract, this footage is protected under that ordinance and will not be shared with any outside entities.'",
        "'speaker_1': 'Councilwoman. That's something I'd need to come back with.'",
        "'speaker_2': 'Is it? Thank you. Council President. Is it possible to delay this until we have an answer on that?'",
        "'speaker_0': 'We could most likely delay it to a date certain, if you'd. I know Councilman Hines had his hand up as well. If you'd allow us to get a couple questions, more questions up into the queue, and then we can get back to you as to next steps.'",
        "'speaker_2': 'Awesome. Sounds good. That's it for my questions. Thank you, Madam President.'",
        "'speaker_0': 'All right. Very good. Thank you, Councilman Hines.'",
        "'speaker_1': 'Thank you, Madam President. And thank you, Chief and Sheriff, both for for being here tonight and for doing what is clearly a difficult job in any situation, even more difficult in 2020. So. Hats off to you. I would not want to have your job.'",
        "'speaker_1': 'So thank you for for being willing to do it. I have received conflicting reports about how tasers are safe. They don't reduce violence on underserved communities like our bipoc neighbors. But there are also a. I get information from constituents that say the data shows that kids, which do not do any of the things that are purported to'",
        "'speaker_1': 'do, like prevent use of firearms by police or de-escalate police interactions. And so this particular email asks me to tell you to look at data. This particular one also didn't provide any any references to data. So I can't, you know, cite any particular source.'",
        "'speaker_1': 'But I wonder if if you have any knowledge of data in the police department of how tasers are used, how they reduce violence on underserved communities. I know that's kind of a softball question, but. But here we are.'",
        "'speaker_1': 'And I got the email today so I wasn't able to provide this to you in advance. So I can tell you that, you know, there have been hundreds of studies on the safety and effectiveness of tasers that has been to you referencing a constituent that reached out to you, saying that their knowledge of of a particular study'",
        "'speaker_1': 'counters that without seeing in that report, seeing if at source and if it's peer reviewed, it would be impossible for me to answer that particular question. What I can say is we have documented incidences where Taber Tasers have helped in very dangerous and violent situations of armed individuals that have been able to safely been addressed.'",
        "'speaker_1': 'And, you know, speaking a body cams, there's a city in Wisconsin that delayed the purchase of body cams and regrets that decision and now is expediting, getting those purchased. There's a city in Pennsylvania, a major city that made the same decision with regards to tasers and unfortunately in the very near time have dealt with a subsequent tragedy'",
        "'speaker_1': 'as well. So it's important that we have safe tools, that we have strong policy, and that we provide training around that policy to ensure adherence to this. You know, I'd have to point to the hundreds of studies, including independent academic, institutional studies, that point to the safety and effectiveness of that.'",
        "'speaker_1': 'And you'd have to look at that data or those resources to make an informed decision based on what you read. So. Thank you, Chief. Do you do you have data in the city of Denver? You know, specifically as opposed to studies elsewhere?'",
        "'speaker_1': 'The city of Denver. Do we have data that shows that there there has been a reduction in lethal force because we have used Tasers in a less than lethal situation. So this is this is not part of the use of force report.'",
        "'speaker_1': 'And this is an area that we seek to improve upon in the future. We don't have a checkbox. And Taser was used to save a life or in a in a lethal force encounter. We do know based on accommodations or situations where we have been able to help an individual that had a knife and is threatening family'",
        "'speaker_1': 'members where you're able to utilize less lethal tools in order to save individual lives. And again, the goal here is that you have the appropriate tools, the appropriate policy and the appropriate training around it. Thank you, Chief. The and you mentioned that we don't currently have a policy about tasers.'",
        "'speaker_1': 'I think you have mentioned that our policy document is a living document. It was most recently changed, I think, in perhaps response to some of the protests and speeches 17 that this the new body cameras automatically are automatically triggered when a firearm is on holstered or a taser in a holster.'",
        "'speaker_1': 'Is that correct? That is correct. That's an available feature that we think is important. With the upgrade in technology. So to that end, that we have this upgraded technology for the body cameras and cameras and supported equipment and software, etc., that would allow police department to more quickly update its document so that as soon as there is'",
        "'speaker_1': 'a report of a firearm being holstered or a taser being holstered, that could that could immediately trigger some other process. And we have hard data that shows exactly when each of that each of those events happened. Is that is that a fair statement?'",
        "'speaker_1': 'I yes. Let me just give additional context. So we currently require that report, and now this dataset would be used to cross-reference the reporting of it. So if you know, we had. 36 Taser deployments in 2020. You would then be able to cross-reference the use of force reports that 12 F to say officers completed 36 reports, and'",
        "'speaker_1': 'then you would have this data to say 36 times. A taser was removed from a holster. And if it turns out one says 36 and one says 35, we can point to just do a quick cross-reference. And we see that the officer that that hasn't submitted their report, correct?'",
        "'speaker_1': 'That is correct. We would initiate an investigation, an internal investigation that is then shared with the Office of Independent Monitor or Review. And then I also want to just go backwards for a second. You said something to the effect of we don't currently have a policy for Tasers.'",
        "'speaker_1': 'It may have just been a slip. We have a very strong policy for Tasers. It's part of the use of force policy, the very strong and progressive use of force policy that was done in conjunction with with input from various community members and community groups.'",
        "'speaker_1': 'So we could say we have one of, if not the strongest, most progressive use of force policy in the country. Over the next 12 to 17 days, does S.B. 217 change our data retention and release policy regarding body cameras?'",
        "'speaker_1': 'In some aspects with regards to, you know, the highest levels of use of force. It mandates that that that the DA's office that that those types of situations are released much sooner. And so does does it require body camera footage to be automatically released after a certain period of time, like, I think two weeks, 14 days and'",
        "'speaker_1': 'but like that of mine, my misremembering. For certain circumstances. Yes. In. Okay. Are. Okay. I think that's that's fair. Fair for now. I would agree with Councilmember Hastert about his concerns. I mean, this is the public's information and are that the public purchased the body cameras.'",
        "'speaker_1': 'And so I think there could be a case to be made to have all body camera information available upon request. But we're not talking about that to do so. So thank you for that. Your your response is the last thing that I would say is a mr. Horn over the city attorney's office mentioned that we have we'",
        "'speaker_1': 'have we published something regarding. Or rather, we we have a policy regarding publishing information regarding citizens in the city. I think, as members said about his point, was specifically about non-citizens. And so we want to make sure. I do want to ask the question, because you use the phrase citizen and I catch myself often using citizen.'",
        "'speaker_1': 'So, Mr. Holland, we have a policy regarding releasing information about anyone in this city, citizen or not. Is that is that right? We have a in reference to the immigration ordinance to answer Councilwoman Dukakis question. The city is precluded from use.'",
        "'speaker_1': 'Any officer employee is precluded from using any city city resources for federal immigration enforcement. In terms of body cameras, the question concerning citizens there is the press sometimes will request. Images or records because they are records under Cora.'",
        "'speaker_1': 'So it's my understanding that. They could be released under a court request. For citizens or for anyone. For. For the images in general as a record could be released. Okay. Thank you. Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilman Hines.'",
        "'speaker_1': 'Councilman Herndon thinking I'm president, just in the spirit of making sure everyone know their roles and responsibility. I just wanted to remind this council that this is a one reading resolution and any council member can delay a resolution for one week without a vote.'",
        "'speaker_1': 'And if any council member wants to do that, they have that option. Just reminding folks of what our responsibilities are. Thank you, Madam President.'",
        "'speaker_0': 'Very good. Thank you, Councilman Herndon. We are back up, Councilman CdeBaca. To Councilman Herndon's point. You are more than welcome to delay this for one week by invoking Council Rule 3.7. In order to accomplish that, we would just need to ask the folks who made the motion and second, to withdraw that.'",
        "'speaker_0': 'If that's your intent.'",
        "'speaker_2': 'Thank you, Madam President. I would love to delay for a week.'",
        "'speaker_1': 'Drawing its name.'",
        "'speaker_0': 'There's no motion or second necessary.'",
        "'speaker_2': 'Point of order. This rule change does not require withdrawal of the motion. It is under the rule. You just cite the rule. And so I just I think that this this additional step has never before been required and I don't believe is necessary.'",
        "'speaker_2': 'Sorry for the interruption in order.'",
        "'speaker_0': 'No worries. I appreciate that we have a motion and a second that put it on the floor for adoption. And so we would just ask that those be withdrawn because it's not on the floor right at this point, that that's the advice I'm getting from our council secretary right now.'",
        "'speaker_0': 'And so and then we can allow Councilwoman Sade Abarca to invoke 3.7 on withdrawal.'",
        "'speaker_1': 'Madam President.'",
        "'speaker_0': 'Thank you. Councilman Hines.'",
        "'speaker_1': 'Withdraw my ticket.'",
        "'speaker_2': 'Very good. Again, you can't invoke the rule for a bill that's not on the floor. I think this is with all due.'",
        "'speaker_0': 'We had moved and put it on the floor. Councilman Flynn had moved that council resolution 20 dash 1356 be adopted.'",
        "'speaker_2': 'Yes. And it has to be on the floor for the rule to then take effect. If we withdraw the motions, it becomes part of the consent agenda again and the rule can't be invoked. So I think the motions were proper.'",
        "'speaker_2': 'Sorry, I know this is.'",
        "'speaker_0': 'I think accomplishing we're accomplishing the same intent. And that was the direction that I had been given. Either way, we have that motion pulled back and we have a vote. 3.7 will double check on that, but there's no motion or second to invoke that.'",
        "'speaker_0': 'And so I'm getting the thumbs up from everybody on that. And so if we're all right, we'll go ahead and move on to the next item on the agenda council. Woman Say to Barca, you still have your hand up.'",
        "'speaker_0': 'Was there an additional question that you had or comment?'",
        "'speaker_2': 'No, ma'am. Just waiting in queue. Thank you.'",
        "'speaker_0': 'Okay. Very good. Very good. The next item up is Council Bill 1320. Councilmember CdeBaca, please go ahead with your questions on Council Bill 1320.'",
        "'speaker_2': 'Thank you, Madam President. And I actually got my questions answered on this one, so I don't have any questions on this one.'",
        "'speaker_0': 'All right. Very good. The next item up is Council Bill 1390. Council member State Abarca. Go ahead with your questions on Bill 1390, please.'",
        "'speaker_2': 'Thank you, Madam President. I am curious about a couple of pieces that are in this change and that were presented to us. There is a piece that allows the executive director of Human Services the ability to adopt rules and guidelines for this tax.'",
        "'speaker_2': 'And I wanted to know what is the plan to engage the public, either on the front end or after the rules are changed so that we're aware of what happens under this new power? Good evening. Thank you so much for the question, Councilman CdeBaca.'",
        "'speaker_2': 'My name is Krystal Porter. I am the program manager for the Ideas Program at DHS, which brought forth these ordinance revisions. And so I'm happy to answer your question about that. Our plan is to engage stakeholders prior to pursuing any rules and to follow the public rulemaking process that's outlined in the ordinance in the DRC.'",
        "'speaker_2': 'So we would plan to have some kind of stakeholder meetings that we've already had some thoughts and conversations that have been put forward to us from community members and stakeholders as part of some of the advisory groups that our our program engages.'",
        "'speaker_2': 'And we are looking forward to continuing those conversations. We didn't want to run before we had the ability to do so. So we haven't fully mapped out what that engagement process will look like. But we do plan for there to be several opportunities for people to weigh in.'",
        "'speaker_2': 'Thank you, Ms.. Porter. And if there's a stakeholder group or a committee set up, can you make sure that our officers get notice of that so that we can have somebody present? I'm also curious about a piece of the PowerPoint that had mentioned a community housing report, and I'm wondering what exists already to tell us a little'",
        "'speaker_2': 'bit about how our dollars are spent on housing under ideas. So under ideas, we have not pursued a lot of housing initiatives to date. We've worked through our advisory council at DHS to learn from them. What they wanted to see with that initial recommendation from a community needs assessment completed in 2018, what we have done is already'",
        "'speaker_2': 'invested dollars in housing stabilization efforts ramped that up quite a bit this year in response to COVID 19. So we're already in that space in different ways, but now we want to look at some opportunities to really change the landscape for housing.'",
        "'speaker_2': 'Opportunity for people with A.D.D. in this housing report will give us a level of detail specific to Denver that we don't have at this point. That'll be awesome. Can you tell me a little bit about classification? And if you require individuals to already have their I.D. classification when they come to you for services, or do you guys'",
        "'speaker_2': 'do any eligibility or classification services themselves? That is a great question. So the the what the classification or what we call eligibility determinations done through the community center board serving Denver. It's part of the state program administering funds for Medicaid waivers and and supports for people with intellectual and developmental disabilities.'",
        "'speaker_2': 'And so they often go through that process. What our ordinance does allow is it creates space for people that have an intellectual developmental disability but may not have been identified, or it may have at some point left the system and may have themselves experienced homelessness or been shuffled around and want to return back.'",
        "'speaker_2': 'So we do have the ability, if people have not received that designation before and need to be evaluated, our funds are still able to provide some resources and support to them as they pursue that eligibility. And do we do any of the outreach for that classification service in shelters or the jails?'",
        "'speaker_2': 'That would be a question that I could take back to the community center board partner that we work with, Rocky Mountain Human Services. I know they do some pretty extensive outreach. We also are looking for opportunities to do presentations and meet with different partners to learn how we can better educate people that are accessing these services from'",
        "'speaker_2': 'different points. And so if you have some ideas, we would love to meet with you further on that and we can certainly circle back with you on information about what's already happening through our partner with Rocky Mountain Human Services.'",
        "'speaker_2': 'Absolutely. I've done federal compliance for people with disabilities and find that a lot of people don't actually get the right classification or don't have a classification at all, especially in our jails and shelters, and want to make sure that that is one of the indirect costs that could be included.'",
        "'speaker_2': 'I'm also wondering if legal services for individuals with ADR are included in the indirect costs that this now allows us more flexibility to spend on. Um, Councilwoman CdeBaca, could you clarify which part? When you're discussing indirect costs, you're talking about indirect costs for our service providers through their contracts with us.'",
        "'speaker_2': 'Yes. Okay. Thank you. So. So, actually, the kind of services that you're describing would still be considered a direct service. So if we were providing legal services and sports for people with intellectual developmental disabilities, we would engage that service directly.'",
        "'speaker_2': 'It's a it's a direct labor cost. So the indirect costs that that cap refers to are meant to capture other costs that are necessary to running a business and having good infrastructure to actually deliver those direct programs. And so with your also, since you did clarify that, it's primarily about administrative and overhead costs.'",
        "'speaker_2': 'I'm wondering if you guys have a gold standard for the percentage split in the nonprofit world that they try to keep overhead to 5% or less. And so I'm wondering if we have set any thresholds or gold standards for us.'",
        "'speaker_2': 'That's a really great question. I would love to refer you to a memo that Denver Human Services worked on in response to questions kind of of a similar nature from Councilman Flynn at our November 18th safety housing presentation.'",
        "'speaker_2': 'I can speak briefly to it, though. What they're finding and really what actually the standard recommendation is moving forward is that and how the federal government actually does this with their agreements is to work with partners to understand their costs and to classify those costs so that no, they can actually take a realistic look at what's needed'",
        "'speaker_2': 'to be able to have a good impact and a good outcome for the people that are on the receiving end of that service. And in fact, there is the possibility that the the rate that you're describing is actually a rate that is insufficient to support the operating needs of an organization, particularly for organizations that are smaller and'",
        "'speaker_2': 'can't spread that that indirect cost around to various funding sources or projects. Awesome. How will the public get information about that? Because I'm less worried about the small organizations doing a million different things. I'm more concerned about our big boys on campus who, you know, have.'",
        "'speaker_2': 'Six figure salaries for their executives and the workers are getting $30,000 a year. I don't want to I don't want the city to be paying for those executive salaries. Now, that is a really great question. I mean, currently, the way that we've we've engaged that thus far is twofold.'",
        "'speaker_2': 'Certainly, people can see the contracts that we execute and can request those from the clerk in recorder's office. And so they have access to the various rates that we've negotiated with our partners. I mean, additionally, we do a lot of our reporting out on how our programs and services are operating through our advisory council based on questions'",
        "'speaker_2': 'that they've asked and information that they're interested in receiving. For our biggest player, in particular, the Rocky Mountain Human Services contract. They also come and do an annual report to City Council on the services provided and talk about the various aspects of those services and programs.'",
        "'speaker_2': 'And so I think we have multiple areas where there is the ability for light to be shed on those activities. But if you have some other ideas on how we can be as transparent as possible, that is absolutely our goal with this program and we look forward to hearing that from you.'",
        "'speaker_2': 'Awesome. And do we collect audited financials from our partners prior to releasing dollars to them either through grants or contracts? That is a great question. I would have to defer to Lori Noble, who is our financial services director, and she's on the call to kind of talk about our general practice with that.'",
        "'speaker_2': 'Thank you. And that's my last question. So when she answers that, that's it for me, Madam President.'",
        "'speaker_0': 'All right. Great. Thank you, Councilwoman. Go ahead, Lori.'",
        "'speaker_2': 'Hello. Thank you so much, Councilwoman, for your question. Yes, we actually do, as part of our risk assessment, understand what kinds of areas need to be looked at. And part of that risk assessment that is performed by our internal audit function and group is to look at any kind of audit reports that have come out for Rocky'",
        "'speaker_2': 'Mountain and other contractors. Awesome. Thank you very much.'",
        "'speaker_0': 'All right. Great. Thank you. Next up, we have Councilman Hines.'",
        "'speaker_1': 'Thank you, Madam President. I guess I'm going to. I think, Ms.. Porter, maybe you could answer this. How is the how is the contract with Rocky Mountain Human Services going? I think they took over on July 1st, right when they the fiscal year rolled over to the new fiscal year.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'So, Councilman Hines, I think you're referring to the state contract for single entry point services for Medicaid waivers that are for that that can be accessed by people with ID, but are actually covering a wide span of other areas of service, including mental, mental health, mental illness, things like that.'",
        "'speaker_2': 'So talking about Human Services has, I believe, for over 25 years been serving Denver as the community centered boarding has been over the the Medicaid waivers that are specific for people with intellectual developmental disabilities. But to answer your question, from what I what I've seen and heard so far, I think it's going well.'",
        "'speaker_1': 'For the Heidi, 25 year history.'",
        "'speaker_2': 'Sorry. I know I was referring to your question about the recent transition. We do still follow kind of the general updates and activities about that, especially because there are a lot of people with ADT that may have opted to receive services through this other waiver, other waivers that are available to them.'",
        "'speaker_2': 'And so that transition has gone, I think, pretty well, pretty smoothly so far. And we look forward to hearing more from Rocky Mountain human sources about that.'",
        "'speaker_1': 'I would be happy to provide feedback about that too. I am on the sci fi through my flight, but that's not a waiver and thank you for pointing it out that that is not part of what we're discussing tonight.'",
        "'speaker_1': 'So, Madam President, thank you. I'm done.'",
        "'speaker_0': 'Thank you. Councilman Hines. Councilman Ortega.'",
        "'speaker_2': 'Get a muted here. Thank you, Madam President.'",
        "'speaker_3': 'So I wanted to ask Christo. You're the DHS point person. Right.'",
        "'speaker_2': 'So we do in a three year contract.'",
        "'speaker_3': 'Just out.'",
        "'speaker_0': 'Of curiosity.'",
        "'speaker_2': 'Yeah, I think that's a really great question. We in the past have done longer contracts with IHS. The contract that most recently ended was also a three year contract, and there are some really great opportunities there to ensure that there is some continuity in services.'",
        "'speaker_2': 'A lot of the services the military is supporting are services that people are accessing day in and day out. And so as much as possible, it just kind of helps us with our planning process and we still have the opportunity, you know, should an appropriation change from what we believe it could be in future based on what'",
        "'speaker_2': 'we believe revenues would be coming in from this council, then we have the opportunity to go in and amend the agreement. Same if there are any other issues that may come up over time. So the three year the three year agreement is is based on annual terms and performance and negotiating kind of a new budget for the'",
        "'speaker_2': 'next year. And so even though it's a three year agreement overall, it's segmented out pretty clearly into these individual terms that allows us to kind of evaluate services as we're going. So a number of years ago, it was agreed that.'",
        "'speaker_3': 'DHS would be holding back a percentage of.'",
        "'speaker_2': 'The dollars and allocating them.'",
        "'speaker_0': 'Yourselves, as opposed to the entirety of it.'",
        "'speaker_3': 'All being administered.'",
        "'speaker_2': 'By.'",
        "'speaker_0': 'Rocky Mountain Human Services. Because the history had been that although they could be contracting out.'",
        "'speaker_3': 'Some of those dollars, that wasn't really happening in real practice. So I guess I want to know a couple of things. How, what's what's the amount.'",
        "'speaker_0': 'Each year that's being held back?'",
        "'speaker_3': 'And is that being accrued with other dollars that haven't been allocated? Or are you guys allocating the full amount each year? And then as part of that, one of the provisions that I didn't agree with is that Rocky Mountain could also apply for the same amount that DHS was holding.'",
        "'speaker_0': 'Back and trying to reallocate to.'",
        "'speaker_3': 'Other providers in the community. And I haven't seen any data showing whether or.'",
        "'speaker_2': 'Not they are.'",
        "'speaker_3': 'Applying and getting some of that funding or whether it's actually going to other providers. So can you speak to some of that?'",
        "'speaker_2': 'Certainly I'd be happy to to answer those, and I'll try to kind of track through your question. It's been a lot of questions. Yeah. So firstly, when we look at how we're allocating our funds, we actually aren't basing it on a set percentage.'",
        "'speaker_2': 'We're not saying, you know, 75, 85, 95% go to Rocky Mountain Human Services. We're meeting with them and working with them and listening to what's happening to services at the state level and listening to what needs are elevated to us through our various stakeholder engagement and community conversations, so that we're actually funding services that are really pivotal'",
        "'speaker_2': 'to people's lives and wellbeing. And so we don't hold ourselves to a set amount because we want to be responsive to the need. And what is there, I will say of our for our agreement this year, it was a $15 million agreement for 2020.'",
        "'speaker_2': 'Over $3 million of that was contracted out to providers of various sizes through our Rocky Mountain services for initiatives and projects separate from the community center board that does not include services that are contracted in the day to day as part of our Mill Levy Service Plan program, which basically means if someone is only has it in'",
        "'speaker_2': 'their service plan to be able to access the program four days a week, the bill of funds can fund that fifth day if if there's a need for that, and so that those funds then go out through contract to those providers that are providing that service for that individual and is based on that individual's selection of that'",
        "'speaker_2': 'provider. Currently, any funds that are not being spent are through our mutual agreement are either contracted through. We have about five partners, I believe right now, five active partners that are not Rocky Mountain Human Services, that are doing great work in the community.'",
        "'speaker_2': 'And we're really looking to seek out several more partners in the next year. That's part of what we're hoping to accomplish with some of these ordinance changes, is to create space for those providers because we recognize that there's going to be a lot more diversity than the direct assistance that we provide through Rocky Mountain.'",
        "'speaker_2': 'So will you clarify.'",
        "'speaker_3': 'If that's just US dollars you're.'",
        "'speaker_2': 'Talking about, or is that a combination of the dollars that they contract out.'",
        "'speaker_0': 'As well as the DHS dollars?'",
        "'speaker_2': 'So that's the DHS dollars. Okay. Rocky Mount Human Services contracts with over I would say last year in their 2019 report, they reported 103 community provider agencies. So completely separate of that, we've got five we're working with, one of which is Rocky Mountain Human Services.'",
        "'speaker_2': 'We have several more on deck. We're working through those various contracts and projects to get them established. And and we're looking forward to bringing at least two of those to you guys in the near future.'",
        "'speaker_3': 'So it would be helpful to get a list of all of those community provider agencies that Rocky Mountain contracts with. I know that what were the discussions we had some time ago was around trying to meet the needs of individual clients.'",
        "'speaker_0': 'That are currently under.'",
        "'speaker_2': 'The Rocky.'",
        "'speaker_1': 'Mountains.'",
        "'speaker_3': 'Purview, if you will. And, you know, it's it's a lengthy and complex process that people have to follow to get in, to be able to access services. You've got to be on the wait list, you know, all of that stuff.'",
        "'speaker_3': 'And so I'm just curious to know how that's going in terms of whether individuals ability to get more services now has been expanded as the amount of money has increased since. I mean, COVID has had a huge impact on it.'",
        "'speaker_3': 'But when I.'",
        "'speaker_0': 'Came on in 2011, we were at somewhere in the ballpark.'",
        "'speaker_3': 'Of about 11 to $12 million a year, and now it's way in excess of that. And so I guess I'm just curious whether we're getting more people in the pipeline and and their services or being met. I know we can do some services.'",
        "'speaker_0': 'While they're on or awaiting.'",
        "'speaker_3': 'Getting on the waitlist. But I just looking at the PowerPoint, which I have in front of me that you all presented to the the committee, I can't tell whether or not we're giving more services to individuals or whether we've gotten more people into the pipeline that need them.'",
        "'speaker_3': 'And again, it would be helpful to know kind of where are we on the waitlist as well?'",
        "'speaker_2': 'Absolutely. That's something that we connect with Rocky Mountain on fairly frequently. And I would love to set up a follow up with you and possibly share. Happy to do that. Little more. Yeah. Okay.'",
        "'speaker_3': 'Thank you. I have no further questions. I think.'",
        "'speaker_2': 'You know, this is a program.'",
        "'speaker_3': 'That Cathy Reynolds actually was the catalyst in, in moving forward by creating this special mill levy for the developmentally disabled community in Denver. And over time, it has. Since the inception, it's been the same entity doing this. And I know that they have to be approved through the state, but it it almost also violates our executive order'",
        "'speaker_3': 'that tries to put these things out to be it on a regular basis. And when it started, all of the different providers in our community were getting a share of these dollars to serve their their clients.'",
        "'speaker_0': 'And now it's kind of like the Rocky Mountain is is the sole entity that.'",
        "'speaker_3': 'You know, that is our community service provider through sort of approved by the state. But at the same time, some of those others have tried to gain access to the resources and some have been successful. Others have not been as successful.'",
        "'speaker_3': 'And so the access continues to be an ongoing.'",
        "'speaker_0': 'Concern and making sure that you all are tracking that. And I know that's part of why.'",
        "'speaker_3': 'You hold those extra dollars aside to ensure that the needs are.'",
        "'speaker_0': 'Being met in our community.'",
        "'speaker_3': 'So it would be helpful to have that.'",
        "'speaker_0': 'Follow up with you, to.'",
        "'speaker_3': 'Just understand a little bit more detail, kind of where are we with the waitlist and where are we in in terms of spreading those dollars further?'",
        "'speaker_0': 'Or are we putting more.'",
        "'speaker_3': 'Dollars into each individual that's already in the you know, in the system?'",
        "'speaker_2': 'Thank you. Certainly. And if it's okay, Madam President, I'd love to just create a couple of points of clarity there. I think you're right in the sense that we've worked with this energy for a really long time, and there have been times where that hasn't gone as well as I'm going right now.'",
        "'speaker_2': 'What I will say, though, is that they are because of their state designation and the role that they played in the community, they are kind of this nucleus for services in Denver and it is challenging and not really necessarily our intention to create different entry points for services when we have a population that is especially vulnerable and'",
        "'speaker_2': 'may have difficulty navigating a more complex system. So I would love to have more conversation with you about that. I think we've done a lot to try to diversify our provider network, and we're looking forward to doing more of that.'",
        "'speaker_2': 'And one of the things I would love to point all council members to, since this deadline is coming up, we actually have one of our new partners, Point B strategies is working with organizations on the smaller side to work with them on projects up to $10,000.'",
        "'speaker_2': 'And that application window is open until December 4th, which is Friday. And hopefully you you all are able to push that out quickly without.'",
        "'speaker_3': 'Cumbersome contracting.'",
        "'speaker_2': 'Nightmare. We do our best well following what's necessary to adhere to our contracting process, but I hear that feedback. Thank you so much. Okay. Thank you. Madam President.'",
        "'speaker_3': 'Thank you. I have no further.'",
        "'speaker_2': 'Questions or comments.'"
    ],
    "A bill for an ordinance approving an Amended Budget for 2020 and an Operating Plan and Budget for 2021 for the Five Points Business Improvement District. Approves the 2021 Operating Plan and Budget and amending the 2020 Budget for the Five Points Business Improvement District in Council District 9. The Committee approved filing this item at its meeting on 11-10-20.": [
        "'speaker_0': 'All right. Thank you, Councilman Ortega. Ah, and thank you, Crystal, as well. Our next item up is Council Bill 1271. And Councilmember Flynn, would you please put Bill 1271 on the floor for final passage?'",
        "'speaker_1': 'Certainly, Madam President, I move that council bill 20 dash 1271 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved. And we have a second from Councilman Hines. Questions or comments by members of council. Councilmember CdeBaca.'",
        "'speaker_2': 'Thank you. Madam President, this question is for legal. I tried several of the property owners within the five points did reach out to me about not having a voice in the board decisions, especially during the pandemic. And there's been a concern and a desire to lower the mill levy.'",
        "'speaker_2': 'The five points bid has, I believe, the highest levy of our bids and are probably the most some of the most marginalized businesses left. And so I'm wondering from legal, what is where is the right place for people who are taxed by the bid to be able to have a say so in the mill levy?'",
        "'speaker_2': 'And what is the what are the requirements around? Property owner participation in these operating plans.'",
        "'speaker_0': 'All right. Thank you for that question. And I had Michael Carrigan listed as our staff support and then Beth Moisi. And so I'll leave it to you to answer.'",
        "'speaker_1': 'Hey. Thank you for allowing me to speak today. And I'm not I'm not part of the city attorney's office, so I'll give my comments. And then maybe if there is a city attorney on the line, they can they can help fill in some of the questions, too.'",
        "'speaker_1': 'So regarding the the the places where the constituents can talk and voice their their concerns, their expressions about the the mill levy that is actually during the budget approval process. So all bids are required to submit a a an open public meeting for, for all of their constituents.'",
        "'speaker_1': 'And, and then at that meeting, that's the constituents can come in and talk about the the mills. They're going to be a set of the mills that are going to be led. And then they can also talk about how those dollars are going to be spent.'",
        "'speaker_1': 'And I am sorry I didn't catch the rest of your question.'",
        "'speaker_2': 'Well, I think it would actually be helpful to dove a little bit deeper on that. So at the meeting where the budget was decided upon, this was a conversation that was not allowed to occur. And so what? What happens then?'",
        "'speaker_1': 'So I was not at that meeting. So I. I don't know what happened at the meeting. I don't know. Is there is there maybe somebody from the the bid that they can make comments to that question?'",
        "'speaker_2': 'Hi. This is veteran whiskey with the Downtown Denver Partnership. And we do work on behalf of the five points. We we help manage the meetings. But I also wanted to call out board director Ryan Carbons, who is on the call as well.'",
        "'speaker_2': 'And he was present at those public meetings. All the bid, all the five points board meetings are open to the public.'",
        "'speaker_1': 'That's right.'",
        "'speaker_2': 'Yeah. And Ryan, you know, I was president and that was raised in the chat because there were only the executive board is allowed to participate in the virtual decision making. And I made it clear that there were other people on the call who wanted to discuss the mill levy.'",
        "'speaker_2': 'And Paul said that that was not a topic of discussion.'",
        "'speaker_1': 'I appreciate that, Councilwoman CdeBaca. I may tend to disagree, of course, in terms of the fact that we had several opportunities for public comment in the reminding ourselves as well that as I was part of the Five Points Business District Board that birthed the video and had a very extensive community meetings surrounding the amount of mill levies'",
        "'speaker_1': 'and what that tax look like. And of course, in order for the bid to pass, we needed the involvement of all the stakeholders which were the property and business owners along Wheldon Street. And so and I'm reminded that, you know, although our I believe we're at ten mills, the Cherry Creek area is at 15 mills.'",
        "'speaker_1': 'And so.'",
        "'speaker_2': 'So the question is, was it discussed at the budget meeting?'",
        "'speaker_1': 'So these pieces were discussed at the budget meeting this year. This year, yes.'",
        "'speaker_2': 'Can you provide that recording?'",
        "'speaker_1': 'I don't hold those recordings, but I can obviously seek those out. And I think this has been a point of conversation that we've had in terms of making sure that we address some of the concerns that you have coming before the vide meeting.'",
        "'speaker_1': 'And I know you've just concerns regarding folks that had dissension on the bid and challenges with the bid and where they were, where we were at tax wise. I know we've asked those questions in terms of let's reach out to those to make sure that those folks, whoever have questions, get those questions answered.'",
        "'speaker_1': 'In addition to that, making sure that we also reach out to those legacy business owners, and so trying to figure out who they are, I guess, is the question.'",
        "'speaker_2': 'While it's the.'",
        "'speaker_1': 'Participation.'",
        "'speaker_2': 'Dr. Cousins and Ms.. Steiger have both brought up reducing the mill levy. And there's never been a board discussion. They've never had that question entertained.'",
        "'speaker_1': 'And just so we know, those aren't just regular folks in our community. Those are actual you know, Dr. Cousins King was actually a board member of the bid. Correct. Ms.. Stiger is obviously a current member of the bid.'",
        "'speaker_1': 'And for her for us to have a conversation, of course, in a discussion is very simple for her. I have never heard either one of those parties raise those issues. And of course, I am also there at Coffee at the point every single day.'",
        "'speaker_1': 'And so.'",
        "'speaker_2': 'Mr. Carrigan, is it possible, since this is not a single reading resolution and this is a bill, is it possible for us to delay this one, to make sure that we get some of those property owners in to speak about their desire to lower the mill?'",
        "'speaker_1': 'So this is actually the second reading for this ordinance. And a city or a state statute does require council to vote on the D.A. budgets by December 5th every year. But today is actually the last opportunity. And, you know, those property owners did have an opportunity to speak at those board member those board meetings and very public'",
        "'speaker_1': 'comment section. So there's really not an opportunity at council for additional comments to be heard by but by those by those property owners.'",
        "'speaker_2': 'But what I'm explaining to you is that they they have raised this concern and it has not been addressed. What recourse do they have as property owners that are taxed by this, Mel Levy.'",
        "'speaker_1': 'If you don't mind, Mr. Carrigan, if I take 2 seconds on that one, the five Points Business Improvement District is something that years ago was on a wish list for us as the Five Points Business District Board. And to be clear.'",
        "'speaker_1': 'Part of the feeling, of course, my business celebrated its 10th year anniversary right at well in 27 a week and a half ago. Part of what we feared in our area is that Fivepoint wasn't being taken serious. Our feeling was we did a tremendous amount of work to pass the bid.'",
        "'speaker_1': 'A tremendous amount of work to pass the video with incredible amount of community engagement and investment in other individuals to help us ensure that we're reaching our our are not just our property owners and our business owners, but also our neighbors, our residential residential neighbors as well.'",
        "'speaker_1': 'The two individuals, Councilwoman CdeBaca, that you refer to, have probably just a voice in our neighborhood, but probably one of the loudest, louder places in our neighborhood. Steiger and Dr. Cousins came. You know, if there is dissension among those two individuals that I have not heard of from attending just about every community meeting going back to ten'",
        "'speaker_1': 'years and including the surrounding meetings, even with the rhinos that exist in five points, you know, I will personally, based on you, will reach out to them to see if they have questions. But I see no reason why to hold up the process, to further set our neighborhood back.'",
        "'speaker_1': 'I just I appreciate your time.'",
        "'speaker_0': 'Thank you, Mr. Collins. And this? The city would be out of compliance. If we entertain a motion to delay. We do have this on the floor for final consideration for a vote. And so just want to make that reminder.'",
        "'speaker_0': 'Next up, we have Councilman Hines.'",
        "'speaker_1': 'Thank you, Madam President. I just want to ask someone from the city. Wow. That so wise state statute. We have to vote by December 5th. What? What happens if we say no? So if you do not accept the the the budget tonight, the the budget would be and I'm paraphrasing because I'd have to go back and actually'",
        "'speaker_1': 'look at state budget law. But I believe that the district has to operate on the approved 2019 budget. And then I think there's there's some sort of a reduction take off of that budget as well. But I'd have to I have to do a little research to find that exact language for you.'",
        "'speaker_1': 'They approved the 2019 budget, even though this has been 20. Oh, sorry. The the approved 2020 budget. Sorry. Okay. Uh. Okay. Does anyone here able to answer what the 20 what the differences between the 2020 and the proposed 2021 budget is is there a significant dollar difference?'",
        "'speaker_0': 'I can go ahead, Mr. Collins.'",
        "'speaker_1': 'Yes, I can. I can pull that up. It'll take me a quick second. There is a 2020 versus 2021 on here. Yeah. So that I've got that too. So in addition to what you guys are approving tonight, you're approving an amended 2020 budget which approves a projected actual column of the budget.'",
        "'speaker_1': 'So the 2021 amended budget, what you what you be approving is $377,661 in total expenditure. And then the 2021 budget is $271,461 in total. And what what about. So, so thank you. But if we were to vote no, we would vote no.'",
        "'speaker_1': 'Also on the amended 2020 budget. So we would, by default adopt the unamended 2020 budget which we adopted council adopted last year. So what would that number be? So that was 275,116. So 275 116 And then the proposed 2021 budget is 50 something to 71 for 61.'",
        "'speaker_1': 'Okay. All right. So if we said no. We would theoretically be throwing a five point bid that they should lose about 20 K And then, Mr. Kerrigan, you mentioned that maybe there's a penalty as well, some sort of discount.'",
        "'speaker_1': 'Yes, I think it's I think it's a prescribed percentage reduction. And I can remember with that with that exact percentages. Okay. Thank you. Thank you both for your for your answers. I I guess that as Councilmember CdeBaca mentioned, this is one of our most underserved communities.'",
        "'speaker_1': 'So I have reservations in and in making them even more underserved. But I'll just leave it at that. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Hines. And so Council Member CdeBaca, we have this on the floor for a vote. Or are you looking to do a motion to delay?'",
        "'speaker_2': 'I. Is it possible to delay since we're at a compliance, or is there a possibility to reopen it mid-year?'",
        "'speaker_0': 'Michael, is that an opportunity to open it mid-year?'",
        "'speaker_1': 'I guess I don't understand what you mean by open it mid-year. Can you elaborate a little bit on that, please?'",
        "'speaker_2': 'So what you're hearing right now between myself and Mr. Corbyn's is at odds and there is video that could clarify. In fact, I think I see Jessie Perry's on the call right now, and he mentioned he could get Ms..'",
        "'speaker_2': 'Stiger on the call or speak to his experience in those meetings. He's participated in all of those meetings as well. And the way that it was classified by Mr. Coleman's is not true. There have been several concerns. And for Councilman Hines, I understand that on its face it may sound like you would be disadvantaging a disadvantaged area'",
        "'speaker_2': '. The issue here is that you might actually save businesses that are going out of business because they can't afford the levy imposed on them. And so that is why we should be listening to the property owners in this bid who are saying they can't they simply cannot afford the ten mills, not before the pandemic, and especially not'",
        "'speaker_2': 'now during the pandemic. And so my concern is that, you know, people could very well lose property if we don't act to lower this mill.'",
        "'speaker_1': 'May I respond.'",
        "'speaker_0': 'Sir? Well, the first. The first thing is, is that we don't have that power by council to do that right now, because we're not the board. And so I know we've talked about this quite a bit. This did come through thin gov.'",
        "'speaker_0': 'And unfortunately, we're ending up doing a lot of committee work to nine eight on the floor. And so I it doesn't sound like there's an opportunity to open this up midyear. We have a motion on the floor to vote on this.'",
        "'speaker_0': 'Or the only other option is. Councilwoman, for you to make a motion to delay it. But you would have to have a majority vote of council in favor of delaying it. And I don't believe that you're going to have that support tonight on it.'",
        "'speaker_0': 'And so right now we have it on on the floor. And so I'm going to go ahead. And we haven't heard from Councilman Herndon tonight on this one. And just a quick reminder, we have one more question, and then we do have five public hearings scheduled tonight, albeit three, that we're going to gavel in and gavel out'",
        "'speaker_0': 'of. But I want to be cognizant of the members of the public who are also joining us here tonight. So, Councilman Herndon.'",
        "'speaker_1': 'Yes, ma'am. I was just going to kind of go back to our responsibilities. As I mentioned earlier, we are going to approve a budget. It's either the 2021 that the the 5.3 idea worked through and went through the process or we vote no.'",
        "'speaker_1': 'And as Mr. Carrigan explained, we go back to the previous year's budget and I've not heard a compelling reason at all to not support the budget. So I would when we hopefully get to this vote really soon, I want to I will I will be voting yes.'",
        "'speaker_1': 'And I appreciate Mr. Comments for all his work that he does in five points. Thank you, Mr. President.'",
        "'speaker_0': 'Very good. Thank you. Well, we have a motion on the floor. Madam Secretary, roll call, please.'",
        "'speaker_2': 'CDEBACA No. Clark.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Hines. Cashman.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Can each I. Ortega. I. Sandoval. I swear, I. Torres, I. Black I.'",
        "'speaker_3': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_2': 'One Ni 12 I's.'",
        "'speaker_0': '12 I's Council Bill 1271 has passed. The next item up is Council Bill 1200. Councilwoman CdeBaca, please go ahead with your questions on Bill 1200.'",
        "'speaker_2': 'Thank you, Madam President. Who is on the call for the project?'",
        "'speaker_0': 'Jason Gallardo.'",
        "'speaker_2': 'I'm actually looking for the applicant.'",
        "'speaker_1': 'Yeah, I think we need to upgrade. Steve Ferris. Ferris?'",
        "'speaker_0': 'We've got him in the queue. Go ahead with your question.'",
        "'speaker_2': 'Mr. Ferris, I'm curious about this vacation. Originally, it seemed like it set up the ability to have private parking. With vacated public land. And then I understand you all got permits to encroach in the right of way so that there public spaces.'",
        "'speaker_2': 'I'm curious about how that will be possible because are you not protecting managed in road into those public spaces.'",
        "'speaker_1': 'Me, I guess. What we have is a former right of way. If vacated, that would have an easement. Or utilities underneath it. So we couldn't remove that roadway. We couldn't build on top of it. In other words, either the driveway would remain and then the six parking spaces you referred to are going to be in public land'",
        "'speaker_1': ', 20th Street right away that is not being vacated. So I guess I'm trying to get my head around your question, but I believe by telling you that, you know, that that easement in that driveway will be remaining, there will always be access to those six parking spaces.'",
        "'speaker_1': 'Does that help?'",
        "'speaker_2': 'Kind of. I'm looking at the picture and trying to understand how someone would access those parking. Are they on the street?'",
        "'speaker_1': 'Yes. Those six bases and I can share a screen if everybody else wants to see it are going to be in 20th Street. Right of way. Okay. You got me.'",
        "'speaker_2': 'And I asked Jason earlier if they were going to be metered spaces because it's predominantly a metered area. And he said that they are not going to be metered. Can you explain, Jason, what the thinking is around that?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_4': 'So my comment is.'",
        "'speaker_1': 'At this time, we don't have a plan to meter those spaces, but that doesn't mean that we won't be moving forward with meters if the site eventually gets approved and moves forward where it's just too early for us to do a parking assessment with our team, our parking assessment team, to be able to go there and find'",
        "'speaker_1': 'out the best way to meter these if if it is to meter and we're not neutral, we just can't answer that question yet is too early.'",
        "'speaker_2': 'So what is the square footage split between the parking's and the rest of the land vacated?'",
        "'speaker_1': 'The land being vacated is just under 3000 square feet. The six public spaces that we see, I guess I'm looking at, they're not even measured in the sense that they're in 20th Street right away, that subject to an encroachment permit and a transportation engineering plan, both approved by Doty.'",
        "'speaker_1': 'But I mean, the average parking space is 300 square feet, so you could say it's 1800 square feet in those six spaces. And then, of course, we also constructing that pedestrian walkway, an accessible route, also into 20th Street right away in and around those six parking spaces.'",
        "'speaker_2': 'Got it. And so. There was something in your application that said that the plan was to in the future that this would this vacation would contribute to another project. Is that correct?'",
        "'speaker_1': 'I might have been the only project we were referring to at that time. You know, we've been working on this for 18 months and there's about six different permits from zoning to engineering plans to variances, and I mean several.'",
        "'speaker_1': 'So I might have been it's all one project with an encroachment permit with six different permits. So maybe I was referring to that those relationships. Got it. I don't recall. It's never been there's only been one project planned here, and that is a 17 car parking lot.'",
        "'speaker_2': 'Got it. Just making sure that there was nothing else. That's it for my questions on this one, Madam President.'",
        "'speaker_0': 'Right. Thank you, Councilwoman CdeBaca. That concludes our items to be called out. All bills for introduction are ordered, published. And Mr. Farris, we're just going to ask you if you could remove your screen sharing for us, sir.'",
        "'speaker_1': 'Madam President.'",
        "'speaker_0': 'Oh, I'm sorry. That's right. Councilman Hines, I'm so sorry I had the wrong view up, and so go ahead with your question, Councilman.'",
        "'speaker_1': 'Thank you, Madam President. I'm sorry. I have questions for a couple of questions as well about the the vacation. It appears that the purpose that you intend to use the land for is a parking lot. Right. Mr. Harris.'",
        "'speaker_1': 'You're muted if you are, which is. I thank you. I got unmuted. I thought we were stepping away and I forgot. But yes, there's up. The parking lot will be on land to be vacated and land to be maintained is right of way.'",
        "'speaker_1': 'But of course, as part of that parking lot and it was part of the understanding when we first proposed this plan that we would construct that walkway and accessible route to a wider up from the backside of the King Soopers there.'",
        "'speaker_1': 'So this parking lot is for that. Theoretically, the people who would part in this lot would be going to King Soopers. If if they wanted to go to King Soopers, they could park in the public spaces. We intend most of the 11 spaces to be serving the existing retail operation that's there now.'",
        "'speaker_1': 'It's a two story building. Okay. Some other businesses way. So how did how do people get to these other businesses now? The business that is there, the retail marijuana shop is not is. I think people are walking or biking to it.'",
        "'speaker_1': 'There isn't really any parking serving. I think there's one spot in the front. I'll have to look, I think, as I recall. But otherwise there is very, very limited. And you want to add 17 spaces or 11 spaces.'",
        "'speaker_1': 'To serve a retailer that. Currently all their customers walk or drive. Well, we've what we believe and this is that they their Canada has asked they have a 13 year lease, an option to extend for another ten. The business is thriving, but they feel that parking is an is in demand in that area.'",
        "'speaker_1': 'And there's a there's a shortage of it. And they feel it's part of the lease and part of the services they provide would be assisted by having more parking. Okay, so I noticed that the accessible cost of travel and all the accessible parking spaces are in the right of way.'",
        "'speaker_1': 'But non-vaccinated right away is what let's say we we don't know for the vacation. Are you going to proceed forward with a lot? And with a smaller amount of parking. Or you see it at all. We're not going to proceed at all because we have to package it as a work, as a as an investment for the'",
        "'speaker_1': 'time and money. To do it without the vacation is what we look at in our analysis. And so who's profiting? So there are no meters on the spaces. There are. This is a public life. So you say that the finances it doesn't make it is unprofitable.'",
        "'speaker_1': 'How is someone profiting? From public parking spaces without meters. Well. We came in with this plan that we wanted to try to construct parking there, and we started talking to the city about how to do that. And they pointed out that the Division Street right of way and the small section of a water in the front of'",
        "'speaker_1': 'the lot really impeded our ability to get access to any parking. So we discussed how best to do that. And they there was an interest in this accessible walkway and we said and there was interest in public parking.'",
        "'speaker_1': 'And however the city decides there are six spaces are metered or left for the public. Either way, we're not we're not planning on using them for the business. And that's that's up to the city. And we're flexible on how they want to provide that or limit that access.'",
        "'speaker_1': 'It's it's kind of like on street parking, as far as we're concerned. It's it's not under our control. But to answer your broader question, I think about why we found out that we couldn't get access to the internal lot without requesting the vacation of Division Street.'",
        "'speaker_1': 'Right of way. If you look at the site. Okay. You want me to share it again? No, no, no. I get what you're saying now. Okay. Thank you. The reason this curiosity is because all of the accessible improvements are dependent on the vacation.'",
        "'speaker_1': 'And as someone who would use that, I just I don't want to I want to make sure that we're if we're going to install a parking lot, that it isn't using a justification of the disability community to put in a line that may or may not actually be available to people with disabilities.'",
        "'speaker_1': 'But and that's let me add that's a fair question. You know, that would we proposed ten car lot I believe we would have one accessible space. We proposed seven 1617. So the ratios required us to provide to where we put them wasn't as important.'",
        "'speaker_1': 'They just seemed to fit over there best in, in, in the layout of the site. We could have put them on private property, too. It really wasn't a deciding factor. You know, we we just they it was the way the design work that they they take up more space and they fit well.'",
        "'speaker_1': 'They're we're happy to I think they're I think they're great that they're public. But it's not it wasn't like they were. We insisted on that. So long as you're in compliance with FDA, I'm not going to. I don't think this is the reform you talked about.'",
        "'speaker_1': 'So thank you. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Hines. Glad we were able to get your final questions in there. All right. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember this is a consent or block vote and you will need to vote.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Council Member Flynn Will you please put the resolutions for adoption and bills on final consideration for final passage on the floor?'",
        "'speaker_1': 'Muted.'",
        "'speaker_0': 'Oh, you're muted. Council and offline.'",
        "'speaker_1': 'You're muted. We can't hear you either.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'Thank you. You go. All right.'",
        "'speaker_1': 'Sometimes I click it and it works and sometimes it doesn't. I move the resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in a block for the following items. All series of 2020 1188 1330, 1331, 13, 32, 1333, 1334, 1335, 1340 1339 1349 1350 1357, 1114 1228, 1265, 13, 28, nine'",
        "'speaker_1': ', 28, 11, 17, 13, 16, 13, 24, 13, 25, 1343, 1189, 12, 70, 12, 72, 12, 73, 12, 74, 12, 75, 12, 76, 1277, 12, 78, 1279, 12, 8012, 81, 12, 82, 12, 83, 12, 84, 1285, 1149 1211 92.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you, Councilman Flynn. It has been moved and seconded by Councilman Ortega. Madam Secretary, roll call, please.'",
        "'speaker_2': 'Black eye. CdeBaca. I, Clark.'",
        "'speaker_1': 'I. Flinn i.'",
        "'speaker_3': 'Herndon.'",
        "'speaker_1': 'I. I.'",
        "'speaker_2': 'Cashman. I can. H. I. Ortega. I. Sandoval. I. Sawyer. I. Torres. I. Madam Secretary.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_3': '13 eyes.'",
        "'speaker_0': '13 eyes. The resolutions have been adopted and bills have been placed upon final consideration and do pass. Tonight, there will be a required public hearing on Council Bill 1123, changing the zoning classification for 2483 South Josephine Street. A required public hearing on Council Bill 1124.'",
        "'speaker_0': 'Changing the zoning classification for 1634 Xenia Street. A required public hearing on Council Bill 1162 Changing the zoning classification for 2580. South Clarkson Street and Council will convene separately as the Board of Directors of the Reno General. Denver General, just Denver excuse me and will convene separately as the Board of Directors of the Reno for General Guide'",
        "'speaker_0': ', General Improvement District, Denver, 14th Street and Gateway Village Improvement District to approve a work plan, adopt a budget, impose capital and maintenance charges, and make appropriations for the 2021 fiscal year for each district. Anyone wishing to speak on any of these matters must go online and sign up during the recess of council.'",
        "'speaker_0': 'If there are no objections from members of council, we will take a ten minute recess. Members, please remember to turn off your cameras and mute your microphones and we will return at 7:26 p.m.. Thank you.'",
        "'speaker_5': 'The magical spirit of the season comes to life in this acclaimed production and beloved holiday favorite. Tune in to view this special presentation of Colorado Ballet's The Nutcracker on Rocky Mountain, PBS. It premieres on Thanksgiving at 7 p.m..'",
        "'speaker_5': 'Your Colorado Symphony is pleased to unveil an on demand digital video and audio content portal called Virtual Stage, featuring new and never before seen content from the Colorado Symphony go to Colorado Symphony dot org. For tickets and more information, enjoy the holiday safely at both the Gardens, York Street and Chatfield Farm locations with the blossom of lights'",
        "'speaker_5': 'and the Trail of lights. Go to Botanic Gardens dot org for guidelines and ticket information for both events. This year's parade will be a multi-week, socially safe extravaganza of activities across downtown. The parade floats will span from Denver pavilions to Union Station, offering multiple chances for you to relish in the charm and excitement of the holiday season'",
        "'speaker_5': '. Go to downtown Denver accom. For more information. It's official. Zoo Lights has been making magic memories and even marriages for 30 amazing years. Don't miss this year's historic celebration. Tickets are only available online at Denver Zoo, dawg. The 20th annual Denver Chris Kindle market is moving to a spacious open air location in Civic Center Park.'",
        "'speaker_5': 'Go to Chris Kindle market Denver dot com for more information. The Clyfford still, M.K. Denver and Kirkland Museums, along with the History Colorado Center, are closed to the public to comply with the state's recent public health order. We will let you know when they are able to reopen.'",
        "'speaker_5': 'In the meantime, stay connected by checking out their virtual programing. Most are free. Please stay safe out there. And that's a quick look at what's happening in Denver this week. This week on your city. Now, officials enlist new measures in the COVID 19 battle and the expansion of housing opportunities continues.'",
        "'speaker_5': 'These stories are just ahead on your city now. As the second wave of COVID 19 infections continue to spread across the nation, Colorado officials have updated the state's dial system in an effort to mitigate the need for a full lockdown.'",
        "'speaker_5': 'The state has moved Denver to the new red level as of 5 p.m. on November 20th. Thus, new restrictions are in place across the city. Indoor dining has been suspended and the consumption of alcohol must end by 8 p.m..'",
        "'speaker_5': 'But outdoor dining, as well as pickup and delivery options, are still open. Offices and gyms are limited to 10% capacity. Retail operations can stay open, but are limited to 50% capacity. Denver DMV offices will cease all in-person operations as of Monday, November 23rd.'",
        "'speaker_5': 'With the holidays, it's important to do everything possible to keep yourself and your loved ones safe while celebrating. Personal gatherings are prohibited under the new level. It has been advised you only interact in-person with people from your household and don't travel to visit family and friends.'",
        "'speaker_5': 'Continue to wear your mask and keep six feet of distance from others while in public. The new restrictions will be in place until at least December 18th. Housing on Colfax Avenue is changing as several multi-family developments are being proposed along what was once called the longest wicket of street in America.'",
        "'speaker_5': 'Here are some examples. On East Colfax, near Downing, there are plans to possibly tear down the Ramada Inn Hotel and replace it with a seven story building with 300 plus units. Further west, development plans have been filed for the 55 acres directly south of Empower Field at Mile High.'",
        "'speaker_5': 'Plans would include a mixed use neighborhood with market rate and affordable housing office, entertainment, hospitality and other stadium related land uses. One of the more unique proposals comes from Tucson, Arizona, based Startup Steakhouse. They plan to offer tiny homes out of 320 square foot shipping containers, with prices starting at $45,000.'",
        "'speaker_5': 'Stackhouse is currently under contract for a quarter acre site at West Colfax and Knox Court, where the company hopes to build a five story tower that can house 50 of the so-called alternative living units. Earlier this year, Denver Parks and Recreation closed all internal roads and parking lots in the parks to avoid crowding and promote physical distancing'",
        "'speaker_5': 'during the pandemic. Now, Parks and Rec is asking for your opinion via a survey about making this a permanent change.'",
        "'speaker_1': 'There's actually a variety of considerations that go into it. So obviously, if we're reducing vehicular through traffic, we're reducing the potential for pet and bike conflicts and can make an enhanced park user experience. It's a little quieter. There's a little more space to use.'",
        "'speaker_1': 'Obviously, there are other considerations that come into play. Our parks have regional attractions and regional destinations that obviously have a need for vehicular access and loading, like pavilions or large athletic fields. We want to make sure that we are providing an appropriate added parking access so that everyone can access these parks.'",
        "'speaker_1': 'So it's sort of balancing those considerations. We've been able to sort of through our day to day field operations, see how people have repurposed the streets and get individual feedback. But as we continue to evaluate whether there's opportunities to keep park roads or portions of park roads closed in the long term, we want to make sure we'",
        "'speaker_1': 'have a broader perspective and get as much feedback as we can through our online survey.'",
        "'speaker_5': 'The survey is open through November 30th. Denver City Council unanimously approved a rezoning of the Chaffee Park neighborhood to allow accessory dwelling units throughout that northwest Denver area.'",
        "'speaker_2': 'To rezone 1400 doors with no comments or questions from my colleagues. I was pretty shocked and really surprised. It was a great win. Chaffee Park neighborhood came to me as the councilwoman in 2019 after I was elected and asked if I would be interested in working with the neighborhood to rezone the entire neighborhood.'",
        "'speaker_2': 'It allows people to build a smaller apartment type structure in the backyard, and they can use it for a long term rental. They can use it for a short term rental. It adds some stability to a neighborhood and allows somebody the ability to build an accessory dwelling unit and have another source of income so that they can'",
        "'speaker_2': 'stay within the neighborhood.'",
        "'speaker_5': 'To learn more, visit Denver Gov dawg. You can catch new episodes of your city now every Friday. Thanks for watching Denver. The magical spirit of the season comes to life in this acclaimed production and beloved holiday favorite. Tune in to view this special presentation of Colorado Ballet's The Nutcracker on Rocky Mountain, PBS.'",
        "'speaker_5': 'It premieres on Thanksgiving at 7 p.m.. YORK Colorado Symphony is pleased to unveil an on demand digital video and audio content portal called Virtual Stage, featuring new and never before seen content from the Colorado Symphony go to Colorado Symphony dot org.'",
        "'speaker_5': 'For tickets and more information. Enjoy the holiday safely at both the Gardens, York St and Chatfield Farm locations with the blossom of Lights and the Trail of lights. Go to Botanic Gardens dot org for guidelines and ticket information for both events.'",
        "'speaker_5': 'This year's parade will be a multi-week, socially safe extravaganza of activities across downtown. The parade floats will span from Denver pavilions to Union Station, offering multiple chances for you to relish in the charm and excitement of the holiday season.'",
        "'speaker_5': 'Go to downtown Denver AECOM for more information. It's official Xu Lites has been making magic memories and even marriages for 30 amazing years. Don't miss this year's historic celebration. Tickets are only available online at Denver Zoo North.'",
        "'speaker_0': 'We have six public hearings tonight. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses. When called upon, please wait until our meeting hosts promote you to speaker.'",
        "'speaker_0': 'When you're promoted, your screen will flash and say Reconnecting to meeting. Please do not leave the meeting. You will be reconnected and you will need to turn your camera on if you have one on your microphone. If you signed up to answer questions, only state your name and note that you are available for questions of counsel.'",
        "'speaker_0': 'Speakers will have 3 minutes. There is no yield enough to time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted. You will see your time flash on the screen when you have 30 seconds left.'",
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members as a whole. Please refrain from profane or obscene speech and please refrain from individual or personal attacks. Councilmember Flynn, will you please put Council Bill 1123 on the floor for final passage?'",
        "'speaker_1': 'Go. Yes, Madam President, I move that council bill 20 dash 1123 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 Dash 1123 is open. May we please have the staff report?'",
        "'speaker_3': 'Let me know if you can see my screen.'",
        "'speaker_0': 'And how we can see it. And we just need you to put it in. Full screen for presentation.'",
        "'speaker_3': 'That is not working.'",
        "'speaker_0': 'Thanks for an.'",
        "'speaker_2': 'Excellent.'",
        "'speaker_3': 'Good afternoon, members of City Council. My name is from Pineville and I'll be presenting tonight an overview of the Map Amendment four 2483 South Justice Street. The subject property is located in Councilman Paul Cashman, District six. In the University Park neighborhood.'",
        "'speaker_3': 'The subject property is between Wesley Avenue and Harvard Avenue, and it's only one block east from University Boulevard. The subject so note is approximately 7500 square feet and the applicant is proposing to rezone the property from. You as you see to you, as you see one Southern district which allows for the Urban House and the touch accessory'",
        "'speaker_3': 'dwelling unit building for us. The maximum height for a house is 30 to 35 feet and 24 feet for the Dutch. 80. The property is currently in the urban single unit season district, which allows for a minimum standard of 5400 square feet.'",
        "'speaker_3': 'And as you can see on this map, most of the surrounding properties are also sold. U.S. you see with some U.S. you d to the south and grx5 to the west. Site is currently occupied by a single unit home and it is surrounded by mostly other single unit uses to the north, east and south by you can'",
        "'speaker_3': 'see out to the west there is some mixed land use. This lake here shows the existing area with the site of the proposed rezoning on the top right and on the bottom right. On left, you can see some images that show the character of the neighborhood.'",
        "'speaker_3': 'So you can see in the bottom left the five story building to the west. Speaking to a process. Information on notice of the application was sent on July 21st, 2020. Planning Board recommended approval on September 30th, and notice of this public hearing was sent on November nine and the property was appropriately notice of present.'",
        "'speaker_3': 'One letter of support from the I.R.A. and three letters of support from the public have been received. The Denver zoning code has five review criteria, which I will go. The first criteria is that the rezoning request must be consistent with adopted plans.'",
        "'speaker_3': 'Therefore, adopt the plans that apply to the request rezoning. We have a comprehensive plan. 2040 Blueprint. Denver Housing and Interest. Denver and the University Park Neighborhood Plan approved in 2008. The rezoning is consistent with several of the tragedies in comprehensive plan 2040, but I'll go over a couple of them.'",
        "'speaker_3': 'This MAP amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead to an environmentally resilient Denver by promoting infill development where infrastructure and services are already in place. Now looking at blueprint Denver the subject properties map as part of the urban neighborhood context.'",
        "'speaker_3': 'This context is described as containing small, multi-unit, residential and mixed use areas that are typically embedded in one unit and two unit residential areas. Look, buttocks are generally regular with a mix of alley access and they have been described as having a high degree of walkability, likability and good access to transit with less reliance on cars.'",
        "'speaker_3': 'Now the future places map designates the subject property as low residential place type. This place types have predominantly two single and two unit uses, and accessory dwelling units are appropriate. Josephine Street is designated as a local street, which is mostly characterized by residential uses.'",
        "'speaker_3': 'But it's important to note that the property is only one block east from University Boulevard, but it's a mixed use arterial. The growth area in Blueprint. Denver is full of areas of the city. This area is anticipated to see a 10th percent employment growth and 20% housing growth by 2040.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2483 South Josephine Street in University Park. Approves a map amendment to rezone property from U-SU-C to U-SU-C1, located at 2483 South Josephine Street in Council District 6. The Committee approved filing this item at its meeting on 10-20-20.": [
        "'speaker_3': 'Blueprint also has specific policy recommendations. So the housing policy number four talks about diversifying housing choice through expansion of accessory dwelling units. Throughout all residential areas and a city wide approach to enable it to use is preferred. But until holistic approach is in place, individual rezonings to enable you to use in all residential areas, specifically where tools'",
        "'speaker_3': 'to transit are appropriate. In this case, the request rezoning is a single loading a residential area only one block away from a bus stop. So this rezoning to use on district will have minimal impacts in the surrounding neighborhood and is consistent with blueprint recommendations.'",
        "'speaker_3': 'The University Park Neighborhood Plan was adopted by Denver City Council in 2008 and applies to the subject site. The overarching theme of the University Park Neighborhood Plan is to create and nurture a community that accommodates wide variety of uses and people in an environment that enhances the quality of life for residents.'",
        "'speaker_3': 'The proposed rezoning to USOC one is consistent with the following urban design and land use goals. Goal number two Residential neighborhood character stability preserve the single family nature of the University Park Residential Neighborhood and respect their design and the architectural character of established and preferred residential forms.'",
        "'speaker_3': 'And Goal Number four Diverse housing options in appropriate locations. Diversify the mix of housing types near trusted amenities to allow residents to age in place, live without the daily use of care and accommodate the housing needs of empty nesters, students, young professionals and families.'",
        "'speaker_3': 'Adopted in 2018. Housing and inclusive. Denver was not adopted as a supplement to Denver Comprehensive Plan 2040, but was still adopted by City Council and can be considered relevant criteria for this MAP amendment. The plan encourages expanding the development of accessory dwelling units to incentivize affordable and mixed use housing.'",
        "'speaker_3': 'Stuff also finds that of the proposed rezoning to USOC, one meets the next two criteria. It will result in the uniform application of social district building for use and design regulations. And the proposed official MAP Amendment furthers the public health, safety and general welfare of the city through implementation of the city adopted land use, which recommends the'",
        "'speaker_3': 'expansion of accessory dwelling units throughout all residential areas. The proposed rezoning would also provide the benefit of an additional housing unit that is comparably integrated into surrounding neighborhoods. The justified circumstance for this rezoning is clear of the plan since the approval of the existing yes, you see some district.'",
        "'speaker_3': 'The city has adopted the Comprehensive Plan 2014 Blueprint, Denver Housing and Inclusive Denver and University Park Neighborhood Plan as stated throughout this presentation. The proposed rezoning meets the intent of this plan's. Lastly, the proposed zoning is consistent with the urban neighborhood context residential districts and the USOC one stone district.'",
        "'speaker_3': 'Stuff that's to recommend approval based on finding or review criteria has been met. And that concludes stuff. Presentation. Thank you.'",
        "'speaker_0': 'All right. Thank you, Fran. Council has not received any written comments on Council Bill 1123 and we have one individual signed up to speak and we will go ahead and get started. We have Jesse Paris. App and friend will go ahead and ask you to pull down the slide deck for us and.'",
        "'speaker_4': 'The member of the council. My name is Jesse Harris and I represent a four member home of now Black Star Action Movement for Self, the fifth Positive Action Commitment for Social Change, as well as the related party of Colorado and Mile-High News and I will be the next November 2023.'",
        "'speaker_4': 'I am in favor of this rezoning tonight. Good job, Cash. Man, you got this. I support especially dwelling units all over the city, just like I support tiny villages that say Balboa camps. So I am here tonight and got this cash.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. That concludes our speakers questions from members of council. All right. Seen no questions by members of council. The public hearing for Council Bill 20 Dash 1123 is closed. Any comments by members of Council?'",
        "'speaker_0': 'All right. I'm not saying. Oh, there you go, Councilman Cashman.'",
        "'speaker_1': 'Yeah. Thank you, Madam President. I just wanted to say, I believe this application clearly meets all the criteria. It's a great location for a block off of University Boulevard. It's about a ten block walk from a light rail station.'",
        "'speaker_1': 'The University of Denver campus is just across the University Boulevard and a block up. And my my only concern I just wanted to express about AIDS in general is I wish we could figure out a way to keep them from being used as short term rentals.'",
        "'speaker_1': 'I really love 80 used as an addition to our housing stock for residents. And as much as I believe paid short term rentals probably have a place in our community, I don't like to see them taking up accessory dwelling units, personal opinion.'",
        "'speaker_1': 'But I will be supporting this and I hope my colleagues will join me.'",
        "'speaker_0': 'All right. Thank you. Councilman Cashman, seen no other comments by members of council. I'll just throw in that saying that this meets all the review criteria. I will be voting in favor of it as well. Madam Secretary, roll call.'",
        "'speaker_3': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Can. I. Ortega. I. Sandoval. I.'",
        "'speaker_3': 'Sawyer.'",
        "'speaker_2': 'I. Torres, I. Black Eye. CdeBaca, I.'",
        "'speaker_1': 'Park I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Hi.'",
        "'speaker_1': 'Hi.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1634 Xenia Street in East Colfax. Approves a map amendment to rezone property from E-SU-Dx to E-SU-D1x, located at 1634 Xenia Street in Council District 8. The Committee approved filing this item at its meeting on 10-20-20.": [
        "'speaker_0': '13 Eyes Council Bill 20 Dash. 1123 has passed. Councilmember Flynn. Will you please put Council Bill 1124 on the floor for final passage?'",
        "'speaker_1': 'Certainly I moved the Council Bill 20 1124 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved again. Thank you, Councilwoman Sawyer. The required public hearing for Council Bill 20 Dash 1124 is open. May we have the staff report?'",
        "'speaker_3': 'Okay. Let me know if you can see this one. All right. Okay. Is that working?'",
        "'speaker_0': 'Uh huh. Thanks, Fran.'",
        "'speaker_3': 'Okay. This is going to sound repetitive because it's very similar. So. My name is from Benefield, and I'll present an overview of the MAP Amendment for 1634 Cynthia Street. This one is located in Councilman Chris Herndon's District eight.'",
        "'speaker_3': 'In the East Colfax neighborhood. The subject. Property is only a block and a half north Jim Colfax Avenue and one block west from Yosemite Street. The city limit with Adams County and the studio Ferrara is approximately 6250 square feet and is currently occupied by a single unit dwelling.'",
        "'speaker_3': 'The property is currently in the urban edge single unit, the Exon District, and the applicant is proposing to rezone to urban edge single unit d1s to allow for an accessory dwelling unit. The ESU de one x requires a minimum standard of 6000 square feet and allows for the urban house suburban house on the Dutch expressway detached accessory'",
        "'speaker_3': 'dwelling unit building forms. The maximum height for the house is 30 to 35 feet and 24 feet for the detached 82. The subject property is stone. Yes, UTX, as I said, and the surrounding properties are stone PSU decks with some e RH 2.5 to the Southwest and some MSR five to the stealth.'",
        "'speaker_3': 'Site is occupied by a single unit dwelling and it's surrounded by other single unit uses. But we can see that there's some public possible link to the north and some two unit multi-unit, residential and mixed use and commercial use to the south along the Colfax corridor.'",
        "'speaker_3': 'This slide shows the existing area with the site of the proposed rezoning on the top left and just some images to show the character of the neighborhood on the top right and the bottom left. In regards to the rezoning process and informational notice of the application was sent on July eight, 2020.'",
        "'speaker_3': 'Planning Board recommended approval on September 14th. The City Council public hearing was properly notice on October nine, and as a result, no letters of opposition have been received or support. No letters of support for opposition. To approve a rezoning, it must be found.'",
        "'speaker_3': 'The request map amendment is consistent with five review criteria from the Denver zoning code. The first criteria is that the rezoning request must be consistent with adopted, must therefore adopt the plans that apply to the request. Rezoning. Comprehensive Plan 2040 Blueprint.'",
        "'speaker_3': 'Denver. The East Area Plan and the Housing and Inclusive Denver Plan. The rezoning request is consistent with a comprehensive plan because it will allow infill development that broadens the range of housing types available in an area where infrastructure and services already exist, consistent with strong and authentic neighborhood vision elements, as well as environmentally resilient vision elements.'",
        "'speaker_3': 'The rezoning request is also consistent with Blueprint Denver. The subject properties mapped as part of the urban edge neighborhood context. This context is described as containing predominantly residential uses with single and two unit low scale homes on short walkable blocks.'",
        "'speaker_3': 'The future places map designates the subject property. A slow residential low residential place type displaced types have predominantly single and two unit uses, and accessory dwelling units are provided. Sonya Street is designated as Local Street, which is mostly characterized by residential uses.'",
        "'speaker_3': 'The growth area in Denver is for other areas of the city. This area is anticipated to see a 10% employment growth and 20% housing growth by 2040. Blueprint also includes specific policy recommendations. Housing Policy four focuses on diversifying housing choice through expansion of accessory dwelling units throughout all residential areas.'",
        "'speaker_3': 'And Housing Policy five recommends removing barriers to strengthening energy use as this rezoning would accomplish. The recently adopted East Terrier plan designates the subject property as urban edge future neighborhood context a low residential unit for your place. Consistent with Blueprint Denver the proposals eat as you would want.'",
        "'speaker_3': 'Exon District would allow for the development of an accessory dwelling unit that is consistent with the urban edge, future, neighborhood context and low residential future places. The proposed rezoning would contribute to the preservation of the neighborhood's existing character, while allowing comparable new construction and uses consistent with the recommendations of the East Area plan.'",
        "'speaker_3': 'Housing an inclusive Denver encourages expanding the development of accessory dwelling units to incentivize affordable and mixed use housing. The proposed rezoning is consistent with the recommendations in the Comprehensive Plan Blueprint Denver, the East Area Plan and Housing and Inclusive Denver because it will expand, expand housing options and allow the development of accessory dwelling units.'",
        "'speaker_3': 'Stuff also finds that they requested zoning meets the next two criteria. The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare primarily through its implementation of adopted plans. It justified a circumstance for this rezoning is a client of the plan.'",
        "'speaker_3': 'Since the approval of the existing ESU de zone district, the city has adopted the Comprehensive Plan 2040 Blueprint Denver that you stereo plan and housing in inclusive Denver stated throughout this presentation. The proposed rezoning meets the intent of this class.'",
        "'speaker_3': 'Overall, the proposed rezoning is consistent with the Urban Itch neighborhood context that exists in the surrounding area and with the purpose and intent of the ESU one district. This meeting that if criteria and conclusions does recommend approval based on finding or review criteria has been met.'",
        "'speaker_3': 'And that concludes the presentation. Thank you very much.'",
        "'speaker_0': 'All right. Thank you, Fran. Council has not received any written comments on Council Bill 1124, and we have one individual signed up to speak this evening. Jesse Paris.'",
        "'speaker_4': 'Maybe even a member of the council. My name is Justin Shoppers and live in district eight county district representative member homicide well black star action member for Self-defense positive action committed for social change as well. Party of Colorado and Mile-High News.'",
        "'speaker_4': 'And I will be the next mayor of Denver in 2023. I'm in favor of this rezoning tonight. I just had a question or two. I want to know what was going to be the aim item for this property in question.'",
        "'speaker_4': 'Because as you already know, and if you are aware, we have a housing crisis, we have upwards of ten to close to 20,000 people on the streets right now. And this is only going to get worse until we actually try to make a dent in our affordability crisis.'",
        "'speaker_4': 'So I would like to know what the AMA level is going to be for these properties. And if it is at all possible with the demographics of the people that are going to be occupying this or currently occupied this property.'",
        "'speaker_4': 'Ah, I would greatly appreciate if someone could answer those questions. Thank you.'",
        "'speaker_0': 'All right. Thank you, Jesse. Questions from members of Council on Bill 1124. Seen no questions of members of council. The public hearing for Council Bill 20 1124 is closed. Comments by members of Council. Councilman Herndon.'",
        "'speaker_1': 'Thank you, Madam President. I and I believe that this meets the criteria, and I would ask my colleagues to support it. I'm just excited to see the East Area plan is already being considered as we go through rezoning.'",
        "'speaker_1': 'So happy that that was approved and now we're using that as criteria in this area. Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you, Councilman Herndon. And seen the criteria for this rezoning has been met. I will be supporting it as well. Madam Secretary, roll call, please.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Hines.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Can each. I. Ortega. I. Sandoval. I. Sawyer. I. Torres, I. Black. I. CdeBaca, I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Madam President, I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2580 South Clarkson Street in Rosedale. Approves a map amendment to rezone property from E-SU-D to E-SU-D1, located at 2580 South Clarkson Street in Council District 6. The Committee approved filing this item at its meeting on 10-20-20.": [
        "'speaker_0': '13 eyes. Counsel Bill 20 Dash 1124 has passed. Councilmember Flynn, would you please put council Bill 1162 on the floor for final passage?'",
        "'speaker_1': 'Certainly. I move that council bill 20 dash 1160 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded by Counsel Min Hines. The required public hearing for Council Bill 20 Dash 1162 is open. May we have the staff report?'",
        "'speaker_1': 'Thank you, Madam President. This is James and his CBD. Are you able to hear me? And soon.'",
        "'speaker_0': 'We are. Thanks, James.'",
        "'speaker_1': 'Thank you. Time before you. We have a proposed rezoning of 2580 South Clarkson Street. The rezoning request is to go from VCAT to ESU one to allow for the detached EDU building. Properties located in Council District six in the Rosedale neighborhood.'",
        "'speaker_1': 'The parcel is approximately 70 to 130 square feet and is a single unit residential use. The ESU D1 zoned district allows for the Urban House and detached accessory dwelling unit building forms at the max building height from 30 to 35 feet and 24 feet for the interview minimum.'",
        "'speaker_1': 'What size for the center district is 6000 square feet. Existing zoning is sued and is surrounded by other sued parcels. There's OSA in the form of Harvard Gulch Park to the north as well as Camp two and H1-B to east.'",
        "'speaker_1': 'Existing land uses single unit residential surrounded by other single unit residential uses as well as parks and open space and public and quasi public uses. Some photos of the surrounding neighborhood for context. The proposal in question is the upper right hand photo.'",
        "'speaker_1': 'This application was heard before the planning board on their consent agenda and recommended unanimously for approval on September 30th on Rudi's consent agenda October 20th, and here tonight before Council on November 30th, we have received no public comment letters on this application.'",
        "'speaker_1': 'Here are the five review criteria the council must find the application to be consistent with to approve the application. Starting with review criteria. Number one, consistency with adopted plan series. We have that plan 2040 Blueprint Denver as well as housing and inclusive Denver.'",
        "'speaker_1': 'The application is consistent with several strategies in the Comprehensive Plan 2014, including some strong and authentic neighborhood goals and climate goals. Moving on to Blueprint Denver. This application is located in the Urban Edge Zone District, which is a nursery context, which is predominantly residential homes, are typically low scale and single and two unit with some small scale'",
        "'speaker_1': 'multi-unit residential embedded. They offer good walkability with short and predictable blocks. Future place type is low residential and predominately single in two unit uses and accessory dwelling units are appropriate in a residential future place type. Clarkston Street is a local street.'",
        "'speaker_1': 'Growth area strategy because all other areas of the city which you anticipate seeing 10% job growth in 20% housing growth by 2040. Some additional policies that the application is consistent with include. Housing policy number four, diversity of housing choice through the expansion of accessory dwelling units throughout all residential areas as well as housing policy.'",
        "'speaker_1': 'Five Remove barriers to constructing accessory dwelling units. The application is also consistent with several provisions of housing in inclusive Denver, including legislative and regulatory priorities. Two Recommendation to expanding the development of accessory dwelling staff finds that the application is also consistent with the next two criteria uniformity of district regulations.'",
        "'speaker_1': 'There is no. No variation to the districts being requested, as well as furthering public health, safety and welfare predominantly by implementing adaptive plans and providing an additional housing unit that is comparatively integrated into the surrounding neighborhood. Justifying circumstances.'",
        "'speaker_1': 'City Adopted Plans Plan 2040 and Blueprint Denver have been adopted since the base zoning was implemented. Steph also finds the application to be consistent with the neighborhood context zone, district purposes and intent to. But should say council pass.'",
        "'speaker_1': 'CPD recommends council approve the application. Apologies for not updating that site, finding it consistent with all five of the criteria. That's it for me.'",
        "'speaker_0': 'All right. Thank you, James. Council has not received any written comments on Council Bill 1162, and we have one speaker signed up, Jesse, Paris and James. We're going to go ahead and ask if you would stop your screen sharing for us.'",
        "'speaker_0': 'Thank you so much. All right. We'll go ahead and have Jesse. All right. Go ahead, Jesse, please.'",
        "'speaker_4': 'A member of the council. My name is just in the past and I'm representing the Denver homeless now. Black Star Action Member for self-professed positive action campaigning for social change after being to be Party of Colorado in Mile-High News.'",
        "'speaker_4': 'That will be the next November in 2023. And I live in District eight and Christopher Hampton's district. I am in favor of this approval, of this rezoning. Tonight. I have stated previously I support accessory dwelling units. I would love to see them all over the city along with two whole villages and safe outdoor camps.'",
        "'speaker_4': 'So cashing in once again, it's a slam dunk for you. You should get this approved with no problems. Thank you.'",
        "'speaker_0': 'Thank you. All right. Thank you. That concludes our speakers questions from members of Council on Bill 1162. CNN. The public hearing for council bill 20 dash 1162 is closed. Councilman Cashman.'",
        "'speaker_1': 'Thank you, Madam President. Once again, I think this clearly meets the five criteria. My memory is from an early discussion with the property owner that the plans were to use the ADU for a relative. But this property also is directly across the street from the Porter Hospital campus, so it would be a great location for a health'",
        "'speaker_1': 'care worker. Anybody wanting a spot in a wonderful neighborhood should less, I believe, less than a block from Harvard Gulch, parked about three blocks from a great growing little retail strip along Downing. So somebody is going to get lucky with a nice, nice place to live.'",
        "'speaker_1': 'And I obviously plan on supporting this and ask my colleagues to join me. Thanks, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Cashman. And seeing that it does meet all of the criteria, I will be supporting it as well. Madam Secretary, roll call, please.'",
        "'speaker_2': 'Cashman. I can reach. That was in. I sorry, Ron, but Ortega, I. Sandoval, I. Sawyer, I. Torres, I. Work. I see tobacco. I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I. Hines, I.'",
        "'speaker_2': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'"
    ],
    "A resolution by the Council of the City and County of Denver, sitting ex officio as the Board of Directors of the RiNo Denver General Improvement District, approving a Work Plan, adopting a Budget, imposing Capital Charges and Maintenance Charges, approving a Mill Levy, and making appropriations for the 2021 Fiscal Year, and approving an Amended Work Plan, adopting an Amended Budget, and making appropriations for the 2020 Fiscal Year, as necessary. Approves the 2021 Work Plan and Budget and amends the 2020 Budget for the RiNo Denver General Improvement District in Council District 9. The Committee approved filing this item at its meeting on 11-10-20.": [
        "'speaker_0': '13 Eyes Council Bill 20 Dash 1162 has passed. We're going to now convene as the board of directors for the Reno Denver General Improvement District Council is now convened as the board of directors of the Rhino Denver General Improvement District Councilmember Flynn.'",
        "'speaker_0': 'Will you please put Resolution 1267 on the floor?'",
        "'speaker_1': 'Yes, Madam President. I move the council resolution 20, dash 1267, be adopted.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. We've got Councilman Herndon with the second the public carrying for resolution 1267 is open. May we have the staff report, Michael?'",
        "'speaker_1': 'Evening Board members. I am Michael Kerrigan with the Department of Finance, Capital Planning and Programing Division. I am before you tonight to give the staff report and request approval for the Reno Denver General Improvement District 2021 Annual Work Plan and Budget and the 2020 Budget Amendment.'",
        "'speaker_1': 'The district is located northwest of downtown and includes residentially and commercially assessed properties around the Brighton Boulevard corridor. Generally, the grade is centered on Brighton Boulevard, stretching from I-70 on the north to 29th Street on the south and bounded east by the Union Pacific Railroad and by the and to the west, by the Burlington Northern Railroad Line'",
        "'speaker_1': 'to Girard supports infrastructure enhancements and maintenance in the Reno area, including streetscape enhancements to Brighton Boulevard. City Council approved the formation of the Rhino. J.D. The Rhino Denver. J.D. by ordinance number 309 Series 2015 and established City Council as the ex-officio board of Directors of the District.'",
        "'speaker_1': 'The ordinance also created a district advisory board comprised of property owners within the district. The ordinance specified that the that the Advisory Board should subject to the approval of the Board of Directors, conduct and manage all affairs of the District as the authorized agent of the Board of Directors.'",
        "'speaker_1': 'The District Advisory Board has created the Budget before you to meet the 2021 Budget proposal proposes overall expenditures and fund transfers of $1,593,396, and overall revenue and overall revenues of $1,162,707. Of these revenues, the district will generate approximately $923,107 through the levy of four mills, a real property for general operating purposes.'",
        "'speaker_1': 'And it will generate approximately $175,000 from the imposition of a capital charge assessed on a lineal foot basis on properties adjacent to the Brighton, adjacent to Brighton Boulevard for the repayment of debt used to fund capital and capital enhancements along Brighton Boulevard.'",
        "'speaker_1': 'City staff has reviewed the budget and work plan and recommends it for approval. Tracy Will is here tonight on behalf of the district to answer any questions as well. Thank you.'",
        "'speaker_0': 'All right. Thank you, Michael. We have two individuals or actually we have two individuals signed up to speak. The first one is you, Michael. So for the for the public hearing, do you just want to introduce yourself again?'",
        "'speaker_0': 'And I know you're available for questions.'",
        "'speaker_1': 'Sure. Michael Kerrigan available here for questions.'",
        "'speaker_0': 'Very good. And our second speaker is Jesse Paris.'",
        "'speaker_4': 'Council members, Jesse Bishop and I live in District eight, in Christopher Council member Christopher Hammett's district and I represented down the homicide row next door, actually moved for self defense by the maximum name for social change as well as the party of Colorado and Mile High.'",
        "'speaker_4': 'Moose and I will be the next November 2023. I have a few questions for the board member. Why is the level so low for this proposed business improvement district? Earlier tonight, we had a discussion about the five point the school improvement district and the fact that they are paying such a high level levy and comparison to other'",
        "'speaker_4': 'business improvement districts. So I would like to know why the lobbyists follow the windmills and. Is this money being used to also sleep on house neighbors from this colonized area that is now known as Rhino? It's the marketplace.'",
        "'speaker_4': 'Answer that question. I would really appreciate it. Thank you.'",
        "'speaker_0': 'Thank you, Jesse. That concludes our speakers questions from members of council. All right. Seen no questions from members of council. The Public Caring for Council Resolution 1267 is closed. Comments by Members of Council. All right. Seen no hands raised for comments of members of council.'",
        "'speaker_0': 'Madam Secretary, roll call, please.'",
        "'speaker_2': 'Like I said, America, I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I. He writes I.'",
        "'speaker_2': 'Cashman. I can eat. I am. Ortega, I. I.'",
        "'speaker_3': 'Sawyer.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Torres.'",
        "'speaker_2': 'I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'"
    ],
    "A resolution by the Council of the City and County of Denver, sitting ex officio as the Board of Directors of the Denver 14th Street General Improvement District, approving a Work Plan, adopting a Budget, imposing Capital Charges and Maintenance Charges, and making appropriations for the 2021 Fiscal Year. Approves the 2021 Work Plan and Budget for the 14th Street General Improvement District in Council District 9. The Committee approved filing this item at its meeting on 11-10-20.": [
        "'speaker_0': '13 Eyes. Resolution 1267 has been adopted. Council is now convened as the board of directors of the Denver 14th Street General Improvement District. Councilmember Flynn. Will you please put Resolution 1268 on the floor?'",
        "'speaker_1': 'I guess I will. Thank you. Madam president, i move that council resolution 20 dash 1268 be adopted. Dagen.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for resolution 1268 is open. May we have the staff report?'",
        "'speaker_1': 'Leaving board members once again, I'm Michael Kerrigan from the Department of Finance, Capital Planning and Programing Division. I'm here to provide the staff report for the Denver 14 Street General Improvement District and request approval for the District's 2021 budget and work plan.'",
        "'speaker_1': 'The district is 22.66 acres in size and is located along 14th Street from market to Colfax and generally includes all persons along both sides of 14th Street. It was created by council and approved by the electors in response to the 14th Street Initiative to create downtown Denver's Ambassador Street.'",
        "'speaker_1': 'The initiative began in 2005 and visualized 14th Street as a promenade and major gateway to the downtown area. The plan contemplated streetscape enhancements and related public infrastructure improvements. Stakeholders included private property owners, public officials and business organizations participating in the establishment and conceptual design for 14th Street.'",
        "'speaker_1': 'In 2019, City Council approved the formation of the 14th Street G80 and the creation of the District Advisory Board. The district was established to acquire finance, operate and maintain street improvements. The district's creation ordinance calls for the JD to end to annually at least to at least annually pass a work plan and budget.'",
        "'speaker_1': 'The District Advisory Board, after a notice and hearing, recommends to the Board of directors the proposed workplan and budget, including maintenance charges and capital charges before you tonight in 2021. The district plans to continue maintaining district amenities, including but not limited to tree planter and flower pots, landscape maintenance, signage, repairs, trash removal and sidewalk landscape and sidewalk'",
        "'speaker_1': 'lighting maintenance. The work plan, budget and charges include total revenues of $555,816, which is comprised of $248,306 in maintenance charges in Banner River Banner rental revenue plus $306,010 in capital charges for the repayment of debt used to fund the capital handsomeness along 14th Street.'",
        "'speaker_1': 'City staff has reviewed the 2021 Budget Work Plan, Budget and Work Plan and recommends it for approval. Beth MALESKY and Mark Katz are also here on behalf of the district to answer any questions. Thank you.'",
        "'speaker_0': 'All right. Thank you, Michael. We have three individuals signed up to speak. The first one is Beth Moisi.'",
        "'speaker_2': 'Any evening. I'm here on behalf of the 43 General Improvement District and available to answer questions.'",
        "'speaker_0': 'Very good. Thank you, Beth. Next up, we have you, Michael.'",
        "'speaker_1': 'And Michael Eric Michael Carrigan here to answer any questions regarding the 14th Street.'",
        "'speaker_0': 'All right. Very good. And Jesse, you're up next.'",
        "'speaker_4': 'So many members of council are. Watching at home just to watch. Your parents and I live in district eight and Christopher have this district and I represent the Denver now black star salute for self defense positive African-Americans social change as well as the party of Colorado and Mile High knows that would be the next November in 2023'",
        "'speaker_4': '. I had a few questions for Michael or Beth. I want to know which is General Improvement District, where these funds are going to be used for because I heard something about trash cleanup. And it is my understanding, with several people's understanding, that our unhoused may be treated like trash if swept every night and day.'",
        "'speaker_4': 'So is this money going to be used to sweep undesirables from the 14th Street Promenade? The smoker. Please answer that question. I would greatly appreciate it.'",
        "'speaker_0': 'All right. Thank you, Jesse. That concludes our speakers questions from members of council. All right. CNN, the public hearing for council resolution 1268 is closed. Comments by members of council. CNN. Madam Secretary, roll call, please.'",
        "'speaker_2': 'CdeBaca. I. Clark.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_1': 'I. Hines, I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Kimmich I. Ortega, I. Sandoval. I. Sawyer, I. Torres, I. Black. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '13 Eyes.'"
    ],
    "A resolution by the Council of the City and County of Denver, sitting ex officio as the Board of Directors of the Gateway Village General Improvement District, approving a Work Plan, adopting a Budget and making appropriations for the Budget Year 2021 and approving a Mill Levy. Approves the 2021 Work Plan and Budget for the Gateway Village General Improvement District in Council District 11. The Committee approved filing this item at its meeting on 11-10-20.": [
        "'speaker_0': '13 Eyes. Resolution 1268 has been adopted. Council is now convened as the board of Directors of the Gateway Village General Improvement District Council member Flynn, will you please put Resolution 1269 on the floor?'",
        "'speaker_1': 'Certainly. Thank you. I move the council resolution 20, dash 1268, be adopted.'",
        "'speaker_0': 'I think we had a typo here. Can I get you to 1260?'",
        "'speaker_1': 'That. I think there is a second.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'All right. The council resolution of 20 Dash 1269. It's very.'",
        "'speaker_0': 'Good. And we have the motion and we got your second. Councilman Herndon, we got that 1/1.'",
        "'speaker_1': 'That's what I get for reading verbatim.'",
        "'speaker_0': 'All right. The public hearing for Resolution 1269 is open. May we have the staff report, Michael?'",
        "'speaker_1': 'Leaving board members once again. Michael Kerrigan with the Department of Finance, Capital Planning and Programing Division. I am afraid tonight to give staff, report and request approval for the Gateway Village General Improvement District 2021 Annual Work Plan and Budget.'",
        "'speaker_1': 'The district is located northwest of the I-70 and Chambers Road Chambers Road intersection. It consists of approximately 243 acres on the eastern border. A border of Montebello is completely developed and primarily consists of residential property. Responsibilities for the district include maintaining landscaping and parks.'",
        "'speaker_1': 'City Council approved formation of the Gateway Village District by ordinance number 551 series 1994 and established City Council as the ex-officio board of Directors of the District. The creation ordinance was created, also created the District Advisory Board made up of property owners within the city.'",
        "'speaker_1': 'The ordinance specified that such advisory boards should conduct and manage all affairs of the district as the authorized agent of the Board of Directors, including its financial and legal affairs. Pursuant to Resolution Number 332 Series 1995, Denver City Council authorized the District Advisory Board to create a work plan and budget for approval by the District by the'",
        "'speaker_1': 'Board of Directors annually. The Gateway Village 2021 budget proposes overall expenditures of $824,016 and transfers to the capital fund of $435,000, with total revenues of $687,884. The district plans to assess 20 miles on real property within the district during 2021.'",
        "'speaker_1': 'The district anticipates starting on the next phase of its major landscape improvement project, which will address the landscape issues along Chambers Road. Additionally, the district plans to contribute to continue landscaping, irrigation maintenance, snow removal, external drainage maintenance within the district.'",
        "'speaker_1': 'City staff has reviewed the 2021 budget and work plan and recommends it for approval. Jeff Erb is here on behalf of the District to answer questions as well. Thank you.'",
        "'speaker_0': 'Thank you, Michael. And we have two individuals signed up to speak this evening. And the first one is you, Michael. And so you're here available for questions. And our second speaker is Jesse Paris.'",
        "'speaker_4': 'It was a council I was watching at home. It's just a missing person. And I live in District eight and council had in this district. And I represent the Denver homicide well, black star examiner for self-defense. I was the first to come in for social change, as well as the Unity Party of Colorado at Mile High Noon'",
        "'speaker_4': '. And I will be the next November in 2023. Honestly, I have no questions on zoning or this board approval. This gentleman from the district. There's nothing I'm going to tell you that's going to change your mind or any of this.'",
        "'speaker_4': 'So you just go ahead and do what I do. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of council. So, you know, no questions from members of council. The public hearing for Council Resolution 1269 is closed. Comments by Members of Council. Seen none. Madam Secretary, roll call, please.'",
        "'speaker_2': 'Black. I. CdeBaca, I. Clark.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_1': 'I. Herndon High.'",
        "'speaker_2': 'Hines.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Can each I. Ortega, I. Sandoval. I. Sawyer, I. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please closer voting and announce the results.'",
        "'speaker_2': '13 Eyes.'",
        "'speaker_0': '13 Eyes. Resolution 1269 has been adopted. Council is now reconvened and there be there being no further business before this body. This meeting is adjourned.'"
    ]
}