{
    "A bill for an ordinance adopting a new Article VIII in Chapter 28 of the Denver Revised Municipal Code, to be known as the Public Safety Enforcement Priorities Act. Amends Chapter 28 of the Revised Municipal Code to add a new Article VIII related to public safety enforcement that will provide the following: memorializes existing City policy by prohibiting the detention of individuals beyond their sentence; memorializes predominant City practices by prohibiting City employees from collecting information on immigration or citizenship status; prohibits the sharing of any other information about individuals for purposes of immigration enforcement; and, memorializes predominant practices by prohibiting use of city resources or City cooperation with civil immigration enforcement, including prohibiting providing access to secure areas or facilities. This bill was approved for filing by Councilmembers Kniech and Lopez.": [
        "'speaker_2': 'Nothing has been called out under bills for introduction. Councilman Lopez has called out council at 940 for a comment. Under Bill's defining consideration, I have nothing under pending. We have nothing, Madam Secretary. Is that right, everyone? All right.'",
        "'speaker_2': 'And, Madam Secretary, please put the first item on the screen. 940. Councilman Lopez, go ahead. Make your comment.'",
        "'speaker_1': 'Thank you, Mr. President. This is in regards to the Denver Enforcement Priorities Act. I just want to let folks know we want to make I want to make my comments in general comments and have have time for that lengthy process next meeting.'",
        "'speaker_1': 'And I just being that there's some folks from the coalition here, I just want to thank you for your hard work. But Mr. President, don't want to belabor the point. Just be want to be able to make those comments and have that time next next meeting.'",
        "'speaker_1': 'Now that there's a public hearing.'",
        "'speaker_2': 'Great. And you want to just make that comment again for folks who came late in the night. Hear your announcement.'",
        "'speaker_1': 'Oh, yeah. Thank you for for that. So just for folks that are that I came into the room before or during the announcements, we asked that we have a scheduled public hearing in one hour, a courtesy public hearing for the next council meeting in these chambers next Monday.'",
        "'speaker_1': '5:30 p.m.. It's a one hour courtesy public hearing on the Public Safety Enforcement Priorities Act. That's Council Bill 940. So I want now that we have that, I want to be able to make those comments then great. Thank you to the folks that came here.'",
        "'speaker_1': 'And then I just want to recognize my colleague, who's my course, who's the co-sponsor here, and I Councilman Kasich.'",
        "'speaker_2': 'That's great. And I echo those comments. So we'll have the debate next week for the courtesy public hearing. Madam Secretary, we have three public hearings, so that will be the last public hearing next week. Just want to.'",
        "'speaker_4': 'This. Correct. Okay.'",
        "'speaker_2': 'Just for folks who are going to be a part of this would be the last public hearing for that for a courtesy public hearing. Councilman Flynn.'",
        "'speaker_9': 'Thank you, Mr. President. As some of the folks know, I voted no on this bill when it was in committee a couple of weeks ago. And in that time, after making my objections to one of the provisions known the sponsors, Councilwoman Lopez, Councilwoman Cranitch worked very hard with the community here and with the administration to make some'",
        "'speaker_9': 'compromises that make it acceptable. And I intend to vote yes on it tonight and next week. Thank you.'",
        "'speaker_2': 'All right. Thank you, Councilman Flynn. Well, this concludes the items that feels a little weird saying that on an August night. So there's no more items that need to be called out or moving right along. All of the bills for introduction have been ordered published.'",
        "'speaker_2': 'We are now ready for the block votes and the resolutions and bills and final consideration. Councilmember this rumor. This is a consent or block vote and you will need to vote. Otherwise it's your last chance to call an item for a separate vote.'",
        "'speaker_2': 'Councilwoman Sussman, will you please put the resolutions for adoption and the bills for final consideration and final passage on the floor?'",
        "'speaker_5': 'Yes, I, I move that the following resolutions be adopted. Resolution 886 838 854 873 874 875 876 877, eight, 78, eight, 93. 852. 853. 867. Eight. 78. 71. 862. 879. 888. 92. And that's the resolutions.'",
        "'speaker_4': 'There's those on final.'",
        "'speaker_5': 'And though and also I move that the bills for introduction for final be passed. Let me get down to them. Should have had them up here. Series of 17 Build Number 794 924.'",
        "'speaker_2': 'Great. Madam Secretary, do we have it? It's been moved and seconded. My secretary. Roll call.'",
        "'speaker_4': 'Can each. Lopez. All right, new Ortega. My assessment. All right. Black eye. All right. Espinosa.'",
        "'speaker_0': 'Hi. Flynn.'",
        "'speaker_4': 'Hi, Gilmore. I heard in Katherine. Mr. President.'",
        "'speaker_2': 'I plusieurs voting announce results 3913 eyes. The resolutions have been adopted in the bills have been placed upon final consideration and do pass tonight. There will be a required public hearing on Council Bill 751 Changes on classification from 46 north to Lady Street in Globeville.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4060 North Elati Street in Globeville. Rezones property at 4060 North Elati Street from I-A UO-2 to C-RX-12 (industrial to urban center, mixed-use) in Council District 9. The Committee approved filing this bill at its meeting on 7-11-17.": [
        "'speaker_5': 'Yes, Mr. President. I move. The Council will 751 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved.'",
        "'speaker_4': 'I'm sorry. 1/2.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_4': 'Okay.'",
        "'speaker_2': 'It has been moved in second in the public hearing for council. 751 is now open. Andrew up. Can we have a staff report?'",
        "'speaker_11': 'Thank you. Good evening, Mr. President. Members of the council Andrew Webb here from CPD to present on this proposed rezoning of a property at 46 North LRT Street from the EIA.'",
        "'speaker_0': 'Zoning.'",
        "'speaker_11': 'Bureau to overlay to CRL. This request is in Council District three. It's in the southwest quadrant of the Globeville neighborhood near the 41st and Fox, soon to open RTD station properties about just under three quarters of an acre.'",
        "'speaker_11': 'It's right at the intersection of LRT and 41st and currently has a small office building in a parking lot. Surrounding zoning is primarily the same as the subject site with the UO to overlay. Although as you can see on the map here, there have been quite a few rezonings in recent months and years to mixed use zones'",
        "'speaker_11': ', implementing some of the adopted plans for this area, including a S.R. X Zone M's, their main street mixed use zone and SIMEX zone district, ranging from maximum heights of 8 to 20 storeys. The land uses in the area are primarily industrial, commercial and residential, with the bulk of the residential to the east in the student housing development'",
        "'speaker_11': 'for our area campus students and then to the to the west of the subject site is more of a mix of industrial, commercial and vacant land uses. As you get closer to the station, this area often gives you a feel for the scale of development in the area.'",
        "'speaker_11': 'As you can see, currently, most development is ranges from 1 to 3 stories, with the exception, of course, of the old Regency Hotel Tower there on the right hand side of the photo, you can also see the the rail line going through and the pedestrian bridge over to the Sunnyside neighborhood.'",
        "'speaker_11': 'These photos show the subject's sight from L.A. Street. As you can see, it is a small office and parking lot. The top photo here is the site directly to the north of the subject's site. It was resumed last year to the same zone district, S.R. 12.'",
        "'speaker_11': 'And the bottom photo shows a vacant lot directly across the street from the subject's site. The top photo here shows another commercial structure across the street from the subject's site. And then finally, a mostly unused parking lot to the south with the Regency, the old former Regency Hotel tower, and there in the background.'",
        "'speaker_11': 'So the current zoning, the air zone is a light industrial zone district does not allow new residential uses. The you oh two overlay does allow billboard uses subject to spacing and location and other limitations in the Denver zoning code.'",
        "'speaker_11': 'So this is a request to the S.R. X 12 Zone District that's urban center neighborhood context residential mixed use with a maximum height of 12 stories. The Zone District promotes pedestrian scale development with a shopfront building forms buildings built up at the street with pedestrian entrances and active street level uses aimed at creating a walkable district.'",
        "'speaker_11': 'In terms of the process so far. Informational notice went out on March 15th to register neighborhood organizations, the city councilors and other stakeholders in the area. Planning Board held a hearing on June 21st and recommended approval of this proposed rezoning of the Land Use Transportation and Infrastructure Committee met on July 11th and also recommended approval.'",
        "'speaker_11': 'We have not received public comment about this request. As you can see on this list, there are quite a few RINO's who who do consider this subject state to be within their boundaries and all have been notified of this proposal.'",
        "'speaker_11': 'As you're aware, the Council two to adopt a zone change must find that it's consistent with these five criteria from the Denver zoning code. With regard to the first consistency with adopted plans, there are four plans that impact the subject site Comprehensive Plan 2000 and Blueprint, Denver, and then also the 41st and Fox Station Area Plan and'",
        "'speaker_11': 'the Globeville Neighborhood Plan. So with regard to the comprehensive plan, the proposed year 12 zone, further several comprehensive planning policies including encouraging more density near transit nodes, promoting infill development in an area that has been identified for increased density and new uses.'",
        "'speaker_11': 'Blueprint Denver identifies the subject site for urban residential and identifies areas to the west of L.A. Street for transit oriented development. Closer to the station, Urban Residential is aimed at higher density, primarily residential uses with complementary commercial uses.'",
        "'speaker_11': 'The entire area here of Globeville is designated as an area of change. The 41st and Fox Station Area Plan also identified the subject site for urban residential uses with more commercial, more intensive commercial mixed uses. Further to the west, closer to the rail station, the Globeville Neighborhood Plan adopted more recently to reinforce the 41st and Fox station'",
        "'speaker_11': 'area playing recommendations for urban residential land uses at this location also highlighted it as an area of change. And then finally, that plan also established or made recommended building heights for the area. And this request for 12 stories is consistent with the recommendations of the 41st and FOX Plan.'",
        "'speaker_11': 'With regard to the other criteria, this request request will result in a uniform application of building form, use and design regulations for the S.R. X 12 Zone District. It will further the public welfare by enabling redevelopment over time of this industrial area into a walkable, mixed use district, thereby implementing adopted land use plans and policies and staff'",
        "'speaker_11': 'agrees with the the applicant's proposed justifying circumstance. There have been quite a few changes in this area already as the opening date for the G line station approaches and the adopted plans in this area made multiple recommendations for infrastructure improvements, many of which have been accomplished, including several pedestrian and bike infrastructure improvements in the area.'",
        "'speaker_11': 'Finally, staff finds that this proposal is consistent with the surrounding urban center neighborhood context, and with that, CPD recommends approval based on a finding that the review criteria had been met. And I'm happy to answer any questions you have.'",
        "'speaker_2': 'All right. Thank you, Andrew, that we have three speakers tonight for this bill, and I'm going to call them all up to the. You say so. Oh, okay. Sorry. I'm going to call the three speakers up to the front here.'",
        "'speaker_2': 'Patricia. Patricia Guillet. Gillette. Sekou and an Elizabeth. Patricia, your.'",
        "'speaker_12': 'First.'",
        "'speaker_4': 'Good evening. Thank you for having me this evening. My name is Patricia Gillette. I am the vice president of the Colorado Motor Carriers Association, located at 46 North L.A. Street. My home address for the record is 6600 Zing Street in Arvada.'",
        "'speaker_4': 'I am the applicant. We are the applicant. We are a membership organization. Governed by a board of directors. And we are asking for the zoning change as a pro-active move to meet changes in our neighborhood. We have no immediate plans or or short term plans to redevelop this area, but we're looking to match the rezoning that has'",
        "'speaker_4': 'happened directly to the north of us and across both LRT and Fox Street from our location.'",
        "'speaker_2': 'Thank you, Mr.. I appreciate it. Sekou.'",
        "'speaker_8': 'Yes, it. Uh. My name is Chairman Sekou, and I'm an organizer and founder of the Black Star Action Movement for Self-defense. Who are servicing poor, working, poor, homeless and senior citizens. Resident of Denver for 67 years. Born and raised in the five points.'",
        "'speaker_8': 'And and thoroughly immersed in the culture, population and future development of generations here and coming. We support this rezoning. For a couple of reasons. One. Now the general floor. You already got the votes to pass it. There's nothing I can say that would deter you from doing what you're doing.'",
        "'speaker_8': 'So this is pretty much a done deal. And I doubt very seriously if I'm going to tell you anything new that you ain't already heard, especially for the folks who's been there for a while. And that is this.'",
        "'speaker_8': 'After the zoning change goes down. Everybody's hands off. There's no monitoring of the project after that because as long as it comes within the guidelines of the 22 plan and Gupta will develop. It goes down and nobody takes a second glance at it because you got so much stuff to deal with.'",
        "'speaker_8': 'You don't do no oversight whatsoever unless there's a complaint from the citizens. And because you know that they're not that well organized. And of course, you just say, hey, it's not on me. Some assistance to do. But there is a moral authority that we have because as they go about doing this mixed use thing and developing housing'",
        "'speaker_8': 'and they have this little category called affordable housing, it's housing that poor people can afford. Was gay passed away because he nobody's looking at that piece because according to the guidelines, as long as there's affordable and there's been no adjustment or data being brought forth in terms of who your client areas base, you end up with a'",
        "'speaker_8': 'city looking like boulder and over pencil and paper you gentrify the neighborhood and it becomes white only like apartments. 72% white now used to be 95% black. Yeah. Yeah. Mm hmm. So these what you call the fun unattended consequences or in fact, intended consequences because of what you do.'",
        "'speaker_8': 'See. So our question is, how do you sleep at night knowing that what you do is a rippling effect, not only happens in global, but that ripple effect is starting to happen in the five points. Then it goes Montebello, then it go to Park Hill, then go to Green Valley Ranch, and then all of a sudden you'",
        "'speaker_8': 'have a white supremacist society with white privilege and white boys making money on taxpayers money cycle.'",
        "'speaker_2': 'So your time is up.'",
        "'speaker_8': 'I'm close with this.'",
        "'speaker_2': 'Your time is up.'",
        "'speaker_8': 'Thank you very.'",
        "'speaker_2': 'Much. Thank you. All right. And Elizabeth.'",
        "'speaker_0': 'I appreciate the opportunity to just comment in favor of this zoning. I'm in Elizabeth at East 50th in Washington, in Globeville. And a little bit related to what Chairman Shaker was just saying.'",
        "'speaker_4': 'Is a.'",
        "'speaker_0': 'Vigilance that I think is favorable for the neighborhood. If you look at the justifications of how it aligns with the plans, there's into a is the sentence. The new zoning we seek will allow for quick, intelligent and reasonable growth in the area to help spur other elements of the neighborhood to also grow.'",
        "'speaker_0': 'So I just want to support this and put a spotlight on the organism of economy in Globeville and that the transit oriented development is an opportunity for very creative, very responsible, very egalitarian enrichment and revitalization in the neighborhoods where actually helping the accessible opportunities and entry into the diverse, diversified economy that mixed use can bring can be'",
        "'speaker_0': 'part of the solution for people being able to sustain multi-generational abilities to stay in place in their neighborhoods. So I support this partly because the people that are involved have been very sensitive to the neighborhoods. I know the area because of it being a project cure, drop up, drop off site, a volunteer site for dropping off for'",
        "'speaker_0': 'many years. And I used to be a courier for a couple of years picking up the hospital supplies, etc. And so I know the area very well and I think that the connectivity conversations around this are very good.'",
        "'speaker_0': 'I think there has been sensitivity to the plans in some of these conversations, but I would say let's stay vigilant as we do rezoning changes. I do feel like this is a gap in the continuity of getting from the from the ideal to the actual and that we need to all work together from within the neighborhoods in'",
        "'speaker_0': 'the council to really when we get to the nuts and bolts and the designs and what it feels like to bring in the more stories and that kind of a thing, to really make sure that we're doing the advocacy from as policymakers and his constituents and neighbors to really make these be organically neighborhood.'",
        "'speaker_7': 'Friendly.'",
        "'speaker_0': 'Developments. So there's a lot of work to do, and I think this is a really great step in revitalization. And I'm glad there's some legacy industry protections going on with these, too, because I think in the neighborhoods, a lot of people really do like some of the legacy industries that have been there for many generations.'",
        "'speaker_0': 'So hopefully this will be a shoo in.'",
        "'speaker_2': 'Thank you, Miss Elizabeth. Now questions for members of council. Mr. Let I'm ask you to come up. I have a question for you. You just had an Elizabeth who was in the neighborhood speaking on behalf of this. Can you talk a little bit about the outreach you do to the stakeholders and the community.'",
        "'speaker_4': 'According to under recommendations from the zoning meeting that we had early on? I've sent out emails and letters to every neighborhood organization that was listed. We met with our immediate neighborhood. I have not to date heard any.'",
        "'speaker_2': 'Who did you meet with?'",
        "'speaker_4': 'Who did I meet with?'",
        "'speaker_2': 'You said immediate neighborhood.'",
        "'speaker_4': 'Yeah. Our property to the north.'",
        "'speaker_2': 'Okay.'",
        "'speaker_4': 'And our properties to the west. I did not meet with the new ones to the north west. It's a medicinal.'",
        "'speaker_2': 'Okay.'",
        "'speaker_4': 'Recreational pot shop.'",
        "'speaker_2': 'In. And just about your. Your plans for this. You all are responding to the movement of zoning changes that is happening in the in the in the context of this neighborhood. But there is no plans for your organization to to sell, to grow, to.'",
        "'speaker_2': 'I mean, I'm just trying to understand a little bit.'",
        "'speaker_4': 'Right. We are responding to the changes within the neighborhood. Our board of directors, which are made up about 52 members. Trucking companies and allied companies have instructed us to look at a five, ten and 20 year plan for our organization.'",
        "'speaker_4': 'And as part of that, the zoning came up. We have no intention. We have no current plans for redeveloping. We have no capacity to to redevelop. To be very honest with you, there may be sales down the road.'",
        "'speaker_4': 'That's part of the reason that we're rezoning to match the neighborhood so that if somebody wanted to come in and match parcels to the immediate north, that would make our property a little more attractive for sales down the road.'",
        "'speaker_4': 'But we have no immediate plans for any of that.'",
        "'speaker_2': 'Okay. Councilman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. I wanted to first ask Andrew if you would come to the microphone. Notwithstanding the answers to the questions that we just heard. But as we are seeing more and more properties in this neighborhood being resold to very, very high densities, and we will see an incredible increase in traffic in and out of this'",
        "'speaker_7': 'area. What specific conversations has CPD been involved in related to that intersection of 38th Avenue, Fox I, 25 and Park Avenue.'",
        "'speaker_11': 'Well, thank you, Mr. President. Councilmember Ortega, I appreciate the opportunity to answer that. I can't speak to specific conversations about that exact intersection, but I can tell you that the KPD in general is very aware of the volume of zone changes that have been coming in here in recent years, especially since the the Globeville plan kind of'",
        "'speaker_11': 'reaffirmed the station area plan in 2014. There have been, as you know, some some improvements made, some bike and pedestrian improvements that have recommended by those plans that have already been made. The CPD and Public Works and other partner agencies are actually in the sort of the beginning stages right now of a next step study that would'",
        "'speaker_11': 'look at as the as these zone changes occur, what would be, you know, and especially as actual development requests come in, what would be an appropriate sort of large scale response to to making sure that the infrastructure in this area can handle that.'",
        "'speaker_11': 'I should say that that the zone changes are not individual development approvals. So any development that comes in would have to go through review. And it's possible that traffic engineers and and other reviewers of those plans at Site Plan Review would require some off site mitigation of traffic issues and that sort of thing as well.'",
        "'speaker_11': 'So it's something that's being looked at from from multiple angles.'",
        "'speaker_7': 'So just to be clear, is, is that something that's being looked at, being done in a comprehensive manner that is taking into consideration the volume of density and traffic? That is. That has the potential to be in this area that is still way over tax.'",
        "'speaker_7': 'That interchange, that intersection.'",
        "'speaker_11': 'Yes, I think I can say that that when when CPD and partner agencies look at this, they will be looking at that whole kind of sort of semi-circular area across, you know, east of the tracks and and south of the of the highway interchange.'",
        "'speaker_11': 'And and looking at all of the land use entitlements that have been made and and calculating the the potential traffic and pedestrian and other needs for the area and looking at a holistic solution to.'",
        "'speaker_4': 'So are there.'",
        "'speaker_7': 'Conversations being had with the property owners who have come in and rezone the properties, letting them know that there's going to be.'",
        "'speaker_4': 'Some expectation for them to be part of.'",
        "'speaker_7': 'That solution, since they're going to be helping create part of the.'",
        "'speaker_4': 'The headache that we're going to be.'",
        "'speaker_7': 'Dealing with, because I don't want to wait until it is so oversaturated.'",
        "'speaker_4': 'That the expectation is the taxpayers.'",
        "'speaker_7': 'Have to fix the problem, not the people who are building and developing.'",
        "'speaker_4': 'In the area creating this challenge.'",
        "'speaker_11': 'And I can't speak to two previous rezoning applications, and I think a lot of the rezoning applications have been similar to this one in that they are sort of are being made by owners at an early stage who do not expect to actually be the developers themselves as these areas redevelop.'",
        "'speaker_11': 'So those discussions would likely be had more with some kind of end stage property owners or developers who are ready to actually come in for site plan approval. But but certainly at the point at which people are coming in for individual development approvals, I would expect any any reviewer who is looking at those plans to make them'",
        "'speaker_11': 'aware that there may be maybe needs for mitigation of traffic issues.'",
        "'speaker_7': 'Yeah, I think it's important that at the earliest stages of them having any connection to CPD, those conversations need to begin rather than waiting until somebody has rezoning their property and gets ready to submit their, you know, their detailed plans for for redevelopment that they learn about it at that point.'",
        "'speaker_7': 'I think it's important to start having that conversation upfront as as the department, you know, defines what that looks like. And it would be helpful for, you know, this body to understand what those solutions are going to look like so that, you know, maybe it's a presentation to our land use committee, but to keep doing these rezonings'",
        "'speaker_7': 'without knowing clearly that that's being addressed is a little concerning because, you know, I know somebody has put pencil to paper and they're not only looking at this intersection, they're also looking at 44th Avenue, which I advised we should not be doing, because what that means is you're going to put traffic through Globeville that that should not'",
        "'speaker_7': 'be traveling through Globeville to councilwoman.'",
        "'speaker_2': 'You're you're in commerce, and I know where you're going on that. And I just want you to reserve the effort for comments and go in and then I'm going the same place. Okay. Thank you, Councilman Espinosa.'",
        "'speaker_12': 'Well, actually, this these are questions, but they're related. What does the Globeville plan that that over that speaks to this long district I mean this rezoning say specifically about and I apologize for not knowing this about the Fox Street interchange in the 44th ingress and egress to this site doesn't speak to how this level of growth should'",
        "'speaker_12': 'be accommodated. I'm sure it talks about the TOD, but you know, it should be talking about these other ingress and egress points as well.'",
        "'speaker_11': 'It does indeed look at the limited ingress and egress points in the area and it makes some recommendations for hypothetical approaches to solving that. Councilmember Ortega mentioned 44, and I think that does come up as a as a possibility in the plan as something that should be potentially studied.'",
        "'speaker_11': 'But the plan does not, to the best of my knowledge, make specific recommendations. It did recommend some bike ped improvements that were pretty obvious. And those were made relatively recently.'",
        "'speaker_12': 'You know, and, and the bike pad improvements on Inka are wonderful. Do you know what the grades are right now for both of the mean for the the 38th and Fox intersection.'",
        "'speaker_11': 'I'm sorry. Their grades?'",
        "'speaker_12': 'Yeah.'",
        "'speaker_11': 'The intersection in terms of level of service. Yeah, I do not.'",
        "'speaker_12': 'Before. Before we get another rezoning in Globeville, can you make sure to. To sort of be prepared with that for ludi? And if you get it, I'm sure it's available, you know, can you email that even between now and then?'",
        "'speaker_11': 'I'd be more than happy to do that.'",
        "'speaker_12': 'And then. This seems to be an industrial system in an industrial association, so that would be an office use sort of thing. If there were a change of use but no actual new storefront building, I mean, certain changes of uses would be allowed, correct?'",
        "'speaker_11': 'That is correct. Although the current zoning would not allow residential uses. So. But it would allow continued office and commercial and industrial uses.'",
        "'speaker_12': 'Okay. Do you think it's ironic, though, a majority of the industrial uses are not permitted in the X12. Some are in a limited capacity.'",
        "'speaker_11': 'And I think I answered your question incorrectly. So the new zoning, the proposed new zoning this year, X12, would allow limited office and commercial uses, but it is more focused on on residential uses. But the existing office use could of course could of course continue.'",
        "'speaker_12': 'Is that. But that's because it is a conforming use for that zone.'",
        "'speaker_11': 'That is correct, yes. Yeah.'",
        "'speaker_12': 'But industrial, certainly a majority of industrial uses for that would not conform to our X12.'",
        "'speaker_11': 'That is correct, yes.'",
        "'speaker_12': 'No further questions.'",
        "'speaker_2': 'Thank you. Thank you. Thank you. Councilman Espinosa, Councilor Flower.'",
        "'speaker_9': 'Thank, Mr. President. Andrew, in the staff report, it was mentioned that I think there were ten registered neighborhood organizations that are covered by this area, and no comment was received from any of them at the time the report was written.'",
        "'speaker_9': 'Has there been any? It's hard for me to believe that as active as the neighborhood is, that there wasn't a comment received from out.'",
        "'speaker_11': 'We you know, they have received several notices of upcoming meetings. You know, the originally the original application planning board meeting, Landers, Transportation and Infrastructure Committee and tonight's hearing. And we have not received comment from any of the neighbors.'",
        "'speaker_9': 'Okay. Thank you. That's almost asking.'",
        "'speaker_2': 'Yeah. Thank you, Councilman. Flaying. Councilman Cashman. Okay. Great. All right. This concludes my experience and all the questions are council bill hearing for Council 751 is now closed. Comments by members of council. You know, I'll sort of because this is my district.'",
        "'speaker_2': 'This is again on the on the technical piece of this. This. You know, is consistent and congruent with everything that we need to improve for city council. Obviously, you hear a lot of issues here on city council because we're seeing what's starting to be the reality on the ground here and what I call Fox Island.'",
        "'speaker_2': 'It is an island that is disconnected from for many reasons, but there are not neighborhoods that exactly go up to Fox on that. Why? That's why you're not going to have a lot of people commenting on this. You have a one way in, one way out transportation system of cars.'",
        "'speaker_2': 'You do have a light rail coming in, which is good. But you got to look at the number of. Rezonings that we have have had in the neighborhood. And what that's going to do for traffic and it's just going to the whole system is going to fail if we're not thinking about infrastructure along with redevelopment.'",
        "'speaker_2': 'And so for the the person the the group of folks who are asking for a rezoning, I'll tell you right now that this entire area is going to have a transportation network and it's going to have a transportation network that those who own property will be paying into and getting assessed for that transportation network.'",
        "'speaker_2': 'Because we as the city and the taxpayers can no longer afford to pay for that solution. And the the growth is is so much at this point that, I mean, we're going to see an epic failure for this for this area.'",
        "'speaker_2': 'So for me, that's just I'm just serving notice on everyone who's coming before us and getting a rezoning. By law, you can come before us and get this rezoning because it matches up with what our criteria is. But you have to know going forward where we're headed to the to the community conversation that we've for you.'",
        "'speaker_2': 'You actually had an Elizabeth who's very active in the community support this because she was a part of the planning process to approve zoning, to set the zoning standard. And the frustration that we hear from the community is why are you approving these zoning?'",
        "'speaker_2': 'And what folks don't understand is we have a process. We have a community process that was just approved in 2014, the Globeville area, Swansea, a plan which neighbors spoke into how they wanted to see their neighborhood address. And this.'",
        "'speaker_2': 'It's congruent and consistent with what that plan is. And so we as city council officials need to support that. But we also need to support a larger plan like this transportation network, affordable housing plans that you're going to see coming forth on 30th and Blake, things like that to make sure that we can rightsize it for our'",
        "'speaker_2': 'community. So transit plan is coming. Be prepared. I'm going to support this because it's consistent with what the community members spoke and what they want to see in their neighborhood. I typically do not like to see a rezoning without a plan, you know, and this seems as if you all are evaluating your land for future use of'",
        "'speaker_2': 'the sale. And I don't like to see that. But you have the legal right to do that before this body. And so but I just wanted to serve notice, let folks know we're doing a transportation plan. Councilman Espinosa.'",
        "'speaker_12': 'There was not. Maybe you can clarify it. Feel free to chime in to clarify. But it seemed that you spoke of maybe a possible. Sort of mechanism whereby the future of redevelopment in this area might actually contribute into the infrastructure needs of that area.'",
        "'speaker_12': 'I know that we've had a preliminary discussion about some potential metropolitan district, but it was very for a very finite portion of this area, not as all inclusive as this area needs. Are we is there. I wonder I mean, I'm just curious if.'",
        "'speaker_2': 'There's I don't think I don't think that there's a proposal that's ready for primetime right now. But all of the individuals who are parcels that are significantly impacting the area and causing a transportation need will be paying into, you know, this fee.'",
        "'speaker_2': 'We don't know how it's going to look just yet. Okay. But but I think it's something that Ortega was talking about and she's had ideas about the the administration and CPD is working on some things. And I definitely have some ideas on what to do.'",
        "'speaker_2': 'And I think we need to come together and figure out what that it is.'",
        "'speaker_12': 'That's that's good. That's good to know. I'd like to know more about it as this is adjacent to my district. But and because there's also been a concern of mine on several of these rezonings going back two years about the sort of what's what's happening.'",
        "'speaker_12': 'I do want to thank Sekou for for bringing up some of some very salient points, though, because because I am trying to grapple with the displacement issue in Northwest Denver and to you'd be naive to think that it would be any different in this part of Globeville.'",
        "'speaker_12': 'You know, right now it'll be in a series of spaces until a developer starts to move and be on a transformative project. Certainly the land use and the zoning is in place for something transformative. The planning is in place for something transformative.'",
        "'speaker_12': 'The infrastructure is lagging behind. But I'm pretty sure that once there's reinvestment in the area, you will see that subsequent reinvestment in infrastructure. And one thing that happens is if we took the demographic makeup of the area today and you saw somebody strikes that match and development starts to go commensurate with what is planned, the demographics will'",
        "'speaker_12': 'radically change. And if we if we if we. So there's two things here that I just want to comment on that are related to this rezoning and all previous rezonings and subsequent rezonings that are all involved with this, this Globeville plan and the tio de station area plan for 41st and Fox, which is if we don't get'",
        "'speaker_12': 'on top of the infrastructure, we will squander this tod opportunity of this area will remain in stasis when it actually is. You've got way too much potential. There's too much vision there that shouldn't be ignored. But if we don't actually figure out a better way than anything we've done to date and anything we are talking about right'",
        "'speaker_12': 'now on how to address displacement and gentrification, we will fail Denver as a city in both of both Globeville and Sunnyside. My side of the railroad tracks here offer tremendous opportunity for both to address, mean to catalyze new development, make maximum impact from a tod, and do so in a way that not only addresses displacement in the'",
        "'speaker_12': 'area, but actually can capture families that are being displaced from other parts of northwest Denver, north and west Denver, I should say. And so I'm just saying that because I've said similar comments in past Globeville rezonings. The comments tonight sort of spurred my own sort of.'",
        "'speaker_12': 'I mean feelings. With that said, it's you know, it'll be it's purely consistent with the plan. But I think the city needs has a big role to play on the future of Globeville as a as a as a sort of beacon for what could be redevelopment rather than redevelopment as as usual.'",
        "'speaker_12': 'Thanks.'",
        "'speaker_2': 'Thank you. Councilman Espinosa. Councilman Castro.'",
        "'speaker_6': 'Thank you, Mr. President. I'm going to add my voice to the the infrastructure piece as well. You know, we since we've been passing rezoning after rezoning in this area and every time at least Councilman Ortega will bring up what are we doing about the transportation system?'",
        "'speaker_6': 'And we get this vague. Well, we're will look at it. And as things come online, we'll look at it. And, you know, and I think I've reached my limit of of approving these. I'm inclined that to not pick on this particular development.'",
        "'speaker_6': 'But I think past that, I've reached my limit to the point where it may be part of the neighborhood plan, but I'm looking at our reviewer review criteria and I can't, with a straight face, believe that without some assurance that there is.'",
        "'speaker_6': 'I'm going to need to see on paper CPD's plans, contingency plans for how to address transportation in this area. Or I can't, in all honesty, say that this is furthering public health, safety and welfare. Because I'm looking at the maps of what land is left.'",
        "'speaker_6': 'And I'd be interested to see where you folks think you're going to go to build this transportation system that, you know, we've got parcels that are come look to me. I expect to see some three to twenties and so on.'",
        "'speaker_6': 'Yet in this plan, and that may be just what this area needs if there's an infrastructure plan that makes sense. I'm just not seeing it there. So thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Castor and Councilman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. I first want to say to Mr. Gillette, your your application is cut up in the middle of a bigger picture discussion that we started having about this area. You know, I think your particular site meets the criteria, as I think Councilman Brooks said earlier.'",
        "'speaker_7': 'But it is part of a conversation that we have not been privy to in terms of how we're working to solve what is going to be a huge infrastructure nightmare if we don't get out in front of it in terms of not only the traffic, but the drainage issue is equally as vital to ensure that we address'",
        "'speaker_7': 'because we already have flooding problems in this area, that 38th Avenue underpass, it it has trapped cars in there on many occasions when it when it rains. And so and part of that water from from the west side of I-25 flows through the pipes down into Globeville and is in part some of the reason that Globeville floods'",
        "'speaker_7': 'besides water that comes out of the, you know, the riverbank just south of 38th Avenue. So while we have the opportunity to be addressing infrastructure, we need to make sure that we're talking about drainage as well as transportation.'",
        "'speaker_7': 'And I would just caution that we not be talking about 44th Avenue being part of the ingress egress for this Fox Street area, because there's no way with everything else that will be happening with I-70, with National West, or with the reconstruction of Washington Street, with everything else that's happening in the Reno area to put even more'",
        "'speaker_7': 'traffic into that Globeville neighborhood. So we need to look at other solutions besides how we fix that intersection and look at other connectivity answers to how we solve this problem. So I look forward to either being part of ongoing conversations or seeing whatever is in the discussion stages with CPD to look at how we address this before'",
        "'speaker_7': 'we have any more applications from this area come forward. So I have no problem supporting this one tonight, but I am anxious to see that we're making some headway in addressing this problem. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. And I can promise you there are more on the way, and they will hear this same speech and I hope with a little bit more concrete of a plan of moving forward. It's been moved in.'",
        "'speaker_2': 'Seconded. Madam Secretary Rocha.'",
        "'speaker_4': 'Black. Clerk Espinosa.'",
        "'speaker_0': 'I.'",
        "'speaker_4': 'Flynn. All right. Gilmore. Herndon. Cashman. Can each. Lopez. I knew Ortega. Sussman.'",
        "'speaker_2': 'I think you missed a couple of that. Madam Secretary.'",
        "'speaker_4': 'Mr. President.'"
    ],
    "A bill for an ordinance changing the zoning classification for 3955, 3965 and 3995 North High Street in Cole. Rezones property at 3955, 3965, and 3995 North High Street from I-B, UO-2 to I-MX-3, UO-2 (industrial to industrial, mixed-use) in Council District 9. The Committee approved filing this bill at its meeting on 7-11-17.": [
        "'speaker_2': 'I. You know, you guys know our SEC. Madam Secretary is very fast on that. We get everyone. We just listen to people. Yes. All right. 11 eyes. Council Bill 71 is passed. Okay. Next up, councilman, clerk, will you please put Councilperson 52 on the floor?'",
        "'speaker_1': 'Jasmine's president I move that council bill 752 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved and second it. Andrew Webb up. Can we hear the staff report?'",
        "'speaker_11': 'All right. Thank you again. Andrew Webb here from CPD. This is a request for rezoning of properties at 39, 55, 39, 65 and 3995 North High Street from Ibe you oh two to IMX three you owe to. This request is in Council District three.'",
        "'speaker_11': 'It's at the north edge of the Cole neighborhood. It's a little over three, three quarters of an acre at the intersection of 40th and high. Currently occupied by two industrial structures, the subject site zone or the surrounding zoning is also primarily ivy UO two, with some mixed use zoning to the south and a couple of planned unit'",
        "'speaker_11': 'developments.'",
        "'speaker_2': 'Andrew Scuse me real quick. Why don't you go black back one one slide.'",
        "'speaker_11': 'Absolutely.'",
        "'speaker_2': 'Another slide. Another slide. Okay. This is Council District nine. I just went, Oh, geez, I know. I don't want to get confused with a Lopez and.'",
        "'speaker_1': 'All council district three so bad.'",
        "'speaker_2': 'So let's let's just.'",
        "'speaker_11': 'I apologize for the misnomer there. This is indeed Council District nine.'",
        "'speaker_2': 'This is fine District nine. Everyone watching in at the OC. Go ahead. You can go back. Sorry to interrupt. You just wanted to be clear about that.'",
        "'speaker_11': 'Land users in the area are a are a fairly fine grained mix of industrial, commercial, multi and or single and multi-unit residential. And then of course to the north there on the north side of 40th over the A-line tracks, there is a major intermodal rail and trucking facility.'",
        "'speaker_11': 'Now, this aerial shows the subject site, along with an associated redevelopment site. They're kind of at the top of the of the frame. The subject site is proposed for rezoning to enable the construction of a parking garage that would serve redevelopment of this this collection of pre-war industrial structures.'",
        "'speaker_11': 'They're further west along 39th. This is a photograph or photographs of the subject site here. The first looking kind of southwest, a long high street and the one on the bottom, they're looking northwest along high. These photos are looking across High Street to the east.'",
        "'speaker_11': 'You can see that the development across the street includes residential, some industrial and some outdoor storage uses. These photos were taken at where the alley intersects 40th. So we're looking east at the back of the subject's site and then west toward the industrial use to the west of the site.'",
        "'speaker_11': 'So the existing zoning, as I mentioned, is I.B. with the quota or billboard overlay. I.B. is a is a high intensity industrial district and it does allow surface and structured parking. However, it requires fairly deep setbacks to the primary street, which in this case would be High Street.'",
        "'speaker_11': 'This photograph, this aerial shows the variation of setbacks in the area. As you can see, the structure at the north end of the subject site actually is built right up at the street. The structure on the south part of the site is set back about 30 feet.'",
        "'speaker_11': 'The applicant proposes this the IMX zone to allow full use of the site for this parking garage. So again, the IMX three, that is an industrial neighborhood context mixed use with a maximum height of three stories. The idea is to promote industrial mixed use, but in a pedestrian scaled environment with buildings up at the street, kind of'",
        "'speaker_11': 'shop front appearances and an active street level, it does allow the shallow front setbacks. It has high build to requirements and is generally accommodates a variety of commercial, civic and residential uses. Terms of the process to date. Informational notice did go out to all the Reno's counselors and other stakeholders on April 9th.'",
        "'speaker_11': 'Planning Board held a hearing on June 21st at which they recommended approval. The committee considered this request on July 11th and also recommended approval. There are quite a few registered neighborhood organizations that consider the subject site to be within their boundaries.'",
        "'speaker_11': 'All have received notices several times throughout the process. We have received one email from the whole neighborhood in support of this proposed rezoning. To approve a rezoning. As you know, the Council must find that the request meets these five criteria from the Denver zoning code.'",
        "'speaker_11': 'In terms of the first criteria with regard to consistency with adopted plans, there are five plans that impact the site comprehensive plan and Blueprint Denver and then also the River North Plan, the 30th and Blake Station Area Plan and the subsequent Hyde amendments that were adopted last year and the Elyria and Swansea Neighborhoods plans which abuts the'",
        "'speaker_11': 'area in terms of the comprehensive plan, the proposed IMX three district further several policies by increasing the feasibility of development on a smaller site in keeping with the existing fine grained mix of of uses in this area and small block sizes and furthers a mixed use redevelopment opportunities and support of nearby redevelopment of the nearby complex of'",
        "'speaker_11': 'of older industrial structures. The Blueprint Denver identifies this area as an area of change and highlights this particular site for mixed use. The River North Plan recommends a general transit oriented development and mixed use for this area, and this request is consistent with that.'",
        "'speaker_11': 'The 38th and Blake Station area plan does not technically impact this site, but it does impact the larger redevelopment site to the west. And for this area generally recommends a mix of uses the Elyria and Swansea. A neighborhood plan recommends a mixed uses in this area with a focus on employment, which is consistent with the IMX Zone'",
        "'speaker_11': 'District. With regard to the other criteria, the this request will result in the uniform application of building form, use and design regulations for the IMX three District Implements Plans for walkable, transit oriented development, thereby furthering public health, safety and welfare and staff agrees with the applicant's proposed justifying circumstance.'",
        "'speaker_11': 'As I'm sure you're all aware there, we've observed high levels of redevelopment and interest in this area. Redevelopment activity in this area intensified by the opening of the 30th and Blake Arcade Station and the efforts of the Arts District.'",
        "'speaker_11': 'And finally, staff finds this proposal is consistent with the surrounding industrial neighborhood context. So with that, CPD recommends approval based on the finding that all these criteria have been met. And I'm happy to answer any questions.'",
        "'speaker_2': 'All right. Thank you, Andrew. We have five speakers for this bill. I'm going to ask all five speakers to come up to the front. You have 3 minutes each. Bruce O'Donnell, John McIntyre, Brett Parmalee, Trina Moyer and Sekou.'",
        "'speaker_2': 'Bruce O'Donohue a first.'",
        "'speaker_13': 'Good evening, Mr. President, and members of council. My name is Bruce O'Donnell, and I'm at 770 Sherman Street here in Denver. And earlier this evening, this document was passed out to each of you. And I thought it might be helpful to give it some context to this rezoning request.'",
        "'speaker_13': 'In addition to what was provided in the staff report immediately west of this site is a nine acre adaptive reuse of a former industrial site, and to reuse these grade old brick buildings that have significant architecture and will be rhino's next hot spot.'",
        "'speaker_13': 'We need to be able to create a parking reservoir because that's the way to preserve the buildings and reuse the site. And so the purpose of this rezoning is to set up a parking reservoir for phase one of the redevelopment of the Denver Rock Trail property.'",
        "'speaker_13': 'And we're proposing I am x three, which would allow approximately 400 stall parking structure to be built on the site. It will comply with all of the requirements in the IMX zoning to include the possibility of activating the ground floor, special design and screening and transparency on the on the ground floor.'",
        "'speaker_13': 'And in fact, the parking garage is going through SDP review right now in the planning department. So that's kind of the context for this rezoning request. And members of the design team and the ownership team and I are all here tonight in available to answer any questions.'",
        "'speaker_13': 'Should you have any. Thank you.'",
        "'speaker_2': 'All right. Thank you, Mr. O'Donnell. John McIntyre. If you would, all of the folks that I call if you make your way up here. So here's a little time. Go ahead.'",
        "'speaker_1': 'John McIntyre with Tribe Tactics, 1759 Dahlia.'",
        "'speaker_2': 'Street hit answer any questions? Great. Thank you, Brett Parmalee.'",
        "'speaker_1': 'Brett Parmalee, 1302 South Vine with Saunders Construction here to answer any questions.'",
        "'speaker_2': 'Great. Thank you. Trina Moyer.'",
        "'speaker_3': 'Hello. I'm Trina Moyer. I'm a resident of Denver, and I'm here representing the whole neighborhood. As the vice president of the Neighborhood Association Board, we are in support of the rezoning of the properties located on North High Street in order that a parking structure can be built near the Rock Creek Rock Drill Development site if reasonably priced'",
        "'speaker_3': 'parking is made available. We believe that this will reduce the number of patrons parking elsewhere within coal, thereby keeping most of the on street parking available for all residents. The new zoning would also allow for possible ground street.'",
        "'speaker_7': 'Activation of the.'",
        "'speaker_3': 'Parking structure, which is preferred by the Coal Neighborhood Association. I also would like to express our appreciation to rock drill, for their willingness to engage.'",
        "'speaker_7': 'Us and the coal residents in their process. And we look forward to.'",
        "'speaker_3': 'Continued communications and collaboration.'",
        "'speaker_2': 'Thank. Great. Thank you. All right. So who?'",
        "'speaker_8': 'Oh Masuku as before, same organization went to three ABC. Okay. Continue on a dialog. Same thing, different location. But I didn't get it. You went. Why don't you hit something? Going to try it another way? Because what we're going to do is we're going to document the records, so.'",
        "'speaker_8': 'We're talking about congruent. See in It's Only Change and we're talking about making sure that it's like other pieces of property in the area. And so we want to really work on confusing this thing because we want to get people so caught up in the details of things that you missed the forest for the tree.'",
        "'speaker_8': 'Now I've been to them community meetings. Let me tell you how it works. Powerful people come in with a paradigm framework. And they tell the people flat out this is going to happen. It's going to happen. What do you want to happen or not?'",
        "'speaker_8': 'Because there are powerful people doing powerful things and we are all a city council already lined up for like the last 13 zip. People are now afraid that if they don't put an input into that is congruent to the paradigm, they will have no no input.'",
        "'speaker_8': 'So they operating out of fear. Well, if we don't go along with the program and we don't get none. And if they keep it going where they keep it going, then, you know, somebody's going to get in trouble because they oppose this.'",
        "'speaker_8': 'And you know how they do things. Now, historically, local governments were involved in the rezoning of Jewish people in Nazi Germany to put them into concentration camps. Same justification, always going to be found and abuse and everything, and then end up engaged in a world war that killed millions of people.'",
        "'speaker_8': 'And the rescue of humanity. Yeah. Yeah. And then because of that, there is a United Nations resolution on human rights violations that include genocide, gentrification and ethnic cleansing. The guy in Yugoslavia, he was doing life imprisonment and they have hung folks for that because it requires the requirement death penalty.'",
        "'speaker_8': 'Hmm. Imprisonment for life and enormous fines. Now, imagine this. That's filed in the United Nations under. As a focal point. Then all of a sudden, watch tourism drop. Watch economic development drop. And you know as well as I know, I've been here long enough to see this boom bust thing with you real estate, because it's unplanned.'",
        "'speaker_8': 'You got a misses cycle plan. Missed cycle didn't include marijuana. This was 10,000 people coming here every month. And where they're going to live must cycle and.'",
        "'speaker_0': 'Displace the local population.'",
        "'speaker_2': 'All right. You can have a seat. Thank you. Appreciate it. Yeah. Wow. Well, that concludes our speakers questions for members of council. I have a question for you, Andrew. So we had one person in our position on the on the planning board.'",
        "'speaker_2': 'Do you did you do you remember what the issue was there?'",
        "'speaker_11': 'Yes, Mr. President. The issue was the retention of the oh two billboard overlay.'",
        "'speaker_2': 'That's right. Okay. And. I mean, did they talk a little bit more about that or.'",
        "'speaker_11': 'I believe the commissioner's stance was that is this area redeveloped into more of a of a people oriented place with, you know, they're kind of the transit oriented development that's coming along with the 38 and Blake Station area plan that he didn't feel that billboard uses were remained appropriate for the area.'",
        "'speaker_2': 'Okay. So we have the 38th new question. We have the 30th and Blake design overlay, which you were actually a part of and working on. So do these specific properties fall within the design overlay?'",
        "'speaker_11': 'Yes, Mr. President. You know, I neglected to mention that during our presentation, but the the the recommended height here is consistent or the proposed height here of three stories is consistent with the base height recommendation of the 38th and Blake stationary, a plan height amendments which did include this area.'",
        "'speaker_2': 'Okay. And they call for activation of ground floor. Call for ground floor uses as as one of the is Trina moya from the neighborhood said so I guess what I'm trying to get to is and maybe someone from you know the owner's representative team can answer this.'",
        "'speaker_2': 'Is there a plan to activate the ground floor for the for the parking structure?'",
        "'speaker_11': 'And I'll let them speak to that. But I would say generally that the IMX three zone also does have some requirements for ground level activation entrances, transparency, that sort of thing. But right. I'll pass on to Mike to the development team here.'",
        "'speaker_11': 'Great.'",
        "'speaker_1': 'I can respond to that. John McIntyre with the architects. The, um, the parking structure that's being.'",
        "'speaker_2': 'Proposed currently is being designed to meet the IMX requirements for transparency.'",
        "'speaker_1': 'And street.'",
        "'speaker_0': 'Edge activation.'",
        "'speaker_1': 'It is also being designed for future conversion with flat four.'",
        "'speaker_2': 'Uses and the appropriate floor to ceiling.'",
        "'speaker_1': 'Heights should it need to be converted to full active ground use under the design overlay when it comes in. So it's being designed to meet the current requirements of mix with allowance, to fulfill the requirements of the.'",
        "'speaker_0': 'Design overlay.'",
        "'speaker_2': 'In terms of floor to ceiling.'",
        "'speaker_1': 'Clearance as a ground floor, height and flat levels and at the beach.'",
        "'speaker_2': 'Okay. And for the owners, is there a commitment to do it or are we still just talking about conception at this point?'",
        "'speaker_1': 'We're still talking about conception at this point. I think the there's a need and a requirement for us to meet all the requirements of the IMX zoning until we fully understand the design overlay.'",
        "'speaker_2': 'Requirements and those are issued.'",
        "'speaker_1': 'Legally.'",
        "'speaker_2': 'All right, Councilman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. Andrew, can you help me understand why we are doing parking for a project that's on a different block and that development is not providing its own parking. I mean, it may have some of its own parking, but why throw allowing an offsite parking structure for a different development that's not even adjacent?'",
        "'speaker_11': 'Councilmember Ortega, going back to the aerial here, hopefully you can see it on screen.'",
        "'speaker_7': 'Yeah, I'm real familiar with the site.'",
        "'speaker_11': 'The the sites are actually owned. They're under the same ownership. Okay. And and I believe the same development team is working on both projects. But the as you can see there, the rock drill site itself is fairly dense with prewar brick structures.'",
        "'speaker_11': 'While the while the subject site here is probably, I would say, 1950s to sixties, more modest industrial structures. And I think the idea is, is rather than to create the space on the rock drill site for for parking by tearing down some of those more historic structures is to use this space right nearby to to provide that'",
        "'speaker_11': 'parking and preserve some of the the unique architecture on the rock drill site.'",
        "'speaker_2': 'And.'",
        "'speaker_7': 'In.'",
        "'speaker_2': 'Councilwoman along along with that and correct me if I'm wrong here, this is the 39th Street, the channel that's coming coming through there. And they will be taking some of what could be used for parking some of the parking locations right there along 39th as well for this.'",
        "'speaker_11': 'Mr. President, that that is correct. That that project will run along 39th Street there, including the parcels that you see to the south that are currently being used for storage. So some of the it's not I'm not sure exactly how it will impact the parking, but it could be expected that parking will change.'",
        "'speaker_7': 'So I had another question. So basically what? I would like to know from Mr. O'Donnell is. Yes, I was just looking at the the PowerPoint, and it showed some schematics that look like we're not preserving that property. It would be a whole new development on that nine acre site.'",
        "'speaker_7': 'Can you correct me if if I'm saying that wrong?'",
        "'speaker_13': 'Yes. Also, if I could go back to your parking question for just a moment. We have also acquired property between High and William Street in. So there's a direct pedestrian connection from the park, the proposed parking structure site straight into the heart of the rock drill site on the west side of William Street.'",
        "'speaker_13': 'And so there is an easy pedestrian connection there.'",
        "'speaker_7': 'Okay. So is and I know the other property is not what we're dealing with tonight, but because it is already tied together via this application. Has that property been re zoned or is that a different project that's yet to come before this council?'",
        "'speaker_13': 'It is a different project. It is also zoned I.A. today. And as Triber architects explained a moment ago, we're waiting for the design overlay in in all of the 38 Blake Hyde amendments work to get work its way through and become adopted before we take any next steps.'",
        "'speaker_7': 'Okay. So is it anticipated that you would. The developer would utilize or the landowner, whichever is going to be doing the actual development is going to keep those buildings or actually level that and put in entirely new.'",
        "'speaker_13': 'So the intent and I'm going to use some approximations here right now, but I would estimate that about 60% of the site is built out with beautiful old red brick with classic architecture, old industrial architecture. In the intent is to preserve all of that and have this anchor of this be an adaptive reuse of those existing structures'",
        "'speaker_13': '. Okay. And then about 40% of the structures there are of cinder block in in kind of 1960s, finest in. So the newer, taller buildings that that are in the plan right now would replace some of that. That isn't as architecturally significant.'",
        "'speaker_7': 'So in the newer, taller buildings, is it anticipated that given the fact that you have nine acres, that that site will provide some of its own parking?'",
        "'speaker_13': 'Yes.'",
        "'speaker_7': 'Okay. All right. And. So the people who own that property now, are they the actual applicant or is it someone else who, you know, is trying to purchase the land that's that's rezoning this today?'",
        "'speaker_13': 'So the property owners are the actual applicant and they're in a joint venture with Saunders development to pursue this whole plan.'",
        "'speaker_7': 'Great. I have no further questions. Thank you.'",
        "'speaker_2': 'Thank you. Thank you. Councilman Ortega. All right, Councilman Flynn.'",
        "'speaker_9': 'Thank you, Bruce.'",
        "'speaker_13': 'Yes, sir.'",
        "'speaker_9': 'Might as well just stand there. I remember going through the complex there, rock drill complex a few years back and was told that there on that site there are about 76 or 77 separate structures that grew over the years when that was an industrial complex and.'",
        "'speaker_9': 'With the if the ability to put the offsite parking garage is is granted through this rezoning, how many structures that otherwise might have to come down to satisfy parking requirements? How many of those structures would remain if you know.'",
        "'speaker_13': 'We'll put our heads together here. I think we can.'",
        "'speaker_9': 'Thank you. In other words, how many how many buildings of historical value might we actually be re using by allowing this off off site parking you?'",
        "'speaker_2': 'That number of existing buildings isn't as high as 70, but there is a.'",
        "'speaker_0': 'Number of very small buildings.'",
        "'speaker_9': 'Including those we.'",
        "'speaker_2': 'Are looking at retaining.'",
        "'speaker_0': '18 large.'",
        "'speaker_1': 'Historic structures. So the predominantly brick masonry to through structures as well as some of the more interesting manufacturing buildings that are located along 40th, which is the vast majority of the historically significant buildings, was only one building from earlier that we're looking at the potential of taking apart and reassembling because it was built between two more historically'",
        "'speaker_1': 'significant buildings. The balance of those are buildings that would be taken down are 1950s metal sheets.'",
        "'speaker_9': 'Right. Okay. Does that does the the buildings that would be retained on the 40th, does that include the one that has the the railroad siding that goes through there?'",
        "'speaker_0': 'Yeah, we're looking to retain both the.'",
        "'speaker_1': 'Spurs and all of the and increase the lines and courtyards within this one.'",
        "'speaker_9': 'Okay. Thank you, Mr. President.'",
        "'speaker_2': 'Yeah, thank you. Councilman Flynn. Councilman Espinosa.'",
        "'speaker_12': 'A question on the euro to. I'm looking at chapter 59. How was that? That was called you oh two in chapter 59, wasn't it. Or what was it called in chapter 59.'",
        "'speaker_11': 'But Councilmember Espinosa, I will have to get back to you on that. I'm not sure if that if that, you know, to overlay nomenclature was a carryover from former Chapter 59 or if that was in the current zoning code.'",
        "'speaker_11': 'But it it is it is an overlay zone in the overlay section of of the current zoning code. And it is the billboard overlay.'",
        "'speaker_12': 'That somebody from CPD or the city attorney. How is the year or two mapped in 2010? Thank you, Councilman Espinosa, Nate Lucero, Assistant City Attorney. When the city resumed in 2010, the UO two overlay, which is the billboard use overlay, was mapped everywhere where it was.'",
        "'speaker_12': 'Presently allowed at that time. And so the properties that were already entitled with the billboard use retained that.'",
        "'speaker_2': 'Use through the.'",
        "'speaker_12': 'You oh to. So would that have been so this was for this is currently I b was that a use that was allowed in i b and therefore it got you go to add it on even though it didn't go into a new zone district.'",
        "'speaker_12': 'Andrew Correct me if I'm wrong, but I believe the B is a Denver zoning code zone district, is that right? So in 2010 when that property was re zoned, it was rezone to I.B.M. to. Well, because we didn't actually have eyes on districts in the prior.'",
        "'speaker_12': 'What would that have? Well, we did. We had i0i1 and I to. Okay. So that would have been on a billboard use would have been allowed in the I zero. I wonder I to.'",
        "'speaker_11': 'I believe that is correct, yes.'",
        "'speaker_12': 'So there are five one, two, three, four, five, five different adopted plans that relate to this. Do any of them speak to signage and billboards?'",
        "'speaker_11': 'I would have to confirm that. But having read through all of those several times, I'm not aware of any of them really addressing specifically the issue of of off premise signage.'",
        "'speaker_12': 'The reason I ask is having been through a steering committee and their neighborhood planning process. We have billboards on federal, but we never actually that sort of subject never came off. And so do we have a sort of weakness in our process whereby we don't actually have a mechanism to address whether billboards are, in fact, appropriate going'",
        "'speaker_12': 'forward or not? Because I get that the former I's zone districts in Chapter 59 allowed them. But when we move from a in a high zoned district into our most flexible zone district, which is IMAX, which could be 100% residential, it could be 30% industrial, could it be 100% commercial?'",
        "'speaker_12': 'We're talking about different animal. And if we're not having the conversation about signage during a planning process or during a rezoning, you know, when do we have it? And so I think it's it's relevant. I mean, I'm glad that somebody from Planning Board raised the issue because instead of suddenly realizing that there's a sort of weakness in'",
        "'speaker_12': 'our process about when do when do we start having that conversation? Obviously, we've we've run into this problem when we went to LED signage and things like that. But so I guess I would like from CPD if you could get back to me on what, if any, of our current neighborhood plans address signage going forward and if'",
        "'speaker_12': 'we have that as sort of our NPI process where we're talking about overhead signage because they're just this layer of of things that apply to various parts of the city that should be discussed and we should have direction when it when these things come to us.'",
        "'speaker_12': 'So thank you.'",
        "'speaker_2': 'All right. Thank you, Councilman Espinosa. Councilman, do.'",
        "'speaker_1': 'I think it was Bruce s question about your handout, please? I want to talk about the picture, the vision and master plan. This is a very impressive picture. And can you I don't know if you've got a copy of it.'",
        "'speaker_1': 'Can you describe where this parking garage is and the other two buildings that are in this development? It's a very impressive looking, complete plan here. And I just want to make sure I in my mind, I know what are old buildings destroyed was brand new where this parking garage is.'",
        "'speaker_13': 'Yes, sir. Councilman, do the the page that is entitled Vision and Master Plan two. In the far right of that image, there's a light blue structure in that is the proposed parking structure. In it has a high street address.'",
        "'speaker_13': 'But but there's a connection straight into the heart of the bigger site across William Street, Mid-Block.'",
        "'speaker_1': 'Oh. Okay.'",
        "'speaker_13': 'Are we. Let's make sure we're looking at the same picture. No, no. Okay. I'm sorry. I'm looking at this picture. So that in that picture, the parking structure is in the bottom left corner.'",
        "'speaker_1': 'Okay. So first.'",
        "'speaker_13': 'Yes, this is the picture, correct? Yes, sir. So in the bottom left corner, there's an image of the parking structure and it's illuminated. Is there a way to.'",
        "'speaker_11': 'Thank. Yeah.'",
        "'speaker_13': 'You don't have that picture. So in the picture that you all have in front of you this evening, in the handout, there's an illustrative that's at night with all of these buildings illuminated in the parking structure is in the bottom left corner and it in it actually says Denver rock drill on it in that image.'",
        "'speaker_1': 'Okay. Okay.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_1': 'Can you describe? Are these all your buildings going off to to the right there? Is this your entire plan?'",
        "'speaker_13': 'Yes, it is.'",
        "'speaker_1': 'Okay. Can you just give us just for education, can you explain what the future. Sure.'",
        "'speaker_13': 'So that right now the vision for the development program is that the generally single storey, historic redbrick structures would be reused for a lot of open office type uses and also retail, restaurant entertainment and recreation type uses. There's the taller buildings too, that further to the right are more futuristic at this point.'",
        "'speaker_13': 'But we're in discussions with the hotel company to perhaps do a hotel there and then some taller mixed use buildings in. Part of the idea, obviously, is to take advantage of the proximity to the 30th and Blake Rail Station.'",
        "'speaker_1': 'And I'm sure that some of those buildings will have its own parking like this parking garage is not going to satisfy the needs of that entire future.'",
        "'speaker_13': 'That's correct. That the the new buildings, the multistory new buildings would self park in in this parking reservoir would be available for visitors and tenants in the primarily in the red brick buildings where the there's a tradeoff. If we want to preserve and re-use those buildings, we need to find a parking solution.'",
        "'speaker_1': 'And it looks like some mixed use. Additional residential as well.'",
        "'speaker_13': 'Possibly. Yes.'",
        "'speaker_1': 'Very impressive image. Thank you very much. Thank you. Thank you.'",
        "'speaker_2': 'Okay. Yeah. Thank you. Let's go to Councilman Flynn. Back up.'",
        "'speaker_9': 'Thank you, Mr. President. When Councilman Espinosa was asking about the use overlay, he prompted a few questions that I had intended to ask, but kind of dismissed. So maybe, Bruce, I could ask you, are you intending to use billboards to bring billboards onto the site?'",
        "'speaker_9': 'And that's why you want to preserve this?'",
        "'speaker_13': 'Not at this time, no, sir.'",
        "'speaker_9': 'But you just want to preserve the right because it's there now.'",
        "'speaker_13': 'Generally, yes. So the this overlay, in order for a billboard to in order for a new billboard to appear anywhere in the city of Denver where this overlay is in place, a billboard somewhere else in the city would have to go away.'",
        "'speaker_13': 'Mm hmm. And that's the only way a new billboard could come here.'",
        "'speaker_1': 'Okay.'",
        "'speaker_13': 'And so the thinking is, is that it's a property, right? That that maybe someday could be of some value, in particular with the line running adjacent to this site. But there is no plan. There's no activity in in in a billboard somewhere else in the city would have to go away for anything to happen here.'",
        "'speaker_9': 'And, Mr. President, the reason I came back in after Councilman Espinosa was I was searching the other IMX zones in the areas, particularly along Walnut and Larimer and along Brighton Boulevard and all of the I Amex parcels there also have the billboard overlay as part of their zoning.'",
        "'speaker_9': 'So it's not an unusual thing. But would it allow, Andrew, would the billboard overlay allow the type of signage that we see, say, at the Convention Center, the lighted LED signs that advertise third party businesses or events or things like that?'",
        "'speaker_11': 'Councilman Nu Generally, yes, the bill overlay does have those location restrictions. It does have that. It does require the cap and trade program, but it would allow the the advertisement for off of off site services or or products.'",
        "'speaker_9': 'And would it need some special additional approval to do animated or variable messaging signs, billboards?'",
        "'speaker_11': 'My apologies. Without the without the the the Denver zoning code right in front of me, I can't answer that, but I will certainly circle back to you.'",
        "'speaker_9': 'Or perhaps I think the answer is yes.'",
        "'speaker_12': 'Councilman Flynn, at this point in time, the Denver zoning code does not allow billboards to be animated or illuminated. There are a couple that were grandfathered in 2010, but at this time, billboards are not allowed to be on billboards.'",
        "'speaker_9': 'That's all.'",
        "'speaker_2': 'All right. Thank you. All right, Councilman Espinosa, back up.'",
        "'speaker_12': 'I would be in support of them moving the one that's next to the student housing on Colfax. I mean, literally right outside the windows over to the side. The question I have, because everybody who comes in speaks, has to sort of mention who they are and most stay where they live.'",
        "'speaker_12': 'Mr. Donald, can you tell me who the principals are for? 3939 Williams Building Corp..'",
        "'speaker_13': 'Yes, the principles are the Weiss family, and they're Denver residents and business people in they've owned this site, I believe, since 1993. And they operate a business there. They operate their business there today and are in the process of relocating that business to accommodate the adaptive reuse of the site.'",
        "'speaker_12': 'Okay. Yeah, it's all right. This is there are so many layers between us and who's really making the ask. I just would like to know. So thank you.'",
        "'speaker_2': 'All right. Thank you. This concludes our questions. Now close counsel Bill 752 Comments. Members of council. This is again in my district. There are multiple things happening in this area right here. Full disclosure, I live down the street from this site.'",
        "'speaker_2': 'I think you got a you got a very active neighborhood. And you guys had to reach out to a lot of individuals, some of which aren't even close to this site, which. Again. Let's work on that. On our notification for neighborhoods, on some of these things.'",
        "'speaker_2': 'You probably didn't even receive a response from some of these neighbors, but the whole neighborhood is embedded right in this site. And rhino arts is is really close, close by. I'm going to be supporting it. This is something that I think, you know, again, it it it is on on par with the guidelines and consistent with what'",
        "'speaker_2': 'our plans are. And so I'll be supporting this. Other. I keep my screen just one out. Okay. No other comments. It's been more than a second reminder of Secretary Rocha.'",
        "'speaker_4': 'Black eye. Clark Espinosa. I. Flynn. I Gilmore. I cash in. Can eat. I. Lopez. I knew. Ortega.'",
        "'speaker_7': 'I.'",
        "'speaker_4': 'Sesan. Mr. President.'",
        "'speaker_2': 'I police those voting against the results.'",
        "'speaker_4': 'The sorry, councilor.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1208 North Quitman Street in West Colfax. Rezones property located at 1208 North Quitman Street from G-MU-3 to G-RX-5 (general, urban neighborhood multi-unit to general, urban residential mixed-use) in Council District 3.  The Committee approved filing this bill at its meeting on 7-11-17.  Community Planning and Development has determined that the requirement for a legal protest (signatures of the owners of at least 20% of those property owners within 200 feet of the subject area or 20% within 200 feet of the outside of the subject area) has not been met (petition signatures represent 0% and 6.5%, respectively).": [
        "'speaker_2': '11 eyes. 11 eyes. Constable 752 has passed. Councilman. Clerk, will you please put up Council Bill 750 on the floor?'",
        "'speaker_1': 'Yes, Mr. President. I move that council bills 715 be placed upon final consideration and do pass.'",
        "'speaker_2': 'It has been moved and seconded. The public hearing for Council Bill 750 is open. We have the staff report. Teresa Lucero.'",
        "'speaker_7': 'So seriously. Sarah With community planning and development, this is a rezoning of 1208 North Quitman Street. The request is to rezone from general urban multi-unit three storey to general urban residential mixed use five storeys. So the property is located in District three in the West Colfax neighborhood.'",
        "'speaker_7': 'It is adjacent to the Perry Street Light Rail Station and Lakewood Dry Gulch Park, four blocks south of Saint Anthony redevelopment and Sloan's Lake Park, three blocks west of Colfax Avenue and four blocks north of West Sixth Avenue.'",
        "'speaker_7': 'Property is about 10,000, almost 10,500 square feet or about a quarter of an acre. There is a single family structure on the property. The applicant is requesting rezoning to redevelop the property. And again, the request is to go from a multi-unit three storey to a residential mixed use.'",
        "'speaker_7': 'Five storey. General Urban is one of our more intense zone districts or sorry not doing districts contexts characterized by multi-unit residential variety of building forms. Low scale commercial imbedded in the area. Commercial uses can be a variety of building forms.'",
        "'speaker_7': 'And then the generics five zone district is primarily residential, but there can be a mixture of uses if the mix, if the nonresidential uses are on the first level. Otherwise the structure has to be residential. And if the structure is solely commercial, then the size of the structure is limited to 10,000 square feet and the allowed building'",
        "'speaker_7': 'height would be 70 feet. So again, existing zoning is multi-unit. Three land use in the area is a mixture of single and multi-unit residential one, two, three stories. Zoning North gm u three South e t u c which is two unit and open space for the City Park East rx5 and West Open space for the park that's'",
        "'speaker_7': 'there, the Liquid Dry Gulch Park. These pictures give you kind of a flavor of the building form and scale. The existing site is the top one. The vacant districts five site to the east is top right. Station itself is bottom right.'",
        "'speaker_7': 'Park is bottom left. And then the series of single family homes adjacent to the site are north of the site is top left. Land use in the area mixed between low scale multi-unit and single family. Informational notice on this application went out on April 9th, a planning board hearing and on June 21st.'",
        "'speaker_7': 'There, of course, all of the electronic notification and signs were posted correctly for that hearing, and there was a vote of 6 to 3 in favor of recommending approval on this application. This application was also at Land Use Committee on July 11th.'",
        "'speaker_7': 'And then, of course, we're here tonight. There are. Three or four local arenas in the area you have in your packet with your staff report 27 postcards and letters in opposition to this and 26 letters in support. And one of the letters of support is from the Sloan's Lake Citizens Group.'",
        "'speaker_7': 'So the criteria consistency with adopted plans. We have current plan 2000 Blueprint Denver and the West Colfax Plan, which is a 2006 plan, can't plan, protect and improve air quality by reducing vehicular pollution, by expanding the land use, the use of transit encourage redevelopment of housing that meets the increasing diverse needs of our residents.'",
        "'speaker_7': 'Encourage mixed use transit oriented development. And in three different ways. Strategies encourage mixed use and transit oriented development blueprint. Denver The land use concept is urban residential, a higher density primarily residential land use concept with a noteworthy number of commercial uses.'",
        "'speaker_7': 'And the subject property isn't within an area of change, which is, of course, where we want to direct growth. Future street classification for equipment is an undesignated local basically tailored to local access. The West Colfax Plan consists of two parts a framework plan and then as district plans.'",
        "'speaker_7': 'The framework plan is the part of the plan that tells that the plan tells and should be used for guiding our zoning decisions. The district plan is. Says it does not imply zoning changes but is included to provide guidance for appropriate character and scale in an area.'",
        "'speaker_7': 'So within the framework plan. This site is designated an urban neighborhood station, so single family and multi-family residential with development pattern that's variable and compact highest intensity focused around the station platform with a scale of 1 to 5 stories within the plan are also.'",
        "'speaker_7': 'Residential growth opportunity areas where existing housing stock is dated and declining and may be appropriate for redevelopment. Land use recommendations include establishing zoning tools that provide for a mix of building types and uses, promoting a range of housing types, supporting infill development and mixed use projects, particularly at the station areas.'",
        "'speaker_7': 'And to the greatest extent possible, focus both structural and use intensity at Main Streets, transit stations and town centers. So this is a picture of the plan in the the future land use concept in the West Colfax Plan, urban neighborhood station.'",
        "'speaker_7': 'As you can see residential growth opportunity area on there urban design concept map. So within the district plan, the plan tells us to establish appropriate regulatory conditions and incentives to facilitate the redevelopment of the Villa Park and West Colfax neighborhoods near rail facilities, and talks about the pace of development in the area.'",
        "'speaker_7': 'And again, this is a 2006 plan. Light rail started in 2013, so it pre-dates light rail, but talks about how development in this area might be gradual because there are not large assemblages of property. So staff believes that this request is consistent with the area plans that by using our standard zone district we are furthering the uniformity'",
        "'speaker_7': 'of district regulations and by establishing more development at our transit stations, we're contributing to hopefully helping our air quality and contributing to further furthering public health, safety and welfare. And by implementing our plans, we're doing the same. Justifying circumstances is changed.'",
        "'speaker_7': 'Conditions, the land or surrounding environments has changed or is changing to a degree that it's in the public interest to encourage redevelopment. Of course, where you have the light rail that opened in 2013, the redevelopment of the Saint Anthony site, also within this area in just the last three years, we have eight new multi units built in'",
        "'speaker_7': 'just the blocks adjacent to this block and this block. And we have four more under review. So we're seeing rather rapid redevelopment of the area based on the MMU three zoning. So staff believes this is an appropriate changed condition and an appropriate justifying circumstance.'",
        "'speaker_7': 'We didn't already talk a little bit about the general urban context, promoting safe, active, pedestrian oriented, diverse areas, enhancing convenience and enjoyment of transit, walking shopping, ensuring new development contributes positively to excuse me, to establish neighborhoods and other our five zone district primarily intended for residential uses and with that staff recommends approval of this application.'",
        "'speaker_7': 'And of course, I'm here for questions.'",
        "'speaker_2': 'Thank you, Miss Lucero. All right. We have seven speakers for this council. Bill. Two are identified as speaking for 6 minutes because someone else gave their time. So I'm going to call all I'm going to call the first five.'",
        "'speaker_2': 'When I call your name, please come to the first bench to save a little time. Bruce O'Donnell. Brandon Gill. Justin Herman. John Buckner. The second and Laurie Smith. Bruce O'Donnell, you first.'",
        "'speaker_13': 'Good evening again, Mr. President, of members of council. And unlike the eclipse, I'm coming around again more, more quickly, I guess, this evening. Thank you for your time tonight. This site, 12 Quitman is immediately adjacent to and in fact abuts the RTD W Line rail platform at the Perry Street Station.'",
        "'speaker_13': 'And so it's a tremendous total opportunity. In fact, nine months ago, the city of Denver rezone the adjacent property to the east. 1209 Perry Street to the same gr x five zone district in the fact pattern is identical here the it's adjacent to rail.'",
        "'speaker_13': 'There is significant plan support and in fact the West Colfax Plan from 2006 is explicit and unambiguous and it says it wants to see buildings one, two, five stories in height at this exact location. So we have had numerous meetings with two RINO's we can the West Colfax, R.A. and also the Sloan's Lake Citizen Group.'",
        "'speaker_13': 'This site is embedded wholly in both of those no boundaries. And the Sloan's Lake Citizens Group took action in support of this rezoning request. We can does not do that. In any event, in his is knowledgeable about this but does not take a position.'",
        "'speaker_13': 'In addition to that, we have 25 letters of support, most of those from property owners in the neighborhood. As Teresa Lucero from CPD explained. There's been tremendous change going on in this neighborhood in in fact, right today there are 21 site development plans that have either been approved or are under review, transforming this neighborhood primarily in multi-story'",
        "'speaker_13': 'buildings north of here between 12th Avenue and 13th Avenue. As was stated, there has been some some opposition from neighbors as well in this opposition is primarily been over heights, allowed of five stories in this group's five zone district.'",
        "'speaker_13': 'And we've listened to those neighbors and considered their input. And in response to that, last week recorded a protective covenant and deed restriction on this property that should this zoning pass this evening, the deed restriction would limit building heights to four storeys at this site.'",
        "'speaker_13': 'And so while x five would allow five, we've committed that we would only be able to go to four with this protective covenant. So we hope that that's a good balance between the two D objectives and the plan support and the justifying circumstances.'",
        "'speaker_13': 'And that compromising on four storeys makes sense in the neighborhood. That also allows us to take advantage of the total opportunity and implement the city's comprehensive plan. I want to reiterate that this rezoning application meets every review criteria that Council is asked to consider.'",
        "'speaker_13': 'It has plan support and it has justifying circumstances. It has a recommendation of approval from the Planning Department and also from the Planning Board. And so, in summary, I ask that you weigh that criteria and consider the covenants reducing it to four storeys and vote to approve this rezoning this evening.'",
        "'speaker_13': 'Thank you for your time.'",
        "'speaker_2': 'Thank you, Mr. O'Donnell. Brant and Gil. You have 3 minutes. Oh, actually, yeah. Come to the mike. Mm hmm.'",
        "'speaker_0': 'Yes. I'm Brandon Gayle. I'm the property owner. I actually didn't.'",
        "'speaker_2': 'Elect to speak. I was just here to answer any questions. Thank you. Justin Herman, you have 3 minutes.'",
        "'speaker_0': 'Thank you. I live just to the.'",
        "'speaker_11': 'North of the property.'",
        "'speaker_1': 'The one thing that was kind of stressed in the planning.'",
        "'speaker_2': 'Can you introduce yourself for the record, please?'",
        "'speaker_1': 'Yes.'",
        "'speaker_11': 'Justin Herman, I live at 1246 equipment.'",
        "'speaker_1': 'One thing that was stressed in the.'",
        "'speaker_0': 'Planning development meeting was.'",
        "'speaker_1': 'That this.'",
        "'speaker_12': 'Would keep the character of the neighborhood. There's no five story buildings within 200 feet of this property or even.'",
        "'speaker_1': 'Really visible from this property unless you go to Colfax.'",
        "'speaker_0': 'You know, just because the property of the East was rezone doesn't mean that it's right for the neighborhood. Yes, there's development going on.'",
        "'speaker_1': 'The.'",
        "'speaker_0': 'Immediate area. But again, five story zoning is not consistent with the rest of the neighborhood.'",
        "'speaker_11': 'Three stories, kind of.'",
        "'speaker_1': 'The max that you see there. And you know that I think it would just kind of look.'",
        "'speaker_0': 'Out of place. To be honest with you.'",
        "'speaker_11': 'The compromise.'",
        "'speaker_13': 'That they talked about.'",
        "'speaker_0': 'Would only.'",
        "'speaker_1': 'Limit the height restriction for 20 years. So it doesn't talk about anything. What what would happen with after that? You know, if they built a building that.'",
        "'speaker_12': 'You could add on top of that would increase then.'",
        "'speaker_1': 'In height and.'",
        "'speaker_0': 'Support the commercial aspect of the property.'",
        "'speaker_1': 'But again, the height is kind of more of the main issue here.'",
        "'speaker_11': 'I would increase parking.'",
        "'speaker_0': 'There's already kind of an issue with parking on the street just with the way that the properties are designed. And now they have garage garages that face equipment. So parking, that street parking is already kind of limited with higher density, but also increase to this issue that you already have on the street.'",
        "'speaker_12': 'People park on the street, walk to the light rail.'",
        "'speaker_1': 'Station and, you know, it's kind of an issue. So again.'",
        "'speaker_0': 'I would recommend the applicant amend their request.'",
        "'speaker_13': 'To grx3.'",
        "'speaker_11': 'Zoning. I know that.'",
        "'speaker_0': 'It wasn't available when they made the initial application, but it is available now. And so that that would be my recommend recommendation to the Council.'",
        "'speaker_2': 'Thank you, Miss Herman. John Buckner.'",
        "'speaker_11': 'Good evening, Council members. Mr. President. My name is John W Buckner, the second I'm the homeowner at 1267 Equipment Street. I appreciate the opportunity today to speak on behalf of my fellow neighbors and opposition to the proposed rezoning of 12 away equipment three property.'",
        "'speaker_11': 'My property is just outside the 200 feet radius to sign the official protest. However, I trust my concerns will be heard by this council if I believe this proposed development will negatively affect the lives of those within the radius and its surrounding area.'",
        "'speaker_11': 'I've been a homeowner on Quitman since 2013, just before the light rail came in. At this time there were a total of 22 homes on the cul de sac, plus or minus two, and we're calling from memory some duplexes.'",
        "'speaker_11': 'For reference, the 1200 block of women dead ends on the south side of the street into the Perry Street light rail station has been mentioned since 2013. Three single family homes on our block have been scraped and in their place, an eight unit condominium development has already been completed on one lot.'",
        "'speaker_11': 'And construction is underway for another 12 units on the other two lots. Likewise, the home directly next to mine has been sold to the same developer I just mentioned who erected the new eight unit condominium development with plans to build an identical eight unit condominium structure where a single family home once stood.'",
        "'speaker_11': 'In total, the development on our block has added 25, I should say, had and will add 25 new homes to our cul de sac, raising the total to 47 homes on a block that once held 22. This is not including the proposed unit in the building we are here to oppose.'",
        "'speaker_11': 'And it is important to note that all of the new proposed development at 12 away Equipment Street, all of them except for the proposed development equip the street have conform to the.'",
        "'speaker_1': 'Existing GMU.'",
        "'speaker_11': 'Three zoning. My fellow my fellow residents who are opposed to the proposed zoning will speak to the inconsistency with the character of the neighborhood that agr5 development will create, as well as this gentleman speaking to the infrastructure challenges.'",
        "'speaker_11': 'I echo their sentiment as neighborhood elders can barely recognize their community as it is. And although one could contend that development is a benefit resulting in a higher property value for each of us, and that development in our neighborhood was inevitable outcome due to the Denver's sustained growth in our neighborhoods.'",
        "'speaker_11': 'Proximity to downtown, however development have we, as we have experienced it, is both a benefit and a curse. Thus, in addition to the character issues this proposed structure will cause. I'd like to raise the topic of infrastructure as it pertains to the proposed rezoning and the challenges and frustrations of this proposed development will create for current residents'",
        "'speaker_11': 'as well as their new neighbors. I know personally of neighbors who can no longer grow gardens due to the height of GMU three buildings, let alone five casting shadows or four in this case casting shadows over the dwarfed one storey homes.'",
        "'speaker_11': 'Parking on our block is increasingly challenging as more residents occupiers, street developers build largely one car garages for multiple occupancy homes like real commuters who do not live on equipment, treat the street like a park and right already occupying vital spaces on an already cramped street and making some simple activities like unloading groceries or putting trash on'",
        "'speaker_11': 'the curb. A hassle for homeowners that least structure.'",
        "'speaker_2': 'Your time is up.'",
        "'speaker_11': 'In 3 minutes goes quick. If I may just conclude in saying that I appreciate you sharing my considerations and I appreciate your consideration in weighing these options.'",
        "'speaker_2': 'Thank you, Mr. Buckner. Laurie Smith, you have 6 minutes.'",
        "'speaker_0': 'Oh, yeah.'",
        "'speaker_8': 'Oh, no, you don't.'",
        "'speaker_2': 'Perhaps someone with you can put it together while you're getting going. Here we go. Yeah, we can see that. I wanted to fight. You want to go to the mic right here and then introduce yourself for the record?'",
        "'speaker_4': 'Okay. My name is Laurie Smith. You've probably all received emails from me in some form. I have an I'm an owner at 1275 Tennyson and have a contract under a house under contract on Perry Street, all within four blocks of this property.'",
        "'speaker_4': 'Which is why I'm interested party. I want to do two things. First of all, I want to set the context of what we're looking at within that 200 feet boundaries of the property zone of the property. I'm going to walk over here and I'm going to speak.'",
        "'speaker_2': 'We you know, we actually need you in the mike. And so if someone can just can hold that for her as be great. Excellent. Thank you.'",
        "'speaker_4': 'All right. So within this 200 feet, the yellow represents the parts that the city owns. The slashed green represents the part that developers own. And this the slash, the purple horizontal slash represent the part that are owned. But nobody that people don't live there.'",
        "'speaker_4': 'They're being rented out. The owners don't live there. They're being rented out. The red represents the part that are owner residents, and those are the people that signed the petition against this rezoning. So within 200 feet. Every owner except to sign the petition.'",
        "'speaker_4': 'One has a conflict of interest. In the other two, we could just never contact. We could never get a hold of. So I want that. I want that to be. I want you to see how many people within that area are against this free zone.'",
        "'speaker_4': 'Okay. The second thing I would like to do is talk about finding that balance between increasing density around, particularly around light rail stations. Balancing that with preserving the look and character of our community and our neighbor neighborhood. I'm pro-development, but it's got to be wise and thoughtful, not patchwork.'",
        "'speaker_4': 'We've got to have a plan. It has to make sense. So if you look through all those city of Denver plans, comprehensive plan, blueprint plan, West Colfax Plan, Todd Plan and the Denver zoning zoning of 2010 and reviewed and revised in 2017, you see a push pull between achieving greater density, especially around light rail stations or transit'",
        "'speaker_4': 'stations and preserving the character of the neighborhood. So our our neighbors are the group of us are trying to strike that balance as you are and as the city is. That's important. Okay. So we feel that the gr3 is striking that balance, that particular property is going from a single unit to if it goes to three stories'",
        "'speaker_4': ', it will end with the shop front. Our X is the shop front on the first floor and then the next two floors are residential. If it goes to that, that will change the zoning density from one to up to 20 units, which is a dramatic increase in density.'",
        "'speaker_4': 'The three story. We believe part of it will still be able to preserve that character of the neighborhood, which is one, one, two, three. And we acknowledge that the applicant has made an offer. We feel like that has no teeth.'",
        "'speaker_4': 'I've talked with city council staff and I've talked with our R.A. and both said, unfortunately, it's a gesture that would be very difficult to enforce if the eventual developer, which we understand the owner, is not the eventual developer, if that eventual developer does not abide by this attached covenant.'",
        "'speaker_4': 'Um, again, we are we it is really important to us to preserve the character of that, of that neighborhood character. And look, the neighborhood, which is all 1 to 3 stories. Lots of those homes have been redone, including the for the for next to this property.'",
        "'speaker_4': 'And then there, you know, other other properties as well that have been remodeled. I want to quote Mayor Hancock from a July 10th speech. Begin, quote, Development shouldn't happen to us. It should conform to our values. Here's how we're making it happen.'",
        "'speaker_4': 'Residents are partnering with the city to preserve the look and character of their neighborhoods. The city's partnering with the neighborhoods to determine their futures through neighborhood plans, which we need to update our Colfax plan. And neighborhoods are partnering with the city and developers to find ways to build projects that provide the stores and services that residents need'",
        "'speaker_4': '. Again, development shouldn't happen to us. It should conform to our values. And here's how we're making it happen. Residents are partnering with the city to preserve the look and character of their neighborhoods. So again, I would ask that you would oppose the request of g, rx5 and that you would recommend that the applicant reapply for grx3.'",
        "'speaker_4': 'I did it. I got it.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'So much. I really appreciate.'",
        "'speaker_2': 'It. Okay. I'm going to ask the the five that are up here to grab your seats. And we have two more, Stephanie Wickman and Mr. Siku and Stephanie Wickman. You are first. You have 3 minutes.'",
        "'speaker_3': 'Good evening. Thank you for allowing me to speak. My name is Stephanie Wickman. I live at 1218 Quitman Street. This is the property directly adjacent to the north of the property in question. I am the homeowner and resident at 1218 Quitman.'",
        "'speaker_3': 'I've lived at 1218 equipment for ten years. At the time of my purchase in 2007, the light rail, I knew about it. It was underway. I've I've weathered the construction and enjoyed the, the perks of the new station.'",
        "'speaker_3': 'But when I purchased in this neighborhood, it was in large part due to the charm and character of the existing structures, mostly single family, Victorian or bungalow type homes. Mine being a Victorian built in 1892. There are four currently Victorians in a row directly to the north of this property and we're all one, one and a half'",
        "'speaker_3': 'storeys. My concern. Somewhat selfish is the shadow or lack of sunlight that my property will receive. With the development of a five storey up to 75 foot tall structure that with the GM x five, if I understand correctly, can build completely to the lot lines.'",
        "'speaker_3': 'So this would block not only sunlight, but also views to to the south for my property and my neighbors to the north. I support the recommended GM x three. Request of some of my fellow neighbors. And I am also the person, the person who gathered the petition of protest signatures, four of six resident owners within 200 feet'",
        "'speaker_3': ', and that represents 12 of the properties within 200 feet of the subject. Property. So I'm here also speaking on their behalf because I spoke to each of these property owners, my neighbors directly, and we all have share the same concerns.'",
        "'speaker_3': 'Not only the term and character of the existing neighborhood, but the parking as that has been mentioned before. Parking is a large issue on our street. It is a cul de sac with a large area turn around for fire department vehicles at the bottom.'",
        "'speaker_3': 'That allows no street parking for a majority of of that. And I've already seen. Oh, my time is up. Well, thank you.'",
        "'speaker_2': 'That 5 seconds when.'",
        "'speaker_3': 'I use it. Thank you. And I just want to say, I. To me, quality of life is more important to the than the property value.'",
        "'speaker_2': 'Now, your times are Miss Workman. Thank me. Thank you. Yeah. Mr. Psycho messed up.'",
        "'speaker_8': 'Time starts when I start talking, right?'",
        "'speaker_2': 'I'm talking now.'",
        "'speaker_8': 'I just want to set it up properly. Okay. Everybody knows who I am.'",
        "'speaker_2': 'For the record.'",
        "'speaker_8': 'For the record, my name is Chairman Sekou, not Sekou. Chairman Sekou. And I am the founder organizer for the Black Star Action Movement, which is a public advocacy group for poor, working, poor, homeless and senior citizens. Okay. Baseball.'",
        "'speaker_8': 'Two strikes. I got one more strike. We're going to try this one more time, only we're going to make it basic. Paul, I need your help with this. We have a test for city council. It is to see if you are paying attention to us.'",
        "'speaker_8': 'And I believe there's a president. BROOKS If I'm not correct, there's a 160 rule that city councilman tells about in terms of you got to pay attention. Otherwise, this stuff can be overthrown and thrown out of court. Every decision you make is a 160 rule.'",
        "'speaker_8': 'And we used to bust Charlie Brown up in here. You remember Charlie Brown. You almost had a heart attack. We caught him reading sports page. Well, there was public hearing. And then Charlie had this issue, medical issue with his feet where he had neuropathy and he had these cowboy boots and he would not wash his socks.'",
        "'speaker_8': 'And when he took off his shoes to spread his feet, it would be so funky up in here. We could smell it all the way to the back of the room. And so we had to go get this spray to be scary.'",
        "'speaker_8': 'And he would call who peo potpourri before you go to the toilet?'",
        "'speaker_2': '750 We want to talk to the bill.'",
        "'speaker_8': '750 spoke to it. So we're getting it. So here we go. Help me pour five words. Repeat after me. Help me. Just so I know, you pay the rent.'",
        "'speaker_2': 'It was a cycle.'",
        "'speaker_8': 'Wait, wait. Speak to the bill. This is the bill. This is a bill.'",
        "'speaker_2': 'You're speaking to a council person.'",
        "'speaker_8': 'Work with me. The rent is too high. You said. No, this is the one. I'm going to give you a heart attack. The rent is too high. The rent is too high. The rent is too high. The rents too high.'",
        "'speaker_8': 'The risk too high. The rent is too high. We cannot afford it. Poor people. Now, this is a solution. And this called them for help because they're getting ready to have a heart attack up here because they pro-development rent control.'",
        "'speaker_8': 'What they tell you best. Rent control is the solution to the problem of development because it has to be planned according to recent not 2000 to not 2014. Whatever that I'm talking about right now with the influx of the marijuana, people are coming in.'",
        "'speaker_8': 'You've got to have 10,000 people every month where you put them and then you replaced mistakes. Thank you. Those who can afford it. Thank you. The rate is too high. Thank you. Rent control is the only. Thank you.'",
        "'speaker_8': 'Thank you. Yeah. Thank you very much.'",
        "'speaker_2': 'Yeah. Have a seat. Thank you. Thank you, Mr. Laker. All right. Rent control is illegal in the state of Colorado. Just for just justice, for fact. Just tell the tell you right amendment. I have I have a question.'",
        "'speaker_2': 'This is we're in question time now. And I have a question, Nate Lucero, because this has come up a couple of times around the legal protest. Where are we in this bill with the legal protest?'",
        "'speaker_12': 'So the manager of CPD has made a determination that the protest petition that was filed didn't meet the requirements.'",
        "'speaker_2': 'And what's the threshold? Just for folks.'",
        "'speaker_12': 'So it's I believe in Theresa may knows better than me. So if I'm wrong, she could correct me. But I believe it's 20% of the owners within the area to be re zoned or 20% of the owners within 200 feet of the property to be resolved.'",
        "'speaker_7': 'That correct owners of 20% of the area.'",
        "'speaker_2': '20% of the area. Okay. And so I just wanted to state it for the record, because we did get some communication that it was legal practice and it wasn't. And so just for the record, it's not a legal protest, but if it was, it would had to have met 20% of the area.'",
        "'speaker_7': 'Correct?'",
        "'speaker_2': 'Okay. Thank you. All right, Councilman Black.'",
        "'speaker_3': 'Thank you, Mr. President. I have a long list of short questions. The neighbors. If anyone wants to answer my question, did you all oppose the rezoning of the lot next door that is now rezoning x five?'",
        "'speaker_1': 'Across the street.'",
        "'speaker_2': 'Is there a.'",
        "'speaker_3': 'Answer that.'",
        "'speaker_7': 'You have.'",
        "'speaker_2': 'To go you've got to come to the mike. Mike and maybe a neighbor representative. Yeah. Come on up to the mike. Thank you. Introduce yourself again.'",
        "'speaker_4': 'I'm Laurie Smith. And had we known, had we been aware of that, we would have protested. Okay. Okay.'",
        "'speaker_3': 'So. All right. Thank you.'",
        "'speaker_2': 'And and I would say that some labor should probably stay here, and you're probably gonna get a lot of questions.'",
        "'speaker_3': 'So the rest of your neighborhood is zoned GMU three. And so I know Mr. Buckner was talking about the kinds of density development that is going in that does comply with that, that zone district. So I heard from you that you're not happy with that, but it's already zoned that way.'",
        "'speaker_3': 'So you know this. Whatever happens tonight, the rest of that can still happen. So I just want. Are you aware of that?'",
        "'speaker_11': 'We are not.'",
        "'speaker_1': 'Opposing the.'",
        "'speaker_11': 'Current model of redevelopment. It does fit within our region. Although I did cite some instances of the gee, the three story units at this point causing some conflicts for people as far as overshadowing their own homes. We recognize that in the spirit of Denver and where it's heading, this is consistent with what's happening in Denver.'",
        "'speaker_11': 'Five stories in our neighborhood is unheard of. And then we think we'd also present the other problems that we recommended that are on this street, in particular with the cul de sac. The number of units that would be included in a five story building versus a three story building will add significantly more numbers of cars on the'",
        "'speaker_11': 'street without any parking for them. Not to mention the challenges that we have with the light rail itself. The last plan for our area was ten years ago, prior to the light rail coming in, and I don't think anyone foresaw Quitman Street after the Perry Street Station named for Perry.'",
        "'speaker_11': 'But the train actually pulls in on Quitman being as heavily trafficked as it is right now for parking people, leaving their cars, not paying a fee and driving into the city excusing, taking the train into the city. So it's not the three story structures that we are opposed to.'",
        "'speaker_11': 'It is changing that everyone that has come into our area thus far has stayed within that range of three. Five would be unheard of in our neighborhood.'",
        "'speaker_3': 'So is is your primary concern the parking? Is that your biggest.'",
        "'speaker_0': 'No.'",
        "'speaker_11': 'I would say parking is second to the character of the neighborhood. My home was built in 1890 as well. So the many of us bought in this neighborhood for the sheer fact that it was single family homes, traditional homes, bungalows and Victorians.'",
        "'speaker_11': 'People take great care in restoring these homes. And what's happening is that a lot of these people are then being forced out of these homes based on the the cost of taxes as they go up and other things.'",
        "'speaker_11': 'And those are all subsidiary factors here. But ultimately, it is the character of the neighborhood that we think is at cost most. But I won't say that that's.'",
        "'speaker_1': 'Not the only.'",
        "'speaker_11': 'Factor, because the parking is also becoming a huge problem as a result of people going outside of what is traditionally accustomed to in this common in these in this neighborhood.'",
        "'speaker_3': 'So one final question. So the GMU three. Really is what I'm hearing from you. This is a question is is that's really inconsistent with your neighborhood of single family homes.'",
        "'speaker_11': 'It is. And it is inconsistent. But we all recognize that in a three story home that does bring retail to our neighborhood, which could very much change the dynamics of our neighborhood and does stay consistent with what we see happening along the light rail line.'",
        "'speaker_11': 'It is also consistent to our partners in the north at Saint Anthony and I will say the St Anthony's a very different community around Sloan's Lake than what we have in our sleepy neighborhood just south of Colfax. So some similarities there.'",
        "'speaker_11': 'So, yes, we do see that it is inconsistent with the neighborhood, but is really the height that is dramatically inconsistent. It's not the effort to bring in retail in addition to homes.'",
        "'speaker_3': 'Okay. So what I was referring to, though, is the GMU three, that the current zoning of your neighborhood is inconsistent with the character of your neighborhood because you're talking about the single family homes and the Victorian homes. And so the current zoning you have really.'",
        "'speaker_11': 'It is extremely inconsistent, however, consistent with Denver as far as what Denver is doing around the entire city, as far as where properties are going, we're all getting the shipping container look in our properties. I think we all recognize shipping containers with third stories.'",
        "'speaker_11': 'Yeah, it's not that the we're opposing, it's the five story 70 feet and a neighborhood that traditionally had single family, one and a half storey bungalows now going five stories 70 feet and right along Lakewood Gulch. So, yes, we do think that is very inconsistent.'",
        "'speaker_11': 'I understand your point. The Jimmy three is also inconsistent with the neighborhood, but not to that extent.'",
        "'speaker_3': 'Yeah. Okay. Thank you. Yes.'",
        "'speaker_2': 'Thank you. All right. You have more. You want to come back? Okay. Councilman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. Let me first ask Andrew Webb. Are you still here or that was you. Okay, sorry about that. So the. There was reference made to the Greeks zoning category that it's now available. So originally there was no gr3 and in the last bundle we created the Greeks three zone district.'",
        "'speaker_7': 'I think that's the. What, though, was that available when this application was filed? Uh. Where's Bruce? Mr. O'Donnell, can you answer that question? I'm not sure you're next on my list anyway, so.'",
        "'speaker_13': 'Grace three was not available at the time we filed the application. It was made available more recently.'",
        "'speaker_7': 'Okay. So let me ask you my other questions. So the this is a 10,480 square foot lot, correct? 0.024.'",
        "'speaker_13': 'Yes.'",
        "'speaker_7': 'Point two. Four acres. So first of all, on the 20 year covenant that would be placed on the property. Has that been filed or at what point would that be filed?'",
        "'speaker_13': 'Yes, I personally filed in the clerk in recorder's office last Thursday.'",
        "'speaker_7': 'Okay. And that is for 20 years, correct?'",
        "'speaker_13': 'It might be 25. I'll double check, but it's not in perpetuity.'",
        "'speaker_0': 'Okay.'",
        "'speaker_7': 'Councilman Lopez is saying he's reading something that says it's 25. Right. Okay. So that that goes with the land for the next 25 years, regardless of who owns it, correct?'",
        "'speaker_13': 'Correct.'",
        "'speaker_7': 'Okay. And then in terms of the number of units that could be on this site. So we're talking about four stories. So people keep saying it's five stories, but your covenant caps it at four.'",
        "'speaker_13': 'Yes, that's correct.'",
        "'speaker_7': 'Does that include your age back and all of that stuff on top?'",
        "'speaker_13': 'So the the way the covenant reads is that it's four stories and also 55 feet, and that would cover all of parapets, age, HVAC, mechanical, all that type of thing would be within that limit.'",
        "'speaker_7': 'Does that include like rooftop patios, everything? Yes. Okay. And then how many how many units can you get into that? That amount of.'",
        "'speaker_0': 'Properly.'",
        "'speaker_13': 'We haven't studied that yet, but it's anticipated that the ground floor would be all parking, likely with three floors of residential units above. And so maybe in the 15 to 18 range of total.'",
        "'speaker_7': 'In. So I know that oftentimes a a lender will not provide financing if you don't have some parking on your development. I'm just saying, you're looking at 15 units. What what is the anticipated number of parking spaces per unit?'",
        "'speaker_13': 'Most likely one per unit.'",
        "'speaker_7': 'And are we talking about predominantly one bedroom, two bedroom.'",
        "'speaker_13': 'So some mix of that there. I want to be cautious in this discussion. There is no development plan today.'",
        "'speaker_7': 'I understand. I understand that. But schematically, I mean, you can we're trying to figure out what you can actually fit on the site. Right.'",
        "'speaker_1': 'Right.'",
        "'speaker_7': 'Okay. Um. I think those are all the questions I have right now.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilman do.'",
        "'speaker_1': 'Theresa, a couple questions, please. On the planning board. Three members voted against this rezoning. What were the reasons or the issues they talked about?'",
        "'speaker_7': 'It was the tension between the framework plan and the West Colfax Plan and the District Plan in the back that talks about the character in the framework plan. Is the urban residential station or urban? I can't remember the exact term, but the station 1 to 5 stories.'",
        "'speaker_7': 'But in the district plan in the back talks about gradual change in the neighborhood, discrete changes. And it was that tension. Some members believed that. This was too intense of a change.'",
        "'speaker_1': 'Do they, do they have a discussion about the height of this project or.'",
        "'speaker_7': 'Well, yes. Whether the discussion was because the plan talks about discrete changes in that I want to talk about, say, the back part of the plan. And so what's discrete the discussion was, is five 3 to 5 discrete.'",
        "'speaker_1': 'So the property adjacent Councilman Black was talking about that was done. There was reason ten months ago that I hear this.'",
        "'speaker_7': 'Unanimously.'",
        "'speaker_1': 'And I hear Rose's word. Did not know about it. Was there no notification of that?'",
        "'speaker_7': 'There's always notification if some.'",
        "'speaker_1': 'And here we did you Hamlet?'",
        "'speaker_7': 'Yes, I did.'",
        "'speaker_1': 'Was there any opposition to that?'",
        "'speaker_7': 'No.'",
        "'speaker_1': 'Okay. How did council vote on that?'",
        "'speaker_7': 'Unanimously.'",
        "'speaker_1': 'Okay. Well, the. But that the summer questions. Thank you very much.'",
        "'speaker_2': 'Thank you, Councilman and Councilman Castro.'",
        "'speaker_6': 'Thank you, Mr. President. First questions for Attorney Lucero. The covenant that we're hearing about, is it in? Does it in fact. Limit development on this parcel to four stories for 25 years.'",
        "'speaker_12': 'KELLERMAN Katherine, I have not reviewed that deed restriction. So I can't say whether or not it does. It's a private covenant that was inflicted upon the property by the developer. It's not something that's required by the zoning.'",
        "'speaker_6': 'Okay. Mr. O'Donnell, please. Do you refresh my memory? Are you involved with the partial to the East? That was recent?'",
        "'speaker_13': 'Yes, I was the owners rep for that rezoning.'",
        "'speaker_6': 'And is there a development planned for that parcel at this point?'",
        "'speaker_13': 'It has been in to the city for a concept review.'",
        "'speaker_6': 'I'm wondering if there would be a possibility of a covenant on that parcel as well. Have you considered that at all?'",
        "'speaker_13': 'Well, I have nothing to do with it.'",
        "'speaker_6': 'It's okay. It's out of your hands at this, correct? Yeah. Okay. Thank you. See if I have. Anything else? No, that's all I have. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you. Councilman Cashman. Counselor Flynn.'",
        "'speaker_9': 'Thanks, Mr. President. Teresa on the. The 200 foot radius and the. The requirements for legal protest. As I'm looking at the the document that we were given in the staff, the new staff report. In the calculation of total land area of which you need 20%.'",
        "'speaker_9': 'Do we include the park? We do. And the RTD light rail?'",
        "'speaker_7': 'We do.'",
        "'speaker_9': 'So in other words, to get 20%, we in many cases, we might have to get the city to sign off on a legal protest. Do we include the streets?'",
        "'speaker_7': 'We do include streets.'",
        "'speaker_9': 'So when we count the square footage of the folks who signed the protest, do we count the square footage just of the parcel they own, or do we count out to the middle of the street?'",
        "'speaker_7': 'We count the parcel they own?'",
        "'speaker_9': 'Okay, so the streets always count against a protest. Okay. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Flynn. Councilman Espinosa.'",
        "'speaker_12': 'Councilman Flynn, I'm glad you brought that up because that was one of the I've stressed that before. When the when the community is successful, I will have questions for you, Theresa. But after first, actually for you, actually. But that 20% is very, very difficult to achieve because particularly when you're adjacent to right of way big right away'",
        "'speaker_12': 'and public entities that own property. If we were to actually do the numbers here, there are 21. If you look at that map, there are 21 parcels, seven have complete. So a third of them had satisfactory signatures. One had a split, four had rejected signatures.'",
        "'speaker_12': 'So between a third and half of the actual property owners that weren't public entities or streets did in fact sign. But that threshold of 20%, I mean, I would be happy to for us to reconsider how we we define that.'",
        "'speaker_12': 'So questions for that was just follow up to Councilman Flynn. Are you aware that sounds like citizens group like we can does not take positions.'",
        "'speaker_7': 'No. Because they didn't take a position on this rezoning.'",
        "'speaker_12': 'No. Their letter only gave the results of a straw poll. Okay. But it's really frustrating for me personally, because I wish they did take positions because because because of the fact that the city has put us in this situation and we have a tool to codify these sorts of tweaks through the waivers and conditions process.'",
        "'speaker_12': 'But since we don't use them in this situation, we enter into these public, private I mean, these private party agreements. And when you have an R.A. that doesn't take a position, it makes it very, very difficult. We've been successful, but only because we have bids in our nose that take positions, so to speak.'",
        "'speaker_12': 'So I do have other questions. Perry, are Perry equipment in the same street classification? No. What is Perry?'",
        "'speaker_7': 'Perry is a collector.'",
        "'speaker_12': 'And equipment is a local. So those are very, very different in the eyes of the zoning code, are they not?'",
        "'speaker_7': 'In some cases, yes.'",
        "'speaker_12': 'No. But are X is something is a new sort of is a sort of different animal. The but so in looking at the adopted plan justification, the AMAX has a storefront and we've talked a lot about the sort of mixed use, but all the plans point to urban residential where there is no mention that's single-family and multifamily'",
        "'speaker_12': '. How did CPD come to this idea that a mixed use zone district with storefront and nonresidential uses was a was consistent with an urban residential use?'",
        "'speaker_7': 'I'm not getting your question. I think.'",
        "'speaker_12': 'Specifically on your slide deck.'",
        "'speaker_7': 'Which one?'",
        "'speaker_12': 'They're not numbers. It's the one said review criteria, consistency with adopted plans.'",
        "'speaker_7': 'Okay. That might be. Well, okay.'",
        "'speaker_12': 'Actually. Let's go to the next slide first.'",
        "'speaker_7': 'Justifying circumstances.'",
        "'speaker_12': 'Yeah, it says urban station. Urban neighborhood station, single family and multi-family residential. It doesn't say, oh.'",
        "'speaker_7': 'I don't think I'm on the same slide as you.'",
        "'speaker_12': 'Further earlier in the presentation, we're talking about consistency with adopted class. Still further.'",
        "'speaker_8': 'Well, it's.'",
        "'speaker_2': 'Perhaps you can just just outline it there.'",
        "'speaker_12': 'One more right there. So the very first thing we're talking about, the West Colfax framework plan and it talks there's there's really. All the other plans roll up into this urban, residential, urban, urban neighborhood station. Urban, residential. There is some talk about.'",
        "'speaker_12': 'Mixed use projects, but our mixed use zoning is specific for those collectors, not for the local residential streets, are they not?'",
        "'speaker_7': 'Well, I'd have to pull out my code. But some of our mixed use is, as you know, from the last time I was here on the church or on local streets, like two X in particular.'",
        "'speaker_12': 'So that would be a two storey zone district is sort of far less intensive. I mean, by design that is what are zoned it district is for an s sort of context a suburban, you know, a single unit context.'",
        "'speaker_7': 'Well, that was an urban context. Yes.'",
        "'speaker_12': 'I mean, yeah, I'm sorry, but a single unit context or a t you context, we would go into it in a two zone district. Does that mean we don't use it to vaccinate in a in a in downtown Denver pharmacy?'",
        "'speaker_12': 'So I'm just trying to understand how CPD came to me to equate a local. I mean, treat Quitman the same as it did Perry, which are two dramatically different streets when these two plans this slide in the slide before talk about how these new zone districts is since clearly in the slide before this.'",
        "'speaker_12': 'It says the district plans quote do not imply zoning changes. So we're in a situation where we have a Jim U3, which is an urban residential zone district, and we're electing to go into a mixed use zone district.'",
        "'speaker_12': 'It's mixed use lite. Granted. Granted. But the plans don't say mixed use on local streets. So how did CPD come to the conclusion that this was appropriate?'",
        "'speaker_7': 'I think because of the adjacency to the transit station.'",
        "'speaker_12': 'But this is not oriented to the transit station. It is oriented to equipment going.'",
        "'speaker_7': 'To be oriented.'",
        "'speaker_12': 'Can you orient a building to the adjacent properties owned by RTD? Mm hmm. Can you orient your building towards the adjacent property?'",
        "'speaker_7': 'You could you a storefront? It depends on what you build. As you know, we've been seeing.'",
        "'speaker_12': 'The zoning provisions.'",
        "'speaker_7': 'Mandate form, but are several multi-unit next to each other.'",
        "'speaker_12': 'But this is the our zone district. So it has a storefront requirement. Is that storefront requirement on an interior side side sideline or is.'",
        "'speaker_7': 'It on the primary street, which is Quitman? Yes.'",
        "'speaker_12': 'So I'm still trying to because trust me, I've been promoting that we orient these buildings to the right away. Mm hmm. But this is a situation where we're not oriented right away. We're orienting to a slice of property that is clearly owned by RTD.'",
        "'speaker_12': 'Mm hmm. And so that's a side interior lot, not a primary street or some other thing. So I'm just trying to grapple with how CPD felt like what was appropriate and I supported for Perry is deemed appropriate for Quitman when they're two completely different street characters classifications.'",
        "'speaker_7': 'Again, I think it was the proximity to the transit station that swayed us. Sweet.'",
        "'speaker_12': 'So I so we have a new criteria in CPD that says transit station in proximity trumps sort of all or other. No. Okay.'",
        "'speaker_7': 'Council them all.'",
        "'speaker_12': 'Okay.'",
        "'speaker_0': 'But our plan recommendations.'",
        "'speaker_7': 'And other our.'",
        "'speaker_12': 'Plan recommendations do not say on local streets where we designate where we call for urban, residential, single family and multi-family, that we should be entering into sort of a mixed use zone district. So if we if that is our new idea, we should update our plans to sort of reflect that.'",
        "'speaker_12': 'That is the new criteria that overrides our small area plans.'",
        "'speaker_7': 'No. When you look at Blueprint Denver, the Land Use Council, that's.'",
        "'speaker_12': 'Not a small area plan, though. No, these are small area plans, which I would think.'",
        "'speaker_7': 'Both of them are what we look at.'",
        "'speaker_12': 'But it doesn't do in our small area plans that are newer and more recently adopted. Trump are sort of prior thinking that predate this.'",
        "'speaker_7': 'Well, we have a 2003 plan in Blueprint. We have a 2006 plan in the West Colfax plan. And so I would say generally, we think that the West Colfax plan would trump the blueprint plan. However, I think that with all that's been happening in this neighborhood, staff believes that the West Colfax plan is fairly outdated as well'",
        "'speaker_12': '. Yeah, I wish you've heard me before, because I actually think that you guys are trying to get to the right thing. But I wish we would empower you with more ability to use our waivers and conditions policies to actually shape and work with the developer and the community to slim down.'",
        "'speaker_7': 'That in the past. Yeah, it didn't work.'",
        "'speaker_0': 'Let's do it again.'",
        "'speaker_7': 'We tried that.'",
        "'speaker_2': 'Okay, Councilman, can I. Can I get to some other folks and I'll put you down the list?'",
        "'speaker_12': 'That's the fine.'",
        "'speaker_2': 'All right. Thank you. Councilwoman Black, can I get to Councilman Lopez? Councilor Lopez?'",
        "'speaker_1': 'Yeah. Thank you. Just a couple quick questions. I don't know if this is. For you or for for Laureen. Then I wanted to ask Lorene a question as well. To the property. Behind it was the one that was resolved.'",
        "'speaker_1': 'Right? That's if I look. Closely at 1209, Perry. And that was a reason to cheer. Now watch your.'",
        "'speaker_7': 'X53rx5.'",
        "'speaker_1': 'What's on the other side. So what? What faces this property?'",
        "'speaker_7': 'Are you talking about zoning?'",
        "'speaker_11': 'Yeah.'",
        "'speaker_7': 'Okay. Let me get to a zoning map.'",
        "'speaker_1': 'There you are. Is that always a.'",
        "'speaker_7': 'Oh, it's a city park.'",
        "'speaker_1': 'So it's a park. And the property north to it.'",
        "'speaker_7': 'Jim. Jim, you three.'",
        "'speaker_1': 'Also faces the park.'",
        "'speaker_7': 'Yes.'",
        "'speaker_1': 'Okay. Thank you, Teresa. If I may ask Laurie to come up, please. I just have a couple of questions. Or do you own the property?'",
        "'speaker_4': 'Excuse me?'",
        "'speaker_1': 'You own the property?'",
        "'speaker_4': 'I am an owner of 1275 Tennyson. And I have a contract.'",
        "'speaker_1': 'I'm talking about the property of question in question right now. Oh, you're the owner.'",
        "'speaker_7': 'Oh, yes. No, we have no.'",
        "'speaker_1': 'Okay. Remind me what your position was on this. You're a yes. Yeah. You encouraged us to vote yes, right? Yes. In Laureen.'",
        "'speaker_4': 'My my position. Hmm.'",
        "'speaker_1': 'So you you own part. You don't own property. You don't own that property. You own property in the neighborhood.'",
        "'speaker_4': 'I own property four blocks over on Tennyson, the 1200 block of Tennyson.'",
        "'speaker_1': 'That where you live?'",
        "'speaker_4': 'No, I do not live there. We are we have a townhome under contract on Perry Street, the 1500 block of Perry Street.'",
        "'speaker_1': 'Just north of Colfax.'",
        "'speaker_4': 'Yes, it's yes, exactly.'",
        "'speaker_1': 'So you're by the new development with the slums like area.'",
        "'speaker_4': 'Oh, I'm sorry.'",
        "'speaker_1': 'You're so. You're. Were you owned properties in the Stones Lake area?'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Okay. Okay. I just I wasn't sure many of you actually lived in the neighborhood or own property right there in West Colfax, so.'",
        "'speaker_4': 'I own property. I do not live there.'",
        "'speaker_1': 'Okay. Thank you. That counts for right now.'",
        "'speaker_2': 'Okay. And okay. Councilman. Councilman Black, back up.'",
        "'speaker_3': 'Thank you, Mr. President. Teresa. Can you tell me what can be built in G three and how tall they can be.'",
        "'speaker_7': 'In a moment?'",
        "'speaker_12': 'Apartment forms four stories, three stories, up to 45 feet.'",
        "'speaker_7': 'So it is a three story. So industry which I wanted to get. What? Here is my old cheat sheet. So urban house in 80 you duplex garden court rowhouse house and apartment and then in the grs5, by contrast, just a shopfront building form.'",
        "'speaker_7': 'And as the councilman said, 35 feet is the height limit versus the 70 that we're talking about with the. Or five.'",
        "'speaker_3': 'Okay. Thank you. And, Mr. O'Donnell, your covenant would limit it to 55 feet.'",
        "'speaker_13': 'Yes, that's correct. And also for stories.'",
        "'speaker_3': 'Okay. I know people are asking about the covenant and I think Miss Smith had a concern about it. I will say in my own district, there is a covenant, a piece of property by the South Moor Station that.'",
        "'speaker_3': 'The property owner and the neighborhood association agreed upon in 1997. And it's a 50 year agreement and it is attached to the property and there have been multiple property owners and it is still attached to that property, which is why there's nothing there.'",
        "'speaker_3': 'So I do know that they they are legally binding, so. All right. That was my only question. Thanks.'",
        "'speaker_1': 'Thank you. Councilwoman Black. Councilwoman Ortega.'",
        "'speaker_7': 'I've asked my questions. Thank you.'",
        "'speaker_1': 'Well. Carl's menu. Did you have something else or you didn't care? Bruce, the just want to follow up on the property adjacent there. Do you know what the what they're planning on building there on that property.'",
        "'speaker_13': 'On the 1209 Perry? Yes. They're hoping to build for sale condominiums there.'",
        "'speaker_1': 'Do you know what the size of that building is going to be? Four stories. For some reason, it would be similar to yours. What you're with there?'",
        "'speaker_13': 'That's my understanding, yes.'",
        "'speaker_1': '55 feet.'",
        "'speaker_13': 'I believe it. Four stories is what I've been told. I don't know.'",
        "'speaker_1': 'The feed requirement for stories is for the.'",
        "'speaker_7': 'We don't have a four stories owned district, so I don't know if.'",
        "'speaker_1': 'It is it normally 55 feet.'",
        "'speaker_7': 'I a story.'",
        "'speaker_1': 'What's five? What's five stories? 73. 73 stories is what?'",
        "'speaker_7': '40 or 35.'",
        "'speaker_1': 'Okay. So it's about 55 feet. Okay. Thank you very much. Thank you. Thank you, Councilman. Councilman Gilmore.'",
        "'speaker_5': 'Thank you, President Pro tem. I had a question. I believe it would be directed to the city attorney. Some of the residents had mentioned concerns about a shadow that could be created by, I guess, what will be in a covenant four storey building with 55 additional feet.'",
        "'speaker_5': 'And and I remember us talking a little bit about, you know, the requirements that that we need to look at to approve or not approve a zoning. And I wanted to make sure, you know, the shadow question. Are we able to consider anything around shadows that a building might create as criteria to not approve a rezoning?'",
        "'speaker_12': 'Kels, when Gilmore, Councilwoman Gilmore for this particular zone district. It's going to depend on what the setbacks require. And since we're completely within the Denver zoning code in this area. I don't think it takes into consideration like the protected zone district when you have a transition from old zoning code to the new zoning code.'",
        "'speaker_12': 'So I don't think that there's any entitlements to sunlight.'",
        "'speaker_5': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_2': 'Yeah, thank you. Councilwoman Gilmore and Councilman Espinosa.'",
        "'speaker_12': 'So quickly, Mr. O'Donnell is the property owner, the sole parcel party on the covenant.'",
        "'speaker_13': 'I'm sorry. I didn't quite catch the question.'",
        "'speaker_12': 'Is the property owner the sole party on the covenant?'",
        "'speaker_13': 'Yes. The the property and or signed in. There's no memo you or agreement or anything with anybody. It was done voluntarily.'",
        "'speaker_12': 'Yeah, that's an important thing that I wanted to bring up, simply because when we've done this in the past, it has been with similar to what Councilwoman Black had mentioned, it's a two party covenant where an R.A. or a bid with the owner because you to amend or remove the covenant, you only need the parties that are'",
        "'speaker_12': 'involved. And so well it's well intended. The owner could change at any point I mean, remove the mean on record that that covenant at their discretion.'",
        "'speaker_13': 'So we approached we can last week in and I attended their board meeting and asked if they would please be a counterparty to an agreement and they'd said no.'",
        "'speaker_12': 'Yeah. And so that's what's driving it.'",
        "'speaker_13': 'And in the. The those who have expressed concern over five stories are individuals. In in so we we attempted to but we could not identify a counterparty in. So since Denver does not have a four story zone district, we decided the right thing to do in response to this input was to go ahead and record the covenant'",
        "'speaker_13': 'on our own.'",
        "'speaker_12': 'So let me ask you this, and I don't know if you have owner the owner here, but and maybe Miss missed that one one way we've addressed this in the past I think it was on the on the Saint Dominic's is actually Saint Dominic's was willing to in their covenant or in an M.O., I forget which mechanism'",
        "'speaker_12': 'they used but to cover the legal expenses, if the other party, I mean, sort of the other party pursued a judgment on a violation of the covenant. It's pretty easy to count four stories versus more than four stories.'",
        "'speaker_12': 'You know, would you guys be willing to do add that language or create that sort of protection if one of the concerned members of the neighborhood would be a party to that covenant?'",
        "'speaker_13': 'So because we couldn't find another party, I think we've taken the best and kind of only step we could to memorialize our intent and commitment to only build four stories. And the fact is, is that if anyone were to pull title work even today, this would show up as an exception to title.'",
        "'speaker_13': 'And so when this site is up for development and they try to get financing or design, get in step started anything this will appear in and I don't think it can be violated because they won't get financing.'",
        "'speaker_12': 'But that would just during your title work you could simply cure that. And but to do that, you'd simply go to the owner and say, look, I need to remove this. There's this covenant because this is preventing me from maximizing my ARX five zoning that I have on the property.'",
        "'speaker_13': 'I the, the owner is here tonight and is available to answer questions. I would say that if we've clearly expressed our intent and commitment to this four story issue, and it may be that we could explore a more solid way to to make it bulletproof.'",
        "'speaker_13': 'But we've we've done what we could do alone and with the tools available to us that I'm aware of now.'",
        "'speaker_12': 'Well, I appreciate that. And I would just encourage any of my colleagues that are supporting this rezoning on the basis of that risk, voluntary restriction that you press the applicant and the owner to sort of a more robust measure.'",
        "'speaker_12': 'Do I have any other questions? I don't think.'",
        "'speaker_2': 'So. All right. Thank you, Councilman Espinosa. This concludes the question portion and closes the public hearing for Council Bill 750. We're now on to comments. Kamal Lopez, this is your district.'",
        "'speaker_1': 'Yes. This is the real district three.'",
        "'speaker_2': 'Legendary.'",
        "'speaker_1': 'House of the legendary. That's right. So I am I want first, I want to thank everybody for for being here and these kind of rezonings often, you know, they're head scratchers, especially when they are along light rail lines and especially when they split neighborhoods right on right across the street is Villa Park with a plan that's 1992'",
        "'speaker_1': '. West Colfax has been behind me, the more nuanced plan, a lot more involvement, and is consistently being tinkered with. So I totally was was very careful not to engage in any of the conversations, any of the meetings, anything like that.'",
        "'speaker_1': 'I wanted to be absolutely removed from the process so I can make have with a clear head, take a look at this and then hear from folks in the hearing. And although, you know, I absolutely I absolutely respect and really want to see a lot of the folks who are here.'",
        "'speaker_1': 'And thank you for being here. There's a lot of folks who are here. Right. And so we have to really think about this in context in terms of, okay, this is a big neighborhood, big neighborhood to the north and in the south.'",
        "'speaker_1': 'You know, for me, I'm thinking of thinking about context. And I think of. How it came in the Council with support from planning board. Yes, there were some no votes and I paid attention to those no no votes, took a look at those, dived into some of the reasoning.'",
        "'speaker_1': 'But when you look at the criteria that we have and you look at the criteria that we have in terms of rezoning. This meets the criteria from CPD. It's in compliance with with our plans. It's in compliance with the West Colfax Neighborhood Plan.'",
        "'speaker_1': 'And it's not the only development in the neighborhood. Just to the north. You have stones like. And it's growing like crazy. Yes, you do. I'm from the neighborhood. I've been there. A heck of a lot longer than you guys have.'",
        "'speaker_1': 'All right. So the second is on Perry. Perry is growing. You see development on Perry happening like nobody's business. I haven't seen any any opposition to that. Right. Third, when you look at 12 or nine, I'm asking why hasn't there why was there opposition to that?'",
        "'speaker_1': 'If you're looking at one property on Perry and this is where I disagree with my colleague here, you're looking at the property that faces Perry adjacent to the light rail station. Right. And you look at the property right behind it and the property in question doesn't face anything else but a park.'",
        "'speaker_1': 'It's different when you're talking about a neighborhood or units or lots on a neighborhood that face each other. Right. It's absolutely different. It really makes no sense. To restrict height and to restrict density, especially at a light rail station on Perry.'",
        "'speaker_1': 'And, you know, we can't consider affordability, but affordability doesn't equate to less units. And so that, you know, what was spoken here earlier in that testimony is kind of out the window. It doesn't make sense. I actually was looking for opposition.'",
        "'speaker_1': 'We can did not oppose it that I'm kind of frustrated as well to the organized neighborhood association in the neighborhood isn't isn't present the an issue that Villa Park neighborhood which is right across the street within 200 feet.'",
        "'speaker_1': 'They didn't submit any kind of opposition. And then also I don't see the outcry in the room. Where is the outcry? If it was such a big issue, you think this would be filled. And I'm sorry I called you up.'",
        "'speaker_1': 'I had. That's that's just the thing. If I see the property owner here who's supporting it. And then I hear testimony from folks that don't even live in that neighborhood. And they live in a neighborhood that's even denser.'",
        "'speaker_1': 'So for me. You know, I don't think that there was a necessity for a restriction, but the restriction exists. So that that deed restriction is limited in height for 25 years. As much as I understand it, if this rezoning is approved.'",
        "'speaker_1': 'The other thing is this yes the area cost of 20% for for a protest but. What we saw and what we saw in front of us is 16 signatures, 16 signatures, eight of which were valid. To have a real protest to give us the the legal justification to oppose it.'",
        "'speaker_1': 'There has to be more than eight signatures. And so and that for me. That's a big deal. I can. It's hard for us to oppose something if the opposition is not in the room. It's big. That's that violates any one of those criteria that we have or that we'd only have a legal protest for.'",
        "'speaker_1': 'I've been in this room. When we had rezonings on any matter where we've been here till 3 a.m.. Because it's packed, because there is a legal protest filed over one or two properties. I've been here long enough to know the difference.'",
        "'speaker_1': 'And I would I would really encourage that if if there is that activity, if there is that groundswell of folks that don't want to see the density or don't want to see this kind of zoning in the neighborhood around light rail stations, folks.'",
        "'speaker_1': 'Then you need to be able to have it in the chambers or in a legal protest. So that. That's where I'm at with this. I you know, I have remained as far away from the intermingling conversations that have had.'",
        "'speaker_1': 'Take a look at this objectively. And that's what we do in zoning, is that you have to take a look at this absolutely objective objectively. And I just don't see any reason to oppose it. Any legal reason to oppose it?'",
        "'speaker_1': 'And you can laugh and snicker here. But, you know, this is my neighborhood as well, too.'",
        "'speaker_11': 'May I speak to why we're snickering?'",
        "'speaker_1': 'What is this?'",
        "'speaker_2': 'This is. This is the comment period.'",
        "'speaker_1': 'Sorry, buddy. You had your.'",
        "'speaker_2': 'You had a.'",
        "'speaker_1': 'Chance. I had my 3 minutes. But I think it's very.'",
        "'speaker_11': 'Interesting that you give developers more time to talk.'",
        "'speaker_1': 'But no, no, no, no.'",
        "'speaker_11': 'I can. I can. Categorically. Sir, sir, everything that Mr. Lopez just said. Okay. Excuse me for breaking decorum, sir.'",
        "'speaker_1': 'Thank you. All right. Okay. Okay.'",
        "'speaker_2': 'Are there?'",
        "'speaker_11': 'You can call us.'",
        "'speaker_2': 'All right. Are there any other members of council? One of my coming calls for an well.'",
        "'speaker_12': 'Is what it is. I just want to explain my vote in that. I'm trying to look back. I'm trying to compare old zoning versus new zoning. I mean, there was a woman, Stephanie Wickman, who lives who signed that protest petition, lives immediately adjacent to this parcel, who will definitely be impacted in a way by this.'",
        "'speaker_12': 'The amount of zone lot coverage and the drastic changes in parking versus, you know, anybody who owned in that area prior to 2010. And that's just going to give you three, which is the the culprit of transformation in Jefferson Park that everyone sort of recognizes as like, you know, this is this is this is a foreign thing'",
        "'speaker_12': '. So, Jim, you three is no great shakes. And that's what that's what this area is is is plagued with, in my opinion, in going to this Joan district. This is a good zone district. And philosophically, I'm all for density at our rail stations.'",
        "'speaker_12': 'But how we got here isn't how we should get here to density. It is very clear to me that this is a real stretch of old adopted plans in that flies in the face of recent adopted plans and with very, very, very detrimental impact to a local street.'",
        "'speaker_12': 'And so, again, philosophically, my heart's in this sort of zone district, but I cannot support it because I don't think it has the valid plan support that it needs in order to for us to sort of grossly say that the criteria has been met.'",
        "'speaker_12': 'But I so I just I'm not saying that you guys can't see it, but I don't see it. And I wanted people, Bruce, particularly, because he he knows that I feel that we should have density here. And I work with other developers time and time again, but I try to work in, you know, in a way that'",
        "'speaker_12': 'we're actually recognizing the needs of the community, recognizing the needs of developer and trying to find a middle ground. And I think that was what the tool that I've mentioned before is the covenant. That's how we've used it in the past.'",
        "'speaker_12': 'I wish we didn't. We can do it through zoning, particularly when we had our and it was a lack of our know strength or willingness or bid. And it's really, really difficult when we don't have the ability to sort of use our tools or use third parties to get to that compromise.'",
        "'speaker_12': 'Because I do think there's a compromise to be made here, one that orients a new development towards the towards the Lakewood Gulch, one that satisfies parking and architectural concerns and street lighting concerns, permitting, you know, future residential permits, which you can't do unless he brings a mixed use on that ground floor.'",
        "'speaker_12': 'And there's a real way to sort of get to grapple with our station areas in a way that is constructive and not destructive. But our M.O. is to zone to something that is. That is just so. So I don't know.'",
        "'speaker_12': 'So. I don't know the loss for words of how pathetic our zoning code is on adapting to the real world contexts of our neighborhoods because they're so applicable citywide that they don't recognize that a Lakewood Gulch and a Jefferson Park are different than an MLK and Central, you know, just completely different animals, but same zoning tool.'",
        "'speaker_12': 'And we should be able to sort of reach that compromise. And I and I think Bruce has proven time and time again that he's capable of doing that and willing to do that. But he doesn't have to go any further than where the city takes him or demands and.'",
        "'speaker_12': 'And that's really unfortunate. Right. So I've been on that on that on that soapbox for a long time now. Thanks.'",
        "'speaker_2': 'All right. Thank you. Councilman Espinosa.'",
        "'speaker_0': 'Councilman Black.'",
        "'speaker_3': 'Thank you, Mr. President. This is a very interesting rezoning. And as my earlier questioning sort of alluded to, I think. The issues in the neighborhood are really the GMU three rezoning. And I know a lot of the west side of town is is getting some really awful buildings built in residential neighborhoods and and.'",
        "'speaker_3': 'That that zone district is is. Is going to hurt your single-family residential neighborhood. And I feel like that's more of a problem than this building that is adjacent to the light rail station. And as we do our work, we really are trying to encourage density at the light rail stations.'",
        "'speaker_3': 'To get people to use that the train. And I feel like the adjacent lot that is grx5 makes this appropriate in the fact that nobody came to oppose that. I think it's a legitimate transition to the GM, you three.'",
        "'speaker_3': 'Parking is not how we should plan our city. We spend a lot of time talking about parking. You guys can work with. With our parking department on maybe some residential permits. I don't know. But I appreciate the developer considering a covenant.'",
        "'speaker_3': 'I think that they would be willing to work with the neighbors on other things. I am going to support it. It does meet the legal criteria that we are required to look at. And so I will be supporting you.'",
        "'speaker_2': 'Thank you, Councilwoman Black.'",
        "'speaker_0': 'Councilman Flynn.'",
        "'speaker_9': 'Thank you, Mr. President. I think that the all of the criteria we heard in the staff report would also support the the new generics three. And it does bother me listening to Councilman Espinosa and talking about Equipment Street being a dead end and being completely different from the collector nature of Paris Street that this might be the'",
        "'speaker_9': 'even with the restriction in the covenant to force storeys puts significantly more traffic on a dead end street than would occur on that lot that's on Perry. And so I am struggling with that because I think the very same arguments that are made and the criteria that fit the Greeks five also fit the generics.'",
        "'speaker_9': 'Three And I know Mr. O'Donnell said that that came along after the application had begun, but I wish that that had been explored more fully, because I think that might be the more appropriate song for this and would be very justifiable.'",
        "'speaker_9': 'So thank you, Mr. President.'",
        "'speaker_2': 'All right. Thank you, Councilman Lopez.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_2': 'Well, actually, I'm sorry, Councilman Lopez. Councilwoman can each popped in at that time? She hasn't spoke yet?'",
        "'speaker_1': 'No.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_5': 'I want to thank the folks who spoke today and also a number of you wrote letters and emails. Laurie, I think I got your letters, so I appreciate you communicating with us in advance to share your concerns. I just wanted to speak for a moment about one of the criteria that's been in dispute a little bit, which'",
        "'speaker_5': 'is about the adopted plans in terms of the West Colfax plan and its age. I know 26 feels like a long time ago to us, but it is more up to date. That is a more recent plan than we have in many areas of the city.'",
        "'speaker_5': 'And I also don't have any reason to believe that we wouldn't come up with similar recommendations because the stuff that went into that plan is so similar to that which is coming out in other plans with other station areas like this.'",
        "'speaker_5': 'And so it is it is definitely, in my mind, still a criteria that has been met because I you know, it was still planning for transit. It was still planning for some of the things that the open space was there.'",
        "'speaker_5': 'So none of those things that went into that plan have changed. So there's not a lot of belief that I have that the plan would come out necessarily differently. The other thing I wanted to just distinguish, because I know folks are bringing out transportation concerns, is this is a little different than what we talked about a couple'",
        "'speaker_5': 'zoning ago. Go with the street and the whole area in that and you have a dead end into an entire development. In this case, you have a dead end into a park. It's not like the development is extending beyond.'",
        "'speaker_5': 'And so I think that there's not a lot of purpose, there's no other destination there. So when we when we think about what's going to happen with traffic and a dead end, it's now people are going to the grocery store and then have to get back out again.'",
        "'speaker_5': 'The only people who are going to go out, the dead under, the people who are going to be parking there so it doesn't have the same traffic implications as is the earlier one. So. And so, you know, I just you know, I appreciate the concerns and it's always hardest for the folks who live closest in terms of'",
        "'speaker_5': 'the impacts of change. And so really sensitive to that. I think there should be a lot of conversation here about step backs on the backside of that building. If it if it doesn't have a protected district element to it.'",
        "'speaker_5': 'And owner, I hope that you will be really sensitive in thinking about that. But I to see that the criteria are met and just wanted to speak for a moment about distinguishing why in particular, I think the plan has been met in spite of the fact that folks are concerned about the plan being from 2006.'",
        "'speaker_5': 'So with that, I will be supporting it today. But I do hope that you all will stay in dialog and I appreciate your constructive approach tonight. You've been very respectful and communicative and it's very much appreciated. Your your concerns are heard even even if they don't necessarily change the weighing of the legal criteria.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_2': 'Councilman Lopez. Thank you.'",
        "'speaker_1': 'Yeah, I just I know that the comments have been made on parking, but we can't consider anything when it comes to parking and parking's an issue. Parking from the stadium is becoming an issue all the way that far south.'",
        "'speaker_1': 'And we have to consider tags, literally tags that you hang on your car to keep people from parking on your spot. And that's not even your spot. Public Streets, Public Street. But that's a whole nother issue. We can't consider parking as part of a zoning, especially a zoning application space, especially here.'",
        "'speaker_1': 'It's just not part of the criteria. And I really, really want to underscore that. And the other point is exactly the brilliance that my calling it was. Just displaying was. That isn't. To other development. It's a dead end, but it's a dead end to a light rail station.'",
        "'speaker_1': 'And if we really, really want to be able to increase access and just looking at that, increase access to light rail and stepping down from using vehicles, these are the locations in the way we do it. This is where you have density and it's not fair for folks to live on a light rail station and not even'",
        "'speaker_1': 'be able to have access to it or just to limit that access to a few. To a few. What good is a light rail station around bunch of single family homes? With cars. There you have it. So I just want to make that extra point.'",
        "'speaker_2': 'All right. Thank you, Councilman Lopez. See no other comments. I'll just say this. Number one, everyone who's still here at 9:00, it's an early night for us. But for you, it's a late night. You've come through security, you paid for parking.'",
        "'speaker_2': 'And so I just want to thank you for voice, in your opinion, I think is incredibly important. I think this makes our city much, much better. I went on I went on a ride with Councilman Espinosa in his district of Jefferson Park, and I got a chance to see the the development that was happening.'",
        "'speaker_2': 'And it is a bit ridiculous and overwhelming for the community. And so we began to have this conversation about what do you what do you do? Where do you what do you kind of go from here? And I have a a proposal coming in my district.'",
        "'speaker_2': 'And I'm glad you brought up the the the three story. The the what was I think it was a game, you three that's around here. We have the same issue in a part of five points in San Rafael and the neighbors and they have 80% of the neighborhood on board too downs on the neighborhood because of this'",
        "'speaker_2': 'fear. And and although we're talking about this one spot here, I think there's a larger conversation for your entire neighborhood to be had. The thing and Councilman Flynn touched on it that I'm really upset and kind of bothered on is is the Greeks three from CPD.'",
        "'speaker_2': 'I don't understand how later in a process that becomes it comes up as a possibility and not in the beginning of the process. And so I wasn't in on those. I I'm sitting here as, you know, an objective, you know, councilperson now.'",
        "'speaker_2': 'But. This is the third or fourth time we've had a conversation where this could have been taken care of on the front end between the neighborhood and the community. And now we're dealing with it on the back end.'",
        "'speaker_2': 'And so at. I don't I don't get that. And I don't understand that. And it's very frustrating. I. This is a tough one because, you know, obviously, I think the neighborhood has a lot of concerns and they're their right concerns.'",
        "'speaker_2': 'And at the same time, we have a criteria. And at the same time, this is a light rail station. And and so this is tough. But I guess my message is twofold. One, I want to have a conversation with CPD on on these enlightenment moments that happen.'",
        "'speaker_2': 'As the conversation is going with the proposer and then something changes 6 to 12 weeks down the road. I just I don't get that. You've done this study. Why is it changing? So I just need an explanation on that.'",
        "'speaker_2': 'And then to if the neighbors are really wanting to take this to the next level, what does it look like to look at the entire context of the community? So with that, Madam Secretary, Rocco.'",
        "'speaker_4': 'Lopez. I knew Ortega.'",
        "'speaker_7': 'I.'",
        "'speaker_3': 'Black eye.'",
        "'speaker_4': 'Clark.'",
        "'speaker_0': 'Right.'",
        "'speaker_4': 'Espinosa.'",
        "'speaker_12': 'Yes.'",
        "'speaker_1': 'Flynn No.'",
        "'speaker_4': 'Gilmore I caution. Can each.'",
        "'speaker_12': 'ESPINOZA No.'",
        "'speaker_4': 'Mr. President?'",
        "'speaker_2': 'No. Please consider bringing us the results.'",
        "'speaker_4': 'Sorry. 1/2.'",
        "'speaker_3': 'Not everyone's.'",
        "'speaker_12': 'Felt sorry.'",
        "'speaker_2': 'Yeah. Can you.'",
        "'speaker_4': 'Just.'",
        "'speaker_2': 'Change that screen? Eight eyes, three nays. Council Bill 715 passes on Monday, August 28th. Council will hold a required public hearing on Council Bill 883, creating establishing a Denver tourism district, appointing initial members of the Board of Directors of the district and improving initial plan a preliminary 2018 budget.'"
    ]
}