{
    "A bill for an ordinance amending Chapter 2 of the Revised Municipal Code of the City and County of Denver by enacting Article XX to establish the Office of Special Events. Amends Chapter 2 of the Denver Revised Municipal Code by enacting Article XX to establish the Office of Special Events. The Committee approved filing this item at its meeting on 8-4-21.": [
        "'speaker_1': 'Council member Torres has called out Council Bill 20 1-843 for comments under pending. No items have been called out. Madam Secretary, please put the first item on our screen. Councilmember Cashman, would you please put council bill 863 on the floor for publication.'",
        "'speaker_6': 'I move the council bill 20 10863 be ordered published.'",
        "'speaker_1': 'Thank you. It has been moved and seconded comments by members of council. Council members say the Barca.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_4': 'I just wanted to make sure that we get to vote on this separately, that one of the pieces of this ordinance proposal is allowing for issuance and enforcement of a special event permit. And given that our.'",
        "'speaker_8': 'District.'",
        "'speaker_4': 'Is the host of many of the special events that we have in our city, we deal often with a lot of the people who are applying for those special event permits. And what we have found is that the process needs to be streamlined more effectively.'",
        "'speaker_4': 'And that's not part of this proposal. This proposal adds a layer that I think complicates.'",
        "'speaker_8': 'What we're trying to do. And I would.'",
        "'speaker_4': 'Have liked to have seen this proposal come to us when we were at a place where we were ready to streamline our processes to make it easier on the constituents and the people hosting special.'",
        "'speaker_8': 'Events to get.'",
        "'speaker_4': 'Their event permitted. Currently it doesn't do that, and so I wanted to go on record as a no. I don't think that this portion is ready yet. Thank you.'",
        "'speaker_1': 'All right. Thank you. Council member Sayed Abarca. Next up, we had Council Pro Tem Torres.'",
        "'speaker_4': 'Thank you, Madam President. I don't believe enough work's been done to think through some of the blindspots in codifying this office and implementing a new fee, timelines and likely barriers for our nonprofits and community based organizations. A B.A. tonight and next week.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Thank you, counsel pro Tem Torres. Next up, we have Councilmember Sandoval.'",
        "'speaker_8': 'Thank you, Madam President. I have similar concerns to Councilman CdeBaca and Councilman Torres, so I will be a note tonight as well. Thank you.'",
        "'speaker_1': 'All right. Thank you, Councilmember Sandoval. Seeing no other hands raised, Madam Secretary. Oh, I was going to give it a second there, Councilmember Kimmich.'",
        "'speaker_4': 'Thank you, Madam President. Thank you, Madam President. I do think it would be helpful if someone from the agency is here. I mean, if we're going to have some some no votes, it might be helpful for the public to understand what the concerns response is.'",
        "'speaker_4': 'So I appreciate my colleagues raising their concerns with someone from the department like to comment on the nonprofit impact.'",
        "'speaker_1': 'I believe we do have a representative here from the proposed office. So if you want to go ahead and come up and introduce yourself and tell us a little bit about what the bill accomplishes, and then we'll go ahead and have the roll call vote.'",
        "'speaker_4': 'Thank you, Kate. Easter, senior director for the Office of Special Events. Thank you for having me tonight. So if you could reiterate how I can address the question and specifically, that would be great.'",
        "'speaker_1': 'I think if you can just explain for the public, since we're going to have council members voting no on this tonight, exactly what Bill 21, Dash 863 is hoping to accomplish. So folks understand what council members are perhaps voting no on.'",
        "'speaker_4': 'Okay. So what we are trying to do right now is we are trying to create some accountability in the Office of Special Events. Currently, we have no enforcement capabilities for the requirements that exist in the city of Denver.'",
        "'speaker_4': 'Our office is a coordinating and communicating entity. And what we want to be able to do is to be able to ensure compliance of all city requirements. And right now, we have a hard time in our agency enforcing that compliance.'",
        "'speaker_4': 'The agencies we help support, the agencies that have special event requirements. But there are some agencies that do not have enforcement power. And so what we are trying to do is fill in a number of gaps to make sure that all events that are happening on public property have all of their compliance needs with the city met'",
        "'speaker_4': 'and by the city by our agency issuing a special event permit, then we have that ability to ensure that all the city requirements have been met and we can bring together all the parties to ensure that the communication is there, that the event knows what the requirements are, that the agencies are in communication, and that an event'",
        "'speaker_4': 'doesn't happen on public property without its proper requirements. Permits met. I don't know if that addresses it right.'",
        "'speaker_1': 'Questions, I think that's fine. There's a couple more members that have gotten into the queue. I fully accept my earlier colleague's comments on why they're going to vote no. I think they described that very well, but we'll go ahead and move on.'",
        "'speaker_1': 'Councilmember, did you have anything additional that you had questions about or wanted to chime in to.'",
        "'speaker_4': 'Ask you to address the particular concern about unintended consequences on nonprofits in particular, and how you are trying to mitigate those in the permit that you described? Absolutely. Thank you. So there is a communication channel that we are going to need to clarify when it comes to nonprofits.'",
        "'speaker_4': 'A lot of nonprofits that are happening, I don't know, a ratio per se, but they aren't necessarily categorized as special events where our office is concerned. Our office addresses events that are happening on public property that use more than that, utilize one more than one city agency.'",
        "'speaker_4': 'There are definitely a number of nonprofit events that just happen in a park or that just that aren't even on public property. So I think there is a communication channel that we're going to need to address to ensure that some of the nonprofits that you may be speaking of or that that may be stuck in in a'",
        "'speaker_4': 'communication gap, is is clarifying when our office is actually being utilized. And just to clarify, it's events on public property that are temporary in nature and that utilize more than one city agency as we are a coordinating agency.'",
        "'speaker_4': 'It is more than one city agency. There's a number of events that just happen in a park. When that happens, we're not involved at all in those events. So we certainly have had conversations. And Councilwoman Torres brought to light some some questions that we are now ready to to look into and try and identify where those gaps'",
        "'speaker_4': 'are. If there are nonprofits that are challenged with either knowing that we even exist, that we can help them, or if there is a gap where they may not be able to afford it, we have we've made the the application fee extremely low comparatively from a from a nationwide standpoint of $25 for the smallest events.'",
        "'speaker_4': 'And we did an analysis of the different permits that an event, a small event would pull, and it's 0.6% .0. 6% of what their total budget would be. And that's on average. So we it was very important to the mayor that this application fee would in no way be a detriment to an event from happening.'",
        "'speaker_4': 'And if that ever were to become a case, this the executive director certainly has the right to waive those fees. We have been working with the Office of Social Equity and Inclusion. They have given us guidelines. We have gone back and forth over the last four months with the office and propose a number of ideas and they've'",
        "'speaker_4': 'come back. So we'd love to create a criteria. We are not, actually. Charging the application fee until the year 2023. So we have given we wanted to give the events this two year time period so that they a year of education in 21, another year of education in 22 before they would actually be paying for their event'",
        "'speaker_4': 'in 23. So because we had not finalized what that criteria would be for nonprofits or for any entity that may be struggling with the cost of an application fee, that we know that we still have time and every intention to continue working with the Office of Inclusion and Equity and Inclusion.'",
        "'speaker_4': 'So it's it's by no means a complete process. And it is something that is important to us as it is to the mayor. And we are currently working on it, but we believe we do have some time to get that figured out before they would be charged.'",
        "'speaker_1': 'All right. Great. Thank you. All right. Next up, we have Councilmember Black.'",
        "'speaker_8': 'Hi, Katie. Hi. I have experience before being on council.'",
        "'speaker_4': 'Of hosting a.'",
        "'speaker_8': 'Special event, and I earlier mentioned an event. I'm having a Bible Park this coming week and I know how challenging it is from the coordination standpoint, having to get a permit from parks and something from public work or from daddy and dealing with the waste and excise and licenses and all those different agencies.'",
        "'speaker_4': 'And I know it's really hard for people.'",
        "'speaker_8': 'And so when when you all came to committee and I think I had a briefing with you, we.'",
        "'speaker_4': 'Kind of talked how you all will help the coordinators navigate all those different city agencies.'",
        "'speaker_8': 'So can you tell us a little bit more about how you're going to help.'",
        "'speaker_4': 'The people who are hosting the events? Absolutely. So our the goal of our office and the product of our office is service. We have been doing that for six years. Where it is, we are a relatively decentralized city in that there is different permits and different agencies and it is hard and it is challenging.'",
        "'speaker_4': 'And our agency was set up as a coordinating agencies so that that maze of agencies and requirements that an event organizer would be faced with, that we could help them through that it can be a puzzle. There's every agency has different timelines, different deadlines, different permit fees, different inspections.'",
        "'speaker_4': 'It is very confusing. Our office was set up after all of these other agencies were. So we have had to kind of cobble together and create a workflow where our agencies, our agency are our liaisons are event specialists, know a tremendous about 21 different agencies.'",
        "'speaker_4': 'And it's their job to help these event organizers, whether they're brand new organizers, whether they've been doing it for 30 years, which we've had too many of those also, is that it's we are helping them to navigate the city process so that they can be on time, so that they can get all their requirements met.'",
        "'speaker_4': 'We often are able to answer many of the questions. We take the burden off the response. We take the burden from the agencies themselves so that they can focus on their main objectives of their agencies. And we're able to take a lot of those questions.'",
        "'speaker_4': 'So it really is. Customer service at its best. And I think she wants to say something. Hi Julius. I'm the Communications and community engagement officer with the Office of Special Events, and I just wanted to add something to Katie's points that one of the very special things that we do is we work really closely with the communities'",
        "'speaker_4': 'and the local businesses that are impacted by events. And one thing that our office oversees is the community notification effort. So when we before our office was instituted, we had lots of community complaints about different things trash, noise, traffic, parking.'",
        "'speaker_4': 'We still have those complaints, but there is much, much fewer of those. And we try to mitigate those issues before they become a serious issues and work very closely with the event organizers to make sure that your officers are aware of the events that are coming up and the impacts they will have, as well as all the'",
        "'speaker_4': 'different residents and businesses as well. So that's a special service that our office provides as well that I think is really important to your offices and your constituents. So I just want to mention that.'",
        "'speaker_1': 'All right. Thank you, Councilwoman Black. Are you good? All right. Thank you. Up next, we have Councilwoman Ortega.'",
        "'speaker_9': 'Thank you, Madam President. Katie, I have a couple of questions for you. And I'm sorry, I was I did not have the benefit of hearing the conversation at committee. But let me just start with asking how many staff you have?'",
        "'speaker_4': 'We have six, including myself.'",
        "'speaker_9': 'Okay. Will any of this result in an increase in the cost either to the office or to the applicants? Other than the $25 you mentioned, and I'm not clear what constitutes a small versus a large event, so can you.'",
        "'speaker_9': 'I know that's a lot of questions. I'm thrown at you, but.'",
        "'speaker_4': 'I think I got it. I think I have it. So we did create a range. So it's $25 for the smallest event, up to $250 to the largest events. And the ratio of that cost is similarly. 0.6% and 0.5% for the largest.'",
        "'speaker_4': 'So for both the small to the large.'",
        "'speaker_9': 'Okay. And. Okay. In. You talked about doing this. So that gives your agency the power to deal with enforcement. So can any of that be done without codifying the existence of your agency?'",
        "'speaker_4': 'So we need to codify the agency in order to give it a permit. We do not. We need to be an ordinance in order to issue a permit.'",
        "'speaker_9': 'And in doing so, how does that give you power? To oversee issues that are violations with exercising license, with Doddy, with any of the other agencies that may be involved, including Parks and Rec. Now, because it sounds like your expectation is for events that will be in parks, that it falls that all under the same umbrella.'",
        "'speaker_4': 'So first of all, we will be creating some of our own requirements that right now we don't have the ability to to mandate. One of them, as Jill just spoke about, was the community notification. Right now, all we can do is ask event organizers to please notify their communities.'",
        "'speaker_4': 'We do not have the ability to say you must provide a notification for all of your events. So by having a permit that allows us to ensure that they have conducted this community notification, another requirement from our agency is the Office of Emergency Management, which is not an enforcement agency, has a has has asked us to help'",
        "'speaker_4': 'with their requirement, which is essentially an emergency management plan. And so this is a new requirement, which we have not been able to mandate of event organizers that ensures that every single event on public property has an emergency management plan, which is anywhere from, you know, a hailstorm and how people are evacuated to a drive by shooting'",
        "'speaker_4': 'or any of the above that. Right now, that's not required. We we can ask event organizers to provide an emergency action plan, but right now, we can't require it. So that's those are two really important requirements that we that are certainly a gap in the city that we want to be able to require.'",
        "'speaker_4': 'In regards to your questions about the other city agencies. We don't have authority over their permits by any stretch of the imagination, and we don't want it and we're not asking for it. It really is coordination between them.'",
        "'speaker_4': 'If there is an event that excuse me that is falling behind the job of our agency and our special event permitting experts is to stay with that event and to make sure that they're meeting all the deadlines. Parks has thousands and thousands of permits they're issuing, and they don't have time to sit on top of these events'",
        "'speaker_4': 'to make sure they're meeting all their deadlines. So what our agency does is we send out notifications and reminders and we're working with them. So it's not about overriding the authority of another agency, but it's it's helping that it's helping to ensure that all of the events are meeting the requirements of the other agencies.'",
        "'speaker_9': 'So if you're going to be doing that, are you expecting to make any budget requests for an increase in staffing.'",
        "'speaker_4': 'At this point? It may it may come about, but it's not something that we have. It's not something that we have at this point. We our agency definitely is working far more hours than than 40 hours a week as it stands right now, certainly with something like the MLB All-Star Game and the large events that are coming'",
        "'speaker_4': 'into town put a big demand on us. So it is it is a possibility.'",
        "'speaker_9': 'And will you just remind us how many events we have a year?'",
        "'speaker_4': 'Sure. We have over 700, between 700 and 750 event days throughout the year.'",
        "'speaker_9': 'Okay. That concludes my questions. Thank you, Madam Chair.'",
        "'speaker_1': 'All right, thank you. Member Ortega. And we've got two more council members up in the queue. And quick reminder, we've got four, three required hearings this evening and one one hour courtesy, public hearing. And so we're going to have a late night.'",
        "'speaker_1': 'And so I just want to remind folks of that. Councilmember Sawyer.'",
        "'speaker_4': 'Thanks, Madam President. Just wanted to commend you guys for your amazing work. So Councilman Herndon and I sit on the committee, the Special Events Committee, and we work with you all the time and you are amazing. What you do is incredible.'",
        "'speaker_4': 'The fact that you were able to pull off the All-Star Game events the way you did it was extraordinary in the timing. It was amazing. So I understand my council, fellow council members concerns over some of the language in the in the bill.'",
        "'speaker_4': 'But I think if you had the experience of sitting in these meetings like Councilman harder than I do, you would 100% supports creating this this what do we call you guys now office this office into an actual agency because it's something that our city needs.'",
        "'speaker_4': 'And the work that is done by this team is extraordinary. So I just want to commend you and thank you. And I will be absolutely supporting you tonight and appreciating that, you know, there are some things that maybe need to be worked out and they can be done in now in the policies and procedures rulemaking part.'",
        "'speaker_4': 'Thank you. Thank you, Councilwoman.'",
        "'speaker_1': 'Thank you, Councilmember Sawyer. Councilmember Sandoval.'",
        "'speaker_8': 'Thank you, Madam Chair. I have a couple of questions for you, Katie. So on top of C, we would have a fee, a permit for this special event. Correct. And then they would still have to pay their park permit fee.'",
        "'speaker_8': 'They would still have to pay their daddy fee. They'd still have to pay their excise and license fee. So on top of the fees that they're already paying there, we're adding an additional fee for your office.'",
        "'speaker_4': 'Correct.'",
        "'speaker_8': 'And then in Parks and Rec, you know, there's the ability for city council to be sponsors and then the fees are waived. Are do you have that built into your regs, rules and regulations?'",
        "'speaker_4': 'That is something that we are still continuing to work on and that would be in the rules and regulations. There's some agencies that have that established already. We don't have the authority to tell Dotty what they would or wouldn't waive.'",
        "'speaker_4': 'I know Parks has has waivers. So in terms of our costs, I think that's a conversation that we still can have and put in our rules and regs at this point. Yeah. Yeah. It's not written in at this point.'",
        "'speaker_8': 'Do your rules and regulations come back to city council?'",
        "'speaker_4': 'Do they come back? No.'",
        "'speaker_8': 'No. So you have the ability to make your rules and regulations with no input from us once this gets voted on.'",
        "'speaker_10': 'So.'",
        "'speaker_2': 'Okay. Good evening. Members of Council Nathan Sarah, Assistant City Attorney. Can you ask the question again, Councilwoman?'",
        "'speaker_8': 'Yeah. Thank you, Nate. So once the rules. So if this were to pass the rules and regulations that the Office of Special Events creates, they don't have to come back to for city council for any input or we don't vote on them.'",
        "'speaker_8': 'Is that correct?'",
        "'speaker_2': 'That's correct.'",
        "'speaker_8': 'Okay. Thank you. I just want to say, I absolutely support creating this agency. I just don't like adding all of the bureaucracy on top of it. So I have worked with your office numerous times, and I think it's helpful when we do have these events.'",
        "'speaker_8': 'I just don't like the added fee on top of everything because we already have to have a lot of fees. So even if your fee doesn't match up with the nation's fee, our other fees, such as they just updated their fees to actually match what's happening around the nation and they can be pretty expensive depending on the'",
        "'speaker_8': 'street classification to close the street. So I support creating this agency to codify it. I think it's smart. I don't support the fees and I don't support the fact that city council can get waivers. I use those waivers only in particular cases where it is a strain on the community to have those events.'",
        "'speaker_8': 'And I also don't support the fact that these rules and regulations never come back to city council. So we're asking being asked to create the agency. And then from there on it, I think you said the mayor's name like four times.'",
        "'speaker_8': 'I'm not privy to what the mayor wants. I have to respect what my constituents want. And my constituents don't want added bureaucracy into it already, like a lot of political red tape. So thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Sandoval. Councilmember Herndon.'",
        "'speaker_3': 'Thank you, Madam President. I will I will be brief. I just wanted to to speak to the the rules and procedures.'",
        "'speaker_2': 'I'm not aware of any.'",
        "'speaker_3': 'Rules and procedures from.'",
        "'speaker_2': 'Any agency that comes to council for approval once we.'",
        "'speaker_3': 'Approve an ordinance. So that is one and two, as my colleague also said.'",
        "'speaker_2': 'Councilman Sawyer and I sit with on the Office of Special Events Committee.'",
        "'speaker_3': 'So have colleagues feel they couldn't directly connect with Katie and Katie. I know they could, but you could talk to two.'",
        "'speaker_2': 'Council members who sit on this committee with you who will be a part of these conversations. So I just don't feel that that's an accurate depiction. That Council will have no input on that, and I am certainly in support of this.'",
        "'speaker_2': 'And as Councilman Sawyer says, thank you for all that you do with your small but mighty team. Thank you, my.'",
        "'speaker_4': 'Thank you, Councilman.'",
        "'speaker_1': 'Thank you, Councilmember Herndon. All right. We might just have everybody chime in now. Councilman Cashman, go ahead.'",
        "'speaker_6': 'Well, I couldn't miss this opportunity, Madam President. I'm supportive of the creation of this office as a means to not only improve things for the promoters and make their life easier, but in turn make life better for the residents of the city and county of Denver.'",
        "'speaker_6': 'And I'm just hoping the administration will see the same wisdom in creating an Office of Community Engagement that this council has found as a value and would also lead towards the improvement of life in Denver for all its residents.'",
        "'speaker_6': 'So thank you so much.'",
        "'speaker_1': 'All right. Thank you, Councilmember Cashman. All right. I think we're good. We can go ahead and have you take a seat, Katie, and thank you and your team. All right. We are going to go ahead and go forward with the vote.'",
        "'speaker_1': 'Madam Secretary, roll call Hines I.'",
        "'speaker_7': 'CdeBaca.'",
        "'speaker_4': 'No.'",
        "'speaker_2': 'Clark I.'",
        "'speaker_7': 'Swim.'",
        "'speaker_2': 'All right. Herndon, I.'",
        "'speaker_7': 'Cashman. I can h i Ortega. Sandoval.'",
        "'speaker_8': 'No.'",
        "'speaker_7': 'Sawyer.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Torres.'",
        "'speaker_4': 'No black eye.'",
        "'speaker_7': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_7': 'Three Days ten Eyes.'",
        "'speaker_1': 'Ten Eyes Council Bill 20 1-863 has been ordered published. All right. We're going to go ahead and move on. Madam Secretary, please put the next item on our screen. Councilmember Torres, go ahead with your question or your comments.'",
        "'speaker_1': 'Excuse me, on Council Bill eight for three, please.'",
        "'speaker_4': 'Thank you so much, Madam President. I just wanted to thank community advocates, advocacy organizations, council members here on the dais, and those who have left city council who have been working for many years to continue to strengthen the Office of the Independent Monitor.'"
    ],
    "A bill for an ordinance changing the zoning classification for 3145 West 31st Avenue in West Highland. Approves a map amendment to rezone property from U-SU-B to U-SU-B1 (allows for an accessory dwelling unit), located at 3145 West 31st Avenue in Council District 1. The Committee approved filing this item at its meeting on 6-22-21.": [
        "'speaker_1': 'Councilmember Cashman, will you please put Council Bill six, eight, nine on the floor for final passage?'",
        "'speaker_6': 'Yes, Council President. I move the council bill 21 689 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 689 is open. May we please have the staff report? And I see we have. It's in here. Go ahead, please.'",
        "'speaker_2': 'Good evening, everyone. My name is Ed Senate Finance and I'm with CPD. Before you today, we have 30, 31, 45 West 31st Avenue, where the applicant is seeking to rezone a single unit zoned district to a single unit zone district that allows for an accessory dwelling unit.'",
        "'speaker_2': 'So the site itself is located in Council District on Amanda Sandoval's district in the sorry, in the West Highland neighborhood. So the site itself is just under 8000 square feet. It's a single unit, residential, and they're looking to do an accessory dwelling unit.'",
        "'speaker_2': 'The site is surrounded by several single unit zone districts. So to the west and to the east, its US hub, which is a single unit, stone district to the north you see a US-EU, a one which is a single unit zone district that allows for an accessory dwelling unit into the south and see us through a.'",
        "'speaker_2': 'And close proximity. You can see um, x three, which is a mixed use up to three stories. The land use is a single unit residential and as you can see it's predominately single unit and two unit uses in in the vicinity.'",
        "'speaker_2': 'And the site itself is in the upper left corner. It's a one story home. And as you can see, it's predominately 1 to 2 stories in the neighborhood. It went before the planning board in June. It was approved unanimously and it's before you today.'",
        "'speaker_2': 'And as a present there no comments have been received for this application. Whenever we're looking at a rezoning case, the Denver zoning code has specific review criteria that I will analyze right now. The first one is consistency with adopted plans, and we're really focusing on two plans, which is comprehensive plan 2040 and Blueprint Denver, L.A. and Transportation'",
        "'speaker_2': 'Plan of 2019. There are several strategies found in a staff report that this application is consistent with and I will jump into a blueprint. Denver, Brooklyn and Denver classifies this area as urban. And when we look at the future place type, it's classified as low residential, which is predominantly single and two unit uses and accessory dwelling units'",
        "'speaker_2': '. 80 use are appropriate and 31st Avenue is a local street, which is primaries are primarily served by residential uses. Blueprint also has a policy in the Langston built form housing policy, which talks about having housing choice through the expansion of accessory dwelling units in all residential areas.'",
        "'speaker_2': 'And this application is consistent with other review criteria found in the staff report. Therefore, CPD recommends approval based on all findings of the review criteria. Having met and I am available for questions as well as the applicant's representative is on as well.'",
        "'speaker_1': 'All right. Thank you, Edson. We're going to go ahead and. We have one individual signed up to speak this evening and it's on the virtual platform. And so we'll go ahead and move to our speaker. And it's Jesse.'",
        "'speaker_4': 'Paris.'",
        "'speaker_2': 'December 20, 23. I am in favor of the rezoning tonight. I support the accessory dwelling units. When I ran for city council at large in 2019 and 2021, I still continue to support them. We need alternative housing solutions and methods throughout the city.'",
        "'speaker_2': 'So I support assisted dying units in all this, not just District one. So I'm in favor of this sometimes. Good job, Amanda said of you. Got this.'",
        "'speaker_1': 'All right. Thank you. Questions for members of Council on Council Bill 689. All right. Seen no questions by members of council. And just wanted to double check. All right. The public hearing is closed. Comments by members of Council on Council Bill 689.'",
        "'speaker_1': 'Council Member Sandoval.'",
        "'speaker_8': 'Thank you, Mr. President. This map amendment may create another sorry. This matter amendment meets all the criteria. Patty has been very communicative with our office. She reached out a while ago, and I know that my aide, Councilwoman or Naomi, has met with the West Highland Neighborhood Association to see if they would like a legislative rezoning.'",
        "'speaker_8': 'So we don't have to have these one off rezonings as we're seen. With that, I would ask that everyone support this map amendment this evening. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember Sandoval. And seeing that this does meet the zoning code, the rezoning criteria, I'm happy to support it as well. Madam Secretary, roll call on Council Bill 689.'",
        "'speaker_8': 'Hines.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'We might have to call in Councilman Hines again, council secretary.'",
        "'speaker_2': 'I.'",
        "'speaker_7': 'Sandoval.'",
        "'speaker_8': 'I.'",
        "'speaker_7': 'Sawyer.'",
        "'speaker_4': 'I.'",
        "'speaker_9': 'Torres. I black.'",
        "'speaker_7': 'I see tobacco.'",
        "'speaker_2': 'Clark I.'",
        "'speaker_7': 'Saw when.'",
        "'speaker_3': 'I.'",
        "'speaker_7': 'Herndon. I cashmere. I can teach.'",
        "'speaker_4': 'I.'",
        "'speaker_9': 'Ortega. I.'",
        "'speaker_7': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_7': '13 Eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification for 4295 North Inca Street in Sunnyside. Approves a map amendment to rezone property from I-A UO-2 to C-RX-8 (industrial to urban center), located at 4295 North Inca Street in Council District 1. The Committee approved filing this item at its meeting on 6-22-21.": [
        "'speaker_1': '13 Eyes. Council Bill 20 1-689 has passed. All right. Moving on to our next required public hearing. Councilmember Cashman, would you please put Council Bill 694 on the floor for final passage?'",
        "'speaker_6': 'Yes, Madam President, I move the Council Bill 21 694 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved and seconded the required public hearing for council bill 694 is open. May we please have the staff report?'",
        "'speaker_2': 'Hello. My name is Edson. Iranians, and I'm here before you again with CPD. So before you we have 42 and 95 North Inca Street. Currently it is in a light industrial zone district and they're requesting S.R. eight, which is a residential mixed use.'",
        "'speaker_2': 'It's located in Council District one, Amanda Sandoval's district, and it is in the Sunnyside neighborhood. As you can see, it's in close proximity to the 31st and Fox Station right at the border there. So the request is just for about an acre site.'",
        "'speaker_2': 'And it's for urban center neighborhood context, residential mixed use, up to eight storeys in height. And so what this means is that the first level allows for street level retail uses and commercial uses, but the remainder upper stories are strictly reserved for housing and lodging accommodation uses.'",
        "'speaker_2': 'So the zoning is as you as you can see, it's year or two, which is a light industrial zoning district with the billboard use overlay. So there is no billboard on site and the applicant is looking to remove that you or two adjacent to it, as you can see to the northeast or to but to the west'",
        "'speaker_2': 'and to the south you can see the same zoned district that the applicant is applying for the CRC, which is a residential mixed use, up to eight storeys as well. Through the West. You see IMAX three, which is an industrial mixed use up to three stories and some UTC, which is a22 unit zone district.'",
        "'speaker_2': 'The land use is industrial and adjacent to it is an industrial single unit. But as you can see, there's a lot of industrial single unit, multi-unit, residential, vacant office as you can see. And here is a aerial photo of the site.'",
        "'speaker_2': 'It's about half an acre. And the middle and the bottom for photos are the site itself. As you can see, it's a one story industrial building and directly to the north, above 43rd is the electrical substation. Um, directly to the west, you can see a one storey industrial building and then on the top right photo, it's really'",
        "'speaker_2': 'hard to see, but you can see a one storey industrial building to the south and then about a block and a half away, you see an eight storey S.R., S.R. eight, which is a residential mixed use, up to eight story structure that connects with a pedestrian bridge.'",
        "'speaker_2': 'So the applicant has entered into a voluntary, affordable housing agreement, which is attached to the staff report of which the applicant is committing to 12.5% of the units as income restricted at 80% or less, ami of which 20% of two or more bedrooms will be income restricted at a 60 year period of affordability.'",
        "'speaker_2': 'So with the process, it went before the planning board in June and the planning board approved this unanimously. There were some concerns from the planning board. Some of the concerns from the planning board had to do with the 41st and Fox station area plan where it recommends 2 to 8 storeys to like about two blocks to the'",
        "'speaker_2': 'north of this site, saying that at this site it is appropriate for eight storeys, but anything above this site or to the west as when we dove into that plan, that it might not be appropriate for eight stories.'",
        "'speaker_2': 'That was one of the concerns they had as well as they had some issues around the neighborhood context, which I'm going to explain in a moment. And it is before you today. So far, several different channels have been notified, as you can see on the screen.'",
        "'speaker_2': 'And there has been one letter of support from the Sunnyside United Neighbors, Sonny's organization, of which Sonny specifies that they met with the applicant in various occasions and they approved it unanimously, and they provided a lot of input on the design and the material of the building.'",
        "'speaker_2': 'So there are several review criteria that we analyze based off the Denver zoning code. And the first one is consistency with adopted plans. We're looking at four specific plans, which are a comprehensive plan 2040 blueprint in Denver of 2019, the Sunnyside Neighborhood Plan of 1992, and the 41st and Fox Station Area Plan.'",
        "'speaker_2': 'So there's several strategies found in a comprehensive plan that this application is consistent with. And I will jump into several of these. The first one being under equity, specifically strategy, and B, which is equitable, accessible and inclusive goal one and two, increasing the development of housing units close to transit and mixed use developments, as well as create'",
        "'speaker_2': 'a greater mix of housing options in every neighborhood for all individuals and families. As well as for climate under the environment, resilient, resilient and gold strategy A, B and C promote infill development where infrastructure and services already in place.'",
        "'speaker_2': 'Encourage mixed use communities where residents can live, work and play in their own neighborhoods, as well as focus growth by transit stations. Now when we jump into Blueprint, Blueprint classifies this area as general urban. Which homes vary from multi-unit complexes to complex, compact single unit houses and development should offer a mix of uses with good street activation'",
        "'speaker_2': 'and connectivity, and it should be served by transit and enjoy access to abundant amenities and entertainment options. So something I do want to highlight is that blueprint Denver and tend to emphasize this area with a future neighborhood context of General Urban, the applicant is applying for urban center.'",
        "'speaker_2': 'So however however that area plan as well as blueprint in the next slide will show that that this location is appropriate for up to eight storeys, but there is no eight storeys in the residential mixed use for the general urban.'",
        "'speaker_2': 'So that's why the applicant is applying for this urban center. Residential mixed use eight stories. So as you saw earlier in the existing zoning slide and I have it here, there are other rezonings at this location that have the six eight district which is very comparable to the closest groups five in terms of like built to requirements'",
        "'speaker_2': 'as well as limitations of parking structures and the pedestrian realm. So Blueprint does provide specific guidance on the flexibility of a neighborhood context, which is found on page 66 of Blueprint, which says a mapping of a neighborhood context is at a citywide scale.'",
        "'speaker_2': 'So the boundaries of the context may be interpreted with limited flexibility if the request furthers the goals of Blueprint Denver and is consistent with the overall intent of the neighborhood context. And so at this specific application, they are providing affordable housing option, they're promoting comparable design and providing a walkable mixed use center here.'",
        "'speaker_2': 'And so when we look at the future place type for this site, it it's classified as high medium residential, which offers a mix of low to medium scale multi-unit residential uses with some neighborhood services servicing mixed use distributed throughout.'",
        "'speaker_2': 'And buildings are generally up to eight storeys in height and block patterns are consistent and pedestrian scaled buildings form clearly define and activate the street now 43rd and industry are on designated local streets and I know that it's not adjacent to a arterial or collector street but the but it is served in that area by light pan'",
        "'speaker_2': 'and 38th, which are arterial collector streets as well as the pedestrian connection that is about a block and a half to the south that connects to the commuter rail. So I also wanted to provide a comparison similar to what's found in the staff report.'",
        "'speaker_2': 'In the staff report, we do industrial to what this proposes. But I also wanted to show that in Blueprint recommends General Urban and the applicants applying for our urban center because there is no x eight. But when you look at Greece five in comparison to Syria, it's very similar when you look at setbacks.'",
        "'speaker_2': 'They're identical when you're looking at the stories. They're different in this sense because one is five and eight is what applicants seeking for. But when you look at surface parking between buildings in Primary Street, they're identical. And when you look at the bill two, they're very similar.'",
        "'speaker_2': 'So these districts are very similar. When we jump into a blueprint for future growth strategy, it's classified as all areas of their city where they're anticipated to see 10% of new job growth and 20% of new housing growth by 2040.'",
        "'speaker_2': 'And something to highlight is that we're going from an industrial use to a residential mixed use is that this subject site is not in a manufacturing district or a manufacturing preservation area. Now when we jump into the sunny side neighborhood plan, the sunny side identified this area as industrial and it states that the far eastern portion of'",
        "'speaker_2': 'this plan should be industrial. Given that it's it's it's close proximity to the rail as well as the interstate. And then it also says that there's scattered residential mixed in through the industrial and that should be redeveloped as industrial uses.'",
        "'speaker_2': 'And so so although the Sunnyside Neighborhood Plan was it is an adaptive plan and continues to shape the overall policy and development decisions of the area. There's a newer plan that was adopted in 2009, which is the 41st and Fox station area plan that gives more specific guidance for this area.'",
        "'speaker_2': 'That station plan is in response to new opportunities presented by the commuter rail. As a result, it provides a substantially different land use recommendation in the Sunnyside Neighborhood Plan, which pre-dates the conception of the fast tracks by more than a decade.'",
        "'speaker_2': 'And then the 41st and Fox station area plan does not recommend industrial like this plan does. So when we jump into the 41st and Fox station area plan, it provides a vision for a diverse, transit, supportive and environmentally sustainable urban center.'",
        "'speaker_2': 'And something that I do want to point out is that when you look at the actual plan, this specific site is classified as a electrical substation, which I showed you earlier below and previously, is that the electrical substation is above 43rd, not below 43rd.'",
        "'speaker_2': 'So there's a mapping error with this. And so the inferred land use for this site is urban residential, 2 to 8 storeys, as you can see. That's what's to the north, to the south, to the west. And so when we're looking at urban residential, it's new moderate density neighborhoods forming a new edge between the station and the'",
        "'speaker_2': 'existing neighborhood to the west, as well as it provides a lot of urban design recommendations, such as asking for it to be closer to the street, the building, and to minimize the setbacks. So the proposed S.R. eight zoning meets the land use intensity and design intent of the 41st and Fox station area plan.'",
        "'speaker_2': 'And when we're jumping into review criteria to uniformly disaggregate nations, the request is consistent as well as furthering the public health safety in general welfare. And it does this by implementing adaptive plans as well as it's furthering the city's goals by creating a cohesive, walkable community around the 41st and FOX Station.'",
        "'speaker_2': 'And then for the fourth criteria justifying circumstances, the applicant stated change and changing conditions in a particular area in the city in general by this is a mixed use redevelopment in the area and the 41st and Fox commuter station and pedestrian bridge that is in close proximity and the Inca Street multi-use path that connects downtown.'",
        "'speaker_2': 'And for the fifth graders here, consistent with neighborhood context, is this your purpose and intent? Sierra Zone District Promote safe, active and pedestrian scaled diverse areas through building forums that activate the public realm. Therefore CPD recommends approval based based on all findings that the review has been met.'",
        "'speaker_2': 'I am available for questions. Andrew Johnson from host is here to answer any questions as well and the applicant is online Billy Wang as well to answer questions.'",
        "'speaker_1': 'All right. Thank you, Anderson, for the great staff report. And we have one individual signed up to speak this evening, and he's joining us virtually. And we have Jesse Paris.'",
        "'speaker_2': 'Yes. There's a council of those watching at home. Those are in the council chambers. My name is Jesse with some personal work resume for Blackstone, maximum for self-defense powers of actually come in for social change as well as the unity party of Colorado and frontline black knows and I would be the next my member in 2023.'",
        "'speaker_2': 'I am against this rezoning tonight for several reasons. The first reason is this is not affordable 80% or less than mine in a rapidly gentrifying neighborhood that is not affordable. Maybe if it was 40%. Maybe if it was.'",
        "'speaker_2': '50% or less. I would be in favor of it, but I'm not in favor of this. Only 12% of the units are 80% or less. That is definitely not affordable. I have three questions. Is there a traffic study done on this particular site?'",
        "'speaker_2': 'Has there been a parking study done on this particular sites? And last but not least, has there been a neighborhood agreement at this particular site? How many square feet are these apartments going to be? Now, you say it meets all five of the criteria, which is consistency with adopted plans, uniformity of district regulations, further public health, safety'",
        "'speaker_2': 'and welfare, justified circumstances and consistency with neighborhood context and zone sense. This is rapid gentrification. You're going to continue to fuel rapid gentrification if you pass this tonight. This is not affordable by any means. I don't know who you think can afford this, but 80% am I.'",
        "'speaker_2': 'That means you have to make 80% of $75,000 a year to be able to afford to live in these units. So this is not affordable. Please stop saying this is affordable, but it is clearly not. And don't pass it to me.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers for this hearing. Questions from members of Council on Council Bill 694. Councilmember Ortega.'",
        "'speaker_9': 'Thank you, Madam President. I just wanted to ask a couple of questions. Is the applicant around?'",
        "'speaker_1': 'Yes. I believe we have the applicant in the queue. Billy.'",
        "'speaker_9': 'Okay. Billy. Wink, I believe. So the first question I want to ask is whether or not the applicant was provided the information from the railroad working group that basically has a check off box on the application to basically alert them that they need to be looking at how they would address railroad safety issues.'",
        "'speaker_9': 'So to the applicant, did you receive that when you came to the Planning Department?'",
        "'speaker_1': 'Okay. We're double checking that we have the applicant in the queue.'",
        "'speaker_3': 'Can you hear me? This is Billy Wang.'",
        "'speaker_1': 'Very good. Go ahead, please.'",
        "'speaker_3': 'Good evening, council members. We did not receive a railroad plan. Council woman Ortega. And regarding the traffic study, we were informed that that would be required when we submit prior to the site development plan what we've proposed to SUNY thus far and get their unanimous support from the PC, SUNY Pcdi and the Sunni neighborhood is a conceptual'",
        "'speaker_3': 'plan that shows the elevation and a concept of units. We don't have those defined in terms of how many units, what's the square footage. But we would be pursuing that. As we progress with design.'",
        "'speaker_9': 'That said your application was within a close proximity to railroad. Is that what you're saying to me in when you submitted your application?'",
        "'speaker_3': 'It is. Yes. It's adjacent to the railroad tracks, correct?'",
        "'speaker_9': 'Did your application check that box.'",
        "'speaker_3': 'I would have to look.'",
        "'speaker_9': 'It's an I have a question for you about what the tallest building is along that corridor adjacent to the tracks close to the light rail stop.'",
        "'speaker_2': 'I may answer that question, but before I do, we did provide them with a railroad study at the Pre-Application phase and as well a few, maybe a few weeks before the planning board as well, because I know this question would be brought up.'",
        "'speaker_2': 'And this building, if you remember correctly, this is the one where we discussed what previous applicants have done in the past and with noise, TDM and different things of what the plan talked about specifically. And you mentioned about how you wanted to maybe mimic some of that stuff if you remember correctly.'",
        "'speaker_2': 'But I did send it to you, Billy, on two occasions and we did talk about it Zoom as well. But going by it for your question, I don't know that specific. I do know that it's eight storeys and it's about a block and a half to the south.'",
        "'speaker_2': 'It's that C development which is eight storeys. I don't know. The height, the maximum height that it is allowed to be is 110. I'm not sure if it's at 110, but the zone district allows for that one, which is exactly this one district to S.R. eight.'",
        "'speaker_2': 'It would allow for a 110. I'm not sure if it's below that or around that, but it should be around that.'",
        "'speaker_9': 'Okay. I've driven and I don't remember that any of them were eight stories in in height. And perhaps Councilwoman Sandoval can address that.'",
        "'speaker_8': 'Yes. The Zia apartment building on 40th and into from 40 from 40th to 41st. The entire block is eight stories currently built and occupied.'",
        "'speaker_2': 'Okay.'",
        "'speaker_9': 'And do you know if they addressed the railroad safety concerns in their construction, in their work with the planning department?'",
        "'speaker_8': 'From what I understand, they met all requirements for building. I don't know specifically if it was the railroad construction because there is the street and then the anchor pedestrian trail, the promenade and then more land and then the rail yard.'",
        "'speaker_9': 'Okay. Thank you. It's an. Can you tell me if there are any limitations on the first floor activation that you talked about that would happen on this site?'",
        "'speaker_2': 'The limitations are only if it's strictly residential, but if it's commercial, it's the setbacks can be zero.'",
        "'speaker_9': 'In terms of the types of uses that could be in the commercial space, that's what I'm referring to.'",
        "'speaker_2': 'It's mainly focused on retail and commercial uses, not necessarily industrial uses, as you see in Mumbai, but it will be mainly retail and commercial uses office as well.'",
        "'speaker_9': 'Okay. And then the applicant said he wasn't clear on how many units there might be, but with these stories that potentially can can be pretty significant in terms of the number of units, somewhere in the 70 to 80 ballpark, depending on size, you know, number of bedrooms, etc..'",
        "'speaker_9': 'So this is trying to get an idea of that given its proximity to rail. Can you just talk about how many parking spaces this would require? Again, knowing that sort of tied to the number of the units that will be on the site.'",
        "'speaker_2': 'I'm going to let the applicant speak on that because he has a breakdown of parking and the number of units that he's been discussing with House as well as well.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_2': 'Billy.'",
        "'speaker_3': 'Thank you. Can you hear me okay? Yes. So to address your question regarding first, the commercial spot right now from the concept plan, we have allocated commercial space right on the corner of the northeast corner of 43rd and anchor.'",
        "'speaker_3': 'Alongside that would be a plaza because one of the key components is to activate 43rd and activate anchor and drive as a community center. So we would streetscape that from both angles and create a commercial site. Right now.'",
        "'speaker_3': 'I believe. Let me look. The concept plans is about 74 units. Councilwoman Ortega But that may adjust and as it adjusts, the affordability scale would adjust as well. Regarding the parking, we would certainly adhere to the parking requirements for that zone district and we would take into the future traffic study plan of trying to minimize parking or'",
        "'speaker_3': 'try to minimize. The number of use of cars. Along that well and try to promote the the fox and 41st light rail plan, car sharing, smart cars etc..'",
        "'speaker_9': 'So tied to that question. Have have you ever encountered a bank being concerned that if you didn't provide adequate parking, that if for some reason the project didn't move forward, they didn't want to be stuck with the project.'",
        "'speaker_9': 'They couldn't park the units.'",
        "'speaker_3': 'I have not personally encountered that.'",
        "'speaker_9': 'Q I have no further questions. All right.'",
        "'speaker_1': 'Thank you, Councilmember Ortega. Up next, we have council member Flynn.'",
        "'speaker_3': 'Thank you, Madam President. Hudson, I have one quick question. I recall from I think I recall correctly from a long ago billboard overlay issue that here we're getting rid of the overlay is our is the city under any obligation to maintain a certain amount of billboard overlay areas in the city.'",
        "'speaker_3': 'Is there some sort of an agreement still in effect? And, Nate, I don't know if you can answer that. I do. It was a long time ago. I remember this came up in a hearing. I just wonder what the current status is.'",
        "'speaker_3': 'Not that I want to see billboards here. Good evening. Members of council.'",
        "'speaker_2': 'Neighbors their assistant city attorney. There is no obligation for the city to maintain the billboard use overlay.'",
        "'speaker_3': 'Okay. So conceivably, if we re zoned any place with a billboard overlay we could do away with. We're under no obligation to keep. That is correct. Okay. Thank you. Could I ask, is there someone here from host? Oh, Andrew, I forgot.'",
        "'speaker_3': 'You're over and hosts now. Thank you. Hello. Andrew Johnson with the Department of Housing. Could you raise the microphones here to Andrew Johnson with the Department of Housing Stability? Thank you. In the affordable housing agreement, it read. It has two alternative paragraphs if they're for rent or for sale, but they seem to require the same thing.'",
        "'speaker_3': 'Can you describe, first of all, do we know what the owner intends to do, what the developer intends to do here? Yeah. His intent is actually to do rental to the rental. And so the focus during our conversations when we were going through this agreement was to do rentals.'",
        "'speaker_3': 'We always put up for sale paragraph in there as much as possible just in case, because 60 years is a long time. It could change somewhere down the road just in case it goes condo. Correct. Okay. I would we normally have this ask for the same percentages and affordability levels between a rental project and a for sale'",
        "'speaker_3': 'project. Just because of a different economics.'",
        "'speaker_2': 'We usually have different AMI levels on a for sale sign.'",
        "'speaker_3': 'Right. We did talk about a different percentage on the for sale side.'",
        "'speaker_2': 'But because was very confident that he was doing.'",
        "'speaker_3': 'Rental just focused on the just the rental AMI level. Okay. Thank you, Madam President. That's all I had.'",
        "'speaker_1': 'Thank you, Councilmember Flynn. And thank you, Andrew. Up next, we have Councilman Cashman.'",
        "'speaker_6': 'Thank you, Madam President. For the owner or developer. I'm wondering, you said 74 units. Was we talking the whole development or the affordable portion?'",
        "'speaker_3': 'A. Can you hear me? Hello?'",
        "'speaker_1': 'Yes, we can hear. Okay.'",
        "'speaker_3': 'I apologize. The 74 units is in concept right now. That's total number of units. So if we were to meet the agreed host agreement of 12 and a half percent, what would that be? Nine units, approximately eight or nine units, and then 20% of 74, which would be two units.'",
        "'speaker_3': 'I think 20%, 20 for me.'",
        "'speaker_6': 'Total units, not of the affordable units.'",
        "'speaker_3': 'Just 274 is the total number of units in concept right now. Yes.'",
        "'speaker_6': '12.5% of that is going to be affordable at 80%. So 20%, two bedrooms, 20% of, what, 20? And it's got to be 20% of the 12 and a half percent. Correct.'",
        "'speaker_3': 'It'll be about.'",
        "'speaker_6': 'One one or two units.'",
        "'speaker_2': 'Yes. Okay.'",
        "'speaker_3': 'So it's a lot of math, but it's about one or two.'",
        "'speaker_2': 'Units in back.'",
        "'speaker_1': 'All right, I. You're all brave doing math on the spot. So I was just going to let you go ahead and do that. Thank you, Councilman Cashman. And thank you, Andrew, for helping out with those questions. All right.'",
        "'speaker_1': 'Seen no other members of council in the queue. The public hearing is closed. Comments from members of Council on Council Bill 694 Council Member Sandoval.'",
        "'speaker_8': 'Thank you, Madam President. I know that the applicant, Billy Wing, has worked with the Sunnyside neighborhood to get their support as it was just brought up by my colleague. I wish the affordability was going deeper. 1 to 2 units does not make a dent into the Sunnyside neighborhood.'",
        "'speaker_8': 'But that's another day, another story for another day. I know that my colleague, Councilwoman Kenny and I are sitting on the expanding affordable housing task force, which hopefully we will get more units out of rezonings such as these.'",
        "'speaker_8': 'So with that, I ask my colleagues support. Thank you.'",
        "'speaker_1': 'All right. Thank you. Councilmember Sandoval and seen no other speakers. I will go ahead and chime in that I do believe that this has met all of the review criteria and will be voting in favor of this tonight.'",
        "'speaker_1': 'And I want to also let folks know that Councilman Hines needed to leave the meeting. And so that's why we're skipping him in the roll call in case anybody caught that. And so we'll go ahead, Madam Secretary. Roll call on Council Bill 694, please.'",
        "'speaker_7': 'Sandoval.'",
        "'speaker_8': 'I.'",
        "'speaker_7': 'Sawyer.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Torres.'",
        "'speaker_4': 'I. Black I. CdeBaca No.'",
        "'speaker_7': 'Clerk.'",
        "'speaker_2': 'I.'",
        "'speaker_7': 'Flynn.'",
        "'speaker_2': 'I.'",
        "'speaker_7': 'Herndon.'",
        "'speaker_2': 'Hi.'",
        "'speaker_7': 'Cashman. I can each.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Ortega.'",
        "'speaker_9': 'I.'",
        "'speaker_7': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce results.'",
        "'speaker_7': 'One May 11 Nice.'"
    ],
    "A bill for an ordinance changing the zoning classification for 16298 Green Valley Ranch Boulevard in Gateway - Green Valley Ranch. Approves a map amendment to rezone property from PUD 319 to S-MX-3 and S-CC-3 (planned development to mixed-use), located at 16298 Green Valley Ranch Boulevard in Council District 11. The Committee approved filing this item at its meeting on 6-29-21.": [
        "'speaker_1': '11 Eyes Council Bill 20 1-694 has passed. Thank you Edson and Andrew and the community members who joined us for those two hearings. Next up, we have our third required public hearing. Councilmember Cashman, would you please put council Bill 7 to 1 on the floor for final passage?'",
        "'speaker_6': 'Yes, Madam President. I move the council bill 21, Dash 721 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved and seconded the required public hearing for council bills. 7 to 1 is open. And I see we have Libby here. When may we please have the staff report?'",
        "'speaker_8': 'Okay. Thank you. I'm with the Atoms with Community Planning and development and I'll be presenting the MAP Amendment for 16298 Green Valley Ranch Boulevard. This application is located in Council District 11 in the Gateway Green Valley Ranch neighborhood.'",
        "'speaker_8': 'The applicant is requesting to rezone from former Chapter 59 PWD 319 to 6 three for the northern portion of the site and SCC three for the southern half of the site. This 32 acre property is located near Pioneer and Green Valley Orange Boulevards.'",
        "'speaker_8': 'So to go into a bit more detail about the proposed zone districts, they both allow for a mix of uses including commercial, residential and office with heights up to three stories or 45 feet. Both have a minimum primary front slip or primary setback of zero feet transparency and pedestrian connection requirements that will help encourage an active ground'",
        "'speaker_8': 'floor. Additionally, the Smc's district requires a build to a 50% between zero and 80 feet. The existing PD 319, specifically Super BLOCK F, which is this property allows for a mix of uses but does not allow for a grocery store.'",
        "'speaker_8': 'It allows a maximum gross floor area of only half the size of the lot, which would enable a very low density development. The area is subject to the Denver Gateway Design Standards and guidelines, which provide guidance on street design, site planning, architectural design, landscape design, signage and lighting.'",
        "'speaker_8': 'These design standards and guidelines are applicable to most of the gateway area, which you can see in yellow on the screen. Prior to applying for this rezoning, this site went through the larger development review process because it is over five acres.'",
        "'speaker_8': 'It's recommended in the far northeast area plan and the proposed development requires new infrastructure. So the large development framework outlines the regulatory steps to be taken, with first being the rezoning, a mobility study, urban design review subdivision and then construction and building permits.'",
        "'speaker_8': 'So while our purview here today is to look at is to review the rezoning, you know, the previous slide talked about that there were other processes that are associated with this larger development. So one that has already been approved by city council is an economic development agreement between the city and the applicant for a sales tax revenue'",
        "'speaker_8': 'return generated by a full service grocery store. And so that's one of the main reasons the applicant has applied for rezoning, is because this amendment is specific to a certain grocery store, which is not permitted under the current zone district.'",
        "'speaker_8': 'The site is currently used for agricultural uses. You can see there is multi-unit, residential, vacant and then office surrounding the site. This slide shows the existing building form and scale with the subject property on the upper right hand side, an office directly south model, some row houses directly to the west, and then a new gas station to'",
        "'speaker_8': 'the north. The MAP amendment was complete at the beginning of November, and this rezoning received a unanimous recommendation of approval at Planning Board on June 16. To date, staff has received five comment letters, noting that residents would like to see locally owned businesses rather than chains.'",
        "'speaker_8': 'However, our zoning code does not regulate a business's ownership structure. We've also received letters of support from the Montebello 2020 register neighborhood organization, Marbella, Golden Age Club, Montebello Walks and Families Against Violent Acts, all stating that this proposal meets the goals of the Far North East Area Plan and will enable development of healthy food options.'",
        "'speaker_8': 'So there are five review criteria in the Denver zoning code that must be met in order for rezoning to be approved. The first criterion is consistency with adaptive plans, and there are three plans applicable to the three zoning.'",
        "'speaker_8': 'Information on how the application meets the strategies and the comprehensive plan can be found on this slide and in the staff report. And Blueprint. Denver The future neighborhood context is identified as suburban. These areas are characterized by a range of uses with a regular block patterns and curvilinear streets.'",
        "'speaker_8': 'And then Blueprint identifies the future place type as the community center place type. These types provide a mix of office, commercial and residential uses with heights up to five stories. The The Street Network is a mixture of mixed use, arterial collector and local streets.'",
        "'speaker_8': 'So this street network of local collector and arterial streets will support a mixed use and commercial corridor development. The Growth Area and Blueprint Denver. Denver is community centers and corridors. This is where we anticipate to see 25% of new housing growth in 20% of new job growth by 2040.'",
        "'speaker_8': 'So rezoning to an S-MAX three and CC three will allow for greater density development on the site. In compliance with this growth area strategy. Blueprint also encourages the rezoning of properties from the former Chapter 59 Zoning Code into the Denver Zoning Code until the entire city is covered by the Denver Zoning Code.'",
        "'speaker_8': 'And all large map amendments such as this one should be guided by the equity concepts found in Blueprint. Denver So the access to opportunity score is a combination of the neighborhood equity index, proximity to high frequency transit and then access to centers and corridors.'",
        "'speaker_8': 'So this site has lower than average access to opportunity scoring, lower on the equity index and proximity to transit. The access to centers and corridors varies throughout the area, so rezoning to Smc's x three and SCC three will increase access to centers and corridors because it will allow for a variety of commercial commercial uses, including community serving'",
        "'speaker_8': 'retail, such as a grocery store, which again is not permitted under the current but. The vulnerability to involuntary displacement score is based on median household income, percent of renter occupied units and residents with less than a college degree.'",
        "'speaker_8': 'So this area scores as moderately vulnerable to displacement, based on two indicators median household income and educational attainment. The proposed districts may bring a variety of jobs to the area, allowing residents with different incomes and education levels to find jobs and build wealth, which could help prevent involuntary displacement.'",
        "'speaker_8': 'The housing diversity score includes five measures percentage of middle density housing, home size, diversity, ownership versus rental housing costs and then income restricted units. So this site has a moderate housing density, only scoring as not diverse on the affordable units in the area of the proposed commercial and mixed use districts will likely have little impact on this'",
        "'speaker_8': 'metric, but they do allow for residential uses, which is for if residential is constructed, it could maintain the existing housing diversity in the area. And this map shows the mix of jobs in the area of the city with the dominant industry depicted by color.'",
        "'speaker_8': 'So this area has a similar mix of jobs to the city as a whole, and the proposed districts allow for a variety of office, commercial and retail uses, which will bring a variety of jobs to this area. The guidance in the far northeast area plan is consistent with the guidance and blueprint Denver for a neighborhood context, place'",
        "'speaker_8': 'type and growth area strategy. The Far Northeast Area Plan provides further guard guidance in regard in regards to building heights, allowing up to a maximum of eight stories on this site. And the plan also provides specific recommendations. Irsay identifies airport way as a through street, also updating the future street type, which will be constructed as a result'",
        "'speaker_8': 'of this proposed development and airport way is identified as a mixed use arterial. The Far Northeast plan also provides specific recommendations for the Gateway Green Valley Ranch neighborhood, including creating new community centers on undeveloped land and supporting a mix of uses and encouraging properties to rezone from the former Chapter 59 Code into the Denver Zoning Code.'",
        "'speaker_8': 'So the proposed S-MAX three and FCC three districts are consistent with the far northeast area plan because they will allow for a new community center on undeveloped land and bring a property into the Denver zoning code. Staff also finds the rezoning meets the next two criteria.'",
        "'speaker_8': 'It will result in uniformity of district regulations, and it will further the public health and safety and welfare by rezoning a property from the former Chapter 59 into the Denver zoning code, allowing a greater mix of uses, increased density on the site, and allowing grocery store use in an area that has little access to healthy food options'",
        "'speaker_8': '. Additionally, rezoning the property out of PUD 319 will not have an impact on the remainder of the properties that will remain in the PUD because there's a maximum gross floor area for each super block within this body, so that will prevent any increase in density in the remainder south.'",
        "'speaker_8': 'Also finds there is a justifying circumstance and that this property and that this rezoning is rezoning a property from the former Chapter 59 into the Denver zoning code. And lastly, it's consistent with the suburban neighborhood context, the purpose of the mixed use and community corridor districts and the specific intent of the smc's three and three districts.'",
        "'speaker_8': 'So finding all review criteria have been met. Staff recommends approval and that concludes my presentation. Happy answer. Any questions?'",
        "'speaker_1': 'All right. Well, thank you, Libby, for the staff report. And we're going to go first to our individuals who are signed up to speak. We have seven individuals. We have our first two, her and chambers. And so I'll go ahead and call them.'",
        "'speaker_1': 'We have Troy Coles and Mark Goldberg. And so we'll go ahead and start with Troy Kels.'",
        "'speaker_2': 'Vertical.'",
        "'speaker_1': 'Okay. All right. Troy is going to go ahead and defer his time. And so we'll go ahead and go to Mark Goldberg.'",
        "'speaker_3': 'Madam President, members of the Diversity Council. My name is Mark Goldberg. My company is Goldberg Property Inc. I'm a long time Denver resident, was born here, went to East Denver High School and have been developing commercial real estate, mostly shopping centers for over 40 years.'",
        "'speaker_3': 'Some in Denver, one in Councilmember Black's neighborhood as well. We are very pleased to come before you tonight for our rezoning of this property, bringing in our Chapter 59 into a more contemporary zoning. One of the key features in doing that was we could not do grocery stores live, he said.'",
        "'speaker_3': 'And we do intend to have a grocery store here and much more. That will be Costco will be our anchor tenant. And Costco fulfills many things in the far Northeast Plan and blueprint, Denver and the aspirations of the folks in far northeast, and that is jobs.'",
        "'speaker_3': 'There will be 500 to 600 new jobs added with this project. Costco alone will have 200 jobs. And of those 200 jobs, they will play an average of $24 an hour. Costco also for employees that work for 23 hours a week, a provide vacation, full medical and full dental care.'",
        "'speaker_3': 'The Costco will have not only fresh groceries, many of you been there, but many other general merchandise and items as well as pharmacy hearing, aids, eyeglasses, appliances, you name it. It's a full service retail establishment. Many of those dollars that the people in the far northeast and in Denver, those same dollars that are spent out of Costco'",
        "'speaker_3': 'actually go out of the city of Denver. They go principally to Aurora. By having this project happen, those dollars will come back. Moreover, it will make it more convenient for people in the far northeast to access good groceries and fresh groceries.'",
        "'speaker_3': 'In addition to that, we will have additional retail in the northern part of the project that will have a variety of food offerings sit down restaurants, fast casual restaurants, fast food and other kinds of restaurants. We'll have a town center that will be very human scale, much like we see in some of the older neighborhoods in Denver'",
        "'speaker_3': 'where you can be very walkable, will have a plaza. There will be 123,000 square feet of places to sit down, a firepit. There will be an amphitheater for folks to entertain. In addition to that, there's certainly open space and connectivity to existing trails that go through our nearest neighborhood, the Albion neighborhood and so forth.'",
        "'speaker_3': 'With me tonight are members of our team, including Noor Kimball. And unfortunately without us tonight is Susan Stanton, who was the original champion of this project and introduced me to Councilman Gilmore. And things kind of moved from there.'",
        "'speaker_3': 'And we miss Susan as a member of our team dearly. Carolyn Weiner, attorney is online, my partner, Adam Meyers, and all the.'",
        "'speaker_1': 'Time we have available. Thank you. We'll ask you to answer any other questions council members might have here in a moment. We're going to go ahead and transition to our next set of speakers. And they are all online.'",
        "'speaker_1': 'And so our first speaker up is Adam Meyers.'",
        "'speaker_2': 'Hi. Good evening. Can you see and hear me? Yes. Great. Thank you all for your time tonight. Mark and I have been working on this project since 2016. As Mark said, we've got Costco as our anchor retailer who will be a significant economic engine to Denver and the northeast area.'",
        "'speaker_2': 'And I just wanted to state that our my company is CPA Bedrock has on.'",
        "'speaker_3': 'This property for over.'",
        "'speaker_2': '25 years. We were we've been investing in this area for four decades. That said, we've been waiting for this type of opportunity and this.'",
        "'speaker_3': 'Type of world class retailer.'",
        "'speaker_2': 'To come in and help anchor a project such as this one. So beyond that, my own personal connectivity to Denver. I went to grad school. Do you go pioneers? And I've lived in Denver for many years. Unfortunately, here on the East Coast.'",
        "'speaker_2': 'I would love to be in Denver again, but I just wanted to state that this is a very exciting project for us and we are thrilled to be able to bring Costco and many other offerings to the community which has been underserved for decades.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker this evening is Carolyn White.'",
        "'speaker_9': 'Madam President, I'm just signed up to answer questions.'",
        "'speaker_1': 'All right, great. Thank you. Our next speaker is Lawrence Murray.'",
        "'speaker_3': 'I. Can you hear me?'",
        "'speaker_1': 'Yes, go ahead.'",
        "'speaker_3': 'Good evening. Denver City Council and Denver residents. My name is Lawrence Murray. Currently, I serve as my fellow Gold eight club vice president and I purchased my home in my brother in 1982. That's made a prior memo to the planning board on my support.'",
        "'speaker_3': 'This zoning change. In my humble opinion, this change is a no brainer for council stamp of approval. Yet. Let me quickly comment that this is an opportunity for the city to get an economical jump on our neighbor to the south.'",
        "'speaker_3': 'Aurora Marbella is an enclave devoid of many services provided to many other communities in our city. This initiative will help to correct that situation. However, I think that the city should.'",
        "'speaker_2': 'Be concerned with.'",
        "'speaker_3': 'How to keep assets and revenue of our citizens in Denver. In many cases, folks living in my neighborhood must keep it for services provided elsewhere, and that elsewhere normally is Aurora. This project will not just be a service source for us, but an economical boon for my neighborhood and the city.'",
        "'speaker_3': 'The introduction of a Costco here will not only affect my business, but it will be a magnet for all for northeast Denver, Adams County, Aurora and the smaller communities like Watkins, Bennett and Strasburg and buyers that line the eastern corridor of I-70.'",
        "'speaker_3': 'There is no other service source like this proposal located closer to those towns. Trust me. Should you farther back them in this change? There is no doubt that the sooner and waiting for this costume is Aurora. Please don't let that happen.'",
        "'speaker_3': 'Support our Denver citizens, especially those of us living in my bubble and the City Council. Approve the Crossbow Flyway Project Zoning Code. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Ann White.'",
        "'speaker_9': 'Hello? Can you hear.'",
        "'speaker_1': 'Me? Go ahead.'",
        "'speaker_9': 'Okay. Thank you for the opportunity to speak. I'm and white, a 45 year resident, a mom, fellow and board president and chair.'",
        "'speaker_4': 'Bill 2020 R.A..'",
        "'speaker_9': 'I'm speaking in.'",
        "'speaker_4': 'Support of the five.'",
        "'speaker_9': 'Way slash Costco Project Design Change. This project will provide quality food access, which means we will no longer be considered a food desert. Multi-faceted retail, shopping options, restaurants, etc.. High paying jobs with benefits. It will also allow our tax dollars to remain in our community.'",
        "'speaker_9': 'Our community has waited decades for this land to be developed. This project will provide equity, equality and transparency with shopping options. Other Denver communities already enjoy. Our Urge Council to pass this zoning change.'",
        "'speaker_1': 'Thank you, Miss White. Our last speaker is Jesse Paris.'",
        "'speaker_2': 'Yes. Good evening. Members of council, those watching at home, those in the council chambers. My name is Justin with Sam parents and I'm representing for Black Sox I'm all to self-defense as a mexican man for social change as well as the Unity Party of Colorado and frontline black males.'",
        "'speaker_2': 'And I will be the next mayor of Denver in 2023. I am 100% in favor of this resounding change. To me, this is a much needed asset to this community of Montebello, Gateway and Green Valley Ranch. Areas of town that have been neglected, especially when it comes to food access.'",
        "'speaker_2': 'So I am definitely in favor of this rezoning. It's my please pass this. We need this. This would be the first of its kind in East Denver, a Costco that would employ people in our community with high paying jobs and benefits.'",
        "'speaker_2': 'So, yes, this is an asset, not a liability. I am full support of this. I'm glad it's not going to be something that's going to be unaffordable and nobody can afford to live in. But actually an asset and a resource.'",
        "'speaker_2': 'A much needed resource. Black and brown communities with Montebello Gateway, which are predominantly. So please pass the tonight. We need equity and inclusion in the city and county of Denver. And this is one step in that direction.'",
        "'speaker_1': 'Thank you, Jesse. That concludes our speakers questions from members of Council on Council Bill 7 to 1. I'll give it a moment here. All right. Not seen any questions by members of council. The public hearing is closed. Comments by members of Council on Council Bill 7 to 1.'",
        "'speaker_1': 'Councilmember Ortega.'",
        "'speaker_9': 'Thank you, Madam President. I had an opportunity to attend one of the community meetings where this project was being discussed, and overwhelmingly people from the Belo community were very excited about the opportunity to see some commercial development there.'",
        "'speaker_9': 'So this is not just the Costco, right? There will be some other commercial development in the area. And certainly the the wages that Costco pays and just the offerings that they have where you can go and basically shop for a number of things.'",
        "'speaker_9': 'It is a membership driven entity, if you will. But that did not seem to be a deterrent for most of the people from the community. And I think this is going to be incredible for these neighbors, especially knowing the fact that many of them shop in Aurora and a lot of our our dollars, we call it leakage'",
        "'speaker_9': ', basically are going to the neighboring county. And this is an opportunity to capture those revenues in the city of Denver. So I am very supportive of this moving forward tonight. So thank you, Madam President.'",
        "'speaker_1': 'Thank you, Councilmember Ortega. And not seeing anybody else up in the queue. I'll go ahead and make my comments now. It's a little bit surreal that we've gotten to this point. I want to really think the development team.'",
        "'speaker_1': 'You know, we heard from Mark Goldberg, we heard from Adam Meyers. We mentioned and could not be remiss in mentioning Nora Kimball. But then also Susan's Susan Stanton, who we lost last year in the month of August when we were coming forward to committee with this project.'",
        "'speaker_1': 'And I have to say, were we're carrying this forward in Susan's memory. She was of the community. She was integral in making sure that we were coordinating with Montebello 2020, with the Golden Age Club, with Montebello Walks with families forward, with Montebello Organizing Committee.'",
        "'speaker_1': 'This is a win for the neighborhood. They have championed access to full service grocery stores and retail for decades. I've lived in Montebello for 25 years. I know that there's folks that have been working on this for 40, 45, 50 years to get this in the community and our largest workforce.'",
        "'speaker_1': 'You know, area in the far northeast is Denver International Airport. Everybody else who works in the district, it's a mass exodus every single morning and every single night because we don't have employers who are close to home in our neighborhoods.'",
        "'speaker_1': 'And so to be able to have access to full service grocer but then a place in the neighborhood to go buy a pair of socks. If you needed a pair of socks to buy a pair of shoes to buy clothing.'",
        "'speaker_1': 'The only place now that we have had for decades are dollar trees and dollar stores. And to finally have a retailer, along with the full service food establishments and a gathering area in the community, along with well-paying jobs, with benefits, is a huge win.'",
        "'speaker_1': 'And I want to give this all the credit to the community for their advocacy. But then as well, I don't know, Marc, it was maybe four and a half years ago that I took Marc on a driving tour of the district and got him in my car, got him a cup of coffee.'",
        "'speaker_1': 'But then we were going to drive through Montebello. We were going to drive through Park Field. We drove through Green Valley Ranch and we drove the surrounding area. And I have to appreciate Marc and his vision to bring this forward, because we've had lots of bumps along the way, but very, very grateful that we got here.'",
        "'speaker_1': 'And I would be honored to have my colleagues tonight vote in favor of this rezoning of the 32 acres for the Flyway Project. And so with that being said, Madam Secretary, roll call on Council Bill 7 to 1, please.'",
        "'speaker_4': 'Black.'",
        "'speaker_7': 'I see tobacco.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_7': 'Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Herndon, i.'",
        "'speaker_7': 'Cashman. I can eat.'",
        "'speaker_4': 'I.'",
        "'speaker_9': 'Ortega, I.'",
        "'speaker_7': 'Sandoval. Sawyer.'",
        "'speaker_4': 'I. Torres, I.'",
        "'speaker_7': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_7': '12 Eyes.'",
        "'speaker_1': '12 Eyes Council Bill 20 1-721 has passed. Thank you to the community members and the development team and Libby for joining us this evening for this hearing. And we're going to go ahead and move on to the courtesy, public hearing that we have on the bond package.'"
    ],
    "A bill for an ordinance submitting to a vote of the qualified and registered electors of the City and County of Denver at a special municipal election to be held on Tuesday, November 2, 2021, the question of whether the City shall be authorized to issue or incur general obligation debt for the purpose of financing and/or refinancing the cost of repairs and improvements to the Denver Facilities System; providing the form of the ballot question; providing for other details in connection therewith; and ratifying action previously taken. Refers a question to the November 2021 ballot to allow the City to issue general obligation bonds for the purpose of financing and/or refinancing the cost of repairs and improvements to the Denver facilities system. The Committee approved filing this item at its meeting on 8-3-21.": [
        "'speaker_1': 'Councilmember Cashman, will you please put Council Bill 864 on the floor for publication?'",
        "'speaker_6': 'Yes, Madam President. I move the council bill 21, dash 864, be ordered published.'",
        "'speaker_1': 'Thank you. It's been moved and seconded. The combined one hour courtesy public hearing for council bills. 864865866867924 and 868 is open. Speakers may address any or all of those items after the conclusion of this public hearing. Council will vote on each item separately and we're going to go ahead and have the staff report from Brendan Hanlin with'",
        "'speaker_1': 'the Department of Finance.'",
        "'speaker_2': 'Good evening, City Council. Thank you for having us here tonight. Brendan Hanlon, the city's chief financial officer. You're here to provide the staff briefing on the following six bill requests. 864 865 866, 867, 924 and 868. We have been presenting these in two committee meetings over the previous three weeks, reviewing and asking for council's approval to refer'",
        "'speaker_2': 'five bond measures. Now that's up from four from from the last time we were briefing council. Five bond measures to the ballot for consideration by the people of Denver for the municipal election to be held on November 2nd, 2021.'",
        "'speaker_2': 'Wanted to briefly provide some some overview that's been provided at the committee level, then focus on the primary purpose that we're here. This is part of our recovery effort. The package includes 80 unique projects that would create 7580 jobs, $483 million in labor income, and $1 billion in economic output.'",
        "'speaker_2': 'So this is a foundational element of our recovery. It is not the only element of our recovery that also is going to be paired with other federal funding dollars and other city dollars both this year and into 2022.'",
        "'speaker_2': 'So briefly reviewing the package of projects that are in each of the five questions, these are this is going to be an element of the sixth ordinance request or bill request that has the companion ordinance that outlines these projects.'",
        "'speaker_2': 'The first question is on Denver facilities, a total of $93.7 million of projects, 1832 jobs created by this package, $116 million of wages provided through these projects. $255.8 million of economic output. You'll notice that the projects are a combination of city facilities, cultural facilities, both new construction as well as maintenance, housing and sheltering.'",
        "'speaker_2': 'Two projects. These projects total three $37.4 million, providing jobs of 457 wages at 26.1 million, and economic output of 60 million focused primarily on our sheltering facilities. Again, these should be paired with other investments that the city has made by way of CARES funds, as well as proposed American rescue plan dollars that are also containing housing investments'",
        "'speaker_2': 'as well. So this is one element of a multi funding stream. Transportation investments totaling $61.2 million, 877 jobs, 54.7 million of wages provided through these projects. Economic output of $122.4 million. Again, a combination of both concentrated new construction as well as maintenance of an expansion of our transportation system.'",
        "'speaker_2': 'Parks and rec projects totaling $52.7 million. 947 jobs. Wages provided 60 million economic output of $115.4 million. Again, a variety of both new construction as well as maintenance projects throughout the city, both large and small. Projects. And the last question, this is a new question from our Conversation Committee.'",
        "'speaker_2': 'Two weeks ago, two projects totaling $190 million of investment for 3467 jobs. Wages of $225.5 million. Economic output of 490 million. And these two projects are concentrated in in the National Western Center campus facilities. There are other elements of this.'",
        "'speaker_2': 'You have the questions that have been provided to you. These are elements of those questions. These are table required numbers. Below that estimate, the paramount or the principle that would be transacted through each of the questions. The maximum total repayment cost, principal and interest is in that category and the maximum annual debt service.'",
        "'speaker_2': 'All of these elements are required as part of the table of questions that that is a legal requirement of any debt questions that go on to the ballot. And that concludes my update and staff report. Thank you.'",
        "'speaker_1': 'All right. Thank you, Brendan. And tonight, we have 40 individuals signed up to speak and we want to hear from as many folks as possible. We're going to allocate one hour to the courtesy public hearing. And we also have some folks that we're going to have interpretation services for them as well and will allow them 6 minutes'",
        "'speaker_1': 'for the translation. And we're going to go ahead and call up our first set of folks who are in chambers. And so Nolan Miguel, L.J. Suzuki, Mercedes Gonzalez, Jocelyn Hill and Angela Angelina. Scuse me, Torres, are all the folks in person in chambers that we're going to take first?'",
        "'speaker_1': 'And our first speaker is Nola Miguel.'",
        "'speaker_4': 'Good evening, council members. Thanks so much for for hearing us tonight. My name is Nolan Miguel, and I'm here with the global response here, Coalition Organizing for Health and Housing Justice. I wish that we were here tonight in support of this.'",
        "'speaker_4': 'I really do. Mostly because the fate of local area Swansea is really intertwined with the National Western Center. Especially our most vulnerable neighbors that have been facing already involuntary displacement. Nine out of ten neighbors facing involuntary displacement. Now, with the pandemic, the issue is even more heavy, something that we're all dealing with every day.'",
        "'speaker_4': 'Unfortunately, community benefits have not been identified yet. After eight years of talking about it, and I'm happy to give a more detailed history of those eight years as I've experienced them. There hasn't been real community benefits identified. We haven't we don't feel like a real partner in this development.'",
        "'speaker_4': 'We don't feel like we're engaged in this development. We have lost homes and businesses, in particular in the Elyria neighborhood in the triangle that have not been recovered nor mitigated. And we feel like this isn't being done right.'",
        "'speaker_4': 'This is being rushed. We feel like this the rushing this actually puts the national Western reputation at in danger. Is it and is is irresponsible in a lot of ways because it frustrates the voters. It divides our community in globally response here.'",
        "'speaker_4': 'And it really feels negligent and harmful to not have done a proper process for this. And we have time to do that. We have time to do that and to finance this right in a way where community benefits are prioritized and really have a path forward.'",
        "'speaker_4': 'We talk about recovery. Is this is talk about recovery for a minute. Is it to re cover? Is it to recover our eyes to the reality that was before the pandemic? Because we know that the pandemic has unveiled structural inequities around housing, around health, and we can't go back that those things have been unveiled to us.'",
        "'speaker_4': 'And we need to see our leaders really rethink these types of things that plans that were formed in 2014 and shift to a resilient plan that builds on the strengths of people. We feel like we're this is just plowing forward with tons of unknowns.'",
        "'speaker_4': 'I have so many unanswered questions about what's going on in this plan, and we don't feel like doing this is smart governing or putting this out to the public when there's not enough of those answers to those questions right now.'",
        "'speaker_4': 'We have been working as a coalition on really thinking through what could happen at the National Western when there is a gap from the P3 not going through anymore. We really took that as an opportunity to say what would we want?'",
        "'speaker_4': 'What is the vision? And we started working on that earlier this year. And we have a vision document. We have extra copies and are happy to give them all to you. And we can talk more about it at.'",
        "'speaker_1': 'The time we have this evening. All right. We're going to go ahead and go to our next speaker, LJ Suzuki.'",
        "'speaker_2': 'Good evening, Councilwoman. Councilman and fellow citizens. My name is L.J. Suzuki, and I'm here representing the Globeville first R.A., which is the primary registered neighborhood organization of Globeville. We had a meeting last Tuesday night to discuss 924 for the funding of Phase three of the National Western Center and have released a resolution on our stance, which I'",
        "'speaker_2': 'will happily circulate with you all when I'm done here. In summary, we support the economic development of our neighborhood and therefore we support the Phase three development bond issue with the following firm conditions. First, we insist that the City of Denver and the National Western Center approve the Community Investment Funds proposed community impact fee.'",
        "'speaker_2': 'This fee is not the same as the already committed to. Roundup is an additional mechanism which will be presented to the National Western Center's Board of Directors in the coming weeks. The committee carefully designed the fee to scale proportionally with the growth of the National Western Center.'",
        "'speaker_2': 'Therefore, the campus's success is also our community's success. Phase three, therefore, stands to benefit Globeville in a significant way, but only so long as the community impact fee is in place. Also approval of this fee is a non-negotiable condition of our organization.'",
        "'speaker_2': 'Support of the bond. Second, we expect the city of Denver to make good on the projects in the 2017 bond issue and verbal promises made by several city officials over the years. These include adding improving pedestrian infrastructure, traffic, calming measures to keep our children safe.'",
        "'speaker_2': 'A pocket park at the site of the former tiny home village and cleaning the underpasses our children and commuters use every day, which are typically filthy with pigeon feces and habituated by homeless people. While several projects are planned and in process, many remain verbal promises only.'",
        "'speaker_2': 'We respectfully request written commitments from the city to perform these basic services which are already being performed in Reno and other neighborhoods. With legally binding consent for these two simple conditions. Global First will enthusiastically support the city's bond package and the November ballots, and we will encourage our neighbors to do the same.'",
        "'speaker_2': 'Thank you. And I'll remain available tonight for further questions.'",
        "'speaker_1': 'All right. Thank you. Our next speaker is Mercedes Gonzalez. And as she makes her way to the podium and with our interpreter and I would ask that our rules of decorum, we ask everybody to have a seat. And so we can't allow anybody to stand against the wall in the back.'",
        "'speaker_1': 'Thank you. Go ahead, please.'",
        "'speaker_10': 'When I start this, the lengthy list for Permettere, the mayor of LA presidency. This one here, which going to see is La Coalition. De is Globeville. Elyria. Swansea? Yes. They represent other island residents. This does those for money, that is.'",
        "'speaker_10': 'Brett Johnson for management. They proclaim under Proceso de la Ciudad the embed in Valencia Canal, this Arroyo del Complexo Nazionale. The lawyers thing. Good evening, Council, city council. And I want to thank you for for allowing us to be here and to give a comment.'",
        "'speaker_10': 'So the G as Coalition global area Swansea represented represents the residents of these two communities, rejects formally the proclaim the proclamation in the process in the equities accretive process of the city of the Denver in relationship to the development of the national Western stock.'",
        "'speaker_10': 'Lot. Miembros de la Junta. I mean, don't yell. L'll call them Hancock. So you get enough in this area, they'll complain. Who is particular de la soul Neville to not gonna see that commercial triangulum say I gave him the former costar he acted that diva bit unmistakable is that's a feeling I feel my slowness begs I feel'",
        "'speaker_10': 'my processor continua on only legato the practical, the this arrow, your sister, this poor quality, a lack of money that you Basil's promise as well as you that other them better they want this arroyo that he the poor la comunidad.'",
        "'speaker_10': 'City council members and the and Mayor Hancock affirm are they continue to affirm that the developments of this complex and in particular of the triangle zone that is known as the triangle has been taken in a way that is a just and equitable.'",
        "'speaker_10': 'But for our community it rejects these affirmations, does affirms that this process continues to be taken by our racist practices for this development. It has been displacing land for the community and false promises that the city of Denver for a development that is led by the community.'",
        "'speaker_10': 'Sierra Young got me into the embed in Sierra Leone process so that I meant that it was the SEC Optometry Congress. Miembro de la Comunidad Tribal Association Profunda Gay Incluida Escuchar incorporate aspect of the La Comunidad Para Los Banos Anteriores Contra la comunidad.'",
        "'speaker_10': 'That will be the lateral precedentes. They'll address the residents in an elegant central Vegas solicitous you that guarantee in a disaster your equitable maybe anything. If city if Denver City Council would like to be able to do a truly equity tive process of righteous process, it would commit to gas or with gas and with the members of'",
        "'speaker_10': 'the community through a collaboration that is a deeper collaboration that would include listening and incorporating the petitions of the community and to be able to repair the damage is done before against the community by returning the property of the land of the residents in concrete, G.S. is asking the city to advance in a development that is equitable'",
        "'speaker_10': ', more equitable through. The Polar bear a la Comunidad Reno's gives it a spot on the river turtles in El Bahia. The Complex Nacional de la is the common part of this arroyo a largo plazo that. So it would commit by giving back to the community those lands that were taken from the community, from the neighborhood and through'",
        "'speaker_10': 'the National Western Stock Show as part of a development in the long term for Denver. Established Heroin Association Significativa as commonly gathered locally, Circrnas and Nazionale was their para provider. Dentists border with Assisi on this arroyo. This was the barrio from operating their pocket, their bones in equal care.'",
        "'speaker_10': 'This arroyo posterior. To establish an association, a meaningful association with the communities, with the local communities nearby and to Western Stock Show to be able to give residents the power over the decision making, over the development of the neighborhoods as part of the package of the bonus package or of the bond package and whatever other development that'",
        "'speaker_10': 'happens. Zero. That's an error that that general this Arroyo. The studio in Berkeley, Los Banos and Servicio Salud. We end up at a Los Habitantes the but most notably we end up losing touch on Bebe Indesit Ghibli e Programas Empleo.'",
        "'speaker_10': 'It would stop the development of the stadium and invest the bonds in certain health care services homes for the people of Denver, such as solutions for housing, solutions for the homeless homes, accessible homes and programs and employment programs and housing, accessible housing and employment programs.'",
        "'speaker_10': 'Gilmore resident It is one Seattle labor that is for me. Yo siento completamente. They're on the prowl the other a post border stop pasando in already adorned with comunidad en todo el these are all your triangulum yellows. This are all yours.'",
        "'speaker_10': 'Then the lizard. Then to the DeSalvo Is Salvatore Mendel getting all this stuff done? DoCoMo comunidad eu mas afectado solos mas vulnerables gets quarters for this place. Sarmiento gives a stubby indoor color the masked Imus displacement of water systems.'",
        "'speaker_10': 'This arroyos intones as more or more blessed enter labor that e so you're not abuela they they all choice equals yes, he says nietos he says these nietos Joe we are laboratorios tambien body yours or mi familia. Over time, darling, or you'll have to let the Vietnam Police straight up stop us and.'",
        "'speaker_10': 'So as a resident of Swansea, I am very disappointed by what has happened and I am disappointed by the development that has happening all around the area with I-70. With everything that is happening and with all the homeless communities that we see all around.'",
        "'speaker_10': 'And as a as a mother of eight, grandmother of 16, and great grandmother of six, I worry about their future and about other things that are happening with it, with the lack of housing in our communities.'",
        "'speaker_1': 'All right. Thank you very much. We've got to go ahead and move on with their spirits. Yes. Thank you. Yes. Next up, we have Jocelyn Hill.'",
        "'speaker_4': 'Thank you. It is an honor to be here tonight speaking with you council members. I am here. I am Jocelyn Hill. I am a Denver resident. I am here representing the Colorado State University system. The CSU system is expressing support for the inclusion of the arena, an historic 1909 stadium building bond on the November ballot.'",
        "'speaker_4': 'CSU has been a partner of the National Western Center redevelopment since 2013. Our CSU Spurr campus, currently under construction, will be a public facing satellite campus, bringing educational and research opportunities of our three institutions to Denver and to learners of all ages.'",
        "'speaker_4': 'Our mission at SPR is to promote educational equity and inspire the next generation to tackle big challenges in food, water and health. Critical to this mission is our engagement and connection with the surrounding neighborhoods and to the city and county of Denver over the last eight years.'",
        "'speaker_4': 'We have listened, offered community responsive programs, partnered with existing local organizations and are on the verge of opening physical spaces that can host our neighbors for programs in just a few short months and can over time become an anchor institution for the community providing good jobs and economic sustainability.'",
        "'speaker_4': 'The arena matters to CSU. It would include local families, and our vision is that when they visit the arena, they also visit Spur when they come to events. They will also come to experience our hands on fun learning experiences that connect young people to career pathways they may not have considered.'",
        "'speaker_4': 'In this environment, children who may never have had the opportunity to see and experience how food grows or what it means to be a veterinarian can dove in and explore those opportunities in a setting where learning is open and designed for them.'",
        "'speaker_4': 'I see us whose presence at the National Western Center also represents a partnership with Denver schools and Denver youth that ultimately aims to ensure that more students will be ready for careers and connected to the educational pathways that those careers require.'",
        "'speaker_4': 'We believe we will reach more families and young people with the arena and 1909 stadium building energized and drawing visitors in addition to local families. We also know that visitor visitors will come to the arenas from around the country and around the world, providing an opportunity to showcase North Denver and the state of Colorado.'",
        "'speaker_4': 'The 1909 stadium building offers something a little bit different a chance to focus on what CSU has done for over 150 years to connect people to food. The vision for the market space in the 1909 includes opportunities for small businesses, a chance to showcase Colorado's food products, and a way to incubate new ideas, all while opening up'",
        "'speaker_4': 'possibilities for fresh, affordable food being more accessible to those nearby. Both the Arena and 1909 have been part of the overall vision for the National Western Center and bring strength to the larger project. Along with the rest of the National Western Center.'",
        "'speaker_4': 'They will provide economic impact and long term jobs. For these reasons, CSU is asking that the council vote to include the arena and stadium building public market in November's ballot. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Angelina Torres. And we're going to allow 6 minutes for translation services.'",
        "'speaker_10': 'When I started.'",
        "'speaker_2': 'Looking at.'",
        "'speaker_10': 'The numbers letters. So to see them through this one in. Good evening, City City Council. My name is Angelina Torres and I am a resident of Swansea. And. Nor is there equitable Bono to buttress. Portugal National with the notice of promises in polio.'",
        "'speaker_10': 'They use this rule. Familiar Italians who live in the center of Circle National. Was this just a participant in this? Who molested the girls in the lawyers technical 7-Eleven is the automatic comment this. These are local. No care of that apology album.'",
        "'speaker_10': 'No Birkin? No. Is Diciendo. Look at the very end, I said. Embrace the Latino necesitamos viviendo. Farkas. In the local community areas. Is passive, communitarian. Lara's request. But alas, 1 million still within that inner. Further, it cannot happen in the theater.'",
        "'speaker_10': 'Contreras Eagle National Wisdom Taken from Metalcore La Comunidad. If your mando bull compromise socialism everywhere don't. Gadhafi. I am not in agreement with the Phase three bond because in north the National Western Stock Show has made promises that did not fulfill that they did not fulfill.'",
        "'speaker_10': 'They displaced families that had their homes in the lands close to the national western. They disappeared. Stores such as the store called Sinaloa into La Botanica and 7-Eleven, which were automatically displaced. I don't want the city to support this bond because they are not doing what they should do.'",
        "'speaker_10': 'Instead of the arena, we need housing, parks, local stores, community spaces, recreational places so that the families in the neighborhood and we need them to support the community land trust with lands and for the national western to commit with the community by signing an agreement, a solid agreement.'",
        "'speaker_10': 'That is true. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Silvia Hernandez. And she is joining us online. And it looks like we don't have Sylvia with us. And so I'm gonna go ahead and call the next speaker online. We have Jack FINLAW, Marvin Thomas, Kevin O'Connor and Bob Sarlo, just so you can be ready if you're not right by your computer'",
        "'speaker_1': '. And so we're going to go ahead and go to Jack FINLAW. Jack, if you can hear us, we've got you cued up to speak. You might have to unmute yourself. Okay. We'll go ahead and move on. We'll try to get Jack back in the queue if we can.'",
        "'speaker_1': 'Marvin Thomas. All right. It doesn't look like we have Marvin Thomas. Kevin O'Connor.'",
        "'speaker_3': 'Thank you, President Gilmore. Can you hear me?'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'Thank you very much. And thank you. Members of the city council. My name is Kevin O'Connor. I reside at seven seven for Saint Paul Street. First, I want to thank the city council and the city government for this excellent technology that makes it possible for myself and other citizens to testify from our homes.'",
        "'speaker_3': 'I think that's a terrific advancement of democracy. I also want to acknowledge that the bond issue. I am speaking on behalf of completion of the Central Library Project. In doing so, I want to acknowledge that two very important library additions are in this Bond project.'",
        "'speaker_3': 'Certainly appropriate given that the city has grown 115,000 people and that these neighborhoods are properly served. I want to refer back to an article on April 28th in the Denver Post when the mayor announced a approximately $400 million bond issue in concept, saying that it was to jumpstart the pandemic recovery, create 40,000 jobs by the end of'",
        "'speaker_3': '2022. I also want to refer to the report that was received by the Finance Committee, where the completion of the Central Library was a Tier one project. There's many reasons for that. Most importantly, the current project is on time and it's on budget.'",
        "'speaker_3': 'It's also already planned and ready for construction. So if we're to meet the goals that was were in the introduction of the bond issue by staff to create jobs by the end of 2022. This seems like an ideal project and would secondly save the city money because construction is on site already.'",
        "'speaker_3': 'So by by being on site, the contractor can continue without the start up costs. So I would I would encourage the city council to restore the $19 Million necessary to complete the Central Library Project. And appreciate your consideration.'",
        "'speaker_1': 'Thank you. We're going to go ahead and ask Jack FINLAW to go ahead and leave the Zoom meeting and come back into it. And we think we'll get your audio and video working. Sometimes we just need to have you pop out and pop back in and we can get it going again.'",
        "'speaker_1': 'So if Jack FINLAW would do that, our next speaker that we had online via Zoom was Barb, Bob Sarlo. Bob Sarlo and it doesn't look like we have Bob in. And so we're going to go ahead and transition back into chambers and I'm going to call the next five folks if they can join us up in the'",
        "'speaker_1': 'front pew or get ready to come up. We have Sara Lee, Paul Andrews, Alma Urbano, Ernest House and Carol Briggs. Our first speaker is Sarah Lake.'",
        "'speaker_4': 'Thank you. Council members. My name is Sarah Lake. I live in District nine and I wanted to speak about the development of the national western complex and in particular the arena in the 1909 building. I'm speaking tonight not only as a longtime Denver resident, but also as an economist over from Boulder in economics, sociology and meaning.'",
        "'speaker_4': 'My training and my career is dedicated to looking at how economic development either exacerbates or improves inequality. So tonight I'm approaching this question about this bond from an academic perspective, from a research research perspective. And if we look at the research, it's very clear the arena is both economically untenable and also unjust in an equitable.'",
        "'speaker_4': 'Several council members have already pointed out in previous sessions there's many problems with the feasibility study that has been conducted. So let's start there. First. We've already invested $765 million in this project, and now they're asking for more because the original plan counted on a public private partnership of which companies pulled out of because they themselves did'",
        "'speaker_4': 'not trust that this was going to be profitable. Second, we know that the feasibility study stated that it will not be profitable unless 10,000 housing units are built in the neighborhood. That's nearly four times the number of all housing units in the Reno neighborhood right now.'",
        "'speaker_4': 'Next. Any recovery is expected to be 3 to 5 years out. We're not talking about economic returns from the arena any time soon, and especially not for the neighbors surrounding the arena. This project is not shovel ready as it was originally claimed.'",
        "'speaker_4': 'Next, the study notes that the arena is going to compete directly with other venues. There are over a dozen venues in the Denver and surrounding areas that hold 5000 or more people, and the feasibility study even notes that it will be the same types of events that will be held at this arena as well as the other'",
        "'speaker_4': 'dozen arenas. Next. There's been very little thought put into the sources of revenue for the investment fund. The bare minimum solution of rounding up on purchases is highly contingent on sufficient sales and doesn't even offer the scale of investment necessary to support the community.'",
        "'speaker_4': 'And next, the feasibility study. It was conducted from 2013 to 2014. It uses data from 2012. We're talking about a decade old data source that we're relying on to tell us that this is going to be economically profitable and sound.'",
        "'speaker_4': 'And last, the feasibility study emphasizes the challenge of developing the arena without available land. It requires the disenfranchisement of local community members. And as we've heard from the global Globeville, Elyria, Swansea Coalition, they are not supporting this development.'",
        "'speaker_4': 'So to be fair and just, it is essential that we vote no on this bond and allow more time to investigate how to do this process in a just and fair way that does the right thing.'",
        "'speaker_1': 'Q That time we have allotted our next speaker up is Paul Andrews.'",
        "'speaker_3': 'Thank you, Madam President. Thank you, members of council. It's always a pleasure to be here with you. I am Paul Andrews, the president and CEO of the National Western Stock Show. A event that has been successful for 115 years in the great city of Denver.'",
        "'speaker_3': 'I'm here in.'",
        "'speaker_2': 'Support of the new arena.'",
        "'speaker_3': 'And I'm here in support of the 1909 stadium arena, which we built in 1909.'",
        "'speaker_2': 'The new arena is the catalyst to the entire.'",
        "'speaker_3': 'Nation, a Western stock show development and the nation of Western Center development with projected numbers of more than 150 events a.'",
        "'speaker_2': 'Year at that arena. It's the centerpiece.'",
        "'speaker_3': 'That makes everything else work on this site. The National Western Center, once fully built out, is projected to generate.'",
        "'speaker_2': 'Economic impact of $230 million.'",
        "'speaker_3': 'A year and host a projected 310 events each year by passing this bond. Payback is immediate. The new arena is the most important building to the nation. A Western stock show.'",
        "'speaker_2': 'And our 29 rodeo.'",
        "'speaker_3': 'Performances. The successful business model for this 115 year old Colorado institution hangs in the balance as you cast your vote tonight. To support the community. The National Western Stock Show has voluntarily decided to implement the round up this January on all food, drink and ticket purchases on site over the 16 days of show.'",
        "'speaker_3': 'We continue to be a good neighbor to our friends in Globeville, Larry.'",
        "'speaker_2': 'Elyria and.'",
        "'speaker_3': 'Swansea. Please, complete with the voters in every district passed in 2015 ballot measure to see complete the master plan for the nation Western Center.'",
        "'speaker_2': 'And vote yes on the new arena and the 1909.'",
        "'speaker_3': 'Renovation here tonight.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Alma Urban. You.'",
        "'speaker_4': 'Hello. My name's Automotive Piano pronounced her and I am a resident of Swansea. Today I would only speak as representative of the Community Investment Fund Committee, a committee that has been organized to make sure funding is secure and distributed to the communities impacted by the National Western.'",
        "'speaker_4': 'I will be reading from a letter composed by the committee members and organizers from the three connecting neighborhoods. As residents of the Globeville, Elyria and Swansea neighborhood. We have been tasked as the Community Investment Fund Committee with negotiating a system for the receive, the funds and their distribution.'",
        "'speaker_4': 'To make it clear, as a Community Investment Fund Committee, we are aware of the impact the Arena mentioned in the plan will have in their efforts. We are also far more aware of the impact this type of development will have in our communities.'",
        "'speaker_10': 'The development of P3 will directly affect.'",
        "'speaker_4': 'The revenue of the CRF based on our current proposal, and I hope this makes our stance more impactful. We are accepting the consequences this takes to make sure our communities are respected. We are opposed to the international western arena, part of the Bonn phase three, and as a result it will be hard for us to support the'",
        "'speaker_4': 'ban as it stands in the midst of an ongoing and convoluted.'",
        "'speaker_10': 'Discussion about additional funding for the 10,000 seat.'",
        "'speaker_4': 'Arena. The community is being pulled to both sides when we should be at the center. City officials alleged the development of the National Western Center is the only way. Community needs and glitz can be addressed. They want us to believe encroachment and disruption is their only path to address housing issues.'",
        "'speaker_4': 'The lack of food outlets or other essential resources. The city of Denver has been content to acknowledge the issue, but has taken minimal steps to respond. Before we talk about a new arena, shouldn't we talk about housing? At what point do we become outraged and ashamed that our fellow residents are treated with such disrespect, with the conditions'",
        "'speaker_4': 'that exist in Swansea and Globeville be allowed to continue in neighborhoods located elsewhere? Sadly, we have had little financial value to the businesses and companies to invest in this area. That is until Denver ran out of land. So now our value is so-called unoccupied land.'",
        "'speaker_4': 'We now have transactional value for financial interests. However, this bond is not is an.'",
        "'speaker_10': 'Example of.'",
        "'speaker_4': 'Us asking the same system to repair the same issues they have cost. Our question is, do we not have this backwards? Should we not start by asking what is in the best interests of our communities? What do the residents need?'",
        "'speaker_4': 'How do we honor.'",
        "'speaker_10': 'The value of the people who have tolerated so much from neglect.'",
        "'speaker_9': 'Intrusion?'",
        "'speaker_4': 'Simply put, the community must come first. Therefore, we oppose Phase three development of the National Western Center until the city has first focused on resolving basic community issues and global variance once again. Myself and a few other members of the Community Investment Fund are available to answer any questions to your time.'",
        "'speaker_1': 'Thank you. Next step, we have EARNEST House.'",
        "'speaker_2': 'Well, make the argument the way. Madam President, members of council. My name is Ernest House Junior. I'm a member of the National Western Center Authority Board of Directors. I'm here to speak in favor of all of the go bond measures.'",
        "'speaker_2': 'This is the right time to invest in our economic recovery. In particular, I want to make a few comments of support of Bill number 221, dash 0924 that refers to the voters, a bond measure to fund improvements to the National Western Center campus.'",
        "'speaker_2': 'I understand this placement broken promises, and it voted my career in acknowledging that history. I'm an enrolled member of the new tribe and work as senior policy director at the Keystone Policy Center. I spent a lot of time working with communities and acknowledging that in the U.S., authorities must be diligent, diligent about working together with our neighbors'",
        "'speaker_2': '. The arena in 1909. Buildings are important to the campus. And if we honor our board adopted community benefits principles, we can ensure that these buildings support the authority operations and support the community. Our goal with these buildings and the entire campus is to create jobs and opportunity for our guests, neighbors and broader community.'",
        "'speaker_2': 'The 1909 market will be the center of opportunity for farmers and ranchers bringing their product to Denver. And with community input, we can create opportunities for our neighbors by providing space for makers to sell their products. The arena will bring more people to the campus, something that is critical to the success of the market.'",
        "'speaker_2': 'Both these buildings were increase funding to the Community Investment Fund. I sit on the Community Benefits Committee and while we have a long way to go, I'm confident that our relationship with all of the community entities will grow and we can all share in the success of this campus.'",
        "'speaker_2': 'We are excited that the Community Investment Fund Committee is coming together as a self-governing group that will decide how CRF revenues will be distributed. A partnership with Councilman Ortega and Councilwoman CdeBaca has made this possible. Thank you for helping get that process started.'",
        "'speaker_2': 'We look forward to working with you, our neighbors in Greece and the broader community to make this campus something special. The arena in 1909 are the next steps. And I ask you to support sending the ballot measure to the people.'",
        "'speaker_2': 'The. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Carol Briggs.'",
        "'speaker_9': 'Thank you, Counsel, for this opportunity to speak. I am a resident of Swansea.'",
        "'speaker_4': 'And I speak against.'",
        "'speaker_9': 'Including the.'",
        "'speaker_4': 'Any more money is going to.'",
        "'speaker_2': 'The national western.'",
        "'speaker_4': 'In the bond.'",
        "'speaker_9': 'The City process.'",
        "'speaker_4': 'The city development process provides for community comment.'",
        "'speaker_1': 'Possibly community benefits.'",
        "'speaker_9': 'Agreement and equity commitment. However, over and over again, the process fails. Denver Neighbors The CBA and equity, culture and equity commitments are drafted by the city with input from developers and then brought to the neighborhood for comment. The neighborhood heads are expected to accept the city planning with only superficial comment.'",
        "'speaker_9': 'This was confirmed by a city planning and development staff on a Zoom call in fall of 2020. A staff member told us it was the neighbors job to comment and his department's job to decide what will be done.'",
        "'speaker_9': 'This statement is part of a pattern of systemic white supremacy in the city's process. The neighborhood representation at the National Western CACC is a city packed community member with no voting power. When the neighborhood requested a grocery store, the National Western ranged for an urban market that does not meet the.'",
        "'speaker_4': 'Needs of the neighborhood.'",
        "'speaker_9': 'When the neighborhood requested affordable housing that keeps neighbors in their homes, or at least in the neighborhood, we are told that there is no plan for affordable housing. The housing will be elsewhere in the city.'",
        "'speaker_4': 'In other words, you can't stay here.'",
        "'speaker_9': 'There continues to be talk of how the national restroom provides career jobs for neighbors, even though nobody knows of anyone in 8 to 1 six.'",
        "'speaker_4': 'That has ever had a.'",
        "'speaker_9': 'Career job at the National West. It has not happened in decades, but continues to be talked as if it is a benefit for the surrounding neighborhood. What is playing out here is the white supremacist tactic.'",
        "'speaker_2': 'Of look at everything the city.'",
        "'speaker_9': 'Is offering these people and they.'",
        "'speaker_4': 'Are not grateful.'",
        "'speaker_9': 'There is no.'",
        "'speaker_1': 'Recognition that what is.'",
        "'speaker_9': 'Offered is not what is needed.'",
        "'speaker_2': 'Or requested by the.'",
        "'speaker_4': 'Neighborhoods.'",
        "'speaker_2': 'There can be.'",
        "'speaker_9': 'No true input from community, no agreement, no commitments that mean anything unless the community is an equal at the negotiating table. Neighborhoods know what their issues are. Neighborhoods have solutions. I join with my neighbors and other concerned groups asking the bond not include additional public funding for an inequitable redevelopment of the National Western.'",
        "'speaker_9': 'There are other ways to to economic recovery that meet neighborhood needs. Please take a step closer to true democracy by keeping public land.'",
        "'speaker_2': 'In.'",
        "'speaker_4': 'Public hands.'",
        "'speaker_9': 'And public money to help every resident of Denver.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker, we're going to move to the online virtual format. We have Jack FINLAW, Amy Berman, Marilyn Masterman, Jessie Perez and Kate Barton. And then we also would like to we understand they had a little bit of trouble getting in Silvia Hernandez if we see Silvia Hernandez in the queue.'",
        "'speaker_1': 'And so we're going to go ahead and go to Jack FINLAW.'",
        "'speaker_3': 'Good evening, Madam President. I hope you can hear and see me at this point.'",
        "'speaker_1': 'Yes.'",
        "'speaker_3': 'I had a switch to my iPhone thanks to a new laptop that wasn't working very well. It's great to be here tonight. I'm a resident of Denver, a long time resident of Denver. I live in the Congress Park neighborhood.'",
        "'speaker_3': 'I'm a former city official. I worked for Mayor Hickenlooper and I served as chief of staff to mayor of DOL. And it's good to see so many friends here on the council and in the audience tonight. I'm here to really just speak to the lack of funding for this central library project.'",
        "'speaker_3': 'Was very disappointed to see that that $90 million project, which is underway and could be completed with another $90 million, is not going to be part of this bond package. We've had a lot of very articulate, passionate comments tonight about equity and equity serving institutions.'",
        "'speaker_3': 'And the Denver Public Library is probably one of our preeminent equity institutions that provides services to all the people of Denver and beyond for free. It is one of our greatest institutions, and while we're appreciative of seeing some funding for some of our branch libraries, the central library is where is the center of the action.'",
        "'speaker_3': 'It's where everything flows from. And so I would just urge you, urge Brandon and the city officials to find money from the capital improvement budget or from some other source to finish that central library renovation while it's still ongoing.'",
        "'speaker_3': 'Because if we stop and just have to start again, it'll cost a lot more money. So please keep the Central Library project in your in your budgeting process in the months ahead. Thank you.'",
        "'speaker_1': 'Thank you. And a quick time check. We've got about 18 minutes left in the one hour courtesy, public hearing. And so if folks wouldn't mind if you are repeating information, we'd appreciate you just being a little bit more concise.'",
        "'speaker_1': 'Next up, we have Amy Brymer. Okay. It doesn't look like Amy Brenneman is in the queue. We're going to go ahead and move on to Marilyn Muster, man. All right. No, Marilyn. Next up, we have Jesse Paris.'",
        "'speaker_2': 'Yes. Good evening. Members of council, those watching at home. One of them is just a missing person presume for Black Star Blackstar and move for self defense of the Mexican man for social change as well as the Unity Party of Colorado and frontline black males.'",
        "'speaker_2': 'And I will be the next mayor Denver in 2023. I am against. This. Tonight's the bond package tonight, especially in regards to the arena. Hearing the compelling testimony from the coalition and the solidarity with. I have to. Definitely go against this.'",
        "'speaker_2': 'This is going to cause more so after displacement than what is already occurring in the area of Swansea and Globeville. The unintended consequences of this arena are just. Unsalvageable at this point. No one within a two, three mile radius of this arena is going to be able to survive the unintended consequences that are going to occur from'",
        "'speaker_2': 'having such a structure built. This is not what the community needs. These communities have been neglected for decades and they do not need a thousand person arena. That is the last thing they need. The need services within their individual neighborhoods.'",
        "'speaker_2': 'Any grocery stores. They need access to free, healthy food. What they do not need is an arena that's going to cause more displacement, and that's already occurring throughout this city. This is going to be an epicenter of epicenter of displacement and gentrification.'",
        "'speaker_2': 'If you go through with this tonight so you can make a stand tonight, city council and you can say, look, enough is enough of this. We don't need any more unintended consequences from on more growth, more development that is going to cause rapid gentrification and displacement of our black and brown communities.'",
        "'speaker_2': 'Someone has to take a stand against the mayor. This is not okay. These communities have made a collective effort for decades, and it appears that they're just going to continue to do this and pass this to me. So we would ax you in solidarity with this coalition.'",
        "'speaker_2': 'It would actually not pass us to me and allow. Don't bring this to the voters. We don't want to vote on this. This is not something that these communities need. Thank you.'",
        "'speaker_1': 'Thank you. Our last two speakers online for this set are Kate Barton and Stephen Bencic. And so we'll go to Kate Barton.'",
        "'speaker_4': 'In the evening.'",
        "'speaker_8': 'Members of council. Can you hear me?'",
        "'speaker_4': 'Yes.'",
        "'speaker_8': 'Hi. Thank you so much for having me this evening. My name is Kate Barton. I'm executive vice president at the Downtown Denver Partnership. We are excited about a number of projects listed in the in the proposed geo bonds, many of which we have worked on or advocated for with our members and stakeholders for years.'",
        "'speaker_8': 'The downtown Denver Partnership's work is driven by the 27 downtown area plan. This plan created a 20 year vision for downtown Denver that is ultimately enhanced by long term investments through efforts such as the general.'",
        "'speaker_4': 'Obligation bond issue. We believe in.'",
        "'speaker_8': 'Investing for our city for the long term and applaud Denver City Council and the city for leading this process to determine key projects that will impact Denver now and into the future. The partnership has a long history of supporting geo bonds, and we believe in the economic impacts delivered by a number of elements of the bond package'",
        "'speaker_8': ', including the National Western Housing, Mobility, Parks and Arts related projects. Several of the projects included in this bond issue support long term plans that were previously prioritized by the community. Others that address infrastructure needs will help to ensure that we are maintaining the current built environment and also building for the future.'",
        "'speaker_8': 'Recognizing that others have talked more about several projects listed in the bond package. We want to call out one of the projects that we've been deeply engaged in the 50 to 80 trail. The Downtown Denver Partnership has been leading the efforts to create the 50 to 80 Trail, a bold project that will transform how the public right'",
        "'speaker_8': 'of way is used in downtown Denver. For several years, the 50 to 80 will link neighborhoods and connect people by reimagining underutilized streets into the into the essential downtown experience uniting urban life with Denver's amazing Denver and Colorado's amazing outdoor culture.'",
        "'speaker_8': 'This Vision Visionary Project is shovel ready, with one section already underway on 21st Street and will create much needed public space in the heart of downtown. The Golden Triangle neighborhood has shown great enthusiasm about this project, and we believe that this connects to many key infrastructure and mobility projects, both in districts nine and ten.'",
        "'speaker_8': 'The 50 to 80 trail development proposed in the bond will not only create jobs and result in positive economic impact, but sets the stage for the future development of the to 80 trail throughout the center city, resulting in millions of dollars of economic impact.'",
        "'speaker_8': 'And we just provided we believe the 50 to 80 trail demonstrates a project that will help us build a city for today, thinking of the needs of tomorrow and we'll attract residents and visitors to our community. To reiterate, the downtown of our partnership is excited about many components of the proposed geo bond package, both city wide and'",
        "'speaker_8': 'downtown specific. We look forward to the great impacts that will happen as a result of these proposals, and we thank you for your consideration and leadership in making long term investments in our city.'",
        "'speaker_1': 'Thank you. Our next speaker online is Steven, Ben, Chick. And then the three folks that we're going to have in person in chambers after Steven speaks are Alfonso Espino, Brian Loma and Katie Blakey. So you can get ready or come up to the front pew here so we can get you up quicker.'",
        "'speaker_1': 'Go ahead, Steven, please.'",
        "'speaker_2': 'Although City Council, there are many things the city can do with $160 million. We can build streets where those walking or biking don't have to fear for their lives. We can build safe sidewalks in the 40% of the city that goes without them and maybe meet the city's self-imposed goal for miles of sidewalk constructed for the first'",
        "'speaker_2': 'time since we started measuring it. We can make improvements to transit along some of our big busiest corridors like Colfax and improve our air quality in the process. However, these things are not necessarily being considered by the city with this bond issue at the level that they deserve.'",
        "'speaker_2': 'The city is currently considering spending about $160 million on was effectively another Pepsi Center. This is the last thing we need right now in light of all of the issues I mentioned before, the city is not struggling for capacity for events between the Pepsi Center, Convention Center and Denver Coliseum, just to name a few.'",
        "'speaker_2': 'Its proposed arena would really do nothing but just line the pockets of a few politically connected individuals. There's a serious problem when this project's being given 160 million, whereas the critical infrastructure that I mentioned is being only given around 73 million.'",
        "'speaker_2': 'This money that this 160 million should be put into transportation bonds to give a state to have a safe streets, better transit options, and maybe finally, some sidewalks. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker in person is Alfonso Espino.'",
        "'speaker_2': 'Good evening, counsel. Thank you for having me. And it's also really nice to be in person for once. And I hope you're all well. I'm here to speak again, sending the bond proposal in relation to the National Western's proposed arena and public market to not send it to the voters.'",
        "'speaker_2': 'I think that the process, or better said, the lack of process to have arrived at this decision to rush through a bond process, not just for the arena, but several years before the accustomed to ten year period in which bond proposals happen is ridiculous and unfair, not only to the people who I am here in solidarity with'",
        "'speaker_2': ', because I understand that I do not speak for all the people in my own community. I do not speak for all of Denver, but who I do speak for, who I do stand in solidarity with, are those that have been historically marginalized.'",
        "'speaker_2': 'The people that are currently or have already been displaced. Especially in my community and this process. Or once again, lack of process that has been going on around the arena amounts to what I would view, and I think correctly so, as extortion.'",
        "'speaker_2': 'You have the people. That support the arena, always stating the health and the necessity for economically driving the success of the complex. So there's this diluted idea in this chamber right now that that amounts to the success of my community, that that amounts to representation of the people who I am standing in solidarity here with today.'",
        "'speaker_2': 'This extortion of we will give you everything that you've lacked for decades. Better set a century of existence. As some of the oldest neighborhoods in Denver. Only if you once again give up more concessions. Give it more, give it more.'",
        "'speaker_2': 'That's all I ever hear. That's all that's ever asked of us to do. And when we come down here and we beg of you to rethink this, not only for my neighbors, because I stand in solidarity with my unhoused neighbors who are sitting in the street right now.'",
        "'speaker_2': 'I'm standing in solidarity with the people across north Denver, east Denver, south Denver, who are also going through the same thing where these bond money, which is vital to the recovery. Should be going to instead. They're trying to push through an arena with a lack of process that will not address any of the problems that we are'",
        "'speaker_2': 'currently facing. We are not currently facing a lack of arenas in Denver. We have tons of them. What do we lack? Do I have to state them? I'm very sure that you all know exactly what's missing. I wish I could be up here today supporting this arena.'",
        "'speaker_2': 'I wish I could see it as something vital to my community. But as somebody who's been living in this area for all 25 years, right up the block from National Western, the only thing we ever got was parking where we used to charge people to park in our backyards.'",
        "'speaker_2': 'And now we don't even get that. Thank you.'",
        "'speaker_1': 'Thank you. That's your time. Thank you. Next up, we have Brian Lamar.'",
        "'speaker_3': 'Evening Council. I like this gentleman. Couple of important things he said. One of them is that we really don't have a lack of place to have events and. The bond issue. I was trying to figure out how this is going to get on the ballot.'",
        "'speaker_3': 'I've been out, as many of you heard earlier, for two months now, talking to Denver voters about what they want. And I've seen a lot of ballot measures and not once if I had anybody asked me if I would support tax dollars toward rebuilding the National Convention Center.'",
        "'speaker_3': 'So how are we going straight to the ballot with this with taxpayer dollars when, as we've heard time and time again. Illyria. Swansea is some of the strongest neighborhood community groups in the city of Denver. And I know because as Lisa Calderon's former field manager, they were the most active people working on getting out.'",
        "'speaker_3': 'Michael Hancock as well. Right. This is a far fetched idea that we need more places for more entertainment. We had 31 million people travel through Denver in 2018, 31 million statistic. And everybody's had plenty of places to go.'",
        "'speaker_3': 'There's not enough housing in the area. There's not enough housing anywhere. We just stopped a man from dying outside the outside this building tonight. We need housing. We need services for people to be off the streets. So when they come to Denver, people actually enjoy our community because it's pretty.'",
        "'speaker_3': 'And the houses are are for everybody and not the sidewalks for everybody. This is absolutely ridiculous that we're talking about millions of dollars for entertainment when people are dying in the streets daily. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Katie Blakey.'",
        "'speaker_11': 'Hello. It's nice to see you in person again. Um, my name is Katie Blaikie, and I live in District ten. I'm here to ask you to please vote no on 20 1-092 for the jazz community has not been meaningfully included in the process.'",
        "'speaker_11': 'They'll be impacted the most by this construction, but will receive the least benefit.'",
        "'speaker_1': 'Katie, I'm sorry to interrupt you, but if you could pull the mic down a little bit so we can hear you. Okay. Thank you.'",
        "'speaker_11': 'During the single meetings on this project, several of you asked some really good questions about the proposed ordinance. I really appreciate your attention to detail and thoroughness. In its feasibility study. The 1909 market success is contingent on the building of thousands of units and has not been zoned for that purpose.'",
        "'speaker_11': 'There's also no solid strategy for allocating funds to the community, and relying on a round up program is insufficient. With the city's lack of of through with 2017 bond and measure to sea funds, it's hard to believe that the money will reach them anyway.'",
        "'speaker_11': 'Another significant concern is the lack of overall vision for the arena. The details on it are sparse. The constitutes the majority of the bond allocation, knowing that this bond will not cover the full expenses expense of the project and that there's not even a projection of the cost of its completion.'",
        "'speaker_11': 'Putting this vanity project on the ballot means Denver taxpayers may be on the hook for hundreds of millions in additional costs. The jazz community has a cohesive vision for the site. Please vote no on this and consider investments into community led projects and neighborhoods that have been marginalized for too long and into truly affordable housing to combat'",
        "'speaker_11': 'our growing homelessness crisis. Thank you.'",
        "'speaker_1': 'Thank you. We're going to go ahead and transition back to online for a couple more speakers and then we'll be at our one hour courtesy public hearing time online. We're going to have Samantha Haviland, Harmonie Cummins, Lydia Pena and Theron Macleay.'",
        "'speaker_1': 'And so we'll go ahead and start with Samantha.'",
        "'speaker_8': 'Thank you. Good evening, honorable members of City Council. Thank you for the opportunity to speak this evening. My name is Samantha Havilland and the executive director of Career Development Student Supports for Denver Public Schools. And I'm here in support of a zero 9 to 4 to support the National Western complex.'",
        "'speaker_8': 'National Western has been an excellent partner, community partner with Denver Public Schools and has helped us to expand career exposure and opportunity for students in various fields.'",
        "'speaker_4': 'That they previously didn't know existed.'",
        "'speaker_8': 'And helped to identify areas and challenges within their communities. They also have been an excellent partner in helping us to address the affordability of college with providing scholarships and I think will.'",
        "'speaker_4': 'Continue to be.'",
        "'speaker_8': 'A great partner and a great opportunity for employment in high demand, high wage jobs within Denver for our students.'",
        "'speaker_4': 'So having said.'",
        "'speaker_8': 'That, I know we are short on time, so I will respect all of our peers and give that back to you.'",
        "'speaker_1': 'All right. Thank you. Okay. Our next speaker online is Harmony Cummins, and it looks like we don't have harmony with us. All right. We'll go ahead and go to Lydia here.'",
        "'speaker_3': 'Whoa.'",
        "'speaker_8': 'Can you hear me?'",
        "'speaker_1': 'Yes.'",
        "'speaker_4': 'Perfect.'",
        "'speaker_8': 'Okay. I am speaking.'",
        "'speaker_2': 'In.'",
        "'speaker_4': 'The Western Stock Show Arena. There's a lot of things that we need. And if I ask for bathrooms in our parks and I'm told we don't have the resources for these sort of things. I'm ask for our pools, our cooling centers, our city processes are on reduced hours or reduced services.'",
        "'speaker_4': 'From public comments, I was told that when I called in because we don't have the funding and that's how my years of savings civic center part ask about bathrooms, drinking fountains, solar panels so we don't have to have aerators on our food trucks.'",
        "'speaker_4': 'That's not something in our plan because we're making these things fountains. We spend a lot of money on things that we don't need.'",
        "'speaker_9': 'What about.'",
        "'speaker_4': 'Trash services? I asked the CASA office about trash services and everyone points to RTD or Dotti or someone else. Why don't we provide more trash services? Our city looks disgusting right now, and there's trash everywhere. And a recycling rate is terrible.'",
        "'speaker_4': 'What about housing? When I take my child to homeless sweeps and I had him talk to Evan Dreier and that's why we're sweeping the homeless when people are unhoused and poor and sick. And he tells me that this is a city connecting people to resources and it's working.'",
        "'speaker_4': 'I think we need to do a lot better than resources. An arena is definitely not. Let's see what else.'",
        "'speaker_8': 'Is an impasse and feels the pain of the earth. The last two weeks in Denver have been.'",
        "'speaker_4': 'Apocalyptically depressing $160 million. You want to know what? That's the same number as the task, the environmental task force recommendations for last year of what the city needs to address our climate goals. We need 200 million each year to a is going to provide 40 million and we're short 160 million.'",
        "'speaker_4': 'Why don't we take this $160 million and invest it in mass transit solar projects and have an equity lens on those things? Because you know what we all need instead of arena that only benefits a few and gentrify the neighborhood, we all need to be able to breathe the air here.'",
        "'speaker_4': 'Do you want to breathe? I want to be able to breathe and. Yeah. I don't know what this is about. I don't know if this is because our mayor wants to leave a legacy, but I don't want to be a part of that rodeo, and I don't think any of us should have to be.'",
        "'speaker_4': 'I spent a lot of time in the genius neighborhoods.'",
        "'speaker_9': 'And decades.'",
        "'speaker_4': 'After decades, it's one of the most poor.'",
        "'speaker_8': 'Polluted, and people are afraid of losing.'",
        "'speaker_4': 'Their homes. We need real housing solutions so people don't have to live in this fear. We need true jobs, not arena jobs. We need air to breathe. We need bathrooms in our city. We need trash services. There's a difference between needs and wants from a lot of people in this call.'",
        "'speaker_4': 'Who wants another arena.'",
        "'speaker_9': 'That benefits just the.'",
        "'speaker_4': 'Wealthy? Who can participate in it while also cause is more concrete and takes away from the things that we actually need here? Please do not support.'",
        "'speaker_9': 'This to go to the ballot.'",
        "'speaker_1': 'Thank you. And just to clarify for folks that was there on Macleay and our last.'",
        "'speaker_8': 'Harmony.'",
        "'speaker_1': 'Cummings Oh, well, when it's had that she was talking, it was there and meekly. But okay. Harmony Cummings, our last speaker this evening will be Lydia Pena.'",
        "'speaker_9': 'Lydia Pena, a sister of Loreto. And our graduate of Loreto Heights College. Years after graduation, I returned to teach the history of art that I did for 23 years. The made May biography theater for the Performing Arts was thriving during the years that I taught there.'",
        "'speaker_9': 'The theater is in a part of the city that benefited southwest Denver residents, as well as other areas of our great city. For many years, during the months monthly meetings that Westside Partnership has held for over two years, residents from all areas of the city were there in support of the theater.'",
        "'speaker_9': 'As a Latina who values diversity and inclusivity, I thank you all for the work that has gone into getting the Loreto Heights Theater on the Bond list. A bond that I wholeheartedly support because it will enrich many lives.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_1': 'Thank you. And I'd like to thank the folks that signed up and both online and in chambers to speak. And that is we went a little bit over our one hour courtesy. And so we are going to go ahead and now ask for questions from members of Council on council bills.'",
        "'speaker_1': '864865866867924 and 868. And a reminder, this is your opportunity to ask questions. Once we closed the public hearing, we're going to go ahead and make comments and vote on on all of them separately. But we're doing questions within the hearing here.'",
        "'speaker_1': 'And so, first up, we've got Councilmember Cashman.'",
        "'speaker_6': 'Thank you, Madam President. I think this is for Brendan is. Well, you can pass it off if it's better for someone else. So I'm trying to understand why we're doing a bond issue at all now. So as we all know, we had Elevate Denver in 2017.'",
        "'speaker_6': 'And Emily Schneider was kind enough to get me some information out of the 484 projects that were part of Elevate Denver 268, or in the earliest phase of her project Life Cycle, the development phase 109 are either in design or construction, and 107 are complete.'",
        "'speaker_6': 'Of the 937 million passed as part of that bond issue. We've only spent 270 million, which leaves another 667 million to be spent. So it seems like we've got an awful lot in the pipeline to jumpstart the economy and at a time where it's tough to get people to do work.'",
        "'speaker_6': 'So I'm trying to trying to understand that. I mean, if you look through the list of projects, there's a lot of great projects in the rise. Denver Bond. But I'm just trying to figure out why we're doing a bond issue now.'",
        "'speaker_2': 'Sure. And Councilman Brennan Hanlon, the city's chief financial officer. So I'm going to have Laura Perry come up and talk about the status of Elevate. I think what we're trying to do here is lean into the Elevate strategy.'",
        "'speaker_2': 'So one of the things that we did in the 2021 budget was actually invest more funds and accelerate the Elevate Denver Bond program and went with a larger allocation from the market at the end of 2020. So this would be this issuance with rise would be paired with that paired with the remaining balance, which you're going to'",
        "'speaker_2': 'have Laura talk about. I think we have some conflicting numbers in terms of what the spend down is to date, but the goal is still to invest in capital like we have done during the Great Recession. That's a strategy that is that has benefited us in the past and continue to invest in our infrastructure, in our construction'",
        "'speaker_2': 'industry. One of the things that I mentioned was that the construction industry here in the Denver metro region was the fifth most impacted in the nation. So we're leaning into that industry and recovery around that industry. But let me bring up Laura to talk about a little bit of the status of where we are with with Elevate'",
        "'speaker_2': 'relative to the numbers that you just shared.'",
        "'speaker_6': 'Yeah. And the numbers I got came from Emily on the 13th of this month.'",
        "'speaker_4': 'Good evening. Members of City Council Laura Perry, Director of Capital Planning and Programing with the Department of Finance. So as Councilman Cashman stated to date, about 107 projects as of July have been completed and the Elevate Denver Bond program, and there's about.'",
        "'speaker_8': '50 projects.'",
        "'speaker_4': 'In the design stage and 59 projects in the construction phase. Many of our projects that are coming up are entering into the construction phase and are fairly large in nature. So the timeline to complete them is a little bit longer.'",
        "'speaker_4': 'And so we're anticipating construction on many to start soon as of all the 484 projects that have been started. There's about 268 in the earliest phase of the project lifecycle and 216 in either design construction or complete. So that's a summation of the numbers that I just gave you.'",
        "'speaker_4': 'On the financial side, as of July, we have spent $269 million, although $937 million authorized for the program. So that's roughly about 31% of the dollars. And to date, 94% of the projects are on schedule. And overall projects have remained on budget, with only 10% of the total programs purpose contingency being allocated to projects to date in'",
        "'speaker_4': 'terms of long term benefits of the bond in tandem with Elevate Denver. This prize bond approved by voters in 2021, will provide for a.'",
        "'speaker_8': 'Longer, more sustained job.'",
        "'speaker_4': 'Duration as it will be completed in tandem with Elevate Denver. In addition, it will deliver some enhanced delivery efficiencies for some projects, such as ADA projects. As a reminder, the city has a mandate from the Department of Justice that we need to reach, and certainly this bond will help us achieve the funding we need to address that'",
        "'speaker_4': 'mandate in a timely fashion. That's the other question.'",
        "'speaker_6': 'Last my my other question. Trying to understand the answer I got when I asked with all these projects left to do from Elevate. Now we're adding, I believe if all these were to pass 80 projects to that and try to understand so the some of the other elevate projects get pushed out even further then than they are'",
        "'speaker_6': 'now. The answer I was given is that now happen in parallel. And the only information I got that gives me a hint on how projects would be timed is that the arena, if it were to be approved design and construction early next year and completion in 25.'",
        "'speaker_6': 'So it's it's just it's hard for me to understand how we then take 200 million or I guess 160, because I don't think the answer included the nine or nine building. But how we then take another 160 million in construction dollars, get that done in that time frame and not bump other projects.'",
        "'speaker_6': 'So is there any one can.'",
        "'speaker_9': 'Adam, do you want to try to address delivery and.'",
        "'speaker_4': 'Optimization of contracts?'",
        "'speaker_2': 'Good evening, council Adam Pitts with the Department of Transportation and Infrastructure. Councilman, it's a good question. We want to make sure that when we resource our projects, we resource them so that we can continue to deliver them on schedule and on budget.'",
        "'speaker_2': 'When you look at the diversity of projects, the project count is just over 400 for Elevate the project count and this new bond package is just shy of 100, if I'm correct. It is with when you look at each individual segment like the Elevate Numbers and we've staggered our staff and we've resourced up appropriately to be able'",
        "'speaker_2': 'to do this. Part of the economic recovery is not just the implementation of the construction, but it's the design sector, it's professional services, it's program management, it's project management. And so when you see the layering of these bond issuances, it allows us to impact industries across the board, not just in construction.'",
        "'speaker_6': 'Okay. Those are my questions. I'll comment later on. Thank you for the answer. Thank you, Madam President.'",
        "'speaker_1': 'All right. Thank you, Councilman Cashman. Next up, we have council members say to Baker.'",
        "'speaker_4': 'Thank you. I have several questions. First, can somebody familiar with the framework agreement tell me what the timeline is in the framework agreement to figure out the funding for the arena? I believe it's page 35.'",
        "'speaker_2': 'I'm going to ask Jen Wellborn to come up. Thank you.'",
        "'speaker_4': 'I brought it counsel to Orson. I can flip right to it. 35. I'm John, and I'm with the city attorney's office. And the answer is that the. The city committed to. Moving conversation forward with how to finalize the master plan that was adopted by City Council in 20.'",
        "'speaker_4': '16. I'm going to say that wrong. And so we have an obligation in the framework agreement the city does to make attempts to complete the master plan. And that is the unfunded part was the phases three through eight.'",
        "'speaker_4': 'So that. The city is supposed to do that. There's not really a timeline on it except that what it says is that the partners can, if the city fails to accomplish that by 2027, that the partners, then CSU, the Authority and the stock show can bring forward a plan that is both financially and sound and construct able'",
        "'speaker_4': 'to the city. And then the city, pursuant to the framework agreement, is required to evaluate that plan and if it is feasible and construct able to make the land available for the construction of those facilities that are in the master plan phases three through eight.'",
        "'speaker_4': 'Got it. So in that sense, in short, we have until 2027 to figure out a plan for this, for the arenas. At least until then. Yes. Got it. In the feasibility study that was mentioned several times this evening.'",
        "'speaker_4': 'I don't know who else might be able to answer this question, but it does mention that 10,000 homes minimum would need to be created in order for the arenas to be successful in the market. To be successful. Can somebody speak to why we're choosing to operate in this order and put the arenas before the residences?'",
        "'speaker_4': 'I can't speak to the feasibility the feasibility study, but I will say that the master plan doesn't have any private development in it. And so the opportunity is for us to locate the, the phases three through eight facilities and see if there is land available.'",
        "'speaker_4': 'We expect that there is. But I think to to get to your order question without sorry, really addressing the feasibility study because I don't I'm not familiar with it. The order of these things is really because the the cultural facilities that that are created in the masterplan include this arena and the expo hall and the refurbishment in'",
        "'speaker_4': 'the 1909 building. And, and if there is to be additional land available or land of excuse me, land available, it would be after those phases are built. And that's I mean, that's just because the way the master plan works, I think.'",
        "'speaker_4': 'So along those lines, how much land was acquired from private owners. Before we pulled together all of our parcels for National Western. There's a total of. I'm sorry.'",
        "'speaker_2': 'Sure. Good evening. Council members Brad Dodson. I'm the deputy director for the mayor's office of the National Western Center. So, Councilman CdeBaca, thank you. Your question was, how many acres were acquired as part of the campus?'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'So the total campus boundaries is 250 acres. Now, that includes land the city already owned within the Coliseum area. It also includes land that was given by the Western Stock Association, as well as a private land that was acquired.'",
        "'speaker_2': 'I don't have the specific acreage of what that private land is.'",
        "'speaker_4': 'But overall, 250.'",
        "'speaker_2': 'The entire campus boundaries or 250.'",
        "'speaker_4': 'Acres of public land. So how much of the land in the triangle was going to be traded in the P3 to the private developers in exchange for the arena renovations?'",
        "'speaker_2': 'So I can defer to someone else on the details of that procurement. But the area that was commonly referred to as the triangle is roughly 60 acres.'",
        "'speaker_4': 'So we were going to give 60 acres away, essentially in exchange for the developers who received it to renovate or construct these arenas.'",
        "'speaker_2': 'That was the total area that was contemplated. So that included both public assets, private assets, infrastructure, open space, etc..'",
        "'speaker_4': 'Got it. And so is there. So given that it's public land and we're proposing to publicly finance the arena, renovation and construction, is there a plan to.'",
        "'speaker_8': 'Return that acquired.'",
        "'speaker_4': 'Land back to the public in some form, like the community land trust or something like that? I think your question is, is there a plan for what to do with the land after the public facilities are built? Correct.'",
        "'speaker_4': 'What? They acquired a lot of land. Yeah. I just want out here. I didn't necessarily need it. So within the proposed P-3 that was publicly available, we did have a plan that was it was, you know, you're going to do X amount of affordable housing.'",
        "'speaker_4': 'And and we had seen a little bit about what those teams were going to respond with in terms of what they were going to do with private land. And since we're not doing that, that was one of the advantages, frankly, of doing it all together, was that it all sort of moved at the same at the same'",
        "'speaker_4': 'time and at the same pace with with not doing a three. What we're doing is the first step, which is building in the public facilities so that we know what we have, because that's the completion of the master plan.'",
        "'speaker_4': 'But we know there isn't. So we, we haven't gotten there because it's now we're doing it sort of in a linear, sequential fashion instead of all in a. But we can't make those public facilities successful without the housing that was required in the feasibility study.'",
        "'speaker_4': 'So my question related to the plan was what was the overall cost associated with the plan for the triangle when we had the whole package together? Well, that that included that included the Expo Hall and include I mean, housing, all of that whole bunch of stuff.'",
        "'speaker_4': 'What was that cost going to be? Well, we we would not have made that public because it was I mean, we wouldn't have made any estimates that we had public because it was on the street. So I don't know that I have a number, but now it we certainly didn't have that.'",
        "'speaker_4': 'I don't know if we have an estimate that. So we made a plan and we could.'",
        "'speaker_8': 'And it's not.'",
        "'speaker_4': 'On the street for a contract. I just don't know. I don't I don't know that we have one. Can anyone share the number? I don't know that we.'",
        "'speaker_2': 'That was not a number that we made public. We had internal estimates and then essentially protected those. As we went through the negotiation process, we would have to follow up on what the details of those numbers were. I just want to clarify one thing, though, in terms of the mechanics of the 60 acres.'",
        "'speaker_2': 'That wasn't a one for one transaction that was being that was being dealt with. I think what Jen was trying to say is that the whole campus had a transaction that brought multiple public assets and that put in play certain areas of real estate at the same time, along with other community benefits that were defined in that'",
        "'speaker_2': 'procurement at the time. So it wasn't just a parcel that was dedicated to an individual asset.'",
        "'speaker_4': 'The issue here is that where we have somehow arbitrarily prioritized the arenas in that plan that we say we had for the triangle. And so what I'm curious about is if we understand that in order for this plan to be successful in the arena, to be successful and we're throwing out big numbers to the taxpayers to fund'",
        "'speaker_4': 'why didn't we ask them to fund the whole cost of the triangle to make sure that the community's priorities on the housing side were paid for as well?'",
        "'speaker_2': 'So I don't think that the that the strategy of of advancing the arena versus the reason that that asset was was selected was because it is that economic engine that Mr. Andrews had testified about. So it had the best return on investment.'",
        "'speaker_2': 'It provided the most activation for the campus as a whole. I don't think that the balance of the conversation around other community investment opportunities is precluded by starting with this one asset. I think what Jen was mentioning was that this is going to be a more prolonged process.'",
        "'speaker_2': 'Now that won't just end with this one asset. We're still required to fulfill the master vision for the campus as part of the framework agreement.'",
        "'speaker_4': 'So two.'",
        "'speaker_8': 'Questions.'",
        "'speaker_4': 'On that. What is the potential for you all to take into.'",
        "'speaker_8': 'Consideration what you've heard.'",
        "'speaker_4': 'From the community tonight and get that non-negotiable commitment to the community and investment funds request? Before this gets to us for second reading.'",
        "'speaker_2': 'So we heard a few things tonight, the you conditions, if you will, around support for the program. I'm going to actually ask Laura Perry to come up. We we received the list. I think we have some responses on some of the projects that were identified on there.'",
        "'speaker_2': 'We don't have answers for all of them yet, but we have we have the answers for some of them. And I want to just be sensitive to my role here in the city CFO. But the authority is the custodian of the Community Investment Fund in that process.'",
        "'speaker_2': 'So I might ask Brad Buchanan to talk about what the next steps are around the Community Investment Fund and commitments made through that process. So I think, Laura, if you could talk first about those first asks and then Brad Buchanan could come up thereafter.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_4': 'So there are.'",
        "'speaker_8': 'Several infrastructure.'",
        "'speaker_4': 'Assets that had been made, including sidewalk improvements. And currently there is $70 million included in the Elevate Denver Bond, which is currently moving forward and making progress. There were several traffic calming infrastructure.'",
        "'speaker_8': 'Improvements on Lincoln Street.'",
        "'speaker_4': 'And 51st. The bike lane from North Lincoln to Washington Street is an active project and includes some traffic calming, which is funded via Skype and we are still confirming a couple of the other traffic calming projects requested. The replacement of LED water sewer lines.'",
        "'speaker_4': 'That is not something that is handled by the city. But certainly we can have conversations with Denver water regarding those assets. And the Washington Street Reconstruction Project is currently under the funding from the Elevate Denver Bond Program. Can I save you some time yet?'",
        "'speaker_4': 'That list. I'm not talking about projects that are already in place. I'm talking about the impact fee that the Community Investment Fund group is requesting a commitment on prior to this going to the floor. Thank you for that.'",
        "'speaker_8': 'Yeah.'",
        "'speaker_4': 'Sorry, I can come and speak to that. So many moving parts. I don't know who to call. So thank you.'",
        "'speaker_2': 'Thank you. Members of Council Brad Buchanan, CEO of National Western Center Authority. So the Community Investment Fund process, it it was, as I said in.'",
        "'speaker_3': 'Committee a few weeks ago, it was embedded in the P3 process. When the P3 process was halted in January.'",
        "'speaker_2': 'We started working on and actually with with you Councilwoman.'",
        "'speaker_3': 'CdeBaca and Councilman Ortega in the.'",
        "'speaker_2': 'Formation of a community investment fund committee, which you seeded in and they began meeting.'",
        "'speaker_3': 'In.'",
        "'speaker_0': 'In April. That is the beginning of the process.'",
        "'speaker_2': 'It is not the end of the process. The the next steps for the community investment fund process. And I, I don't I don't know how we could commit to it, to providing an answer to what I think will be a.'",
        "'speaker_3': 'Much longer process in the next week around the Community Investment Fund.'",
        "'speaker_2': 'To me, the next step in the process is that we're going to one need to stand up a fiscal agent to receive those campus investment fund revenue streams.'",
        "'speaker_4': 'Denver Foundation is ready to go.'",
        "'speaker_2': 'Yep, it's great. That's great. And and then secondly, our community benefits committee.'",
        "'speaker_3': 'Chaired by Lucia Guzman, who's here tonight.'",
        "'speaker_2': 'And Ernst House, who spoke earlier.'",
        "'speaker_3': 'Is sits on that committee as well, working with myself and our chair, John Iker.'",
        "'speaker_2': 'And in talking with you council members as well. I've identified clearly that technical assistance advocacy for the communities is an important step so that they can have the resources they need.'",
        "'speaker_3': 'To.'",
        "'speaker_2': 'Be.'",
        "'speaker_3': 'Expert.'",
        "'speaker_2': 'Negotiators and to be able to identify best practices nationwide. And so we have been in conversations with the city and with the Department of Finance have had very favorable conversations. And we're going to be requesting $400,000 to be transferred to the authority, to then be transferred to the Community Investment Fund Committee so that they can go through'",
        "'speaker_2': 'the process of procuring and selecting a technical assistance expertize so that they can then formulate those their their their requests, their desires. They are the experts.'",
        "'speaker_4': 'Proposal on the table.'",
        "'speaker_8': 'Right now, because.'",
        "'speaker_4': 'What I'm hearing is what I heard in 2016 and.'",
        "'speaker_8': '2017 and 2018 and 2019 and.'",
        "'speaker_4': '2020, the community benefits agreement was baked into an MCU that happened many years ago, and the CRF was baked into the framework agreement, which was approved in 2016. And so we're in 2021 having the same conversation. We didn't invest in the community up until now.'",
        "'speaker_4': 'And so the community, from my understanding, has put a proposal.'",
        "'speaker_8': 'On your.'",
        "'speaker_4': 'Desk for the frame, for the authority asking for an impact fee, not a round up. Impact fee in addition to the roundup. What is the position of the authority on the impact fee?'",
        "'speaker_2': 'The position is that we've heard from two neighborhood organizations that have brought us ideas. We have asked that those be folded into the community investment fund process and considered with all of the community input that will be.'",
        "'speaker_3': 'Involved in that process.'",
        "'speaker_4': 'But we have no decision on the impact fee.'",
        "'speaker_2': 'Not at this time.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_4': 'Can you speak to the ask?'",
        "'speaker_8': 'Have you.'",
        "'speaker_4': 'Guys done.'",
        "'speaker_8': 'Any kind of analysis or study on the impact of your public.'",
        "'speaker_4': 'Investment on the surrounding community? Maybe you.'",
        "'speaker_8': 'Guys, maybe.'",
        "'speaker_4': 'The city, anybody?'",
        "'speaker_3': 'I don't know, however.'",
        "'speaker_2': 'I might have to have NewCo come up and talk about the kind of neighborhood assessments that go into installing a project on the campus. Is that take us or Brad Dotson?'",
        "'speaker_8': 'And I bring this up.'",
        "'speaker_4': 'Because I didn't realize until public testimony how old the data was from our feasibility studies. A lot has changed, including the addition of Mission Ballroom and some other venues. So I'm wondering impact on community. Has that been studied and the feasibility of these venues?'",
        "'speaker_4': 'Have we studied it now that there are new venues?'",
        "'speaker_2': 'Good evening. Council members take us hallways like a director of the Mayor's Office of the National Western Center. I'm not sure that the feasibility, the intent of it was to study the impacts to the adjacent community, because the demand for those type of facilities as the campus builds out and also the convention center, I do know that'",
        "'speaker_2': 'there's others here that can speak to a little bit more of a feasibility study in itself. I think what you're hearing and seeing from us, though, is while that wasn't studied, we do want to continue to work through the true terms of community benefits, whether that's the lower case, community benefits and the return on investment that can'",
        "'speaker_2': 'come directly to the community through the Combined Investment Fund, the Community Benefits Committee. But also, as we continue to move forward, how do we continue to develop the land in a in an approach that is balanced with the community desires and needs and commitments, but also balance with the economic return that's needed for the economic development to'",
        "'speaker_2': 'support continue to support the operations of the campus. But also, like I said, the community needs as well.'",
        "'speaker_8': 'So how was that.'",
        "'speaker_4': 'Done prior to advancing this proposal? How did we how did we work directly with the community to balance the needs and priorities in this specific proposal?'",
        "'speaker_2': 'So I think to two fold. First of all, the requests that came out from the city was for projects to submit that are part of jobs and recovery for the city. So knowing that the campus, again, plans, neighborhood plans, 2013, the actual campus plan itself, 2015, identified these as public assets is part of the comprehensive approach to'",
        "'speaker_2': 'the campus itself. Again, can have a disagreement on the level of community engagement and who was involved. But over 500 meetings have been pencil to date with community members to talk about this again. So when the city asks for projects that can help support economic, short term and long term recovery for the city, the arena is one'",
        "'speaker_2': 'of the most economic stimulative projects that we have on the campus. And so we wanted to bring that forward for this discussion. Again, I think that the way that it sounds is it's more about an OR and what we're saying is it should be in and jobs and housing.'",
        "'speaker_2': 'There is a linkage, obviously, between the two. We know that the public asset with the arena can help us do economically. And what could we do for the campus as we figure out what the return on investment is for the community through Community Investment Fund and other things.'",
        "'speaker_2': 'But the land development process, which we speak about in the P three, of course, we don't have that mechanism anymore. And we want to be able to bring forward what a land development process is, while yes, addressing the community needs and commitments as well as jobs, housing, community oriented, retail, community supportive related items.'",
        "'speaker_8': 'My final.'",
        "'speaker_4': 'Question was there a single GSE resident that supported.'",
        "'speaker_8': 'This initiative tonight.'",
        "'speaker_4': 'Without conditions?'",
        "'speaker_2': 'So we can say that we have presented this material through the Community Advisory Committee, understanding we have a difference of opinion on that group with initial support for moving forward again with the campus and the arena in 1909.'",
        "'speaker_2': 'And so we do believe that there are individuals and community members who support this approach.'",
        "'speaker_4': 'And correct me if I'm wrong, the Community Advisory Council, led by National Western, is facilitated by CRL, who was also the registered agent on the negative mailer.'",
        "'speaker_2': 'I'm not sure about the mailer. Carol does help facilitate the conversation with the campaign advisor.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_8': 'That's it for my questions.'",
        "'speaker_1': 'All right. Thank you. Councilmember CdeBaca and the City and National Restaurant Authority folks that answered. Up next, we have Councilmember.'",
        "'speaker_9': 'Black.'",
        "'speaker_4': 'Coming up a a.'",
        "'speaker_2': 'Week.'",
        "'speaker_1': 'You need to honor our rules of decorum. We ask that you take a seat. We ask that you take a seat. Yeah, go ahead, Councilmember Black.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_8': 'A lot of the questions I wanted to ask were already asked, but I just wanted to clarify a few things. Based on some things that some of the speakers said.'",
        "'speaker_4': 'So I'm sure.'",
        "'speaker_8': 'Any one of you can.'",
        "'speaker_4': 'Speak to the master plan.'",
        "'speaker_8': 'It is from 2015. It was from March of 2015.'",
        "'speaker_4': 'I think.'",
        "'speaker_8': 'There's only a few council members up here tonight who.'",
        "'speaker_4': 'Who voted on that. But a number a few of the speakers said that the discussion about the arena in the 1909 building were rushed. And so.'",
        "'speaker_8': 'I any of you in the front row, you.'",
        "'speaker_4': 'Want to comment on what is.'",
        "'speaker_8': 'In the master plan specifically from March of 2015.'",
        "'speaker_4': 'Related to the arena in the 1909 building?'",
        "'speaker_2': 'So the planning process, I'm familiar with the planning processes. I was Executive Director at CPD when those plans were.'",
        "'speaker_9': 'Can you speak up, Bret?'",
        "'speaker_2': 'I was executive director of CPD when those plans were created, but the Globeville Neighborhood Plan.'",
        "'speaker_3': 'As well as the National Western Center Master Plan.'",
        "'speaker_2': 'And they did have the arena and 99 marketplace in the public market.'",
        "'speaker_0': 'As well as the.'",
        "'speaker_2': 'Expo Hall on the east side of the tracks.'",
        "'speaker_4': 'Great. Thank you. So it wasn't something that was just conjured up this year?'",
        "'speaker_2': 'No.'",
        "'speaker_4': 'Right. Okay. And then.'",
        "'speaker_8': 'Jen, you are our legal.'",
        "'speaker_4': 'Expert, and I know you worked really hard on that framework plan.'",
        "'speaker_8': 'But it was really helpful for me to hear you explain it as being linear instead of doing it all at once. And I know there's a great community desire.'",
        "'speaker_4': 'For housing on the triangle, but what I heard you say is that none of that is possible until the public facilities are built. And so once those are in place and we know where they're going, then you can start contemplating.'",
        "'speaker_4': 'Other things to do with the land, including many of the things that the community members are asking for. Thank you. I think you just said that much more clearly than I did before. Okay. Well, all right. That's all I have.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_1': 'All right. Thank you. Councilmember Black. Councilmember Sandoval.'",
        "'speaker_8': 'Thank you, Madam President. Brendan, I think this is for you. So I was doing some research, and I was trying to figure out, has Denver ever done a geo bond on land we own, but then we give to a third party entity?'",
        "'speaker_8': 'So I was looking at the 1989 when I was looking at the 2007 and I was looking at the 2017. And just to give context to my question, I know that we find for, let's say, the museum, but the museum owns that land we own.'",
        "'speaker_8': 'We bond for other cultural facilities, but they usually own the land. I see someone shaking your head. So have we ever bonded where we own the land, the taxpayers? We would build the project, but then we give it to a third party entity to run, not the city and county of Denver like arts and venues.'",
        "'speaker_2': 'Councilwoman I'm now stretching my memory like my mind automatically goes to our cultural institutions, but we retain the ownership of those assets. Laura. Laura, come on up.'",
        "'speaker_4': 'So there is one entity that the city consistently has included in our general obligation bond programs, and that's the Denver Health and Hospital Authority. They are a governmental entity under state statute, so therefore we are able to issue general obligation bonds for their benefit in constructing public health facilities that will benefit the county, city and county of'",
        "'speaker_4': 'Denver.'",
        "'speaker_8': 'And do we own the land? So in the national waste, we own the land right for the arena. And the 1909 building. Does the city and county of Denver own the land where the Denver health is?'",
        "'speaker_4': 'To my knowledge, we do not. But I can triple confirm that that's.'",
        "'speaker_8': 'That's what I keep thinking about. Where have we where the city and county of Denver own the land and then we bond to build the project. And then we turn it over to a third party entity.'",
        "'speaker_9': 'Those were city assets initially.'",
        "'speaker_4': 'Yep. The cultural, as Brendan referenced, other cultural institutions, the city owned land building for those entities, and they also participate in our joint obligation bond programs where we finance improvements for those campuses, for those facilities.'",
        "'speaker_8': 'So the Denver Art Museum, the city and county of Denver owns the land.'",
        "'speaker_4': 'I think the assets may be. Let's. Yes. Yes. I think that, John, we're in with the city attorney's office. The city the examples I would use are the Denver Museum of Nature and Science. The Denver Botanic Gardens and the Denver Zoo are, I think, the most clearcut examples of that, where the city owns the land underneath those'",
        "'speaker_4': 'facilities, owns the facilities, owns the collections, and the nonprofits actually have contracts with the city to manage those facilities.'",
        "'speaker_8': 'So that said, the Botanic Gardens, the the ones you just named are non-profits, correct?'",
        "'speaker_4': 'The operators are nonprofits.'",
        "'speaker_8': 'Is the National Western Center who we would give the 1909 arena to or the 1909 building and the Arena. Are they a nonprofit?'",
        "'speaker_4': 'Well, we're talking about, I think what we're not talking about giving them the building. We're talking about letting them operate the building. And the National Western Center Authority is a nonprofit. Yes, it is a nonprofit. Okay.'",
        "'speaker_8': 'Thank you. Thank you, Madam President.'",
        "'speaker_1': 'All right. Thank you. Councilmember Sandoval, Councilmember, can each.'",
        "'speaker_4': 'Thank you, Madam President. My first question is we have some conversation in committee, I believe, about the library and the central library. And at that point, the only explanation of how it might be funded was maybe the CFP.'",
        "'speaker_4': 'We discussed the fact that the IP generally would be the entire amount for an entire year. So my first question is, has Finance had any further conversation with the library commission or, you know, the head librarian about funding that project since your last conversation to committee?'",
        "'speaker_4': 'So we do have a meeting scheduled coming up to further discuss that. And so it's important to note within the Central Branch Library project, there are individual scope components that have independent utility that can be funded through CIP.'",
        "'speaker_4': 'Certainly the full 18 million, as you mentioned, would comprise an entire year discretionary funding for. But those elements could be funded over multiple years to achieve the same outcome. Have you calculated the cost escalation of demobilizing and recontracting for those in phases versus utilizing the mobilized.'",
        "'speaker_2': 'Construction.'",
        "'speaker_4': 'Contracts that are already in place? We have not to date. Okay. Would you acknowledge that there will be a cost increase from separating out scopes rather than completing as a complete scope? Certainly there is there's always additional costs of mobilization, certainly escalation as time goes on and projects continue to progress forward.'",
        "'speaker_4': 'But certainly utilizing and optimizing existing contracts could mitigate some of that risk. And can I just ask a you know, this is it. I know there was a long list, but is there any other project that was already mobilized and had already approved plans that was passed up in this economic stimulus?'",
        "'speaker_4': 'Get people back to work as soon as possible. But. I wanted to get back to you on that to take a look. Yeah, I realize that's a tough one. I have a question that might be either for is maybe Brad, maybe Josh lately I see who's here.'",
        "'speaker_4': 'But Jen Wellborn answered some questions for my colleagues about that. You would have to do the public facilities first, and only then later would you figure out the private development. That's really not my understanding of what the P3 would have done.'",
        "'speaker_4': 'It would have programed both simultaneously and so I just want to have someone who was involved with the P3 solicitation just, you know, not to put you not to have you disagreeing with your colleagues. But I think it's an important question about whether it was going to be build a public facility and then figure out the private'",
        "'speaker_4': 'or really whether and how interrelated the two are and why they are. That this has been a theme and I have a few more questions on it. But would someone who was familiar with that RFP want to speak to that, please?'",
        "'speaker_4': 'No, no. I want you to follow up, but I just want to maybe correct the record because that if I said that, I apologize. That's obviously not true. What I was saying was that the P-3 actually did do everything together and that what we're doing now is considering because we were able to locate the public facilities at'",
        "'speaker_4': 'the same time. I'm not saying we can't do that now. It's just going to be in multiple stages. And so we need we need to know we at least need to know where the arena is going to go, for example, before we can say that there's land available for some other purpose, because the the framework agreement calls'",
        "'speaker_4': 'for us to finish the master plan. So I apologize if I was unclear.'",
        "'speaker_2': 'Did. So I don't want to belabor that. Sorry, Josh. Lately, chief projects officer for the Mayor's office. If that answer your question. But I think the quick of it is the P three. The concept was to do it all at once to your point.'",
        "'speaker_4': 'And I, I want to just, let's just take it to the next question then or the next, you know, consideration, which is that it's not just a policy choice where we thought we'd do them together before, and now we're going to do them separate.'",
        "'speaker_4': 'When you choose a location for this new arena, you will be considering whether that location would be better used and how it would be potentially impacting private development. Yes.'",
        "'speaker_2': 'Yes, we want to be informed with good land use decisions.'",
        "'speaker_4': 'So it's not really true to say it's just about the public facility first and we'll figure out the private later. We are going to continue to consider the two together. Yes.'",
        "'speaker_2': 'I think I'm going to I'm going to say yes to kind of both of those things. I think they can happen a little bit simultaneously. But there's also a legal agreement that we have with our partners that say we're going to move these public facilities forward.'",
        "'speaker_2': 'As we move those public facilities forward, we should have that conversation around as we develop this site out and we figure out where those public facilities go on the best use of land. Let's talk about what other uses of land can be opened up for other commitments.'",
        "'speaker_4': 'So I think that I appreciate you, you know, acknowledging the connection and you know, I hear you that the framework agreement. But I will just say I mean we I brought this up in committee and a few speakers have raised it tonight more so the 1909 building than the arena depends on private development, its feasibility, its actual'",
        "'speaker_4': 'like whether it's worth it to spend $30 million is 100% related to private development. Yes.'",
        "'speaker_2': 'I don't know about 100%, but I will say that the current investment is, I think, $30 million for 1909. There's some additional investment that's going to come in to kind of finish it out once we have the plan of exactly what we want to do.'",
        "'speaker_2': 'But this gets that mechanical and all those, you know, gets the bones of the facility back in. And then for the next phase of finishing out, hopefully we would have a plan to start activating with residential. Because you're right, 1909 needs residential activation.'",
        "'speaker_4': 'So I think that the reason I'm asking these questions is because one of the things we're challenged with tonight is determining whether this package for this particular project is ready to go or not and whether or not we understand the implications of the decision we're making well enough to send it to the voters who will not have'",
        "'speaker_4': 'the benefit of this level of detail. Right. They rely on this body. And I think that to the extent we've tried to say that, all the rest of that will get figured out later, I just think it's really I think that I mean, and again, you know, it's not just you, Josh, I just wanted to bring up'",
        "'speaker_4': 'the P-3, but. The idea that what we do with this funding decision has ripple effects that are not part of this discussion, that do not have answers, that do not have commitments and that do not have details that would have been done in conjunction with another method.'",
        "'speaker_4': 'And so I just you know, if you want to respond to that, I had to do have an actual follow up question, but I realize I'm sneaking a comment in.'",
        "'speaker_2': 'But no, I think you're right. I think, you know, previous procurement method, we would have laid out a large plan out in front of you with a contract that you all saw, the draft RFP that was about that thick with a lot of requirements in it and a lot of plans on what was going to happen in'",
        "'speaker_2': 'a rezoning that was going to go with it. All of that was part of that package. Now, as Ms.. Wellborn pointed out, now we're in a little bit more of a linear fashion if we're going to take down chunks at a time.'",
        "'speaker_2': 'And that creates challenges to figure out, okay, how do we walk through this process? The upside of that was last time you're going to have one decision and then we were going to sign a contract and we're going to have ap3 developer start, move it now.'",
        "'speaker_2': 'We're going to have we're going to come back with a contract for the arena. And then if we're going to develop land, we're going to come back with a contract for a developer. And there'll be many bites at the apple, so to speak, or many conversations to be had in the future of how this all gets done'",
        "'speaker_2': 'because we're in this more linear fashion. Yeah.'",
        "'speaker_4': 'So I'm going to change gears. I have a question it might be for you, former Senator Lucia Guzman. It's always a pleasure to have you here with us. But if you would, would you be willing to come up for a question, please?'",
        "'speaker_4': 'And if it's you instead, Brad, feel free to to work it out. But.'",
        "'speaker_9': 'Something happened to my shoe. It doesn't work.'",
        "'speaker_4': 'It's probably going to sail from the benches. So I appreciate that you're chairing the Community Benefits Committee. Have you had a chance to look at other major entertainment venues, community benefits in equity conversations nationally and how they played out?'",
        "'speaker_4': 'Is that something you had a chance to do as a committee yet?'",
        "'speaker_9': 'You know, I have.'",
        "'speaker_11': 'Earlier on, I know when.'",
        "'speaker_9': 'I was first working with Councilwoman Ortega, she had.'",
        "'speaker_3': 'Shared some.'",
        "'speaker_9': 'Information. And I think that you might have been part of that. So that so I know something about that, but not really. I think this is a major process that needs to happen with with the members of the community committee as well, is to really look at what others have done.'",
        "'speaker_9': 'This is a big deal. And how how has it been done? How how is it going to be how are we going to make sure that the community is responsible for this? Who's going to handle the money? How is that fiscally physically fiduciary going to be taking care of what how that happens.'",
        "'speaker_9': 'All the things that I have read and looked into really point to the need for a major I'm not going to say a director, but some kind of major facilitation, not not in the scope of taking over the community, but under the I guess in a way that the community, the members use this facilitation to their to'",
        "'speaker_9': 'benefit their goals and their aspirations for what this can be to to balance the correct kind of facilitation, you know, facilitator maybe with the community committee. And what they want to do is going to be very, very important.'",
        "'speaker_4': 'Yeah, I will just share that of the most successful community benefits agreements I'm familiar with nationally that were on major entertainment venues, Staples Center of the Nashville Soccer Stadium are the two most significant examples. Both of them negotiated agreements before they had a funding commitment from a public body.'",
        "'speaker_4': 'That's how it worked. One question I've been a little confused about in tonight's conversation. You've talked about the Community Investment Funds Committee, and then you have a community benefits committee. Is it your understanding that your committee or that committee is looking at the development questions and the land use questions and the affordable housing questions that the community'",
        "'speaker_4': 'has asked to prioritize? Or just this question of dollars?'",
        "'speaker_9': 'The investment committee that I've worked with and and saw is one of my responsibilities as the member of the committee of the authority board is to enhance the. Really the investment fund. What what's going to happen there? Now, there are people, as I understand it, that on serving on the investment fund, council or committee, I'm not sure'",
        "'speaker_9': 'what the formal name is yet, who are also members of the coalition that are very concerned about the land. But my involvement right now has not involved both of those both of those items.'",
        "'speaker_2': 'But I, I believe that the.'",
        "'speaker_9': 'Folks who are serving on the investment fund do not separate, you know, the interest of the coalition, some of the Coalition's interest and their interest where really my my work has really been centered on the major opportunity for that, for this, this group or council to receive officially be the group.'",
        "'speaker_2': 'That receives.'",
        "'speaker_4': 'Dollars.'",
        "'speaker_2': 'From the.'",
        "'speaker_9': 'Revenue that is due to them and how they set that up and how they then work with their community to decide how they want those funds to be used.'",
        "'speaker_4': 'So I'm going to ask. I forget if it was you, Brad, or who spoke about the capacity building dollars, maybe. Can I switch to the. If it was it was it the money.'",
        "'speaker_9': 'That we were asking.'",
        "'speaker_4': 'For? Right. Because this is a really big deal. Yeah. Money to build your capacity to receive funding and distribute it responsibly is very different than money to build your capacity to engage in a conversation about the land use decisions and the affordable housing requirements.'",
        "'speaker_4': 'And the equity principles that will be built into the overall development of the remaining acres. They're very different. And I want to understand, because I think we are using the terms community investment fund and community benefits interchangeably and we should not be doing that.'",
        "'speaker_4': 'They are not the same thing, right? The Community Investment Fund may be one example of a benefit, but it is not the thing that particularly where this much land is involved, it's not the largest thing. Right. It may be a factor.'",
        "'speaker_4': 'Right. If the dollars are used to support development on that land for affordable housing or if they're used for community land trust, they may overlap. But we've been talking about them like they're the same. So I need to understand that.'",
        "'speaker_4': '$400,000 better. Mm hmm. So, Brad, did you want to talk about either of you? But which is it? Is it is it capacity building for distributing the funds, or is it capacity building for engaging in the overall use of the site and a full range of benefits, which might include co-op businesses and may include, you know, worker'",
        "'speaker_4': 'policies that help to make these really good jobs, which we have some that are coming from the city policy side. But every project I described, you negotiated unique job specific things on top of standard policy. So it's a much bigger package of questions than just what to do with the dollars.'",
        "'speaker_2': 'It is both of those things. We've been prioritizing the Community Investment Fund dollars piece because in 2022 the campus.'",
        "'speaker_3': 'Will generate community investment fund revenue.'",
        "'speaker_2': 'And obviously when the livestock center comes on and and we hope the arena.'",
        "'speaker_3': 'The dollars become much more substantial. Yes, there is a whole.'",
        "'speaker_2': 'Family of opportunities all around community.'",
        "'speaker_3': 'Benefits from those jobs, the sustainable jobs, the.'",
        "'speaker_2': 'Training, the small business, entrepreneurship, all the things that can happen here on the 1909, how that how that process is set up. 99 has been assumed to be operated by a nonprofit, not not the authority, but a community led nonprofit.'",
        "'speaker_2': 'So, I mean, all of that is going to take capacity building expertize to to to to help the community receive those those.'",
        "'speaker_0': 'Benefits and and to have.'",
        "'speaker_2': 'To create the outcomes that they want that they define. Not that we define.'",
        "'speaker_4': 'I have another question, but I'll go to the end of the queue. Madam, I understand. I am asking quite a few. Thank you. All right.'",
        "'speaker_1': 'Thank you, Councilmember Kenny. Next up, we have Councilmember Ortega.'",
        "'speaker_9': 'Here we go. That my microphone was on. I wanted to ask Josh if you wouldn't mind coming up to the microphone. If if this were not ready to go now, how far down the road would this be? Punted.'",
        "'speaker_9': 'I mean, is this something that this administration would be able to continue to have conversations about and and try to move it forward? Or does this potentially get pushed so far down the road that we're talking about a whole different administration that's going to be having to deal with this?'",
        "'speaker_2': 'Sure. Josh, lately, chief projects officer for the mayor's office. I'd love to answer that. Yeah, we'd move fast and come up with a new plan and get that done. But I think reality would tell us that to come up with a new funding plan, which we haven't even thought of yet.'",
        "'speaker_2': 'Aside from this geo bond issuance we would have, that would take time and it would obviously take political support and community support, and it takes time to put those things together. So I think during this administration that is probably not going to happen.'",
        "'speaker_9': 'So this was the backup plan to the p three proposal to try to get it funded by a private entity.'",
        "'speaker_2': 'Yeah. And I just want to tweak those words a little bit because we didn't have a backup plan originally. We, we thought we were moving forward with ap3 and I think I joked with our CFO, Brendan Hanlin, like tourism revenue was never going to go down.'",
        "'speaker_2': 'Come on, we're Denver, Colorado. And then it happened and nobody expected that to happen. And so we had to take a hard look and reassess. And, you know, I was very engaged in that part of the project and it wasn't an easy thing to do.'",
        "'speaker_2': 'And this is this is how we retooled to say what is what is the next revenue generator that can help bring to fruition the campus in the master plan that was previously envisioned?'",
        "'speaker_9': 'So let me ask you a different question, because when this came to committee, one of my colleagues had asked a question about the tourism dollars, both the lodgers tax, as well as the car rental tax and. Why we would not be just looking to that.'",
        "'speaker_9': 'And as we all know, we were expecting that revenue to be coming through to take care of what was part of phase one in phase two. Correct. So can you just speak to that?'",
        "'speaker_2': 'Correct. And I can. If I mess up anything, the CFO Brennan will correct me. But yeah, that was bringing phase one and two to fruition. And then for phases three through eight, which were the triangle, we hadn't formally committed any dollars.'",
        "'speaker_2': 'The overflow of our tourism revenue goes into the general fund, so we hadn't committed those. That's what we would have done had we brought that contract forward, we would have asked you to commit those dollars.'",
        "'speaker_9': 'So technically, what was anticipated? To be for phase one. And phase two is not money we can rely on for phase three to do these these buildings. In other words, there are just asking the question in a different way.'",
        "'speaker_2': 'Correct. So let me see if I can answer it in a different way. And and hopefully to you, there is no current funding identified other than the geo bond for the triangle or the phases three through it.'",
        "'speaker_9': 'Okay. And I wanted to ask a question about whether or not we. Jeopardize any of the state RTA funding if we do not bring the arena online.'",
        "'speaker_2': 'I'm going to ask someone else to answer that one because I'm not. Brett Dotson. Good evening. Brad Dodson, deputy director from the mayor's office of the National Western Center. Councilman, your question? The arena was not prescribed as a required element in the in the RTA agreement or the RTA resolution.'",
        "'speaker_9': 'But it did it did project a certain volume of jobs being generated.'",
        "'speaker_4': 'Right.'",
        "'speaker_2': 'The the RTA application talked about looked forward to an arena. However, at the time when we actually made the commitment as part of the RTA, the arena was not funded, it was not there wasn't a timeline established and so it was not included as a required element.'",
        "'speaker_9': 'So we think we're meeting those goals with the buildings that are being constructed today.'",
        "'speaker_2': 'Yes. And I think the if you if you take a step back by what the looking at the goals of the RTA, which was to increase tourism activity regionally, I think the arena absolutely gets to the spirit of that commitment, even though it wasn't defined as a required element.'",
        "'speaker_9': 'Okay. And you were Brad can answer this question. So a new arena is intended not only to serve national Western in the annual stock show, but any of the other partners on the campus could book that facility for any any number of types of activities or events.'",
        "'speaker_9': 'Correct?'",
        "'speaker_3': 'Yes, absolutely.'",
        "'speaker_2': 'So it's a it's a year round facility. 16 days in January, obviously, it'll be the National Western Stock Show with the rest of the year. It's it's a concert venue. It's an entertainment venue. GSA and high school sports events throughout the year, expo space, exhibition space.'",
        "'speaker_2': 'A lot of different kinds.'",
        "'speaker_3': 'Of users that have shown exhibited some interest in the in the arena.'",
        "'speaker_2': 'And if I could, I did we pulled some information from the 1909 market study because.'",
        "'speaker_0': 'As what I recalled.'",
        "'speaker_2': 'On the housing was that there were 10,000 units in the.'",
        "'speaker_3': 'Pipeline at that time.'",
        "'speaker_2': 'Of the.'",
        "'speaker_3': 'The market study. And we can we'll send around the exact language in.'",
        "'speaker_0': '20 and we can actually.'",
        "'speaker_2': 'Go and see how many of these happened. But at that time, there were 10,191 multifamily units in the.'",
        "'speaker_3': 'Pipeline within the five mile radius that they talked.'",
        "'speaker_2': 'About. So we do we.'",
        "'speaker_0': 'Do believe.'",
        "'speaker_2': 'That the.'",
        "'speaker_3': 'The market study.'",
        "'speaker_2': 'Requirements that were listed have been met. But please let us get that information of the facts secured and back to you.'",
        "'speaker_9': 'So does that potentially include all of what's going in along the Brayton court corridor, some of the big projects in the pipeline, for example, Fox Park. Some of those kinds of things. Yes.'",
        "'speaker_2': 'Yeah.'",
        "'speaker_0': 'They they call.'",
        "'speaker_2': 'That a five mile radius from the from the triangle.'",
        "'speaker_9': 'Okay. My my last question is about a commitment to the process that will engage the community to be part of looking at the Coliseum property and what that timeline, the commitment to that timeline is. I don't know if this is something that Josh would speak to or Brad, if you want to speak to that.'",
        "'speaker_9': 'I'm. Because we know that. If these two projects move forward. We still have the 30 acres where the Coliseum campus is, and it's it's critical for the community to be engaged in that conversation about, you know, what happens there.'",
        "'speaker_9': 'We know that part of that is a conversation with historic Denver, for example, about whether the Coliseum stays or whether it should go. But at the same time, you know, there's there's a lot of land there. There's some environmental issues that have to be addressed as part of the the bigger picture of what would happen there.'",
        "'speaker_9': 'But and we've seen contaminated sites develop all across the city, Shattock Gates site. So this would be no different. Asarco has commercial, you know, development on that site. So. I guess I'm just asking for what that timeline would look like in the commitment to.'",
        "'speaker_9': 'To move forward with that process that would engage the community in a full blown way around all of that. I think that's. Josh, do you want to take this one? It's one of the things spelled out in the letter that the mayor and Councilwoman Gilmore signed that sort of went through all the documents and pulled out all'",
        "'speaker_9': 'of the community commitments.'",
        "'speaker_2': 'Yep. And and maybe you can elaborate more on the letter, I think would be good, but I think it is contingent upon development, right, where we've got an urban renewal area that is set to collect. You know, we would like to get a tip in Metro District in place to start doing things like that.'",
        "'speaker_2': 'Putting roads back in. Cleaning the site. It is an EPA Superfund site and we need revenues to clean that site up. And so this would generate some of that and would kick that process into play have.'",
        "'speaker_9': 'I don't know if you know the answer to this, but have we, the city, ever taken on doing our own tiff, or has that always been with a private partner to address some of those infrastructure improvements?'",
        "'speaker_2': 'I can't answer that one. I've come up in comments, not that I'm aware of. I believe we've always used the Denver Urban Renewal Authority as as our partner for that. Is that what you meant? Like. Transacting ATF on our own?'",
        "'speaker_2': 'Yeah. We've always leveraged our urban renewal partners.'",
        "'speaker_9': 'Typically, they leverage bringing a private development partner to the table to help do that. Right. Because I'm not aware I'm trying to think of so many different projects that have been done across our city, but they've all involved.'",
        "'speaker_9': 'A private development partner to leverage the tax increment financing?'",
        "'speaker_2': 'I believe so. I might look at the cost.'",
        "'speaker_4': 'Laura Perry There is one area that I'm aware of, East Colfax. So the urban renewal area and the project plan were established before a developer was at the table with Dura to bring forward a firm project for that area.'",
        "'speaker_9': 'That was the motel property, so correct. That was redevelop not.'",
        "'speaker_4': '100% on that one. I can't comment.'",
        "'speaker_9': 'Okay. All right, let me just make sure. So I didn't hear a solid time frame commitment to engaging the community. And in the letter, I'm working through it right now that says in I mean, if if you think about where we're at now, you know, by the time this gets on the ballot, that's November.'",
        "'speaker_9': 'Right. There'll be the whole process of all of the projects that everybody's going to be trying to get passed before the voters. And then we're going to be in December. So we're into 2022 before, I think in the letter commits to starting this process in 2022.'",
        "'speaker_9': 'So I've I've requested that we have funding to make sure that that process can move forward. And I don't know if that would come out of. You know, national Western funds, if, you know, the finance office is looking at someplace else that these resources would come from, but that process has to begin in 2022.'",
        "'speaker_2': 'I'll let Brendon speak to the funding in just a minute, but I do want to point out GE's coalition is actually we're meeting with them tomorrow morning, I think at 9 a.m. in our offices with our Community Benefits Committee.'",
        "'speaker_2': 'And we are setting up a special community benefits committee meeting for later for mid-month to meet with the Community Investment Fund Committee who wants to discuss their work so far. And then the Community Investment Fund Committee, I believe, is coming to our September.'",
        "'speaker_3': 'Board meeting as.'",
        "'speaker_2': 'Well and and agree that setting up timelines.'",
        "'speaker_3': 'Is, is first job, first thing of order.'",
        "'speaker_2': 'Do you want to take it from there? Councilwoman. We, Brad and I and a few others have begun that conversation. I don't have a transaction before council this evening. One of the things that at least finance is contemplated is this inappropriate use of a one time contingency transaction to help support this and give clarity and certainty immediately'",
        "'speaker_9': '. So we should see something in the 2022 budget.'",
        "'speaker_2': 'I would try to transact that this year.'",
        "'speaker_9': 'Okay, great. Thank you. That's that's it for my questions.'",
        "'speaker_1': 'All right. Thank you, Councilmember Ortega. And we're back up for the second time. We've got councilmembers CdeBaca and Kenny. So go ahead, Councilwoman.'",
        "'speaker_4': 'Thank you. Just a quick clarification and also a request that we get a split of the 400,000 you guys are considering using on the CRF.'",
        "'speaker_10': 'Process and the CPA.'",
        "'speaker_4': 'Process. How would we split it? Who would be those entities? Who? Who is the CPA committee? I know the CHF group, but I would love to see that all on paper and just want people to recognize that there is not necessarily a process needed for the CIF that was promised to the community and embedded in the framework'",
        "'speaker_4': 'agreement. We only had not yet chosen a revenue source, so a roundup optional roundup was a baseline potential revenue source, but not the only one. And so community is proposing that plus an impact fee and there's not a lot of process needed around that.'",
        "'speaker_4': 'We can get a commitment on that before we vote on this. But the CBA process, I definitely would like to know who are we planning to involve? When are we going to have these meetings? When will it be completed?'",
        "'speaker_4': 'What's on the table? I would like to see all of that before we vote on this.'",
        "'speaker_8': 'And that's it for my questions and clarifications.'",
        "'speaker_4': 'Thank you.'",
        "'speaker_1': 'All right. Thank you. Councilmember CdeBaca, is there any response or more to come, I guess, to those questions? We're in the questions for me to be.'",
        "'speaker_2': 'Following up and providing that information. All right.'",
        "'speaker_1': 'Very good. Thank you. Councilmember, can each.'",
        "'speaker_4': 'Thank you. Council President We've had just a teeny bit of debate about this study, and would you indulge me in answering a question that was raised about what the study says about the household proximity, just to put it in the record?'",
        "'speaker_4': 'Would that be okay before asking my final question? Thank you. So, page 60 of the 1909 study starts a list of challenges, and it says this. It's page 6061. Actually, that demand from residents within the five minute drive time area is not currently sufficient to support a market at this site.'",
        "'speaker_4': 'The difference in the half mile radius between Denver, we have about 1200 households within a half mile radius. Pike Market, which we've described as the model that we want with fresh food, has 11,000 in the half mile radius.'",
        "'speaker_4': 'So it is a significant difference. The other cities that have a small number of households in the half mile radius in this study, in this set of pages, 58 to 62, if you're short on time, focus on those pages goes into detail that they don't provide fresh food.'",
        "'speaker_4': 'They have markets, but they're more like flea markets. They attract tourists. So the comparable level of household. So if this vision is for a fresh food market, if you take each of the pieces of this study together, there are not sufficient households.'",
        "'speaker_4': 'It's very clear it says it black and white is not sufficient to support a market. It does rely on the additional development we can debate with. That number is right. It does make a point that there are 10,000 units planned in the area.'",
        "'speaker_4': 'There's there's several references to 10,000. But that that actually makes a point that most of those are at the edge of the radius. They're not. And it kind of interchanges, sometimes a five minute radius with a half mile radius, which I'm not, I will admit ignorance in not knowing which of those is which in terms of what'",
        "'speaker_4': 'they translate to for distance. But but I think that, you know, the study does have some pretty strong statements in it about demand needed for success. So, you know, it's all there. Page 58 to 62. So with that, just kind of in the record, just to emphasize that the the question was asked about, we never looked at'",
        "'speaker_4': 'any other options. And I guess I just want to ask the question, why not? So who from the city. And I really do want to hear from someone from the city. We have two thirds of a bond that's not yet spent.'",
        "'speaker_4': 'And someone walks in the door and says, Why don't we use a bond for this? What process did we go to to evaluate whether there were other options and why this was the best? What was our options analysis and did we do it?'",
        "'speaker_4': 'And if not, why not? But just I thought that was an interesting question that got asked and I wanted to understand more.'",
        "'speaker_2': 'And I might be calling Josh up to talk about that as well. But I just want to make sure I understand the question. How do we get to the place where we're considering this bond or this bond as a tool relative to the arena?'",
        "'speaker_4': 'Well, I wouldn't mind mentioned separate is we want them to think that they are because they feel like we are. You know, we have a centerpiece here and the rest was built around that centerpiece. Right. So. So I think, you know, but for for this purpose, let's ask you about the National Western Center exclusively.'",
        "'speaker_4': 'So they say we want to finish. You know, we want to fund these these phases with this source and we want to do it immediately. Can't wait till 20, 22, which I believe is still during Mayor Hancock's term.'",
        "'speaker_4': 'Yes, 2022.'",
        "'speaker_2': 'Yes.'",
        "'speaker_4': 'Yeah. So there is another election during this mayor's term, this administration's term. But so what what analysis did we do? What vetting of the idea what vetting of alternatives did we do before proceeding with this?'",
        "'speaker_2': 'So I just want to make sure I'm answering the right questions.'",
        "'speaker_4': 'National Western Center piece of the package.'",
        "'speaker_2': 'Correct. So. Okay. So I think this goes back to Civil War Josh was talking about we were dependent on that P3 transaction to fund the all of the assets on this campus. We did meet internally to talk about options of moving forward because we do have a multi-year commitment to deliver the assets of the campus.'",
        "'speaker_2': 'I think to the question that was brought up earlier about, well, why was this one asset selected relative to others? It was because of the economic return on the campus and the activation it brought with it, as well as to the activation it brought to other assets on the campus.'",
        "'speaker_2': 'So there was an element that went through the deliberative process with the bond executive committee was proposed by the NewCo team and supported by the authority. These were ideas that came in through that process and it went through that deliberative process and reviewed the mechanics that and the and the values that it delivered as part of the'",
        "'speaker_2': 'geo bond process.'",
        "'speaker_4': 'I'm just going to ask it a different way. Okay. You didn't analyze any other finance mechanisms for it, so you evaluate it. Is it is it a good project or not or doesn't meet the bond criteria? But I'm asking, did you do an alternatives analysis?'",
        "'speaker_4': 'Did you say, is there another finance mechanism? Is there a copy? Is there I mean, you know, I don't know what the list would have been, but did you look at other ways to pay for it?'",
        "'speaker_2': 'So, I mean, we considered other financing tools. So there's two things that were going on at the same time. There's the financing transaction. So that's that's going out to the market transacting a debt debt amount that would then finance a project.'",
        "'speaker_2': 'But then there's the revenue stream component to it as well. So we did look at other revenue streams that had a nexus with the campus. But as we discussed before, they were tethered back to the option, which was the P three and they have been very impacted by the pandemic.'",
        "'speaker_2': 'So we we we looked at those as a possibility, but they still had not been strong enough to to provide a sufficient alternative to provide not the debt service amount, but the revenue that would be needed to repay the debt service once it was issued.'",
        "'speaker_4': 'Last question, I promise, in terms of the amounts, right. I mean, it's concerning to a number of us that the the Central Library Project is not in here. And so was there any effort to find a mechanism or an alternative source that could have shrunk the amount of this ask in order to fund a core free service'",
        "'speaker_4': 'that provides safety net services to so much of our community? Right. Was there any attempt to value engineer the amount and find the the remainder from another source, any attempt to do that?'",
        "'speaker_2': 'So we reviewed the project list repeatedly, internally, repeatedly with with council members, individually as well, and tried to make sure that we were honing in on what that project list looks like. I think it's also goes back to Laura's earlier point about the next step in our work is was finding those increments of independent utility items that'",
        "'speaker_2': 'could be carved off. I agree that there are capital escalation that would come with that, but I think we've been trying to be solution oriented relative to individual independent utility scope items. But we also were trying to make sure that we were being true to the conversations that we've had with all of you around projects and prioritization'",
        "'speaker_4': '. Okay. Thanks.'",
        "'speaker_1': 'All right. Thank you, Councilmember Koinange. The public hearing is closed. Comments by members of Council on council bills 864865866867924 and or 868. And a reminder, Council members, this is the only opportunity to offer any comments on any of these after the vote on 864864.'",
        "'speaker_1': 'Excuse me, the floor does not open back up for comments. Councilmember Flynn.'",
        "'speaker_3': 'Thank you, Madam President. I know that it only came up once this evening in the testimony, but I wanted to thank Sister Lydia Pena and also Guadalupe Lloyd, who is a neighbor whose backyard backs up to the Loreto campus for their comments on the efforts to revive reopen the May Bonfils Theater that's included in one of these'",
        "'speaker_3': 'packages, the city facilities bonds. This was something very important to my community in southwest Denver when we did the small area plan and talked about reviving the campus. This is an opportunity for the city finally to expand the arts and venues portfolio beyond that of downtown well and Red Rocks there's that.'",
        "'speaker_3': 'But to provide a performing arts facility to bring cultural opportunities, cultural growth to frankly, a very underserved part of town and high inequity part of town. A facility for performing arts that's accessible to small groups. A facility that would provide not only the stage for performance, but also meeting rooms for just for community meetings.'",
        "'speaker_3': 'I believe this facility can foster growth in the arts. Among, say, tier three SFD groups and foster establishment of new groups. Moreover, it has been nearly 30 years since the city last invested and a major community facility in southwest Denver.'",
        "'speaker_3': 'And I wanted to thank the Department of Finance, the mayor's office, for listening to the outpouring from Southwest Denver. The last facility that the city invested, I think, was from the 87 bond issue. That was the Southwest Recreation Center, which, by the way, just opened today after a year and a half of being closed due to COVID'",
        "'speaker_3': '. So I just wanted to I know that most of the discussion tonight has been on National Western and the Arena and the 1909 building. But I just wanted to make note of one of the other significant investments that we have that I hope my colleagues will pass on to voters and let them decide whether to proceed with'",
        "'speaker_3': 'this. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Flynn, Council Member Sawyer.'",
        "'speaker_4': 'Thanks, Madam President. There was something I heard from the public tonight that was it was really concerning to me, and that is when several people said, we don't want to vote. And that is really, really disturbing because when we're looking at what is going on across the world and we're looking what happened in Afghanistan today, the fact'",
        "'speaker_4': 'that someone has said, I don't want to vote on this. I don't want people to be able to use their voice and make a choice. That is the single thing that the United States of America has been built on.'",
        "'speaker_4': 'It's what we have been fighting for in Afghanistan for the last 20 years. It's what we lost today for an entire country that is extraordinary. And whether I agree with the idea that the package that has been put in front of us is worthwhile or not, it should go to the voters.'",
        "'speaker_4': 'It should go to the voters to decide to have this conversation, because that's what we do in America, because that's democracy. And frankly, there's not enough in this package for District five. But that's okay. That is a decision for District five voters to make.'",
        "'speaker_4': 'It is a decision for the voters of the city of Denver to make. And I feel really strongly, especially with what is going on in the rest of the world today, that we pass we vote, we pass this along, we refer it to the ballot, and we allow the people of our city to have this conversation and'",
        "'speaker_4': 'to decide for themselves whether this is something that they support or whether it's not something that they support, because it is too important for us to give up our vote. That's not okay. So I'm going to vote to refer these to our vote to publish them today.'",
        "'speaker_4': 'I'm going to vote to refer them next week. And I just wanted to make sure that I was really clear about that. Thank you.'",
        "'speaker_1': 'Thank you. Council Member Sawyer Council member Cashman.'",
        "'speaker_6': 'Well, thank you, Madam President. It obviously a difficult, difficult decision to be made. I mean, I love the the National Western and I took my kids there for years and years, take my grandkids. I think it's an important asset to the city and county of Denver.'",
        "'speaker_6': 'I also love sidewalks that are in good repair and that are wide enough for wheelchairs to traverse. I love sidewalks where people walk rather than sleep because we have enough housing. I love libraries that are open when people need them to be open and in 2021 condition rather than, you know, 1995 condition.'",
        "'speaker_6': 'And I love that that we can breathe without our throats getting scratchy and mountain views that still exist on a regular basis. So this is is is difficult. It's not a matter of of anything. I'm not a hater of the national western.'",
        "'speaker_6': 'I'm not a hater of a whole lot that's in this package. But I'm struggling with, you know, how what I want to pass on to the voters and what I don't I very much appreciate Councilor Councilmember Sawyer's position and it's one I'll I'll take into account, but I'm still measuring my votes.'",
        "'speaker_6': 'I appreciate everybody's efforts in putting this together and answering questions, but it is troubling to me.'",
        "'speaker_1': 'Thank you, Councilmember Cashman. Councilmember, can each.'",
        "'speaker_4': 'Thank you. Council President I first just want to say that I reject those who have cast aspersions and disparaged the folks who brought this package forward. I think that everyone has good intentions. And I take it as a fact that this.'",
        "'speaker_4': 'This package has things that are important in it and that are long delayed. And I also take it as a fact that even the project I've had the most questions about the arena is necessary and is a key to the the campus, the national western campus.'",
        "'speaker_4': 'And so and that we have some obligation to participate in the solution of of funding that. So I, I just want to make really clear that, that I think that that the intentions are good. I like Councilman Cashman struggle with the timing of this package overall with three quarters of a prior bond unspent, with the delayed nature'",
        "'speaker_4': 'of some of the stimulus that's coming, and with the ability that a year would have given us to answer more questions. Right. So I, too, am struggling. And I will just say I really appreciate Councilwoman Sawyer's point. I guess I would describe it a little differently.'",
        "'speaker_4': 'We are elected in a representative democracy to vet things in the first instance. And when I send something to the ballot, I think they're my questions were based on the idea that the voter expects that I've done some work to figure out the readiness of the issue and the implications and the future costs if you're going to'",
        "'speaker_4': 'have to demolish the Coliseum later and we're on the hook for that and there's no funding for it in this package. Right. That's an example of a consequence that I could be taking on with this vote. And that's not in the ballot language.'",
        "'speaker_4': 'And so so I do think that not everything always is appropriate to be referred, because that's why we're here, is to vet those things. And that's really important. It costs a lot of money to have an election and it's not equal footing.'",
        "'speaker_4': 'Everyone doesn't have equal information. And so I do trust the voters to make sound decisions, but they also trust me and the people up here to do some vetting. So that's why I think it matters a lot. If we feel like it's ready and we feel like it had the best vetting that it could have, the voters'",
        "'speaker_4': 'don't have a chance to say that they would have liked to put a project in. That's particularly what they don't get to do. Only we get to do that, and they're projects that were left out of this that would have an immediate stimulative effect.'",
        "'speaker_4': 'And I struggle with that, too. So thank you as well for all the answers to the questions that folks were able to give. And to my colleagues for your good questions as well. Thanks.'",
        "'speaker_1': 'Thank you. Councilmember Kinney. Councilmember Ortega.'",
        "'speaker_9': 'Thank you, Madam President. I want to thank everybody for being here tonight. This is one of our late nights that we've been here since we've come back to the chambers. And thanks to Councilwoman Sandoval, you now have cushions on the seats to sit on.'",
        "'speaker_9': 'So they're not hard seats. I've been involved with this project going back to when I was a staff member for Sal Carpio. And conversations have been ongoing about, you know, what kind of investment should the city be making in national western?'",
        "'speaker_9': 'Over time, we've spent money on various buildings from bond, you know, from the voters supporting various bond packages that built some of the buildings that that are there and are still being used. We know that the 1909 building needs major upgrades for that building to be usable for anything.'",
        "'speaker_9': 'And there's been a commitment made that it would be used as a public market. The the package of items that have come forward. Some of those were vetted with input from the community and some of that came from input from members of council, which is not unusual in this process.'",
        "'speaker_9': 'I can remember one round when we had a package moving forward and I wanted the bridge underneath that connected or the connection. It's a tunnel actually that connected the Coliseum to the National Western campus because 46th Avenue would have to be closed and residents would have to drive on I-70.'",
        "'speaker_9': 'And you know that that got put into the package. It's part of the process. It's not unusual for members of council to push for some of these things to be included in these bond packages. And what you have before you tonight is a reflection of accumulation of all of that input.'",
        "'speaker_9': 'The reason I put together or asked the administration to work with me in putting together the letter that Councilwoman Gilmore and Mayor Hancock signed was to take all of those commitments to the community benefits. And they're it's not it's not intended to be the entirety of what can can be for that campus.'",
        "'speaker_9': 'But that is what is memorialized in each of the documents. And that was done with input from residents, from the community. We had many people that sat on the the National Western. What's the right name of the group?'",
        "'speaker_9': 'The Community Advisory Committee. That's where many of those things ended up in the framework agreement because of input from the community. And same with the 1909. A number of residents from the community sat through those meetings to give input.'",
        "'speaker_9': 'We had the gentleman who ran Pike's Market in Seattle, who was the consultant that worked with the community to say, if you want this to be successful, it has to be a community driven program. It can't be something where you bring in chain restaurants and that kind of thing because that's not a public market.'",
        "'speaker_9': 'That's not going to work. It was intended to not be just food, but to have a variety of different kinds of things, very similar to Pike's Market that would have a robust interface with the community. We haven't gotten there yet.'",
        "'speaker_9': 'Right, because these these projects have not had the opportunity to move forward. We didn't get to the P3 process. This is the opportunity to really move in that direction with with these two buildings that are part of this package.'",
        "'speaker_9': 'And I would just say that if these two buildings are not part of the package for the national western campus, it will be punted so far down the road that we probably won't see it before some of us who are term limited leave in 2023.'",
        "'speaker_9': 'And I think this is an opportunity to ensure that the revenue that will be generated from these buildings will be added to what is already being proposed with the existing buildings that have been constructed or are getting ready to open that were funded in phase one and phase two, that lifts up how much more can be generated'",
        "'speaker_9': 'from the Community Investment Fund. And again, that is the floor, that is not the ceiling of what the opportunities are for these communities. And I just think that it will be a missed opportunity for the residents of these neighborhoods to not have this be part of the package that the voters should be able to make a decision'",
        "'speaker_9': 'about. And this is this is our opportunity as members of this body to put this forward and to create the opportunity to then engage in that conversation with funding that our finance office is going to find to make sure that we have that robust conversation to engage the community.'",
        "'speaker_9': 'And what happens with the 30 acres at the Coliseum if these two buildings are built on the north side of I-70? We still have all the land on the south side of I-70 to figure out what do we do with that and have the community involved in that conversation along with, you know, what are the funding, other'",
        "'speaker_9': 'funding sources that could be had to make sure that we have this these opportunities for the neighborhood. So I'm going to be supporting the full package tonight. I was adamant that if these two properties these two projects were not part of the package, I wouldn't support it all moving forward.'",
        "'speaker_9': 'But I think this is critical for the kind of jobs that are going to be generated and the benefits that will come to these neighborhoods. Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Ortega. Councilmember CdeBaca.'",
        "'speaker_4': 'I thought I was done, but I'm not. Thank you so much for letting me.'",
        "'speaker_8': 'Close us out on this. And I just want to.'",
        "'speaker_4': 'Respectfully disagree with Councilwoman Ortega. We've had several things memorialized on paper.'",
        "'speaker_8': 'Over the last 5 to 10 years related to the community commitments here. We've got an Emmylou.'",
        "'speaker_4': 'For the Community Benefit Agreement. We've got a framework that talks about the Community Investment Fund. And only.'",
        "'speaker_8': 'Now that we're.'",
        "'speaker_4': 'Asking the community to give up more, are we committing to that process in a meaningful way. And so I don't think.'",
        "'speaker_8': 'Another letter.'",
        "'speaker_4': 'Is going to get the community.'",
        "'speaker_8': 'What they're asking for.'",
        "'speaker_4': 'I think that we need community driving, how.'",
        "'speaker_1': 'We.'",
        "'speaker_4': 'Prioritize anything that happens within the next.'",
        "'speaker_8': 'Ten years leading up to our deadline.'",
        "'speaker_4': 'I personally feel that, you know, community consistently comes, shows up, testifies, tells you what they want, tells you what they're asking for, and we ignore them. Tonight there was not a single resident that spoke in support of this.'",
        "'speaker_4': 'This is the most marginalized community and the most impacted by these projects. Yes, we split it up. And I absolutely do not support the national western side of this. But I also think that it's irresponsible for us to be going to the voters, to the taxpayers, asking.'",
        "'speaker_8': 'Them to take out another.'",
        "'speaker_4': 'Loan when we have already expedited the debt on the previous loan we had them take out in the middle of an economic crisis. This is not a hotel and tourism tax. The reason that we didn't generate enough revenue is because of COVID, because that's not something people could attend, could do.'",
        "'speaker_4': 'We don't know if covid's over. So we're planning for a venue that will be shut down that we may or may not generate revenue on. And we're calling that an economic jumpstart. It's not. Were lying to the voters.'",
        "'speaker_4': 'We're not telling them the truth about this. This project won't even generate revenue for another 5.'",
        "'speaker_8': 'To 10.'",
        "'speaker_4': 'Years, if that. So I think the package is irresponsible. At a time like this, we're relying on the taxpayers and their property taxes, which we just raised this year, to fill the shortfalls of our of our revenue gaps.'",
        "'speaker_8': 'From last year.'",
        "'speaker_4': 'It's not a. We're at this time and I don't support the whole package, but I absolutely don't support the National Western package. And at minimum, I encourage my colleagues to pay careful.'",
        "'speaker_8': 'Attention to the National.'",
        "'speaker_4': 'Western piece and recognize that the people speaking here tonight did exactly what you asked them to do. And they don't want this piece. So please, at minimum do not support the piece for National Western. Thank you.'",
        "'speaker_1': 'Thank you, Councilmember CdeBaca. And I'll go ahead and wrap up the comments and then we're going to go ahead and vote on each one individually. I hope we've heard a lot tonight about National, Western and 1909. Something that we haven't heard a lot about are all of the other projects that are part of this package that are'",
        "'speaker_1': 'transformational for other parts of our city. And folks have been waiting for some of these projects for decades and. It doesn't have to be an either or. It can be a yes. And earlier tonight, we approved a rezoning for a Costco in the Montebello neighborhood that's going to create well-paying jobs that have benefits.'",
        "'speaker_1': 'One of the things that we all saw over the pandemic, especially for hourly wage workers, are if you don't have access to benefits or PTO or sick leave, you're just out and you can't pay your rent. You can't buy food.'",
        "'speaker_1': 'That's why we had so many folks in food lines during the pandemic that they were just like, I can't believe I'm here, but I don't have sick time. My child got sick, my spouse got sick. I lost my job because I didn't have those benefits.'",
        "'speaker_1': 'This is something that we can start this process and start it over or re spark it so that there is the will of this body behind it to ensure that we get that 400,000 to see this work so that folks aren't able just to say what they want, but they can actually be at the table, community members'",
        "'speaker_1': 'can be at the table and negotiate around national, western and 1909 and we're going to find that 400,000. We've got the 2022 budget process coming up. If we don't have it figured out before then, I can assure you that there's going to be some sort of amendment that creates that funding stream, because the will of this body'",
        "'speaker_1': ', we all feel that it's very important that we follow up on the promises that have been made to this community and that we make sure that we're empowering them to be at the table to make those decisions. I want to really thank Councilwoman Ortega for her leadership in.'",
        "'speaker_1': 'Pulling together that high level summary letter that really just puts everything in one place. So it's easy for the community to track, for the public to track for our city agencies and administration to track. This is something that myself and Mayor Hancock have both signed, and I feel a huge sense of responsibility to ensure that we see'",
        "'speaker_1': 'this through. We have had community organizations in Montebello, Montebello organizing committee that have been very, very successful in getting a fresh food market with affordable housing on top of it. There are models within our city that are already being funded and work, and so I hope that we can continue to build off of that.'",
        "'speaker_1': 'And then I also want to sincerely thank Council Pro Tem Torres and her partnership through this, because the amount of meetings and weekends that we have spent working with Brendan Hanlon, Laura Perry and your entire team, it's been quite a process.'",
        "'speaker_1': 'And was it going to be perfect? No. We knew that that wasn't going to be the goal. Was it going to be something that we could revive the economy and make sure that we were providing well-paying jobs with benefits and jobs that could lead to careers along with that partnership of our universities?'",
        "'speaker_1': 'Yes, that's what we were trying to accomplish. And I feel like we have done that here tonight. And so I am in support of everything that we have in front of us, because I know that the time has been short, but the need is great and now is the time for us to act on this.'",
        "'speaker_1': 'And so appreciate the community members for staying along with us on this and council. Bill 20 1864 is on the floor for publication. Madam Secretary, roll call on council bill eight six for please.'",
        "'speaker_4': 'Flag I.'",
        "'speaker_7': 'CdeBaca.'",
        "'speaker_4': 'No.'",
        "'speaker_7': 'Clerk.'",
        "'speaker_2': 'I. Swim I. Herndon, I.'",
        "'speaker_7': 'Cashman.'",
        "'speaker_6': 'I.'",
        "'speaker_4': 'Each I.'",
        "'speaker_9': 'Ortega, i.'",
        "'speaker_8': 'Sandoval, i.'",
        "'speaker_4': 'Sawyer, I.'",
        "'speaker_9': 'Torres, I.'",
        "'speaker_7': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'"
    ],
    "A bill for an ordinance submitting to a vote of the qualified and registered electors of the City and County of Denver at a special municipal election to be held on Tuesday, November 2, 2021, the question of whether the City shall be authorized to issue or incur general obligation debt for the purpose of financing and/or refinancing the cost of repairs and improvements to the National Western Campus Facilities System; providing the form of the ballot question; providing for other details in connection therewith; and ratifying action previously taken. Refers a question to the November 2021 ballot to allow the City to issue general obligation bonds for the purpose of financing and/or refinancing the cost of repairs and improvements to the National Western campus facilities system. Councilmember Black approved filing this item on 8-12-21.": [
        "'speaker_1': 'I. Madam Secretary, closed the voting and announce the results one day.'",
        "'speaker_7': '11 Eyes.'",
        "'speaker_1': '11 Eyes Council Bill 867 has been ordered published. Councilmember Cashman, we need you to put Council Bill 9 to 4 on the floor for publication, please.'",
        "'speaker_6': 'As Council President, I move the council bill 21, dash 924, be ordered published.'",
        "'speaker_1': 'Thank you. It's been moved and seconded. Madam Secretary, roll call on Council Bill 924.'",
        "'speaker_4': 'Black eye.'",
        "'speaker_7': 'See Bucket.'",
        "'speaker_4': 'Hell, no, Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_7': 'Flynn.'",
        "'speaker_2': 'I. Herndon, I.'",
        "'speaker_7': 'Cashman can each.'",
        "'speaker_4': 'Name.'",
        "'speaker_9': 'ORTEGA All right.'",
        "'speaker_8': 'Sandoval No.'",
        "'speaker_4': 'Sawyer, I.'",
        "'speaker_7': 'Torres.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce results.'",
        "'speaker_7': 'Four nays.'"
    ],
    "A bill for an ordinance designating the projects to be undertaken and funded with the proceeds of any general obligations bonds authorized by voters at the November 2, 2021 election.  Approves a companion ordinance designating the projects to be undertaken and funded with the proceeds of any general obligations bonds authorized by voters at the November 2021 election. The Committee approved filing this item at its meeting on 8-3-21.": [
        "'speaker_1': 'Eight eyes. Eight I's Council. Bill. 924 has been ordered published. Councilman Cashman, will you please put Council Bill 868 on the floor for publication?'",
        "'speaker_6': 'Yes, Madam President. I move the council bill 21, dash eight, six, eight, be ordered published.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. Madam Secretary, roll call on Council Bill 868.'",
        "'speaker_7': 'Black Hi. CdeBaca No clerk.'",
        "'speaker_2': 'All right. Flynn, I. Herndon, I.'",
        "'speaker_7': 'Cashman. I can h.'",
        "'speaker_4': 'I.'",
        "'speaker_9': 'Ortega, I.'",
        "'speaker_7': 'Sandoval.'",
        "'speaker_8': 'I.'",
        "'speaker_7': 'Sawyer.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Torres.'",
        "'speaker_4': 'I.'",
        "'speaker_7': 'Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_7': 'One. The 11 eyes.'",
        "'speaker_1': '11 Eyes counsel bill 868 has been ordered published. There being no further business before this body. This meeting is adjourned.'"
    ]
}