{
    "A resolution approving a proposed Contract between the City and County of Denver and AXS Group, LLC to add compensation and five years to provide ticketing services, box office operation, information and call center functions, and marketing support for City venues. Approves a contract with AXS Group, LLC for $5,010,613 and for five years to provide ticketing services, box office operation, information and call center functions, and marketing support for City venues (THTRS-201952501). The last regularly scheduled Council meeting within the 30-day review period is on 12-23-19. The Committee approved filing this item at its meeting on 11-20-19.": [
        "'speaker_0': 'Under pending, no items have been called out. Miss anything? All right, Madam Secretary, if you'll please put the first item on our screens. And, Councilman Herndon, will you please put Council Resolution 1220 on the floor?'",
        "'speaker_8': 'Yes, Mr. President. I move the council removing council resolution 19, dash 12 to be adopted.'",
        "'speaker_0': 'It has been moved and seconded. Questions and comments by members of Council. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I want to apologize to two members of the committee. We actually are. Excuse me. Members of the body. This actually came through committee, as you may know. There was an article in the Denver Post late last week.'",
        "'speaker_4': 'And and that that article has created a flurry of communication between constituents in District ten and the office. So these are questions that I would have preferred to have mentioned in committee. But I think that some people have some reasonable questions.'",
        "'speaker_4': 'And so I hope you'll allow me to ask that of either access or arts and venues if anyone is here from either of those entities.'",
        "'speaker_9': 'Good evening. My name is Brian Kitts. I'm director of marketing and business development with Arts and Venues.'",
        "'speaker_4': 'I thank you for coming. And again, I apologize that I didn't ask this in committee. So we've heard probably just that. Well, certainly the second most commented issue that we heard from constituents over the Thanksgiving holiday and the end today, but first being the lack of snow removal was about the access contract.'",
        "'speaker_4': 'And by the way, you were not even near the same league as all the concerns about snow removal. But I didn't realize that that the perspective venue or excuse me, a prospective vendor is currently under. What does they have?'",
        "'speaker_4': 'The House Energy and Commerce Committee has a probe into AEG. And I'm just curious to hear and also the European let's see what is the European group, the Competition and Markets Authority in the U.K. has also launched an investigation.'",
        "'speaker_4': 'And so I'd like to hear what your thoughts are, what your comments are about the investigations and how that may have affected the decision making process.'",
        "'speaker_9': 'I'll answer the second question first. The decision making process was not affected by by this quote unquote, probe. Our work with the purchasing department started several months ago. I had quite a back and forth with the reporter from the Denver Post today.'",
        "'speaker_9': 'I would I would not characterize what's happening right now as a probe. What has happened and I've actually got a copy of the letter from the congressional committee that is investigating what they've done is they have sent a letter to dozens of ticketing platforms around the country asking for information.'",
        "'speaker_9': 'It is not a criminal investigation in any way. They are looking at five specific areas of concern to ticket buyers in general in an effort to reintroduce the boss act. The Boss Act. This is where I get all ticketing and nerdy on you.'",
        "'speaker_9': 'The Boss Act is named after Bruce Springsteen. It's been kicking around since 2009. What it does, it stands for better oversight of secondaries, sales. It's exactly what it sounds like. It is intended to protect consumers from predatory ticket sales, especially on the secondary market.'",
        "'speaker_9': 'So, you know, this is not something that access is afraid of. This was not directed only at access. It was directed at, like I said, Ticketmaster, Eventbrite tickets. Now, almost everybody that's running a ticketing platform right now got one of these letters asking for information.'",
        "'speaker_9': 'It's not something that they were afraid of. We would welcome four of the five. We would welcome real work in the form of four of the five categories that are being looked into. So, you know, again, I, I want to be clear that what the congressional committee is doing is not look into criminal activity of any kind'",
        "'speaker_9': '. It's asking for information to reintroduce the bias act.'",
        "'speaker_4': 'Okay. Thank you. So you mentioned secondhand sales. Does this the proposed contract, does it control secondhand sales in the chosen city venues?'",
        "'speaker_9': 'To the extent that we can. Yes. I think that what what you've seen with the advance of technology over the past several years is that we have now gone from, you know, literally selling tickets, card tickets across the street from Coors Field or standing outside of Red Rocks with a hard ticket to being able to transfer some'",
        "'speaker_9': 'of those electric lights, transfer almost all of those electronically. To the extent that we can, we are trying to control that secondary market. We want to do that. It is to the benefit of Red Rocks and the performing arts complex.'",
        "'speaker_9': 'And everybody who looks at those venues that we're able to do that as opposed to, you know, somebody randomly selling those tickets on Craigslist where we actually can't see who's buying or selling those those tickets.'",
        "'speaker_4': 'Thank you. So I recognize that that often the people who comment are directly affected. And and so I thank you for your comments because it's important for me to better understand, you know, all sides of the story. The secondhand market, I think, in the contract is 22 point something percent for the secondary market.'",
        "'speaker_4': 'And the city gets half and access gets half. Is that right?'",
        "'speaker_9': 'That's correct.'",
        "'speaker_4': 'Some of the some of the concerns that we had received, the emails, some even today, were that it was really difficult to purchase from the primary market. And an effective access to tickets in some of these venues are entirely through the secondary market.'",
        "'speaker_4': 'Do you have any thoughts or comments about that?'",
        "'speaker_9': 'Sure. I'm going to generalize and I'm going to use Red Rocks. But this applies to Pepsi Center or any sports or entertainment venue in the city where, you know, bluntly tickets are limited. I'm going to say that by the time a fan club gets its hands on tickets, by the time a team pre sells its tickets, by'",
        "'speaker_9': 'the time season tickets come off of the system, there are a limited number of tickets. We worked with Westword and Channel Nine a couple of years ago on a story, you know, talking about Red Rock specifically. By the time a show goes on sale where there are 9000 tickets available, even if every single ticket was available with'",
        "'speaker_9': 'a ticket limit of four per household, that's that's almost 1000 buyers that get those tickets. So, you know, this is a matter of supply and demand. It is it frankly doesn't have much to do with the primary or secondary market.'",
        "'speaker_9': 'It has to do with limited, limited availability in in any of those venues. There are plenty of shows at Red Rocks where, you know, bluntly the night of the show, you are going to be able to buy buy that ticket.'",
        "'speaker_4': 'And and, Mr. President, I've one other question, and I noticed there are other people with questions, so I'll yield after this. How do other promoters like Ticketmaster? How do they both have the sorry, the other ticketing agencies and promoters?'",
        "'speaker_4': 'How do they interact with access? So to to be a little more specific about the question. Well, artists be unable to participate in the markets that we are in some of our city venues because they have an exclusive arrangement with Ticketmaster or vice versa.'",
        "'speaker_9': 'No. I think one of the interesting things when we first partnered with Access is that and I think some of you have heard this in presentations, the city of Denver had a specific set of venues that was the only set of venues that wasn't under some sort of exclusive agreement.'",
        "'speaker_9': 'Pepsi Center is ticketed by Ticketmaster. Coors Field has its own. The Broncos are ticketed specifically by Ticketmaster. It doesn't matter who plays at Red Rocks, it's going to be on the access system. That's the way that that the industry is working right now.'",
        "'speaker_9': 'So there is no artist that is shut out.'",
        "'speaker_4': 'Okay. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman and Councilwoman Sawyer.'",
        "'speaker_5': 'Thank you, Mr. President. Can you just explain to me a little bit? This is a this is a we're just re-upping this contract, correct?'",
        "'speaker_9': 'Yes. So it was a five year initial contract that is expiring. And so this is a renewal of or a rework of the initial contract.'",
        "'speaker_5': 'So this rework of the initial contract then is anything changing materially about the way people in the city and county of Denver are purchasing tickets? When this contract starts in January versus the way they have done tickets or purchase tickets are experienced.'",
        "'speaker_5': 'Our venues for the last five years.'",
        "'speaker_9': 'Not because of the contracts. I think that you are experiencing different things as a fan, but it's based on technology and it would be the same whether you were with Ticketmaster or any other system. You know, 95% of our tickets are now sold electronically.'",
        "'speaker_9': 'So you show up at the venue with your phone. You may have borrowed it on your phone. The days of the hard ticket are gone. That's really the only change. This is really a fairly seamless process. There hasn't been an increase in fees.'",
        "'speaker_9': 'As a matter of fact, in a couple of cases, you're going to see lower fees with the renewed contract that's based on volume. You know that the industry is really reliant. The music industry is reliant on touring right now.'",
        "'speaker_9': 'And so that makes all of our venues incredibly healthy. So that's that's allowed us to, you know, basically work a volume discount on some of those fees.'",
        "'speaker_5': 'So in terms of the people of the city of Denver and the experience that they're getting at our venues and the basis of this contract, the. The article that was in the post the other day that sort of brought all of this up.'",
        "'speaker_5': 'It felt a little clickbait to me because it didn't really. It's sort of targeted access.'",
        "'speaker_10': 'But it wasn't really talking about access. Right.'",
        "'speaker_5': 'Is that is that accurate? Can you can you explain like is that is my experience with that, correct?'",
        "'speaker_9': 'Sure. You know, like I said in response to Councilman Hines question the the article, I wish the headline certainly matched what was in the article and what's in our contract a little bit better. You know, there are there are lots of good things that have come out of this contract.'",
        "'speaker_9': 'You can get a ticket from any of the platforms that had replied. But I think that what we have done with access is, you know, taking a deeper look at who's coming to our venue. So when we got ready to look at redeveloping the arts complex, we weren't sure.'",
        "'speaker_9': 'We had no demographic information at all. By by working with this system, we're able to see that, you know, three of the top ten markets that buy tickets at Red Rocks are from outside of the metro area. When it came to settling the lawsuit against Red Rocks in the city last year over accessibility and access to Row'",
        "'speaker_9': 'one at Red Rocks. It was actually written into the consent decree that the flash heat system which Access owns and operates, become part of the solution. It allowed for us to restrict who bought tickets and actually who transferred those tickets.'",
        "'speaker_9': 'And so that was something that was helpful for patrons who needed access to two row one. So, you know, I think that there are lots of things that technology has has been good for when it comes to the ticketing system.'",
        "'speaker_9': 'That continues with with with this contract.'",
        "'speaker_5': 'Okay. And so in your opinion, this is a good deal. This is a good value for the people of the city and county of Denver.'",
        "'speaker_9': 'Not only is it a good value, but it's one of the you know, it's one of the vital systems that we use in our venues. You know, we're talking about two contracts with arts and venues tonight. The other one is with Aramark.'",
        "'speaker_9': 'You know, both of these contracts are the workhorses that get the trains running on time at Red Rocks. One of them provides food and beverage service along with the the workforce that handles the concessions. You know, the access contract actually gets the tickets from the promoter into the hands of into the hands of the fans and, you'",
        "'speaker_9': 'know, staff. So every box office that we've got so, you know, these are it's not just a good deal. It's it's vital to what arts and venues does.'",
        "'speaker_5': 'You, Mr..'",
        "'speaker_0': 'President. Thank you, Councilwoman. Councilman Flynn.'",
        "'speaker_3': 'Thank you, Mr. President. Brian, thank you also for being here. I think you addressed with Councilman Hines most of the the things I wanted to raise, but I was interviewed also by John at The Post about this. And I just wanted to point out to the audience and to my colleagues that, first of all, this is this'",
        "'speaker_3': 'was a competitive re procurement of this process. This isn't just an automatic renewal of access, a contract that it's had for the past five years. So we had, I think, six proposers, three of whom were shortlisted.'",
        "'speaker_9': 'Two actually were deemed viable by purchasers.'",
        "'speaker_3': 'And what's going what's going on in the House committee is basically a not a probe or investigation into, like you said, criminal activity. That's not the issue at all. What's actually going on is the House is looking at some common some practices that are common in the industry and not particular to the access.'",
        "'speaker_3': 'This would have been an issue no matter which proposer we chose to proceed. Correct. So I want to point that out to colleagues. This is not peculiar to access. That's right. And the last thing I wanted to bring up was that this contract in the last five years, if I recall correctly, has meant a huge improvement in'",
        "'speaker_3': 'accountability and transparency, particularly when it comes to our seat tax revenue. Right. Prior to this, we relied on the promoters. To basically tell us how many people were there. Right. And remit the 10% seed tax based on their word.'",
        "'speaker_3': 'Is that correct?'",
        "'speaker_9': 'That's correct.'",
        "'speaker_3': 'So, in fact, I was put in mind of one of the final scenes in the Blues Brothers when Jake and Elwood went backstage and they ran into the guy from Clarion Records who handed him a an envelope of cash.'",
        "'speaker_3': 'And that's kind of kind of how it used to be. Correct. They don't have suitcases.'",
        "'speaker_9': 'Full of cash because the revenue at Red Rocks is so big. But yes.'",
        "'speaker_3': 'They do. And so I guess what I want to emphasize is that with the digital platform and the records, the documentation that's kept on ticket sales, now we not only get for seat tax remission. Of what we were owed, the 10% surtax not just at Red Rocks, but Coliseum and the arts complex.'",
        "'speaker_3': 'And maybe in the future, the Lorenzo Heights Theater, if we're successful. But we also know such things as demographically, where do these customers come from so we can target market and things like that. So so overall, that's what this contract has meant to us.'",
        "'speaker_9': 'That's a huge part of it. And, you know, again, the technology here can't be overstated. You could have gone to, you know, before this contract, before the city opted in, you could have gone to a show at the convention center and they would have taken your cash and given you a red paper ticket.'",
        "'speaker_9': 'Mm hmm. By using an electronic system like this, we collect the money first. And I think this is important, though, too. We collect the money first through the access system, and then it is paid out to live nation and AEG or the symphony or whoever is is booking the venue that night.'",
        "'speaker_9': 'So not only do we get the arts and venues portion, including the seat tax, which is important, we are we're able to see where the money comes in and where it goes. We don't have to rely on an individual promoter and it's immediate.'",
        "'speaker_9': 'You know, part of the contract says that we have to pay out within ten days. You know, that's a huge improvement over the weeks and weeks.'",
        "'speaker_3': 'Thank you. And just to cap this, we we, in fact, as a city or as an agency, arts and venues might even be supportive of the House committee looking into some of these practices, because that could make it much better for some of our customers to be able to be engaged in the secondary market if they had'",
        "'speaker_3': 'to.'",
        "'speaker_9': 'Yeah, absolutely. You know, Red Rocks is known as being a leader in lots of areas. And I think this is one where I think we'd be proud to cooperate with the House committee in this type of work. And like I said before, this isn't something that we're afraid of.'",
        "'speaker_9': 'It's not something that I access is afraid of. It's a natural progression in terms of ticketing and protecting consumers.'",
        "'speaker_3': 'Thank you, Brian. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, gentlemen. Councilman Black.'",
        "'speaker_5': 'Thank you. I was not at the committee meeting, but I also got a lot of questions and I have a couple of constituents who have been unhappy with ticketing. For as long as I've been a councilperson. And so I'm going to follow up with you tomorrow for it with some very specific questions.'",
        "'speaker_5': 'But generally speaking, what would the difference be if you would have worded it to a different vendor? First question. And then related to that, would it be possible for the city to do this without a vendor?'",
        "'speaker_9': 'The answer to the second question is. Not without hiring lots and lots and lots of people. And at some point you're going to have to bring on the software system anyway. So my I guess my answer would be no, we we couldn't do it without a vendor.'",
        "'speaker_9': 'The difference, you know, frankly, between Ticketmaster and Access when it came to this procurement wasn't wasn't a lot and you know I think that part of it has to do with what I think the panel saw as flexibility and the ability to kind of pivot when you need new product or, you know, access was just a little'",
        "'speaker_9': 'bit more nimble based on our experience.'",
        "'speaker_5': 'So there's not some other model out there that wouldn't have all these fees. No. Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Cashman.'",
        "'speaker_6': 'Thank you, Mr. President. A couple of quick questions. So I know there are a lot of performers now in an effort to beat, scalpers will use systems like lotteries. You send in your name, you get a number, and if you're picked, you get tickets.'",
        "'speaker_6': 'That's not available at Red Rocks, is that correct?'",
        "'speaker_9': 'You know.'",
        "'speaker_6': 'Pardon me, of places with the access system.'",
        "'speaker_9': 'The short answer is yes. It is a little bit more complex. Answer is that's kind of the way that the system works now where you go in and you are put into a random order. But access and this is not at our venues right now.'",
        "'speaker_9': 'AEG is doing this at the Mission Ballroom and some of its other venues. You can sign up as part of a preferred fan program that lets you have early access to those tickets and be in a lottery to actually get those tickets.'",
        "'speaker_9': 'So Access could do that at Red Rocks if the promoter wanted that.'",
        "'speaker_6': 'Okay. Thank you. Just a comment. The thing that drives me crazy is that the $75 ticket ends up being 97 or 102. And I'd love to see the advertising be the final price. And I believe a lot of the promoters and companies are working in that direction.'",
        "'speaker_6': 'And the last thing that I wanted to say, I was really interested to hear what you said, that out of town purchasing is is so large. With all the mistakes I have made in my life as a parent, I get the most forgiveness for the fact that I slept outside of King Bee Records, which is now Spanx'",
        "'speaker_6': 'Roadhouse on East Evans, and slept overnight and got my kids for two throw center seats for Michael Jackson's victory tour. And and while I'd be willing to do that still, it's not available anymore.'",
        "'speaker_9': 'It's a hell of a dad.'",
        "'speaker_6': 'Yeah, well, there you go. Thank you.'",
        "'speaker_0': 'Thank you, gentlemen. Kels, behind you. Back up.'",
        "'speaker_4': 'Yes, sir. Thank you, Mr. President. And think. Thank you. Councilwoman Black reminded me you had mentioned what would happen if we used a different vendor or another. I think that's an interesting point, because another concern that we had was the perception of monopolistic practices.'",
        "'speaker_4': 'But. That's a that's not really an issue with the city of Denver. That's more an issue, the potential issue with the industry like. So regardless of which which vendor arts and venues chose or the city of Denver chose, would kind of be in the same boat.'",
        "'speaker_4': 'Is that a fair statement?'",
        "'speaker_9': 'Yeah, that's fair.'",
        "'speaker_4': 'So and parts and venues of the city of Denver has. But what is what authority or power would we have to break up monopolistic practices?'",
        "'speaker_9': 'That's a big question. You know, I don't know that there's an easy answer to that. You know, this is an industry. You know the industry. I think when you start again, going back to, you know, the boss act, I think that what you see is that ticketing artist management, venue management, promoters.'",
        "'speaker_9': 'They are all so intertwined that, you know, these things are tough to unwind something. And again, I think this is important that I didn't say earlier, the boss act isn't looking just at. Ticketing companies. You know these are practices like Councilman Cashman said that that affect.'",
        "'speaker_9': 'That are affected by artists that are affected by promoters. So you know in this particular case, since we own and operate our own venues, you know, I think we're sort of free of some of that monopoly. We get to choose who we want based, you know, not based on, you know, who our parent company is.'",
        "'speaker_4': 'Okay. Thank you. And is this that you were talking about data of my visit or from the visitors that public record? It's something that an open records request could.'",
        "'speaker_9': 'Yeah, I think so. Um, I'm not sure, but it's cool stuff, so I want to share it.'",
        "'speaker_4': 'I'm assuming not at the individual level.'",
        "'speaker_9': 'No, that's. That is not horrible.'",
        "'speaker_4': 'Okay. Thank you. Thank you, Miss President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Ortega.'",
        "'speaker_7': 'Brian, I just have one question for you. For people who don't want to pay the fees or don't want to order online. Can you just tell the listening audience how they can still purchase a ticket?'",
        "'speaker_9': 'Sure. That's an important question, because the last time that this this contract came through city council, it was actually a request of council that we and access or whoever the contractor was, provide a little more face friendly service and a way to purchase tickets for no fees.'",
        "'speaker_9': 'And so as a result of that, you can go to any of the city box offices. And I want to be clear that those are our own venues. So if you want to go to Red Rocks and buy a ticket to a show at the Coliseum, you can do that.'",
        "'speaker_9': 'And if you're at the Coliseum, you can buy that ticket with no fees at all. If you are if you're paying with a credit card at the Coliseum, you're going to pay that, I think 3% credit card fee.'",
        "'speaker_9': 'But if you walk up with cash, which plenty of people do, you can buy those tickets for for no fees at all.'",
        "'speaker_7': 'And will you just clarify if Pavilion is one of those venues?'",
        "'speaker_9': 'Love it. Pavilion is not one of the city owned and operated venues, so. No.'",
        "'speaker_7': 'Okay. That was the one I had issues with related to that.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. See no other questions or comments on this issue. Madam Secretary, roll call.'",
        "'speaker_2': 'I. CdeBaca I Flynn I Gillmor I. Herndon Hines. High Cashman. Kenny Ortega Sandoval, I. Sawyer Torres. Hi, Mr. President.'",
        "'speaker_0': 'Right, Madam Secretary, please close voting and note the results.'",
        "'speaker_2': '39.'"
    ],
    "Approves the following Mayoral appointments and reappointment to the Denver Community Corrections Board: appointment of Steven Abraham to serve as a representative of the District Attorneys Office for a term effective immediately and expiring 6-30-21; appointment of Paul Rosenthal to serve as a citizen representative for a term effective immediately and expiring 6-30-22; and appointment of Frances Gomez to serve as a representative of the Sheriffs Department for a term effective immediately and expiring 6-30-23 or until a successor is duly appointed and the reappointment of Jane Prancan to serve as a citizen representative for a term effective immediately and expiring 6-30-23 or until a successor is duly appointed.  The Committee approved filing this item on 12-17-19.": [
        "'speaker_0': '39 Council Resolution 1220 has been adopted. Madam Secretary, if you please put the next item on our screens and Councilman Herndon, if you'd please put Council Bill 1236 on the floor.'",
        "'speaker_8': 'Yes, Mr. President. I move that council bill 19 dash one, two, three, six, be published.'",
        "'speaker_0': 'It has been moved and seconded. Councilwoman, back your motion. You have a motion to postpone?'",
        "'speaker_5': 'Yes, I am requesting that we refer this to committee. We have two sets of appointments for the Community Corrections Board. And I'm hoping that instead of dragging you all through the questions tonight, we can just ask together.'",
        "'speaker_0': 'Okay, so you have a motion. Do you want to go ahead and move comfortable? 1920. Necessary referral. Sorry, I misspoke. Not postponement. You're asking for a referral. You're going to go. I'd make the motion.'",
        "'speaker_5': 'I move that council bill 19 1236 be referred to committee.'",
        "'speaker_0': 'Has been moved near the second and seconded so now comments. Anything you want to add to what you had already said about the referral?'",
        "'speaker_5': 'Just opportunity to refer it. If we don't, then I would love to ask the questions tonight before we vote and vote separately.'",
        "'speaker_0': 'Okay. Councilman Ortega.'",
        "'speaker_7': 'I have a question for Greg, if you wouldn't mind coming forward. Greg Morrow.'",
        "'speaker_4': 'Greg Morrow, Director of Community Corrections.'",
        "'speaker_7': 'So other than these appointments tonight, are there any other vacancies that will be coming up in the immediate future?'",
        "'speaker_4': 'Yes, Councilwoman. And actually Ramon Pacheco is also here, the boards and commissions director for Mary Hancock. Maybe she would be better suited to answer what's coming forward. We do have four vacancies on the Community Corrections Board aside from the ones before council tonight.'",
        "'speaker_7': 'Okay. And if you could highlight whether Romain, if you wouldn't mind introducing yourself.'",
        "'speaker_5': 'Good evening. Romaine Pacheco, director of Boards and commissions and community outreach for the mayor.'",
        "'speaker_7': 'So of the four vacancies that are still yet to be filled, are there specific categories that need to sort of be checked off in order to appoint people to those seats?'",
        "'speaker_5': 'Yes, Councilwoman Ortega, the ordinance is prescriptive in terms of who it is that can serve on the Community Corrections Board. We actually have two vacancies currently. There are two other appointments that have been made that are awaiting the process through city council.'",
        "'speaker_5': 'But currently we have a vacancy for a representative from Denver Public Schools. The other is for an expert in criminal justice.'",
        "'speaker_7': 'Okay. And the two that are pending. What are those categories?'",
        "'speaker_5': 'Representatives from the Department of Safety and a local elected official. Okay.'",
        "'speaker_7': 'And local elected doesn't mean somebody serving on this body. It means somebody that can be serving in the state legislature. That is correct. Okay, great. I have no further questions.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. And I believe before we go too far down the path of questions, I need a clarification either from legal or our Madam Secretary over there. Right now should only be debating the postponement. Take the vote on the postponement, and then we can ask questions if it's not postponed.'",
        "'speaker_0': 'About the actual board and and things. So right now only discussion on whether to postpone or not.'",
        "'speaker_5': 'To re refer.'",
        "'speaker_0': 'Correct? I'm sorry. I keep saying postpone to re refer. So. So. Okay, so.'",
        "'speaker_7': 'That was helpful to me to know how to vote. So that's why.'",
        "'speaker_0': 'Just to clarify, before we get too far down the rabbit hole, these are discussion on the postponement, not on the bill. Councilwoman CdeBaca, you back up.'",
        "'speaker_5': 'No, no, no.'",
        "'speaker_0': 'Okay. All right. So. So nobody else on the postponement. Let's vote on that, Madam Secretary. Sorry.'",
        "'speaker_3': 'Referral.'",
        "'speaker_0': 'Referral. Madam Secretary. Roll call on the referral.'",
        "'speaker_2': 'Sorry. A little slower. Black.'",
        "'speaker_5': 'CdeBaca, I.'",
        "'speaker_3': 'Flynn No.'",
        "'speaker_2': 'Gilmore. Herndon.'",
        "'speaker_8': 'No.'",
        "'speaker_2': 'Hines.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Cashman. Can each have Ortega? No. Sandoval. I. Torres.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_0': 'No. Councilman Kennedy, did you pass? So I think we need to go back.'",
        "'speaker_5': 'I'm sorry. I'm not feeling well. We're voting on the motion to a.'",
        "'speaker_0': 'Motion to re refer to committee.'",
        "'speaker_5': 'Yes.'",
        "'speaker_0': 'I. All right, Madam Secretary, now, if you can, because voting announced the results.'",
        "'speaker_2': 'Yes. Seven, eight, eight. Nick. Seven eyes. Six knees.'",
        "'speaker_0': 'Seven eyes. Six knees. Counts with a one, two, three, six has been referred back to committee and will be scheduled at a later date. All right, Madam Secretary, if you could please put the next item on our screen.'"
    ],
    "A bill for an ordinance approving a proposed Cooperation Agreement between the City and County of Denver and 4201 East Arkansas Urban Redevelopment Area, to establish, among other matters, the parameters for tax increment financing with incremental sales and property taxes. Approves a cooperation agreement with Denver Urban Renewal Authority for the 4201 East Arkansas Urban Redevelopment Area to establish the parameters for tax increment financing with incremental sales and property taxes in Council District 6. The last regularly scheduled Council meeting within the 30-day review period is on 12-16-19. The Committee approved filing this item at its meeting on 11-12-19.": [
        "'speaker_0': 'And Councilman Herndon, if you could please put Council Bill 1246 on the floor.'",
        "'speaker_8': 'Yes, Mr. President, I move that council bill 19, dash one, two, four, six be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. Councilwoman Black, your motion to postpone on this item.'",
        "'speaker_3': 'Michael.'",
        "'speaker_5': 'I move that final consideration of Council Bill 19, does 1246 be postponed to the end of tonight's public hearing on council built 19 Dash 1245.'",
        "'speaker_0': 'Thank you, Councilman. And we're waiting for technology to catch up on your motion here. It's been moved. Can I get a second? It's been moved and seconded. Comments by members of council. Councilman Black.'",
        "'speaker_5': 'Thank you. Since Council Bill 1245 and 1246 are companion bills related to the East Arkansas redevelopment, I ask that my colleagues postpone consideration of Bill 1246 until after the public hearing on 1245 this evening.'",
        "'speaker_0': 'Thank you, Councilwoman. Thing. No other comments on this item, Madam Secretary. Roll call on the postponement.'",
        "'speaker_5': 'Black Eye. CdeBaca Eye.'",
        "'speaker_2': 'Flynn. Gillmor. Herndon High. Haynes. High Cashman. Kenny Ortega. Sandoval, I. Torres.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting, announce the results.'",
        "'speaker_2': '13 Eyes.'",
        "'speaker_0': '13 eyes. Final Consideration of Cats. Bill 1246 has been postponed to after the public hearing on Council Bill 1245. That concludes the items to be called out this evening or other bills for introduction are ordered published. Council members remember that this is a consent or block vote and you will need to vote.'",
        "'speaker_0': 'Otherwise, this is your last chance to call an item out for a separate vote. Councilman Herndon, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_8': 'Yes, Mr. President, I move that the resolutions be adopted and the bills on final consideration be placed upon final consideration and do pass and then block for the following items. All Series 2019 unless stated 1238 1268 1252, 1261 1267, 1275 1230 1253, 12, 7011, 16, 11, 89.'",
        "'speaker_0': 'Thank you, Councilman. It has been moved and seconded. Madam Secretary, Roll Call.'",
        "'speaker_2': 'Black Eye. CDEBACA Hi. Flynn Hi. Gilmore. I. Herndon, I. Hines Hi. Cashman. Kenny. Ortega. Sandoval. I. Sawyer. Torres. I. Mr. President.'",
        "'speaker_0': 'Hi, Madam Secretary. Please. Because the voting announced results.'",
        "'speaker_2': '13 eyes.'",
        "'speaker_0': '13 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Tonight, there will be a required public hearing on Council Bill 1057 changing the zoning classification of 2975 Huron Street and five points a required public hearing on Council Bill 1058 Changing the zoning classification for 2100 South Colorado Boulevard 4040'",
        "'speaker_0': 'East Evans Avenue 2140. South Albion Street 2132 2150 South Corridor Boulevard and 4102 two 4108 East Evans Avenue and required public hearing on Council Bill 1245 approving the 4201 East Arkansas Urban Redevelopment Plan and the creation of the 4201 East Arkansas Urban Redevelopment Area, and that 4201 East Arkansas sales and property tax increment areas.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2975 Huron Street in Five Points. Approves an official map amendment to rezone property located at 2975 Huron Street from R-MU-30 with waivers to C-MX-12 (residential, mixed-use to urban center, mixed-use) in Council District 9. The Committee approved filing this item at its meeting on 10-15-19.": [
        "'speaker_3': 'There we go.'",
        "'speaker_0': 'And it looks like we have motion in second. Thank you. All right. The public hearing for Council Bill 1057 is open. May we have the staff report?'",
        "'speaker_10': 'Yes. Thank you. Good evening. I'm Courtney Livingston with Community Planning and Development. And this is a map amendment application is located at 2975 Huron Street in the five point statistical neighborhood in Council District nine on the western edge of the five Points neighborhood, just a half mile from Union Station in the CPV Prospect and neighborhood area, the'",
        "'speaker_10': 'request is to rezone the southern two thirds portion of the property, which is about an acre and a half to Cemex 12 to match the existing zoning on the northern third of the property. There's an existing five story multi-unit building that was constructed recently about in 2013.'",
        "'speaker_10': 'The applicant is not proposing to demolish the existing building or redevelop in connection with this requested rezoning. The objective, as stated in their application, is simply to unify the zoning on the property. So in terms of existing zoning and the portion of the property that is the subject of the rezoning is currently zoned r m you 30'",
        "'speaker_10': 'with waivers and that's outlined in red. You can easily see here from this map that the existing split zoning is asking to rectify with a single existing multi-unit building spanning both the C-Max 12 and the RMU 30 zoning on that site.'",
        "'speaker_10': 'The waivers from 26 for that arm, you throw the old code zoning, those waived all open space and setbacks. You can see from this the surrounding zoning that there's a lot of CMCs 12 already in the area and AMI 30 is interspersed in there, but primarily it is Cmax 12.'",
        "'speaker_10': 'So a portion of the subject property is within the cause field view plane. The View Plane was enacted in 2009 to maintain and protect mountain views from the upper deck seats. Of course the view plane limits, building height, then a portion of that subject property.'",
        "'speaker_10': 'So that little bottom piece right there to a maximum of 73 feet in height. So that's about six storeys. In terms of existing land use. The property containing the subject site currently has a multi-unit residential building, as I previously mentioned.'",
        "'speaker_10': 'The properties in north is vacant land to the east. There's more multi-unit, residential and some office industrial uses and directly to the south as a restaurant and to the west is a multi-unit residential. So that gives you a flavor of what's going on in that area.'",
        "'speaker_10': 'The tap photos is of the existing building to which the southern portion of that existing building is the subject of this rezoning. The bottom of the photo is that restaurant that's to the south. Next, there are some photos of properties to the east.'",
        "'speaker_10': 'The yellow arrows shows where it is in relation to the subject site. And here are some photos of the properties to the West. In terms of process. The Map amendment application was noticed according to code requirements. A staff has not received any comments related to this application.'",
        "'speaker_10': 'The applicant has reported to reach out to the surrounding Arnaud's and the tenants in the area as well as the Union Station Arno. Union Station, North Arno. No concerns were expressed. In terms of public comment that I received, a few questions were asked and they were mostly clarifying in nature and they stated that they didn't want to'",
        "'speaker_10': 'submit a formal comment because they just had questions about what is the rezoning if the building was going away. So the code provides five review criteria for evaluating map amendments will step through how the application meets each one of those.'",
        "'speaker_10': 'There are four plans that apply to this rezoning plan 2040 Blueprint Denver, the downtown area plan and the CPV Comprehensive Plan Amendment. That's from 1991. So the application is consistent, consistent with many goals and strategies outlined in comprehensive plan 2040.'",
        "'speaker_10': 'More detail can be found on page 13 of the staff report. More specifically highlighted is how this request is for rolling policy under the equitable, affordable, inclusive vision element of the comprehensive plan. By allowing the existing residential development to remain in, that's near transit, and that helps those residents have access to transit relatively nearby.'",
        "'speaker_10': 'Secondly, the request furthers environmental goals by enabling existing building remain and preventing additional demolition waste. Furthering our climate and environmental goals. Next, move on to how the request is consistent with Blueprint. Denver Blueprint identifies the subject site as being part of the urban center neighborhood context and Blueprint.'",
        "'speaker_10': 'Future neighborhood contexts are used to understand differences across land use in built form and mobility options at a higher scale. And the urban center context is generally described as a higher intensity. Context has a mix of residential and employment, uses the sense the site promote proposed is being asked to be zoned to see x 12 and that'",
        "'speaker_10': 'allows for all those things and is within the urban center context. Hence the see it's consistent with that plan guidance. The future places map shows the subject property as part of the high median residential area. Blueprint describes those aspirational characteristics of the urban center.'",
        "'speaker_10': 'Context is a mix of uses, including multi-unit residential with heights generally up to eight storeys. It's important to note that blueprint also caveats. Height guidance provided in the plan is simply to provide a general sense of scale and is not intended to send exact minimums or maximums.'",
        "'speaker_10': 'So may be instances like these where building heights taller than what specified are appropriate. Taking into the surrounding context of all the CMCs 12 zoning around that, that entire entitlement and the close proximity to Union Station, which is the mobility hub.'",
        "'speaker_10': 'Additionally, the site is primarily served by 20th, which is a mixed use arterial. Moreover, blueprint's growth strategy. That's one of the criteria and blueprint we looked for consistency with. This is a version of the future places map showing aspirational just distributing future grocer in across Denver.'",
        "'speaker_10': 'The subject site is part of the high median residential area and citywide these areas are anticipated to see around 30% of new housing growth and 5% of new employment growth by 2040. Again, this is not proposing a new building on this site at all.'",
        "'speaker_10': 'It's just asking for the existing building to remain with unified zoning. So we're going to move on to the downtown area plan, which was adopted by City Council in 2007 and applies the subject property. The plan shows the subject as part of the Central Valley District and part of the Prospect Subdistrict of the plan.'",
        "'speaker_10': 'There's no specific discussion of the plan related to future land use or building heights, however, does generally describe the area as mixed use with residential general commercial retail. So the proposed zoning is consistent with the plan as it will allow for the mixed use as recommended in the final small area plan that applies.'",
        "'speaker_10': 'This MAP amendment is the Central Platte Valley Comprehensive Plan Amendment adopted way back in 1991. The plan identified the area as general, mixed use and recommended low rise heights. But those low rise heights was not specifically defined in the plan.'",
        "'speaker_10': 'The proposed TMX 12 zone district, as with all other existing zoning in this sub area, allows for more mid-rise heights rather than the low rise as recommended by the plan. And also that kind of the higher zoning that's requested is mitigated by the view plan and more recent planning guidance in the area.'",
        "'speaker_10': 'That said, on balance defines the application to be generally consistent with this adopted plan. So all in all, Sefton's requested zoning also meets next three criteria. The rezoning will result in a uniformity of district regulations and will further the public health, safety and welfare primarily through its implementation of adopted plans and by supporting the existing housing density'",
        "'speaker_10': 'in mixed uses that are already in place and the application meets the justifying circumstance criteria. As the city adopted the new code in 2010 and the portion of the subject site, which is the what we're talking about to be re zoned retained former chapter 59.'",
        "'speaker_10': 'So that justifies the rezoning. And so the final review criteria is consistency with neighborhood context, zone, district purpose and intent statements. The requested zone district is within the urban center neighborhood context, which only consists of multi-unit, residential and mixed use commercial areas with high levels of bike and pedestrian access to transit.'",
        "'speaker_10': 'That said, CMCs 12 would support the existing multi-unit residential with convenient bike and PED access to Union Station. Consider with consistent with the urban center context, description, description and mixed use intent. Purpose X 12 is also intended to apply to areas in intersections primarily served by major arterial streets and building scale.'",
        "'speaker_10': '3 to 12 storeys site is generally served by 20th, which is a mixed use arterial, and the proximity to Union Station makes this zone district requested appropriate. So finally, we recommend approval of the application based on finding all review criteria have been met.'",
        "'speaker_10': 'The applicant's representative is here if you have any more specific questions for them. Thank you very much.'",
        "'speaker_0': 'Thank you. All right. We have four individuals signed up to speak on this item this evening, so I'm going to call you up. First up is James dear. And so. Darren. So I apologize. I think I got that one wrong.'",
        "'speaker_6': 'It's Italian. Good evening. Thank you for the time. James dear Enzo.'",
        "'speaker_0': 'Proud resident.'",
        "'speaker_3': 'Of the Baker neighborhood.'",
        "'speaker_6': 'And Lucky District seven. Thank you for the good work, Councilman. Council President. Clerk. I am a representative for Griffiths Residential, the owner and manager of.'",
        "'speaker_3': 'The subject community. We are a locally based apartment owner.'",
        "'speaker_6': 'Operator. We are not a developer.'",
        "'speaker_3': 'We hold our properties long term.'",
        "'speaker_0': 'And try to focus heavily on the.'",
        "'speaker_6': 'Resident experience. We'd like to say thank you to Courtney for.'",
        "'speaker_0': 'The hard work and diligence.'",
        "'speaker_3': 'On this process. It's been great to work with her.'",
        "'speaker_6': 'We when we acquired this property in 2017, we noticed.'",
        "'speaker_0': 'In kind of.'",
        "'speaker_6': 'Diligence that it had two.'",
        "'speaker_0': 'Different zoning. So that was confusing and difficult.'",
        "'speaker_4': 'For us.'",
        "'speaker_6': 'To understand, especially given that the.'",
        "'speaker_0': 'Southern two thirds was zoned.'",
        "'speaker_6': 'Under the old code, which was revised in 2010.'",
        "'speaker_4': 'So this is.'",
        "'speaker_0': 'Just a clean up for us. It's really more about just making sure it's consistent and within the new zoning code.'",
        "'speaker_6': 'And.'",
        "'speaker_0': 'You know, no absolutely no plans to.'",
        "'speaker_6': 'You know, disrupt or the buildings actually was built in 2013 I think last year was 2015. So very.'",
        "'speaker_3': 'New.'",
        "'speaker_6': 'Nice building that we're not changing anything about.'",
        "'speaker_0': 'Thank you very much. All right. Next up, Caitlin Quander.'",
        "'speaker_5': 'Good evening. Council President Members of Council Caitlin Quadrillion, Youth Counsel to the applicant. I'm a resident of Denver in District six, so this application meets each of the criteria in the code for rezoning approval as a staff report and ah, submit a letter walk through.'",
        "'speaker_5': 'And as Jim described, this was an interesting zoning analysis. When Griff Griffiths first looked to acquire the property in 2017, there was a kind of question of, well, it has two different zoning laws and one's old code and one's new code and do we comply?'",
        "'speaker_5': 'We were able to determine that the property does comply. But when the opportunity arose to clean this up and provide that clarity and uniformity across the building and property, we wanted to pursue that. I think after reviewing the property and discussing with staff.'",
        "'speaker_2': 'It's clear to us that if the waiver.'",
        "'speaker_5': 'Is on the review 30 had not been in place in 2010, this portion of the property would have been zoned along with the northern portion that was resolved in 2010. So hopefully tonight we're hoping to clarify that and and come away with one uniform zoned district across the property.'",
        "'speaker_5': 'So if that were available, if there's any questions. And thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Chairman Seiko.'",
        "'speaker_3': 'Yes. My name is TerraCycle, founder. Organizer. That's action movement for self-defense. Born and raised 5.67 years old. To celebrate my birthday on Thanksgiving, 1952. It was on a Thursday. Okay, here we go. Here we go. Zoning changes. Protect the existing owners for future appreciation of value of property.'",
        "'speaker_3': 'Out of money made on the zoning changes? No. Nobody asked for zoning change without a plan. But now is the time to tell folks what the plan is. This area has been totally gentrified. No. Well, very few black folks exist.'",
        "'speaker_3': 'So this is really a zoning change to make it appear as if it's okay to do this by city council approval to approve the gentrification process and make it appear as if it's okay. Kind of like how the West was won when you killed all the Indians and then you declared the changed names and they're like five'",
        "'speaker_3': 'points. We're museum relics. We no longer exist other than pictures on the wall. About where black folks used to be. And the diversity that exists and the privilege is very clear. Look at who's the owners. All white people with white women as a front.'",
        "'speaker_3': 'Taking advantage of the civil rights movement where we died for legislation to make it there, and then we're systematically excluded. Yeah. Yeah. But nobody surprised. Because this is what you've been doing ever since. I've been down here for almost 20 years.'",
        "'speaker_3': 'So we go basis. I. I can't go because you said you were different than the ones that you replaced. And now, again, we have profit over the people because who can't be there in that area. Are you going to come back and repatriate people who was ethnically cleansed?'",
        "'speaker_3': 'No. That's not part of the plan. And you ain't got to, because that's not part of the requirements with the zoning.'",
        "'speaker_0': 'I'm sorry. Your time is up. Thank you very much. Next up, Jesse first.'",
        "'speaker_12': 'Good evening. Members of council, members of the audience, those watching at home. My name is Jesse LaShawn Pearce. I ran for city council by a large, almost 15,000 votes with no money. And I'll be running again in 2023 to be your next mayor.'",
        "'speaker_12': 'And I'm represented for Denver. Homeless out loud, Black Star. It's a moment for self defense, positive action coming for social change, as well as the Unity Party of Colorado and a universal African People's Organization. The Denver Chapter and Mile High knows.'",
        "'speaker_12': 'In regards to this rezoning change. As Temasek, who has already alluded to this, is full blown gentrification. I know firsthand who is residing in this property right now because I've moved people into this. White supremacy on clave because that's what it is.'",
        "'speaker_12': 'When I was moving people into this property, they were constantly calling the police on our on house neighbors who just so happened to be in the alley. I asked them to leave them alone, but they consistently called the police on them because they don't want undesirables in the area.'",
        "'speaker_12': 'This area is prime real estate. It is nothing but rich white millennials living here. I did not feel safe in this area. I did not feel at home. I felt like I was in a completely different area of town.'",
        "'speaker_12': 'And yet this is still the five points. So I have a few questions that I would like the property owners to answer. I want to know what is the current AMI level for this property? Because the person that I move said they were paying at least $2,000 a month for a one bedroom.'",
        "'speaker_12': 'And then what businesses are you going to put here because you're rezoning this for commercial use? I want to know exactly what businesses are going to be here is going to be another restaurant like it is like across the streets where there was no people of color, so-called in the vicinity.'",
        "'speaker_12': 'It was all whites from beginning to end, like I said. So I want to know those questions and I don't know how you can get away with calling us affordable because this place was nowhere close to affordable. It looks like you have to have big money to even attempt to walk down the street over here, let alone'",
        "'speaker_12': 'the rent there. So I want to sue to answer those questions, especially since we can do better and we have a housing crisis in this town. But get your rezoning properties that are at, I'm guessing, anywhere between 60 to 100% at my level.'",
        "'speaker_12': 'What I would like the occupant to answer those questions for me. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers on this item. Are there any questions from members of council? Councilman Flint.'",
        "'speaker_3': 'Thank you. Courtney, could you. I'm having a little trouble understanding what is gained by the rezoning versus what is is what is lost by not rezoning. If it were to remain as it is, what harm is done? Any?'",
        "'speaker_10': 'No.'",
        "'speaker_3': 'So the change is being sought. It's an existing building. In fact, it's all part of a single structure, is it not? Yep. Okay. And it just straddles two different zones, and it met all the requirements of both. Let me rephrase that as a question.'",
        "'speaker_3': 'Did it meet all the requirements of both zone districts when it was built?'",
        "'speaker_10': 'Yes, it did. And the applicant provided a very thorough analysis of the site plan and how it is a compliant structure in both zone districts.'",
        "'speaker_3': 'Okay. I did read through the staff report, but I didn't. I must not. Is it in the staff?'",
        "'speaker_10': 'No, it's in the application that's in attachment.'",
        "'speaker_3': 'Thank you. Are there different rules? Governing the structure depending on which side of the building you're on.'",
        "'speaker_10': 'No. You see him? Cinemax 12 and Army's 30 are pretty similar. Kind of like they translate over pretty well, you know, in Army 30. But that is the uses that are not okay and Army 30, but they're allowed in.'",
        "'speaker_10': 'CMCs 12 are very sporadic, like a car wash or car sales. Right. So there's a few uses that are not okay in one, but okay and the other. And they're they're not really applicable because this site is is not.'",
        "'speaker_3': 'Proposing.'",
        "'speaker_10': 'Any change.'",
        "'speaker_3': 'Right. Okay. Well, thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Flynn. See no other questions. The public hearing for Connersville 1057 is closed. Comments by members of Council. Um. Councilman CdeBaca, did you want to go first? This one is in your district? Yes.'",
        "'speaker_5': 'Yeah, I have no comment.'",
        "'speaker_0': 'No comment. All right. And Councilman Flynn, your name is still hanging from questions or you back up for now.'",
        "'speaker_3': 'Mr. President, my. That's just there. I have no idea why it's there. Right there. I took it off.'",
        "'speaker_0': 'All right. All right. So no comments. I will just think staff for the staff report and for all the hard work in putting that all together for us. I think this clearly meets the criteria and I will be voting to support it this evening.'",
        "'speaker_0': 'Madam Secretary, roll call.'",
        "'speaker_5': 'I. Blank. I.'",
        "'speaker_2': 'CdeBaca. I. Flynn. I. Gilmore. I. Herndon.'",
        "'speaker_9': 'I.'",
        "'speaker_2': 'Hines. I. Cashman. Ortega. Sandoval. I. Sawyer. I. Torres. Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please close voting. Announce the results. 1339, his council Bill 1057 has passed. Councilman Herndon, will you please put Council Bill 1058 on the floor?'"
    ],
    "A bill for an ordinance changing the zoning classification for 2100 South Colorado Boulevard, 4040 East Evans Avenue, 2140 South Albion Street, 2130-2150 South Colorado Boulevard and 4102-4108 East Evans Avenue in University Hills. Approves an official map amendment to rezone properties located at 2100 South Colorado Boulevard, 4040 East Evans Avenue, 2140 South Albion Street, 2130-2150 South Colorado Boulevard, and 4102- 4108 East Evans Avenue from C-MX-5 and C-MX-5 UO-1, UO-2 to C-MX-12 (urban center, mixed-use, five-stories to urban center, mixed-use, twelve-stories) in Council District 4. The Committee approved filing this item at its meeting on 10-22-19.": [
        "'speaker_8': 'Yes, Mr. President. I move the council bill of 19 dash 1058 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you, Councilman. It has been moved and seconded. The public hearing for Council 1058 is now open. May we have the staff report?'",
        "'speaker_6': 'Yes, thank you. Scott Robinson with Community Planning and Development. This is a request to rezone 2120 132, 21, 50 South Colorado.'",
        "'speaker_4': 'Boulevard, 4040 and.'",
        "'speaker_6': '4102 to 40.'",
        "'speaker_4': '1 to 8 Evans Avenue.'",
        "'speaker_6': 'And 2140 South Albion Street from see Amex five and select 501022c Annex 12 property is located in Council District four in the University Hills neighborhood at the southeast corner of Evans Avenue and Colorado.'",
        "'speaker_3': 'Boulevard.'",
        "'speaker_6': 'Just south of the Colorado station. Light Rail Stop. The property is just.'",
        "'speaker_4': 'Under two acres.'",
        "'speaker_6': 'Currently has a single storey retail structure on it and a parking lot. As I said, the request is to go from six, five and six five, you zero one, you go to. Most of the property is 650102.'",
        "'speaker_4': 'Which is.'",
        "'speaker_6': 'Urban center mixed use, five storey maximum.'",
        "'speaker_4': 'Height with the adult use.'",
        "'speaker_6': 'And billboard overlays. And then a small.'",
        "'speaker_4': 'Sliver of select site does.'",
        "'speaker_6': 'Not have the.'",
        "'speaker_4': 'Adult use and billboard overlays. The request is to go to see an x 12, which is urban center mixed use 12 story maximum.'",
        "'speaker_6': 'Height in order to redevelop the property. So you can see the existing zoning there with the surrounding CSX five to the south and east s and X five to the west across Colorado Boulevard and see an x 20, which is 20 straight zoning to the north across to Evans Avenue.'",
        "'speaker_6': 'The property is also part.'",
        "'speaker_4': 'Of the Corridor Station General Development Plan, which was adopted in 2008.'",
        "'speaker_6': 'It's in the secondary GDP area development area, too, which generally calls for office and retail uses with.'",
        "'speaker_4': 'Heights up to six stories. However, the GDP does not specifically allocate use height or density, and those things.'",
        "'speaker_6': 'Can be changed without any amendment whatsoever to the general development plan.'",
        "'speaker_4': 'As I.'",
        "'speaker_6': 'Mentioned, the property currently has a.'",
        "'speaker_3': 'A.'",
        "'speaker_6': 'Retail structure on it and parking lots. And then you can see surrounding uses a new residential structure immediately to the south.'",
        "'speaker_4': 'Commercial uses up and down.'",
        "'speaker_6': 'Evans and Colorado Boulevards. And here you can see the subject site and some of the surrounding properties. This application went to the planning board on October 2nd or received a recommendation of approval by a 7 to 1 vote.'",
        "'speaker_6': 'Three members of the public spoke in favor of the application at that hearing. I went to Land Use Transportation and Infrastructure Committee on October 22nd. In your packet you have public comment, including 35 letters of support from members of the community and two letters of support.'",
        "'speaker_4': 'From registered neighborhood organizations.'",
        "'speaker_6': 'The University Hills North Community and the University Park Community Council, the University Hills North. Community support is based on the.'",
        "'speaker_4': 'Signed Good Neighbor Agreement that is also included.'",
        "'speaker_6': 'In your packet. In order to.'",
        "'speaker_4': 'Approve a rezoning, the city must find that.'",
        "'speaker_6': 'These five criteria have been. The first criterion is consistency with adopted plans. There are four adopted plans that apply to this property. The first adopted plan is Comprehensive Plan 2040 that was adopted earlier this year as described in the staff report.'",
        "'speaker_6': 'Staff has found the proposed rezoning is consistent with these seven strategies from Plan 2040, including strategies related to equitable development by concentrating development in areas close to mixed use development and near transit, which this site would be, as I mentioned, just south of the Colorado Station Transit Center, and also served by transit on both Colorado and Adams'",
        "'speaker_6': '. The second plan is Blueprint Denver also from 2019. The future context for the.'",
        "'speaker_4': 'Site is Urban Center, which is consistent with the key context of.'",
        "'speaker_6': 'The proposed TMX 12 zoning, calling for high intensity residential and employment areas and.'",
        "'speaker_4': 'Substantial.'",
        "'speaker_6': 'Mixed abuses. The future place for this property is what's called Community Corridor, which calls for a mix of office, commercial.'",
        "'speaker_4': 'And residential.'",
        "'speaker_6': 'Uses and says heights generally up to eight stories. However, that's just a.'",
        "'speaker_4': 'General guideline, and that can be higher or lower.'",
        "'speaker_6': 'Depending on specific factors, which I'll get into in just a minute. Both Colorado.'",
        "'speaker_4': 'Boulevard and Evans.'",
        "'speaker_6': 'Avenue are mixed use arterials, which indicate a.'",
        "'speaker_4': 'Appropriateness for higher.'",
        "'speaker_6': 'Intensity mixed use.'",
        "'speaker_4': 'Development, such as the.'",
        "'speaker_6': 'Proposed TMX 12.'",
        "'speaker_3': 'Zoning.'",
        "'speaker_6': 'It's also within the community corridors and.'",
        "'speaker_4': 'Center's growth area, which calls for 25%.'",
        "'speaker_6': 'Of new housing and 20% of new.'",
        "'speaker_4': 'Jobs over.'",
        "'speaker_6': 'The next 20 years. The proposed rezoning is also consistent with strategies from Blueprint Denver, including general policy one strategy which calls for encouraging higher density mixed use development in transit rich areas, particularly areas community corridors such as this, where transit per priority streets are planned.'",
        "'speaker_6': 'Both Carr.'",
        "'speaker_4': 'Colorado Boulevard and Evans Avenue.'",
        "'speaker_6': 'Are transit priority streets in Blueprint Denver. So this is an area appropriate for higher density.'",
        "'speaker_4': 'And then as I mentioned, there are factors in.'",
        "'speaker_6': 'Blueprint Denver setting when higher or lower heights should be considered. So I'll run through some of those.'",
        "'speaker_4': 'First is guidance from a.'",
        "'speaker_6': 'Current small area plan. I'll get into the small area plan guidance in just a minute. But the.'",
        "'speaker_4': 'Small area plan that applies to this property is fairly old, so not exactly.'",
        "'speaker_6': 'Current.'",
        "'speaker_4': 'And does not provide clear guidance.'",
        "'speaker_6': 'The second factor is surrounding context, including existing and.'",
        "'speaker_4': 'Planned building heights.'",
        "'speaker_6': 'As I mentioned, there's five story zoning on three sides, three sides of this property and 20 story.'",
        "'speaker_4': 'Zoning across.'",
        "'speaker_6': 'Colorado Boulevard.'",
        "'speaker_4': 'To the north.'",
        "'speaker_6': 'With 20 story buildings on the north side of Colorado station. So there are taller buildings in the area and zoning for taller buildings immediately adjacent to this property.'",
        "'speaker_4': 'The third factor is transitions, including transitions from higher intensity to lower intensity areas. So as I mentioned, the 20 story zoning immediately to the north, five story zoning to the.'",
        "'speaker_6': 'South, the 12 story zoning would act as a transition between those.'",
        "'speaker_4': 'Two. The fourth factor is.'",
        "'speaker_6': 'Adjacency to transit, especially mobility hubs. So as I mentioned, this is just south of the Colorado station.'",
        "'speaker_4': 'Light rail stop and also served by busses.'",
        "'speaker_6': 'On both Colorado Boulevard.'",
        "'speaker_4': 'And Evans Avenue. And then the last two factors for.'",
        "'speaker_6': 'Achieving planned goals or furthering urban design. This proposal at.'",
        "'speaker_4': 'This time does not specifically address those, but given.'",
        "'speaker_6': 'Are the three factors around context transitions and adjacency to transit staff finds that the proposed request of 1212 story zoning against 12 is appropriate and consistent with.'",
        "'speaker_4': 'The recommendations of Blueprint Denver.'",
        "'speaker_6': 'The third plan is the Colorado Boulevard plan. The small area plan that I mentioned is from 1991.'",
        "'speaker_4': 'So as I said, fairly old.'",
        "'speaker_6': 'It says continue appropriate mix of land uses and new development should be compatible with existing development.'",
        "'speaker_4': 'Also, the.'",
        "'speaker_6': 'Proposed TMX 12 zoning would allow mixed use zoning consistent with what is currently allowed, and the 12 storey zoning would allow appropriate.'",
        "'speaker_4': 'Development heights.'",
        "'speaker_6': 'Consistent as the transition from the taller zoning to the north and the shorter zoning to the south. And then the last.'",
        "'speaker_4': 'Plan is the Colorado Station.'",
        "'speaker_6': 'General Development Plan, which, as I mentioned earlier, calls for.'",
        "'speaker_4': 'Office and retail uses consistent with the.'",
        "'speaker_6': 'Proposed TMX 12 building heights of 1 to 6 storeys.'",
        "'speaker_4': 'Which is less.'",
        "'speaker_6': 'Than the proposed TMX 12.'",
        "'speaker_4': 'However, as I said, the GDPR does not.'",
        "'speaker_6': 'Specifically control height, use or density, and those can be changed without any amendment to the GDP. So staff finds the proposed rezoning consistent with all four plans.'",
        "'speaker_4': 'And the first criterion met.'",
        "'speaker_6': 'The second criterion is uniformity of district regulations. Staff finds the proposed rezoning would result in the uniform application of the Annex 12 Zone District. The third criterion is to further the public health, safety and general welfare of the city.'",
        "'speaker_6': 'Staff finds the proposed rezoning would do so by implementing the city's adopted plans and promoting.'",
        "'speaker_4': 'Walkable mixed use areas.'",
        "'speaker_6': 'Promoting people walking and getting to transit safely and healthily. The fourth criterion is justifying circumstances.'",
        "'speaker_4': 'Staff finds the proposed.'",
        "'speaker_6': 'Rezoning is justified by changed and changing conditions in the area. There's been a fair amount of redevelopment.'",
        "'speaker_4': 'As I mentioned, there's a brand.'",
        "'speaker_6': 'New apartment building just to the south. There's been new development around Colorado Center Station. At that higher height, this is turning into more of a transit.'",
        "'speaker_4': 'Oriented development area.'",
        "'speaker_6': 'And so concentrating more.'",
        "'speaker_4': 'Growth here, allowing more height.'",
        "'speaker_6': 'Especially at an intersection of two major.'",
        "'speaker_4': 'Arterials close to transit, is justified by the changes in the area.'",
        "'speaker_6': 'And the fifth criterion is consistency with the neighborhood context.'",
        "'speaker_4': 'District purpose and intent. Steffens The proposed rezoning would result in.'",
        "'speaker_6': 'Development consistent with the urban center neighborhood context, description and the purpose and intent of the same x 12 zone district, which is intended to apply to areas and intersections served primarily by major arterial.'",
        "'speaker_4': 'Streets.'",
        "'speaker_6': 'Or building scale 3 to 12 storeys if.'",
        "'speaker_4': 'Desired. As I mentioned, both Colorado and Evans are major arterials, so this.'",
        "'speaker_6': 'Is an appropriate location for the next 12 zone.'",
        "'speaker_4': 'District. So staff finds all five criteria have been met and recommends approval. I'll be happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. We have 21 individuals who signed up to speak on this item this evening. So I do apologize. But I'm going to ask if that front row, if you can just move, there's still front row seating available over here just so that we can bring I'm going to bring the speakers up in sets of'",
        "'speaker_0': 'five and use that that bench. So I will call you up five at a time as soon as I call your name, if you'd make your way up to this front bench and then I'll call when I call your name, step right up to the podium so that your time can start.'",
        "'speaker_0': 'I also took a quick look and it looks like of our 21 is overwhelmingly signed up in support of this tonight. You are free to take your full 3 minutes at the microphone. But if we get further down the list and someone has covered the points that you're going to make, you're also welcome to introduce yourself state'",
        "'speaker_0': 'how you feel on this and reiterate quickly some of the points that were made and you don't need to take up the full 3 minutes if you don't need it. All right. Vincent English. Brit Probst, Sandy. Heck, UNMOVIC Chairman Say Qu and Robert Forster.'",
        "'speaker_0': 'If you'd come to the front bench and Vincent English, you are up.'",
        "'speaker_4': 'Thank you. Mr. President, we are currently passing out an information packet for the council here. To the count. To the council clerk. Thank you. Good evening. My name is Vinny English. My address is 3825 Tone Street, Denver, Colorado.'",
        "'speaker_4': '80211. I'm the chief development officer for Q Factor. And for those of you that are not familiar with CU Factor, we are a contemporary development company, most notably recognized for industry, the modern office environments in the Reno neighborhood.'",
        "'speaker_4': 'We have been working with the property owners here with us tonight, Z portfolio in our team for more than a year on a mixed use concept as well as this associated rezoning process for the site located at Colorado Boulevard and East Seventh Avenue, adjacent to the Colorado Transit Station.'",
        "'speaker_4': 'We've been involved with leading a long and proactive outreach effort with the city, the University Hills North Community, the Arno, the primary and closest Arno to the site, as well as the University Park Community Council, the neighborhood and R.A. to the West across Colorado Boulevard and the East Evans Business Association, as well as other local organizations.'",
        "'speaker_4': 'We are honored to have a great deal of community and neighborhood support for the application, which I think is a reflection of the type of outreach and genuine communication that we have sought to provide throughout this process. Furthermore, on page 13 of your packet is a list of the letters of community support received for our application.'",
        "'speaker_4': 'Since that time, both the project and our community outreach have both evolved significantly, and we are excited to be here in front of you today. We've taken a lot of the concepts and recommendations and blueprint. Denver and the comprehensive plan to heart, such as urban centers, community corridors, design, quality and mobility just to name a few.'",
        "'speaker_4': 'And we've truly let a number of these concepts drive some of the inspiration for our project and mix of uses. I would like to thank the city planning staff for all the time and hard work they've put in.'",
        "'speaker_4': 'I also want to thank the community and neighborhood leaders that we have been working with. I'm here to answer any questions you may have, and I thank you again for your time and consideration.'",
        "'speaker_0': 'Thank you. Next up, Brett Probst. Hello. I'm Brett Probst.'",
        "'speaker_6': 'I live at 2255 South Jackson.'",
        "'speaker_4': 'Street.'",
        "'speaker_0': 'In Denver. I'm going to be very brief. The architect who has.'",
        "'speaker_6': 'The honor of working with Q Factor in Z portfolio on the design of this project.'",
        "'speaker_4': 'I'm really excited about it because I know.'",
        "'speaker_6': 'They have such high intentions.'",
        "'speaker_4': 'To create a really.'",
        "'speaker_6': 'Noteworthy development here.'",
        "'speaker_4': 'I'm also excited because I live just a few blocks away from this property, so I feel especially.'",
        "'speaker_13': 'Invested.'",
        "'speaker_6': 'In making sure a great.'",
        "'speaker_3': 'Outcome.'",
        "'speaker_6': 'Occurs.'",
        "'speaker_4': 'And again, I'm here to answer questions that you may have.'",
        "'speaker_0': 'Thank you. Next up, Sandy Hook, UNMOVIC.'",
        "'speaker_5': 'Good evening. It's a pleasure to be here. My name is Sandy. How of itch? Our family owns the property at the south east corner of Colorado Boulevard and East Evans. My address for the record is three, three, three South Monroe Street.'",
        "'speaker_5': 'Number 401 Denver. My family has owned and developed real estate in Denver for over 100 years. In fact, my great grandfather was one of the original stonemasons here at City Hall. We have on the land to Colorado Boulevard and Evans for as long as I can remember.'",
        "'speaker_5': 'And that's a very long time. As you can imagine, we have had a ton of offers over the years for a variety of uses, including fast food chains, automobile dealerships, drive thru Starbucks, and of course, the proverbial five story rep style apartments as many other sites in the area have developed.'",
        "'speaker_5': 'However, as a tribute and legacy to our family, we have turned down these less than visionary projects and offers and took the time to consult with the city, with the council, with the community to deliver a project that the community desires and can be proud of.'",
        "'speaker_5': 'We are looking at this property as an iconic long term legacy for Southeast Denver. Our goal has been and continues to be to build a true mixed use development that will provide the community with a gathering place much needed restaurants, shopping, office, residential and a hotel.'",
        "'speaker_5': 'We actually had an architectural competition and ultimately ended up retaining two very talented architectural teams to help us create our vision. We're excited about the partnerships that have been developed and the conversations we've had with so many along the way to get to this point.'",
        "'speaker_5': 'I would like also like to thank the community and neighbors who have taken an active role in the development of this project and helping further our quest for rezoning. I'm here to answer any questions you might have. Thank you for your time.'",
        "'speaker_0': 'Thank you, Chairman Sekou. You got to go in here. Okay, here we go.'",
        "'speaker_3': 'Chairman SEC, who likes our action movement. Also the next United States Senator. 2020. Here we go again. The vote on this one is going to be 13. The two who stop playing games up here. Because this is the way it goes down down here.'",
        "'speaker_3': 'You scratch my back, I got your back. There is no moral turpitude whatsoever in the game. It corrupt thoroughly.'",
        "'speaker_0': 'Mr. Speaker, I would point to our decorum rules. Please follow them. Do it now. If you could please follow our decorum rules.'",
        "'speaker_3': 'What did I do now?'",
        "'speaker_0': 'You are not to question the motives of the council members. Speak to the issue.'",
        "'speaker_3': 'I did not question the mode of the city council.'",
        "'speaker_0': 'All right.'",
        "'speaker_3': 'Continue is apparent and evident how we have to do that. Your history speaks for you before you even walk in the room. Here we go. Now. Who is this bull? Who spoke. And as you go about doing the development and getting and hiring the subcontractors who don't work, that no black people guarantee.'",
        "'speaker_3': 'White, brown, maybe. But guaranteed white workers can't be doing this. So once again, as a city develops, they leave us out conveniently under the as someone once said. Unintended consequences. Oh, yeah. Get real slick with the language. So as we go on, we move this thing down the road.'",
        "'speaker_3': 'You're going to do what you're gonna do. And black people have got to be put in another category call endangered species. Like doo wop, who they are and the world and the tree and the beetle, because they give more consideration than we do as a human.'",
        "'speaker_9': 'Being in this town.'",
        "'speaker_3': 'And that's been going down for 67 year. And the ball keeps bouncing. And the faces keep changing and the song is still the same. So what was the real change go down here? It wasn't a changing of the guard or the regime.'",
        "'speaker_3': 'No, it wasn't. It was game changing faces. Same rules, same regs. Just different folks doing it.'",
        "'speaker_9': 'Lying about their.'",
        "'speaker_3': 'Intentions and not wanting their end. I didn't. Question How can you sit up there and tell me it's against the rule to question?'",
        "'speaker_0': 'I'm sorry, but your time is up. Next up is Robert Forester. And we have I'm going to call the next five up, Jesse Paris, Rita Henry, Matthew Hubbard, Jennifer, New Haven and Brooke Webb. Go ahead. Hi. My name is Robert Forrester.'",
        "'speaker_0': 'I live at.'",
        "'speaker_4': '2461 South Holly Place to Denver mailing address.'",
        "'speaker_0': 'But it is Arapahoe County. I'm about a mile from the project and I wanted to come speak on behalf of this zoning request. It's a beautiful project that I think will enhance the area.'",
        "'speaker_3': 'Its closeness to you.'",
        "'speaker_4': 'And the light rail resonates with what the community needs.'",
        "'speaker_0': 'It's. Really a lot of thought has been put into it. There's been community input. There's been an effort to reach out to people in the area to answer concerns and questions. I think the project is. The best use of the area.'",
        "'speaker_0': 'I think it will.'",
        "'speaker_4': 'Enhance.'",
        "'speaker_0': 'Values for everyone concerned and I would like to ask the council to approve it. Thank you very much. Thank you. Next up, Jesse Paris.'",
        "'speaker_12': 'Good evening. Council President Clark, members of the council, members of the audience, those watching at home. My name is Jesse Larson, Paris. And I ran for city council while large with almost 15,000 votes with no money. And I'll be running again in 2023 to be your next mayor, Mr. Pierce.'",
        "'speaker_0': 'Do you have something germane to this issue reside?'",
        "'speaker_12': 'And can you see the Backus District Court, District nine? And I am speaking against this proposal tonight. I was at the last meeting when you guys deliberated on what you were going to do in regards to this. And I asked the developer straight up, what was the ammo level for this.'",
        "'speaker_12': 'I was told that only 10%, ten units out of. 360 were actually going to be affordable? Or was it more like ten units out of 500? Either way. It's a joke to say that this isn't even remotely close to affordable.'",
        "'speaker_12': 'It's 80% at my level and only ten other units are qualify for the tax credits. So really, who are you building this for is my question, because you keep screaming out, we can do better. We have a housing crisis in this city and this town.'",
        "'speaker_12': 'But yet you keep building honest luxury housing for who and what community spoke in favor of the still white afloat community. Really? This is honestly a joke. But you're going to do what you're going to do. As has already been stated.'",
        "'speaker_12': 'You already made your minds up before you come into chambers. So I had a few questions that I want to answer. I wanted to know if there was going to be a traffic study done on this area, because currently the traffic is atrocious in this area.'",
        "'speaker_12': 'And as a pedestrian walking in this area. You're putting your life in or at risk. You have to play Frogger. I know because I used to work in this area when I was selling direct TV for Amazon Satellite, which is right next door to where this proposed development is going to happen.'",
        "'speaker_12': 'So I would like somebody to please answer those questions because you keep ignoring my question. So I would like somebody to please answer that traffic question. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Rita Henry.'",
        "'speaker_5': 'I am Rita Henry three, three, three, three is Florida Avenue, Denver 80210. And I'm here to say that I really like the design for Colorado and Evans, and I think people hear 12 stories, but that's misleading since it's only a small portion of the project.'",
        "'speaker_5': 'That's 12 stories. The other parts are open and green available to the community for their use, and that's seven or 8000 square feet on the ground floor that will be open to the sky. And I asked if they had done.'",
        "'speaker_5': 'The Sun tests. They said they did and it will not be shady any time of the year. So I like the upscale design. That area right now has derelict corner vacant. Nothing there. So and I like the glass restaurant that spans the bridge connecting the two buildings with an outdoor patio.'",
        "'speaker_5': 'So I think it makes it very desirable. And I like the idea of a boutique hotel with 120 to 130 rooms. And I have heard that. Do you parents coming from out of town have limited options? And the residencies are, I've heard, 125 units.'",
        "'speaker_5': 'And it's such an improvement of what is in progress being built that's allowed without any questions asked. Five stories, zero light line apartments that if that's what can be done on this property with no questions asked, then I think.'",
        "'speaker_5': 'Definitely needs to change because that project is pretty bad looking. Everybody's talked about that and that's 350 units and they say that's what you could do on this property without going for a zoning change. So. And I do think parking is a problem and people can't ride their bikes.'",
        "'speaker_5': 'And I think it's probably right about that busy intersection. And I don't know how that will ever change because it's not going to stay undeveloped. So I think a subway system is really the answer, but that won't happen either.'",
        "'speaker_5': 'So I feel like people move to Colorado to be outdoors. So I think by limiting parking, you're not going to get people to just. Take the light rail to Broadway and downtown. It's got to be more coming. So I would say that's probably.'",
        "'speaker_5': 'Something to work on which is difficult.'",
        "'speaker_0': 'Thank you. All right. Next up, Matthew Hubbard.'",
        "'speaker_8': 'Hello. My name is Matthew Hubbard. I'm a resident at 515 Franklin Street in Denver. I'm here to speak in support of the Evans and Colorado Project. I believe the design of the project will bring some much needed architectural interest to this part of the city.'",
        "'speaker_8': 'My wife and I own a modern bungalow, a custom almost furniture store located just down the street in you hills. We have been there for 15 years. I was impressed that the developers reached out to us directly. They shared their project motivations and design.'",
        "'speaker_8': 'They asked for honest feedback and before asking us if we'd be willing to speak in favor of the project. That's the first time that's happened in 15 years. Density is good for small business. Innovative design is good for the soul of the city.'",
        "'speaker_8': 'This project offers both. With that said, I would like to support what Jesse Paris said about pedestrian traffic, and I would add cycling traffic along Colorado. That would be a really nice upgrade to the area. And with that, thank you for your time and thank you for your service to our city, especially Councilman Hines from my home'",
        "'speaker_8': 'district, District ten, thank you very much.'",
        "'speaker_0': 'Thank you. Next up, Jennifer, New Haven.'",
        "'speaker_5': 'Good evening. My name is Jennifer New Hoffman. I live in the University Hills Norris neighborhood. Although I'm a co-president of the Hills, Norris Community are an oh who already provided a support statement in support of this rezoning. This statement is mine and should not be interpreted as a statement from the board.'",
        "'speaker_5': 'I also support this rezoning. He Hills North has been going through some dramatic changes over the last five or so years and it's obvious there will continue to be development in the northern portion near Evans Avenue. Hundreds of new townhomes have either recently filled or will complete construction soon.'",
        "'speaker_5': 'We're about to see a 350 unit apartment building open to renters in just a couple of weeks ago, another 360 unit apartment building broke ground. Well, I'm not against density there. In fact, I think it's the exact right place for density.'",
        "'speaker_5': 'I have concerns about how quickly the density was preceding the zoning for this property. The southeast corner of Colorado Boulevard and Evans currently allows for yet another five story apartment building, paying the linkage fee for affordable housing and like the five plus storey building immediately to the south, they would not have to look to the access to'",
        "'speaker_5': 'the existing businesses or residents to gather feedback and opinions. Although we may ultimately have more of those developments, the neighborhood needs more than just housing. Bringing in a development that consists of a diverse mix of tenants will help activate the community around it.'",
        "'speaker_5': 'This also gives Denver extra time to provide better infrastructure to support future density. As we know, the Evans corridor struggles to manage its current traffic off traffic levels. When I heard what the owners and developers wanted to do with that property, I became excited.'",
        "'speaker_5': 'Excited to have an architecturally interesting building at the Northwest entrance to University Hills, excited that someone had vision enough to design something that would provide the same amount of density a use by right build would get, but supplying so much more to the community.'",
        "'speaker_5': 'Excited at the prospect of having an open outdoor community gathering space, a new desirable restaurant, a new dessert shop to walk to on a hot summer night. I'm excited to think there might be something in our neighborhood that instead of bringing more residents, it would bring a destination for all our existing and incoming residents to go to'",
        "'speaker_5': '. I am most excited for there to be a place between the hundreds of single family homes and the transit station. To better activate the transit station, give the residents a reason to head to the station on foot or meet friends coming in from the light rail for a social outing.'",
        "'speaker_5': 'I'm grateful the owners kept going to the drawing board to find a concept that would benefit everyone. I fully support this rezoning and hope you will too. Thank you.'",
        "'speaker_0': 'Thank you. Next up is Brooke Webb and I call the next five up to the front. Pamela Whitney Walsh, Ryan Morrissey. Lori Bissell, Max Everett and Barry Rosoff. Brooke Webb. Hi.'",
        "'speaker_10': 'I'm Brooke Webb. I live at 5382 East Colorado Avenue in Virginia Village, which is about a mile from the project. I'm involved with Ellis Elementary School as the parent teacher organization president. And one of the reasons I'm speaking in support of the project is because we need to attract and retain families in Virginia Village.'",
        "'speaker_10': 'I like the many of the points that have already been brought up, so I'll just reiterate the fact that this is a legacy project for the corner of Colorado and Evans, that it's very close to the light rail station, the Colorado station, and we want the Colorado station to become more of a destination station like some of'",
        "'speaker_10': 'the other light rail stations throughout the city, where right now it's more of just a commuter station. This would help improve the Colorado station tremendously. I really liked when I met with CU Factor, the accessibility that they talked about as well as the wide sidewalks.'",
        "'speaker_10': 'I think that that's an imperative part of this project for the pedestrian and cycling concerns that have been brought up. I really like the fact that it's a luxury, high quality project that other areas of the city have seen and our little neck of the woods hasn't really benefited from quite yet.'",
        "'speaker_10': 'And the hotel, the housing. And currently it's just a defunct site with a really old building there that has had no use for us. So from what it is to what it is going to be, I think it's very beneficial for the community.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Pamela Whitney Walsh.'",
        "'speaker_2': 'Did he mean? And Pamela Walsh and I.'",
        "'speaker_10': 'Reside at 1316 South Elm Street. And I'm here tonight in support of the redevelopment project. I'm very excited about the opportunity that this represents for our neighborhood. Specifically, if free zoned to be mixed use, we could have a greater mix of amenities like broader choices of restaurants that we see in other thriving neighborhoods like Walsh Park and'",
        "'speaker_10': 'Platte Park. Currently, that area is dominated by fast food restaurants and chains and would be would rather prefer to have a range of healthy choices from fast casual to more sophisticated dining that you might find in other great cities like San Francisco and New York.'",
        "'speaker_10': 'And it would give local restaurateurs the opportunity to create something really special in their own communities. It also promises greater access to what is currently a concrete wasteland. By carving out open space for public use. And finally, I was really relieved and furthermore inspired when I heard from the outcome of each family about their desire to build'",
        "'speaker_10': 'a legacy project on the southeast corner of Denver. I believe that it will bring a level of visceral, visual sophistication and appreciation for design to the neighborhoods so that it really elevates our community rather than having it blend in or worse, diminish the beauty of our neighborhood.'",
        "'speaker_10': 'So again, as a neighbor within walking distance to this promising new development, I hope you will consider approving the rezoning that will enable the project to create something that maximizes its full potential for our community.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Ryan Morsi. Good evening, council members.'",
        "'speaker_4': 'My name is Ryan Morsi. I live at.'",
        "'speaker_6': '3434 South Claremont Street in the New University.'",
        "'speaker_4': 'Hills neighborhood. I'm here tonight in support.'",
        "'speaker_6': 'Of CU Factor and Z Portfolios.'",
        "'speaker_4': 'Application to rezone the corner of Colorado and Evans as a nine year resident of University Hills. I've seen a lot of changes.'",
        "'speaker_3': 'In our neighborhood. Not every project allows us.'",
        "'speaker_4': 'The opportunity to discuss.'",
        "'speaker_3': 'The proposed development with the developers or owners.'",
        "'speaker_0': 'Q Factor and Z Portfolio.'",
        "'speaker_4': 'Have taken the time over this past year to meet with our neighborhood.'",
        "'speaker_3': 'We've been able to discuss.'",
        "'speaker_4': 'And view the proposed building and mixed uses of space. It is clear that they have spent a great deal of time wanting to create a building that will bring a unique architectural design.'",
        "'speaker_0': 'To our neighborhood.'",
        "'speaker_4': 'And not just a planned structure that we often see built. Because of this, I believe the building will become a center of gathering that our community has been lacking. By creating a variation in height and density, they will be providing a plaza with open spaces and amenities not seen by any current development.'",
        "'speaker_4': 'Providing this mix of uses, we will gain shops, restaurants, offices and living spaces all in one location. This will allow both walkability.'",
        "'speaker_0': 'And.'",
        "'speaker_4': 'Vibrancy that the future of our community will need. With easy access and use of Colorado station. This mix of uses will allow the outreach for others to enjoy enjoy. Not just our neighborhood. Please support the growth of.'",
        "'speaker_0': 'Our neighborhood and community by approving this.'",
        "'speaker_4': 'Project to move forward. We will all enjoy the strong precedence this building will make in our community and hopefully will encourage other developers to follow suit. Thank you again for the opportunity to discuss my support in this development and rezoning.'",
        "'speaker_0': 'Thank you. Next up, Laurie Bissell.'",
        "'speaker_5': 'Yes. My name is Lori Bissell. I live at 2167 South Belcher Street and I am probably the closest neighbor to the project and I've lived in the neighborhood for 24 years, so I've seen a lot of changes. I was community president when Light Rail went in and Colorado center development and all that and I think this is'",
        "'speaker_5': 'a really good project is bringing excitement to the neighborhood because it's kind of been just sitting there for a long time and I thought, How come this isn't being developed like Highlands Ranch? I'm like Highlands or that. And finally the development is coming and I think this is a good development.'",
        "'speaker_5': 'It's well thought out. The developers were willing to talk to the community. These six blocks are going to be developed and how they develop is really important to the community because I've traveled in, you know, in Europe, like I'm sure some of you have, and you'll see that the train stations are a place where people go, they'",
        "'speaker_5': 'go to buy their cheese, their wine, pick up their laundry and have a really nice meal or meet people from another that come from another station. And you meet there at the station in Zurich. I remember my friend said meeting where the singles meet and I go, What the hell are you talking about?'",
        "'speaker_5': 'And she goes, Yeah, we have a place where people come, where singles meet, and then families meet in a different place in the station. So I think as Denver develops as a metropolitan area, it's really a good thing that we get out of our cars and have the option to take light rail to places like I took'",
        "'speaker_5': 'light rail down here tonight, so I don't know how many of you did that in, but I did. And I think that's a great option to get people out of their cars. Even though I drive for Uber and Lyft, I think that that's going to help us in the future to be able to do that.'",
        "'speaker_5': 'So I hope that you vote for this. I'm for this project, and I think it's going to be good for standards, set standards for the development of these six blocks that are right there. So thank you.'",
        "'speaker_0': 'Thank you. Next up, Max Everett. Max Everett. All right. Very brassed off. And then I'll call our next group up. If you could make your way to the front bench. Sam Muir of Sharon Pearson. Elizabeth Davis. Kyle Exner, Kimberley Tyson and Paul Leone.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_6': 'Excellent. Good evening.'",
        "'speaker_9': 'Members of members of council. I'm very proud to preside at 333 South Monroe Street in Denver, Colorado. Although I've only been a member Colorado resident for about 12 years, I've seen an incredible amount of development all through the city.'",
        "'speaker_9': 'Living in Cherry Creek, I've kind of looked at LoDo, LoDo, the Highlands, Reno, all these areas popping up with incredible, vibrant destiny, areas that have become destinations. Sitting in Cherry Creek, we look at this and say, You know what?'",
        "'speaker_9': 'Where do we want to go? Where can I go? The University Hills area really has, and it is really just a wasteland of just information of a transportation corridor from I-25 down to Hamden. It's kind of it's a wonder why this area hasn't developed.'",
        "'speaker_9': 'And I think this this project is an unbelievable way of bringing an incredible amount of diversity and development to the area. And I'm incredibly excited to see this to see this this area develop. I think the project that that that's put forth is really, really an architecturally amazing thing, which is which is also really interesting because I'm'",
        "'speaker_9': 'tired of driving by another big box of just plain box and irresponsible development. This does a really nice job of combining what the community needs in a very in a visually pleasing way. And I give my unconditional support for the project.'",
        "'speaker_9': 'And thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Sam Mira.'",
        "'speaker_6': 'Good evening. My name is Sam Europe. I own a business on Monaco and Evans is triple-A.'",
        "'speaker_3': 'Swing and vacuum. I've been there since 1985.'",
        "'speaker_6': 'And I must tell you, I've seen a.'",
        "'speaker_3': 'Lot of changes.'",
        "'speaker_0': 'During the time I've been.'",
        "'speaker_13': 'There.'",
        "'speaker_3': 'And when they approached me.'",
        "'speaker_6': 'With this project on Monaco and Evans, I'm.'",
        "'speaker_3': 'In Colorado and Evans, as of now.'",
        "'speaker_0': 'I do a lot of driving in that area.'",
        "'speaker_6': 'And every time I see that corner.'",
        "'speaker_3': 'I just shake my head because all I.'",
        "'speaker_9': 'See.'",
        "'speaker_3': 'Is people frying in a green chili.'",
        "'speaker_6': 'Some people selling sunglasses on the corner. Uh, and I've seen.'",
        "'speaker_3': 'People, you know, I mean, all kind of stuff, and it would attract gravity.'",
        "'speaker_0': 'And it's really sad to see that corner like that.'",
        "'speaker_6': 'So when they told me about this project, I really felt excited and I really wanted to give my $0.02 worth about this project. And I. I appreciate if you guys will give it consideration to approve it. It's a it's a great thing for the city.'",
        "'speaker_6': 'And like I said, I've been there.'",
        "'speaker_3': 'For almost 35 years. I'm very excited about it. Thank you very much.'",
        "'speaker_0': 'Thank you. Next up, Sharon Pearson.'",
        "'speaker_5': 'Hi. My name is Sharon Pierce, and I've lived in the neighborhood for 20 years. I'm about six blocks southeast of the project. I think the points I'm going to make are with all the development that encroaching on your neighborhood.'",
        "'speaker_5': 'This is the first group that's really come to us with vision and looked at it as How can we improve your neighborhood instead of just plopping a building down in the middle of it? The project that was just built just south of their building is not anything I think any of us are proud to look at every'",
        "'speaker_5': 'day. And the idea that someone is bringing something to us that's going to produce some architectural interest and bring new things to our neighborhood is refreshing. And my major point would be I hope they set a precedent for the three other developers that are currently on the north side of our neighborhood going after their projects.'",
        "'speaker_5': 'So get out there and make your plea to those other guys. So I am strongly in favor of this project. Thanks.'",
        "'speaker_0': 'Thank you. Next up, Elizabeth Davis.'",
        "'speaker_5': 'Thank you. My name is Elizabeth Davis and I live at 2575 South Cherry Street in Denver with Jenny. I'm co-president of the University Hills North Community. R.A. I'm speaking today to represent my personal support for this project. As a resident of this neighborhood for over 20 years, I see this project as an opportunity and an investment in'",
        "'speaker_5': 'the future of our area. I'm committed to working for smart development in a safe, walkable and vibrant future for University Health North and all along the Evans and Colorado Boulevard corridors, the developers and owner in this project have proactively engaged the community.'",
        "'speaker_5': 'They've been accessible, they've listened and responded to feedback. Although the increase from five stories to 12 stories sounds steep, they have agreed to design to match the equivalent of five story density and have included open space and retail at this property.'",
        "'speaker_5': 'They have also agreed to active engagement in an implementation of transportation demand management strategies. These elements are important to me and to our residents and are captured in the Good Neighbor Agreement that people have referenced already. For all of these reasons, I am in full support of this project, and I hope you will, too.'",
        "'speaker_0': 'Thank you. Next up, Kyle Exner.'",
        "'speaker_13': 'Evening. My name is Kyle Asner. I live in University Hills. Thank you for the opportunity to speak to you tonight. I'll try to keep this short because to keep it from getting too repetitive, a few bullet points. I think it's an exciting mixed use project that isn't your standard five storey apartment building that a lot of people'",
        "'speaker_13': 'have spoken against tonight. The developer is local and has a history of successful projects in the Denver area. This has been mentioned before, but they've made a significant effort to engage the community and gather feedback and that the project helps increase density near light rail and all the jobs at Colorado station.'",
        "'speaker_13': 'And those are the main points I want to highlight tonight. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Kimberly tests.'",
        "'speaker_5': 'Yeah. You're not going.'",
        "'speaker_0': 'I apologize.'",
        "'speaker_5': 'How you doing? It's too. I live in University Hills, and I've been there for over a decade. And before that, from 2000 to 2008, I was in five points where I also enjoyed living. But I actually went over to that area because it seemed like I had more yard and.'",
        "'speaker_2': 'There were things that were going.'",
        "'speaker_5': 'To be exciting and happening there. And as I've been watching it grow over the last ten years, I can say that this group has been very good about cooperating with the community. They have scheduled one on one appointments with anyone who asked.'",
        "'speaker_5': 'They have scheduled tons of meetings where anyone has been able to come. It has been well advertised.'",
        "'speaker_2': 'And I find it, as a resident of University Hills, a little.'",
        "'speaker_5': 'Disturbing that the two people have spoken against it. I had not seen it a single meeting or participated at all. So I believe all the people who have stood up and spoken so far have been at the meetings and they have been very well and engaging.'",
        "'speaker_2': 'And like they've spoken. The architect has just been so thoughtful and they've.'",
        "'speaker_5': 'Answered all of our questions. We brought up the concerns about traffic and pedestrians. They told us how they were looking into that. They did studies. They were opening up that lane for the cars to pull in more. There have been thoughtful in every way and they've answered every question and they've been nothing but cooperative.'",
        "'speaker_5': 'And as you can see, the support by the people actually live in that area is immense. So I really hope you guys go all the way for it. Thanks.'",
        "'speaker_0': 'Thank you. Next up, Paul Leone.'",
        "'speaker_13': 'Good evening. My name is Paul. Excuse me. Good evening. My name is Paul Leone. I live at 4225 east. I live which is the Observatory Heights Development in. It's about a block diagonal southeast of the development we're discussing.'",
        "'speaker_13': 'I wanted to say that I relocated to the area from North Central Westminster specifically to be near the transit. I haven't lived in the area for over 11 months. I consider myself the unofficial gentry representative to the University Hills North Community as I appear to be the only one living in a slot house development that comes to'",
        "'speaker_13': 'the meetings. And so I have done so out of a commitment to avoid the conflict that we've seen in other areas like Rhino and Highlands and other parts of the city. Um, sorry. Uh, due to. Do not come out from.'",
        "'speaker_13': 'I just repeat what some other people say. The applicant's commitment to a legacy building is important and important. The applicant's commitment to vertical density over horizontal density is important. And I wanted to bring up one point that was not brought up by the staff or by any of the commenters that the applicant has committed to permanently remove'",
        "'speaker_13': 'the billboard and adult use zoning overlays that currently govern the part of the property. I'm a firm believer in First Amendment rights to adult operations, if that's what they want. But I wanted to bring that up for the record that that's part of the deal and that I personally welcome that commitment.'",
        "'speaker_13': 'Otherwise, I implore the Council and Councilor Black to continue to bring infrastructure improvements to our neighborhood, including sidewalks. Sidewalks is a big issue around the city. It's an issue in our neighborhood. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers tonight on this item. Are there any questions from members of council? Well, there we go, Councilman Torres.'",
        "'speaker_5': 'Thank you so much, Mr. President.'",
        "'speaker_10': 'QUESTION You know, the president.'",
        "'speaker_5': 'Of the Auno was here. If I know you spoken on your behalf.'",
        "'speaker_10': 'But I wonder if you could just answer a couple of questions about the Arno Gina. Just for a clarification.'",
        "'speaker_5': 'The DNA is directly with University Hills.'",
        "'speaker_10': 'North Community. Arno. Yes. Were you already in Arno? I'm sorry. If everyone C-3 prior to this agreement or did that.'",
        "'speaker_5': 'Come as kind of seeking.'",
        "'speaker_10': 'Out the DNA?'",
        "'speaker_5': 'I don't think we're. 523 So you're not a 523? No. Sorry. Let me. In Virgina, it states that.'",
        "'speaker_10': 'University Hill's Arts Community, a Colorado nonprofit corporation. That's not accurate.'",
        "'speaker_5': 'No. Okay. I am sorry. There is legal speak in the DNA that I didn't recognize. I was just making sure that the points that the residents in the neighborhood wanted to be met, like the transportation demand management plan and the reduced density for the 12 story max.'",
        "'speaker_5': 'Those things were being met there. Maybe. Can I have somebody from Z portfolio? Hi. How are you there? Can you introduce.'",
        "'speaker_10': 'Yourself real quick for the record?'",
        "'speaker_5': 'Sandy, how come of it?'",
        "'speaker_10': 'Thank you. Sandy, do you know the answer to that? The DNA that I'm looking at states that UNHCR I'm sorry, you agency.'",
        "'speaker_5': 'Is a right and this is an I.R.A. It's been in existence for quite some time. It did not become an R.A. because of us at all. A nonprofit. Because of this. They're nonprofit. No. Who signed the Good Neighbor agreement then?'",
        "'speaker_5': 'As far as Z portfolio I did on behalf of the neighborhood who signed now I as the co-presidents of the R.A.. Okay.'",
        "'speaker_10': 'I'm not an attorney, so I don't know if this is even matters, but it states that you're in a5a1c3 nonprofit in here. So I don't know if that.'",
        "'speaker_5': 'So are you. Do you know if you're five or 23, which are okay? All right. You might be because.'",
        "'speaker_0': 'I'm sorry. We have lots of folks watching on TV. So if you're responding to the question, if the council would like to pull you up, you have to come to the microphone.'",
        "'speaker_5': 'I think that they might be is that the organization has been there since like the early fifties. So and we vote presidents and as a community and, you know, around Denver, each community has a council, most of them have a council.'",
        "'speaker_5': 'So that's the way that we can talk to you. And I do believe so there's a it's a nonprofit. Sure.'",
        "'speaker_10': 'I think there's a difference between registering as an R.A. with the city and registering as a.'",
        "'speaker_5': 'Nonprofit entity with the state. Yeah, but I think it's it's more of the community council's that's been there for years and years and years and years. I would just encourage you to be very sure.'",
        "'speaker_10': 'About what that means, because there's also language in here that is a transaction of money for possible.'",
        "'speaker_5': 'Legal fund, legal.'",
        "'speaker_10': 'Legal needs, should the R.A. need them. So just be very sure what you're signing. Right. Yeah. And that's.'",
        "'speaker_9': 'Yeah, I think.'",
        "'speaker_0': 'I think we have our attorney trying to chime in here.'",
        "'speaker_3': 'And.'",
        "'speaker_5': 'Figure it out. Kirsten Crawford, Legislative Counsel. Apparently this is a similar question that was asked and another evening that I was not here, an unusual time when I was not here. But there are various ways to incorporate. And so, you know, I don't advise the Arnaud's, but you know, it doesn't have to be a nonprofit 501c3 model'",
        "'speaker_5': 'to qualify as a Colorado nonprofit corporation, if that's the question.'",
        "'speaker_10': 'And that's fine. I'm just stating, I think what I'm reading here in the DNA.'",
        "'speaker_5': 'That you HNC.'",
        "'speaker_10': 'A Colorado nonprofit corporation. And that doesn't sound like familiar.'",
        "'speaker_5': 'Language to the R.A., so just wanting to make sure that you're you're signing something that's sure to stay on that question. Okay. I will definitely look into that. I can't speak for Sandy, but I'm willing to sign a just an identical DNA if we correct that part of the language.'",
        "'speaker_5': 'We'll find out for sure what their designation is and we'll change that. The good neighbor agreement, if we need to, to reflect that.'",
        "'speaker_10': 'Okay. And I recognize you probably.'",
        "'speaker_5': 'Have more trust than.'",
        "'speaker_10': 'Than I'm aware of, but.'",
        "'speaker_5': 'I think that's a significant thing. Okay.'",
        "'speaker_10': 'No other questions only. Okay. I'll come in later.'",
        "'speaker_0': 'Okay. Thank you, Councilman Flint.'",
        "'speaker_3': 'Thank you, Mr. President. Just briefly, the University Hills North Community is a Colorado nonprofit corporation. It was articles of incorporation were filed in 1978. And so but it's just simply just as Kirsten Crawford said, it's just not a they never saw 2513 tax exemption, but it is a nonprofit corporation.'",
        "'speaker_3': 'Okay, Scott, I'm curious if you could run me through again. Or run through for me, not run me through. Holy cow. The reasoning for the exception to the general guidance in blueprint on building heights because community corridor in this location the guidance is up to eight storeys but this zoning allows a 50% increase over that to 12'",
        "'speaker_3': '. And I did see in the staff report the citation to some of the guidance and blueprint that I that I called up to review here as well. And so why why was the exception? Why was it why is it being recommended for approval here?'",
        "'speaker_3': 'Is it the adjacency to the Colorado station, to Colorado Boulevard, to Evans?'",
        "'speaker_6': 'Yes. So there's the guidance and blueprint is general height guidance. And this has generally updated stories, but it says building heights identified in this plan provide a general sense of scale and are not intended to set exact minimums or maximums.'",
        "'speaker_6': 'So and then the plan provides further factors to consider in saying should it be higher or lower than the.'",
        "'speaker_3': 'And I see there are six bullet points here in Blueprint that suggest, you know, when we can vary from that. And I'm I guess I'm curious, you might not know the answer to this, but if you do, that would be helpful to me.'",
        "'speaker_3': 'Are have there been other rezonings or are there other applications you're looking at right now where where these where the general guidelines are are being modified with with these specifics? Or is this sort of our first case at this?'",
        "'speaker_6': 'Well, the one you approved earlier tonight had general guidance up to eight and you approves the next 12. So similar situation. Right. I think these may be the first two.'",
        "'speaker_3': 'But that that was an existing structure that that's already five.'",
        "'speaker_6': 'Correct? Right. Yes. So I think as far as I'm aware, these are the first two that have gone through. Okay, I'm going above the gentleman.'",
        "'speaker_3': 'I'm just wondering about the precedent setting nature of this and how broadly these exceptions might be applied so that the general guidance doesn't really apply anymore. Yeah.'",
        "'speaker_6': 'So to get back to your original question of why we think 12 is appropriate, right. I think it is the things you mentioned, you know, there are six factors, but one of them is proximity to other allowed heights are building existing building heights that are taller than that, which as I mentioned, this has 20 storeys zoning directly'",
        "'speaker_6': 'across the street to the north with.'",
        "'speaker_3': 'So there's not a 20 storey building there.'",
        "'speaker_4': 'Not immediately to the.'",
        "'speaker_6': 'North, but a little.'",
        "'speaker_3': 'Bit further north on council center, that's 12 storeys.'",
        "'speaker_6': 'It has taller than 12 storeys, I believe.'",
        "'speaker_3': 'Okay.'",
        "'speaker_6': 'But it's also zoned for 20 storeys there. So that whole area north of north of Evans is zoned for 20 storeys.'",
        "'speaker_4': 'Serving as the transitions of that.'",
        "'speaker_6': '20 storey zoning to the north, five storey zoning existing to the south, 12 storeys serves as a transition and then yes, proximity to transit. So with the current station light rail stop just across Evans to the north.'",
        "'speaker_4': 'And then bus.'",
        "'speaker_6': 'Service on both Colorado and Evans at the intersection of two major arterials. Right. We felt.'",
        "'speaker_4': 'That this met those factors to go above that general height that say.'",
        "'speaker_3': 'Thank you. That's almost present.'",
        "'speaker_0': 'Thank you, councilman. Next up, Councilman Central.'",
        "'speaker_5': 'Thank you, Mr. President. I have a question for the developer.'",
        "'speaker_4': 'Thank you, Councilwoman.'",
        "'speaker_5': 'Thank you. So tonight, several speakers have talked about the architecture, and I'm pretty familiar with good neighbor agreements and I'm pretty familiar with zoning. So tonight, we're only approving the entitlement. And tonight, there's an executed grid neighbor agreement.'",
        "'speaker_5': 'But within that document, it doesn't talk about the architecture. So talk to me about how you ensure this project to the people, because a lot of times bait and switch happens. I'm not saying that that happens. You're going to do that.'",
        "'speaker_5': 'But it's reality in development, right? So can you just talk to me? How come you didn't add architectural language to the Good Neighbor Agreement?'",
        "'speaker_4': 'So architecture language is not added to the Good Neighbor Agreement, Councilwoman, because we felt that the design was still in such an infant phase of the process. Right now, first and foremost, however, we did tie the overall design of the project to the Good Neighbor Agreement and really to the overall development through the 8% of private open'",
        "'speaker_4': 'space that we did commit to, as well as a form of mass reduction. That's a zoning code allowable piece. And even though it wasn't able to factor into any other document here in front of us tonight, we did paper those two with the with the in the good neighbor agreement.'",
        "'speaker_4': 'And so through what you did here, spoken to by the community, was a representation regarding the amount of density that we're crafting on the site. And even though there is the overall and overarching request for TMX 12 density here or actually sculpting with that amount of density is comparable to that, which is that of a five storey'",
        "'speaker_4': 'project.'",
        "'speaker_5': 'Because you're taking the massing and moving it around and that's how you're going to address that architecture in more easy language. Is that what I understand?'",
        "'speaker_4': 'Yes. Yes, ma'am.'",
        "'speaker_5': 'Okay. And then are you building? I couldn't figure. I couldn't find it. I'm sorry if I missed it. Are you building in your hotel? But are you doing rental or for sale product there as well?'",
        "'speaker_4': 'Currently, we do have residential as a long term residential as a component of the project. However, it's it's a minimal component of the overall project right now. So, yes, in addition to hospitality use that's been discussed here, we do have a a lesser component that will be planned for right now long term rental.'",
        "'speaker_4': 'So, yes, multi-family rental.'",
        "'speaker_5': 'And so one more question with that. Will you be doing the on site affordable or will you be paying out the linkage fee?'",
        "'speaker_0': 'So as it currently sits right now, we would be.'",
        "'speaker_4': 'Paying the linkage fee for the entire project. And that linkage fee is calculated under the 2019 rates is in excess of $600,000. And so while that's not to be denoted as a significant impact to the to the overall project, it's definitely notable.'",
        "'speaker_4': 'However, regardless of whether there's the the other components of the project, be it.'",
        "'speaker_3': 'Commercial.'",
        "'speaker_4': 'Office or hospitality, would be required to pay that linkage fee no matter what. So it would be our intent to pay that linkage fee as of today.'",
        "'speaker_5': 'Yeah, I get that. The commercial, there's the three buckets, right, that commercial. And so I just always questioning whether developers are going to build the on site and help our affordability issue crises that we have in Denver or they pay the linkage.'",
        "'speaker_5': 'So thank you for answering that. Yes, thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_6': 'Thank you, Mr. President. Vinny, thank you. How many? Thank you for staying there.'",
        "'speaker_4': 'Thank you, Councilman.'",
        "'speaker_6': 'How many residential units are you envisioning at this point?'",
        "'speaker_4': 'Currently, at the time at this time, we only have about 86.'",
        "'speaker_0': 'Units.'",
        "'speaker_4': 'Currently planned in the project.'",
        "'speaker_6': 'Okay. And how how big is the open space and square foot? I mean, you said 8%. I don't do math. Afternoon.'",
        "'speaker_0': 'Understood.'",
        "'speaker_4': 'We're currently looking at a total open space of about 15,000 square feet.'",
        "'speaker_6': 'When you say total, is that that one space in the middle that that.'",
        "'speaker_4': 'So the one space in the middle is is actually terraced. So there's multiple levels of this open space. The technical definition of open space per the zoning code requires it to actually have dirt all the way to the center of the earth, essentially.'",
        "'speaker_4': 'So that is where we come to a smaller square footage number in this 78,000 square feet.'",
        "'speaker_6': 'Okay. Thank you. That's all, Mr. President. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. Since you're there, I have a question for you. So in a similar vein to Councilman Sandoval, this I guess this is a little strange for me because, you know, I can't really say that I'm new for much longer.'",
        "'speaker_4': 'But this is one of the first rezoning applications that doesn't include affordable housing. So I'm. Was that something that you considered or how did. You know, how did you get by with not having an affordable housing requirement? I guess it's part of my question.'",
        "'speaker_4': 'So that is my question, actually. Yeah. Councilman Hines, thank you. And I appreciate the.'",
        "'speaker_8': 'The question there. And I can totally understand where it's coming from. As as mentioned and as Councilman Cashman asked, we currently only have 86 long term rentals currently planned for the project right now. So over two thirds of the project.'",
        "'speaker_4': 'Is really dedicated to other uses. And at this infant stage of the project, we're really trying to reserve optionality for the project. The needs of.'",
        "'speaker_8': 'The project may need to pivot to additional commercial.'",
        "'speaker_4': 'Office. The hotel user may see the need for additional hotel keys there. So as it stands.'",
        "'speaker_8': 'Today, the residential component, the long term rental component is so minimal that we didn't feel it appropriate to.'",
        "'speaker_4': 'Tie this or this project to an affordable housing commitment. Is there a if you say that in its infancy and, you know, currently you're planning 86 units, if some if you say, you know, this these were great ideas, let's just throw it out and start over, you know, is it would there be another comment period?'",
        "'speaker_4': 'The I mean, I I've heard from a lot of the people who came here tonight that they were very happy that you engaged the community, that you were very proactive. I really enjoyed that. I'm glad that you as a developer chose to engage the community also.'",
        "'speaker_4': 'I don't I don't know if the the phrase bait and switch, that's a little I don't think that you would do that necessarily. But people do do that. And so I guess I'm asking a similar question. I, too, feel a little uncomfortable saying we're going to go to 12 storeys and it be open and wonderful and then'",
        "'speaker_4': 'it be a 12 story box with a million units. None are affordable, you know. So. And is there any other way outside of it? Can you can you help us feel better about the project and that it'll stay?'",
        "'speaker_4': 'It really will be in the spirit that you are describing to us.'",
        "'speaker_8': 'Absolutely. And so I think, Councilman Hines, I think it's important to remember that.'",
        "'speaker_4': 'We do have an executed good neighbor agreement with the registered neighborhood organization that was discussed.'",
        "'speaker_8': 'As part of that.'",
        "'speaker_4': 'Good neighbor agreement. There is mass reduction, so it's currently not allowable for us to build the entire site out to 12 storeys. There is a commitment that we have to to further the.'",
        "'speaker_8': 'Overall design of the project in.'",
        "'speaker_4': 'Alignment with what we've currently shown. And as.'",
        "'speaker_8': 'We as you heard from the.'",
        "'speaker_4': 'Community, we listened to the feedback that was provided to us. And so pieces of the community's desires for this project, for this location are things such as retail and restaurants and open space. And so those are the pieces.'",
        "'speaker_8': 'Of the project that we're.'",
        "'speaker_4': 'Committing to and that we've executed with the neighborhood. Okay. Thank you. Did you have something you want to.'",
        "'speaker_5': 'Get in the good neighbor agreement? It has the owner obligations. So a lot of these questions you have are addressed in the Good Neighbor Agreement. We've committed to not going more than the what the total density would be for the five storey building.'",
        "'speaker_5': 'So we're putting it at different levels though. Even though we're asking for TMX 12, there's only one of the buildings would actually be 12 storeys. The rest of it would be scaled down.'",
        "'speaker_4': 'Well, as it's currently proposed in its infancy.'",
        "'speaker_5': 'Yes, that's true.'",
        "'speaker_4': 'Okay. Thank you very much. And just one comment about Colorado nonprofits versus 501c3. Maybe this has already been addressed, but Colorado nonprofit is in the state of Colorado and 51c3 is a federal IRS designation. So there you can have one and not the other.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. All right. Seeing no other questions. The public hearing for Collinsville 1058 is closed. Comments by members of Council Councilwoman Black.'",
        "'speaker_5': 'Thank you, Mr. President. Thank you all for being here. It was very, very nice of neighbors to come up on a very cold December night. And I want to thank the development team. When I was first elected in 2015, one of the first people I called was Sandy because I heard a rumor that she wanted to develop'",
        "'speaker_5': 'that corner. So this was four years ago, and she's right. There were a lot of people coming to them for a drive thru liquor store, drive thru restaurant, all a lot of things that nobody wanted. And I just kept meeting with her and we kept talking about what would be nice for the neighborhood.'",
        "'speaker_5': 'And so it's mean so much to me. I've lived in that area most of my life and just I know you are also a Denver native and everyone's right. It is not an active part of town. They're just transportation corridors.'",
        "'speaker_5': 'And it's such an incredible opportunity to have an active light rail station. And there are some new things coming to the actual light rail station that are positive. This is going to be incredibly positive for the area. Everyone is concerned about transportation and safety.'",
        "'speaker_5': 'I'm so happy to see Stewart in the audience along with Bill James and Chris Nevett. The city also cares about getting people to the station safely and making it more walkable. And so Public Works is trying to get an Evans Corridor study done and Colorado Corridor study done to plan some improvements.'",
        "'speaker_5': 'I worked with Stewart before the 2017 was it 2017 bond on some improvements around the station, which hopefully those will get started, but there's much more to be done. But everyone knows about it and everyone cares about it is a priority.'",
        "'speaker_5': 'I really appreciate that you all came together for so many, many meetings and got to a point where you all thought this was a good idea. And I really appreciate you doing the good neighbor agreement, the affordable housing.'",
        "'speaker_5': 'I would like to address you are doing what the law allows you to do. So you're not getting any special favors. You are paying the linkage fee that was set forth in the ordinance that many of us voted for.'",
        "'speaker_5': 'But there are other things going in there that are going to be really a benefit to the community. And I hope then that good things spread from there around the station east on Evans, South on Colorado Boulevard and north on Colorado Boulevard.'",
        "'speaker_5': 'And that we get Colorado Boulevard to be more of an active transportation corridor, getting people move, moving outside of their cars. So a BRT or something. And I think with that, that is all I wanted to say. Jenny and Liz, you guys have been incredible.'",
        "'speaker_5': 'President of your neighborhood organization. Thank you so much for leading. And thank you all for this. It sounds like I'm going to support it. And I am.'",
        "'speaker_0': 'Thank you. Thank you, Councilwoman. Councilwoman Torres.'",
        "'speaker_5': 'Thank you so much.'",
        "'speaker_10': 'And thanks for the clarification, everyone, for the R.A. status. That's helpful. The comment I wanted to make, there was a public commenter who remarked about previously on This Lot. There had been Green Chili Roasters.'",
        "'speaker_5': 'And so as this starts to take shape, please come to District three for your green Chile. All along, federal boulevard. We have plenty of options for you. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Cashman.'",
        "'speaker_6': 'It's tough to follow up. Green Chile Roasters who will say that? This is really interesting. I hate to see any piece of ground built on without affordable housing. This is a small piece of ground. This is a very small piece of ground.'",
        "'speaker_6': 'And the $600,000 hopefully will will go towards financing affordability elsewhere and the design. I came into this job while I'm still concerned about height of structures. When you see that five story rectangle immediately to the south of this project, just south of the southeast corner of Evans and Colorado, you realize that that it's about design, I think'",
        "'speaker_6': 'is what everybody's flipping out about is the crap that we see being built in some areas. You know, and what this does have is, is exceptional design. And I know that's always a matter of taste. And I think to Councilman Hines is quite a line of questioning.'",
        "'speaker_6': 'I'm from from what I read in the agreements. I'm convinced that the requirements of massing prevent a giant box, that the 12 stories will be minimal. So what does concern me and it's not about this development really is the reality of our city right now.'",
        "'speaker_6': 'And the reality of the Evans corridor is, as Councilwoman Black said. So we've got to we approved the development of three 500 units down by the highway last week. We'll have a couple hundred more townhouses at Holly and Evans in the next couple of years.'",
        "'speaker_6': 'We'll talk later about the proposal for 800 more units up at the old see that site and all this to say we're we're acting right now in the way we are about what we give out incentives as if we have a real life mass transit system and we have a skeleton of the mass transit system that we'",
        "'speaker_6': 'need. We're giving out parking incentives. We're expecting we're we're allowing height, encouraging height, which we should buy by transit stations. But we're all watching the same thing with our our primary transit agency, reducing service and reduced releasing reduced ridership numbers.'",
        "'speaker_6': 'So all of this to simply say we really need to get extremely serious as a city very quickly about creating a mass transit system that actually gets people out of their cars in the numbers that we need to.'",
        "'speaker_6': 'I think this council did a great thing in in the voters in approving the Department of Transportation and Mobility. But we need to make use of it. You know, we just we can't leave it up to any outside agency, be it RTD or something else, or we're going to run into real trouble.'",
        "'speaker_6': 'You know, and I don't know whether the number I don't know what the number is that creates problems for us on our corridors because we've got problems now. We all know it. You know, people people say we have we have too many people in Denver and we don't I don't believe I mean, you can go get your'",
        "'speaker_6': 'haircut, go buy paint at Home Depot, change the tires on your car. What? You need to do buy groceries and you check out in a few minutes and you're on your way. But when we get in our cars.'",
        "'speaker_6': 'So I would ask our new director of Community Planning and Development and our director of Public Works to get real serious about how long are we going to go before we take action that matters in Denver. So I will be approving this tonight because I think it.'",
        "'speaker_6': 'I think it enhances the community. And but as I say, it just brought up all these concerns about moving people around and we need to do better. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I. I want to thank Councilman Cashman for his concerns about RTD and. And our struggle with getting people around the city outside of a car. 73% of Denver employees or Denver workers commute by single argument vehicle.'",
        "'speaker_4': 'And, you know, as we move from a cow town in a flyover state to a destination that, you know, our airport has, we're either number one or number two in the most direct destinations of any airport in the US.'",
        "'speaker_4': 'So as we become a destination instead of a flyover state, we really need to to lower that percentage. And on July 15th, when when we were all inaugurated, there was a reporter that brought the five new city council people together.'",
        "'speaker_4': 'And they asked, what is the biggest issue facing Denver? And I said, in my wonky way, I said, it's the relationship between land use and transit infrastructure. And so I'm obviously we can't rely on a another agency that is reducing service, increasing fares, has a massive rider shortage who's talking about significant reductions.'",
        "'speaker_4': 'So I would also share Councilman Cashman's thought about, you know, Denver, we can take a leadership role and and and now's the time for us to do that. We're at an inflection point to this particular project. I heard I'm I really like the the widen sidewalks that you have have drawn in your your plan.'",
        "'speaker_4': 'I think that that's, you know, one of the key components of making sure that people get out of their cars is to make the non car experience a positive one. And and I've seen a lot of recent development that has a curb for foot sidewalk and then, you know, 12 storey building and that's not conducive.'",
        "'speaker_4': 'Well, no wonder why people want to drive because they don't feel safe, you know, in this little it's like threading the Death Star or something, except that, you know, there's only one wall and then there's cars on the other side.'",
        "'speaker_4': 'So I like that. I like that. It's right next to a transit station. That's one of my key components. When I campaigned, I talked about the 20 minute neighborhood as and we should have everything within a 20 minute walk, right.'",
        "'speaker_4': 'A role and and locating density around transit is certainly in accordance with our adopted plans, but it's also very much in accordance with my personal values. As one of my colleagues said, unlike District ten, District four is not perfect.'",
        "'speaker_4': 'Councilwoman Black, I'm a little jealous about this this project. This is this is something that would easily fit in District ten. And, and I'm really excited that we're doing more placemaking around transit stops because that's how that's how we get that 73% lower is we have people located near places where they can easily take alternatives to cars'",
        "'speaker_4': '. I would say one other thing. One of my staff went to New Mexico over the weekend and since green chilies come up Colorado, green chili is better than New Mexico. Green chili. Thank you very much, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Sandoval.'",
        "'speaker_5': 'Thank you, Mr. President. So I think every neighborhood needs a catalytic project. I remember touring this site as a council aide, working for Councilman Espinosa, and walking around this area and thinking how it was a missed opportunity. And so when we put public information, public dollars, such as transit into areas, I would really like to see catalytic'",
        "'speaker_5': 'projects take take shape around there and make them destinations. In northwest Denver, we've always had a really robust, eclectic neighborhood, so we didn't really need that. My whole entire life I've spent living there. So but I think as sprawl has happened, we need catalytic projects and just to re-emphasize work, my colleague, Councilman Cashman, said about affordability.'",
        "'speaker_5': 'I understand that you're paying a large portion into the bucket, and I will just ask you that your future projects. I know that the bottom line everyone has a performa everyone. I come from a small family restaurant. We had a performer and it was really important when health care came to the topic that our place had health'",
        "'speaker_5': 'care. And so now I think the topic of affordable housing is on the forefront of everyone. And so I just ask you, as a developer in Denver and I'm a resident of North Denver, that next time in your projects that maybe you can pencil them in and not have to meet by law, you are meeting the criteria'",
        "'speaker_5': '. Absolutely. And by law, you're meeting the height. Right. And so tonight, we're just approving a rezoning. We don't get to approve projects. That's one of the hard things that I sit up here and feel handcuffed by is that we don't get to approve projects because I like to take deep dives into projects.'",
        "'speaker_5': 'That's my specialty. But you're getting the density. So just be true to this neighborhood and be true to Denver. So in your next project, just pencil them in, even if it's a couple units paint into it. Yes, you are.'",
        "'speaker_5': 'You are following the rule of the law. So thank you for doing that. You're not getting any special treatment. You're getting entitlement, but you are. I just want everyone to realize that that you are getting entitlement. So please be good stewards of that land and please make sure that you're thinking about that in the next seven generations'",
        "'speaker_5': '. And don't. And I would just also ask that you don't value engineer anything out. I think a lot of times communities are presented projects and then as bids go out, things are value engineered out. And so just do your best to mean true to the integrity of this project, because I really believe it could be a catalytic'",
        "'speaker_5': 'project for right in that area and that area really deserves it. It's a long time coming. And with that, I will be supporting this project. So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Ortega.'",
        "'speaker_7': 'Thank you. So I heard one of the speakers talk about the opportunity for this to be a destination. And hearing her ask for a place where singles can go was, you know, one of those suggestions. And, you know, this is a project that really I think I've been in this area.'",
        "'speaker_7': 'And to Councilman Cashman's point about the traffic on Colorado Boulevard. We all know what a nightmare it is. Right. So how these projects are done and the fact that, you know, a traffic study will more than likely be needed to address how you move pedestrians across this very busy corridor.'",
        "'speaker_7': 'We deal with the same problem along the federal boulevard corridor, which is our number one corridor for fatalities. And, you know, the fact that we are seeing so much development in this city, we have to be so thoughtful about how we address these issues on the front end.'",
        "'speaker_7': 'And we don't get to do that because we don't approve the details that you have to go work on with our folks over at the Community Planning and Development Agency. But I appreciate the fact that you had an opportunity to have this conversation with the community.'",
        "'speaker_7': 'And the fact that you've got residents pretty unanimous in support of this project is is exciting because I know this particular corner could really use some help and be that anchor project for the neighborhood. So. You know, I support the comments made about affordable housing.'",
        "'speaker_7': 'I was one of the original co-chairs when we did our inclusionary housing ordinance. Wasn't necessarily that. Favorable to developers in in terms of, you know, having to comply. But it was a tool in our toolbox that gave us the opportunity to ensure that we were incrementally addressing the needs of people in our city.'",
        "'speaker_7': 'And we're seeing our city change so drastically that people cannot afford to live here. And when we start looking at all the development that is proposed along the I-25 corridor and the potential impact that will have on the neighborhoods to the West, if we are not thoughtful about this, in looking at this at the front end, we'",
        "'speaker_7': 'lose our city. The the the part about what is so great about this city is its diversity, its diversity of the neighborhoods, its diversity of the people, the economic incomes. And I don't want to see Denver become like our mountain communities, where people have to live so far away that we struggle to find the service workers to'",
        "'speaker_7': 'support the components of many of these developments that build in restaurants and hotels. And when people have to live so far away and they can find jobs that pay the same wages closer to where they live and where their kids go to school, we as a city will struggle trying to figure out how we get workers to'",
        "'speaker_7': 'work in this city to support different sectors. So it's it's an important component of how as a city, we need to be a lot more thoughtful. And I know that development is expensive. I sit on the board of a nonprofit housing development group that does housing development for, you know, folks that are struggling financially.'",
        "'speaker_7': 'And it requires a lot more stacking of resources to make those projects pencil out. But if we're not really focused in addressing this problem, I think we start to lose what is so good about this city. And I think we all have to be very intentional about how we move that needle forward.'",
        "'speaker_7': 'And I think this project, again, is one that will will make a difference in this neighborhood. I will be supporting it tonight. But we have to keep it keep keep at it. And, you know, I know it's a priority issue for this body of council.'",
        "'speaker_7': 'We've had many, many conversations in our retreats about this this issue. And I guess, you know, this is my plea to our development community. And we have development partners in this city who are private developers who have stepped up to the plate and said, I'm going to do this.'",
        "'speaker_7': 'You know, this is important. We're going to incorporate it into our project. And, you know, yes, it takes getting your low income tax credits and some of those things that are an extra process that is added, but it adds value to the project in the long run.'",
        "'speaker_7': 'So I'll stop with that. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. All right. Seeing nobody else in the queue, I have a few things I'd like to add. One of the advantages or disadvantages to sitting in this seat is you always get two or have to go last.'",
        "'speaker_0': 'So Councilman Cashman usually beats me to the punch on talking about conformance with our adopted plans when it comes to climate change. And since he didn't steal the thunder, this time I'm going to read not the entire thing, but just a piece of it as we look.'",
        "'speaker_0': 'And this is this is in our blueprint. This is in our plan. As we look to our future, we recognize that reversing our contribution to climate change is critical. How we plan our city can help us reduce our drain on resources and reduce Denver's carbon footprint to eliminate our collective contribution to the climate change crisis.'",
        "'speaker_0': 'That commitment must be our overarching guide. And so as I'm looking at these rezonings, obviously we're all looking at that criteria and do you meet that? And I think that we're not talking enough up here about this. I think, you know, you'll hear us talk a lot about affordable housing, which is critical, and you'll hear us talk'",
        "'speaker_0': 'a lot about transportation, which certainly has climate implications. But talking directly about climate change and the impact of how we're planning and how we're building our city, I think is also critical that we're talking about and we're talking about every chance we get in a hearing like this.'",
        "'speaker_0': 'And I think what doesn't get covered a lot right now, because talking about density and redevelopment in Denver is hard right now. We are experiencing a lot of growing pains and a lot of communities are feeling a lot of change.'",
        "'speaker_0': 'And a lot of us like me who got a driver's license when we're 16 and you could get anywhere in Denver in 10 minutes, are grappling with the fact that that's not the same. City that I live in as the one that I grew up in.'",
        "'speaker_0': 'And so often that is overshadowed that conversation is overshadowed with some of the things that I think we should be talking about like that a project like this that is talking about having a very small portion that is residential housing is still going to build the equivalent of three or four, depending on where you are, five blocks'",
        "'speaker_0': 'of single family housing into it. And that's a small part of what we can do when we're building dense. Having conversations about the carbon impact of building places where people can live, but also where they work, where they play, where they stay.'",
        "'speaker_0': 'Like this has a much smaller carbon footprint than a lot of other kinds of development. And as we're looking and having conversations about density that is right on a transit station, right on major transportation corridors, that is, you know, supported by the community, that this is the exact place we should be talking about.'",
        "'speaker_0': 'How do we build density and what is that impact for our planet and for our species and our ability to continue inhabiting this planet? And we're not talking about that as a way that this is conforming with our adopted plans and meeting a critical criteria for rezoning.'",
        "'speaker_0': 'So I just wanted to shine a light on that, and that's not to discourage anyone. I really appreciated the speaker who mentioned and called out Plat Park in Walsh Park, two places in my district as great places to go grab food.'",
        "'speaker_0': 'I also have the other side of federal and maybe we should have a an east west south federal showdown on green Chile. Bring it on. Or whether you're coming to the Little Saigon district to get Vietnamese food. I mean, we've got it all in District seven and hear other communities say, hey, we want to be able to'",
        "'speaker_0': 'walk. And here's a development that allows us to walk, not to take away from driving to all the awesome places in my district. But that is those are the conversations that we have to be having about how do we build communities where people can walk and get there and can get out of their car?'",
        "'speaker_0': 'Because we have to be making those changes and we have to be making those changes yesterday. So I know that we've talked about all our wishes and dreams on affordable housing and transportation. Also throughout that, I hope that you will really consider climate.'",
        "'speaker_0': 'I hope that you'll choose to opt in to our stretch green building code when you get there and when we've adopted it. I hope that you'll outpace your requirements in our green building ordinance, and I hope that you will not put any natural gas infrastructure in for things like gas stoves, which we will have to transition off'",
        "'speaker_0': 'of long after that. This infrastructure, we're a long outlive our ability to continue using fossil fuels for those things. So with that and for all those reasons, I think this meets the criteria and thank you for the presentation from staff illustrating all of this.'",
        "'speaker_0': 'I hope we'll also continue to focus on climate in our presentations on how this meets how things like this meet our criteria. I will be happy to support this this evening. Madam Secretary Rocha.'",
        "'speaker_5': 'Black Eye. CdeBaca I.'",
        "'speaker_2': 'When I. Gillmor, I. Herndon High Hinds High Cashman.'",
        "'speaker_3': 'Five.'",
        "'speaker_2': 'Kenny Ortega. Sandoval, I. Sawyer.'",
        "'speaker_5': 'I.'",
        "'speaker_2': 'Torres, I. Mr. President.'"
    ],
    "A bill for an ordinance approving the 4201 East Arkansas Urban Redevelopment Plan and the creation of the 4201 East Arkansas Urban Redevelopment Area and the 4201 East Arkansas Sales and Property Tax Increment Areas. Approves the 4201 East Arkansas Urban Redevelopment Plan authorizing the creation of an Urban Redevelopment Area and sales and property tax increment areas in Council District 6. The Committee approved filing this item at its meeting on 11-12-19.": [
        "'speaker_0': 'Hi, Madam Secretary. Please close the voting, announce the results. 1339 as Council Bill 1058 has passed. Councilman Herndon, will you please put Council Bill 1245 on the floor?'",
        "'speaker_8': 'Yes, Mr. President. I move the council bill 19 dash one, two, four, five be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded the public hearing for Council Bill one, two, four, five is open. May we have the staff report?'",
        "'speaker_5': 'You go.'",
        "'speaker_14': 'Good evening, Mr. President. Members of City Council. My name is Tracy Huggins, and I'm the executive director of the Denver Urban Renewal Authority here this evening, requesting council's approval of the 4201 East Arkansas Urban Redevelopment Plan to facilitate development of the 40 2001 East Arkansas Urban Redevelopment Area.'",
        "'speaker_14': 'The proposed area is an area of 13.2 acres located in the Virginia Village statistical neighborhood. The site includes six parcels, five of which are positioned for redevelopment, and one of which includes a microwave tower which will retain will be retained by Seedat.'",
        "'speaker_14': 'The area is generally bounded by East Louisiana and East Louisiana. Easy for me to say. East Louisiana Avenue to the North South Byrd Street to the East, East, Arkansas Avenue to the south and the Eastern property line of the private commercial property fronting Colorado Boulevard to the west.'",
        "'speaker_14': 'One of the parcels included in the area is located east of South Byrd Street at the northeast corner of East Arkansas Avenue and South Birch Street. The area served as the seaboard headquarters for approximately 65 years in 2018, set out, consolidated its operations and relocated to a new building in West Central Denver, Colorado.'",
        "'speaker_14': 'State law requires properties owned by the state to be offered to a local government entity first before they may be offered for sale to a private purchaser. The city and county of Denver was the successful bidder for this site.'",
        "'speaker_14': 'After being selected, the city chose a master developer through a competitive selection process to effect catalytic development of the property, ensuring development consistent with the existing neighborhood area plans, economic and job development. In December of 2018, much of the site was resigned from the Campus Zone District to a variety of mixed use and residential zoned districts, with'",
        "'speaker_14': 'the intention of incentivizing the creation of a pedestrian oriented community asset that transitions appropriately into the existing neighborhood. A Condition study was commissioned in July of 2019 and it was finalized in October of 2019. The study specifically excluded any conditions relating to the buildings as they were to be demolished by CEDAW prior to the consideration of the'",
        "'speaker_14': 'Urban Redevelopment Plan. The study supported a finding of blight based on the presence of the following conditions. Unsanitary or unsafe conditions. Deterioration of sight or other improvements. Unusual topography or. Inadequate public improvements. Or utilities. Environmental contamination of buildings or property.'",
        "'speaker_14': 'And the existence of factors requiring high levels of municipal services or substantial physical underutilization or vacancy of sites, buildings or other improvements. The finding of blight is a legislative finding by the City Council. Based upon the condition study, which has been filed with the city clerk and other evidence presented at this public hearing.'",
        "'speaker_14': 'As part of the purchase of the property from the city, the developer was required to commit to certain development outcomes related to the planning and development of the site, including the preparation of a master drainage study to address all drainage issues, including onsite detention and water quality.'",
        "'speaker_14': 'A traffic study addressing all transportation issues, including offsite and on site intersections, street layout, on site multimodal connections and other elements as determined in coordination with the Public Works Department, a required minimum of 10% of the net developable area to be publicly accessible.'",
        "'speaker_14': 'Open space or a designated park. A master transportation demand management study is to be provided to the city for review and approval. In addition, each concept site development plan for a parcel of vertical development must submit a letter identifying the team practices to be utilized, a requirement to construct at least 150 housing units with a maximum affordability'",
        "'speaker_14': 'restriction of 60%, ami a covenant to develop the property in a manner resulting in a minimum of 150,000 square feet of commercial space and the creation of a minimum of 200 permanent new jobs. While the developer is bound by the above noted conditions, they are serving as the horizontal developer initially of the site and will sell finished'",
        "'speaker_14': 'pads to vertical developers. Accordingly, there are no specific vertical development plans for the site, but this slide provides a proposed conceptual site plan. The expected development includes not more than 690 residential units on the site to be located on blocks one, two and five.'",
        "'speaker_14': 'The housing may include senior and senior assisted living and a mix of rental and for sale product. All of this will be dependent on the market conditions. The 150 affordable housing units will be located on BLOCK six. It is important that the site respect the density of the area so the maximum number of residential units is capped'",
        "'speaker_14': 'at 840. The current development plan includes an approximately 130 room hotel to be constructed on block for the remaining required. Commercial development will occur on the ground floors of blocks one, two and five. The goal, again, is to be a vibrant, mixed use development that delivers housing across a spectrum of incomes and ages meets the 100,000 150,000'",
        "'speaker_14': 'square foot commercial development requirement and provides the 200 permanent jobs. BLOCK three will be an approximately one acre park to be owned, maintained and programed by the existing metropolitan district. The objectives of the Urban Redevelopment Plan are to reduce or eliminate blighted conditions and to stimulate the continued growth and development of the urban redevelopment area.'",
        "'speaker_14': 'The proposed Urban Redevelopment Project meets the objectives of the plan, as noted on the screen behind me, including the creation of complete and inclusive neighborhoods. Encourage mixed use redevelopment that is socially and economically inclusive more effectively. Use underdeveloped land within the urban redevelopment area.'",
        "'speaker_14': 'Improve access to healthy transportation options, healthy foods and open space. And promote a diverse, sustainable neighborhood economy, including mixed use and commercial development opportunities within the area. This slide, which I apologize for a challenge in reading any of it is intended to show the key objectives of the Urban Redevelopment Plan, Plan 2040 and Blueprint Denver that this'",
        "'speaker_14': 'plan and project will address the city as part of their sale transaction to the developer identified many of the strategies necessary to allow for the redevelopment of this approximately 13 acre site in a way that maximizes its development potential while balancing the impacts of redevelopment on the surrounding area, the inclusion of 150 units of affordable housing, the'",
        "'speaker_14': 'requirement of job creation, the open space dedications, the traffic mitigation requirements and the density limitations all work to mitigate the involuntary displacement of residents or businesses, respect the existing character of the neighborhood and provide new access to services and amenities.'",
        "'speaker_14': 'Any Urban Redevelopment Plan in Progress project must be determined to further the goals and objectives of Plan 2040 and its approved supplements. As this diagram intends to show, not every goal and objective of each plan can be addressed through urban renewal activities.'",
        "'speaker_14': 'However, we believe this plan and project meet the relevant criteria of the city plans. The Urban Redevelopment Plan was submitted to the Denver Planning Board on November six of this year with a staff recommendation to find the plan to be in conformance with the comp plan.'",
        "'speaker_14': '2040 Planning Board voted 8 to 1 to find the plan to be in conformance with Plan 2040 and its adopted supplements. And a letter to this effect has been submitted as part of the the record of this hearing.'",
        "'speaker_14': 'The Urban Redevelopment Plan authorizes Doura to finance projects with the in the area by the use of tax increment financing. The tiff will remedy the blighting conditions through financial assistance of costs related to infrastructure, environmental remediation and site work.'",
        "'speaker_14': 'In addition to the development challenges presented by these blighting conditions, the project is also requesting TIFF to deliver the development plan outcomes already discussed. The TIFF will also be used to help address the costs related to delivering 150 units of affordable housing.'",
        "'speaker_14': 'The additional parking, open spaces and costs associated with tower improvements. The Dora staff has reviewed the development budgets and proforma submitted by the developer and believes there is a financial gap in the project of of approximately $23.6 million.'",
        "'speaker_14': 'This financing gap will be addressed by reimbursing eligible costs through property tax and sales tax increment generated from the tax increment area, which is coterminous with the urban redevelopment area for a period not to exceed 25 years. The utilization of tax increment financing invokes the requirement that before City Council can approve a new urban redevelopment plan, they'",
        "'speaker_14': 'must find that an agreement has been entered into between Dura and the affected taxing district in regards to the allocation of property tax increment to the project. There are three other property taxing districts Denver Public Schools, Urban Drainage and Flood Control District and the East Arkansas Metropolitan Districts.'",
        "'speaker_14': 'All taxing districts were notified of the proposed urban redevelopment plan following that notification. All of these districts evaluated the impact the project would have on their ability to deliver services based on the information provided to urban drainage. They have determined that the project will have limited impact on their ability to deliver services and have agreed to allow'",
        "'speaker_14': 'all increment derived from their mill levy to be paid to Dura to support the project. Denver Public Schools has also evaluated the impact the residential development will have on their ability to provide services to schools in the Southeast planning region.'",
        "'speaker_14': 'These schools include Ellis Elementary Merrill Middle School and South High School. While DPS has agreed to allow all increment derived from their mill levy to be paid to direct to support the project, they have requested payment of just over $1.2 million from the tax increment to support the schools in the Southeast planning region per the terms of'",
        "'speaker_14': 'the DPS Inter-Governmental Agreement. The $1.2 million will be paid prior to any amounts reimbursing the developer for eligible costs. The East Arkansas Metropolitan Districts have requested that all incremental taxes generated by their mill levy be paid to them to support the redevelopment of the site.'",
        "'speaker_14': 'The cooperation agreement between Dura and the Metropolitan Districts allows for this payment. Lastly, the under the cooperation agreement between the city and borough governs the collection and remittance of both the property and sales tax increment to support the redevelopment project.'",
        "'speaker_14': 'It also limits the term of the tax increment area to the earlier of repayment of the DURA obligation or 25 years. In considering the approval of the 40 2001 East Arkansas Urban Redevelopment Plan, City Council must make the following additional legislative findings that the boundaries of the area have been drawn as narrowly as feasible to accomplish the'",
        "'speaker_14': 'planning and development objectives of the plan. If any individuals or families are displaced, or if any business concerns are displaced as a result of adoption or implementation of the plan, a feasible method exists for the relocation of those families, businesses and individuals in accordance with the ACT.'",
        "'speaker_14': 'Due to the vacancy of the project area, it contains no residences or business concerns. Therefore, no individuals, families or businesses will be displaced. Written notice of this public hearing has been provided to all property owners, residents and owners of business concerns within the urban redevelopment area.'",
        "'speaker_14': 'This written notice was mailed on October 31st of 2019, at least 30 days prior to this public hearing. Not more than 120 days have passed since the first public hearing before City Council on the plan. This is the first consideration of an urban redevelopment plan for this site.'",
        "'speaker_14': 'And this the city Council has not previously failed to approve an urban redevelopment plan for this site. The Urban Redevelopment Plan will afford maximum opportunity for the rehabilitation or redevelopment of the area by private enterprise. The Urban Redevelopment Plan does not consist of any area of open land which is to be developed for residential or non residential'",
        "'speaker_14': 'uses or any agricultural land. And lastly, that the city and county of Denver can adequately finance and agreements are in place to finance any additional city and county of Denver infrastructure and services required to serve this urban redevelopment area.'",
        "'speaker_14': 'And the Urban Renewal Plan allows for cooperative agreements between the city and area to address additional infrastructure requirements should they arise. I do want to note that this plan does not authorize any acquisition by eminent domain. So Jura is pleased to work with the city and with the control group to bring forward this project.'",
        "'speaker_14': 'As I noted earlier, the city administration to find a good project when it required the creation of 200 jobs, delivery of commercial space and 150 units of affordable housing. However, the work of Councilman Cashman and the community he represents made it a much better project when they increased the open space requirement from 10% to nearly 20%.'",
        "'speaker_14': 'With the addition of the one acre park, when they cap the total number of residential units to serve to respect the surrounding area and required traffic mitigation not only immediate to the site but also to other parts of the neighborhood that will be impacted by the project.'",
        "'speaker_14': 'These are all very important elements of the project that cannot be delivered without the assistance of urban renewal and tax increment financing. That concludes my staff report, and we respectfully ask for your favorable consideration of this plan.'",
        "'speaker_0': 'Thank you very much. All right. We have 13 individuals signed up to speak this evening, so I will call first five up to the bench and then when your name is called to step up to the microphone. Our first five tonight are Curtis Roe, Chris Faskari, Jimmy Bull, Office Chairman Sekou and Jesse Paris.'",
        "'speaker_0': 'You'd come on up. And Curtis Rowe, you're.'",
        "'speaker_9': 'Good evening. I'm Curtis Rowe with Kimberly Artist Associates. I'm a traffic engineer, prepared the traffic impact study that was.'",
        "'speaker_0': 'Referenced for this project. And I'm.'",
        "'speaker_3': 'Available to answer any.'",
        "'speaker_0': 'Questions that you may.'",
        "'speaker_9': 'Have after the comment period.'",
        "'speaker_0': 'Thank you very much. Christmas card you.'",
        "'speaker_4': 'Thank you. Good evening. I'm Chris Vickery with the control group 1509 York Street. After our robust engagement with the neighborhood, the neighborhood really challenged us on coming out with the following outcomes focus on open space, balanced density with inclusion, housing, a neighborhood retail center, solutions for traffic and improvements of the tower that's existing.'",
        "'speaker_4': 'The proposal in front of you tonight, we've have we've created inclusive development that provides doubling the open space 10 to 20% with one acre community park and other open space that will focus on seasonal programing and art, limiting our residential density to 840 units.'",
        "'speaker_4': 'That's inclusive of the 150 units of affordable housing that we'll be providing on site. That makes up to 18% of affordable housing out of the residential units. Additionally, we're going to target the separate segments to really make this as diverse as we can, and that's getting age restricted assisted living, market rate and probably for sale depending on'",
        "'speaker_4': 'the market. The affordable housing is a part of the project with or without the TIFF. Really, the tiff is really just going to expedite that getting delivered outside of what we did committed in our development agreement neighborhood center, we really spent a lot of time here.'",
        "'speaker_4': 'We're trying to create what we call the heart of a project. And you can kind of see on the site plan that was surrounded around a plaza. We studied city centers in Europe, in other places in Europe to really figure out what what's the best size and how do we activate this and do something great since we're'",
        "'speaker_4': 'off of Colorado Boulevard and we think we found the right size and placement of that, and with the density around it could be successful. That's going to be lined with restaurants, a grocery, a cop shop, other neighborhood retail center services that the neighborhood will want to come to.'",
        "'speaker_4': 'And we're going to hopefully focus local traffic since the beginning of the rezoning. This is something that we've had a head on just with the change that's coming there. We've worked with the councilmen, the neighbors and our team.'",
        "'speaker_4': 'The proposed traffic improvements that we're making on and off site. Some of those are a mile away. Off site. We're actually making low level service better than what they are today, including our our traffic. So I think that's a huge step forward.'",
        "'speaker_4': 'The other really big thing that we need to focus on is the pedestrian, the biker and other modes to get to the site. And we're proposing a very robust TDM strategy with the mobility hub and other modes to really incent people to get out of the car rather than always using Colorado Boulevard and driving to the site'",
        "'speaker_4': '. Luckily where we are, we're bordered by two bus lines, the 40 and 46 and where we have light rail that's only three quarters of a mile away. And we're going to have to create a way to connect to that.'",
        "'speaker_4': 'The existing tower is a unique beast. We'll get that one and get it redesigned. And we really envision this as the project, not Cherry Creek, not Rhino, not low, high. It's a culture and experience. It's our Virginia village.'",
        "'speaker_4': 'Thanks.'",
        "'speaker_0': 'Thank you. Next up, Jimmy Buffett.'",
        "'speaker_4': 'Good evening, counsel and councilwoman. I'm Jimmy Butler, office co-founder and principal of the Cancer Group. And we're the company that's developing this great project in front of you guys tonight. We're here tonight to seek your approval for a tiff.'",
        "'speaker_4': 'With this tiff, we can create this amazing project, and we can create this best community. We can create the best community possible with a set of enhancements that will help transform this great development into an unforgettable one. This quick recap This project is comprised of 150 units of affordable housing that we will be built on site.'",
        "'speaker_4': 'It also is going to include another 690 units, a market rate unit for sell units, senior living and for sale product. We also are planning to construct this vibrant, walkable community where we'll have a grocery store, cafes, restaurants, neighborhood, community, neighborhood oriented retail that will service the surrounding neighborhoods.'",
        "'speaker_4': 'We plan to create 200 permanent jobs, and then we also plan to reintroduce the street grid. Asch and Belair will come through between Louisiana and Arkansas. So these were all the requests that were put in development agreement. When we had our ten meetings with the community, we heard great things.'",
        "'speaker_4': 'That cannot be taken lightly. And so we heard that the community wanted a park, which we're going to deliver on this site. And that's taken the the open space from 10% to 20%. We're also going to deliver a rebuilt of a tower.'",
        "'speaker_4': 'Right now, the tower on site is an eyesore and we plan to beautify that tower and make it more of an icon than than an eyesore for the community. We also are doing a cop shop and we're also doing a vibrant, vibrant streetscapes that's very walkable for the whole community.'",
        "'speaker_4': 'I am asking you for your support tonight, but I want to thank all the groups that have helped shape this project from City Administration Public Works, CPD host the Division of Real Estate Cities Attorney's Office, Councilman Cashman. And of course, the neighbors and all those stakeholders have really shaped where we are tonight, and we're going to continue'",
        "'speaker_4': 'to work with all stakeholders as we built this great project. I'll be available to answer any specific questions once all the speakers have concluded. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Chairman Sekou.'",
        "'speaker_3': 'Chairman say who likes the arts movement? Self defense. Very rarely. After over 15 years of coming down here. Can I actually consciously. Support a project such as this. It is. Thoroughly organized. It includes. All other aspects that allows the city's poor, vulnerable community to be included.'",
        "'speaker_3': 'In terms of housing and jobs and being welcomed into a community that is privileged. And perhaps most importantly, because I can't speak to the good and bad intentions of any of the council members. I can certainly affirm without mentioning anybody's name that.'",
        "'speaker_3': 'This was good. This could. That's good. And the people of this neighborhood are very lucky.'",
        "'speaker_0': 'Could you speak to the microphone so everybody can hear.'",
        "'speaker_3': 'People and people in the neighborhood who've come here for support or against a very lucky to have the quality of leadership that currently exists for this district. Now, of course, that's no endorsement because rarely do we agree on stuff.'",
        "'speaker_3': 'But I got to go. I got to go get this one. And I'm glad I came tonight because this is one of those things that I didn't expect to happen here. So. Good luck. Congratulations. And Tracy. Smile. I'm not going get you this time.'",
        "'speaker_0': 'Thank you. Next up, Jesse Paris and I'll call the next five up to the front bench. Pamela Whitney Walsh, Debora Powers, Monte Powers, Brooke Webb and Russell Welch. Go ahead.'",
        "'speaker_12': 'Good evening. Council President Clark, members of council members of the audience, those watching at home. My name is Jesse. Listen, Paris. And I'll be your next mayor in 2023. And I slogan is Just for the poor people. Our prophet and I represent for Denver Homicide out loud, Blackstar, some more self-defense forces have actually come in for social'",
        "'speaker_12': 'change, as well as the Unity Party of Colorado and the Universal African People's Organization in my OHI knows I am still reluctantly against this because for the simple fact we were told we can do better this whole time.'",
        "'speaker_12': 'And all I keep seeing is rezonings for more housing that people cannot afford, you need to just stop corner at affordable housing and just say, Look, this is not affordable. You're just not going to be able to afford this 60%, am I really?'",
        "'speaker_12': 'That's that's the best we can do. While we have how many vacant luxury apartments in this town, it is apparently clear where your priorities are. And it is not affordable housing, let alone attainable house. And tonight I've heard two rezonings for housing that most people, especially people that look like me, cannot afford.'",
        "'speaker_12': 'But yeah, I keep hearing all this stuff about diversity and inclusivity and it meets this criteria. So systems are the criteria. You're going to approve it anyway. But logically speaking, this is not the answer. But I have a good relationship with Councilperson in this district, so it's going to be a reluctant.'",
        "'speaker_12': 'Yes on this. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Pamela Whitney off.'",
        "'speaker_2': 'Good evening.'",
        "'speaker_10': 'I'm Pamela Walsh and I reside at 1316 South Elm Street. And I'm here tonight in support of the financing needed for the redevelopment of this project. I participated in nearly every one of the ten community meetings hosted by Castro in my roles as a prior board member of the Virginia Village Community Association, as well as the East'",
        "'speaker_10': 'Evans Business Association, and tonight as a neighbor. I live just about half a mile or five blocks from the site, and I'm anticipating this new development to be my go to for all of my basic amenities and services.'",
        "'speaker_10': 'Potentially hair salon, dentist, veterinarian and entertainment like a park and movies and restaurants. I dream of living a mostly carefree lifestyle, and I think this site has the potential to not only provide for most of my household needs, but also to elevate the reputation of the southeast Denver neighborhood as a destination and something for other neighborhoods to'",
        "'speaker_10': 'aspire to. Specific to the funding being requested tonight, I believe that TIF financing is critical to address some of the fundamental components of the site redevelopment so that it can fully maximize its potential, including the creation of a neighborhood park and more open space that might otherwise not be possible.'",
        "'speaker_10': 'The ability to more effectively address traffic management and thoughtful design transfer to thoughtfully design transportation options like public transit and car share to minimize the impact to the neighboring community, to reconnect the grid that was previously obstructed by the on campus, and to beautify the communications tower that is currently an eyesore.'",
        "'speaker_10': 'Finally, I believe the program is worthy of this incremental financing because Castro group has demonstrated that they're genuinely interested in committing to creating the best experience for our community, as evidenced by their ongoing community meetings, adjustments to their plans based on our input, including the maximizing of low income housing units, and providing a park and engaging a'",
        "'speaker_10': 'local architectural expert to advise on their conceptual designs to ensure that it meets that it fits in with our community esthetic. So as a neighbor who stands to benefit from having a locally focused one stop shop that reflects the charming midcentury modern design of our special neighborhood, I ask that you vote in support of funding tonight.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Debora Powers.'",
        "'speaker_2': 'Hi. I'm Debra Powers. I live at 4503 East Arkansas Avenue, and I thank you for the opportunity to speak with you tonight. January 2020 marks the two year milestone to my introduction to the project and my first Cantrell neighborhood meeting.'",
        "'speaker_2': 'The neighborhood embraced affordable housing as part of the project control grid. We wanted more open space and then we wanted more open space. And they went back to the drawing board and they gave us the park. I envision this development, bringing a vital, vibrant addition to our ever changing city.'",
        "'speaker_2': 'I will walk to many new amenities that the development will offer. I like that the retail will support local businesses. I am most excited when I hear that there is a discussion of a transportation hub being created here.'",
        "'speaker_2': 'It makes sense that a tip investment will be used for the redevelopment was a thoughtful inclusion by the control group to partner with Dora. One of Dora's objectives is to steward a citywide vision as Denver grows and changes.'",
        "'speaker_2': 'I find Dora had a hand in some of my favorite development projects throughout Denver. Larimer Square, the Pepsi Center. Ari, the Sauce and University Hills. Let's move this project forward and provide the investment needed. Tonight I ask for your support.'",
        "'speaker_2': 'Please vote to approve the partnership and tip investment that will help finance this redevelopment in my neighborhood. When we bring it across the finish line, I believe it will be exceptional.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Monte Powers.'",
        "'speaker_3': 'My name is Monte Powers. I live at 4503 East Arkansas Avenue. Thank you for letting me speak to you tonight about the redevelopment of the property of 4201 East Arkansas Avenue. I believe Cantrell has assembled the best team to do this project and the control group that proven that they care about my community.'",
        "'speaker_3': 'When other developers would have bought their way out of a 60% and my affordable housing, Cantrell chose to include these people in my community. I've been to all ten of the community meetings. Controls had controls listened to my community.'",
        "'speaker_3': 'The plan has evolved as a response to community input. I'm excited to have a new restaurant and retail opportunities with walkability in my neighborhood. I'm happy that there will be a small park as part of this community, and I'm also excited about the plans for transportation hub.'",
        "'speaker_3': 'This is a great project that can transform this part of Denver. The use money generated by the by the use of tiff money generated by the revenue created by this project are useful tool to let Dura and Cantrell have a development that will stand the test of time and be a model for future development.'",
        "'speaker_3': 'Please vote for TIFF funding for this development. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Brooke Webb.'",
        "'speaker_10': 'Good evening. I'm Brooke Webb. I live at 5382 East Colorado Avenue, about eight blocks from this the space. The reason I'm speaking tonight in support of the TIFF funding is because of many of the features that have already been mentioned tonight.'",
        "'speaker_10': 'So I'll just quickly run through them. But my understanding is we're getting around a one acre open space park, many restaurants and shops. There's going to be a mobility and transportation hub. And we need to retrain, retain and attract families to the neighborhood.'",
        "'speaker_10': 'My daughter attends Ellis Elementary School, which has a population that's been decreasing. We really need the affordable housing. As of right now, 85% of the students that attend Alice Elementary are on free and reduced lunch. So even though we're in a very affluent neighborhood, there's still a very big need for affordable housing in the neighborhood.'",
        "'speaker_10': 'And I also think that funding is very important for the tower. Right now, it's an eyesore, but it sounds like it's going to be a place finding landmark for the future for the neighborhood. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Russell Welch. And Stewart Anderson Jeff to Hardie and Bill James if you'd come up to the front bench.'",
        "'speaker_3': 'Good evening, everyone. My name is Russell Welch. I live at 1964 South Pontiac Street. I represent my family and they're probably the toughest constituents I'll ever face. So that drove me to be here tonight. You know, I've been part of this since the very beginning, and I've not seen a developer in my time working in commercial.'",
        "'speaker_4': 'Construction acts the way Castro does. They've not only spoke, but they've listened.'",
        "'speaker_3': 'They listened to all of our needs. They provided the open space and the retail that we so desperately need.'",
        "'speaker_4': 'I've lived there.'",
        "'speaker_3': 'For 15 years, so my kids have grown up there. We live across.'",
        "'speaker_4': 'From the Sears that we see that's.'",
        "'speaker_3': 'Dead. And hopefully soon it'll it'll come back to life. But we have no place to go when it comes to meeting our neighbors.'",
        "'speaker_4': 'And many days, we look longingly at South Pearl Street or South Gaylord Street in the festivals that we can't ride our bikes to, we can't walk to. And our kids need that. Our families need that. And I think our community needs that.'",
        "'speaker_3': 'We can look to other examples of projects that have had that have had TIFF financing in our area.'",
        "'speaker_0': 'Whether that's you, Hills or Tamarack.'",
        "'speaker_4': 'They've been successful. But you know what? Those are just retail. This project brings people together.'",
        "'speaker_3': 'Go have a beer with one another.'",
        "'speaker_4': 'Go out, play.'",
        "'speaker_3': 'Some horseshoes or cornhole or whatever. We don't have that and we desperately need it. This is a 13 acre site and this is your chance to make a good project. A great project.'",
        "'speaker_4': 'And I've lived in Denver a long time, and I don't know that our city council does things just good.'",
        "'speaker_3': 'We do it great. And in order to do that, we.'",
        "'speaker_4': 'Have to pass the TIFF financing. So my constituents will be very upset with me if I have to go home and tell them that this didn't pass. So I implore you, please pass the two financing. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Stewart Anderson.'",
        "'speaker_3': 'Street, Anderson 1041 Marion Street. I run an organization known as Transportation Solutions. We work in that area where the control was building and we've been working with them in good faith to address a variety of issues that you've heard about.'",
        "'speaker_3': 'And certainly there's three core components that we're looking at. One is to create a multimodal environment that means anybody can get around walking, biking, using a cargo bike, whatever it is that they need a car share, it'll be there.'",
        "'speaker_3': 'The focus is this mobility hub that will be placed on the east side that will not only benefit those at that site, but the residents around that area. It'll improve access to Colorado station for residents of that area.'",
        "'speaker_3': 'And the second is to connect the network. We're trying to connect to the Florida bike path so that so this property is connected to all other types of facilities that are available. But the third point that I'd like to call out and why I think this investment is very important, is that they've really focused on one thing'",
        "'speaker_3': ', and that's called internal capture, and we overlook that too often. Internal capture means putting a grocery store in that property where you have residents. There's not going to be somebody getting in a car and driving to the grocery store.'",
        "'speaker_3': 'It reduces those trips, and a well-designed facility can reduce up to 30% of their trip generation by putting different uses and making those available. And one thing that we don't look at at the city is how many trips we reduce from people around the area.'",
        "'speaker_3': 'And I think having a grocery store, having restaurants, having the ability to walk in an area that was blocked by the court headquarters when you're going north and south, allows people to get out and to enjoy these things.'",
        "'speaker_3': 'And I really think it's going to be an asset for the community. And I would encourage you to go forward with the funding and make this happen. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jeff Tardy.'",
        "'speaker_9': 'Good evening. Jeff Hardy, 1970 South Clayton Street. In listening to Tracy earlier tonight, she was talking about the financing package, which included about 23 million and change of eligible TIFF dollars for this project. And I'm thinking about that gap that's provided and that unique opportunity tonight to approve a package of public money, to go back into the'",
        "'speaker_9': 'community, go backing into the roads, allowing for a catalyst or for future development, open space. We're creating jobs, 200 plus jobs, commercial retail, affordable housing for sale, for rent, housing, product, a true mixed use community.'",
        "'speaker_3': 'We have an opportunity that's unique.'",
        "'speaker_9': 'I just want you to realize that as you make your choices, you have a good developer who stands behind their word here. We have a unique tool to take this from a good project to a great project and make this be almost a legacy model of what TIFF can be for future projects.'",
        "'speaker_9': 'So with that, I ask you to approve tonight's TIFF package.'",
        "'speaker_0': 'Thank you. Thank you. Next up, Bill James.'",
        "'speaker_3': 'Thank you. I'm Bill James.'",
        "'speaker_0': 'I live at.'",
        "'speaker_3': '1145 South Glencoe Street for those council members that haven't met.'",
        "'speaker_0': 'Me before. I was on the board of directors of RTD.'",
        "'speaker_3': 'For two terms and then a.'",
        "'speaker_0': 'Couple of years ago. And I'm a commercial.'",
        "'speaker_3': 'Real estate appraiser.'",
        "'speaker_0': 'And consultant.'",
        "'speaker_3': 'I lived in the Cherry Creek area for a long.'",
        "'speaker_0': 'Time and now live in the.'",
        "'speaker_3': 'Virginia Village area. And I'm happy to do that. And one of the things that I found was there's an opportunity presented by this site, and I decided to support the site. Among the things I.'",
        "'speaker_0': 'Support because of my career are cost effective public and private resources, affordable housing and enhanced mobility. I'm one of the founding.'",
        "'speaker_3': 'Members of the Board of Directors of Transportation Solutions, which is run so well by Stuart Anderson.'",
        "'speaker_0': 'I'd like to say good real estate's supporting residents and businesses. And there's a number of things that this project that I see that I appreciate a lot among them, that the council's willingness to listen to citizens and the input that they were able to give.'",
        "'speaker_3': 'The city, taking the opportunity to take this site.'",
        "'speaker_0': 'And encourage its redevelopment.'",
        "'speaker_3': 'In ways that can benefit the community.'",
        "'speaker_0': 'As well as it can. The result of the site feel it took place a little while back. It was, I think, very helpful to allow retail and gathering place type uses. The the.'",
        "'speaker_3': 'I really appreciate the the outreach that Cointreau.'",
        "'speaker_0': 'Has done. I've watched some of the other projects that they do and it's and this.'",
        "'speaker_3': 'Is likely to turn out to be a very good project as a.'",
        "'speaker_0': 'Result of that, the affordable housing component that has been required along the way is is sure to benefit.'",
        "'speaker_3': 'The neighborhood, contribute to balance the.'",
        "'speaker_0': 'Mobility enhancement that is.'",
        "'speaker_3': 'Required.'",
        "'speaker_0': 'The team will benefit the neighborhood as well. I really appreciate the fact that the antenna tower.'",
        "'speaker_3': 'Will be beautified as.'",
        "'speaker_0': 'Much as it will be. And then Control's agreement to include a park in the in the development as well. The and some of the conversations that I've had with them.'",
        "'speaker_3': 'Encouraging things like a food.'",
        "'speaker_0': 'Hall.'",
        "'speaker_3': 'Developments that.'",
        "'speaker_0': 'Can cause people to be attracted to this location and make it so that this neighborhood has a a gathering place.'",
        "'speaker_3': 'Similar to the Cherry Creek that.'",
        "'speaker_0': 'I don't live in anymore. So I really encourage.'",
        "'speaker_3': 'The council to.'",
        "'speaker_0': 'Approve this TIFF financing. Thank you. Thank you. That concludes our speakers on this item. Are there any questions from members of council? Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. May I have a question for Director Huggins or a couple of questions? They should be quick, though. Thank you for coming. Does this application require a letter of support from a city council person?'",
        "'speaker_14': 'We have requested a letter of support from the councilperson, and through that, the conversations that we have had with the councilmen during the course of this have really stood in the place of that letter at this time. But we have we would always prefer to have a letter of support, but that has not been received on this'",
        "'speaker_14': 'project.'",
        "'speaker_4': 'Okay. Thank you. And that's it for direct or. Excuse me, Mr. Bluffs, may I ask you a couple questions? And thank you, Director Hawkins. Hello. Hi. How's it going? Good. Thank you for living in District ten. Sorry you moved out of District ten.'",
        "'speaker_4': 'Anyway, so I had a couple of questions about the development. Do you have. In the presentation, there was a thought of linking this site to the nearby transportation three quarters of a mile away. Do you. Since. Since it was brought up, do you have any ideas on how that might happen?'",
        "'speaker_4': 'Yeah, there there was the bus line 46 I believe that runs Belair, that runs North-South. It's still not running as efficient as it can, but we plan to sit down with our team, our multi mobile team and work with RTD to see how we connect to it.'",
        "'speaker_4': 'I know at one point there was a chariot that ran with Glendale that went away, so I think there's some ideas there, but I think it's going to take some discussions with some stakeholders that can get us to that stop.'",
        "'speaker_4': 'Yeah. Chariot actually went through your neighborhood between Camp Hill and Cherry Creek, so I'm familiar with the project was very short lived, but yeah, a just as other potential sites, Inglewood has the art bus that connects the transit station to the businesses surrounding the community.'",
        "'speaker_4': 'So if there's something that that could be similar. So I like the idea of of connecting the site to the transit hub because we've talked a lot about multimodal transit, and I'd love to further encourage getting people out of cars.'",
        "'speaker_4': 'Um, did I hear that you're restoring the grid, as in reconnecting through streets? Yeah. So part of the development agreement was to at least bring one of the streets through, and that was built there. And so right now you have Louisiana to the north and Arkansas to the south, and you have.'",
        "'speaker_0': 'A big block.'",
        "'speaker_4': 'That is stopping the Denver street grid. So with a tiff, approval will connect Belair and Astro. So and what was the thought process behind Reconnecting Through Streets? Is that I mean, was that a requirement from the city or one of the streets is.'",
        "'speaker_4': 'But I think we can we want to build this vibrant community. And a lot of the charm around the city is on a grid. And we just want to want to keep it. Why recreate the will? So we just decided to kind of continue it.'",
        "'speaker_4': 'Sure. And and I think your your plan is probably already well down the path. If we are encouraging multimodal modal transit, I would love to pedestrianize more streets rather than car and ize them. Yep. So just just as an ash is probably going to be more of a private street, the metro district will control it.'",
        "'speaker_4': 'And we want to make it all brick. And we we want to make it more of a private street that's more pedestrian friendly than car. I mean, there's not going to be any surface parking lot through this whole site.'",
        "'speaker_4': 'So this is going to be a very pedestrian oriented development. And that's absolutely fair to. There are a lot of European streets. I think someone mentioned European earlier tonight and a lot of European streets that technically allow cars, but it is designed more for people than it is for cars.'",
        "'speaker_4': 'So thank you for considering that. And then the last thing I'd say is you talked about how this is a community for a lot of people and you talked about age and income. I I'd just a do you are you putting in disability friendly units or are you considering that?'",
        "'speaker_4': 'I guess I would just say I would invite you to to make that part of your conversation as well. Yes. As when we get to the detail drawings, we want an inclusive community. So. Great. Thank you, sir. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_6': 'Thank you, Mr. President. I do have a couple of questions. But first, in response to Councilman Haynes's question to Tracy, I decided against providing a letter in advance, because this is a very serious, important discussion, and I didn't want to short circuit that discussion.'",
        "'speaker_6': 'It was neither. No inference should have been made from that. Let's see, Chris. Question for you. So the the area that the park. Will be constructed on is an area that historically has been connected with some environmental challenges.'",
        "'speaker_6': 'Can you speak about that? And does that affect construction of the park? We just.'",
        "'speaker_4': 'Yeah. Yeah, no problem. So the northeast corner is has a historical contaminated site. Cedar has been actually in the for a program with the Department of Health and being required to clean it since the eighties. They're making good headway.'",
        "'speaker_4': 'It's basically isolated to the groundwater now, and it's right at the northeast corner of basically Louisiana and Birch. So that doesn't mean you can't occupy. It doesn't mean before they see that had employees operating in the facility. And in this circumstance, how it'll work is Cedar still actually owns the underlying land.'",
        "'speaker_4': 'They're still going to be required to take care of the contamination and close out the site. And how we operate under that is it's actually a license agreement that will allow us perpetual use and to develop there. So once we kind of get along with design, we'll see that in us.'",
        "'speaker_4': 'We'll go meet with the Department of Health to then say what's safe here and what do we need to do? Does that mean we need to do a vapor barrier and take out some dirt to make sure it's publicly safe and then everybody will sign off and the park can be installed.'",
        "'speaker_6': 'Okay. And Chris, have you figured out yet the exact size of that park? I know it it has to do a bit with the tower and some other factors.'",
        "'speaker_4': 'So right now, we're still at probably about 1.42 acres we're getting close to. And what's been hard about this is we're trying to solve the tower site. The tower side only has about 9000 square feet. It was used utilizing all the facilities of seedat.'",
        "'speaker_4': 'So or trying to solve for them is what do you need? Is that bathroom? How big of a kitchen? How many employees you're going to have there? So we're getting close to that. I have a weekly call with the state trying to satisfy what they need.'",
        "'speaker_4': 'And that's really what's driving that. That size is they might need some parking. So it'll be above an acre for sure. And right now we're at 1.42 acres.'",
        "'speaker_6': 'And can you. Are there other one acre parks that come to mind?'",
        "'speaker_4': 'Yeah. So we've done a good study and that's a good idea. We took the councilman on a quick drive just to kind of give some scale to things like Governor's Park McKinley, which is in Cherry Creek. There's a couple in Lodi that are around that size.'",
        "'speaker_4': 'And it's all about quantity. And you know what you're providing in that quality of that park. We're working with a public it's called Gale out of Copenhagen that's going to help us program how that will work. And they'll we're going to treat it just as a it's like a city park.'",
        "'speaker_4': 'We're going to have neighborhood meetings. We're going to go out and say what's going to what's needed here.'",
        "'speaker_6': 'And this is a public park. It's not just for the developer.'",
        "'speaker_0': 'Correct?'",
        "'speaker_6': 'It's created. Okay. You know, that's that that's good for right now. Thank you. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Sawyer.'",
        "'speaker_10': 'Thank you, Mr. President. Tracy, I just wanted to ask a.'",
        "'speaker_5': 'Couple of questions. I know the last time we met was when we were setting an urban renewal area up on East Colfax. And there were a lot of questions around gentrification and displacement and the effects of an urban renewal area on the community.'",
        "'speaker_5': 'And so I just wanted to ask a couple of questions about what steps you have taken in this area to help ensure that that those kinds of issues are not going to happen in this area.'",
        "'speaker_14': 'So I think that the first and foremost, the current condition of the site really is important to take into consideration. It is now, since the buildings have been demolished, it is vacant. So we are not looking to go in and take something that an existing business that was there because they already left the site to be able'",
        "'speaker_14': 'to to bring new opportunities. I think the addition of the affordable housing really helps to provide new people coming in, as well as people who are already in the community have new options. I think the considerations of the age, the the senior and senior assisted again allows people in the neighborhood who are already there a different alternative'",
        "'speaker_14': 'as far as being able to stay in their neighborhood even as their life circumstances change. We did look a lot at the demographic around the area and its location very close to Colorado Boulevard already provides some additional barriers to change, if you will.'",
        "'speaker_14': 'You already have a very well-developed commercial corridor to the west. You already also have very well-established residential, albeit highly rental. This is a portion of the neighborhood that has a high degree of rental housing. And so this will add to that.'",
        "'speaker_14': 'But it has been in place for a long time and see this as really complementing as opposed to competing with with that site. So thinking about jobs, thinking about the affordable housing, thinking about just the infill nature of the site itself, I think all work to help mitigate the overall impact of change in this as you move'",
        "'speaker_14': 'farther to the east, really established in residential neighborhood, some hope we believe that all of those things in combination will help address what might otherwise happen happen to the area.'",
        "'speaker_5': 'Great. And then in terms of this is a little bit different because it comes with the tiff attached to it. So is this a is this then for a specific project or is this covering the entire area? So clarify that a little.'",
        "'speaker_5': 'Sure. Sure.'",
        "'speaker_14': 'So the urban renewal plan establishes the urban renewal area, which is just the property that started on. That is also the boundaries of the tax increment area. So the taxes that are generated only from that area is what we will capture to then reinvest back into the project to help deliver it.'",
        "'speaker_5': 'Perfect. Thank you so much.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Seeing no other questions. The public hearing for Council Bill one, two, four or five is closed. Comments by members of Council or Councilman Cashman.'",
        "'speaker_6': 'Thank you, Mr. President. And my colleagues will indulge me. I do have some thoughts. I've been living this project 24 hours a day for the past couple of years. It's never been very far from my mind. I live about seven or eight blocks from the site and I love my neighborhood.'",
        "'speaker_6': 'I'm not moving anywhere. And so whatever form it takes, I'll be living with this project as long as I'm on planet Earth. From the first time I heard about the potential redevelopment of the 13 plus acre site at East Arkansas Avenue and South Byrd Street, I've had one concern, and that is that whatever is built on the'",
        "'speaker_6': 'site and I've said this a million times, that it enhances the Virginia Village community rather than overwhelms it. So what does that mean? To enhance the community would be to bring in a mix of housing and commercial uses that allow Virginia Village residents and other locals to live, work and or play on the land where Colorado Department'",
        "'speaker_6': 'of Transportation held forth for for many decades. To earn money there or to spend money there at neighborhoods serving businesses within walking distance of their front doors. Overwhelming the community would involve traffic going to and from the site that the nearby arterials and collector streets cannot handle, thereby sending traffic streaming on to local residential streets where it's'",
        "'speaker_6': 'not intended to go. So the previous zoning for the site allowed for substantial use of 12 storey construction after initially considering some 12 storey construction on the northwest corner of this site. Kentaro decided agreed to drop the maximum height for the development eight storeys as part of the turf negotiations.'",
        "'speaker_6': 'As you've heard, the developer has capped the total number of doors, residential doors at 840. The development agreement went well when the rent control engaged with the city to purchase the site. The requirement of 150 units of affordable housing had a buyout agreement on it, a cash in lieu.'",
        "'speaker_6': 'And as we would go to the public meetings and they would say of affordable housing, affordable housing, I would tell them, you know, it's just another maybe the way maybe it'll be a health club or maybe it'll be something else.'",
        "'speaker_6': 'And so as things move forward, the development agreement they signed and agreed that that 150 units of affordable housing was a definite must do as part of the project. And as as I believe Tracy mentioned, that takes the affordable component to 18% on this site, which is getting close to what we should be doing on every site'",
        "'speaker_6': ', you know, where usually we talk about 10%. This is nearly double that. The developer's own estimates have predicted that traffic generated on the site is expected to grow anywhere from 5 to 7 times over what the old DOT site generated to reduce that number.'",
        "'speaker_6': 'At my request, early on, Kentaro contacted Transportation Solutions and ended up contracting with transportation solutions to devise infrastructure and processes to reduce auto trips to and from the site. Again, at my request, even though there have been no formal site plans available to work with.'",
        "'speaker_6': 'Courtesy Kim Lee Horne has and Kentaro have have worked with Denver Public Works in two different teams since we lost the first team to other cities, but have worked repeatedly to to get ahead of the game and assess traffic mitigation opportunities between Colorado Boulevard and Holly Street from Arkansas down to Florida and have come up with with'",
        "'speaker_6': 'a number of recommended improvements. And while that while the tiff includes some money that would go towards paying for these improvements, these traffic mitigation measures should along the way Denver Public Works decide. You know what, guys, that's not enough.'",
        "'speaker_6': 'We need more. That will have to come from the from the developer's pocket. And that's part of this of this TIFF agreement. And again, has been said, the agreement includes that whatever ends up being built needs to generate 200 permanent jobs, 200 new jobs, in addition to the construction temporary construction related positions.'",
        "'speaker_6': 'It is conceivable that during construction on this 13 acre site, multiple companies will be working on site at the same time. And so Control is also agreed to assign a single construction manager so that any concerns that might be related to construction will have one point of contact to.'",
        "'speaker_6': 'Carry that, carry the message where it needs to go. And in late in the project, realizing that Denver Parks and Rec now has a. Substantial fund for purchase of parkland along with Parks and Rec. We met with Castro and started discussions on wood with the city.'",
        "'speaker_6': 'Purchase some land and buy a park. And the city wanted two acres. Castro was unable to to work that into their plan, but then took the approach of they would construct a park in the 1 to 1.4 acres, a number, as you've heard, that will be accessible to the public.'",
        "'speaker_6': 'It will be designed with public involvement. And that brings that the normal ten again, the normal 10% open space figure, which should be more as we access as we evaluate projects moving forward, this gets us up closer to 20%.'",
        "'speaker_6': 'You've heard the money will be used to beautify the erector set my communications tower that has had nothing in the way of esthetics. And one thing that most people probably understand, some people may not right now. And while Seedat was on that land, it did not generate tax money.'",
        "'speaker_6': 'You know, the state was tax exempt. So while we are considering entering into a deal where for a couple of decades the taxes generated will not go into city coffers, they are paying for investment in connecting the street grid and all the other improvements.'",
        "'speaker_6': 'And after those 20, 25 years, substantial tax revenue in the millions will be coming in to the city annually. Let's see as far as the jobs. By involving Dora in a TIFF and managing a TIFF program, though, those 200 permanent jobs and the construction jobs are subject to a first source hiring dictate that requires that they welcome'",
        "'speaker_6': 'first application from low income Denver residents. It doesn't mean that the jobs have to go to those people, but it does mean they have to be given serious consideration. You know, in our current especially in our current construction, with so much building going on around the city, those jobs can be can be difficult to fill.'",
        "'speaker_6': 'What else? 23% of the total project budget, excluding the land costs, will be devoted to SB firms, small business enterprise firms. That number is not set in stone. It is a guideline. There are no penalties, particularly if they don't reach that number.'",
        "'speaker_6': 'However, they will be required to present a plan to doer to show how they intend to reach that number. One of my first requests, when we considered this project two years ago, there was a cop shop at Monaco and Lead Stale that had lost their lease.'",
        "'speaker_6': 'And I ask that they consider finding, you know, a couple hundred, few hundred square feet for a cop shop. And while the details haven't been settled, there's what I consider a handshake commitment that that will be part of this project in some form.'",
        "'speaker_6': 'Last thing as far as. Why would we want to enter into this agreement is it provides an overall degree of oversight over what's going to happen on this property. That wouldn't be there if there wasn't this involvement with Dura.'",
        "'speaker_6': 'I'm believing what the developer says, that they intend to sell the pads to other builders, vertical builders, and then take back management and ownership of the retail portion. I believe they'll remain on site should they decide to sell.'",
        "'speaker_6': 'Any sale needs to be approved by Doura to ensure that the plan that we're approving, whether it's Cantrell or anybody else, gets carried through. So this has been a real wrestling match for for a couple for a couple of years.'",
        "'speaker_6': 'As I said to Councilman Hines. You know, I don't know. It was a month or two months ago when this hugging said, you know, we really would like a letter from the council member and say.'",
        "'speaker_3': 'No.'",
        "'speaker_6': 'No, we're we're still talking about this. There's still work to be done. I don't know whether we've gotten to the point that I have been aiming for as creating a development that is going to enhance more than impact.'",
        "'speaker_6': 'I think we've made real, profound steps in that direction. So now we'll just continue as a community. Should my colleagues support this project to try to build something that I think is what my neighbors would want? So, yes, I will be supporting this package this evening, and I hope that my colleagues will join me in investing in'",
        "'speaker_6': 'the Virginia Village community. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. The city saw this as a great opportunity when Cedar was moving away from this site and we were given the first right of refusal in the city, said, Yeah, we want it, but we're going to turn, turn around and put it out to bid.'",
        "'speaker_7': 'And I had the opportunity to attend a couple of the community meetings and saw the incredible work that was being done by the Kintore Group in in terms of really listening to the community and incorporating that input into this project.'",
        "'speaker_7': 'Clearly, the TIFF piece is a critical component that makes the overall finances of the project work. But. I think in general, you know, the fact that you're doing more affordable housing on the site than is normally requested with other TIFF projects that you're doing more open space than is normally requested or provided is just speaks a lot'",
        "'speaker_7': 'to the commitment and the dedication of this team in bringing forward a project that the community was happy to support. And you had community people here tonight. We didn't see any naysayers. Even to have Sekou and Jesse here speaking in support.'",
        "'speaker_7': 'I guess Jesse was sort of on the fence, but. You know, Brother Sekou is typically very critical of development projects that don't incorporate, you know, certain elements. And obviously the affordability that is part of this project and the fact that it will it was going to happen regardless of whether the tiff was in, you know, Inc., I'",
        "'speaker_7': 'think speaks a lot to the the genuine commitment that this team had to making this a quality project for this neighborhood. I would love to be able to connect you guys to some local groups. We have some incredible models like The Prodigy Coffee, the work options for women, the commercial program over on the taxi site.'",
        "'speaker_7': 'These are all incredible services being provided to the community. But at the same time, they're they're working with different segments of our population and they're giving back to the community as well. So I would just hope you would consider some of those as as potential options to have as as possible tenants in some of the spaces that'",
        "'speaker_7': 'you guys are going to be having, depending on, you know, what that makeup or the mix of of those various types of businesses are that are going to be on the site. So I'm happy to support this tonight.'",
        "'speaker_7': 'I think this is clearly a model that I would hope that other developers take note of and really look to in in terms of. Actually what used to be provided to City Council on a pretty consistent basis before the zoning code was changed.'",
        "'speaker_7': 'And some of us are talking about trying to codify some of those old steps that used to be part of the zoning process. So stay tuned on that. There's there'll be a lot more conversations with the development community about that before anything is brought forward to city council.'",
        "'speaker_7': 'But great job. I think your your team did an amazing job in working with the community. I want to thank Councilman Cashman for his tenacity in continuing to push the envelope and really ensure that this is a project that was, you know, supported and welcomed by the community.'",
        "'speaker_7': 'Does it mean there won't be some challenges? I think with any project, it's all kind of continuing to work through those details with the community once the the development phase of it gets started. But this is a big step in moving the project forward.'",
        "'speaker_7': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. I also will be voting in favor of this as well. But I part of the reason why I really enjoyed the message that you've delivered is something that I said in a in a previous conversation tonight.'",
        "'speaker_4': 'And that's you know, I'm very I'm a firm advocate of the 20 minute neighborhood. And and as Mr. Anderson had said, also a District ten resident, he had said that, you know, locating all the things you need to survive and thrive within walking distance or rolling distance, as the case may be, is is critical for us to'",
        "'speaker_4': 'get out of cars. And to President Clarke's point, getting out of cars is good for physical health. It's good for community, but it's also good for the planet, too. So so I commend you for your for your attention to it attention and intention to give us a place where we can have community.'",
        "'speaker_4': 'Apparently. Speaking of community, last thing I'll say is apparently you have a dearth of cornhole locations. So that was the as well. Geez, if there's if there's no cornhole and this will solve that, then I'm happy to support.'",
        "'speaker_4': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. All right, so no other comments. I will just say thank you all for coming tonight, sticking with us late into the evening to be a part of this conversation. Thank you, Tracy, for the presentation and for walking us through all of this.'",
        "'speaker_0': 'Thank you to the development team for all of your hard work, all of the meetings with community and with our colleagues up here to get to this point. I remember when we were debating the zoning on this site, I felt very, very strongly that night that the entitlements that were on the property, if left, how it was'",
        "'speaker_0': 'zoned versus what we were contemplating as a rezoning, that we would get a much better project and much better outcomes for the community. Under the proposal for rezoning. And I feel the same tonight that we will get much better outcomes and I won't go into the details of all of that because it's been covered and it's been'",
        "'speaker_0': 'talked about. But this will be much better for the community and for our city if we approve this than if we don't. And so I'll be happy to support it this evening. Madam Secretary, roll call.'",
        "'speaker_2': 'Black eye to the Barca. I. Flynn.'",
        "'speaker_3': 'I.'",
        "'speaker_2': 'Gilmore. I. Herndon. I. Hines. I. PASHMAN. Yup. Kenny Ortega. I. Sandoval. I swear. I. Torres.'",
        "'speaker_0': 'Mr. President, I am secretary. Please cause voting. Announce the results. 1339 as Council Bill 1245 has passed. We're not quite done yet. We have that companion bill that we delayed earlier. Councilman Herndon, will you please put council bill 1246 on the floor?'",
        "'speaker_8': 'Yes, Mr. President, I move that council bill 19 dash one, two, four, six be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. Are there any comments on this one or can we just get to the vote? Looks like we can just vote. Madam Secretary, roll call.'",
        "'speaker_2': 'Black eye. CdeBaca Then I feel more. Herndon High. Hines I. Cashman I can reach. Ortega All right. Sandoval. I. Sawyer, I. Torres, I. Mr. President.'",
        "'speaker_0': 'I. Um. We're missing one. Did we miss somebody? Oh, all right. Madam Secretary, please close voting in those results.'",
        "'speaker_7': 'Oh.'",
        "'speaker_0': 'I think. No. Ortega, you didn't come through.'",
        "'speaker_7': 'I don't know what happened from.'",
        "'speaker_0': 'Where you and I.'",
        "'speaker_2': '39.'",
        "'speaker_0': '39, 39 As Council Bill 1246 has passed, seeing no other business before this body, this meeting is adjourned.'"
    ]
}