{
    "A proclamation celebrating Colorado Cities & Towns Week with the Colorado Municipal League and Recognizing Denver's dedicated employees.": [
        "'speaker_6': 'I would be happy to. Thank you, Mr. President. Proclamation number 14 0856 is celebrating Colorado Communities and Towns Week with the Colorado Municipal League recognizing Denver's dedicated employees. Whereas the Colorado Municipal League has declared October 20th through 26 the first ever Colorado Cities and Towns Week.'",
        "'speaker_6': 'Whereas many of you have seen the Colorado Municipal League's video on Channel eight Cities and Towns program highlighting how improvements in our communities happen. And. WHEREAS, Designation of this week is intended to showcase all that cities and towns and their elected leaders and employees do to ensure the well managed, safe, attractive and livable communities continue to thrive'",
        "'speaker_6': 'across Colorado. And. Whereas, the success of cities and towns ultimately comes down to the hard work of many employees, some of whom have devoted several years, if not their entire working life, to ensure that their neighbors, families and fellow citizens benefit from everything it takes from basic municipal services to emergency protection and sound fiscal practices.'",
        "'speaker_6': 'And. Whereas, Denver has a total of 13,610 employees, which includes 2385 uniformed police and fire employees. And. WHEREAS, so many of these Denver employees have extensive years of service that this proclamation cannot list them all by name. But council recognizes and thanks the more than 125 with 35 or more years of service, over 250 with 30 to'",
        "'speaker_6': '35 years of service, and over 550 with 25 to 30 years of service and almost 1100 with 20 to 25 years of service. So you can see why we didn't want to bring them all here tonight. Whereas City Council heartily thinks all city and county of Denver employees for their dedication, hard work and service to make Denver'",
        "'speaker_6': 'the great place to live, work and play that it is now therefore be proclaimed by the Council of the City and County of Denver that the Council hereby recognizes October 23, 26 as Colorado Cities and Towns Week. Thanks many employees who daily take care of so many basic needs of the city, from mowing the parks to being'",
        "'speaker_6': 'prepared to provide emergency services, to managing the financial transactions, and encourages Denver residents to thank each city employee. Section two that the Clerk of the City and County of Denver show attesting to fix the seal of the city and county of Denver to this proclamation and transmit copies to Mayor Michael Hancock and the Colorado Municipal League.'",
        "'speaker_4': 'Thank you, Councilman Ortega. Your motion to adopt.'",
        "'speaker_6': 'I move for the adoption of proclamation.'",
        "'speaker_4': '856 is in and has been moved in seconded comments from members of the Council. Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I want to thank my colleagues who signed on as co-sponsors of this proclamation. Many of you have attended from time to time some of the various events that the Colorado Municipal League sponsors. They do extensive training, especially for many of the newly elected local government leaders, to ensure that they understand their fiduciary responsibilities'",
        "'speaker_6': 'and understand a variety of things like zoning and land use, and they're just ongoing. We putting on different training programs that are extremely helpful and beneficial to elected officials, not only newly elected, but I know I've sat through some of the different discussions about fracking and what that means.'",
        "'speaker_6': 'That's a big topic for some of our neighboring communities, more so than it is for Denver. But just to have that knowledge and understanding is really important. How many of you have actually seen the Cities and Towns video that's done on Channel eight?'",
        "'speaker_6': 'You may want to see. That is very interesting because it helps the general public understand how their taxpayer their taxpayer dollars are utilized in delivering the the host of city services that local government provides to the citizenry. We have someone here that will address us in just a little bit.'",
        "'speaker_6': 'Many of you know Sam Elliott, who is the executive director of Cmll. And I just want to highlight in mention that one of the things that Cmll is working with us on is moving forward a proclamation that is going to the National League of Cities conference in November that will be working with many other cities to address'",
        "'speaker_6': 'the safe transport of hazardous materials on rail and and more specifically, a lot of the crude oil. I don't know if you saw the business Denver Business Journal article a couple of weeks ago that talked about the increase in the transport of crude oil because we have so much more domestic drilling that's happening in the United States'",
        "'speaker_6': '. And as a result of that, we have seen various incidents that have occurred in different cities. And so this is an important issue that Cmll has sort of taken taken a lead role in, along with some of our other counterparts in different cities, to move that forward and make sure that the rule changes that are moving through'",
        "'speaker_6': 'the Federal Railroad Administration understands that there's strong local community support to make sure those changes happen. So with that, I will just encourage the passage of this proclamation.'",
        "'speaker_4': 'Thank you. Councilwoman Ortega Council. Councilwoman Sussman.'",
        "'speaker_2': 'Thank you, Mr. President. I'm so happy to see Sam moment here. I think if you looked up and dictionary Colorado Municipal League, you ought to see the picture of Sam Mamet. He is the icon of this organization and I am going to be attending the next National League of Cities Convention, I guess, in a couple of weeks'",
        "'speaker_2': 'with and I'm very much looking forward to it and very much looking forward to the conversations about the sharing economy, which we're working on. And of course, many cities are throughout the United States. I look forward to sharing it with my other fellow city council people and look forward to a wonderful experience at the conference.'",
        "'speaker_2': 'Good to see you, Mr. Moment.'",
        "'speaker_4': 'Thank you, Councilwoman Sussman and Councilwoman Sheppard.'",
        "'speaker_2': 'Thank you. I would definitely like to certainly compliment Sameh and his leadership for the wonderful Colorado Municipal League and the wonderful resource that is for folks not only on this dais, but all around the state. But I actually want to say a few comments on the other part of this proclamation, and that is recognizing the 13,600 people'",
        "'speaker_2': 'that work for the city and county of Denver, so many of whom are unsung heroes and, you know, make the wheels of the city grind and probably don't receive thanks often enough. And I see a few of you in the audience there.'",
        "'speaker_2': 'So and then I'm hoping a few more are watching on television. So certainly on behalf of District one and Northwest Denver, I would like to thank all of you so much for the hard work and dedication that you do on a daily basis to make this city functioning and be well managed and to move forward.'",
        "'speaker_2': 'I know that, you know, often when we on this dais hear from elected officials, it's not often from people who are happy about something. It's usually from folks that, you know, have a concern or an issue and a complaint.'",
        "'speaker_2': 'And a lot of that gets directed at our city employees. So I don't want, you know, your I don't want you to go home at the end of the day thinking, you know, gosh, everyone's mad at me all the time and we're just not doing good enough.'",
        "'speaker_2': 'You guys are doing a great job. Thank you for all your hard work. Please relay these sentiments to your fellow coworkers when you get in the office tomorrow. Thank you so much.'",
        "'speaker_4': 'Thank you. Councilwoman Sheppard, Councilwoman Fox.'",
        "'speaker_7': 'Thank you, Mr. President. Certainly, our city employees are extremely important, and I thank each and every one of them for the work they do. I also want to comment on the other portion of this this proclamation, because it's always important, as you look past for the work that you've done in government, people that have been with you'",
        "'speaker_7': 'a long time have a special place in your heart. And there is nobody in this chambers that I have worked longer with than Sam Mamet. He was. Front and center voice always for cities and how he was for cities at the state legislature.'",
        "'speaker_7': 'And now it's great to run into him constantly here at the city level. It just seems as if it brings everything together. Sam, to have you here tonight. Thanks for being here.'",
        "'speaker_4': 'Thank you, Councilwoman Fides. Councilman, I take it that okay if I go down and guess what, Councilman Brown?'",
        "'speaker_8': 'Oh, thank you, Mr. President. Well, thank you, Councilwoman Fox, for your comments about our good, dear friend, Sam Mamet. There's no one here that loves city government more than Sam Mamet. And that is why two years ago at the annual meeting, I nominated him to run for my seat.'",
        "'speaker_8': 'And maybe you're going to make an announcement tonight and when you come to the podium. Thank you. Thank you.'",
        "'speaker_4': 'Thank you, Councilman Brown. Councilwoman Ortega.'",
        "'speaker_6': 'No pressure. So there were two things I failed to mention. You have a brochure on your desk and it has the simple pin on it. So provide you information on the various services that Cmll provides to local cities and towns.'",
        "'speaker_6': 'I also wanted to mention that one of our very own David Broadwell, came from the Colorado Municipal League, and we've been very blessed that he continues to be one of our key players that participates in the Policy Committee during the legislative session and helps us look at the various issues that Denver is weighing in on that are'",
        "'speaker_6': 'moving through the state legislative process. I serve on that on the CML board and have thoroughly enjoyed my interface with counterparts from different jurisdictions. But the work that is done by the incredible staff from Cmll is extremely beneficial to especially many of the cities that don't have their own city attorneys and the resources to ensure that they'",
        "'speaker_6': 'are taking a thorough look at so many of these issues that move through the legislature that could have a very direct impact on their communities. So I just want to say thank you to David for his work on behalf of the city directly with Cmll and to the very competent staff at Cmll and again to all of'",
        "'speaker_6': 'our city employees. We wanted to list all the names, but we would have been here all night just reading through them. So this is just our way of supporting this new cities and towns week recognition of city employees for all the work they do.'",
        "'speaker_6': 'And I just want to say just a big thank you to our employees as well.'",
        "'speaker_4': 'Thank you, Councilwoman. Any other comments from members of Council Team? None. Madam Secretary.'",
        "'speaker_5': 'Raquel Ortega, Rob Shepherd, Sussman Brooks. All right. I thought I can eat. I Laman Lopez. Monteiro, I Nevitt. Hi, Mr. President.'",
        "'speaker_4': 'Hi, Councilman Brown. Madam Secretary, please close the voting and not the results. 3939 836 has been adopted, Councilwoman Ortega. Is there anyone in the audience you'd like to bring up to receive the proclamation?'",
        "'speaker_6': 'I can't see him behind the podium. That's blocking my view of him. But we've got Sam there in the audience, who's the executive director of the Colorado Municipal League. Sam, would you like to come up and make a few comments?'",
        "'speaker_8': 'After Councilman Brown's comments. I'm not sure if I want to get drafted. It's one thing to say that at the CMO conference, it's another thing to say it on Channel eight. I have no interest in being grist for my own mill and.'",
        "'speaker_8': 'But I'm flattered. Anyway, good evening, honorable members of this council. I appreciate very much the resolution. The cities and towns week that the league is sponsoring coming up shortly. We've got over 30 cities and towns across the state that are very actively engaged in helping to promote this.'",
        "'speaker_8': 'And I certainly appreciate Denver's engagement. We're very lucky to have one of your colleagues, council member Ortega, on our board of directors, and we appreciate that very much. I do agree with Council member Sheppard on her comments about city employees.'",
        "'speaker_8': 'They are for all of us who serve in cities and towns across the state our greatest assets and at the risk of embarrassing one who I'd like to mention from Denver who will be very upset with me but I'm going to do it anyway, is your own Gretchen Williams, who of course, is retiring at the end of'",
        "'speaker_8': 'the year and I have valued her leadership. I think she represents a level of excellence in public service. Having served the council here for so many years on the staff and is just representative of the kinds of people that we all get a chance to interact with day in and day out.'",
        "'speaker_8': 'And I would be remiss if I did not acknowledge Gretchen's service on this occasion when we're talking about the great employees for our communities across the state. I appreciate your leadership. I've been traveling around the state the last two months or so with regional meetings and visiting with all kinds of cities and towns across the state.'",
        "'speaker_8': 'But it's just great to be here with my own city council and and to be with all of you and celebrate this week. So I want to thank you very much, Debbie, for doing this. And I want to thank you all for your support for this week and for the Municipal League.'",
        "'speaker_8': 'And just for the record, I am not a candidate for anything except going home so I can see my wife and have dinner with her. But I thank you very much, and it's a pleasure to be with you all.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_4': 'Thank you. And thank you, Councilwoman Ortega, for bringing that forward. We are on to the resolutions. Madam Secretary, could you please read the resolutions?'",
        "'speaker_5': 'Business Development 812 Resolution. Peru. The Mayor's Appointments. The West Colfax Business Improvement District from Safety and Well-Being 811 Resolution approving the Mayor's Appointment of the Denver Gay Lesbian Bisexual Transgender Commission.'"
    ]
}