{
    "Local Maintenance Districts Group 1\nTonight, Council was scheduled to sit as the quasi-judicial Board of Equalization to consider reduction of total cost assessments for Local Maintenance Districts.  However, since no written protests of assessment were filed with the Manager of Public Works by September 27, 2018, Council will not sit as the Board of Equalization for the following Local Maintenance Districts:\n\n15th Street Pedestrian Mall\n20th Street Pedestrian Mall\nConsolidated Larimer Street Pedestrian Mall\nSanta Fe Drive Pedestrian Mall C\nSt. Lukes Pedestrian Mall\nDelgany Street\nEast 13th Avenue Pedestrian Mall\nSouth Downing Street Pedestrian Mall\nTennyson Street II Pedestrian Mall\n44th Avenue & Eliot Street Pedestrian Mall\nWest 32nd Avenue Pedestrian Mall\nBroadway Pedestrian Mall A\nSouth Broadway Streetscape (Arizona to Iowa)\nSouth Broadway Streetscape (Wesley to Yale)\nSouth Broadway Streetscape (Iowa to Wesley)\nTennyson Streetscape (Portions of 38th to 44th)": [
        "'speaker_2': 'Thank you, Councilman Flynn. I don't see anybody else in line for announcements. Just double checking. All right. Moving right along. There are no presentations. There is one communication tonight. Tonight, council is scheduled to sit as the quasi judicial board of Equalization to consider reduction of total cost assessments for local maintenance districts.'",
        "'speaker_2': 'However, since no written protests of assessment were filed with the manager of public works by September 27th, 2018, Council will not sit as the Board of Equalization for the following local maintenance districts. 15th Street Pedestrian Mall. 20th Street Pedestrian Mall.'",
        "'speaker_2': 'Consolidated Larimer Street Pedestrian Mall. Santa Fe Drive Pedestrian Mall C St Luke's Pedestrian Mall Del Gainey Street East 13th Avenue Pedestrian Mall South Downing Street Pedestrian Mall Tennyson Street to pedestrian mall 44th Avenue an Elliott Street Pedestrian Mall West 32nd Avenue Pedestrian mall Broadway Pedestrian Mall A South Broadway streetscape Arizona to Iowa South Broadway Broadway Streetscape West'",
        "'speaker_2': 'Little South Broadway Streetscape, Iowa to Wesley Tennyson streetscape portions of 38 to 40 fourth. And we have no proclamations this evening. So resolutions. Madam Secretary, will you please read the resolution titles?'"
    ],
    "A resolution approving and providing for the execution of a proposed Grant Agreement between the City and County of Denver and the United States of America Department of Housing and Urban Development concerning the Housing Opportunities for People with AIDS (HOPWA) FY18 program and the funding therefor. Approves a performance grant agreement with the United States Department of Housing and Urban Development (HUD) for the 2018 allocation of $2,017,134 through the Housing Opportunities for People with AIDS (HOPWA) program to provide housing and supportive services designed to prevent homelessness for persons with Acquired Immunodeficiency Syndrome (AIDS) or related diseases, citywide (201844785). The last regularly scheduled Council meeting within the 30-day review period is on 11-5-18. The Committee approved filing this item at its meeting on 10-3-18.": [
        "'speaker_2': 'So, Madam Secretary, could you put 1086 Council Resolution 1086 on our screens? And Councilman Ortega, that's one that you would call out for an abstention. Anything you want to add to that?'",
        "'speaker_5': 'No, I'm on the board of a nonprofit that receives helpful funds, and it's consistent with how I have voted on this particular allocation of funding that we receive.'",
        "'speaker_2': 'And I'm sorry, Councilman Herby, abstain. Okay. Councilman Herndon, can you put Council Resolution 1086.'",
        "'speaker_4': 'On the floor? Business president, I move that council resolution 1086 be adopted.'",
        "'speaker_2': 'It has been moved and seconded. Councilman Flynn. Do I see you up on this one for comment?'",
        "'speaker_3': 'You see it there, Mr. President, but it's there because it didn't go away from the council announcements.'",
        "'speaker_2': 'Okay. So you're all good on this one. All right. Seeing no other questions or comments on this one. Madam Secretary, roll call.'",
        "'speaker_1': 'Black eye Brooks.'",
        "'speaker_3': 'I had.'",
        "'speaker_1': 'Espinosa when.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Gilmore i Herndon. I Cashman. I can teach i.'",
        "'speaker_4': 'Lopez I.'",
        "'speaker_1': 'Knew.'",
        "'speaker_5': 'Ortega Abstain.'",
        "'speaker_1': 'Sussman, i. Mr. President.'",
        "'speaker_2': 'I. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_1': '11 eyes, one abstention.'"
    ],
    "A bill for an ordinance to amend Article IV of Chapter 27 (Housing) of the Revised Municipal Code relating to affordable housing.  Amends Article IV, Chapter 27 of the Denver Revised Municipal Code relating to affordable housing to allow for the execution of a performance deed of trust for settlements of disputed matters and to allow the recapture of lost affordability terms. The Committee approved filing this item at its meeting on 9-12-18.": [
        "'speaker_2': '11 eyes, one abstention. Council before council resolution 1086 has been adopted. And now, Madam Secretary, if you could put the next item, a council bill 975 on our screens. And Councilman Herndon, if you can put a motion to delay consideration of 975 until after the public hearing tonight, the courtesy public hearing tonight on 1089 is due.'",
        "'speaker_4': 'I first need to order it published and then there needs to be a second motion to delay.'",
        "'speaker_2': 'The word I got was that we needed a move to delay consideration, but we need to put it on the floor first.'",
        "'speaker_1': 'I think I think you do your vote on that, but then you'll go ahead and.'",
        "'speaker_2': 'All right. So go ahead and put it on the floor.'",
        "'speaker_4': 'Yes, Mr. President, I would move that council bill 975 be ordered published.'",
        "'speaker_2': 'Right. It has been moved and seconded. And now do we need Councilman Espinosa then to make a motion to postpone? Correct. All right, Councilman Espinosa, I want to make a motion to postpone consideration of this until after the public hearing.'",
        "'speaker_7': 'Yes. President, I moved to postpone this till after the public hearing of.'",
        "'speaker_4': '86.'",
        "'speaker_2': 'Has been moved and seconded. Any comments or questions by members of council on this? I'm guessing, Councilman Flynn, that that's still just you hanging around on there.'",
        "'speaker_3': 'Correct. And not that I'm trying to. It just won't go away.'",
        "'speaker_2': 'Madam Secretary, roll call.'",
        "'speaker_1': 'Black Eye. Brooks.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Espinosa.'",
        "'speaker_7': 'I.'",
        "'speaker_1': 'Flynn.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Gilmore, I.'",
        "'speaker_4': 'Herndon, I.'",
        "'speaker_1': 'Cashman. I can reach Lopez.'",
        "'speaker_4': 'All right.'",
        "'speaker_1': 'Knew Ortega. I Susman. Mr. President.'",
        "'speaker_2': 'I. Madam Secretary, please close voting. Announced the results. 3913 Eyes Council Bill 975 will be postponed for consideration until after the courtesy public hearing tonight on 1089. I believe that concludes the items to be called out this evening.'",
        "'speaker_2': 'All other bills for introduction are ordered published except for Council Bill 8-0189 which council will vote on after the conclusion of the one hour courtesy public hearings scheduled later this evening, we are now ready for the black vote on resolutions and bills on final consideration.'",
        "'speaker_2': 'Council members remember that this is a consent or block vote and you will need to vote I. Otherwise, this is your last chance to call out an item for a separate vote. Councilman Herndon, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_4': 'Yes, Mr. President, I move that the resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in the block for the following items. All serious 2018 unless noted 1076, 1068, 1049, 1067, 1069, 1085, 1087.'",
        "'speaker_2': 'All right. It has been moved and seconded. Madam Secretary, roll call.'",
        "'speaker_1': 'Black eye Brooks.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Espinosa. Hi, Flynn, I Gilmore I Herndon, I Cashman I can canete.'",
        "'speaker_4': 'Lopez Hi.'",
        "'speaker_1': 'New Ortega I Susman. All right, Mr. President.'",
        "'speaker_2': 'I Madam Secretary, please close voting and announce results. 1313 I As the resolutions have been adopted and the bills have been placed upon final consideration and do pass tonight, there will be a one hour courtesy public hearing on Council Bill 1089, amending Title 27 of the Revised Municipal Code of the City and County of Denver to revise'"
    ],
    "AS AMENDED a bill for an ordinance amending Title 27 of the Revised Municipal Code of the City and County of Denver to revise definitions and procedures set forth therein for greater clarity and to extend the minimum affordability period for properties that receive city subsidies from twenty years to sixty years. Amends Section 27 of the Denver Revised Municipal Code (DRMC) to approve revisions to the Affordable Housing Preservation ordinance including definitions and procedures intended to clarify applicability to income-restricted properties within the city and extension of the minimum period of affordability from 20 years to 60 years. The Committee approved filing this item at its meeting on 10-3-18. Amended 10-15-18 to delay the effective date of the affordability period to 2-1-19.": [
        "'speaker_2': 'Council has reconvened. Apologies for the extended recess. We do have one courtesy public hearing this evening. Speakers should begin their remarks by telling the council their names and cities of residents and if they feel comfortable doing so, their home addresses.'",
        "'speaker_2': 'If you are here to answer questions only when your name is called, please come to the podium, state your name and note that you are available for questions of council. Speakers will have 3 minutes and there is no yielding of time on the presentation monitor.'",
        "'speaker_2': 'On the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_2': 'Councilman Herndon, will you please put Council Bill 1089 on the floor?'",
        "'speaker_7': 'Yes, Mr. President. I move that council.'",
        "'speaker_4': 'Bill 1089 be ordered published.'",
        "'speaker_2': 'It has been moved and seconded. Are we? Sir, I'm just checking. Are we doing the amendment now? Okay, so we are going to do the amendment now. I almost had the gavel down there. Councilwoman, can you have an amendment to make before the public hearing so that members of the public can make comments on the amendment as'",
        "'speaker_2': 'well? Would you like to make that amendment now?'",
        "'speaker_6': 'Yes. Thank you, Mr. President. I move to amend Council Bill 18, Dash 1089, as follows On page seven, line 18, insert the following. The amendment to section 27 Dash 50 regarding minimum affordability periods shall be effective with regard to projects receiving a city subsidy pursuant to a contract dated on or after February 1st, 2019.'",
        "'speaker_2': 'And we have a motion and a second on the amendment, and now we're going to do the public hearing. So that explanation. Go ahead with your comment. Yes.'",
        "'speaker_6': 'Thank you, Mr. President. The purpose of this amendment is to extend the period by which the. So right now our current law is that the minimum affordability period is 20 years. The bill before us has many components in it, including tweaks to the preservation aspects.'",
        "'speaker_6': 'All of those would go into effect upon passage of the bill were passed. But the piece that would change the minimum affordability to 20 years to 60 years would be delayed until February 1st of 2019. There are two reasons for this.'",
        "'speaker_6': 'One is because I believe there has been a very sincere desire from members in our affordable housing development community to engage in a closer dialog with the Office of Economic Development about the implementation, details of the how, and I think they legitimately want to have a seat at the table before the rules and regulations are finalized, and'",
        "'speaker_6': 'this allows time to do that. The second reason is because I know my colleagues were planning to introduce a motion to delay the adoption or debate of this bill until February of 2019. And my concern with delaying the entire bill is that we have several tax credit applications that are due in January 1st.'",
        "'speaker_6': 'Developers have to have their letter of intent into the Colorado Housing and Finance Authority about what projects they want to submit. And then they actually have to submit the actual application by February 1st. If what we do is we don't decide where we are on this length of affordability, we will have an entire round of tax credit'",
        "'speaker_6': 'of players living in limbo, not knowing where we're headed. I believe that my amendment is intended to be a sincere compromise with my colleagues and with the community members that there does allow time before the law goes into effect and it ensures they have a seat at the table.'",
        "'speaker_6': 'But it creates certainty for those folks, especially who are applying for tax credits in January and February. So I apologize to my my colleagues for the the last minute amendment, but I felt like it was a compromise to the motion to delay.'",
        "'speaker_6': 'And so this is how legislative process works sometimes. And I look forward to hearing feedback from the community during the hearing. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you very much, Councilwoman. Okay, so we have the bill and then the amendment on the floor for our courtesy, public hearing and members of the public can feel free to speak to either. We will not take action on them until after we've heard from the public since the amendment has been moved and seconded.'",
        "'speaker_2': 'The one hour courtesy public hearing for Council Bill 1089 is open. May we have the staff report?'",
        "'speaker_9': 'Absolutely. Laura brzezinski, Office of Economic Development in her housing division. I am going to just give a brief overview of the information that was provided to the Safety Committee two weeks ago regarding Council Bill 1089. As Councilwoman Kenny mentioned, there are two components of what's being proposed with this bill.'",
        "'speaker_9': 'There are some intended clarifications to some of the definitions as well as the notice periods for the implementation of the preservation ordinance. We have had three years of time passed since we introduced the right of first refusal to the ordinance in 2015.'",
        "'speaker_9': 'And we've realized through the implementation process that we need some more clarity in terms of the definitions used within the ordinance, as well as certain definitions that are omitted from the ordinance and need to be added. We also have some clarity that's needed for the notice periods for federally as well as locally supported resource preservation projects.'",
        "'speaker_9': 'These are just clarifications to the ordinance language, not introducing new policy solutions or policy concepts into the ordinance. The component of the changes. The second component of the changes is the proposed change to the minimum affordability period. So why are we discussing extending this minimum affordability period?'",
        "'speaker_9': 'We conducted a lot of outreach as part of the development of our five year housing plan, housing and Inclusive Denver and heard from community members and stakeholders that our our plan and our implementation processes should focus on longer term affordability periods across all of our investments, and that we should pursue housing that is affordable in perpetuity.'",
        "'speaker_9': 'And those are a couple of the direct comments that we received from community or stakeholder members during the process. Why are we talking about it? We believe that long term affordability of rental housing can prevent the conversion of our multifamily resident residential rental developments to market rate housing, which can help to stabilize low and moderate income households'",
        "'speaker_9': 'and or prevent homelessness. When when a property is converted to market rate, it's at risk of displacing the residents that currently live there. Right now, the ordinance requires that our projects come with a minimum period of 20 years.'",
        "'speaker_9': 'However, we do administratively sometimes apply longer restrictions at 30 or 40 years, but that ordinance does state that 20 years right now. So in terms of our process, we analyzed our current portfolio of affordable units across all of the redistricting agencies.'",
        "'speaker_9': 'We have about 20,000 affordable units in our entire portfolio. Not all of those are funded exclusively by the city of Denver. We also have U.S. Department of Housing and Urban Development, the Division of Housing at the state level, and then the Colorado Housing and Finance Authority that apply other types of restrictions to properties as part of Denver's'",
        "'speaker_9': 'portfolio. The average term of the restriction is about 29 years across our entire portfolio with these different restricting agencies. We also conducted research on other high cost peer cities as part of this process to determine what are some of the best practices in terms of minimum affordability periods.'",
        "'speaker_9': 'We found anywhere from 50 to perpetual affordability in some of our peer cities. If folks have questions about that, I'm happy to answer them. We hope to also conduct a large group as well as stakeholder outreach, including outreach to nonprofit, as well as for profit developers of affordable housing finance experts, including tax credit investors, as well as'",
        "'speaker_9': 'private lenders. We had several meetings with our housing advisory committee and subcommittees between May and September of this year, and we also have a group of experts convening locally around anti displacement solutions and policy recommendations. That's part of a cohort of different cities nationally looking at policies that focus on anti displacement.'",
        "'speaker_9': 'So our our recommendation based on public and stakeholder feedback is to use long term to long term affordability as a tool to stabilize residents at risk of displacement and to promote inclusive communities. We are recommending an increase from the minimum affordability period from 20 years to 60 years in the ordinance as part of our focused outreach with'",
        "'speaker_9': 'those different stakeholder representatives. We did hear some feedback on that, has informed some of these recommendations and our considerations for implementation. We do believe, based on our outreach, that the income increase minimum affordability period should not impact developer developers ability to access low income housing, tax, credit equity or private debt.'",
        "'speaker_9': 'We have talked to other communities, even here in Colorado, that have longer term affordability periods than what Denver currently has at 20 years. Boulder is an example. They have perpetual affordability on their projects right now. There's also a willingness to match the city and the state affordability, length and loan terms.'",
        "'speaker_9': 'We've had a lot of conversations with the state division of Housing as part of this, and we have gotten some feedback regarding opportunities for implementation considerations. There's been questions around the funding for rehabilitation over time, as well as some of our underwriting criteria, which we think there's opportunities through a rules and regulations process to more clearly define'",
        "'speaker_9': 'as well as specific covenant terms. Some questions around the length of affordability and the potential for the mix of affordability within an individual project. So for example, if a unit is restricted at 30% of the area median income because there is also a project based voucher that is being leveraged for that unit, if that project based voucher'",
        "'speaker_9': 'goes away in 20 years. But we have affordability restrictions at 60 years. Is there an opportunity to amend the commitment to accommodate that change in the the project's capital stack? That's the kind of thing we've heard some feedback on and are looking to have further discussion around the rules and regulations related to this piece.'",
        "'speaker_9': 'So we are recommending approval of Council Bill 18. 1089 tonight.'",
        "'speaker_2': 'Thank you very much. We do have nine individuals signed up to speak this evening. I'm going to call the first five if you could make your way up to the frontbench so that we can move through everyone as quickly as possible.'",
        "'speaker_2': 'And I do apologize if I mispronounce your name. As soon as I call your name, then please step up to the podium. There will be a slight delay to let you get there from that front bench and then your time will start.'",
        "'speaker_2': 'So the first five I have are Jennie Santos, Andrew Romero, Andrea Barela, Jonathan Capelli and Marvin Kelley. If you could come up to the front and Jennie Santos, you are up.'",
        "'speaker_1': 'When that's not just. Good evening. My name is Jennie Santos. I'm actually a resident of Globeville. And the reason I'm here, I'm in here in support of this ordinance as Servicios de la Raza, as a victim advocate, I provide support to victims and survivors of domestic violence, sexual assault, human trafficking in general, victims of crime.'",
        "'speaker_1': 'However, our agency also has a reentry program that helps individuals that are, in the end, incarceration system reentry back into our community. We also have our mental health program that aids individuals, individuals and family, what their mental needs.'",
        "'speaker_1': 'And we also have our client a program that provides support to victims, that provide support to individuals that are diagnosed with HIV and providing education around that with case management. We service a very vulnerable community. Our community is needing the support and increasing the years of affordability from 20 years to 60 years.'",
        "'speaker_1': 'Why? Our children, our mothers, our fathers are needed to have that mental stability of knowing that if they're currently finding a housing unit right now we're in a market where it's hard enough to find a unit that's affordable.'",
        "'speaker_1': 'But when individuals are able to find a unit that does have that affordability to have not only 20 years but the extension of 60 years, because service a lot of families. And in the city and county of Denver, we're dealing with the housing crisis.'",
        "'speaker_1': 'It's very important that we're able to have these units for a long term, even after you and I are gone from here. As far as the roles that we play and hopefully we've moved on knowing that we've created this change in disabilities, this the ability for the city and county of Denver's residents.'",
        "'speaker_1': 'Thank you. Please vote in favor of this because our communities need the support. Thank you.'",
        "'speaker_2': 'Thank you. Next up, Andrew Romero.'",
        "'speaker_7': 'That's part of the problem.'",
        "'speaker_10': 'Hi, my name is Andrew Romero and I'm a resident of Denver and Jefferson Park and I am a member of the board of All in Denver here representing that organization. We certainly support longer term affordability, city dollars and other resources such as state funds.'",
        "'speaker_10': 'Federal tax credits should not be spent on short term affordable fixes for long term problems. 20 years is not a very long term time period for one of these affordable housing projects. When people are generationally poor sometimes, however, if there is going to be a longer term affordability restriction 60 or more years than when those projects have'",
        "'speaker_10': 'to be refinanced or re syndicated for low tech, low income housing tax credits, typically every 15 years or so, there has to be a recognition that those projects have to be continually reinvested in affordable housing developments, especially the family projects and those that are older to begin with need to be substantially re halved periodically.'",
        "'speaker_10': 'Capital markets for debt and tax credit equity will not accept the minimal amount of rehab at refinanced time Project Rehab, but just have to demonstrate that the new loan will outlast the major systems in the project. So typically capital markets want to see new roofs updated electrical kitchens, baths, carpets, heating, cooling systems.'",
        "'speaker_10': 'These costs are typically well above $40,000 per unit in these projects. So we often see projects coming in for refinancing with only $25,000 per unit in rehab. That means that they're skipping some major systems that could fail during the life of the financing again, only every 15 years or so, which puts the project and the owner at'",
        "'speaker_10': 'significant risk of default. So while longer affordability makes a lot of sense to keep units in the affordable housing stock, those projects have to be maintained throughout the life of the restriction and we're talking six years. So all in Denver encourages the city and its other partners to look at new and additional sources of funding to make'",
        "'speaker_10': 'sure that the low income residents in long term affordable projects are not being forced to live in substandard conditions due to a lack of funding as projects cycle through their financing periods. And we don't want to see burdens on owners and financial partners as well.'",
        "'speaker_10': 'So perhaps it makes sense to explore both sides of this equation, the restriction versus the resource further before passing this resolution. Thank you.'",
        "'speaker_2': 'Thank you. Next up, Andrea broke.'",
        "'speaker_1': 'Good evening. My name's Andrea Barela. I'm the president and CEO of New Said Community Development Corporation and treasurer of in D.C. Neighborhood Development Collaborative. We are one of the oldest kdka's in Colorado this year. At 45 years, we owned several affordable housing developments in Denver and endeavor to build more in the future.'",
        "'speaker_1': 'Like our colleagues in this field, we are mission driven and want to see the proliferation and sustainability of affordable housing, both rental and for sale for low and moderate income households. In the Denver metro area, a segment of the population that is being slowly displaced.'",
        "'speaker_1': 'We work daily to and we work daily serving that ideology. In order to make affordable housing projects work for the long term, there must be flexibility that accommodates fluctuations in the ever changing economy. This is why news that supports a 40 year affordable affordability restriction.'",
        "'speaker_1': 'There have been no plans of funding commitments made by the city, state or chapter to accommodate a 60 year affordability restriction. And this is very troubling, to say the least. What is clear to us, as well as various members of NBC, is that a vote at this time would be extremely premature.'",
        "'speaker_1': 'And we strongly support a four month delay to allow for a more strategic and informed policy approach. You know, just to speak also to what Andrew was was was saying, we echo all of those comments. You know, we currently have a couple of properties in the market right now that are you know, we've only erected very recently'",
        "'speaker_1': 'and already they are seeing just a myriad of issues. And, you know, these kinds of restrictions would really hinder our ability to to, you know, do do the kinds of improvements that that we need in them. So, you know, we are all about affordability in the long term affordability, but it has to be done the right way'",
        "'speaker_1': '. And I know that there's been a lot of looking at other cities and how they do that, but there is also strong funding commitments in those other cities that the Denver hasn't demonstrated yet. And we we need to see that demonstrated.'",
        "'speaker_1': 'We need to see something other than just pushing forward an ordinance that we don't know how that's going to affect us in the long run. So we hope we can take a step back and and really look at this.'",
        "'speaker_1': 'So we we we support an extension on this.'",
        "'speaker_2': 'Thank you very much. Next up, Jonathan Capelli.'",
        "'speaker_4': 'Thank you, everyone. So, I'm John Kelly. Live at 3421, Bruce Randolph. I'm the director of the Neighborhood Development Collaborative. And before you all, you should have a copy of a letter that we sent very late. Sorry about that.'",
        "'speaker_4': 'Detailing exposition space. I just want it so there's no time to read the letter. But I wanted to ask if you could formally.'",
        "'speaker_5': 'You pull your microphone up a little closer.'",
        "'speaker_4': 'Oh, I'm sorry. I better don't ask if you guys could formally enter that letter into the record for the hearing. All right, great. So first, we want to say that ABC strongly supports the city's goal of extending the affordability ordinance.'",
        "'speaker_4': 'We can't allow the current problems of losing affordable units to due to short term covenants continue into the future. When it comes to the extension of the preservation ordinance, the question is not if to extend it, but how.'",
        "'speaker_4': 'But as it's currently written, many developers have serious concerns about how to make it work. It's true that other pure cities have a longer preservation ordinance than we do, but is also true, as evidenced in the city's own research, that these cities have different funding mechanisms and regulation language than we do.'",
        "'speaker_4': 'And that of all of our peer cities, Denver has the lowest municipal contribution per unit. Seattle, for instance, funds units at up to five times the rate that we do, but has only only has a 50 year affordability covered in other cities such as Boulder and Boston that have less than Seattle, more than Denver, less than Seattle'",
        "'speaker_4': ', but have it in perpetuity. So the point is that the devil sort of in the details for how you implement this, and that's what we're concerned about. So we're asking for postponement of this vote until a group of developers, nonprofit housing providers, advocates and tax credit attorneys can get together and craft what funding and regulatory changes we'",
        "'speaker_4': 'need in order to actually support this. Why do we not simply wait until the second reading? Because we want as much time as possible to give this substantive feedback. Why? If the question is not if, but how to implement this, we don't simply turn our attention to rules and regulations.'",
        "'speaker_4': 'The reason is because we think that the ordinance could potentially even be even even longer. The number of NDC members, some of which implement even longer affordability covenants, you know, up to 199 years, still agree that we need to have this delay in order to figure out the details.'",
        "'speaker_4': 'The cart shouldn't become come before the horse on this. So so once again, our request is to postpone it until February 15th, 2018. And we ask for this given the coming holidays, the absence of a number of OED leaders under the three month FEMA Family Medical Leave Act.'",
        "'speaker_4': 'And so we're seeking this four month delay so that everyone can be at the table and work on this together. I'm hearing Councilman, can you she's concerned about tax applications, you know, perhaps delaying until December makes sense. But in any case, we still feel like that the ordinance should be delayed and the rules and regulations worked out'",
        "'speaker_4': 'first. As a final note, it might seem counterintuitive and I don't even have time to say about I say, all right.'",
        "'speaker_2': 'Thank you very much. Next up is Marvin Kelley. And if the last four speakers who signed up tonight to speak could come to that front bench Tiana Patterson, Jean Markkanen, Jessie Parris and David Roybal, if you could come to the front row, that would be appreciated.'",
        "'speaker_2': 'Go ahead.'",
        "'speaker_3': 'My name is Marvin Kelley. I live at 139 South Clarkson Street in Councilman Clark's district. And I'm also the executive director of Del Norte Development Corporation. We've worked in the Highland neighborhood and West Colfax neighborhoods since 1979, developing housing affordable to very low income and moderate income families.'",
        "'speaker_3': 'And so, as a matter of fact, I developed the very first tax credit property in the United States working with Jim Ross of the Enterprise Foundation. And that property was developed in 1986 when the tax credit legislation was passed.'",
        "'speaker_3': 'That property is still under our ownership. It is still affordable. We still has all those families who are primarily earning less than 30% of the Denver median income. I've shared my concern with this legislation with the Office of Economic Development Staff, and I've worked with the staff in trying to fashion some changes to this that would make'",
        "'speaker_3': 'it more palatable to us. But tonight, we're asking for a four month delay in the adoption of the legislation as another note. We've worked with this, the chap of 40 year affordability. Ever since that has passed and that's something we live with and something we have to live with.'",
        "'speaker_3': 'So there's no necessarily. Need to go to 60 years, in my opinion now. If we can work out the tools that to make that work, then as far as I'm concerned, I'm fine with that. But to date, I haven't seen the tools that time that will help us make that work.'",
        "'speaker_3': 'This year, we attempted to syndicate 80 units of affordable housing located in Highland, placing an additional 30 years of affordability on those properties. The properties primarily housed persons whose income does not exceed 30% AMI families, persons living with other disabilities, historic properties and persons living with HIV AIDS.'",
        "'speaker_3': 'We developed the very first property in Denver to house homeless persons living with HIV AIDS. We ran into a very, very big problem in trying to re syndicate these properties with the rent restrictions that were in place. They impacted the appraisals to the extent that our basis on which the tax credits are based and therefore the investor'",
        "'speaker_3': 'payments made re syndication impossible. We are keeping the properties affordable primarily through HUD's RAD program, and so that's working very well with us. And those properties will remain affordable for another 30 years.'",
        "'speaker_2': 'I'm sorry, but you're out of time. Thank you very much. Next up.'",
        "'speaker_3': 'We're asking for a delay in their letters.'",
        "'speaker_2': 'Next up, T.A. Patterson.'",
        "'speaker_1': 'Good evening. My name is Tianna Patterson. I am the state and local policy director for Enterprise Community Partners. 110 16th Street in Denver is operated pretty simply. Enterprise supports the extension of long term affordability from 20 years to 60 years.'",
        "'speaker_1': 'And we also are here to express our support for the proposed amendment and for the continued engagement with our nonprofit and for profit development partners. As this process moves forward. Thank you.'",
        "'speaker_2': 'Thank you very much. Next up, Kate Markkanen.'",
        "'speaker_7': 'Grimly. My name is Kate McKinnon. Kate, a second for short. I work for the Northeast Denver Housing Center. I'm the executive director.'",
        "'speaker_5': 'Northeast has been.'",
        "'speaker_4': 'Around for about 36 years.'",
        "'speaker_7': 'We do both wholesale and rental housing. So I speak to you with.'",
        "'speaker_4': 'A little bit of experience.'",
        "'speaker_7': 'Having.'",
        "'speaker_5': 'Lived.'",
        "'speaker_7': 'Properties that have been.'",
        "'speaker_5': 'Financed.'",
        "'speaker_7': '20, 25.'",
        "'speaker_5': '30 years ago. And when markets change, when community.'",
        "'speaker_7': 'Change, when financing.'",
        "'speaker_5': 'Changes, what we thought 20 and 30 years ago are not the same today. Similarly today, when we talk about an ordinance that's going to be.'",
        "'speaker_7': 'With us for 60 years.'",
        "'speaker_5': 'I think we need.'",
        "'speaker_7': 'To stop and pose and make sure we have the.'",
        "'speaker_5': 'Toolsets and the thought out answers to what.'",
        "'speaker_7': 'We could.'",
        "'speaker_5': 'Anticipate happening in 60 years. At the end of the day, this Council is interested.'",
        "'speaker_7': 'About how well we house low to moderate income families what you do here and make sure that your.'",
        "'speaker_5': 'Office of Economic Development has.'",
        "'speaker_7': 'Set the right.'",
        "'speaker_5': 'Tools such.'",
        "'speaker_7': 'To evaluate.'",
        "'speaker_5': 'Progress as we go.'",
        "'speaker_7': 'Will make sure that units will not be less than what you would want your children to live in. What we had experienced in the first 20, 30.'",
        "'speaker_4': 'Years was because.'",
        "'speaker_7': 'Of the restrictive nature.'",
        "'speaker_5': 'Of early.'",
        "'speaker_7': 'Housing programs, we could not.'",
        "'speaker_5': 'Get enough income.'",
        "'speaker_4': 'To capitalize and.'",
        "'speaker_7': 'Improve the housing stocks that we had. Where similarly, today, unless we do this program right, pose and query and challenge our friends at OED to do a little bit more research.'",
        "'speaker_5': 'Than telephone calls.'",
        "'speaker_7': 'To survey cities throughout the city, let's look at the fundamentals of.'",
        "'speaker_5': 'Neighborhoods from one.'",
        "'speaker_7': 'Area to the other are different. Today, you're looking at roughly about 60 to 65 units that are going to come into restriction in the next five years. While we're supposed to you.'",
        "'speaker_5': 'That most.'",
        "'speaker_7': 'Of these units are in the.'",
        "'speaker_5': 'Inner city, older.'",
        "'speaker_7': 'Housing stock. What are you going to do to those housing stocks? There's going to be different that the new units that we built in Stapleton, what we may build today in downtown, the collaboration that is needed in terms of the flexibility going to need for the owner developer.'",
        "'speaker_5': 'Down the.'",
        "'speaker_4': 'Line.'",
        "'speaker_5': 'When markets have changed, what neighborhood needs have changed?'",
        "'speaker_7': 'If you have told him you got to be a 30%.'",
        "'speaker_5': 'EMI, that's not.'",
        "'speaker_7': 'Going to work 30 or 40 years ago. So you need to build the flexibility into the program that anticipates.'",
        "'speaker_5': 'Change.'",
        "'speaker_7': 'And is friendly to the residents and to the owner. Because it's a partnership. The city can't do it by itself. Nonprofits can't do by itself. We need the private, the profit and the industry working together as a partner.'",
        "'speaker_7': 'This ordinance today kind of lacks a little bit in terms of.'",
        "'speaker_5': 'Working and making.'",
        "'speaker_2': 'I'm sorry. I'm sorry, but your time is up. Thank you very much. Next up, Jesse Paris.'",
        "'speaker_11': 'Good afternoon. Members of council. My name is Jesse Paris. I'm speaking on behalf of Black Star Action Movement for Self-defense. Denver Homicide Out Loud. A Community Action Commitment for change. No hidden agendas. Members of this Council, this ordinance amending Title 27 of the revised fiscal code of the City County of Denver to revise definitions and procedures for'",
        "'speaker_11': 'greater clarity and to extend the minimum affordability period for properties to receive city subsidies from 20 to 60 years has been a long time coming. I guess the housing project experiment is over and now you want to address the needs of the poor and downtrodden in the city.'",
        "'speaker_11': 'I have several questions. My questions. My first question is will there be a set Ahmar level written into this bill or will be up to the property owners to decide? Also, what is with the property owners going to be room 40 extension to 80 to 100 years worth.'",
        "'speaker_11': 'The city continue to allow developers to pay the linkage fee to opt out of accepting subsidies from the city for affordable housing. So in closing, positive action commitment for change is in favor of this ordinance. We would love to see more affordable measures for the housing and increasingly rising rental market, causing displacement and communities of color black'",
        "'speaker_11': ', brown and indigenous. No delay. We have a housing crisis. I would ask council to approve this immediately. The poor, homeless and downtrodden in the city have no time to delay or wait. Thank you.'",
        "'speaker_2': 'Thank you. And last up, David Roybal.'",
        "'speaker_4': 'David Roybal, 742 West Ninth Avenue represent West Denver United. Candidate for District three represent positive action. Commitment for change. No hidden agendas. We already got a sanctuary city. We need an affordable city. This should be front lines is Latino.'",
        "'speaker_4': 'This city will be affordable. Is this going to protect the black and brown communities that has been moved since the seventies, 1970 Horario was a thriving community in town, and now it's gone. The history has been erased. North Lincoln in the past ten, 15 years has changed so much.'",
        "'speaker_4': 'Many people getting relocated out. So we hope the people that made the city can move back and 60 years can be three generations, four generations. And we just hope that the gentrification across Colfax will stop. And we ought to have a plan that when it comes to properties, we want organizations like Donor Day.'",
        "'speaker_4': 'And we we need a lobbying for affordable housing. We don't need the lobbyists and those and the lobbying is the community members that addressing the need that are most affected. How would this plan, you know, in the Sun Valley's due process?'",
        "'speaker_4': 'Well, this keeps Sun Valley affordable. They want we want to do something by the stadium. And you guys are leading the way. And I hope that other cities can learn. And there's been a lot of a lot of housing ordinances passed.'",
        "'speaker_4': 'And it's a big plan. And I just hope that it's done right and it's done the right way. And it keeps the people here and let us know that that we want to be here for the rest of our life and have generations to have our kids thrived and want to be in fear that we can't afford'",
        "'speaker_4': 'it. So we just hope that that this is good for everybody and let other cities know that that that it works and that you guys can get it done. Thank you.'",
        "'speaker_2': 'Thank you. That concludes our speakers. Are there any questions from members of council? Councilwoman Sussman.'",
        "'speaker_1': 'Thank you very much. I have a question of Councilor McKinney or or Laura, if that's appropriate. The amendment that you're making is not about the fact that they are. This is for affordable housing that the city subsidizes. It's just an amendment to change the date at which it takes effect.'",
        "'speaker_1': 'It's not. Is it related at all to. Because it applies only to projects that that receive city subsidies. Right. Right.'",
        "'speaker_6': 'The section that's referenced is intended to only delay the effective date for the number of years. So, yes, it is about the number of years, but it doesn't change it. So it would still go to 60, but only for projects that enter into contracts after February 1st.'",
        "'speaker_6': 'I see. So it was intended to get at this idea that it allows time for the rules and regulations to be written so that they can go into effect at the same time with all the stakeholder input.'",
        "'speaker_1': 'Okay. And I'm wondering, Laura, do we have an idea of of the inventory of our affordable housing? How what is the percentage that received subsidies from the city that would be affected by this rule? What's the percentage of our or our whole inventory?'",
        "'speaker_1': 'Do you have that? And if you do, I'd be all be amazed.'",
        "'speaker_7': 'Of course. Because if it's not affected, it's a VHA problem. Permanent.'",
        "'speaker_1': 'I'm Britta Fisher. I'm the chief housing officer. And I think I have approximate numbers for you. There's about 20,000 income restricted units in the city and county of Denver, and over 5000 of those are funded by the city of Denver.'",
        "'speaker_1': 'Okay. Thank you. Thank you. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman Sussman. Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. I have a couple of questions as well. So the first one is who on the staff would be working with the nonprofits? I mean, I'm assuming there's a commitment to sit down, roll up your sleeves, and make sure that in looking at whatever kind of rules will be put into place to ensure that'",
        "'speaker_5': 'the staff at the housing arm have the right systems, the right policies and practices in place that will ensure. You know. So, first of all, it's the input with the neighborhood, but then with the nonprofits and then how how all of that will come together.'",
        "'speaker_5': 'Who are the staff people that will be doing that?'",
        "'speaker_9': 'Sure. So this has been really a collaborative effort between our policy and program team, as well as our development staff. As for how the research has been conducted to date and the outreach process, so I expect that to continue.'",
        "'speaker_9': 'I will be one of the staff members out on Family Medical Leave for a portion of the next couple of months. So I expect our staff members on the policy team as well as the development team.'",
        "'speaker_5': 'Who are they specifically?'",
        "'speaker_9': 'Sure. So Doug Selby leads our development team. Hailey Jordan, who is on his team as well as Megan Yankey are also supporting this project and Melissa Tardy from the policy team will be supporting as well. That will be in consultation and working closely with the city attorney's office as well.'",
        "'speaker_5': 'Okay. And how quickly would you envision that that that those conversations would begin? And I know that the nonprofits have been to a number of meetings, but didn't the level of details that they're asking for are not contained within this ordinance?'",
        "'speaker_5': 'And, you know, normally that's done through your rulemaking process. And I mean, this is no different than when this body wanted to make sure that we had a housing plan before we move forward with, you know, just giving carte blanche authority to the administration to decide what projects were getting funded.'",
        "'speaker_5': 'I mean, I see this no different than that. So I just wanted to make sure I knew who the staff people would be involved with that. The other question I wanted to ask is specific to I think to some degree, Councilwoman Sussman got at the amount of the 5000, how many of those are actually properties that are'",
        "'speaker_5': 'owned by the nonprofits? And these are over the next five years, correct, that the obligation period would expire. And so how many of those 5000 are owned by nonprofits?'",
        "'speaker_9': 'So we have I think the the answer to the question regarding how many total units were funded by the city is of our portfolio, but not all of those have restrictions that expire over the next five years. We have in total across all funding levels are all funding sources.'",
        "'speaker_9': 'The city included about 2000 units that have restrictions that are at risk of expiring over the next five years. I say at risk because sometimes we are working on extending affordability through rehabilitation or a recent addition of a tax credit project.'",
        "'speaker_9': 'But about 63% of those that have restrictions that are at risk of expiring over the next five years are owned by nonprofits.'",
        "'speaker_5': 'Okay. So when when we look at the fact that the city has put money into for profit development to ensure that we have affordable units within those developments, how are those units being treated differently from the ones that are owned by non-profits?'",
        "'speaker_9': 'So we really focus on what the outcome is that we're purchasing with our city subsidies. So we are buying affordability as part of our investment into a particular project. And the partner by which we achieve that outcome is part of what we're looking at in terms of a project.'",
        "'speaker_9': 'But it's really what what we achieve in terms of the outcome that we're looking at, not who the partner is relative to to picking specific funding, but.'",
        "'speaker_5': 'What is the maximum that we've been able to extract from all of the non. All of the for profits that we have put city money into. I want to make sure I understand the price of the affordability. Is it 20 years?'",
        "'speaker_5': 'Is it 30 years on? On the ones that we have been funding and those that are in the pipeline.'",
        "'speaker_9': 'So is the question the difference between the non-profits and the for profits in terms of affordability? I can certainly follow up with that information. I don't have that immediately available. But across our portfolio, 29 is the average length of affordability.'",
        "'speaker_9': 'And right now, our term sheets have the same affordability length, whether you're a for profit or a nonprofit developer. Okay. But I can certainly follow up on the difference in our portfolio between nonprofit and.'",
        "'speaker_5': 'The 20,000 includes directive funded units and that that includes some that are out at Stapleton. We've got trying to think of our other funding sources.'",
        "'speaker_9': 'The Denver Housing and Housing Finance Authority might place a similar division structure. Yep, exactly.'",
        "'speaker_5': 'So. So they have different affordability periods than what Denver does. And in the communication you sent to us, it was just the Division of Housing who had indicated. But they're not doing that right now in terms of extending to a 60 year timeframe.'",
        "'speaker_5': 'Correct.'",
        "'speaker_9': 'They do not currently have a policy of a 60 year timeframe across all of their investments, but they have indicated that if the city was to go to 60 years, they would match that term.'",
        "'speaker_5': 'And they would do that statewide or just.'",
        "'speaker_9': 'For Denver, the projects.'",
        "'speaker_5': 'Just for Denver. Okay. Do you want to add some?'",
        "'speaker_1': 'I just want to clarify that point a little bit. One of my other hats is sitting on the state housing board. So for the Fisher chief housing officer. Right now, the city of Denver in general matches the local length of affordability.'",
        "'speaker_1': 'The state of Colorado matches that level of affordability, except the city of Denver, which has a lesser affordability period than their minimum, which is 30 years. So their minimum affordability period is 30 years, but they'll match whatever the local jurisdiction has.'",
        "'speaker_1': 'So like for Boulder, that's perpetuity.'",
        "'speaker_5': 'But does that mean then because part of the challenge here is a structure normally needs investment before the end of a 60 year obligation period. And having said on the board of a nonprofit, I know that you can't allow them to fall into a state of deterioration without having to invest some money to keep the property attractive'",
        "'speaker_5': 'in the neighborhood. So you don't have neighbors complaining, but also to ensure that, excuse me, your residents are living in habitable conditions. So by extending out the affordability period, what what is the cities? And again, I think this is where having the dialog with the nonprofits is important.'",
        "'speaker_5': 'But what is the city's commitment to ensuring that there is city money that will be available for the improvements that need to happen during that time frame that the obligation period has been extended out?'",
        "'speaker_1': 'Yeah, if I may answer that as well, I, I know that I cannot commit future councils to levels of funding, but I think the recent actions of this Council to remove the sunset on the dedicated affordable housing fund provide a strong indication of future funding, and in asking our development team for any examples of rehab projects that'",
        "'speaker_1': 'had been denied in the last ten years. I wasn't given any. So we have a strong commitment to preserving. That's what this ordinance is about, and I hope we can continue that. But I cannot forward commit on behalf of the city.'",
        "'speaker_5': 'So just one last question, Mr. President. And this is about how how we ensure that even though we have city money into for profit projects, that at the end of that obligation timeframe on the handful of units that are in for profit projects that have a majority of market rate units, how we expect we the city expect'",
        "'speaker_5': 'that those owners will commit to extending out long term affordability of those units.'",
        "'speaker_9': 'So I want to make sure I know understanding how do we ensure that for profit owners, I will extend affordability restrictions that are set to expire in the next five years. Sure. So we engage in a process of conducting outreach to all of the properties that have restrictions that expire over the next five years.'",
        "'speaker_9': 'And we are talking with them about options to rehabilitate their property, whether they're for profit or nonprofit, and also making them aware of the requirements of the preservation ordinance. So this preservation ordinance that we're discussing, although we're talking about one piece of it, does give the city a right of first refusal when any income restricted property is'",
        "'speaker_9': 'sold. That's only while the restriction is still active. I know that was something that we discussed a little bit in committee. But we are conducting outreach to all of the owners that have properties that expire over the next five years, including for profit and nonprofit, to let them know about the availability of our financing.'",
        "'speaker_9': 'I think there was a question or a comment earlier about the city's term sheets. We do right now offer rehabilitation, financing up to $50,000 per unit. Sometimes that's leveraged with tax credits, sometimes it's levered leveraged without tax credits.'",
        "'speaker_9': 'But that is the current available funding for our projects. We have, I think, six or seven projects in the pipeline representing about 500 units that are in some stage of financing for rehabilitation at our existing properties.'",
        "'speaker_5': 'So how how realistic is it, though, that we will exercise the first right of refusal on a project that has, say, 30 affordable units, but there's 400 units in the development to try to secure the long term affordability at the end of that commitment period.'",
        "'speaker_9': 'We would certainly be looking at the price tag of the opportunity to exercise the right of first refusal. But a lot of our projects that are owned by for profit developers are not necessarily just a small portion of units in an otherwise market rate development.'",
        "'speaker_9': 'They might also be tax credit projects where the entire property is affordable. So so the number of projects where we have just a few affordable units within an otherwise market rate development is actually a pretty small proportion of our portfolio.'",
        "'speaker_5': 'Well, I'm just thinking about many of the projects that have come before us where we've been asked to approve the financing that's going into these projects. And we have seen a lot of them that are for profit developments, that have smaller number of units in a very large development.'",
        "'speaker_5': 'And I don't see the city using money to go buy an entire market rate project in downtown, a lot of them on Welton Street. I mean, they're all over the city now because those are going to be way too expensive.'",
        "'speaker_5': 'So so I guess part of my concern is that the majority of the entities that this ordinance is going to apply to is going to be our non-profits. So anyway, I'll stop at that. Mr. President, thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilman Espinosa.'",
        "'speaker_7': 'So three questions, actually, and Laura might want to stick around. How many of the units, the 20,000 units that you mentioned include the DHEA units? And how many units are DHEA?'",
        "'speaker_9': 'Sure. DHEA represents about 5000 of the affordable units in the city's portfolio of 20,000. Okay.'",
        "'speaker_7': 'And none of those would have met. All those are in perpetuity, correct?'",
        "'speaker_9': 'I can double check the answer to that question. I'm not sure that 100% of them have covenants that require perpetual affordability, but certainly any unit that is developed under the agreement that was approved by council earlier this summer will be subject to a covenant that requires affordability in perpetuity.'",
        "'speaker_9': 'But I can follow up with our staff on the answers specifically to the current portfolio.'",
        "'speaker_7': 'I'm glad you mentioned that. So we just committed basically $100 million in bond table money to DHEA for those perpetual units, which is going to take a significant portion of our permanent affordable housing fund over the next few years, is it not?'",
        "'speaker_9': 'So we in the effort to double the affordable housing fund earlier this summer, we went from two sources, up to four sources, up to $30 million. And the partnership with the Denver Housing Authority utilized the existing property tax, which is about seven and a half to 8 million of that $30 million for the next 20 years.'",
        "'speaker_7': 'Which is the more which is the bond portion. Right. Because our per the amount of money that we assessed developers through linkage fee is not vulnerable or is it?'",
        "'speaker_9': 'The property tax represents a stable source that the determination was that it was an appropriate source to repay if if bonds were issued and the other sources are a little bit more volatile.'",
        "'speaker_7': 'Yeah. So that's what that's what I'm getting at is our only actual sort of reliable source of income is actually now obligated to an affordable housing provider that that is already not subject to this 30 slash 60 year term because they're already obligated through their missions and their purpose to deliver permanent and perpetual affordability.'",
        "'speaker_9': 'And they're also obligated because of that agreement to deliver perpetual affordability. So any unit developed by DHS or through a partner on land that DOJ acquired under that agreement would be subject to a covenant in perpetuity.'",
        "'speaker_7': 'So all of those DHEA properties that we're going to do with the $100 million are not as flexible as the properties that we do with developer agreements or through our nonprofits today, because they're locked in forever.'",
        "'speaker_9': 'The six years is less than that. Perpetual affordability and the development agreement, if that.'",
        "'speaker_7': 'But that is double any of the things that we do today and triple what the actual had mandated.'",
        "'speaker_9': 'For the six years. Yeah.'",
        "'speaker_7': 'So I mean, quadruple sorry, it was a 15 year affordability term when it came out. So the question for Britta is that I just wanted to to hear that again about the you know, you had asked about the denial of funding in the last ten years.'",
        "'speaker_7': 'Can you clarify that for me? Because that is not my understanding. So what was said to you and by whom?'",
        "'speaker_1': 'What my understanding was or was that I asked for any example of a rehab project that had been denied funding and I was not given any that had. And Doug Selby can answer that more specifically if there's any qualifiers on that.'",
        "'speaker_7': 'Yeah, I appreciate John maybe giving any qualifiers on that because it sure makes us look like we don't deny projects funding. But I, I know prior to ten years ago of a specific project that was denied funding, but I'd love to hear Doug's.'",
        "'speaker_12': 'I'm Doug Selby on the housing development manager for OED. Sorry Councilman. My memory only goes back ten years when I started employment. That's okay.'",
        "'speaker_7': 'That's the only time frame we're talking about. So in the last in.'",
        "'speaker_12': 'My in my tenure here, for any project that's applied for us for rehab funding that came in and qualified and hit our priorities and also had the other financing lined up all of the underwriting criteria that any governmental entity would do.'",
        "'speaker_12': 'We have not denied that funding.'",
        "'speaker_7': 'Okay. Those are the important qualifiers, right? Because there's a lot of criteria that we a lot of checkboxes we asked to be checked. And sometimes that can sort of keep evolving as our priorities adjust. Similarly, you know, where we have a project that might hit a lot of our criteria, but not all of them, and therefore it'",
        "'speaker_7': 'resulted in a lack of funding because you hold the keys of all the criteria. Do not.'",
        "'speaker_12': 'The city holds the keys of all the criteria which is given to us by the Housing Advisory Committee.'",
        "'speaker_7': 'Those are not interior years. What's that? Not in the last ten years. That's only the last three years.'",
        "'speaker_12': 'Correct. In the last three years, our priorities have been the same towards the affordability levels that we have targeted for. Prior to the last few years, we had just federal funds and so those were limited at affordability levels.'",
        "'speaker_7': 'Also, the reason why I'm even bringing that up is myself, my colleagues and myself have been working a lot to try and eliminate some of the subjectivity that has been involved with OPD and the funding of affordable funding, because priorities seem to shift in administration to administration or year after year.'",
        "'speaker_7': 'And that's understandable because that's basically recognizing that market shift, conditions shift and basically all the things that Gate was mentioning that things are different on the ground year in and year out, decade to decade. And so it is difficult.'",
        "'speaker_7': 'Can you tell me what the market's going to look like in 60 years from now?'",
        "'speaker_12': 'No, Councilman, I can.'",
        "'speaker_7': 'Yeah. Can anybody? Laura. Britta. No. Okay. So thank you. Sorry. Then the last question, and it's really a group question and I don't know if it's Andrea, Andrew, Gay, Marvin, you know, Jonathan, somebody can you in a fourth grade at a fourth grade level for me explain to you address how how this how a delay in either'",
        "'speaker_7': 'implementation or or adoption of this bill impacts pending app mean current applications applications that are have already been submitted. I should I should mention this. When you go for latex funding, there's no guarantee that you're going to get it.'",
        "'speaker_7': 'There's it's known that you go after round after round sometimes trying to get your funding. So there might be applications that are coming in for their second or third, whatever iteration. If we change the rules, what happens? So thanks.'",
        "'speaker_3': 'Councilman. I'm not aware that anything will change. What probably will change is allura the land use restriction that Shaffir places on the project. Could change from 40 years to 60 years. That's the only thing in my opinion and in my experience that will change.'",
        "'speaker_3': 'The performance won't change, the tax implications won't change. It'll look like a typo. Others may have other opinions about that.'",
        "'speaker_7': 'And so is that what you're saying becomes an issue? Long term sustainability of the project is if all you're doing is changing the land use restriction, the rest of the portfolio perform becomes challenging over time.'",
        "'speaker_3': 'Or I understand the question to be. That you need to act on this tonight because folks, folks won't be able to submit an application in February. I don't see that. I'm sorry. Because I see. Is that when the when the deal closes, the Laura may look differently.'",
        "'speaker_3': 'Okay. The numbers will not change. Or if they do change, they could change at any time due to any of the investors reasons. For instance, I've had them change at midnight or close to midnight on December 31st. Nobody wants that.'",
        "'speaker_3': 'That's no fun, but nothing else will change. There are no tax implications to this.'",
        "'speaker_7': 'So I apologize. When I was in the affordable housing business, I was on the design side. Fortunately, we had some really confident and capable people on the financing side in the in the capital stack side and whatnot. Is there a question I should be asking you all that I'm not that.'",
        "'speaker_3': 'What's the hurry?'",
        "'speaker_7': 'What is the hurry? Thank you.'",
        "'speaker_3': 'Let's get it right. If we're going to do it, let's get it right.'",
        "'speaker_7': 'Okay. That is a good question. To to to our staff, which is for 32 years, we have been operating under the current rules and current periods. What is happened because I have been talking for three and a half years from this dais about the need for a longer term affordability.'",
        "'speaker_7': 'Many of my colleagues have been asking for the longer term affordability. Yet I did not know until you guys presented to me that anybody at the city had been having this discussion and then less than two months later were on the floor committee.'",
        "'speaker_7': 'And we're here trying to ramrod this through where people that I highly respect in this field and worked with for five years delivering affordable housing have legitimate what I believe legitimate concerns. And when our comparison are jurisdictions that have a multi-year, multi-decade, more robust track record of funding affordable housing to deeper levels.'",
        "'speaker_7': 'We've already made a $100 million commitment to that 0 to 30% AMI in very low income households. I have a my own proposal for for the missing middle that has sort of been pooh poohed by the administration, because somehow our portfolio addresses that concern, which I would argue if you go around and you ask the community, are'",
        "'speaker_7': 'affordable housing needs at 50, 60, 70 and 80% AMI is being met? The answer is going to be a resounding no. So my concerns, you know, why are why does it have to be this round of high tech funding when it wasn't last year's around a little bit funny and in the year before this round of high'",
        "'speaker_7': 'tech funding. Why can't this be a discussion for 2020? Why does it have to be 2019?'",
        "'speaker_1': 'So I'll at.'",
        "'speaker_9': 'Least address the process. So our draft of the five year housing plan, which was released at the end of last year, did include a recommendation to explore the possibility of increasing the minimum affordability period. That plan was approved by council with that language in February of this year.'",
        "'speaker_9': 'We did also include the exploration of the minimum affordable exploration and raising of the minimum affordability in our 2019 Annual Action or 2018 Annual Action Plan excuse me, that was approved for implementation by our Housing Advisory Committee in April of this year.'",
        "'speaker_9': 'So it's been something we've been working to start researching and start engaging in conversations about really for several months this year. We had a stakeholder kick off process in May of this year where we had nonprofit for profit finance experts come together to help share some of our initial research on other peer studies, as well as get'",
        "'speaker_9': 'initial feedback on some of their considerations or thoughts for us as we explored this. And then we really spent the majority of this summer time at the housing advisory committees and subcommittees talking through the potential considerations as part of this.'",
        "'speaker_9': 'So we believe that the proposal to increase from 20 to 6 years has been thoroughly vetted through our stakeholder community and through our housing advisory committee. And it is typical for us to set policy here at the council level in ordinance and then to engage in a rulemaking process as a supplemental implementation conversation of that policy.'",
        "'speaker_9': 'So that's a typical process for us and for other agencies, and we're certainly committed to moving forward with the rulemaking process over the course of the next couple of months.'",
        "'speaker_7': 'I'm trying to figure out how to turn this in the form of a question. Here it is. I've had many developers come to me with this notion that they have met several times with the community, and therefore, just by virtue of the fact that they met several times, they have crossed some sort of threshold.'",
        "'speaker_7': 'That means that this council should accept what they're proposing because of the sheer volume of meetings. How do I know that the the the the the output that we see today is, is one that is well conceived, considered and and thoroughly, you know, extrapolate, you know, considered, considered over time that we know it will work.'",
        "'speaker_7': 'Because I haven't seen how it plays out. I've seen a lot of comparisons on how it compares to others, but I don't. And then some allusion to to the funds that we the commitments that we've made. But we just talked about who's got the locked in funds versus who's got the discretion is sort of more volatile funds'",
        "'speaker_7': ', as you termed. So how do I know that this isn't just us grabbing on to that notion that this is. Well, we all champion this idea of extended terms and we're just moving forward the standard terms versus a well, well considered measure.'",
        "'speaker_7': 'And just telling me that you met several times since April and May does not tell me that. It just tells me that you had a lot of meetings over a long period of time. So is there anything that you can can provide me for that?'",
        "'speaker_9': 'I think that, you know, we have we have had a lot of those conversations. We've been having follow up conversations with specific experts based on what was shared with us at those stakeholder processes and with the Housing Advisory Committee.'",
        "'speaker_9': 'We do not take our having our housing advisory committee take a formal position on it. But Councilwoman Kenney, just part of that advisory committee, you may be willing to speak to the conversation that has been happening there over the course of the last couple of months.'",
        "'speaker_9': 'And really, what I would say is a robust dialog about this as part of that process. So you do have the benefit of someone here who has participated in that process. But we do believe that we have vetted the concerns that were raised as part of those conversations.'",
        "'speaker_7': 'I would expect her comments probably will address that. But there is a history that I am concerned about with respect to having a sole member leading that continuum for this body.'",
        "'speaker_4': 'Councilman.'",
        "'speaker_2': 'Do you have any more questions or comments in in a little bit. I just want to make sure we're still moving along with questions.'",
        "'speaker_7': 'That's good.'",
        "'speaker_2': 'Thank you. Councilman. Thank you, Mr. President. Laura, I'm just going back through the material that you presented very nicely at the safety committee. And and I didn't see any information about the the issue that is being discussed here tonight about the repair and reconditioning costs and and what tools were available in other cities when you survey the'",
        "'speaker_2': 'cities. Did you or did you ever find out what those other cities were providing, what tools they were providing to help with the financing? If we go out to 60 years and they are faced with additional pressure for repairs, planning funds to repair and reconditioned affordable housing.'",
        "'speaker_4': 'Units.'",
        "'speaker_9': 'We did find from our Pier City analysis that the other cities that have longer affordability periods do typically reinvest into projects after their initial or initial funding of the project. We did not find from our peer city research that those cities have a dedicated amount set for the particular project, but they do offer rehabilitation financing, just like'",
        "'speaker_9': 'we do to projects that are in need of it at any time during their affordability period.'",
        "'speaker_2': 'Did they address it in their preservation ordinance? The disrepair and conditioning financing? Is it addressed in any way? We just didn't address.'",
        "'speaker_9': 'Whether or not this the availability of rehabilitation financing is addressed specifically in their ordinances. I can follow up with our team that did the research on that.'",
        "'speaker_2': 'Because I didn't hear as much objection to the 60 years as I heard about where we would be able to finance the repairs. And we don't want these units to become slums and and in such poor repair that it would be embarrassing to have people live there.'",
        "'speaker_2': 'So I think I think that's a very legitimate issue. And so so I think it'd be very appropriate for us to look at making sure we not only have six years of housing stock, but also 60 years of quality, quality housing stock.'",
        "'speaker_2': 'So, yeah. So maybe, maybe a little more time may be necessary, especially if it's not going to mess up anything with life with the funding for the state. So the test price that. Here is is that I?'",
        "'speaker_9': 'So I can certainly look into what language might be present in some of those other in those other cities. But I believe that it would be appropriately addressed if if we were to address what kind of funding might be available at an implementation level, which is typically more rules and regulations.'",
        "'speaker_2': 'I just think a lot of the developers and, you know, need predictability about, you know, what's going to happen in the future. So at least will give some kind of assurance there will be funding to help. And we sure do want to make sure we have all that quality housing stock available.'",
        "'speaker_2': 'So short now. Last question on the 20,000 units we've got. You said, you know, the DHS got, what, 5000 and we got the nonprofits with 5000. So the other half of 10,000 units is being managed by for profit organizations.'",
        "'speaker_9': 'The 63% was of the properties owned. And with respect to those that have restrictions over the next five years, I can follow up with the information of of the entire portfolio. What proportion is owned by nonprofit?'",
        "'speaker_2': 'Okay. Because I was thinking I was thinking DHS had a very large percentage of the from the committee meetings. And I guess the committee we talked about that. I thought, I don't know why 75% stuck in my arrangement, but that they had 75% of the stock.'",
        "'speaker_9': 'About 25%.'",
        "'speaker_2': 'By.'",
        "'speaker_9': '2030. Yeah, about 5000 of our 20,000 units. Okay.'",
        "'speaker_2': 'Thank you very much. Thank you, Mr. President. Thank you, Councilman. New Councilman Brooks.'",
        "'speaker_4': 'Yeah, I was actually going to talk about that. The Laura, this is a question for you. And I'm just I'm it's a comment and asking you to respond.'",
        "'speaker_7': 'Question form but or to answer it I believe it's 5500 DHS actual units and 6800 vouchers. So I guess my question is, where are those vouchers? You know, what units are they using?'",
        "'speaker_9': 'Do you mean project based vouchers or tenant based vouchers?'",
        "'speaker_7': 'Well, the report that I got it just said six, 800 vouchers. So they must be. I wonder if they're both.'",
        "'speaker_9': 'Okay. We can certainly follow up with more detailed information about what there may be that some of those units overlap with the DHS units and some of them overlap with the other units that are not. And if they are project based vouchers, typically a tenant based voucher is taken to a market rate unit and would be in'",
        "'speaker_9': 'addition to the 20 20,000 income restricted units.'",
        "'speaker_4': 'Okay. So that 20 so okay. Yeah, we should get some more information on that. Okay. Can can you tell me and just a more a much more specific question about our units that are vulnerable.'",
        "'speaker_7': 'From four expiring this year for, let me.'",
        "'speaker_4': 'Say, 2019.'",
        "'speaker_7': 'Do we have that number?'",
        "'speaker_9': 'I have here the breakdown of the next five years, but I don't have it year by year. So that's something that I can.'",
        "'speaker_4': 'Okay. And what was the number?'",
        "'speaker_9': 'It's about 2000 units that have restrictions that are at risk of expiring over the next five years.'",
        "'speaker_4': 'You also.'",
        "'speaker_7': 'You also said.'",
        "'speaker_4': 'That Councilwoman Sussman was talking about and I've actually said this in the.'",
        "'speaker_7': 'Bill, that it's only projects receiving.'",
        "'speaker_4': 'City subsidy. But also since our new policy is around land use and incentives.'",
        "'speaker_7': 'Those projects as well would be receiving the extension and affordability. Correct.'",
        "'speaker_9': 'So right now, the when projects do build alternative plan under the linkage fee ordinance or under the height incentive overlay at 38th and Blake and do not receive city subsidies, the linkage fee rules and regulations are applicable. The linkage fee rules and regulations when drafted were drafted such to meet the preservation ordinance minimum requirements.'",
        "'speaker_9': 'So right now the rules say 20 years, but if approved by council to increase the minimum affordability for city projects to 60 years, we would looking at an administrative process to update those rules and regulations to require the same amount of years for other projects under the build alternative.'",
        "'speaker_7': 'How quickly would those be implemented?'",
        "'speaker_4': 'The reason I ask is, as you know, there's there's.'",
        "'speaker_7': 'About 100 or so units being built right now and in the five points area around that. And so we want to make sure that they have that 60 year affordability.'",
        "'speaker_1': 'Sure.'",
        "'speaker_9': 'We've been discussing some possible updates to those rules and regulations for a couple of months, and we'll probably continue over the next couple of months. We have been engaging as part of that in an overall conversation around another approach at the Central Valley area.'",
        "'speaker_9': 'So we've been waiting to move forward with some proposed regulations to the linkage fee ordinance to try and tie those processes a little bit more closely together if there's anything necessary for the implementation of the central. Valley and area district if adopted.'",
        "'speaker_9': 'So that's part of why there's been a little bit of a delay on those. I expect we can move forward over the next couple of months.'",
        "'speaker_4': 'Okay. Last question.'",
        "'speaker_7': 'I know you were studying other cities.'",
        "'speaker_4': 'And.'",
        "'speaker_7': 'Can you tell me the two cities that were and I.'",
        "'speaker_4': 'Know we had it in and I couldn't find it in the in the slide. But the two cities that mirror us that.'",
        "'speaker_7': 'You're looking at for 60 years and if there was any conversation with a distinction between for profit nonprofit developers.'",
        "'speaker_9': 'Let's see. Just pulling back my. So it looks like Seattle has 50 years. And then we have Portland at 99 and Boston and Boulder at perpetuity. So the closest there is Seattle. But we do have a couple of examples of cities that are out longer than 60 years.'",
        "'speaker_7': 'And was there any conversation with how they dealt with the nonprofit to nonprofit, you know, rehab.'",
        "'speaker_4': 'Program and all those issues?'",
        "'speaker_9': 'I can certainly follow up with the staff that conducted the research directly to see if there was a nuance between whether or not the for profit and nonprofit developers had different affordability periods.'",
        "'speaker_7': 'But not that you know of tonight. No. Okay.'",
        "'speaker_2': 'Thank you. Councilman Brooks. Councilwoman Black.'",
        "'speaker_1': 'Thank you, especially Laura and Britta, because you both look really uncomfortable and tired. I have a question if if this does pass and I'm going to put a hypothetical situation so I'm imagining my district, there's a. Six or seven story building let's say this passes a developer built that that building across the street from that building that'",
        "'speaker_1': 'actually does exist now. There's a giant piece of property that's for sale. Let's say this building was built after this pass and then all of a sudden they realize they can acquire this property across the street if they can sell this one and they can build three times more units.'",
        "'speaker_1': 'Could they do that if this passed?'",
        "'speaker_9': 'I think it would require an amendment to the covenant. In that scenario, and Julia may have a more robust answer for Councilwoman Black, but it would require an amendment to the covenant on the original building to encapsulate the second property if there was to be a transfer of the units from one property to the other.'",
        "'speaker_9': 'But would you have anything else to that?'",
        "'speaker_1': 'So if I understand.'",
        "'speaker_6': 'The question you're asking, if they could essentially replace the units on one site with units from the other site, they would have to come back to the city. And as Laura.'",
        "'speaker_1': 'Indicated, we would have to do an amendment, a release, partial release of one covenant and replace it with another covenant. So it would be a process that we would have to go to go through what would have to go through the council or it would just go through already.'",
        "'speaker_1': 'I think it would depend. You have.'",
        "'speaker_12': 'If we were making a substantial amendment to an existing contract that was over 500,000, it would have to come in front of city council.'",
        "'speaker_1': 'Okay. Thank you. That's all I had.'",
        "'speaker_2': 'Thank you. Councilwoman Black. Councilwoman Cannick.'",
        "'speaker_1': 'Thank you, Mr. President.'",
        "'speaker_6': 'So I wanted to my colleagues have asked great questions. I was going to do some cleanup, but I see there's some others. Maybe I'll wait. I'm going to wait. Actually, I'm going to defer. Mr. President, if that's okay, I just want to let my colleagues ask questions and then clean up where I think there's some gaps.'",
        "'speaker_2': 'Do you want to go to the back of the queue? Okay. Kezman fun.'",
        "'speaker_3': 'Thank you, Mr. President. Councilwoman Sussman and Councilman Espinosa. Actually, I just asked several of my questions, but I do have a little bit of clarity that I need provided maybe Marvin Kelly can I can ask you to clarify for me, by extending the the affordability period into 60 years, you were saying that there's no impact on pro'",
        "'speaker_3': 'formas for projects. I'm trying to understand how when a project is geared on 20 or 40 years, how extending that retroactively to 60 years doesn't have an impact on the bottom line. Maybe explain that for me. It does not have an impact on the pro forma as it is submitted to the Cholera Housing Finance Authority.'",
        "'speaker_3': 'The only thing that would impact the action tonight would be, as I said, the Laura and maybe Andrew can help me with that if he's if he's still here. Okay.'",
        "'speaker_4': 'Good me, I think I was, but I just.'",
        "'speaker_2': 'If you could wait until you're up at the microphone before.'",
        "'speaker_10': 'What was the question?'",
        "'speaker_3': 'How does the extension of a project out of the affordability period of six years from 20 or 40? How does that not impact the bottom line of a project? But Marvin was saying, no, it doesn't affect the the Lura.'",
        "'speaker_10': 'Right. Well, from a finance perspective, you know, from a lender and investor perspective, any of these projects for that first 15 years, it maybe doesn't affect it. But if you have a 60 year Lura land use restriction agreement every 15 years, you're going to have to go back and try to refinance that project really, because that's that's'",
        "'speaker_10': 'just the economics of it and what makes sense. And so when you're doing that, you're going to have to do that three times over the period of six years, rather than in order for you to have adequate financing to renovate the project in a way that is attractive to the capital markets, you have to have more than'",
        "'speaker_10': '$40,000 a unit in there. And what I'm seeing and I've seen about five projects in the Denver metro region in the last year, all of them had less than 40,000 as unit rehab and they're just weren't able to be sold in the market adequately.'",
        "'speaker_10': 'You're only going to get a couple of interested buyers and your prices are going to be depressed. There's not enough competition. So I think that's the big issue here, is there's not enough rehab coming in to these projects that are older, you know, and as you go forward, you're going to just get older and older buildings.'",
        "'speaker_10': 'And if you're not putting enough money into them over the years, you're starting to have pretty depressed projects.'",
        "'speaker_3': 'But that won't impact step to the microphone. That won't impact the capacity of any developer or nonprofit developer to submit an application to. SHAFER Right. The the action tonight. Okay. Thank you. That's all.'",
        "'speaker_2': 'Thank you. Councilman Flynn, I'm going to go to Councilwoman Gilmore because I don't think she's been up yet. Councilwoman Zimmer. Oh.'",
        "'speaker_1': 'Thank you, Mr. President. I think this question might be for you, Doug. Since we were asking questions about rehabbing the units, I, I want to understand what the maybe the financial modeling that you all did to look at right now, if I'm understanding right, there were 6 to 7 projects in any one year in the pipeline around'",
        "'speaker_1': 'rehab. What's the conversation been if we're.'",
        "'speaker_5': 'Going to now extend the affordability.'",
        "'speaker_1': 'To 60 years, what that gap.'",
        "'speaker_4': 'In.'",
        "'speaker_1': 'Funding might be to appropriately rehab units?'",
        "'speaker_12': 'The conversation has more been about our accessibility to funding for rehab in the units, whether a project is restricted for 20 years, 40 years or 60 years. As you've seen some of the audience members come up, the development community said usually they move in for a syndication of a tax credit project at year 15 to 20, and'",
        "'speaker_12': 'that's when they're looking for some more inflection into the project of capital dollars to rehab to the projects. So it's been more about the availability of funding than it has about the level that is reflected in our product term sheets.'",
        "'speaker_1': 'Are you anticipating that there will be?'",
        "'speaker_4': 'You know, as we're.'",
        "'speaker_1': 'Looking at federal funding and state funding, what's coming to local municipalities, a need for local municipalities to put more in, as were increasing the number of years of affordability.'",
        "'speaker_12': 'I don't see a need. I see a need for sustained funding over the period of affordability time. I don't see a need for that funding to increase over time. Costs just generally go up for those rehab dollars, but I don't see a need for an initial like today's money to be increase for rehab dollars today.'",
        "'speaker_12': 'Okay. Does that make sense?'",
        "'speaker_1': 'Yes. Yes. As far as the the application guidelines for the projects that are coming into the city, are you all going to relook at the the guidelines and qualifications for those as part of the the rules and regs process?'",
        "'speaker_12': 'We'll look to make sure that is in alignment with what we looked at in the term sheet so that we didn't miss anything. Currently, you know, we have seven term sheets out there for different types of products and our rehab dollars on a tax credit project or if it's not a tax credit project or anywhere from 10000'",
        "'speaker_12': 'to $50000 per unit.'",
        "'speaker_4': 'Okay. All right.'",
        "'speaker_1': 'All right. Thank you. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman Gilmore. Councilwoman Ortega, you back up.'",
        "'speaker_5': 'Thank you, Mr. President. I wanted to ask Andrew Romero if you wouldn't mind coming back up. I wanted to ask you if you see any implications of adopting the ordinance tonight without the rulemaking components in place. I know that's part of what the development community is asking for, is to have some input into all of the the'",
        "'speaker_5': 'rules. And are we locking certain things in by adopting the ordinance tonight that then. Leave less flexibility for what those rules might look like if we wait and deal with the totality of it all at the end of the four month time frame.'",
        "'speaker_10': 'Well, I think the markets would just be a little bit unsettled maybe. You know, we don't really understand until we see the rules as investors and lenders. Again, we don't we'd have to see what the rules are behind it.'",
        "'speaker_10': 'You can change this one piece. But until we are able to see what the actual guidelines are for $30, for how chapter reacts to the change, for how the Division of Housing reacts to the change, it's just impossible to really understand what the impacts are, you know, financially.'",
        "'speaker_10': 'So I do think that there you really have to look at the deed. Someone said, look, the devil, the devil's in the details. You got to look at that. And I really would like to see, you know, not not just the lengthening of the term, but how you propose that these projects will be funded.'",
        "'speaker_10': 'I just there's something I've been wanting to say for a long time, and I have now an opportunity and maybe this is the time the state of Oregon addresses these issues in a very different way than in Colorado.'",
        "'speaker_10': 'They have preservation as one of their top priorities. So in their later program projects that come up for recertification, they give a lot of points in the state to preserving units that might expire or go out of the program.'",
        "'speaker_10': 'And that's something very different from Colorado, Colorado. Almost all of the money for 9% awards go to new projects. And so they're they're doing something about it. They're very different than we are. And I think that would be something to look at, you know, suggestions to look at.'",
        "'speaker_10': 'Another thing that is happening in Oregon is the match Portland metro area has a $650 million bond on on the ballot in November. And a big chunk of that is for preserving units that are about to expire. So there's another thing that I think we ought to look at is the resource side of this, not just, you'",
        "'speaker_10': 'know, the restriction side.'",
        "'speaker_5': 'So one last question for you. So as a lender, do you look at a project that is brand new that would have a 60 year commitment time frame to the affordability different from what you would look at an older building that is being asked to commit to a 60 year affordability?'",
        "'speaker_10': 'No, we're looking at 15 year, 15 year time frames as lenders and investors. Okay. And we're only looking at the length of time our money and our capital is in the project, and it's always usually about a 15 year time frame.'",
        "'speaker_10': 'So we look at it in increments of 15 years. But I can tell you that when a project is, say, 30 years old and it comes in to us and there and they're proposing small amounts of renovation because, you know, the city, the state just doesn't have enough resources to build it up to a point where it's'",
        "'speaker_10': 'substantial.'",
        "'speaker_5': 'The funding.'",
        "'speaker_10': 'Yeah. Then, then that becomes an issue for us as lenders and investors. And those are usually older projects.'",
        "'speaker_5': 'Okay. Couple of questions for Edie, and I'm not sure Britta or Doug who wants to answer this. First of all, how many how many projects are in the pipeline right now that are asking for city money that are awaiting awards from Chapple for their like tech funding?'",
        "'speaker_12': 'There are 25 projects that we're actively working on right now that are in various stages of underwriting or moving towards a contract. The pipeline going into next tax credit round. We're compiling that information right now. Two projects were awarded tax credits this last round.'",
        "'speaker_5': 'In the city of Denver.'",
        "'speaker_12': 'Correct? In the city of Denver, sorry.'",
        "'speaker_5': 'Because this is a statewide competitive, very competitive process for not just the 9%, but any more even for the 4% money rate.'",
        "'speaker_12': 'The 4% plus state is competitive and the 9% is very competitive.'",
        "'speaker_1': 'Okay.'",
        "'speaker_5': 'Is it mandating a particular am I level for projects? And how do you all determine which projects receive which? Am I levels?'",
        "'speaker_12': 'We do incentivize into our term sheets for financing products that incentivize a lower AMI level across the board of our projects to those rental projects for pushing to 30%. AMI As an example, I think we talked about the 4% plus state.'",
        "'speaker_12': 'Our we started a typical per unit subsidy of 15,000 and we are able to move that to 25,000 per unit should the project do 30% of its units restricted to 30% am I?'",
        "'speaker_5': 'So if this is a nonprofit that's already serving a low income population, that may or may not be right at 30%. I'm curious how the mandate, if you will, to go to 30% impacts the bottom line that we were just we just heard about earlier, where a lender is looking at the the rents to be at a'",
        "'speaker_5': 'certain a certain rate that ensures that the project will pencil out over the the, you know, next term of that affordability period. Can you can you speak to that? If so. If a project is is coming in for re syndication of of their tax credits and asking for city asking the city for funding to help close that'",
        "'speaker_5': 'gap again because it requires that find finding financing. How how is the 30% that you just talked about affecting that bottom line?'",
        "'speaker_12': 'It depends on the project I can't speak to unless you give me higher specifics. I can say that any project that is currently under tax credits, if they're going for re syndication of tax credits and asking for tax credits and re syndicating to a longer amount, the appraisal of the projects must be done at the current subsidized'",
        "'speaker_12': 'rents. So if they have Section eight subsidy in there, they must be pro forma and underwritten at those current rents. If they don't have those existing subsidies, they must be done at the current lura levels that are in place on the project.'",
        "'speaker_5': 'Okay. And I think you're just reiterating the point that Marvin Kelly just made earlier.'",
        "'speaker_12': 'For the 30% units, we only incentivize those. We don't mandate that you have to ask for those. So we have levels of affordability that we're targeting as an outcome, and we'll pay more for those lower affordability. But we still will subsidize projects between the 30 and 60% levels and the 30 and 80% level.'",
        "'speaker_5': 'And are you making any distinction between whether the developer is a for profit or nonprofit?'",
        "'speaker_12': 'We're we're totally driven towards the outcomes that we get for longer term affordability and lower affordability. Our term sheets are available to for profit and nonprofit developers.'",
        "'speaker_5': 'And it's based on who's willing to go, who's who's willing to serve that lower income population that you then subsidize further subsidize those units for.'",
        "'speaker_4': 'Correct?'",
        "'speaker_5': 'Okay. Does the allow developer fees for both for profit to nonprofits when they're building a unit brand new as well as when they're coming in for a re a total refinance of their project to maintain that long term affordability of those units.'",
        "'speaker_12': 'Yeah, the developer fee is an eligible staff costs in a development budget for both for profit nonprofit any affordable developments.'",
        "'speaker_5': 'And is there a difference in how they are looked at and awarded, if you will? Between the two. Does a for profit get a higher developer than a nonprofit?'",
        "'speaker_12': 'Typically now the developer fees are set within a range. I would say that the developer fees currently are falling within the 9 to 12% of the total development budget.'",
        "'speaker_5': 'Okay. Thank you. I have no further questions.'",
        "'speaker_2': 'Thank you. Councilwoman Ortega.'",
        "'speaker_4': 'Councilwoman Sussman.'",
        "'speaker_1': 'Oh, thank you, Mr. President. I'd like to return to Councilman Black's hypothetical. Just a real quick question. It might be my lack of knowledge about capital markets, but if suppose you have a building that went from a 20 year preservation to a 60 year preservation, and you want to buy the property across the street.'",
        "'speaker_1': 'And use the building you presently have as collateral. Does the change from 20 years locked in to 60 years reduce the value of the property you have now? If you wanted to use it for collateral to buy something across the street.'",
        "'speaker_12': 'Oof! These are great questions. I don't think so, because I think the collateral would be as an as is condition for the appraised value of the building. You're you're talking about whether there was another 20 years left on it or 15 or 60.'",
        "'speaker_12': 'It would be as a as is condition with the as is in place rents if you're pledging that as collateral to a project somewhere else.'",
        "'speaker_1': 'I'm getting different kinds of answers from the head nodding behind you. I'm wondering if I call Mr. Romero up in.'",
        "'speaker_4': 'Church.'",
        "'speaker_1': 'And have him talk to me. He seemed to know something about capital markets.'",
        "'speaker_10': 'I think it would be a very big difference in value because you would also look at the 15 year value of the property. And if you don't have restrictions at that point, that value is going to be much higher.'",
        "'speaker_10': 'So a person who wanted to buy that property, if there if the if the restrictions were ending in, say, five years, they're going to pay a lot more than if there were any in six years.'",
        "'speaker_1': 'Thank you very much.'",
        "'speaker_2': 'Councilman Espinosa. Thank you.'",
        "'speaker_7': 'Maryland, sir. Mr. Romero, just. I guess for her as a refresher, how many years have you been doing affordable housing finance?'",
        "'speaker_10': 'Oh, thanks. Thanks. Bravo. It's been a long time. About 30 years, huh?'",
        "'speaker_7': 'Yeah. On the bank side, correct?'",
        "'speaker_10': 'Yes, on lots of different sides. But yeah, on the bank side for about 20 plus. Yeah.'",
        "'speaker_7': 'So I will stick around. I will have a question for you about private activity bonds. But first, I have a question to the city. It has has chief have been consulted and I recognize they have a member of the of chaff has an ex-officio role on the hat committee but has the board.'",
        "'speaker_7': 'Has the city asked the board chair for board for a written position of support? Why or why not? Or have they received it?'",
        "'speaker_9': 'So Jaffa and the State were both consulted as part of our research on this proposal. We did not ask them to take a formal position.'",
        "'speaker_7': 'Since they seem to have, you know, they would probably be impacted on the financing side. Why didn't they give us a strong indication of support or non. Just, you know, simply just being at the table as opposed to actually being giving us clear direction that this isn't set, in fact, something that they desire.'",
        "'speaker_9': 'I won't put words into Shaffer's mouth in terms of why they wouldn't give us any formal recommendation. But this is a local consideration for us of what do we think is appropriate for Denver. And certainly they have worked with restrictions at a local level that range from hours at 20 years up to perpetuity at Boulder.'",
        "'speaker_9': 'But I, I won't speak for Chandler for why they didn't take a formal position.'",
        "'speaker_7': 'Well, what percentage of our Logitech projects go through Charter?'",
        "'speaker_9': 'So any Logitech project that receives well, I should say any project that receives city funding that's a large tech project was allocated the light tax through Schaefer because they are the allocating agency for our city.'",
        "'speaker_7': 'So basically what we've talked about a lot are low income housing tax credit projects and those are the real deep affordability projects. And that is we can't wrap ourselves around deep affordability and in our goals there without actually considering the people that actually direct those funds and and and allocate those funds year in and year out.'",
        "'speaker_7': 'I really wish they would have taken a position. Maybe that's my question to you, Ander. How do how do private activity bonds. I mean, you talked a lot about how hard it is to finance these longer term affordability projects.'",
        "'speaker_7': 'Were you specifically talking about private activity bonds with respect to charter or or is that history?'",
        "'speaker_10': 'Yeah. Most of the renovation syndication work is with the 4% private activity bond program. What I was talking about is in another state, they're allowing the 9% program to come in and do these return occasions a lot more.'",
        "'speaker_10': 'But yeah, almost. I would say 90% of the work that's done with recent occasion is private activity bond 4%.'",
        "'speaker_7': 'So do you think this will impact Charter in any way, shape or form? If we were to dedicate I mean, extend the terms 30 to 60.'",
        "'speaker_10': 'Probably not too much. No, I don't think so. I think it might eventually make these projects a little more competitive if they start scoring them based on that years and if they start to if we can encourage as a city, you know, a lot more of out of the scoring to go toward re syndicating and these projects'",
        "'speaker_10': 'that are expiring if we can get more scoring, there's certainly traffic will be impacted significantly by that. And that's what I've been advocating is is being able to have more resources to these projects that are expiring that are older.'",
        "'speaker_7': 'So that's interesting. So because there is that aspect of this of this action sort of forcing our hand both from a funding standpoint down the road and now maybe impacting charter, I don't know, half as formal structure. Do they get to change their own rules about scoring or do they have to go somewhere?'",
        "'speaker_10': 'Yeah, kind of. But I think that there's input from cities and localities and you know, we certainly can input have input as a city and I think we do as a city, have input into chief as to which projects they select.'",
        "'speaker_10': 'So certainly we as a city, we have a significant role.'",
        "'speaker_7': 'All right. Thank you.'",
        "'speaker_2': 'Thank you. Councilman Espinosa and Councilwoman Kennish, thank you for your patience here.'",
        "'speaker_6': 'Thanks, Mr. President. I'll just pick up where we left off. So there's this early question about whether this is compatible with China. We're narrowing it down by minus two final questions. One, are we aware of any projects in Denver that have been underwritten for 60 years already?'",
        "'speaker_6': 'Particularly that involved tax credit financing.'",
        "'speaker_9': 'So I think actually Union Station is the example that we looked at that has a 60 year restriction.'",
        "'speaker_6': 'So we've already done this in Denver. Projects in Boulder have perpetuity. Has CHAUFFER underwritten them?'",
        "'speaker_9': 'Yes.'",
        "'speaker_6': 'Okay. Does it to your knowledge, has Shaffer ever taken a position on a city housing policy? Is that something the state does generally in Denver, elsewhere, or do they weigh in on city policies?'",
        "'speaker_9': 'Not to.'",
        "'speaker_1': 'My knowledge. Okay.'",
        "'speaker_6': 'So, Mr. Mayor, I just wanted to follow up. You were asked a scenario, and I think you answered it sincerely, but you might have answered two different things. So one question is if I'm about to buy a building, if you want to come up, if I'm about to buy a building, would I pay more for a building'",
        "'speaker_6': 'that's about to expire or for a building that. And that was kind of the answer you gave. Well, of course, it's going to expire in six months. I'm going to pay more than I would if it's in 60.'",
        "'speaker_6': 'But that wasn't actually the question Councilman Sussman asked. And so you were saying about collateral or thinking about if you wanted to finance or renovation. So we're not in a sale scenario. You're going to a bank and you're saying, I want to refinance this building to repair it, or I want to use it as collateral to do'",
        "'speaker_6': 'something else. In that scenario, you're not talking to a buyer saying, is the bank going to give you less money because you have a longer affordability? And so we'd gotten some answers and they matched what Doug said. And so I just want to clarify that we're not talking about a sales scenario appraisal here.'",
        "'speaker_6': 'We're talking about with a bank, if you less money to renovate because your affordability had 20 years instead of ten years to expire.'",
        "'speaker_10': 'I'm sorry. Maybe I understood her.'",
        "'speaker_1': 'Question a lot about kind of long night.'",
        "'speaker_10': 'So her question was about collateral also and whether the long a longer term restriction would impact that value of the collateral. And it would, in my view, impact the value of that collateral across the street because of the lower if you have only five years left, it's certainly going to be a higher value than six years to'",
        "'speaker_10': 'anybody, to the marketplace. And that's what an appraiser is going to look at. They're going to look at the value in the market.'",
        "'speaker_6': 'And then going back to the original scenario about if it was just a rehabilitation, though, which is I mean, again, we're not in the interest of passing an ordinance that helps makes make buildings sell for more. That's not our mission today.'",
        "'speaker_6': 'That's not the ordinance as purpose. So I'm most interested does it impact the ability to rehabilitate? We'd gotten again quick answers from the from other financers that it was whether your deed restricted or not more so than the length of affordability.'",
        "'speaker_6': 'And so I just am trying to.'",
        "'speaker_10': 'I don't I don't know, I think for renovation the length, as long as you're out past 15 years, again, you know, that is the length of time that our capital is in a project. So if it's 15 plus, that's all we're really looking at.'",
        "'speaker_10': 'And I don't think it affects the value there.'",
        "'speaker_6': 'No. Okay. Thank you. That's really hope. I'm just trying to I think my goal here is to narrow the number of issues that we're debating or that we're concerned about. There were a couple of folks you mentioned tripling the number of years of affordability.'",
        "'speaker_6': 'Denver's ordinance has 20 years in it. But could you get a tax credit project funded right now at 20 years? Do we have any new projects being funded at 20 years that are receiving tax credits in Denver and for the last couple of years?'",
        "'speaker_12': 'While it would be allowable under the AKP for Shaffir, they actually incentivize through a point system longer affordability. So they're already as I mentioned, at 40 years this would achieve another or achieve 38 points in their AQAP. So just.'",
        "'speaker_6': 'To clarify, we're legally going from 20 years to 60 years, but in practicality, for most projects, we're going from 40 to 60.'",
        "'speaker_12': 'As we see it in tax credit projects. That could be correct, yes.'",
        "'speaker_6': 'Okay. That's helpful. Thanks. I wanted to go back to something that was touched on. A couple folks in the testimony shared concern about the idea that you might have this need to change the army levels that markets change.'",
        "'speaker_6': 'And I wanted to just ask OSD, you know, we had some conversations and I you know, I shared some questions from the community prior to the hearing. So I just want to be transparent is. Well, let me ask the city attorney first.'",
        "'speaker_6': 'Is there anything in the ordinance before us tonight that prohibits OSD from allowing a change in army levels? So is there anything in the ordinance language that would prohibit us from allowing a project to change its aim eye level during the six years?'",
        "'speaker_6': 'By the way, I'm Julie.'",
        "'speaker_1': 'Mecklenburg with the city attorney's office. I forgot to introduce myself last time.'",
        "'speaker_6': 'No, there's nothing that would prevent that. Great. Thank you. And then for OSD, there are some things that you know are yet to be figured out. But have you made a decision definitively on your willingness to commit to in writing something in the rules and regs related to flexibility in army levels at the point at which someone'",
        "'speaker_6': 'is re syndicating and had an economic case. So can you just speak to what commitments you're able to make on this topic?'",
        "'speaker_9': 'Sure. We have asked we talked with Chief. This is one of the things that we talked to the chiefs about. And in their lawyers, they do have language that they've shared with us that allows flexibility in the event that a project needs it to amend the terms of the covenant.'",
        "'speaker_9': 'And we have discussed that internally, and that's something that we would feel comfortable, including in our covenants, if a project required it.'",
        "'speaker_6': 'Okay, great. So we've had a range of questions about, you know, the re syndication issue. And so I just, you know, the community came to me with some ideas from San Francisco. One of them was the idea of having a little more reserve up front to just kind of build up a little bit more of a nest'",
        "'speaker_6': 'egg for those repairs. Is that something you are willing to consider in the process that's going to happen with the community that you'll look at that idea?'",
        "'speaker_9': 'Sure. Yeah. I think we are we are definitely committed to evaluating our role in supporting projects, including our underwriting standards, and that would be part of that conversation around our underwriting standards.'",
        "'speaker_6': 'And then there was also a question about whether or not it made sense to have a renovation specific RFP or some ground where folks weren't trying to compete with new units, but they were, in fact, just money might be set aside.'",
        "'speaker_6': 'Is that also something the department is committing, committed to considering?'",
        "'speaker_9': 'Yeah, I think we are open to considering ways that we would support these kinds of projects and preservation generally moving forward. Got it.'",
        "'speaker_6': 'So the other you know, there's been a set of concerns that are kind of were raised about whether or not there's enough money generally. And I think, you know, this is where sometimes we have a conversation up here that's about more than just the policy before us.'",
        "'speaker_6': 'We've gotten several folks who've been very clear now that nothing changes in the pro forma with the decision we make tonight. And yet folks have also brought up the amount that the city subsidizes. So we've got a little bit of a conflicting message out there.'",
        "'speaker_6': 'But I want to clarify. Has anything changed in the maximum investment amount from OSD since the initial research was done about how our initial investments compare to other cities? So we were lower? No question. But that research was done.'",
        "'speaker_6': 'Is there has there been any changes in what aid has been willing to invest per unit since that research was done?'",
        "'speaker_12': 'We've increased our funding levels across the board in our term sheet over the last years. Amounts given that research and also the market research we did here in Denver for development of projects, both tax credit and non tax credit.'",
        "'speaker_6': 'Okay, great. I think that's it, Mr. President.'",
        "'speaker_2': 'Thank you, Councilwoman Quinn. Each Councilman Ortega.'",
        "'speaker_5': 'One very last question I just want to ask. Oh, I'm assuming that you were looking to do rulemaking anyway. So what does that look like moving forward? Have you already sort of laid out a schedule? What are some of the key elements of what that would entail and who else is at the table besides the nonprofits to'",
        "'speaker_5': 'help shape what that looks like? And do you expect that can be done over the next four months, given the fact that at least two of you are going to be out for, I would assume, a couple, 2 to 3 months?'",
        "'speaker_9': 'Sir. So there's two different pieces of the rulemaking process. This ordinance includes the right of first refusal as well as the minimum affordability period. We have been because we've had the right of first refusal and the experience of the last couple of years, we've been thinking about what those rules look like and starting to have some conversation'",
        "'speaker_9': 'around that side of it already. So certainly focusing in on the minimum affordability is something that we could spend the next several months working on. And I imagine that we would want to have the non-profits, for profit developers, but also finance experts as well as some of our other state partners at the table to think about what'",
        "'speaker_9': 'particular implications our rulemaking process might have on those other agencies.'",
        "'speaker_5': 'And can you make sure that it's not just one representative representing the for profit community because you have some that have been around long enough that they have exhausted their obligation, period, and have attempted to refinance, whereas others have not quite even come to that point yet with some of their properties.'",
        "'speaker_5': 'And I think it's important to have robust representation because I believe you're going to see a greater effect on the nonprofit world than what you are, the for profit world, because we're not going to go buy a, you know, 100 million or whatever the cost of a a project is on Walton Street that has a smaller number'",
        "'speaker_5': 'of affordable units, whereas the non-profits, it's 100% of their properties that are affordable. And so I think the representation is critical in how the the criteria gets shape moving forward for what will. And I would love for the opportunity to ensure that some of that information is shared.'",
        "'speaker_5': 'Back with us about how that rulemaking plays out.'",
        "'speaker_9': 'Absolutely. Whenever we engage in a policy conversation like this, we try to have a balance of different perspectives informing the dialog. But I think that's certainly appropriate to have more than one voice as part of the representation that for that particular stakeholder group.'",
        "'speaker_5': 'Thank you. No further questions.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Seeing no other questions. The public hearing for Council Bill 1089 is closed. Comments by members of Council Councilwoman Cannick.'",
        "'speaker_6': 'Thank you, Mr. President. We had a very technical debate there. Discussion. I want to thank all of the speakers, particularly the community members who spent time with me and with many of us just engaging in this dialog over the private previous weeks.'",
        "'speaker_6': 'There were a couple questions raised about process, and I frankly agree that it can't be one council member trying to carry the opinions of this council, which is why, at my urging, in May, when the department started to hold meetings on this, they invited this entire council.'",
        "'speaker_6': 'So I just pulled up the email. All of us were invited to attend those focus groups and to be a part of the conversation. I'm busy. I don't make it to everything. I don't expect everyone to make it to everything.'",
        "'speaker_6': 'But the offer was there. I also pulled up the email from June 20th where I emailed you all the slide that I got and shared with you, my feedback and the things that were raised, including some of the questions that came from the community.'",
        "'speaker_6': 'I flagged all that in June, so I always I know we're busy and it is always acceptable if we can't all engage in a debate at the same level. But it's important for us to take responsibility for our roles and not say that we weren't included when we had those chances.'",
        "'speaker_6': 'That doesn't mean that everything was perfect and that the process couldn't have been more robust and getting to some of the technical pieces of how this could be implemented. And I think from the community standpoint, I will say and I shared this, that initially it sounded a lot like opposition to the concept.'",
        "'speaker_6': 'And so it can be hard to focus on the how. And so sometimes it just takes some time to get through that. And I appreciate the time that folks spent getting there. The letters we received today, the testimony from some folks today was clear that there was a commitment to long term affordability and the focus should be'",
        "'speaker_6': 'on how did we get there a little later than we might have in terms of being able to get to those details? Probably. Are there some learning opportunities? Yep, there sure are. But where do I find myself tonight in terms of wanting to really move this forward now?'",
        "'speaker_6': 'And it comes down to two things. The first, I've been doing this work before I was elected, including council 15 ish years. During that time, I have seen zero nonprofit projects flipped to luxury. I have seen nonprofits that regardless of whether their covenant is in.'",
        "'speaker_6': 'Place or not. And I heard some of these stories this week. Work to get the refinancing. Work to get the loans. Work to get the do the repairs. They may change the army levels and they keep their buildings affordable.'",
        "'speaker_6': 'So whether this ordinance passes or not, our nonprofits are doing this work and it's hard and we can make it easier. But during that time, I can tell you, I have seen a number of for profit buildings flip to luxury.'",
        "'speaker_6': 'Right. So Sikora Square. Right. Is is lost. Rents increased. There's a building in Capitol Hill that we lost. I know this may sound counterintuitive based on the testimony we heard today. I believe this measure levels the playing field because right now, mission based organizations have to trudge through and find solutions to all of these renovations because their'",
        "'speaker_6': 'mission requires them to, whereas for profits can dodge our efforts to make offers and can let their units expire and sell them at a profit and walk away. And they've done it. And so that's unacceptable to me. I want our for profits to get the same investments as we heard tonight, as are nonprofits, to have to slog'",
        "'speaker_6': 'through all of these challenges, too. I want them to have to figure out the refinance and the repair and all those things. And I want us to be fixing all the systems and improving our ability to do it.'",
        "'speaker_6': 'But I can't in good conscience allow one piece of our market to walk away from these buildings and the residents and have them be displaced. So, one, I see this as a leveling of the playing field and to.'",
        "'speaker_6': 'I can't walk away from a solution that I know is feasible during a moment when it's needed the most. 25 projects in the pipeline. And I have the opportunity right now today. Now, some may be a little further along and maybe they're already past the point where this would apply.'",
        "'speaker_6': 'But if I have the opportunity to send a signal to this market about what's expected in the city, and I can send the message tonight that what's expected is six years, I need to send it. And I can't go to my community and say, no, sorry, I'm not sure where I stand.'",
        "'speaker_6': 'We need a few months because I know today it's feasible. I know today it's feasible because actually Union Station did it in our city. I know it's feasible because Boulder has funded 1818 tax credit projects since 2000 with perpetual affordability in the same Housing Finance Authority system that we use.'",
        "'speaker_6': 'And so if it's feasible and if it's right and if I have the power to vote on it tonight, I have to do that. And so I urge my colleagues to reject a delay. But out of respect for the desire to get those details on paper, to support my amendment to delay the effective date, but to make'",
        "'speaker_6': 'it certain for everyone that that effective date is coming. Because if we delay this for four months, what we are saying is we don't know, we're not sure, and it might change. And that's not the message I think we need to send during this moment in this housing crisis.'",
        "'speaker_6': 'So with that, I urge a yes vote on the amendment as well as the bill. Thank you.'",
        "'speaker_2': 'Thank you. Council can each sing no votes. Some late clickers. Councilman Espinosa.'",
        "'speaker_7': 'Sorry, I thought I actually clicked, so I apologize. I'm not going to go there. I got we did this before, which is not going to use the fact that there's urgency to sort of to sort of run run forward with something that can actually be improved and actually win my support, because I have been in favor of'",
        "'speaker_7': 'extended terms since before I got on this council. And and so but it isn't I have no interest in just doing it. When there were three things in my colleague's line of questioning that that that the presenters said that they are open to discussing that are actually important to know and have sort of written down clearly so'",
        "'speaker_7': 'that we can clear I'd approach this and all that takes us. Yeah a few more months of dialog or a couple more meetings and it doesn't take me being there because I haven't been present every single iteration. But there are members of this community that have that have been paying attention for three years on these endeavors, that'",
        "'speaker_7': 'still have these concerns, that you are just willfully acknowledged that, yeah, those are all things that we can consider. So why not consider them and come to this body with some form of rulemaking already in place, in some sort of projection on what these needs would be going forward so that we can actually approach this thing thoughtfully'",
        "'speaker_7': '. Because over the last 15 years we had an Ihf that had a 30 unit minimum and didn't, and we were promised that this was going to generate a whole bunch of housing. And we told people back then that that was not low enough.'",
        "'speaker_7': 'And that one was heat mapped. We could have done it towards specific communities and then it had a 15 year covenant, and that was disastrous because part of these units that are going up these days are the units in Jefferson Park that expire this year and in three years.'",
        "'speaker_7': 'In all, affordable housing, subsidized housing that the city built will be gone from Jefferson Park in four years. Meanwhile, we've lost a lot of market rate housing to very generous zone up zones. That's a different matter. And we even had to extend we had to update the show to revise the terms of the covenants because we had'",
        "'speaker_7': 'bound people into looser units when the economy took a downturn. We don't get it all right from here. And we have acknowledged that. And it's painful and slow to get it right later on. So what's a few more months to have this discussion to address our partners in the Affordable in the nonprofit sector?'",
        "'speaker_7': 'I get it. I'm fine with no one wants to send a clear signal to our for profit community that developers than me been very consistent with that for three and a half years on this on this date. Got no problem with that.'",
        "'speaker_7': 'But there are actual language in our charter that makes special carve outs for nonprofit. So why not do it in ordinance? Recognizing that for 32 years, our nonprofits have taken it upon themselves to help deliver on these needs for our city.'",
        "'speaker_7': 'Why not give them flexibility that our for profits don't have? So I think there's I think there's a discussion to be had, and I think it takes time. And so this is often where I get told to not let the perfect be the enemy of the good.'",
        "'speaker_7': 'I'm not searching for perfect. I'm searching for a few more rules to address some legitimate concerns by our nonprofit partners who have helped put in that affordable housing that you just were told doesn't disappear. They don't go away.'",
        "'speaker_7': 'And I can tell you, having sat in those offices for five years delivering affordable housing, and I said that I wasn't on the financial side, but I have seen the work that gets done to try and put together the capital stack.'",
        "'speaker_7': 'And that is not easy work. Architecture is simple. To build developing projects is simple compared to the financing that goes on in these projects for nonprofits. That is difficult work. That is a lot of brain cells being used up and a lot of stress because what you're trying to do with those nonprofits is you've got a mission'",
        "'speaker_7': 'to deliver this kind of this needed housing to a population that is demanding it, and there is a waitlist for it. And you're sitting here going, How can I make sure this project gets financed? What do I need to do to make sure we get across the finish line?'",
        "'speaker_7': 'And Doug just mentioned all the different strata, the different checklists that you have to go through to get to that finish line. It is not easy work. The building code, the zoning code, those are way easier than every bit of requirement in AQAP in a latex credit, you know, light tech application, a NOVA, you know, all these'",
        "'speaker_7': 'terms that I don't even care to know are all surrounding. And they drive up the cost of delivering affordable housing. And these guys have been doing it for 32 years in this city. And if they have a question that needs to be addressed and it's going to take us one, two, three or four months to address, then'",
        "'speaker_7': 'let's give them that time. Because for 32 years, we haven't done this. But for 32 years, we've actually had the need and other municipalities have been doing it for almost that time. So I, I just, you know, to compare us to Boulder is, is to me, if you look at Boulder and their per capita revenue relative to'",
        "'speaker_7': 'this city, they have the means to put additional constraints on their development, held their linkage fee of $19 per square foot on their construction. And people will pay that because it's still a desirable place to live because they care about their people.'",
        "'speaker_7': 'I care about our people. But I so I'm not interested in pooh poohing this. I am not interested in not doing a 60 year turn. I am very much interested in a six year term, but I want four months just to have this conversation about how do we actually make sure that driving this, to shove it down'",
        "'speaker_7': 'the throat of a development private developing company world is is good enough. And because we've got this pressure of affordable housing that we're just going to do it. All right. Now, when there are legitimate concerns that don't require me being at the table every single step of the way.'",
        "'speaker_7': 'Because I sit here on this dais right now at this decision point to hear those concerns at this public hearing. And I did. So with that, at some point I will be asking for an extension for four months for my colleagues.'",
        "'speaker_7': 'Mike.'",
        "'speaker_2': 'Thank you, Councilman Espinosa, Councilwoman Sussman.'",
        "'speaker_1': 'Thank you, Mr. President. I want to thank Councilman Councilwoman Kennish for her passion and her hard work on all of all things having to do with affordability. And I think I can give a reason why I'm going to vote no more briefly.'",
        "'speaker_1': 'I. I also want to see the preservation of affordability and feel very strongly that this is a very good goal for us to have. But hearing the leaders of the Housing Affordability Community speak tonight about their concerns, it produced concerns for me.'",
        "'speaker_1': 'And it reminds me, although this might be an unfair comparison of the Green Roofs ordinance, which also had some rules and regs already. But we have we got we got that ordinance and it was an executable and executable and had to take it and write the rules and regulations so that it does become something that is can'",
        "'speaker_1': 'be executed and and maintain the original goal of it. And I'm feeling like this is the same thing here. I also think if we're if there isn't a hurry about something, let's let's let the community that is feeling concerns about the ordinance work on the rules and regulations so that we can pass the ordinance with everybody thinking'",
        "'speaker_1': ', okay, this is a good this is a good thing. We can make this work. So. Thanks. But thanks again, Councilwoman Kennish, for all your work on this.'",
        "'speaker_2': 'Thank you, Councilwoman Sussman. Councilman. New. Thank you, Mr. President. Face Lord, the whole crew for all your hard work. And Robin, especially, I have similar concerns. You know, when I think of the word preservation, I think of, you know, first I think of our right of first refusal, you know, to make sure we secure those properties.'",
        "'speaker_2': 'But I also think about rehabilitation, and I think that's the piece of the definition that we haven't addressed thoroughly with me tonight is that I wish we had gotten more information from those other cities about what kind of funding that they have to make sure that those affordable housing stay in good condition and that we don't end'",
        "'speaker_2': 'up 30 or 40 years from now in a funding crisis where those properties deteriorate. And I just worry a lot about that, and I'm not sure that a couple of months is going to make a difference. I think Councilwoman Sass was right getting all the people to the players at the table to talk about this and just'",
        "'speaker_2': 'and make sure we address all the key issues, whether it's right of first refusal or rehabilitation. I don't think any of us disagree with the 60 years that much. You know, what I heard was was rehabilitation. Am I going to be able to refinance?'",
        "'speaker_2': 'Am I going to be able to afford to keep these properties in good condition? And I don't think we can afford not. To make sure that happens. I will also be voting no tonight. Thank you again for all your hard work.'",
        "'speaker_2': 'Thank you. Councilman. New Councilman Lopez.'",
        "'speaker_4': 'Thank you, Mr. President. I think I don't want to reiterate a lot of folks said. I just. I think for me, I think.'",
        "'speaker_2': 'Of it in terms as folks were at the podium, as we were going back and forth. I just kept thinking of my council district.'",
        "'speaker_4': 'Most of the development that we've had in housing has been affordable. There have been low tech projects. Most of those units that are out there are units that have that that shelf life. Right. Of affordability and also maintenance.'",
        "'speaker_4': 'You know, these are brownstones that are being built right there and they're amazing. But they have a shelf life, I think, of the housing stock in my council district. A lot of the housing stock in my council district and this is one thing I always talk about early on is, you know, what's the greatest challenge in District'",
        "'speaker_4': 'three is that it's the housing stock. The housing stock wasn't built to last for more than 60 years. Some of the.'",
        "'speaker_2': 'Some of those units, you can really tell.'",
        "'speaker_4': 'However, it's that investment and then the opportunity for folks to invest in that future. And I can't tell you what it's going to look like in 60 years. Hopefully, we won a few Super Bowls in that in that time frame.'",
        "'speaker_4': 'But I think of the investment that's happening now in Council District three, where you're seeing most of these.'",
        "'speaker_2': 'Apartment units that.'",
        "'speaker_4': 'Are being built are all luxury. You drive down Colfax and.'",
        "'speaker_2': 'You go to the north.'",
        "'speaker_4': 'Or you look at Avondale or the top of the town bar used to be or the other side of the street or the old human services building used to be. They're all luxury. And then our game plan, in terms of how we're working on it, and.'",
        "'speaker_2': 'You look at a project.'",
        "'speaker_4': 'Just down the way across from Sloan's Lake and folks have been talking about this project for two years, is to create mixed housing affordability and for sale at 51%. And we drag our feet in terms of making it happen.'",
        "'speaker_4': 'And I kind of I don't have much faith that we're going to have the same kind of vigor that we do now in the future if we're already tripping over over our own feet. The folks that I used to rely on and that I still rely on are those showed us when Marvin comes to my office and'",
        "'speaker_4': 'talks about affordability and talks about properties in the district, I listen when new San or northeast come come by and listen. Because before it was popular they were doing it. And so for me, that means something. And I hope that we can gather that information in that input.'",
        "'speaker_4': 'So I am you know, I admire.'",
        "'speaker_2': 'My my all my colleagues who have.'",
        "'speaker_4': 'Been working on on this on this particular issue with their whole heart and soul, with everything.'",
        "'speaker_2': 'I think there's a lot of work that goes in. I don't want any vote here.'",
        "'speaker_4': 'To reflect any kind of no non-confidence or anything in that. I just, you know, issue by issue here in front of the city council. And this is one of them that I think every single like I said, most of the units have been built in my district that are new, are affordable, and they have that shelf life'",
        "'speaker_4': '. Right, 20 years, 25 years max. So thank you.'",
        "'speaker_2': 'Thank you, Councilman Lopez. Councilwoman Ortega.'",
        "'speaker_5': 'Thank you, Mr. President. And I want to thank all of you for your willingness to sit through this public hearing and to listen to the input from our nonprofit, who unfortunately were not able to be at committee because this was during the same week as the housing conference that's held up in the mountains.'",
        "'speaker_5': 'Otherwise they would have been at the committee meeting. So I appreciate your indulgence in allowing for all of these issues to be put on the table. I also want to thank our city team from our housing office for all of your work, not just on on putting this together, but all the work that has assisted us in'",
        "'speaker_5': 'looking at how we roll out the $30 million in bond financing and have an adopted housing plan that really guides how that is going to be spent and how we meet the different ambition levels where the need is just so great across the entire city for so many people.'",
        "'speaker_5': 'From 0 to 80% of the am-I and. But I do want to say that, you know, when you talk about preservation, it equals investment. And we have to have the opportunity for input into the rules so that people know what that means and how how that impacts their ability to continue to deliver, and particularly for the nonprofits'",
        "'speaker_5': 'who are in it for the long haul and have been and will continue to be. But if this creates some hindrance and there's a different way to think it out and work through how you create that longer term affordability, but still allow that investment into the units to happen, that is really critical to ensuring that we don't'",
        "'speaker_5': 'have folks say, Oh, well, heck with it. If we if we have to do this and we can't get assistance with not only the units, but when you say you got to serve zero re 30, you also have to provide some of the service dollars because they're harder population that needs the support services.'",
        "'speaker_5': 'And if we're not looking at and doing that, we're doing a disservice to the city, to the individuals we expect to live in these units and to the surrounding communities. So we have to be looking at the big picture and making sure that we are doing this with that comprehensive point of view and input into how we'",
        "'speaker_5': 'move forward. Yes, there are 25 projects in the pipeline, but annually we're lucky if we get 2 to 3 in the entire city of Denver to get funded because we're competing with Grand Junction and Fort Collins and Trinidad and every other community across the state that's trying to secure these same dollars.'",
        "'speaker_5': 'So the the long term affordability is something that I support. But I think having the the confidence that. Our non-profits have some input into where this goes is a vital part of being able to. Ensure that it's not creating roadblocks down the road.'",
        "'speaker_5': 'And again, we have some that you're not going to see that, you know, time period expire for for a while and others that have have already tried to refinance and have have run into the roadblocks, because that's why we receive some of the input they have.'",
        "'speaker_5': 'They have tried and they they have shared with us the challenge of being able to show the lenders that the incomes that they're collecting on the properties today don't pencil out over the long period to sustain the project.'",
        "'speaker_5': 'And so you need that deeper affordability with with support and assistance from the city. So having the tools in place and the right systems that will track these over time. I mean, I was here when we adopted the inclusionary housing ordinance.'",
        "'speaker_5': 'We thought we had all the right components in place to be able to monitor each of those. Inclusionary housing ordinance across the city, a number of which were at Stapleton. Some were in Green Valley Ranch. Some were, you know, just scattered across the city.'",
        "'speaker_5': 'And we ran into some challenges. And I don't know if that's because we've seen pretty significant changes in our staffing across over time. But having those components in place and the confidence that that we will be able to monitor those and ensure that affordability is there, not just for the nonprofit units.'",
        "'speaker_5': 'And I support our for profit partners being able to commit to the longer term affordability if they want our city money to do their projects. This is one place where public policy matters, ensuring that we can create the right environment and the right tools across the board that ensures that we have this long term affordability.'",
        "'speaker_5': 'But this input is critical. So I am going to move a different motion and we'll have two on the floor that we could we could vote on.'",
        "'speaker_2': 'We're not doing the motion yet. You'll have a chance to do that after we get through the amendment. It's in your paper. You're you're you're in here. But first we vote on the amendment, and then we'll move to your motion.'",
        "'speaker_2': 'So don't make that motion yet, because we.'",
        "'speaker_5': 'Okay. Let me just explain what I propose to do. Go ahead. Okay. I propose to bring forward a different amendment that moves forward, a four month time frame that allows our nonprofit partners, along with with others, to engage with our staff from OED to have input on what the rulemaking will entail before we adopt the ordinance.'",
        "'speaker_5': 'And that's the difference between the amendment that I will propose versus what we have on the table. The one on the table would adopt the ordinance as is, and then we go do the rulemaking, mine would do the rulemaking and then bring it back in four months and then adopt it.'",
        "'speaker_5': 'So I just want you to know that's what I will bring forward as soon as we.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. Councilman Cashman.'",
        "'speaker_3': 'Thank you, Mr. President. I'm not particularly interested in 60 years of affordability. I'm interested in perpetual affordability. But 60 years is what is on the table. So that's that's what we're talking about tonight.'",
        "'speaker_4': 'I don't believe.'",
        "'speaker_3': 'That this ordinance has been discussed in a silo with no concern for our nonprofit partners. I believe their concerns were on the table all along. I believe that.'",
        "'speaker_4': 'Now is the time.'",
        "'speaker_3': 'To make. We're not going to not extend our affordability. I haven't heard anyone at the table suggest they don't want to go to at least 60 years. It's about involving our valued partners in setting up the rules. And I think the most logical approach is what Councilwoman Kenney says to pass this ordinance tonight, let the community know'",
        "'speaker_4': '. Where our commitment is and then hold a four month.'",
        "'speaker_3': 'Delay on the lengthening the affordability portion. So we can involve the nonprofit community even more deeply in setting up the rules and regulations. So I'm I'm tried, but I don't see a reason to delay this ordinance. So I will be I'll be supporting it tonight.'",
        "'speaker_3': 'And I really think we need to be talking about a perpetual affordability. I don't see why in in any scenario, I can envision that we want to take these off the table. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you, Councilman Castro and Councilman Brooks.'",
        "'speaker_4': 'Yep. Just put an exclamation point on this long hearing. 20,000 units.'",
        "'speaker_7': 'A fourth of them are all in District nine. And what I hear from every meeting that I'm at is on affordability and length of four. But it's it's sometimes I feel like I'm in two public hearings in this deal.'",
        "'speaker_7': 'I mean, what I heard is that we're going to work through through the rules and regulations, opportunities for funding and rehab. That's what I heard in the public hearing. That's the major issue that we're talking about here. Every city that I go to.'",
        "'speaker_4': 'And talk.'",
        "'speaker_7': 'To city council members.'",
        "'speaker_4': 'Around housing, they all have longer.'",
        "'speaker_7': 'Times of affordability than we do. And this has been a major point of conversation.'",
        "'speaker_4': 'At.'",
        "'speaker_1': 'All of our.'",
        "'speaker_4': 'Community meetings.'",
        "'speaker_7': 'So I'm a little frustrated.'",
        "'speaker_4': 'I'm going to be I'm going to be supporting this. I think Councilwoman Kinesis rational and.'",
        "'speaker_7': 'Collaborative Amendment fits really good on both ends to allow us to really sit at the table and say, let's make sure we bring the totals to the table. Let's make sure we have the nonprofit developers. And let me just say this, because Councilwoman Ortega said this twice.'",
        "'speaker_4': 'For profit, affordable housing developments aren't just ten and 15 units. We have a.'",
        "'speaker_7': '225 unit for profit development right there at Park Ave.'",
        "'speaker_4': 'And and in.'",
        "'speaker_7': 'Welton. And so it's a very complex issue.'",
        "'speaker_4': 'But I do.'",
        "'speaker_7': 'Believe in rehab. I think that's so important. And I hope that we can get there. And I think we can get there the rules and regulations and through the hierarchy of law. And so honorably supporting this.'",
        "'speaker_4': 'I don't. Yeah, I'll leave it there. I'm supporting it.'",
        "'speaker_2': 'Thank you, Councilman Brooks. See no other speakers. I just want to add my piece here. First of all, I want to thank Councilman Ken each for all your work and all of the staff for all the work. And that, you know, there are there are a lot of things going on and there are a lot of us'",
        "'speaker_2': 'who are working in different areas. But I really appreciate Councilwoman Cleage and staff everybody on the team willingness to reach out repeatedly, answer any questions that I had, and very quickly to get that information and up to speed.'",
        "'speaker_2': 'And I absolutely feel like even when I was not able to make every single meeting, the resources were right there for me. And so thank you for that. You know, I'm going to echo what Councilwoman Kennedy said. I can't say it better than that.'",
        "'speaker_2': 'So I kind of feel like this is a less good version of what she said. But also it tells me Cashman and Councilman Brooks said, you know, to get to for me, I'm. Really. I'm feeling, like, very confused as to why we're not.'",
        "'speaker_2': 'This isn't a 13 oh vote here. And I think Councilwoman Kennedy said it best. This is doable. Right. We have we have proof that this is doable. And it's time we're in a crisis right now. And to sit up here and say we're going to put a delay on this and kick down the road, whether or not'",
        "'speaker_2': 'we're even going to do 60 years to me is is absolutely not in line with what I'm hearing. At least I think that we need to do this tonight. I think that the amendment that Councilwoman Kennedy put forward is is a good compromise.'",
        "'speaker_2': 'Let's tonight make the statement that in Denver, it's going to be 60 years. Look at the smart people we have in this room, on the city side, on the development side. I have no doubt in my mind that given between now and February, knowing that that's when 60 years start, that this will all get figured out.'",
        "'speaker_4': 'And if it doesn't, we are the legislative body. We can amend it, we can repeal it.'",
        "'speaker_2': 'We can say, you know, we didn't get there. So guess what? Now we're going to stop it. So to me, it's we this is our chance that none of the stuff is going to be ironed out. And rules and regs changes our ordinance.'",
        "'speaker_2': 'We'll be back here on the one plan voting on the same exact thing in February when we could have just said, Hey, you guys didn't get there, so now we're going to repeal it because you didn't get there, right?'",
        "'speaker_2': 'And that puts the pressure in the right place. And it's the one pressure point we have as legislators is do our part, pass the ordinance and then say, go figure these things out or else we'll reveal it. Right.'",
        "'speaker_2': 'And so to me, that's where we can strongly say, you know, hey, 60 years is what what is the expectation in Denver? And we're going to give you some time to iron out rules and regs, which is appropriate.'",
        "'speaker_2': 'The ordinance doesn't lay those things out. Let's give some time for those conversations to happen. But under the pressure of on this date, it starts. And if you don't get it figured out, then maybe we will take this back up.'",
        "'speaker_2': 'But we won't be taking it up to decide. Do we do it or not? We'll be will be really putting the pressure points in the right place. So for me, I'm absolutely in support of the amendment and not to the delay as things get a little confusing as we start to vote on the multiple things that will'",
        "'speaker_2': 'be on the table. Councilman Lopez, are you back?'",
        "'speaker_4': 'And just just in terms of procedure. Council president, I just.'",
        "'speaker_2': 'It feels awkward because I would support.'",
        "'speaker_4': 'This one, but I also would consider supporting a postponement. And I'm just wondering why. I'm just thinking how it flows. It doesn't seem to flow as if it sounds like it. It would flow better. Procedural wise, if you had the postponement, motion and vote first and then this.'",
        "'speaker_2': 'I appreciate that. That's why we spent so much time extra at recess. It wasn't just because we couldn't get it off the slide talked about, but it was because. Because for Robert's rules, we have a motion on the floor that has been amended.'",
        "'speaker_2': 'The motion to postpone actually comes after that. And so that's so again, I think thank you to Councilwoman Ortega for setting forth what our our various options are. But procedurally, we take them in the order of bills being put on the floor.'",
        "'speaker_2': 'It's been amended. If it gets amended or not amended, then there's a motion about postponement for a second reading, which comes either way. And so that's why it's set up like that. But I think, again, to clarify for anyone who's following along in the room or on Channel eight for we have the bill open, we'll vote first'",
        "'speaker_2': 'on the amendment. The amendment would say that if the bill passes even now and then on second reading, then it's the implementation. Part of the part that's been contentious tonight does not start until that same date in February, February 9th or February 1st on the amendment.'",
        "'speaker_2': 'Is that what it is, Councilwoman?'",
        "'speaker_6': 'Yes, I.'",
        "'speaker_2': 'February, February 1st on the amendment, whether that amendment then passes or not, then Councilwoman Ortega intends to bring forward a motion to postpone second reading, meaning that the ordinance would not even be adopted until February 19th. And so those are the things that we are we're going in that order.'",
        "'speaker_4': 'Thank you for the explanation.'",
        "'speaker_2': 'Of.'",
        "'speaker_4': 'Folks falling at home. I think it's finite either or. Yeah, it's it's yeah, it's.'",
        "'speaker_2': 'Been it's been a little bit of making the sausage on the floor tonight here. Councilwoman Lopez, was that everything you gentlemen can do? You want to add something to you?'",
        "'speaker_6': 'Yeah, just to two quick comments. First of all, regardless of how these votes go tonight, I'm absolutely committed to being a resource through this process where it's appropriate and where the parties that are involved are interested. So in my opinion, no matter where the vote goes, I'm committed.'",
        "'speaker_6': 'Secondly, just a little piece of voting advice to my colleagues. If you shoot down the amendment and then the motion to delay fails, this bill will go into effect immediately.'",
        "'speaker_1': 'So.'",
        "'speaker_6': 'You may want to vote for the amendment as an insurance policy just in case the vote to delay fails. If what you want is more time. So you certainly may do what you like. But I'm oversimplifying that Mr. Roberts rules speech to say the implicate and I will say this so if you vote for my amendment and'",
        "'speaker_6': 'then the delay happens, we will probably have to amend the bill when it comes back because it'll have this awkward effective date that's easy to fix and will run an amendment so the world doesn't end. But I will say this if you shoot down the amendment and it's not delayed, just so folks understand, the bill will go'",
        "'speaker_6': 'into effect when it's signed. Is that correct, Julie? It's got it doesn't have another effective date. It's just it's silent, which means it goes into effect when it's signed. Someone will jump up if I'm wrong, but then the attorneys are not jumping up.'",
        "'speaker_6': 'So there you go. Thanks, Mr. President. And thanks to my colleagues for a very thoughtful discussion.'",
        "'speaker_2': 'Thank you, Councilwoman Kennedy. Councilman Espinosa.'",
        "'speaker_7': 'Yeah. I just want to be real clear, because the public hearing was on the bill, but the amendments on the floor, I do, in fact, support the amendment to extend I mean, to change the implementation date and and all these have.'",
        "'speaker_7': 'So I appreciate it, my colleague, Councilwoman Candice, for bringing forward that amendment. Thank you.'",
        "'speaker_2': 'All right. So let's see if we can figure this out in our voting here, because everybody's done. So first, we're going to roll on the amendment, which as a reminder, is not necessarily an either or, but does change the effective date to February 1st.'",
        "'speaker_2': 'Madam Secretary, roll call on the amendment.'",
        "'speaker_1': 'I. Brooks.'",
        "'speaker_4': 'Hi.'",
        "'speaker_1': 'Espinosa. Hi. Flynn, i. Gilmore. I. Herndon. Cashman. I can h. I. Lopez. I knew. Ortega, i. Susman, i. Mr. President.'",
        "'speaker_2': 'I. I. I'm secretary. Please close the voting. Announce the results.'",
        "'speaker_1': '12 hours, 12 hours.'",
        "'speaker_2': 'The amendment has passed. President Pro Tem Gilmore, would you step in since Councilman Herndon has stepped out for a second? And will you please put Council Bill 1089 on the floor as amended, I believe is our next step?'",
        "'speaker_1': 'Yes, President Clark, I move that council bill 18 Dash 1089.'",
        "'speaker_5': 'Be ordered published as amended.'",
        "'speaker_2': 'All right. It has been moved and seconded. So we are now voting on the bill as amended. And then after that, we will move to the postponement after it's ordered. Yep.'",
        "'speaker_5': 'The postponement first? Yeah. Mm hmm. Because if you're adopting the bill, then.'",
        "'speaker_2': 'You know, we've got our legislative staff there.'",
        "'speaker_4': 'To duck cross my legislative staff. This is first reading. So the bill would still go on for final next week, which would be delaying the final reading until February 19.'",
        "'speaker_2': 'The first we order it published on first reading. Then you delay second or final. Okay, so this is just approving the bill as amended is what we're voting on now. And then we'll move to the postponement. All right.'",
        "'speaker_2': 'Okay, everybody good on this.'",
        "'speaker_4': 'Okay.'",
        "'speaker_2': 'Madam Secretary, roll call.'",
        "'speaker_1': 'Black eye.'",
        "'speaker_4': 'Brooks Hi.'",
        "'speaker_1': 'Espinosa. Hi. Flynn I gillmor, i.'",
        "'speaker_4': 'Cashman Hi.'",
        "'speaker_1': 'Can I.'",
        "'speaker_4': 'Lopez All right.'",
        "'speaker_1': 'New Ortega, I. Susman No, Mr. President.'",
        "'speaker_2': 'I. I'm secretary. Please close the voting. Announce the results.'",
        "'speaker_1': 'You have ten eyes.'",
        "'speaker_2': 'One name that we're missing somebody because we have 12 up here. So we're missing council minutes.'",
        "'speaker_1': 'So Lebanese want.'",
        "'speaker_2': '11 eyes when they're accountable. 1089 has been ordered, published as amended. And now, Councilwoman Ortega, your motion to postpone.'",
        "'speaker_5': 'Thank you, Mr. President. Mr. President, I move to postpone final consideration of Bill Number 1089 series of 2018 to February 19, 2019.'",
        "'speaker_2': 'It has been moved and seconded. Are there any comments or questions on this part by members of Council Council women or take it you have more you want to add?'",
        "'speaker_5': 'No, I think it's it's all pretty clear. It just postpones final consideration that allows this input to happen until February the 19th, 2019.'",
        "'speaker_2': 'And Councilman Espinosa, I don't know if your name is still in there or if you're in there for a comment on this. For a comment. Okay. Go ahead.'",
        "'speaker_5': 'And this this is Monday. It's Presidents Day.'",
        "'speaker_7': 'This is this is my plea to try and sway the president. You know, this idea of a statement vote. You know, Donald Trump is great at making statements. We don't need to be in that business. We need to be pragmatic.'",
        "'speaker_7': 'And my point is, is the reason why I'm even saying this is you were questioning you were wondering why this is not a 13 oh vote. I want it to be a 13 no vote. I think if we did a four month delay, I have no doubt that this would be a unanimous vote.'",
        "'speaker_7': 'What I take exception to is the same thing I took exception to back in the permanent affordable housing vote thing. I was always a yes vote except for the fact that we were not going striving deep enough. I wanted a higher linkage fee.'",
        "'speaker_7': 'Multi-unit, affordable, I mean, multi-unit, apartment housing, which was a segment that we could have isolated in the next study. We, we because I recognized we were not going to get enough money out of the development community, nowhere near what was being promised to deliver the 15 years million dollars per year.'",
        "'speaker_7': 'And it bore out and it continues to bear out. And what I was saying is that the amount in total, $15 million was insufficient to make a real crack at an affordable housing needs. And so I am grateful.'",
        "'speaker_7': 'And that's why you saw me supporting the two additional sources and getting to that $30 million a year, because that's where I wanted to be two and a half years ago. And we had the votes we needed nine to override the mayor.'",
        "'speaker_7': 'There were seven to get it through. And we can do that as a body, but we chose not to because it would have required a little bit of negotiation and legwork to make that happen. So instead of getting that additional $30 million over the last two years and having to subsidize it, I mean, add funds in a'",
        "'speaker_7': 'whole bunch of different ways rather than have it part of the permanent affordable housing fund. We we missed that opportunity. This is that opportunity on this bit of legislation is what you have is resounding support for 60 months.'",
        "'speaker_7': 'I mean, 60 years terms. Why not come here with a unanimous decision? Where that says to the development community on all sides that this council is unequivocal in its statement that this is important because I'm a yes vote on a six year term.'",
        "'speaker_7': 'But I, I, I, I love the, the, the paragraphs four, three and four of the NDC statement that really gets to the heart of what's at issue here. There are partners they're not interested in, in having counsel kill this bill.'",
        "'speaker_7': 'I'm formally of that. We're having been an employee there and I am not interested in killing this bill, but I am interested in having them at a discussion and making and trying to make clear tweaks so that we can get somewhat some bit of assurance that we've considered the long term ramifications that this has to a very'",
        "'speaker_7': ', very specific I'll recognize a very, very specific sector. But that sector has served us well. You heard it in the statement. DHEA only has 25% of our units. It's these others, these other segments that are delivering the bulk of our affordable housing units.'",
        "'speaker_7': 'Why wouldn't we have a big significant partner in that discussion helping shape our policy before we implement it? Why would we put a gun to their head and say, Nope, we give you till February 1st to figure this out.'",
        "'speaker_7': 'We've given our state, our city until February 1st to figure this out because the consequences if they don't is we live with the bill as written and whatever they come up with. What is so terrible about taking a little bit of time?'",
        "'speaker_7': 'Why are we Trumpian about this? Like, wow, we're going to make a statement. Lock her up. You know, that's great.'",
        "'speaker_2': 'Jasmine. Jasmine. With all due respect, I think everyone understands where you are. You have talked at length this evening about it. In a democracy, rational people, smart people who care about their community can disagree. That is what this chamber and this body is all about.'",
        "'speaker_2': 'You demean us as a body. You demean this chamber by reverting to name calling on our decorum rules. What we expect from the other people in our chamber on how they treat us. The person who has broken that tonight and not just in how you have spoken to me.'",
        "'speaker_2': 'Do not make remarks about council members, personality, parents, or perceived motives. You're bringing in something that is highly controversial to. I'm I'm not done. And I'm sorry, but your time is up right now. It's inappropriate. You demean this body, you demean this chamber.'",
        "'speaker_2': 'Everyone knows where you're at. It is disrespectful what you have done tonight, and I take issue with it. Are there other comments on this? I think that we have.'",
        "'speaker_7': 'We have. I did not.'",
        "'speaker_2': 'I mean, I'm sorry, Councilman.'",
        "'speaker_7': 'I did not intend to demean the president. I was.'",
        "'speaker_2': 'Councilman.'",
        "'speaker_7': 'I have experience. I have.'",
        "'speaker_2': 'If you don't respect the rules of this chamber, then we have no democracy. Your time is up. I want to get clarified one thing. February 19th is that Presidents Day, do we have the right date on? Is that the Monday or the two Presidents Day?'",
        "'speaker_5': 'That's why I put the 19th, because that is a Tuesday.'",
        "'speaker_2': 'Okay. So it says Monday. It is February 19th. Is the correct. Correct. To clarify. So there's movement to February. Seeing no other comments. Madam Secretary, roll call on the delay on the floor.'",
        "'speaker_1': 'Black. No. BROOKS.'",
        "'speaker_4': 'No.'",
        "'speaker_1': 'Espinosa Oh.'",
        "'speaker_2': 'Flynn No.'",
        "'speaker_1': 'Gilmore No. Herndon. Cashman. Kenny. Lopez. I knew Ortega. I. Susman. No, Mr. President.'",
        "'speaker_2': 'No. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_4': 'Before.'",
        "'speaker_5': 'Harry, my mind didn't have nine.'",
        "'speaker_1': 'I'm sorry. Three eyes. Nine knees.'",
        "'speaker_2': 'Three eyes. Nine days. That postponement has failed. Now, Councilman Ortega.'",
        "'speaker_5': 'You should have been four eyes. I mean, four nays.'",
        "'speaker_2': 'Nine and three gets us to 12, which is how many we have without councilman heard it. And so either somebody pressed the wrong button. We can. For Madam Secretary, can you bring that vote back up and can we just double check?'",
        "'speaker_2': 'Somebody might have pressed the wrong button so that it's eight four does not change the result of the vote. But let's make sure that we get it right for the minute. Council President. I think I'm the one that actually pushed this.'",
        "'speaker_2': 'Okay. All right. So, Madam Secretary, we will fix Councilman Lopez to clarify. Your vote was no, but you pressed. Yes, yes. We'll get that fixed. Does not change the the results, but we'll make sure and Councilman Flynn, we'll make sure that we get the minutes correct for next week.'",
        "'speaker_4': 'All right.'",
        "'speaker_2': 'And Councilman Ortega, you also had a motion to postpone a companion bill of 975 sitting that the first postponement did not pass. Are you still moving to postpone?'",
        "'speaker_5': 'That was an entirely different bill. That is not should not be intertwined.'",
        "'speaker_1': 'Oh, I oppose it.'",
        "'speaker_5': 'There is no need to even have a vote on that.'",
        "'speaker_2': 'We did. We did. Is that the one that we pushed consideration? We delayed consideration. Okay. So we do need to vote on it. That's right. So, Madam Secretary, could you please put 975 up on our screens to vote on when I pushed?'",
        "'speaker_1': 'Oh.'",
        "'speaker_5': 'It will be two.'",
        "'speaker_2': 'So this was the one that we postponed prior due to council 975 yup.'",
        "'speaker_1': 'Okay. Thank you. President Clerk I am.'",
        "'speaker_2': 'Yeah. So, Councilwoman Gilmore, can you please just put Bill 975 on the floor?'",
        "'speaker_1': 'Yes, President Clerk I put council bill 975 on the floor right there.'",
        "'speaker_2': 'Is there any discussion on this one?'",
        "'speaker_6': 'Councilwoman Cannick Yes, thank you, Mr. President. Just for transparency, this bill is about making some amendments to the inclusionary housing ordinance and other covenants that some of the for sale homes are under. In order to create more opportunities for to try to.'",
        "'speaker_1': 'Cure.'",
        "'speaker_6': 'Some of the noncompliance issues that were discovered at our committee meeting, we had a really robust discussion about a desire for stronger protections and new covenants going forward. And I just wanted to share from my perspective that OPD and the City Attorney's Office have been responsive to that request.'",
        "'speaker_6': 'We don't have amendments that will be moving to this bill for future covenants, but I feel pretty comfortable that we're on a good course of talking about how to not use the same covenants and the same methods again and assume that we're going to have a different result, but that in fact, we're going to use a do'",
        "'speaker_6': 'a different result. So I just wanted that to be transparent since we had such a robust conversation at committee. And I want to thank, you know, our alleged counsel in the city attorney's office, and particularly Councilwoman Gilmore, who's put a lot of time into this for their work.'",
        "'speaker_6': 'So just wanted that on the record. Thank you.'",
        "'speaker_2': 'Councilwoman Gilmore.'",
        "'speaker_1': 'Thank you. Thank you, President Clark. I want to clarify for my colleagues that we have been dealing with this issue around affordable housing compliance. I have been personally for the last two years, and I would ask that my colleagues vote down any sort of postponement of 975, because we have had homeowners, folks who have been affected by'",
        "'speaker_1': 'this affordable housing compliance issue and basically were holding.'",
        "'speaker_5': 'Their lives in limbo.'",
        "'speaker_1': 'At this point in time. And so I would ask my colleagues to vote down any sort of postponement that might be offered, because we need to really get this clarified and cleared up for these residents, these homeowners, by the end of this year or as quickly as possible.'",
        "'speaker_1': 'Thank you, President Clark.'",
        "'speaker_2': 'All right. Thank you, Councilwoman Gilmore. And I think the motion on the floor is not currently a postponement, and I don't see anybody making that motion. So we're just voting on this.'",
        "'speaker_1': 'Location.'",
        "'speaker_2': 'Whether.'",
        "'speaker_1': 'We're voting to order it published.'",
        "'speaker_2': 'Just to order. 975. Published? Correct. Yep. All right. Any other. Because this is not showing up on my screen been. Guzman-Lopez Did you have something on this one because you're still showing up on the last one. No, I was on the last one because I wanted to I.'",
        "'speaker_4': 'I did vote I on the last postponement. The other issue was, is that my.'",
        "'speaker_2': 'Colleague didn't vote yes on her own.'",
        "'speaker_3': 'So I didn't. All right.'",
        "'speaker_2': 'Okay. Well, we got it. All right. Perfect. I wanted to make sure on that record thing, nothing else on 975. Madam Secretary, roll call.'",
        "'speaker_4': 'Right? Yeah.'",
        "'speaker_2': 'This is first of all, thanks for that. This is just to order published 975. This is ordering 975.'",
        "'speaker_4': 'Published in.'",
        "'speaker_1': 'Black. All right.'",
        "'speaker_4': 'That's Brooks. Hi.'",
        "'speaker_1': 'Espinosa.'",
        "'speaker_7': 'Hi.'",
        "'speaker_3': 'Flynn. Hi.'",
        "'speaker_1': 'Gilmore. I Cashman can reach Lopez. I knew Ortega. I Susman. But, Mr. President.'",
        "'speaker_2': 'I'm secretary. Please close the voting. Announce results. Automatically since I was the one that.'",
        "'speaker_1': '11 eyes.'",
        "'speaker_2': '11 eyes count the bill. 975 has been ordered published. Seeing nothing else before us. We do have a pre adjournment announcement on Monday, October 27, 2018. Council will hold a required public hearing on Council Bill 1072, designating the Vassar School bungalows historic district as a district for preservation.'",
        "'speaker_2': 'And on Monday, November 13th, 2018, Council will hold a required public hearing on Council Bill 996, changing the zoning classification of 3742 3850 York Street in the Clayton neighborhood. A required public hearing on Council Bill 1006 changing the zoning class classification of 1901 Noisy Street in Union Station and a required hearing on Council Bill 1013 Changing the'",
        "'speaker_2': 'Zoning Classification for 2929 West 10th Street in Sun Valley. Any protest against Council Bill 9961006 or 1013 must be filed with the council officers no later than Monday, November 5th. Seeing no other business before this body, this meeting is adjourned.'"
    ]
}