{
    "A resolution approving a proposed Agreement between the City and County of Denver and ISS Facility Services, Inc. concerning janitorial cleaning services at Denver International Airport. Approves a three-year contract with ISS Facility Services, Inc. in the amount of $114,883,000 for janitorial cleaning services at the main terminal, concourses, airport office building, and other areas as well as snow removal services to pedestrian sidewalks and parking structures at Denver International Airport (201732928).  Pursuant to Council Rule 3.7, Councilman Flynn called out this resolution at the Monday, February 12, 2018, Council meeting for a postponement to the next regularly scheduled meeting of Tuesday, February 20, 2018.  The last regularly scheduled Council meeting within the 30-day review period is on 3-5-18.  The Committee approved filing this resolution at its meeting on 1-31-18.": [
        "'speaker_0': 'Council has reconvened before we open the public hearing. Council will need to vote on the adoption of Council Resolution 77 pertaining to the Denver International Airport Janitorial Services contract. Dr. Sussman, will you put the resolution on the floor, please?'",
        "'speaker_0': 'Yes. As you hustle over.'",
        "'speaker_1': 'I move that resolution one one, one be adopted now. Seven, 7777274.'",
        "'speaker_0': '77, 77. Okay. Okay. It has been moved and seconded questions by members of Council. Council members. The Council Roll Call. Oh.'",
        "'speaker_9': 'I was just going to explain that I was going to abstain from this vote, mostly because of the comments that came up in public comment was new information to me. Thank you.'",
        "'speaker_0': 'Okay, great. All right. Madam Secretary, roll call.'",
        "'speaker_2': 'Clark.'",
        "'speaker_4': 'I.'",
        "'speaker_9': 'Espinosa abstained.'",
        "'speaker_2': 'Flynn is not. Sorry. I'm seen who's not here. Herndon.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_4': 'Hi.'",
        "'speaker_2': 'New. Ortega.'",
        "'speaker_4': 'I wasn't.'",
        "'speaker_2': 'Sussman.'",
        "'speaker_1': 'All right.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_4': '77.'",
        "'speaker_8': 'Thank you, Mr. President. This is what we are. Was this was this not in the black vote seven?'",
        "'speaker_0': 'It was not in the black vote we're correcting right now.'",
        "'speaker_8': 'Oh, I'm sorry, I gillmor.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Just making sure everyone.'",
        "'speaker_0': 'Teaches everybody to be in their seats when you're told. All right. We got a late night. What else? Who are we missing?'",
        "'speaker_2': 'I think I see. Okay. I think we're good. So. One abstention.'",
        "'speaker_0': 'I didn't say it, but I did. We get everybody on the floor. Okay.'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'All right. Eight I's, one abstentions. 77 has been adopted. Okay. We have one public hearing this evening. Speakers should begin their remarks by telling the council their names and cities of residents if they feel comfortable doing so. Their Home Address.'"
    ],
    "A resolution approving a proposed five-year comprehensive housing plan for the City and County of Denver. Approves the Citys five-year comprehensive housing plan as required in Chapter 27, Article V of the Denver Revised Municipal Code.  The Committee approved filing this resolution at its meeting on 1-31-18.": [
        "'speaker_0': 'If you're here to answer questions only when your name is called, come to the podium. I can state your name. And that note that you are available for questions from the council speakers will have 3 minutes. There is no yielding of time because this is a courtesy public hearing.'",
        "'speaker_0': 'The presentation monitor on the wall you'll see your time countdowns. Speakers will stay on the topic of the hearing and direct their comments to members of council as a whole. Please refrain from profane, obscene speech. Direct your. I already said that.'",
        "'speaker_0': 'Okay. No personal attacks. Councilman Sussman. Dr. Sussman, please put Council Resolution 111 on the floor.'",
        "'speaker_1': 'Thank you. Mr. President, I move that council resolution 111 be adopted.'",
        "'speaker_0': 'It has been moved. And second it the public hearing for council resolution 111 is open. We have the staff report. Laura brzezinski, hello. Hello. Welcome back.'",
        "'speaker_10': 'Thank you. Thank you. Members of council for having me. I'm Laura brzezinski with the Office of Economic Development in our Housing Division. I'm just going to provide a brief overview of the staff report here. I know this is a topic that we've talked extensively about over the last several months, so I will try to keep this brief'",
        "'speaker_10': '. But first, I want to acknowledge many of the folks in this room and those who might be watching for the hard work and hours that they've put into this process over almost a year at this point. I want to acknowledge enterprise community partners, the Corporation for Supportive Housing and Community Strategies Institute that served as the consultants on'",
        "'speaker_10': 'this plan, collecting data and overseeing plan development. I want to thank our Housing Advisory Committee, who put in a number of hours over many months on this. I want to thank members of the public and council members who have also spent time providing feedback on the proposal you hear you see tonight, as well as reviewing the document'",
        "'speaker_10': 'itself. So thank you. We are excited to bring forward this plan for council approval. This is really the first housing plan that the city has had that addresses housing needs across the entire spectrum, from homelessness to rental housing to workforce and affordable homeownership.'",
        "'speaker_10': 'So with that, I am pleased to bring forward this presentation on the purpose of the comprehensive housing plan, which you can see is in section 27 164 of the municipal code. The purpose of the plan is to guide investments of city housing expenditures by the Office of Economic Development in the Housing Development, Preservation and Programs.'",
        "'speaker_10': 'There's a few outlines required elements of that plan, including an overview of housing resources, setting measurable goals for the investment of Housing Resources by Amy. Category Goals for unit development, preservation and programmatic investments, including a mix of for sale and rental units.'",
        "'speaker_10': 'Systems to track areas of the city that are vulnerable to gentrification and displacement and stabilize residents in those areas who might be at risk of displacement. And then to recommend key actions and strategies to address the need for supportive services, land acquisition and mixed income development.'",
        "'speaker_10': 'There was significant outreach conducted, as I mentioned, as part of this process, including surveys during planned development and during the public comment period where the plan was open for review in 2017 with more than 1200 responses. Both of those were conducted in English as well as in Spanish.'",
        "'speaker_10': 'We held five public meetings in 2017 with more than 250 attendees. Those were meetings distributed across the city. We held focus groups with experts from homelessness, rental and homeownership areas to inform our recommendations along the housing spectrum. We had a number of different council meetings, including a full working session in the summer of 2017 for presentations to'",
        "'speaker_10': 'the Safety Committee and individual meetings with many of you. So thank you for your time invested in each of those. We also had a number of presentations and meetings with specific stakeholder organizations, as well as monthly meetings with our Housing Advisory Committee in addition to open office hours.'",
        "'speaker_10': 'Feedback collected during the plan development helped to refine our policy and investment strategies that you will see tonight, including the prioritization of resources along the housing continuum. I know the next two slides are information that's familiar to council members, but just for a brief overview, the plan contains four fundamental values.'",
        "'speaker_10': 'Leveraging and enhancing our housing investments to support the creation of inclusive communities throughout Denver. Identifying ways to support communities of opportunity. Recognizing that certainly housing is an important component to wealth building, but also transportation access, economic mobility through job creation, education and health care.'",
        "'speaker_10': 'Other component important elements of building communities of opportunity as well viewing housing as a continuum that serves residents across a range of needs and incomes, and then certainly embracing neighborhood diversity. To accomplish those fundamental values. The plan outlines four key goals creating affordability in vulnerable areas as well as in areas of opportunity, preserving affordability and housing quality'",
        "'speaker_10': ', promoting equitable and accessible housing options, and then stabilizing residents at risk of involuntary displacement. The plan also contains a recommendation for the investment of resources from the Office of Economic Development. Along the income continuum, 40 to 50% of our resources will be invested to serve residents earning below 30% of the area.'",
        "'speaker_10': 'Median income. That's about $17,000 for an individual and those who are experiencing homelessness. You can see the breakdowns 20 to 25% for residents experiencing homelessness and 20 to 25% for residents earning below 30% AMI underneath that broader category.'",
        "'speaker_10': 'In addition to those resources, 20 to 30% of our housing investments will serve a slightly higher income population on the rental housing side through development, preservation and programs for those earning 31 to 80% AMI and then 20 to 30% of our housing resources invested to serve residents who either are homeowners and want to stay in the homes'",
        "'speaker_10': 'they already own or who are seeking to become homeowners. There are a number of different goals outlined in this plan. Housing an Inclusive Denver. We are aiming to create or preserve approximately 3000 units over the next five years and serve 30,000 households through our programmatic investments to stabilize residents at risk of displacement and helping those who are'",
        "'speaker_10': 'seeking to obtain housing access new housing opportunities. Part of the reason why these numbers are informed the way that they are is that you can see from the last slide that we have a target of serving a majority of our resources to the lowest income populations.'",
        "'speaker_10': 'Serving those populations requires typically a higher per unit investment. So that is accounted for as part of these projections compared to higher army units, especially on the rental side. We have made some updates to the plan that's submitted for your approval tonight, including some feedback from our meeting with the safety committee just a couple of weeks ago'",
        "'speaker_10': ', including a couple of changes to recognize the nexus between jobs and housing and the relationship between public and private investment, rising housing costs, and what impact that has on residents who are at risk of displacement. We have also added some other items through the plan updates over the last several weeks, including a more specific timeline and evaluation'",
        "'speaker_10': 'criteria for exploring additional housing resources more effectively. Coordinating our language in this plan with the language in the gentrification and displacement study that was released in 2016 by the Office of Economic Development, focusing on long term affordability in our housing investments, strengthening the language around comprehensive, comprehensive eviction assistance in the plan.'",
        "'speaker_10': 'Updating some of our language to explore community land trust with diverse input in a variety of factors in terms of our evaluation and then some overall updates to the plan structure to make it easier to navigate. We certainly recognize that we have a lot of next steps as part of the implementation of this plan, including finalizing some'",
        "'speaker_10': 'of our 2018 action planning with input from our housing advisory committee and certainly input that we received from the safety committee that met at the end of January. We are also looking at how to best support our Housing Advisory Committee in refining the role and structure, including the work plan for 2018 and the ongoing reporting of investments'",
        "'speaker_10': 'and outcomes. We are also working internally to OED with input from our advisory committee and other stakeholders to update our financial products to better align with the priorities you see here to serve the lowest income populations with our investments into development, preservation and programs, and then in integrating the plan priorities here into how we evaluate new opportunities'",
        "'speaker_10': 'for investments. Certainly, we are also working to further coordinate our housing and affordability investments defined as some of the other investments that we have in the city along this spectrum, in agencies such as the Department of Human Services, Denver's Road Home and some other rental assistance and supportive housing investments the city makes that are outside of OED'",
        "'speaker_10': '. We are also working to provide clarity on the front door for new housing programs. We have a lot of really good ideas that are coming to us in the city for opportunities that align with this housing plan. So we're working on clarifying how new programs can come into the pipeline and how we can foster those.'",
        "'speaker_10': 'So with that, staff recommends City Council approval of 18 zero zero or 0111 to adopt housing an inclusive Denver.'",
        "'speaker_0': 'All right. Thank you. We have. Ten speakers this evening. I'm going to call you all up to the front row in multiples of five. All right, Helen Taylor, Tim Kraft, Jonathan Capella, Capelli, Emily Bustos and Aaron Meeropol. Helen Taylor, you are first.'",
        "'speaker_1': 'Hi, I'm Helen.'",
        "'speaker_6': 'Taylor at Northeast Denver Housing Center 1735 Gaylord.'",
        "'speaker_4': 'Street, Denver.'",
        "'speaker_1': 'I'm speaking on behalf.'",
        "'speaker_6': 'Of Northeast Denver.'",
        "'speaker_4': 'Housing Center and Del Norte Development Corporation and in support of the True Tour program, which is known as a temporary rental and utility assistance.'",
        "'speaker_6': 'Program. In the short time of.'",
        "'speaker_4': 'Four months, the program has helped over 440 households facing eviction.'",
        "'speaker_6': 'Or the loss of their home and at risk of becoming.'",
        "'speaker_4': 'Homeless. We have assisted 91 people with disabilities.'",
        "'speaker_6': '45 seniors over the age.'",
        "'speaker_4': 'Of 60.'",
        "'speaker_1': 'To 325.'",
        "'speaker_6': 'Female head of households.'",
        "'speaker_4': 'The households are experiencing job losses, medical hardship and decrease in household income. Without true, and most of these families would be facing eviction. Our processes.'",
        "'speaker_6': 'Continue to.'",
        "'speaker_4': 'Improve to provide service in an efficient and timely manner. We have also assisted 62 families with utility assistance. The Comprehensive.'",
        "'speaker_6': 'Housing Plan for Denver will need to.'",
        "'speaker_4': 'Balance its approach and expenditures by making sure that most at risk and vulnerable are protected. The continued.'",
        "'speaker_6': 'Demand for housing and associated.'",
        "'speaker_4': 'Increase in rent will challenge low to.'",
        "'speaker_6': 'Moderate income households.'",
        "'speaker_4': 'The adage.'",
        "'speaker_6': 'Of one paycheck.'",
        "'speaker_4': 'Away from crisis is truly happening.'",
        "'speaker_6': 'In Denver today. We are seeing household.'",
        "'speaker_4': 'With certain medical expenses, auto repairs, reduction.'",
        "'speaker_1': 'Of income.'",
        "'speaker_9': 'Being giving.'",
        "'speaker_4': 'Eviction notices within five days and escalating late.'",
        "'speaker_6': 'Fees.'",
        "'speaker_4': 'The true program is critically.'",
        "'speaker_6': 'Needed to help families that need the.'",
        "'speaker_4': 'Space and time to manage and overcome short term challenges on behalf of the residents and community we serve. We encourage the city council to continue this program. Thank you.'",
        "'speaker_0': 'Thank you, Ms.. Taylor. Tim Craft.'",
        "'speaker_5': 'Good evening. Thank you for the opportunity. Tim Craft, 2500 Cherry Creek Drive South in Denver. Also a Denver based small business owner represented of the Home Builders Association of Metro Denver, as well as a real estate developer generally in favor of the bill.'",
        "'speaker_5': 'However, I would like to express a couple of concerns. First, I think many of the estimates in it are actually a little bit low. I think the demand on Denver proper is going to be even greater in terms of affordable and attainable housing than is what I identified in the report as growing anti-growth sentiment develops and in'",
        "'speaker_5': 'some of the suburban areas and neighboring municipalities. We do anticipate additional demand for tenable housing in Denver proper. Would also caution about the the impact of both additional impact fees as well as mills. Ultimately, in the research that we've done, it typically leads to a greater disparity, a greater gap between what's called in the report affordable and'",
        "'speaker_5': 'attainable housing. Simply put, it's hard to make something more affordable by making it more expensive. Then, beyond that, the council to consider potentially delaying fees, not necessarily the affordable fees, but fees across the board that will ultimately help make some of the larger products that can actually move and make a bigger impact on Attainability until later in'",
        "'speaker_5': 'the process. So to give an example, say a 300 unit, either apartment building or condominium building. For every dollar that's imposed upfront at the time of building permit, typically after the cost of capital equates to roughly $2 by the time of build out.'",
        "'speaker_5': 'And then, of course, that's passed along to the either the renter or the home buyer. Thank you very much for the time.'",
        "'speaker_0': 'Thank you, Mr. Kraft. Jonathan Capelli.'",
        "'speaker_3': 'Thank you for letting me speak my name Jonathan Peli. I'm a Denver resident and the director of the Neighborhood Development Collaborative, which is a coalition of 13 housing development nonprofits based in metro Denver. And our list them all really quick.'",
        "'speaker_3': 'Northeast Denver Housing Center del Norte New said Habitat for Humanity of Metro Denver. Denver Urban Renewal Authority, Urban Land Conservancy Archway. Rocky Mountain Communities Cowal Community Resources or Community Resource and Housing Investment Corporation Coalition for the Homeless and Colorado Housing Assistance Corp. and the Condo Committee Land Trust.'",
        "'speaker_3': 'Okay, so together, since 2009, we have created over 4600 affordable homes in Denver and also helped an additional 4000 families through housing cost assistance, downpayment assistance, rehabilitation, foreclosure prevention and have also helped 35,000 residents through housing counseling. So in short, we are the organizations that are going to be delivering on a large portion of the goals that'",
        "'speaker_3': 'are outlined in the plan. So what do we think about the plan? Well, through the work of a lot of our members on the hack, as well as individual meetings that I've already had with many of you on the council, you've heard that we still strongly feel that the city needs to work on creating ambitious goals that'",
        "'speaker_3': 'are targeted to alleviating the housing crisis by reducing the percentage of housing cost burden households in Denver. And then also by raising enough dollars to fund those goals once we create them. We've also voiced the need for Denver to work to partner more closely with nonprofit housing developers that will be developing the services or providing the services'",
        "'speaker_3': 'that are outlined in the plan. And also, we hope that in the future the city will rely on the hack to a greater degree to create and improve housing policy. However, insofar as this document is a road map for spending $150 million, the first half of $150 million fund, we actually think it's a great plan.'",
        "'speaker_3': 'Over its 100 plus pages. There's a ton of really great housing policies and programs that if we actually move on them and implement them, we think will really help us and other organizations that work in the housing realm to do their work.'",
        "'speaker_3': 'We think the Division of Housing Product types and by EMI was also well done, even though that's usually a really difficult decision. And we're also pleased that the plan includes language just to explore new sources of housing funding.'",
        "'speaker_3': 'So given all the, you know, issues with increasing land values and rent prices and everything, rent costs, everything is going on the city. We're really, really glad that the city council worked the comprehensive housing plan into the housing fund that got passed last year, and that you're considering it right now.'",
        "'speaker_3': 'And we look forward to working with you to deliver on the plan and also to, you know, bring more funding and work to increase the scope of the goals in the future, but approve of this plan. So thank you.'",
        "'speaker_0': 'Right on time. Thank you. Mr. Capelli. Emily Bustos.'",
        "'speaker_1': 'Good evening. My name is Emily Bustos. I'm executive director of Denver's Early Childhood Council. I'm also a Denver resident. I'm here tonight representing the early childhood education community who advocates and represents a wide range of Denver's population. We often act as the voice for educators, parents and their children here in Denver.'",
        "'speaker_1': 'And as you know, as of 2017, more than 33,000 children in Denver are living in poverty. If this remains the status quo, 40% of low income students will not graduate high school. And half of Colorado families will not earn high enough wages to sustain their families.'",
        "'speaker_1': 'With that being said, we would like to echo the sentiments made in our last public letter from September of 2016. A city that allows its affordable housing supply to dwindle also weakens its schools, as affordable housing is the backbone to true affordability and access and creating a thriving, family friendly city.'",
        "'speaker_1': 'We think this is very important. We applaud Denver City Council as on passing our city's first local affordable housing fund. And we believe that the city is taking significant steps in the right direction to address the widespread, widespread displacement of longstanding Denver residents.'",
        "'speaker_1': 'We recognize the impact of 150 million affordable housing fund, but our excitement comes with a dose of apprehension. It has come to our attention that there is no mention of permanent, affordable housing anywhere in the city's initial recommendations, which we believe that affordable, permanent affordability is critical to the long term success of our families and children here'",
        "'speaker_1': 'in Denver. Today, our city is facing a shortage of affordable housing options. And according to the latest report published by Shift Research Lab, the crisis is largely a supply issue. This report exploring Colorado's affordable housing affordability challenges and all of their complexity states that households under $50,000 a year spend more than 35% of their income on housing'",
        "'speaker_1': 'alone. These households are the families we serve, as well as the teachers that educate our children here in Denver. How can we move forward with a clear conscience, knowing full well that many of our students are on a path on the precipice of leaving our school systems due to lack of affordability?'",
        "'speaker_1': 'In 2006, Denver voters approved a 2.12% sales tax, which created the Denver Preschool Program, an organization that makes preschool possible for all Denver families. In 2014, Denver voters reauthorized the tax, this time increasing funding 2.15% since its inception and through the close of 20 1617.'",
        "'speaker_1': 'That program has served and provided nearly 93 million intuition support to close to 46,000 children. Over the last 30 years, there's been a growing demand for early care and education services here in Denver for families of all socioeconomic backgrounds.'",
        "'speaker_1': 'The field of B.C. has faced significant challenges in attracting and maintaining the skilled, diverse and stable workforce that's needed to nurture our youngest children. Thank you for your time. We we're more than happy to answer any questions to provide additional resources.'",
        "'speaker_0': 'Thank you, Mr. Bustos. Erin Murphy.'",
        "'speaker_7': 'Good evening. My name is Aaron Mariupol, a little bit 38. 39 was 29th Avenue, Denver resident. And I'm also the president of the Urban Land Conservancy. First thing I wanted to tell you is thank you. What you have done.'",
        "'speaker_7': 'The step forward and passing 6 to 5 in September of 2016. Moving forward with a plan, a housing plan. A five year plan. Is something that's been long needed. And I know it wasn't easy, but it was something you guys took the bold step forward on.'",
        "'speaker_7': 'And we really want to share with you how much we respect that. It wasn't easy, as I said. I've been working in affordable housing now for over 30 years. I started in this work as a tenant organizer, worked on national housing policy issues, as well as local housing issues.'",
        "'speaker_7': 'And I will tell you, you have made a huge step forward as a community. And it bottom line, it's about our community, our people that we serve. You will see has invested over $60 million here in Denver. That's leveraged another 300 plus million in redevelopment.'",
        "'speaker_7': 'It's a range of affordable housing, nonprofit facilities, schools. We serve over 1000 people a year. Despite the work that we've done, what we're seeing and you going to be hearing, obviously, is that the affordable housing issue has only gotten worse.'",
        "'speaker_7': 'And so how do we get forward and how do we address this? You've done it with the fund, a plan. And then I would add, the piece that I think is really critical that you do need to consider is having permit affordability in this housing plan.'",
        "'speaker_7': 'Currently, it does not state it and it needs to be in. And when I talk about permanent affordable housing, we're talking about multiple generations. We're not talking about a one off. So we know that there are examples today in Denver where there's a 15 year deed restriction and it's burning off and it's going to market.'",
        "'speaker_7': 'We cannot allow that to happen going forward. We need to be the stewards as a community of the investments that we're making going forward in affordable housing for the long term. So you've gotten letters from us in the past.'",
        "'speaker_7': 'I think you know that you also strongly endorses community land trust work. We do it in multifamily and in commercial real estate. We think it is an important tool. The city has certainly talked about it as part of in the housing plan.'",
        "'speaker_7': 'We think that's a great step forward. Jan reading short term deed restrictions 30 years or less should not be approved. We should be moving forward with a minimum of a 50 year covenant on affordability or using a land trust, which is actually 198 years to 99 year leases.'",
        "'speaker_7': 'We're on the ground. We understand what the true cost of affordable housing development is, and we really, really, really ask for you to think about this permanent, affordable housing as a component of the housing plan. We really think it's important.'",
        "'speaker_7': 'At the end of the day, as I said, it's about the people. We have far too many folks in our properties that. But for us, there's not another opportunity in this community. And so we really do need to think about a permanent solution.'",
        "'speaker_7': 'Mr. Tanner, thank you very much for your time.'",
        "'speaker_0': 'Thank you. Thank you for your comments. All right. I'm going to call the next five up. Andrew Romero, T.A. Peterson, Brad SIEGEL, Will. Crawl. Crawl. Wilk, Richie, Rene Martinez Stone. Sorry about that. Well, okay. Uh, Mr. Romero, you up first.'",
        "'speaker_4': 'Amanda Romero.'",
        "'speaker_9': 'Resident in Jefferson Park neighborhood. I am here representing the Colorado Latino Forum. I'm on the board of the Colorado Latino Forum. We at the Latino Forum are concerned, of course, like everybody else, about the significant issues that we face with displacement, housing costs and the lack of high income jobs that can support those high housing units.'",
        "'speaker_9': 'Overall, our housing budget and the city of Denver is approximately $2,022 million a year. When we compare ourselves to a comparable city, Seattle, which has 700,000 people as well, their budget is over $100 million a year. So that's five times our budget.'",
        "'speaker_9': 'And so we know we can do more because we see other cities doing more. They're doing it through a variety of mechanisms. They're using mills. They're bonding those mills. The city budget is about $30 million of that 100 million.'",
        "'speaker_9': 'And then they have significant investments from the private sector. Paul Allen gave one project $30 million last year. Maybe we don't have somebody like Paul Allen here, but we certainly have people we think that we can partner with the private sector, corporations, foundations to do a better job on this issue.'",
        "'speaker_9': 'So we support the core goals of the plan. We support the plan. And who would not support the plan. It's got great ideas. What we think, though, is that we just don't see where the funding is to make this plan effective.'",
        "'speaker_9': 'And what we don't want to see is the plan to just sit up on the shelf. So we would very much advocate various ideas that are out there, including all in Denver, which has suggested a housing bond. They've suggested additional mills in reallocating funds from the overall city budget.'",
        "'speaker_9': 'So we would like the council and the city to look at different options for increasing funds. We we also feel very strongly that the community land trust model is something that will very significantly impact our communities in a positive way, especially broken down into the neighborhood level.'",
        "'speaker_9': 'And we encourage some of the funding to go toward those efforts. Kdka's and nonprofit groups are some of the best organizations in our town and being able to allocate and get administer funds and get them out to the community.'",
        "'speaker_9': 'So we'd like to see more language around that in this plan. In closing, the plan isn't perfect, but it's a step in the right direction and obviously has. I think it could. We think it can use more details in some of the implementation.'",
        "'speaker_9': 'And tomorrow, more funds.'",
        "'speaker_0': 'Thank you. Your time is up. Thank you. Thank you. Deanna Patterson.'",
        "'speaker_1': 'Good evening. My name is Tiana Patterson. I'm a resident of Denver, and I'm the state and local policy director for Enterprise Community Partners. I'm here to speak my support of approval of y'all approving this plan. Sorry. My Southern ness just came out.'",
        "'speaker_1': 'I had the distinct pleasure of serving as an on the ground liaison for Enterprise Advisors as they worked with the city on crafting this housing plan. Although I was not directly involved in writing this housing plan, I did work with the advisors by providing them with context on Denver.'",
        "'speaker_1': 'And I want to commend the city for listening to the needs of the community and experts in the housing field by incorporating and addressing the issues so robustly in the housing plan. For instance, the recommendation to leverage publicly owned land for affordable housing development.'",
        "'speaker_1': 'As many of us know, acquisition of land has been and continues to be one of the biggest barriers to producing more affordable housing. And we believe this is a great first step towards addressing and overcoming this issue. I have been personally impressed by the robust engagement with the public and the end of the community.'",
        "'speaker_1': 'Concerns have also been reflected in this housing plan. Specifically, the recommendations on enhancing renter protections and the creation of a community land trust were both spoken about passionately by community members at Housing Advisory Committee meetings and other public comment opportunities.'",
        "'speaker_1': 'Community members have been grappling with gentrification and displacement, and these two initiatives show that the city has listened and wants to work to keep people in place, stabilize communities and address the concerns over the community. I believe that this plan is a great first step in making Denver a more inclusive and accessible and robust community for all'",
        "'speaker_1': '. And I hope that your support support moving this plan forward. Thank you.'",
        "'speaker_0': 'Thank you, Ms.. Patterson. Brett SIEGEL.'",
        "'speaker_4': 'Good evening. My name is Brad SIEGEL. I'm a Denver native.'",
        "'speaker_3': 'I'm a Congress Park resident in beautiful District ten. And tonight I am speaking as a co-founder of All in Denver. All in Denver is a nonprofit advocacy organization, and we believe an equitable city is where all people have the opportunity to to prosper and thrive.'",
        "'speaker_3': 'Regarding the housing plan, we support the housing plan. We've monitored the progress of it and commend not only the city, but all the volunteers who've been involved in putting it together. We have actually from last from the fall of 2016 when the dedicated fund was formed.'",
        "'speaker_3': 'However, we have been advocating for more funding. So tonight I'm here to simply reiterate a position paper that we sent to council back in December that provides a roadmap on how an additional $150 million surge could be directed toward housing within the next 3 to 5 years.'",
        "'speaker_3': 'The good news is we already have a dedicated fund which over ten years potentially has $150 million. The four ways to accelerate that, number one, is to look at next year's budget and general fund.'",
        "'speaker_4': 'What a great way to.'",
        "'speaker_3': 'Launch the housing plan and double down on the 15 million that's expected for next year. So we're proposing that the administration and council consider another $15 million allocation from the general fund in 2019.'",
        "'speaker_4': 'Secondly, we're recommending that the council.'",
        "'speaker_3': 'Remove the sunset that was originally placed within the dedicated fund. If you'll recall, there was a ten year sunset that's now at nine years.'",
        "'speaker_4': 'We feel that handicaps the utility.'",
        "'speaker_3': 'Of the fund. We feel it's shortsighted. And we understand that council action could reverse that, could eliminate that sunset attack. Perhaps if we feel bold and inspired, we could.'",
        "'speaker_4': 'Consider that this evening. Third item on our list.'",
        "'speaker_3': 'Was to add an additional half mile under the De Bruce, saying that the city participated in a couple of years ago. There's the ability to.'",
        "'speaker_4': 'Actually add additional.'",
        "'speaker_3': 'Funds.'",
        "'speaker_4': 'Through Mill Levy. And then our fourth.'",
        "'speaker_3': 'And final idea, which we talked about back in September of 16, is the notion of taking this to the voters. We do feel it's a number one priority for the city.'",
        "'speaker_4': 'And whether it's a property.'",
        "'speaker_3': 'Tax, a sales tax or another mechanism bond the funds. So we accelerate the funding and get the dollars in today. The following speaker.'",
        "'speaker_4': 'Will karlovic.'",
        "'speaker_3': 'Will talk about the bonding in further detail. But we feel it's even more important a recommendation today with reckless economic policy in Washington.'",
        "'speaker_4': 'There could be more inflation.'",
        "'speaker_3': 'Over the next several years, which could diminish the value of the existing fund.'",
        "'speaker_4': 'And then lastly, when we brought this.'",
        "'speaker_3': 'To you in 2016, this was a fairly novel idea. Since then, more than three dozen jurisdictions have issued housing bonds throughout the West and throughout the country. So, again, thank you. We support the plan and we hope this is a springboard into looking at more funding.'",
        "'speaker_0': 'Thank you, Mr. Segal. Well, Brockovich. Sorry about that.'",
        "'speaker_9': 'No good jack name. My name is Will Karlovic. I'm a proud 15 year resident of Denver at 2828 Zuni Street. I'm speaking here today as a board member of All in Denver. And I want to supplement what Brad SIEGEL has just spoken about.'",
        "'speaker_9': 'In particular. I'm here to introduce a new concept for your consideration that here now has not been part of the conversation, and that is the concept of time, value of money. I urge you to listen up. The next 90 seconds is your MBA in finance and corporate finance.'",
        "'speaker_9': 'Analyzing time value of money is a correct way to compare to competing investment options. Because of inflation, a dollar, six years, seven years, eight years from today is not going to be worth the dollar that it is today.'",
        "'speaker_9': 'Likewise, when we talk about 15 million available in each of the ten years of the dedicated fund adding up to $150 million in present value terms. That's actually a fallacy depending on what interest rate is used. That $150 million in today's dollars actually equates to only about 115 million to 120 million.'",
        "'speaker_9': 'All in Denver has done a present value analysis comparing the dedicated fund pay as you go option against a housing bond option. And again, depending what interest rate is or inflation rate is used in present value terms, they actually come out to be about equal, however.'",
        "'speaker_9': 'There's a couple of considerations that if construction prices continue to rise and property values continue to rise, which there's no reason not to expect, those then future dollars will have less value than today. And as Brad said, if the US economy is headed for higher inflationary times, which many people predict the present value buying power of the'",
        "'speaker_9': 'dedicated fund in the guise of a housing bond is going to be worth more today and be able to contribute more to addressing the affordable housing crisis we have. As one example, if a 4% inflation rate is used, a housing bond actually has a greater present value buying power today than the half mil of the dedicated fund'",
        "'speaker_9': 'in a pay as you go scenario. So simply put, when options are looked at as corporate finance, investment really should be analyzed, a housing bond has the potential of actually giving the city more bang for the buck, which therefore makes a housing bond potentially a more fiscally conservative and fiscally responsible thing for the city to do.'",
        "'speaker_9': 'And for all of you to consider. Thank you very much.'",
        "'speaker_0': 'Thank you, sir. All right. For that MBA lesson. Ms.. Renee Martinez Stone.'",
        "'speaker_11': 'Good evening. My name is Rene Martinez Stone. I'm a resident of Denver, and I speak to you tonight as the director of the West Denver Renaissance Collaborative here in Denver. The West Denver Renaissance Collaborative includes nine wonderful neighborhoods in Denver.'",
        "'speaker_11': 'It's home to many residents that have achieved the American dream of homeownership. It is also working class families whose wages are not keeping pace with housing costs, with rents, with property taxes. These neighborhoods have all been identified as vulnerable, and there are families at risk of having to lose their homes in north in west Denver.'",
        "'speaker_11': 'This has been a priority for the neighborhoods, and as such, we've created an initiative called the West Denver Single Family Plus Program. This solution provides homeowner education, connects them to key partners providing repairs, and creates a pathway for accessory dwelling unit development for low and middle income families.'",
        "'speaker_11': 'This is important because it stabilizes Residents Creek's equitable access to a development tool that's been tried and true for hundreds of years and creates affordable rental units within neighborhoods controlled by homeowners and benefiting homeowners in the city. I want to thank you tonight and staff as well for the work on this plan and express my support for'",
        "'speaker_11': 'this work and this plan. Two areas specifically that I will call attention to are the emphasis on raising more funds and needing to do as much as possible, and specifically benefiting projects that leverage money or bring more money to the table.'",
        "'speaker_11': 'Really rewarding and standing by those projects. Next I'd like to to express my support for. The how the plan speaks to accessory dwelling units. I believe that it does this in the right way because it calls for 80 used to be a tool for affordability and to stabilize residents who are at risk of displacement if it is'",
        "'speaker_11': 'worth expanding and creating policy. I need you. We have to do it in a way that creates a pathway to those residents that need this tool the most. The plan also calls for use as wealth building tools for low and middle income homeowners.'",
        "'speaker_11': 'This is innovative. This is not this is being pursued in many other cities across the country. No one is doing it yet. It is worthwhile. And this is a very progressive call. It's not going to be easy at all, though.'",
        "'speaker_11': 'It's very difficult in building the ADU program that will be rolling out this year in West Denver. There are many facets to it and there are policy facets to it. There are also the risk of unintended consequences. The plan calls for Blueprint.'",
        "'speaker_11': 'Denver laying the groundwork for this. We cannot just blanket the city with additional adu zoning everywhere without including restrictions, priorities or incentives. We could create a backlash where neighborhoods do not and want to resist.'",
        "'speaker_0': 'It's this in stone. Our time's up. Thank you. Thank you. All right. Want to thank all the speakers, and that concludes all of the speakers. We are now ready for questions by members of Council Councilman Espinosa, Europe.'",
        "'speaker_9': 'Question for Tim Kraft. For? Well, he's walking up. I just want to say here here to what you're asking of blueprint Denver on the use that's important sort of guardrails to making sure that they're angled at mean they're for affordable housing not just sort of.'",
        "'speaker_0': 'Question question.'",
        "'speaker_9': 'The question he walked up here to fast so I am glad that you mentioned for the first time something that I've been trying to sort of get us to sort of grapple with, which is that cost of the dollar at start versus at the end.'",
        "'speaker_9': 'So do you think what do you think the consequences. So right now our linkage fee is fairly meager, is as onerous as some people might think it is. It's it's fairly meager. What do you think the outcomes would be if we were to save that value and allow the developer to pay for that later on?'",
        "'speaker_9': 'I mean, because that implies that they're paying for it rather than providing units. So why would we do that?'",
        "'speaker_5': 'So the delay would ultimately get passed along to either the homeowner or the renter. Simply put, it's no different than the permit. Fees are very similar to foundation cost. They go in very early and then you carry that during the entire time.'",
        "'speaker_5': 'It's easy to look at, say, one specific developer, but ultimately any developer who stands before you guys isn't financing a project with their own money are very few would be, you know, to give an example of how the flow of funds would work, let's take, say, PERA.'",
        "'speaker_5': 'So the Colorado Employment Fund, the retirement fund ultimately invests in, say, a private equity group who ultimately invests in guys like us. So they give us a dollar of that dollars on typically 12 months, roughly after the process, the entitlement process has begun.'",
        "'speaker_5': 'That's when the permits fees are paid. Then there's another 12. It's 6 to 12 months until you can actually break ground, then say 2 to 5 years construction depending on the size of the project. So assuming that Pedro would like to see call it an 8% return, ultimately that means the deal needs to produce somewhere in the'",
        "'speaker_5': 'neighborhood of an 18% return. So to actually deliver that, you're looking at doubling every three and a half years. Which is why I say a dollar upfront ultimately means somewhere in the neighborhood of a buck 75 to $2 at the time of CEO.'",
        "'speaker_9': 'So do you. I wish we could play with just the hard cost of the units, but do you think you could come up with four people working on the implementation side? A scenario where if we did two things, essentially effectively do the math of what it would be to defer the fee and defer Sudeep to CEO rather'",
        "'speaker_9': 'than, you know, at the time of permitting as well that we could actually capture unit, you know, physical units, especially on private development where we then relax the HUD requirements for units, mix and sizes.'",
        "'speaker_5': 'Any deferment and fees will definitely benefit ultimately the occupant, be it an owner or a renter. As far as the other details there, I'm not sure I caught all of it. Again, a recommendation would be and it sounds that's something that almost every speaker who is up here said is that really we're in a supply problem.'",
        "'speaker_5': 'So again, from in, there is no bigger proponent for affordable or attainable housing than the HBA. It's what the group does. But to the extent it's more of a care versus the sticks are less of a penalty and more of a benefit.'",
        "'speaker_5': 'So I really stress the importance of giving density bonuses for groups that do more affordable housing and the like, reducing or releasing restrictions on, say, heights, that you can actually do more with the land and ultimately, you know, defer the cost of the actual real estate with more height.'",
        "'speaker_9': 'Great. Thank you.'",
        "'speaker_0': 'It's all right, Councilman Cashman.'",
        "'speaker_4': 'Thank you, Mr. President. Question for Laura, if I can. So Laura, in numerous places throughout the plan, it talks about the phrases if local and federal resources remain consistent with current levels, then we're going to create 3000 new units, address 30,000 households with various programs.'",
        "'speaker_4': 'There seems to be an indication that federal levels won't remain the same. There's at least some concern. I wonder if you could address that and how far along you might be in in contingency thoughts on how we would move forward.'",
        "'speaker_4': 'Because this I mean, I spent the weekend reading the whole plan and it touches everything. And so. Yeah, just the finances.'",
        "'speaker_10': 'Sure. In terms of federal funds, we will not know our 20 allocation, 2018 allocation likely for several months. There was a continuing resolution passed at the federal level. We do have some contingency funds that allow us to fund our programs until we know what our award is in 2018.'",
        "'speaker_10': 'Typically, we find that out somewhere between July and September. So we're funding programs for this year knowing that we might not find that out until a little bit later this year. So we're looking to find that out. The president's proposed budget eliminates funding for housing.'",
        "'speaker_10': 'It's a policy document, not necessarily the proposed investment, but it is an indication of what we might see at a federal level, which is a decline in resources. But at this point, we won't know our federal allocation until a little later this year.'",
        "'speaker_4': 'Thank you. The other question, just wondering when we should expect the rollout of the 2018 action plan and how will that be done? Will that come through committee? How do you anticipate that?'",
        "'speaker_10': 'Sure. We have some discussion with our housing advisory committee at the upcoming meeting in March to refine some of that planning. But I'd be happy to take back to the team their request to bring that forward to council.'",
        "'speaker_10': 'For an update on what the 2018 Action Plan looks like, I can take that back to the team.'",
        "'speaker_4': 'Okay. Thank you, Laura. Thank you, Mr. President.'",
        "'speaker_0': 'Yep. Thank you. Councilman Cashman. That's from Flynn.'",
        "'speaker_8': 'Thank you, Mr. President. Excuse me. Rene Martinez. Stone, could you come up and talk a little bit more about what you were going to say about ADOS and and and some of the nuances about them that you didn't get to finish?'",
        "'speaker_11': 'Thank you so. He launching a program that really is dependent upon native zoning, really puts you in a position to want more zoning. But one of the things that we've learned in studying cities across the country who are doing the same thing is one of the fundamental things that it does is it increases the rate of return'",
        "'speaker_11': ', typically on investment properties in vulnerable neighborhoods. And so in some cases, the unintended consequences are that you just increase the value of those properties to those who are able to access the financing to not only purchase those properties, but to build a need to you.'",
        "'speaker_11': 'So ideas have been zoned in Denver since 2010. We haven't seen a lot of aid use built. You can't really put your finger specifically on why that is. Has to do with financing, has to do with custom design, has to do with a lot of reasons.'",
        "'speaker_11': 'So it stands to reason. This isn't with a lot of in-depth study that if you expand zoning, what you're doing is expanding zoning for those who are capable of financing and building it to use. And so without a different pathway, you're not able to expand that tool to middle and low income homeowners.'",
        "'speaker_11': 'So a lot of cities are saying, you know, before you broadly increase use zoning, you may want to look at incentives or restrictions or even geographic areas of priority. You may want to look at it's tough to do, but limiting the numbers so that neighborhoods, you know, aren't fearful that they're going to get, you know, 10,000 acres'",
        "'speaker_11': 'versus the number that they typically get, which is a small amount.'",
        "'speaker_8': 'Do you have any specific suggestions for what this plan should have said regarding those restrictions?'",
        "'speaker_11': 'I like that the plan specifically calls for this tool to be to be a tool into achieving affordable units and helping men in low income. I think if if all actions follow that course, they'll be different actions than they would just to expand zoning.'",
        "'speaker_11': 'They will be about creating pathways. They will be about looking at accessing you. To use zoning means that you're doing it in geographical priority areas. You're looking at is does the owner have to live on the property or not?'",
        "'speaker_11': 'Because if they don't, that really opens the door even wider for investment. It is a tool to expand the number of units, but expanding the number of units in a city through its use has to be done thoughtfully and carefully.'",
        "'speaker_11': 'Right. Because it can be if it's done too fast. I mean, and also planning board members. So I hear the number of residents who don't want the problem of an issue. They don't. There's a number of issues that can be made of it.'",
        "'speaker_11': 'But as well, when it's framed in the right way, there are neighborhoods and we are talking to residents who like the idea of units being financed and built that they control, that aren't concentrated to create traffic issues that are housing families who are losing the rental units within the existing neighborhood.'",
        "'speaker_8': 'Was the group at all concerned with the possibility that folks could have ideas that would essentially they would use as short term rentals and not really to house people on a long term basis, that sort of thing?'",
        "'speaker_11': 'Absolutely.'",
        "'speaker_8': 'I don't know if that's something we can legislate.'",
        "'speaker_11': 'Or not, but it's certainly something we can look at for the West Denver Single Family Plus program, any program, any homeowner that develops an ATV within our program will not be allowed to short term rent their ADU.'",
        "'speaker_8': 'Okay, that's under your program.'",
        "'speaker_11': 'It is inconsistent not with the wealth building portion. Right. Of our program. It would build a lot of wealth to be able to rent at short term, but it's not consistent with the long term feasibility of promoting you to use as well as them providing an affordable long term solution within neighborhoods.'",
        "'speaker_11': 'So all of those elements of a need you all of those potential unintended, unintended consequences are really important to look out.'",
        "'speaker_8': 'Thank you. I appreciate that.'",
        "'speaker_4': 'Laura, can I ask you.'",
        "'speaker_8': 'A few things based on the email exchange that we had earlier today, map 2.5 areas vulnerable to displacement relative to neighborhood types. I was sort of scratching my head as to how DIA and Gateway are in the area of considered vulnerable to displacement for obvious reasons that it's an airport.'",
        "'speaker_8': 'But also I'm down in my district, Bear Valley, and I've I've never, never had anyone suggests to me that Bear Valley was vulnerable to displacement. So I'm wondering if you could just take a moment to explain the metrics that went in to number crunching that gave us these particular census tracts and neighborhoods that are vulnerable to displacement'",
        "'speaker_10': '. Sure. So the vulnerability index that was part of the 2016 gentrification and displacement study that we'd collected. Put together had three different factors. It looked at the percentage of residents that were renters versus owners. So if there was a higher percentage of renters in a neighborhood, that was one consideration.'",
        "'speaker_10': 'It looked at the overall income of the residents in that neighborhood. If the income was lower than the average citywide, that was one of the indicators that might make a neighborhood vulnerable. And then the final factor was the educational attainment of residents in the neighborhood.'",
        "'speaker_10': 'So it used the access data in terms of residents who have a bachelor's degree or higher. If the percentage of residents who had less than a bachelor's degree or higher, that was a third factor in the analysis in a neighborhood was identified as vulnerable.'",
        "'speaker_10': 'Is it that two out of three of those factors? Okay.'",
        "'speaker_8': 'Maybe we could sit down afterward because I'm a little stunned that Bear Valley would have would qualify under any of those. Any of those three compared to all the neighborhoods around it. But let me move on. Other neighborhoods in my district, verbally, West Harvey Park, South Fort Logan and Marston along South Wadsworth is described as a Type'",
        "'speaker_8': 'three neighborhood, which is where residents enjoy hip neighborhood restaurants and chic boutiques.'",
        "'speaker_4': 'I have an IHOP, a Taco Bell.'",
        "'speaker_8': 'Outback Steakhouse and Applebee's. I. I thought maybe you got a confused with the. I have a restaurant is very popular with seniors so I thought maybe it was hip replacement restaurants. But how did those neighborhoods end up being categorized in the same as the same type as Councilman Espinosa's hot neighborhoods in Highland and Slim Lake, Jefferson Park'",
        "'speaker_8': ', Stapleton Lowry, Cherry Creek Country Club. I'm stunned. Sure. And the reason I am just to be clear, Mr. President, reason I am is I'm concerned how these classifications will drive resources.'",
        "'speaker_3': 'Sure.'",
        "'speaker_8': 'Because being in that type may keep resources from going to those neighborhoods when in fact, maybe they ought to be going there.'",
        "'speaker_10': 'So to pieces, I will address the first piece. The neighborhood tapes were developed by Enterprise Community Partners based on almost 50 different factors. A majority of those were data points from the American Community Survey.'",
        "'speaker_8': 'And I did read through all of those in the appendix.'",
        "'speaker_10': 'I appreciate how much time council members have spent reading through the plan this week, and I want to say thank you. So there's in the appendix, there is a list of the different factors that went into those neighborhood clusters and typology analysis.'",
        "'speaker_10': 'It includes both what the the main theme is of the data as well as what the sources and the year that the data was collected most recently from. So the neighborhood clusters represent neighborhoods that scored similarly on those different factors.'",
        "'speaker_10': 'So the types were transit as well as housing, stock and availability, transportation, education, housing, stock, economic mobility like workforce and then health care were some of the themes of the different cluster analysis and the different data sources. The second piece, maybe I'll pause there.'",
        "'speaker_10': 'Does you have.'",
        "'speaker_8': 'No, no, no. What I would like to do then maybe is after, you know, in in the next week or so and see the actual number crunched up the crunched the numbers that led to this, it it's very confusing to me.'",
        "'speaker_10': 'Go ahead. I would be happy to spend more time. One of the things that we also outline in the last section of implementation, we recognized that these neighborhood typologies were developed as part of our analysis to look at what different neighborhoods of the city had, similar characteristics and those opportunity indicators.'",
        "'speaker_10': 'But we think that they need additional vetting, additional conversation. So we're proposing to look at some of the physical conditions on the ground, in addition to what we found from the neighborhood clusters, based on X data, as well as have continued conversations about what opportunity looks like for these different areas and how to focus our investments.'",
        "'speaker_10': 'So, yeah.'",
        "'speaker_8': 'I'm sorry, can you say that this categorization, this ranking or placing them in different categories will or will not drive or block resources from going to those areas?'",
        "'speaker_10': 'I think it will inform our investments, but I think there's opportunity for additional conversation about what those neighborhoods look like and what the.'",
        "'speaker_8': 'Last question is on the live Denver program. The voucher of the voucher to make up the difference between the the of the rents that a tenant might be able to pay versus what the market rate is in vacant units.'",
        "'speaker_8': 'I think the theory of the market is that if a landlord has a lot of units that are vacant, he's asking too much. And I'm concerned and I wonder what the discussion was in the group. I'm concerned that by agreeing to pay the difference between what a tenant who needs an affordable unit can pay versus what we'",
        "'speaker_8': 'will backfill. Does not provide any incentive for a landlord to lower rents that were only feeding a spiral. And I'm very concerned about that. So what is. I know that this program is not quite in place yet. And tell me what your thinking is on on that phenomenon.'",
        "'speaker_10': 'Sure. I will take a first stab at the answer to that. Certainly. Eric Sullivan, who is the director of the Office of Hope, has worked on this project for a long time and might have some additional information to provide as part of this.'",
        "'speaker_10': 'But as as part of an RFQ that we released in November of 2017, we asked interested property owners who were interested in responding to the RFQ to provide their market rent, what they were charging, as well as the concessions that they were offering, for example, two months free rent.'",
        "'speaker_10': 'And so we took in as part of the RFQ responses, both that market rent as well as the concessions. And part of the analysis that the staff in the city, as well as our partners in DOJ have been undergoing, is to look at what we're calling a reasonable market rent comparison, looking at what was provided as a'",
        "'speaker_10': 'response to the RFQ, to other properties in the area that are comparable in size and location and and type of unit to ultimately come up with a reasonable market rent for the particular units that responded to the RFQ.'",
        "'speaker_10': 'As we finalize the parameters of the program, there would be an RFP that is released to finalize what that reasonable market rent is for the particular units. But that's some of how we are determining what the reasonable rent is for the properties that responded to the RFQ for this program.'",
        "'speaker_4': 'All right. Thank you, Mr. President.'",
        "'speaker_0': 'Okay. Thank you. Councilman Flynn. Councilman Ortega. Turn your mike on speaker resolve.'",
        "'speaker_6': 'Laura, I have a few questions for you. So let me first start by just laying out a couple of things that when you come back to do the review of the one year action plan, I'd like to make sure are contained within that.'",
        "'speaker_6': 'So for example, the live program we had talked about this at the last housing meeting when the plan came through, a number of us asked to see it mapped on where these units are at by district. How many are we doing in total and where are they?'",
        "'speaker_6': 'So that's one issue. I would like you to address. What the expectation is on the existing, the existence and the ongoing role of the Housing Advisory Committee. So you can either speak to that tonight or, you know, when this comes back to us, I would think that there's been some thought put in to the role and the'",
        "'speaker_6': 'importance that the broad and diverse group of stakeholders have given to the city. And I think, you know, knowing what the city's commitment to that is is really important. I think they play a vital role in helping look at the annual priorities and making sure that we are meeting not only the spirit, but the intent of the'",
        "'speaker_6': ', you know, the five year plan in meeting those AMI thresholds. So I would like to see how. The in the one year action plan, how 20 $17 in 20 $18 are in fact meeting those RMI goals set. I would also like to know.'",
        "'speaker_6': 'On the. Renter protections, what those specifically entail. I know we had Helen Taylor talk about the program that is currently funded, the Temporary Rental Assistance and Utility Program. Are we continuing that? What are some of the others? You know, city council, for example, put funds into addressing legal issues with evictions and whatnot.'",
        "'speaker_6': 'So is this something that our housing fund is going to be providing some dollars to? So that's another one you can speak to in that when you bring that back. This one's really important, the investments that are being made.'",
        "'speaker_6': 'The plan speaks over and over to investments that the city is going to make, but it doesn't clarify the commitment to permanent affordability. So the live program, it's a temporary program. It's not creating permanent units. It's utilizing existing permanent units.'",
        "'speaker_6': 'And I don't have a problem with the concept, but where we know we need more units in this city, I don't want to see us obligate all of this money to some things where we're not able to address the creation of more affordable units in this city.'",
        "'speaker_6': 'Go on. Got a couple more here, Mr. President. Okay. If I may, I think it's important to know. Of the obligations, how much of that being committed to the various programs? How much is going to the community land trust?'",
        "'speaker_6': 'How much is going to the live program? I tried to get information on how much we've obligated to the citywide community land trust and have not been able to get that information from from anyone. So I think when that comes back to council with the one year action plan, I want to know that I would think some'",
        "'speaker_6': 'of my colleagues would want to know that as well. And, you know, somebody raised the question about, you know, do we really have a supply problem or mention that we have a supply problem? But if we have apartment buildings or, you know, apartment owners offering a couple of months free rent, that says to me that it's not'",
        "'speaker_6': 'necessarily a supply problem, it's an affordability problem. And so I think understanding that will be really important in terms of, you know. Do we need to keep building more units? Like I said before, we've never had more housing units in this city being built than we do today.'",
        "'speaker_6': 'The problem is they're at a price point that the average person cannot afford. So what are we doing to bring that price point down to address the needs and demands of people that are trying to stay in this city?'",
        "'speaker_6': 'So currently, I just.'",
        "'speaker_0': 'Want to make sure there's a question in that.'",
        "'speaker_6': 'One. Well, it's asking for that information as part of that.'",
        "'speaker_0': 'So is that is that a vacancy rate? Question is I just want to be clear.'",
        "'speaker_6': 'It's it's so so it's trying to answer the question, do we have a supply problem or do we have, you know, an affordability prognosis? You got that? Okay. Two last ones. Brad. Raised a question about the funding and I wanted to ask Brendan if you could talk about the.'",
        "'speaker_6': 'Analysis that we've done about bonding and whether or not there are other city resources programs that we're looking at to add more money. You know, this was a priority in city council's retreat. And we we all feel that pressure that families experience every day.'",
        "'speaker_6': 'And so what are those various tools that we're looking at to add more resources?'",
        "'speaker_3': 'So, Councilwoman, on your first question, we're going to be in committee on March 7th talking about the the multiyear obligation type structure that all in Denver is. That's all in Denver is proposed. Councilwoman Kennish has been very involved in that.'",
        "'speaker_3': 'We've been working through her and her office, so we'll will be in committee on that day. The second is, I think this has been a leading priority for city council over no less than five years at this point in time.'",
        "'speaker_3': 'And I think every year is a deliberative budget process. We've we've looked to add funds this past year. We worked a lot.'",
        "'speaker_9': 'On adding funds that.'",
        "'speaker_3': 'Backfilled the linkage fee when it underperformed.'",
        "'speaker_9': 'We also transacted, you'll remember, the Tsotsi settlement. We transacted dollars.'",
        "'speaker_3': 'Into that as well. So we're always kind of looking for those opportunities as they come around. And we continue to do so both during the budget process as well as when we see, you know, an opportunity like tzi come through.'",
        "'speaker_6': 'Okay. Thank you. The last one is on the ADOS. And just a question, Laura. When you all come back, I think it's important to hear what the thinking is on. ADOS be available as permanent housing. If they all are allowed to be turned into short term rental, then we are not solving our housing problem, we're just exacerbating'",
        "'speaker_6': 'it. I think we did that when we created and allowed adus. That's my personal opinion. I think that so there's somewhere in the ballpark of 3000 units that are currently not available, as you know, permanent rental housing for folks because they're utilized as short term housing.'",
        "'speaker_6': 'So I think we need to look very seriously at how we allow those ADU use to be. And again, to Renee Martinez, to Stones point, how we prioritize that. Okay. And the very last one I'm sorry, Councilwoman.'",
        "'speaker_0': 'We got a lot of folks. Okay. Thank you. Come on. Thank you. All right, Councilwoman. I mean, Councilman Neal. Sorry about that, Ken.'",
        "'speaker_5': 'Brenda, you know the question. Younger tie ins. Councilwoman Ortega's question. But I it's going to be one question, Brenda, on the when you come to committee. You know, I was very impressed with the options that Brad presented tonight.'",
        "'speaker_5': 'You know, can you do an evaluation on each one of those options to the committee to talk about the pluses and minuses of each one of those options so council can understand clearly what the city's position is on those and what your opinion is on that?'",
        "'speaker_3': 'Sure, sure. We had some PowerPoint slides from the last time we were in committee. I'll make sure that you get a copy of those two that at least outline pros and cons for each of the proposals.'",
        "'speaker_5': 'Yes, we're covering each one of the four options that he gave tonight.'",
        "'speaker_3': 'There are some additional options that are in front of us. So I have to run some additional numbers, but we'll get those to you. That'll be great.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman. Councilman Lopez.'",
        "'speaker_3': 'Thank you, Mr. President. I don't know. Who I think is Laura, if you can push the microphone. I wanted to ask a question and this is just a follow up regarding land trusts right now, there's different kind of land trusts.'",
        "'speaker_3': 'And I know folks in the community have talked a little bit about the need for community driven land trusts, right? Like neighborhood owned land trusts. So more of that kind of co-op type of land trust. What has been I mean, you talked a little bit about it in committee in terms of the process.'",
        "'speaker_3': 'What's the commitment in the housing plan to that? And specifically, do we actually talk about, I mean, differentiate the types of land trusts and put our chips in on a and specifically on a neighborhood land trust? And what's our commitment to neighborhood land trust?'",
        "'speaker_10': 'So the housing plan outlines exploration of community land trusts. I will note that we do have a couple of land trust that do operate in the city. We had heard from the Urban Land Conservancy as well as the Colorado Community Land Trust.'",
        "'speaker_10': 'But as part of the exploration of land trust, the language in the plan outlines a couple of factors for consideration. And community stewardship is one of those factors.'",
        "'speaker_3': 'In community stewardship, meaning that it's.'",
        "'speaker_10': 'Owned with how the and how the land trust is informed by community participation. I think that exploration of land trust will involve a lot of those conversations about what exactly the right model looks like in an individual neighborhood.'",
        "'speaker_10': 'But that's part of what's outlined in that in the plan for exploration and something that we're working on in 18.'",
        "'speaker_3': 'Thank you. And Renee, if you can come to the microphone when we're talking about ideas and we're talking about the West Denver Plus, I really want you to evaluate something or just explain to us a little bit more in depth and what that can be.'",
        "'speaker_3': 'I've asked this question of you. We both talked about this because this is happening throughout the neighborhoods and that is people are already converting their garages even in non edu zone districts. Right. We've seen CPD make exceptions for artists who were having nonconforming uses.'",
        "'speaker_3': 'Can you talk a little bit about kind of the program and how it would address? A lot of people think I mean, a lot of people know the reality of building you need to use. It's pretty expensive. It's about $65,000 at a very minimum.'",
        "'speaker_3': 'Right. Can you talk a little bit about the plan to approach some of the garage conversions, if that is indeed a possibility?'",
        "'speaker_11': 'Yep. So will be the first component of West Timber single family plus meaning homeowners where they are. And so it's a bit of a triage to to make sure their mortgage is good and their home needs doesn't need any critical repairs.'",
        "'speaker_11': 'Part of that would be around looking at a garage and assessing, you know, sort of the needs of the family, what their equity is, what their opportunities are. 80 you construction is expensive. We just did a market review with a few builders and a 650 square foot unit.'",
        "'speaker_11': 'Pulling together numbers from a number of homeowners who've just built to use in a number of builders. The average price is $250,000 for a 650 square foot unit. And it's it's very expensive. There are a lot of as there should be, building code requirements that in some cases prevent a garage from being converted.'",
        "'speaker_11': 'So our primary approach to that situation is working closely with a very valued partner, Habitat for Humanity, and we'll be building the units for the 82 program of the West Denver Single Family Plus, and through a number of efforts, including valuing engineering, creativity, their experience, the same size unit 650 square feet will cost approximately at this time'",
        "'speaker_11': '125,000. So half of the market rate. Part of that is to pull down that price to an attainable, very controlled way of developing that unit, but specifically converting a garage. Um, is going to be dependent on a number of factors.'",
        "'speaker_11': 'And in most cases, I have to say, probably not very likely.'",
        "'speaker_3': 'Thank you. And if I just may ask Laura, one just follow up question to that conversation. Thank you. That's okay, Mr. President. Laura, it is expensive, even fixing garages that could be used as a to use and doing that require if it's not.'",
        "'speaker_3': 'The challenge with with with money or capital to borrow against to be able to do that. Sometimes the challenges with CPD. And getting them to recognize that this you know, a lot of these, you know, don't perhaps need to be so stringently enforced in terms of some of the regs with already existing uses.'",
        "'speaker_3': 'Do we have an approach with CPD to identify that kind of challenge? I mean, I use the the artists that were in non-conforming abodes, so to speak, of spaces as an example of CPD moving to help those folks that were there.'",
        "'speaker_3': 'Do you is there anything in the plan or any goal that that you've you've encountered in making sure that that same courtesy can be extended for. Things like this.'",
        "'speaker_10': 'So I will acknowledge that the housing plan does include some land use recommendations, including expanding the opportunity to construct to use in the legislative and regulatory section. On that particular question about the conversion of enforcement is something that I haven't personally talked to CPD Sarah Showalter as hear from CPD, although on the planning side, if you have'",
        "'speaker_10': 'anything to add, please feel free. Otherwise I can take that back to the CPD team and ask for some further analysis.'",
        "'speaker_3': 'If you want to make.'",
        "'speaker_4': 'Yeah. I didn't.'",
        "'speaker_0': 'Say it. Okay.'",
        "'speaker_1': 'Good evening.'",
        "'speaker_11': 'Sarah Showalter with Community.'",
        "'speaker_1': 'Planning Development. So don't have that much to add because we haven't talked about it at all. But I think it's a great point and you give a great example of what we are, you know, that that way of thinking for the artists spaces.'",
        "'speaker_10': 'So it's a great idea.'",
        "'speaker_1': 'I think we definitely take it back. Yeah.'",
        "'speaker_3': 'Thank you and thank you, Mike. My only point, Mr. President, is just the artists. We extend that courtesy for folks and that with our success, we should probably be doing the same thing for folks that already have ideas.'",
        "'speaker_3': 'Unbeknownst to them, it was illegal from God's. Please.'",
        "'speaker_0': 'Dr. Sussman.'",
        "'speaker_1': 'Thank you, Mr. President. Ren, I have a question for you. I was I was very intrigued with the kind of study you did about AIDS and stars and and all the nuances that, you know, it might mean. And one of our big decisions as we were working on stars or one of our big rationales was that for'",
        "'speaker_1': 'some families and the reason why we require that they be primary housing was that some families could use an SDR in order to meet a mortgage. But we didn't have third real good third party data about that. We had it from the from the Airbnb and we had it from some of ours.'",
        "'speaker_1': 'Is there data that you were able to look at that compared that value, that good value? Yes. Help me meet my mortgage if I suppose I buy a house that already has an ADU versus. The one that you all were concerned about, that under this program you can't use an SDR because of the you already have to'",
        "'speaker_1': 'have enough money to have a mortgage in order to get the home that has the adu. I would love to have, if you have it, the data that passed that out, because that's that is an important nuance.'",
        "'speaker_11': 'Yeah. And unfortunately, I have to say, we don't have the data. That is a true rental analysis of the rents being achieved with short term rentals versus long term rentals. Part of the problem with studying its use, you know, dependent on any variable is just there's not that many to study in the city and that's driver.'",
        "'speaker_11': 'That's true in particular of documented areas. Last study I looked at there was three in all of us, Denver, that were permitted. So there's a real lack of data. So that's why we're looking to other cities. We know that anecdotally, some of the reasons that are pushing families to do the to use the cost.'",
        "'speaker_11': 'Right. Um and so we've heard anecdotally again that. Do you see at the cost that this ended up creating in the time that it took in the unforeseen variables? We pretty much like have to run it at the absolute best return that we can on that.'",
        "'speaker_11': 'So that would be that. That's why after a lot of study, we really didn't hesitate to consider having a no short term rental requirement because of the cost that will be saving the homeowner. The work that's gone into reducing the cost of the ADU really does not put it into in the financing, won't be predicated on like'",
        "'speaker_11': 'the highest amount of rent that can be achieved. Yes, I see. Okay.'",
        "'speaker_1': 'I thought maybe you had found a secret cache of data that we couldn't find ourselves. But. But it makes sense. I mean, we you know, that it would be interesting to do some more research to see if I can find some.'",
        "'speaker_1': 'Thank you very much for your explanation.'",
        "'speaker_0': 'Thank you, Councilwoman Gilmore.'",
        "'speaker_6': 'Thank you, President Brooks.'",
        "'speaker_1': 'Laura, I have a question.'",
        "'speaker_6': 'For you about the American community survey data. And if you could explain for folks who are watching this at TV exactly how that data is collected.'",
        "'speaker_10': 'Sure I will make my best attempt, but it is the Census Bureau that collects that data every ten years. As you know, there's a full analysis and EC's data is collected annually as estimates as part of the in between the years of the ten year census.'",
        "'speaker_10': 'But I can certainly follow up with a more detailed analysis of what factors. Particular community. Well, let me let me clarify. I'm happy to follow up with more information about how data is collected and how we can make residents of where aware of those particular data points.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'It's via telephone that that that.'",
        "'speaker_1': 'Data is collected.'",
        "'speaker_10': 'I can follow up with that.'",
        "'speaker_1': 'Okay. All right.'",
        "'speaker_6': 'And so what is the plan? This is a point in time. What's the how is this going to get updated and communicated specifically to our constituents if there's changing conditions? Specifically with, you know, the maps, the type one through five.'",
        "'speaker_10': 'Sure. It's anticipated that we would update this map as new information is available and that would be contained in the annual action plans. So I believe it's 2015 is the majority of what this data is based on because it was the most the data was available across the most number of factors for the 2015 data, but that's'",
        "'speaker_10': 'what we anticipate in terms of updating information.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'And then, you know, once we vote on this tonight and, you know, thank you for all of the work and outreach and engagement. But once we vote on this tonight, city council will not then approve the action plans going forward.'",
        "'speaker_6': 'And so how will constituents and special interest groups and different stakeholders be able to, you know, continue to be engaged in the process if there's maybe not something that city council is voting on?'",
        "'speaker_10': 'Sure. We have a requirement in the ordinance that created the fund, as well as the committee, as well as the plan to have at least one public meeting annually. We are figuring out exactly what that might look like in coordination with planning, and we're also working with our advisory committee to refine what annual action planning looks like'",
        "'speaker_10': '. So I can take the desire that I've heard tonight to have some updates on what annual action plans look like as they're being developed as well as as they're informed by this council. Back to our team as well as the advisory committee.'",
        "'speaker_6': 'Okay, great. My last question, and I'm not quite sure who to address this to, I'm sure it would be someone within OED. But regarding deed restricted properties. You know, it's my understanding in the past there was a kind of a blanket developer's agreement that that was filed to convey that those properties were indeed deed restricted.'",
        "'speaker_6': 'To my understanding, it hasn't been recorded on each individual property previously. And so are there conversations within OED or within.'",
        "'speaker_9': 'You know.'",
        "'speaker_6': 'The city to rectify or address that issue where someone might have a deed, restricted property and for whatever reason not know that there's income restrictions and there's limitations to them either buying or selling those properties.'",
        "'speaker_10': 'Sure. So I will at least answer the question. And if there's more information I can provide, I'd be happy to. Under the development agreements on major, large scale developments like Staples here in Green Valley Ranch, Lowery as well as under the inclusionary housing ordinance and rezoning agreements, we have more than 1200 units that have been produced that'",
        "'speaker_10': 'are for sale units. A majority of those units have an individual covenant on the property. But there are some filings in Green Valley Ranch where the covenant is on the filing and then the information about the affordability covenant is within the warranty deed, but the covenant sets over the entire filing.'",
        "'speaker_10': 'So that's a unique scenario. In Green Valley Ranch, the majority of our covenants are on the individual unit. So I will acknowledge that we are also working to educate our homeowners in that program about the requirements of their covenant.'",
        "'speaker_10': 'We just sent out a letter in the last couple of weeks to remind them just of the requirements of the covenant. So those are some of our outreach efforts, but I'd be happy to spend a little bit more time talking about that in more detail with you.'",
        "'speaker_1': 'Right.'",
        "'speaker_6': 'I mean, I would love to talk more about that because the onus is put on the homeowner. And, you know, when you're going through mortgage paperwork and you're signing away, it might not be as clear as it needs to be, especially if you're looking to sell.'",
        "'speaker_6': 'And so I look forward.'",
        "'speaker_1': 'To having a little bit more robust conversation about that.'",
        "'speaker_6': 'All right. Thank you. Thank you, President Brooks.'",
        "'speaker_0': 'Yep. Thank you, Councilman Espinosa. One question for Will.'",
        "'speaker_9': 'Well. Is. The question is, is there a way to factor in? Is there a way to factor in the value of people living in affordable housing? And I imagine that if we did a bond, we would probably build denser housing sooner and to factor in the value of having people living in affordable housing for the better part'",
        "'speaker_9': 'of that ten years as opposed to incrementally over ten years. Let me just understand with that support the numbers that you were talking about. Right. So looking at a present value analysis of the value of somebody living in at affordable housing today or, say, a year from now versus eight years from now.'",
        "'speaker_9': 'Yeah. I mean, there is a way of quantifying that. I can think of a number of ways you could quantify it. But I do have to give some thought to that. The reason why I say that is because you basically said, well, there's sort of the same amount at some point, but I think that there's some real'",
        "'speaker_9': 'value there to to our communities in the city to having higher concentrate, higher or higher numbers of affordable units in inclusive communities. It would I think maybe the more important question is how many more people could you house help by bringing money forward and having more money today than less money a year from now?'",
        "'speaker_9': 'Now. So I think it's something to think about. Sure.'",
        "'speaker_0': 'Okay. Just a couple of quick questions. Laura, there's a comment about the restriction in affordability. Has there been an analysis done by OED on what cities have. What blanket did restrict your requirements. They've done citywide. So on our linkage fee it's a we have a 20 year on our ordinance.'",
        "'speaker_0': 'What have other cities done citywide?'",
        "'speaker_10': 'I will pull out the exact page, but we have conducted at least some initial analysis. There's a couple of examples in the housing plan that state in this section where we recommend enhancing the minimum requirement. Right now, it's the preservation ordinance that has a 20 year minimum affordability restriction for the receipt of city funding.'",
        "'speaker_10': 'The linkage fees also have a 20 year restriction. We looked at Boston, Seattle in a couple examples, and some of those are 40 years, 50 years, some of them use in perpetuity. But we would want to conduct some additional analysis and certainly have some policy conversations with our housing advisory committee as we inform that final number.'",
        "'speaker_0': 'So that seems like a change that the city council can make towards the preservation ordinance to a 4050 year based upon the hax recommendation.'",
        "'speaker_10': 'That is the place where the minimum affordability restriction exists in regulation.'",
        "'speaker_0': 'Great. And then just a quick question for Rene Martinez. So have you have you addressed and is this a yes or no? But have did you address tap fees? For a to use. Okay. She said, we hope to address taxes because I think that's a big, big, big issue.'",
        "'speaker_0': 'Do you. Yeah. Yeah. You want me? Yeah, go ahead.'",
        "'speaker_11': 'I actually would say to add on to that is that. The situation with taxis and water service is such that that will be an enrollment criteria because it's such a big variable in the development of an idea that a person's utilities and tap situation may actually influence if they're able to develop an idea or not.'",
        "'speaker_0': 'Do we know cities that have waived tap fees?'",
        "'speaker_11': 'We know cities that heavily permit fees but not found any.'",
        "'speaker_0': 'That waive tap fees.'",
        "'speaker_11': 'But we will we do intend to work at it at a larger level with the city versus just doing 30 units here and there.'",
        "'speaker_0': 'Thank you and thank you for your work on this. Okay. This concludes our questions. We're ready for comments. Public hearing of 111 is now closed. Comments for members of Council Councilwoman Ortega.'",
        "'speaker_6': 'Thank you, Mr. President. I first want to say a great big thank you to everybody who has been involved in putting this five year plan together. I think, you know, our city does this five year plan because it's required of HUD.'",
        "'speaker_6': 'But in this body of council used to approve the five year plan and somewhere along the lines, we got away from this body playing a role in in approving them. And I was pleased to see the mayor's office support this plan being adopted by council.'",
        "'speaker_6': 'So for members of the hack, which includes a broad spectrum of of interests and stakeholders to folks at OED finance, you've been very much part of these conversations. You know, this has involved communities around the city being able to weigh in.'",
        "'speaker_6': 'I think it's vitally important that we move forward, adopt this plan. But I'm anxiously looking forward to seeing the details in the one year action plan. That's really where we will see if we're meeting the benchmarks that are spelled out in the five year plan, you know, the emission levels that are sort of identified as target goals'",
        "'speaker_6': 'for the majority of the funds being spent, four 0 to 30. And, you know, looking we we don't have enough money to do everything unless we go figure out how to bring more money to the table so that we can address, you know, the issues, which is not all about production.'",
        "'speaker_6': 'That's important. Creating more affordable, permanent units in the city is important. But there are a variety of other things that this plan moves us towards doing, creating some renter protections for folks who find themselves paying ridiculous fees for, you know, being late one day, you name it.'",
        "'speaker_6': 'But this really, I think, hits the marks in terms of the key areas that we want to see happen in moving this plan forward. And again, we'll see the action plan come to us in March. I am anxious to see that we are committing to the community or neighborhood level community land trust and specifically for the yes'",
        "'speaker_6': 'neighborhoods. I know other neighborhoods are looking at this as well, but with gas, the thing that makes this a little different is Sea Dot has committed $2 million to those neighborhoods to address the housing that's being lost as a result of the I-70 project.'",
        "'speaker_6': 'So that money should go to those neighborhoods and they've got the, you know, appropriate. Expertize, working with them to ensure that those dollars are being spent in a way that maximizes the benefit to those communities. And so with that, I'm not going to continue more than just to say I appreciate the work that everybody has put into'",
        "'speaker_6': 'this, because this gets us moving forward. The real work starts as we continue to raise more dollars and, you know, really work towards trying to keep people in this city that want to stay in Denver. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Ortega. Councilman Espinosa.'",
        "'speaker_9': 'I want to thank the volunteers that worked on this over the course of this amount of time and the staff that led them and guided them through the process. But like several supporters that spoke tonight, they picked on the plan.'",
        "'speaker_9': 'So count me among them, the title of the of of the of the of the plan is called Housing and Inclusive Denver. And I think the operative word there is inclusive. And yet it only the word inclusive only comes up in one of the plan recommendations.'",
        "'speaker_9': 'And it's the fourth plan recommendation, and it's not even in Denver. And so that plan recommendation is pursue regional collaboration with partners across the metro Denver metro area to promote inclusive communities. I'm very big on the idea of inclusive communities, and maybe you argue that all of these other recommendations will do that.'",
        "'speaker_9': 'But I see a lot of sort of my concern originally when we passed this ordinance that created this whole thing, which was maintaining the status quo, a lot of the things recommendations sort of maintain the status quo, which we recognize aren't doing a really bang up job on inclusive community.'",
        "'speaker_9': 'So I get frustrated by that idea because it says recognizing that housing and affordability challenges, challenges do not start and stop at Denver's boundary boundaries. The city and its partnership should pursue regional partnerships, including with Denver's Regional Council government, to leverage funding and investment strategies to promote inclusive communities sort of outside of Denver.'",
        "'speaker_9': 'And this is the problem of displacement, is we need to be. I wish we had a strong recommendation to the to include to have inclusive inclusivity, to be a part of new construction. That idea is not strongly stated as a goal for Denver.'",
        "'speaker_9': 'Instead, that page that I just quoted emphasizes inclusivity on our surrounding communities. Not here, despite the title of the document Housing and Inclusive Denver. So among the recommendations is is a clear is clear direction that we should pursue inclusive housing as a norm.'",
        "'speaker_9': 'That should be among the recommendations, not an exception whether that is achieving achieved voluntarily or descriptively. And to do so, there needs to be an emphasis in this plan on lobbying in the state legislature for greater municipal autonomy regarding housing.'",
        "'speaker_9': 'We have strong limitations on what we can and can't do. You know, we went you know, Councilman Brooks went to great lengths to sort of get to that point with the incentives, which I think. Which Tim sort of spoke of.'",
        "'speaker_9': 'But that is a small. That is a small, small step towards this inclusivity idea. But we are encumbered, meaning that we are limited by the the rules and decisions that have been made at the state legislature on the degree of regulatory mandates that we can do towards this end.'",
        "'speaker_9': 'And it's not stated here. It's more like again. And maybe that's the aim, right? Which is this is just the permanent affordable housing fund and how we're supposed to divvy that up. But this is also replacing our housing plan, which does the does the bigger macroscopic picture.'",
        "'speaker_9': 'And so. That is my my my lone frustration. I appreciate the the the efforts towards sort of the my stated concerns that at committee and to Mr. Siegel's and Mr. Romero's comments get me the ballot initiative and you will see me relax my position on sunsetting.'",
        "'speaker_9': 'All right. So I want to see us. That's been my biggest frustration all along, is this is we've never done a big enough move on the affordable housing front at this time of incredible prosperity in crisis, in housing in Denver.'",
        "'speaker_9': 'And now is the time to sort of still the time to sort of capitalize on this thing, make moves that are that are more sustainable and sort of give us the ability to manage assets. None of that is I mean, that's all sort of granular.'",
        "'speaker_9': 'Hope to see it in the action plan. But, you know, I wish it were more strongly worded in this document, but I do still nonetheless appreciate the level of analysis and in the aspirational aspects of this document going forward.'",
        "'speaker_9': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Lopez.'",
        "'speaker_3': 'Thank you, Mr. President. I also wanted to just thank you all for your work. I know there's a lot of work to create this housing plan. Thank you, Councilwoman Ortega, for fighting for it way back when it's actually be completed.'",
        "'speaker_3': 'The housing plan was actually something that we talked about ten years ago without having an actual plan. And so I think being able to see it go through come to fruition is a big thing. However, a plan is a plan.'",
        "'speaker_3': 'This sits on the shelf unless there's action. And we all know that from this council to the people in this room, to the advocates, to the folks we know in the community that are that are screaming for help.'",
        "'speaker_3': 'Right. Especially when it comes to affordability. We have to make sure that that plan doesn't sit on some shelf and collect dust. We there are implementable changes. However, I do have a few comments. Rene, you're amazing. What your your work, your dedication in the West Side, especially with the 80 with the 80 use and the question of'",
        "'speaker_3': '80 use is something that shouldn't really, truly be revolutionary. This is something that we've always had the power to do in a lot of our areas. And in 2010, we kind of foresaw this as a good, happy medium because back then we weren't talking about affordability, we were just talking about survival and staying and keeping those homes'",
        "'speaker_3': 'right and keeping those that ownership of those homes. Unfortunately, there are just a few areas in Denver where it was the hardest hit in the whole country, both in Montebello and Green Valley Ranch and in the West Side, you had probably the some of the highest foreclosure rates in the country and it would go neck and neck'",
        "'speaker_3': 'with some of our other what the other cities. But the aid use has always been an option. And I think as a city we need to do whatever possible to help that come to fruition areas that we are okay with and focus in on.'",
        "'speaker_3': 'At least I know in the West I don't want to have to use we're down to do the legislative rezoning, give us staff time and let's get it done. That way these folks can actually take that next step.'",
        "'speaker_3': 'The other thing is, is a question that I think we have to address is, you know, there are a lot of folks that are living in garages and they're not necessarily living in garages as garages. They're living in garages as a way to use their just nonconforming uses.'",
        "'speaker_3': 'I visited a few of them and having conversations with CPD said, Well, we a counter and we've got to shut them down. Their nonconforming uses, and that is protocol. If there's a nonconforming use and you build something without permits, it gets shut down.'",
        "'speaker_3': 'What we've seen in some areas now with with artists, studios and a public support behind that, we can make it happen. We can social compassion, we can actually create steps for that. You don't necessarily have to be hard nosed.'",
        "'speaker_3': 'And I think the same approach has to be had with some of these ADA use in some of these areas. Right. So maybe it's the zoning first and then working with some of these property owners so they don't wanna have to fear coming the CBD, CBD saying oops, we actually built one, what do we do now?'",
        "'speaker_3': 'Right. So we have to address that on a case by case basis, but we have to have some policies that support that. The Community Land Trust. I hope we really mean neighborhood, community land trusts. There are different land trust that are out there.'",
        "'speaker_3': 'Some are more elaborate. Some are owned by organizations that have a lot of great track record. But there are folks who came in our chambers multiple times throughout our city saying we would like to see real grassroots residential on land trusts.'",
        "'speaker_3': 'I think that's a great idea. I think it's definitely something that we're not just exploring. But let's help. Let's help. Look at that. Let's help. Create may bring that to fruition as well to. The last thing is something that I always chime in on, especially when we're talking about affordability and affordability in our housing.'",
        "'speaker_3': 'It is well understood that we cannot do anything about rent control and our ability to actually do rent control. The state prohibits us from doing that. But there is an avenue. If the state were to allow local control of rental regulation.'",
        "'speaker_3': 'And we would actually have a viable option. And they're not going to do it overnight. And we know politically it's going to be a challenge, especially with the split house over there across the park. And highly unlikely. But that's only without our advocacy.'",
        "'speaker_3': 'If we really, truly believe in affordability in Denver and using all the tools that we can in the toolbox, then this is a big wrench that we need to be that is essential and doesn't have to look like rent control in other cities, but just the ability to be able to rest assured.'",
        "'speaker_3': 'One, you know, as we lay our heads at night from coming back from from council meetings to know that those cranes in Denver, all those cranes in Denver, if they're building housing now, we can count on policy that requires at least some level of affordability on every single one of those cranes, whether it's rental or whether they're'",
        "'speaker_3': 'for sale units. Without that tool, we are up a creek and we have to be real and we have to be strong with our advocacy because when we're silent. There's no action across there in that state capital. So, Mr. President, thank you so much for for me to speak.'",
        "'speaker_3': 'And thank you all for your hard work, Laura.'",
        "'speaker_0': 'Thanks, Councilman. Councilman Flynn.'",
        "'speaker_8': 'Thank you, Mr. President. I first want to thank again everybody who did work on this for such a long time. And and but I share some of the concerns that Councilman Espinosa brought up, but also those I brought up during questioning.'",
        "'speaker_8': 'I in reading the plan, I felt that it. I agree with a lot of the goals and a lot of the recommendations, but to me it lacked a lot of specifics. And in the areas where I was specific, I felt that it missed the mark.'",
        "'speaker_8': 'And I'm speaking frankly about the characterizations of some of the neighborhoods in my own district that I thought were so far off in how they were typecast, that it may, as we heard, that it may end up either misdirecting or blocking the use of the resources from a fund into areas in my district that that could benefit'",
        "'speaker_8': 'from them. And that concerns me very much. And for that reason I have to cast a no vote, not out of any disrespect for the work that went in, but I but out of concern that as far as it's gotten right now, it may actually not do what it needs to do in my district.'",
        "'speaker_8': 'And so with that, Mr. President, I'll turn it back to you.'",
        "'speaker_0': 'All right, Councilman Flynn, and I'll turn it over to Councilman Cashman.'",
        "'speaker_4': 'Well, thank you, Mr. President. This is the housing inclusive. Denver is obviously it's not an action plan. It's an aspirational plan that commits to doing the legwork needed to get us to the to fine tune the actions that we need to achieve the broad range of recommendations in the plan.'",
        "'speaker_4': 'As I was reading along, I started to have concerns for specificity and realized what I was looking at. This plan looks at affordability for rentals and for sale units. It looks at a broad range of amenities. It looks at new builds preservation considers, new funding options, eviction assistance.'",
        "'speaker_4': 'It looks at tiny homes, land trusts, and A2 use at tools for affordability, extending covenants. It really touches all the bases that are important. And Councilman Flynn, I had my own concerns on a map to that. Had some on the face left questions for me.'",
        "'speaker_4': 'But I think the key is going to be in the action plans where where the rubber meets the road. I just think there's just been a tremendous amount of work done. And I really think this is a comprehensive package that will guide the conversation and do us a whole lot of good along the way.'",
        "'speaker_4': 'So I'm actually very pleased to support this this evening. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Cash from Councilman New.'",
        "'speaker_5': 'Thank you, Mr. President. The play is very good, very comprehensive. And I'm very pleased with I think all three were involved in getting it developed. But to me, it's all about the money. You know, we we've talked about having enough revenue and we talked about the affordable housing program.'",
        "'speaker_5': 'We we worried about whether 15 million would be enough money. And and surely it isn't. Now, you know, the 2015 homeless plan identified 27,000 units for homelessness. You know this were identify. We talk now about 80,000 cost burdened citizens we have households we have and 5000 homeless on the street.'",
        "'speaker_5': 'So we've got an increasing need, not something that is decreasing. And so hopefully this plan will be the basis for improving that situation. And I look forward to bringing a really forward year analysis and I hope you'll work with all in Denver and come up with do a real thorough analysis of these four options because in rank'",
        "'speaker_5': 'them in terms of effectiveness on meeting our need. If this possible, I'd like to really see what it is that you come up with. I trust your judgment tremendously, and I know your team will help develop a good plan and see what those four options will be.'",
        "'speaker_5': 'So thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. New scene. Are there speakers? You know, I'll say this. I was critical of the plan because of a conversation we had around land trust early on and it looks like we've got that address. And so I'm I'm very excited to see the possibility of a land trust in Greece globally or Swansea.'",
        "'speaker_0': 'And so I'm excited. You know what Councilwoman Espinosa said it wasn't inclusive, but if you know the list that you just reading the plan and the list that Councilman Cashman just listed is every request that I had through my office to for the city to start addressing.'",
        "'speaker_0': 'And so I actually do feel like it's inclusive, is inclusive of grass roots, the grass tops leaders all over this city. You know, the the the deed restriction, the years of deed restriction needs to be dealt with in the preservation ordinance.'",
        "'speaker_0': 'And that's something that I'm going to be looking at and working on with members of council and figuring out with and communication with the hack and relationship with the hack of is 50 years, 40 years. What what is the right number based upon their advisement as well?'",
        "'speaker_0': 'And the last thing I'll say, just piggybacking off my Colfax brother, councilman knew is that it is all about the money. And if the city of Denver does not double the fun this year, this year, find the funds, this year we will be in trouble.'",
        "'speaker_0': 'And so I am not only am I predicting we are going to come together with the mayor's office to find those funds this year, I'm saying we have to for the good of this city. So thanks for everyone in the audience who stayed, who's been working.'",
        "'speaker_0': 'We appreciate you pushing. I think we've gotten to a place that we all can move forward. And this is how a city works. We fight a little bit, but we push a little bit and we come together with the vision.'",
        "'speaker_0': 'And I think this vision, for the first time in Denver's history, is going to move us to a good place. And so I want to lastly thank Councilman Ortega for putting this in the ordinance two years ago so that we can have this robust discussion.'",
        "'speaker_0': 'And with that. Madam Secretary, Raquel Ortega.'",
        "'speaker_2': 'Sussman Black. Clark Espinosa. Flynn, no. Gilmore, I. Herndon, I. Cashman. Lopez.'",
        "'speaker_9': 'All right.'",
        "'speaker_2': 'New. Mr. President.'",
        "'speaker_0': 'I, um. Okay. We're good. Councilman Black's voting went down, but it went back up. All right. Calls voting in US.'",
        "'speaker_2': 'Results 11 eyes. One nay.'",
        "'speaker_0': '11 eyes, one nay. 111 has been adopted. That has been adopted. On Monday, March 19, 2018, Council will hold a required public hearing council bill 130 Changes on a classification for 680 Sheridan Boulevard and Villa Park and he protests against Council Bill 130 must be filed to Council Office no later than Monday, March 12th.'"
    ]
}