{
    "A bill for an ordinance approving a proposed Third Amendatory Agreement between the City and County of Denver and Town of Morrison, to facilitate acquisition of identified improvements necessary to ensure long-term treatment of wastewater in an efficient and economical manner. Amends an intergovernmental agreement with the Town of Morrison by adding $946,000 for a new total of $1,500,900 and six months for a new end date of 12-31-19 for engineering services and acquisition of wastewater improvements related to wastewater infrastructure at Red Rocks amphitheater (THTRS-201628380-03). The last regularly scheduled Council meeting within the 30-day review period is on 4-29-19. The Committee approved filing this item at its meeting on 3-20-19.": [
        "'speaker_0': 'Thank you. That concludes our proclamations for this evening. Bills for Introduction. Madam Secretary, will you please read the Bills for introduction?'",
        "'speaker_6': 'From business, arts, workforce and aviation to 55. A bill for an ordinance approving a proposed third a mandatory agreement between the city and county of Denver and town of Morrison to facilitate acquisition of identified improvements necessary to ensure long term treatment of wastewater in an efficient and economical manner.'",
        "'speaker_6': 'From finance and governance to 83. A Bill for an ordinance authorizing the issuance of one. The City and County of Denver, Colorado. General Obligation Elevate Denver Bond Series 2019 eight for the purpose of financing and defraying the cost of acquiring, constructing, installing and improving various civic facilities and to the city and county of Denver, Colorado.'",
        "'speaker_6': 'General Obligation Better Denver and Zoo Refunding Bonds Series 2019 be for the purpose of refunding, paying and discharging all of the city's outstanding general obligation. Better Denver in due Bonds Series 29 AIM Maturing after August one, 2019, providing for the levy of general ad valorem taxes to pay the principal of an interest on the series of 2019'",
        "'speaker_6': 'A and B bonds and making other provisions relating thereto to 90. A Bill for an ordinance authorizing expenditures in the General Government Special Revenue Fund based on a letter of intent from the United States of America to award funding to the city and county of Denver for the Head Start Grant Fiscal Year 20 1920 program from land'",
        "'speaker_6': 'use, transportation and infrastructure to 47. A bill for an ordinance changing the zoning classification for 3429. West Third Avenue in Barnham with a reasonable condition to 89. A bill for an ordinance relinquishing an easement reserved in ordinance number 134.'",
        "'speaker_6': 'Series of 1931 recorded with Denver Clerk and recorder at Book A 17 Page 677 located at 1900 West 32nd Avenue and 1729 Erie Street and From Safety, Housing, Education and Homelessness. 133 A bill for an ordinance six Excuse me, a bill for an ordinance authorizing the issuance and sale of an amount not to exceed 30 million.'",
        "'speaker_6': 'The City and County of Denver Multifamily Housing Revenue Notes Series 2019 for the purpose of financing the acquisition, rehabilitation, improvement and equipping of a multifamily residential rental housing development to be occupied by low and middle income families and persons in the city and county of Denver, Colorado, to pay certain expenses of such notes as defined below issue'",
        "'speaker_6': 'approving and authorizing execution of a funding loan agreement, a project loan agreement, and a tax regulatory agreement such as defined below with respect to the notes, making findings and determinations with respect to the project as defined below, and the notes authorizing the execution and delivery of related documents and repealing all action here to four taken in conflict'",
        "'speaker_6': 'herewith.'",
        "'speaker_0': 'Thank you, Madam Secretary. Council members. This is your last opportunity to call out an item. Councilman Gilmore, would you please make the motions for us this evening?'"
    ],
    "A bill for an ordinance approving the First Amendment to the Amended and Restated Service Plan for Denver International Business Center Metropolitan District No. 1. Approves the First Amendment to the Amended and Restated Service Plan for Denver International Business Center Metropolitan District No. 1, located near Tower Road between 64th and 72nd Avenues in Council District 11. The Committee approved filing this item at its meeting on 3-19-19.": [
        "'speaker_0': 'If you are here to answer questions only when your name is called, please come to the podium, state your name and note that you are available for questions of council speakers about 3 minutes and there is no yielding of time on the presentation monitor.'",
        "'speaker_0': 'On the wall you'll see your time county down. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilwoman Gilmore, will you please put Council Bill 246 on the floor?'",
        "'speaker_1': 'Yes, President Clark, I move that council bill 19 dash 0 to 4 six be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved. Can I get a second? Thank you. It's been moved and seconded. The public hearing for Council Bill 19 0246 is open. May we have the staff report? Good evening. My name is Andrew Johnston with the Department of Finance here to talk to you about a amendment to an amended service plan for Denver International'",
        "'speaker_0': 'Business District number one. The district was organized in 1994 after city approval of a service plan and August 29th of 1994. The service plan was subsequently amended by the city on December 16, 2022, and most recently just last October.'",
        "'speaker_0': 'In October 2018, we amended and restated the whole service plan. Which brings us to why we're here tonight. The Denver International Business Center Metropolitan District is located west of Tower Road, between 64th and 72nd Avenues. The district is mostly is most easily recognizable for the various office and hotels on the west side of Tower Road.'",
        "'speaker_0': 'The district district contains only commercial property, and as the new airport noise contour prohibits residential development, the metropolitan district currently has about 11.3 million in bonds outstanding and an assessed value of 11.30 $1.7 million. The purpose of the recent amended and restated service plan in October 2018 was to update update the service plan language and certainly the'",
        "'speaker_0': 'new language in section SB four of the service plan was too restrictive and did not meet the circumstances of a growing metropolitan district. The district current bonds were issued with an unlimited meal levy pledge as allowed because the debt was 50% of the assessed value.'",
        "'speaker_0': 'This is not uncommon in districts where infrastructure is complete. However, Denver International Business Center is still constructing public infrastructure and for the next phases of development, the ratio of debt to assessed value will exceed 50%. The existing language actually in the service plan actually prohibits the issuance of any debt where the debt is to where the debt'",
        "'speaker_0': 'to assessed value is greater than 50%. The correction before you tonight is to allow the debt to be issued when the assessed value is greater than 50%. So long as the mill levy pledge for repayment is less than the maximum aggregate mill levy of 50 of 60 mills.'",
        "'speaker_0': 'Approval of the amendment clarifies the service plan and will permit the district to enter into financing arrangements allowing construction of future phases. This amendment only modifies Section XP for the district. Activities shall continue to be subject to review by the city as provided in the current and amended and stated service plan, state or local law, intergovernmental agreements'",
        "'speaker_0': ', or where the district activities deviate in a material manner from the amended and restated service plan. The primary purpose of this district will be to financing strike public improvements and to operate and maintain the public improvements that are not accepted for ownership or maintenance by the city or any other public entity.'",
        "'speaker_0': 'The district's public improvements will be for the use and profit of anticipated taxpayers in the district and staff recommends approval of the amended Section XP four of the service plan. The applicant and their representatives are here to answer any questions.'",
        "'speaker_0': 'Thank you very much. We do have two individuals signed up to speak this evening, so I'll ask if you signed up to speak on this, please come up to the front bench. And first up is Marianne Mcgeady.'",
        "'speaker_6': 'Hi. My name is Maryanne Mcgeady. Address four or five 454 50/17 Avenue, Suite 400 and Denver. I here on behalf of the applicant to address any questions you may have.'",
        "'speaker_0': 'Thank you very much. Next up, Jesse Paris.'",
        "'speaker_13': 'It's just the. Represent for Denver homeless sell low black star some woman for self defense and positive as a commitment for social change. And I'm an at large candidate for the May 2019 election. I'm on top of the ballot.'",
        "'speaker_13': 'I was neither for or against this amendment. I wanted to know more details on what this all encompassed, how it was going to affect the workers at the CIA since we just passed a $15 minimum wage increase for the CIA workers.'",
        "'speaker_13': 'And there's this whole section of tower roll. Going to be an industrial district. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of Council Councilwoman Ortega?'",
        "'speaker_11': 'Thank you, Mr. President. And I apologize. I did not get a chance to check in with you guys on a couple of these questions. So the fact that it is unlimited but capped at 60 miles with the amendment.'",
        "'speaker_11': 'So first of all, what changed from the original creation that is warranting the amendment? And then when the improvements that are done that are turned over to the city and typically that's what roads and parks, what else would that include?'",
        "'speaker_11': 'So and when that's done, does the mill that's being charged or the amount of mills to the the property owners that come in, does any of that go down when those assets, if you will, are turned over to the city?'",
        "'speaker_11': 'So can one of you address those questions?'",
        "'speaker_6': 'This is Marianne Magee. I'll try to address the questions as I understand them. The first question had to do with the total overall mill levy and how does that mill levy adjust as improvements are constructed, completed, and then to the extent conveyed to the city and county for assumption for operation maintenance.'",
        "'speaker_6': 'What we understand at the district level is we forecast over 30, 40, 50 years what the improvements will be, what the maintenance burden will be with the eye towards trying to keep the mill levy as level as possible.'",
        "'speaker_6': 'And so we anticipate that there will be transition in the ownership and operation.'",
        "'speaker_8': 'And maintenance to the city. And so the mill should stay pretty constant. It shouldn't drop.'",
        "'speaker_11': 'So even though.'",
        "'speaker_10': 'The.'",
        "'speaker_11': 'Where the mills are set and the calculation factors in all of the maintenance, those assets that get transferred over to the city, the maintenance of the the mill, the the amount of money that's being charged to to the property owners still remains constant.'",
        "'speaker_6': 'Well, it's there is a growth projection. And so what's happening is the mill levy staying the same, the amount of dollars being used to pay debt versus operating is changing year to year. But we do build into that forecast the assumption that there's transition once we get to the end of the warranty period on certain of those'",
        "'speaker_6': 'operating items for the items that the district continues to be responsible for, we have to continue to have a reserve.'",
        "'speaker_4': 'Depreciation.'",
        "'speaker_6': 'Budget repair, replacement budgets. And so that's why we try to keep it constant over time, even though what we're spending the money on varies. I think your other question had to do with the mill levies and under the.'",
        "'speaker_11': 'So what what changed that warranted this amendment?'",
        "'speaker_6': 'Okay. Under the model plan that's being proposed and under discussion, which we used as the template to start preparing the amended and restated plan that was most recently approved by Council. There was a section there that refers to unlimited mill levy, which occurs once you have exceeded 50% debt to assessed valuation.'",
        "'speaker_6': 'So at that point you're financially stable. You can get a better interest rate if you can remove that mill levy cap. However, the way the wording is in that template plan is that once you have done that, you you can't issue any cap mill levy debt because it's assuming that all the debt you're going to issue is'",
        "'speaker_6': 'going to be beyond that 2 to 1 debt to assessed ratio calculation. If you have a single phase of financing that works, if you're doing future phases of financing, you can't get that next phase done. And because the ABC since 1994 is one large district and doesn't have multiple districts within its service area, it needs to be'",
        "'speaker_6': 'able to issue those next phases of debt to complete the project. So in discussion with the Finance Department, we brought forward the concept that you'd keep the unlimited mill levy pledge on the debt that mathematically is below the 2 to 1 debt to assess calculation for any debt issued.'",
        "'speaker_6': 'Beyond that, you would have the mill levy cap in place, that mill levy that's needed to serve the unlimited debt. If it takes up all of the cap, then there would be no money to pay on this on those cap debt.'",
        "'speaker_8': 'So mathematically, you're not pushing the mill levy cap beyond what was in the original plan.'",
        "'speaker_11': 'And under what circumstances might we see an additional, excuse me, metro district being created under this district? I know with I think it was the football stadium district, it had more than one metro district created.'",
        "'speaker_6': 'Well, for DBC, the way it has set its boundaries and it has an inclusion area and it brings in property as it's developing it, there shouldn't be a need to organize any future districts.'",
        "'speaker_11': 'Thank you. I have no further questions. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Seeing no other questions, the public hearing for Constable 246 is closed. Are there any comments by members of council? All right. No seeing, no comments. Madam Secretary, roll call on Gainesville, 246.'",
        "'speaker_6': 'Black eye. Brooks Espinosa. Hi, Flynn. Hi, Gilmore. I can. I can use Lopez.'",
        "'speaker_0': 'All right.'",
        "'speaker_6': 'New Ortega, I. Assessment, Mr. President.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2535 E. 40th Avenue in Elyria Swansea. Approves an official map amendment to rezone property from I-A UO-2 and I-A to I-MX-3 (light industrial to industrial, mixed-use), located at 2535 E. 40th Avenue in Council District 9. The Committee approved filing this item at its meeting on 2-26-19.": [
        "'speaker_0': 'All right. Madam Secretary. Because the voting in the results. 12 hours, 12 hours council bill 19 0246 has passed. Councilman Gilmore, will you please put Council Bill 127 on the floor?'",
        "'speaker_1': 'Yes, President. Clerk, I move that council bill 127 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Has been moved and seconded. The public hearing for Collinsville 19 20127 is open. May we have the staff report?'",
        "'speaker_10': 'Yes. Thank you and good evening. I'm Courtney Livingston with Community Planning and Development. This Map Amendment application request is to rezone a single property located at 2535 East 40th Avenue, located in Council District nine in the south portion of the Elyria Swansea statistical neighborhood at the northwest corner of East 40th and Clinton Street.'",
        "'speaker_10': 'The site is approximately 14 acres in size and has an existing 235,000 square foot warehouse style building, which is currently occupied by a nonprofit dance studio. It was previously home to the AT&T Network Control Center. The applicant is proposing to rezone from the existing IAU vote to an AI zoning two IMX three to allow for adaptive reuse'",
        "'speaker_10': 'of the existing building and the site enabling for a mixed use redevelopment. The site is currently zoned IAU two and with a portion of that on the eastern portion. AIA is an industrial light industrial zone district that allows for variety uses except for new residential uses.'",
        "'speaker_10': 'The U. OH to which is the Billboard use overlay is currently applied to the site, however, is proposed to be removed with the rezoning. There is no billboards currently on site to the north is zoned IAU oh two.'",
        "'speaker_10': 'To the east we have single unit residential with the ECB to the southeast, IAU two. That's where Bruce Randolph High School is. And then to the south and west we have Ivy Yota, which is industrial. So the subject property was previously in industrial use.'",
        "'speaker_10': 'That's actually the AT&T Network Control Center, but it's now home to the nonprofit dance studio, and their associated administrative offices to the north and south are primarily industrial uses to the east as single unit residential Randolph High schools to the southeast, to the south and west, there's a mix of vacant utilities and industrial uses.'",
        "'speaker_10': 'So here are some photos of the subject site at the bottom. Photos taken from East 40th Avenue. Looking north, the photo on the left was taken of the subject property looking north in the photo on the right was taken looking east towards the adjacent residential.'",
        "'speaker_10': 'Additional photos of the site with that residential to the east and then to the second photo on the bottom is the industrial use to the south. So register neighborhood organizations. This is a list of the applicable registered neighborhood organizations that were noticed, according to the Denver zoning code requirements.'",
        "'speaker_10': 'And then this is an overview of the public process related to this a map amendment postcards were related to this map amendment in both English and Spanish were sent to all property owners within 200 feet of the site.'",
        "'speaker_10': 'And that was for the informational notice noticing folks that application was sent. And then also of the planning board hearing. We also have sign postings for the planning board hearing and then this council public hearing and then written here written notification was sent at those different touch points.'",
        "'speaker_10': 'There are five review criterias in the Denver zoning code that were required to review rezoning against a briefly summarize each of them. There's additional detail to be found in the staff report. First it must be sound that rezonings are consistent with adopted plans.'",
        "'speaker_10': 'There are three adopted plans that apply to this rezoning the Denver Comprehensive Plan 2000 Blueprint, Denver and the Elyria Swansea Plan. First Comprehensive Plan 2000, which sets a citywide vision. There are a number of strategies that from the Comprehensive Plan 2000 that we found this application is consistent with.'",
        "'speaker_10': 'It would enable mixed use infill development where infrastructure is already in place and increase density and accommodate new uses near transit. Next is Blueprint Denver. This is Blueprint Denver 2002 and the site is showing to have a concept land use of industrial and within is within an area of change.'",
        "'speaker_10': 'Blueprint 2010 notes that the need for industrial areas may be decreasing and buildings are suitable for conversion to office and residential. The proposed MAP amendment is consistent with blueprint recommendations, as allows for industrial uses as well as some complementary office commercial and residential.'",
        "'speaker_10': 'And also it's in an area change blueprint provides guidance for area of the change saying to channel growth where it will be beneficial and best improve access to jobs, housing services with fewer and shorter auto trips. This proposed rezoning is consistent with the areas of change, intent and blueprint Denver as it will allow for reinvestment, reuse and'",
        "'speaker_10': 'industrial mixed use zoning creating access to jobs within a mile of a transit station. It's also located on the northeast corner of East 40th Avenue and Clinton Street. Blueprint designates East 40th Avenue as a mixed use arterial and enhanced transit corridor, while Clayton is on designated local street.'",
        "'speaker_10': 'Blueprint notes that mixed use arterials like East 40th provide a high degree of mobility, whereas local streets like Clayton are tailored more for local access. That said, the overall street network serving this site is appropriate for the proposed IMAX three zone district and is consistent with plan recommendations.'",
        "'speaker_10': 'Next, we'll move on to the Elyria Swansea A Plan. That plan was recently adopted in 2015 and identifies the site as industrial mixed use, noting that these light industrial uses are such as light manufacturing and smaller warehouses are compatible with a variety of housing uses and housing types.'",
        "'speaker_10': 'The proposed Annex Street District is consistent with the plan's development vision for the area that allows for compatible mix, including residential and light industrial. The plan also has a height map and shows the recommended height for this area at three stories and IMAX three has a max height of three stories.'",
        "'speaker_10': 'So it is consistent with the recommendations of that plan related to that. Next, move on to the next two criteria. Staff finds that the requested zoning meet the next two criteria. The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare through its implementation of adopted plans, enabling adaptive reuse and'",
        "'speaker_10': 'infill redevelopment and a mix of uses within a mile of transit. So the fourth criterion is related to justifying circumstances. And in this case, a neighborhood plan was recently adopted in 2015, and there have been many changes in the area as the 40th, the Colorado and the 30th and Blake stations with the opening of the University of'",
        "'speaker_10': 'Colorado align. The application also notes that there's been some new investment in the area, such as the nearby Eastside Human Services Center. These changing conditions, along with the recently adopted neighborhood plan, justify the rezoning that's in the public interest.'",
        "'speaker_10': 'And finally, in order to prove or approve a rezoning, it must be found consistent with the context, district purpose and intent statements found in the Denver zoning code. The proposed rezoning is consistent with the industrial context exist in the surrounding area and is consistent with the purpose and intent statements as it accommodates a variety of uses, including'",
        "'speaker_10': 'industrial, and it can serve as a transition from that residential to having industrial uses. And the intent of the I am sorry district is to be applied in the industrial areas where there is a maximum of three stories to be desired.'",
        "'speaker_10': 'In conclusion, CPD recommends approval based on finding all review criteria have been met. Thank you.'",
        "'speaker_0': 'Thank you very much. We have 31 individuals signed up to speak this evening. So what I'm going to do is I'm going to call up five at a time. When I call your name, if you can come to this front bench and be ready to step right up to the microphone when your name is called, and then'",
        "'speaker_0': 'we'll kind of go through five at a time. So the first five, if you can come up, Bruce O'Donnell. Griselda Calderon, Angelina Torres, Andrew Miele and Raimunda carry on. And normally you have 3 minutes. But if we are doing translation during yours, then we automatically give you 6 minutes.'",
        "'speaker_0': 'So first up, President.'",
        "'speaker_14': 'Good evening, Mr. President and members of council. I'm Bruce O'Donnell. I reside at 386 Emerson and I'm the owner's representative for this rezoning application. There's been a lot of discussion about the community outreach process, and I wanted to remind everybody here that the applicant email Lorenzo's requesting to meet and engage with them on July 22nd, October 16th'",
        "'speaker_14': 'and February 4th. And we received positive feedback from Clayton United and the Elyria, Swansea, Globeville Business Association. We met with Clayton United on December 11th. We had a meeting with the GSE Coalition on March 6th. We hosted a community house on March 18th.'",
        "'speaker_14': 'Approximately 40 attendees were there, resulting in nine letters of support that you have in your file from immediate neighbors on Clayton Street and Fillmore. We had a meeting and presented to United North Denver on April 25th, and we met with immediate neighbors on April 1st.'",
        "'speaker_14': 'As you're aware, this rezoning meets the rezoning criteria established in the CLO, in the code in particular plan support. This is an a blueprint Denver area of change in the 2015 and Elyria Swansea neighborhood plan has the most important criteria that designating this as industrial mixed use on page 28 and with a three story height limit on'",
        "'speaker_14': 'page 31. This explicit plan support identifies IMX three is the exact and only zoned district appropriate for the property because the applicant meets the zoning criteria established in the code. There is staff recommending approval and a unanimous recommendation of approval from the Denver Planning Board.'",
        "'speaker_14': 'These alone are sufficient reasons to warrant rezoning and for city council to approve the rezoning. In addition, the applicant has executed an agreement to build affordable units with the City of Denver's Office of Economic Development. We're contractually obligated to build a 70 units at 60% AMI or below.'",
        "'speaker_14': 'We estimate that this was five times the build alternative that would be required under the linkage fee ordinates, the five times the number of units we started out at 80% AMI. But after discussions with the neighborhood moved a 60% to make it more affordable, the applicant is committed to providing significant, publicly accessible open space and has already'",
        "'speaker_14': 'leased land at Denver Urban Gardens for a community garden. You'll learn more about our arrangement with Wonder down to the nonprofit community ballet in a moment. It is important to state that the applicant is interested in an ongoing dialog with the community, as is evidenced by our commitments to affordability, open space and cultural benefits.'",
        "'speaker_14': 'Our interests are aligned with the community. An example of this is in motion. Today the GSS Coalition introduced the applicant two brothers redevelopment in the US Community Land Trust. We are exploring opportunities with these entities. I am x three.'",
        "'speaker_14': 'Zoning opens the door to innovation, ongoing engagement, cooperation and mutually beneficial dialog which we are committed to. For all these reasons, I formally request the Denver City Council vote to approve Council Bill 19 Dash 0127 Rezoning 2535 East 40th Avenue from IEEE to Annex three.'",
        "'speaker_14': 'And I apologize for my speed reading.'",
        "'speaker_0': 'Thank you. Next up, Griselda Calderon.'",
        "'speaker_6': 'Good evening. So how many of you like to be ignored and pushed aside? We don't either. But we have constantly been ignored and pushed aside. My name is CRISELDA Calderon, and I have been a resident of swans here for over 25 years.'",
        "'speaker_6': 'I attended Swansea Elementary School when it only went up to second grade. And then we we were bused to Whitman Elementary after that. I have seen the changes in our community. However, not as many changes that I have seen since coming back home.'",
        "'speaker_6': 'After serving my country. Sorry. After being injured and returning to my beloved city of Denver. Gosh, I return to the beginning of a mess in the making. Our mayor, forgetting his past and hungry for more money, allowed and encouraged the destruction of our beautiful city.'",
        "'speaker_6': 'Instead of helping those suffering in five points, the mayor and the city of Denver allow gentrification to overtake five points. Now we are next. I have seen more and more of my neighbors being forced out of their homes.'",
        "'speaker_6': 'However, according to what we understand, is that we do not matter and that we are to suffer more and more. If you do not know Illyria songs here were the developer is trying to build their immense complex has already suffered plenty.'",
        "'speaker_6': 'First, our community is already marginalized and high risk for displacement. Some of the suffering is I-70. We are trapped like rats. Pollution. Dust. Construction of such great project has impacted us greatly. Not to mention the noise. And we still have more than four years left and summer is coming.'",
        "'speaker_6': 'We are to open our windows now because we do not have air conditioning. So who will rise up for us? Who will fight?'",
        "'speaker_0': 'I'm sorry, but your time is up. Next up, we have Angelina Torres. Angelina Torres.'",
        "'speaker_15': 'When I start, etc.. Selena Torres played Party de la Coliseum.'",
        "'speaker_2': 'Good evening, everyone. My name is Angelina Taurus. I am part of the coalition.'",
        "'speaker_15': 'They want to answer.'",
        "'speaker_2': 'I live in Swansea, you know.'",
        "'speaker_15': 'Solamente academic beneficios para individuals. Comparado a lugar. Nosotros queremos get competition scenarios. I look at pura for their material. This place ambiental in this unfamiliar and most conservative cultura liberal vecinos it's landless are familias necesitan alien Brasil that is.'",
        "'speaker_2': 'We don't just want benefits for those individuals that bought the place. We would like them to share with our neighborhood something that could help us deal with the displacement that our families and we have suffered. We would like to conserve our cultures and our neighbors and our community.'",
        "'speaker_15': 'Hoover did not done this as his address, but I lost my school near Aviles Como para la familia. The letter said that if familias Ingresos feels English knows it as yes.'",
        "'speaker_2': 'We need to cover the needs for the most vulnerable. For example, the families that have elderly families on fixed income and the rest of our neighbors. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Andrew Mele Gill. Say in your field? It could be, says me on my system, but if that's you, then you can correct it on the record. Thank you.'",
        "'speaker_13': 'Hello. My name is Andrew Keele. I own and live at 4052 Clayton Street directly across.'",
        "'speaker_14': 'The street from the Quest property in.'",
        "'speaker_13': 'Question. I'm speaking tonight on behalf of myself and my neighbors, including Marcio Juan de la Rose, Joey Anthony and Cecil Levi and Jamie Ramirez and my wife, all who live within a few blocks of the proposed rezoning. Some of them are.'",
        "'speaker_13': 'We are excited about the industrial zoning going away and having a mixed use neighborhood development that complements with and integrates into the neighborhood rezoning to I am x three assures. Lower building at three stories eliminates industrial use that are that are incapable incompatible with a neighborhood and brings in a chance for new housing stock, including affordable housing'",
        "'speaker_13': '. In addition, we are excited about opportunities for more public open space and community serving retail as well as the culture promise, as well as the cultural promise of wonder bound. The ballet going in IMAX three is a better fit for the neighborhood, and we embrace the zoning change.'",
        "'speaker_13': 'The neighborhood plan. The neighborhood plan addresses this. Please vote to approve KB 19 0127 Rezoning 2535 East 40th Avenue from IEA to IMAX three. Thank you.'",
        "'speaker_0': 'Thank you. And apologies for getting your name in there wrong. Raimunda, carry on and I'll call the next five up if you want to make your way up to the front bench. Rosa maria or to Rick or to Brie, Mercedes Gonzalez, Caitlin Lucas, Maria de Luna Jimenez and Laird Horrigan.'",
        "'speaker_0': 'And I apologize if I got your name wrong. Go ahead.'",
        "'speaker_15': 'My mother lets me know that Korean is simply casualness, but a lot of pleasure than been some more important this week.'",
        "'speaker_2': 'Good evening. My name is Raymond. The Korean. The implications the long term implications are also very important.'",
        "'speaker_15': 'And this is a promotional solution. I order eagle for Toronto therapy then el mismo la maison my solution them oscar the animals this arroyos easily one gives them a couple samples This place I'm in.'",
        "'speaker_0': 'And I apologize when you're doing the translation if you could just. There we go. Make sure to speak right in the microphone. Thank you.'",
        "'speaker_2': 'We need a solution right now and so that in the future we don't see the same situation. We know that there's more developing development coming at the same as these. They're going to cause more displacement.'",
        "'speaker_15': 'You're revealing a lot in this one. Separate Mazda maintainers. Yeah. With this place out there and you see every crisis, are those in control travesty in the Peru tampoco there's thumbs them as thumbs overalls contemptuous. Bless our mental ill plan the devil's in Dario Necesita save Travis.'",
        "'speaker_15': 'I sense they will not resume para evitar them to this place. I mean.'",
        "'speaker_2': 'I live in swans here, and I've lived in Swanson for more than 20 years. I was displaced in December, but thank God I was able to find housing. But we are still not safe. With all of the displacement happening, the neighborhood plan needs to be revised to prevent all of this displacement crisis.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Rosa maria. But.'",
        "'speaker_15': 'When I started this evening, the most incredible opportunity that my parents and my mother seem to have me and those images that all my children will now. But most important, you'll see when I'm persona, I think this will equal inappropriate testosterone ification where you mix up a little girl and I mean it in a total enrollment number'",
        "'speaker_15': 'with regard to this, you know, the larger this one case result is.'",
        "'speaker_2': 'We need to have the opportunity to have improvements in our community without displacement. We have waited for these services in the community for a long time. I'm a person on fixed income and I do not want that with this new zoning that I would be losing my house due to the high taxes that will come with it'",
        "'speaker_2': 'in the future. This will harm all of us and all of the neighbors surrounding the area.'",
        "'speaker_0': 'And could you just state your name for the record?'",
        "'speaker_2': 'Is the Monday. So let's he some more money.'",
        "'speaker_15': 'In order to stop. Maria.'",
        "'speaker_7': 'Thank you. Maria.'",
        "'speaker_0': 'Thank you. Mercedes Gonzalez.'",
        "'speaker_15': 'When I started this number as mentioned is Gonzalez the sorry party the LA quality Angus la elizabeth as sodium g la connection introduce plus Sarmiento e la salud.'",
        "'speaker_6': 'Cee lo i.'",
        "'speaker_15': 'Cee lo are you in this place? Sarmiento in voluntarily exterminate Sandow La Salud Publica Eleazar Syria e la calidad deby. The then was to accompany the.'",
        "'speaker_2': 'Good evening. My name is Hussein Mercedes and I am part of the Jazz Coalition. There is a connection between displacement and health. Yes, there is. And the displacement, the involuntary displacement has been harassing the health of the public health of our people and the safety and quality of life of our community.'",
        "'speaker_15': 'El Impacto is good RB accounts are the lost ground is this arroyo's last year? The better scenario is La mesa picked up? Joe is there maybe in single those boring Decatur wines. If we this bluster we just plaza that you meet the more annoying country meet a more middle America.'",
        "'speaker_15': 'You got to on the at the end you got to climb into gear but can no longer estoy cerca they set into phone I stress to really pardon me, but I'm in particular estava. Yeah, this has been quadrennial.'",
        "'speaker_15': 'You start yelling Cinco Puntos is me. Comunidad Estaba Agosto.'",
        "'speaker_2': 'The impact is very severe due to the all of these large developments and it's across the city. But our neighborhood is the most affected. I used to live. I lived in in five points for 24 years and I was displaced from there.'",
        "'speaker_2': 'And unfortunately I was able to find housing where now we have the I-70 project and this has been a huge stress, but that was the only place that I have found that was able to find.'",
        "'speaker_15': 'Is I got a really porky outcome. So this is this place. SARMIENTO Nosotros is was as mutually narrow as mutually narrow. But the policy, Tony por la Renta accounts are there. So it's high stress. It's a lot to really postpone the stress to really you crisis ideas go retire Estonian poquito make Corporal Georges circle setanta.'",
        "'speaker_15': 'But I mean, I got a really personal message into Atropos the atropos the symbol earlier, this salutary blip. But a move will go to replace the can do.'",
        "'speaker_2': 'And this was terrible. Getting displaced put a crazy amount of stress because it's so expensive to get displaced. You have all of deposits, you have the rent. And now, unfortunately, I have the other stress of being trapped right there by I 70.'",
        "'speaker_2': 'I really feel trapped and it's really terrible all of this stress and how it's affecting my health.'",
        "'speaker_15': 'See Wednesday's cameos Galaxy survivor Bonita Garoppolo is a cameo battle with let me set up around those other onset apparel. I can take the wearer. All I can to go must be Nero La Quinta gunman Thomas Dinero lac into the record records us almost as gluey those this dos cambios.'",
        "'speaker_2': 'Yeah and it's going to be pretty once you make all of this development it's going to be beautiful, but it's not going to be for us. It's going to be for for the people that come in from the outside, people that make more money, but all of us that are low income are forgotten.'",
        "'speaker_2': 'We're completely excluded from this choice.'",
        "'speaker_15': 'Be the journalist, be the one to stay this by Wednesday. This was a source. This plan is it this arroyo you Dominic to La Comunidad the la comunidad the recursos la comunidad mas vulnerably ghetto meaning quinta ghetto meaning went up told us this has why Emilia's not when you went to Tambin better than Ecuador and this was'",
        "'speaker_15': 'like where those who stayed as they went to this como Ciudad Como concert colors European status lost born them that in Paris without a bit of that Paraguayan estar they tanto they hinted that he nero tanto como la quinta must vulnerability look into poverty.'",
        "'speaker_2': 'So I would just like to ask you when you think about all of this development, please consider the neighbors to please consider the people of low income. Because I believe that you are city council. You guys are here to be worried about the people that make a lot of money, but also the people that are most vulnerable'",
        "'speaker_2': ', the people that are low income and the ones that are most affected. And I include myself and hold them.'",
        "'speaker_15': 'As parochial auto meaning Guinta he in which has great support poor you to me.'",
        "'speaker_2': 'I hope that you would consider this and thank you very much for listening to me.'",
        "'speaker_15': 'A plan Betsy Nadia Necesita Honorary CEO for care plan not to be and neither is keep the table but to here he has established our Los Vecinos DeLorean Motor Company that your character Toto then begins to affect other portals as those cameos battle the crookedness that are coming out of this.'",
        "'speaker_15': 'You know, they they this one's here. Yes. LA must affect the other and not just on greed. Those are some cause they don't. They use the toilet baby in the name. I got a moment I took a moment to choke it ball in traffic coagulate maravilla construction circuit as entered into Damascus.'",
        "'speaker_2': 'The neighborhood plan needs to be revised because in the plan there is no and there's no there's not an equitable development plan for the neighborhood to protect and stabilize all of the neighbors in the area. And all of Denver is suffering from this.'",
        "'speaker_2': 'But right here we are the most impacted. I am now a part of the community and swans here. And by right by where I live, there's always car accidents due to all the traffic that's going on. On top of all the noise and I live on BASKAS.'",
        "'speaker_4': 'We talk a lot.'",
        "'speaker_7': 'Thank you very much.'",
        "'speaker_0': 'Next up, caitlin lucas.'",
        "'speaker_4': 'Good evening. I'm Caitlin Lucas. I live at 4126 Clinton Street, directly across from the property in question. I support the rezoning to Annex three.'",
        "'speaker_10': 'Contingent upon continued community engagement and a negotiated community benefit agreement that engages registered neighborhood organizations in Olivia's Swansea. I'm generally supportive.'",
        "'speaker_4': 'Of the rezoning because I realize that the use by right of the property as it currently.'",
        "'speaker_10': 'Is zoned, as potential to lead to development that is not compatible.'",
        "'speaker_4': 'With the surrounding.'",
        "'speaker_10': 'Residential neighborhood. The mixed use.'",
        "'speaker_4': 'Zoning, on the other hand, has the potential.'",
        "'speaker_10': 'To act effectively as a transition zone between industrial zoning and the residential zoning.'",
        "'speaker_4': 'Thoughtful and deliver deliberate.'",
        "'speaker_10': 'Development of this site could provide a great benefit to the area. However, I'm disappointed in the city and the developer's lack of engagement with the community during the rezoning process.'",
        "'speaker_4': 'The rezoning of this property without proper.'",
        "'speaker_10': 'Community engagement sets a precedent that community feedback is not required.'",
        "'speaker_4': 'Or considered for similar projects in the future. It needs to fall in this city.'",
        "'speaker_10': 'To require and implement and lead a much more robust community community engagement process, especially in locations that have been noted as areas of change. I believe there's a path to rezoning that can be agreed upon by the community, the developer and the city, but that there needs to be an additional community engagement and buy in before the'",
        "'speaker_10': 'rezoning can be responsibly approved without conditions. I support the rezoning contingent upon a negotiated community benefit or development agreement that considers affordability, open space and transportation impacts.'",
        "'speaker_4': 'Prior to the approval of the project site development plan. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Maria de Luna, M.A..'",
        "'speaker_15': 'When I start this, I mean. Maria Elena Jimenez, EEOC Bartonella Coalition, the G.S. Entonces Nosotros Como coalition noise. Thomas Encontrado Lozano just goes on. Leave us in the will start giving unmask Sinestro.'",
        "'speaker_2': 'Good evening. My name is Maria the Luna Jimnez and I am part of the coalition. And we are not against this development. We are all for the new development because we like nice things in our neighborhood.'",
        "'speaker_15': 'Little Carioca. And this is it almost will not revision their plan, their scenario. But in a planetary scenario we poco they under we poco. That is the biggest of which one of those Milkins and those Milkins say son cuatro and son cuatro.'",
        "'speaker_15': 'Daniel's and Samuel's son Cuatro Daniel's the K and also Estado Para and the muchos familias.'",
        "'speaker_2': 'And what I think is that we need to revise the neighborhood plan because it doesn't talk about housing and doesn't talk about displacement. This was done in 2015 and that's been fought. That was four years ago. And since then we have lost so many families, so many neighbors due to all of the displacement.'",
        "'speaker_15': 'And also Fidel al-Saadi, Puestos and also Fredo Alexandre renters not Apostolos Cambios Ekrem okay on positive was better tambin get it most sad incluidos como comunidad como la Comunidad Karamazov Hasta pasando Isabella tiempo no cuando yai standards cosas encima.'",
        "'speaker_2': 'We have suffered increases in taxes, we have suffered increases in rent and we would like to be included. We want to know what's to come because we want the new development that's coming. We just ask to be aware and informed not just before.'",
        "'speaker_2': 'Right? It's about to happen when they.'",
        "'speaker_12': 'Tell us.'",
        "'speaker_15': 'Queremos. Okay, I got a bit of I do not. It will not cause I get that that viva todos caramel beneficio para total no solamente para owners, group personas, personas or origin. Get the animals email.'",
        "'speaker_2': 'And we want there to be an equitable opportunity for everybody, not just for a certain amount of people, maybe some people that have money. We want it to be equitable for everybody.'",
        "'speaker_15': 'Not all, says Kokomo Siempre Kay, the Colorado Sun. Bienvenidos. Nosotros is a community that knows will start a civil action Then those will start a civil person and nuevas non will start a civil cosign Leave us Pedro Tambien State dinner party their lunch table either la bueno no Solamente or Malo no solamente that is our local no'",
        "'speaker_15': 'solamente they outside their rent us simple there I said another year. Okay, so nice to see that they've got a company that they're very corporate.'",
        "'speaker_2': 'You know, we always we always hear people say that everyone is welcome in Colorado and we do. We welcome people in our community. We accept them. We encourage people to come in and into our community. And now with all of the developments, we want the benefits of that, too.'",
        "'speaker_2': 'We don't just want the consequences because all we get is an increase in our rent and an increase in displacement. So we don't want just that side of of things. We want the benefits as well.'",
        "'speaker_15': 'So I must get a cumbia sonification. So I said historian experiment and their como law and the commandments. You'll know those. But I must admit I look with Amazon La Isla McWherter, no rule non-negotiable, no solid common one enclosure paradigm in nosotros as they are then throw them those SRO you'll never get in most cases of Caribbean'",
        "'speaker_15': 'presented by Dallas Proximas this are all your skate sorry almost given away nil mas.'",
        "'speaker_2': 'And we know that the zoning is going to happen. We just asked to be included. We would like to continue talking and maybe negotiating a little bit and we want to establish this so that in future developments, once they come, because we know they are, that we are included in all of this.'",
        "'speaker_15': 'Gracias.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Laird, Corrigan and McCall. The next five up to the front bench Dawn Fey, Ashton Dennard, Kathryn ARD, Dawn Gilmore and Robin Reichert. Good.'",
        "'speaker_2': 'Good evening, City Council. My name is Laird Horrigan and I live at 4126 Clayton Street, which is directly across from the proposed development. I stand with the GSE Coalition in their position to accept the rezoning contingent upon three conditions.'",
        "'speaker_2': 'One condition that's particularly meaningful as of late is that a is that the developer conduct a traffic and construction impact analysis and provide the results of the analysis, including mitigations and recommendations to the neighborhood. The reason this is so meaningful is the magnitude and the scale of several construction projects that have impacted the neighborhood and many of'",
        "'speaker_2': 'the residents here tonight, including the drainage projects in City Park, Park Hill, the 39th Street Greenway, the continued struggles with the RTD line. And the I-70 project. It's a daily adventure trying to get to and from the places we live.'",
        "'speaker_2': 'And this project would be no different in that it would impact us directly and at the same time as all these other projects are occurring. So I.'",
        "'speaker_0': 'Just would like to.'",
        "'speaker_2': 'Support this rezoning, but with the conditions and consideration for the people that it would impact directly today and for the next four years. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Don Faye.'",
        "'speaker_8': 'Good evening, everyone, and thank you for hearing me out. My name is Dawn Fey. I am the president of Wonder around a501c3 nonprofit professional dance company. We have been in the building now for six and a half months and I will go into that relocation in just a moment.'",
        "'speaker_8': 'We are in Councilman Brooks's district at 80205 and we do extensive work with the community aside.'",
        "'speaker_4': 'From being a professional dance company.'",
        "'speaker_8': 'We do a lot of work in Title One schools, a lot of which are in Elyria, Swansea. We've also implemented a program for the homeless, which is called Pari Paso. I could go on and on about Wonder Brown, but I'd actually like to speak a little bit to the conversations that have been taking place tonight, as well'",
        "'speaker_8': 'as some of the previous conversations, if I may reference. Councilman Lopez mentioned earlier in an agenda item about creating a place for community and establishing relevance. This was echoed by Councilwoman Ortega. This was also talked about by Councilman Espinosa in terms of creating a place for community.'",
        "'speaker_8': 'And that's what we've done at Wonder Ground in our past. We were located at 1075 Park Avenue West, literally next door to Saint Francis Center across from Denver, Rescue Mission. And just up the street from Catholic Charities, we implemented a program for our community and our largest daily audience, which was the homeless at that point.'",
        "'speaker_8': 'And we put this in place in 2015. I have been having conversations with a lot of the people that I see here tonight who have come to our space and been introduced to who we are. And part of our responsibility as a nonprofit is to serve our community, is to create a place where everyone can feel welcome'",
        "'speaker_8': ', and that is what we plan to do. The arts are not just for the elite and the wealthy. The arts are for everyone and should be shared by everyone. And what we will do in our new home is create this place for community to gather, for children, for the elderly, for all peoples, regardless of any kind of'",
        "'speaker_8': 'status in this community. That is our our our guarantee that we will do that with our new home. And as an organization that was displaced previously due to our wonderful booming economy, we understand the relevance of being able to create a place that serves its community, and we want to do so for the long term.'",
        "'speaker_8': 'And with that, I would ask the council to I respectfully ask the council to approve the rezoning. Thank you very much.'",
        "'speaker_0': 'Thank you. Next up, Ashton Kennard.'",
        "'speaker_13': 'Good evening. My name is Ashton Kennard. I speak on behalf of myself as well as young activists in the black, Hispanic and Native American community of the Denver metro area. I am neither for nor against this rezoning because there's positives and negatives to each judgment.'",
        "'speaker_13': 'I instead am going to take this time to address you find men and women of the Council as well as my community, to say that this is a learning lesson. We need to understand that if we unify and come together to buy our neighborhoods, we can not be displaced and taken advantage of.'",
        "'speaker_13': 'If we took the time to unify and come together. We will be able to leverage our faculty, our assets and our voice to get wonder bound and the developer to allow us space in order to bring in black and Hispanic contractors so we can bring in money into our community, as well as bring in black and Hispanic'",
        "'speaker_13': 'entrepreneurs to better facilitate small business, as well as providing afterschool programs for our our children, black and Hispanic children in that space. We need to take this time to realize united we stand, divided. We are gentrified. Our best interests are among ourselves.'",
        "'speaker_13': 'But these fine and wise people who sit on the council, our elected officials and our public servants. That means if we take our voice and come together on one accord, they are willing to provide us anything that we need.'",
        "'speaker_13': 'But it all begins at home. If we do not buy our neighborhoods, if we're not taking advantage of the space that we already have. We are going to continue to be dispersed and pushed out. But again, the people who sit before us who are elected by us in order to serve us.'",
        "'speaker_13': 'So let us continue forward. Whether it's for rezoning to do residential and we can take a part in contracting and building up the space, bringing money into our community, or if it's left as an industrial zone. Because we all know the Swansea area is a food desert.'",
        "'speaker_13': 'There's no there's no supermarkets in that area. So if it's left industrial, we can still bring in supermarkets, supermarkets in order to facilitate growth in our community. But if we do not unify, if we do not stand together as black, Hispanic, indigenous people, we will be taken advantage of.'",
        "'speaker_13': 'This is a lesson. Same with the I-70 project. Let's not get angry, not get mad. But whatever happens from this point forward, let's be wise in our decision making and stand together. Unification. Thank you. Awesome.'",
        "'speaker_0': 'Thank you. Next up, Catherine are doing.'",
        "'speaker_4': 'Good evening. I'm Catherine Arden. And tonight I am here speaking as a resident representative of both the Grow House, a nonprofit in Elyria, Swansea, a really rooted in food access in this neighborhood, and also acting as a.'",
        "'speaker_6': 'Platform to.'",
        "'speaker_4': 'Amplify the voices of the folks of this community that often do get overlooked. So both as a representative of the Grow House, but also a resident of the 80205 ZIP code and a resident in walking distance of this this location.'",
        "'speaker_4': 'And as it stands now, I am opposed to the rezoning, and that is because of the approach that's been taking. That leaves out engagement and consideration of this neighborhood, which has a history of being left out and underserved.'",
        "'speaker_4': 'I would be willing to change my position if certain conditions were met.'",
        "'speaker_6': 'And those conditions include.'",
        "'speaker_4': 'Including a community benefits agreement that is signed with the GSA coalition and at least one Elyria, Swansea, a registered.'",
        "'speaker_6': 'Neighborhood neighborhood organization. The second piece that I would need to be included would be a complete.'",
        "'speaker_4': 'And.'",
        "'speaker_6': 'Full traffic construction impact analysis report on the neighborhood. As we know, there are significant construction and traffic developments.'",
        "'speaker_4': 'I, again, as somebody who lives right there, I also feel limited in my mobility. And the third piece would be to.'",
        "'speaker_6': 'Complete a.'",
        "'speaker_4': 'Transformative project process that includes the anti Displacement Displacement Action.'",
        "'speaker_6': 'Plan in the neighborhood.'",
        "'speaker_4': 'If these conditions were met, I would be really interested in seeing how this project could move forward. But at this point, I don't believe.'",
        "'speaker_6': 'That the the best interests of this historic neighborhood have been met nor considered. Thank you so much.'",
        "'speaker_0': 'Thank you. Next up, Bill Moore.'",
        "'speaker_13': 'My name is Bill Moore, the architect for the project. And I think I'm supposed to answer some questions on some dry technical issues. But first, before I field any of those, I just want to let you know I'm actually very excited about the project.'",
        "'speaker_13': 'Buildings in general aren't so popular these days in Denver, but this is an exciting project. I'm excited to reuse the existing building. I'm excited to design an authentic performing arts space. And I'm also exciting. If this were to pass, to incorporate residential uses into this plan, I think it makes for more vibrant plan and it would be'",
        "'speaker_13': 'contributing factor a little bit more in the design. The owners are huge supporters of the arts and other nonprofits in Denver. They're also very interested in having Wonder Brown be the heart of this development. It's really the public heart of the development adjacent to it.'",
        "'speaker_13': 'In the plan would be plaza, a public park, playground, gallery space as well as the Urban Garden. So I really do hope that you approve this and allow residential uses and I'll field some questions if you have any.'",
        "'speaker_0': 'Thank you. Next up, Robin Reichert and I'll call the next five up, Mauricio Moreno, Noemi go Alma Urbano, Rosa Maria Turvey and Jackie Carranza, if you want to come up to the bench. Good.'",
        "'speaker_14': 'Good evening. My name is Robin Reichert. I've lived in Swansea.'",
        "'speaker_13': 'Here for about six years.'",
        "'speaker_14': 'My family, I've got.'",
        "'speaker_13': 'Two young boys, love this neighborhood. We're part of the jazz, I'm part of the Jazz Coalition. And we want to see this. We want to see development. We want to see where there hasn't been something come.'",
        "'speaker_14': 'We want to see improvements.'",
        "'speaker_13': 'But to the reference some points here that have been previously made, if if you can't afford to stay in the neighborhood, that dance studio means nothing. It's an empty dream. And I think the missing piece in this conversation is the city has lots of data and studies about how investment, private and public investment causes displacement.'",
        "'speaker_14': 'It's linked in hundreds of.'",
        "'speaker_13': 'Study across the country, including some of Denver's own studies that private and public investments are directly linked to it, to mass displacement of low income neighbors. And that's what's been happening. That's already happening. We've been up here too many times already talking about this.'",
        "'speaker_13': 'And so for me, it's I'm just baffled how this process went through for nine however many months. And we didn't find out about it until a month before today's date. And I'm baffled that this that the city ignored their own process, that the general development plan was waived despite that this if you've been on 40th Avenue in'",
        "'speaker_13': 'New York and you've been stuck between the lighter rail, the the commuter rail and the Union Pacific line, why is there not a traffic plan here? It's astounding. And even more so, it's so frustrating that in the neighborhood plan, the Larry Swanson plan, it explicitly says, I have it here on pages two, 18, 21, 46 and page'",
        "'speaker_13': '126, the critical importance of reaching the neighborhood that has been historically excluded from this process. And so to send out a couple of emails to our no is not good enough. In no world is that good enough. There is ample nonprofits, ample community groups, ample ways to get the.'",
        "'speaker_14': 'Community involved, and none of that was.'",
        "'speaker_13': 'Done. So I just got to say, I'm so disappointed. I'm so disappointed with this process. I'm so disappointed with the planning department and what can we do? What are we doing here? If if every one of our pieces of civic engagement has been cut off and I'll tell you, the first public open meeting that the developer had'",
        "'speaker_13': 'was three weeks ago in the neighborhood, an open house. And I told the city, I told Tim Sanders and Irene Aguilar at that meeting how disappointed that I am. And they apologized and they said, we're sorry. They said the city dropped the ball in, not connecting between CPD, between OED.'",
        "'speaker_13': 'There was no communication between they told us they found out about this project from the same Denver article that we did. How is that possible? How is it that after years of advocacy, years of study, that it feels like negligence and honestly to the neighborhood, it makes this whole process feel like a joke because we want to'",
        "'speaker_13': 'be a part of this. We want to see these changes. But if we're not taken, if we're not included before that happens, then we won't be here to enjoy these amenities.'",
        "'speaker_0': 'Thank you. Thank you. Next up, Mauricio Moreno.'",
        "'speaker_13': 'What they mean. My name is Mauricio Marino. I'm a resident of Swansea. I lived there for the last two years and I'm supporting the signing change in. I just want to point that if it's not because the developer came out with this idea and have a meeting three weeks ago, like my fellows here say.'",
        "'speaker_13': 'We know we don't know anything about the group that is here opposing the project because they talking about including the community. But I think the community need to work for the community. And this is the first time in two years that I see members of the community talking about the community, caring for the community until this developer'",
        "'speaker_13': 'and this project come out. That's the first time that they hear from them. So my name is Mauricio Moreno and I support the project.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. No, go.'",
        "'speaker_10': 'Hi. Good evening. My name is Nola Miguel. I'm with the Globally Responsive Coalition Organizing for Health and Housing Justice. Nice to see everyone tonight. As Maria said, we're not anti-development. We're for development without displacement. What this really has felt like and all the things that have been said about the last minute notification, all that is that it's'",
        "'speaker_10': 'really set us up against this developer. And that's not.'",
        "'speaker_8': 'What we wanted out of.'",
        "'speaker_10': 'This or want in the future. But as you can see from all the neighbors that are here, Swansea neighbors are interested in this. So just saying that oh well nobody responded to an email that said I to IMAX three and maybe people didn't understand what that was or the the the hugeness of this project, 700 units, 14'",
        "'speaker_10': 'acres that we are interested. There's lots of people in Swansea that love their neighborhood, that care about their neighborhood and want to be.'",
        "'speaker_4': 'Involved in a.'",
        "'speaker_8': 'Critical.'",
        "'speaker_4': 'Project.'",
        "'speaker_10': 'That equals half of the existing units in Swansea. We want to be part of making that project successful and think that we have a lot to offer the level of this. Massaro saying globally. Swansea there's a lot that's going on in global response here that could offer to a project and benefit a project.'",
        "'speaker_10': 'I think one thing that's very clear from the amount of affordability that we were able to get out of this is that the linkage fee in the affordable housing fund is not enough. 15 units out of 700.'",
        "'speaker_8': 'That's insane. In the lowest income.'",
        "'speaker_10': 'Neighborhood that doesn't have restricted housing in it, like Sun Valley, Swansea, it doesn't have restricted housing. Every almost every single household except the county homes and the habitat homes are are vulnerable to displacement. So this happening in this context, something needs to be tweaked with how that's working.'",
        "'speaker_10': 'We need those affordable requirements to be higher. This, as Robin said, this at some point should have been flagged before we found out about it in Denver. Right. This should have been flagged. How did we not know about this?'",
        "'speaker_8': 'Did anyone put in lovely.'",
        "'speaker_10': 'Response and housing.'",
        "'speaker_8': 'Because they would have found the gas.'",
        "'speaker_10': 'Coalition if that had been the case. Or actually reach out and call any of the Arnaud's in the neighborhood, try to build a relationship, talk to some of the neighbors. That's process oriented. But if we want equitable outcomes, we have to have.'",
        "'speaker_4': 'Equitable.'",
        "'speaker_10': 'Process. I wanted to get in. You heard what our position is. We're asking for these conditions. You saw the evidence, hopefully in our letter. That evidence in each of the criteria that you are evaluating is backing up those conditions that we need a community benefits agreement, that we need traffic and construction analysis around this.'",
        "'speaker_10': 'This is adjacent to the train and the property in the concept plans. The housing goes all the way up to the train and I'm really concerned about that as well.'",
        "'speaker_13': 'Other stuff, but thanks.'",
        "'speaker_0': 'Thank you. Next up, Alma Urbano.'",
        "'speaker_4': 'Hello. My name is.'",
        "'speaker_6': 'Elmer Buono and I am here as myself, but also as a resident of the Swansea neighborhood. I'm also an employee of Project Voice, a youth advocacy and civic training organization that provides afterschool youth development opportunities for first round of school students right across the street from 2535 E 40th Avenue.'",
        "'speaker_6': 'My experiences growing up, living and now working in Swansea have provided me with a judgment to request our city council representatives to make sure that if the rezoning goes through, the safety, well-being and welfare of our community members is protected and treated with the highest level of dignity.'",
        "'speaker_6': 'So far, the community engagement process has been a total failure. The developer has refused to create a community benefits agreement with community organizations, and our city officials have come forward to argue in favor of the legality of such project.'",
        "'speaker_6': 'The developer has in fact done the minimum or just above the minimum. But in times of displacement, rampant homelessness in large investment schemes and previously forgotten neighborhoods like Swansea to the minimum is not only straight up disrespectful and negligent, but also deadly.'",
        "'speaker_6': 'The project proposal does not address the context of the neighborhood a predominantly brown and black neighborhood with mostly single family homes. It does not address first round of school families and students, 98% of whom are people of color.'",
        "'speaker_6': '98% of students also qualify for free and reduced lunch. Many of these students already travel 40 minutes out because their families have been kicked out of the neighborhood due to rising cost costs of housing. It is hard, I can tell you from my own experience, to concentrate on PSAT and SAT exams when your family cannot afford to'",
        "'speaker_6': 'pay a monthly rent. It is hard to focus when most of our income goes to pay for housing and there is simply not enough food at the table. I live on the other side of Central so I do not own a car.'",
        "'speaker_6': 'I have to walk from first round of school where I work along 40th and Clinton every day Monday to Friday. I deal with I-70, construction, traffic, congestion and fear. I encourage city official members, council members to answer the following.'",
        "'speaker_6': 'Would you allow a 700 unit rezoning plan to go through in your own neighborhood with only 10% affordable units for your own neighbors? Do you accept the terrible community engagement that has happened here? I ask the Council to please create the conditions for community members and developers to work together to develop and implement a community benefits agreement'",
        "'speaker_6': 'that supports and protects the health and wellbeing of one of our most targeted communities. Valeria Swansea. Thank you. Also Wonder Brown is not part of our community until they stand in favor of participate in the Community Benefits Agreement and leverage their connections to the developer to truly fit into the new space while also connected to the community'",
        "'speaker_6': '. Thank you.'",
        "'speaker_0': 'Thank you. Rosa maria Torres, Jackie Carranza. And I'm going to call the next five up to the front bench, Jim Garcia, Kathy Patchell, Yadira Sanchez, Ruben Sanchez and Carol Briggs. Go ahead.'",
        "'speaker_4': 'Good afternoon. I'm Jackie Collins. I am one of the residents on 4065 Milwaukee Street. I'm not for or against it. I think gentrification is great, but there is also a limit to where gentrification can be. I'm a single mother of one, so my only concern is to be displaced and I have nowhere to go if taxes am'",
        "'speaker_4': 'property or property taxes go up. So that is my only concern. So I hope that we can come together and I don't know. Make a great exception. Have more of a realistic ideas for this building to come up for.'",
        "'speaker_4': 'So I'm sorry for not having anything prepared, but this is kind of what I'm here for because I was kind of lost of what was happening until our first meeting on April 1st. So thank you.'",
        "'speaker_0': 'Thank you, Jim Garcia. Good evening. My name is Jim Garcia here representing clinical orthopedic clinic. Orthopedic is a community health center that has been located in the Elyria, Swansea neighborhood for the past 15 years. And we provide primary health care, mental health services and oral health services to the residents of the Yes community and the surrounding communities'",
        "'speaker_0': '. For the past three years or so ago, we started the process of when we realized that we would no longer had capacity at our current facility in the Globeville neighborhood. We made the conscious decision to explore a new site at 48th and raise in the Swansea neighborhood.'",
        "'speaker_0': 'And when we did so we were very intentional about partnering with the Urban Land Conservancy to work in partnership with the neighborhood, because we know that community health is much more than what happens in the exam room. It's what happens out in the community when we talk about the social determinants of health.'",
        "'speaker_0': 'One of those being housing. And so it was a very easy decision for our board and our and our team to pursue the project at 48th and raise. And as part of that process, it started I said it, like I said, about three years ago, over the past year, we were able to engage in authentic community engagement'",
        "'speaker_0': 'with with the residents of Globeville, Elyria, Swansea, and to enter into a partnership for the development of our project that at 40th and raised and when it was brought to our attention to my attention about the proposed project, it seemed to me knowing what we initiated and participated in with the community to do to engage in authentic'",
        "'speaker_0': 'community engagement, we felt like this is something that's indeed possible and and in fact should be expected of of the community in our in our community leaders. So I would just say that we would like to see a similar process involved involving this project where the community does feel engaged and included in this process.'",
        "'speaker_0': 'So and that entails a community benefits agreement similar to what we have in place. Thank you. Cathy Patchell.'",
        "'speaker_4': 'Good evening. My name is Kathy Patchell. I'm a member of the community. And I am neither for or against the rezoning of our neighborhood or the property in question. However, I agree with my community members that it's very important that the rezoning excuse me, is aligned with the community properly.'",
        "'speaker_4': 'From what I heard at the beginning, the statements coming from the developers sound like they're interested in doing the minimum. They have a certain percentage of housing that they have to accomplish and a minimum amount of space they have to give up.'",
        "'speaker_4': 'And that's not aligning with our community, is properly that's getting by and then completing your own goal. What we need is a proper comprehensive plan that benefits the community, not just gets by and you know, further communication needs to be had because we haven't had it in the past and the properties already been purchased.'",
        "'speaker_4': 'And so before deciding on rezoning, I think that needs to be addressed. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next up, Yadira Sanchez.'",
        "'speaker_6': 'Hi. Good evening. My name is Yadira Sanchez. I am part of Swansea, a neighborhood. I've been living there for about six years. I am also part of the Jazz Coalition, so I have a lot of things to say, but I'm going to try to say them as fast as I can with making as many points as I'",
        "'speaker_6': 'can, because there's a lot of things that need to be said. We did meet with the developer, like they said, probably the 1st of April, and then we tried to talk to them. They did say that they had an agreement with considering one of our plans, which they did not.'",
        "'speaker_6': 'We also had the city there who said that they do agree that there is a lot of wrongdoing in their part for allowing a lot of this construction to happen all at the same time, and for not giving this notification in a proper way.'",
        "'speaker_6': 'However, giving your apologies doesn't fix the problem or being non aware or being there to service your community is also not okay either because that's what you're there for. We are here together united as a group to try to speak to you guys about what is being done, which I don't feel.'",
        "'speaker_6': 'I don't feel like is right. Wander around is great. However, you're not a school you're you're already a steady dance group and our community needs more more proactive. If you would be a school, that would be wonderful to allow everybody to join.'",
        "'speaker_6': 'But having this are inviting us to come and visit you guys, seeing you already do all your things well, that's great, but that doesn't help us from saving our community. There are a lot of things happening or going wrong with the zoning.'",
        "'speaker_6': 'If we allow this to happen, more displacement is going to continue to grow. They are offering units at 60%, but in this neighborhood we need more like 30% to 20% because there is a lot of need. And the city needs to focus, too, on getting together with all of the construction.'",
        "'speaker_6': 'When they are allowing all of this zoning situations to happen is that we do live there and we are under a lot of stress and it is quite a joke when you wake up one morning and you're going on one side of the road and the following night you're not.'",
        "'speaker_6': 'Sometimes you end up running into sidewalks and posts because you just don't know where you're going anymore. It's hard to get to our home where we have our lives in allowing this to continue. It's just opening doors for more developments to come in and feel that they could do and destruct and take away what is already there'",
        "'speaker_6': '. And they're allowing this to continue and saying that they're here for the community by opening their gardens, but closing their streets or, you know, having a stressed out through all of these situations that are happening. And I don't think they're right.'",
        "'speaker_6': 'I think that the city needs to take into consideration and working together with the benefits agreement plan and the neighborhood. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Ruben Sanchez. Ruben Sanchez. All right. Next up, Carol Briggs. And I'm going to call the next five up, Bree Ice, Elijah Buford, Virginia Calderon and Jesse Pierce. Go ahead.'",
        "'speaker_16': 'Hi. My name's Carol Briggs, and I live at 4027 Fillmore, which backs up to Clyde Clayton. And I understand that it's unrealistic to think that no rezoning or construction is going to occur in the Swansea neighborhood. I do believe that I and all my neighbors deserve a voice in this process.'",
        "'speaker_16': 'The current project will significantly increase the population of my neighborhood, so I would approve a rezoning if a community benefit agreement is developed and signed by by the Clu, Globeville. Elyria, Syria Coalition. A minimum of one other registered neighborhood organization and the developer.'",
        "'speaker_16': 'The Gas Coalition has been the organization that has ensured that the information has gotten to my door. It has not been the city. They've also provided me the opportunity for me to hear the views of others in the community and the surrounding areas on this project.'",
        "'speaker_16': 'It is beyond my understanding that a traffic impact report was waived with the already existing traffic challenges in the I-70, I-70, construction, the drainage project, and what is required by this. This construction project will significantly impact traffic. The increase in property value often precedes significant displacement in a neighborhood.'",
        "'speaker_16': 'It is important that the process include the city led completion of the transformation project, an anti displacement and an anti displacement plan. No site development plan should be approved until these two plans are completed. It is very difficult to separate the rezoning from the project itself.'",
        "'speaker_16': 'I think as you've heard from my neighbors, the rezoning isn't really our issue. Rezoning is actually a good thing for us because industrial really isn't what the neighborhood needs. But I also know with the process that the city uses that when I say yes to rezoning, I'm almost saying yes to the project.'",
        "'speaker_16': 'And I'm not saying yes to the project. I, I can't say yes to 700 units that my neighborhood for three of us probably to get together and live together could afford to freakin live in. I can't say that.'",
        "'speaker_16': 'Would you do it? Would you do it to your neighbor? This neighborhood has been displaced and displaced and displaced, and it has been our lack of care, lack of concern for those who sit in this room that don't look like me.'",
        "'speaker_16': 'And I know that. And I know I'm privileged to be in this neighborhood and my neighbors need to be heard, just like I need to be heard.'",
        "'speaker_0': 'I'm sorry that your time is up. Thank you. Thank you. This.'",
        "'speaker_4': 'Good evening, everyone. My name is Bria Zizi and I am neither for nor against this bill. But I am here to say that we need an equitable development plan. I appreciate the opportunity to speak with you all. And I work for Project Voice and we've worked with the GSE community for the past 13 years.'",
        "'speaker_4': 'We train, employ and organize youth and we specifically work with Bruce Randolph High School and middle school students. And this is situated just a block away from this proposed development. And given this proximity to our students school, we need to address the issues of equity in the design, the planning and the process to ensure the well-being of'",
        "'speaker_4': 'our youth and their families in the GSA community. And that is why we're asking for you to consider the following conditions. One A Community Benefits Agreement developed and signed by the GSA Coalition and Delirious wants your R.A. to complete a full traffic construction impact analysis report and report this back to the neighborhood.'",
        "'speaker_4': 'I think this is an imperative because we've already seen that mobility in the neighborhood has diminished because of other infrastructure projects that are happening like I-70. And three, completing a transformation project process that includes Anti Displacement Action Plan.'",
        "'speaker_4': 'Currently, right now, as you've heard from other folks tonight, there is 60 units at 60% AMI. And that does not fit the needs of the community and specifically for youth. Involuntary displacement destabilizes their social networks routines and has directly been linked to decline in school performance.'",
        "'speaker_4': 'So I would ask that we consider an equitable development plan and that we prioritize the well-being of girls, youth and their families. Thank you.'",
        "'speaker_0': 'Thank you. All right. Next up, Elijah Beaufort.'",
        "'speaker_2': 'That's me. How you guys doing? So my name's Elijah. I'm a youth leader in social activism community, also known as Young Activists. And I'm neither for nor against the re the rezoning project. And the reason is because, you know, first and foremost, I believe that we are doing the minimum to actually help out these communities of color'",
        "'speaker_2': '. I believe that we can actually be doing more as a community to be doing that. And no matter which way you go, if you're for a project against the project or in between with the rezoning, it's not owned by us.'",
        "'speaker_2': 'It's not owned by people of color. It's based off of a Caucasian mind, you know, just saying the elephant in the room. And it's true. So no matter which way you go, you have to understand that the key element to life is experience.'",
        "'speaker_2': 'You know, experience is the best education you can have, right? Everybody knows that here. And with this gentrification going on, pushing communities of color and the outskirts of Denver and moving a lot of white people in the middle, we understand that we have to improve our communities, you know, before that happens, because you have to understand your'",
        "'speaker_2': 'history before you know, the future repeats itself. So we have to understand how to improve communities. And honestly, I challenge all you guys who are not of color in here. If you truly want to see improvement in these type of communities, if you truly want to see change in these type of communities, you have to put your'",
        "'speaker_2': 'money where your mouth is. You actually have to put your foot down and say, I'm going to help out these communities of color as well. The question is how, if you're going to do these rezoning projects, make it affordable for people like these beautiful individuals to actually be able to live there comfortably, not survive, but live there'",
        "'speaker_2': '. Make make sure that their educations there as well. For example, if people want to be doctors, lawyers and be able to actually rebuild their communities, have that as an opportunity, have that as a access point in that area.'",
        "'speaker_2': 'Also, we have to really understand the only people really fighting for their communities in their areas is people of color, minorities. You're not going to Chinatown is doing the same thing. You're not going to places in the Jewish community doing the same things are not going to the suburbs.'",
        "'speaker_2': 'It's always a problem in the black and Hispanic communities. And of course, you know why? Because we have no financial freedom. We have no financial literacy. We don't know what we're doing. So if you care as well, also finances and economic classes there.'",
        "'speaker_2': 'So we could be able to understand how to improve our own communities because you have to love yourself before you love anybody else. So support improvement of us in order for us to actually create economic change in those communities.'",
        "'speaker_2': 'Because at the end of the day, it's not going to be owned by us. So we have to be able to understand and learn from these experiences in these oppressive systems, how to build within our own. Thank you very.'",
        "'speaker_0': 'Much. Thank you. Next up, Virginia courtroom.'",
        "'speaker_15': 'We want to start with you, Michael Barone Precedenti the L.A. Sun support up your show and yours.'",
        "'speaker_2': 'Good evening. My name is Bettina Calderon. I have been a resident of the Lake Area Swansea neighborhood for 2028 years.'",
        "'speaker_15': 'For 28 years, ESTELLA, we've been fortunate. I mean, in a state here either so fortunate I mean for two entities operating on Lou and we are saving the Oshawa animals for the animals we need to maintain our aura this are fortunate I mean to them Podemos we rely Espinosa's done incremental on the west Tantalus cost of living'",
        "'speaker_15': 'and.'",
        "'speaker_2': 'I've been fortunate to live there for 28 years because 28 years ago we could live there comfortably. And now unfortunately we are facing increases in our rent and unfortunately we are being displaced.'",
        "'speaker_15': 'Escuchar la palabra ignorant A.The main thing.'",
        "'speaker_2': 'I've heard the word ignore recently.'",
        "'speaker_15': 'You know that a lady Tomika Griselda Calderon. Yeah. We be laboring for being disinclined use. Yeah, ahora. No kidding me. Is that in firma e tambin Potomac? A la construction dragon, though, that I can do la tierra aura Millsap where we really yona see if of Korean mosaic or even that famous proportion and Bebe and as close'",
        "'speaker_15': 'to slow system will say.'",
        "'speaker_2': 'And ignored has been said by my daughter Griselda Calderon, who has lived there for 25 years. She is sick and she continues to live. There's we can all continue to live there. And here we swallow this pollution, we swallow this dirt.'",
        "'speaker_2': 'And now, even besides all of that, we are willing to stay there. We just ask for affordable housing and an opportunity to stay in our neighborhood.'",
        "'speaker_15': 'So center for Santo the I am it e now is sufficient para nosotros nosotros no analysis. I can tell you that necesitamos must reduce sickness and loss Median.'",
        "'speaker_2': '60% asthma is not good for us We do not make that much money. We need a lower cost of this so that we can afford to live there.'",
        "'speaker_15': 'Jentleson is telling me Randall story for those sequitur. At the end of that I put the hair in on the photos. Como comunita?'",
        "'speaker_2': 'You guys have been looking at us for the past two years. For the past two years we have been trying to figure out how to protect ourselves as a community.'",
        "'speaker_15': 'As soon to be more another neocon condor to Sarajevo. It is on Miembros LSU that.'",
        "'speaker_2': 'A month ago we had a meeting with the developer and some city council folks.'",
        "'speaker_15': 'You can respond, they'll ask you a question. Committee Member Reuters If their sorcerer is a stand up at the end.'",
        "'speaker_2': 'What does the city say? That they're making mistakes and through those mistakes are learning.'",
        "'speaker_15': 'You know, so.'",
        "'speaker_2': 'What about us?'",
        "'speaker_15': 'I saw those customers up at Indian Motel. Also seen alarmism.'",
        "'speaker_2': 'What are we learning from all of this? Just that we're going to keep following the same thing.'",
        "'speaker_15': 'Kellogg has done up in the industry, this time being Kellogg in the proportion that will stay the same or sort of.'",
        "'speaker_2': 'What are you guys learning from all of this? What are you guys going to provide for us?'",
        "'speaker_15': 'If some Australian dollar is royalties in LA Comunidad, even in my supposedly mountainous area, Ms.. Burton made caramel supper and there there is a caramel formerly sorry caramel to plan, but apparently strangely.'",
        "'speaker_2': 'And there are already a lot of developers in our in our neighborhood and there's more to come probably. And what we want is a way to be able to communicate and to be involved with all of this development themselves.'",
        "'speaker_15': 'Those who think cancel them or tambin or cancel them. A stress reduction.'",
        "'speaker_2': 'If you guys are tired of us, but we are also tired of our situation.'",
        "'speaker_15': 'And the stress situation. Espinoza Recitation of the power meal or samples. Dolores Almas Photo narrator.'",
        "'speaker_2': 'In our situations, awful. It's embarrassing. It's our situation is paying 1800 dollars a month just for rent.'",
        "'speaker_15': 'You're not a common lady. Show Anteriormente that mythical amicable status put empanadas in, you know, sort of seeping in afterwards. I can tell you that.'",
        "'speaker_2': 'I've said it before. Maybe you guys can't even afford to pay this and we're supposed to be able to pay that somehow.'",
        "'speaker_15': 'So center por ciento is the machado para nosotros not freedom of the two. We are in consideration. Capulet run by her was 24. Lamine wasn't quite in town trying to persuade simply I am a.'",
        "'speaker_2': 'And 60% is way too much for us. Maybe you guys could please consider to lower it that maybe at least a 40 or 30%.'",
        "'speaker_15': 'Amy and I trust family have made assembly. We do not know that there are no strong family left medicine. They do not come. You don't even lugard on their lives.'",
        "'speaker_2': 'Our families deserve a home. Our families deserve a bed in a place in which to live.'",
        "'speaker_15': 'But implementable, to commit their lives.'",
        "'speaker_2': 'To simply to be able to eat, simply to be able to live them.'",
        "'speaker_15': 'Because some of lucky.'",
        "'speaker_2': 'As any of us that are present here.'",
        "'speaker_15': 'Which are with us.'",
        "'speaker_2': 'Thank you very much.'",
        "'speaker_0': 'Thank you. Next up, Chelsea Paris. Mm.'",
        "'speaker_13': 'Jesse Pierce represent for Denver, home of South Low. Positive action. Commitment for social change. And Black Stars more for self-defense. And I'm also an at large candidate for the At-Large position. I'm on top of the ballot for the May 2019 election.'",
        "'speaker_13': 'We are against this rezoning for all of the reasons that have been stated tonight. As usual, this current council is going through with rapid gentrification measures that are violating U.N. resolutions. The U.N. was here two months ago. This current council, when mayor is in violation of all kinds of U.N. resolutions and you guys continue to turn a'",
        "'speaker_13': 'blind eye to it. But the members of the community and those that are running for office are not turning a blind eye to it. And we see it loud and clear for what it is. This is not gentrification.'",
        "'speaker_13': 'This is communist side. This is ethnic cleansing. We are being ethnically cleansed out of our neighborhoods and our communities. And this current council was not doing anything to mitigate or stop this from happening. So I say as a city council representative, candidates hit candidate at this time.'",
        "'speaker_13': 'We need to sweep the council like this with the homeless every night. We need to elect new members of council and mayor that actually can empathize.'",
        "'speaker_0': 'And Mr. Pierce, please talk.'",
        "'speaker_13': 'To those that are suffering in this town. We need new, bold leadership. We need people that are actually going to have these discussions with the community, not wait for the last minute to have these discussions with the community, not put these things on a community at the very last moment in seconds.'",
        "'speaker_13': 'This is ridiculous. This council should be ashamed of itself. Sweep the council like they sweep the homeless every night. Vote May 7th. Your ballots drop. Mr. Barrett.'",
        "'speaker_0': 'Do you have anything to add on the topic of this public hearing? Thank you very much. All right, that concludes our speakers. Are there any questions from members of Council Councilman Brooks?'",
        "'speaker_9': 'Yeah. Thank you, Mr. President. Can we get CPD? I just have a couple of questions. There are a couple of questions regarding the general development plan and that CPD did not require in our development plan. Can we can we talk about that a little bit?'",
        "'speaker_9': 'And a traffic study, I believe one of the speakers talked about didn't require a traffic study.'",
        "'speaker_10': 'I can start with the traffic study, then I'll hand it off to Sara Showalter. What? I understand that a traffic study will be required at time of site development plan. I spoke with public works and they were pretty clear about that requirement.'",
        "'speaker_9': 'Okay. So the developer will be doing a traffic study? That's correct. Thank you. Sir.'",
        "'speaker_10': 'Good evening, everyone. Sarah Showalter from Community Plan Development. So to address the question about a general development plan, the Denver Zoning Code says that CPD will make the determination whether a general development plan should be required or not.'",
        "'speaker_10': 'It gives some guidance on things to consider and includes the size of the site. It includes whether there would likely be phase development with multiple owners. It includes whether the site is within 100 feet of a river corridor, whether a neighborhood plan calls for GDP.'",
        "'speaker_10': 'Those are just examples of the things it says to consider. So CPD at the time that the PRE-APPLICATION happened for this rezoning very early on, considered all of those different factors, things that led to the determination to not require GDP include the fact that there is the neighborhood plan does not call for GDP here.'",
        "'speaker_10': 'And what the proposed rezoning is is in alignment with what the neighborhood plan does call for an industrial mixed use three storey building the or zone district. The neighborhood plan does not call for any major street connections through the site.'",
        "'speaker_10': 'If we have a neighborhood plan that calls for street connections will often use the general development plan as a way to make sure that that will happen. But there that wasn't part of the neighborhood plan. And there aren't really there could certainly be street extensions into the site for sure.'",
        "'speaker_10': 'I don't mean to imply that there isn't any need for connectivity into the site, but there wouldn't be any major connections because of the railroad tracks and lack of connectivity of anything to connect you to the West Side.'",
        "'speaker_10': 'So through the site development plan process, we are able to ask for those things. And one of the big things that the code says about whether to do a DDP or not is to also consider if there are other regulatory processes available, such as site development plan review, to be able to get what seems adequate for the'",
        "'speaker_10': 'site, given the fact that the rezoning is actually decreasing the intensity that is allowed on the site. The current zoning idea allows for a lot of heavy uses that the new zoning would not allow. It also has no height limit.'",
        "'speaker_10': 'It has kind of the older model of zoning we had in the city for a long time called a far floor area ratio with no height limit. The new zoning will limit the entire site to three stories in height.'",
        "'speaker_10': 'So it's actually another reason we'll think, oh, we might really need a GDP is if there's going to be a significant increase in intensity indicating we might need significant infrastructure improvements. Again, not to imply there will be no infrastructure improvements, but they are could be accomplished through the site development plan review such as the traffic study that'",
        "'speaker_10': 'was already mentioned. That's a common procedure that would be part of the site development plan review process.'",
        "'speaker_9': 'You touched on something that was one of my questions and it was the intensity of height that the current zoning idea requires. This is a bit of a, you know, effort. The zoning is depending on what you're trying to do.'",
        "'speaker_9': 'So can you give in layman's terms to folks who are watching who who are here, what could be built?'",
        "'speaker_10': 'Under the current zoning with the idea. Yeah, sure. So the way the floor area ratio works is it's basically a multiplier of your how large your property is. And in this case, it allows for up to a maximum of two times the site.'",
        "'speaker_10': 'So that could be two. Just to keep it simple, there would be some required setbacks, but basically that means you could just build like a two storey building across the entire site ish. This is very, you know, rudimentary description of how a fireworks or you could squeeze it all into a much smaller building because there's no height'",
        "'speaker_10': 'limit, however, however tall you could get until you'd run out of floor area. So there's a lot of options with a huge site like this because it's 14 acres, obviously would probably be multiple buildings, but collectively, all that floor area could be up to two times the square footage of the site.'",
        "'speaker_9': 'Okay, great. Thank you for that. Laura Brzezinski question for you regarding this housing we've been talking about this development and regarding some sort of housing requirement. Right now it's 70, 70 units at 60%. Am I do we have a recorded contract that that's deeded with?'",
        "'speaker_9': 'And also which hasn't been brought up is the developer has agreed, I believe, that if they cannot do this development within two years, that they will give the land to a nonprofit to develop it is that deeded in in the contract.'",
        "'speaker_4': 'So Laura brzezinski with the Denver Economic Development and Opportunity Office there is a an agreement to provide affordable housing at this site. It is 70 units and that would be affordable at 60% AMI or below. What was it mentioned earlier is there's also a requirement to build at least 30% of those units with two or more bedrooms'",
        "'speaker_4': '. So there are some family sized units. What the agreement states is that the developer would be required to build the affordable units within the first phase of development so they can build up to half of the acreage and then they must provide the affordable housing.'",
        "'speaker_4': 'So we recognize that there are some external factors in terms of development and timing of development. So we wanted to provide some flexibility given market conditions to phase the development of the affordable units in alongside the market without having the specific time constraints of a two year time period.'",
        "'speaker_9': 'And and if the developer cannot, this is a little bit of complexity on tax credit. There's another tax credit deal at 40th and raise a lot of folks who have been doing developments and geese don't feel like they've been competitive and not been able to get tax credits if they do not get the tax credits, is there'",
        "'speaker_9': 'another mechanism that's in there that this is what I was told? So I'm seeing if they can't do the development well, they did it to another nonprofit to do that development.'",
        "'speaker_4': 'So the agreement does not require that they did it to another developer. It's flexible in who develops the affordable units, whether it's this developer or a partner developer. But because the agreement states that there must be 70 units produced at 60% AMI, it doesn't also require that they are developed through tax credits.'",
        "'speaker_4': 'So those 60% of units could be developed with or without tax credits.'",
        "'speaker_9': 'Okay. Thank you. I see a lot of folks in the queue, so I'm going to let my colleagues yield my time to my colleagues.'",
        "'speaker_1': 'And Brooks. We've got Councilman Ortega up next.'",
        "'speaker_11': 'Thank you, Madam Pro Tem. Let me first start with Bill Moore, if you wouldn't mind, coming up. So I'm just thinking about some of the infrastructure that is going to be needed on this site. This is a big site and typically a GDP is required on anything that is ten acres or more.'",
        "'speaker_11': 'This is 14. Talk to me about storm drainage, what street extensions might look like. How how much open space is expected in terms of acres or size of the the open space?'",
        "'speaker_13': 'Well, currently there is a storm drainage program on the site. It was a little bit. It appears like it may have been cut off by RTD because they they brought their line around. And so they've had to redo it.'",
        "'speaker_13': 'So that is going to be changed to accommodate the whole site with her.'",
        "'speaker_11': 'Explain what that.'",
        "'speaker_13': 'Means. Well, I maybe I almost don't know enough to explain that. What I do realize that the storm drainage was had been recently updated because it was altered when the RTD line cut off what I believe was the historic extents of this parcel, if that makes sense.'",
        "'speaker_11': 'So in other words, you would tap into the existing storm drainage that was built as part of the RTD line coming in. But does that not require you to have to do more to deal with onsite storm drainage for a property of this size?'",
        "'speaker_13': 'We will be doing we will be doing a new plan that incorporates what exist and then also new drain, a new addition to that drainage system. Okay. And with regards to the streets 41st and 42nd would cross Clayton.'",
        "'speaker_13': 'So we're just aligning our access points with 41st and 42nd as well. We're not. And the other along 40th, those access points are staying as they are currently.'",
        "'speaker_11': 'Okay. And do you anticipate that this would be done in phases?'",
        "'speaker_13': 'You know, it's it is large. So it's really hard to say at this time.'",
        "'speaker_11': 'And I guess I'm just trying to understand if just hearing what Mr. Brzezinski said in terms of the phasing and when the affordable units would need to be done. And am I correct in assuming to do this at 60%, the expectation is to access the tax credits.'",
        "'speaker_13': 'That's one of the avenues that the developer is going to pursue. But there may be others.'",
        "'speaker_11': 'So is there any chance that if other avenues could be pursued that to secure tax credits could actually achieve a lower emission rate? And is that something the developer is actually considering?'",
        "'speaker_13': 'That's possible. It's been a fire drill to develop the agreement. And so, you know, I can't speak beyond the way it's worded, but yes, I mean, that is possible.'",
        "'speaker_11': 'So the agreement right now that exists is just on the affordable housing, and that's with our housing office. Is that correct?'",
        "'speaker_13': 'I believe that's the sign portion. Okay. And but you made an earlier question about open space, so I didn't speak to that. But go ahead. Currently, we we have a commitment to provide 20% open space. The code requires ten.'",
        "'speaker_11': 'Okay. And. That's expected to be internal to the project.'",
        "'speaker_13': 'It will be internal to the project, but a large component of it will be public space. So there is going to be a park. There's a plaza that's adjacent to the underground performance space. So it's the intent is that it is public space.'",
        "'speaker_11': 'Okay. So, Sarah, would you mind coming up for a moment? Thank you, Bill. If I have any others, I'll call you back. Hi. So, Sara, I'm just looking at the criteria for GDPs. So it talks about large scale.'",
        "'speaker_11': 'Typically, it's ten acres anticipated to be developed in phases or maybe owned by more than one person or entity, which, you know, may or may not be the case on this project. I know it's not unusual. We saw that with the St Anthony's project.'",
        "'speaker_11': 'We've seen that with many other properties that were, you know, either similar or smaller in size. I guess I'm trying to understand, looking at the criteria, anticipated infrastructure. I mean, clearly, drainage is one of those the parks that would need to be built, that open space would be considered infrastructure.'",
        "'speaker_11': 'So why is it that the city made a decision to not require a general development plan as as opposed to. Let me just stop at that. Why did the the city planning staff decide this site, which far exceeds ten acres and has some phasing and has some of the things spelled out in the criteria, but yet did'",
        "'speaker_11': 'not call for that?'",
        "'speaker_10': 'Yeah, sure. So size is definitely one of the things it does consider, but we've had other sites that are larger. We have not done a GDP. There's a rezoning recently in front of you for a site well over ten acres, the old city headquarters.'",
        "'speaker_10': 'There's no general development plan there either. So size is is an important consideration, but it's not the deciding thing. We also look at a lot of other factors. So you brought up the infrastructure needs, which are really important.'",
        "'speaker_10': 'We worked. We don't just make the decision alone and CPD, we talk to other departments, including public works and parks. And the the input that we got was the likely infrastructure needs for this site, especially given the fact that this is an up zoning and in some ways is even a down zoning would be easy to get'",
        "'speaker_10': 'through the typical site development plan process that we didn't need a larger planning effort. GDPs. This gets a little bit too the phasing and ownership question as well. GDPs are often really helpful when particularly about the time or there's a definite plan in place.'",
        "'speaker_10': 'There's multiple owners. GDP is a great way to make sure there's a plan in place for all the infrastructure to get built as needed and potentially even identify phasing. In this case, we had one consistent owner across the entire site and when we talked to the engineers in that area, whether it was about traffic and street connections'",
        "'speaker_10': ', whether it's about stormwater, the feedback we got is, although those are important things and they'll definitely be addressed, the requirements and process through site development plan will be adequate to get what's needed. There wasn't a separate need for a bigger framework, Plan B or GDP.'",
        "'speaker_11': 'And can you just explain what the community input is in the site development plan review process?'",
        "'speaker_10': 'There's no required community input. If a applicant voluntarily shares information with the community, they can definitely do that, but there's no required process for public input.'",
        "'speaker_11': 'Okay, I have some other questions, but I know we have people in queue. If you could just put me back in, I'll come back with my others.'",
        "'speaker_0': 'Sounds good, Councilwoman Black.'",
        "'speaker_4': 'Thank you. Thank you, everyone, for coming out tonight and for your passion for your community. I heard you loud and clear. Your concern is gentrification and displacement. And someone mentioned the Neighborhood Equity Stabilization Team. Is anyone here from that office tonight?'",
        "'speaker_4': 'Of course. So I'm just very curious why they aren't part of this conversation. That office was started last year and I this is seems like this is what that office was made for was to help deal with situations like this.'",
        "'speaker_4': 'So. Kevin, I would request that the mayor's office. Get the Neighborhood Equity Stabilization Team involved with this project.'",
        "'speaker_6': 'I then have a few minor questions. Nola, can you please tell me what you. Would like to see in a.'",
        "'speaker_4': 'Community benefit agreement.'",
        "'speaker_10': 'So and it should be in the evidence that we we sent. There's one example that's just kind of a general ask of equitable development. And in in that goes through the affordability, including the ranges of affordability. So it doesn't you know, it doesn't just say 60% AMI and below it says, you know, half of the 70 units'",
        "'speaker_10': ', for instance, would be 30 to 50%. And so those types of details around affordability, there would be a creation of a body that has.'",
        "'speaker_8': 'Ongoing and meaningful participation.'",
        "'speaker_10': 'Throughout the different stages of the project. So that, for instance, if you had that site plan and you had the traffic report, that.'",
        "'speaker_8': 'There could be a committee.'",
        "'speaker_10': 'Made up of community members that would get to hear what that traffic report is and give feedback on it or respond to it, those types of things that would give an ongoing interaction between the development and the neighbors.'",
        "'speaker_10': 'We also in the 40th and race project, we worked on the creation of a community defense fund where the developer actually donated to a defense fund to support the legal needs of neighbors that are facing displacement in the area.'",
        "'speaker_10': 'Because that's a big gap is the legal support for neighbors that are facing now trying to remember what else is in there. I don't have it with me. The equitable. That's my forgetting. Oh, neighborhood preference. So that isn't we know it's not a policy yet, but the actually the affirmative marketing plan that says that they would offer'",
        "'speaker_10': 'those units first to neighbors that have that need and and we would help to promote within the neighborhood accessibility to those neighbors or to those units. So those types of things, local preference for local businesses or at least conversations with local businesses see that as this one, the platform for actual development.'",
        "'speaker_10': 'Yeah. And then the last ones are a preference for local business facing displacement pressures and also a non-compete clause for existing local businesses so that you're not bringing in businesses that are competing with existing businesses, the neighborhood.'",
        "'speaker_4': '9.25%.'",
        "'speaker_10': 'And then work the local hiring, too.'",
        "'speaker_4': 'If there's jobs that are created, that's it. And did you talk to the developer about this when we.'",
        "'speaker_10': 'The the one meeting that we had with them, not the open house, but we had a meeting just with the GSA coalition. We gave them this.'",
        "'speaker_8': 'And they were.'",
        "'speaker_10': 'Interested in it. But we just haven't had time to negotiate anything and. I don't know if you're interested now or not.'",
        "'speaker_4': 'Okay. Thank you. Okay. Just a few short questions. Courtney. A lot of people said they weren't aware of it. And aren't everyone who lives within a certain distance, 200 feet, supposed to receive notification of what's going on inside?'",
        "'speaker_4': 'Posted. Did all of that happen? Right.'",
        "'speaker_10': 'So there was the public process that includes the posting signs on the property, the written notification, Arnaud's, but then also the postcards that are sent out in English and Spanish to all property owners within 200 feet of the subject pre zoning.'",
        "'speaker_10': 'We always encourage the applicant to do additional outreach to the community and we that's no different than today, you know, and maybe the applicant can speak of their efforts and what they did above and beyond those code requirements.'",
        "'speaker_10': 'But we did outline in the staff report those code required outreach things that are required.'",
        "'speaker_4': 'Okay. Thank you. And Bruce, when you started, you did speak really quickly, but you mentioned a number of meetings.'",
        "'speaker_6': 'Can you go over?'",
        "'speaker_14': 'Sure, I'd be happy to.'",
        "'speaker_4': 'This was from your perspective.'",
        "'speaker_14': 'So we filed the application in October of last year. And prior to that, in July, we contacted some of the RINO's in the neighborhood requesting a chance to get together and brief them and get their input and engage with them.'",
        "'speaker_14': 'And the only two that responded were Clayton United Neighbors and the Business Association. And in fact, we got positive feedback from them, including, I think in your packets is a support from members of the Clayton United. Clayton pardon me.'",
        "'speaker_14': 'Um, when the application was turned in. We sent a detailed summary of the, what the rezoning entailed to the RINO's and we also sent them the application itself in a PDF format in the the summary that was kind of like a cover memo to the application addressed the difference between I and I and I.'",
        "'speaker_14': 'And that's three. It addressed the size of the site. It addressed changes of uses, the introduction of residential. It was quite a lot of detail, again, inviting dialog and participation. And there was no response. We then again followed up a third time in February with these same groups attempting to engage them.'",
        "'speaker_14': 'And again, no response. And so it wasn't then until after, Ludie, that that things really got going. And so, as I've described earlier, we had a community open house at the site in the wonder bound space. We sent, I think, about 90 invitations to immediate neighbors to that, and I would estimate there were more than 40 people'",
        "'speaker_14': 'there. But by my count, there were about 40 people that were neighbors that came in response to the invitations. We had, as NOLA described, a meeting with the coalition itself. We've had a meeting with North was a build the United North R.A. and and then we also have sat down in individual home and met with immediate neighbors'",
        "'speaker_14': '. And and so we've been out there trying, getting notice out of I personally put up all the signs, that type of thing. So I think that we've made every attempt to get engagement. And regretfully, it was late that the Coalition surfaced on this and has been very clear about what their topics are.'",
        "'speaker_4': 'And did you send notification to the GSA coalition? Are you an R.A. now? Okay.'",
        "'speaker_14': 'Thank you. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Black, Councilman Espinosa.'",
        "'speaker_12': 'Bruce Instagram.'",
        "'speaker_14': 'Yes, sir.'",
        "'speaker_12': 'What was the application fee to the city for the rezoning?'",
        "'speaker_14': 'Well, it was. I'm trying to do math in my head. Probably about $7,000.'",
        "'speaker_12': 'Okay. And then how did the city get involved? Because this is all private development or did the city have some stake in the land at some point?'",
        "'speaker_14': 'What do you mean by city? Get involved.'",
        "'speaker_12': 'Got in. There's machinations about an agreement. I'm still confused by it, but, you know, why would you. What was what was the impetus for that?'",
        "'speaker_14': 'So about a week after the ludy meeting, we got an email from CPD suggesting that entering into a development agreement would be a desired outcome of all this. And so we started discussions and dialog on that and arrived at the agreement to build affordable units.'",
        "'speaker_14': 'It's been described tonight with the 70 units.'",
        "'speaker_12': 'To meet units, which is, you know, I've heard people talk about 700 units, so that would be 10% of a proposed project or is that.'",
        "'speaker_14': 'That's an accurate estimate?'",
        "'speaker_12': 'Okay. Yeah. So and then just a question for Greg Moore. I mean, sorry, Mr. Moore, can you direct me to where you're getting the 10% open space request, or is that part of the agreement?'",
        "'speaker_13': 'It's not part of the agreement. It's it's just a component in the code.'",
        "'speaker_12': 'Which form standard are you using?'",
        "'speaker_13': 'You know, I don't I don't know. I'm looking at I mean, it's in the IMAX code and it's a.'",
        "'speaker_12': 'Maybe staff could could tell me where that is.'",
        "'speaker_14': 'You know, I could go ahead.'",
        "'speaker_10': 'So the next three, they will be allowed to build under the townhouse general and industrial building forms. So the residential will probably be under the townhouse building for.'",
        "'speaker_12': 'Okay. And then this is just sort of a question for both Sarah and yourself because sir, in the response to the GDB question, you said a lot of things that sort of justified, you know, recap the whole justification.'",
        "'speaker_12': 'And so I'm really perplexed. Yes. It doesn't say anything about GDP being required here, but in the Illyria plan, this sort of small area plan for this area, there is a tab in in this I'm going to call it up so I can have it as a reference called industrial areas, which this is clearly mapped in that'",
        "'speaker_12': 'plan. Correct.'",
        "'speaker_10': 'Yes. I mean, it's in the area. It's, in fact, doing exactly what the plan calls, which is to try to phase out the heavy industrial areas and replace them with more mixed use and residential.'",
        "'speaker_12': 'That's actually not what the plan calls for. If I direct you to pages 94 and 94.'",
        "'speaker_10': 'Let me grab my copy of the plan.'",
        "'speaker_12': 'There is absolutely zero reference to housing or residential as a replacement says encourage infill development to improve the quality of built environment, encourage industrial properties lying further away from the station areas and residential areas to develop into higher valley value.'",
        "'speaker_12': 'Employment and manufacturing facilities encourage industrial properties used for outdoor product stores to invest in vertical racking systems. And it goes on and on and on about these are job centers and industrial and near-zero reference to housing being the the appropriate re-use of these industrial areas that are mapped in this plan.'",
        "'speaker_10': 'Well, I just want to point out the land use map for this is industrial mixed use in the plan.'",
        "'speaker_12': 'But this is character area strategies, which is how this area is mapped.'",
        "'speaker_10': 'Sure. And if you look at the map, do you remember what page the. Here it is, page 28. If you look at the site under question, you see that map, correct? It says the future. The vision for this site is industrial mixed use.'",
        "'speaker_10': 'And then if you read the strategy for industrial, the description of industrial mixed use, it is exactly aligned with the I am x zone district that they're calling for. So you're right, it still allows for plenty of employment opportunities.'",
        "'speaker_10': 'It's not saying it only has to be residential. I Emacs is a very diverse zone category has all kinds of permitted uses. It's not saying it has to exclusively be residential, it's just adding that option.'",
        "'speaker_12': 'You will agree with me, will you? Won't you, that the the 2010 zone districts, which I am x three is one has had a lot of impact in I mean, it has has had a lot to do with the gentrification and displacement that has occurred in other parts of the city.'",
        "'speaker_12': 'Correct?'",
        "'speaker_10': 'I don't know enough about where we've mapped I am zoning recently.'",
        "'speaker_12': 'And I said 2010 zones.'",
        "'speaker_10': 'I don't know enough about where it was mapped in 2010 to. I'd want to overlay that with our vulnerability to displacement map. To answer that question, I don't have the data in front of me to answer that.'",
        "'speaker_12': 'Where I'm going, what I'm why I'm asking this question this way about the 2010 zone districts is, as you know, you could build slot homes in an IMX three zone district and that's why it has the townhouse form.'",
        "'speaker_12': 'Now that we addressed, you could have done it under the general building form previously. And so I'm not talking about IMX in particular, I'm actually talking about the form standards that would have allowed essentially the same things that happened in, say, Jackson Park or West Colfax could be built in an IMX three zone district prior to the'",
        "'speaker_12': 'Slide Home Text Amendment, correct.'",
        "'speaker_10': 'Yes, I'm I'm having.'",
        "'speaker_12': 'I have one right there at 41st and Inga. Right. There's a 26 unit development at 40 at 30/40, an anchor right next to a. Using the IMX three standard. So, I mean, yeah, I mean, it's doable. All right.'",
        "'speaker_12': 'No further questions. I'll come back. I do want to get back in the queue.'",
        "'speaker_0': 'Major Espinosa, Councilman Bruce, I've got a couple questions. I just want to go over the the configuration of the project. You know, how many how many total units of 700.'",
        "'speaker_14': 'And that's the estimate right now is about 700. As you can imagine, we're in a very conceptual planning stage because we don't even have the zoning yet.'",
        "'speaker_0': 'And so the affordable units are going to be 10% of the 70 units. So yes. And so the rest will be market unit and market rate.'",
        "'speaker_14': 'Not necessarily. The developer has a goal of doing some below market rate units, mixed income units, artists, live work units. And and so there's a whole some ideas about a whole variety of, of types of units and mixed income.'",
        "'speaker_0': 'So those types of of units are your number. Is that affordable? Is that in addition to the affordable?'",
        "'speaker_14': 'That would be in addition to the 70 affordable. Correct.'",
        "'speaker_0': 'So it would be 60%, Amma?'",
        "'speaker_14': 'No, it would be a potentially a whole mix of EMI, but there's some a goal of the applicant to not do, to do more than just the 70 units at 60 and then the rest at all market rate.'",
        "'speaker_0': 'Okay. Okay. Is it rental or ownership? There's a mixture or.'",
        "'speaker_14': 'Mixture.'",
        "'speaker_0': 'Likely? Likely.'",
        "'speaker_14': 'Probably, I would imagine more rental at this time. But the some of the units are an idea is to have the me townhomes, pardon me, townhome townhouse type units. And so it's conceivable that some of those could be for sale or sale.'",
        "'speaker_0': 'And are you considering the pricing of your rental units versus your for sale?'",
        "'speaker_14': 'Not yet, no.'",
        "'speaker_0': 'Do you think it's coming more toward market rate?'",
        "'speaker_14': 'Well, I think some will be market and some will be less than market.'",
        "'speaker_0': 'Okay. Community service and retail, are you going to have any?'",
        "'speaker_14': 'Yes. Right now, we estimate about 25,000 square feet of retail. And it's a community serving in the sense that it's small spaces scattered in various spots around the site and no no big footprints of retail type. And so it will definitely serve the broader community as well as the new development here.'",
        "'speaker_0': 'What kind of stores you're thinking about?'",
        "'speaker_14': 'Probably food service a fair amount in the store.'",
        "'speaker_0': 'Is that a restaurant or.'",
        "'speaker_14': 'Probably not a grocery store just because the footprints aren't big enough? Mm hmm.'",
        "'speaker_0': 'Okay. But it's more like a restaurant or.'",
        "'speaker_14': 'I would think some restaurants. And. But beyond that, again, we just. It's too early to know, Councilman.'",
        "'speaker_0': 'Okay. Okay. So the community benefits agreement, what would you say? It sounds like a good neighbor agreement to some degree or maybe it's a little bit more than that. Are y'all receptive to that or what?'",
        "'speaker_14': 'Well, as I said earlier, when I gave the my presentation that we are absolutely open to ongoing discussions and engagement with the community. And a lot of what we heard tonight from the community I think makes good sense in our the right types of goals for all of us to be striving for.'",
        "'speaker_14': 'What shape that might take tonight. I don't know.'",
        "'speaker_0': 'Okay. Just don't know yet. Can you get the rezoning tonight? Is that was it going to require me to do this type of agreement?'",
        "'speaker_14': 'The reasoning itself would not know. It would be voluntary.'",
        "'speaker_0': 'But. But you're committed to do that?'",
        "'speaker_14': 'Yes, sir.'",
        "'speaker_0': 'And the traffic study. That has to be done. Who would pay for that traffic study? The applicant. Applicant? Okay, then how would you share the results of that study with the community?'",
        "'speaker_14': 'Well, that would be determined through our continued dialog.'",
        "'speaker_0': 'And she would be sharing it to possibly.'",
        "'speaker_14': 'Yes.'",
        "'speaker_0': 'US with. Why would you not share?'",
        "'speaker_14': 'I can't think of a reason why not right now. But I just again, I'm I'm not going to negotiate anything this evening.'",
        "'speaker_0': 'Okay. Okay. Thank you very much. Courtney, let me ask you a question on the on the notification to residence and guess it's to the property owners. And I don't know how many ladies here are the property owners, you know, all property owners or do you rent or how do you how do you handle rental notifications in areas'",
        "'speaker_0': ', you know, where you may not have as many property owners as normal? How do we make sure that all those folks are knowing what's going on?'",
        "'speaker_8': 'Right. So the code.'",
        "'speaker_10': 'Requirement of the postcards, that information is pulled from the assessor's data. And so we send them to owners of record. So that's who they address essentially that people, you know, who own the property, if the property owner doesn't live at that address and they rented out, then it would be their responsibility to inform their renters.'",
        "'speaker_0': 'Yeah. Sound like we're probably in a low income area. We may have a problem with that notification for sound like we need to change that maybe then development agreement. You know, we all are supporting that. I mean, you said nobody was suggesting that CPD get involved with that at all.'",
        "'speaker_0': 'Yeah. Are you're you're supporting that agreement?'",
        "'speaker_10': 'Yes. We worked together with OED and the applicant for that affordable housing agreement.'",
        "'speaker_0': 'What about the community benefits agreement? You're in support of it.'",
        "'speaker_10': 'Yes, there isn't one currently executed that we know of between the applicant and the the community.'",
        "'speaker_0': 'One gets developed. You can help with that. One guess developing could help with that or support that or.'",
        "'speaker_10': 'I mean typically that's between the community and the the the applicant that enforcement.'",
        "'speaker_0': 'Okay. All right. Thank you, Mr. President. Thank you, Councilman. New Councilman Flynn. Thank you, Mr. President. Courtney first let me pick up where Councilman New left off with the development agreement that was suggested by CPD to the applicant after the committee meetings.'",
        "'speaker_0': 'Is that what I hear that correctly?'",
        "'speaker_10': 'I believe that we have record of of talking and saying, you know, of, you know, suggesting entering into a voluntary agreement. And we stressed the entire time that this is a voluntary agreement. I think around the beginning of February suggesting that that might be something that they might want to consider.'",
        "'speaker_0': 'Mr. O'DONNELL Did did I hear you say that you got a call from CPD after the Land Use Transportation Infrastructure Committee to come in and work on a development agreement?'",
        "'speaker_14': 'It was an email, but it was it was after that.'",
        "'speaker_0': 'It was after the. Okay, so that was about the end of February.'",
        "'speaker_14': 'I'll look up the exact date. Real quick. I have it.'",
        "'speaker_0': 'Okay. Courtney then you answered. Councilman knew by saying that the development agreement was worked out and it's signed. It's done.'",
        "'speaker_10': 'Correct.'",
        "'speaker_0': 'Okay. Where is it? Do we have it?'",
        "'speaker_10': 'I have it.'",
        "'speaker_0': 'Yeah, I mean, we don't. Do we.'",
        "'speaker_10': 'Have. Would you like a copy? Yes. It's signed and it's going through our system. Alfresco.'",
        "'speaker_0': 'That's not. That's what I'm saying. It's not in our record here.'",
        "'speaker_8': 'As an attachment.'",
        "'speaker_2': 'But it's not. Okay.'",
        "'speaker_10': 'I wasn't.'",
        "'speaker_0': 'There, but that was negotiated with OED.'",
        "'speaker_10': 'That's correct. Yep. If you want to check in, Laura, I'm sorry.'",
        "'speaker_0': 'It's Dito now. It's not.'",
        "'speaker_4': 'Dito now.'",
        "'speaker_0': 'So I still say Denver General Hospital. So that tells you something.'",
        "'speaker_4': 'It's an affordable housing agreement that's been signed by the applicant and is working its way through the city signature process. So it has been approved by the office and is still working through the final stages.'",
        "'speaker_0': 'So the development agreement addresses only the provision of affordable housing, how many units, at what level and nothing else.'",
        "'speaker_4': 'It is just an affordable housing. Okay.'",
        "'speaker_0': 'So it doesn't address community concerns or or issues at all.'",
        "'speaker_4': 'Only the affordable housing agreement is there. So any anything above affordable housing commitment is not contained in the agreement.'",
        "'speaker_0': 'Okay. Have we done development agreements that also address concerns and issues in the neighborhoods? Fair.'",
        "'speaker_10': 'So I would say we we typically development agreements are between the city and the applicant. Right. So we include things that are within we feel a fair realm for the city to be asking for in negotiating. Sometimes those overlap with what the community is looking for.'",
        "'speaker_10': 'Sometimes they don't. Oftentimes where there's an agreement in place, there will also be a private agreement or good neighbor agreement, whatever you want to call it, that will address go well beyond what was in the development agreement to address concerns from the community.'",
        "'speaker_0': 'Yet you saved us three more questions then, because what I was getting at was why? Why do we have this bifurcated process where we have the development agreement with the applicant and the city, and then we ask the applicant to voluntarily talk to the community to do a demo, you or or some kind of a community benefits'",
        "'speaker_0': 'agreement separately from that. Have we ever done anything that just combines it all into one process? Node would then be ready for us here at the final.'",
        "'speaker_10': 'Not to my knowledge. The agreements that the city's city enters into are four things within our purview directly with the applicant and then the commute. There's no requirement for us to be involved or do something that would be a bigger negotiation with the community.'",
        "'speaker_0': 'Okay. Mr. O'Donnell, then and my screen is going haywire here, but you sent an email out after the community had asked for a delay in the in the public hearing, you sent an email out saying that there shouldn't be a need for a delay.'",
        "'speaker_0': 'And I don't have the direct quote here because like I said, my my screen is going weird that a delay wouldn't be necessary because by April 8th, which is today, there would have been substantial progress on not just the the agreement with the city, the development agreement, but also on a community benefits agreement or an M.O..'",
        "'speaker_0': 'You with the neighborhood. So what is the status of that second item? Has there been you told us that there would be substantial progress by tonight. That doesn't sound like there was.'",
        "'speaker_14': 'So we contemplated an M or you with the city and that process kind of stalled out because of a preference for making certain that the agreement to build affordable units got completed. Okay. And then there had also been some discussion with the Coalition about some sort of an an M.O. you or an agreement of some type.'",
        "'speaker_14': 'And we pulled back from that when they started exploring a protest petition. And we just felt that it would be very difficult to negotiate in good faith and have, you know, honest discussion and dialog when faced with a protest petition, obviously trying to get the rezoning killed.'",
        "'speaker_0': 'Mm hmm. Okay. Thank you, Mr. President. A few more questions. Would you prefer I get back in line or move on to other for why don't we get to. Some people have asked first and maybe they'll ask some more questions for you.'",
        "'speaker_0': 'I doubt that. But they're welcome to try walking. To try councilman. Love it. Yeah. Thank you, Mr. President.'",
        "'speaker_7': 'Just three three questions I have. First is our our city attorney's office. There's a lot of talk of the of a CBA community benefits agreement. There's even conversation about good neighbor agreement. Is this something that lives within the zoning process or is it something that the city can be a signatory to?'",
        "'speaker_7': 'Where does it start and where does it end? In terms of what our authority is? I wanted to follow up with Councilman Flynn's question on whether it can be bundled in a deal like this or not. Adam Hernandez, Assistant City Attorney.'",
        "'speaker_7': 'Most community backed community benefits agreements and good neighbor agreements are negotiated between the the applicants and the neighborhoods. And most of the purpose is, you know, to to garner support for whatever approval is being sought in exchange for, you know, a variety of of issues.'",
        "'speaker_7': 'But community benefits agreements, good neighbor agreements, do not live in the zoning code. Now, does the city or city council play a role or have a role in that process? Can they be? Signatory to community benefits agreement. It really would depend on what is in the agreement.'",
        "'speaker_7': 'Let's say, like you said, housing. Use of square footage, breakdown of units, affordability, things like that. So just taking this, this instance, for example, the the agreement that was agreed to by both parties dealt with affordable housing. And that's something that the city does regulate and can enforce.'",
        "'speaker_7': 'So oftentimes, good neighbor agreements, community benefit agreements have provisions that the city really can't enforce, doesn't have regulatory authority over. And so those things are more applicable to the negotiations that she's. You know, like I think something mentioned today was a preference for local residents to have access to the affordable housing.'",
        "'speaker_7': 'That's not something that's in our city codes and city regulations. I think there's more good faith marketing requirements. I'd look to Laura just to make sure I'm speaking on that. Could could a community benefits agreement on that know, Adam?'",
        "'speaker_7': 'Could that community benefits agreement have a provision that would give preference, local preference to residents who are in that area? It, it could, but that specific example possibly could run afoul of what is that an act of through our rules and regs for our affordable housing program?'",
        "'speaker_7': 'Again, I'm drawing a blank on some specific examples, but I think of things that the city really wouldn't be enforcing or have regular regulatory authority over. Okay. Thank you, Adam. Carol Costello, in your assessment as a nominee and a friend, the mercedes's better than most anticipated when you're on microphone.'",
        "'speaker_7': 'If you can come to the microphone. So the las cosas masa important piece and so pinion so arrested this arroyo. Baraka left Construir deposit beneficios appointed across the border on Proyecto is that people so and this kind of what this kind of development and what are the what are the priorities what are the priorities that you would'",
        "'speaker_7': 'see is important for you to actually support something like this. One of the things that are missing, so to speak.'",
        "'speaker_15': 'Bebe and us as siblings. But a lack of money that this is really the.'",
        "'speaker_7': 'Affordable element of the community.'",
        "'speaker_0': 'That would be my priority.'",
        "'speaker_15': 'Solamente sexy racy fondle liver bananas throw. But the most to me in this the person that stands for free. And though Bautista what I will sustain their interest in which is personal not the end in itself in their opera, but as a process, whatever.'",
        "'speaker_2': 'I would also ask for legal aid funds. We have a lot of people in our community who are currently struggling and are being abused by landlords and they don't have funds to be able to take care of that legally.'",
        "'speaker_7': 'Okay. Conor Bezos, Dennis already sent us over the border when officials announced the project. When did you guys start organizing around a community benefits agreement with this and with this or with these kind of aspects of this project?'",
        "'speaker_15': 'The an eco mode is the besoin in this arroyo then set into a seasonal almost to the UK lack of money. That is the installation though in this place. Other customers see this blazer was.'",
        "'speaker_0': 'I would say it.'",
        "'speaker_2': 'Has been since the beginning of the I-70 development. We had a study about how people showing how people were being displaced involuntarily.'",
        "'speaker_7': 'The north coast, optical states. And, you know, and obviously that battle is today. But again, as a specific, I meant that there's that there's the them.'",
        "'speaker_15': 'Or there's the proyecto a dinner poquito tiempo that can nosotros no center. I'm just.'",
        "'speaker_7': 'Wondering, based on.'",
        "'speaker_15': 'The American mom starts come. My son was single. Mom is working.'",
        "'speaker_2': 'With this project specifically.'",
        "'speaker_0': 'It's recent because we just found out about it.'",
        "'speaker_2': 'So it's been about a month.'",
        "'speaker_15': 'Como Mr. Smith has always seemed to be primarily on their continues.'",
        "'speaker_7': 'Yeah. So maybe like a month, maybe two ago that we had the meeting with them. CONAN The convalescence, not a recurrence of that, the less on infection. What we made of is what prevent? When did they notify you at this rezoning?'",
        "'speaker_15': 'Was I still missed the phenomenon.'",
        "'speaker_7': 'I've been see a month ago when they had the open house. Excuse to.'",
        "'speaker_15': 'Those.'",
        "'speaker_7': 'Guys were not.'",
        "'speaker_0': 'Yes.'",
        "'speaker_7': 'And we all participated during that time. Thank you. We're going to Bruce, can you come to the Guzman-Lopez?'",
        "'speaker_0': 'Do you mind? You've been a little bit over reserve. Some people have.'",
        "'speaker_7': 'I mean, the translation kind of counted towards that, but I think.'",
        "'speaker_0': 'That's you mind. We just had a lot of other people went over to one.'",
        "'speaker_7': 'I've been quiet this whole time. I just have one question for me, but that's fine. Come back to me, please.'",
        "'speaker_0': 'All right, Councilman Cashman. Thank you, Mr. President. I'm sorry. We're still there. You're hiding back behind there. Thank you. The development agreement. So it only addresses the housing piece? That's correct. Compared to what God put together for she died.'",
        "'speaker_0': 'That's pretty bare bones. I mean, she that talked about a single point of reference on construction. It talked about public meetings when site plans were submitted and drainage plans and so on. I'm wondering why this is just so then.'",
        "'speaker_10': 'I'd prefer for the applicant answer that question. I mean, on our end we wanted it to include things like open space and there was a very short amount of time and this is what they put on the table.'",
        "'speaker_10': 'And in a very short period of time for us to commit to, it sounds like they're open to maybe pursuing future conversations. But. Right.'",
        "'speaker_0': 'But first, let's talk more about what we're looking at now is a development agreement that only addresses the housing piece. So as far as Mr. Moore talked, about 20% open space. Is that part of any?'",
        "'speaker_10': 'Like I said, we would love to have open space to be part of a development agreement, but it's.'",
        "'speaker_0': 'Not.'",
        "'speaker_10': 'The applicant proposal that would be part of an MOU. You at the city and emoji is not enforceable. We never to my knowledge ever done and I'm on your piece. It doesn't really mean anything it's just and what they felt like they could commit to at this time and a voluntary agreement was the 70 units.'",
        "'speaker_10': 'And so that's what we move forward on. Right. We would love to see an agreement that included open space.'",
        "'speaker_0': 'Okay. Thank you for that. Let's see. So just I don't know who would answer this. My understanding is that the dance company is moving it or is now in the existing building. Is there anything that requires that to stay indefinitely or that I'm not?'",
        "'speaker_8': 'Thank you, Councilman. We have actually been given a permanent home by Brooke and Tom Gordon in that building. Right. To be there hopefully is in perpetuity to create a performing arts center and a place for the community to be as well as wander bounds.'",
        "'speaker_0': 'Permanent home. Right. But that that's just a verb. Some sort of agreement between you and the developer. I'm just trying to. This might not even be appropriate for you. I guess city staff might know better. I mean, can that building go away at some point?'",
        "'speaker_8': 'The agreement that we have, which is verbal and but there is a lease that is a long term lease. It's 30 years and then is renewed in ten year increments.'",
        "'speaker_0': 'Okay. Thank you.'",
        "'speaker_4': 'Yeah.'",
        "'speaker_0': 'Thank you very much. The community benefits they're talking about is. That's not been resolved. Bruce. To be sure I'm clear. You didn't notify GSC in your original sending out to R and O's and so on. Is that correct?'",
        "'speaker_14': 'That's correct.'",
        "'speaker_0': 'Okay. And then that was about a month ago where here and right. That they came into the conversation. Right. Okay. Thank you. And I guess the last thing whomever wants to answer this, the 70 units of affordable housing.'",
        "'speaker_0': 'So, as I understand it, 60%. 60% or less. And I think Laura might have said there's some requirement for two bedrooms. Refresh me on that, please.'",
        "'speaker_4': 'Sure. The agreement does state 70 units at 60% AMI or below with no less than 30% of them that are two bedrooms are larger. And those are the minimum requirements. Under the agreement, certainly the applicant can produce more affordable at deeper affordability levels, more than that as far as bedrooms.'",
        "'speaker_4': 'But the agreement is what is committed to without the assumption of any city subsidies.'",
        "'speaker_0': 'Okay. And I think that's all my. Oh, the the 10% open space is a code requirement, correct?'",
        "'speaker_10': 'That would be a GDP code requirement.'",
        "'speaker_0': 'So there's no code requirement at this point?'",
        "'speaker_10': 'No, there is no GDP.'",
        "'speaker_0': 'Okay. Thank you very much. Thank you, Mr. President. Thank you, Councilman Cashman. Councilwoman Gilmore.'",
        "'speaker_1': 'Thank you, President Clarke. Mr. Moore.'",
        "'speaker_0': 'I thought I was going to slip away.'",
        "'speaker_1': 'You had referenced earlier that you're voluntarily, since it's not in the general development plan, committing to 20% open, open space. Is that open space and a park space?'",
        "'speaker_13': 'No, it's not a it's not our park space. It's actually our plan right now has 35 are just being conservative, calling it 20. It's just it's a big site. Things are still moving around. So I'm reluctant to specify exactly how that's allocated.'",
        "'speaker_13': 'But of the 35. The intent is that we're using the nomenclature and the definitions that are in the zoning code. And so we're because it's an existing building, we're just really has creates a lot of physical constraints. And so it it it presents a lot of open space.'",
        "'speaker_13': 'And so we're using that in any number of ways.'",
        "'speaker_1': 'So you had said earlier 20%, but now you're saying 35%. What is your.'",
        "'speaker_13': 'I'm just I'm just illustrating because I know these I mean, this is this zoning is the beginning of the design in a lot of ways. So we really can't move forward. There's just still some things moving around. Our actual plan that we're working on right now are working.'",
        "'speaker_13': 'Plan has 35% of open space. So what? But as a commitment to the community, we're kind of tempering that by by calling it 20%. And I could say a large part of that is public space. There's a park, there's a plaza outside of Wonder Brown.'",
        "'speaker_13': 'I mean, there's a lot of different uses for that space.'",
        "'speaker_1': 'What is this? So if you're using 20%, if you're using 35%, I'm sure that that does not make the community feel any better, knowing that there's vagueness around how much open space they might get. What is your percentage split between park space versus detention and drainage?'",
        "'speaker_13': 'I don't know. The detention drainage is has only been done at conceptual level.'",
        "'speaker_1': 'I mean, so are you committing to you said that you are going to double the amount of open space required. It would be 1.4 acres if you're doing the 10%. You said you were going to double that. So that's 2.8 acres of open space.'",
        "'speaker_1': 'But you can't tell us how much is going to be park land versus how much is going to be detention or drainage.'",
        "'speaker_13': 'I can't delineate between those right now. I mean, I could do that math if I had the plan. And we just haven't we haven't delineated it like that.'",
        "'speaker_1': 'Okay. Thank you, Sarah. I have some questions for you, please. You had said something earlier that, you know, in the far northeast, we're right now in the middle of our neighborhood planning initiative. And you had said something that when Councilman Espinosa was asking you questions, you said, well, the a GDP was not required as part of that'",
        "'speaker_1': 'neighborhood plan. Could you explain what you were meaning?'",
        "'speaker_10': 'Sure. If I said required, that would have been the wrong verb. It's one of the things the code says to consider when we're determining whether to acquire a GDP or not. It's not whether a neighborhood plan requires it.'",
        "'speaker_10': 'I don't think it's the right word. But just does the neighborhood plan call for a recommend that a GDP happen for a particular site? So if a neighborhood plan does say that, then the code says, you know, that's an important consideration.'",
        "'speaker_1': 'Okay. That's very helpful to know because even going through this process, that is very helpful going forward. You had also said that significant intensity would be one of the variables that would require a general development plan. I'm struggling to understand how 700 new units.'",
        "'speaker_1': 'Doesn't qualify as significant intensity.'",
        "'speaker_10': 'Yeah, no, it's a great point. I think it's change in intensity as we were thinking about it. So it's compared to what the zoning allows today versus what the requested zoning would allow. Not to imply that that's not a change or not intensity, but that it's to the extent that it's going to require significant new public infrastructure'",
        "'speaker_10': '. And that's where we like I said earlier, CPD doesn't make that call on our own. We talk to the engineers, you know, given that this and to be clear, they're evaluating the zoning request, not a particular project. So the what's in front of them is the proposed IMAX three zoning and anything that could be allowed under that'",
        "'speaker_10': ', including significant residential development. And is there need to have a coordinated, larger picture conversation about public infrastructure based on the rezoning request or in this case, what was determined, even though there'll be significant development, and that will probably require improvements to the site to serve the residential as well as potential traffic improvements.'",
        "'speaker_10': 'Those things are commonly addressed through the site development planning process and they didn't see the need, especially because there's one owner in control of the entire parcel. There wasn't concerns about not being able to get the improvements that they need.'",
        "'speaker_1': 'So I want to understand it. Earlier, it sounded like you were, you know, pushing it off to the applicant that that they chose not to do a general development plan.'",
        "'speaker_10': 'No, not to do development agreement.'",
        "'speaker_1': 'Or development.'",
        "'speaker_10': 'That included open space.'",
        "'speaker_1': 'So I guess where where is your staff in this equation? I guess pushing back and asking the applicant to show what they're going to do around parks and open space. You know, we've only got an agreement now that only speaks to affordable housing.'",
        "'speaker_1': 'It doesn't speak to the significant intensity that this development is potentially going to bring. And so I just I'm I'm confused as to why staff didn't, I guess, ask more questions or get more information, especially now, because the only requirement that we have if we approve this rezoning is around the affordable housing.'",
        "'speaker_1': 'We don't have anything else that we're going to be able to ask this developer to potentially do.'",
        "'speaker_10': 'Yeah. Yeah. So your point, we we did ask a lot of questions. We encouraged doing an agreement that would address, at a minimum, affordable housing and open space, try and address some of the community surgeons that have been coming up.'",
        "'speaker_10': 'We are also need to stay within the legal framework of the rezoning process and what we're what we can require an applicant to do versus what we can encourage an applicant to do. So we encourage them to consider taking longer and build time in for a more robust agreement.'",
        "'speaker_10': 'We were asking those questions. We were trying, but ultimately, particularly under advisement of the attorneys office, we we couldn't require anything more. So we are we were doing what we could within our legally defined role. And I think it's a great example of some of the you're pointing us to improvements that we can be looking to make'",
        "'speaker_10': 'this this whole rezoning. Like one of the things I wanted to note that came up earlier, I think there is a question about Nest Irene, the director of Nest, is aware of this rezoning and has been very involved responding to community concerns in particular.'",
        "'speaker_10': 'But an example of one of the things that's come up is that really important community groups like the majority of people are here tonight from the Jazz Coalition just because they're not a registered neighbor or an organization. They were not on the list of required bodies to be notified.'",
        "'speaker_10': 'And so one of the things that Irene's working on is, you know, long term blueprint Denver and some of the plans that we'll be bringing to you soon for adoption call for we need to make some changes in our process so it is more equitable in terms of how outreach happens and what the requirements are, which requires'",
        "'speaker_10': 'a little more work. But in the short term, Irene's looking at ways to just at least develop lists and communities, especially those that are her focus that are vulnerable to displacement, to give applicants, even though you aren't required by the code, to notify.'",
        "'speaker_10': 'These are those. These are other community groups that you should know about in this area and do outreach to them as well. So it's that's an example the the regulatory tools available to us right now when you have.'",
        "'speaker_10': 'A large rezoning like this, and some of their limitations are also an example of things they want to improve. So then that would get to some of the questions you were asking about, you know, why weren't we requiring or asking for more?'",
        "'speaker_10': 'There are already underway. Also coming to you soon are the whole GDP process is going to completely change? So large development review or LDR. We are hoping part of what that process does is create a better, more coordinated process at the beginning for all departments to be at the table and be clear on what what is required'",
        "'speaker_10': 'of a large development. And then Dido and CPD was kicking off an effort to create a more clear triggers and a regulatory way to create and enforce those triggers for large developments to provide affordable housing. So we did get the agreement for the 70 units here.'",
        "'speaker_10': 'I'm kind of at the last minute, but what we'd like to do in the future through that process is identify where we have large sites. Other triggers might include sites that are receiving TIFF funding, for example. Be a little clearer for everybody involved what are the triggers and what would be requirements?'",
        "'speaker_10': 'So do want to acknowledge that we see room for improvement and we already have ideas about what some of those improvements could be so we could see better outcomes. But for this particular process, we kind of worked within the regulatory tools available to us, which didn't give us a lot of ability to require things, but we tried'",
        "'speaker_10': 'to encourage and push where we could go.'",
        "'speaker_1': 'Thank you, President Clark. Thank you, Sara. I'll defer. I've got a couple other questions, but thank you.'",
        "'speaker_0': 'Thank you, Councilwoman each.'",
        "'speaker_8': 'Thank you, Mr. President. I would like to begin with a couple of questions. Well. Let me clarify with Laura. I think let me start with Laura and then I'll follow up the first, if that's okay. Are the affordable housing requirements in an AHP and affordable housing plan or are they in a development agreement, which are two different'",
        "'speaker_8': 'tools? One is a regulatory thing that has exclusive authority to approve. The other is an agreement with the city that I'm guessing has a different set of signatures on it. So which do we have here? Because we've called it both and I'm not clear.'",
        "'speaker_4': 'Yeah, good question. And I will take a stab at the first answer. Adam, if you need to step in, please feel free. So an affordable housing plan is an agreement that was negotiated under the historic inclusionary housing ordinance.'",
        "'speaker_4': 'So we no longer create that exact same plan. This is an affordable housing agreement, which looks more like a development agreement which is signed by all of the city parties, in addition to just the Denver Economic Development and Opportunity Office.'",
        "'speaker_4': 'So it is signed by those other agencies that would typically execute an agreement like this rather than an affordable housing plan.'",
        "'speaker_8': 'So is the proper term to use as you have in an affordable housing agreement, you do not have a development agreement that's covering the entire scope of the deal.'",
        "'speaker_4': 'We would typically have affordable housing requirements in a development agreement if there were other components to the development agreement. But it functions in the same way.'",
        "'speaker_8': 'Okay. Thank you. So can you clarify what the length of affordability is in there? And I it is I just will say it's very disappointing because several of your memos referenced that it was attached and it was not in the record.'",
        "'speaker_8': 'So we're all flying blind without actually being able to see the agreement. I understand why you couldn't provide it, but it was referenced in in your memos. Mr. O'Donnell is an attachment. And it was it was indeed not attached to any of the memos that you sent her that you submitted to the record.'",
        "'speaker_8': 'So we're all making, you know, trying to catch up here 40 years. 40 years is the minimum. Okay. And when was that agreed to before or after the ordinance change going to 60 years.'",
        "'speaker_4': 'That was agreed to in the last several weeks as we were negotiating this. The affordable housing ordinance that changed the minimum afforded affordability period to six years was adopted in the fall. But there's no city subsidies being utilized for these units required under this agreement.'",
        "'speaker_4': 'If there were any city subsidies used, any applicable city requirements would also be applicable here.'",
        "'speaker_8': 'Did you ask for the 60 years? We did and they were refused.'",
        "'speaker_4': 'The 40 years. What was that was what was negotiated.'",
        "'speaker_8': 'Okay. And then I want to ask what the agreement says about the ability to layer subsidies. So we talked a little bit before. So if they were to pay a linkage fee, they'd be on the hook for the fee.'",
        "'speaker_8': 'They're going to get credit for building on site. So there's a certain period, there's a certain amount of money this developer should just be using to pay for this housing. So does the agreement contemplate how much they are just plain on the hook for regardless versus how much they're allowed to seek subsidize city, for example, and competes'",
        "'speaker_8': ', frankly, with other projects that are also competing for those resources.'",
        "'speaker_4': 'So what the agreement states is that the provision of the 70 affordable units below 60% AMI in accordance with the agreement, waives the linkage fee on residential construction. Within this site there is still a commercial linkage fee being collected and any commercial development within the site.'",
        "'speaker_4': 'Certainly there's an option to build additional units instead of pay that commercial fee. But it is optional, not required as it is on the residential side. And the agreement also requires the 70 units at 60% AMI without the provision of city subsidies, it doesn't prohibit the use of city subsidies or contemplate their use.'",
        "'speaker_8': 'Say that last part again. I'm sorry I didn't catch it.'",
        "'speaker_4': 'That the agreement doesn't prohibit their ability to compete for city subsidies, but it does state that if they were to compete for city subsidies, it would be beyond what is required by the 70 units at 60%.'",
        "'speaker_8': 'Let me say back to you in a different way. They are not eligible for any subsidy from the city to get these 70 units at 60% of. They'd either have to go to a lower AMI, but they can seek state subsidies for them.'",
        "'speaker_8': 'They could take six states tax credits.'",
        "'speaker_4': 'It doesn't contemplate any prohibition on other financial tools to build the units other than city subsidies. Okay.'",
        "'speaker_8': 'And then can I just ask, was OED present at the community meetings that were held?'",
        "'speaker_4': 'We were. Was Melissa there? Yes. Melissa was there. Or one of our staff members was present. And where were you.'",
        "'speaker_8': 'When how much negotiation was occurring before versus after the community meetings? Primarily after oak and oak. This is really hard not to go into comments. I'll hold. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Kenny. Councilwoman Sussman. Well, she had. Sorry your husband hasn't gotten in line yet, so.'",
        "'speaker_9': 'Excuse me, Doctor. Certainly.'",
        "'speaker_6': 'That's perfectly all right. Thank you all for being here. This has been a just an amazing conversation. Nola, I'd like I'd like to ask you a question if you could go. And I'm I'm going to ask you, because you had sent us a very good email about.'",
        "'speaker_4': 'Some of the things that the neighborhood.'",
        "'speaker_6': 'Wanted to have in in.'",
        "'speaker_4': 'An agreement.'",
        "'speaker_6': 'And tonight, it's almost as if we can't we don't get a chance to decide what might be.'",
        "'speaker_4': 'In an agreement.'",
        "'speaker_6': 'Tonight, we are going to have to decide whether this.'",
        "'speaker_4': 'Stays as an industrial.'",
        "'speaker_6': 'Area.'",
        "'speaker_4': 'Or whether it becomes an industrial mixed.'",
        "'speaker_8': 'Use.'",
        "'speaker_6': 'Area. And I. I would. I'd like to know, do you think the community would like it to stay as an industrial area, or do you think the community would like it to become a mixed use area? Because if the zoning fails, they can't come back for a year to ask for the mixed use.'",
        "'speaker_8': 'Three storey one. They would have the.'",
        "'speaker_4': 'Zoning as industrial with, you know, 30 foot heights and industrial things. What what would you say that?'",
        "'speaker_6': 'After hearing all of.'",
        "'speaker_4': 'The concerns that the neighborhood.'",
        "'speaker_6': 'Would very much like?'",
        "'speaker_10': 'Well, I can speak both to the recent conversations that we have and also the conversations that we had in the neighborhood planning process, because I was a part of that as well. Yes.'",
        "'speaker_4': 'That's why I asked you.'",
        "'speaker_8': 'I thought you'd be a good representative.'",
        "'speaker_10': 'During the neighborhood planning process. And I appreciated Councilman Espinoza's question because we really didn't talk about I am x three in the context of housing. And it's also because it was kind of a different time then.'",
        "'speaker_8': 'In 2014 when we weren't talking.'",
        "'speaker_10': 'About housing as much generally what the desire from the neighbors was to get rid of industrial uses that people don't want, in particular marijuana growing in their backyard. We since then have fought for a cap on the marijuana licenses for Larry Swanson neighborhood.'",
        "'speaker_10': 'So we don't have that risk anymore to have new locations of marijuana licenses at the site, for instance. But sure, most neighbors don't want heavy industrial uses right next to them. AT&T hasn't been a heavy industrial user. You know, there's cars in the parking lot, but it's not necessarily use.'",
        "'speaker_10': 'That was upsetting to the neighborhood. We never talked about this site in the neighborhood planning process back in 2014. Specifically as far as the AT&T site, I would say more recently, that's what's made this path so hard for us to decide.'",
        "'speaker_8': 'Do do we oppose this, though? We don't really want to oppose it.'",
        "'speaker_10': 'Because we don't necessarily want industrial uses, but we had no good pathway forward and that's why we really struggled with what do we support? You know, this supporting it with conditions was kind of the makeshift solution that we had because we didn't have another way to move forward.'",
        "'speaker_10': 'And we didn't we need we we would like some sort of accountability measure for the developer to say, you know, that's why we're saying, you know, before the site development plan is completed and done, if the city could require a community benefits agreement or something like that, so that we at least we know we we have more'",
        "'speaker_10': 'than just a word that says we're going to engage in this community benefits agreement or have some sort of accountability to that. So I don't know if I answered your question, but.'",
        "'speaker_6': 'Well, we we don't we don't get those choices. We are either going to pass this zoning or we are not.'",
        "'speaker_4': 'Which would the neighborhood prefer?'",
        "'speaker_10': 'Well, let me say one other thing we did when we talked in depth in the neighborhood about the 40th and race site. We did. You know, the zoning that we went for was a35, eight zoning. It wasn't just three stories.'",
        "'speaker_10': 'And that was because of the compromise with the added.'",
        "'speaker_8': 'Affordability commitment.'",
        "'speaker_10': 'By the Urban Land Conservancy. And so I do think that if we had time to have an in-depth conversation around what that zoning could be, we could come up with something that could be better for everyone all around in the long term.'",
        "'speaker_10': 'But we haven't had the time. And, you know, we asked for the postponement of the hearing to try and work some of these things out and just didn't get that time to do that.'",
        "'speaker_8': 'So, you know, we're looking to you.'",
        "'speaker_10': 'For those types of tools. Is there anything that that that.'",
        "'speaker_8': 'We can do in the circumstances?'",
        "'speaker_10': 'Because we were like, I wish I had the right answer, but we're stuck. We don't we don't know how to move forward at this point unless there are I mean, if there are conditions that you can put in.'",
        "'speaker_10': 'But I don't totally understand the answers to that either or what how that would change the process or.'",
        "'speaker_4': 'So you don't know.'",
        "'speaker_8': 'Which. Okay. That's all right. You did. You did a good job. Thank you very.'",
        "'speaker_4': 'Much. I appreciate it. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Sussman. All right. We're going to start going back for a second round here. Councilman Brooks. Oh, okay.'",
        "'speaker_9': 'Rapid Fire, real quick. I just heard something that was different than. My original understanding, Bruce, for the the term of affordability on these units, what I understood was that the team was okay with them being. For a long time.'",
        "'speaker_9': 'I didn't understand that it was 40 years. So can someone. Clarify that. And the other thing I want to clarify is it seems as if the conversations that we've had before is you would exceed 70 units of affordability.'",
        "'speaker_9': 'You would have a range of incomes. This is in concept, and I think a lot of folks don't understand that coming to zoning, like you still have months of detail to work out. There's still a lot of things and we get that.'",
        "'speaker_9': 'But. It seems like the development agreement that was signed. Is what you're talking about, but you're not talking about your aspirations of what you want to do. And I'm not clear on that because I'm here in two different things.'",
        "'speaker_9': 'So.'",
        "'speaker_14': 'Yes, sir. Give me 1/2. All right. I'm going to look something up here.'",
        "'speaker_0': 'Okay.'",
        "'speaker_14': 'Okay. So it's correct that the agreement to build affordable units that we've executed is for 40 years. And and that's where we got in working with CPD and Dito.'",
        "'speaker_9': 'Okay. Is that the are you just doing that as the limit? Limited agreement. Do you do you have a desire to have a longer term of affordability? Do you have desire to have a rate or more affordable housing than 70 units?'",
        "'speaker_14': 'Yes. So I was trying to explain this earlier. I think when Councilman Nu asked a couple of questions, I must not have done a very good job. We aspire to have many more than these 70 units be at various levels of affordability.'",
        "'speaker_14': 'These 7070s are locked in contract. This 70 pardon me is locked in contractually. Yeah. And as I was explaining earlier, we were looking at live work studios for artists. We've had discussions about below market rate units that could be marketed to teachers at the Bruce Randolph School and librarians and all that type of kind of workforce housing'",
        "'speaker_14': 'at below market.'",
        "'speaker_9': 'So could.'",
        "'speaker_0': 'Could.'",
        "'speaker_9': 'Potentially could this reach 20% of affordability.'",
        "'speaker_14': 'I don't know today.'",
        "'speaker_9': 'Okay. So let's I think it's important to cut to the chase. There's nothing, you know, obviously, because we're under a quasi judicial state here and there are legal issues. We can't force you to sign an agreement. We can't force you to postpone.'",
        "'speaker_9': 'Right. But obviously, there's a there's a gap and there's some issues that council is trying to address with the neighborhood. My question is it it seems like and I've been writing the issues that have been with the community.'",
        "'speaker_9': 'I've been writing what I've heard from you all for the last month. And it seems like you're not far apart on issues, on targeting neighbors who have been displaced and marketing to them to be to have a first refusal on on folks at Bruce Randolph school and teachers to allow them to have the first right refusal, making'",
        "'speaker_9': 'sure that there are businesses that the community desires that are in the location, you know, making sure that there are a range of incomes that even dip down to 50% or whatever, you know, that kind of conversation making sure and we've done this with other developments, making sure that there's a community group that has a say in'",
        "'speaker_9': 'the development process or is informed about traffic studies. Can you agree to those ideas conceptually? So that I think council can really feel like the public safety and welfare of our criteria is met?'",
        "'speaker_14': 'Yes, absolutely. And so I think what we can agree to is to engage with the community, the gas coalition and others that may be appropriate in enter into some sort of a community benefits agreement or an M.O. you and that addresses the tonight's entire discussion, really.'",
        "'speaker_14': 'And I think that what we would look to in an agreement like this would be procedural things that or sections or topics that are in allow the community to encourage their participation in all of these types of solutions in their ongoing involvement.'",
        "'speaker_9': 'Okay. Okay. I'll come back. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Brooks. Councilman Ortega.'",
        "'speaker_11': 'Thank you. I appreciate all the questions that have been asked and the input that we've received from everyone. So let me just look at what has not yet been asked. So was there ever any mediation that was done between the developer and the community?'",
        "'speaker_11': 'This is very common when we have sort of this conflict or where things have not yet been worked out. Is that something that occurred and is that a role that our Nest office played in this process? Because typically we wouldn't have something coming forward that was still sort of at odds between the community and the developer.'",
        "'speaker_11': 'So I don't know who could answer that question. Maybe somebody from the plant.'",
        "'speaker_10': 'Maybe I can start with the first part and you can add on if you'd like. Mediation was offered to the applicant and the community. The applicant declined the mediation in favor of other forms of engagement. If you'd like to speak more, Bruce, about how your engagement and mediation went.'",
        "'speaker_11': 'So, Bruce, come on up for a second. So when was mediation offered and why was it declined?'",
        "'speaker_14': 'So like much of everything we're discussing tonight, it came up very late and it was primarily not appealing to us because as I said earlier tonight and has come up a few times, our interests are actually very aligned, we think, with much of the community's view of this.'",
        "'speaker_14': 'And we're agreeing to the 70 units of affordable that we've now signed the contract for. The other things have come up, the open space, the wonder about all those kind of things and that that that in effect was our offer and that.'",
        "'speaker_11': 'So but but let me let me make sure I understand this correctly, because what I was hearing was there was really one meeting with the neighborhood. And that one meeting happened after the bill request went to the zoning committee, the land use committee, is that correct?'",
        "'speaker_14': 'Well, I'm not sure, Councilman, which meeting you were referring to. We had a large community open house. We met with the GSS coalition. We met with Clinton United. We met with United North. And so well.'",
        "'speaker_11': 'I guess is the Swansea a neighborhood is it's within their statistical boundaries of their neighborhood and and typically you know. It's it's important that the notices go out. But when you are dealing with communities that have language barriers and where.'",
        "'speaker_11': 'There is a requirement to sit down and walk through the details of what is going on. It's it's not incumbent upon you to do a phone call and to to request a separate meeting, but. I think these are some of the kinds of things that we should be talking about with the planning department, about changes that need'",
        "'speaker_11': 'to be made to the process so that there is a far more robust kind of effort and engagement so that we don't find ourselves here in this kind of situation because those steps didn't take place. And and I hear that you reached out.'",
        "'speaker_11': 'You did meet with some people, but you met with some of the neighborhoods who are adjacent, but not the geese, the Swansea community. And and I think that's why you have so many people here tonight and why that concern is, is being expressed about just trying to work through some of these details.'",
        "'speaker_11': 'And I hear you loud and clear about the commitments that have been made, but the only thing we have in writing will be in the development agreement, which we don't to have.'",
        "'speaker_0': 'Councilwoman, I just wanna make sure this is restrained a little bit into comments which we'll get to. You want to make sure that we're sticking to questions I.'",
        "'speaker_11': 'Want to get to. So I asked about the mediation. The Sarah talked a little bit about an overlay with vulnerability displacement map. And I want to know. Specifically. What that is. Is that something that's done by our Environmental Health Office?'",
        "'speaker_11': 'And was that something that was looked at? Is part of this process? I mean, the whole reason we now have a nest office is to look at situations like this in neighborhoods that are being impacted by various types of issues.'",
        "'speaker_11': 'And this neighborhood out of all neighborhoods in our entire city and I just pulled up a map a few minutes ago that has at least seven. And let me see if I could just find it real quick. Streets that are closed, so access points getting in and out of the neighborhood.'",
        "'speaker_11': 'The building may have been posted, but I just drove through the area today and literally had to go all the way around from Colorado Boulevard because you can't go through on 40th Avenue. So I'm not sure how many people are actually even seeing the notification being posted on the property.'",
        "'speaker_11': 'So help me understand what the overlay with vulnerability displacement map is and how something like that could have, should have, would have been used in this kind of situation.'",
        "'speaker_10': 'Sure. Well, the map I was referring to is actually originally created by the president, say economic development, Dito. It's in Blueprint Denver. You've seen it several times now and we've done briefings with you. It's a yellow map and it shows the neighborhoods in Denver most vulnerable to displacement.'",
        "'speaker_10': 'And as you very correctly noted, this neighborhood is one of the most vulnerable. I was referring to that map because Councilman Espinosa asked me, would I confirm that I am zoning has contributed to displacement and gentrification. And I was saying, oh, that's an interesting question.'",
        "'speaker_10': 'I don't have the data in front of me. One of the things I'd want to look at to answer that question is where is there an intersection or overlay between I am zoning and areas vulnerable to displacement? I don't know.'",
        "'speaker_10': 'That's why I was referring to that map in the future after we adopt the proposed blueprint. Denver The plan does call for looking for ways, particularly through large rezonings, to use all three equity maps. So one is vulnerability to displacement, but there's also one about housing and jobs diversity and one about access to opportunity, which is the'",
        "'speaker_10': 'Public Health Department's equity index to consider those maps as we look at large rezonings. So I think in the future, there's a possibility that we might be able to use efforts like this to talk about how to get better tools in place as part of rezonings or other efforts to address concerns in areas vulnerable to displacement.'",
        "'speaker_10': 'But that was not part of the the process now, because it's not part of our criteria now.'",
        "'speaker_11': 'So I guess you can't answer this, but then. If we're not. Addressing these as part of zoning, which is a huge part of what impacts neighborhoods. I'm not clear then what Nest is actually doing in in terms of its role in these various neighborhoods across the city.'",
        "'speaker_11': 'Are vulnerable communities across the city that are being affected by gentrification and displacement. So that's that's not for you to have to answer. I think that's something that we can try to clarify with the administration and the office of Nest.'",
        "'speaker_11': 'Bruce, one last question for you. So I may be prejudicing my vote here tonight. But when I learned about sort of the disconnect, I reached out to you and said, Will you please meet with GM so you guys can work this out?'",
        "'speaker_11': 'I wasn't advocating for anything in particular other than to say, I think you guys need to sit down and work through the issues that still need to be talked through. It sounds like the the breakdown happened when you all learned there was an inquiry about the the legal protest process.'",
        "'speaker_11': 'So it's my understanding a legal protest was never filed. Otherwise we would have that here tonight in front of us. But I am concerned that we're still sort of at this this disconnect between trying to ensure, as we would do in any neighborhood across this city where we have not seen, you know, some of these issues worked'",
        "'speaker_11': 'out, we would ask that mediation absolutely be incorporated into the process. So I just want to ask about the issue of postponement and. You know, as. Councilwoman Sussman said. We could either, you know, vote this up or vote it down, or we could postpone it in attempts to try to work through and be able to put in'",
        "'speaker_11': 'writing some of the things that you've talked about, and I don't know what else the neighborhood is asking for, but I think at a minimum, again, the only thing we have is the development agreement on the housing, and that was negotiated between you and the city.'",
        "'speaker_11': 'You meaning the developer and the city. So I just want to ask about and I don't know how much time would be needed if we looked at a postponement to try to work through some of these issues. It sounds like there's, you know, some consensus on what some of these issues are.'",
        "'speaker_11': 'But I just wanted to ask what what would be a reasonable amount of time to address these issues between you all and the community?'",
        "'speaker_14': 'So we cannot postpone and therefore request an up or down vote tonight.'",
        "'speaker_11': 'And so you would be willing to take the chance that you'd have to wait a whole year or you would just walk away from the project altogether?'",
        "'speaker_14': 'Well, there's there's no walking away from it because it's owned by the applicant. And who would proceed with development under a zoning.'",
        "'speaker_6': 'Okay.'",
        "'speaker_11': 'That that clarifies kind of where you're at. So thank you.'",
        "'speaker_0': 'Thank you. Councilman Ortega. Councilman Espinosa.'",
        "'speaker_12': 'Councilman Ortega sort of took the. The wind out of my sails. That's essentially the question I was going to ask, because it seems pretty clear to me if I read the let me just read it recommendation one in the global meaning the lyrics sponsorship plan plan item B five is improve transition between industrial and residential uses to'",
        "'speaker_12': 'improve compatibility between residential and more intensive industrial areas. Development between these uses shall be should be consistent with the industrial mixed use land use designation. This is on page 29. So just page after I was in, it's a.'",
        "'speaker_1': 'C, E, three.'",
        "'speaker_12': 'E8 and E 22. And that is where you find the language that is consistent with Nola's portrayal, which is that housing was only tangentially referenced here. So my question I'm going to ask the question still again, even though you were really clear, so I'm very confused by everything that has been said tonight by your design team in'",
        "'speaker_12': 'particular, right? Because the current zoning has a 22.0 IFR. Sara just explained it correctly, which is you can build nearly the entire lot two stores. If you want to build a three storey house structure, then it's going to be 66% of the total site, meaning 33% of the site would be open space or parking or whatever.'",
        "'speaker_12': 'You're now telling me that you're you're contemplating up to 35% of the site being open space, you know, but you're only going to agree to 20%, but you're not going to put that in writing. So what it seems fairly clear to me then is if you're if your form is, for all intents and purposes, consistent with the'",
        "'speaker_12': 'EIA. F.A. The whole reason for this rezoning is to build 630 market rate housing units where there's very little plan support. And so I think probably I'm putting words in the CPD's mouth that probably why they encourage you to have this conversation with the community is to address this discrepancy and to figure out a way to actually'",
        "'speaker_12': 'help you guys get to the outcome you're wanting. But by working with the community so you're not the client, but is your client at all amenable with working with this neighborhood for, say, 60 or 90 days so that we can see if this outcome can be achieved?'",
        "'speaker_14': 'So the a couple of things in response, Councilman. The are conceptual designs so that switching from idea to IMX is about a 300,000 square foot loss in development potential building failure. And so it's a down zoning in effect by limiting the site to the three stories.'",
        "'speaker_14': 'And we I agree that some of the discussion tonight was confusing on the open space. Right now, our development program conceptual 35% open space. But we're confident that 20 of that would meet the city's requirements for publicly accessible open space.'",
        "'speaker_14': 'And so that's why the two numbers are floating around. The as I stated earlier, yes, we are absolutely willing to and will commit tonight to continue to engage and work with the community on all these variety of issues.'",
        "'speaker_14': 'But that would have to be post rezoning if in fact, the rezoning is approved tonight, and if not, we'll live with it.'",
        "'speaker_12': 'So I just want to correct the record because what Sarah was describing was AIA zoning, which only allows those industrial uses and use table it. So I'm going to compare apples and apples IMX 3ia has a 20 foot primary street set back and a ten foot side street setback.'",
        "'speaker_12': 'IMX three has a zero setback and you can cover that entire site to 32 to 3 stories. So so if you're using your townhouse form, I get how you could end up with an open space requirement. But if you're using industrial, if you do the industrial uses, which this plan supports and encourages for jobs, you can actually'",
        "'speaker_12': 'develop more intensely than what you're describing. Is that true?'",
        "'speaker_14': 'So I'm I'm sure that may be true. Our plan yields what I've described to you as.'",
        "'speaker_12': 'Doing a rezoning. That's true. A rezoning that allows this sort of intensity of development.'",
        "'speaker_14': 'So you're right, we're we're caught up in a plan when the only criteria for the rezoning are the five, including compliance with the plan. And it says I am x three.'",
        "'speaker_12': 'And so what I'm actually saying is it says industrial makes you use and then it describes what they mean by industrial mixed use, which was exactly as as NOLA had conveyed to Councilwoman Sussman. I'm telling you right now that I don't know how you got this far, because the plan does not seem to support 700 housing units'",
        "'speaker_12': 'on this property.'",
        "'speaker_0': 'Councilman, you might receive some of that for comments. Yes. You have some more questions. Councilman? Yeah. Thanks a lot. Just a couple questions. In several rezonings we've had. Boy, you're a tough negotiator, and it seems like we're negotiating more, a lot more than 10% affordable units.'",
        "'speaker_0': 'Wow. How do we settle on 10% when we probably could have gotten more?'",
        "'speaker_4': 'So this site has 70 units, which we have some agreements that have between ten and 15%. But these are all below 60% AMI and have no city subsidies being used for them.'",
        "'speaker_0': 'Was there any negotiation about trying to do less than 60%? You know, the a separate building on the side or some of the things we've been talking about with flexibility.'",
        "'speaker_4': 'There was an attempt to negotiate a lower affordability level. That is a minimum. Certainly there's more that could be done above that minimum. And I think there's a commitment tonight to continue the conversation about what additional affordable housing may be at the site.'",
        "'speaker_0': 'Okay. What about displacement tools we've seen like we've talked about displacement tools. Were any of those talked about and discussed with the community or or do we have any displacement tools?'",
        "'speaker_4': 'So I think it might have been Sarah, who addressed earlier that the development agreement has to contain what we can enforce as a requirement of the developer. So we do have other tools related to displacement where other partner organizations may be involved, but that's not something that we can enforce with the applicant.'",
        "'speaker_0': 'Nothing that would apply to this situation.'",
        "'speaker_4': 'I think there are some ideas that there's.'",
        "'speaker_0': 'Rezoning.'",
        "'speaker_4': 'There. There are some ideas that have been proposed tonight and as part of the discussions that we would continue to support the dialog around. But the Affordable Housing Agreement just addresses the specific unit requirements.'",
        "'speaker_0': 'GREGORY Thank you. Bruce, one one last quick question. I know we're going along here. We had a rezoning a year or so back on Colorado Boulevard, where we had a lot of community unrest, you know, and that that rezoning was a nine.'",
        "'speaker_0': 'They came back with a really good project because it reached agreement with the neighborhood. And I just want to say, I hope you will consider a postponement to reach some kind of agreement and not, you know, risk a denial of a rezoning.'",
        "'speaker_0': 'But here's something I think what I've heard tonight, it would be great to have that kind of conversation, and I hope you'll consider it. Thank you.'",
        "'speaker_14': 'Thank you.'",
        "'speaker_0': 'I think Councilman new councilman Flynn. Thank you, Mr. President. Courtney, I had a couple questions on the criteria and the staff's analysis of it justifying circumstances. I understand since since the date of the approval of the Zone District 2010, there's been a change to such a degree that the proposed rezoning is in the public interest.'",
        "'speaker_0': 'Can you explain to me how the staff analyzed the opening of the East Side Human Services Center like seven or eight blocks away as something that justifies this rezoning? And then also the opening of the aligned stations, which this this particular site happens to be exactly, I think midpoint between 38th and Blake and 40th and Colorado stations'",
        "'speaker_0': ', both of which are just slightly over one mile away. Mm hmm. So how does that. Justify this reasoning.'",
        "'speaker_10': 'So that fourth criterion justifying circumstances has sub criterion, a change or changing conditions in a particular area or the city generally or so a particular area or city in general. We're looking at area things in the area change and there's investment and that may, you know, because the there's so much change in the area that may necessitate'",
        "'speaker_10': 'a different zone district that would better reflect the change in that area because of the different things that we talked about. So the 40th and Colorado station 38th and Blake, these are all things that we look at for justifying circumstances is very standard practice with rezonings in terms of like justifying circumstances and that being a suitable criteria'",
        "'speaker_0': '. Okay. That particularly when you say changing conditions in the city generally, that that's that's sort of so murky that you can almost justify any any request.'",
        "'speaker_10': 'Right.'",
        "'speaker_0': 'Okay. And then and I understand adoption of the early response to a neighborhood plan that is obviously a a changed condition. And then on criteria three, further public health, safety and welfare. The analysis that's described here seems to be just a repetition of criteria, one which is consistency with adopted plans.'",
        "'speaker_0': 'And I'm wondering if we're getting we're killing two birds with one stone here. This application furthers the public health, safety and welfare because it implements adopted plans and encourages adaptive reuse. That's exactly the same analysis that was in criteria one, are we not, you know?'",
        "'speaker_0': 'Killing two birds with one stone.'",
        "'speaker_10': 'Here it does. So it's a little bit different. We go on to say, too, that not only through the implementation of adopted plans that would further the public health, safety and welfare, also it through encouraging adaptive reuse and infill redevelopment of an underutilized site, can help encourage the public health, safety and welfare in encouraging a mix of'",
        "'speaker_10': 'uses.'",
        "'speaker_0': 'Okay. I think we've heard some testimony from the community that they're concerned that this actually imperils the their safety, health and welfare. Was that taken into account in any way? By staff.'",
        "'speaker_10': 'By. I think we definitely did hear, you know, that there were many concerns related to this rezoning in terms of the the criteria, in evaluating the criteria. There are things looked at and we did find that encouraging the adaptive reuse and infill and the implementation of adaptive plans didn't meet the review criteria for that third one with'",
        "'speaker_10': 'the public health, safety and welfare.'",
        "'speaker_0': 'All right. Mr. O'Donnell, just one more question. And Councilman Espinosa was asking something that I wanted to get to after you had said that you would prefer an up or down vote you would develop under AIA if if you didn't get the rezoning, i.e. doesn't allow residential.'",
        "'speaker_0': 'And so what would you have in mind?'",
        "'speaker_14': 'So that's correct. I.e. does not allow residential, right. And what I'm about to explain to you is I the first to admit is anecdotal, but since our client is on this property, the industrial brokers and developers have been beating the door down to get to this site in order to do industrial warehouse distribution manufacturing type uses.'",
        "'speaker_14': 'The client would rather have a 30 year rent free lease with one bound commit to affordable housing. We actually think that the introduction of residential uses here and the commitment to affordable helps mitigate displacement. And all of these things are valuable to the client.'",
        "'speaker_14': 'But the industrial is economically actually more appealing. If you if all you looked at was financial returns. And so I would be a green light tomorrow.'",
        "'speaker_0': 'Okay. Thank you. That's Councilman Flynn and Councilwoman McKinney.'",
        "'speaker_8': 'Thank you, Mr. President. I would like to start with asking Kirsten Crawford, our Legislative Council, a question. There seems to be a discussion about whether the applicant is going to consent to a postponement, but it is within the authority of this council to motion for a postponement and vote on it, regardless of the wishes of the applicant'",
        "'speaker_8': '. Yes. Kirsten Crawford, Legislative Counsel And that's correct. You guys could postpone to a date certain, and if we did so, it would be we should be basing it on something in the rec. We should be leaving the record open.'",
        "'speaker_8': 'Talk to me about the criteria by which we should be considering why we would be doing that if there was, for example, a criteria that was missing or incomplete or. Well, that's right.'",
        "'speaker_10': 'I mean.'",
        "'speaker_8': 'If council moves to postpone the hearing, the hearing would remain open. But the criteria is still going to be the same as it is presented today by staff. Right. But for example, would it be a legally permissible reason to move for a postponement if you felt the record was incomplete or unclear and you wanted to give folks'",
        "'speaker_8': 'time to submit additional material related to a criteria, it, might that be a legally appropriate reason to move for a postponement? Yes, I think that's appropriate. Okay. So I'd like to check in because I've been cross-referencing some of the plans we have and I want to focus on the criteria about plan conformance.'",
        "'speaker_8': 'So I've stated the fact that I have no. One of the key plan components is that expanding access to affordable housing and I have no written record submitted for this hearing related to the affordable housing agreement. I've, you know, happy to hear updates from folks.'",
        "'speaker_8': 'But you notice each time we ask a question, we learn something different. For example, I don't have any information about what happens if they build fewer units than expected, or maybe they build 900 units than does the number of housing units go up.'",
        "'speaker_8': 'So I just can can anyone clarify for me? Just to make sure that I'm not mistaken, that there's nowhere in this record that I have a written record of this affordable housing commitment that has been described. I've looked through every page I can open on granicus and I see not that it that I do not see that'",
        "'speaker_8': 'it was submitted. So I want to clarify that if you do not believe you submitted something to Granicus that didn't get uploaded, for example.'",
        "'speaker_14': 'Until I. Apologize that if you don't have this file, I would be happy to submit. For the record this evening my copy of the agreement to build affordable units that has been signed by our client and Notarized.'",
        "'speaker_8': 'Well, we're, you know, 1015 here. So I want to ask the staff, maybe, Courtney, if you can answer. There's there are numerous mentions to displacement. There's also mentions to implementing health impact assessments in the plan. The plan calls for that.'",
        "'speaker_8': 'It says when there's development, we should be impact in implementing health impact assessments and we should be looking to anti displacement. Are you aware of anywhere in the record where those items are addressed for plan conformance? So as I look to see whether this proposal conforms to the plan, whether there's anything in there related to those two'",
        "'speaker_8': 'pieces specifically that you're aware of that you submitted or reviewed in your staff analysis?'",
        "'speaker_10': 'No, there is not. We just talk about the land use recommendations of the plan and how this is meeting the specific land use recommendations of IMAX three.'",
        "'speaker_8': 'But if I was a decision maker, we're looking for conformance with all aspects of the plan and not just that one map. There's no nothing that you know of in the in the record. So the record is is absent.'",
        "'speaker_8': 'It doesn't mean it doesn't meet it, but there's nothing in the record that demonstrates how it meets it. No. Okay. To either the developer's representative or any of the tenants in the room. Is there any planned or current request that has been made, whether it is informal or has formally been submitted for any subsidies for this site'",
        "'speaker_8': 'whereby this project might be coming through this Council again in the future?'",
        "'speaker_14': 'No.'",
        "'speaker_8': 'So no, no request for subsidies has been discussed with you or any tenant and the city and county of Denver at this time for any aspect of this project.'",
        "'speaker_14': 'No, not that I'm aware of.'",
        "'speaker_8': 'Okay. And does any tenant want to discuss anything differently? Okay. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Kennedy. Councilman Lopez.'",
        "'speaker_7': 'Thank you, Mr. President. Mm hmm. Excuse me. I still have a few questions. One of them talked about. So in. In the plan. And maybe this is for you, sir. But in the plan, it talked about any kind of development that kind of takes in that surrounding kind of diverse city reflects it.'",
        "'speaker_7': 'And any kind of new development, have there been any any renderings, anything that anything visual has been produced through all this process? In terms of like height, what buildings look like, some of the things that are required in the zoning and I've seen a lot of rezoning has come here and we've asked those kind of questions we'",
        "'speaker_7': 'can't consider. But yeah, been out there.'",
        "'speaker_10': 'Since it's not technically part of the consideration criteria we haven't asked for that required it, but I, I don't know if the applicant. I know. Do you have any 3D renderings or anything.'",
        "'speaker_7': 'So I'm very curious about that. And then the other to you know, there's regarding the train safety and.'",
        "'speaker_14': 'Yes, so I've we do have some conceptual renderings and I've shared them in emails with counsel. One of them shows the extensions and the connections of it's a it's a concept site plan and it shows about 30 what we think we would classify as a 35% open space.'",
        "'speaker_14': 'It shows the 41st and 42nd Avenues where they enter the site. It shows how the buildings on the west half of the site are adaptively, reused and repurposed to accommodate redevelopment and in a home for wander around all those kind of things.'",
        "'speaker_0': 'Okay.'",
        "'speaker_14': 'You know.'",
        "'speaker_7': 'Let me ask about train safety. Still a train track? Yeah, there's still train tracks running through there with heavy rail. What's being done to buffer that? Are you taking that into consideration with that box in terms of any kind of buffers or even noise reduction and things like that from what some of the proposed development.'",
        "'speaker_14': 'Bill might be able to answer this better than I can. I think there's in the building designs, there's things like windows and special siding and insulation and so forth for sound. There is a at grade crossing obviously at Clayton.'",
        "'speaker_14': 'Yeah, this site is almost exactly a third of a mile from the two stations for forties in Colorado and and also 38 in Blake. But that's the extent of my what I could speak to this evening on anything to do with regard to the train.'",
        "'speaker_7': 'At any point in the property, maybe you sir, if I could ask you, is there any what's the closest point of the property to the nearest. Train track.'",
        "'speaker_11': 'Let's.'",
        "'speaker_13': 'I'm not sure the exact distance, but it it estimate it curves around the track and it's light rail is the closest to the property and it's probably 30 or 40 feet to the property line. But I, I'm totally guessing based on the surveys.'",
        "'speaker_7': 'Let me ask one of the. Sara, somebody from CPD. How close can we get legally to a train tracks of that magnitude? For development. Oh, can you. Can you hear me? I'm sorry.'",
        "'speaker_10': 'Did you ask how close?'",
        "'speaker_7': 'How close can you legally?'",
        "'speaker_10': 'Oh, my daughter.'",
        "'speaker_7': 'Well, I.'",
        "'speaker_10': 'Mean, so in the zoning, there aren't there aren't additional requirements that relate to the proximity to the rail. So it be whatever the required setback is right there, you.'",
        "'speaker_6': 'Know what the setback is to look it up.'",
        "'speaker_10': 'So we can look and see what the zoning requirement is. But there's when they go through site development review, thanks in part to Councilman Ortega, there's now a process for any properties that are close to a rail line to go through extra review.'",
        "'speaker_10': 'It may not often, I don't think it results in necessarily a larger setback than the rezoning or though it might can also include other things that get at safety and noise. So the proper windows and things like that.'",
        "'speaker_7': 'The reason I ask is. Because I mean, it's a it's a it's a potential hazard. It's it's an emergency. It's an emergency management question. And it's definitely not the EL and Chicago. I mean, yeah, I think who's around it rattles everything around it.'",
        "'speaker_7': 'But you live next to the ah. You chose to live there. Right. So it's a little different. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Councilwoman Black.'",
        "'speaker_11': 'Who's your mike? We can't hear you.'",
        "'speaker_4': 'I had actually withdrawn my request, but since it didn't go away, I'm just really curious about Councilwoman Sussman question, too, you know, about what the community would prefer, because this is a very difficult decision we're making tonight and.'",
        "'speaker_4': 'I feel like the applicant is. Going to build something that the community might like that includes affordable housing, or they might have an industrial warehouse there. So.'",
        "'speaker_0': 'Hey.'",
        "'speaker_6': 'Do you have any more thoughts on that?'",
        "'speaker_10': 'If they know.'",
        "'speaker_0': 'You're going to have to come up to the microphone.'",
        "'speaker_10': 'They're asking if if, if they don't do IMAX 3D. And we did we came up with a different zoning code together. Could that. But they can can they and at the same they can't apply for a different. Proposal.'",
        "'speaker_10': 'It was a different proposal. Could they apply for.'",
        "'speaker_4': 'You mean could they if you if they didn't if this didn't pass tonight, could the applicant come back and apply for a difference? Yeah, I believe that happens.'",
        "'speaker_10': 'Within before the year.'",
        "'speaker_6': 'But there's.'",
        "'speaker_9': 'Can I?'",
        "'speaker_4': 'Can I? There would have to be plans for.'",
        "'speaker_0': 'Councilman or councilman. Councilman Brooks, did you have something to add to this?'",
        "'speaker_9': 'You just call me Espinosa.'",
        "'speaker_0': 'He was standing up. I apologize that the hours late.'",
        "'speaker_2': 'So.'",
        "'speaker_9': 'Bruce. First you want to come up to the what if what if we. You know it it again. We can't force you to do anything. But if there was a group of these folks in the DC Coalition with some of the neighbors who are here who testified to do a month delay.'",
        "'speaker_9': 'And to agree on these kind of components that we conceptually agree on, but to get them down and to come up with a benefits agreement that everybody could feel like conceptually was the right direction.'",
        "'speaker_14': 'We we could probably do up to one month. Okay. Does that answer your question?'",
        "'speaker_0': 'Yeah.'",
        "'speaker_9': 'Yep. And, Nola, can you can you come to the micro quick? Nola, would you be open to. Obviously, we've worked together. You have great leaders in your group and also some of the folks who live adjacent to the property that it sound like there.'",
        "'speaker_9': 'I'm forgetting your name, sir. In the back. Yeah. No. In that. Yes. At this gym. Yeah. He has some some folks, some neighbors. And maybe that could be a group that comes together to conceptually come up with an agreement.'",
        "'speaker_0': 'Okay.'",
        "'speaker_10': 'A real assigned agreement. A real agreement.'",
        "'speaker_9': 'A community benefits agreement that everybody can be like, yes, this is this is this is meeting halfway or.'",
        "'speaker_10': 'Yeah, I mean, a month is rough, but. That's all we can get.'",
        "'speaker_9': 'Okay. Can can I. Bruce, one of the things you didn't talk about is why you all have not done a delay. And I think. I think it's important. You know, to talk about finances is I mean, that's what you told me as to one of the reasons.'",
        "'speaker_9': 'And so is there a financial issue?'",
        "'speaker_14': 'Well, I think that, yes, there's this property is very expensive to hold vacant, largely vacant, while also spending a lot of money on pre-development and planning and design and zoning and those types of things. And it it's.'",
        "'speaker_9': 'Can you give us an idea of how much architectural plans, things like that, a mortgage on 14 acres would cost?'",
        "'speaker_14': 'So right now, the what we would kind of call the monthly nut or the monthly burn is about $150,000 a month on the the mortgage and in consultant fees and that type of thing.'",
        "'speaker_9': 'Okay. Thank you. Thanks. Thanks, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Brooks. Councilman Black. You started that line of questioning. Are you good? Yeah. Okay. And Councilman Espinosa, you're still on screen. Do you still need in or are you good?'",
        "'speaker_12': 'Yeah, it's just sort of elaboration on the question here. So I looked at the plan that you said you sent to us. So is this that document?'",
        "'speaker_14': 'Yes, it looks familiar.'",
        "'speaker_12': 'Yeah. Okay. This is interesting to me, right? Because. This is one of those situations where, again, and we've been down this road sort of both in our personal lives prior to our time in council, which is this depicts something that I think could largely be supported by people.'",
        "'speaker_12': 'But we agree. But the zoning allows this and a whole lot of other things. Do you agree on that? Yes. And so this is but I do see a lot of things here that could, in fact, be codified if you've talked about the plaza.'",
        "'speaker_12': 'The community might say, well, we want to make sure that a portion or all of that plaza and I can see it here, is publicly accessible because right now it's very introverted and it's not clear in this plan if it would be or not.'",
        "'speaker_12': 'And so that could be codified. You know, there has been talk about the wonder ban people, and it sounds like it's going to be a real community asset. You could ascribe a minimum percentage of square footage that would be dedicated to that sort of function and codify that as well.'",
        "'speaker_12': 'And so there's a lot that you've already done that I think could get to the point where there's some sort of there's something written and documented that would would would give us some assurance that the things that you're talking about that address many of the concerns that I have with regard to plans could be captured.'",
        "'speaker_12': 'So but you've already made it very clear that you're not interested. You want an up or down vote. And yeah, it would cost $150,000 a month. But if this council.'",
        "'speaker_0': 'Chose to have a question and we're still in questions.'",
        "'speaker_12': 'Yeah. If this council chose to make a motion of a defined amount of time, would you utilize that time to maybe try to to do the things that I'm talking about, which is to give us some certainty that the outcome that you're depicting would.'",
        "'speaker_12': 'Yes. All right. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilman Espinosa. So, Councilman Brooks, before we close this hearing, it sounds like we may have, you know, an applicant who is willing to delay and a community that is eager for a delay. Would you like to make a motion before I close the hearing?'",
        "'speaker_9': 'Yes. I want to add one more thing to this, is that we get a neutral mediator to put together a community benefits agreement. And, you know, being someone who's worked with the GSA coalition many times just past the rezoning, worked with the applicant, this is much closer than.'",
        "'speaker_9': 'Kind of this hearing alluded to. I believe we're really close to an agreement. And so. I got to ask my lawyer what cursor, what motion. I move that we move this hearing to postpone this hearing to May 6th time.'",
        "'speaker_9': 'And I'm looking at the secretary I'm looking at the president to make sure that May six we have a public hearing available.'",
        "'speaker_6': 'I mean, that's that's fine. You want to postpone final consideration with its public hearing?'",
        "'speaker_9': 'Yeah, we want to postpone final consideration with this public hearing to May 6th of counsel Bill 127.'",
        "'speaker_0': 'Madam Secretary, does that pass muster?'",
        "'speaker_6': 'Yes, sir.'",
        "'speaker_0': 'All right. We have the motion in there. Can I get a second? All right. Question Time. Oh. Councilman Ortega, do you have a question about the motion on the floor? Yes, I do. Sorry. Kirsten, do you have clarification about the motion on the floor and then you go first?'",
        "'speaker_8': 'So. Kirsten covered Legislative Council just to make clear the motion will postpone the final vote to a date certain, but it will continue the hearing as well. So the hearing will remain open.'",
        "'speaker_0': 'Yes, correct. I haven't closed the hearing yet. So. Okay. That is what's on the floor. Councilman Ortega, do you have a question about the motion?'",
        "'speaker_11': 'I just wanted to make a request that we include the NEST office in that conversation.'",
        "'speaker_0': 'All right. Noted. All right. So we have a motion and a second. Councilman Espinosa, do you have a question about the motion on the floor?'",
        "'speaker_12': 'I just want to confirm what I believe we already know, but let's just get it on the record that since we're extending this public hearing, if the council adopts a new blueprint, Denver and Cobb plan that we are doing it under these current zone, you know, adopted plans.'",
        "'speaker_9': 'We have.'",
        "'speaker_7': 'Confirmed with our.'",
        "'speaker_9': 'Legal team.'",
        "'speaker_0': 'Somebody should play the Jeopardy! Music while we wait.'",
        "'speaker_8': 'So, Kirsten Crawford, Legislative Council, the the applicant has voluntarily agreed to the delay. And so the terms and conditions would and the criteria are going to be the same. So it's under the same set of plans.'",
        "'speaker_0': 'All right. Okay. We've got all the questions answered. We have a motion on the floor. It has been seconded. Madam Secretary, roll call on the motion on the floor.'",
        "'speaker_6': 'Hmm. Black. Hi. Brooks. Hi, Espinosa. Hi. Flynn.'",
        "'speaker_0': 'Hi.'",
        "'speaker_6': 'Gilmore. Cashman. I can reach Lopez. I knew Ortega. I Susman. Mr. President.'",
        "'speaker_0': 'I. Secretary, please close the voting. Announce the results. 12 hours 12 IES Council Bill 19 20127. And it's still open. Public hearing will be postponed till.'",
        "'speaker_6': 'May.'",
        "'speaker_0': 'Six. Till May six. Thank you all for all of your time staying here so late in those super comfortable seats. Quick announcement on Monday, April 15, 2019. Council will hold a required public hearing on Council Bill 19 0349.'"
    ]
}