{
    "A Proclamation Recognizing the Annual Brothers Redevelopment and Denver Employee Volunteer Opportunities Paint-A-Thon Day in the City and County of Denver on Saturday, August 10, 2019": [
        "'speaker_0': 'Thank you, Councilman Herndon. And just to be clear to all the new members who might want to join us, the four mile all downhill leg is mine. All right. That concludes our presentations. There are no communications this evening, but we do have one proclamation.'",
        "'speaker_0': 'Councilman Ortega, will you please read Proclamation 570?'",
        "'speaker_7': 'I would be happy to. Proclamation number 570. Is that right? Yep. Sorry, the number was not on my copy in front of me. This is recognizing the annual Brothers redevelopment and Denver employee volunteer opportunity, otherwise known as Devo Paint Athon Day in the city and county of Denver on Saturday, August the 10th.'",
        "'speaker_7': 'Whereas, through a partnership with Denver Employee Volunteer Opportunities, Devo and Brothers Redevelopment Inc 100 plus Denver city employees will volunteer their time to paint homes of deserving senior homeowners. Four Brothers Redevelopment Inc's 41st paint a thon. And. Whereas, all painting will be completed free of charge for homeowners saving the city's fixed income seniors thousands of dollars in'",
        "'speaker_7': 'home maintenance cost. And. Whereas, volunteers will be beautifying homes and preserving home values in Denver neighborhoods as a result of their participation. And. Whereas, The Paint Athon is a great way to show the city employees that city employees take pride in the community and care about its residents.'",
        "'speaker_7': 'And. WHEREAS, the paint a thon truly makes a difference in the lives of many Denver residents. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City Council recognizes the day of August ten, 2019, as brothers redevelopment paint a thon day in the city and county of Denver'",
        "'speaker_7': '. Number two, that the clerk of the city and county of Denver shall a test and affix the seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the Devoe board.'",
        "'speaker_0': 'Thank you. Councilman Ortega. Your motion to adopt.'",
        "'speaker_7': 'I move for the adoption of proclamation number 570.'",
        "'speaker_0': 'It has been moved and seconded comments by members of Council of Councilman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. We are very lucky to have this nonprofit who has been doing this community service for the last 40, now 41st year. I have gone out on several occasions and participated in this alongside my city employee colleagues.'",
        "'speaker_7': 'And the homeowners are just so, so gracious.'",
        "'speaker_9': 'And we are so grateful for the city. So we. I see. Yeah, I. So we.'",
        "'speaker_0': 'Go ahead, Councilwoman Ortega.'",
        "'speaker_7': 'So, Mr. President, I just wanted to acknowledge some of the city agencies that participate in this annual event with employees who, you know, recognize the importance of stepping out and doing this volunteer work for seniors in the Denver community who really otherwise would not be able to get this work done on their own because most of them'",
        "'speaker_7': 'cannot afford the costs to do some of these repairs. So our Denver County Courts, Denver Department of Public Health and Environment, Denver International Airport, Parks and Recreation. The Denver Police Department. Human Services Office of Human Resources, City Attorney's Office, members of Council have have participated in this.'",
        "'speaker_7': 'And so, as I said, over 100 employees from these various departments have stepped out to recognize the importance of of helping seniors in our community and to the staff and the other volunteers from Brothers Redevelopment. I just want to say thank you for continuing to do this year after year and really making a difference in people's lives'",
        "'speaker_7': '. Thank you, Mr. Chair.'",
        "'speaker_0': 'Thank you, Councilman Ortega. And thank you so much for bringing this proclamation forward. Madam Secretary, roll call.'",
        "'speaker_7': 'Ortega i.'",
        "'speaker_3': 'Black.'",
        "'speaker_1': 'I see tobacco. I. Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_1': 'Gilmore. I. Herndon. Can each. I. Sandoval.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'Sawyer. I. Torres. I. Mr. President.'",
        "'speaker_0': 'I. I'm secretary. Please close voting. Announce the results. 11 days 11 is proclamation. 570 has been adopted. We do have 5 minutes set aside for proclamation acceptance. Councilwoman Ortega, do you have someone you'd like to invite up?'",
        "'speaker_7': 'Yes. The executive director or president, as he's known Jeff Martinez with brother's redevelopment. And then I believe that's Chad with you. Chad Nibley, who is the program manager with Brother's Redevelopment Payment Fund. And I believe Derek Hoyt might be here with the DEVO program.'",
        "'speaker_7': 'That's you. Okay, so would you all please come forward?'",
        "'speaker_2': 'Well, good evening. Thank you. Council President. Members of council. Thank you so much, Councilmember Ortega, for those kind words. I'm Jeff Martinez, president brother's redevelopment. And on behalf of our team, we're really excited and honored to be here again to share our excitement as we team with Denver employee volunteer opportunities or DEVO to paint the homes as'",
        "'speaker_2': 'part of the 41st season of our annual paint a thon. And as many of you know, the paint a thon is brother's redevelopment signature event. Each year, we recruit teams of volunteers to paint the homes of income, qualified senior and disabled homeowners across the city.'",
        "'speaker_2': 'And Deveau is one of our longest serving volunteer teams. Since this partnership, I think, formally launched with the city in 2005, the devotees, as we like to call them, have painted more than 113 homes, donated 13,000 volunteer hours in getting there.'",
        "'speaker_2': 'And it's just such a tremendous gift for our homeowners in the city. And through their efforts, they've also added luster and value to the seniors. Most important investment their home. To date, Divo volunteers have saved clients more than 285,000 during that period in home maintenance expenses and preserved property values along the way.'",
        "'speaker_2': 'Volunteers also restore hope in the process. As one Denver senior whose home was painted this year as part of our event, they shared with us in a letter. My home is now beautiful. I feel a new sense of pride and home ownership.'",
        "'speaker_2': 'I no longer feel that I rundown my neighborhood. I've always tried to give anything and everything I could. Now I have been given back tenfold. I can't put into words what your volunteers who painted my home have done for me.'",
        "'speaker_2': 'We volunteer, we make a difference. And each year, Deveaux helps us all paint the picture of a caring city, showcasing the value of volunteerism to our neighbors, our elders and others. So this Saturday will see city employees up on those ladders, not too high liability issues, and we'll also see them bearing brushes once again in the Globeville'",
        "'speaker_2': ', Elyria, Swansea and Park Hill neighborhoods, volunteering their time to show our seniors how much the city in this community cares for them. So we hope you'll be there. We have Precious for you. We're going to put them out.'",
        "'speaker_2': 'But now we can give you some. We hope to see you there this Saturday. Painting smiles at a paint a thon site near you. So we welcome you to join us. Thank you.'",
        "'speaker_0': 'Thank you very much. Thank you for all your great work. Before we move on to our bills for introduction, I missed I believe we have State Senator Robert Rodriguez still here in the House. Welcome. Thank you for joining us.'",
        "'speaker_7': 'And Representative Paul Rosenthal, former Representative Paul Rosenthal is also in the honorable.'",
        "'speaker_0': 'Thank you very much for being in our chamber with us this evening. All right. That brings us to our bills for introduction. Madam Secretary, will you please read the bills for introduction.'"
    ],
    "A bill for an ordinance amending Chapter 59 (Zoning) of the Denver Revised Municipal Code to revise the amendment procedure for land retaining Planned Unit Development zoning under Former Chapter 59. Amends the Denver Revised Municipal Code (DRMC) to change who may submit an application to partially rezone a Former Chapter 59 Planned Unit Development to a district in the Denver Zoning Code by requiring the consent of only those property owners within the portion being rezoned. The Committee approved filing this item at its meeting on 6-25-19.": [
        "'speaker_0': 'of council. Speakers will have 3 minutes and there is no yielding up time. On the presentation monitor on the wall you will see your time counting down. Speakers must stay on the topic of the hearing and must direct their comments to the council members.'",
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilman Flynn, will you please put Council Bill 584 on the floor?'",
        "'speaker_13': 'Yes, I will, Mr. President. Thank you. I move that council bill 19 Dash 584 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The required public hearing for Constable 584 is open. May we have the staff report?'",
        "'speaker_3': 'Yes. Thank you. Good evening. I am Libby Adams. I'm an associate city planner with community planning and Development, and I'm here to present on the proposed text amendment to the Denver Revised Municipal Code regarding the partial rezoning, a former Chapter 59 planned unit developments.'",
        "'speaker_3': 'And so in the following slides, we'll talk about the purpose of this text amendment. I'll go through the summary of the existing regulations and what's being proposed. I'll highlight the public process and the feedback we received. I'll talk about how the review, how the proposed tax amendment meets the review criteria and then conclude with the staff recommendation'",
        "'speaker_3': '. And this proposed zoning text amendment is sponsored by the Community Planning and Development Executive Director. So the purpose of the text amendment is to revise the Denver Revised Municipal Code to change who may submit an application to rezone a portion of a former Chapter 59 planned unit development.'",
        "'speaker_3': 'The hope is that this will encourage property property owners in the former Chapter 59 PUD to rezone into districts in the Denver zoning code by simplifying the requirements for who may submit an application. So the under the existing requirement in order for a single property to re zone out of an old code pad.'",
        "'speaker_3': 'All property owners within that PUD would be required to sign the application under the proposed requirement. Just the applicant who's who's proposing to rezone their property out of the old code would be required to sign the application. So this applies only to applications for portions of former Chapter 59 PDS that would be rezoning into a district in'",
        "'speaker_3': 'the Denver zoning code. The existing signatures requirement presents an unnecessary barrier that doesn't exist for other former Chapter 59 properties. So those with waivers and conditions, as well as those unplanned building groups, are all able to submit an application for an individual property.'",
        "'speaker_3': 'So removing it would level the playing field for all property owners that are within the former Chapter 59 code. So this is an illustration of the existing requirement. So if the property owner of the blue, the property represented in blue would want to rezone out, they would have to get signatures from all eight property owners within this'",
        "'speaker_3': 'PWD in order just to submit an application. Under the proposed requirement, the property owner in blue would be the only one required to sign the application in order to apply for rezoning. And this is a map of the former Chapter 59 pads that are in Denver.'",
        "'speaker_3': 'So the ones in kind of the orange, a yellow color are just one property. So those won't be affected by this text amendment. But the ones in red are multiple properties. So those would potentially be affected by this amendment.'",
        "'speaker_3': 'So as you can see, it does impact all areas of the city, but is concentrated those in Cherry Creek and then the far northeast. This is just a highlight of the public process. I won't go through everything it was in your staff packet, but I will highlight just a couple of things.'",
        "'speaker_3': 'So on January seven, this red line and the summary was posted to the Community Planning and Development website as well as an email was sent to registered neighborhood organizations and city council members. Then on January 26th, staff went before the entire Neighborhood Cooperation, Zoning and Planning Committee to present on this topic.'",
        "'speaker_3': 'And in that meeting, we did learn that they would that the greater agency organization would be meeting on February 9th, which is three days after the originally scheduled planning board hearing. And so in order to allow them to meet as a large organization and come to a formal vote on this matter, we decided to postpone the planning'",
        "'speaker_3': 'board hearing. So that's why this process started several months ago. And then we also allowed for more time for public input. So we went to the Montebello Neighborhood Improvement Association meeting on February 20th. And then we're here before you today on August 5th for the city council public hearing.'",
        "'speaker_3': 'We did receive three public comment emails and one motion from ANC regarding this topic. The first comment was from a private citizen and they were opposed to the text amendment. Their concern was that this would facilitate piecemeal rezoning of former Chapter 59 properties into the Denver zoning code.'",
        "'speaker_3': 'However, this amendment does not change the process for a rezoning, so any owner applying to rezone a former Chapter 59 PD into the Denver zoning code would have to meet all of the review criteria. And as a part of the rezoning process, community planning and development would make sure there would be no ill effects.'",
        "'speaker_3': 'And if there would be ill effects on the remainder, then that may be one that staff would recommend denial on. And then the second comment we received was from a registered neighborhood organization, and they were concerned that PDD amendments that were negotiated between the neighborhood and the developer would be nullified if one property were to come out'",
        "'speaker_3': '. However, this text amendment will not change any established agreements. Those would still be in place. And then we received one comment from a private citizen in support of the amendment, and then the motion from ANC was in opposition.'",
        "'speaker_3': 'And so to the criteria for review for a proposed tax amendment are found in section 12 for 1211 of the Denver Zoning Code. And CPD finds that the proposed TEX amendment is consistent with many of the goals, strategies and policies found in comprehensive plan 2040, as well as Blueprint 2019 to highlight a few.'",
        "'speaker_3': 'The comprehensive plan calls for improved, equitable access to city resources and city meetings, and to adopt strategies to ensure city plans and processes incorporate equity as well as promoting infill development where infrastructure and services are already in place.'",
        "'speaker_3': 'So this text amendment promotes equity by putting property owners in the former Chapter 59 Code RPD on a level playing field with all other property owners that are still in old code districts by allowing them to individually apply for rezoning.'",
        "'speaker_3': 'And then it promotes infill development by eliminating a barrier that currently inhibits the development of former Chapter 59 Pwds and then Blueprint Denver 2019 specifically encourages incentivizing property owners in the former Chapter 59 code to rezone to the Denver Zoning Code.'",
        "'speaker_3': 'And this text amendment does just that. It's one way it simplifies the requirements for applications, making it easier for property owners to come in to the new code. And then staff also finds that the Tech Summit furthers the public health, safety and general welfare of the city by providing all property owners within the old code an equal'",
        "'speaker_3': 'opportunity to apply for rezoning. So the requirement for consent from all property owners within a former Chapter 59 PD to apply for a rezoning does not exist for other former Chapter 59 properties. In addition, under the proposed amendment, properties would be subject to the rezoning process and the Denver Zoning Code, which requires a more frequent and extensive'",
        "'speaker_3': 'notification process to property owners and registered neighborhood organizations than that of the former Chapter 59 Code. And then finally CPD finds the text amendment will result in regulations that are uniform in each district. More specifically, the amendment will result in uniform application requirements for all properties in the former Chapter 59 code proposing to rezone into the Denver'",
        "'speaker_3': 'zoning code. So staff has reviewed the proposed tax amendment for compliance based on the review criteria and has found the amendment satisfies each of the three review criteria. So staff recommends the Denver City Council approve the partial rezonings of former Chapter 59 planned unit development text amendment to the Denver Revised Municipal Code.'",
        "'speaker_3': 'And that concludes staff presentation.'",
        "'speaker_0': 'Thank you very much. We have seven individuals signed up to speak this evening. If you signed up to speak on this item, I'd ask that you come up to this front bench so that you're ready. When I call your name to step up to the microphone and your time will start.'",
        "'speaker_0': 'First up, we have Merrill Carter. And again, I'd ask if you've signed up to come up here because you're you're going to lose some time if you're not ready to jump up.'",
        "'speaker_9': 'So I'm concerned with the fact that we the city, is giving state money to these corporations. I'm not. I've been an addiction counselor here.'",
        "'speaker_0': 'And I'm sorry, sir, but this is for the rezoning for chapter 59. I'm sorry. If you'd like to sign up for a courtesy hearing about those items, check in with our council secretary. But that's not what this hearing is for.'",
        "'speaker_0': 'Okay. Thank you. Next up, Michael Anderson.'",
        "'speaker_2': 'They could kill two members of her. Allow me to speak to you. Address you this evening. I'm going to read for some notes that I took in my purpose for being here as support of the Core and Geo Geo.'",
        "'speaker_0': 'Again, unfortunately, that's not this hearing. I think you signed up for the wrong one. We have to this evening so we can check in with the council secretary. She'll get you signed up for the right hearing. Thank you very much.'",
        "'speaker_0': 'Next up, Chairman. Thank you.'",
        "'speaker_9': 'My name's is Sekou. I represent the Black Sox Movement for Self-defense. Couple of questions. I can see was in opposition to this change. And. I heard nothing in the staff report about that letter of opposition in terms of why they are opposed to this, since it's such a good idea and they represent.'",
        "'speaker_9': 'When it comes to getting community input, they're much better at doing that and getting more people involved than the people who were given the report. It would seem to me that something of this nature. You would expect for their meetings to reflect that in terms of the number of people who actually attended the meeting.'",
        "'speaker_9': 'That's not in the report. So we don't know whether it was one person at the meeting or at Montebello. We don't know what was a community engagement with that Arnaud to get people to that meeting. And so I'm kind of lost there because after 15 years, that is some justice just gonna slip in here with this one'",
        "'speaker_9': 'here. And my last concern is this when we're talking about property owners and we're talking about people who actually own multiple unit dwellings as property owners in these areas that we wanted to do the zoning zoning change. It was my understanding that when I pay rent with I own the property or not, then I'm doing the things'",
        "'speaker_9': 'that the property owners are required to do that don't do that. I do that. So how come I'm not included in this as being a resident who has approved this thing? My boys ain't even are, but I'm paying for all of this.'",
        "'speaker_9': 'So what's going on here with this sale? Is this class legislation for just the rich and we don't matter. And then you asked for our opinion. But then you don't. And then we're paying for all of this because as a renter, I'm paying taxes, too, and I'm paying property taxes.'",
        "'speaker_9': 'Taxes on the property. But you don't talk to me about none of this. And you want to pass this mess for real. This shouldn't even be considered out of the sense of equity and justice to the people who are paying taxes.'",
        "'speaker_9': 'This is crazy. But this is what we do down here, because you dismissed the people who matter the most and recruit the people who don't matter to most. Property owners don't even live in the city county of Denver.'",
        "'speaker_9': 'So you talk to me and you tell me I'm lying about this mess.'",
        "'speaker_0': 'I'm sorry, but your time is up. Next up, Jesse Paris.'",
        "'speaker_10': 'Jesse Pierce, represented for Denver Homicide, a low black star action movement for self-defense and positive action commitment for social change. And I was on top of the battle for our lives this past May 2019 election by almost 15,000 votes with no money.'",
        "'speaker_10': 'We are neither for or against this. I wanted to know exactly who is going to benefit is going to benefit the property owners. We know this. So it's going to make it easier for them to do a rezoning.'",
        "'speaker_10': 'So if they want to do a upscaling of their property, they will not have to notify their immediate neighbors surrounding business owners of this to get their application approved. Is that correct? Is that what I'm understanding? So I have that question.'",
        "'speaker_10': 'Is that whether.'",
        "'speaker_9': 'It's going to happen?'",
        "'speaker_0': 'This is just your comments in national section.'",
        "'speaker_10': 'How would this factor in with potential tiny home villages and encampments? Would a property owners be able to change the rezoning to allow for these things to even be possible or to use or any other attainable housing that our property owners might want to do if they actually cared about our housing crisis?'",
        "'speaker_10': 'That's my question. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Amy, former. Oh. Amy disappeared? Nope. Okay. We'll get her moved over to the other one, Brian Conley.'",
        "'speaker_14': 'Evening Council. I'm Brian Connolly. As some of you know, I'm a land use planner and land use lawyer with the firm of Otten, Johnson, Robinson, Neff and Ragan. Eddie, I am not here this evening on behalf of one single client, but on behalf of several of our clients who have been in the position of being in properties'",
        "'speaker_14': 'that are under former Chapter 59 pads, but that have sought rezonings out of those pads. And so therefore we are here fully in support of this amendment, which is very much a common sense amendment. I think there are three underlying reasons that we would encourage your support.'",
        "'speaker_14': 'The first is that this amendment would allow a conversation to begin when a landowner desires to rezone out of a former Chapter 59 district, as Ms.. Adams presented very well. Any landowner who wants to even start that conversation has to first get the signatures of every person who owns property within the party to even file an application'",
        "'speaker_14': '. So it allows the conversation to begin. It allows your professional staff to review those applications, and it allows those conversations to come forward to you. The second reason we support this is that this or this amendment would be consistent and make Denver consistent with every other jurisdiction in the state of Colorado in which we've worked.'",
        "'speaker_14': 'There is no other jurisdiction in the state that requires every landowner within a party to consent to a rezoning of it. It allows parcel by parcel rezonings. And the third reason that we are supportive of this amendment is that many landowners who find themselves with amputees, who require the support of all the other owners, find themselves in'",
        "'speaker_14': 'a position of of being assaulted by those other owners. For amendments, we've been in the position where you have maybe one holdout landowner who does not want to consent to a piece of the amendment, but will only do so on the condition that he or she is paid a certain amount of money to consent to the amendment'",
        "'speaker_14': '. And so that prevents several, at least in our experience, has presented several meritorious projects from moving forward, everything from grocery stores in communities that are underserved with grocery stores to affordable housing projects, projects that would involve the creation of new public space.'",
        "'speaker_14': 'So for all those reasons, we think this is very much a common sense amendment. We thank your staff for bringing this forward. It's something that for a long time we observed was an issue. And so we would very much respectfully request your support of this amendment.'",
        "'speaker_14': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there questions for members of council? Comes from black.'",
        "'speaker_5': 'Thank you, Mr. President. Libby, I have a question for you, first of all. Great presentation. Thank you. While we don't always get that. So my question was about PBGC plan building groups. And I feel like I heard you say that this applies to PBDEs.'",
        "'speaker_5': 'Is that true?'",
        "'speaker_3': 'So you as like an individual property owner in a PBGC, you could apply to rezone to a new district, but you would still remain in the planned building group. So this doesn't change the plan. To get out of the plan to building group, you would still have to have all of the required signatures.'",
        "'speaker_5': 'Okay. And is CPD working on perhaps changing that? Annalise It's sort of like you might have an answer to that. I happen to have a lot of those in my district.'",
        "'speaker_1': 'In there currently that's not on the work program on what we're committing to, but it's something that we might evaluate further. PB Jesus and parties are quite different in nature because a PBJ is essentially a site specific development plan that has more detailed elements such as drainage and landscaping and parking.'",
        "'speaker_1': 'And so there's a little bit more nuance that goes into those. So right now we're not proposing any changes, but we can follow up with you more on that.'",
        "'speaker_5': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Black. Councilwoman CdeBaca.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_1': 'Can you tell us.'",
        "'speaker_3': 'Or.'",
        "'speaker_1': 'Describe a real example.'",
        "'speaker_3': 'Of one of these pads and perhaps how it didn't allow us to do something beneficial to.'",
        "'speaker_1': 'The community?'",
        "'speaker_3': 'Certainly. So in Council District 11, the far northeast, there is pad 319. Let me see if I can pull it up here. Um. Let's see. Here it is. So it's Green Valley Ranch, and then the park is split by Pena Boulevard.'",
        "'speaker_3': 'And this park does not allow for a grocery store. It specifically says no grocery stores. And I believe several years ago, there was a proposal to put a grocery store in this park and it was unable to happen because there are so many owners in this party that they would have had to get hundreds of signatures and'",
        "'speaker_3': 'with property owners constantly changing. They were stuck with the development that the city currently calls for.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman CdeBaca. Councilman Flynn.'",
        "'speaker_13': 'Thank you, Mr. President. Libby, can you. One of the concerns I've had is this work through the process is exactly what you spoke to about and what some of the opposition is rooted in, which is all the property owners in appear to have a common interest in some of the agreements and the waivers and conditions.'",
        "'speaker_13': 'And I know that your answer was, well, staff would likely not put forward a change requested by a single owner within a payday to to make a change that might alter those agreements that were made. I think the R.A. cited that.'",
        "'speaker_13': 'The one R.A. and I can see. Can you speak to what other safeguards are in place, if any, other than just a staff review before it comes to us? Because we would be the final wall protecting the other owners in a PD from losing some of their their their rights.'",
        "'speaker_3': 'Yeah, certainly. So in this PD 319, for example, there are development agreements and so for roadway improvements and things like that. And so those would still remain in place if the one see the kind of the larger property at Green Valley Ranch and Pena Boulevard were to rezone out so we could have a grocery store.'",
        "'speaker_3': 'So there are other agreements or infrastructure master plans that would keep some of those things in place.'",
        "'speaker_13': 'So the rezoning would not nullify an impact. So in that sense, to go back to Councilwoman Black's question, it wouldn't, you know, if you were in a planned building group, you would still be bound, even though today I have a PBGC at my old Target village, for instance, with several other properties in it.'",
        "'speaker_13': 'If one of those property owners wanted to rezone out of the old B3, which is old chapter 59, then you're saying that they would still be bound by all the requirements in the plan building?'",
        "'speaker_3': 'Correct, yes. So they would still have to file the plan building group, but they could apply to rezone to a different to.'",
        "'speaker_13': 'Do another use perhaps or some. Okay. All right. Thank you. That's Thomas President.'",
        "'speaker_0': 'Thank you. Councilman Flynn. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. Question Are there any current pwds in the country club neighborhood?'",
        "'speaker_3': 'So there are two, I believe, and I think they may be single owner. Let me. One may actually just be outside the bounds. Oh, this isn't close enough, is it? On a lease may be looking here, but I think there might be one or just two.'",
        "'speaker_4': 'And while you're looking, the reason why I'm asking the question I think, you know, is that the the one R.A. that voted that it registered opposition other than ANC is the country club historic neighborhood. So I'm our country club neighborhood organization so I'm kind of filling time so the analyst can do a little more searching.'",
        "'speaker_4': 'But so I guess I'll ask another question. Why might a neighborhood that doesn't have a lot of affected, why might an R.A. take a position against if this R.A. doesn't have a lot of or can you help provide additional context as to why Country Club might have voted against?'",
        "'speaker_4': 'Yeah.'",
        "'speaker_3': 'So I think's the PDS that I'm thinking of May. If they're not in country club, they're right on the border. So it could have been that when the parties were first established, the neighborhood had an agreement with the developer that was adjacent to their neighborhood.'",
        "'speaker_4': 'Okay. And so this obviously country club's in Converse Perfect ten. So I want to make sure that I understand and listen to their concerns as well. If we were to have future zoning variances, which I'm again, I think what I think you've just answered this with Councilman Flynn, but I just want to make sure I understand country'",
        "'speaker_4': 'club R.A. would have all the same protections as they would if this weren't a party like you. Just go this the same regular zoning process.'",
        "'speaker_3': 'Correct. Yeah. So they would still get the referral and they would be able to comment on the project? Correct.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Hines, are no other questions? The public hearing for Council Bill 584 is closed. Are there any comments by members of council? Well, not everybody jump in at the same time. All right. Seeing no comments. Madam Secretary.'",
        "'speaker_0': 'Raquel.'",
        "'speaker_1': 'Black Eye. CdeBaca. I.'",
        "'speaker_13': 'Flint High.'",
        "'speaker_1': 'Gilmer. I. Herndon. I. Paint.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Can each. Ortega. I. Sandoval. I swear. I. Torres. I. 12.'",
        "'speaker_0': 'I didn't get to vote. I mean, I voted on here. But you.'",
        "'speaker_9': 'Didn't ask.'",
        "'speaker_1': 'Mr. President.'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver to be administered by the Department of Safety, Division of Community Corrections in consultation with the Denver Community Corrections Board and Community Education Centers, Inc. for residential and non-residential community corrections services.\nApproves a contract with Community Education Centers, Inc. for $3,894,401.16 and for one year for residential and non-residential community corrections services (2019-50108). The last regularly scheduled Council meeting within the 30-day review period is on 8-26-19. The Committee approved filing this item at its meeting on 7-17-19.": [
        "'speaker_0': 'Okay, I. Madam Secretary, please vote in the results. Now, I think we have 12. Thank you. 12 eyes. Gainesville, 584 has passed. Councilman Flynn, will you please put Council Resolution 673 on the floor?'",
        "'speaker_13': 'Yes, I will, Mr. President. But if I could have a moment of personal privilege. Good. I just had an email from an associate who informed me that my former colleague and long time reporter John Insulin was found dead in his apartment this morning.'",
        "'speaker_13': 'He worked for the Rocky Mountain News for many years. SAT at that table for many years covering city council and recently returned to Colorado to work for the Colorado Politics Online site. And we all got to know him because he was covering the city council here.'",
        "'speaker_13': 'And so I just want to let my colleagues know that of that event and how profoundly sad I am, because John was such a great force in journalism in the city. With that. Mr. President, I move that council resolution 19, dash 673 be adopted.'",
        "'speaker_0': 'It has been moved and seconded. We are going to do a combined public hearing for Council Resolution 673 and Council Resolution 674, and that is now open. Speakers may come and comment on either or both items, and after the conclusion of the public hearing, council will vote separately on each item.'",
        "'speaker_0': 'May we have the staff report?'",
        "'speaker_11': 'Good evening, Mr. President. Members of Council Greg Morrow, director of Community Corrections with the Department of Public Safety. I'm here to provide the staff report on both resolutions six, seven, three and 674. I'm going to go through a few slides to kind of frame what these resolutions are.'",
        "'speaker_11': 'These contract agreements are part of they're part of the overall community corrections system and program in Denver. And I think it's important for those to understand what the services provided do. I know many of you have seen portions of the slide deck, so I promise to move fast.'",
        "'speaker_11': 'So what is community corrections? Community corrections provides secure residential and nonresidential reentry services to both individuals who are transitioning from incarceration, from prison or being diverted from prison and can safely be managed in the community. It's a successful collaborative partnership between the state and local government, and we rely on our service providers to complete the direct services'",
        "'speaker_11': '. Colorado's model is one of local support and decision making and how that's accomplished. Why?'",
        "'speaker_8': 'They've got a fourth grade.'",
        "'speaker_9': 'Sorry.'",
        "'speaker_11': 'My apologies. I was saying that Colorado's model is founded on this one of local support. How that's accomplished is through the formation of community corrections boards. These boards are authorized to review and decide which clients from the Department of Corrections or from the courts are approved for placement in the programs.'",
        "'speaker_11': 'There's essentially two populations that are served. Those coming out of prison are called transition clients. Those being diverted instead of going to prison are called direct sentence or diversion clients. So what are the benefits? The benefits the programs are they provide 24 hour structure, offering programing and supervision.'",
        "'speaker_11': 'It allows for employment and a wide range of services targeting the person's needs. Participants pay into restitution, child support, supervision, costs and the tax base. It's a reduced cost. It's cheaper than prison or jail. And most importantly, there are specialized behavioral health programs, drug and alcohol and mental health treatment provided.'",
        "'speaker_11': 'It's a risk reduction model. We know that by reducing risk, we can reduce recidivism and it provides gradual step down reentry services. And the thing we have to think about is over 90% of the folks that are sentenced to the Department of Corrections come back to our communities.'",
        "'speaker_11': 'This slide here just represents the significant oversight provided by both local and state agencies in the model. The center tree represents the Division of Criminal Justice as well as local government. The outer trees are the state judicial department and the Department of Corrections.'",
        "'speaker_11': 'In addition, if there are behavioral health services provided, the Office of Behavioral Health also regulates these programs. I mentioned the community corrections boards. Each of Colorado's 22 judicial districts has formed a community board. The Denver board is comprised of the individuals on the right of the slide.'",
        "'speaker_11': 'The authorizing ordinance is to the left. I want to mention the service providers. These programs provide safe alternatives for individuals to serve their sentence outside of prison or jail. There's no perimeter fencing, nor is anybody in a cell.'",
        "'speaker_11': 'The facilities are designed as residential programs that offer gradual and individualized reintegration services and treatment, support and skill building. There are four service providers that have been part of this program. They're listed on the bottom of the slide.'",
        "'speaker_11': 'Corecivic Inc. runs four facilities. Jail Care Reentry Services under the subsidiary of Community Education Centers runs two programs. Independence House has two programs, and the University of Colorado Addiction Research and Treatment Services has two programs. This slide represents the ten facilities that are part of this program.'",
        "'speaker_11': 'There's an additional facility on South Federal Boulevard that's zoned as community corrections. However, it's not part of this state and local system. The contract is with the Bureau of Prisons. The slide shows which council districts the programs are located in and the approximate zoned capacity of 748 beds.'",
        "'speaker_11': 'I want to mention the outcomes. Community corrections is an effective option and a safe reentry strategy. Less than 2% of the individuals are terminated for the commission of a new crime in placement. We talk about risk reduction. We see risk reduction across both the diversion and transition population, as well as the male and female population.'",
        "'speaker_11': 'We talk about recidivism for those that successfully complete community corrections, the residential capacity, three out of four remained crime free one year later. Now specifically to the two service providers whose contracts are up for consideration, just like. Independence House and the University all provide case management, employment assistance, life skills, financial planning, mental health services and substance use'",
        "'speaker_11': 'treatment. Specifically, CORECIVIC provides the intensive residential treatment program for substance abuse. The William St Center by GEO provides gender responsive programing for women and is one of only two placements for the female population. And the Geo Tully Hall program as part of a demonstration program for the state offering intensive cognitive behavioral therapy.'",
        "'speaker_11': 'Listed. Here are several items to consider if if the contracts do not move forward. One, the programs, the community corrections programs, partners own the facilities in which these individuals are placed due to the zoning and the restrictive zoning.'",
        "'speaker_11': 'There are no other viable alternatives. If these contracts are not approved, up to 517 individuals who are appropriately being monitored in the community will go back to jail or prison. If these contracts are not approved, the program will be severely limited in its ability to place individuals in the community.'",
        "'speaker_11': 'There will be dramatic increase in the economic burden placed on the city's taxpayers. There will be increase in jailbird costs, in prison bed costs. There'll be reduction in the ability to provide residential services and substance abuse to some of our most vulnerable residents.'",
        "'speaker_11': 'And as far as the need. Currently today, there are over 200 people who have been approved by the board and are waiting to come into these beds from the from the Department of Corrections and 40 individuals who remain in our jail waiting for a bed.'",
        "'speaker_11': 'I think there are some items to consider whether these move forward or not. I think that there needs to be continued efforts with city council in the mayor's office through the group Living Code to address the zoning issue.'",
        "'speaker_11': 'When we look at the availability or lack thereof of qualified service providers, it comes back to zoning because of the limited ability for a provider to have a building to offer these services. This would address the future capacity.'",
        "'speaker_11': 'It would increase reentry and substance abuse and reentry and supportive services, including mental health and substance use. It potentially could expand the service provider pool. It would modernize our structures. And most importantly, it could reduce the number of people in jail and prison.'",
        "'speaker_11': 'The city could also consider the cost of construction of a facility on city property that could either be operated by the city or outsourced. That concludes the staff report.'",
        "'speaker_0': 'Thank you. All right. We have 22 individuals signed up to speak this evening. If I could ask if we can keep this front bench clear. Just to get try to get through everybody. We have one hour for this courtesy hearing.'",
        "'speaker_0': 'We'd like to get to everyone. So I will ask that I'm going to call five at a time up. If you could come up and be ready to step right up to that microphone, because we are going to start your time as soon as your name is called to make sure that we have time for everyone that'",
        "'speaker_0': 'we can possibly have time for. So when I call your name, please come up to the front bench and be ready when your name is called to step up. So the first five, if you can come down. Are David Morales, Erika Giuseppe, Bree Zeiss, Asia Alvarado and Dana miller.'",
        "'speaker_0': 'If you can all come to the front and David Morales, you are up first. Go ahead and step up to the microphone.'",
        "'speaker_2': 'Hello, counsel. My name is David Morales, and today I'm speaking in strong opposition to resolution number 674. As a concerned constituent, not a lobbyist or representative of special interests. As we know, this resolution would authorize a contract worth over $6 million between Denver and, of course, Civic in a city and county as diverse as Denver.'",
        "'speaker_2': 'It is shocking to think we would even negotiate or entertain a contract with a corporation. That subsidy substantially profits off of detaining immigrants in inhumane manners. Thus, we have the right to be concerned and skeptical. Just last week, a immigrant mother had to file a lawsuit against Court Civic because her one year old daughter died due to'",
        "'speaker_2': 'poor conditions and a 2400 bed detention center that was managed and operated by Core Civic. There CEO Damien.'",
        "'speaker_1': 'HENNINGER has even.'",
        "'speaker_2': 'Bragged to investors about the robust profits he makes over private prison.'",
        "'speaker_1': 'Mistreatment and.'",
        "'speaker_2': 'Detaining immigrants once again in inhumane manners. Unfortunately, I can continue to cite all of the mistreatment immigrants and private prison inmates have had to experience under core civics watch. The worst part of it is, however, they continue to get away with all of this human rights abuse because of the simple fact that cities and states across this'",
        "'speaker_2': 'country continue to rubber stamp contracts such as these. Thus, it is no surprise that they rake in over billions of dollars annually for counsel, which claims to stand in solidarity with immigrants. It is appalling that this was considered to go through the consent agenda once again being rubber stamped as public servants.'",
        "'speaker_2': 'You have a moral and ethical obligation to stand against injustice regardless of the efficiency and profit that comes with it. I ask all of you to be bold and stand against this contract, because if you do not, you are simply enabling core civic regardless of what service they are providing.'",
        "'speaker_2': 'Please remember we elected a new council for a reason. That is to challenge the status quo, not to simply rubberstamp it. Thank you.'",
        "'speaker_0': 'Thank you. Next up is. I appreciate that we have many people who are passionate about this issue. But when you clap and cheer after every speaker that does eat up time into our thing and some people might not get to speak.'",
        "'speaker_0': 'So I would ask if you could hold your applause so that we can get through everyone. Erica Jewell I'm sorry.'",
        "'speaker_3': 'Gillespie Thank you. Thank you for your time. Again, my name is Erica Gillespie. I am the facility director of Core Civic Dahlia, ten Northeast Park Hill. I've been working in community corrections since 1997, and I have.'",
        "'speaker_1': 'Over 20 years experience working with individuals that are in the Community.'",
        "'speaker_3': 'Corrections Program. I am a witness to people's.'",
        "'speaker_1': 'Lives being changed by our programs.'",
        "'speaker_3': 'We work every day to deal, to work with individuals and.'",
        "'speaker_1': 'To help them become productive citizens. They are working full time. They are engaging in therapy.'",
        "'speaker_3': 'They are financially compliant, paying restitution, their child support, paying taxes. And they're also having time to reengage with family in a way where they're sober.'",
        "'speaker_1': 'And where they're making good decisions.'",
        "'speaker_3': 'We work hard every day to ensure.'",
        "'speaker_1': 'That the individuals in our programs are productive.'",
        "'speaker_3': 'We are changing lives, and we're seeing the impact every day as we do the work. And I've been doing that over 20 years. My experience of working in community corrections has been positive. My experience working with Corecivic has been positive also.'",
        "'speaker_3': 'They have been able to provide additional.'",
        "'speaker_1': 'Resources such as GED programing in the.'",
        "'speaker_3': 'Facility where residents are able to work on their GED. Outside of work hours, we don't have a lot of programs where they're able to.'",
        "'speaker_1': 'Engage in during the business during business.'",
        "'speaker_3': 'Hours. We're offering cognitive behavioral therapy, life skills, substance abuse, mental health training. And this is helping them to continue the treatment outside of our facility. So as they transition, they're continuing to work with their therapists and they're able to do so and have this additional support when they need to.'",
        "'speaker_3': 'I'm I just want to support and continue to support community corrections and the work we do. We work hard every day. We are we are working hard to ensure that the individuals that we working with are healthy and they are supportive and they are getting back to their families to be productive citizens.'",
        "'speaker_3': 'Also, I wanted to say that core civic offers competitive training, competitive salaries and giving people opportunities for career advancement.'",
        "'speaker_1': 'We run evidence based programing.'",
        "'speaker_3': 'And we continue to work hard on innovative ideas that are presented. We want to do what works for the.'",
        "'speaker_1': 'Individuals in our community so that they're going home in their being fathers.'",
        "'speaker_3': 'In their being husbands.'",
        "'speaker_1': 'And they're doing the work that we need to do to keep safe communities. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Bria Zeiss.'",
        "'speaker_3': 'Thank you for your time this evening, Counsel. My name is Breezy and I'm here representing myself to oppose the renewal, of course, civic and geo contracts for community corrections. As many of you may know, the national conversation about private prisons has put pressure on governments to end their relationship with companies such as Core, Civic and GEO.'",
        "'speaker_3': 'In doing so, many states such as Colorado have moved to increase rehabilitation programs, and in response, companies like CORE, Civic and GEO have been transitioning their business model into other facets of our criminal justice system, such as halfway houses.'",
        "'speaker_3': 'According to the 2018 Community Corrections Report, 82% of community corrections facilities are now owned and operated by private companies. There are numerous barriers in accessing information about these companies financial positions and profits, their annual stakeholder reports and FCC filings aggregate information on a national scale.'",
        "'speaker_3': 'But most state specific information is cited as proprietary information to avoid public release, which includes audits. This lack of fiscal and operational transparency is extremely concerning. A report produced in 2018 by the Department of Corrections tells us that 48% of the people interviewed who are currently incarcerated refused or waived a referral to community corrections due to hearing'",
        "'speaker_3': 'mostly negative things about community corrections. And 36% of respondents noted that they were concerned about the cost of community corrections. Furthermore, a third of survey response respondents reported that they did not receive the help they needed from community corrections staff and 13% reported to not feel safe in community corrections.'",
        "'speaker_3': 'And national data tells us that facilities owned and operated by private companies offer less staff training, offer lower salaries and have higher staff turnover. This begs the question of how much of the rent and subsidies paid to the halfway houses are being funneled into the profit margins of private companies instead of going to programs and services.'",
        "'speaker_3': 'And for this reason, I urge the Council to vote no on renewing these contracts and consider an alternative to privatized community corrections services.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Aisha Alvarado.'",
        "'speaker_1': 'Good evening. My name is Rachel Prado and I am a facility director at Core Civic All-Star in Denver. There is a saying that you choose a job you love and you'll never work a day in your life. Community corrections was not my first career choice.'",
        "'speaker_1': 'I didn't choose community corrections. It chose me. And I have enjoyed my work and community every day for almost six years. I believe in what community corrections does for not only for the community and the residents in the program.'",
        "'speaker_1': 'My reward for working in community corrections is not based off of financial compensation, but my reward is getting these residents from the day of intake that these guys are at their lowest. Watching them grow and successfully leaving the programs.'",
        "'speaker_1': 'I have received numerous thank you letters, phone calls and also visits from previous residents that went through our program and sharing how they have maintained their freedom and sharing photos of their families and their children. I am I take pride in and pride in that because we share a small part in their success because of the work'",
        "'speaker_1': 'that my staff and I do with these individuals daily. We could have taught them just something as small as for activating their first debit card because they've never had a savings account or a checking account. Teaching them how to write out a money order because they've never had to do that before.'",
        "'speaker_1': 'Just these small things that's rewarding to us. That means that we're teaching them something. They're learning something. These individuals that are accepted into our programs are set up for success and not failure. When they arrived to community, they are guided and given all the tools necessary to be successful.'",
        "'speaker_1': 'When they're not when they're no longer in a structured environment. We partner with community agencies to assist residents in our programs with job readiness and employment opportunities. I have been at a Denver facility for two years and our employment rate has been less than 10%, even 2%.'",
        "'speaker_1': 'At times we partner with local employers that come to the facilities and give them applications and give them job opportunities because those are the partnerships that we have built. We provide mobile dental, where mobile dental services come onto our properties and give our residents the dental care that they need.'",
        "'speaker_1': 'We have assistance with medical and medical coverage. HIV and Hep C testing, transportation, clothing and housing. Our focus is on assessing each individual's risk and need and prioritizing their top criminal genic needs. Treatment matching.'",
        "'speaker_0': 'And I'm sorry about your time is up. Next up is Dana miller, and I'm going to call the next five if you could come up to the front row. Our next five are Rene Romero, Joel Zimmerman, Jean Franken, Anna Rodriguez and Jesse Paris.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_1': 'Hi. Hello, everyone. My name is Dana miller and I represent Indivisible Denver. And when I was thinking about the kinds of remarks I wanted to make tonight, I realized I really didn't understand a lot of the background. So I reached out to my friends at American Friends Service Committee, and Gabriela Flores sent me some information, some reports'",
        "'speaker_1': 'that they have done around this issue. So I'd like to read a little bit from one of those reports. It helped me learn a lot more about kind of the background and the context of where we're speaking. As states pursue sentencing reform, efforts to reduce prison populations and the federal government continues to grapple with comprehensive immigration reform'",
        "'speaker_1': '. The private prison industry faces pressure to adapt to a shifting penal landscape that is moving towards alternatives to incarceration. In response to these developments. The private prison industry began rebranding and re and expanding into subcontracted things like prisoner health care, forensic mental health treatment and other alternative programing.'",
        "'speaker_1': 'The American Friends Service Committee, Grassroots Leadership, and the Southern Center for Human Rights identified this emergency emerging trend as the treatment industrial complex. There were some findings that came out of the report that Gabriela sent me, and I'll do four of them.'",
        "'speaker_1': 'For profit prisons, corporations like Core Civic and the GEO Group are moving to expand their their holdings in the community corrections area. Both have acquired smaller companies that hold contracts for electric monitoring, day reporting, intermediate sanctions and residential reentry.'",
        "'speaker_1': 'Both every brand rebranded themselves as providers of rehabilitation services with a focus on recidivism and recidivism reduction. Number two, the niche market of community corrections is continually expanding, with new companies moving in to take advantage of lucrative government contracts and opportunity to extract payment from those under supervision.'",
        "'speaker_1': 'Number three, the profit is it profit? Ization of community corrections poses a serious threat to the movement to end mass incarceration due to their extensive economic and political influence. Corporations such as CORE, Civic and GEO are able to exploit reform efforts for their own financial gain.'",
        "'speaker_1': 'They can outcompete smaller, community based service providers for contracts. In addition, their extensive lobbying and campaign contributions are being leveraged to influence the direction of sentencing sentences, reform efforts and other policy decisions at the state and local levels.'",
        "'speaker_1': 'The alternatives to incarceration movement should be resulting in a strong downward push, reducing the number of people incarcerated, but also moving people more quickly off all forms of supervision. This should all be happening at the front end where.'",
        "'speaker_0': 'Over time as it makes up for a narrative.'",
        "'speaker_1': 'Thank you. Okay. Thank you. Hey, counsel, I want to thank you all for allowing me to appear on behalf of Geo Care with the William St Center, located in Denver, Colorado. A quick introduction by myself. My name is Rene Romero.'",
        "'speaker_1': 'I have been employed with the company for a little shy of nine years at this point, so I've been in community corrections for my whole experience. At this point with the William Street Center, we are able to hold a capacity of 80 women at one time.'",
        "'speaker_1': 'I am at full capacity and at this point we have we have a need to create a bigger facility to house more women, whether it's through our diversion population or our transition population, with those that are releasing from D.O.C..'",
        "'speaker_1': 'I've seen many changes from my start in 2011 to where we are today, and a lot of it is through our programing that we've developed a long time. We have the Be Smart model, which is behavioral shaping model and reinforcement tools, which really focuses on our sanctioning grid in our incentive grid.'",
        "'speaker_1': 'This has shown a lot of improvement with the population we work for. Allowing the residents to actually improve their strategies with with their incentives allows them to do more things in the facility. We are also transparent as a company with the residents upon intake that if if they have any questions about what some of the rules are'",
        "'speaker_1': ', we provide them a residential handbook. We also make sure that we are transparent with what kind of sanctions are imposed if they were to violate any rules that we are transparent in the forefront with. We also want to make sure to touch base on the progression matrix, which really focuses on unique programing for each resident that walks'",
        "'speaker_1': 'into our building. We want to make sure that each individual is recognized for who they are, where they came from, and where they want to be. They are highly involved in developing the matrix with their case manager and they meet with them on a weekly basis.'",
        "'speaker_1': 'So they have that went on when care. And we have a lot of gender responsivity trainings through Stephanie Covington, a curriculum like Helping Women in Recovery, which focuses on substance abuse as well as trauma. We have healing trauma, which is a brief intervention for women.'",
        "'speaker_1': 'We also hold MRC through Gregory Littleton's curriculum as well. We work with a lot of programing and resources out in the community, like Dress for Success. I've been involved with throwing fashion shows for the women. It's very important for them to be able to be involved in things outside of the day to day.'",
        "'speaker_1': 'We also work with work option for women, which allows them to get their Surf Safe certifications, and we post those in the facility to recognize that you achieved an accomplishment while being in our program. Little things like that really reflects on their skill development and also their self-esteem, which they lack and they don't get enough of when'",
        "'speaker_1': 'they're in incarceration. So I really want to make sure that everyone understands we're here to help them succeed.'",
        "'speaker_0': 'Thank you. Next up, Joel Zygmunt.'",
        "'speaker_1': 'Council President and city council members. Thank you for the opportunity to speak to you today. My name is George Zimmerman. I am a resident of District ten and I'm here representing myself. I am here to ask you to vote no on council bills 19 0673 and 19 0674 and to not renew the contracts for residential and nonresidential'",
        "'speaker_1': 'community corrections services with GEO and of course Civic. My work is not related to immigration or criminal justice reform. I am an elementary school music teacher who worked for two years and Jeffco Public Schools, an education union organizer.'",
        "'speaker_1': 'And I'm currently teaching music privately. I once pursued sober housing when I was living in Austin, Texas, and was denied services by a gender segregated program as a transgender person. This is my first time giving public comment at a city council meeting.'",
        "'speaker_1': 'I don't have to be an expert in the fields or be personally affected by it to know that what these companies are doing is morally reprehensible. Both companies have a long record of abuse and neglect that is very public.'",
        "'speaker_1': 'Both companies are clearly more interested in their profit margin than human dignity. Both companies do not provide transgender and non-binary, affirming services, and both companies spend significant money on lobbying policy and funding candidates who strengthen regulations on drugs and immigration so that they can further profit from incarceration of people of color.'",
        "'speaker_1': 'I do not want the company running the ice detention facility in Aurora to be given $3 million by my city. I recognize that they have a monopoly in this field, but there are other states like New York who are leading the way by taking a stance to divest from private prisons.'",
        "'speaker_1': 'I believe strongly that Colorado can also lead in the conversation about what a just alternative to providing these services could be. There are other options. Voting no on renewing these city contracts with geo and core civic for transitional and diversion housing is a tangible way that Denver can start the divestment process.'",
        "'speaker_1': 'That is the Denver. I want my students to grow up in private prison. Corporations thrive when no one pays attention. I am grateful that Councilwoman CdeBaca and others have given us this opportunity to take them out into the light.'",
        "'speaker_1': 'Thank you, city council members, for your time.'",
        "'speaker_0': 'Thank you. Next up, shame. Jane Franklin.'",
        "'speaker_7': 'Hi. My name is Jane Franken. I'm a long time resident of Denver. I also have served for many, many years as the chairman of the Denver Community Corrections Board. And it's in that vein that I'm here tonight. I'd just like you to think about three things.'",
        "'speaker_7': 'I think I sent you all a letter. I hope you had a chance to read it. If you didn't, well, so be it. Number one is public safety. One of the things that the Denver Community Corrections Board has always been concerned about is public safety.'",
        "'speaker_7': 'And we believe that the services that are provided by all of our our facilities are critical to maintaining and to enabling prisoners who otherwise would be incarcerated to actually find themselves. And those services are so important. I think Greg mentioned that three out of four who graduate after a year are not involved in criminal activity continuing forward'",
        "'speaker_7': '. We have intensive residential services. The impact on civic and civic on city services, if you are to not approve these is going to be pretty tremendous. We'll have 500 people, 500 convicted criminals who will be either sent back to prison or who will be sent to the county jail.'",
        "'speaker_7': 'And I will tell you that because of the Department of.'",
        "'speaker_1': 'Corrections, where.'",
        "'speaker_7': 'They are right now, those people will come back to our community and they'll come back with no services at all. So I'd like you to think about that. It was said that there are a lot of other options.'",
        "'speaker_7': 'Well, I can tell you right now there are no other options. The zoning for community corrections is very, very limited, and we've worked for years to try to change that and would continue. We would love to continue to work on that with city council and the mayor's office.'",
        "'speaker_7': 'Second thing I want to say is we have 500 clients. They've all worked really hard to get in to community corrections. Despite what's been said earlier, I talked to them. We review them.'",
        "'speaker_1': 'On a weekly I mean, on a monthly and bi.'",
        "'speaker_7': 'Monthly basis. I think it would be a tragedy to throw these people out back to the wolves when they've all they've done is try to be good. I also want to say there's one facility that deals with women that well, there two.'",
        "'speaker_7': 'One is it is a therapeutic community that only has 30 beds. The other is William St Center, which has 80 beds for women. It's one of the only women's facilities in the state of Colorado. So I would hate to see that closed.'",
        "'speaker_7': 'The last thing I want to say is we have staff, we have 150 staff who all care deeply about these clients. And I'd like you to think about them, too, before you make these decisions. Thank you.'",
        "'speaker_0': 'Thank you. Next up in a Rodriguez.'",
        "'speaker_3': 'Thank you. My name is Anna Rodriguez, and today I'm representing Colorado People's Alliance and the American Friends Services Committee. I'm here speaking against the renewal of the contract for GEO and CORECIVIC. Both of these corporations are for profit corporations that are managing detention facilities as well as these type of halfway houses.'",
        "'speaker_3': 'And we've heard continuously with the detention centers that they operate, one of which is in our own backyard in Aurora, Colorado. They're inhumane practices on a daily basis. Two men have died in that facility. And I speak regularly with individuals who are currently being housed in detention or whose loved ones have recently come out of detention that'",
        "'speaker_3': 'speak about the horrible situations that were put in there before. One of the folks that I've been speaking with recently was sharing about how he was put in solitary for a month for forgetting to put on his bracelet.'",
        "'speaker_3': 'One of the folks we've been organizing with had his hand broken by a guard just a few months ago and still hasn't received the medical care that he needs as he's awaiting something to happen with him as his immigration case.'",
        "'speaker_3': 'So we're constantly hearing that these for profit detention facilities are not meeting basic human needs of the people in their care because they are a for profit corporation. They're very system requires that they be tight fisted on everything from services to staffing to medical care.'",
        "'speaker_3': 'This is the same model that is operating in these community corrections halfway houses. It's the same model that prevents them from investing in the community the way that a different type of model would allow for the investment into services, investment into better buildings, investment into safer situations for our people.'",
        "'speaker_3': 'So I ask that the that the council vote again for the renewal for these contracts. We need to not only divest from this for profit, these for profit corporations that are growing and profiting from the detention machine, that is deporting our family members.'",
        "'speaker_3': 'And we also need to be taking a step away from the for profit system in these halfway houses and to move towards a community run model that allows for us not to be kind of at the hands of these for profit corporations that are the only ones that can own buildings because they're the only ones wealthy enough'",
        "'speaker_3': 'to own buildings that house our people. So let's move in a direction that actually honors the immigrants that we claim that we're standing up for. Let's divest from these for profit corporations that are hurting our communities, not just these for their detention centers, but as well as how they're operating their community corrections as well.'",
        "'speaker_0': 'Thank you. Thank you. Next up, Jesse Pearce.'",
        "'speaker_10': 'Hard act to follow. Jesse Paris represent for Denver Homicide Law Black Star similar for self-defense and positive action can move for social change and I was on top of the ballot for at large just past 2019th May 2019 election got almost 15,000 votes with no money.'",
        "'speaker_10': 'What we have here is the difference between right and wrong. And if we want to continue to do wrong or if we want to do rights, we know that privatized prisons is not the answer to our crime problem, if you will.'",
        "'speaker_10': 'We need to stop warehouse and people in cages and people. My people have been caged for 400 years in this country. Nobody talks about that. But now immigrants are being caged up. So now everybody's in the same boat.'",
        "'speaker_10': 'Similarly, we need to not approve this contract. It is not morally right. Like previous speakers have said already. These for profit corporations do not care about people. All they care about is profit. We've spent our whole campaign making sure people were putting people over profit.'",
        "'speaker_10': 'So if the current council members approve this, we'll know exactly who is exactly putting people over profit and who is not. So with that said, I accept you vote no on this deal. As we heard this whole past campaign.'",
        "'speaker_10': 'We can do better. So let's do better and stop detaining people because of their status or you don't want them here or you don't feel like they belong here. Because like I said, my people have been dealing with this for 400 years.'",
        "'speaker_10': 'Enough is enough of this madness. Vote no on this. Thank you.'",
        "'speaker_0': 'Thank you. Next up, I'm going to call the next five, our Rachel Crowe, Tennis, Paul Rosenthal, Meryl Carter, Michael Anderson and Michael Tenant House. If you could come up to the front and Rachel Tennis, you're.'",
        "'speaker_3': 'Hi. My name is Rachel Pretenders. I'm a Denver resident. I wanted to thank you all for having me here tonight. I'm here to oppose the renewal of the contract, and I want to talk to you about it through someone who I'm going to call Carlos.'",
        "'speaker_3': 'It's I've really there's been a lot of statistics here tonight, and I want to share an individual story with you as well. Carlos has been detained in the GIO Detention Center in Aurora since June of 2017. That's two years and two months.'",
        "'speaker_3': 'I am a volunteer from Casa de Paz. I've been visiting him for the past one year and seven months. It's been either every week or every other week, and I've gotten to know him. I want to tell you about him and some of his experiences at the GEO Detention Center.'",
        "'speaker_3': 'First of all, just so you know about him, he's a man of faith, compassion and empathy. He's creative. He makes art, poetry and bracelets. He's lived in the United States since he was a child. The reason he got to where he is now is he was falsely identified for having committed a crime.'",
        "'speaker_3': 'When they realized that it wasn't him, he was turned over to ICE and has been in the detention center in Aurora ever since. Some of our visits are visits are conducted by speaking through glass, through a glass while we speak on the phone that connects us.'",
        "'speaker_3': 'And it's like that for us and for everyone else there who, you know, a lot of them are fathers who have to speak to their children, who aren't able to hug them or touch them. There is in the visitation room in the lobby, there are signs that talk about the superior services that God provides phones, which they're'",
        "'speaker_3': 'only able to use if they pay doctors who may or may not be trauma informed and able to provide the correct assistance and time to each person. And the open air rec facility, which is really just high walls with a gap that allows for some air to get in.'",
        "'speaker_3': 'Carlos was put in solitary confinement due to an issue and was left there for longer than he should have been because there was overcrowding and he wasn't able to go back to his original unit. Having suffered from other mental health issues.'",
        "'speaker_3': 'This is really problematic. According to the ICE 2018 budget, these private prisons are making $140 a day, more or less, by detaining Carlos for the two years and two months that he's been there. That's roughly $111,000 that they've made.'",
        "'speaker_3': 'And their goal is cutting costs to bolster profit.'",
        "'speaker_6': 'Where there's a lack.'",
        "'speaker_3': 'Of concern around health and safety. This isn't who we are as a community or state. And I'd ask you not to I'd ask you to. Thank you, Neal.'",
        "'speaker_0': 'Thank you. Next to Paul Rosenthal.'",
        "'speaker_2': 'Mr. President, members of council. My name is Paul Rosenthal, and I live in Councilwoman Black's district. I'm honored to be here today to speak with you. By the way, while I'm up here. Could you get some cushions for the benches?'",
        "'speaker_2': 'It's kind of important. So for the past 14 years, I've had the pleasure to serve on the Denver Community Corrections Board alongside Jane Franken. And you're going to hear from Mike Anderson. We also have a very diverse board.'",
        "'speaker_2': 'I've served six years in the legislature pushing for criminal justice reform, among other issues, and when not in legislative session. I have been and am now a teacher in the Division of Youth Corrections Day, as we call it now, for ten years.'",
        "'speaker_2': 'So helping youth and adult offenders is an important part of my life. I agree with everyone who has come up here to condemn the awful conditions at GEO facility in Aurora. In fact, I took in my own home an asylee for a few weeks so he could get his feet on the ground.'",
        "'speaker_2': 'But ice is not the issue here before you today. Rather, your decision is on the renewal of a one year contract with GEO subsidiary and with Core Civic. Let's be clear what that means. If you do not renew this contract over 500 years, 500 people from Denver will be returned to prison or to jail.'",
        "'speaker_2': 'So I'm here to advocate for them, including the African-American, Latino, Latina women and men who are in the halfway houses, which will be shut down if you vote no. I'm here to advocate for our people who do not have a voice, our offenders who need opportunity, who need hope, who need to be reunited with their families, who'",
        "'speaker_2': 'need a job, who need drug and alcohol treatment since many are not getting in prison or jail. Or in the community. I have asked a friend of mine who is currently in a halfway house Where would you rather be in a halfway house or in prison?'",
        "'speaker_2': 'He's like, Oh, I'd rather be in a halfway house. And he supports these contracts be renewed if these contract renewals pass today. Tomorrow you can begin the tough work of assessing bids on new contracts land use, zoning code, community corrections, capacity backlogs, program quality, more treatment and services, more providers and possibly new facilities.'",
        "'speaker_2': 'Modernize structures, reduce our jail populations and prison populations to transition offenders back to community. Please give these offenders, many of whom are people of color, women and men who are our family, our friends, our fellow members of the community, giving them a chance to come back to the community.'",
        "'speaker_2': 'Vote yes on these contracts.'",
        "'speaker_0': 'Thank you. Thank you very much. Next up, Meryl Carter.'",
        "'speaker_9': 'First, I just got to talk about the term offenders. Right. Many of these people have been offended. They're not offenders. I'm not going to waste a lot of your time up here at all. You guys got a big decision to make.'",
        "'speaker_9': 'It's. Which side are you on? Are you on the side of immigrants and refugees and people that have been have their lives destroyed by the prison industrial complex? Are you on the side of companies that profit from pain?'",
        "'speaker_0': 'Can you. I'm sorry, can you say can you state your name for the record? Merrill Carter. Thank you very much. Next up, Michael Anderson.'",
        "'speaker_2': 'Thank you, Mr. President. And council members. My name is Michael Anderson. First time generation native to Colorado, grew up in lower downtown Denver around five points currently. And Councilman Hern and. District. I've had the pleasure, along with that, of serving the city and county of Denver for 34 years as a Denver police officer from 1973 to 2006'",
        "'speaker_2': '. In 2009, Governor Ritter appointed me to the Colorado Board of Parole, where I served the state on the parole board, traveling throughout the state to the different prisons. I can tell you that. There are individuals that are in prison today that should not be there.'",
        "'speaker_2': 'I can also tell you that there are people, prisoners that should never, ever be allowed to leave prison. And my concern is for the citizens of the city and county of Denver. I have great empathy and and pain for our immigration system, which is a national issue.'",
        "'speaker_2': 'It's something that our country has to deal with along with our prison system. So the issue today for me is in support of core and go.'",
        "'speaker_0': 'For the concerns of the citizens of.'",
        "'speaker_2': 'Denver. You've heard it said there's going to be over 517 individuals that are part of that program.'",
        "'speaker_0': 'They're going to be.'",
        "'speaker_2': 'Returned to the city. And you have to understand, our legislatures have mandated that these individuals have mandatory release date. There isn't a question of whether they're. They're just going back to prison. They're coming back out. So the question is for you, for the city and county of Denver, do we want individuals to come out with support and'",
        "'speaker_2': 'with with our care?'",
        "'speaker_0': 'Thank you. Next up is Michael Tennant house and hour called the next five up to the front bench. Vincent Bowen. Pastor Terrence Hughes. Chairman Sekou Amy Schumer. And I'm a Urbano. Go ahead.'",
        "'speaker_10': 'I'm just an outraged private citizen, Gio. And, of course, Civic should never get another dime from taxpayers. I might accidentally refer to, of course, Civic as Kia. They changed. They rebranded their name to get away from their dirty reputation.'",
        "'speaker_10': 'There's plenty of evidence that private citizen correction is not actually save taxpayers any money or provide any benefit all the like. Advertise saving to taxpayers is accounting trickery. Privatization obviously creates a perverted financial incentive to not rehabilitate and cut corners on expenses everywhere possible.'",
        "'speaker_10': 'These for profit prison corporations are engaged in slavery. They make tons of money from unpaid, coerced labor. There's no amount of semantics and B.S. about job chain training that can change the fact that they profit from involuntary labor slavery.'",
        "'speaker_10': 'These businesses prey upon and exploit the most vulnerable people in our society and traffic in human misery. These halfway houses will never have an occupant that's half as evil as Geo Group's executives and lobbyists. These two corporations are a vile threat to our American principles of liberty, justice and human rights.'",
        "'speaker_10': 'If you hate freedom enough to give money to these monsters, you should at least check to see if the Taliban will make a lower bid. CCR is currently in federal court facing accusations of securities fraud because they lied to their investors.'",
        "'speaker_10': 'Both C.K. and Geo's credit ratings are classified as junk by Moody's and S&P global analysts. JPMorgan Chase, Wells Fargo and Baker. America refuse to do business with them. Why are we these these contracts should go to local businesses, even though they should really be nonprofits.'",
        "'speaker_10': 'They're just. I mean, it's a black it's just a playing right and wrong issue there. Yeah. Oh, I see what time it was, too. They do? Yeah. Pennsylvania government audit found that graduates from the S.E.C. halfway homes, just like the ones that are up for contract, were significantly more likely to re-offend than inmates who had just been'",
        "'speaker_10': 'released on the streets. Um. Yeah, there's. I'm not in Washington. State's attorney general is currently suing GEO for illegal enrichment and violating state labor laws on a massive scale. It's these are just evil corporations that don't deserve a dime of taxpayer money.'",
        "'speaker_10': 'And I hope you guys really just look at the morals and ethics. They're trying to hold this 500 prisoners hostage over your guy's head. Every single person that's voted for this bill has had a career interest or financial financial interest in getting this contract or in their industry getting more money.'",
        "'speaker_10': 'We we have the number one highest incarceration rate on the planet.'",
        "'speaker_0': 'All right, but your time is up. Next up, Vincent Van.'",
        "'speaker_10': 'Hi. My name is Vincent Bowe. And I'd like to thank Candy CdeBaca for pushing us to think about things that have been the status quo in a new way. I mean, Park Hill in Councilman Herndon's district. I am part of the leadership team of Black Lives Matter, and I was a senior executive of a company called Correctional'",
        "'speaker_10': 'Health Care company CHC from 2010 to 2012. It was then the largest provider of health care services in over 250 jails around the country, including in several counties in Colorado, some intimately aware of the economics of this industry.'",
        "'speaker_10': 'I was responsible for securing new contracts and evaluating potential corporate acquisitions. I worked specifically on evaluating a potential acquisition of Boulder based Rocky Mountain Offender Management Systems Almonds. We did not acquire CHC did not acquire almonds, but it was subsequently acquired by Core Civic and it is now the provider of the services that we are talking about'",
        "'speaker_10': '. I am talking speaking against renewing this contract because taxpayer interests are not served by it. Beyond the moral repulsive ness of this for profit community corrections contracts with their focus on collecting fees for service are inherently motivated to maximize neighbors under supervision, while our community is best served by maximizing rehabilitative success and minimizing neighbors under supervision.'",
        "'speaker_10': 'So I heard from some very passionate folks Erika, Ghaleb Gillespie, Aisha Alvarado, Rene Romero all clearly very professional and passionate about their work. But you know who I didn't see in here? Is George Slowly or Damon HENNINGER. Right.'",
        "'speaker_10': 'They are the CEOs, of course, if it can go. They made over $10 million combined last year. So I want to ask this council, why aren't we paying the folks who were doing this service? Well, in our community, the money that's going out of our community not being reinvested and not adding to our collective good, instead of'",
        "'speaker_10': 'paying these fellows who I'm sure are lovely people, but they're not, actually, why are we paying for them rather than paying the wonderful professionals who understand this to do this? So I think we need to think about a model that takes away the privatization, keeps the great providers of service.'",
        "'speaker_10': 'But why are we paying for profits for nonresident folks that do not provide the services here? There's margin in there. There's waste in there. There's abuse. There's a moral hazard to reduce costs at the expense of the quality of care.'",
        "'speaker_10': 'And we have great people who can do this.'",
        "'speaker_0': 'But your time. Let's do that. Thank you very much, Pastor Terrence, you.'",
        "'speaker_13': 'I'm Presbyterian Sues New Covenant Christian Church, helping them bigger ministries and the Colorado Poor People's Campaign a national call for moral revival. I'm saddened that this was going to be pushed through without the voice of the people, but hopeful that this new council will hear the voice and cries of the people.'",
        "'speaker_13': 'The city and county of Denver has moved away from partnering with community based providers, including stakeholders in the process of transitional services. GEO was the largest reentry private prison corporation in America. They have an unfair competitive advantage over local reentry programs.'",
        "'speaker_13': 'They have no connection to Denver, nor interested in rehabilitating inmates or reducing recidivism from a profit model. A local review gave them two and a half stars out of five. The relationship with the city and county of Denver is likened to the convict leasing program, a post slavery days where the city county of Denver is in the'",
        "'speaker_13': 'role of the southern states and the south, who entirely gave up its prison control to a private contractor. There were numerous abuses then, and there's numerous abuses now. All for profit. This creates a moral dilemma for Denver. Everyone deserves a fair opportunity to be rehabilitated for a second chance when all power is located with a third party'",
        "'speaker_13': 'with no real oversight or connection to the city in which it operates. It puts profits over people. Denver has the capacity, through its partners and stakeholders in reentry to provide for its citizens without compromise. The last moral dilemma Denver places is the prison camp in Aurora.'",
        "'speaker_13': 'That Denver tax dollars are, by extension, subsidizing by reauthorizing GEO. Denver needs to divest from this prison corporation. Now it's GEO. If GEO has no problem running a prison camp, Denver should have a problem having a financial relationship with them.'",
        "'speaker_13': 'The prison industrial complex is broken, is a broken system, and having a relationship with GEO makes Denver complicit, complicit with all of its business dealings. I'm a preacher from a preacher. So I ask you this for Mark. What shall a prophet, a man, if he shall gain the whole world to lose, sold his soul.'",
        "'speaker_13': 'What should a prophet council members to gain? The whole world. What should a prophet? A city to gain the whole world and lose its soul? Denver's soul is at stake. Denver's soul is at stake. It's time to divest from this evil corporation.'",
        "'speaker_13': 'Yes, those who are working there will get jobs with the other corporate, with the other companies. Just like when Geo moved in and they start taking over companies, they were hired to do them. Thank you.'",
        "'speaker_0': 'Thank you. September 2nd. Chairman Seiko.'",
        "'speaker_9': 'Has made. When I was chairman, Suku founded Black Sox, a movement representing poor, working, poor, homeless. Voiceless, the oppressed. What was said by a mentor of mine that. To have a moral argument or to present a moral case to people who don't have a conscience is crazy.'",
        "'speaker_9': 'It's not going to work. This is about power. This about organization is about land. This is already a done deal because you don't have the votes to get it through opposition. That's the truth. It wouldn't be on the floor and it was already approved on this dog and pony show and going to work.'",
        "'speaker_9': 'So for the people who want to look at the practicality of this, who are going to vote for this politician because of bland, oh, he got to blend this. All right. Everything people say about this corporation is private thing and the truth.'",
        "'speaker_9': 'And the other truth above that, too, is presidents don't go nowhere in any society, especially European society. Does prison ever work a duck? So you need to ban all present, period. But in the meantime, because we got to do this tonight.'",
        "'speaker_9': 'And most of the people who are advocating to close this thing down for people who are already in there, that's it. More. If they don't get the funding tonight, what do they do? What is the alternative? You ain't propose.'",
        "'speaker_9': 'What? So you have much more argument about that. See? So I propose a solution. Well, simple. Let's get $10 million. The following two people in there. So why don't you do this? Get to 500 people.'",
        "'speaker_8': 'The 10 million does get it done, and I get to everybody. A president will want that.'",
        "'speaker_9': 'Kind of program to bypass all the overhead expenses and they get how much money is it? Should I go to jail for that?'",
        "'speaker_0': 'German Speaker, Please watch your language.'",
        "'speaker_9': 'Oh, I'm sorry. That was. Okay, so give the fight for the prisoners, folks. Peru. Pass this thing because there is no other alternative for justice because they've done the time. Person and all of you on that are opposed to this, doing it with the prisoners and get them out of jail.'",
        "'speaker_0': 'I'm sorry. Your time is up. Next up, Amy Koppelman. Next up, Amy Poehler.'",
        "'speaker_12': 'Hi, my name is Amy from I am with the Above Waters Project. It's a local nonprofit here in Denver that focuses on community corrections. It was founded by the late Tammy Jerry Williams, who went through community corrections for nearly a year and came out extremely dedicated and committed to exposing what was going on inside and championing championing'",
        "'speaker_12': 'the respect and dignity, dignified treatment that people going through incarceration or community corrections should receive. There are about 33 facilities here in the state of Colorado. 31 are privately owned. What we do is research, policy, advocacy and education around how they intersect with the criminal justice system.'",
        "'speaker_12': 'In a nutshell, there are a ton of problems, almost half of them, if not more than half of the percentage that people fail out of the Common Core programs. So when we're talking about possibly 500 people going back to prison, roughly half of them probably are already.'",
        "'speaker_12': 'We do want these programs to be successful. But of course, we've always stood against the private. Private profit model.'",
        "'speaker_9': 'E.'",
        "'speaker_12': 'Of course, civic NGO have long lobbied for harsher sentencing, which obviously should be a direct conflict of interest. If you run, let alone own prisons, they also. In 2013, converted their businesses to real estate interest trusts. So I don't know if you're familiar.'",
        "'speaker_12': 'I'm not as familiar, but basically they are developing companies and hiding behind this real estate names. They do, you know, lobby. They do political contributions to whoever will basically maintain the supply of prisoners. Right. Because that's their business.'",
        "'speaker_12': 'In 2016, under the Obama administration, the Department of Justice actually wanted to phase out the use of the contracts with your own core civic. Unfortunately, in 2017, that phase out was ignored and their revenues have increased. Part of their appeal to the counties and government contracts is that they do this more effectively and cheaper.'",
        "'speaker_12': 'But that's not necessarily true. According to the Colorado Department, stats costs about $22,000 to jail someone and it costs about $20,000 to put someone in community corrections. Not including what the residents themselves have to pay, which is if they were to serve there for a year.'",
        "'speaker_12': 'It's around $5,000. Being that there are now real estate investment trusts, they've been able to avoid paying taxes, substantial taxes. In 2017, Joe was able to avoid paying 44 million.'",
        "'speaker_0': 'I'm sorry that your time is up. Next up is Omar Urbano and I'll call the last three, Denise Mays, Dr. Calderon and Pam Clifton. If you could come to the front bench.'",
        "'speaker_5': 'My name's. Oh.'",
        "'speaker_1': 'My name's Elmer Bueno. I am in District nine. Candy, said the Bacchus District Swansea neighborhood. I am against the renewal of contracts with geo and core civics. Geo and Core Civics receive a large amount of profit from holding undocumented immigrants.'",
        "'speaker_1': 'So I am here to speak as a nonresident alien immigrant who could arguably be affected by the continued partnership between Denver and these corporations. My family is undocumented. I hold a permit from Dacca that could very well go away if the Supreme Court decides soon.'",
        "'speaker_1': 'What happens then? Well, my family and I end up in one of the geo in core civic concentration camps that profit off of us. I encourage you to find a better solutions to the so-called halfway homes that don't do much to prevent our own children from entering into modern slavery.'",
        "'speaker_1': 'Whether it is for this or to other or to offer other services to pay a corrections corporations to exist and benefit from the pain of our families is shameful. And given our federal executive branch, it is deadly. I am here in fear for my life, my safety, and with the worry that my city will sign my life'",
        "'speaker_1': 'away along with my taxes.'",
        "'speaker_3': 'Please show me.'",
        "'speaker_1': 'With your vote tonight that you want me to exist, to contribute. Continue assisting and contribute to supporting our city without feeling the shame or having a city that supports and signs agreements with modern slave holders and corporations that place people like me in detention centers take a chance to invest in your immigrant communities, at least as much'",
        "'speaker_1': 'as you seem to want to invest in this corporations. We, undocumented immigrants are so poor that taxes are going to the functioning of the city system. We also contribute to the public safety of our home. Denver. We matter.'",
        "'speaker_1': 'Investing in us would be a better way of preventing all of our people from entering the corrections system. Please vote no to go and core civics for the sake of our Denver, this so-called place that claims to love immigrants.'",
        "'speaker_1': 'I understand this may be a tough for some of you. I hope you let your values guide you as this is all I will see tonight when you make this decision. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Denise rants.'",
        "'speaker_1': 'Members of council. Denise My yes, I am the public policy director for the ACLU of Colorado, and I'm here to challenge these particular initiatives before you. Quite simply, based on the fact that we got to quit feeding the beast a for profit in our criminal justice system, for profit providers are answerable to shareholders and not the people'",
        "'speaker_1': 'within their facilities. You as elected individual officials.'",
        "'speaker_2': 'Your shareholders.'",
        "'speaker_1': 'Are the people of the city and county of Denver and therefore you will be better caretakers of the people within your communities. Indeed, all of us here should ask the question that since when did the laudable goal of going from prison in to the community, what allow individuals to become commodities?'",
        "'speaker_1': 'And that's really the question that I present before you. And we seem to have bought this model wholesale that will just continue to do it the way we have always done without really asking the hard questions of if if it works.'",
        "'speaker_1': 'We do a great deal of work with Mr. Morrow, and I have a great deal of respect for his work. I'll quibble with two things. One, he says that a measure of success for community corrections is that 2% of the individuals will drop out of programs.'",
        "'speaker_1': 'How does that translate into transitioning into community? Second thing, he says, is that three quarters of the individuals getting out of community corrections are crime free. I don't know what data he's looking at, but the Department of Criminal Justice tells us that that 41% recidivate within two years of release from a halfway house.'",
        "'speaker_1': 'So maybe he's looking at a very, very brief period of time that's not successful transition. And even if you look at those unique positives to a community corrections facility, it's not unique to a for profit entity. You. The city and county of Denver can run your own community corrections program.'",
        "'speaker_1': 'And by God, I am sure you will do it far better.'",
        "'speaker_9': 'If these measures go through.'",
        "'speaker_1': 'Today. I do hope that you will look at county community corrections programs that are working that are not for profit. Go to Garfield County, go to Larimer County, go to Mesa County, because those counties have amazing success and they're doing it internally and they have great goals and they're making the numbers.'",
        "'speaker_1': 'You don't need to feed the for profit demon because at the end of the day, I know you believe each of you in people over profit. And I want you to show the people of the city and county of Denver that you embrace that goal wholeheartedly.'",
        "'speaker_1': 'Thank you so.'",
        "'speaker_0': 'Much. Thank you. Next up, Dr. on.'",
        "'speaker_1': 'Lisa Calderon I'm here in my personal capacity as a former criminal justice professor, former reentry provider and researcher on this very issue in which I got my doctorate. And I'm here to bust a few myths that have been shared today by people supporting this contract of which I am opposed are both of these contracts.'",
        "'speaker_1': 'The first myth is that we must rely on the private prison industry to transition people to freedom. There is no proof that freedom comes under coercive control, under threat of being sent back to prison. Myth number two is that transitioning people into halfway houses results in better outcomes than straight parole.'",
        "'speaker_1': 'There is no research that indicates that that is in fact true. So we are continuing to feed a beast that has no better outcomes and just paroling people into the community. Myth number three is there is no connection between inhumane conditions, human rights violations, keeping people in cages, labor exploitation and this contract or these contracts before the'",
        "'speaker_1': 'city. They are all connected. So simply picking and choosing which which freedom we're going to pay attention to, I think is unconscionable. SMITH For that, simply providing programing is a sign of effectiveness. It is not. I study this as part of my doctorate.'",
        "'speaker_1': 'So, for example, just offering life skills program as part of your repertoire doesn't mean that that's in fact in fact, it's one of the least effective modes of educating people. So you need to use evidence based programing. Simply looking at program completion just simply means that people got a certificate for attending your class.'",
        "'speaker_1': 'Myth number five By calling yourself your agency, Community Education Center doesn't mean you are in the business of community or in the business of education. And as an educator, I am offended that our community, our education has been co-opted and rebranded by these for profit industries to, as someone had said earlier, essentially hide the poor records.'",
        "'speaker_1': 'For example, Corrections.'",
        "'speaker_7': 'Corporation of.'",
        "'speaker_1': 'America, NGO. Myth number six that if you don't approve this contract, people will go back to prison.'",
        "'speaker_7': 'Crime will increase.'",
        "'speaker_1': 'And there will be chaos in the streets. We've been hearing that since the Clinton years, since the Nixon years. We know that we have an incarceration, a mass incarceration problem, and we have an opportunity now to do something about it.'",
        "'speaker_1': 'And myth number nine, that private prisons, well, this problem was unforeseeable. I thought when I ran a reentry program, Geo and other corporations, I warned the city that this day was coming. So this is an opportunity to form a work group, to divest from poor, for profit prison industry.'",
        "'speaker_1': 'And we can do this. It's never too late to do justice. And I'm imploring you to do justice now.'",
        "'speaker_0': 'Thank you. Next up, 1050.'",
        "'speaker_1': 'Good evening. My name is Pamela Clifton and the communications coordinator for the Colorado Criminal Justice Reform Coalition. I'm here today to share our concerns about the four private prison companies that currently contract with the city of Denver to operate community corrections facilities.'",
        "'speaker_1': 'Now, I'm here because part of my job entails answering phone calls, letters and emails from people that are in prison, in community corrections, and their families who are caught up in the community, in the criminal justice system. CCJ RC is fundamentally opposed to the use of private prison companies, not just as private prison operators.'",
        "'speaker_1': 'In recent years. They've, as you've heard, diversify their business model to include alternatives to incarceration. And that's not just saying that out loud. They've actually.'",
        "'speaker_7': 'Bought by, which.'",
        "'speaker_1': 'Was the Reporting and First Alliance, which did use testing because there's a lot of money to be made in service in the criminal justice system. Now, first of all, we are very encouraged that the city council is looking more closely at this issue because it needs to, especially since private prison companies now operate six out of the'",
        "'speaker_1': 'ten community corrections facilities in Denver. We're concerned that there's inadequate oversight by the city, especially with regards to ways that residents can lodge complaints. This is one of the number one problems. There's no meaningful way I this is the actual voice of people that are that are in community corrections.'",
        "'speaker_1': 'There's no meaningful way for people to to complain anonymously about issues that they're dealing with because there's no outside ombudsman office that is empowered to investigate or address grievances. We've heard numerous examples of people who've walked away from halfway houses because they are frustrated with the programs that they're in.'",
        "'speaker_1': 'They have no one to talk about it without fearing some kind of retaliation. Obviously, this can result in people being charged with escape and sent back or or returned to prison. There are also seems to be little consistency in programing or staffing.'",
        "'speaker_1': 'There are constant complaints about things as simple as the food. It's availability, the lack of privacy. Some facilities are clean and others are not. Now I want to address one place and facility, one facility in particular, and that is William Street.'",
        "'speaker_1': 'It's owned by Geo. They housed women. It's one of the few that are out there. The concerns that I have are that staff are concerned only about where they are not concerned about how they are. And this is important when it comes to women, when you're talking about trauma informed care.'",
        "'speaker_1': 'There are constant complaints.'",
        "'speaker_5': 'About.'",
        "'speaker_1': 'The way that people are talked to by line staff. And that's who the culture of the community of community corrections are, the people that they deal with every single day. The staff are short with folks and often rude to them and their families.'",
        "'speaker_7': 'So research by the Division.'",
        "'speaker_1': 'Of Criminal Justice indicates that county run community corrections, including race in Larimer, have better. I'm sorry.'",
        "'speaker_0': 'But your time is up. Thank you very much. That concludes our speakers this evening. We are going to move on to questions from members of council. And again, we were in a combined courtesy hearing. So you can ask questions about 673 or 674.'",
        "'speaker_3': 'Councilwoman CdeBaca I have a pretty extensive line of questions for Mr. Mauro. Can you come up? These can be short answers, if you like. Yes or no will do. Unless otherwise. Unless you feel otherwise. Are you aware of the human rights violations being committed by GEO nationally and locally in any of their facilities?'",
        "'speaker_11': 'Councilwoman. I'm here to speak to the Community Corrections Program and the renewal of these two contracts for community corrections services.'",
        "'speaker_3': 'That's not the question I asked.'",
        "'speaker_11': 'I understand that. But respectfully, that's the answer I'm giving.'",
        "'speaker_5': 'How many times have we.'",
        "'speaker_3': 'Renewed this contract with GEO and of course Civic?'",
        "'speaker_11': 'So the community corrections contract for GEO GEO acquired community education centers in 2017. So this will be the third renewal Corecivic Acquired Correctional Management in 2006.'",
        "'speaker_3': 'We heard that GEO does not make their audit information public. Do you have audit information for either of these entities?'",
        "'speaker_11': 'I do. Both my staff from the Community Corrections Board audit these programs regularly, as well as audits from the State Division of Criminal Justice are available upon request.'",
        "'speaker_3': 'We would love those, please. Do you? What is the per diem costs per resident at these facilities? From the state side of it.'",
        "'speaker_11': 'So there are several different podiums. The base bed is for fiscal year, 1920 is $45 and 40, $0.84. I had to get back to you on that. I don't remember. Off the top of my head, there's also specialized program per diems for the residential adult diagnosis program, for the Therapeutic Communities, for the Cognitive Behavioral Treatment Program, and'",
        "'speaker_11': 'for all of those were provided to counsel in a follow up to Safe House presentation via an email. The Exact Rates.'",
        "'speaker_3': 'What's the top of that range? I'm asking on the record for the public's benefit.'",
        "'speaker_11': 'Can I have a minute to look at my notes?'",
        "'speaker_1': 'Yes.'",
        "'speaker_0': 'Are you going to need a little bit of time or you have that pretty quick?'",
        "'speaker_11': 'Yeah, I can have. And I can try to multitask. Councilwoman, if you want to ask questions.'",
        "'speaker_0': 'Or Councilwoman, I'm happy to go to somebody who wants to question something else and come back when it's going to take a while. But I'm up to you.'",
        "'speaker_9': 'You got to.'",
        "'speaker_0': 'Excuse me. Excuse me. This is the time for council members. Ask questions and ask if you'd like to watch on TV. Talk rule out next door. Councilman, would you like to continue?'",
        "'speaker_3': 'It looks like he has the answer.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_11': 'The combine per diem for the cognitive behavioral treatment program is $95.02.'",
        "'speaker_3': 'So between 90, 45 and 95 is that range.'",
        "'speaker_11': 'And for clarification, the standard residential podium is 4845 for fiscal year 1920.'",
        "'speaker_3': 'And what do the residents pay on top of that base costs from their own money.'",
        "'speaker_11': 'So for the specialized programs, the residents are not expected to pay subsistence, which is a requirement in the footnote of the long bill each year that the General Assembly puts forth. But for the base bed of 4845, they're authorized to collect up to $17 per day.'",
        "'speaker_11': 'I can tell you that the collection rates are well short of that. You'd have to ask a provider for those exact rates, but they are not $17 a day. And again, that's an expectation of the General Assembly.'",
        "'speaker_3': 'We visited a course civic one on Columbine, and there's a 17 hour residents provided free food, free clothing, free laundry or any other free services.'",
        "'speaker_11': 'So all of the facilities provide free food. Three meals a day are provided. The menus are approved by a dietician. As far as clothing know the resident, the facilities are not expected or contracted to provide clothing. They will work with community agencies or support systems of the client to obtain clothing and essential needs.'",
        "'speaker_11': 'And then as far as paying for laundry, I'll have to get back to you on that one and poll each provider. I know some facilities have laundry on site. I'm not sure if they allow clients to access that free of charge or fee for service.'",
        "'speaker_1': 'So I pulled up the.'",
        "'speaker_3': 'PowerPoint that you had shared during committee, and one of the reasons for renewal was that.'",
        "'speaker_1': 'This reduces the cost. It's a reduced.'",
        "'speaker_3': 'Cost for halfway houses than prisons. I looked up the data.'",
        "'speaker_1': 'For.'",
        "'speaker_3': 'Private prisons per.'",
        "'speaker_1': 'Diem, and that is.'",
        "'speaker_3': '$57.37 a day. It's looking like at even at the lowest end of our bed costs, plus the $17 we're exceeding that amount of private prisons. Is that accurate?'",
        "'speaker_11': 'Well, I think when you're comparing the cost of a prison, but you can't just compare the cost of a private prison, you would have to kind of average out the cost across all facilities in Colorado. And that's why the number I reported was an average of $90 a day.'",
        "'speaker_1': 'Do you believe that a corporation that's getting.'",
        "'speaker_3': 'Millions of taxpayer dollars should be more transparent?'",
        "'speaker_11': 'I believe in transparency for everyone.'",
        "'speaker_3': 'Do we know how much profit is being made by these entities here in Colorado?'",
        "'speaker_11': 'I do not.'",
        "'speaker_3': 'Which demographic of residents do worst in these programs?'",
        "'speaker_11': 'I'm pausing to think through the in the annual reports. I don't know if I have that information to provide tonight. I can certainly follow up. There's also a report published by the Division of Criminal Justice that goes back and looks at programs across the state by race, ethnicity, legal status, all sorts of different interventions and provides those'",
        "'speaker_11': 'outcomes and recidivism numbers that I'm happy to share.'",
        "'speaker_3': 'Two more questions. What percent of services are directly.'",
        "'speaker_1': 'Provided by GEO.'",
        "'speaker_3': 'Or CORECIVIC and not by partner agencies?'",
        "'speaker_11': 'I don't have a percentage for you, Councilwoman. I can tell you that you know that all clients are assessed and their basic treatment needs are met. Sometimes those facilities will provide services in-house or even when they're outsourced. That's covered by the community corrections funding.'",
        "'speaker_11': 'But when you say all services, that's a pretty broad category. If you'd like to narrow that question, I'd be happy to try to respond.'",
        "'speaker_5': 'Well, my question is.'",
        "'speaker_3': 'Mostly because we heard from some who were testifying that nonprofits and community are relied on to provide the services as partners to the halfway.'",
        "'speaker_5': 'Houses.'",
        "'speaker_3': 'I visited the Columbine facility and they also said the same thing, that they primarily.'",
        "'speaker_1': 'Rely on.'",
        "'speaker_3': 'Nonprofits in community to provide the services, but they connect them to them. Is that accurate?'",
        "'speaker_11': 'I don't want to say it's inaccurate, but it deserves explanation. I think when you're talking about behavioral health services, those services are directly provided either by the facility or through the contractual funds that the facility outsources. There are many great community providers out there offering supportive work or work around employment, and I know our programs work extensively'",
        "'speaker_11': 'with them. The city of Denver has a formalized contract with Second Chance Center to complement the work going on in community corrections. I think that's the model. I mean, I think having a partnership with community partners as well as having the structure of these residential programs can work.'",
        "'speaker_11': 'We've just begun that. We're hoping that we see better outcomes because of it.'",
        "'speaker_3': 'So you're saying that the we pay geo or course Civic.'",
        "'speaker_5': 'And we pay.'",
        "'speaker_3': 'The nonprofit organizations to deliver those services.'",
        "'speaker_11': 'Deliver different services.'",
        "'speaker_3': 'And final question. What is your plan as the head of community corrections to win the city off of the private prison industrial complex?'",
        "'speaker_11': 'Well, I think as many others have stated, I think it's necessary to form some type of study group or work group and look at what the future holds. We've talked about zoning a little bit, but I think it's been ignored.'",
        "'speaker_11': 'The reason that we have ten facilities operated by the four programs is because there are no other options for a residential structure. So unless that, changes will continue to be right back where we are with four providers who have ten buildings where this use can occur.'",
        "'speaker_11': 'There's obviously a conversation that can occur with with the public run programs. I concur with with Ms.. Clifton, who talked about the great success of Larimer, Mason Garfield. But there's there are costs there, too. Those programs are more expensive to run.'",
        "'speaker_11': 'The counties have to subsidize the funding in order to make them work. I think that could be a model Denver could explore. I think there's a lot of different options, but it also has to start with zoning.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Black.'",
        "'speaker_5': 'Thank you, Mr. President. I have a few questions for you, Mr. Morrow. I just want to clarify some things I feel like the public comments are we're talking about three different things here, but tonight we're contemplating these two contracts.'",
        "'speaker_5': 'So specifically addressing those, if these do not pass, what will happen to those 517 people?'",
        "'speaker_11': 'So if these contracts do not pass, we would have to move to proceed to to not renew the contracts and there'd have to be a plan invoked to what happens with those individuals. The individuals that are sentenced directly by the courts are under a direct sentence to community corrections.'",
        "'speaker_11': 'So the only option is to return them to custody, to the Denver jail, until the court could review their case and decide whether to send them to the Department of Corrections, possibly to probation or some sentencing alternative. It's unlikely that many would be sentenced to probation because community corrections serves as an interim step between those who are'",
        "'speaker_11': 'unsuccessful or probation in prison. The individuals under the authority of the Department of Corrections are here under a statutory scheme that only allows them to be placed in a residential center under our current statute. So all of them would have to be returned now.'",
        "'speaker_11': 'They could be reviewed by the parole board. The parole board might parole some. They could look at other jurisdictions to try to place them. But across our state, we have a waiting list for community corrections beds. So the short term response, councilwoman is they would all be returned to custody in very short order.'",
        "'speaker_5': 'And what is the timeline for all of this? So if if they failed tonight, would all this happen tomorrow or happen next month when all of this happened?'",
        "'speaker_11': 'That would be a conversation with the city attorney's office and others to have a plan to move forward to safely close essentially six facilities.'",
        "'speaker_5': 'Okay. And the contracts that we're contemplating are for one year, is that correct?'",
        "'speaker_11': 'That's correct.'",
        "'speaker_5': 'And are they always for one year, or is just this just a one year extension? Correct.'",
        "'speaker_11': 'There are always one year renewable contracts.'",
        "'speaker_5': 'And so just a few minutes ago, you were talking about issues that we need to deal with as a city related to zoning. Are there other people who run these kinds of facilities who might be able to submit a proposal?'",
        "'speaker_11': 'So, Councilwoman, if you look across the state, there's a limited pool of providers in our current system. In addition to GEO, of course, you have Independence House, which is a private corporation that runs two programs in Denver, plus a third program for the Bureau of Prisons.'",
        "'speaker_11': 'There's a I think there's five other private providers of services in the state. There are three county run programs, as was mentioned earlier. Now, with different zoning and different land use issues, could you have smaller facilities that would be operated by community, not for profits or for from other providers, maybe?'",
        "'speaker_11': 'I think that would be very interesting and exciting to look at. It just doesn't exist. You know, we've been dealing with very restrictive zoning for a number of years, and I think this is part of the reason we're here.'",
        "'speaker_5': 'Okay. I have two more quick, quick questions. So I don't think there's anyone here who is okay with the ice detention facility and or anywhere else. But are you receiving complaints of. Abuse at any of these halfway houses.'",
        "'speaker_11': 'We receive complaints that cover the spectrum of I'm not moving as fast as I can. The staff member isn't treating me in a way that I should be treated. And we look into those, we address them. But there have been no instances of abuse that have alleged a civil right violation in the community corrections program that I'm'",
        "'speaker_11': 'aware of.'",
        "'speaker_5': 'Okay. And my final question is, Amy Coffman said in her remarks that half of the people in halfway houses probably will go back to prison. But I think you said something different in your presentation. Can you please clarify that?'",
        "'speaker_11': 'Sure. So we're talking about we're talking about two different statistics. She is correct that about 50% and this is a very generalized term of individuals placed in community corrections, will not successfully complete the program. Some will be returned to custody because that's the supervision component.'",
        "'speaker_11': 'Some individuals will break rules and not do what they're supposed to and be returned to custody. Some will walk away from the program. Some will commit a new crime. That's that 2% figure I discussed. When I talk about recidivism, it comes from the same department, the Division of Criminal Justice at one year post-release from successful completion of'",
        "'speaker_11': 'Common Core. It's roughly three out of four individuals are crime free 12 months later. But the average success rate is going to vary across program and service type. It's as high as 70% in some of our specialized programs, and it's as low as 45 to 50% in other programs.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Sawyer.'",
        "'speaker_6': 'Thank you. I just need a little bit of clarification, if you don't mind. On the financial portion of this.'",
        "'speaker_1': 'Den are Denver tax dollars being used.'",
        "'speaker_6': 'To fund these programs?'",
        "'speaker_11': 'Let me answer with clarification and then maybe answer your question. The the money that Denver receives to fund the residential contracts is appropriated by the General Assembly. It travels to the State Division of Criminal Justice, where they contract with each of the Colorado's 22 judicial districts.'",
        "'speaker_11': 'So those are state funds that pay for these services.'",
        "'speaker_6': 'So this is essentially we are this we the city of Denver and county of Denver are essentially a pass through.'",
        "'speaker_11': 'Correct. With the exception of $600,000. That goes to support the infrastructure of your local oversight and review of the programs.'",
        "'speaker_6': 'Okay. I was just a little bit confused with some of the comments tonight that people were were making when they were saying specifically Denver tax dollars were being used to support these facilities. So it is actually the vast majority of the almost $10 million we're talking about here is actually state tax dollars that are simply passing through'",
        "'speaker_6': 'the city and county of Denver via these contracts.'",
        "'speaker_11': 'You know, the funding is all derived from the state general fund as well as, you know, the state cash funds. There are no city funds that go into out of the general fund. There are no city dollars that go into paying for these contracts.'",
        "'speaker_1': 'Okay.'",
        "'speaker_6': 'Thank you for clarifying them. Thank you.'",
        "'speaker_0': 'Thank you, Catwoman clementines.'",
        "'speaker_4': 'Thank you, Mr. President. I have some questions as well. So several of my questions have already been answered. But you mentioned that public facilities are more expensive to run. Can you help me understand why a private company would be cheaper when they have a profit motive and then a public facility?'",
        "'speaker_11': 'So I want to be very careful not to report numbers that I've heard in conversations with my colleagues from Larimer, Mesa and Garfield. I think if this becomes a focal point of any future study, I think we need to ask those counties, too, to articulate what the true costs are.'",
        "'speaker_11': 'But I know for a fact that Larimer County and their commissioners last year were seeking additional funding, funding in excess of several hundred thousand dollars to me to continue to fund the program up there. Part of it is salaries.'",
        "'speaker_11': 'As county staff stay longer, the salary costs are more expensive than in some of the private, private vendors. That's that's a factor. And we're also not just talking about we're only talking about the year to year operations. When I hear those figures from Larimer, it does nothing to speak to the capital construction cost of their facility.'",
        "'speaker_11': 'Larimer, Mason and Garfield all chose to go this direction Larimer and Mesa in the beginning of community corrections in the 1970s and eighties. They've always been a county run program. They've always been a single provider. They're smaller districts.'",
        "'speaker_11': 'They have a smaller number of beds. So if you have more questions about the costs of a public run program as compared to a private, we can certainly work with those jurisdictions. I just I don't want to provide misinformation to this council.'",
        "'speaker_4': 'Thank you. And thank you for describing what you know versus what you under you've heard. So and also thank you for I mean, this is it's it's not fun being in the hot seat so not usually so thank you for thank you for being here and answering our questions.'",
        "'speaker_4': 'So next question. You mentioned that you don't have a contingency plan should the contract not be renewed, like you have to figure out what to do next or when the contract would wind down. Is that and I don't mean you haven't done anything, but like just how much thought had you put in or have you put into'",
        "'speaker_4': ', should the contract not be renewed?'",
        "'speaker_11': 'Well, I put a tremendous amount of thought in. But, you know, the Safety Department has no other options. Again, it goes back to that zoning issues. If this was an easier decision and it was about rebidding these contracts, I think that would have been done.'",
        "'speaker_11': 'I continue to point back to the land use restrictions that kind of put us here. Each year when we evaluate how to proceed with these contracts. There's no other options because there's no other buildings. If you don't have a building, you cannot provide residential services.'",
        "'speaker_11': 'It's just a no starter from day one. Until that, changes will continue to be in the cycle or we look at city property or would you change the zoning?'",
        "'speaker_4': 'And then one last question, Mr. President, you've mentioned that state funds are are given to the city excuse me, to the judicial district. And the judicial district then decides where the funds I guess the nature. My question is, does.'",
        "'speaker_4': 'These are state funds. Does the state decide the recipient of these contracts or does the judicial district have authority on bidding and deciding the contracts?'",
        "'speaker_11': 'Yeah, let me clarify, Councilman Hines. So, no, a judicial district is not an entity to contract with. So in Denver's situation, the city and county of Denver is the second judicial district. So the funds from the state are received and contracted.'",
        "'speaker_11': 'So the decision to contract with a provider is the city's.'",
        "'speaker_4': 'Thank you. And thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Hines. Councilwoman, can each.'",
        "'speaker_6': 'Thank you, Mr. President. I thought Councilwoman Ortega might have been in front of me. I wonder if the computer is not working. I am happy to defer to her.'",
        "'speaker_0': 'I don't see you at all.'",
        "'speaker_7': 'I was on there, so I'm not sure what happened.'",
        "'speaker_6': 'She was on there before Councilman Hines, and I think maybe we can apologize. So can I defer, please? No.'",
        "'speaker_4': 'Thank you. Sorry I jumped the line, Councilwoman Ortega.'",
        "'speaker_7': 'Thank you. I do have a few questions as well. So let me first start, Craig, by asking if you could just highlight the history of locally owned community correction facilities. I was looking through the list and recalling that at least a couple of them that are now owned by a major corporation were locally owned.'",
        "'speaker_7': 'Columbine, as I remember, was locally owned. So was Fox. Obviously Fillmore and Independence House are. So can you just talk about some of that history of. Just sort of the challenges that have sort of transpired as a result of big corporations buying them out.'",
        "'speaker_7': 'That kind of.'",
        "'speaker_1': 'Stuff.'",
        "'speaker_11': 'Councilwoman Ortega So I can go back as far as my history, which began in 1996 with the city. The University has always run the Peer one in Haven program on the grounds of Fort Logan. Those are therapeutic communities under their addiction science and treatment services model.'",
        "'speaker_11': 'Independence House, either through Independence House, family or R.K. Enterprises, has always run the Fillmore program in Independence House, Paco's Independence House, as well as a local corporation. Prior to 2016, Correctional Management Inc. ran the four core civic programs we discussed today Ulster, Dahlia, Fox and Columbine.'",
        "'speaker_11': 'At the same time, correctional management operated programs in Boulder and Longmont and in Arapahoe County. Beginning in 2016, we began to see that that acquisition of first CMI. Then there were programs purchased in Arapahoe County and then Adams County by Core Civic.'",
        "'speaker_11': 'Community Education Centers operated the William Street and Tully Hall program. Prior to that, it was Community Corrections Corporation, so they were sold once before. And then the jail group acquired CSC as a subsidiary in 2017. I think when we think about what's happening not only in Denver but across the state, this is relatively new to see these'",
        "'speaker_11': 'large vendors purchase the programs that were once owned locally. We're still studying the impacts. We've talked about some of the things or at least some of the concerns have been expressed here tonight. But there's also been some some advantages that I've seen.'",
        "'speaker_11': 'I've seen Corecivic invest in training and development of its staff. Both Geo and Core Civic recently provided raises to their staff. Now, will that matter in terms of outcomes? I think that remains to be seen. But I also just want to point out that there have been some advantages to this larger infrastructure.'",
        "'speaker_11': 'I think it's important to have a sense in the community and you heard from the program directors that they live and work in Denver. They care about this community. And I think that's important.'",
        "'speaker_7': 'So let me go on to my other questions. Do we know what the availability of beds both in the jail as well as in the prison are, so that if for some reason these contracts were not approved. And I'll ask another question later about what happens to another bill we have on the agenda tonight accepting the full'",
        "'speaker_7': 'amount of money from the state. But do we know what the availability of beds is, if that were to be the case? Do we know the jail has room to take the 40 people that are? Well, that's a whole separate group.'",
        "'speaker_7': 'We've got 240 people on the waitlist in addition to the people that are currently in the programs. Right.'",
        "'speaker_11': 'Yeah. Councilwoman Ortega, if I can clarify some of the numbers. So in addition to the people that are occupying beds today, there are 200 individuals referred by the Department of Corrections who have declared Denver as their destination of release, that our Community Corrections Board has said they're acceptable and willing to take them.'",
        "'speaker_11': 'So there's 200 people on a waitlist that would also have to find somewhere else to go.'",
        "'speaker_7': 'And those people are still in prison.'",
        "'speaker_11': 'That those people are still in prison. Of the 500 beds that are currently occupied between the geo and core civic programs, roughly two thirds are Department of Corrections clients. Our historic utilization of DOC versus our direct sentence is about two thirds to one third.'",
        "'speaker_11': 'So you can approximate that two thirds of that 500 would be returned to U.S.. The vacancy rate in the U.S. is low. If you read the papers or you pay attention to what's going on at the legislature, you know that number is extremely low.'",
        "'speaker_11': 'There's a prison population legislation that's been introduced calling for reports to be generated to elected officials, to the judiciary, to the parole board and others whenever the vacancy rate falls below 3%. I've heard reports recently that there's less than 100 vacant male beds in the Department of Corrections.'",
        "'speaker_7': 'So do do our demographics of people who are in our community corrections system pretty much parallel the population of people who are in the prison system. I.e. mostly black and brown, both men and women.'",
        "'speaker_11': 'So I can provide those numbers. The numbers of the demographics of the Denver Community Corrections system looked different than the statewide community corrections system. I don't know the numbers or the specific percentages of the prison population. I can tell you roughly there are about a third African-Americans roughly there, about a third of Hispanics and roughly about a'",
        "'speaker_11': 'third Caucasians in the Denver system.'",
        "'speaker_7': 'Okay. What are the state licensing requirements for an operator? So if we were to take a different path and say, you know, maybe, maybe we approve this for the next year or maybe, you know, if we can extend the existing contract for six months and look at accelerating, looking at a whole different point of view, i.e. maybe'",
        "'speaker_7': 'city owned properties, we have been asked to purchase a property on Vasquez Boulevard, for example, in Swansea, a neighborhood we own a property over on. I think it's Jason Street in southwest Denver. So what would be those licensing requirements for an operator, whether it's us finding a local operator or the city deciding they might want to run'",
        "'speaker_7': 'this?'",
        "'speaker_11': 'So. Councilwoman Ortega So the first step, assuming that a building or a site could be secured, it would depend upon putting.'",
        "'speaker_7': 'The zoning aside for a minute, knowing that that's got to be addressed.'",
        "'speaker_11': 'It would depend what services are being solicited. What I mean by that is for substance abuse or mental health treatment, the division of Behavioral Health would have to step in and license and look at, you know, all the requirements they have under their rules and regulations.'",
        "'speaker_11': 'There's no specific licensure either at the city or state level for a community corrections facility. It's really a land use designation. There does have to be a level of expertize because we select which providers operate. But the D.O.C. and the judicial department also have to be comfortable with the providers that are offering those services, otherwise they won't'",
        "'speaker_11': 'refer place.'",
        "'speaker_7': 'Okay. And I think that's it for now. I may have a couple more and may want to be put back in the queue.'",
        "'speaker_0': 'Thank you, councilwoman or councilman glitch.'",
        "'speaker_6': 'Thank you. I was wondering if I could ask those who testified against the contract tonight whether which none of which in my notes had any specific ideas or proposals for the 500 people who two thirds of which would be returned to prison, a third of which would be returned to jail.'",
        "'speaker_6': 'If anyone has any specific suggestions on how that should be managed, if anyone who testified and said we should kill this contract tonight immediately, whether anyone would like to share any chance now that you've heard some about the implications, I would like to know what transition, sir?'",
        "'speaker_6': 'Would you like to step forward? And please reintroduce yourself. Thank you.'",
        "'speaker_10': 'Sure. I'm Vincent Bowen and I. I think Chairman Saca actually had a proposal, so. I mean, that's a statement of fact. But I think that you even just spoke of renegotiating the problem with killing the or the problem with extending the contract is it doesn't give the impetus to actually start doing something, but perhaps renegotiating leases.'",
        "'speaker_10': 'The providers are not going to have any use for the buildings if they are not the contract provider. So perhaps an interim lease could be renegotiated. You could also just extend the lease or extend the contract a shorter amount of time and work on a transition because there are providers in the community.'",
        "'speaker_10': 'You can also work on transitioning the people who are employed by the for profit company into a community corrections owned by the city or operated by the city or nonprofits. But there's definitely transition plans. It can be done if there's the will to do it.'",
        "'speaker_6': 'Yes, sir. I just want to clarify a couple of things you described are not factually correct. So, Greg, can you clarify the ownership of the building that these are not leases, these are not city facilities? Thank you, Mr. Bryant.'",
        "'speaker_10': 'I know that. I know that, of course. But if you are a provider of the services and tomorrow you have no services, what are you going to do with the building? You'd probably be motivated to negotiate a lease back to the city, correct?'",
        "'speaker_6': 'Yeah, I hear you. Thank you for that clarification. I would like to talk not just to Greg, so either you or the administration a little bit about this idea of a task force. I guess I'd like to know how firm this idea is.'",
        "'speaker_6': 'And particularly, I'd like to ask a series of questions about the topics that we've heard about tonight and get some responses from from you all. So. Are you are you forming a task force? Is that a commitment that's being made tonight versus an idea yet?'",
        "'speaker_3': 'Sky Student Mayor's Office. Greg and I have had a conversation about that and we are committed to doing that. We have formed the exact make up of that group yet, but we have talked with a few different people about including council and community members.'",
        "'speaker_3': 'So we are committed to working through what that looks like and a structure going forward.'",
        "'speaker_6': 'And so one of the things I heard about is that when if we contract for these services, it has to be relevant what the performance has been at other facilities. And so is that having contracting criteria related to other facilities, not just our own program history, but that a concrete contracting term could be whether or not there'",
        "'speaker_6': 'have been health or safety violations in other facilities that that could be considered. Is that something you're open to having in this task forces agenda? Contracting standards?'",
        "'speaker_3': 'Yeah, absolutely. Happy to have that be part of the conversation and have talked about that.'",
        "'speaker_6': 'I've heard a request to look at a concrete alternative for public provision. Is that something that. Yes.'",
        "'speaker_3': 'Yeah, absolutely. You heard about a few programs tonight. Greg has mentioned those in the past as well, that other county run facilities. It's something that we would be willing to look at in more detail and try and understand what the mechanics of that are going forward.'",
        "'speaker_6': 'I wanted to ask about we heard some concern that there is not a mechanism for making anonymous complaints. And so particularly at the county level, I don't know what may exist at the state level, but since these contracts are with us, are you open to having a conversation about an anonymous complaint and and investigation system that would'",
        "'speaker_6': 'be at our level with those with whom we are contracting so that people have a method to safely make complaints.'",
        "'speaker_3': 'Sure. I think we're open to all of those things. Sorry, Greg and I hadn't talked about that one specifically, so I just wanted to check in and see if he had particular thoughts. But yes, I'm open to having all of those things be components of this conversation.'",
        "'speaker_3': 'Okay.'",
        "'speaker_11': 'Councilwoman, may I.'",
        "'speaker_1': 'Please.'",
        "'speaker_11': 'I just want to clarify. There is a grievance process within community corrections. So at each one of these ten sites, there's an assigned Department of Corrections Community Parole Officer. So the residents have an opportunity to speak to their CPO.'",
        "'speaker_11': 'If there's a concern within the standards published by the State Division of Criminal Justice, each program has to have a central grievance file. My team goes out and reviews those grievances to make sure they were addressed in a timely and appropriate way, as does the Division of Criminal Justice.'",
        "'speaker_11': 'I know Ms.. Clifton gets complaints, my office gets complaints. So there is remedy for people who feel like their placement isn't being treated in a way that's professional, ethical or to standards. So I just want to clarify that there is a process now to field complaints, so.'",
        "'speaker_6': 'I just want to clarify in that process an individual would be known to the parole officer they're making the complaint to the request was about the ability to make an anonymous complaint. Now, clearly, I just want to state for the record that I'm aware some anonymous complaints have enough facts.'",
        "'speaker_6': 'They can be investigated. Some do not have enough facts. And without the names person, you can't really investigate. But is there any rule prohibiting us from having an anonymous complaint system?'",
        "'speaker_11': 'Councilman No, you're correct. And I apologize for talking about the the No. One complaint. Yeah, but we do receive anonymous complaints. Sometimes they're difficult to follow up for the reasons that you mentioned, but we take each one seriously and we will usually send a team in to kind of look at the issues that were raised to see'",
        "'speaker_11': 'if there's any cooperating.'",
        "'speaker_6': 'Facts they are right to provide such an anonymous complaint is the procedure for making such a complaint posted in the facilities? Is there potentially more work that could be done to make that complaint option a more robust option?'",
        "'speaker_11': 'Yes, Councilwoman.'",
        "'speaker_6': 'Is that something that this group could consider? Great.'",
        "'speaker_3': 'Yes, absolutely.'",
        "'speaker_6': 'So I've got four things then that you've identified. One of the things I'm not sure if it goes on the list or not is a technical question. And it has to do with this question about is parole more effective than community corrections?'",
        "'speaker_6': 'So I have a question. If we were to decide as a county that we think parole is just as effective, would we have the ability to make the parole decision rather than the referral to community corrections? What influence would we have if we were to look at that question?'",
        "'speaker_11': 'Councilwoman Connie, you should know the city or the county has no authority on parole matters. That's a state function. The governor's parole board makes the paroling decision.'",
        "'speaker_6': 'So that may be something that is a statewide issue, which I've, you know, been educated on in the last week, but is maybe not something that is something that we could affect the change on, even if the data were further fleshed out.'",
        "'speaker_11': 'That is correct.'",
        "'speaker_6': 'Okay. So I guess I want to ask, very few hands went up when I asked for those who testified against about a transition plan. I guess the question I have is I can't. Okay.'",
        "'speaker_3': 'Dr. Calderon had her hand up.'",
        "'speaker_6': 'Okay. I missed that. So I'd like to know about weighing the and I'm going to you know, I'll go go with Dr. Keller. And I need to understand, weighing the ability to make a plan for 500 individuals over the course of a year with a certain plan and the sending of 500 people back to prison, which I'",
        "'speaker_6': 'find to be unpalatable as an alternative. So I'd like to know about the. In terms of of weighing it, because I believe there is a potential transition plan. But everything that I'm sorry to just look back at my last page of notes here, Mr. Bowen mentioned our steps that take time and that is not something that 500'",
        "'speaker_6': 'individuals have. They will immediately have to go. And so if you Dr. Calderon, if you'd like to address that, I'd love to hear from you. And then I have a question for one more attorney, and then I'll cede the floor.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Councilwoman, can you really appreciate that question? Because I asked Christy Donner with Colorado Criminal Justice Reform Coalition. Exactly. That also conferred a little bit with Denise Meyers as well with the ACLU. So no one said that this was going to be easy, but we didn't.'",
        "'speaker_1': 'We also know it's not impossible. Service providers serve more than 500 people a year all of the time. And so I think that we take the approach of putting everything on the table. But first, starting with the premise that we transition out, that's the goal.'",
        "'speaker_1': 'Right. So looking at what would phase out look like what needs to be in place and what would be the timeline for that. And so it could range from everything from when if buildings are the issue, then maybe we lease the building and then put in other providers as when when phase of the the phase out or'",
        "'speaker_1': 'the transition out to a transition lease. We also look at need to look at some of the buildings. I think that you all looked at places like 46 and still there's talk of using the old pat off, which is the old jail is converting to a another police department.'",
        "'speaker_1': 'And yet we have needs of these critical services for a population and incarcerated population that it's not even part of that conversation.'",
        "'speaker_7': 'So we have to look at some.'",
        "'speaker_1': 'Of our current uses of our current sitting bid at buildings that are already zoned for this type of population. And, you know, re reprioritize. We also need to drill down on this population. So as I was speaking to earlier, you know, we tend to lump all incarcerated or formerly incarcerated people into one box.'",
        "'speaker_1': 'But what we really need to do is to drill down and really ask which ones are would be eligible for parole. Which ones? You know, so what is that spectrum instead of putting everybody together? I think it does require a sense of urgency, commitment and prioritization, but it's by no means is impossible when we actually put everything'",
        "'speaker_1': 'in the pot, as long as we basically state that our intention is to phase out this contract, knowing we need steps, knowing we need time. But that's our intent.'",
        "'speaker_6': 'Thank you very much. Mr. President, do you want me to sit or. I have two more questions.'",
        "'speaker_0': 'You have two more? Well, you wrap it up.'",
        "'speaker_1': 'Okay, thanks.'",
        "'speaker_6': 'Q I just want to clarify the zoning timeline and councilwoman are taking our both on are both on this. So I know the timeline, but I'm not supposed to speak. So can you please share the soonest timeline that community planning and development expects to have an ordinance that would bring forward changes to the zoning?'",
        "'speaker_6': 'Or I can answer if I'm allowed, but I think it's important that we get that out.'",
        "'speaker_3': 'Councilman, you should probably answer because I don't have that timeline off the top of my head.'",
        "'speaker_6': 'With the president's forbearance.'",
        "'speaker_0': 'Go ahead.'",
        "'speaker_6': 'The as soon as they expect to have a draft ordinance is the end of the year, which means adoption would be into early 2020. And there is a moratorium. There is no site that can be legally used for this purpose as a community corrections facility under the current ordinance.'",
        "'speaker_6': 'So that's the situation we're in. It doesn't matter what its current or past uses, it is a moratorium in the in the ordinance and so it is physically impossible for that to be passed before early 2020.'",
        "'speaker_7': 'Just a point of clarification. I think the moratorium expired. So but if there were to be any industrial site that was identified, that's that's the whole nuance.'",
        "'speaker_6': 'It's all Chapter 59, zoning. No, anything that's re zoned into the new code is not eligible.'",
        "'speaker_3': 'Yeah, you're you're both correct. The moratorium did expire in May of 2018. But the way the zoning code is structured now, there is no possible way for a new facility to be put online until those changes are made.'",
        "'speaker_6': 'Yeah. Thank you for correcting me. I appreciate that. One last question is, so we have 300 individuals approximately. That would be D.O.C. decisions. It would not be our decision. So whether they were appropriate for parole or not, it would not be our decision.'",
        "'speaker_6': 'It would be Doc's decision. There's an individual here, Triston Gorman, who has a letter that's been put into the record, if I may ask Kristen to speak to what the potential space solutions D.O.C. has been looking at when faced with an influx of residents.'",
        "'speaker_6': 'I just want us to understand the full implications of us potentially sending 300 people back to D.O.C., what may happen, and how it could impact the state conversation about correctional prison space. So if you would, Miss Gorman.'",
        "'speaker_15': 'Thank you, Councilwoman Kennedy. Council members. My name is Triston Gorman. I'm a practicing criminal defense attorney. I'm also the legislative policy coordinator for the Colorado Criminal Defense Bar. My understanding at the Capitol, I do believe Mr. Morrow is correct that there have been recent reports that the vacancy rate in DC has fallen so low that there are'",
        "'speaker_15': 'around 100. Vacant male beds. I currently sit on an interim study committee for prison population management because this has become such a dire emergency in D.O.C.. For several years now, D.O.C. has been coming to the Capitol just demanding more money for more walls, more bars and more guards.'",
        "'speaker_15': 'We have been trying to keep them from reopening prison facilities like CSP, too. I would be shocked if we suddenly sent more than 300 inmates back into the custody of DC. My estimate, based on that two thirds out of 517 is approximately 340 inmates.'",
        "'speaker_15': 'I would be absolutely shocked if DC did anything other than run to the Capitol and demand that we reopen CSP too and put all these people in now. It's also important to keep in mind that DC does not directly handle parole matters.'",
        "'speaker_15': 'The State Parole Board appointed by the governor. They are the only people in the state who can handle parole matters. Until this legislative session, they have been limping along with seven members to handle tens of thousands of parole hearings every year.'",
        "'speaker_15': 'There was a bill passed this legislative session at the state level that increases parole board membership all the way up to nine. But my understanding is that hasn't actually been implemented yet. It's an incredibly difficult job. It's incredibly difficult for them to even get through the number of hearings that they have on their dockets every day.'",
        "'speaker_15': 'So what ends up happening? They end up erring on the side of public safety and not paroling people. They end up with over a thousand inmates well past their parole eligibility date who haven't actually been given any kind of real consideration for parole.'",
        "'speaker_15': 'And to think that if we send an influx of Denver inmates from our community into the State Department of Corrections where there are no beds for them, that somehow that's going to translate to an overworked, under-resourced state parole board.'",
        "'speaker_15': 'Paroling more people, I think is a fallacy, and I see no evidence to support it.'",
        "'speaker_6': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Flynn.'",
        "'speaker_13': 'Thank you, Mr. President. Can I ask the gentleman? The bone from Black Lives Matter. I'm sorry. Thank you. Hearing your concerns, hearing your concerns about the private for profit. I'm wondering, do you have any concerns about the other two providers that we already have contracts with, particularly the University of Colorado, which runs the Pier one, the arts'",
        "'speaker_13': 'program, and the Haven down in my district at Fort Logan or with the Private Independence House. Are there any concerns with those?'",
        "'speaker_10': 'Yeah, my my concern is not with particular programs is with the model.'",
        "'speaker_13': 'Concept.'",
        "'speaker_10': 'Of. Yeah, the concept. I mean, I mean, it's just a simple fort. We have a service to provide. We have people in need. We have people who are profiting off of that. It's a moral hazard.'",
        "'speaker_13': 'Could I ask you, would you have that same concern with the University of Colorado as a contractor, but as a public institution? Do you have that same concern also?'",
        "'speaker_10': 'Well, I actually do, because my my brother in law is a heart surgeon who worked for the University of Colorado. And as a profiting entity, they did some very poor service issues with health care.'",
        "'speaker_13': 'All right. Thank you. That's good to hear.'",
        "'speaker_9': 'Yeah.'",
        "'speaker_13': 'Greg or Sky who just ran back to our chair. Maybe Greg can handle this or maybe Jane Franken can answer. You've been with the community corrections since 96. Correct. And has this I just want to make sure I understand the history.'",
        "'speaker_13': 'Has Denver County, the second judicial district. Have we ever operated community corrections ourselves as a county entity? And then we transitioned to private? Do you know?'",
        "'speaker_11': 'We never. Councilman Flynn, we've never transitioned to a private. For several years, we had an additional provider operated by the Denver Sheriff's Department. It shared a building with the work release program. It was called Phase one. Mountain parks and individuals who first were coming out of prison would come into then building 18 or building 20.'",
        "'speaker_11': 'They would stabilize for about 60 days and then go into one of our community based programs. If they were struggling, they could be returned, placed on a work crew or are given some booster support services and then have another opportunity in lieu of going back to prison or the sentencing court to go back to community corrections.'",
        "'speaker_11': 'I want to say in 2013, that program was suspended. The Denver Sheriff's Department at that time was operating okay.'",
        "'speaker_13': 'But that's entirely different than the county or the judicial district, like Larimer and Garfield and Mesa operating their own system entirely. Correct. Okay. Agenda, is that is that true? So we started in in the 70 and the community corrections came in in the seventies.'",
        "'speaker_13': 'It has always been private providers. Jane, do you want to come up? Maybe just so because we're on TV. And there may even be people still watching.'",
        "'speaker_1': 'I can't add.'",
        "'speaker_7': 'Very much to that, except to say that we did have the Phase one program at the jail. Right. And what ultimately happened was the jail got overcrowded and they just didn't.'",
        "'speaker_1': 'Want to do it anymore.'",
        "'speaker_13': 'Okay. But we always had the private providers.'",
        "'speaker_1': 'Always. Okay.'",
        "'speaker_13': 'Thank you. Greg, the other of the 517 you estimated about or the attrition actually estimated at 340, some would be doxy clients, but the others are direct assignments to community corrections from the courts.'",
        "'speaker_11': 'Correct. Correct.'",
        "'speaker_13': 'What would happen to those?'",
        "'speaker_11': 'So in the likely scenario, would they be returned to the jail.'",
        "'speaker_13': 'Or adjudication by the.'",
        "'speaker_11': 'Court would have to review whatever court it was. And then they would the court would have to decide whether to impose a sentence to the Department of Corrections, which many times community corrections is a suspended sentence to DC.'",
        "'speaker_11': 'So if it can't be fulfilled in community, it would likely result in a sentence to the department. Furthermore, most of the folks that wind up in community corrections on that direct sentence side weren't making it at probation for whatever reason.'",
        "'speaker_11': 'Usually it's about structure. They were unsuccessful, so the court would be highly unlikely to sentence them to probation. So you're left with the unpleasant reality as many of those folks would end up in the Department of Corrections as well.'",
        "'speaker_11': 'Yeah.'",
        "'speaker_13': 'And maybe if maybe Sky can answer this or Greg, if you can, he would relieve her of having to walk all the way over again. Oh, you have a blank. Would one year be enough time to work on a transition plan and to examine whether the whether Denver County should be running its own community corrections as Larimer'",
        "'speaker_13': ', Mesa and Garfield would one year be enough time.'",
        "'speaker_11': 'I can offer my opinion. Sky. Would you like me to.'",
        "'speaker_1': 'Yeah, go ahead, Greg thing.'",
        "'speaker_11': 'So, Councilman, I think that's a great question because this isn't this would not be an easy transition. I believe there are other counties that have considered moving their privatized operations to a county run facility. At least one has concluded that it's not feasible for the county.'",
        "'speaker_11': 'And I believe that study took a year to two years to look at. So that's a great question. And I think that would really be left to what what does the transition look like? Is the transition to make a clean break from the current providers?'",
        "'speaker_11': 'Is the transition to bring in additional providers? I think those are very different timelines.'",
        "'speaker_13': 'Okay. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Flynn, Councilwoman Torres.'",
        "'speaker_1': 'Thank you, Mr. President. Greg, just a couple questions for you on the capacity issue and the numbers that we currently serve. Can you clarify for me? Individuals can indicate if they're in a state, the city anywhere in the state of Colorado, that they can designate Denver as the place where they want to be their be released or'",
        "'speaker_1': 'do community corrections. Is that right?'",
        "'speaker_11': 'That's that's correct. So there is nothing in state statute that requires someone to go to community corrections from the Department of Corrections from the county of sentence. The thought process is an individual may have committed a crime in Adams County, but actually has ties or interest or a reason to want to parole to Denver County and that'",
        "'speaker_11': 'therefore the transition services are usually set up, set up in that release destination. But that is an inmate choice. There's nothing that prescribes how the doc case manager or the D.O.C. makes that referral. It's inmate choice.'",
        "'speaker_1': 'And I'm wondering on that, that question in particular, because I do know that kinship based release or reunification programs tend to be more successful. But in visiting and talking with some of the folks today, Denver is a difficult place to be released.'",
        "'speaker_1': 'Denver's a difficult place for any new job to find a new apartment. And so I'm wondering if our climate, our economy, our financial kind of future for folks being released is actually conducive to what they're thinking their success rate might look like?'",
        "'speaker_11': 'Forgive me, Councilwoman. I'm not sure I'm following.'",
        "'speaker_1': 'That might have been a statement more than a question. The other was, how is it determined that we serve 700 individuals? Is it based on beds? Is it based on growth? What's that number been determined by?'",
        "'speaker_11': 'Councilwoman, It's really been the need for additional beds has driven the amount of beds we have. So there's roughly 748 zoned beds in Denver. We run a population between 680 and 707 ten on any given day. And with the 200 plus people on the waitlist in The O.C. and the 40 individuals waiting for services in the jail'",
        "'speaker_11': '. The demand is increasing. I would just like to maybe comment on what some others have said, and I do believe that we can do a better job in engaging and partnering with the community. That's never been what this is about tonight.'",
        "'speaker_11': 'This is about limited options to provide reentry services. I absolutely concur that we can do a better job and should do a better job to engage with the community partners where all of these residents are going to, you know, end up someday.'",
        "'speaker_11': 'So I just want to make that statement for the record that we can do better there.'",
        "'speaker_1': 'And then my my final question. When we saw this in committee, it wasn't because we had an RFP. Right. Can you walk us through maybe how the vendors are these the only foreign number that can possibly do this job?'",
        "'speaker_1': 'That may be the case, but how were they competing for a seat at the table?'",
        "'speaker_11': 'So, Councilwoman, it gets a little complex. So bear with me and the explanation. Some of the services were through a competitive bid process at the state. The residential dual diagnosis program, the IRC program, the CBT program were all competitively bid when the state issued an RFP and Denver said we would support that service here in Denver.'",
        "'speaker_11': 'But the providers were selected as far as the facilities themselves to offer the services. We did not go out to bid on these partly because, as was mentioned just a few minutes ago, up until from 2008 through 2018, there was a moratorium.'",
        "'speaker_11': 'So there was no ability for a new facility to be sited in Denver. Because of that, coupled with the land use going out to bid, is an exercise in futility. If you don't have a building, you can't be awarded the contract.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Tourists. Councilwoman Sandoval.'",
        "'speaker_5': 'Thank you, Mr. President. So, Greg, can you explain a little bit more thoroughly about the moratorium and exactly what that looked like and the timeline? Because we keep talking about zone beds. Correct. And I don't think a lot of people understand that.'",
        "'speaker_5': 'We also have this problem in Denver called NIMBYs, not in my backyard. And so can you please explain the timeline, how we got there, what that looks like? Because this is actually a really complicated land use issue. And when you throw out terms like moratorium and not giving the specifics around that and when it expired and why'",
        "'speaker_5': 'it went in, I think that's confusing for people in the audience to understand exactly why we are in this predicament right now in 2019.'",
        "'speaker_11': 'I'd be happy to your Councilwoman Sandoval and Councilwoman Ortega, maybe you can assist if you have the history on this as well. Let me go back to, you know, as I've been told in the 1970s and eighties and community corrections, the land use allowed facilities to be zoned in residential neighborhoods.'",
        "'speaker_11': 'In beginning in the mid-nineties to early 2000, there was a resistance from from neighborhoods and from community members that these this type of use should move out to the heavy industrial parts of the city. So zoning laws were changed and at the same time, there was a capacity in terms of the number of residents that could be'",
        "'speaker_11': 'in at that time. And I want or I too zoned district it was placed at 60 residents in 2006. The Department of Safety, through the Community Corrections Office and the Community Corrections Board, recognized that we needed more beds.'",
        "'speaker_11': 'The land use issues were very similar back then. Our providers were telling us not only local providers, but providers that were offering services elsewhere in the state told us there's no available land in Denver, or if there is a small sliver, it's not affordable.'",
        "'speaker_11': 'So we worked with the mayor's office at the time and council too for three years to expand the number of beds at four different facilities in the I1 I two zoned districts at the time. Eventually, three of them were allowed to raise their resident capacity from 60 up to 120.'",
        "'speaker_11': 'One of them was only allowed to to expand from 60 to 90. At that time is where the moratorium came into play. And what the moratorium essentially said was that from May, April or May of 2008, through May of 2018, there could be no new facility zoned anywhere in the city for community corrections use.'",
        "'speaker_11': 'And if someone from planning is here, they can correct me if I'm wrong. But the definition of community corrections use is quite narrow as well. It's three or more unrelated individuals who are moving from a place of confinement or criminal justice supervision in a single dwelling.'",
        "'speaker_11': 'So it's a pretty restrictive definition in and by itself. So all that together brought us to the moratorium. The more the conversations, as I recall them, we're about to study the impact that having more or additional beds in communities.'",
        "'speaker_11': 'Would it cause any harm to neighborhoods or community? And they wanted to wait ten years to see that play itself out. I was there for all ten years. Anecdotally, I can tell you there was there's no additional complaints.'",
        "'speaker_11': 'There's been no wave of crime. I think people talked about there's a fear factor out there that if you have people who are returning from prison or jail in the community, that everyone's out there doing harm to two individuals.'",
        "'speaker_11': 'And that's that's not true. There are people who do bad things. And as Mr. Anderson said, I'm in the camp that we need prisons. I don't think we need as many as we have. I don't think we need to build anything more.'",
        "'speaker_11': 'I think we need more alternatives. But the alternatives that we have or the programs that we're discussing tonight.'",
        "'speaker_5': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman Sandoval. Councilman CdeBaca, you back in with more questions?'",
        "'speaker_3': 'I am. I have three more questions. But while I ask the questions, I saw two hands up for solutions that didn't get acknowledged. Pastor Hughes and Ms.. Mayes Wood, can they respond with their ideas for solutions?'",
        "'speaker_0': 'The floor is yours. You can ask them any questions you.'",
        "'speaker_1': 'Like so.'",
        "'speaker_3': 'You guys can come up while I ask Mr. Mora these three questions. What's the required zoning?'",
        "'speaker_11': 'Forgive me, Councilwoman, because the new zoning code is even more complex than the old one. It used to be. I wanted to. Is there another city attorney maybe that can answer the specific zoned districts?'",
        "'speaker_3': 'So Kirsten can correct me if I'm wrong, but I want to know who you became. I and I b and I cannot remember off the top of my head if I am ex allows these as well, but I do not believe so.'",
        "'speaker_3': 'And it looks like Councilman Carnation Councilman Ortega shaking know at me and they've been closely involved in this conversation so I and it would be the answer. So the 46th and still least that we just engaged in for 87 months is an I 110,000 square foot warehouse.'",
        "'speaker_3': 'Second question, what's the what is the.'",
        "'speaker_1': 'Range of.'",
        "'speaker_3': 'Square footage needed for these sites?'",
        "'speaker_11': 'So in addition to councilwoman, in addition to what zone district they can be located in. There are a number of buffers that come into play. They have to be there's distance requirements to residential zones, there's distance requirements to schools, there's distance requirements, two other large residential care uses.'",
        "'speaker_11': 'So when you start to look at just sort of the a map that shows what zone districts it's allowed, but then you begin to buffer and filter out the other space and density. That's where we say there's no dirt available.'",
        "'speaker_3': 'And help me understand the numbers. So I'm looking at the 3.8 million and I am trying to figure out how that matches up with the $48 per bid that you mentioned for the 116 that are in the go contract.'",
        "'speaker_3': 'The numbers aren't quite lining up. What are those.'",
        "'speaker_1': 'Discrepancies?'",
        "'speaker_11': 'Councilwoman CdeBaca So the, the 4845 covers every bed that's available in that contract. So it's 73 beds that truly haul in 80 beds at William Street. So roughly 113 to 115. In addition to that, that's cognitive behavioral treatment per diem is applied for the for 48 of the beds of the 73 at Troy Hall.'",
        "'speaker_11': 'The facilities also receive what's called a facility payment distribution appropriated by the General Assembly that seeks to help reduce caseloads for case managers. There's a cap of one case manager per 20 residents. There's expectations on base salaries and salary and benefits that all all providers in the state have to achieve.'",
        "'speaker_11': 'And there are PREA reporting requirements. PREA is the Prison Rape Elimination Act. There are federal requirements and audits that are associated with brain being pre a complement of client and that allocation includes that. There's also the Correctional Treatment Fund.'",
        "'speaker_11': 'These are dollars that come to Denver and then go to our service providers in order to provide mental health and substance abuse, either in-house or outsource with community providers. That's how we're able to contract with Second Chance Center is we use the correctional treatment fund for those services.'",
        "'speaker_11': 'There may be in other funding lines, but it's hard to just equate X number of beds times 4845. I'd be happy to send you the actual allocation worksheet that shows you exactly how the funding equals 3.8 million. And if you would, if the Council would like it for course Civic, I could do that as well.'",
        "'speaker_3': 'Okay, those that's it for the questions with you. I have one more that Skye might need to answer. So we use eminent domain a lot against private residences and private businesses for public uses. Public benefits. Tell me what prevents us from being able to use eminent domain against corecivic or GEO for their facilities.'",
        "'speaker_1': 'Knowing that those buildings those facilities would have no other real value.'",
        "'speaker_3': 'Besides what they're serving us for. So I would say we don't use eminent domain a lot at all. But I'm going to hand this over to and Crawford. That's really more of a legal question.'",
        "'speaker_1': 'In my neighborhood, we do.'",
        "'speaker_5': 'Councilwoman CdeBaca, this is Commission.'",
        "'speaker_6': 'Crawford Legislative.'",
        "'speaker_3': 'Council.'",
        "'speaker_6': 'The the due process clause of the U.S. Constitution does not allow the city to just go in and take private property, certainly without just compensation. And there has to be a legitimate public purpose. And it would not be a it would not be an acceptable legal use of the takings clause of the U.S. Constitution to take the'",
        "'speaker_6': 'course of civic, ergo property. In this particular situation, I think maybe you and I should spend some time off line on this particular issue because it is very complicated.'",
        "'speaker_3': 'I do want to have this conversation online, actually, because we're using eminent domain for event centers. We use eminent domain for institutions of higher education.'",
        "'speaker_5': 'For public highways.'",
        "'speaker_3': 'For a range of different things that really don't rise to the level of public safety. And so we're talking about public safety.'",
        "'speaker_1': 'What are some of those criteria for eminent or public use that.'",
        "'speaker_3': 'That don't fit with public safety?'",
        "'speaker_6': 'So can you please clarify your question?'",
        "'speaker_3': 'What's the criteria for implementing eminent domain for public use of land?'",
        "'speaker_6': 'It's hard to. I'm having a really hard time doing this, like putting on the spot like this in this particular situation. I just can tell you for for the use of this property, we would not the city would not be able to legally take this property and then, I guess create.'",
        "'speaker_6': 'I guess. I'm. I'm struggling. I mean.'",
        "'speaker_1': 'How about that? How about the lease.'",
        "'speaker_3': 'That we just entered at 46 and still that zoned I a. Is that.'",
        "'speaker_1': 'Not a public publicly.'",
        "'speaker_3': 'Leased.'",
        "'speaker_1': 'Piece of land.'",
        "'speaker_3': 'With substantial amount of time that could be used for that, considering it's.'",
        "'speaker_1': 'Zoned.'",
        "'speaker_3': 'Appropriately? So, Councilman, I would say there's no way to answer that on the spot tonight. There's a lot of analysis. Greg talked a little bit through that. There are spacing requirements. There are a lot of other components of the code.'",
        "'speaker_3': 'There are also building code issues. Typically, a warehouse space is is not easily converted into a residential facility. So those are all things that we would have to have conversations about. I can't answer that for you tonight, whether that facility in that specific location would be a future option.'",
        "'speaker_3': 'But it is certainly something we could continue to look at and talk about. And that's great. And just to.'",
        "'speaker_1': 'Let the public know, it's within.'",
        "'speaker_3': 'Blocks of several of the other three facilities that are located in my district along that same exact corridor. And it several of the other facilities look very similar to warehouses. And so I believe it is an option. Pastor Hughes, would you be able to come up and denice on deck?'",
        "'speaker_13': 'Thank you, Councilwoman. Councilwoman Candace, you asked for solutions, and I'm glad you did. And although I wasn't prepared at first, but as Dr. Caldwell stated, this will require some work and a robust partnership with the D.O.C. and City County, Denver.'",
        "'speaker_13': 'So if D.O.C. evaluated or in SLAs escalated those. We're talking about 500 folk who are ready to move home to home monitoring. And they can they can then receive their additional services from service providers that are already being contracted, as was already stated, and then expand titers for services that would be lost to the contract by opening'",
        "'speaker_13': 'up contracts the by the former employees who are already training and doing case management and other services. That's the way we could do that. And then also Denver could move. Denver jail could could move low risk and low band people from jail to home monitoring, therefore opening up more beds to just those left over from the 500'",
        "'speaker_13': '. Put the remaining not going to home release. Let let them utilize that jail as a home as a work release process where they'll go out, get their services, get their additional trainings at their name, and then return back to the facility at night.'",
        "'speaker_13': 'Is it just like you do with work release? And in essence, it would be operating also like a halfway house, but that's a way of opening up beds, utilizing the folks we have, and then moving people from one place to the other.'",
        "'speaker_13': 'That's that's what that's what this process does anyway. So it would just take a matter of really reevaluating those who are already in the system, who are already working to come home, reevaluating, see where they're really at, and then moving them there and then moving open up those beds in the different county jail.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman CdeBaca and Councilwoman CORNISH, for your question of solutions. And honestly, I had a lot of the same comments that the pastor did. I think there's a lot of things that we could do if you realize that these 500 individuals are already being sent to residential treatment.'",
        "'speaker_1': 'So doing that in a home detention type with an ankle monitor or what have you, which I'm sure is probably owned by some other for profit entity, but there would be at least a way that they would be at home.'",
        "'speaker_1': 'And so that's certainly permitted. And I also do wonder if you are being given the false choice of signing a one year contract versus something that's month to month versus something that's only for six months and allow certain other solutions to kind of work themselves out over a period of time.'",
        "'speaker_1': 'And probably two last things and I'll be quick is it is actually incorrect and I hate to do this since Miss Gorman has left, but I told her I was going to do this was to correct a little bit of the prison population numbers.'",
        "'speaker_1': 'The fact of the matter is, is that the prison population is not nearly as big as Department of Corrections has led us to believe, as we have discovered. That is not to suggest that we send these individuals back to prison.'",
        "'speaker_1': 'So but I did want to correct that small record. And then the last thing I'll say, which I think should be part of the bigger study and it maybe some of it can be done more current is residential type treatment programs that Denver has that Denver doesn't fund enough.'",
        "'speaker_1': 'You're going to get money from House Bill 1263, which is the bill that do felonies is simple drug possession. You will be eligible for a grant program. You'll get money and funds from that to help people with substance abuse.'",
        "'speaker_1': 'So there is a way to take care of some of these individuals because I'm sure they're suffering from some form of substance abuse that could be funneled into a House Bill 1263 type of program. There are lots of solutions here.'",
        "'speaker_1': 'It's unfortunate that you feel like you are forced into a false choice, because I think there are several that we could look at. Thank you so much.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Welcome to Micah, Council of Ministers. How you jump back in. And that was originally your question is are your questions follow up on the same line?'",
        "'speaker_6': 'I have a correction to the answer about the zoning code.'",
        "'speaker_0': 'Councilman Hines, do you mind if I let Councilman to jump in first?'",
        "'speaker_4': 'I don't mind.'",
        "'speaker_0': 'Thank you. Go ahead.'",
        "'speaker_6': 'I shook my head. No, on the Impact Zone district and then went to my records from the group Living Zoning Code to double check my answer. And it is allowed in the impact zone district. But the challenge is that it has to be 1500 feet from a residential zone district and most of our impact zone districts are'",
        "'speaker_6': 'used as a buffer between residential and industrial areas, so there are almost none of them. I sent the council members an email with the problem statement about the zoning code so you can see the mapping that was done about which areas might be eligible.'",
        "'speaker_6': 'Some of those areas, as you can see on the map, don't have the type of buildings that would be appropriate. Like there's a spot right near City Park that is on the map as potential but, you know, is a built out area.'",
        "'speaker_6': 'So anyway, I just share that information since we don't have someone from zoning here today, I wanted to correct the record for the second time tonight. I'm for two. But anyway, I do think it outlines parking requirements and the distancing requirements are what essentially eliminates the the use of those spaces.'",
        "'speaker_6': 'And so you all have that in your inbox now. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. Miss Myers, are you. His my is are you here in your personal capacity or in your professional capacity?'",
        "'speaker_0': 'Could you could you please come up to the microphone? Answer So everybody are a rabid viewers on Channel eight can hear your answer.'",
        "'speaker_1': 'Your sidebar conversation was in my personal capacity, just so that were clear. No, I am here as public policy director for the ACLU of Colorado, but a very proud resident of Council District nine represented by the wonderful. Oh, one.'",
        "'speaker_1': 'Sorry, Councilwoman Sandoval. See, I know where I live. I promise.'",
        "'speaker_4': 'I will. Wait. Don't go away. So thank you, Ms.. Myers, for coming. And thank you for being here on on behalf of ACLU. I want to ask, does the ACLU have a relationship with either of these vendors that we're dealing with tonight?'",
        "'speaker_4': 'And by relationship, I mean, you know, judicial. Have you sued either of them?'",
        "'speaker_1': 'I got you. Because I was wondering, because we don't really like each other so we wouldn't have a good relationship. But no, we are not in any litigation with either of the entities that are subject to the contracts, either Corecivic, GEO or any of the others.'",
        "'speaker_4': 'And why is it you're talking about present tense?'",
        "'speaker_1': 'Have you tracked and I do not recall, at least for the ACLU of Colorado, that we have been involved in any litigation with either of these entities.'",
        "'speaker_4': 'Okay. Thank you for the clarification, because I read that ACLU was in lawsuits, but you're referring specifically to ACLU of Colorado. That's correct. Okay. Thank you. Um, I have one other I have two other sets of questions. The first is I just want to see if anyone from the audience is here who would be willing to speak'",
        "'speaker_4': 'about some of the non the vendors that aren't part of this, like Independence House. Is anyone here willing to speak about Independence House tonight? Well, yes, of course I do. Oh, do you want me to give you the question that I want to ask?'",
        "'speaker_4': 'And you can decide if you want to come up.'",
        "'speaker_0': 'If you wouldn't mind reintroducing yourself.'",
        "'speaker_1': 'Hi, my name is Rose Rodriguez. I am in District one and a family operated community corrections center in Denver.'",
        "'speaker_4': 'Okay. And you're with the Independence House?'",
        "'speaker_1': 'Yes, I'm the chief of operations.'",
        "'speaker_4': 'Awesome. Thank you. So I want to get a different perspective other than certainly we've heard from from people who work at both of the entities that are under consideration tonight. We've had a lot of conversation about we can do better, we can pick other vendors.'",
        "'speaker_4': 'And so if you're willing, I'd be interested in two questions. The first, how might you operate different than the two vendors that we have under consideration tonight? And the second question is, can the independents house support additional clients or are you at capacity?'",
        "'speaker_1': 'We are currently at capacity. We're actually under kind of a grandfathered zoning. So we can't change our zoning, open up any new beds. And even within the process that we have been doing this zoning committee, my idea I don't have an idea.'",
        "'speaker_1': 'The only thing that I have is the experience. And. The opportunity to work in this field that has shown us to be different. It's just really about us being a family business and we work on culture a lot.'",
        "'speaker_1': 'It's difficult work. I share the same thoughts as the other ladies that came up here. It's a lot of training, it's a lot of passion that we all have into it and we are different because we're a family and it's just the way we treat people.'",
        "'speaker_1': 'It's the type of people that we find that we hire and how we treat our employees seems to make a difference because it also goes down to how the how the clients feel in their success. But overall, I think Denver is a good place to work, and Greg's always been very helpful and helping everyone.'",
        "'speaker_1': 'So I don't have any ideas. Could we have capacity? No. Would we do it? I don't know. It's hard. It's really hard. You mentioned Denver and affordable living. You know, things going on here. There's a lot of clients that come back to Denver.'",
        "'speaker_4': 'Okay. Thank you. I certainly want to engage as many people as I can or as many organizations as possible. So thank you for your time. So I've got kind of a technical question. I suppose we've talked about going month to month or six months, is that I don't think that's within our power, is it?'",
        "'speaker_4': 'It's either we vote for the contract as it is, which is a year or we don't. Is that correct?'",
        "'speaker_3': 'Councilman Skye Stewart Mayor's Office. It is true that council cannot negotiate contract terms. So the contract in front of you, you would have to vote up or down logistically on the rest of it. I, Greg, would have to answer whether there's an ability to pass the state funds through differently.'",
        "'speaker_3': 'But that is not something we've contemplated. That's not the contract we negotiated. So that's not what's in front of you today.'",
        "'speaker_4': 'Is there a willingness it sounds like we've had several people talk about six months. Is there a willingness to consider a six month contract?'",
        "'speaker_11': 'Councilman Hines. I think that would be a deeper conversation with the administration. I do want to just we haven't talked about this, but I've been having a conversation with the community corrections board chair who mentioned this to me, and I think it deserves being said.'",
        "'speaker_11': 'There's no guarantee that those providers wouldn't contract with the feds or another entity to provide services if these contracts aren't renewed. So in addition to the complexity of what happens with the residents currently in program that might be returned or would be returned to to incarceration, both of them could renegotiate with the Bureau of Prisons, with the'",
        "'speaker_11': 'U.S. Probation and Pretrial Office. They could seek to have other contracts come in in those facilities. And we, at least from a community corrections lens, would have no authority. At some point, the state could consider getting rid of the local partnership in this model if if we don't create an opportunity for folks to come back to community'",
        "'speaker_11': '. There's been references made at the Capitol before about that, and you could potentially see the state change, the contracting. There's nothing that prohibits the state from directly contracting with a provider so they could take Denver out of the equation in selecting its service providers.'",
        "'speaker_11': 'So that's why I say this is a very complicated issue, and I think it's hard to answer it in the span of 2 hours.'",
        "'speaker_3': 'And Councilman, I would just jump back in and also point out that the timing for the change in the zoning code would not happen within six months. So we will be locked down with issues there until that zoning code change happens, which will not be for at least another six months.'",
        "'speaker_3': 'So I would be really reluctant to have a conversation about a six month contract knowing that we will not have further tools available to us before then.'",
        "'speaker_4': 'Fair enough. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you. Councilman Hines, Councilwoman Ortega.'",
        "'speaker_7': 'Two last questions. Greg, can you talk a little bit about the role that the Crossroads Shelter has played for people who are released that have reached their mandatory release date? Oftentimes people come out and don't necessarily have a place to go to.'",
        "'speaker_7': 'But I know that Crossroads has had sort of a contractual relationship with the. So can you speak to that? And so part of where I'm leaning is whether we also see a percentage of folks that come out that don't have that support system to help them get a job, to help them, you know, react fully back into'",
        "'speaker_7': 'society, especially if they've been locked up for so long in the world, is so different with technology and, you know, everything being so what's the right word? I want to use animated or you know, if you're not connected to the Internet, you don't know how to use, you know, all the new technology.'",
        "'speaker_7': 'It's harder for folks to get adapted to being back out and and being successful. So can you just speak to that for a minute?'",
        "'speaker_11': 'Councilwoman Ortega. So I believe there's a similar question raised at committee, so I'm going to try to answer it consistently. I would prefer not to speak to the operations of the Salvation Army because I don't know what relationship, contractual or whatnot they have with the Department of Corrections.'",
        "'speaker_11': 'What I would say is. More than 90% of the incarcerated population, those in the U.S. come back to communities. So there are choices to be made. Do you want those individuals reaching their mandatory release date and returning without services?'",
        "'speaker_11': 'Some some might be successful. Some absolutely need to go just to parole supervision. There was there's been discussion about the ankle bracelet program that's referred to as ESPN mate. I ASPI one thing, there are different eligibility requirements for that.'",
        "'speaker_11': 'So it's not an option to look at ISP on everybody that would be returned to prison. You have to be within six months of your parole eligibility date in order to be to qualify for ISP. So there's again, it just becomes more and more complicated as we even begin to think about other solutions.'",
        "'speaker_11': 'My professional opinion is if you lose this type of capacity in Denver, you will see an increase in the number of individuals that patrol homeless into Denver County. That would probably place a higher burden on an over tax shelter system to begin with because people lose their housing when they're in D.O.C., they don't necessarily always have the'",
        "'speaker_11': 'support of families, and so oftentimes they don't have anywhere else to go. And these residential programs create an opportunity for safe placement.'",
        "'speaker_7': 'Okay. My last question and this is both to you and to Sky as as we're talking about creating a new a new opportunity for looking at how we do community corrections, different. Number one, what would be the timeline for trying to ramp that up to have a committee in place and begin the conversation immediately?'",
        "'speaker_7': 'And then I would like.'",
        "'speaker_1': 'To see.'",
        "'speaker_7': 'And we've talked about this in our our meetings on the Group Living Ordinance as we are discussing the community correction component, the inclusion of social enterprises to be part of that. You know, I've been to the Delancey Street Foundation out in San Francisco.'",
        "'speaker_7': 'We've got a model that's looking at moving in here that mimics that, that some folks saw in Salt Lake City that are that are planning to open one right here in Denver. I believe they're going to serve 25 people.'",
        "'speaker_7': 'But the role that building in businesses and jobs and creating a more stable environment for the entity, for the people, I think is is one that has been a proven model and it's not something we have incorporated into our community correctional facilities.'",
        "'speaker_7': 'Frankly, we should be incorporating it into our homeless shelters as well. So is that something that you all would would be open to having on the table as part of those conversations so that we're not looking at long term, forever dependance on government resources to allow these to operate regardless of who the operator ends up being.'",
        "'speaker_7': 'So can you speak to that?'",
        "'speaker_3': 'Sure. I think, you know, in the course of the next week, we can start putting on paper what that plan would look like. Who would be involved? Certainly open to suggestion from you all would want to make sure that we have a chance to reach out to partners, too, to get the right people formulated into that.'",
        "'speaker_3': 'But, you know, there is a lot to discuss there. And I think we would have to get on a cadence to have those conversations quickly. And and throughout the next several months, up to a year, we'll obviously know more as the zoning code amendment is coming forward, what that will look like and what opportunities we have there'",
        "'speaker_3': '. But, yes, I think, you know, anything people think is an important component to talk about should be put on the table and let's have those discussions. There may be barriers that I'm not aware of or Greg is not aware of that we would need to talk about.'",
        "'speaker_3': 'But I think having the discussion about any of those different opportunities is is important and having a group available to flush those out makes sense. So I know you have some time constraints of heading out of town, but maybe in the next few days we can get some ideas put on paper and circle back with a couple'",
        "'speaker_3': 'of council members and continue to flesh that out over the next.'",
        "'speaker_7': 'Couple of weeks. I just want to make sure that I'm hearing you correctly. Are you assuming that nothing would happen until the work of the group living ordinance occurs or that we could do something on a parallel track?'",
        "'speaker_1': 'Oh, no, on a parallel track.'",
        "'speaker_3': 'I think my point is only. Yeah. That we will. As that work continues on and that community process continues on, we'll have a better sense for what additional opportunities.'",
        "'speaker_7': 'Because I think one is going to inform the other.'",
        "'speaker_3': 'Yeah. They would they would have to layer together but be informed by each other. Yep.'",
        "'speaker_7': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. See no other questions. Just quick clarification. These are not general fund dollars. If these contracts were turned down, they don't go back to the general fund. They go back to the state.'",
        "'speaker_11': 'That is correct.'",
        "'speaker_0': 'And they you they're not they can be spent for this use, but they could not be spent. We're talking about different creative solutions. This is what that money can be spent for. If we don't use this money for that, it goes back.'",
        "'speaker_11': 'That's correct. Mr. President, the JBC line items how community corrections funds can be used. We can't deviate from them.'",
        "'speaker_0': 'Thank you very much. All right. So no other questions. The combined hearing, public hearing for council resolution 673 and Council Resolution 674 oh, I'm sorry, is to go on hearings, closed comments by members of council. What we're going to do procedurally, comments on 673 and 674.'",
        "'speaker_0': 'We will vote on them separately, but make your comments for both the second one. We'll just go vote and not have a comment section. So this would be your time to comment on both before we vote individually on each.'",
        "'speaker_0': 'Councilwoman Black.'",
        "'speaker_5': 'Thank you, Mr. President. Thank you all for being here so late. I appreciate your passion and your interest. And thank you, Greg, for being here. I know this is a very difficult conversation, a very complicated issue. I also want to thank my constituent and my former state representative, Paul Rosenthal, who just snuck out.'",
        "'speaker_5': 'He and another one of my constituents, Diane Tram. You Tola Lawson, have both served on the community corrections word for many, many years, and they both have dedicated much of their lives to criminal justice reform. And they both keep me apprized of these issues that arise in that area tonight.'",
        "'speaker_5': 'I feel like there was a big disconnect and we were really talking about three different things. One is the immediate problem at hand, which how are we going to ensure that 517 people don't return to prison now? And the ways we can prevent that from happening is to approve those contracts.'",
        "'speaker_5': 'The other two topics that came up a lot in the public comment is our great concern with ICE and the ICE detention centers. Again, I don't think there's a person in this room who is okay with that. And I've asked.'",
        "'speaker_5': 'And our concerns with for profit community corrections. Perhaps there's a way we can address all of those things. One, we can allow for 517 people to stay in community halfway houses rather than going back to jail by passing these one year contracts.'",
        "'speaker_5': 'And then to move forward with a task force or some process that you are all promising that will allow us to look at different options. And for those reasons, I will be supporting these contracts.'",
        "'speaker_0': 'Thank you. Councilwoman Black. Councilman Flynn.'",
        "'speaker_13': 'Thank you, Mr. President. I really like the discussion that we've had tonight, and I like the the resolve to examine how we're doing things right now, whether that's the way we ought to be doing things. But to transition to a new model does require time, and it requires much thought and insight.'",
        "'speaker_13': 'And it can't be done in a chaotic outcome of or the chaotic result of voting down these contracts and having to deal with it in crisis mode. I like the one year extension. I think that gives. Probably not enough time given the testimony we heard during the hearing that might require more time to study this.'",
        "'speaker_13': 'Other counties, other judicial districts have had to take more time to examine their options. But I do like that we're committed to seeing if there is, in fact, a better model for doing this to to vote down these contracts.'",
        "'speaker_13': 'However, would, in my opinion, based on what we heard tonight, do too much harm to too many people too quickly. And I can't do that. So I will support this contract. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn, Councilwoman CdeBaca.'",
        "'speaker_3': 'So thank you all for staying late tonight. We've busted a lot of myths, and the people have called for more than rhetoric and good intentions. They're asking for action, and we hear you loud and clear. I don't think there was a disconnect.'",
        "'speaker_3': 'I think that you all have elected us, tasked us with the job of walking and chewing gum at the same time. And we have to make sure that we are like a lens zooming in and out to understand how our micro actions.'",
        "'speaker_1': 'Impact the.'",
        "'speaker_3': 'Macro level of things. And this is definitely an issue that I'm glad we're having a conversation about, even if my colleagues choose to vote this contract through.'",
        "'speaker_1': 'We're faced with the moral dilemma tonight.'",
        "'speaker_3': 'We have to in front, we have to confront mass incarceration in all of its forms and ugly faces. All of us watched 13 and felt enraged and wanted to do something about it. And this this is one of the examples of an opportunity we have to do something about mass incarceration on a small scale right here in'",
        "'speaker_3': 'our backyard.'",
        "'speaker_1': 'This machine is bigger and smarter than the big, slow, clunky systems of our government.'",
        "'speaker_3': 'You've watched them adapt. They are.'",
        "'speaker_1': 'Nimble. They have the ability and resources to adapt the.'",
        "'speaker_3': 'Language to to move and maneuver in ways we do not. You've heard.'",
        "'speaker_1': '17.'",
        "'speaker_3': 'People tonight tell.'",
        "'speaker_1': 'You repeatedly that this machine has adapted to our good intention language and shifted services to exploit our good intentions. We've watched these large entities gobble up smaller providers and public dollars with little to no accountability or transparency. These monopolies are market failures, and we as a government have a.'",
        "'speaker_3': 'Responsibility to intervene. These entities are essentially the Wal-Marts.'",
        "'speaker_1': 'Taking away.'",
        "'speaker_3': 'The businesses from our mom and pops, and they're taking away our ability to serve our community in ways that we would.'",
        "'speaker_1': 'Know are best for our community because we're part of that. We all know the long record of bad behavior of these companies. We know of their rebranding, of their accounting trickery. We know of the involuntary employee labor that they're employing.'",
        "'speaker_1': 'We have several court cases of employment discrimination.'",
        "'speaker_3': 'Across the country for multiple levels of.'",
        "'speaker_1': 'Their services. We have models of halfway houses that work and we're ignoring them. We know this one.'",
        "'speaker_3': 'We're allowing it to exhaust nonprofits and their small budgets to do the services while they collect money. And we have no idea of how to track that money or to know.'",
        "'speaker_1': 'What.'",
        "'speaker_3': 'They're doing with our taxpayer dollars. Yes, Denver is part of Colorado. And so we pay into those taxes that come down to us kind of like rain clouds.'",
        "'speaker_1': 'Pull up rain before we get.'",
        "'speaker_3': 'The precipitation. I'm here to advocate for the folks who are in jail.'",
        "'speaker_1': 'Facilities of all types who don't have someone here, don't have geo or course civic staff speaking to support them. There are no records of abuses likely because.'",
        "'speaker_3': 'They're investigating themselves.'",
        "'speaker_1': 'There's no.'",
        "'speaker_3': 'Research.'",
        "'speaker_1': 'Indicating that.'",
        "'speaker_3': 'Community corrections versus straight parole is better at transitioning people. And it's not true that most of the 155 parolees will be sent back to prison. Many will still be eligible for parole. We've heard solutions from county run facilities, zoning, that is.'",
        "'speaker_1': 'Or properties that are now available.'",
        "'speaker_3': 'And zoned appropriately to transition into this space. We've heard people who have expressed a willingness to start a study group. We have to do better and we know of models that work.'",
        "'speaker_1': 'We've renewed twice these contracts.'",
        "'speaker_3': 'Again, we've not given an impetus for them to change. We know that denying tonight is invoking a new plan.'",
        "'speaker_1': 'And that seems like an excellent catalyst to get our zoning conversation and the accountability conversations expedited.'",
        "'speaker_3': 'And so for those reasons, I will be voting no on both of these contracts tonight. Thank you.'",
        "'speaker_0': 'Thank you. Come from the sea. Dr. Catherine McGrath.'",
        "'speaker_1': 'Thank you, Mr. President. I just want to thank every single speaker here tonight and that you've endured a number of hours to make sure that we understood where you were coming from and what you're passionate about. And the folks who took the time to call or email my office about these two contracts, but also about big pictures'",
        "'speaker_1': '. I was able to tour a couple of facilities today before the vote, and I want to thank them each and every one of you for your time and energy and what you put into what are clearly very demanding and likely very stressful jobs.'",
        "'speaker_1': 'And the individuals participating in those programs were thoughtful and grateful for their opportunity to skill build as they prepared to leave jail. I clearly saw today the need for support systems for those exiting jails and prisons and the commitment from staff to provide those services.'",
        "'speaker_1': 'It is an absolute shame, though, that the owners of the companies are who they are for me anyway. On Wednesday, July 17th, I entered the Safety, Housing, Education and Homeless Committee. It was our second day after being sworn in to council.'",
        "'speaker_1': 'We were reviewing the set of contracts community corrections. During the presentation, the Association of CSC with GEO Court. All of our attention. And it wasn't something that I was expecting even walking into the room. And what I appreciate is that it's opened up this sizable conversation over the past three weeks about Geo Group.'",
        "'speaker_1': 'Their fingers in the city and county of Denver and Core Civic as well, because their presence is the owners of the community correctional services is relatively new for Denver, and we have to acknowledge that too. Of course, Civic Acquired Correctional Management Inc 2016 for $35 million.'",
        "'speaker_1': 'Geo Group acquired community education centers in 2017 for $360 million. And to your point about salaries, they've doubled between 2016 and 2017 for the top five individuals who run those companies. Behemoth has been the word used to describe these two.'",
        "'speaker_1': 'It's been an education, though, to learn why we face this situation. We have both a problem of limited capability in zoning and limited capacity and providers able to step in. Enter core civic NGO Group. Those paying attention to our own backyard know the many issues that the geo detention facility in Aurora faces today.'",
        "'speaker_1': 'And historically, we know in our backyard on the backdrop of immigrant rights work, unsafe, unsanitary, forced labor complaints and inhumane practices are reported across the country. There's also a larger argument that services with a profit motive run counter to the long term interest in reducing the need for their services, not increasing it.'",
        "'speaker_1': 'They're under pressure. They're under no pressure to have unionized labor, and they're generally exempt from the Freedom of Information Act. Yes, immigration is a national issue, but that doesn't mean we leave it at D.C. doorstep. I stepped into this space for counsel after 13 years spent promoting immigrant integration and strong pro-immigrant policy and practice for a reason'",
        "'speaker_1': '. Because I think we can make better decisions at a local level when we have the will and support of leadership. Local policy work in immigrant integration has turned a corner nationally because we're looking at what we can control, what we can shift, and what what requires thoughtful planning.'",
        "'speaker_1': 'I understand the reality of over 500 individuals receiving services that would be impacted. In addition, 147 staff employed by the two entities. But I cannot vote in favor of the two contracts before us. That said. That said, I also don't want to be here a year from now with the exact same dilemma and not having give substantial'",
        "'speaker_1': 'time to exploring what we can do about it. We have a working group that's making important strides in Cuba Group Livings Quarter matters but have not yet begun to really tackle community corrections. We need to put pressure for that to shift.'",
        "'speaker_1': 'I would like to put more imperative toward working on a device divestment strategy so we're not in a position where 60% of our bed capacity and the success, the successful futures of those needing services hangs in the balance.'",
        "'speaker_1': 'I thank you all for being here tonight. This is absolutely why I sit in this seat and why I am a proud resident of Denver. And again, I'll be voting no.'",
        "'speaker_0': 'Thank you. Councilman towards Councilman Hines.'",
        "'speaker_4': 'Thank you, Mr. President. And I also want to thank everyone here tonight. Over the last few hours that we've had testimony, I've I've been conflicted. I came up with a prepared statement. I wrote a whole lot more notes, which is kind of confused me and made me more conflicted.'",
        "'speaker_4': 'But, I mean, frankly, we're in a box, not like the kids in cages, but we're in a tough spot. And there are only 11 places in the city where these facilities can go. We don't control any of them directly.'",
        "'speaker_4': 'So we have a tough choice on whether to renew the contract or not. If we renew the contract, we're supporting organizations that provide a valuable service to more than 500 people and more than 140 employees. We're also supporting organizations that put kids in cages, run concentration camps, and.'",
        "'speaker_4': 'Have illegal recordings of attorney client meetings, falsify financial records, provide inadequate medical attention across the nation, including deaths and rampant long term scabies in facilities that's just core civic or CA. And then in other class action lawsuits there, kickback, bribery schemes there.'",
        "'speaker_4': 'They've destroyed evidence in court cases. We're supposed to represent the people. What are we doing? Getting in bed with companies that clearly do not represent the people. But if we don't renew the contract, we make a statement that it's not okay to treat anyone like how immigrants are being being treated like in our facilities or.'",
        "'speaker_4': 'We also need to find another place for 550 people. Some will go to jail. Many will go to jail. And I guess it's I'm a little still confused as to whether they can all go to jail or they don't.'",
        "'speaker_4': 'We only have 100 beds left in our state prison. And so that's an issue as well. Ultimately, again, government represents the people. And I agree with Ms.. Myers and other people who have said this is a false dichotomy, that we have other options that aren't being described tonight.'",
        "'speaker_4': 'And I will be a no vote in government.'",
        "'speaker_0': 'Thank you. Come some nights, Councilwoman Sandoval.'",
        "'speaker_5': 'Thank you. Comes President. So as I sit here vacillating back and forth and thinking about this reentry program, I just have to take a moment in personal privilege. I've had a cousin who's done reentry program and he said he would not have made it through if he had just gone to parole.'",
        "'speaker_5': 'He would not have. He had to be reintegrated into society. He had to be reintegrated through a halfway house. And so these programs work. And yet, at the same time, I have a mom who is a member of the Sisters of Loretto who go down and who has gone down several times to the detention facilities and has'",
        "'speaker_5': 'spent hours there and has protested. And so I'm one of the speakers tonight said you have to vote with your values. And so I sit up here feeling very conflicted because my values are representing my cousin who had a reentry and who actually went to one of these facilities ten years ago and is a member of our'",
        "'speaker_5': 'society and is a participant and is a proud father. And I'm so proud to have him. And yet also I sit here and think about the immigrants who are being detained. And so doing my homework. I watched a video yesterday and it was of a woman who had been speeding and talked about being her daughter, was detained'",
        "'speaker_5': 'from her because she was breaking the law. And I as a mother, I that rang true to me. And what am I going to do? So there's a lot of things that we can move forward with. And I hope that the administration I hope that it's true that we do start this working group.'",
        "'speaker_5': 'Many of you may not know. I worked for Councilwoman Monteiro in 2012, and I remember sitting in her office talking about this, talking about the moratorium. And here we are seven years later, not having dealt with anything, and that is not okay.'",
        "'speaker_5': 'I do not feel okay with the fact that I sat in that office in 2012. I knew that this was going on. We worked in Council District nine. I talked about these facilities and here I am seven years later, having to make this very, very, very challenging decision in front of all of you.'",
        "'speaker_5': 'And so as somebody whose family owns a restaurant, I keep thinking about the people who work. And I was able to go to two facilities today, and I saw compassion and I saw how you like your work. And I saw the workers who were there who connected with the people in a residential facility treatment center.'",
        "'speaker_5': 'And that is not easy work. I want to thank you for your work. I want to thank your employees for your work. I don't think that they go home at night and don't take their work with them. This is a job that also I go home at night and I take my work with me as well.'",
        "'speaker_5': 'And so I can relate to the people who work in those residential treatment centers and that you probably worry about your clients at night and you worry if they come back and what are we doing? And at the same time, I have to just go back to where do I vote with my values?'",
        "'speaker_5': 'And my values are the people. And that's why I'm here and that's why I am up on this stage. And that's where I know that I was elected to do. And so in good conscience, I cannot vote for these two contracts.'",
        "'speaker_8': 'Thank you. Thank you, Councilman Sandoval.'",
        "'speaker_0': 'Councilman Sawyer.'",
        "'speaker_6': 'Thank you, Mr. President. I am. I am. I'm so torn. I had the opportunity to tour a couple of facilities on Friday. Thank you very much to Greg and to everyone who opened the doors to me to be able to take a look at the facilities and meet some of the residents and meet some of the workers'",
        "'speaker_6': '. It was it I've had lots of sleepless nights in trying to figure out what to do about this because it's so personal. I feel like there is that we have an ethical obligation to the people of Denver and to the residents of Denver to make sure that we are, you know, keeping them safe.'",
        "'speaker_6': 'And part of this is a safety issue because if we are releasing people back onto back into prisons and then eventually back onto the streets of Denver without giving them the supportive services.'",
        "'speaker_1': 'That they need.'",
        "'speaker_6': 'That could lead to, you know, some major problems and some dangerous situations that that maybe could have been corrected if we had provided supportive services. On the other hand.'",
        "'speaker_1': 'We have a moral.'",
        "'speaker_6': 'Obligation to society at large to not be giving our money to companies that are putting children in.'",
        "'speaker_1': 'Cages. And I'm a mom and I can't I can't imagine. And I have to look myself in the mirror every morning.'",
        "'speaker_6': 'And know that I made the decision for, you know, that was right for my soul. And and and I just I don't know I don't know what to do. I'm I'm this is just a really awful tough situation.'",
        "'speaker_6': 'And, you know, I just I really hope that the the decisions that are made tonight, the discussions that have been started, that we that we follow through on these for real, because this is this is just this is an awful place to sit.'",
        "'speaker_6': 'So thank you.'",
        "'speaker_0': 'Thank you, sir. Councilman Gilmore.'",
        "'speaker_1': 'Thank you, President Clark. You know, I've taken a lot of notes and listened to what everybody had to say tonight, and. Honestly, I don't think it was presented as any successes. I can't say that the current providers, the contracts that we've been re-upping year after year, that there are great successes and that we have to do different'",
        "'speaker_1': '. There were some solutions here tonight. Ankle monitor monitoring. Having people go back to community. More nonprofit support, really. We were put in a no win situation. And I think it's pretty clear that. It was thought that it was going to just kind of push us over.'",
        "'speaker_1': 'And I appreciate the testimony tonight. I appreciate people sharing their personal perspectives. I have family members that have been in halfway houses that have been incarcerated and the system fails them. It failed them and it fails us over and over and over again.'",
        "'speaker_1': 'And I have to vote with my conscience. I have to believe that the 517 individuals that if it's an either or really. We have to go back and revisit that. There has to be some different solutions and I don't want to be back in the same position one year from now.'",
        "'speaker_1': 'It's on all of us sitting here, the public, everyone in our communities. Because if we start saying, not in my backyard, this is why we have the for profit side. And so we need to start wrapping our arms around and taking care of our own and making sure that we're demanding accountability.'",
        "'speaker_1': 'I don't know what the safety record is. I don't know how many complaints were lodged. I don't know how many complaints were taken care of with these providers. And I have to, at the end of the day, vote my conscience.'",
        "'speaker_1': 'And I cannot vote yes on something that is going to put money into these businesses. And so. Respectfully, President Clark, I will be voting no tonight.'",
        "'speaker_0': 'Thank you. Comes from Gilmore, Councilwoman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. This is absolutely an important policy issue that we need to be taking on. I have been serving on this. Committee that's looking at the zoning. Looking at where we can create some flexibility not just for community corrections, but for other group home categories that create greater opportunities for people who are struggling to live'",
        "'speaker_7': 'in the city. Whether you're somebody that's come out of prison and is is trying to find affordable housing, whether you're somebody coming out of a correction facility and trying to get into housing. And for, you know, almost eight years, I served working on homelessness.'",
        "'speaker_7': 'And a lot of the people that come out of prison that have no support system whatsoever are in our shelter system. Their lion's share of the people in our shelter system. And when they come out and they burn their number, they don't get resources.'",
        "'speaker_7': 'The people in our correction facilities are being paid for with state dollars that provide the support services to help them be successful in finding a job. And we're plugging in a bunch of these people into work on I-70, into these apprenticeship opportunities that we have created to make sure that we're rising all tides as we see so'",
        "'speaker_7': 'much wealth being built in this city and making sure that people aren't being left behind. And this is one of those opportunities that by making sure that our city contracts have goals and that we're creating opportunities for everybody, and we specifically say in the RFP, send in the contracts.'",
        "'speaker_7': 'Reentry, you know, are one of the categories that you have to go after and make sure that these are people we're creating jobs for. Yeah. It would be really easy for me to sit here and say, Yeah, I'm a no vote, I'm a no vote, and you have the votes that you need for this to go down'",
        "'speaker_7': '. But you know what? I care about the people that are in these facilities. What the hell are we going to do? Just saying, wow, we'll just throw you out in your ears. I think we have a commitment, a solid commitment.'",
        "'speaker_7': 'And I'm signing up to be right there, working with my sleeves rolled up to find some solutions. I also know that we have a Latino business, a family business running one of these facilities. Do we just cut everybody out off from from underneath, you know, the legs?'",
        "'speaker_7': 'I've worked side by side with the staff from these facilities because I'm on the reentry committee on the Group Living Ordinance, and these are good people. But I also do not agree with the fact that. These facilities are owned by a corporation.'",
        "'speaker_7': 'No different. Then the corporations running our schools. That control the pipeline of how many of our kids fail in school that end up in the prisons that they operate and they control two of the biggest pots of public resources.'",
        "'speaker_7': 'So if we're really serious about addressing this, let's revive our city school coordinating committee. Let's look at the prison the school to prison pipeline and truly focus on where some of these systems breakdowns begin to occur. And when we're not educating our kids.'",
        "'speaker_7': 'And we're letting our schools be controlled by private corporations that are more focused on putting the dollars into the pockets of their shareholders than they are educating our kids. That is contributing. And the majority of the kids, you know, that are failing, that are ending up in our prison system, are black and brown kids from our communities'",
        "'speaker_7': '. And that's where the majority of our schools have been changed over and over and over. I can tell you, Greenlee Elementary School, they're probably on at least a dozen times that school's changed over. So there's some there are some real systems issues that I think we need to work with, with our school district.'",
        "'speaker_7': 'But in terms of this particular issue tonight, we have two things facing us. We have these two contracts and then we have the dollars that we're accepting from the state. So if these contracts go down, then we're going to be dealing with the contract with with the state, the ag with the state.'",
        "'speaker_7': 'I'm not willing to to just throw these people out. I am willing to change the narrative of how we are dealing with community corrections in this city. Because as one member sitting on this task force, I think looking at social enterprises, Inc. is one way that we need to help move, move the paradigm of of how we're'",
        "'speaker_7': 'reentering people into our community, how we're working with our shelter system, because if we just solely rely on government resources to run these facilities. I think we're missing the boat. And I've seen some remarkable models that that we're not really looking at and trying to figure out how we incorporate.'",
        "'speaker_7': 'We've just continued to do things the same way we've been doing them. And so sign me up for for the committee. But I will be supporting this tonight because I think the people who went through the process got paroled, got, you know, approved by a community correction board to be allowed into these facilities.'",
        "'speaker_7': 'And, you know. Can we have 240 people on a waitlist wanting to come back into our community, but we have no beds for them, so we need to look at a solution that looks at the bigger picture and truly addresses this more holistically.'",
        "'speaker_7': 'And I see your faces. I see your, you know, you guys cringing and and and, you know, I'm here because the voters asked me to make some tough decisions. This is a tough decision. And you can you can look at me with your your your scowls on your faces.'",
        "'speaker_7': 'But at the same time, we're talking about lives of people, too. And yes, yes, we are talking about the lives of our kids who are being caged in these ice facilities. I don't support that. As a matter of fact, last week I spent time with local progress, which are all elected officials from cities across the country.'",
        "'speaker_7': 'And I challenged them to look at what we're doing here in Denver tonight and turning flipping this on its head so that we could look at doing community corrections in a whole different way. And many of them were going back to their cities and they were going to look at their contracts and look at how they could'",
        "'speaker_7': 'change this. So, you know, it's not just that easy to just say, yes, I'm there. No, I'm not. Without having these tough conversations. So I will be supporting this tonight.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Herndon.'",
        "'speaker_10': 'Thank you, Mr. President. I want to appreciate my colleagues and the community for having this honest conversation about this. And anyone who sits up here, no matter which way that you choose to vote, to imply that we do not care about the lives of the individuals that our country is treating inhumanely at best is unfortunate that they'",
        "'speaker_10': 'would accuse anyone on the council from doing this, from saying that. What I believe we have the opportunity to do is.'",
        "'speaker_2': 'This is a.'",
        "'speaker_10': 'One year.'",
        "'speaker_2': 'Contract and we have the commitment that we're going to put.'",
        "'speaker_10': 'Together a task force to figure this out. If this was a34 extended contract and it would be.'",
        "'speaker_2': 'Absolutely make sense to say absolutely not. We're making the statement, but we made a statement tonight that we're going to fix this problem and get.'",
        "'speaker_10': 'To some lessons, better solutions from some of our surrounding municipalities. But they're human beings. Lives are at stake if we choose to vote down this contract, in my opinion. And I.'",
        "'speaker_2': 'Believe that by supporting this commit.'",
        "'speaker_10': 'Supporting these contracts, we can continue to serve them and then at the same time figure out how to better do this. That's what I heard. And that's why I why I will be supporting this contract. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Herndon. Are there any other? I thought I saw some. Oh, councilman connection.'",
        "'speaker_6': 'I don't really want to speak to that. I've served in this position for eight years, and I don't think I've ever been to this point. This is one of the most important conversations we've had in my entire time in service.'",
        "'speaker_6': 'And I want to thank both the community and my colleagues for bringing this hearing forward. I think to imply that there's only one moral choice here is really, really unfair. To folks who've been convicted of crimes and. So I believe those that voted, you know, to to to shoot down these contracts or indicated that they're going to'",
        "'speaker_6': 'are voting from a moral position. And I also believe it is moral to say that folks should not be sent back to prison on a whim of of making a message to a multinational corporation that, you know, is a drop in the bucket to them.'",
        "'speaker_6': 'Both are moral positions. They're not the same, but they are both moral. And I know what kind of emails I get tomorrow if I vote yes on this contract. I know. And I think that that's sad to me, because what it means to vote no on this contract tonight is a gamble.'",
        "'speaker_6': 'It's a gamble. First and foremost there, folks optimistic that Department of Corrections will send them all to parole. That's a gamble. We have no guarantee we're gambling with people's lives. And it's a gamble that, you know, some folks might get, you know, another placement.'",
        "'speaker_6': 'That's what we're doing. Perhaps we're gambling that the administration will negotiate a shorter contract. I'm not hearing from most of my colleagues that a shorter contract would matter to them. I'm hearing that this is an all or nothing.'",
        "'speaker_6': 'So they have very little incentive to go back and negotiate a month to month contract or a six month contract unless they get a message from us that that would matter. So we could choose a path that says, let's not gamble.'",
        "'speaker_6': 'Let's find some answers and let's ask them to go back for a six month contract or a month to month contract. But that's not what I've heard here tonight. I've heard folks say that they're willing to gamble. And, you know, I don't want to vote for this contract and I don't want to gamble with people's lives.'",
        "'speaker_6': 'But ultimately, this is about our willingness to continue to dig in and do more work about whether we can find a path that doesn't force that. I feel like it's fine. I mean, I'm offended, frankly, by the clapping to indicate that there's so much happiness with us sending 500 people potentially back to prison.'",
        "'speaker_6': 'That is not. And I will tell you the other thing we're gambling on. I want to go back to what Councilman Ortega talked about. We're gambling that when and if we as a city get a group living code through that our communities are going to open arms and build these facilities.'",
        "'speaker_6': 'I got to tell you, I watch Facebook feeds. Raise your hand if you see the feed where someone says, God damn the border and everything Trump is doing to immigrants. And then in the next sentence is in their next post saying, Did you know the city is trying to put another homeless shelter in our neighborhood?'",
        "'speaker_6': 'It's outrageous. This is the biggest violation of our rights I've ever seen. Tell me if you've seen that post threat from the same people in the same registered neighborhood organization.'",
        "'speaker_1': 'Because I sure have.'",
        "'speaker_6': 'I have seen the same registered neighborhood organization have a conversation about immigrants and how much they love them, and then tell me how they better not build any facilities in their neighborhood. So we're gambling that our communities.'",
        "'speaker_1': 'Hearts are is open.'",
        "'speaker_6': 'To all of these future options. So those are the gambles we face. I don't know that we have the votes to pass this tonight, so I don't know that my vote matters. I you know, if you're doing your counting, it's looking like this is not going to pass.'",
        "'speaker_6': 'But I will say to clap if that's the outcome disrespects. The potentially 3 to 500 people who may end up in prison because we did not force a plan. First, we could up here force a plan. We could say, you have six months.'",
        "'speaker_6': 'Give us the plan and tell us D.O.C. how you will house these folks and where you will house them and what you will do. And we could force that. So I don't know whether anyone's interested in finding a path.'",
        "'speaker_6': 'And I know it's hard because I'm speaking last and folks have now staked out their votes and they've gotten their applause. And I very well could vote no on this contract, too, but I don't want any congratulations. If I do.'",
        "'speaker_6': 'If I do, I'm gambling one vulnerable group of people for a symbolic fight that won't actually change the plight that I want to change. And I believe me, I want to do that. I really, really do. But I also don't want to accept that that is my only choice.'",
        "'speaker_6': 'I heard the statement very clearly. Everybody in this room agrees that there could be a plan. The simple disagreement we're having is whether or not it's worth it to take the time to do it, or whether we have to make our statement tonight.'",
        "'speaker_6': 'And it will feel good to make our statement tonight. But then someone else, frankly not us, will be figuring out the mess. No one in this room makes a decision about who gets parole or not. No one. And if we're okay with that, I will stand by the decision of this body.'",
        "'speaker_6': 'But we got to be super honest about who we're playing with here. And we do have a choice. We could assert a different position with this administration. I don't think we can make a motion to delay it. A week and a week wouldn't matter.'",
        "'speaker_6': 'The right people couldn't figure it out in a week. But. We could. We could vote the contract down with a message that a six month contract or some other structure might be possible. Would they accept it? Would they sign it?'",
        "'speaker_6': 'I have no idea. But we have that option. So I am just throwing that out there before, you know, we take our vote to see whether or not we can really live with the decision that it seems like we're headed for tonight.'",
        "'speaker_0': 'Thank you, Councilwoman. Each. See no other comments. I guess that leaves that leaves me as the only one left. I will echo so much of what has been said by my colleagues up here and I will say before I get into the specific issue.'",
        "'speaker_0': 'The. I'm so proud to serve up here with all of you, no matter what your voting or you've said you're voting tonight to sit in this spot and two way representing 55,000 people on an issue that a lot of people want to make, black and white, but is so many shades of gray.'",
        "'speaker_0': 'It's a huge weight. And anyone who has ever accused anyone on this body of having pre-decided or banning the things that have been said in this chamber tonight and all over social media doesn't have a clue. And if you can't hear that from these people, then then you are the one who's already made your mind up and'",
        "'speaker_0': 'is guilty of the things that were accused of the weight of this decision and how everyone up here is weighing it and what their decision is. Does not come down to something that we can clap for or we can shout out and disrespect someone who is the voice of 55,000 people, one significant portion of our population.'",
        "'speaker_0': 'Everyone up here is struggling. Everyone up here is trying to weigh and that is leading people to different decisions. And that doesn't mean that someone is wrong and someone is right. It means that this is hard work. And I appreciate all of the time and all the passion and all the effort of you being here and you'",
        "'speaker_0': 'being a part of this conversation. Forcing this conversation. And are some of our new councilmembers, Councilwoman CdeBaca, by bringing this forward. But that doesn't mean that it boils down to who's wrong and who's right. It is tearing all of us apart.'",
        "'speaker_0': 'If you can't tell that and you can't see that, I'm going to say it. And there are a bunch of people up here who are voting one way who 2 minutes ago were voting the other way. And I don't need to rehash all of the reasons that everyone has said more eloquently than I will about why they're'",
        "'speaker_0': 'voting the way or how they landed on which side of the fence. But to say that I'm grappling and struggling with the same thing. And so this is really difficult for me. One of the hardest decisions in four years that I've had to sit here as and to see a divided council that all really wants the same'",
        "'speaker_0': 'thing and doesn't see a clear path to that solution. There isn't a silver bullet. There isn't an answer. We're here it is. We get to have our cake and eat it, too. We don't. And so we're all going to carry with us.'",
        "'speaker_0': 'We're all going to go home. And we're going to struggle to sleep tonight. We're going to struggle to look at our kids and look at our family members and know the people in our lives were touched on both sides of this.'",
        "'speaker_0': 'So. I just want I just wanted to voice that because I do. I share. Councilwoman, can you just frustration that this is not something to be cheered for? This is not something to be celebrated because someone in here is getting their way of what they think we should do, which should be celebrated, is the way that we'",
        "'speaker_0': 'have deliberated, the way that these people up here have weighed this, put their put themselves out there, stood up and talked when I'm not sure any of us wanted to talk about this as we're grappling with it inside when we're on TV and we're going to be in the news.'",
        "'speaker_0': 'That's what should be celebrated. That's what should be clap for. In the same way that all of you should be thanked for taking the time to be passionate and share your perspective and why you believe we should be doing something that should be celebrated, but not that somebody won because there are a lot of people who lose'",
        "'speaker_0': 'no matter what we do tonight. All that being said, I will jump right now on the bandwagon of.'",
        "'speaker_4': 'I don't know.'",
        "'speaker_0': 'It's not in our power. Right? Our power is we have a contract. It's up or down. We don't get to say, hey, can we come negotiate this? Can we do six more months? Can we do a month to month?'",
        "'speaker_0': 'Can we solve this? Everybody here wants this solved. Everyone here wants to take care of these people. Do a better job taking care of the people. We're in these services while also not spending a dollar, whether it's our money or the state's money on these corporations.'",
        "'speaker_0': 'There's nobody up here who disagrees with that. We all want. That solution is not here and it's not within our power to amend it. You, the citizens of Denver, have given us a city charter that doesn't allow us to do that.'",
        "'speaker_0': 'You've given us a yes vote or no vote. So I am in the camp that says maybe somewhere in there there is a pathway that we don't have the power to do, but people have the ability to do to come back to us with a plan.'",
        "'speaker_0': 'And we could either vote yes and say we are not voting yes. This will be the same body a year from now. We're not voting yes in a year. So you've got a year to figure it out, but we won't let these people fall through the cracks.'",
        "'speaker_0': 'Or we could say we're going to vote no and come back to us with a plan. I don't know if that's reasonable. I don't know if that's possible. So what do we do? And I think at the end of the day, for me it's extremely difficult.'",
        "'speaker_0': 'And this is not a black or white issue. This is 49, 51%. And I think for me tonight, I will and I am asking you, no matter what I say, I don't want any applause. As I said before, I don't think it's appropriate.'",
        "'speaker_0': 'I think tonight I'm a no vote. In hopes that we can get there. And I don't know, maybe I have taken the wrong gamble and now I have to sleep every night knowing that people's lives have been affected in a very real way because of my vote.'",
        "'speaker_0': 'But that's the situation we're in. And right now, that's where I'm at, 51 to 49.'",
        "'speaker_7': 'I have a procedural question.'",
        "'speaker_0': 'It comes we're going to take a procedural question before we go.'",
        "'speaker_7': 'And I want to ask the city attorney. So it's very clear the votes are not here for this to move forward. And we have a contract to accept the funds from the state. So procedurally, unless you all have plans to turn around and file a new bill for a shorter contract, what happens to the bill for the'",
        "'speaker_7': '$18 million that's.'",
        "'speaker_13': 'Already passed.'",
        "'speaker_9': 'Pass?'",
        "'speaker_13': 'It passed all.'",
        "'speaker_1': 'Along.'",
        "'speaker_7': 'Okay. So that would. We'd have to come back and rescind or.'",
        "'speaker_3': 'So from a legal perspective, I think we'll have to figure that up. Now, you've already approved at least one contract that those funds flow to. So we have to accept some of those funds. I don't know. I mean, we're going to have to go back into that conversation.'",
        "'speaker_0': 'That's not something that we can or need to solve tonight. Correct. We do.'",
        "'speaker_7': 'You remember something that we had not already approved it. So we'll just have to focus.'",
        "'speaker_0': 'On the outcome here. We will have to revisit that. Okay, Madam Secretary, and remember, councilmembers, we are voting separately on these two. We are not going to entertain comments. We are just going to vote through on 73/1 and then 74.'",
        "'speaker_0': 'So, Madam Secretary, roll call on Council Bill 673.'",
        "'speaker_1': 'CdeBaca No.'",
        "'speaker_9': 'Black Flynn.'",
        "'speaker_3': 'Gilmore No.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_4': 'Hines no.'",
        "'speaker_1': 'Cashman. Sorry. Kenny Ortega.'",
        "'speaker_7': 'A reluctant I.'",
        "'speaker_1': 'Sandoval. Sawyer. No. Torres. No, Mr. President.'",
        "'speaker_0': 'No. I'm secretary. Please close the voting. Announce results.'",
        "'speaker_1': 'So eight days for ice.'",
        "'speaker_0': 'It is for ice. Council Resolution 673 has failed. Councilman Flynn, will you please for council resolution 674 on the floor?'"
    ]
}