{
    "A proclamation in observance of the Third Annual Indigenous Peoples Day in the City and County of Denver.": [
        "'speaker_0': 'Thank you, Councilman Brooks. Seeing no other announcements, we are going to move on. There are no presentations this evening and there are no communications. But we do have two proclamations. Councilman Lopez. I think the first one up is yours.'",
        "'speaker_0': 'Would you like to read the proclamation? 1154.'",
        "'speaker_8': 'Yes, Mr. President. Thank you. Proclamation 1150 forces of 2018 and observance of the third annual Indigenous Peoples Day in the city and county of Denver. Whereas the Council, the city and county of Denver recognizes the indigenous people have lived and flourished on the lands known as the Americas since time immemorial, and that the Denver that Denver and'",
        "'speaker_8': 'the surrounding communities are built upon the ancestral homelands of numerous indigenous tribes, including the southern, the new mountain ute tribes of Colorado. And. Whereas, the tribal homelands and seasonal encampments of the Rapido and Cheyenne peoples along the banks of the Cherry Creek and South Platte River confluence gave bearing to future settlements that would become the birthplace of'",
        "'speaker_8': 'the Mile High City. And. Whereas, Colorado encompasses ancestral homeland of 48 tribes, and the city and county of Denver and surrounding communities are home to descendants of approximately 100 tribal nations. And. WHEREAS, on October 3rd, 2016, the Council, the city and county of Denver unanimously passed council bills 16 Dash 801 officially designated in the second Monday of'",
        "'speaker_8': 'each year as Indigenous Peoples Day in Denver, Colorado. And. WHEREAS, the Council of the City and County of Denver continues to recognize and value the vast contributions made to our community through indigenous peoples knowledge, science, philosophy, arts and culture.'",
        "'speaker_8': 'And through these contributions, the City of Denver has developed and thrived. And. Whereas, the Indigenous communities elected and appointed tribal, local officials, community leaders and educational leaders are vital components to the community awareness issue visibility, education, informed decision making, and supporting students in developing greater connections between science and indigenous communities.'",
        "'speaker_8': 'And. Whereas, this year, Indigenous leaders of all types from across the country will gather here in Denver beginning on October 21st for the 75th Annual National Congress of the American Indians Yearly Meeting to discuss specific issues affecting indigenous communities relevant to Denver and throughout the country, including continued advocacy for public lands as monuments, protections for the benefit'",
        "'speaker_8': 'of all individuals now therefore being proclaimed by the Council of the City and County of Denver, Section one. The Council, the City and County of Denver celebrates and honors the cultural and foundational contributions of indigenous people to our history.'",
        "'speaker_8': 'Past, present and future. And continues to promote the education of the Denver community. Of the about these historical and contemporary contributions indigenous people section to the city and county of Denver, Colorado does hereby observe October eight, 2018 as Indigenous Peoples Day.'",
        "'speaker_8': 'Section three at the clerk of the city and county of Denver shall a test and affixed a seal of the city and county of Denver to this proclamation, and that a copy be transmitted to the Denver American Indian Commission and the Colorado Commission on Indian Affairs.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Your motion to adopt.'",
        "'speaker_8': 'Mr. President, I move that council proclamation 1154 series of 2018 be adopted.'",
        "'speaker_0': 'It has been moved and seconded comments by members of council. Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. I you know, it's awesome to be able to read this proclamation for the third time while actually that the third time is Indigenous Peoples Day, the fourth time as recognizing the support for it. You wouldn't have known this but about.'",
        "'speaker_8': 'Seven or eight. I'm out 8 hours ago. Just down the street on I 25. I was in the town of Pueblo. And I was having homemade fry bread in this in this pueblo, in this ancient home. Right. And I was drinking Cafecito, and I was drinking that New Mexico coffee.'",
        "'speaker_8': 'And I was talking about how Colorado chilies better than New Mexican chili and Pueblo. Anyway, bourbon's. Meatier, but it's better. And. She tells me, Oh, you know, that it's Indigenous Peoples Day. I said, I didn't know that. You see, I took my daughter over the weekend to find our great grandmother's, her great grandmother's grave and little town'",
        "'speaker_8': 'of when I was done in New Mexico. Nobody knew or knew where I was at. We just went word of mouth and we found it. And to see my my daughter there, powerfully standing over her, her grave and given her thanks, was powerful for me.'",
        "'speaker_8': 'And we went to the Pueblo. We're reading. And so she says, yes, did you know that? And I said, I did know that she was. How did you know that she was? I'm from Denver. She goes, That's right.'",
        "'speaker_8': 'You all have Indigenous Peoples Day. She goes, Congratulations. I didn't say a word about oil. Well, we had a little something to do with it. But just to know that in an end and in a place like the Pueblo, like the Taos Pueblo, in a little home made of Adobe, of original adobe earth and hay, to know'",
        "'speaker_8': 'that this woman who was making fry bread that was super the. Knew about what we did in Denver and how much it meant to her. And she says, we also are asking for our state to recognize that. We recognize that, but we're asking for our state.'",
        "'speaker_8': 'And we heard about Denver, and we we were so happy, she said. And we got tears in her eyes and saw the know that our impact is not just in our community and our city here in the Mile High City, but far and wide.'",
        "'speaker_8': 'Right. And even just down this little street, none of the south. It's an inspirational and it's a it's a badge of honor and pride. So I wanted to share that with my colleagues here and with you all in the council chambers, because I felt that that was powerful.'",
        "'speaker_8': 'We didn't mean to stay another day. It was by accident. We ended up staying another day, but not for me did it. And so I'm glad I made it just in time. Denver traffic to be here and read this.'",
        "'speaker_8': 'So thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Lopez. And thank you for bringing this forward again this year. Madam Secretary, roll call.'",
        "'speaker_1': 'LOPEZ. Hi. Brooks.'",
        "'speaker_9': 'Hi.'",
        "'speaker_4': 'Espinosa. Hi. Flynn, I. Gilmore, i. Herndon, I. Cashman. I can.'",
        "'speaker_1': 'Teach. I knew. Ortega. Hi, Mr. President.'",
        "'speaker_0': 'Madam Secretary, please close voting and announce the results.'",
        "'speaker_1': 'Ten days at sea. We're waiting for Ortega.'",
        "'speaker_7': 'I went to push it and it disappeared from my screen.'",
        "'speaker_1': 'Here we go. 11 Eyes.'",
        "'speaker_0': '11 Eyes. Proclamation. 1154 has been adopted. Councilman Lopez, is there anyone you'd like to bring up to accept the proclamation?'",
        "'speaker_8': 'Yes, there is. But before that, I want to make sure that I acknowledge and Susan Ranta, who is in my office, is in my mind. I had in my office my brother, who worked so hard every year to make sure this happens, at least from our own, to work with our commission.'",
        "'speaker_8': 'So thank you, Jesus, for your work and thank you for helping coordinate and organize this so and helping write the proclamation. So I wanted to invite the following individuals Kimberly Malek, Lucille Echo Hawk, Donna Christian, Chinua Cross, who?'",
        "'speaker_8': 'Paterson and Christina Badkhen and Lance Soucy to the microphone.'",
        "'speaker_1': 'Thank you. Councilman Lopez. Thank you. City Council President Clark. We'd like to introduce ourselves where the Denver American Indian Commission. And we also have a representative from the Colorado Commission of Indian Affairs today to accept the proclamation recognizing tribal leaders and the vitality and awareness that tribal leaders, community leaders, cultural leaders, educational leaders and economic leaders bring'",
        "'speaker_1': 'to our community, to Denver, to the front range and to the nation. And so with that, I'd like to take just a few minutes and allow my fellow commissioners to introduce themselves, as well as provide a small and a brief profile on some of our our community leaders.'",
        "'speaker_1': 'Before I do that, I'm again Kimberly Valle. I'm Eastern Shoshone, just like Sara or Tegan. And I'm also Oglala Sioux from South Dakota. Thank you. Okay. Hello. Me Diana Cousineau, a crochet Patterson, an adult book doe from Blackfeet Nation.'",
        "'speaker_1': 'I. First of all, I'd like to tell you about one of the mayors diversity and inclusion award and the member that we, the commissioners, decided to choose for this year's award winning. His name is Bill William Tarbell. He is a Cheyenne.'",
        "'speaker_1': 'And so, as you know, we're here on Cheyenne's land. Bill Tarbell has been doing much, many amazing things in the community with our Denver public schools, with committing community members from all different nations and tribes. And one thing in particular that you may or may not know is that he's been working with Denver Parks and Rec and'",
        "'speaker_1': 'with the city. The city gifted our indigenous community with a bison. And Bill was able to arrange a meeting with Denver public school students, with community members, with Parks and Rex members, and with the city to harvest that bison and to do it in a traditional way.'",
        "'speaker_1': 'So he was he deserved the reward this year. And thank you. We talk GAAP you Hotlanta which did not pay to use AP you much AP Donna Christian C John Gounod dinner. Thank you very much. I agree to with a heartfelt handshake.'",
        "'speaker_1': 'Thank you for honoring indigenous people day today. Thank you very much. I would like to acknowledge all the educators in the room, the two that are on our on our commission as well. And I would also like to do a special acknowledgment to Denver Public Schools for chartering the first school to integrate indigenous knowledge and principals this'",
        "'speaker_1': 'year in May. So thank you. Yeah.'",
        "'speaker_9': 'Got a Shaolin associate, a killer Chinese culture. But she's been teaching you just now. Let's go to China. Hey.'",
        "'speaker_10': 'Hey, everyone. My name's Lance Soucy.'",
        "'speaker_9': 'I've been on the commission now for two years. I'm a graduate from the University of Denver. I work now for an educational organization called Big City Mountaineers. And I just want to say thank you all for acknowledging Indigenous Peoples Day.'",
        "'speaker_5': 'Today on this beautiful fall and Denver Day.'",
        "'speaker_9': 'I also want to highlight one of our amazing community members. Her name is Dana Sultan. She's the executive director of the Rocky Mountain American Indian Chamber of Commerce. And she has been working diligently to support our American Indian community by raising money to support students who identify as American Indian or Native American or indigenous to basically support'",
        "'speaker_9': 'them with their educational endeavors. And so she works really hard to get scholarship money for our young youth to pursue their dreams in education. And I just really want to highlight this beautiful.'",
        "'speaker_10': 'Amazing person from our Native American community.'",
        "'speaker_9': 'So thank you.'",
        "'speaker_1': 'Hi. I'm Christine. About hand. I'm Chicago, Lakota and Cherokee. And I'm here to introduce Lucille Echo. Hank. Well, let her come and speak her words to you guys. Thank you, Christina. And it's an absolute pleasure to be here this evening.'",
        "'speaker_1': 'And it's been many years since I've had the pleasure of being in the council chambers with the Denver City Council. And I'm pleased to know that I still know two council members, Councilman Lopez and Ortega. So good to see you both.'",
        "'speaker_1': 'I'm a citizen of the Pawnee nation of Oklahoma, but I've also resided in greater Denver for more than 37 years. I'm starting to feel old. I am in my fourth term as a member, At-Large member of the Colorado Commission of Indian Affairs.'",
        "'speaker_1': 'I served many years ago under Governor Romer's administration or one of them, and I am delighted that they asked me to come back under Governor Hickenlooper's administration to continue the work of the Colorado Commission and the new two pairs that was founded in 1976, and to support the great work of EARNEST House Junior, our executive director, who'",
        "'speaker_1': 'sadly just left us. But he's still going to continue in Denver with the Keystone Policy Center, but will be seeking a new executive director for the account for the commission. And we've just done so much, thanks to Ernest.'",
        "'speaker_1': 'And most recently, a week ago Friday at our meeting in Ignacio, hosted by this other new tribe. The commission, through its member agency, the Colorado Department of Education, presented to the two Ute tribes the first copies of a new curriculum for fourth graders about the peoples of Colorado.'",
        "'speaker_1': 'And we were just. And I hope it's the first piece of well-researched and documented native history that the next step would be to delve into the history of the Arapaho peoples who were here along this this front range, and other native peoples, the Cheyenne as well.'",
        "'speaker_1': 'There's so much that needs to be known by Colorado's young people as they grow into adulthood. I was asked to say a few words and thank you, Councilman Lopez, in reading the resolution to speak about the National Congress of American Indians that will be meeting here the week of October 21st.'",
        "'speaker_1': 'The organization was founded here 75 years ago at the Cosmopolitan Hotel, which, of course, no longer exists in downtown Denver. And so we in the native community here in particular are just thrilled that the organization is coming back to commemorate its 75th anniversary and to recognize its founders.'",
        "'speaker_1': 'And if you look on the website of the National Congress of American Indians, there is a photo of the founders, some of whom are their descendants, will be here to help commemorate this 75th anniversary. It's been a lot of work, but my pleasure to work with many others here in Greater Denver to support the National Congress, which'",
        "'speaker_1': 'is headquartered in Washington, D.C., to put together their conference where what we call the Denver based local planning committee supporting the many tribal leaders in this region of the country who will host the the the conference. But Denver City and County's own Darius Smith is one.'",
        "'speaker_7': 'Of those people who stepped up.'",
        "'speaker_1': 'And has been very, very helpful to us and many other members of the community. What is it they say? If you want something done, ask a busy person. So we've all been very, very busy, but we're looking forward to the conference.'",
        "'speaker_1': 'It will be at the Hyatt Colorado Division, Colorado Convention Center. So thank you very much. We are very moved that this is the third Indigenous Peoples Day in Denver. Yesterday I was privileged to be in Boulder and be a part of their celebration and and then to read that there were at least four other cities in Colorado'",
        "'speaker_1': 'that celebrate Indigenous Peoples Day, Aspen, Telluride, and I can't remember the other ones, but and other cities across the country are following suit as well. So we as native people are are much appreciative and applaud their efforts. So thank you very much for having me this evening.'",
        "'speaker_0': 'Thank you. Thank you all very much for being here.'",
        "'speaker_3': 'Thank you, Chuck.'"
    ],
    "A proclamation in recognition of Francisco Cisco Gallardo and his work reducing gang violence in Denver.": [
        "'speaker_0': 'All right. We do have one other proclamation this evening, Councilman Lopez. It looks like it's yours again. Will you please read Proclamation 115, six?'",
        "'speaker_8': 'Yes. Thank you, Mr. President. Proclamation 1156 Series of 2018 and Recognition of Francisco, Cisco Gallardo and his work Reducing Gang Violence in Denver. Whereas Francisco, Cisco, Gado and his two siblings were raised in North Denver by a single mother after their parents divorced when he was three years old.'",
        "'speaker_8': 'And. WHEREAS, as a young adolescent, Sisqo found himself spending the majority of his time with his friends. The small radio clique rapidly escalated into a violent life of deadly rivalries between Denver neighborhoods. Which saw him losing friends to death in prison.'",
        "'speaker_8': 'And. Whereas, at age 18, he was facing 48 years in prison, ultimately sentenced to a community corrections program where he decided to regain control of his life. And help others avoid the path that he was on. Through a philosophy of Kaltura Gouda translation is culture cures.'",
        "'speaker_8': 'And. Whereas, Cisco built on this philosophy creating a model of how gang members can change their lives by redefining three words respect. Power and pride, redefining the philosophy and models into actions by founding and publishing two positive, viral youth oriented magazines and founding the nonprofit organization Warrior Warriors.'",
        "'speaker_8': 'The Aslan, which dealt with Chicano issues in the political sphere and where Siskel is currently the program director of the Gang Rescue and Support Project Grasp a Gang Intervention and leadership nonprofit that works with Denver area youth involved in the gang activities or in danger of joining a gang.'",
        "'speaker_8': 'And where Cisco's presence, leadership and life's work to heal his community from generational trauma by diverting thousands of individuals from joining while helping active members leave gang activity has efforts have been recognized locally, nationally and internationally, as he has been invited to dozens of speaking engagements about his experiences and rode out of gang life to personal success'",
        "'speaker_8': '. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Council of the City and County of Denver recognizes the importance of reducing gang violence in Denver and how both active and former gang members can play an active role in eliminating gang violence in our communities.'",
        "'speaker_8': 'Empowering those that want to turn their life around by becoming a positive influence. Section two at the Clerk of the city and county of Denver. Solid test and affects the seal of the city and county of Denver to this proclamation and that a copy be transmitted to Francisco Cisco.'",
        "'speaker_0': 'I thank you, Councilman Lopez. Your motion to adopt.'",
        "'speaker_8': 'Mr. president, I move that proclamation 1156 series of 2018 be adopted.'",
        "'speaker_0': 'It has been moved and seconded comments by members of council. Councilman Lopez.'",
        "'speaker_8': 'Thank you, Mr. President. It is. Long overdue and with great pride that I read this proclamation in this council chambers to honor a mentor. A friend. A brother. In an era in our community an unsung hero. And Cisco got out of the.'",
        "'speaker_8': 'I met Cisco when I was on the Aurora campus. And I was completely intimidated by this guy, man. Big dude goatee. Glasses and loud. His voice was loud and I thought he was screaming at us when I first met him.'",
        "'speaker_8': 'But he wasn't that just his voice? And he spoke about empowerment. He spoke about culture. He spoke about identity and how that was important to us. As a community. He spoke about community work, community organizing.'",
        "'speaker_2': 'And he.'",
        "'speaker_8': 'Spoken to himself as being a Chicano and being of an indigenous man. As a. As a. As a. As a badge of pride. And that for me was a big turning point in my life. And personally, my story, I could say, is not unique.'",
        "'speaker_8': 'Because a lot of people can say that about Cisco Guy. You know, Siskel and is right here in front of us. And I'm going to address you, Siskel, personally. My daughter. Doesn't know. About what color she doesn't know is that she's not allowed to wear.'",
        "'speaker_8': 'She's not allowed to wear or she's not she's allowed to wear any color that she wants to. In any neighborhood that she walks in. She's allowed to wear a Denver Broncos shirt if she wanted. In my neighborhood. She's allowed to wear her home colors.'",
        "'speaker_8': 'She's allowed to wear whatever shoes she can that she chooses to wear. Without being threatened for her life. She's allowed to walk in whatever neighborhood. In this city without being. Feared for for at least. Being killed because of her tennis shoes or her jacket.'",
        "'speaker_8': 'I had to explain to her what it was like as a young man growing up in the West Side. And getting jumped because you wore the wrong color on the wrong day. She doesn't know that. I had to explain about watching coming back from homecoming at West High School in 1996 because a young man shot in front'",
        "'speaker_8': 'of North High School. Point blank in the chest. And our pep rally turned into the saddest pep rally we've ever had in our school campus. Cisco going out of all. You are. One of the reasons why she doesn't have to live in that kind of fair man.'",
        "'speaker_8': 'And I want to say thank you. You know, I know for some families it's still hard and still it's hard to say goodbye for them. But I know I write this proclamation and we pass this proclamation, Cisco, because you don't celebrate yourself and we all know of your work.'",
        "'speaker_8': 'You're a humble man and you've been doing this work quietly in this city at the we our standing. You and your compadres with grasp and your your. And the other folks who are who are who play the same role in healing our community.'",
        "'speaker_8': 'You stand at that red tape and that that yellow tape and those police lines when we're fast asleep and not even realizing what happened that night and only hear about it on the news the next morning. You prevent the retaliations?'",
        "'speaker_8': 'Your work is work that we are all grateful for. And then we know that there will be, unfortunately, times where. You know, we'll have those same kind of conversations that we did before, but we know that at least we have a great leader in our community, in our midst that has it's worked and continue to work.'",
        "'speaker_8': 'And I wanted to give you a thanks and make sure that we honor you and other folks on the city council to say the same thing in a way that and that the city does. And that's true. The city council does, and that's true by form of a proclamation.'",
        "'speaker_8': 'So I wanted to say thank you, Cisco, from the bottom of my heart as my hermano and knowing that a lot of money, there's a lot of families, a lot of mothers are sleeping in peace, knowing that their kids are home safe in their homes, doing their homework because of you.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Lopez. Councilwoman Cannick.'",
        "'speaker_1': 'Thank you, Mr. President. It's with great humility. I follow that story because my experience with you is a different aspect, which is about you getting involved civically. And so I don't know if you remember this, but seven years ago, probably shortly after I got elected, I think the new chief allowed us all and the council to give'",
        "'speaker_1': 'him an appointment, I think it was to interview commanders. And I felt like it was important to have a voice from someone who might have had more challenging experiences with the police or come from a background that might be different than the shoes that I walk in and that the shoes of maybe the people I knew.'",
        "'speaker_1': 'And so I asked around and I said, who should I appoint to this? Who would never get appointed to something like this ordinarily? And your name came up twice from folks who said, here's someone who at that point was already working a little bit with the police department, but also had had experiences in the community where there'",
        "'speaker_1': 'had been breakdowns in trust. And I think both perspectives were really important in choosing those commanders. And so I remember getting a very interesting nod from the first person from the police department when I gave them your name.'",
        "'speaker_1': 'But there was respect. They were surprised. Just like I had asked. I said, I want to appoint someone. No one will, you know, not the usual suspect. But there was a respect in there. Nod like that. That's a really good choice.'",
        "'speaker_1': 'He's going to bring a really interesting perspective. And and all the reports were about how constructive and how helpful you were to that process. And if I'm not mistaken, I don't think it was in the proclamation, but I think you later went on to serve on the Citizen's Oversight Board as well.'",
        "'speaker_1': 'Another important role, again, working with our police department and our safety departments is important, but also understanding the challenges that sometimes happen and the need for community trust. So I want to thank you for the ways that you've been involved beyond just your your work at grasp and beyond just your work with gang prevention.'",
        "'speaker_1': 'I think we were all touched when you gave the blessing to our new chief. And I think just the visibility in saying, I believe in this city, I'm going to invest my time in committees and meetings, and there's a lot of demands to do that kind of involvement.'",
        "'speaker_1': 'And I just want to say thank you for stepping up and going beyond even just this calling that you have on the streets, but also to being engaged inside the building, because that to me is is really where change happens.'",
        "'speaker_1': 'It's bringing the outside streets into the institution. And you've done that. And so I want to thank you and I want to thank Councilman Lopez for bringing this forward.'",
        "'speaker_0': 'Thank you, Councilwoman, to Councilman Ortega.'",
        "'speaker_7': 'Thank you, Mr. President. First, I don't know how I missed this, but I want to make sure that my name is added to the proclamation. And I just want to share some personal experiences in having worked with Francisco.'",
        "'speaker_7': 'Cisco, as we all know you over the years, when I served as the District nine Council person, we worked very closely on a number of gang related issues in both the North Side and the West Side. And this was a time when I believe it was under President Bush.'",
        "'speaker_7': 'They wanted to create the weed and seed program. And a lot of people in our community did not want the program because they felt like we had not had this great working relationship between the police and community. And a lot of families felt like this would give even more power to the police department to harass our youth'",
        "'speaker_7': '. And I remember standing up at a large public meeting saying, I, for one, am tired of seeing our kids laid to rest and being put, you know, locked up. We need to do something that brings our community together and really works towards, you know, building that bridge between police and community.'",
        "'speaker_7': 'And Francisco was one of those people involved in the trenches. And we had numerous community meetings that brought community together. I mean, I can remember in the Baker neighborhood, people couldn't sit out on their front porch because of the gang warfare that was going on.'",
        "'speaker_7': 'We actually had a woman who was killed inside her home. She lived across the street from one of the gang members, and she was home with her five year old daughter. And her daughter had to run to a business half a block away to get her aunt to tell her that something happened to her mother and she'",
        "'speaker_7': 'died. But, you know, it was the the work that was done with organizations like Grasp, bringing community together and really working, rolling up our sleeves, working side by side, utilizing the resources that the weed and seed program brought to the table to hire community people, to do programs in our neighborhoods, and to give youth some viable options'",
        "'speaker_7': 'of things to do and to. Ensure that they weren't being only attracted to the the I don't know what's the word I'm looking for, not companionship, but the belonging, that sense of of, you know, having a place where you were welcome and recognized, but being able to do that with some some options.'",
        "'speaker_7': 'The curfew program was one that you were very much involved with that also ensured that our kids were not on the streets late at night, so that they had you know, they were being brought in and picked up by their parents.'",
        "'speaker_7': 'They were they were brought to some of our recreation centers so that they couldn't be out getting in trouble and being some of those statistics that were horrific during that summer of 92, when when we saw Flint Martinez, the young man that Councilman Lopez talked about, who happened to be a neighbor of my family's, he lived across'",
        "'speaker_7': 'the street from us. And to learn that it was somebody that close to home. And, you know, for parents and siblings who experience this every day and and colleagues of some of these folks, it it was very real.'",
        "'speaker_7': 'And to recognize how far we have come in building those bridges with community and our police department doesn't mean to say everything's perfect. We still have work to do, but we have come a long way in in building those bridges across this city, in ensuring that we're giving viable options to our young people.'",
        "'speaker_7': 'So, Francisco, I want to thank you for all of your work for being in the trenches. I can remember taking kids on a camping trip. This was one of the very first overnight camping trips in the mountains that the city actually approved.'",
        "'speaker_7': 'I can't think of the campsite a by chief host, a lodge that now has the ropes course and all kinds of other things that invites youth up there. But the Department of Military Affairs with the state of Colorado was was very involved in providing tents.'",
        "'speaker_7': 'And we raised the money for the food and for kids. And in the neighborhoods this hit for most of them, this had been their first time ever in the mountains. They could see them from here, but most of them had never been in the mountains.'",
        "'speaker_7': 'And it was such a incredible experience for them. And so, you know, it took people like Francisco just being there and being one of those constant players that just said, I'm going to roll up my sleeves because I'm committed to making a difference for these kids in our community.'",
        "'speaker_7': 'And you have done that year after year after year. And thank you. God bless you for all your work.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Brooks.'",
        "'speaker_9': 'Thank you, Mr. President. Thank you, Councilman Lopez, for bring this forward Sysco. Appreciate you. Appreciate your leadership in this city and in there has been way too many vigils that we both have been on. But I just appreciate your spirit.'",
        "'speaker_9': 'You know, in a in a city that's experienced in violence and when there's no answer at a vigil, you bring this amazing sense of healing. And that's special. And that's because you're called to this work you've been called out of.'",
        "'speaker_9': 'That violence and into healing. And I think what's so powerful about that is you invite other young people to that same path. And so I just want to thank you for that. And I also want to thank you for I think it's easy to stay in your own neighborhood.'",
        "'speaker_9': 'What you're comfortable with, I think, is really hard to cross over in other different neighborhoods. And I've seen you in several neighborhoods at different vigils, which is really hard for some from folks that identify with certain neighborhoods. And so I just appreciate you crossing over, man.'",
        "'speaker_9': 'And and now today we honor you, brother. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Brooks. And thank you, Councilman Lopez, for bringing this word. Madam Secretary, roll call Lopez.'",
        "'speaker_4': 'Hi, Brooks Espinosa. Hi, Susan. Hi, Gilmore. Herndon. Hi, Cashman. Hi, Carnage.'",
        "'speaker_1': 'I knew Ortega. Hi, Mr. President.'",
        "'speaker_0': 'Hi. Madam Secretary, please close voting in the results.'",
        "'speaker_1': '11 Eyes.'",
        "'speaker_0': '11 Eyes Proclamation 1156 has been adopted. Councilman Lopez. Is there somebody you'd like to bring up?'",
        "'speaker_8': 'Yeah, I'd like to bring up my brothers. Francisco, Cisco got out of the. If you want to come to the microphone and whoever else you want to bring up with you.'",
        "'speaker_2': 'Well, I just want to say thank you to each and every one of you. I brought my mom up here. Even though I might have been crazy. She was trying to do our best to keep me in check when I was younger.'",
        "'speaker_2': 'And, you know, I. But she's also it's a part of me, you know, even when I was doing bad, she tried to help me. And and since I've been doing good, she still helps me. And so I just want to thank you thank you, Paul, for your words.'",
        "'speaker_2': 'And, you know, I'm really proud of you as well, for all the work you've done and and and Debbie for your continued support, you know, even your counseling when I was still actively gangbanging. And I remember that as well, you know, way in those days.'",
        "'speaker_2': 'And and I really appreciate you and and the leadership, you know, that you provided and a mentor for me to just watching you do your thing and and proving that Chicanos are Chicanos can do anything, you know. And that's what I really wanted to, you know, say to you, I really appreciate you.'",
        "'speaker_2': 'And and and same with, you know, the rest of the council. Council and Brooks, too, for your work in the East Side and other parts of our neighborhoods, you know, each and each and every one of you, you know, gangs is one of those things that doesn't really care where you are, doesn't care if you have a'",
        "'speaker_2': 'green card or not. It doesn't care if your family has money or not. It's one of those things of what will you give up for? Popularity, you know, comes down to risk and benefit. And when you feel you don't have anything, there's a big benefit for being in gangs, you know?'",
        "'speaker_2': 'And and I just I realize, you know, when I was facing all that time in prison and going through all those hard times, you know. There. I knew that there was hope because I had people in the community, you know like just for the record to talk about need to Gonzalez and and Ron Picasso he was works'",
        "'speaker_2': 'for parks and rec for many years retired from there Jerry is where I worked at Uslan Recreation Center and I grew up in northwest Denver. And I always talk about how the communities, the people in my community, they didn't let me fall.'",
        "'speaker_2': 'I tried to do my best to ruin my life, but they wouldn't let me. And so I've been trying to repay back that ever since. So, you know, also through the work of other people within the city, you know, they helped me and I tried to repay that back with all these, you know, trying to do with'",
        "'speaker_2': 'years of service. But, you know, that's all I want to say. So I to give my mom a chance if she wants to say no, this is kind of sad, but you never know.'",
        "'speaker_1': 'Thank you to everybody. And. For helping my son. I love him. I'm the want to love him no matter.'",
        "'speaker_4': 'What you do. And he's doing good. So I feel proud. Think this is thing? Yes. Thank you.'"
    ],
    "A bill for an ordinance changing the zoning classification for 3600 West 29th Avenue in West Highland. Approves an official map amendment to rezone property located at 3600 West 29th Avenue from U-SU-C to U-MX-2x (urban, single-unit, to urban, mixed-use) in Council District 1.  The Committee approved filing this item at its meeting on 8-21-18.": [
        "'speaker_0': 'Council is reconvening and we have three public hearings this evening. Speakers will have 3 minutes unless another speaker has yielded his or her time, which would result in a total of 6 minutes. Speakers should begin their remarks by telling the council their names, their cities of residence, and if they feel comfortable doing so, their home addresses.'",
        "'speaker_0': 'If you are here to answer questions only when your name is called, please come to the podium. State your name and note that you are available for questions of counsel on the presentation monitor. On the wall you will see your time counting down.'",
        "'speaker_0': 'Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilman Brooks, will you please put Council Bill 874.'",
        "'speaker_2': 'On the floor?'",
        "'speaker_9': '874 be placed on the floor.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Constable 874 is open. May we have the staff report?'",
        "'speaker_10': 'Thank you. Council, president and Council. My name is Brandon Shaver with Community Planning and Development, presenting an official Map Amendment application to 18 i0024, which would result in property at 3600 West 29th Avenue from U.S. C to um x to x.'",
        "'speaker_10': 'This property is located in Northwest Denver Council District one. It is actually in Beverly in the Sloan Lake neighborhood. Uh, location is just at the southwest corner of Lowe Boulevard and West 29th Avenue. It is just over 10,000 square feet and is currently a vacant one story building that was formerly occupied by a gas station.'",
        "'speaker_10': 'And the proposal here is to allow for redevelopment with commercial uses. The zone district request is the um x2x that is an urban neighborhood context mixed use two storey maximum and the x two notes, limited uses and building forms.'",
        "'speaker_10': 'Current zoning at the site is as you see, that is urban neighborhood context single unit C lot size which is 5500 square feet. You find this zoning to the south and to the west of the subject property to the north we have campus zoning in the form of C, NPI two and to the east we have two'",
        "'speaker_10': 'unit zoning with the C lot size as well as the current land use on the site is commercial retail as it was formerly a gas station. And what you have surrounding here is generally single and multi-unit residential. To give you a flavor of what is around the site.'",
        "'speaker_10': 'Looking at the top left, we have a couple of single unit residential properties across the alley. On the bottom left, you can see the campus that is to the north and moving to the right, we have two pictures of the subject property.'",
        "'speaker_10': 'And then on the bottom right, a picture of the single unit residential that's directly abutting to the south. Speaking to the process here, this item was that planning board on August 1st where it was voted unanimously in favor.'",
        "'speaker_10': 'It then went to Judy on August 21st. And we are at council today and October 8th. And to date we have received four letters of support, one being from the registered neighborhood organization, which is the West Highland Neighborhood Organization.'",
        "'speaker_10': 'And we have also gotten three letters of support from the nearby property owners. This includes the property owner directly to the south and the property owner directly across the alley to the west. You're familiar with the review criteria.'",
        "'speaker_10': 'Staff has to find that a proposed rezoning meets all five in order for us to recommend approval. Starting with number one, we have consistency with adopted plans and two plans impact this area first comp plan and then blueprint Denver for comprehensive plan 2000.'",
        "'speaker_10': 'You see these noted strategies that are further detailed in the staff report. They speak mainly to environmental sustainability, promoting quality infill and giving residents in the neighborhood opportunities to live, work and play within their neighborhood. The Blueprint Denver land use concept here is single unit, single family residential.'",
        "'speaker_10': 'In these areas there is an employment base, but it is significantly smaller than the housing base. And single family homes are the predominant residential type. This is also in an area of stability. These areas are seeking to maintain the character while accommodating some new development at appropriate locations.'",
        "'speaker_10': 'And Blueprint also says that the land use regulation should aim to prevent or mitigate impacts from nonresidential development. And that is why staff has become comfortable with the application of a, um to zone district here with those lower scale uses and intensities.'",
        "'speaker_10': 'And lastly, the street classifications and blueprints, both Lower Boulevard and West 29th Avenue are residential collectors next? Uniformity of disregulation staff feels that this proposed rezoning will result in the uniform application of the Max to Zone District, and it will further the public health, safety and welfare by implementing adopted plans.'",
        "'speaker_10': 'This application identifies changed or changing conditions as justifying circumstances. I'm sure you're aware that there are a number of new residential units in the area, particularly at the commercial node at 32nd and Lowell, which is just three blocks north of the subject site.'",
        "'speaker_10': 'And we have also noted new bike lanes have been installed from Sheridan into downtown along 29th Avenue. And lastly, consistency with neighborhood context, zone, district purpose and intent. This does fit the urban neighborhood context where usually we see single and two unit residential uses with small scale multi-unit and commercial units that are commercial areas that are embedded'",
        "'speaker_10': 'in these residential areas and the um, max zone district purpose and intent. It does apply to these small sites that are embedded within existing neighborhoods and limited to the lower scale building forms and uses. With that, CPD recommends approval based on finding that all review criteria have been met.'",
        "'speaker_10': 'I'm happy to answer questions. An applicant is present as well.'",
        "'speaker_0': 'Thank you very much. We do have two individuals signed up to speak this evening, so if you signed up to speak on this item, might ask that you please come up to this first bench. I'll call your name and then you can step up to the podium and your time will start.'",
        "'speaker_0': 'First up, we have Reed Goolsbee.'",
        "'speaker_2': 'I'm the owner of the property, so I filled out the card for any questions that you may have. Could you introduce yourself? Reed Goolsby I live at 2440 Mead Street in Denver.'",
        "'speaker_0': 'Thank you very much. All right. And next up, we have Jesse Paris.'",
        "'speaker_11': 'Good evening, members of council. My name is Jesse Pearce. I am representing four Black Star Action Women for Self-defense in Denver Homicide Law, and I'm also a At-Large candidate for office in 2019. This neighborhood, West Highland, is undergoing rapid gentrification.'",
        "'speaker_11': 'Like many areas of the city continue gentrification in the already heavy Lee gentrified area. On this Indigenous Peoples Day, where we are denouncing colonialism and colonialists like Christopher Columbus, you want to allow colonialism in indigenous neighborhoods, in areas of the city in the midst of a housing crisis.'",
        "'speaker_11': 'You want to change the urban single unit to mix youth who will occupy this reason property and what is the army level? That is my question. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council? Councilwoman Ortega.'",
        "'speaker_7': 'I just wanted to ask the applicant what your plans are to do with the property. If you can come to the microphone, please.'",
        "'speaker_2': 'So I initially worked with the West Highlands Neighborhood Association to kind of get an idea or feel for what, you know, the people in the neighborhood would like to see there. It's been vacant as far as I remember.'",
        "'speaker_2': 'I've been in the neighborhood since 2005 and it's been one of the few remaining rundown properties left in the neighborhood, actually vacant for the last three years. But we've kind of been back and forth a few times. And what we have proposed and kind of come to an agreement on with the West Highlands Neighborhood Association was a'",
        "'speaker_2': 'mixed use building of first floor retail, second floor office space. With that will also meet the parking requirements that come along with that.'",
        "'speaker_7': 'So not utilizing the existing structure but correct.'",
        "'speaker_2': 'Yeah, the existing structures is beyond repair at.'",
        "'speaker_7': 'This point and it's very small.'",
        "'speaker_4': 'Yes. Okay.'",
        "'speaker_7': 'Thank you. I have no further questions.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega. Seeing no other questions. The public hearing for Constable 874 is closed comments by members of Council and Councilman Espinosa.'",
        "'speaker_5': 'Well, no, I just obviously this is the exact right zoning for this context and you don't get any more minimal mixed use zone district in single family residential neighborhood. I'm also comforted by the fact that text amendments to the Amsterdam text message to ex help with some form issues that we had previously and the Urban Townhouse Text'",
        "'speaker_5': 'Amendment also would help if that option were pursued. So it is I am more comforted by this base zone district today than I would have been three years ago. That's okay. But that I'll be voting to support things.'",
        "'speaker_0': 'All right. Thank you, Councilman Espinosa. Seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_4': 'I. Brooks, i Flynn, i Gilmore, i Herndon, i Cashman. I can teach Lopez.'",
        "'speaker_1': 'I knew Ortega, i. Mr. President.'",
        "'speaker_0': 'I am. I'm secretary. Please close voting announced the results 11 times. 11 I is accountable. 874 has.'",
        "'speaker_6': 'Passed.'"
    ],
    "A bill for an ordinance changing the zoning classification for 5124, 5128, 5132 & 5136 West 41st Avenue in Berkeley. Approves an official map amendment to rezone property located at 5124, 5128, 5132, and 5136 West 41st Avenue from U-SU-C1 to U-MX-2x (urban, single-unit, to urban, mixed-use) in Council District 1. The Committee approved filing this item at its meeting on 8-21-18.": [
        "'speaker_0': 'Councilman Brooks, would you please put Council Bill 877 on the floor?'",
        "'speaker_9': 'Yemen's president moved the council bill 877 to be placed for funding consideration and do pass.'",
        "'speaker_0': 'It has been moved and can I get a second? It has been moved and seconded. The public hearing for Council Bill 877 is open. May we have the staff report?'",
        "'speaker_10': 'Hello again, Brandon Shaver from CPD. This time we have an official map amendment application 2017 i00171 this free zones property from 5124 to 5136 West 41st Avenue this time from U.S. U.S. one to UMC two x. This item was also at Planet Planning Board on August 1st, where it was voted unanimously in favor to move forward.'",
        "'speaker_10': 'Again, we're in Council District one, this time in the Berkeley neighborhood. Zooming in closer to the site, we are at the edge of the city. This is the southeast corner of 41st Avenue and Sheridan Boulevard. And to the west, we have the city of Wheat Ridge in Jefferson County.'",
        "'speaker_10': 'The request here is the same urban neighborhood context mixed use two story max with limited building forms and uses because of that little access going through the context here, the zoning is see kind of a sea of us.'",
        "'speaker_10': 'You see one, two, all sides of it except for the Jefferson County side to the west. And then there is an insect on the right which shows the mixed use that does occur on both 38th and 44th Avenue.'",
        "'speaker_10': 'And we'll get more into that in a bit. The land use at the site is coming up as mixed use. It is currently three residential units and a retail storefront. It is adjacent to single family dwellings, duplexes and the city of Wheat Ridge.'",
        "'speaker_10': 'Here is an aerial shot to give you a sense of the building, form and scale. This is a building that was constructed in the early 1900s and definitely fits that kind of shopfront embedded commercial look. And a couple of pictures of the site starting at the top left.'",
        "'speaker_10': 'You can see the retail store front and the three residential units that are next to it, going to the bottom left. This is the view of the structure as you travel north on Sheridan Boulevard. And then the pictures on the right just show a kind of a little bit of what the residential character is over there.'",
        "'speaker_10': 'And then again, pulling out the inset map, looking at 33rd and or 38th and 44th Avenues, rather. You can see that this kind of pattern and of embedded commercial exists there as well. The process here, we have received two letters, both being from the Berkeley Regis United Neighbors Incorporation.'",
        "'speaker_10': 'The first was received before planning board and it was a letter of opposition. They have since rescinded that letter and are now in support of this rezoning. Same criteria here. First, consistency with adopted plans. We have the same two plans apply to this area comp plan and blueprint.'",
        "'speaker_10': 'Here are those strategies from comp plan that are further detailed in the staff report, mainly talking about environmental sustainability, land use, mobility and economic activity with the neighborhoods and moving to blueprint the same land use concept is here we have single family, residential and an area of stability and the future street classifications have shared in as a'",
        "'speaker_10': 'residential arterial and 41st Avenue as an UN designated local street. So staff feels that this rezoning will result in the uniform application of the UMTS to U.S. Zone District and will again further the public health, safety and welfare, primarily through the implementation of adopted plans.'",
        "'speaker_10': 'This application for justifying circumstances also known as changed or changing conditions in a particular area. There are also a number of new residential units in this area, particularly along Tennyson Street, which is just to the east, as well as a lot of reinvestment in the housing stock that is currently existing.'",
        "'speaker_10': 'And lastly, for consistency with neighborhood context, this area is very urban in nature and the zone district purpose and intent. Again, the um, access to X is mainly for these embedded commercial uses that are within neighborhoods. Again. CPD recommends approval based on finding that all review criteria have been met.'",
        "'speaker_10': 'Happy to answer questions in the applicant as president as well.'",
        "'speaker_0': 'Thank you very much. We do have two individuals signed up to speak this evening on this item. So if you signed up for this item, if you could make your way to this front bench. First up, we have Jason Lewis.'",
        "'speaker_2': 'Jason Lewis. I reside at 4383 Vrain and I'm here to answer any questions that counsel might have.'",
        "'speaker_0': 'Thank you very much. Next up, Jesse Paris.'",
        "'speaker_11': 'That's the Paris Black Star action movie of self-defense. Denver Homeless out loud, now large candidate for 2019. I had two questions. What was the am I level for these properties on Tennyson? So keep hearing that this area is building housing.'",
        "'speaker_11': 'I want to know what the amount level is. It still seems like this is gentrification in a already rapidly gentrified area. And also, what is going to be the use of this mixed use? What it's going to be here as commercial is going to be residential.'",
        "'speaker_11': 'What is this? Thank you.'",
        "'speaker_0': 'Thank you very much. That concludes our speakers. Are there any questions from members of council? Councilman Ortega.'",
        "'speaker_7': 'Yeah, I just wanted to ask the applicant what you plan to do with the property, if you don't mind just sharing with us what you're. What you hope to do with it. And if you're planning to use the structure or just build a whole new development.'",
        "'speaker_2': 'Yes, we're actually leaving the current structure and it's in its current state. Right now it has single use zoning, but the prior use was originally commercial and over the years it's just been overlaid with the surrounding single use.'",
        "'speaker_2': 'So we wanted to bring the the zoning up to what the current use of the building has been in the past, which is mixed use. It currently has one commercial and three residential units in it. We're looking to essentially upgrade the building.'",
        "'speaker_2': 'We've put a $90,000 energy efficient roof on it and we're looking to do some exterior upgrades. We've re paved the driveway and made some improvements and we're just looking to overall improve it. But before we do that, we'd just like to make sure the zoning matches the use.'",
        "'speaker_7': 'Thank you so much. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Ortega, seeing no other questions. The public hearing for Constable 877 is closed. Comments by members of Council. Councilman Espinosa.'",
        "'speaker_5': 'So this one, I'll just admit this was a little bit awkward for me because I didn't in fact have ex parte communications with all sides regarding this property. But it is. But I had not made a decision prior to the public hearing, and I also communicated that to both parties that I would that I wasn't making a'",
        "'speaker_5': 'decision. That said, this is very, very similar to my comments on the prior rezoning, which is when you're embedded in a business district in a or a business function, in a in a in a single family, two sort of district, the two X is the appropriate zoned commercial mixed use zoned district.'",
        "'speaker_5': 'So with that, I will be in support.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. And I'll just add that I think Stafford the presentation and showing that it clearly meets the criteria for rezoning. I also be supporting this. Madam Secretary, Raquel Espinosa.'",
        "'speaker_4': 'Hi Brooks I. Flynn I Gilmore I. Herndon High. Cashman High. Can each Lopez.'",
        "'speaker_1': 'I knew Ortega.'",
        "'speaker_4': 'Mr. President.'"
    ],
    "A bill for an ordinance relating to the Denver Zoning Code, to improve clarity and usability. Approves a text amendment to the Denver Zoning Code to clarify what constitutes a sign for purposes of zoning regulation and correct a code drafting error that may cause confusion regarding permitted setback encroachments for one-story porches and similar features. The Committee approved filing this item at its meeting on 8-21-18.": [
        "'speaker_0': 'I'm Madam Secretary. Please close voting. Announce the results. 1109 accountable 877 has passed. Councilman Brooks, will you please vote council bill 886 on the floor.'",
        "'speaker_9': 'I thank you, Ms.. President. I move the council bill 866, eight, eight six be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. Thank you. The public hearing for Council Bill 886 is open. May we have the staff report?'",
        "'speaker_10': 'Yes. Good evening, Mr. President. Members of the city council. I mean, it's just Matthew Stoiber with community planning and development. I'm just trying to get the slide show up here. And yes, this is a proposed zoning code, text amendment, text amendment number two to the Denver zoning code, which would remove the word colors from the definition of'",
        "'speaker_10': 'sign. And it's also a correction regarding one storey porch encroachment as a result of the made this your slot home text amendment. So I'll just briefly go over the purpose of the amendment summary of the changes review of the public engagement process.'",
        "'speaker_10': 'I'll go through the review criteria and the staff recommendation at the end. The purpose of the amendment is the clarification of what constitutes sign for purposes of zoning regulation, and then also a correction of a code drafting error that may cause confusion regarding permitted setback encroachments for one storey porches and similar features.'",
        "'speaker_10': 'I'll take the first part of the amendment first. The current definition of sign in the Denver zoning code. It's it's rather lengthy, but it's basically a device or object that advertises by any means, including words, letters, fixture figures, colors, designs, symbols, fixtures, motion, illumination or projected images.'",
        "'speaker_10': 'So let's take a look at that word colors. What does that mean? This is a question that our reviewers are faced with in community planning and development. The gas station canopy, if there's just a red band on the gas station canopy or a green band, depending on the gas station, is that a sign in and of itself'",
        "'speaker_10': '? Obviously, that Conoco is a sign. But what about just that red band? What about the beige color that is used in corporate architecture, franchise architecture such as the Olive Garden restaurant? What about the public storage facility, which has orange doors and they've actually trademarked that color orange on their door?'",
        "'speaker_10': 'Are they each are each of those individual doors a sign? Again. From that definition I just read you signs are words, images, designs, etc. that advertise colors was included in the definition of sign as part of the 1971 sign code update.'",
        "'speaker_10': 'And certainly colors are part of sign designs, but zoning historically has not considered color alone. To be a sign and sign committing sign permitting by staff regarding color has not been applied consistently. Exterior colors are not limited by zoning.'",
        "'speaker_10': 'Sometimes design guidelines may give guidance regarding color. These are not in the zoning code and this will not be changed by the zoning amendment and would continue to apply. So how did how did we get here tonight? There were questions raised recently by the Colorado Wyoming Petroleum Marketers Association regarding if color the use of color alone on'",
        "'speaker_10': 'a building should be regulated as a sign. And again, as I mentioned, regulating color alone as signage is not consistent with historic press practice among staff. So as a result of this question from from the Petroleum Marketers Association and others, the zoning administrator issued a determination or an interpretation of the zoning code in November of last year'",
        "'speaker_10': 'that would have limited colors as signs to trademark or trade dress. However, the Board of Adjustment overturned this interpretation in May of this year. The effect of this Board of Adjustment decision is back where we started, which is that color as a sign is not limited to trademark.'",
        "'speaker_10': 'As a result of this, there's a lack of policy direction and a need for clarity and consistency in regulation. The question keeps still still comes up is color alone a sign? And so that is what has led us to this amendment.'",
        "'speaker_10': 'The amended definition of sign will read the same as before, but the word colors would be stricken from the amendment. I would, however, note that the definition says by any means, including so this is a non-exclusive list of what constitutes a sign, and this still gives staff some flexibility in determining what exactly is a sign.'",
        "'speaker_10': 'However, it will it would give us some clear direction, I think, and the questions I raised earlier. So these are examples that I pointed to earlier of building colors that would not be considered signs post amendment, the public storage orange doors.'",
        "'speaker_10': 'So those I think there's 16 or so orange doors. Those are not 16 signs. The sign that says public storage is still a sign, of course, and colors that are used in franchise architecture, for example, these colored shapes on the on the facade of the Taco Bell restaurant would not be considered signs.'",
        "'speaker_10': 'Of course, the Taco Bell logo and the bell itself is still a sign. So what's the impact of this? Practically speaking, it will reduce ambiguity and the possibility for subjective code. Administration and enforcement among staff. Staff will be able to enforce this consistently and there will be no difference on the ground.'",
        "'speaker_10': 'What's a sign and how signs are regulated will continue consistent with the typical I wouldn't say exclusive practice, but typical practice since 1971. I just want to recap some questions we received at the alumni committee hearing regarding future steps in the sign code that were raised at that at that hearing.'",
        "'speaker_10': 'So the city is planning to undertake a bundle of sign focused text amendments to ensure efficient and legal code administration. The kickoff to this bundle will begin early next year, and CPD will host stakeholder meetings to gather public input on this.'",
        "'speaker_10': 'The bundle process typically takes 9 to 12 months. The city also intends a larger scale effort to rethink and update this update to sign code within the next few years. The second part of this text amendment will maintain historical levels and allowances for porches and similar features to encroach that.'",
        "'speaker_10': 'Encroach into primary. Minimum. Primary. Street setbacks. It will correct a code drafting error that was adopted in the May 2018 slot Home Text Amendment that can cause confusion among reviewers regarding setback encroachment for one storey porches and similar features in some zone districts.'",
        "'speaker_10': 'What this amendment would do would return the relevant porch encroachment text to the pre slot Home Amendment state to fix this drafting error that appears to allow setback encroachments for multistory porches but not one storey porches in some zone districts.'",
        "'speaker_10': 'And it will maintain the intended new allowance for one storey porches to encroach into the increased side interior setbacks when using the new townhouse building form. It will also standardize formatting and terminology used for the allowed porch encroachments.'",
        "'speaker_10': 'Just want to summarize the public engagement process for you. We took this question about the color assigned to the ANC zoning committee in June. A red line draft of the amendment was posted to the CPD website and informational notice was sent to RINOs in July.'",
        "'speaker_10': 'We had a public hearing and planning board on July 16th and the I'm sorry, July 18th and then a public hearing on the 1st of August. Prom planning board recommended approval. Again, we had a committee meeting at Luti on the 21st and I talked already about the question that came up about the sign code update.'",
        "'speaker_10': 'There was also a question that was raised about consistency with small area plans, which I'll cover in the next slide. And then you can see the rest of the public engagement process there. So the review criteria, which is covered in detail in your staff report, includes consistency with adopted plans and policies.'",
        "'speaker_10': 'So I'm not advancing. Here we go. Can't plan 2000. It should be flexible and accommodating of land use needs, supportive of the city's economic strengths and can be fairly administered and enforced, encourages positive change in diversity and development consistent with character of surrounding neighborhoods and applies appropriate controls and assented incentives and encourages porches.'",
        "'speaker_10': 'These are all recommendations out of current Plan 2000, which the proposal is consistent with. Blueprint Denver 2002. The amendment is consistent with recommendations regarding signs in commercial areas. It's consistent with recommendations for language amendments and areas of stability.'",
        "'speaker_10': 'And it's consistent with recommendations that encouraged front porches. Again, I mentioned that there was a question at Liberty regarding is it consistent with adopted small area plans as well as the citywide plan. So we looked and this is summarized in your staff report, we looked at all adopted small area, neighborhood station area plans that were adopted as'",
        "'speaker_10': 'part of comp plan 2000 and any that were adopted sense for references to sign color and these citations are included in the staff report. Removing the word colors from the definition of sign is not incompatible with the direction in these small area small area plans that science should be compatible with and enhance the character of their surroundings'",
        "'speaker_10': '. And although it's not technically part of your review review criteria, I just wanted to also mention we looked at the draft Denver Right. Plans, commercial signage is not specifically addressed. So that is to say that the amendment would not be in conflict with the proposed draft.'",
        "'speaker_10': 'Denver Right plans. Other review criteria including include furthering public health, safety and welfare. So this amendment would provide clarity and predictability and zoning regulations would implement adopted plans through regulatory changes. And then another review criteria is that it results in regulations that are uniform within each zone districts.'",
        "'speaker_10': 'So regulations that are uniform in application to buildings and land uses within each zone district to help ensure the consistency of zoning regulations and to improve the ability to administer and enforce the code uniformly. So the staff recommendation is based on the review criteria that I've just outlined.'",
        "'speaker_10': 'Four Text Amendments stated in Denver Zoning Code Section 12 .4. 11 Staff Recommends Approval of Text Amendment number two to the Denver Zoning Code. Are there any questions?'",
        "'speaker_0': 'Thank you very much. We do have five individuals signed up to speak this evening. So if you've signed up to speak on this item, ask if you please come to the front bench so that we can get through everyone quickly.'",
        "'speaker_0': 'I'll call your names. Please step up to the podium and then your time will start to elapse. First up, and I do apologize if I get your name wrong career Bailey.'",
        "'speaker_2': 'Thank you, Mr. Chairman. My name is Greer Bailey. I serve as the executive director of the Petroleum Marketers Association. I live in Denver in University Hills. I just wanted to briefly thank the extensive work that Director Axelrod and her staff have done over the last year, working with collaboratively work with the industry in order to just provide'",
        "'speaker_2': 'some regulatory clarity for our station owners as they try to improve their businesses in the city. So that's all. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_11': 'Good evening. Jesse Paris Black Star Action Moment for Self-defense. Denver Homeless out loud in large candidate for 2019. I approve this. I don't see no issue with this. I would like to get some more detail on what this all entails, but from the current presentations I've heard, it makes sense.'",
        "'speaker_11': 'So I'm approving now. Thank you.'",
        "'speaker_0': 'Thank you. Next up, Richard.'",
        "'speaker_2': 'Kieran. Good evening. My name is Richard Kieran. Last name again. I am a general contractor. I am one of the owners of Ktc, General Contracting, working with the gas station owners. And I am in favor of this Tex amendment change.'",
        "'speaker_2': 'And if you have any questions, I'd be happy to answer for them.'",
        "'speaker_0': 'Thank you. Next up, John Show Horse.'",
        "'speaker_2': 'Good evening. I'm Jon Snow Horse. And be a.'",
        "'speaker_0': 'Friend of the agenda. I'm going to pass. All right. And Jeff Sussman. I'm Jeff.'",
        "'speaker_2': 'Sussman. I reside at 1391 Elk View Road in Larkspur, but I'm with Juneau Services Company. We're a 50 year old family business here in Denver, and I'm here in support of the amendment. I won't take any more of your time, but I'm happy to answer any questions.'",
        "'speaker_0': 'Thank you very much. That concludes our speakers. Are there any questions from members of council? Councilman Flynn.'",
        "'speaker_2': 'Thank you. Matt Or Abe, maybe you could address this in the presentation. Matt I think you said that that the definition of sign, although we're removing color, the definition of sign characteristics is non-exclusive and that the department would still have flexibility to take color into consideration even though we're removing it as as a specific cited item.'",
        "'speaker_2': 'Is that is that the case?'",
        "'speaker_10': 'Yes, sir, that is the case.'",
        "'speaker_2': 'Thank you, sir. My question is, can did the department envision any particular circumstance where color would now come into play after all the examples of where it does not?'",
        "'speaker_10': 'We have discussed this and we can't think of anything where it would come into play. Certainly we recognize that color is part of a assign a can be part of a sign or part of a logo, but we can't think of any instance where that would apply.'",
        "'speaker_2': 'Okay. But we still have a flexibility in case the unimaginable.'",
        "'speaker_10': 'Right. I think if if the end of the question was really focused on is can color alone be a sign and we can't think of an example, but it's possible. And if that comes up, then we do I think we do have the flexibility to say this is something that advertises that uses a design or something else'",
        "'speaker_10': ', and it could be considered a sign in this case, but I think it would be very narrowly focused.'",
        "'speaker_2': 'Okay. Thank you. And I also want to compliment you in the staff report for using the SIC as ERATO script on when you in the staff report when the one of the Evans station area plan misused the word complement and should have been complement.'",
        "'speaker_2': 'It's a it's a rare eye and an old editor that would pick that up. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn. I was going to mention that same exact thing, but you took the words out of my mouth.'",
        "'speaker_2': 'Yeah, right.'",
        "'speaker_0': 'Councilman Espinosa.'",
        "'speaker_5': 'Matt, first off, I want to say hello. It's been a very long time. Matt and I worked on the Jefferson Park Neighborhood Plan many, many, many moons ago. So welcome back to the city. Thank you. The question I have is, was there a conversation about, you know, you know, one of the things we've done historically and we'",
        "'speaker_5': 'sort of got away from but we still do it on transparency is quantify areas. Was there any conversation about saying well if it is a primary color in a in a sign that it would be limited in its application on the structure by a certain percentage?'",
        "'speaker_10': 'We didn't have that question about quantifying. I think we looked at I think the public storage is a good example of a of a building that if we were to apply this strictly, that each of those doors would be a sign and that the issue, I think then becomes some of these facilities are well in excess of'",
        "'speaker_10': 'the permitted number of signs if if we count each of these strictly. So I think that was a consideration. I think and I'm not trying to dodge your question, but we didn't discuss it specifically. I think the other example I would point out is that there are so many, particularly gas stations that have this color banding on'",
        "'speaker_10': 'their canopy that have just been permitted throughout the years. And and it was never applied that strictly to those particular businesses. So it was an attempt to be sort of consistent with what's existing out there already.'",
        "'speaker_5': 'That's actually why I asked, because there's this thing was being presented. I just kept thinking, you know, gas stations have been sort of the NASCAR of our building for us. Like you can tell which one is the the Texaco versus the Shell versus the Sinclair by whether it's white, yellow or black or red.'",
        "'speaker_5': 'Sorry. Mm hmm. And they've always done that. Where the the the projection was one thing in the building was a different color. And it would have been consistent with our sort of historic use of awnings. We always did an accent color, you know, typically on a you have building facade and then accent.'",
        "'speaker_5': 'And so I think we could have articulated that awnings and a limited portion of the building can sort of have a logo in because this is this this was the primary question in the in the stadium issue. Right.'",
        "'speaker_5': 'It's one thing to label a building the Sports Authority field. You could do that in white letters and it would say the same thing. But why you go after the red is because that's the branding and and in I don't know if we're solving one city do you are you not is is the city satisfied that we're'",
        "'speaker_5': 'not solving. Or this sort of, you know, historic sort of unique deviation and not opening ourselves up to something else. And Ari, is the city at all concerned when I see something like the public storage example that you showed?'",
        "'speaker_5': 'Mm hmm. All that does is scream empty building. And where we put those buildings and we brand that thing, and then we put red doors, orange doors or green doors behind a glass facade. It just says, no one's here, and that's not allowed before.'",
        "'speaker_6': 'Right.'",
        "'speaker_10': 'So I don't I don't think we thought of that specifically with this. I think that I think we did have discussions. I think it was very it was unclear. So, first of all, I would say, again, that the zoning administrator did attempt to draw an interpretation of this last year that would have limited it to trademark and'",
        "'speaker_10': 'trade dress that would have applied to something like public storage. But again, the board overturned that. So we were left without the clarity of direction. I think that when we look at something like a gas station canopy, when and a gas station canopy has four sides, but it may have many more because it may have two canopies'",
        "'speaker_10': 'join together. So then we had a discussion among ourselves. Well, if you're saying each of those is a sign, how many is that? Is that one for each sign or one for each side of the canopy? What if the size of the canopy is articulated now?'",
        "'speaker_10': 'Do you have eight signs or 16 signs? And it just became sort of it's, I think pointed out that it was very difficult for us to interpret to interpret that consistently. What we could say is if somebody is using a logo or a design, you know, a swoosh or something like that, that's that's a design that we'",
        "'speaker_10': 'could say that was a sign. But just saying a green band that's in itself is not would not.'",
        "'speaker_5': 'Be a sign. Interesting. The two items, the porch and the sign come up together, because I do think that we're able to discern what is a porch encroachment and what isn't and what makes a porch versus what differentiates a porch from a building or a porch from a sign.'",
        "'speaker_5': 'I think we could probably make that same distinction on an awning, a canopy for, you know, over pops. And so maybe that's probably going to be like that one. No vote planning board, just the sort of dissenting vote, because I do think that there's probably something there's probably an exception here we need to look at.'",
        "'speaker_5': 'Okay. Worry about the one size fits all approach, the nature of sort of the unintended consequences of this. Thanks. Sure. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman, you made a very nice job tonight. I don't want to prolong this very much, but what do you consider the golden arches?'",
        "'speaker_10': 'I think the golden arches because they are a design. There's a design element to that. I think they would be considered they could be considered design.'",
        "'speaker_2': 'So for so you don't need to have the word McDonald's on that golden arches to say that's right.'",
        "'speaker_10': 'Or the target bullseye doesn't have the word target on it, but it is a color and a design, so it is a sign.'",
        "'speaker_0': 'Thank you very much. All right. Thank you. Councilman knew and it was an 8 to 1 vote at planning board. That's correct. Can you just speak a little bit to the no vote at the no.'",
        "'speaker_10': 'Vote was from, uh, Commissioner Schulz. And let me just look at my notes here.'",
        "'speaker_5': 'That's a rookie.'",
        "'speaker_10': 'Um, pardon me. I just just summarize the discussion. They had some of the questions, same questions that came up today. If if a color design could still be considered a sign, the answer was yes. I will I will say I'm not entirely clear for the reason for Commissioner Schultz's no vote.'",
        "'speaker_10': 'He did participate in that discussion. And I think he had some questions about the I think he felt that the the branding the ability of the Petroleum Marketing Association to brand the gas stations was was already very strong.'",
        "'speaker_10': 'I don't want to take the words. I don't want to take it out of context. I was unclear on the reason for the no vote.'",
        "'speaker_0': 'Okay. Thank you very much. Seeing no other questions at the public hearing for comfortable eight six is closed. Are there comments by members of Council Councilman Espinosa?'",
        "'speaker_5': 'Yeah, I really explain that analogy of the NASCAR of the of our building forms. And why that matters to me is that if all the NASCAR's going around the oval were were the same color and it just had a generic font and it branded, you know, Valvoline and and STB, I don't know.'",
        "'speaker_5': 'I'm going back to Richard Petty Days of Furniture Row. That's a pretty generic car actually. You know, there's a reason why they're all brightly colored is so you can identify, you know, where your driver is. And the same thing with horse jockeys, they all were different colored kits.'",
        "'speaker_5': 'So that, again, they can be identified near and far. And in the case I get, why are our fill filling stations have gone that route? They're all vying for convenience dollars and gas dollars and and some cases liquor dollars.'",
        "'speaker_5': 'The real problem for me is that these these these facilities do the nature of sort of contamination in soils to failed on underground storage tanks, you know is that they end up being sort of permanent fixtures or very difficult to dispose of a remove once they're there life, you know, the leases up in the franchise is gone'",
        "'speaker_5': '. I don't understand the the business. I just know that they sit there when they're when they're contaminated, when they when there's monitoring wells all over the place and when things are spotted and plumes are discovered, no one wants to invest in that land and clean that up.'",
        "'speaker_5': 'And and so we're to to sort of make it I get why we would want to accommodate the need for something reasonable for the purposes of doing your business. But at the same time, they're not necessarily the greatest neighbors.'",
        "'speaker_5': 'They have very few agendas with those operators. They have 24 hour facilities. In some cases. I have light leakage with those facilities. And yeah, if it's a modern facility we can address these things. But if it's a historic facility and you're just doing a re skinning of that, a rebranding of that facility, you know, we're doing you'",
        "'speaker_5': 'a favor by giving you some clarity and saying, hey, plaster our neighborhood with your your logos and your colors and maybe you'll do some other additional things to sort of, you know, pick up. But I have seven elevens that have operators where guys go in with after gunshots and don't call 911.'",
        "'speaker_5': 'And, you know, and those gas pumps, they don't go you know, they're hard to get rid of because there are fewer and fewer in here and they're more and more lucrative when you get them. And so this is this is my struggle with this specific this specific nature of this ask is one that I think we could'",
        "'speaker_5': 'come with a specific answer to for this industry. And what we're doing is we're we're trying to do legitimate clean up on any sort of confusion. But I think what it does is it it it creates an interesting caveat that I think other industries might might pick up on.'",
        "'speaker_5': 'And I and so with that, I'll be voting. No, thanks.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. See nobody else in the queue. I just want to say thank you for all your work on this. You know, I think that this is a common sense fix to a problem that when people look at it and say painting that door a color is not a sign and leads to 15 signs and'",
        "'speaker_0': 'a violation of the number of signs. So I appreciate all the hard work that when you dig into it, it gets more complicated than it looks like. It should be at face value and takes a long time. And I appreciate your staff putting so much time and effort into it and I am happy to support this tonight'",
        "'speaker_0': '. Madam Secretary, roll call.'",
        "'speaker_4': 'Brooks. Hi, Espinosa. No. Flynn. Hi, Gilmore. I. Herndon. I. Cashman. I can teach. Lopez. I knew.'",
        "'speaker_1': 'Ortega. Hi, Mr. President.'",
        "'speaker_0': 'I am secretary. Please close voting in those results. Are we missing somebody?'",
        "'speaker_1': 'Councilwoman Ortega. Thank you. Had Ten eyes one day.'",
        "'speaker_0': 'Ten eyes one day accountable. Eight, eight, six has passed. Seeing no other business before this body. This meeting is adjourned.'",
        "'speaker_1': 'How does what you do play into the whole wind energy story?'",
        "'speaker_2': 'Well, very important part of wind energy prediction is trying to tell the folks who run the electrical system when the wind is going to blow so they could take advantage of it. You have to blend wind in with all of the other.'",
        "'speaker_10': 'Power generation sources like coal and natural gas.'",
        "'speaker_1': 'So what about a regular weather prediction? Is that.'"
    ]
}