{
    "A resolution approving a proposed Third Amendatory Agreement between the City and County of Denver and JKS Industries, LLC to extend the term and add funds to provide on call asbestos, lead and mold abatement services. Amends a contract with JKS Industries, LLC to add $2 million for a new contract total in the amount of $2,480,000 and to add two years for a new end date of 8-3-19, for nuisance abatement actions for residential properties and environmentally regulated building material abatement and demolition activities of city-owned facilities including those associated with the North Denver Cornerstone Collaborative and Platte to Parkhill projects (ENVHL-201415783).  The last regularly scheduled Council meeting within the 30-day review period is on 6-12-17.  The Committee approved filing this resolution at its meeting on 5-10-17.  Pursuant to Council Rule 3.7, Councilman Espinoza called out this resolution at the Monday, May 22, 2017, Council meeting for a postponement to the next regularly scheduled meeting of Monday, June 5, 2017.": [
        "'speaker_2': 'Okay. And then we'll put a question for 577. Right. Okay, great. Madam Secretary, please bring up the block for Espinosa's resolution for 21 two for 27. Councilman Black, we put resolutions for 21. For 2022. For 23, for 24, for 25 and for 27 on the floor for adoption.'",
        "'speaker_3': 'Yes, I move that resolutions for 21. For 22 for 23, for 24 for 25 and for 27. Be adopted in a block.'",
        "'speaker_2': 'All right. It has been moved. And seconded comments by members of council. Councilman Espinosa.'",
        "'speaker_0': 'Actually, I had a question, but is there anyone here to speak on? Thank you. The first question was, as there are six contract contracts being amended, but the amended briefing materials that were given to council last week only include an abstract, abstract information about four of the contracts how how much of its environmental, technical solutions and foothills'",
        "'speaker_0': 'been encumbered for.'",
        "'speaker_1': 'Those are 2.48 million as well. So the two that were not called out or that were not given more detail, those are consultant contracts. The four other ones are either abatement contractors. So sometimes the consultants do the advising, the scoping, the budgeting and the oversight of the contract work to make sure that it's done to adequate standards'",
        "'speaker_0': '. Right. So they were actually $1 million contracts. They're the lesser of the group. But so my I'm just trying to understand so that you provided information that shows we're probably close to 80, 90% or 90% on most of these contracts.'",
        "'speaker_0': 'Are we also 90% on on there for 84 consultants, or are we actually have some room there?'",
        "'speaker_1': 'That is correct. They're close to contract. I was.'",
        "'speaker_2': 'Introduced herself.'",
        "'speaker_1': 'Oh, sorry. Steve Gonzales. City and County. Denver. Denver Health Department. I'm Greg Thomas. I'm the division director for the division. I manage the contracts and the two you called out. They are the oversight, as Greg was mentioning. They're the oversight consultants for the contractors.'",
        "'speaker_1': 'Every time we do work with the four contractors, the two consultants are involved in some capacity for oversight actions and will get used to the contract values or less because they're their capacity. They're not labor, they're a kind of documentation and oversight, and that's generally a less dollar value than the labor.'",
        "'speaker_0': 'Having been familiar with both Foothills and ETS in my past life as an architect, I was aware of that and sort of expected that to be the answer. However, I just wanted to point out that the language in the Indy Council agenda and thus the bill request is identical for the other four contracts.'",
        "'speaker_0': 'Despite the fact that there are different services, as you're saying, as you're explaining. So anyway, the rest is comment. You can stay up there if you want to respond, but I'm not. Thank you, guys. So on Monday, May, June, May 22nd, 14 days ago, I proposed to postpone action on these resolutions due to a glaring lack of'",
        "'speaker_0': 'information supporting a more than tripling in authorized contracts going from 3.4 million for three years worth of work to 12 nearly $12 million, adding nearly $8 million for two additional years. Well, questions were asked in committee. The responses should be seen as interests insufficient to approve this multimillion dollar increase without clear delineation of the increased need.'",
        "'speaker_0': 'More than a week passed when our legislative staff inquired about the lack of follow up by the agencies requesting these these amounts and backup, despite the fact that the supposed contracts for these supposed projects for these contracts should have been defined years ago and revisited many times, particularly in the last few months through the Gabon process, the'",
        "'speaker_0': 'requested supporting projects and cost estimates for the needed abatement work was not at the ready. How how these numbers were arrived at for these contracts without this? How were these contracts arrived at these amounts for these contracts arrived at without these basic this basic information with two weeks to provide information that should have been at the ready'",
        "'speaker_0': '. Getting contract, justifying information should not have been any issue. Yet it took nine days to present this response. These two pages that are now at each of my colleagues desk. Please note that there are no estimates, no project years, be it 2017 this year, 2018 or 2019 included with this information.'",
        "'speaker_0': 'I remind my colleagues that we constantly fight for scraps of money for our mobility agenda or to improve access to affordable housing. And yet we approve unsaid unsubstantiated contracts in the millions that far exceed the amounts that the administration allocates to either endeavor.'",
        "'speaker_0': 'What's more troublesome about these request is that some of the abatement work will support the NWC, a project with which taxpayers agreed to fund through to tourism related taxes not to expend their general fund dollars on. Even more egregious is to spend our limited general fund dollars on a PDP stormwater project.'",
        "'speaker_0': 'When this council already approved nearly 400 million in obligatory fees to all Denver property owners to fund these improvements. Now we are asked to approve an indeterminate amounts of Denver sales and property taxes to these two projects on top of the over billion dollars that have already been essentially allocated.'",
        "'speaker_0': 'There are many worthwhile projects in the city that go unfunded year in and year out. These two projects, the National Western Center and the PDP Hill, are not among them. I recognize that many that they may have in those two projects may have indeterminate needs, but those projects are substantial enough that they should be contracted for separately'",
        "'speaker_0': 'so that all of the other cities abatement needs aren't at risk by the unknowable of those major projects, and that the accounting of our large projects avoid obscuring their total cost to Denver parks tax and fee payers. Given that the administration has three months because these contracts don't end until August and September to revise and substantiate the'",
        "'speaker_0': 'appropriate contract amounts for the four typical agency needs. Rather than relying once again on this behavior of getting the foot in the door with a sub, a small sub, $500,000 contract, and then pumping the amount 400% and including projects that weren't even approved by taxpayers or council at the time of the 2014 contracts, the time these 2014'",
        "'speaker_0': 'contracts were passed, I urge this Legislature, legislative body for once not to be complicit with this conduct and say no to these resolutions on your own without direction from the administration. Thank you.'",
        "'speaker_2': 'Thank you, Councilwoman Sussman. Was this does this come to committee for a discussion? And were some of these questions answered as a part of the overall? Just want to make sure we're being clear here. The overall programmatic needs and construction that we approved and planned to park last year.'",
        "'speaker_3': 'They were answered satisfactorily for me. I'm not sure it was the same for. Okay. Okay.'",
        "'speaker_2': 'Great. Um. Yeah. I just wanted to make sure that did not go in consent, and we had a full discussion within committee. Okay, great. Councilman Ortega.'",
        "'speaker_6': 'So I don't want to debate the merits of the particular resolutions that are in front of us and go back and rehash the overall drainage project that was proposed that includes Globeville Landing Park, the Open Channel, the. City Park Golf course.'",
        "'speaker_6': 'I think what my request is, is that we have an update on where we are at in the total cost. As you all know, this came to us as one project. It was called the Twin Basin Project that was part of the intergovernmental agreement.'",
        "'speaker_6': 'And I think it would be helpful just to have an update on the overall cost of where we are at in terms of how much have we spent and how much do we still expect to expend for all of that?'",
        "'speaker_6': 'And if we could schedule that to come to committee, I think that would be extremely beneficial to just know where we're at. Are there more contracts coming down the pike? Is this the end of it? Where are we in the big picture scheme of things?'",
        "'speaker_2': 'Yeah, there are probably several more contracts I think because of the abatement contracts, but I think that would be okay. Councilwoman Sussman, would that be okay to schedule an update in your committee?'",
        "'speaker_3': 'Of course. Be glad to.'",
        "'speaker_6': 'Okay. And if you could just let us all know when that does get scheduled.'",
        "'speaker_2': 'Thank you. And, Gaby, you hear that from the mayor's perspective? County Councilman Espinosa.'",
        "'speaker_0': 'And I just respectfully disagree with the comment that everything was there presented at committee to satisfy these things. Here was what was presented as part of that. The presentation clearly says about these contracts on the slide, and it includes Public Works Project Project and applied to Park Hill and geo bond projects.'",
        "'speaker_0': 'I mean it states that and it can and possibly included. I mean, we couldn't at 2014 when this thing was approved, we were you were still working on the stormwater master plan that was still in draft mode. So plan to Park Hill wasn't even, you know, a glint in somebody's eye, maybe at the executive level, but we're'",
        "'speaker_0': 'not privy to that. And so as we get is what you guys provide, the executive provides the legislative branch. And I'm telling you what was presented at committee and what I have in hand based on additional asks remain insufficient.'",
        "'speaker_0': 'My colleagues may agree that our lack of information is thorough and worthwhile, but I'm sorry my the taxpayers didn't put me in office to rubber stamp these things.'",
        "'speaker_2': 'Councilman, I think every person up here does their own research and to to attack their research and say that it's a rubber stamp is is probably it's a huge overstep. So what we will do is have a conversation.'",
        "'speaker_2': 'Thank you, Councilwoman Ortega. We'll have that in the committee about the overall budget of a contract that we originally approved a year ago. And that's what we'll do. And every council person can vote this up or down. Madam Secretary, it's been moved the second to roll call.'",
        "'speaker_4': 'Espinosa. Nick Flynn. I Gilmore.'",
        "'speaker_1': 'Herndon High.'",
        "'speaker_4': 'Cashman. Kenny G. Lopez. I knew. Ortega.'",
        "'speaker_6': 'I.'",
        "'speaker_4': 'Sussman. I. Black.'",
        "'speaker_3': 'I.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_2': 'I believe clubs close voting and as a result.'",
        "'speaker_4': 'I'm just checking. One is missing.'",
        "'speaker_2': 'Ten Eyes to name.'",
        "'speaker_4': 'Yes.'",
        "'speaker_1': 'Okay.'",
        "'speaker_2': 'Ten Eyes. Two names for 20. One through four. 27. I'm going to say I'm just for the record. Resolutions for 21. For 22. For 23. For 24. For 25. For 27 have been adopted. Thank you. All right, Madam Secretary, please, will you please put the next bill in by?'",
        "'speaker_4': 'Yeah. It's 577.'",
        "'speaker_1': 'Excuse me. Go ahead.'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver and AECOM Technical Services, Inc. concerning professional services at Denver International Airport. Approves a five-year contract with AECOM in the amount of $65 million to perform federally required quality assurance inspections and special inspections on maintenance and capital improvement projects at Denver International Airport (201628929). The last regularly scheduled Council meeting within the 30-day review period is on 6-26-17. The Committee approved filing this resolution at its meeting on 5-24-17.": [
        "'speaker_4': 'I think it was 577 for good.'",
        "'speaker_6': 'That's correct.'",
        "'speaker_2': 'KELLEY Oh, that's right. Resolution 577 for a question. Councilman Ortega, sorry about that.'",
        "'speaker_6': 'Thank you, Mr. President. I wanted to ask someone from DIA if they could come up. This is a contract in the amount of $65 million to perform federally required quality assurance inspections and special inspections on maintenance and capital improvement projects at DIA.'",
        "'speaker_6': 'And, Aaron, thank you for for being here to answer my question. We have a. Used to be public works. It's part of our community planning and development that has all of our city inspectors that do inspections on typically all of our city projects.'",
        "'speaker_6': 'So what my question is, is. What is done by. This contract that is not done by our city inspectors.'",
        "'speaker_1': 'Sure. So there's. Or mandated by the FAA to have special types of inspectors and to check the work of the contractors on these particular projects. A lot of the concrete, for example, that's used on the runways is a very special type of concrete.'",
        "'speaker_1': 'It needs to be laid a special way in a timely manner. And so these special inspectors are trained to deal with these kinds of projects that are not seen anywhere else in the city.'",
        "'speaker_6': 'So are city inspectors also involved in inspecting some of these same projects? So we're having to inspections done on some of this work.'",
        "'speaker_1': 'They're looking for two different types of things. But yes, we do have two different types of inspectors on these projects. So these are specialized inspectors and making sure that these contractors are following the specifications. Exactly. And the city inspectors are more looking for code requirements that are being met.'",
        "'speaker_6': 'Do we anticipate utilizing the full 65 million over the five year time frame of the contract?'",
        "'speaker_1': 'It's a maximum contract amount of 65 million, so it's possible, but we don't have to spend all of that money. It's an up to amount.'",
        "'speaker_6': 'But with all the construction projects coming down the pike.'",
        "'speaker_1': 'We do have a large amount of construction painted.'",
        "'speaker_6': 'We may use a good part of it. Okay. Thank you very much.'",
        "'speaker_1': 'Thank you.'"
    ],
    "A bill for an ordinance approving a proposed Amendment to Agreement between the City and County of Denver and Urban Drainage and Flood Control District regarding flood control improvements for Sanderson Gulch Lipan Street to South Platte River. Amends an intergovernmental agreement with Urban Drainage and Flood Control District by adding $1 million for a new total of $2.6 million to partially fund flood control improvements along Sanderson Gulch from Lipan Street to the South Platte River to reduce risk of flooding from 10, 25, 50 and 100-year storm events in Council District 7 (201523631). The last regularly scheduled Council meeting within the 30-day review period is on 6-26-17. The Committee approved filing this bill by consent on 4-4-17.": [
        "'speaker_2': 'All right. Thank you, Councilwoman Ortega. Councilwoman Black, will you please put council bills? 33, 85 and four or 542 on the floor. Sorry about that.'",
        "'speaker_3': 'Yes, I move that council bills 385 and 542 be ordered published in a block.'",
        "'speaker_2': 'All right. It has been moved. I need a second. Great. It has been moved in. Segment questions coming from members of Council Council on assessment.'",
        "'speaker_3': 'Thank you, Mr. President. The administration has asked that these two bills be voted down. Concerning Council Bill 385, it's a partnership with urban drainage and flood control, and funding comes from a variety of sources, including federal grants, cost sharing, cost sharing with urban drainage and city funds.'",
        "'speaker_3': 'But the numbers in the actual ordinance aren't the correct ones. And so they wish we would need to vote this down tonight, and then they would refile it with the correct numbers at another time. At the same as the IS refers to the Council Bill 542.'",
        "'speaker_3': 'It again is a partnership with urban drainage and the funding comes from a variety of sources and they have most of it correct, except they don't have the actual the correct numbers for Denver's piece of the project. So I'm asking my fellow council people to vote these down as a block.'",
        "'speaker_2': 'Okay. Councilman Ortega.'",
        "'speaker_6': 'I just want to remind you all that we have shortened our process to expedite the contracts. So we we gave up one week of us being able to look at contracts. We now call them resolutions. And so we get to see them for for a whole week.'",
        "'speaker_6': 'And, you know, typically the agencies have months and months and months that they work on things. They get filed. We get the details the Thursday before the Monday night meeting, and sometimes the details are always there. I did not support that change.'",
        "'speaker_6': 'And this is just one more example of us being expected to you know, I get that we want to make sure we got accurate information and that is important. But I am concerned that there was so much to do made about the contracting process and the need to make the change on our end.'",
        "'speaker_6': 'And we're the ones that had the least amount of time to get to review them. And I'm just expressing, I guess, just frustration in the process and how it works. So I just couldn't let it pass without saying that.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_2': 'Thank you. Councilman Ortega. Councilman Espinosa.'",
        "'speaker_0': 'Wow. My thoughts? Exactly, Councilwoman Ortega. So I just. Not that I need to spell this out, but this is precisely what I was talking about in my comments about we don't vote these things down unless the administration tells us.'",
        "'speaker_0': 'So, yeah, I will be rubberstamping this request from the administration. Yeah. Despite what we're saying that we don't do because it's going it's at least getting us. It's going to come back in the Q and I would like to have ample amount of time to review the final product.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_2': 'Councilman Cashman.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_5': 'Thank you, Mr. President. I'm just unclear as to what is. What are the bad numbers? Those are the dollar amounts, and.'",
        "'speaker_3': 'They're incorrect numbers. The dollar amounts. There's there is somebody in the audience that could speak to it, if you'd like.'",
        "'speaker_5': 'Yeah, that'd be great. I'd be interested to hear where the problem is.'",
        "'speaker_3': 'Thomas Blackman or John McGrath.'",
        "'speaker_1': 'Hi. My name is Thomas Blackman. I'm an engineer supervisor in public works. So the the numbers in the agreements are correct. But they're we wanted to make sure that we represented the contractual obligations of the city. It wasn't clear in this summary.'",
        "'speaker_1': 'So that's why we wanted to redo this summary to to represent the numbers so you could see the actual contractual obligations of the city. And Kay. There were a.'",
        "'speaker_5': 'Lot confused me even more so. I'll definitely support a little more time. There is no and I shouldn't read this as any indication that we're not supporting the deal itself. It's just details.'",
        "'speaker_1': 'Yes. Is that correct? Yes. We when we put together the information. We were more focused on urban drainage. His contribution to the two projects versus the city's obligation that we are. We are going to Sanderson Gulch, for example.'",
        "'speaker_1': 'Urban drainage is putting $1,000,000 towards the project, and that's the primary primary purpose of this amendment. But we do have to put in the total project costs. So we want to make sure that the Council is aware that we are committing the city per this amendment to $7 million, which is going to be you guys looked at'",
        "'speaker_1': 'the grants that are coming from federal governments are going to cover that portion.'",
        "'speaker_5': 'But when would you expect to refile this?'",
        "'speaker_1': 'We are short order. Yeah. Where are you going? To read. Redo him. Work with John McGrath in the Attorney's Office and make sure that we represent. Just so that's very clear on what the city is committed to.'",
        "'speaker_5': 'Great. Thank you. Thank you, Mr. President.'",
        "'speaker_2': 'Thank you. Councilman Cashman. Councilman Flynn.'",
        "'speaker_1': 'Thank you, Mr. President. I suppose we could send a message to the administration by approving this over their objection. But I'll. I'll. I'll refrain from suggesting that in lieu of perhaps 30 more seconds, explaining what it is in the language that was submitted, that is at fault.'",
        "'speaker_1': 'Yeah. I'm John McGrath, the city attorney. So. There are two of them. And I'll describe sort of overall what the issue is, and then we can get okay with each of them. But Sanderson Gulch is one of the two, and what happened is that these are somewhat complicated funding agreements where two or in some cases three different'",
        "'speaker_1': 'governmental entities are contributing funds to a project. These are projects that were already in existence and are sort of moving on to the next phase where additional funding is coming in. So what happened is in the original bill request, all of that detailed information was laid out.'",
        "'speaker_1': 'But somewhere in the process between there and coming up with the short blurb that you see in the agenda, information was omitted. So the description in the agenda is accurate but not complete. Okay. Information was omitted. And so we're not really under the underlying contracts aren't changing.'",
        "'speaker_1': 'It's just that we wanted to make sure that council and the public have the opportunity to see what's actually happening. That's the whole picture. That's good. In other words, the contract that was filed that we have in the system here is not changing.'",
        "'speaker_1': 'It's not change. It's just the way we're describing it here. Thank you. That's very good. I appreciate that.'",
        "'speaker_2': 'Okay. Councilwoman Ortega, do.'",
        "'speaker_1': 'You just.'",
        "'speaker_6': 'I just wanted to ask, you mentioned something about $7 million is the that's the remainder of the total cost. Is all of that coming in grant funding or is there additional general fund money that needs to sort of fill that gap?'",
        "'speaker_1': 'We are we are receiving grant funds from who are receiving each MGP grant from the feds and CDBG grant from the state. That's going to cover the majority of that. And then anything else, we're currently in design and working on cost estimates and everything else would would have to be come from Wastewater Wastewater Enterprise Fund.'",
        "'speaker_1': 'Okay. And the did want to see these are going on ordinance.'",
        "'speaker_2': 'Hold on real quick. Uh, David Brower is the city attorney.'",
        "'speaker_1': 'David Bravo, Assistant City Attorney. Let me just add this clarification for everybody's benefit to this is not an example of where the fix is just going to be coming back with a new bill next week. It's because the bill.'",
        "'speaker_5': 'Request needs.'",
        "'speaker_1': 'To be.'",
        "'speaker_5': 'Corrected and clarified. So you all will see this.'",
        "'speaker_1': 'As a new bill request that you'll have the opportunity to ask questions about pull off consent or or having a committee or consent process. So I just want to be clear about that. This is just going to be refiled next week.'",
        "'speaker_1': 'It's going all the way back to a new and clarified bill request to jive with the proper what should have been the proper description of the contract. So just know that that's what that's what's going to play out next.'",
        "'speaker_2': 'Great. Thank you, Dave. Mr. Broadwell. Well, Councilwoman Ortega, do you have another question?'",
        "'speaker_6': 'I was just clarifying whether or not, you know, there were additional there would be additional hits to the city budget if that wasn't covered by the grants. And I think you you clarified clarified it.'",
        "'speaker_2': 'Thank you. Councilman Espinosa, are you back up? No. Okay, great. It's been moved. And secondly, you guys can have a seat. Thanks for coming up. It's moved and seconded. The committee and the administration has asked us to vote this down, obviously to be refiled.'",
        "'speaker_2': 'So. 385 Madam Secretary, roll call.'",
        "'speaker_4': 'It also includes 542 and 542.'",
        "'speaker_2': 'Thank you. What will we do without you?'",
        "'speaker_4': 'Assessment?'",
        "'speaker_3': 'No. Black? No.'",
        "'speaker_4': 'Espinosa. Flynn? No. Gilmore? No. Herndon? No. Cashman? No. Kenny Lopez? No. New Ortega? No. Mr. President.'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'I'm sorry.'",
        "'speaker_2': 'I was just proven to counsel Councilman Espinosa. It wasn't a, uh. Anyway, please close the voting. Announce the results.'",
        "'speaker_4': 'Zero ice, 12 nays.'",
        "'speaker_2': 'Zero ise, 12 nays comfortable. 385 and 542 have been killed. All right. Let's see. Are we. Are we done, Madam Secretary?'",
        "'speaker_4': 'Yes, Mr. President.'",
        "'speaker_2': 'Okay, great. All other bills for introductions are order published. We are now ready for the black vote on resolutions and bills for front of consideration. Council members remember this is a consent or bloc vote and you will need to vote.'",
        "'speaker_2': 'Otherwise, this is your last chance to call an item for a separate vote. Councilwoman Black, will you put the resolutions for adoption and bills for final consideration for final passage on the floor?'",
        "'speaker_3': 'Yes, I move that resolutions be adopted in bills and final consideration be placed upon final consideration and do pass in a block for the following items. 17 Dash 055205530554055505560557055805600561057705790588058905900591059204610471053405800583058505860291056205660569058105820390057205310530053205360537.'",
        "'speaker_2': 'All right, Madam Secretary, we get them all.'",
        "'speaker_4': 'Yes.'",
        "'speaker_2': 'Okay. It has been moved and second it. Madam Secretary, roll call.'",
        "'speaker_4': 'Black eye. Espinosa. Hi, Flynn. I Gillmor. I heard in Cashman I can eat Lopez. I knew Ortega. I Susman. Mr. President.'",
        "'speaker_2': 'I please cause voting announce results. 1212. The resolutions have been adopted and bills have been placed upon final consideration and do pass. Since there's no public hearings and there's no objections from members of council, we will not take a recess.'"
    ]
}