{
    "A bill for an ordinance approving a proposed Amendatory Lease Agreement between the City and County of Denver and the Colorado Symphony Association, for offices used by the Colorado Symphony Association.\n (FINANCE & SERVICES) Extends a lease agreement with the Colorado Symphony Association by fifteen months to 12-31-16 to occupy 1245 Champa Street and raises rent from one dollar annually to $5,000 per month plus reimbursement of operating expenses (FINAN-201311017-01). The last regularly scheduled Council meeting within the 30-day review period is on 8-15. The Committee approved filing this bill at its meeting on 7-28-15.": [
        "'speaker_0': 'Could you please have 522 placed on final consideration and do pass?'",
        "'speaker_8': 'I move that council bill 522 be placed on final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. Comments. Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. We went all through this last week. This is the least with the Colorado Symphony. I voted no on it last week and I intend to vote no tonight. I do not believe that we need to extract $8,750 a month from this struggling organization when we're only evicting them from the building at the end'",
        "'speaker_5': 'of 2016 anyway. So thank you.'",
        "'speaker_0': 'Thank you, Councilman. Any other comments? 522. Scene nine. Madam Secretary, welcome.'",
        "'speaker_3': 'Flynn.'",
        "'speaker_5': 'Now.'",
        "'speaker_3': 'Gilmore, I. Cashman I can eat. Lopez. I knew Ortega I. Susman, I. Black I. Clark by.'",
        "'speaker_9': 'Espinosa No.'",
        "'speaker_3': 'Mr. President, I.'",
        "'speaker_0': 'Councilman Cashman waiting on your vote. Got it. Thank you. Madam Secretary. Please close vote to announce the results.'",
        "'speaker_3': 'Ten eyes to name tonight.'",
        "'speaker_0': 'As soon as 522 has been placed on final consideration and do pass. I believe that's where all the bill is called out. So all of the bills for introduction are order published and we are ready for the block votes.'",
        "'speaker_0': 'Councilwoman Ortega, will you please put the resolutions on the floor for adoption in a block?'",
        "'speaker_8': 'I move that resolution number 555, five, 57, 568 and 558 be ordered. Published.'"
    ],
    "CB15-0553:  Denver College Affordability Initiative  a) Presentation.  b) Fifteen (15) minutes of public comment on proposal. Two minutes per speaker and equal opportunity for opposing perspectives as determined by the Committee Chair.  Individuals wishing to speak must sign up in the Council Conference room (3rd Floor City & County Building, Rm. 391) beginning 15 minutes prior to the Committees scheduled start time of 1:30 pm.  Sign up ends at 1:15 pm.  The order of speakers is determined by the Committee Chair. c) Discussion/Action.\n (FINANCE & SERVICES) Creates a fund to help young Denverites attend higher education and certificate programs.   This bill must pass no later than August 31, 2015 to meet the deadlines for the November ballot.  The Committee approved filing this bill at its meeting on 8-5-15.": [
        "'speaker_0': 'public hearing and we would like to make sure we have time to get through all the speakers. As public hearings on Council Bill 553. So, Councilwoman Ortega, will you please put five, five, three on the floor.'",
        "'speaker_8': 'And move the council bill five, five, three be placed on final consideration and do pass.'",
        "'speaker_0': 'And wait for the screen to catch up. It has been moved and seconded. The public hearing on five, five, three is now open and I will be given part of the staff report and I will be following. I will be followed by Deputy Mayor Carrie Kennedy and council members.'",
        "'speaker_0': 'There's not something in the computers but on your desk. Each of you have the staff report is a one pager front and back. The overview of the Council bill for Denver College Affordability. What we have before us that we'll be voting on is the Denver College Affordability Plan, a pay for performance model that focuses on student completion'",
        "'speaker_0': '. Our decision tonight is whether or not to send this to the for referendum to the Denver voters this November 2015. The source of the funds will be a proposed .08 sales tax increase to generate 10 million annually to support Austin City funded nonprofit.'",
        "'speaker_0': 'Similar to what we have with the Denver Preschool Program, Kerry Kennedy. We'll talk more about its impact on our overall tax burden. There are two components for the use of the fund. The first deals with scholarship reimbursement. Scholarship organizations may apply annually for reimbursement grants for scholarships they provide to Denver students who have successfully completed the prior'",
        "'speaker_0': 'academic year. These organizations will provide a list of eligible students that they have helped, how much money they have spent for tuition, and the support services for each student, not on administration and operational costs. The support services can be reimbursed to that include academic tutoring, course, election, financial aid, guidance and mentoring and academic counseling programs.'",
        "'speaker_0': 'The ordinance describes that they can only be reimbursed on their privately raised funds and only up to a maximum 75% that they spend on each element. Student This ensures that they can actively fundraise and use this city program as leverage to develop their philanthropy.'",
        "'speaker_0': 'The second pillar second piece deals with grants for student loan debt relief. Not every student in need has a scholarship to support them. The Student Loan Debt Relief Program is designed to help lower the cost barriers to get to and complete.'",
        "'speaker_0': 'College eligible students can apply for a grant to assist with their student loan repayment based on a sliding scale. A Denver student can access up to $4,000 per year through these two programs. The sliding scale will ensure the funds go to the neediest.'",
        "'speaker_0': 'Students who have the highest barriers to getting to and through college eligible students must prove. Denver residency for at least three years attended an accredited technical skill technical school, community college or university in Colorado qualify for financial aid and meet household income criteria and be no older than 25 years old.'",
        "'speaker_0': 'From the transparency and accountability provisions, the ordinance outlines that the required annual reporting will go to the mayor, city council auditor and to the public as well. These auditor reports must include the number of full time and part time students that they are supporting data on student graduating and on track to graduate.'",
        "'speaker_0': 'And over time, the long term workforce impact. The program's records are public records and can be audited by the city auditor. There's a seven member, seven member board appointed by the mayor with city council approval. No more than 10% of the funds can be spent on administrative costs and until sales tax will expire in ten years.'",
        "'speaker_0': 'That is the overview of it. I will now ask our Deputy Mayor and CFO Carrie Kennedy to come talk how this possible increase would affect our overall tax burden.'",
        "'speaker_6': 'Good evening, Mr. President. Members of council. I'm Carrie Kennedy on the city's chief financial officer. I also served as Mayor Hancock's deputy. Thanks so much. When this proposal came forward, we took a look at how the proposed increase in Denver's sales tax rate would impact our city's taxpayers and also how it would impact the competitiveness of our'",
        "'speaker_6': 'city with respect to our overall tax burden. So, as you all know, the proposal proposes a sales tax rate increase of .08 percent. That's a little less than a penny on a $10 purchase. So first of all, the impact on Denver's taxpayers, we found that if this proposal were to be approved by Denver voters, that the sales'",
        "'speaker_6': 'tax rate here in Denver would not be substantial. Wholly different than what our citizens have been accustomed to paying. So there's a little bit of history. Back in 2011, if you'll recall, we had a stadium tax in place of 1%.'",
        "'speaker_6': 'It expired at the end of 2011. So at that time, the total sales tax rate combined that includes everything that somebody would pay if they buy something at a store in Denver was 7.72%. That dropped to 7.62% the day after that stadium tax rolled off.'",
        "'speaker_6': 'It has crept up incrementally lately in 2015, when the voters approved a slight increase to the Denver preschool program tax. So our current rate is 7.65%. If this proposal to fund college affordability in Denver were approved, our total combined sales tax rate in Denver would go to 7.73%.'",
        "'speaker_6': 'So sitting right on top of the 7.72% that it was for a very long time. So really no effective change in the sales tax rate over what people have been accustomed to paying. So then we also took a look at how does that 7.73%, if this were to be approved, how would that impact our competitiveness as a'",
        "'speaker_6': 'city, both in terms of sales taxes that we see across the region, in the metro area where people may elect to go shopping? But also how does it position Denver compared to other cities around the country? So in comparison to our neighboring jurisdictions, we looked at 25 jurisdictions that are adjacent to Denver and and here on the'",
        "'speaker_6': 'front range, we are currently the seventh lowest sales tax rate at our current rate. If this proposal were approved, we wouldn't change positions. We'd still be seventh lowest. Then you all may have seen there was a study that came out about ten days ago that compared tax burdens of all the cities in the United States with populations'",
        "'speaker_6': 'over 250,000 people. So hundreds of cities. Denver came in as one of the 15th lowest overall tax burden cities in the country. So we really aren't concerned from any kind of national standpoint either. If this were measure were to go forward.'",
        "'speaker_6': 'So I guess my message to all is you do have capacity to go ahead and move forward with this with confidence that it won't place any kind of tax burden on the city's residents and shoppers. It won't change what they're used to paying in taxes, and it also won't disadvantage the city in any way with respect to'",
        "'speaker_6': 'our competitive position. Thank you.'",
        "'speaker_0': 'Thank you, Deputy Mayor. Right. Before we go to our 13 speakers, council members just wanted to point out individuals in the audience who could be available for questions. We have Dan Slattery from the city attorney's office, who was instrumental in drafting this bill, as well as Antonio Perez from mayor's office, education and Policy for questions as well'",
        "'speaker_0': '. And you're going to hear from the board chairs as I just see their names on the list. So for any questions that you might have, those are some individuals I just wanted to point out. All right. We have 13 speakers.'",
        "'speaker_0': 'I miscounted. I thought we had more earlier for this. So I'm going to call the first five and I can ask that you please make your way up to the front pew since we have under 20 speakers should not be an issue with the one hour courtesy public hearing.'",
        "'speaker_0': 'We'll get through everyone but the first five are happy Haines that techs Barbara Grogan, Irma Zamora and Steven Jordan. So if you five can make your way up to the front pew and we'll start with the honorable happy Haines, former councilwoman, former council president.'",
        "'speaker_0': 'You may begin.'",
        "'speaker_11': 'Good evening, council president herndon and members of the City Council. Thank you for the time and attention that you have given to this proposal over the past month. My name is Happy Haines. I live in the Park Hill neighborhood.'",
        "'speaker_11': 'As you know, I served on the city council for 13 years, and I also served on the Colorado Commission on Higher Education for nearly nine years. Tonight, I'm here as the co-chair of the Promoting Access to Higher Education Task Force, also co-chaired by my colleagues, Dr. Steven Jordan and Barbara Grogan.'",
        "'speaker_11': 'This task force worked for several months to develop the principles upon which this proposal is based in prior meetings with the City Council. You all asked very important questions and provided helpful feedback to us throughout all of these discussions.'",
        "'speaker_11': 'We all have agreed on one constant theme There is a problem. The costs of college are outpacing our residents ability to afford it, and it impacts our community. This problem is more severe today than it was in the sixties, seventies and eighties.'",
        "'speaker_11': 'Councilman Susman is right. The costs have escalated dramatically and student debt is much more severe severe burden today than in prior generations. Many Denver kids go on to college but complete their degree saddled with debt. Many go to college and do not complete their degree because of finances and are still saddled with debt, which is worse and'",
        "'speaker_11': 'to many simply do not go to college at all. These especially are the students that we aim to help. Unlike a generation or two ago, making a secure living and reaching the middle class with only a high school diploma is not only more difficult today, it is becoming rare.'",
        "'speaker_11': 'A higher education means more job opportunities, higher incomes, more contribution to public services, more civic engagement, and more resilience through economic ups and downs. The city has a myriad of needs, but Councilman Lopez's point last year, last week, is that there is a strong correlation between areas with severe infrastructure needs, low incomes and low levels of higher'",
        "'speaker_11': 'education attainment. The task force studied several alternatives a state solution, a city property tax, a property tax, or simply doing nothing and letting philanthropy pick up the slack, which we know today is not enough. The proposal before you tonight rose to the top as the best solution.'",
        "'speaker_11': 'It's implementable. It's performance based. And it is accountable to taxpayers in the next ten years. At least 30,000 students living in Denver will graduate from high school. Is that how long we wait for a state solution?'",
        "'speaker_0': 'Councilwoman, I apologize. Your time is up.'",
        "'speaker_11': 'Okay. Thank you.'",
        "'speaker_0': 'That Texan.'",
        "'speaker_12': 'Sad tax of 4535. Julian Street, Denver, Colorado. Our constitutional system divides the responsibilities of government among levels so that just as in the construction of a building, all the work gets done. But just as if electricians try to do the work of ironworkers, there's no light.'",
        "'speaker_12': 'And if plumbers try to do the work of painters, there's no water. If the one level of government neglects its responsibilities to do the work of another, some task is left undone. Today, this is important because winter is coming and we know with relative certainty that this winter several homeless people will freeze to death in our alleys'",
        "'speaker_12': 'and under our bridges, and other homeless men and women, and probably even a few children will be raped and beaten and murdered along our rivers. But of course, out of sight, out of mind in our system of government, keeping the homeless safe is the responsibility of city government.'",
        "'speaker_12': 'This issue, then, is not a choice between people and potholes. It is a choice between the academic success of some people and the life of others. Now, this may be a choice between nice, young, talented people who would would be politically popular to serve and dirty, often mentally ill people who many in the community would rather just'",
        "'speaker_12': 'disappear. But it is also a choice between you doing your job and not doing your job. Moreover, you can't escape this choice by simply asserting that if the homeless had been provided with an education, they would be less likely to be homeless.'",
        "'speaker_12': 'The causes of homelessness in our society are much deeper and more complex than education. Our only hope at this point is to provide them with a safe living, space, food, physical and mental health care and job training. Similarly, you can't escape responsibility by saying you're simply promoting debate and giving citizens the choice.'",
        "'speaker_12': 'That begs the question of why you don't submit a ballot issue to the voters to raise taxes in order to provide adequate housing and mental health care to the homeless. But of course, that wouldn't be nearly as politically popular and might require some real advocacy on your part.'",
        "'speaker_12': 'So I suspect you will pass this and go home and bask in the glow of the fact that you have contributed to the future of young Americans, and you will feel really, really good about yourself. So go and do that.'",
        "'speaker_12': 'Just try not to think about this decision. The next time you read about a homeless person being raped or beaten or murdered or freezing to death under one of our bridges or in one of our alleys.'",
        "'speaker_0': 'Thank you, Mr. Texa. Next, Barbara Grogan.'",
        "'speaker_8': 'Thank you, President Herndon and members of city council.'",
        "'speaker_1': 'I'm Barbara Grogan, a resident.'",
        "'speaker_8': 'Of denver for 46 years. And I stand before you as a mother who raised her children here and now is a grandmother who's watching my daughter raise her children here. And I could talk to you all night about how important this is for our students and our children.'",
        "'speaker_8': 'For many of our children.'",
        "'speaker_11': 'It will be their only way out of poverty. But tonight, I want to speak to.'",
        "'speaker_8': 'You as the founder of Western Industrial Contractors and their CEO for 23 years, as the past chairman of the Denver Chamber of Commerce, as past chairman of the Federal Reserve Bank of Denver, and as the past director of three New York Stock Exchange companies.'",
        "'speaker_8': 'I understand what it takes to grow a successful company, and I understand what it takes to sustain a vibrant economy. It takes a well-trained, highly educated workforce. It is the key strategic advantage. It's predicted that in 2024 and a half short years from now, 74% of our jobs, three out of four, will require certification, associate's degree or'",
        "'speaker_8': 'a college degree. And we are far from being able to provide those workers now. Our proposed ballot initiative will provide the citizens of Denver with an enormous and direct return on their investment. We will have the workforce to grow our businesses and attract new ones.'",
        "'speaker_8': 'We will have additional lifelong taxpayers to support our city. They say that the difference between a college educated and a high school educated person is $1,000,000 in their lifelong earnings. And cost avoidance. We will avoid the extensive and likely lifelong cost of social support and incarceration that follows so many who are unable to find work because of'",
        "'speaker_8': 'their lack of education. Some people have asked the question, Is this appropriate thing for the citizens of Denver to support? My answer is only if they want a vibrant and viable future for our city. When the railroads passed by Denver 100 years ago and instead went to Cheyenne, the citizens of Denver built a spur to Cheyenne.'",
        "'speaker_11': 'Our city once owned a ski area.'",
        "'speaker_8': 'I'm here to tell you it was a great investment. I was on the board of Winter Park Trustees when.'",
        "'speaker_11': 'We sold it.'",
        "'speaker_8': '20 years ago, our citizens voted to build a spectacular new airport. When so many were telling us it was a foolish boondoggle that was going to bankrupt our city.'",
        "'speaker_11': 'We are the envy of so.'",
        "'speaker_8': 'Many cities with our bold, scientific and cultural facilities district. And last year, our citizens voted to continue to fund our very progressive Denver preschool program that is also the envy of many cities around the country. I trust the citizens of Denver to do the right thing and invest in our students, our economy and our future.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you. Next is Irma Zamora.'",
        "'speaker_8': 'My name is Irma Zamora, Denver resident for more than 70 years. Today, I would like to spend my time speaking on details in the proposed scholarship measure that, in my opinion, have been either glossed over or ignored. One Funding for higher education is a state federal function, so there are reasons other cities and towns don't consider it'",
        "'speaker_8': '. The taxpayers already pay the state and federal governments to oversee and carry out this function. Denver residents will be asked to pay more for the same activity. If this measure passes, what precedent does it set for Denver to duplicate other state funded activities?'",
        "'speaker_8': 'An idea to do something new is not a valid reason to increase taxes to the mayor and Council. Tell us that the results of the scholarship fund will better prepare young adults under the age of 25 for the jobs of tomorrow.'",
        "'speaker_8': 'Yet nowhere in this proposal has found a work component working part time when not in class. A work component would introduce or strengthen the students work ethic and provide the opportunity to learn and earn at the same time, as well as gain entry level work experience, thereby giving the student an advantage at the time of graduation and'",
        "'speaker_8': 'job application. I grew up in an inner city. High school in northwest Denver is an excellent example to validate that students who learn and earn are better prepared. Three Denver residents might be more amenable to this measure if all college bound young adults could.'",
        "'speaker_6': 'Access the.'",
        "'speaker_8': 'Fund. Everyone pays, so everyone should enjoy the benefit. For the discussions on this.'",
        "'speaker_6': 'Measure have included.'",
        "'speaker_8': 'Conversations regarding the payment of student loans in default, since the measure will not be voted upon until November of this year.'",
        "'speaker_11': 'There is no.'",
        "'speaker_8': 'Authority to pay any educationally related expenses made and or dated prior to the enabling legislation. And what are we? What are we really teaching young adults about personal responsibility? Five. The cap for funding is proposed at 4000 per year, but there is nothing in the bill that speaks to the number of years.'",
        "'speaker_8': 'Is it a maximum of four years, five years or as many years until the student reaches the ages of 25? Is the funding also available to both part time and full time students? Six. The maintenance of a mate of a minimum grade point average should be required.'",
        "'speaker_8': 'If not, the student may receive a piece of paper to hang on the wall. But he most likely did not attain the knowledge, skills or abilities to get, to get or keep a job. If that is really the goal.'",
        "'speaker_8': '2.0 is a c average.'",
        "'speaker_6': 'Is that expecting too much?'",
        "'speaker_8': 'Seven. There are no expected accountability standards pertaining to the program administrators, the city, the recipients, or the universities and colleges in this proposal. This funding will essentially be a taxpayer gift and summary and in my view, a taxi driver residence.'",
        "'speaker_8': 'A new tax for the same.'",
        "'speaker_6': 'Function is not good governance.'",
        "'speaker_8': 'Be asking Denver residents to fund a program that has no accountability standards, no goals or objectives, no time limits or no program requirements.'",
        "'speaker_6': 'Is not good governance, nor is it good stewardship.'",
        "'speaker_0': 'Miss Summer more. I apologize you your 3 minutes is up. Thank you. Thank you. Next is Steven Jordan. And as Dr. Jordan comes up, I'm going to call up the next five speakers Eli Roldan, Tay Anderson, Michelle Koyama, Diamond Rival and Brenda Lucero.'",
        "'speaker_0': 'So you five can make your way up. And Dr. Jordan, you can begin your remarks.'",
        "'speaker_12': 'Thank you, Mr. Chairman. For the record, I'm Steven Jordan, president of the Metropolitan State University of Denver, located at 890 Area Parkway. Council President Herndon and members of the Council. Thank you for your leadership on behalf of our city.'",
        "'speaker_12': 'I'm joined here this evening as well by Dr. Everett Freeman, the president of the Community College of Denver, and Dr. Linda Bowman of the former president of the Community College of Aurora Metropolitan State. University of Denver is celebrating our 50th anniversary in Denver this year.'",
        "'speaker_12': 'And since 1965, we have graduated over 80,000 students. And of those, 75,000 reside in the metro Denver area, and 27,000 have a Denver zip code. Our current 21,000 student body, 12,000 of those students live and reside in the city and county of Denver.'",
        "'speaker_12': 'MSU Denver is also a partner with Denver's biggest employment center, the heart of downtown Denver. We work with companies and organizations headquartered in downtown to provide an educated workforce based on industry's needs. And they include, among others, Wells Fargo, Sage Hospitality, HDR Engineering, IAMA Financial Group, Denver Public Schools and Denver Health just to name a few.'",
        "'speaker_12': 'As an urban university, we see ourselves as a resource that develops talent and skill, largely a Denver resonance, and brings them into the Denver workforce. It was my very special privilege to serve as a co-chair with Happy Haines and Barbara Grogan on the Denver Promoting Access to Higher Education Task Force.'",
        "'speaker_12': 'But the financial challenges that face today's college students are serious. Last year, we contracted with the Hanover Research Group to conduct a survey of students who had left in one of the three previous semesters. 1300 students responded. We wanted to find out why they left the university, and a whopping 43% of the respondents reported that they left'",
        "'speaker_12': 'college not for academic reasons, but because of financial pressures. Simply put, they did not have enough money to attend MSU. Denver. Colorado's most affordable four year university. A high school education is not enough anymore to reach the middle class or to catch the wave of Denver strong economy.'",
        "'speaker_12': 'A technical certificate, an associate's degree or a college degree are needed to open the doors. According to the United States Census Bureau, individuals who achieve the following degree levels earn median annual salaries, PhDs in excess of 100,000. Masters in excess of 63,000 bachelors.'",
        "'speaker_12': '55,700 associates. 42,000. And a high school diploma. 32,500. So on average, a bachelor's degree, a hold holder earns over 2.3 million over their lifetime. These financial challenges of accessing college and completing college are a problem. And it is a problem that affects the city, its economy and the quality of the life of our people.'",
        "'speaker_12': 'This proposal will help to set a new national model that focuses not just on access and affordability, but on the support services it takes for our students to complete their degree.'",
        "'speaker_0': 'Dr. George, I apologize. Ukrainian does.'",
        "'speaker_12': 'That. Thank you, Mr. Chairman.'",
        "'speaker_0': 'Thank you. Next is Tay. Now. Exactly the name. Jesus. Can you go to the next name? It just went off the script. Eli rolled. Okay. There you go. Eli. Roland, go ahead.'",
        "'speaker_7': 'Hello, everyone. I am Ellie. I come from Burnham neighborhood. I'm a senior at West Leadership Academy. I'm also a DPS Student Board of Education. I come from a household where both parents only have an elementary school education, which means that college to my family has been a thought until I learned about college with the money, with the'",
        "'speaker_7': 'amount of money my parents make every year, I can't depend on them to pay for my college. I'll probably be in my sixties and still paying off my student loans. Who want that? Not me. To be honest with everyone.'",
        "'speaker_7': 'I have second guessed if I should even go to college type. College tuition keeps increasing every year. I fear of being one of those students who will be financially pressured, meaning I will still be in debt with no diploma.'",
        "'speaker_7': 'Even if I continue with college until I get my diploma, when graduation, I'll be in so much debt, so much that it would be hard for me to live in Denver with the College Opportunity. Film policy helps that I can pay for my college and we'll second guess if I should even go to college.'",
        "'speaker_7': 'This opportunity will help me and my family by giving me a chance to change my family pathways. Calling me going to college can actually impact my younger brother and my future children. College Opportunity Fund will help me pursue my dream of becoming a nurse.'",
        "'speaker_7': 'I'll probably work my way up to become a pediatrician. I plan to attend either University of Colorado Hospital in which I have visited earlier this week, or New York University, in which I have strong application thanks to my teachers.'",
        "'speaker_7': 'That's all. Thank you.'",
        "'speaker_0': 'Thank you. Thank you. Next is Terry Anderson. Good morning. City Council President Herndon and.'",
        "'speaker_9': 'The rest of city council. My name is Tony Anderson. I'm a rising senior, Emmanuel High School. Right now. I hold the position as.'",
        "'speaker_0': 'The student principal and I also serve as the Student Board of Education representative for this school. I am also the sitting Youth City Council President for our city right now. The DPS tax proposal affects me. It affects me because.'",
        "'speaker_9': 'I don't know if I'm going to be able to pay off college. I want to be.'",
        "'speaker_0': 'The next mayor of Denver. I want to be the next governor of Colorado, and I want to be the next president of this country. But I don't know if I'm going to be able to fulfill those dreams without.'",
        "'speaker_9': 'Me being able to pay for college. My I do not have the GPA to go off because.'",
        "'speaker_0': 'I messed up my freshman year. I'm not the perfect student. I messed up and I've made mistakes.'",
        "'speaker_9': 'But I'm overcoming all of my mistakes. When I'm asking what I am saying right now is that. I need this from you guys. I need you. We as a city need your vote because it's.'",
        "'speaker_0': 'Students like me that may have started off on the wrong path, but that can.'",
        "'speaker_9': 'Always turn into a success. The deed, this type of funding for them.'",
        "'speaker_0': 'It is with your vote that change starts. And so that I so.'",
        "'speaker_9': 'I really ask is that you as a city council think how many and how many students you're going to impact and what the future holds for our city and county. Thank you.'",
        "'speaker_0': 'Thank you. Next, we have Michelle Caggiano.'",
        "'speaker_6': 'Good evening. My name is Michelle Kwame, and I am the very proud principal of Skinner Middle School in the Denver Public Schools. I am here this evening representing myself. I am a product of DPS. In fact, I grew up just down the street in the Baker neighborhood before it was trendy.'",
        "'speaker_6': 'I grew up with a single parent and was also raised by my grandparents. I am a Latina with Japanese with a Japanese surname and recognize that my skin color and last name have afforded me opportunities that my classmates growing up in Denver did not necessarily have.'",
        "'speaker_6': 'I attended CU Boulder and received my first year of college on scholarships. The shock value of student debt in my last three and a half years of school was daunting. And luckily, through teaching and being part of AmeriCorps, through Teach for America, I was able to pay back all of my student loans through service.'",
        "'speaker_6': 'There are many students, however, who don't have the opportunities that I have benefited from. My story is not the norm. Many of my peers from elementary and middle school live lives different from mine and are facing challenges that I did not encounter.'",
        "'speaker_6': 'As a middle school principal in northwest Denver, my staff and I instill on a daily basis the importance of education and stress, college and career readiness. For many of my students, we are already working to break the barrier and the belief that college is not financially possible.'",
        "'speaker_6': 'When they see their older siblings dropping out of college due to the crushing financial burden, they are discouraged. Middle school students should be focused on setting goals and not worried about how they will pay for their education. But the current reality is hard to ignore.'",
        "'speaker_6': 'After all, many of those older siblings were in their shoes a few short years ago, striving to perform at a high level and aspiring to graduate from college. Instituting a dedicated funding stream for college affordability could give those students a better shot at making that admirable dream a new reality.'",
        "'speaker_6': 'This group has the power to institute a system that will begin to close the opportunity gap for students whose college prospects are limited due to their background. Providing students this chance to fulfill their educational potential potential benefits not only those individuals and their families, but society as a whole.'",
        "'speaker_6': 'We must prepare our citizens for the jobs of the future without forcing them to endure a financial burden that impacts their livelihood. We tell our students every day to strive towards college. In fact, at Skinner, we gave a T-shirt out to every student last year that said College Bound on the back.'",
        "'speaker_6': 'And yet, students who walked across the stage at eighth grade continuation a few short years, a few short years ago, hard workers with every aspiration of going to college, who also graduated at the top of their class in high school, are not yet in college.'",
        "'speaker_6': 'Kevin is working construction with his dad. A rally is serving pizza. Alex is bagging groceries at Sprouts, all intended to go to college but found the price tag out of reach. It will take a long time to work at working those jobs to save the money necessary to fund college education.'",
        "'speaker_6': 'The opportunity of college is not what we promised them when they were in school.'",
        "'speaker_0': 'This going on here. 3 minutes is up next. Thank you. Next, we are diamond diamond rival.'",
        "'speaker_8': 'Thank you, counsel, for the opportunity to speak today.'",
        "'speaker_6': 'My name is Diamond Rebel.'",
        "'speaker_8': 'I grew up in southwest Denver and graduated from John F Kennedy High School in 2009. I am here today to tell you about my college story. I attended the University of Colorado at Boulder after graduating high school, and I received a Fulbright scholarship.'",
        "'speaker_8': 'Graduating in 2013 with my bachelor's in Integrative Physiology. Attending college didn't just make an impact on my life. It completely changed it. Not only did college allow me to receive an education, it allowed me to grow as a person.'",
        "'speaker_8': 'I was able to attend a major university, have my first roommate travel and overall gain important life experiences. Receiving my degree led me to my first job as a research program coordinator at a local Denver hospital.'",
        "'speaker_6': 'Has laid the foundation.'",
        "'speaker_8': 'For a path to a master's degree and ultimately to my dream career. If it wasn't for the Denver Scholarship Foundation, I wouldn't be standing here today with these experiences and accomplishments under my belt. Nor would I have attended college as a first generation college student.'",
        "'speaker_8': 'Like many of my peers, my parents had never seen a faster they had never seen a college application or knew how to write an entrance essay. They had no idea how to pay for college. With the help of DCF in their future center.'",
        "'speaker_8': 'These foreign processes were made familiar. College and money to pay for college was no longer an unobtainable idea. It was 100% possible. The Denver Scholarship Foundation not only provided resources for going to college, they provided a mentorship and support throughout the entire college experience.'",
        "'speaker_8': 'Up until I walked across the stage to receive my diploma, Dsf played a vital role in my life and in the lives of other students like me. I couldn't thank them enough for giving me the opportunity to succeed.'",
        "'speaker_8': 'So please vote tonight to refer this to the Denver ballot or I'm sorry to the November ballot, and hopes that more students like myself can.'",
        "'speaker_6': 'Have the opportunity to succeed. Thank you.'",
        "'speaker_0': 'Thank you. Next, we have Brenda Lucero. And as Mrs. Cicero comes up, the final three speakers are Juliette Quinonez, Isiah Ramirez and Eddie Cohen. So you three can make your way up to the front pew. And Mrs. Sara, you can go ahead and begin your remarks.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_10': 'Good evening, City Council. My name is Brenda Lucero. I live in Westwood, neighborhood of Denver, Colorado, and graduated from John F Kennedy High School. Thank you for holding a public hearing about this important topic. Today I am coming to you as a proud Denver native who attended Denver public schools in my elementary and secondary years.'",
        "'speaker_10': 'I had limited financial resources growing up, was eligible for free lunch, and worked very hard to be an outstanding student so I can go to college and pursue a career that allowed me to be an effective contributor.'",
        "'speaker_6': 'To our beautiful.'",
        "'speaker_10': 'Community, as well as one that allowed me to improve the quality of life for my family. My story, upbringing and ambitions are similar to many students across the.'",
        "'speaker_6': 'District.'",
        "'speaker_10': 'Who desire to obtain post-secondary education. I am a University of Denver alum and grateful to be able to say that I graduated debt free thanks to the financial support, a combination of scholarships and other support services that I received as a high school student and college undergraduate.'",
        "'speaker_10': 'My success as a young adult and young professional is highly attributed to the resources that are made available to me, both through scholarships and dedicated time spent with counselors, teachers, mentors and community leaders that form my support network.'",
        "'speaker_10': 'As a senior in high school, I applied to about 150 scholarships. Out of the 150 I was awarded eight, one of which was the Latin American Educational Foundation. This equipped me with the resources that were crucial in shaping a positive trajectory that will infinitely influence my personal and professional life.'",
        "'speaker_10': 'Without the supports, I would have been faced with a different path. I am in support of the Denver College Affordability Fund initiative because of the great impact that this initiative can have on our youth and on the future of our city.'",
        "'speaker_10': 'There are thousands of students who are highly qualified, competitive candidates, students just like me, who are declined the financial support that they deserve in order to attend college simply because of the funds are not available or the support programs are not currently able to meet the needs of the growing population.'",
        "'speaker_10': 'Please vote yes tonight on sending this bill to Denver voters so that we can all have a say on this important priority. Thank you for your time.'",
        "'speaker_0': 'Thank you. Next, we have Juliette Quinonez.'",
        "'speaker_7': 'Good evening. My name is Juliet Quinonez, and I am a product of Denver public schools. I went to Brown Elementary and Valdez and also to Skinner Middle School, and I graduated from North High School in 2004. And I am here on behalf of the Latin American Educational Foundation and myself.'",
        "'speaker_7': 'First, I want to thank you for holding this hearing on this very important topic that will impact our youth and our future. I am the oldest of four, and I am the first to graduate from my family. I grew up in a household where education was valued, and even though neither my parents graduated high school, going to'",
        "'speaker_7': 'college was expected of us. And although my parents had no idea what the admissions process was like, I was very blessed and surrounded by so many community members who helped me navigate the higher education system. I found two amazing mentors, Ricardo and Pam Martinez, who helped me throughout the journey of going to college.'",
        "'speaker_7': 'They helped me understand financial aid, scholarship applications, proofread my essays, took me on college tours and even took me shopping for clothes so that I'd be ready for an admission interview. With their help and that of the Latin-American Educational Foundation, I was able to secure enough private scholarships so that I can graduate from the University of Denver'",
        "'speaker_7': ', where I received my B.A. in sociology and political science since 2008. My parents both worked two jobs and could barely afford to pay the rent and keep food on the table. Without this assistance, all private school and all other private scholarships, I would have never been able to afford college, graduate and be who I am now.'",
        "'speaker_7': 'We all know that the average tuition in Colorado has increased by 50%, which is putting college out of reach for many Denver residents and students. My siblings one who is studying mechanical engineering at SIU Denver, my younger brother who's studying architecture at Metro State University, and my sister who's getting her political science, also Metro State are struggling'",
        "'speaker_7': 'to find financial aid and scholarships to graduate. All three of them currently work part time jobs of an average of 30 hours a week to help pay their way through college. My siblings, like so many other high school students I work with, have the grit and determination to earn a degree.'",
        "'speaker_7': 'This investment in college access and completion will help Denver students close that gap so that they can access education at their high school and complete their degrees. My college degree has opened so many opportunities so that I can give back to my community and be able to provide a better future to my six year old son, Ivan'",
        "'speaker_7': ', who today started his first grade at Denver Center for International Studies. With that in mind, I urge you to please vote yes tonight to refer this to the ballots that all Denver voters may consider this very important proposal.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_0': 'Thank you. I Ramirez.'",
        "'speaker_9': 'Either. Before I speak, I'd just like to thank the City Council for giving me this opportunity to talk today. So as I mentioned, my name is Lisa Ramirez. I am also a product of DPS. I attended Chinook Elementary Merrill Middle School and graduated from Abraham Lincoln High School in 2011.'",
        "'speaker_9': 'To tell a little bit back about myself, I'm a I'm a son of Mexican immigrants, the oldest of three males, and the first to graduate from a from a public from a private university. From the University of Denver.'",
        "'speaker_9': 'As I mentioned before, my parents are immigrants, so they only have a high school education. They don't know the process of filling out a FAFSA. So an out of college application or everything else that entitles the process of applying to a college.'",
        "'speaker_9': 'With this in mind, I did not know where what I wanted to do once I graduated high school. Until I came to the future center, which was run by the Denver Scholarship Foundation. If it wasn't for their help and the help specifically of Cindy Castillo, I would have known that I wanted to attend the University of Denver'",
        "'speaker_9': '. Of course, the University of Denver is a private institution which has.'",
        "'speaker_12': 'A higher price tag.'",
        "'speaker_9': 'And for that reason. They were able to provide me scholarships, but I wasn't able to pay. You know, the entire tuition just because I did not earn a full time, a full scholarship. But thanks to the two scholarships like the Denver Scholarship Foundation and the Latin American Foundation, Latin American Education Foundation, I was able to pay for'",
        "'speaker_9': 'most of my college. However, I did graduate with some loans. But I'm proud to be a graduate of the University of Denver. As I mentioned, I am the oldest of three males. My second youngest brother is attending the University of Denver, where he is currently a sophomore.'",
        "'speaker_9': 'And my youngest brother is at East High School. A college degree has meant the world to my family. It's provided an opportunity to me to follow my passion.'",
        "'speaker_12': 'To follow a career.'",
        "'speaker_9': 'Which I am interested in. I currently work at a technology startup called Pizza Investor. It is. It's been an awesome day because I was offered a full time salary and I am the first person in my family to get offered a full time salary.'",
        "'speaker_9': 'As you can see, it has changed my future thanks to the assistance that I received from ESF and ESF. I have a clear future as to what I want to do in my life and in my career, and I'm forever grateful for that.'",
        "'speaker_9': 'So I just urge you to please vote tonight on this ballot so that all Denver voters may consider this important proposal. Thank you.'",
        "'speaker_0': 'Thank you. Eddie Cohen.'",
        "'speaker_4': 'Mr. President, members of council, I am the son of two high school dropouts, and despite having several degrees in credentials, I have over $100,000 in student loan debt. My name is Eddie Cohen. I'm a first generation college graduate.'",
        "'speaker_4': 'I live in Aurora and I work in Denver. I serve as the executive director of College Track Colorado, where a program that supports underserved students for ten years from the end of eighth grade through college completion, as well as provides scholarship support.'",
        "'speaker_4': 'We serve about 150 high school students and college students from Aurora, and we're expanding into southwest Denver at the end of the school year. Our program provides, I want to emphasize, high touch and ongoing support for underserved students, an often overlooked and critical element to college success.'",
        "'speaker_4': 'We have the capacity to only serve 300 high school students and a full site at a time. With the support of this measure. We have the opportunity to help more students matriculate to and through college. A student in our program is three times more likely to attain a degree than their peers.'",
        "'speaker_4': 'We all know the numbers and we've heard compelling testimonies here tonight. 50% of adults in Denver actually has an associate degree or higher. Yet we have one of the highest equity gaps between whites and nonwhites in the nation.'",
        "'speaker_4': 'Additionally, the rising costs of tuition make it nearly impossible for low income students to afford college, even with sizable loans or creative legislative measures like freezing tuitions or freezing it at 6% growth rate per year. I can speak from experience when I say these programs provide critical financial and success.'",
        "'speaker_4': 'I worked three jobs when I was in college. What student loans? And I was a teen parent. That was in the late 1990s. If we took that same amount of income that I made, then I couldn't pay for a fourth of college, not a fourth.'",
        "'speaker_4': 'College track is excited to work in Denver because of the history of this city. An innovation. How we experience growth, the things that we do. Right. We hope that the city council will join college struck Colorado in support of this measure and the thousands of students that it will impact.'",
        "'speaker_4': 'It is easy to find reasons not to do something. Instead, look for reasons to do something. Give our students a chance at success. Give them a chance at a degree. Just like members of this council. Thank you.'",
        "'speaker_0': 'Thank you, Mr. Cohen. Council that concludes our speakers is now time for questions. A member of council and I'll wait. Councilman Flynn, you're.'",
        "'speaker_5': 'Thank you, Mr. President. Could I ask HL Ramirez, who was just up here? Hi. Hi. Hi. Congratulations, by the way. You said that you had scholarship assistance from both the Latin American Education Foundation and the Denver Scholarship Foundation.'",
        "'speaker_9': 'That's correct.'",
        "'speaker_5': 'I just want to make sure that I heard it correctly.'",
        "'speaker_12': 'Yeah, that's correct.'",
        "'speaker_5': 'Thank you. Can I ask Dr. Jordan question? Hi.'",
        "'speaker_12': 'How are you this evening?'",
        "'speaker_5': 'Oh, I'm hanging in. How are you?'",
        "'speaker_12': 'I'm doing terrific.'",
        "'speaker_5': 'Can you tell me if you can? If you're prepared. What is the average cost of a full time for a full time student at Metropolitan State University in this current academic year.'",
        "'speaker_12': 'Including living expenses, housing, just tuition and fees?'",
        "'speaker_5': 'Let's just talk tuition and fees.'",
        "'speaker_12': '50 $800, 50 $800.'",
        "'speaker_5': 'And do you know I don't know if you were prepared for this, but do you know what it was ten years ago?'",
        "'speaker_12': 'Hmm. I don't know, because I would love to have that. I would. I would. Well, I. I wouldn't want to speculate.'",
        "'speaker_5': 'Okay. Thank you. I appreciate that. We've had enough speculating on other issues in this room in the past. There is also president of Community College of Denver is here as well. I'm sorry.'",
        "'speaker_12': 'That's correct. Dr. Freeman and Dr. Freeman is in the audience. Okay.'",
        "'speaker_5': 'Could I ask him to come up?'",
        "'speaker_12': 'Ever.'",
        "'speaker_5': 'Hi. I had the same question. Do you know what the average full time cost for tuition and fees is today at CD and what it might have been in 2005?'",
        "'speaker_12': 'Can you come up to the podium? Can you come up to the podium?'",
        "'speaker_5': 'I can't hear him.'",
        "'speaker_10': 'He sings.'",
        "'speaker_12': 'Okay. All right. Okay.'",
        "'speaker_5': 'Is there anyone here from the Denver Scholarship Foundation?'",
        "'speaker_9': 'I.'",
        "'speaker_5': 'Can you come up? Sir. Could you introduce.'",
        "'speaker_12': 'Yourself?'",
        "'speaker_14': 'Sure. Name Easley, executive director of Difference Scholarship Foundation.'",
        "'speaker_5': 'And how are you doing?'",
        "'speaker_9': 'I'm doing well.'",
        "'speaker_14': 'Counselor.'",
        "'speaker_5': 'Can you tell me how many students, how many individuals you are assisting this year with the Denver Scholarship Foundation who are from who are residents of the city and county of Denver?'",
        "'speaker_14': 'We assessed roughly 1700 to 2000 Denver public school graduates each year. I would speculate because I don't know exactly that over 90% of those are residents, the city and county of Denver. Mm hmm.'",
        "'speaker_5': 'Okay. 1700 or 2000. That's pretty consistent over the years.'",
        "'speaker_14': 'Yes.'",
        "'speaker_5': 'Okay. And what is the average if you know, what is the average amount of assistance that each of those individuals receives?'",
        "'speaker_14': 'The median scholarship for four year college is 20 $800.'",
        "'speaker_12': '20 $800. Okay.'",
        "'speaker_5': 'Wow. Okay. And is there someone here from the Latin American Education Foundation? Thank you, sir. Could you come up?'",
        "'speaker_1': 'And good evening. Hi.'",
        "'speaker_9': 'I'm Jim Chavez, executive director of the Latin American Education Foundation.'",
        "'speaker_5': 'Thank you, sir. We met at a committee meeting. Thank you very much for coming tonight. I have the same questions. How how many students this year from Denver, from city and county of Denver are you assisting this year?'",
        "'speaker_1': 'And two different two different answers of our.'",
        "'speaker_9': 'Scholarship recipients that we you know, we help out 100 and 2030 year, 55% of them. So 55%. Those numbers are from the Denver City County of Denver scholarship recipients. We help hundreds and hundreds of students every year and their families helping them through and understanding and navigating that college going process.'",
        "'speaker_9': 'Now, I tell you, it's about the same. Over 50% of those students and families are Denver residents.'",
        "'speaker_5': 'Okay, I missed the whole number. What was the whole number?'",
        "'speaker_9': 'Scholarship recipients. Where you are. Scholarships, 920 hundred dollars a year. Okay. Over half of those are Denver. Denver residents.'",
        "'speaker_5': 'Thank you. So 60 to 70, 60 or 65. And do you know what the average or I guess average or median, if either one would would be. Okay.'",
        "'speaker_9': 'Of scholarship.'",
        "'speaker_5': 'Amount? Yes.'",
        "'speaker_9': 'So we have a tiered approach. So that matches the cost of attendance for our students that are attending a four year research institution. Our annual scholarship is from us is a $2,000 award, 1500 dollars for those students attending one of the state college levels, Metropolitan State University, Mesa, Western Adams State.'",
        "'speaker_9': 'And we have a smaller scholarship of $500 for students attending the community college system. Excellent.'",
        "'speaker_12': 'Okay. Thank you.'",
        "'speaker_5': 'Mr. President. I don't quite know who to address this to, so maybe I'll address it to you as the sponsor of the bill. Do you know how many other scholarship organizations are involved in who could be involved in this program?'",
        "'speaker_0': 'The co-chairs for that task force. I'll have that opportunity to ask.'",
        "'speaker_5': 'Miss Grogan or Ms.. Haynes.'",
        "'speaker_0': 'Or how many.'",
        "'speaker_5': 'How many other how many other organizations, scholarship organizations might participate other than DFS and Elif?'",
        "'speaker_11': 'I'm thank you, Councilman Flynn. I believe it that we identified somewhere in the neighborhood of 12 to 15 organizations. So these organizations that we have had a chance to talk to about their services, there could be others. But these are the most prominent organizations.'",
        "'speaker_5': 'Okay. Thank you. Do we know how much? Well, I guess I could add up if I did multiplication. But how much between L, F and DFS did they award then in 2015? I think I have a point. I promise.'",
        "'speaker_0': 'So, councilman, is that you want to have them.'",
        "'speaker_5': 'I just wanna make sure my math is okay. If DFES had about 2000 students and their average awards to 800 and if L.F. had 120 and half of them live in Denver and and the average award was 2000.'",
        "'speaker_5': 'If I did that math, that would be an accurate amount of that aggregate. We agree on that. Okay. Yeah. Thank you. Okay.'",
        "'speaker_14': 'Sorry, I'd be happy to follow up specifically in how many students we brought in each specific year, but since we started, our first cohort was 27 and we've awarded 4600 students that have graduated from Denver Public Schools. So the average, the mean average is over 2000.'",
        "'speaker_14': 'Okay. The median is 2800.'",
        "'speaker_5': 'Tis 2018. But you said you do. You have about 1700 to 2000 individuals every year.'",
        "'speaker_14': 'For the last two years, it's been roughly between. Somewhere between 1518 hundred.'",
        "'speaker_5': 'And you started in 2007, did you say?'",
        "'speaker_14': 'Yeah. First cohort of pilot students, which was from three high schools, were 27.'",
        "'speaker_5': 'Okay. And 4700 individuals have benefited.'",
        "'speaker_14': '46 of that ten students have received 46. Yeah.'",
        "'speaker_5': 'Okay. You don't know how many of those were from Denver.'",
        "'speaker_14': 'I the all of my Denver public school graduates.'",
        "'speaker_5': 'All are Denver public. Most of them. Most.'",
        "'speaker_12': 'About 90%. Okay.'",
        "'speaker_5': 'Thank you, Mr.. And that's all I have for now.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I'm going to ask our city attorney a question. Dan, if you wouldn't mind coming to the microphone. We had a question that came up last Monday when this was on first reading, and the question was about the cap.'",
        "'speaker_8': 'He said There's a cap in the first year and the question is, can that cap change in subsequent years? And what's the the process for it to change if the answer is yes.'",
        "'speaker_4': 'Okay. And I'm Dan Slattery in the Denver City Attorney's Office. So two things. And I was anticipating maybe that or a similar question. The cap is an annual cap. And when when when you read through both the organization reimbursement and the debt relief programs, you see that it's an annual application process and is intended to apply annually'",
        "'speaker_4': 'per student and it can change the corp, the the nonprofit corporation that would be established if this were passed. Would have the ability that board would have the ability to increase the cap.'",
        "'speaker_8': 'And there's no there's no limit on what how high that.'",
        "'speaker_4': 'It's limited by the consumer price index increases in the metro area.'",
        "'speaker_8': 'So if a student has applied to multiple organizations and gets funding, if it's. These dollars if they're being awarded these dollars. How how is it being coordinated so that it's known that a student is only getting 4000 or are they allowed that amount per organization?'",
        "'speaker_4': 'The annual cap is.'",
        "'speaker_8': 'Per student.'",
        "'speaker_4': 'Is per student per year, and also the cap can't be aggregated. So if you're being supported through an organization and that organization is being reimbursed the following year and you also as a student are applying for debt relief, then you can only get a total of $4,000.'",
        "'speaker_8': 'Okay. And that coordination is supposed to be happening by this governance body.'",
        "'speaker_9': 'Yes.'",
        "'speaker_8': 'We'll be overseeing how these dollars are being.'",
        "'speaker_4': 'It's a not it will be a separate nonprofit corporation with this the seven member board, which which will have a lot of responsibility and a lot of administrative details like that to oversee and work out.'",
        "'speaker_8': 'Okay. Those are the only questions I have right now. Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega, Councilman Cashman.'",
        "'speaker_12': 'Thank you, Mr. President. And Mr. Slattery. A couple more questions. I'll I'll ask them both because they're related. As I understand it, the they'll be a nonprofit form to distribute whatever funds might be raised. And the scholarship money for a particular student goes to the scholarship provider based on satisfactory progress in the student's education.'",
        "'speaker_12': 'Is that correct?'",
        "'speaker_4': 'Yes, that's one of the eligibility criteria is you have to be making satisfactory academic progress.'",
        "'speaker_12': 'How is that progress measured? And then the question that was asked, I believe, by Ms.. Mora as to how many years can a student continue to draw from the program if other qualifications are met?'",
        "'speaker_4': 'Well, the limit. Let me see how many. The limit on the only limit is an age limit. So you're a Denver resident. You you your final year of school. You you can't hit 25. So that's the. And then the entire program is ten years.'",
        "'speaker_4': 'Can you repeat the first part of your question, though, Councilman?'",
        "'speaker_12': 'Yeah, the first question was, how do you measure progress?'",
        "'speaker_4': 'Oh, it's. And that is as as determined as is established by the higher ed institution. So under the ordinance, it's just it's the school.'",
        "'speaker_12': 'That the school sets that the ordinance doesn't have. Right.'",
        "'speaker_4': 'Guidelines that the ordinance simply requires satisfactory academic progress as determined by the school.'",
        "'speaker_12': 'Okay. Thank you. And one other question, Fran, and that's all for you, Mr. Slattery. Thank you for any of the educators that might be here, Mr. Jordan, or someone else. There have been concerns. I think Miss Haynes mentioned earlier concerns about the high cost of tuition throughout the educational complex.'",
        "'speaker_12': 'And I'm wondering if you care to address your feelings as to whether Colorado institutions are holding the line sufficiently or have more work to be done? Sure. Thank you, Councilman. I'd be please respond to that. I think clearly we all understand where our heart station system in Colorado is.'",
        "'speaker_12': 'We understand we're ranked 47th in the country and that that has put particularly difficult pressure on tuition. However, I think we need to put it in context. I mentioned that our tuition today is and fees, mandatory fees are 50 $800 a year.'",
        "'speaker_12': 'That puts us in the lowest quartile in the United States. We currently have the lowest tuition of any four year institution in the United States with 15,000 or more students. And I think throughout the system, whether you're talking about the community colleges, whether you are talking about the four year regional comprehensive, you're talking about the research universities'",
        "'speaker_12': ', their in-state tuition relative to their comparison institutions in other states is more affordable. We also, by every measure right now, in terms of numbers of graduates per $100,000 expended, we are number one in the country in efficiency on the number of graduates per $100,000 of tuition and fees that are spent on education.'",
        "'speaker_12': 'Clearly. Clearly, we are all very attentive to that question. The legislature has asked the Department of Higher Education to do a to provide it with a recommendation on what tuition policy should be out into the future. And I think every one of us understands that we are competing in a very free market.'",
        "'speaker_12': 'And so we run the risk in raising tuition rates that we will lose students to other institutions, both in-state and out-of-state. I take great pride in the fact that my institution has more students of color than any other institution in the state of Colorado.'",
        "'speaker_12': 'And we believe that because of the climate we provide and the and the tuition rates that that we set for our institutions, we take great pride that we have over a thousand veterans at our university. And we think that is also because of the affordability of coming to our university.'",
        "'speaker_12': 'We take great pride that of the total 21,000 students, 60% of those students are either low income, first generation or students of color. We do think we do that because we provide an affordable price. Has our tuition increased?'",
        "'speaker_12': 'Absolutely, it has. But when you are faced with a situation where I currently receive less than $3,000 per year from the state of Colorado and the only other place that is left to assure a quality educational experience is to pay for tuition.'",
        "'speaker_12': 'So even at 3000, less than 3000 plus 50 $800 from the student we are still at in terms of total general fund and tuition per student, the lowest in the United States of any institution with 15,000 or more students.'",
        "'speaker_12': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Espinosa, you're up.'",
        "'speaker_9': 'I'd like to call Mr. Easley back up. Sorry. So thank you for having a bunch of information on your website actually.'",
        "'speaker_14': 'That happy to.'",
        "'speaker_9': 'See you. I think it's a little bit dated because it states that there are 4500 students in the in that are being served, but it also states that only 800 have graduated. Is that true?'",
        "'speaker_14': 'So our numbers of this, we've since 2007 provided scholarships to 4600. That's $2,025 million that we've invested as an organization. We've leveraged another 50 million inches financial aid for those students. Three out of four of every student that's ever received our scholarship either is still persisting towards a Certificate Associates, a four year college degree, or they have'",
        "'speaker_14': 'graduated. We have over a thousand college graduates to date, sir. And just for clarification, the students that we serve on an annual basis includes about 600 new students and the rest are returning. So our scholarship is available to students for up to four years.'",
        "'speaker_9': 'Because I'm trying to. So those are, again, slightly larger. So bear with me. The numbers I was using was the 800 that was stated, and that was 18%. What you just said is closer to 20% sort of outcome.'",
        "'speaker_9': 'And so that means that we're that 60 I mean, that 80% of the students that are receiving support don't necessarily ever complete the degree.'",
        "'speaker_14': 'Now, that's that's not entirely true. This that's why I use the term they're either persisting or they've completed. We're a nine year old organization. So we have several students who are still trying to complete a college degree. And as long as we can find them on the rolls of trying, we count them as a success.'",
        "'speaker_14': 'So the numbers I have given you are persistence completion numbers, which we hold together our completion numbers, as I said, 4600 students. We've had over 1000, slightly over 1000 students completed college degree.'",
        "'speaker_9': 'So just to help me out, because I'm looking at the number of four year cycles. Did you? I am assuming you started out serving a smaller population.'",
        "'speaker_14': 'We did.'",
        "'speaker_9': 'And we said, do you have any sense about what year one was versus now the 1700 to 2000?'",
        "'speaker_14': 'So we started off as a pilot organization. And I'll be honest with you, Councilman, we weren't as sophisticated then as we are now. So if you look at our first three or four years before we had the success agreements with 32 colleges across the state, our persistence completion rate wasn't as strong as if you look at from'",
        "'speaker_14': 'two 2010 forward as we grew in partnerships both with colleges and with our fellow organizations that do this kind of work. And so the numbers that I'm giving you are based on that you are a very young organization still trying.'",
        "'speaker_14': 'So there are several students who are still trying to complete their college degree.'",
        "'speaker_9': 'Because the reason why I'm asking is the $25 million that has been used so far, and this is, again, based on the 800 number. So let's lower it. It was it was $31,250 per graduate. Of the 25 million.'",
        "'speaker_9': 'So you're you're operating slightly more efficiently than that, it sounds like. But that's that's a lot of money for four years.'",
        "'speaker_14': 'You know, if you look at the count without if you look at the cost of one year of keeping a person in prison at 30,000, if you look at the cost at four years of our scholarship, it's more than roughly about two and a half times of what we spend as an organization in four years relative to'",
        "'speaker_14': 'what we spent in one year to keep a person in prison or jail. And I'm not trying to suggest that if you don't go to college, you go to jail. If you look at the correlation of educational attainment and whether or not a person ends up in prison, it's it's obvious to obvious that there's a benefit of'",
        "'speaker_14': 'going to college. So we think that if you look at the total cost of what we do and what we leverage from our college partners and from our private partners and from our public partners, it's a pretty strong investment.'",
        "'speaker_14': 'In fact, for every dollar we invest in scholarship, there's a $9 and 59 cent return to the city of Denver. If those students come back and work in the city and county of Denver in terms of tax base available, we've been able to find roughly 500, slightly over 500 of our our graduates so far.'",
        "'speaker_14': 'And we're working to find more. But the ones that we've found, 99% of them live and work in the state of Colorado and 98% of them work in the city and county of Denver.'",
        "'speaker_9': 'So how would this added revenue source actually benefit? The concern is, is that a 20 a 20% sort of completion rate means that there's or let's just say it's better than 80%. Let's say there's only two thirds that aren't graduating.'",
        "'speaker_9': 'Do we lump those on the people that go to prison? You know, how does this money actually bean me actually increase, get us closer to two and to not having that sort of failure rate versus just keeping the status quo, just doing it with more students.'",
        "'speaker_14': 'Councilman, first of all, let me tell you how much I appreciate your question because I really do. Every day I wake up and I think about the fact that our organization has to have a return on investment. It's hard for us to get philanthropic investment if there's no difference in terms of what we're doing with with the'",
        "'speaker_14': 'students in whom we invest and whether or not they graduate. What I love about the initiative that is before you this evening is it ratchets up that that pressure. I mean, he's the executive director to have success. So I can tell you that, number one, he is our students have to meet satisfactory academic progress to get reimbursed'",
        "'speaker_14': '. Number two, key is that we're only reimbursed up to 75% of what we spend on scholarship and support services. And we cannot be reimbursed the money we received from the city in a previous year. Why is that important?'",
        "'speaker_14': 'Because it's a public private partnership, and we think that being accountable to both the city as a public entity and our private investors is very important and will make us, as well as our colleagues who do this work, a lot more efficient as organizations.'",
        "'speaker_14': 'So to sum, it ratchets up significantly the pressure on me and my colleagues to get persistence and completion. In fact, I understand there may be an incentive included in, in the wording of this initiative for for completing. And the other thing that is really important to understand, this includes students who get certificates and associates.'",
        "'speaker_14': 'And when I say college degree, people don't hear that. My my colleagues in private industry have made it very clear to me that we have a real dearth in students who are going on to get the certificates that are necessary to fill our workforce need in the city of Denver.'",
        "'speaker_9': 'Okay. Thank you. And then one more question for Mr. Ramirez wasn't. Sorry. Again congratulations on on your success in completing do you did you say you went to Lincoln? Yeah. Abraham Lincoln. So were you did you reside your family reside in the southwest part of town?'",
        "'speaker_9': 'Yes. So southwest Denver, Ruby Hill Park neighborhood, Missouri. You know that. That's okay. Are you aware that the proposed ballot initiative has a has a Pell Grant component? I mean, it is it's it's it's got a component to it that sort of that goes, what is it?'",
        "'speaker_9': 'I don't want it. It increases the sort of level of qualification and that the LA, the current Denver, the DFES or DSF and L.A. scholarship programs, while they're focused on needs based, they disproportionately sort of award in sort of the northeast, extreme northeast in the extreme southwest parts of the city, because that's where the real need is'",
        "'speaker_9': '. And by increasing this, they actually increase the the income qualification level to 90,000 a year is a family income and that I don't if you look at the if you look at the average median income for for southwest Denver, it's nowhere near $90,000 a year.'",
        "'speaker_9': 'And so that this is going to not mean that this is going to increase the amount of revenue, but it's actually going to, you know. Are you aware that this is actually going to sort of increase the the the breadth of who's available to qualify for those funds?'",
        "'speaker_9': 'So you're saying increase who's available to receive those funds. Yeah. The point. Yeah. Are you aware that it, it, it's, it's going to reach more families technically than the current revenue. I mean, the current sort of. Well, actually, I don't know the programs now I'm speaking out of turn because I don't know.'",
        "'speaker_9': 'Never mind. Scratch what I just said, Councilman. I mean, president. So that.'",
        "'speaker_0': 'You're going to have.'",
        "'speaker_9': 'Some. Yes. Right. Fine. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn, is it okay if I go to council members new and can each. All right, Councilman. New Europe. Okay.'",
        "'speaker_12': 'Thank you, Mr. Rose. Dr. Jordan, question for you, please. Going back to the service, the satisfactory rating of the school or the students progress. How do you view that that satisfactory progress of a student? Sure. So we we do it in the same way.'",
        "'speaker_12': 'I think the state of Colorado does and and has done around the country. We tend to view it as a full time student is 12 credit hours or more. And so to be making satisfactory progress towards the degree they need to complete 24 semester hours in a year, as you know, the full time load is 15 semester'",
        "'speaker_12': 'hours. So someone who took 15 semester hours every semester for eight semesters would complete 120 hour degree program in exactly four years. Someone who takes 12 hours will take five years. Our proposal actually does provide that we would provide funding for students up to six years again, subject to their satisfactory progress if they're going for a bachelor's'",
        "'speaker_12': 'degree and three years for a community college student. All right. Thank you very much.'",
        "'speaker_0': 'Thank you, councilman. New Councilman Kenny wrote.'",
        "'speaker_10': 'Thank you, Mr. President. I just want to follow up on the answer to that question. Dan, is I didn't see a six year and a three year limit in the ordinance language. Should I miss them? Are those in there?'",
        "'speaker_10': 'Because I did have I did want to clarify because Ms.. Zamora had asked that question, and I thought, it's always important if your speakers are asking questions that we try to get them answered.'",
        "'speaker_2': 'I think so.'",
        "'speaker_4': 'We're looking at the the version that I'm looking at. Happy's version had a different language. I don't see a three in a six year. There's a 25 year age limit.'",
        "'speaker_12': 'Right. Okay.'",
        "'speaker_10': 'Thank you, Mr. Slattery. And I guess I'm happy. My question was my second question was for you, if you don't mind coming back up. I appreciate you sharing some of the process and the other funding sources that you considered.'",
        "'speaker_10': 'Can you share a little more about why the DPS property tax was not pursued as the source for this potential program, as an education source of funding?'",
        "'speaker_11': 'Yes. And my colleagues can add anything. We had quite a lengthy debate, and I think at the end of the day, the the decision was we needed to have DPS focus its attention and its resources on its primary responsibility, which is to make certain that students are college and career ready and that the that that there would'",
        "'speaker_11': 'be a conflict in terms of the resources and spreading them beyond that primary mission to then also put put upon them the burden of trying to see students through success in college.'",
        "'speaker_10': 'Okay. Thank you very much. No further questions.'",
        "'speaker_0': 'Thank you, Councilman Kenny G. All right. We are back up to those. And as before, Councilman Flynn, you're up.'",
        "'speaker_5': 'Thank you, Dr. Jordan. Sorry to keep making you get up and down.'",
        "'speaker_12': 'That's what we're here for, sir.'",
        "'speaker_5': 'I'm a little confused because you were talking about the affordability of Metro State. And everything leading up to this moment has led me to believe that college is unaffordable. But you're saying you're in the lowest quartile in the nation in affordability?'",
        "'speaker_5': 'In fact, I think it might be true that three or more students could attend Metro State for the cost of one student to say, going to the University of Denver for a year.'",
        "'speaker_12': 'I haven't done the math. That's just what I would say. That's probably true.'",
        "'speaker_5': 'Yes. That's just.'",
        "'speaker_12': 'Rhetorical. Sure. So.'",
        "'speaker_5': 'So aren't you. You did express a concern up here that with with costs rising that you might lose some students to other institutions. But aren't you concerned that if this tax passes, that some of the students who would choose Metro State would instead go to the University of Denver because they now have the assistance or would instead'",
        "'speaker_5': 'go to Regis or to see you or CSU.'",
        "'speaker_12': 'So my my doctoral degrees in public policy. So I'm a policy wonk. So let me just tell you how I feel about this. I think there's a lot of conversation that's going on, not just in Colorado, but throughout the country, about young people making decisions about going to college, not because it's the right fit for them, but'",
        "'speaker_12': 'because it's the only institution they can afford to go to. I have no objections whatsoever. If a highly qualified student who has a desire and can find a program that is the right fit for them at the University of Denver, I would rather see that student end up at the University of Denver than to end up at'",
        "'speaker_12': 'Metropolitan State University if it wasn't where that student really desired to be. I think we want I think the most important thing for us to do is to find young people who are excited about living in our community, who want to contribute to it and give them the opportunity to attend the array of really great institutions we'",
        "'speaker_12': 'have in Colorado. And by the way, we do have I mean, for for all the troubles we have with financing, we have an exceptionally fine array of institutions in Colorado. And we would we should celebrate their being able have the opportunity to choose the one that's the best fit for them.'",
        "'speaker_12': 'Mm hmm.'",
        "'speaker_5': 'Thank you. So you wouldn't mind losing those students? Do you agree that when you said 50 $800 and you're in the lowest quartile and the lowest cost institution of greater than 15,000 students, that it doesn't seem that there is an affordability problem.'",
        "'speaker_12': 'No, I don't agree with that. That was exactly the reason. And the reason I pointed out in my testimony that when we talk with our students. That had dropped out. 43% said the reason they had dropped out was not because of academic issues, it was because they could not afford to go to college.'",
        "'speaker_5': 'So in the nation and regardless regarded as affordable, one of the most affordable institutions in the country. But your students don't believe that.'",
        "'speaker_12': 'I don't think it's saying they don't believe it. I'm saying they believe they do not have the means to pay for it. Okay.'",
        "'speaker_5': 'That that seems in conflict to me. But thank you. Can I ask Dan a question on. Just to clarify, the 25 year limit. Does that cut off a person when they reach their 25th birthday or their 26th?'",
        "'speaker_9': 'Then. They can't be.'",
        "'speaker_4': 'They cannot be older than 25 as of the final scheduled day of the academic year for which they're seeking.'",
        "'speaker_5': 'Reimbursement. So if they are 25, they can qualify. Yes. Okay. Okay. I was wondering what impact that might have.'",
        "'speaker_4': 'Yes. If they are 25, they still qualify.'",
        "'speaker_5': 'Excellent. Okay. Happy you're still back there. Not that I expected you would be leaving, but you said that in your in your testimony, you said that I believe a throw over the past. Ten years. 30,000 students have graduated from high school in Denver.'",
        "'speaker_5': 'DPS.'",
        "'speaker_11': 'Well, I think I think it was over in the next ten years, the expectation would be roughly 30,000 students.'",
        "'speaker_5': 'Okay from DPS or Denver residents.'",
        "'speaker_11': 'That live in Denver.'",
        "'speaker_5': 'Students who live in Denver. So potentially this could impact this could assist up to 30,000 students. Okay. Thank you. And I guess Mr. Easley. Thank you. My editor used to tell me that journalists doing math was a very dangerous thing.'",
        "'speaker_5': 'I'm sure that elected officials doing math is equally dangerous. But based on the earlier questions I had, it seems to me that. Between the individuals that you're assisting and. And I didn't hear from any others. I can't imagine that any group is larger than a DFS in terms of how much they assist members, students and based on'",
        "'speaker_5': 'your median, which was not the average. So it's fudging a little bit, but based on your median costs and the number of people you're assisted between the two organizations, I counted $4.3 million. Then that could be reimbursed to those two organizations based on the 75% limit of up to $4,000.'",
        "'speaker_5': 'But of course, your median was well below the $4,000. This tax is estimated in the first year, according to the to the ballot measure is estimated to raise $10.6 million a year. And then I imagine it would grow by some factor as sales two as sales tax rose, what happens?'",
        "'speaker_5': 'That's only 40% of the revenue that we're raising with this tax. What is intended for the rest of the 60% of this $10.6 million?'",
        "'speaker_14': 'Thank you for your question, Constable Flynn. Also, just for the for the record, I am I am one of your graduates. I graduated from Montebello High School and like Mr. Keen, I was also a teen parent and worked my way all the way through Ph.D..'",
        "'speaker_14': 'So I'm doctor easily. I normally don't use that, but when I canvased to be on the school board, I met a family that said they had never met a black Ph.D. before. I saw on a public forum I preferred to be Dr. Easily.'",
        "'speaker_14': 'Thank you. That said, your question is at the heart of this policy. That's why it's not just reimbursement to organizations like L.A. for the Denver Scholarship Foundation and in College Track and I Have a Dream. It also includes debt relief and policy, as you know very well.'",
        "'speaker_14': 'Councilman, the last thing you want to do is ask the taxpayer for their hard earned money and then leave it on the table. And so that's that's the challenge for this city. This initiative created nonprofit to make sure that through the 39 eligible colleges throughout the state that we work with the financial aid office and that any'",
        "'speaker_14': 'student who could qualify for these funds, which you estimated 60% is, is aware that that they can work with the city to get up to $4,000 sent to their lenders and to their college to help them with indebtedness.'",
        "'speaker_14': 'It's very important that that be in there. As many of you know from the history, their scholarship foundation had had begged a similar question in the past, really focused on the Denver Scholarship Foundation. And thanks to the community leaders, we had an epiphany that this wasn't about us, this was about Denver.'",
        "'speaker_14': 'And so we let go and gave it to the task force that worked with the mayor's office of the. The initiative before you tonight is really about Denver students. It's not about organizations. As I said earlier, it does ratchet up the the gray hairs that I'll get trying to get success as an organization, but as a montebello'",
        "'speaker_14': 'graduate who thank God, both my kids I had when I was the teen parent of both college graduates as well. I understand the importance of every student finishing. So to answer your question, I think the policy has addressed the need.'",
        "'speaker_14': '10 million is not enough for mathematicians. And if you look at cost of attendance, it's a very little bit when you start talking about somewhere in the neighborhood of 3 to 4000 students a year, it's going to require a lot more commitment from our 39 colleges and state commitment from organizations like DCF to ramp up our private'",
        "'speaker_14': 'fundraising to to match what the city is doing. But I do think it's good policy, and I think it's well thought out. And although I'd love to have seen an earlier proposal, I am happy to say this is not about Denver Scholarship Foundation.'",
        "'speaker_14': 'This is about the kids in Denver.'",
        "'speaker_5': 'Thank you. That's all.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Councilman Susman, you have a question you like to ask here. You haven't asked to have the ability to ask it.'",
        "'speaker_6': 'Oh, sure I do. I do have a question. Go right.'",
        "'speaker_0': 'Ahead.'",
        "'speaker_6': 'And Dr. Jordan, sorry to put you back on the spot again, but I wonder if you could come up, please. Dr. Jordan, I know we've been colleagues before, and I know what a fabulous job Metropolitan State College has done, and I thank you for your leadership.'",
        "'speaker_6': 'And so I'm going to apologize first if some of these questions are a little bit difficult, but I bet for you they won't be. What I'd like to focus on is the elements of this ballot proposal. In this ballot proposal, are there any requirements of reports from Metropolitan State College?'",
        "'speaker_12': 'There are not requirements of reports from the college. There certainly is a an obligation on our part to identify students who would be a graduate of a Denver high school who would otherwise be eligible for some form of of of assistance through this program.'",
        "'speaker_6': 'Thank you. Are there any in this ballot proposal? Are there any criteria which Metro must meet for student achievement in order to receive these funds? Are there is there anything in this ballot proposal that says to Metro, these are criteria you have to meet?'",
        "'speaker_12': 'So there are not in this proposal, but there certainly are in the new higher education funding formula that was brought about by former Speaker Farentino, which places a significant emphasis for every institution in the funding, both on retention of students and on actual graduation, and provides even additional bumps for every institution that in particular does that with'",
        "'speaker_12': 'a Pell Grant student. So the state, through its appropriation process, has clearly said retention and graduation rate is our priority, and we're creating a funding system that is more reliant on those goals.'",
        "'speaker_6': 'Thank you. That that is the state's responsibility. Are there any requirements in this ballot measure that that require you to increase your retention or completion rates? That is, are there any when when you receive tax money for tuition, do you have any requirement to this in this ballot?'",
        "'speaker_12': 'So increase your receiving money for tuition. The student is receiving money.'",
        "'speaker_6': 'Right. But when the student the money that the student spends for tuition are you have any responsibilities or criteria to report on that?'",
        "'speaker_12': 'Certainly not. Not to the city, but certainly to the state and to the federal government. We do.'",
        "'speaker_6': 'Thank you. Appreciate it.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman, because I'm going to take a year out.'",
        "'speaker_8': 'Thank you. The string of questions has raised a few more questions. And let me start with Dr. Easley, if you wouldn't mind coming back to the microphone. Can you tell me what the average cost per student is just on the services that are provided by Denver Scholarship Foundation?'",
        "'speaker_14': 'Thank you for the question, Councilwoman Ortega. I'm just for clarification. The average cost of the Denver Scholarship Foundation or the average.'",
        "'speaker_8': 'Scholarship, the services that are provided.'",
        "'speaker_14': 'We spend depending on the institution. And I hedged on this because it matters if whether or not they're at a community college or Colorado College, but roughly at a community college to make it happen in terms of support services, etc., you need roughly about 1400 dollars.'",
        "'speaker_14': 'In some cases, we're able to get grants to do this. For example, we have a grant at the Community College of Denver where we're able to spend that roughly 1400 in addition to our scholarship on students. In some cases, we're not able to do that.'",
        "'speaker_8': 'So does that 1400 count towards the cap in if this legislation passes? Does it count towards the cap?'",
        "'speaker_14': 'From my reading of the of the policy, you cannot receive more than 4000 regardless of what you spend. And just to make another point that's really important, that means that I have to continue to get leverage, private investment.'",
        "'speaker_14': 'And that's one of the things that I love most about this policy, is that it does not release me or my organization from our relationship with private donors. In fact, the more private money we're able to raise and the more success wherever they have with that private money, the more city money we're able to access.'",
        "'speaker_8': 'So. Can you tell me then if the. Counseling is spent on students who may not end up pursuing a scholarship. For example, I know you do work in the high schools trying to assist students who are seeking various scholarship dollars as they're approaching their senior year and trying to figure out where they want to go to school'",
        "'speaker_8': '. So how how does. How does that apply the money that you're spending on staff for students who may or may not end up being a college student to access a scholarship?'",
        "'speaker_14': 'Again, thank you for a great question. In the case of the Denver Scholarship Foundation, we would not seek reimbursement on what we do with the free college level. We have a strong partnership with Denver Public Schools. We also have several private organizations that sponsor our future centers.'",
        "'speaker_14': 'That would not be what we would seek. Our challenge are to first our scholarship amount. We would love to be able to fit to improve the quality of what we provide in financial aid. So that's one of the challenges and priorities for the organization, is to see if we can increase our scholarship amount so we narrow the'",
        "'speaker_14': 'unmet need for students on an annual basis and to increase our investment in colleges that students attend where they are really faced with both social and academic challenges, things that happen outside of the classroom that put pressure on whether or not they're able to to persist and graduate.'",
        "'speaker_14': 'And, you know, I understand as well as a former teen parent and from a low income single parent family, there's a lot of pressure on me as a young man to quit college and get a job so I can help my mother pay the mortgage for my siblings.'",
        "'speaker_14': 'So I get it. And it's very important the financial aid is necessary, but not sufficient for kids to complete. Oftentimes you need both social academic support and learn how to be an advocate for yourself, know when and where to get help.'",
        "'speaker_14': 'And those are all very, very important. And that's what I love about this policy, is it encourages organizations like the Denver Scholarship Foundation to pay attention to things in addition to financial aid that first generation low income students need.'",
        "'speaker_8': 'What I'm trying to understand is. How the counseling process works at the high school level. Mm hmm. And I'm going to ask our city attorney in a minute to help me understand if there is any percentage split on how much can go towards reimburses reimbursement versus new students that are being recruited out of at a high school'",
        "'speaker_8': '. So my my next question is about how, for example, Denver Scholarship Foundation overlaps or collaborates with college in Colorado, who also does some work in high school with students who are looking to pursue higher ed.'",
        "'speaker_14': 'Again, great question. And I learned growing up in my Belo it's better to cooperate than compete. Although you may think I'm big enough to play for the Broncos now, I wasn't always this size. And so, yeah, I've carried that attitude into my professional career.'",
        "'speaker_14': 'And so we have a written agreement with 21 organizations that do similar work, including the Colorado Department of Higher Education, so that we don't stumble over each other. So what are you going to do and what are we going to do?'",
        "'speaker_14': 'So that was a win for you, a win for us. And most importantly, it's a win for students. So the short answer is we believe in collective impact.'",
        "'speaker_8': 'Okay. My next question is for Harvey Haynes. Thank you, Dr.. Easily. KP Do you have information on how much Denver Public Schools spends on college prep counseling services for high school students that are looking to pursue higher education?'",
        "'speaker_11': 'No, I'm sorry, Councilwoman. I couldn't quote that number to you right off the top of my head. And particularly because our counselors have multiple roles, not a college readiness and college preparation, as well as assistance with students in their high school careers.'",
        "'speaker_11': 'And so sometimes the you know, those lines blur.'",
        "'speaker_8': 'So is there like an average number of college counselors in each high school? I know the sizes of our high schools vary across the board. So can you just.'",
        "'speaker_11': 'It would. It would I think it would be a little misleading to try to give an average number for high school. And here's the reason. We have a student based budget process that gives us an amount of dollars to each school based on the number of students that are enrolled.'",
        "'speaker_11': 'Those schools decide themselves where those dollars are spent. So each high school determines how many counselors and what and how many teachers and how many intervention specialists and all of those things. So there isn't, you know, no term.'",
        "'speaker_8': 'And how much is spent on college prep part. Other words, they determine how much they determine based on the.'",
        "'speaker_11': 'Needs of the student, the students in their school. I can tell you this. Number one, because of additional assistance, both through federal funding and from state funding to add counselors, we have over the past year added counselors in all of our high schools because it is a strong need.'",
        "'speaker_11': 'And many of our high schools have had a, you know, a one counselor per 500 student ratio, which is very high. And and you can imagine how difficult it is to give students the appropriate support. Many of our high schools have really worked to hire additional support in counselors, in student advisors and through other means, including coordination'",
        "'speaker_11': 'with the futures centers. In order to provide that assistance to our students on and getting ready for college.'",
        "'speaker_8': 'In the future centers is a DPS.'",
        "'speaker_11': 'The Futures Centers is a partnership between Denver Public Schools and the Denver Scholarship Foundation. And I would point out, I think to the point the question that you were asking earlier, so the the reimbursements for support under the ordinance is not directed to the future centers that are in within DPS.'",
        "'speaker_11': 'They're directed to students who are enrolled in a college or a certificate program. So the so the thrust of the support services under this proposal is for students is for the support for students who are in one of those programs to help them persist.'",
        "'speaker_8': 'So that reimbursement is not done for students who are in high school.'",
        "'speaker_11': 'That's right. It's not it's not applicable to our future centers in Denver public schools.'",
        "'speaker_8': 'So the work that College in Colorado does works primarily in the high schools, trying to get students ready to go on to college, very similar to what Denver Scholarship Foundation does. Are they, in fact, eligible to be reimbursed for the work they do for students that are helping get into college?'",
        "'speaker_11': 'Again, to the extent that those services are provided to students who are enrolled in a program. So if there if college in Colorado is continuing to assist students who are enrolled in a two year community college or a four year institution or a certificate accredited certificate program, then yes, they would be eligible.'",
        "'speaker_8': 'Okay. Thank you. Thank you. And my last two questions are for Dan Snyder, if you wouldn't mind coming back up. So let me get back to the question that I asked earlier. I'm trying to find my notes here.'",
        "'speaker_8': 'So let me jump to this 1/1. Can you outline the process per the language by which any new organizations could become eligible to? To work with students and take advantage of these resources to assist students.'",
        "'speaker_4': 'So the the requirements for an organization to benefit from funding through the city created nonprofit are on page nine of the bill. They have to be duly incorporated and in good standing under the Colorado nonprofit Corporation Act and the IRS as a tax exempt organization.'",
        "'speaker_4': 'They also have to have existed and operated as a college scholarship and support service entity for not less than three years. So that was a decision to ensure a track record before. Before funding, and then they have reporting requirements to remain in good standing.'",
        "'speaker_4': 'There are reports required to the the city created nonprofit.'",
        "'speaker_8': 'And I'm assuming they have to raise their own money if they're fronting the scholarship and then getting reimbursed back.'",
        "'speaker_4': 'Yes. Because they can only be reimbursed for private funds.'",
        "'speaker_8': 'And can you clarify if the language speaks to a split on what percentage goes towards reimbursement versus what percentage can go to new students? Or is that all basically too determined by the new government's body?'",
        "'speaker_4': 'Just. There's no split. But I'm confused on on what you're splitting between.'",
        "'speaker_8': 'So is there. Are we is does the language say 60% of the dollars should go.'",
        "'speaker_4': 'Oh I see.'",
        "'speaker_8': 'Student for the old enrolled into college versus you know 80% students who are already in.'",
        "'speaker_4': 'No there's no split like that. And nor is there a split articulated between the organization reimbursement side and the debt relief side.'",
        "'speaker_8': 'Okay. Okay. Thank you. I have no further questions.'",
        "'speaker_0': 'Thank Councilman Ortega Guzman as. Do you have a clue?'",
        "'speaker_11': 'Excuse me. Councilman, if I can clarify one answer to the question about college in Colorado. So the organizations that are eligible to be reimbursed must be nonprofit institutions. And so college in Colorado, being a government entity would not be eligible to be reimbursed.'",
        "'speaker_11': 'So I wanted to be sure I clarified that.'",
        "'speaker_8': 'Thank you for thank you for sharing.'",
        "'speaker_0': 'Councilman Espinosa. Okay, if I go to Councilwoman Clark. Right. And then a chance to ask a question. Come on, Clark, you're up.'",
        "'speaker_12': 'Thank you, Mr. President. I have two quick questions. Can our attorney, Mr. Slattery, come back up? Can I just clarify that this you know, Dr. Easley had mentioned earlier that this ordinance is not about one organization. In fact, how this is written.'",
        "'speaker_12': 'The eligible kids would have to be residents of the city and county of Denver, correct?'",
        "'speaker_4': 'Yes.'",
        "'speaker_12': 'And there's a residency requirement built into their.'",
        "'speaker_4': '36 continuous months of rest Denver residency prior to attending.'",
        "'speaker_12': 'Okay. Thank you. And then if I could ask quick question of the honorable Miss Haynes. Earlier, my colleague asked a question about the different funding mechanisms that were looked at to fund potential. You know, for kids to go to college by leveraging if we had leveraged this or looked at this under a DPS funding model.'",
        "'speaker_12': 'It seems to me that that funding would have only been able to be used for Denver public school kids. But by leveraging this funding mechanism through this mechanism, this will now be eligible for all kids beyond Denver public schools.'",
        "'speaker_12': 'Is that correct?'",
        "'speaker_11': 'That is correct. Councilman.'",
        "'speaker_12': 'Thank you very much. Think that's all, Mr. President.'",
        "'speaker_0': 'Think they can count on that? They're happy. Councilman Espinosa, you're up.'",
        "'speaker_9': 'All right. I would like to call the honorable happy Haines. Yeah.'",
        "'speaker_8': 'Oh.'",
        "'speaker_9': 'So I'm sorry. Every time we talk about this new stuff comes up. Otherwise, I would have asked well in advance. So you mentioned that you expected 30,000 students over the next ten years to graduate from Denver schools. What percentage in any sense about what percentage?'",
        "'speaker_9': 'At least based on what we know now, what percentage would go on to post-secondary education that would be eligible for. Well, you know, just in general, how many what percentage would be going to on to college or community college or something?'",
        "'speaker_11': 'So it's over. It's more dangerous for me to be doing the math than, uh, Councilman Flynn. But let me add, because that was over a period of years. So let me let where I'm going with let me just say that we estimate it and I'm going to ask staff to correct me if I'm wrong, if I'm if'",
        "'speaker_11': 'I'm wrong, that approximately 65 it's so not over the ten year period, but approximately 6500 students on on an average attend college in Denver. And that's not a.'",
        "'speaker_9': 'Know where I'm going with this is is if it were 10,000 over ten years as 3000 students a year at $10 million, that's 33,000 I mean, 30 $300 of eligible money. I mean, per student, that's not extrapolating it over 44 years of education.'",
        "'speaker_9': 'But that means that if you had 25% that went on to to school, to programs and were eligible to sort of get money, you could actually fully fund every kid that went to college for 33 I mean, 3300.'",
        "'speaker_9': 'Dollar scholarship. But after if you go half me now, if you expect half of those students now, you reduce that number by half. So I'm just trying to figure out and.'",
        "'speaker_11': 'So great question. I mean, it involves, you know, a crystal ball to some extent. And it's one of the reasons why flexibility was built into the the ordinance to enable the the nonprofit to understand the demand each year.'",
        "'speaker_11': 'And our hope is that particularly the new students that we're trying to reach out to will will swell those numbers. But it could mean that the average amount of of reimbursement would change over the years. It's it's hard to predict.'",
        "'speaker_9': 'So then of those 3000 students that are on average coming out of Denver schools, this goes back to the other question I was starting to ask. What is the maximum eligible EFC that that you guys were targeting? You had a multiplier.'",
        "'speaker_9': 'And I couldn't remember what that multiplier was and I'm sorry.'",
        "'speaker_11': 'So the maximum eligible.'",
        "'speaker_9': 'Expected family contribution that would still be eligible for this money.'",
        "'speaker_11': 'So I expected family income is entirely based on the family's income. So there's there's no way to pull a number out that represents all of those students. Right. What the what the ordinance provides is that students are eligible on a on a sliding scale scale for families up to two and a half times of Pell eligibility.'",
        "'speaker_11': 'So students who are lower income students on a sliding scale and this would be determined by the nonprofit would be eligible for larger amounts up to that 4000 per year.'",
        "'speaker_9': 'Okay. So two and a half. Two. Two and a half of the Pell eligible.'",
        "'speaker_11': 'So so what we're trying to do is is provide eligibility for students who are whom who may not be low income students and eligible for the higher amounts based on their income but still are are racking up debt and therefore in need of some assistance.'",
        "'speaker_11': 'Those students at the higher levels that two and a half times of Pell eligibility would not be eligible for as much reimbursements or support as students who are lower income.'",
        "'speaker_9': 'So then again, I won't extrapolate it over the 30,000 expected, but of the Denver students, the mean of the students that we would say eligible this year, what percentage of that graduating class would meet that 2.2.5 X threshold?'",
        "'speaker_9': 'You any sense about how many students in this year's graduating class would actually be eligible to get money through this program?'",
        "'speaker_11': 'Um, no, I, I don't know. I mean, you, Dr. easily could provide that only based on the number of students in Denver Scholarship Foundation. And you could extrapolate from that.'",
        "'speaker_9': 'Great. Thank you.'",
        "'speaker_14': 'Thank you, Ms.. Haines. Thank you for the question, Councilman. So if you look at DPS population of 90,000 students, two thirds of DPS students qualify for free or reduced lunch. And that is an excellent proxy for palatability. So if you look at the fact that, you know, you get two thirds of the students qualify for free or'",
        "'speaker_14': 'reduced lunch, and that's the largest provider of education in the city. You know, I can't speak to what we have at our private institutions or how many students are choosing to go to Jefferson County schools or other school districts adjacent to ours.'",
        "'speaker_14': 'But I can say if you use Denver as a proxy, there's a there's a there's there should be significant demand for this. We also did some preliminary look at at one point of what it would take for the Denver Scholarship Foundation to to serve all DPS students.'",
        "'speaker_14': 'And, you know, currently, we invest about 4 million a year in scholarships. That number would go up over over 9 million. Just in the small percentage of DPS kids who don't qualify for free or reduced lunch. They're more likely to go to college and they're more likely to persist.'",
        "'speaker_9': 'So that sort of and that would be funding at the current levels that you fund.'",
        "'speaker_14': 'That would be if we expanded our eligibility beyond the current level that we look at. And right now we're at one and a half times Pell.'",
        "'speaker_9': 'Because that was my next question was.'",
        "'speaker_14': 'So we're actually more more conservative than this would be as an organization.'",
        "'speaker_9': 'Great. It just in in in talking about this, suddenly it looks like you have nearly won a very, very high percentage of coverage on essentially eligible students that graduate from Denver.'",
        "'speaker_14': 'We have limits to who we cover.'",
        "'speaker_9': 'No matter what you cover. But by virtue of adding essentially $10 million into the stream. All right. And increasing the threshold to two, two and a half times Pell. Mm hmm. You almost. That's that's a signal.'",
        "'speaker_14': 'I think we, you know, you've you've got an adequate amount to to take a start in to your question about how many students we know that 74% of the jobs in four and a half years are going to require a certificate associates, a four year college degree.'",
        "'speaker_14': 'And even for those students who right now may not be compelled to get a postsecondary degree, we note we expect that to increase. And briefly, I remember when I started the Denver Scholarship Foundation in 2008, there was a gentleman who would I would say good morning to every year, every morning when I went into the garage, and'",
        "'speaker_14': 'I'd say good evening to him when I left. And now it's a machine that says, please, in search of parking ticket. So there's one last job that's available to people with a high school diploma. Denver is one of the hottest cities, as you know well in the country in terms of technology, in terms of our workforce.'",
        "'speaker_14': 'And so there's a high demand for skilled labor. And, you know, I'm not the one to speak to. This space is lots of business leaders in the audience. But I can tell you, I've heard loud and clear that there is a very strong need for more and more educated workforce in the city of Denver.'",
        "'speaker_9': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Espinosa. All right. Seeing no more questions, the public hearing is now closed and we'll move to comments. I'll defer my comments to the end. So anyone want to chime in? Councilwoman Black, you're up.'",
        "'speaker_6': 'Thank you, Mr. President. And thank you for all of you who are here tonight and who have worked so hard on this. Education is so important. We were talking about tuition. I remember when I went to see you a long time ago, I was shocked at my bill, which was $495 my freshman year.'",
        "'speaker_6': 'I am a graduate, as are my mother, my grandmother, my husband, cousins, aunts, uncles and my three kids. I have worked in our schools as an employee and as a volunteer and in our DPS future centers, which we all know are college counseling centers that are funded by the Denver Scholarship Foundation.'",
        "'speaker_6': 'I've been a supporter of the Denver Scholarship Foundation since its inception in 2007. I even interviewed some of our future center coordinators who were in those first three schools. I've seen firsthand how a scholarship can help change a student life, get them into college, and help them complete college.'",
        "'speaker_6': 'It's so important for the kids and for our state. Yes, education funding in Colorado is broken. We all agree on that. But this is something that could be a fix for thousands of Denver kids. I don't think anyone is suggesting that it's going to fix our whole state, but it's something that we can do at the local'",
        "'speaker_6': 'level to really impact our city and our workforce. As Dr. Easily said, we need educated kids to fill the jobs and to be clear to anyone who may just be tuning in on TV. Our vote tonight is not to raise taxes.'",
        "'speaker_6': 'It is to decide whether or not to put this on the ballot for our voters to decide. Affordability in Denver is a real issue. We read about it in the paper every day, and that includes housing, cost of living and college affordability.'",
        "'speaker_6': 'And families have just one budget. And if we can help a family pay for college, we're helping them live here in Denver. And I think we can give someone a chance with less than a penny on $10. I think it's something worth investing.'",
        "'speaker_6': 'I do share the same concerns that many people share, and I agree with The Denver Post that voters generosity is not limitless. But I do trust the voters to make the right decision. So thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Black, Councilwoman Sussman, Europe.'",
        "'speaker_6': 'Thank you, Mr. President. You know, regarding sending this off to debate, I'm pretty sure let's not fool ourselves. Are referring it to the ballot will be seen as our support for it. Y'all have heard me before about my concerns about this particular proposal.'",
        "'speaker_6': 'I again thank the group for asking me to the party and even knowing that I would have some disagreements, I thought I was in quite admiration of you all to do that. Being against this is like being against motherhood and apple pie.'",
        "'speaker_6': 'Indeed, the fresh faced, ambitious young people that came up to talk to us were very eloquent and of course, that college tuition costs are out of sight. In fact, the only other sector of our economy where the prices have raised so much, haven't risen so much higher than inflation is health care and college tuition costs have outpaced'",
        "'speaker_6': 'even health care for debatable reasons, not the least of which is the loss of government support. Even though it's a very unpopular. City Council has an obligation to be responsible electeds. And we have to make difficult decisions, unpopular ones.'",
        "'speaker_6': 'We need to be responsible about our city's financial needs. They are great. And we need to be clear about our sphere of responsibility and our sphere of authority. We can't expect the citizens of Denver to fix the problems of out of control tuition costs and low retention and completion rates.'",
        "'speaker_6': 'Our state and federal government. Have that responsibility, as do the colleges themselves. We are a city government. We are not a city. Government is completely removed from education government. There is no educational institution over which we have any authority.'",
        "'speaker_6': 'None. Yet? None. There are no pieces of this proposal, this ballot proposal that holds any of the actual entities with the responsibility, such as the state, the federal government or the colleges that holds them responsible for the costs of tuition or the retention rates.'",
        "'speaker_6': 'As you heard Dr. Jordan say, I think very eloquently. This particular proposal doesn't require any reports from the college, and I would imagine not from the state or the federal government either, about how the money is being spent and where the non-profits, the extra people who are going to be helping.'",
        "'speaker_6': 'They have a responsibility to report to us. But the ultimate people who are going to receive tuition dollars have no responsibility to report on anything they're doing with the money. We're going to be asking. Denver City Council people.'",
        "'speaker_6': 'To raise taxes to give to. Organizations that will have no need to report on the ways in which it has been spent or the ways in which they have improved things by the money that they've received. And we're going to ask them to take on responsibilities that they don't normally have, which is responsibilities for educating our people'",
        "'speaker_6': '. Now, education is very important, but I, I, I promise you, 29 years in higher education, I don't know if we want to wade into those waters. These are complicated water's edge, higher education. Are we are we asking the city to take on the responsibility of higher education because the state and the federal government haven't been able to'",
        "'speaker_6': 'do much with it? I just. Can't see supporting this ballot measure, although it does tug at the heart strings of the needs that we have for people to go to college. It's just not in our wheelhouse as city council government.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Councilman Cashman, you're up.'",
        "'speaker_12': 'Thank you, Mr. President. For me, what we have here tonight is a bona fide conundrum. I see valid reasons why, as a voter, a citizen of Denver would vote for this proposal. And I see valid reasons why a citizen of Denver might choose to vote otherwise.'",
        "'speaker_12': 'To not fulfill our obligation to educate our children, to educate the next generations is to me, completely unacceptable. The fact that our state representatives continue to fall short in funding education in Colorado is equally unacceptable. The fact that this matter is primarily the purview of state government is painfully clear.'",
        "'speaker_12': 'There are infrastructure needs that we must address as city representatives. There is the housing crisis we all face. We need to find funds to provide housing for for the homeless and for our lower and middle class families. There are neighborhood planning needs that in this particular booming economy.'",
        "'speaker_12': 'These times we need to address will be asked to continue the lodgers tax to fund the National Western Center. Rebuilding, which I think we definitely must do in the near future, will be asked to continue the the tax for the scientific and cultural facilities district, which we absolutely must do.'",
        "'speaker_12': 'I believe the proponents of this bill have a real challenge ahead of them to convince voters to vote for this tax increase, while the less than a penny on $10 may seem insignificant. As my colleague said before, voters notoriously have a limit on what what they will choose to fund.'",
        "'speaker_12': 'The gut reaction that I have had from my constituents thus far has not been positive towards this measure. It's early, but I've yet to get my first email saying Go for it. So again, for me, this is a real conundrum.'",
        "'speaker_12': 'I agree that the colleges need to be held accountable with tuition. I would like to see this proposal have more hard and fast requirements on the institutions. I'd like to see more definite time limits and so on. But I don't think for me that it's appropriate for this body to legislate this matter by crushing this proposal tonight'",
        "'speaker_12': '. I think. There was a matter that came before a previous council a couple of years ago. Most of you are aware of it was a land trade between the city and Denver public schools, and I didn't like the vote that came down.'",
        "'speaker_12': 'But the main thing that I didn't like was our city was robbed of the opportunity to debate two very excellent competing land uses, and I don't want that to happen here. I think our decision on whether or not or how to educate our children deserves a broader discussion.'",
        "'speaker_12': 'So and I wish to be clear, I am in no way indicating my vote should this matter come to ballot. But I definitely want to provide the community the opportunity for this important debate. So I will be supporting this this evening.'",
        "'speaker_0': 'Thank you, Councilman Cashman. Councilwoman Canete.'",
        "'speaker_10': 'Thank you, Mr. President. I want to thank all of the speakers for being here tonight, for getting late. And we know the benches are hard, so we appreciate you being here. And I also want to thank the proponents and council president Herndon.'",
        "'speaker_10': 'This proposal has changed a lot over the last year and a half or so. And, you know, they deserve great credit for their flexibility and taking early feedback and really making it a much broader proposal. I think that in addition to some policy differences, some of my colleagues and we are disagreeing about what our role is here'",
        "'speaker_10': 'tonight. And I just I need to spend a minute on that. You know, I very much agree with Councilwoman Susman. If this were simply about taking a conversation to the community. My role would be to stay neutral and let that conversation happen.'",
        "'speaker_10': 'And the way to do that would have been a citizens initiative and gathering signatures. And if that had happened, I can promise you I would have stayed neutral. But when you bring a measure as an ordinance, you know, to put something on the ballot through this council, I believe I am being asked as a policymaker to weigh'",
        "'speaker_10': 'in with my judgment, to weigh in with my experience serving this city for, you know, going into my fifth year. And based on the information I have the information I've chaired the Budget Committee for several years on this council and have privy to the competing demands.'",
        "'speaker_10': 'I have. I have access to the places that our citizens and our residents and our businesses are asking and meeting the most from the city. And so I do believe it's my job to say whether I think this is the best rightist proposal for this source of revenue.'",
        "'speaker_10': 'And I think that's really important. There is an eloquent case that's been made and it's irrefutable regarding the need to address college access. The question I'm faced with tonight is whether this source right now is the right place for that.'",
        "'speaker_10': 'And I do believe that that's what we're being asked to do as legislators tonight, is to weigh in. So with that in mind, I have to go back to addressing some of the concerns I raised last week. And that really comes down to two issues.'",
        "'speaker_10': 'One, it is really struggling with this source of revenue at this time and the competing needs. You know, I appreciated the consideration you had of other sources, but to hear that a property tax for DPS takes it too far from their mission and risks the competing resources for their needs is exactly the same issue I face.'",
        "'speaker_10': 'It's exactly the same issue I face here at the city council, which is I have a charter and this is not in it. And I have demands that are in that charter that are not being met. And I, I that is a risk that deeply concerns me.'",
        "'speaker_10': 'But I really wanted to get there. I really did. I respect so many of the individuals who are here tonight. Your policy acumen and your eloquent case, the services you're already providing, very respected scholarship organizations. So even if I could suspend my belief and suspend my concern about the competing resources, the question then becomes, is this the'",
        "'speaker_10': 'exact right proposal? It is the best proposal. I don't like the 25 ed 25 year age limit. It really does cut out the technical workforce that Denver needs for middle income jobs who don't tend to get their certificates in education, you know, early in their lives.'",
        "'speaker_10': 'But even more than that, this is the this is the key for me. I just can't get there, which is I can't point to a definitive return on investment for dollars that go out of this community. I understand that not everyone wants to go to college in Denver.'",
        "'speaker_10': 'I understand that some people go to college in Greeley and Durango. They come back. But I can't say to my taxpayer I'm capturing and ROI on every dollar spent for Denver and I'm a team player. You know, we are part of the scientific and cultural district with the rest of the region.'",
        "'speaker_10': 'And I'm okay that those dollars leave Denver because it's a regional partnership. Their dollars come in, our dollars go out. This is us going it alone and this is us not guaranteeing a return on investment for every dollar we invest.'",
        "'speaker_10': 'And that just is the piece that that I can't get there on. I know that this is going to pass tonight based on my colleague's comments. And so I will say this. If the voters approve this, I will wish for its success.'",
        "'speaker_10': 'I will, you know, understand and believe that our voters have spoken. And so, you know, I'm in no ways, you know, planning to go out there and campaign against it. But it's my obligation to share my judgment based on the information I have in this job.'",
        "'speaker_10': 'And that information is that this is not the best proposal and it's not the right source of revenue. So those for those reasons, I'm going to have to vote against this tonight, but we will see what the voters say.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each Councilman Espinosa.'",
        "'speaker_9': 'I'm sorry about that. Yeah. I struggle. I, I my comments reflect the fact that just in the testimony today and in the testimony today, we heard that there are 90,000 students in DPS. And even if you awarded 9000 scholarships, there's nine out of every ten students aren't getting a benefit from this.'",
        "'speaker_9': 'And those I mean, what we heard was about 4500 or so students might actually get a scholarship. That number of people represent less than 1% of the total population of the city of Denver. But when you impose a sales tax, any any person making a taxable sale will pay for that.'",
        "'speaker_9': 'So 100%, even if you give your kids a couple of bucks to go to the store to buy a taxable item, 100% of the population will be paying this tax to then support less than 1% of the population.'",
        "'speaker_9': 'And so that's where I struggle. I like it conceptually, but I think this is the wrong tool because our own tax guide states that the purpose of the sales tax is to generate funds for the payment of expenses of operating and improving the city and its facilities, and for the payment of principal and interest due on certain'",
        "'speaker_9': 'municipal bonds. This is a public taxing mechanism to sort of serve a public good and to to use that instrument to serve a fraction of 1% of the population in this regard, that without any sort of mechanism to actually say Denver's going to benefit from that in the future is sort of to defer this tax in a'",
        "'speaker_9': 'way that I can use this tale's tax in a way that I just I can't refer that to ballot. There is the citizen initiative. You know, you probably could get the entire 18 year old population of DPS to sign that petition and get this thing on the ballot.'",
        "'speaker_9': 'There is a mechanism to do this that doesn't involve us trying to to program and prescribe, I mean, to sort of weigh in this way. And so it's a great idea conceptually. But the funding is is where I struggle with.'",
        "'speaker_9': 'And so those are my thoughts. Thanks.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman.'",
        "'speaker_12': 'Yeah. Well, I echo all my colleagues comments about the concerns, the pluses and minuses of this ordinance. And there's no question that higher education is a state responsibility. And we've got tremendous needs of our city. We've got to take care of those needs.'",
        "'speaker_12': 'But I also believe in educating our our kids. You know, they're the future of our city. And I want to try to do something to educate our workforce, to make sure we are successful economically in our city. So I struggle with this a lot.'",
        "'speaker_12': 'And the thing that I heard most when I go through my whole campaign and I campaigned through every neighborhood in District ten and has so many conversations with my constituents, the thing they said to me was, let me have a voice.'",
        "'speaker_12': 'Let me be a part of the decision making process. I'm tired of the city making decisions for me all the time. Let me be a part of that process. And the emails that I've gotten, I've gotten a lot of different emails, but the common theme of the emails was, let me to help be a part of that'",
        "'speaker_12': 'process. So I understand the concerns everyone has here tonight, and it's very difficult, but I want our citizens to be a part of this decision. So I'm going to vote yes for this and and hope our citizens are well educated about the pros and cons of this legislation.'",
        "'speaker_12': 'And I also want to encourage all of our citizens to get out and vote in November. The low participation of our our citizens in voting is terrible. And so we need to make sure we not only educate everyone about this ordinance, but also encourage everyone to get out and vote.'",
        "'speaker_12': 'Thank you, Mr. Chairman.'",
        "'speaker_0': 'Thank you, Councilman. New Councilman Lopez.'",
        "'speaker_12': 'Thank you, Mr. President. I admit.'",
        "'speaker_9': 'I did, but I did not get.'",
        "'speaker_12': 'The hearing to go this long. But I'm glad I did. I'm glad folks stayed.'",
        "'speaker_1': 'For the end of this. I want to know where the girls from. Barnum and Westwood.'",
        "'speaker_0': 'Where are they? Still here.'",
        "'speaker_10': 'They have homework?'",
        "'speaker_12': 'Yeah. All right. School board member. All right. Got to get. Got to buy the ticket before you get on the train. Right. Okay. I understand my colleague's reservations about about the funding.'",
        "'speaker_1': 'I understand when there is no measure.'",
        "'speaker_12': 'That holds the colleges and universities accountable and reporting or anything like that. But from what I understand, we can't even we don't even have that authority in the city to have any of the colleges report to us. Even if we did, even if we said put it in there, we wouldn't be able to legally defend it.'",
        "'speaker_12': 'I know tuition is out of control. And I know that that. On the federal level and on the state level, it's gridlock. The question itself never gets through committee. Let alone the governor's desk. And meanwhile, we're the ones footing the bill.'",
        "'speaker_12': 'Students are footing the bill. The tuition costs keep going up. And it stresses families and squeezes them out. And it prices out our students. And let me just preface what I'm about to say by saying, yes, there are some institutions that are doing their best.'",
        "'speaker_12': 'I appreciate Metro State University.'",
        "'speaker_1': 'Being here, and I'm wondering why SIU or.'",
        "'speaker_12': 'CSU or any other college or university isn't here? Well, I guess the state call a community college was here.'",
        "'speaker_1': 'But. That to me, that.'",
        "'speaker_12': 'That's what bothers me. However, it's not about the politics of the state. It's not about the politics at the colleges or in academia. It is about what's happening in our city. I was looking at census tracts, census tract maps today throughout our city.'",
        "'speaker_1': 'And I was remembering the debate that.'",
        "'speaker_9': 'We had.'",
        "'speaker_12': 'At our last public hearing, not a public hearing, but the last time we had this bill in front of us. And folks had talked about sidewalks and what we do as a municipality, what the city and county and Denver does have the authority to regulate and does have the authority to spend its budget on.'",
        "'speaker_12': 'And I looked at that map and I looked for the past. 50 years. Especially since part of our district was even part of Denver since until about 1950. I look at that map. And despite my predecessors hard work and despite.'",
        "'speaker_12': 'Advocacy. That map shows two different Denver's. That map shows great inequality. When you look at sidewalks, guess where they're missing? West of the Platte. When you look at housing stock. Where's the worst quality? Where are we hurting? West of the.'",
        "'speaker_1': 'Highway. You look at.'",
        "'speaker_12': 'Street paving when you look at Brexiteers. Every single. When you look at grocery stores and you look at transportation access. When you look at park space.'",
        "'speaker_1': 'It tells you the same story when you look at income. It tells you the same story.'",
        "'speaker_12': 'Poverty. And you go into education. And what hurts the most.'",
        "'speaker_1': 'Is that the neighborhood of Westwood? Has the lowest.'",
        "'speaker_12': 'Amount of bays in the whole city. It's in the single digits, folks. And it's not because those of us from Westwood and Barnum. Don't want to go. Or don't try. Or don't have the capacity. It's because we are priced out.'",
        "'speaker_12': 'And you look at what's happening in this city and what leads to gentrification or at least all this. It's dead. It's our family's debt and bad credit and not being able to sustain.'",
        "'speaker_1': 'A job.'",
        "'speaker_12': 'With a fight for those jobs to get.'",
        "'speaker_1': 'Over their. What's this got to do with this? Well, because those zip codes. 8020480219. They said.'",
        "'speaker_12': 'We always say a zip code should not determine your future, but it has for the last 50 years, and we are tired of it.'",
        "'speaker_1': 'And even though we've been paving streets and putting in sidewalks and trying to close the park.'",
        "'speaker_12': 'Gap and killing food deserts and putting.'",
        "'speaker_1': 'Replacing liquor stores at grocery stores, even though.'",
        "'speaker_12': 'We've been doing this until we have no nails left until our.'",
        "'speaker_1': 'Last breath, we will try. It will not it will not be enough unless we do something in the education now.'",
        "'speaker_12': 'When you look at education, you look at the schools that are performing it or not perform, were all the blue schools there are.'",
        "'speaker_1': 'East of the river. And it's not an us versus them that I'm trying to. It is an end situation. It's not either or. I'm not saying pick Denver. It's and. It's East and west. What are the things? How are we going to fix that?'",
        "'speaker_1': 'You know how we fix that?'",
        "'speaker_12': 'We give the opportunity.'",
        "'speaker_1': 'For Westwood and Barnham and Hyland Island. You guys are doing really well. Councilman Ruby Hill Every everything west.'",
        "'speaker_12': 'Of that river ath ma park, those areas that.'",
        "'speaker_1': 'Are hurting even into Montebello and Whittier and Cole, you give all those folks the opportunity to prove who they are.'",
        "'speaker_12': 'And you know what? You give those folks an opportunity.'",
        "'speaker_1': 'Just a hand up saying, here, come on. Here's a hint. Give them the opportunity and we will.'",
        "'speaker_12': 'Change the neighborhoods. We will change the cities. We will create change in those neighborhoods.'",
        "'speaker_1': 'Now, this isn't the end all be all, but $4,000 a year is a heck of a support.'",
        "'speaker_12': 'And if we can't depend on our expected.'",
        "'speaker_1': 'Family contribution and if we don't have it.'",
        "'speaker_12': 'Then there's that help up. Because not because of lack of will, it's because of lack of funding. And one thing I got to say, yes, it's constituents, maybe. Under 17, a lot of them. Very. I don't know if there's many, very many 18 year olds that are still in.'",
        "'speaker_1': 'High school, seniors in high school. I was one because I had to repeat one grade, but. Supposed to laugh.'",
        "'speaker_12': 'Their voters. And they are also taxpayers. As a matter of fact. My daughter is a taxpayer and she's only eight years old. So when we say taxpayers, it's one in the same. They are also paying the bill for themselves and they will continue to dwell on past failures.'",
        "'speaker_12': 'So I would love to see I think Councilman Cashman put it very, very well. I think it's time to put it on the ballot and let folks decide for themselves.'",
        "'speaker_0': 'Let us decide for themselves.'",
        "'speaker_12': 'And yes, get that vote out. It doesn't matter if you're pro or against. Please get it out anyway. I took a lot of time. I'm sorry. Let's move forward. Yes, let's move forward.'",
        "'speaker_0': 'Thank you. Councilman Lopez. Councilman Flynn.'",
        "'speaker_5': 'Thank you, Mr. President. Everything that was said in here and all the testimony, everything that was said about the struggles that students face in meeting the exorbitant costs of higher education and the importance of completing a degree or a certificate or an associate's degree is so very true.'",
        "'speaker_5': 'But there are agencies in this city and in this state whose core mission is education. We are not one of them. I question the assertion that a mill levy from DPS could only be used to subsidize the college tuition of students who graduated from DPS high schools.'",
        "'speaker_5': 'After all, DPS mill levy is used for anybody and everybody, whatever age, can walk into Emily Griffith Opportunity School. I don't believe we could tell a Denver student who graduated, say, from Mullen that they can't participate in this program if it came through as a no levy from DPS.'",
        "'speaker_5': 'Since DPS has told us that this is this is not something that they want to take on because they're handling so many issues with K-12. And that is true. And we have, as Councilwoman Kennish pointed out, we have core responsibilities as well.'",
        "'speaker_5': 'But since the way the program is set up as a pass through to a not to a governing body that is appointed by us, why could that not that same thing not work with DPS? This isn't something that's going to be managed here in City Hall.'",
        "'speaker_5': 'After all, the sales tax revenue is going to be done by this governing organization that we set up. So we are not one of them. We have core responsibilities that we are struggling to meet as well. Safety, affordable housing, crumbling streets and infrastructure.'",
        "'speaker_5': 'It doesn't matter. As our deputy mayor and CFO Carrie Kennedy said that to me, it doesn't matter that this is just a slight increase in the sales tax or that other cities have higher sales tax. That doesn't matter to me.'",
        "'speaker_5': 'What matters to me is what we're raising that money for. And subsidizing college tuition costs simply isn't a municipal responsibility. The problem with college affordability is the rapidly rising cost, not the inability to pay for it. We'll keep chasing we'll keep chasing these cost increases by raising more and more money for it.'",
        "'speaker_5': 'And we're satisfying the people who are raising the costs and are having no incentive to contain the costs. We think the real problem is the inability to pay these ever rising costs, when the real problem is the ever rising costs of combating the rising costs of higher education by taxing the public to try to meet those increases'",
        "'speaker_5': 'is like trying to solve the obesity problem by throwing an all you can eat buffet. I cannot ask the struggling working families of Mali, Brentwood or Harvey Park to pay anything more at the cash register when they buy school supplies or clothes for their kids so that we can subsidize college tuition cost increases.'",
        "'speaker_5': 'When they have in southwest Denver the highest response time to police 911 calls. When I have an Iraqi war veteran in a wheelchair who cannot even go down his street anymore in the winter because we don't have a sidewalk in his neighborhood or when our streets haven't been touched, some of them in 20 or 30 years.'",
        "'speaker_5': 'I cannot ask those people to pay more at the cash register to subsidize college tuition. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Flynn. Councilwoman Gilmore.'",
        "'speaker_8': 'Thank you, Mr. President. I have to say that. I've been listening to my constituents call and talking with lots of folks and listening to my colleagues tonight, and I have to appreciate the dialog. I am a little disappointed there weren't any students from 80239 or 80249 here.'",
        "'speaker_8': 'But I do know that there are students who have been served by these organizations, and I think that that might also speak to.'",
        "'speaker_6': 'Some of the barriers that.'",
        "'speaker_8': 'Arise for especially students who are first generation or students who are classified as low income to gain access to even get transportation to come and be here tonight, to have the privilege of time and to be able to sit and be here and participate.'",
        "'speaker_8': 'And, you know, I understand that everything is not addressed. Everything is not covered in this council bill, which makes it very, very difficult. But I have to believe that the return on investment in the lives that will be transformed by an opportunity by this is much bigger and broader than all of the details that we could pick'",
        "'speaker_8': 'it apart at and the communities that will be affected, making our city's workforce stronger. And I understand innately how difficult it is to run a nonprofit. I founded a nonprofit. I ran one for almost 20 years. It is the most terrifying thing every year when you know that you have to raise your entire budget.'",
        "'speaker_8': 'It's a very big adjustment for me. I haven't bought a piece of furniture from my council office because I just can't make myself spend that money. I go to surplus and pick through their stuff because I want those tax dollars to go back to the folks in District 11.'",
        "'speaker_8': 'And knowing the privilege of running a501 C3 nonprofit. The immense responsibility that goes along with that because you have foundation, you have individuals donations, who they've given you their money to have that trust that you're going to fulfill your mission.'",
        "'speaker_8': 'And the expanded reporting, accountability, financial audits that go into running a nonprofit. I know that this money will be very well spent and invested and in doing the educational work that I've done for 20 years. When you invest in human beings and you invest in lives, I'm sorry, but.'",
        "'speaker_6': 'There's no guarantees.'",
        "'speaker_8': 'Because human beings are messy. Our lives are messy, communities are messy. And that's the beauty of being a human being and living in the communities of Montebello or Green Valley Ranch. Things arise and they get messy and there's no return on your investment.'",
        "'speaker_8': 'There's a return on.'",
        "'speaker_6': 'Investment.'",
        "'speaker_8': 'In putting the money to prisons because, you know, you have your clientele there. You know, they have to eat. You know, you have to clothe them. You know that they're going to be there. And so I urge my colleagues to make that return on investment in human lives.'",
        "'speaker_8': 'I also urge the board that is the seven member board. That you have a very robust accountability and.'",
        "'speaker_6': 'Transparency.'",
        "'speaker_8': 'More robust that is than outlined in this. There's much, much more that you need to be reporting on to convey to the voters, our constituents, the young people who are investing into this, because 16, 17, 15.'",
        "'speaker_6': 'Year olds are taxpayers as well.'",
        "'speaker_8': 'Many that live in my district because they have to work to help their families out. The 10% administrative cost, you know, for running a nonprofit, kind of that magic number is 8020. Every dollar, 80% goes back to your programs.'",
        "'speaker_8': '20% goes towards administration. Because, again, when you invest in human beings and you invest in lives, you need people who are going to work within these organizations that don't leave. You need to be able to pay good wages.'",
        "'speaker_8': 'You need to pay a livable wage for people to stay.'",
        "'speaker_6': 'The worst thing that can happen, especially when.'",
        "'speaker_8': 'You invest in people's lives, is somebody stays for a year with a program and then they leave to go get a better job somewhere because they have to pay their own bills. And so that 10%, I think, is a very realistic amount.'",
        "'speaker_8': 'And, you know, my campaign slogan was Your voice, our community. Far be it for me to take my community's voice away. I want them to have the opportunity to ask all of these very hard.'",
        "'speaker_6': 'Questions.'",
        "'speaker_8': 'And to debate it. And, you know, everybody talks about the very low voter turnout in my community. That is a systemic result of folks struggling, not having livable wages and.'",
        "'speaker_6': 'Not having the.'",
        "'speaker_8': 'Bandwidth or the feeling that their voice is going to be heard. And through investing in human beings, I would predict and you can hold me to this when we invest in human beings more so, we're going to see an increase in civic engagement in.'",
        "'speaker_6': 'Parents being able to advocate for their own.'",
        "'speaker_8': 'Children in schools and for groups of people.'",
        "'speaker_6': 'To advocate for better wages, health care and benefits. Thank you.'",
        "'speaker_0': 'Thank you. Councilwoman Gilmore, Councilman Clark.'",
        "'speaker_12': 'Thank you, Mr. President. I want to I want to thank all of you for coming, for speaking, for sticking with us and to all my colleagues for the great comments and questions and debate on this for me tonight.'",
        "'speaker_12': 'This is not a choice between roads and kids. It's not a choice between housing the homeless or making college more affordable for our kids. There is no other proposal on the floor we're not weighing. Is this better than something else we're looking at?'",
        "'speaker_12': 'Is this a good idea? Is this something that we want to invest? Is this something that we want to ask the voters? Did they want to invest in? And that even with this this increase in tax, we heard from our CFO that we currently ranked seventh most affordable sales tax and we would remain at the seventh lowest'",
        "'speaker_12': 'sales tax. There is no greater investment that we can make in our city than investing in our kids. We spent a lot of time talking about the affordability of our city. How do we make sure that people can live in the city?'",
        "'speaker_12': 'What better way to invest and make sure that kids growing up in Denver can afford to live in Denver than helping them afford that college degree, that post high school education that allows them to make more money and afford to live here.'",
        "'speaker_12': 'And I certainly think that investing in our kids is a greater investment than building a stadium for our beloved Broncos. Born and raised, I'm a huge Peyton fan. But if if we were able to ask our taxpayers if they wanted to add that to sales tax, I think this is an even greater investment and that deserves a'",
        "'speaker_12': 'debate and an opportunity for voters to say, yes, I support our kids at a rate that is slightly lower than we were willing to spend on building a stadium. I think so often as happens with politics, we get into a debate about whose job it is or what the best mechanism is.'",
        "'speaker_12': 'And at the end of the day, in in our city and our state, our kids are caught in the crossfire and we're failing them. And tonight we have something in front of us that allows us to take to the voters an option to stop debating whose job it is, to stop debating where the money should come from'",
        "'speaker_12': ', or who of us should have taken action. But to say, hey, this body, this part of government is willing to stand up and put an option forward to help be a part of the solution. And for all of those reasons, I will be happily supporting this tonight.'",
        "'speaker_12': 'Thank you, Mr. President.'",
        "'speaker_0': 'Thank you, Councilman Clark. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I also appreciate the hearty discussion that we have had here tonight and the thorough and thoughtful questions and the responses that we have received. I appreciate all of you for sitting through this meeting. This discussion actually started about five and a half years ago when Mr. Tim Marcus approached then Mayor Hickenlooper asking for'",
        "'speaker_8': 'Denver to match the $50 million that he put aside for what is now the Denver Scholarship Foundation. And I appreciate Mr. Marcus's. Investment and commitment to our young people in our community. And without that program, we have many of the young people who testified that probably would not have had the opportunity to go on to college and'",
        "'speaker_8': 'to get their degrees and to be able to be here and speak as as articulately as they did and to be representing the various professions that they're now in. I see two of our young people that came to committee and testified before us.'",
        "'speaker_8': 'I agree with my colleagues about the fact that this should not be one of our core functions. I believe this should be a DPS preferred initiative, not a Denver City Council preferred initiative because education is their. Their focus and their priority.'",
        "'speaker_8': 'I also agree that we want to make sure that we have the kind of work force in our city that our businesses need. We often hear at various functions that, you know, we're all invited to that talk about the kinds of businesses that we're attracting.'",
        "'speaker_8': 'I mean, you look just at the construction industry right now and how much construction is going on. And, you know, one would argue that that's not one of these professions that we're were referring to as far as young people going to school and getting a college degree.'",
        "'speaker_8': 'But many of those that go through the apprenticeship programs are actually being educated and come out with degrees in certification, but they can't fill those jobs fast enough. And they're bringing in their workforce from other communities, other cities, because we just don't have the workforce here.'",
        "'speaker_8': 'I think it's important that as our public education system is now working to identify professions where there is a demand and a need for workers to help, you know, a lot of times young people don't know what they want to do when they get out of college.'",
        "'speaker_8': 'They know they want to go to college and they want to get a degree, but they're not sure exactly, you know, what they want to do. But by knowing and being given the opportunity to do internships with different businesses, it helps guide and shape who our young people want to become.'",
        "'speaker_8': 'And I know that that's one of the things that Denver Public Schools is moving towards, is is to help provide that. And with some of the guidance and assistance from the Denver Scholarship Foundation, I know we have a number of really good scholarship organizations.'",
        "'speaker_8': 'I'm very familiar with all the great work that the Latin American Education Foundation has done. When this conversation started last year, I believe it was last year, maybe the year before, when the talk was about just one organization being the beneficiary of these scholarship dollars.'",
        "'speaker_8': 'I was one of the people who said, you need to go back and have a much larger community conversation about this issue so that there are other scholarship organizations who can participate and that other people in this community know what's going on.'",
        "'speaker_8': 'That did, in fact, happen. There was a much broader conversation. We heard from a number of the speakers who were involved in that committee process. And, you know, what we have in in front of us, I think is not perfect.'",
        "'speaker_8': 'But I think it's important that we do invest in our kids. I remember during the summer of violence, we invested in our kids. But you know what? We were putting our money into programs that kept kids safe. We were spending money on more cops.'",
        "'speaker_8': 'We were spending money on programs that kept our kids off the streets. And that was just survival to make sure our kids were not getting caught in the crossfire of the violence that was happening in our community, where we saw a number of our kids laid to rest from the violence.'",
        "'speaker_8': 'Many of them found themselves sitting in prison from the violence. That's not the kind of investment I think we should be focusing on. This is more appropriate for the kind of investment that is important for our youth. And I have to divulge that I've got three grandchildren in high school that that may be beneficiaries of these dollars'",
        "'speaker_8': '. I don't know that that considers me to be a conflict of interest here. I wouldn't directly benefit. But the fact is we have lots of young people in our community whose parents do not have the resources to be able to afford their children, to be able to go on to school.'",
        "'speaker_8': 'And I think this opportunity that. All Denver residents will have the opportunity to vote on will give our children a fighting chance. And so I will be supporting this tonight. I do wish that it would have been Denver public schools taking the lead and not Denver City Council, because there really is a clear separation between, you know'",
        "'speaker_8': ', the role of our public education institution in this city and the role that we play. And yes, we do have many needs and many demands, and we'll be dealing with all of that as we're going through our budget process.'",
        "'speaker_8': 'We had a budget retreat just a couple of weeks ago to talk about priorities that we all want to see in the city budget. But this is one where the voters do get to decide and they make the ultimate decision.'",
        "'speaker_8': 'And I with all the many issues that we have had on the ballot in this city, we've got a very articulate and an educated electorate, and they will make the right decision that they believe is right for this city.'",
        "'speaker_8': 'So with that, I just want to thank you, Mr. President, for your efforts in working on this issue and bringing this forward. I know it's not been always an easy conversation, but it's an important one and it's important for this city.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. And I will just simply add, let's let's have a debate. I mean, most people on this dyas agree that there is a workforce development shortage. The jobs that we are bringing in, we do not have the homegrown workforce to fill those jobs.'",
        "'speaker_0': 'How do we come to a solution? It is easy to troubleshoot any ordinance that comes before us and say there's an issue here or there's an issue there, and if we do that, then we there will nothing that will ever be passed because we will never get to the perfect ordinance.'",
        "'speaker_0': 'But what we have here is something we have something that can make a difference in the lives of young people. Generational differences. And I thought as a statistic that I believe Dr. Easley said for the dollar, investment generated $9.59.'",
        "'speaker_0': 'It's almost tenfold a tenfold investment in a person. And people turn around and say education is not the purview of the municipal level. It's at the state level. And I said this last week, I'll say it again. And why are we about to debate construction defects?'",
        "'speaker_0': 'Because that is exactly a state purview. But we're going to have a conversation as well as other municipalities have already done. So if it negatively impacts our municipality, we have and we have the opportunity to do a solution, let's do so and let's just have a debate.'",
        "'speaker_0': 'The proponents of this have work to do to demonstrate to the people why this is important. But I think it would be very unfortunate if this body right here simply said we're not even going to allow it to have a discussion.'",
        "'speaker_0': 'I shouldn't fault the proponents just because they choose to go the route of an ordinance versus petition. They have that right. That is the way to do so. And so I just think this is a great opportunity to bookend what we're doing with the Denver Preschool Program.'",
        "'speaker_0': 'And when the Denver Preschool Program came out, they said the exact same things about the Denver preschool program that we're saying right now. It's not our purview. And look how a tremendous success that has been. And so we have the opportunity to do something similar, or at the very least, let's have a conversation about it come November'",
        "'speaker_0': '. Madam Secretary, roll call.'",
        "'speaker_6': 'Black eye.'",
        "'speaker_3': 'Clark, I.'",
        "'speaker_9': 'Espinosa No.'",
        "'speaker_12': 'Flynn No.'",
        "'speaker_3': 'Gilmore Cashman. I can eat.'",
        "'speaker_12': 'Lopez I.'",
        "'speaker_3': 'Knew. Ortega I. Susman No, Mr. President.'",
        "'speaker_0': 'I. Madam Secretary, please cast your vote in the results.'",
        "'speaker_3': 'Eight Ice, four nays, eight.'",
        "'speaker_0': 'Ice, four nays. 553 has been placed on final consideration and does pass. See no other business before this body. This meeting is adjourned.'",
        "'speaker_6': 'Denver eight TV's Your City, Your Source.'",
        "'speaker_1': 'Denver eight. On TV and online.'"
    ]
}