{
    "A proclamation designating the week of June 22 through June 26 as Bike Week and Wednesday, June 24, as Bike to Work Day in Denver.\n\n": [
        "'speaker_5': 'With pleasure, Mr. President. Designating the week of June 22nd through June 26th as Bike Week and Wednesday, June 24th, as a bike to work day in Denver. Whereas the city and county of Denver partners with the Regional Denver Regional Council of Governments, local bicycling organizations and cycling enthusiasts each year to plan activities and events intended to promote'",
        "'speaker_5': 'awareness of the benefits of cycling. And. Whereas, Bike to Work Day is an annual event designed to encourage people to ride their bicycles for transportation on a consistent basis to reduce congestion, improve air quality, and benefit public health.'",
        "'speaker_5': 'And. Whereas, the Department of Public Works hosts the Civic Center Park Breakfast Station, one of the largest in the region where cyclists celebrate their commute to work with free snacks, raffle prizes, music and educational outreach offered by organizations in the region.'",
        "'speaker_5': 'And. Whereas, the Department of Public Works is a major contributor in the planning and implementation of Denver's bicycle infrastructure, implementing at least 15 miles of new bikeways annually, and this year installing two protected bikeways on Arapahoe and Lawrence Streets downtown, with vertical separation between bikes and cars, and whose plans to install more protected bike lanes are contributing'",
        "'speaker_5': 'to Denver's designation as a top bicycling city and its inclusion in the People for Bikes Green Lane Project, which provides technical assistance in the installation of bike lanes. And. Whereas, the city now has more than 140 miles of on street bike lanes and SROs and more than a hundred miles of off street trails, offering recreational opportunities along'",
        "'speaker_5': 'the scenic routes and is in the process of constructing the 35th 36th Street Bridge and important pedestrian and bicycle connections from the new RTD East Line and will begin work on the Brighton Boulevard bicycle facility in late 2015.'",
        "'speaker_5': 'And. Whereas, Denver is supporting bicycling in other new and creative ways, offering on street bike corrals and bike sharing stations in places where people gather with the goal of supporting local businesses and making bike riding an attractive way to get around for more of Denver's residents.'",
        "'speaker_5': 'And. Whereas, bicycle and pedestrian safety and infrastructure continues to be a top priority for the Denver City Council of the City and County of Denver, which is supporting funding for additional and expedited multimodal improvements that will increase bicycling in our city.'",
        "'speaker_5': 'Now, therefore, be it proclaimed by the City Council, the city and County of Denver, Section one, that the council designates the week June 22nd through June 26th as Bike Week and June 24th as Bike to Work Day and encourages citizens to keep their heads up and watch out for one another and stay safe this summer, no matter'",
        "'speaker_5': 'your mode of travel and section two that the clerk of the city and county of Denver shall attest, and to fix the seal of the city and county of Denver to this proclamation, and that a copy hereof be forwarded to the manager of Public Works.'",
        "'speaker_1': 'Thank you, Councilwoman Sheppard. Your motion to adopt.'",
        "'speaker_5': 'I move that proclamation 384 series of 2015 be adopted.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilwoman Sheppard.'",
        "'speaker_5': 'Thank you so much. It is my pleasure. I think for the third or fourth year in a row now to read this proclamation celebrating not just bike to Work Day, but Bike Week and all of the wonderful progress that our city has made in becoming a truly bike friendly city.'",
        "'speaker_5': 'I really want to thank all my colleagues for that, for consistently making the investment of the city in bicycling infrastructure one of our top priorities in every single budget retreat that we've had for the last three years in a row.'",
        "'speaker_5': 'And I'd really like to thank the mayor for continuing to increase the amount of money that he puts in the budget annually to meet many of the goals that we've laid out and of course, our public works. Department for, you know, carrying that banner and working hard to make these things happened.'",
        "'speaker_5': 'And I remember when we opened up the 15th Street Bikeway, you know, that was like a wow revolutionary big deal. But, you know, it's doing what it was supposed to do. It's giving people a safe space to ride down a very busy east west corridor in downtown that has a lot of bike, a car and bus traffic'",
        "'speaker_5': 'on it. I actually ride down 15th Street probably twice a week on that bike lane, and I can attest to the fact that those improvements that we've made in the street, you know, really helped me feel more comfortable as I'm riding down.'",
        "'speaker_5': 'So, you know, I think we're doing a great job. I think we have a long way to go because we were recently designated as a a gold city in our bikes in across the United States. But we really want to be a platinum city.'",
        "'speaker_5': 'And I think, if I'm not mistaken, there's only one in the country. So we really want to aspire to get even more of our residents out of their cars and onto their bikes. Let me just tell you, when I bike to work in the morning, I get to come down Confluence Park and ride up the trails underneath'",
        "'speaker_5': 'our street grid. And I arrive and I feel so relaxed and distressed because I didn't have any traffic jams, I didn't have any crazy drivers. It's there's so many benefits to it other than just being a convenient way to get from point A to point B.'",
        "'speaker_5': 'So I just want to say that it's important that folks think about biking to work not just one day a week, but perhaps every day or at least once or more a week, and make that commitment and see how it changes your life.'",
        "'speaker_5': 'I've been doing it for like about the last month this year, and it's really been actually a lot of fun. So with that, I'm happy to to sponsor this proclamation and I don't know if anyone else has comments as well.'",
        "'speaker_1': 'Thank you, Councilwoman Shephard. Councilman Brooks.'",
        "'speaker_0': 'Thank you, Mr. President. I think, Councilwoman Sheperd, for bringing this proclamation forward. I remember probably about three or four years ago did my first bike to work, and I showed up in a bunch of kind of biking gear minus the tight shorts.'",
        "'speaker_0': 'But, you know, the Colorado Denver biking gear wasn't in my normal go to work type of gear. And and I just thought, you know, it's just a fun little exercise that we do as a city. When someone from Bike Denver told me, no, the point is that you actually use it as your transportation to work.'",
        "'speaker_0': 'So come next time in a suit. And I really didn't understand nor get nor see kind of biking in the overall multimodal system within our city and county of Denver. Until I went on a trip with people for bikes and a couple of folks from the city and to Copenhagen and really begin to understand how this system'",
        "'speaker_0': 'could work. And then we went to other cities as well. And so, you know, I think it's important that we do the the bike to work day, but I hope that it helps all of us in the city and county of Denver think about multimodal options and mode share quite differently than we had in the past.'",
        "'speaker_0': 'That right now in the city and county of Denver, 80% of our mode share is around cars. And I think one of the most important and most issues that I hear from every neighborhood is the issue of congestion and traffic.'",
        "'speaker_0': 'And so I think it's important, number one, that we as a city have a vision and get serious about our investment and implementation and to multi-modal not just bikes, but pedestrians, making sure we have transit opportunities and things like that.'",
        "'speaker_0': 'And so, you know, we can't just encourage bikes. We have to kind of put our money where our mouth is, like Councilwoman Cheryl was saying, and dedicate funds each year to increase protected bike lanes. And we know that if we have protected bike lanes, 60% of the people in this city who do not ride bikes will simply'",
        "'speaker_0': 'because they're safe, comfortable, and they're connected to the places that they want to go. So I'm really excited for this. Thank you. Councilwoman Schipper and I will be supporting this.'",
        "'speaker_1': 'Thank you, Councilman Brooks. Councilman Moran.'",
        "'speaker_4': 'Thank you. Council President Herndon. Right before I came over here, I actually saw an email from Transportation.'",
        "'speaker_7': 'Solutions, which is a.'",
        "'speaker_4': 'Transportation management.'",
        "'speaker_7': 'Association.'",
        "'speaker_4': 'Whose board I serve on, as have Councilman Brown and Councilwoman Sussman and.'",
        "'speaker_7': 'Councilman Nevitt and the whole.'",
        "'speaker_4': 'Ideas to get people out of the single occupancy vehicles, cars. I mean.'",
        "'speaker_8': 'Your bicycle might be single occupancy.'",
        "'speaker_4': 'But at any rate, I'm not the confident cyclist that many of my colleagues are. And so what interested me in this announcement is that Triple A, the Automobile Association, is going to be offering complimentary roadside assistance on Bike to Work Day, and that I thought was pretty great and shows how we're changing the number.'",
        "'speaker_9': 'And this is a paid political advertisement.'",
        "'speaker_4': 'The number is one 800 a help.'",
        "'speaker_1': 'Thank you, Councilwoman Robb. Councilman Monteiro.'",
        "'speaker_6': 'Thank you, Mr. President. I would want to say that slowly, but also kind of quickly. We've been building on shifting the mindset in the city and county of Denver in terms of people looking at riding their bikes to work.'",
        "'speaker_6': 'And I was one of those people because I was always a little tentative, as Councilman Brooks was saying, about what to wear. And so, you know, how do you come to a community meeting? You're all sweaty from riding your bicycle and everything.'",
        "'speaker_6': 'But all kidding aside, I began to look at utilizing my bicycle when I lived in the Central Valley, and I was very close to the South Platte River and the Cherry Creek, and I would just get on my bike and ride all the way into the city and county building.'",
        "'speaker_6': 'Part of that also is that, you know, there's a lot of conversation about utilizing the street grid in terms of protected bike lanes and getting to work. And that's all important. But I also just want to bring up to many people that bicycle that we have another grid and that's on the South Platte.'",
        "'speaker_6': 'On the Platte and also Cherry Creek. And you will see many people utilizing that as transportation as they're making their way through the city of Denver and possibly even to work. So I just wanted to bring out that in my mind, there's two grids, there's a regular street level, and then there is a river path.'",
        "'speaker_6': 'And so we also have that option as well. Thank you.'",
        "'speaker_1': 'Thank you. Councilwoman Monteiro. Councilman Lopez.'",
        "'speaker_0': 'Thank you, Mr. President. I you know, Councilman Brooks, it's cool to wear your suit riding your bike. And when you when you're coming from the east side where everything's nice and flat, but when you're coming from the west side, where there's nothing but hills and bar, no still no bike lanes in a lot of areas, no safe'",
        "'speaker_0': 'crossings. It's really hard. And I tried it. I've tried coming down here, I'm not so bad downhill. But going back, let's just say you got to you got to take your suit to the dry cleaners almost every time you ride your bike.'",
        "'speaker_0': 'So having said that, I think it's important that, you know, we recognize Bike to work day and that we all participate, but we also pay attention when we when we are coming downtown and we are biking down here, biking wherever we need to go, we got to pay attention, know areas that we need to improve, areas that'",
        "'speaker_0': 'we need to have, bike lanes where it makes sense. Places like Colfax, instead of having to go all the way down into the gulch and on the way back home, in the dark and in pure obscurity, you know, places where it makes sense, places where it makes sense to put down striping.'",
        "'speaker_0': 'And I think it's important that we take note of that when we when we do bike places where it makes sense to cross. Right. And it's upon us and it's incumbent upon us as a city to make sure we recognize those intersections and not just give the priority to cars right away at those intersections that we may'",
        "'speaker_0': 'stumble across like Federal Boulevard and 10th Avenue, or like the Colfax Di Viaduct, which is beyond me why we have not thought of making Colfax bike friendly and more pedestrian friendly instead of having to go under and around it and through the.'",
        "'speaker_0': 'Through the crevices of the city and maybe over our bridge some day. So we have to put our thinking caps on. Yes, it's awesome to participate in, but we have to make sure that we're identifying gaps and we are marking certain places and certain intersections where it should be bike friendly and taking that to committee.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Any comments? Proclamation three 8413 nine. Madam Secretary, Roll Call Edward Susman.'",
        "'speaker_4': 'Brooks Brown I fats I can eat lemon lopez monteiro, i. But I'm sorry. Nevett.'",
        "'speaker_0': 'You sure? Okay.'",
        "'speaker_4': 'Hi, Ortega. Hi, Rob. Mr. President.'",
        "'speaker_0': 'Hi.'",
        "'speaker_1': 'Catherine Levitt, are you sure? I thank you. All right. Madam Secretary, please close the voting, announce the results. 3939 is three. 84 has been adopted. Councilwoman Sheppard, is there someone you like to invite to the podium to receive the proclamation?'",
        "'speaker_5': 'I would like to invite several members of the Public Works Department to the podium. Please introduce yourselves. Council. President Members of council. My name is Emily Snyder, and I'm the urban mobility manager with Denver Public Works. I'm going to make my part brief as many of you are transitioning off council and this is Bike Week.'",
        "'speaker_5': 'I just wanted to say thank you very much to this council for all of their support over the past years, for bicycling and walking in this city and for making it a priority, as you have done. And with that, I'm also transitioning the acceptance of this proclamation over to my colleague Rachel Bronson.'",
        "'speaker_5': 'Thank you, Emily, and thank you. Council President and members of Denver City Council. Emily has passed the torch. It's pretty exciting. As a recently designated bicycle friendly business and community in the city and county of Denver is proud to celebrate Bike to Work Day.'",
        "'speaker_5': 'We will be celebrating, as Councilwoman Shepherd said at Civic Center Park with our annual breakfast station. We'll be celebrating, along with dozens of Denver businesses and vendors and thousands of bicyclists from across the community. Our Bike to Work Day celebration at Civic Center Park would not be possible without our many partner agencies, including Denver Parks, Parks and'",
        "'speaker_5': 'recreation facilities, public works, solid waste, public works, communications and public works right away. Services. Currently across the city. In terms of staff, we're competing in a bag to work day business challenge. We have 325 staff across the city that are registered and the leading agencies in this competition who will all be eligible for prizes.'",
        "'speaker_5': 'Are the Library Technology Services, Environmental, Health and Parks and Recreation. Back to work day, bike to work week and Bike Month would not be possible without our many partners in the community, including Dr. COG, CDOT, Spike, Denver, Bicycle, Denver's many transportation management associations and many others.'",
        "'speaker_5': 'So thank you all for recognizing this very important day and for your leadership in making Denver a world class bicycling city.'",
        "'speaker_1': 'Thank you. Thank you, Councilwoman Shepherd, for that. We have one more proclamation in Proclamation 427 sponsored by Councilman Brown. Will you please read Proclamation 47?'"
    ],
    "A proclamation celebrating the Colorado Convention Center's 25th Anniversary. A proclamation celebrating the Colorado Convention Center's 25th Anniversay.": [
        "'speaker_2': 'Thank you, Mr. President. Celebrating the Colorado Convention Centers 25th anniversary. Whereas in 1987, the Denver City Council approved funding for the design and construction of the Colorado Convention Center and in partnership with the Colorado Legislature, which approved purchase of the land.'",
        "'speaker_2': 'Ground was broken on for the center in 1988 and opened in June. 1990 is the 10th largest convention center in America. Where is the building was designed in a way that it could accommodate expansion. And in November 1999, Denver voters approved an increase in the lodgers and car rental tax to expand the center.'",
        "'speaker_2': 'It is worth noting that the architect's design included input from more than 200 national meeting planners, and that no doubt made it a better center. Whereas in 2002, the groundbreaking for the center expansion set a world record as the largest groundbreaking in history with more than 4000 participants.'",
        "'speaker_2': 'Yes, and I was one of them. And it was indeed crowded in 2004. Open is the largest public building in Colorado. 2 million square feet. And. Whereas, in 2008, Denver voters approved that increase in the largest tax for funds to increase tourism and convention marketing.'",
        "'speaker_2': 'And in since that time, 2008, the investment has reaped rewards. In Denver's tourism and convention. Business has grown 48% compared to the national growth of only 15%. Where is the Colorado Convention Center? Is known nationally as one of the greenest convention centers in the country, being the first to meet the Accepted Practices Exchange Apex Standard in 2012'",
        "'speaker_2': 'and improving its leadership in energy and environment design. LEED rating to gold in 2014. And. Whereas, The Convention Center is an economic engine for Denver, generating $500 million annually in local economic impact, employing 200 full time and more than 400 part time staff.'",
        "'speaker_2': 'Driving demand for downtown Denver's 9000 hotel rooms and welcoming nearly a million visitors in 2014. Whereas the CDC is known for its public art, including the center's favorite piece of public art, the Blue Bear. And. WHEREAS, The Convention Center is a hub of continuing education for diverse industries and professionals from around the United States and the world'",
        "'speaker_2': '. Where is the convention center consistently places its professional reviews by meeting planners is one of the top ten convention centers in the nation. Now, therefore, be it or plain by the council, the city and county of Denver, Section one.'",
        "'speaker_2': 'That Denver City Council will recognize as the Colorado Convention Center on its 25th anniversary and celebrates the many contribution the center has made to the economy, education and well-being of Denver citizens. Section two that the clerk of the city and county of Denver shall attest and affixed the sale of the city, the seal of the city in'",
        "'speaker_2': 'county Denver to this proclamation and the copies be transmitted to Richard Schaaf, president and CEO of Visit Denver. John Adams, general manager of the Convention Center. And Clint Rice, director of Arts and Venues for Denver.'",
        "'speaker_1': 'Thank you, Councilman Brown. Your motion to adopt.'",
        "'speaker_2': 'I hope that we will address this this proclamation this evening. Mr. President.'",
        "'speaker_1': 'It has been moved in seconding comments. Councilman Brown.'",
        "'speaker_2': 'Well, thank you again, Mr. President. I've been honored to serve on the Visit Denver board for more than a decade. You know, if you think about it, we've all seen the TV spots that celebrate the importance of fishermen and hunters to our rural areas.'",
        "'speaker_2': 'And their tagline on line is Hug a hunter. You know, when you walk in downtown and we are filled with convention, people here are there. They wear badges. You can't say hug a badger because, you know, that's Wisconsin and we're Colorado.'",
        "'speaker_2': 'But certainly certainly we should thank those individuals who are spending their time and money. And our city. So thank them when you see a badger around our city. And so I am grateful and thankful to be able to present this proclamation this evening and hope my colleagues will approve it.'",
        "'speaker_2': 'Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Brown. Councilwoman Sussman.'",
        "'speaker_5': 'Thank you, Mr. President.'",
        "'speaker_8': 'I'd like to add my name to this.'",
        "'speaker_5': 'I didn't see that meant that message. But I also want to thank the Colorado Convention.'",
        "'speaker_4': 'Bureau and all that you do for tourism.'",
        "'speaker_5': 'In Denver and for the great economic benefit.'",
        "'speaker_4': 'That you provide and the hard work that you do. So we're so proud of your organization.'",
        "'speaker_5': 'Thanks.'",
        "'speaker_1': 'Thank you, Councilwoman Sussman. Councilman Monteiro.'",
        "'speaker_6': 'Thank you, Mr. President. I would also like to add my name to this proclamation. It's very hard to believe that the Colorado Convention Center is a quarter of a century old already. And so happy birthday. And thank you so much.'",
        "'speaker_6': 'We're happy anniversary.'",
        "'speaker_1': 'Thank you, Councilwoman Montero. Catwoman Ortega.'",
        "'speaker_9': 'Thank you. I want to thank Mayor Pena for having the vision of moving this forward in working with our state legislature. We saw that when the convention center first broke ground. We designed it so that we could add the second half later and a number of years later.'",
        "'speaker_9': 'We were successful in doing that and designing it so that our train system could go right through the center of it. And I also want to acknowledge colleagues that I served with who worked to place the issue on the ballot to expand the lodgers tax and thank the voters for their support in passing that that allowed part'",
        "'speaker_9': 'of those costs to to be covered. The work that our convention bureau does is incredible in terms of learning about all the different conventions that are out there that they could attract to this great city. And they do a phenomenal job in in bringing those visitors to this city and selling our city, our hotels or convention center'",
        "'speaker_9': '. I don't know how many of you have been to Comic-Con. That was my most recent event that I got to enjoy, and it's just amazing, you know, the kind of interest that we have in the wide variety of activities and attractions that we bring here.'",
        "'speaker_9': 'So I want to thank my colleague, Councilman Brown, for bringing this forward and say thank you also to the employees that keep that facility running day in and day out. So thank you very much.'",
        "'speaker_1': 'And thank you, Councilwoman Ortega. Any other comments? Proclamation 427 59 Madam Secretary.'",
        "'speaker_4': 'Rocco Brown Hi, Fats. I can eat lemon lopez All right. Montero, I. Nevitt I. ORTEGA Rob Shepherd. Sussman Hi, Mr. President. Hi.'",
        "'speaker_1': 'BROOKS Madam Secretary, please, first of all, announce the results. 3939 is proclamation 47 has been adopted. Councilman Brown, is there someone you'd like to invite to the podium today?'",
        "'speaker_2': 'Absolutely. The man. Richard Schaff, please. President and CEO of Visit Denver. You're going to bring some colleagues. You bet. And as you're approaching the podium, Richard, would you please remind this audience how far in advance that you are working and your team is working to bring convention center business to Denver?'",
        "'speaker_2': 'Some of us don't know what we're going to do this coming weekend, but you're looking out ten and 30 years, which I've always been amazed by that. And welcome, Richard.'",
        "'speaker_10': 'Yes, thank you. Richard Schaap, president, CEO of Visit Denver. John Adams, general manager of the Colorado Convention Center. Of course, can't raise director of arts and venue. It really is a team effort. But to answer your question, Councilman, we have business booked out to 2031 right now.'",
        "'speaker_10': 'So give me an idea that's 5 to 10 years is our tomorrow and Comic-Con. We had 106,000 go through the turnstile, just to give you an idea of the economics on that. But anyway, I just want to, on behalf of everyone here, tell you how thankful we are that you recognize the value of the Colorado Convention Center'",
        "'speaker_10': 'and the value of conventions and tourism. So thank you very much.'",
        "'speaker_2': 'Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Brown. All right. We are moving on to the resolutions. Madam Secretary, please read the resolutions.'",
        "'speaker_4': 'From business development. 372 resolution. Part of the mayor's report was then pointed to the Denver Convention Center Hotel Authority Board 387, a resolution approving the mayor's appointment to the facts. Mayfair Business Improvement District Board of Directors.'"
    ],
    "Refers to the ballot at the November 3, 2015 coordinated election a question concerning the approval of an Amendatory Intergovernmental Agreement with Adams County governing the development and use of certain property at Denver International Airport. (BUSINESS DEVELOPMENT) Refers to the ballot at the November 3, 2015 coordinated election a question concerning the approval of an Amendatory Intergovernmental Agreement with Adams County governing the development and use of certain property at Denver International Airport. The last regularly scheduled Council meeting within the 30-day review period is on    .  The Committee approved filing this bill at its meeting 6-9-15.": [
        "'speaker_0': 'I don't want to recount all the virtues of this historic move forward together with our brothers and sisters in in Adams County. But I do want to recognize and acknowledge and thank for being in the room. Two commissioners from Adams County, the esteemed chairs, Tedesco and Steve O'Driscoll, waved to the watching public all for people who are'",
        "'speaker_0': 'watching Channel eight this evening. So appreciate you guys being here and thanks for all your hard work on this.'",
        "'speaker_1': 'Thank you, Councilman Levitt. Councilwoman Shepherd.'",
        "'speaker_5': 'Thank you. I do have a few questions for the airport team. My first question is a part of this agreement involves a $10 million payment to Adams County. And I'm trying to clarify, what benefit does Denver receive in return for the $10 million?'",
        "'speaker_0': 'Mr. President, members of council, my name is Evan Dreier. I am Mayor Hancock's deputy chief of staff. Councilwoman Sheppard, your question is, what benefit does the city and the airport benefit from for the $10 million? There's there's a couple.'",
        "'speaker_0': 'I think the the first one is the opportunity to develop a broader array of commercial development at the airport. We're talking about an amendment to the intergovernmental agreement that was first entered into in 1988. This would be the first major development, first major amendment.'",
        "'speaker_0': 'And there is a price to that. And that price we negotiated with our friends in Adams County at $10 million. Secondly, the pace of development and the revenue that will be derived from that that we will be sharing will be slow in order to provide some compensation to Adams County.'",
        "'speaker_0': 'Initially, we agreed on an initial upfront payment of $10 million. Those would be the two primary benefits.'",
        "'speaker_5': 'Okay. So but as I understand, revenues are to be shared 50, 50 equally. So we're paying 10 million upfront in order to agree to split revenues. 5050. Correct. At what I'm understanding. Okay. I also want to clarify what the talking about the clear the clear zone language, if I understand correctly, we have the ability Denver does to'",
        "'speaker_5': 'lease land in the clear zones. But then I was reading a few paragraphs down where it sounds like there will be some mitigation payments made back to Adams County. It sounds like there's some other financial consideration that we might either pay or forego that I wasn't clear on in the development agreement.'",
        "'speaker_0': 'I'm going to ask David Broadwell to respond to that question.'",
        "'speaker_10': 'Thank you. David Broadwell, Assistant city attorney. The the provisions in the agreement regarding the clear zones basically would again relieve land use restrictions on that property, which is in Adams County. It's owned by Denver and by DIA, but it's in Adams County and currently subject to a fairly severe set of land use restrictions dating from 1988.'",
        "'speaker_10': 'One of the things the mandatory agreement will allow us to do is, and on a limited basis, identify development parcels in that area for future development going forward. Now the original agreement had the concept that since Denver was buying up a lot of this acreage, which was going to remain fallow in public ownership in Adams County in'",
        "'speaker_10': '1988, we were taking it off their tax rolls and as a consequence of taking it off their tax rolls, a part of the original deal was that there would be something like a payment in lieu of taxes, which they use the term mitigation payment to describe that in the original deal.'",
        "'speaker_10': 'And frankly, even though it's hundreds of acres, it's basically open range land that generates only like 70 or $80,000 a year in mitigation payments. The last time we checked last year. So a very small sum of money flows to Adams County from that.'",
        "'speaker_10': 'To the extent a small amount of commercial development will probably evolve and occur over the years under the New Deal, that some of that will actually be subject to what's called now possession of interest taxation, where the Adams County jurisdictions will actually see more of a tax flow off of that property if it develops more in the'",
        "'speaker_10': 'future. But the mitigation payment idea dates from 1888. There are a lot of terms and conditions in the original deal that are simply being left intact and aren't being changed by the New Deal. I'll be happy to answer more specific questions about where that concept came from and what it means.'",
        "'speaker_5': 'How many acres are we talking about? And I'm sorry, what was that second term? The possessor, interest, taxation. How many acres are we talking about? Out of the 1500.'",
        "'speaker_10': 'Well, the reference the reference to 1500 acres in the agreement, his land that we're going to have freed up in Denver County on the airport property itself, the 1500 acres has nothing to do with the clear zones. The New Deal will allow the Clear Zone acreage to be kind of open in terms of whether or not any'",
        "'speaker_10': 'of that property is made available by Denver and DIA in the future for commercial development. Again, if, when and if we do, it'll be leased. It'll be in Adams County and potentially within the boundaries of Aurora or Commerce City as well.'",
        "'speaker_10': 'And there have been there's been an evolution in the law since 1988 that says when a public entity like Denver leases land for commercial development, then the value of that leasehold is subject to property taxation under a possessor interest theory.'",
        "'speaker_10': 'The value of that possession interest and all of our concessionaires and lessees at DIA now are subject to this kind of taxation that that whole concept evolves since 1988. And we make reference to it in the mandatory agreement that any leasing out there in the clear zones in Adams County will be subject to that kind of taxation'",
        "'speaker_10': 'and they'll keep that tax revenue. The taxing entities in Adams County will benefit from that. One final point is that development on the on that acreage, although it's in Adams County, it's physically on property we owned. Therefore, the DIA enterprise, the aviation enterprise will benefit from the ground lease revenue.'",
        "'speaker_10': 'Even Dreier indicated earlier that the back to the $10 Million question that in paying that we project substantial economic benefit to Denver both in terms of the 50% of the tax revenue will be retaining, but also in terms of the ground lease revenue the DIA will enjoy 100% will be kept by the aviation enterprise and will not'",
        "'speaker_10': 'be shared. So the $10 million payment needs to be viewed in relation to both. Some taxes which will flow to Denver, 100% of the lease revenue will flow to Denver.'",
        "'speaker_5': 'Okay. And then I have some other questions that are more on the planning side. So I know there's been a lot of conceptual planning happening about what this will look like as it moves forward. Is that information going to become public before the November ballot vote?'",
        "'speaker_5': 'Is that going to come to council? Like to lend news to our land use committee or neighborhood and planning committee.'",
        "'speaker_0': 'Might be helpful if Kim Dae or comes to the podium.'",
        "'speaker_8': 'I mean, yes, we have been doing a lot of looking at what potential could be developed on the property. The truth is this agreement that is in front of you hits a little reset for us because all of the planning we were doing did not include the clear zones.'",
        "'speaker_8': 'So we're going to be going back over the next few months, relooking at it, because we now have a different landmass to look at. And we want to look at all of our planning efforts based on this concept of 1500 acres.'",
        "'speaker_8': 'So, no, you probably will not see a plan prior to November 11.'",
        "'speaker_5': 'Okay. So towards the end of the agreement, Article 11, it talks about Denver and the HCC forming a new regional entity to promote and market development opportunities on or around the new airport and assist in coordinating land use and infrastructure planning.'",
        "'speaker_5': 'It gives a date of 1231 2016 for that to be completed. My big question is this is we're talking about greenfield development, and that's a tremendous amount of new infrastructure in terms of both utilities as well as new roads.'",
        "'speaker_5': 'My big question is, who will pay for that infrastructure not only to build it, but also how it will be maintained?'",
        "'speaker_11': 'Because this is not.'",
        "'speaker_0': 'Right for an airport development. The airport enterprise will be responsible for paying for infrastructure. Off airport development, I think, is still something that we are hoping to have conversations with the Adams County and Adams County jurisdictions about this regional entity that you mentioned.'",
        "'speaker_0': 'Councilwoman Shepherd could be a vehicle to getting to regionally cooperative infrastructure, both the development of the planning for and the payment of. But it may not be there may be other options out there as well, but that entity could be a vehicle.'",
        "'speaker_5': 'Okay. And then my other. So one of our upcoming agenda items is about I-70. And certainly all of the growth in northeast Denver in the metro area has caused tremendous impact to I-70, which we're going to be discussing here pretty soon.'",
        "'speaker_5': 'Will part of this planning include a traffic impact study for I-70?'",
        "'speaker_0': 'For Pena Boulevard? Yes. I'm not sure about I-70. Okay.'",
        "'speaker_5': 'Those are my questions. Council President and I would like to pull it out for a vote.'",
        "'speaker_1': 'Sure. All right. Well, let's do that first. Councilwoman Ortega, when you make the motions for us tonight. I will. Will you please have four or two ordered published?'",
        "'speaker_9': 'Mr. President, I move that council bill 402 series of 2015 be ordered published.'",
        "'speaker_1': 'Has been moved in saying Councilman Shepard. Okay we go to the other council member station.'",
        "'speaker_5': 'And then if you could come.'",
        "'speaker_1': 'Back. Absolutely, we will do that. Councilman five zero.'",
        "'speaker_3': 'Thank you, Madam President. Mr. President, I know.'",
        "'speaker_1': 'That.'",
        "'speaker_3': 'You have been gone so long that in. Now that we have this up for a vote, I would perhaps like to even make an additional comment. The more than one I was going to to say I'm going to be supporting this agreement, I think it really is a fine agreement.'",
        "'speaker_3': 'I'm delighted to see the Adams County officials here. Thank you for coming. I remember back in the 1988 time period when even for your predecessors, this was a tough swallow. And it was really an excellent example of cooperation, very tightly drawn agreement that needed changes if the vision that we were all flying today were to come about'",
        "'speaker_3': '. So this agreement, I believe, is essential. Now, Councilwoman Sheppard, the $10 million made me flinch at first to $10 million has that habit. But when I think about what Adams County is doing to come to the table now, I am willing to go that extra step because I know it's difficult to get these kind of agreements going'",
        "'speaker_3': '. And I also remember the history. And given the history and since we have acknowledged individually the Adams County Commissioners, I want to acknowledge former Representative Pat Grant, who I also think had something to do historically with the original agreement.'",
        "'speaker_3': 'Thank you, Pat. Thank you to all of the Adams County officials, former and present for supporting this. And I hope council will also.'",
        "'speaker_1': 'Thank you, Councilwoman Fox, Councilwoman Ortega.'",
        "'speaker_9': 'I just want to ask David Broadwell a couple clarifying questions. I didn't hear the answer to Councilwoman Sheppard's question about the number of acres in the clear zone. And then I also want to clarify whether or not those the land in the clear zone is within the LDA noise contour and whether any residential can be built on'",
        "'speaker_9': 'that.'",
        "'speaker_10': 'So when you say land in the clear zone, you mean total number of clear zone acres or developer developable number of clears on acres?'",
        "'speaker_9': 'Probably developable is more important and accurate.'",
        "'speaker_10': 'Well, I'm going to defer Dan Paramus in the room and he may have some more precise acreage language, but it's a good it's a good time to pause and clarify that the clear zone areas are heavily regulated still under federal regulations that define what can and can't be there in terms of instruction.'",
        "'speaker_10': 'They're called clear zones for a reason. Right. So so we've identified very surgically some potential. And I'll I'll turn it over to Dan right now to talk about kind of in gross numbers, how much acreage that might be.'",
        "'speaker_10': 'Just to start answering your series of questions. Thanks, David. Council President and Council Members Dan Paramo with Dear Dan Real Estate in total Councilwoman. There's about 8000, a little over 8000 total acres in the clear zones. When we look at the actual developable acreage, we've focused just as we have on the airport land, on what's kind of'",
        "'speaker_10': 'immediately developable. And that generally looks to be about 500 to 800 acres. But over the long term, as we develop infrastructure.'",
        "'speaker_2': 'Additional acreage will become.'",
        "'speaker_10': 'Developable out of that 8000.'",
        "'speaker_9': 'Then will you just clarify from the maps that you all provided in the documents that we received, it looks like all of the clear zoned land is on the outside edges of the airport. You just clear?'",
        "'speaker_10': 'Correct. I believe on your packet, the clear zone was all in green on the perimeter of. Of the airport.'",
        "'speaker_9': 'Okay. Thank you, ma'am. I have no further questions.'",
        "'speaker_1': 'Thank you. Councilwoman Ortega. Councilwoman Shephard, come back to you.'",
        "'speaker_5': 'Yeah. Thank you, Mr. President. I am calling it out for a vote. There is a lot to like in the plan. Obviously, the economic development potential of this is huge, not just for Denver, but the whole region. And I mean, the revenue sharing between the counties is absolutely historic and precedent setting, setting.'",
        "'speaker_5': 'And, you know, it has so many wonderful implications in so many ways. I have not been privy to any of the negotiations. I also do not serve on the airport committee. I have tried to do my best due diligence on this and have been briefed a couple of times by the consultants on the plans.'",
        "'speaker_5': 'But. And I mean, this is huge. What we're talking about has huge implications for the city, for the region, for what development looks like for the whole northeast area. I have a lot of questions about, you know, where will the workers that are going to be working at this be housed?'",
        "'speaker_5': 'And I have huge questions about the impacts to our transportation infrastructure, not just to the things that are going to be built on airport property as a result of this. But for the surrounding transportation infrastructure, I have a lot of questions about, you know, what type of public transportation will be here, how it will be augmenting all'",
        "'speaker_5': 'of this. And I feel for my and this is my comments are in no way meant to disparage all of the hard work of everyone that's been involved in this Adams County team. You know, the airport folks, the consultant team, everyone else.'",
        "'speaker_5': 'I want to feel more comfortable about what I'm actually referring because because the implications go far, far, far beyond just the financial agreement between the two counties. I want to understand the long term land use and transportation issues surrounding this.'",
        "'speaker_5': 'I just can't I don't feel comfortable voting to refer it to the ballot tonight, so I will be abstaining.'",
        "'speaker_1': 'Thank you, Councilwoman Sheppard. Councilman Brown.'",
        "'speaker_2': 'Thank you, Mr. President. This indeed has been a long time coming. And I really wonder if our guest in the chamber this evening, the two county commissioners from Adams County, ever thought they would be sitting in this chamber and listening to this debate?'",
        "'speaker_2': 'And by the way, I think our benches are probably harder than yours. I am pleased to support this tonight, and I want to thank the two teams. On both sides that were involved in the give and take to make this possible.'",
        "'speaker_2': 'And I hope my colleagues would join me in supporting this this evening. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Brown. Councilwoman, can each.'",
        "'speaker_7': 'Thank you, Mr. President. I wanted to wait to chime in because I wanted to kind of understand and hear my colleague, Councilwoman Shepherd's, concerns a little better before deciding whether I needed to to speak. I will be supporting the agreement tonight.'",
        "'speaker_7': 'And it's not because I don't share some of the same questions that Councilwoman Sheppard does. I do think that a few things help me feel a little more comfortable, though, and not to change her mind because I respect her, her differing opinion.'",
        "'speaker_7': 'But we have a train that is going to the airport with two major stops. One is already planned and that one has the potential for significant residential. And so whether we do or don't approve this particular agreement, development is already headed into that corridor.'",
        "'speaker_7': 'So the question really isn't, is development going to continue to grow in the far northeast corridor toward the airport? The question is whether the airport land is in play for that or not. And, you know, we know that most all of this land is not really for residential.'",
        "'speaker_7': 'And so for me, the potential here is as a major city that's losing land along the I-70, in the 25 corridors and in some respects along the river as well for industrial and manufacturing purposes. Those areas, generally speaking, are slowly and incrementally being re zoned from industrial manufacturing type uses to residential.'",
        "'speaker_7': 'So if I, as a major city, want us to have a piece of that potential sector in the future, and I want us to be able to have some balance right the tax base that we need. Residents are more expensive to serve, right?'",
        "'speaker_7': 'They need libraries and they need all kinds of schools and services. And businesses are an important piece of the tax base to support that kind of residential service space. So if I see the trends happening, which I see happening then and I and I believe in having middle class working jobs in the city and county of Denver'",
        "'speaker_7': 'and not I mean, I love that our our region is interconnected. And I know many of our residents work in Commerce City and other areas in the region, but I want some of those kinds of jobs in Denver, too.'",
        "'speaker_7': 'I think it is worth the leap now to say that that's possible. I share your concern about the transportation network to get them there and all those pieces. But the thing that I have is the knowledge that this body, whether I'm on it or not, over the next 30 years that this all unfolds, will have a say'",
        "'speaker_7': 'over each of those leases. Because when we lease land and I just look at the city attorney, even if it doesn't, we have a $500,000 threshold for contracts. But we we vote on every lease regardless of the dollar value.'",
        "'speaker_7': 'Is that correct? The city attorney is nodding. For those of you who do not have video, he's nodding yes. But that is the way that I think this body stays very active in ensuring. And this is where. So how do we know that Adams County will continue to participate in a conversation about transportation?'",
        "'speaker_7': 'Well, they have a vested interest now in that development happening. So if we see a lease coming to this body that has a significant, you know, job base and we don't feel like there's local transit to get folks from the the rail station to there or there's not adequate roads.'",
        "'speaker_7': 'We can say we want to see a conversation about that infrastructure and Adams County will have a vested interest in participating because they won't see the revenue from that conversation unless they're part of the transportation conversation. So so I realize that what we're doing is we're making planning possible.'",
        "'speaker_7': 'We're not actually planning. I just want to make really clear, I'm not agreeing to development at the airport. I'm not planning development at the airport. What I'm saying is it's possible. And I think that like Councilman Brown, given the history, I mean, I think that if you go back here, the privilege of this airport was made possible'",
        "'speaker_7': 'by the voters of Adams County. That's that's a fact. And so to the extent that there is consideration in this agreement of $10 million up front, it is an acknowledgment of of who made this possible in terms of the enormous economic impact from the airport.'",
        "'speaker_7': 'At that time, they thought that investment would immediately result in significant commercial development, you know, outside the airport land and in their jurisdictions. That didn't happen. It turns out that the trend was that those developers want to be closer to the airport than we thought.'",
        "'speaker_7': 'So they made some assumptions, but they made some sacrifices. We're making some sacrifices of $10 million and we're making some assumptions. And so I believe that that it's okay to pave the way for that possibility, provided we keep lots of control over each of the steps along the way.'",
        "'speaker_7': 'And I'm sure that although they won't be ready in the next few months when the planning is progressing, this council does need to be a part of that conversation. It does need to come to us. Even if the zoning is in place, the plan should go through this body and I will, you know, advocate for that to'",
        "'speaker_7': 'happen. So sorry for the long comments, but I think that just kind of sharing some reasons why this is important that hadn't been mentioned previously. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman. All right. Any other comments for or two is on the floor for publication, Councilman Brown.'",
        "'speaker_2': 'Sorry, Mr. President, but I just want folks to remember that this is not a final vote in terms of this agreement. This is up to the voters to simply refers this issue to the voters. Of course, they're going to be questioned.'",
        "'speaker_2': 'So we've had some good ones tonight. And guess what? That's why you have a campaign to educate the voters about the advantages or perhaps disadvantages of this agreement. So all we're doing is putting it on the ballot. We hope we have a good campaign.'",
        "'speaker_2': 'We hope we have enough money to run a good campaign. But this this is the first step of a long journey, which will end on November the third. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you, Councilman Brown. All right. No comments on 402. See? None. Madam Secretary. Roll Call.'",
        "'speaker_4': 'Shepherd.'",
        "'speaker_5': 'Epstein.'",
        "'speaker_4': 'Susman. Hi, Brooks Brown. Hi, Fats. I can eat Lemon Lopez, Montero, Nevitt Ortega. I rob I. Mr. President.'",
        "'speaker_1': 'All right, Madam Secretary, please call the voting. Now the results.'",
        "'speaker_4': '12 eyes, one abstention.'",
        "'speaker_1': 'One abstention. 402 is over.'",
        "'speaker_4': 'I'm sorry. Her vote or electronic vote was no. Is that what you wanted or to abstain?'",
        "'speaker_5': 'Abstain.'",
        "'speaker_1': 'It's abstain.'",
        "'speaker_4': 'Changes. It's chosen. No, on my. Oh, no, Annemarie.'"
    ],
    "A bill for an ordinance submitting to a vote of the qualified and registered electors of the City and County of Denver at a special municipal election to be held on Tuesday, November 3, 2015, the question of whether the City shall be authorized to issue bonds or other financial obligations for the purpose of financing the following tourism related projects: the National Western Center and improvements to the Colorado Convention Center; and in connection therewith to eliminate the expiration date of the lodgers tax and the auto rental tax at a rate equal to 1.75%; providing the form of the ballot question; providing for other details in connection therewith; and ratifying action previously taken.\n (FINANCE & SERVICES) Refers a question to the November 2015 ballot to seek authorization for the City to issue bonds or other financial obligations to finance tourism related projects for the National Western Center Campus and improvements to the Colorado Convention Center and to eliminatie the expiration date for portions of the  lodgers tax and the auto rental tax. This bill must pas": [
        "'speaker_1': 'At 1212 eyes one abstention four two is ordered published. All right, one down, six more to go. If I were to go next. One 379. Councilwoman Monteiro, what would you like for us to do with this?'",
        "'speaker_6': 'I just wanted to call 379 out. Which. Talks about National Westerns Center in the Colorado Convention Center. I just had some questions.'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_6': 'Certainly, I would like someone from both the Colorado Convention Center and also from National Western and possibly the city to be able to come up and explain to the voters exactly what this council bill does.'",
        "'speaker_1': 'All right, Kelly, you coming on the.'",
        "'speaker_3': 'Mm hmm. Just do it. Mm hmm.'",
        "'speaker_10': 'They went to grab Kerry Kennedy, so.'",
        "'speaker_5': 'Good evening. Mr. President. Members of council. I'm Carrie Kennedy on the City CFO. I apologize. I was just out in the hallway congratulating folks on your last vote, but happy to take questions on the referral of the ordinance for the National Western Center.'",
        "'speaker_1': 'Come from Ontario. Go ahead. Repeat your question.'",
        "'speaker_6': 'Thank you. So what do we have before us this evening? What does this proposal do? This is a good time to explain to people watching television. And then the next one, the next question that I would like to ask too is from National Western Stock Show, how much you generate every month and I mean every year in'",
        "'speaker_6': 'terms of national Western and the revenue. Also, the same question to visit. Well, whoever is doing the Colorado Convention Center and then I would like the question answered, how did you reach this conclusion and why was this method why are we looking at this method in front of us today in regard to financing for the future?'",
        "'speaker_5': 'Okay. Thank you, Councilman, and thank you to all of you who've helped bring this proposal as far along as it is today. Really appreciate all your great efforts. This is a proposal to submit a proposal to Denver voters in November to finance the redevelopment of the National Western Center and also to finance improvements at the Colorado Convention'",
        "'speaker_5': 'Center. It is an authorization by Denver voters to allow the city to issue 778 up to $778 million in debt. To finance these two proposals and the source of funds to service that debt.'",
        "'speaker_10': 'Are.'",
        "'speaker_5': 'Denver's tourism taxes. So the reason the city has the opportunity to make these new investments in tourism related assets is because the Colorado Convention Center is now 25 years old and is being paid off. I think you all just did a recognition tonight that the convention center is 25 years old.'",
        "'speaker_5': 'This gives the city of Denver an opportunity to move forward with some new tourism related assets. I'll let Kelly lead talk about the evolution of the proposal, the net to redevelop the National Western Center, because it really is a much larger proposal than just the National Western Stock Show.'",
        "'speaker_5': 'It's a redevelopment of the entire campus that includes new connections between Elyria, Globeville and Swansea and neighborhoods to support the redevelopment of North Denver. It includes opening up the river over a mile of the South Platte. So there are park amenities and bike amenities and access to the river, a lot like the wonderful amenities that we see'",
        "'speaker_5': 'today at Confluence Park. This development will create the opportunity for Colorado State University to come on to the National Western Center campus to provide agribusiness and agro science research, veterinary medicine, and also involves the redevelopment of the buildings that are up there that currently housed the National Western Stock Show for a 365 day a year active campus'",
        "'speaker_5': '. That brings new events, new opportunities for tourism, and also allows our National Western Stock Show to remain in Denver, to remain competitive, to remain the Super Bowl of stock shows, as it has been here in our city for the last hundred years, for the next hundred years.'",
        "'speaker_5': 'So significant improvements, the total redevelopment costs over the next ten years for the National Western Center are projected to be $856 million, of which the city of Denver will contribute 673 million. Again, the primary source of that are our tourism taxes, taxes that people pay when they stay in hotels and when they rent cars here in our'",
        "'speaker_5': 'city. Those are the taxes that are currently in place today supporting the Colorado Convention Center. So there is no tax increase. There are no new taxes. But we do need to ask the voters to leave a portion of those taxes in place because a portion of them would expire when the convention center pays off.'",
        "'speaker_5': 'So it's in essence leaving in place the taxes that are there today in order to finance this development project. We also include in this package just over $100 million for improvements to the Colorado Convention Center. And I'll let Richard Schaaf talk about that proposal.'",
        "'speaker_5': 'You heard a lot tonight about the convention center. But in order for Colorado's convention center to remain competitive and to continue to attract the conferences and compete nationally with other convention centers, there are some enhancements, some improvements technology, some flexible space amenities that need to be added in our convention center.'",
        "'speaker_5': 'And so this goes to the voters as a package to authorize the debt and leave the taxes that are in place today to support that debt in order to pay for the redevelopment of the National. Boston Center complex and everything I talked about included in that proposal and the Colorado Convention Center improvements.'",
        "'speaker_5': 'Happy to take questions.'",
        "'speaker_1': 'Councilman Terry was. Or someone else you want?'",
        "'speaker_6': 'Yeah. I'm waiting for whoever wants to go next. Richard Scharf.'",
        "'speaker_10': 'Yes. Thank you. Richard Scharf, president and CEO of Visit Denver. Yes. As Karie mentioned, what we did at the same time, the mayor felt that we should look at all of our facilities that are generating probably nearly three quarters of $1,000,000,000 a year in economic impact.'",
        "'speaker_10': 'Take a look at all of those at same time and see what our needs are. The Strategic Advisory Group SAG did this study in 2013 into 2014, made some recommendations at the National Western Stock Show complex, and also gave did an analysis of our convention center facilities.'",
        "'speaker_10': 'I will tell you this. We have a beautiful facility. It was designed by meeting planners, but what they found out is that we need to remain competitive. And if you think about it, we had Kurgan Hall in 1969 and in 1990, just 21 years later, we built the Colorado Convention Center.'",
        "'speaker_10': '15 years later, we expanded it. And right now, another, you know, 10 to 15 years, we're looking at just making some enhancements with some additional meeting space, flexible meeting space. If we do this, the study suggested that we could generate another hundred million dollars economic impact a year and also protect ourselves from losing business, because, as you'",
        "'speaker_10': 'all know, it's very competitive. In fact, there's 18 other expansions and enhancements out of the top 25 cities in the country right now. So we are just really doing our best to continue to generate the kind of economic impact that we know we can can generate for the future.'",
        "'speaker_10': 'So again, the recommendations, a lot around enhancements, some additional meeting space, flexible meeting space technology would really put us in shape for the next 25 years.'",
        "'speaker_0': 'Okay. Any questions?'",
        "'speaker_6': 'Thank you. I'm going to go ahead and ask a representative from National Western to please come up.'",
        "'speaker_0': 'Yes. Hello, Mr. President. Members of council. I'm Paul Andrews, the president and CEO of your.'",
        "'speaker_10': 'National Western Stock.'",
        "'speaker_0': 'Show here in Denver. What you have before you is a necessity to save the National Western Stock Show.'",
        "'speaker_10': 'We are at a point in history where for 109 years, we've proudly.'",
        "'speaker_0': 'Been at the confluence of I-70 and Brighton Boulevard. We've worked diligently with the mayor and his staff to put together a master plan that is efficient and will allow the National Western Stock Show to thrive and grow. But it's much more than that.'",
        "'speaker_0': 'What you have in front of you.'",
        "'speaker_10': 'Is the National Western Center is a global opportunity to bring in the world's leaders in agriculture year round to Denver, Colorado, increase the economic impact from around 100 million a year to $200 million per year, and put us on the stage internationally as the leader in agricultural education.'",
        "'speaker_0': 'Become some sort of a genesis for how to feed the world.'",
        "'speaker_10': 'The the world.'",
        "'speaker_0': 'As we enter 9 billion inhabitants. Where is that research going to be done? It's going to be done in Denver, Colorado, at the National Western Center.'",
        "'speaker_10': 'So for the National Western Stock Show.'",
        "'speaker_0': 'It's a necessity. But for the city of Denver, this is an opportunity that only.'",
        "'speaker_10': 'Comes once in a lifetime.'",
        "'speaker_0': 'And it's before us here today. Thank you.'",
        "'speaker_6': 'Thank you. Kelly, if you can. Speak to how all of this proposal was organized and how how we reached the conclusion that we're here tonight in terms of having it go to the voters. It was was not an overnight kind of decision.'",
        "'speaker_6': 'And I think it's just important for my client to hear that.'",
        "'speaker_10': 'Sure. Thank you. Councilwoman Monteiro, members of council. You know, this has been really, you know, two years in the making. You know, when the mayor announced the creation of the North Denver Cornerstone Collaborative, which is really about three historic neighborhoods, Globeville area, Swansea, that are very disconnected from the rest of the city, have seen no infrastructure investment'",
        "'speaker_10': 'for over three decades. And the National Western Center project is one of those six projects. And from the get go, this has been about strategically aligning the planning and the implementation of these projects. So we've been very deliberate over the course of the last couple of years as part of the planning that the neighborhood plans went first'",
        "'speaker_10': ', Globeville was approved first than Elyria. Swansea followed, and then the National Western Center was approved by council unanimously in March of this year. And those that plan was informed by the neighborhood plans, because a big part of this is is not only making sure the stock show is here for another hundred years, and it lays out a'",
        "'speaker_10': 'much bolder vision about what this place could be. One of the things that came out of this effort, I'm convinced, is the work we've all done together led to a partnership with the state of Colorado through House Bill 1344.'",
        "'speaker_10': 'That was bipartisan support went through the legislature this year. The state now is a partner in this venture to the tune of $250 million to accelerate the development of Colorado State University on this campus, just like the State participated in accelerate the development of the new medical center at the Anschutz Medical Campus.'",
        "'speaker_10': 'We have an opportunity here to combine all these different funds and create a world class facility that will, again, as Paul mentioned, solve some of the world's biggest food issues. Senator Jerry Sonnenberg described it as positioning Colorado as the Silicon Valley of AG.'",
        "'speaker_10': 'And and so the the question before the voters of Denver will be, who do you want to support an extension of this visitor's tax to make continued investments in our tourism infrastructure at the Convention Center in the National Western.'",
        "'speaker_10': 'And then also a part of that is now the state as a partner in this venture. And we've also got an application into the state for what's called a Regional Tourism Act application to the tune of about 117 million.'",
        "'speaker_10': 'All these pieces come together, along with a substantial investment by the National Western to the tune of 50 million in cash that they will have to raise on an investment from CSU. So all these pieces are coming together over the course of the conversation we've had together the last couple of years.'",
        "'speaker_10': 'And I think what's most important is we always have started and finish our conversations about how does this impact reconnecting these neighborhoods. And so for a big part of this first investment in redeveloping the site is connecting the neighborhoods, Globeville or Swansea, back to the city.'",
        "'speaker_10': 'So we've got a lot obviously a lot of work ahead of us still to move the plan forward over the eight phases over the next ten years. But this is the next really big step to go to the voters of Denver and ask for their support towards this effort.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Monteiro. Councilwoman Ortega.'",
        "'speaker_9': 'Thank you. Kelly, would you mind coming back up, please? Can you tell us what the timeline obligations are if the RTA funding is approved by when we have to generate a certain percentage of dollars? I heard 200 million.'",
        "'speaker_9': 'I'm assuming that is where we're looking at more of the build out of some of these new buildings on the campus. So can you speak to that?'",
        "'speaker_10': 'Sure. You really I mean, so phasing the timing of how the project kind of rolls out is a really, really important conversation. In the in the master plan and in the application, we talk about the eight phases over approximately a decade.'",
        "'speaker_10': 'And one of the key drivers in that is that the stock show can't just close down for the next decade while we rebuild it or there's no place to relocate them while we rebuild the site. So the phasing was intentional about making sure the stock show could stay in place.'",
        "'speaker_10': 'So that was one consideration. The second consideration ties back to the RTA is that once you're awarded an award from the state, a clock starts to tick in terms of getting the project started within five years and then ultimately finishing within ten.'",
        "'speaker_10': 'So there. And that's really focused on getting the facilities in place that are going to drive the new tourism increment to the site. So obviously we have a ton of work to do on the infrastructure side. So some of the first work that will come out in front of us is the infrastructure, the two bridges connecting the'",
        "'speaker_10': 'site to Washington Street, which do not exist today. Moving rail off the river that will allow us to free up and a mile of the South Platte River and reclaim and create 12 acres of new open space along the river.'",
        "'speaker_10': 'A new consolidating the rail, create a new national western drive to connect the site. So there's a lot of work we have to do in the early years to set the site up for success. And then the vertical development we'll we'll follow specific to your question about the 200.'",
        "'speaker_10': 'So I think you're referring to the the dollars that we still have to fill to meet our obligations. Is that what you're referring to?'",
        "'speaker_9': 'Richard Sharp had mentioned, I think it's who referred to the 200 million that we would see.'",
        "'speaker_10': 'Oh, you're referring to Paul. So right now. So that's an economic development question. Right. So right now it's about 100 million or so in economic impact that the stock show has on our economy. The build out of this plan essentially doubles that economic impact to the site because you're now able to have more events on the site'",
        "'speaker_10': '. I mean, right now the site is very inflexible. It's really very limited in what you can do this the new facilities really allow for true flexibility, year round use of the facilities for the stock show. It allows them to grow the number of breeds during the 16 day show.'",
        "'speaker_10': 'It allows for a significant growth in the equestrian or horse business on site and really positions this facility as a perennial player in the large horse shows. That's going to drive nearly a million additional visitors to the site just on the tourism side around it, kind of equestrian related events.'",
        "'speaker_10': 'And then there's a whole nother conversation we'll have about the agribusiness and agro science jobs that will start to emerge in and around this campus to make it the the kind of perennial place to study ag related issues.'",
        "'speaker_10': 'So the, you know, this is with the commitment of finishing this project really sets the stage for a long term sustainable model for both the stock show and the site to generate substantial economic impact, both to the city of Denver and to the entire front range.'",
        "'speaker_9': 'So, Kelly, what I was trying to understand was if the 200 million that we anticipate seeing annually is at full buildout with all the new buildings on the site, or is it just with what the 800 million will buy with the approval of the.'",
        "'speaker_10': 'Really good question. So I think, you know, obviously, to maximize the the the economic impact you got, it got to see the whole build out. But I will tell you, in the RTA, our first two, which are really addressed, the first couple of phases and builds the livestock center, the new livestock center and the equestrian center, those'",
        "'speaker_10': 'are considered really the key drivers of the new tourism increment. So those are early deliverables. As part of our initial build out, we've got to meet those requirements under the state. So you're going to start to see improvements in the economic impact of this campus of the center as a result of those two buildings while we continue'",
        "'speaker_10': 'towards the full buildout.'",
        "'speaker_9': 'Okay. And then I just wanted to ask Kent Rice if you could talk a little bit about the anticipated future of the Coliseum, knowing that at the end of the day, when the new facility is built on the north side of 87.'",
        "'speaker_9': 'Indeed that the Coliseum will no longer be utilized for the stock show and the rodeo. So what is the vision in the future for the Coliseum and the 30 acres of land that we.'",
        "'speaker_10': 'Can't rise here? Executive Director, arts and venues for the city. And we manage the Denver Coliseum. So I'm going to answer your question by first answering one you didn't ask, which is always risky. But the good news is the Coliseum has a near term future that I think is quite bright, which is probably for seven, eight, nine'",
        "'speaker_10': 'years we'll be operating it as the Coliseum. So in the neighborhood it will still be there. We hope to have more events because we're going to continue to do some capital improvement. As for what happens when there is a new arena built and that's one of the big exciting opportunities in the whole plan for the National Western'",
        "'speaker_10': 'Center is to have a.'",
        "'speaker_0': 'Fully functioning 21st century.'",
        "'speaker_10': 'Arena, which the Coliseum, regrettably, is not. It's a beautiful building, but it's it's from the last century. What will happen with that 30 acre site is to be determined. Councilman Ortega we don't know the answer to that yet.'",
        "'speaker_10': 'So it could be adaptive reuse for a variety of things. But our main near-term planning is around how to keep it functioning for the next 7 to 8 years.'",
        "'speaker_9': 'And if we do have I don't know if the request is the right word, but there has been anticipation that the building remains because of historic value. Can you speak to that?'",
        "'speaker_10': 'Only that I've heard the same requests, that people have a lot of affection for the building, as do I. But we haven't really address what will be done with the site.'",
        "'speaker_9': 'All right. Thank you.'",
        "'speaker_10': 'You're welcome.'",
        "'speaker_9': 'I have no further questions.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you. I have one last question for David Broadwell. Can you just talk about should this past this evening what the election cycle would be when that happens, where voters could potentially see this on the ballot?'",
        "'speaker_10': 'Yes. Just like the last question. You were debating the last ordinance before. This is simply a way to get it on the ballot for the November 3rd election because it involves bond. The debt inevitably requires the approval of the voters, both the element of the measure that that incurs the debt as well as extending the expiring taxes'",
        "'speaker_10': '. Those are both things that are triggered under TABOR in terms of needing voter approval and that will and that will occur on November 3rd. In terms of the voters giving a thumbs up or thumbs down that we actually.'",
        "'speaker_10': 'Every year there's some time over the summer when we meet our statutory deadlines for getting things on the ballot. We're moving these two things forward tonight, but there's plenty of time in terms of between now and September to to get the measures on.'",
        "'speaker_6': 'One more question. So, Mr. Broadwell, essentially what's before us tonight is to either approve or disapprove this going forward so they can it appear on the ballot?'",
        "'speaker_10': 'That's right.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_1': 'Thank thank you. Come from Ontario. So that was not called out. Any other questions or comments on 379? All right, Madam Secretary, you ante up the next one, which I believe was 381 column by three council members. And I'm pretty sure these are four beyond comment.'",
        "'speaker_1': 'So we are. Yes, I believe this is going to be a vote count from Ontario. I believe you have this called out for an amendment, correct? Yes. Okay. So that will need to go first. Councilwoman Ortega, I believe, wanted to call it out as well for a courtesy, is that correct?'",
        "'speaker_1': 'Yes. Okay. And then, Councilwoman Fox, you were just for you.'",
        "'speaker_3': 'I'm sorry. We spent a lot of time talking about the stock show measure that would be sent to the people. Did I miss the vote?'",
        "'speaker_1': 'It was not called out for a vote.'",
        "'speaker_3': 'Right. Oh, okay. Thank you. Thank you.'",
        "'speaker_9': 'So you want me to place this on the ballot? Three one.'",
        "'speaker_1': 'Come to my apartment, make sure. Did you want 379 called out because you did not only count.'",
        "'speaker_3': 'Oh, I didn't know. I didn't want it called out. I thought it was okay.'",
        "'speaker_1': 'No, it was not got him. So we are going to start with 381 so we'll do the amendment first will be new needed on the floor to be ordered published. So Councilman Ortega, would you please put 381 on the floor to please.'",
        "'speaker_9': 'Mr. President, I move that council bill 381 be ordered published.'"
    ],
    "A bill for an ordinance approving a proposed Intergovernmental Agreement between the City and County of Denver and the Colorado Department of Transportation, the High Performance Transportation Enterprise and the Bridge Enterprise regarding Montclair and Park Hill basin drainage improvement and I-70 transportation enhancements.\n (INFRASTRUCTURE & CULTURE) Approves an intergovernmental agreement with Colorado Department of Transportation (CDOT), the High Performance Transportation Enterprise and the Bridge Enterprise regarding Montclair and Park Hill basin drainage improvements and I-70 transportation enhancements;  the estimated total costs of $134 million for the drainage project will be shared by the City and CDOT, 60% and 40% respectively; the City's contribution to the transportation project will be $37 million (201522456). The last regularly scheduled Council meeting within the 30-day review date is on 7-20 -15.  The Committee approved filing this bill at its meeting on  6-3-15.": [
        "'speaker_1': 'All right. It has been moved in, second in. And now, Councilman Monteiro, we need a motion to amend.'",
        "'speaker_6': 'Thank you, Mr. President. I move that council bill 381 be amended in the following following particulars on page one line 17 Strike City Clerk's filing number 2015-0265 and insert City Clerk's filing number 20150265.'",
        "'speaker_1': 'Dash a thank you comment on the amendment. Councilwoman Montero Thank.'",
        "'speaker_6': 'You, Mr. President. The purpose of the amendment is to include technical changes requested by the Colorado Department of Transportation. The mayor's office reports that there are no changes to the financial commitments or project details as presented in committee, and the Colorado Department of Transportation and the City of Denver remain committed to creating a partnership that is mutually'",
        "'speaker_6': 'beneficial and keeps the community in mind. This amendment would allow for the substitution of the new contract with a new filing number. These changes would, number one clarify language at the Brighton Boulevard box. Culvert could be used for both city surface drainage needs and as an alternative connection point for the I-70 residual drainage pipe.'",
        "'speaker_6': 'This will enable us to build a drainage pipe in Brighton Boulevard prior to paving currently scheduled for 2017. Let me go back 2016 2017, thus limiting future paving impacts. Number two adds boilerplate language required for all state contracts with vendors per the request of the state comptroller's office.'",
        "'speaker_1': 'Thank you, Councilwoman Monteiro. Any comments on the amendment? Councilmembers Ortega or Fox?'",
        "'speaker_9': 'Yes.'",
        "'speaker_1': 'Go right ahead.'",
        "'speaker_9': 'I want to specifically address the box culvert because I'm not sure this is just a minor amendment because if you look at the actual agreement, number one, Denver is. The language is changed so that now we would pay up to 2.5 million.'",
        "'speaker_9': 'Actually, the state would pay up to 2.5 million towards the box culvert. And in the previous language that was the total cost. And so I want to know, number one, if the cost has changed in the estimates, because that language sort of changes the way that that it reads.'",
        "'speaker_9': 'So I don't know who wants to speak to that.'",
        "'speaker_7': 'Mr. President. Point of order. Could someone also reference it's a you know, it's a multi page contract. What section? The language change that you were referring to. Councilwoman Ortega. So we follow along.'",
        "'speaker_9': 'Yeah, it's. Let's see. I believe it's for me to find the actual page here.'",
        "'speaker_0': 'I think Sky.'",
        "'speaker_3': 'Council.'",
        "'speaker_5': 'Creatures on page three. It's in section one, the 2% drainage project, an early action drainage project in that Section A and I can hand you a red line if that.'",
        "'speaker_9': 'Helps you so I can read the way it read before in the way it reads now. So you have that clarification.'",
        "'speaker_1': 'Go ahead. Ahead.'",
        "'speaker_9': 'Just trying to start at the beginning of the sentence the two base and drainage project including the. Remaining. The EDP is the. East at the Early Action Drainage Project. Sorry I lost my my place here.'",
        "'speaker_1': 'Kathleen Kennedy. Did you find the spot? As long as.'",
        "'speaker_5': 'I do.'",
        "'speaker_0': 'It.'",
        "'speaker_1': 'Kathleen Kennedy dissatisfied. I want to go ahead. We can go ahead and get your questions answered, Councilman Ortega. So whoever.'",
        "'speaker_9': 'Okay, so I'm not sure who's addressing that, but what I'm what I'm trying to clarify is what is the cost now? Has the cost change? Because the language is basically saying now that the state will pay up to that amount.'",
        "'speaker_9': 'And that raises the question about whether or not the cost of the box culvert has changed.'",
        "'speaker_5': 'High Council president and council. I'm Leslie Thomas. I'm the city engineer, and the cost estimate has not changed. And the city attorney here, the attorneys are here, but the new language does not read up to it. Says that the state will pay the city 2.5 million.'",
        "'speaker_9': 'Okay. It must have been the language that I was reading before, because as as I read it, it was not clear that we were changing that verbiage. Says the city. The city will pay 2.5 million toward the construction of Brighton Boulevard box culvert.'",
        "'speaker_9': 'And before the language said that the cost was 2.5 million. So. If you read the the lines above it, it says the estimated cost was 14.9 million. For the Brighton Boulevard box culvert estimated to cost 2.5 million. So you're saying that that amount from the state is exactly the same and we're anticipating the cost of the box'",
        "'speaker_9': 'culvert to be. The 14.9 million. Looks like it's the residual drainage pipe, not the box culvert. So that's. That's where I'm confused here. And I just wanted to make sure I clearly understood what the cost of the box culvert part of this project is.'",
        "'speaker_2': 'In terms I think I'm sorry, Sean Sullivan with the city attorney's office. I think Miss Thomas addressed the cost being two and a half million. The language of the agreement went from the state shall pay the city two and a half million for the Brighton Boulevard box culvert on or before September 15 to the city will pay'",
        "'speaker_2': 'the city to one and a half million toward the construction of the Brighton Boulevard box culvert. It's it doesn't. The state. Excuse me. The state shall pay. So.'",
        "'speaker_9': 'So that doesn't change anything.'",
        "'speaker_2': 'And it didn't change the intent of the of the paragraph.'",
        "'speaker_9': 'Or the cost. Okay. That's the only clarification I had on this related to the amendment.'",
        "'speaker_1': 'Thank you, Councilman Ortega. Any other comments on the amendments? Yeah. See? No seeing none. Madam Secretary, roll call voting on the amendment.'",
        "'speaker_4': 'Montero I nevett i. Ortega I Rob Shepherd. Susman High. Brooks Brown high.'",
        "'speaker_3': 'Thoughts I can each layman i.'",
        "'speaker_4': 'Lopez, i. Ortega.'",
        "'speaker_9': 'I voted already I got.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'All right, now, Secretary, please close the voting and announce the results. 3939 as Council Bill 381 has been amended now. Councilmember Taylor, we need a motion to order published as amended.'",
        "'speaker_9': 'Do we need to do that before we actually discuss the bill? Okay. I move that council bill three 8381 be ordered published as amended.'",
        "'speaker_1': 'Is then moved in second and now councilwoman fights Europe.'",
        "'speaker_3': 'Thank you, Mr. President. It's for the people at home. This is an intergovernmental agreement between the city and various aspects of the state, especially the Colorado Department of Transportation, concerning I-70 improvements and drainage. This is not an issue that goes to the voters like the other two.'",
        "'speaker_3': 'Just to clarify. I am. I'm bringing this out in order to raise some concerns. And first of all, I'm to say what I what I don't believe we have any disagreement on. I-70 needs improvements. The area has drainage problems.'",
        "'speaker_3': 'And Gretchen, the staff all of the staff has worked very hard on this. Let me talk about the transportation side of my problem, though. And before I go into this, I want to clarify that in my past history in the legislature, my first at least six years were spent specializing in transportation issues and transportation funding.'",
        "'speaker_3': 'I chaired the Transportation Committee for two terms, and so I have some very strong feelings about what is proper public policy and what is not proper public policy. For me, the expansion of an existing interstate, a freeway is inappropriate to be handled through Lexus lanes.'",
        "'speaker_3': 'And so from from my perspective, I raised that issue with Colorado's Transportation Department. And when they asked for public comments, nobody is really talking about whether there's another way to fund these improvements. Everybody's just assuming we're going to do everything by doing expansions, whether it's to Boulder or whether it's I-70.'",
        "'speaker_3': 'We're going to do it through Lexus lines, and I don't happen to see it that way. And I'm speaking as a person who has voted for gas tax increases more than once. I believe there is a public policy involved here.'",
        "'speaker_3': 'And for 20 years, people have just simply taking a walk on that public policy. We need to have a discussion of how we're going to fund public infrastructure, not just use this kind of approach. Moreover, in toll roads, I carried legislation on toll roads very supportive of the A470 may be the only council person that has the'",
        "'speaker_3': 'express toll rfi the new transponder on my car. I use it. I pay for it. I'm happy to do so. It was going from point A to point B. A road was built and we got a connection that would not have otherwise been able to be there.'",
        "'speaker_3': 'I am just appalled to see that this that the Lexus lane is not getting more of a discussion and tolling this additional expansion. I do not support it at all. Secondly, the drainage. I have had only one comment from a constituent out in southwest Denver as a civil engineer who had done work on on transit projects before'",
        "'speaker_3': '. And the comment was that if we lower the highway because of the drainage issues, we are about to enter the biggest debacle that we ever could have. That stuck with me. Now, I know that there's been a newer drainage plan, a much more expensive drainage plan suggested that may solve the problem.'",
        "'speaker_3': 'I'm a person who has a lot of skepticism. I really like engineers. I don't always believe that when they say this is going to solve the problem, it will solve the problem. So I don't know if that's going to happen, but I do know that for a drainage problem that is costing as much as this one is'",
        "'speaker_3': 'that to have urban drainage pay, only 9.5 million, they just told me today is just insane. Why would you have urban drainage contribute so little? To a huge drainage issue. Now, when you separate out, let's go to money.'",
        "'speaker_3': 'When you separate out money, there's a $1.56 million of city money. Going into this. 76 million of it is basically enhancements we've asked for. 37 million of the enhancements are on the transportation side. I really hope that the new council members understand this.'",
        "'speaker_3': 'They are going to be paying starting in 2022. $2.68 million from the city annually for 30 years. There is no source identified for this money. Moreover, if we don't, the state is given authority to notify the rating agencies if the council fails and it's right there in the agreement that we're going to be voting on.'",
        "'speaker_3': 'Now on the drainage side, 39,000,000 million of enhancements. That's not even the the big drainage project they added. 39 million are for connectivity and park like features. That is going to require along with that other bigger portion increases in the wastewater fees.'",
        "'speaker_3': 'I'm not going to be sitting here to vote for the wastewater fees. The people that are going to be either going to be voting them up or voting them down are not all here. Some are. Some aren't. So.'",
        "'speaker_3': 'My bottom line is that even though I do want in on improvements in this area and I am willing to look to other solutions, I don't believe this is the issue that this council ought to be deciding because I can't follow through on the annual payments that are required, and I also can't guarantee that the wastewater fees'",
        "'speaker_3': 'are going to be increased. I would be very interested in delaying this until the next council comes on. They can get up to speed very quickly on this issue, but I am not going to sit here and have them tell me she made me do it.'",
        "'speaker_3': 'I have to increase your wastewater fees because that stupid council that was sitting here before made me do it. I'm not going to do it. So I'm going to be voting no on this. And I would love it if the future council would have to deal with this issue.'",
        "'speaker_1': 'Thank you, Councilman Fox. Councilwoman Ortega.'",
        "'speaker_9': 'Mr. President, I want to request a public hearing on this. And you and I talked about when that would be most appropriate. Looking at the calendar of so many other public hearings, we have scheduled both for next week as well as for July the sixth.'",
        "'speaker_9': 'So my request would be to do that on the 13th. I know that would be the last night that this council would be seated for some members, but I don't believe we have time on the calendar to do it.'",
        "'speaker_9': 'On either of those two nights, unless we plan to be here till wee wee hours of the morning, which we're probably going to be anyway, given the large number of public hearings that have been scheduled. So the request is for a public hearing, but I guess I would need to move to postpone final action with a public'",
        "'speaker_9': 'hearing to the 13th of July.'",
        "'speaker_1': 'So that is correct, Councilman. But we will first need to vote as it currently on the floor to be published as amended. So once we have that vote, assuming that vote is successful, then you will make a motion to delay final consideration.'",
        "'speaker_9': 'Until we just published as amended.'",
        "'speaker_1': 'We just approved the amendment and now we have it on the floor, published as amended. So can we vote on this? Then we will have the conversation about your courtesy public hearing, and you will make the motion, and.'",
        "'speaker_9': 'Then we will. I have a number of questions. I don't know if we have time to go through that tonight. It's also part of why I think we need a public hearing. I think the drainage project is absolutely needed for the Park Hill Basin and for the Montclair Basin.'",
        "'speaker_9': 'They will provide tremendous benefit to these neighborhoods Globeville, Swansea, Elyria, which get flooded like the last two weeks that we've had really bad rain. These neighborhoods have borne the brunt of a lot of that drainage in the highway project, I think is one that we've been dealing with for ten years.'",
        "'speaker_9': 'And I've got a number of questions related to the costs and concern that we have taken the drainage project and added everything else as part of the I-70 project into it. It doesn't really speak to the mitigation issues.'",
        "'speaker_9': 'You know, one could argue that the benefit from the drainage is is going to provide benefit to these neighborhoods. But there are issues like the impact to the residents that are within 500 feet of the highway. That in the mayor's letter that he wrote to Don Hood from CEDA in October 31st, 2014, one of the things that'",
        "'speaker_9': 'he did ask for and it's something the neighbors were asking for, was to have windows and doors replaced because during the construction there's going to be a lot of airborne contaminants that are in those soils of heavy metals from the Asarco globe plant.'",
        "'speaker_9': 'And so the health of the neighborhood should be number one in terms of ensuring that the children who go to school, it's once a year, which will continue to stay there during the five years of construction, as well as the families who live within that 500 feet.'",
        "'speaker_9': 'That will not be whose properties will not be taken and will continue to reside within, you know, a close proximity to the highway and be exposed to heavy metals. In the A meeting that we had last week with CDOT, they did indicate that one of the things they were looking at was purchasing portable air conditioners for the'",
        "'speaker_9': 'interior of residences. But that doesn't deal with the window indoors and the concern of of dust coming into their homes. So there are some of those concerns that have not been clarified because we won't see those details until we get the final environmental impact statement.'",
        "'speaker_9': 'And so we're dealing with some of these issues in a vacuum without knowing exactly how those concerns will be mitigated that. Impact neighborhoods that are covered by NEPA under Title six, which means, you know, they're a protected class and we need to make sure that those issues are clearly being addressed, but yet we don't have that information'",
        "'speaker_9': 'in front of us. I've got very specific questions that I'd like to go through. I know that we've got other people signed up that want to ask some questions, so I don't know if your pleasure is that I go through them and then you defer back to.'",
        "'speaker_1': 'How ever you feel. Councilwoman, if you want to go, we can certainly bring you back in the queue.'",
        "'speaker_9': 'Okay. Well, let me start with a couple of them first and then I'll defer to my colleagues. And then if they don't address the questions, then I'm more than happy to come back. So the first issue is under the early action.'",
        "'speaker_9': 'Drainage project and the two basin drainage project. Councilwoman Fox talked about some of the cost, but. What's not clear, for example, about the box cover is who owns that at the end of the day? Can can one of you speak to whether or not that box cover is owned by the city or why?'",
        "'speaker_9': 'And then who's responsible for maintaining it? This is the 2.5 million that I was asking about earlier.'",
        "'speaker_2': 'Mr. President, City Council. I'm Tony DeVito. I'm the I-70 project director. Question on the box. We are working together with the city. Let me clarify that the city's design levels on Brighton Boulevard redevelopment has not reached a point.'",
        "'speaker_2': 'To fully understand the amount of drainage that's going to be associated. We know that there'll be shared drainage in that and as we move forward, that is one of the items that is identified for further negotiation as we negotiate a maintenance agreement.'",
        "'speaker_2': 'That's one of the line items in the contract.'",
        "'speaker_9': 'So does that mean then that we'll see a different agreement in the future?'",
        "'speaker_2': 'As with many agreements between the city and the state on different levels of maintenance, with snowplows and other city street ordinances that we utilize with we we negotiate. And a lot of times the mutual maintenance plans.'",
        "'speaker_9': 'So is that an agreement that will come back before city council? Leslie, I'm looking at you.'",
        "'speaker_5': 'I think as usual and Sean can jump here depending on what the terms are, we will follow whatever the terms are according to the council rules. So if there is money changing hands or other items that would require that, it would definitely come back to city council.'",
        "'speaker_5': 'We don't know what those terms will be at this point. So if it's required, we will certainly be here and happy to be here.'",
        "'speaker_9': 'And is the funding available for the design for Brighton Boulevard?'",
        "'speaker_5': 'Yes, ma'am.'",
        "'speaker_9': 'And what is that amount?'",
        "'speaker_5': 'We have $26.8 million available already as stated in the agreement. And then the remaining 42.2 of the early drainage action early action drainage project will be provided by CDOT as we spend money over the next several years. Per the agreement.'",
        "'speaker_9': 'So this part of Brighton, is it closer to the Coliseum? Or are you talking about the money that has been earmarked for the Brighton Boulevard corridor?'",
        "'speaker_5': 'This part of the Brighton Boulevard box covered is between 44th and about the property line of Pepsi, which is right around. We call it 41st ish. That's where you'll find it.'",
        "'speaker_9': 'All right. And then on the $80 million that the city will be spending, which is basically the. 2.68 million per year that we would be obligated to pay for the next 30 years. The 39 million, that's for the park like amenities.'",
        "'speaker_9': 'That's not part of the 80 million, correct?'",
        "'speaker_5': 'I'll defer to Gretchen.'",
        "'speaker_3': 'Good evening. The council president on his way out. Members of council. My name's Gretchen Haller. I'm the city's deputy CFO. And I'd like to thank Councilman Fox for acknowledgment of the team that's been working on this, but it's both the city and see that in partnership.'",
        "'speaker_3': 'Just to clarify on your question, the 2.68 annual payment that's anticipated to last for 30 years is actually on the transportation side of the improvements. That's the 37 million in project cost. That's the financing that 80 million for the city share.'",
        "'speaker_3': 'That's a 60% share of $134 million total drainage portion of the to base and drainage project that would be paid through the city's wastewater fund. Those would be wastewater ratepayer eligible project costs. And then you're correct, there's an additional 39 million to take that drainage project and turn it into the amenity that's anticipated for the community that'",
        "'speaker_3': 'adds the park, like features the connectivity that would not be funded through the wastewater fund. That would be if you were to think about the ratepayer costs being the conveyance of water, the movement and storage and water quality cleaning of water.'",
        "'speaker_3': 'These features would be the park bench that sits next to the open channel, the trail that allows bike and pad connectivity to allow that to become a greater amenity for the community.'",
        "'speaker_9': 'So that cannot be paid for with wastewater funds.'",
        "'speaker_3': 'No, that's.'",
        "'speaker_9': 'Not. Where will that 39 million come from?'",
        "'speaker_3': 'We will be talking so similar to the wastewater conversation where we will be the budget office will be bringing forward a rate increase regardless of this project for consideration. As part of the 2016 budget process, we will be looking to fund that $39 million as part of the 2016 budget process.'",
        "'speaker_9': 'But that's not part of the rate increase from wastewater. No, that will come from somewhere else. Correct. In the city. Not wastewater.'",
        "'speaker_3': 'Correct. And just to clarify for folks at home, because there are several funding parts of this project, there is a portion of this that's the 37 million for transportation related. Denver requested elements to enhance that project. There is the wastewater portion of the drainage project that comes from the Wastewater Enterprise Fund.'",
        "'speaker_3': 'And then there's the 39 million that is a piece of the wastewater project that is not funded through the wastewater fund.'",
        "'speaker_9': 'Do you have any idea what the fee increase will need to look like for the increase in wastewater fees to cover these costs or to be able to do other projects? Because we're going to use the lion's share of wastewater dollars for this project.'",
        "'speaker_3': 'Yes. So the Budget Management Office has been working with a financial analyst over the past several months. They were not on this timeline. They were bringing this rate increase forward anyway. The last rate increase, as you recall, was in 2011.'",
        "'speaker_3': 'It's been four years. So we need to bring forward a rate increase to accomplish a couple of things. One is to make sure that we have a fully funded and viable capital citywide capital program for the fund. The second is to build a water quality program for the city.'",
        "'speaker_3': 'That is actually a requirement from the state to help us keep our EMS for permits. We are in a ten year window and John Sullivan can speak to this on the legal side if needed. But we're in a ten year window of that.'",
        "'speaker_3': 'I think we're on year four. So we need to take some serious action to provide improved citywide water quality as our water flows to the to the plant. It does happen that the drainage project in front of you is one great big water quality project in our most serious and impacted basin for water quality.'",
        "'speaker_3': 'It's an enormous basin. And so what we are funding as a part of the rate increase, this project fits nicely into and you will see that regardless.'",
        "'speaker_9': 'So are we not doing a 2.6 annual increase from wastewater?'",
        "'speaker_3': 'No, that amount is on the transportation side and that is the amount that.'",
        "'speaker_9': 'Are I'm just talking about annual cost increases to the taxpayer from wastewater. Is that not something that we see on a on an annual basis?'",
        "'speaker_3': 'So we don't have the ratepayer increase for you today. We are anticipating to bring that as part of the 2016 budget discussion. We will begin conversations with you on that near mid to end of July. So that can be part of the September budget hearings.'",
        "'speaker_3': 'The only 2.6 number for today is on the transportation side, and that's the financed improvements and that payment would begin in 2022. And that allows us to leverage CDOT essentially to construct those transportation improvements. And the city does not participate in those payments until they're fully constructed.'",
        "'speaker_9': 'I will defer to my colleagues. I know you have other folks in the queue, so I will wait. And if you could put me towards the back, if my questions get asked, I will scratch them off my list.'",
        "'speaker_1': 'All right. Thank you, Councilwoman Ortega. Councilman Lopez.'",
        "'speaker_0': 'Thank you, Mr. President. You know, I am looking at this bill, and I'm recalling our long Kent City Council committee meeting in which we discussed all of this, which we, you know, had the opportunity to really delve into the issue, ask questions, and then move this on to the rest of the council.'",
        "'speaker_0': 'Now, what I what I take back from it, yes, there's a lot of different intricacies, but what I take back from it is putting on my role as the chair of urban drainage and flood control. And Black is probably this is the basin, the drainage basin that is our biggest threat to the city and county of Denver'",
        "'speaker_0': ', to people and property. And if we don't do anything about it, we're going to have ten times worse than what happened to Boulder and Aurora in this area with the ongoing construction, with the you know, I wasn't at first and very supportive of building this expanding the highway through this neighborhood.'",
        "'speaker_0': 'I was a big proponent of the reroute that's long gone and discussion. Now we're looking at drainage. We have to be able to get this done. We have to be able to move water out of this basin into the Platte River so we can do everything we need to do, but also protect lives and property, the most'",
        "'speaker_0': 'basic form of government in this area, and keep people safe and keep Denver out of a flood zone. So I you know, I really want to just express my support for it. I don't have any more questions. A lot of my questions were answered in committee.'",
        "'speaker_0': 'But I do want to see this move forward. And I'll hopefully I'm curious to what my other colleagues feel as well, too. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Lopez, Councilwoman Canete.'",
        "'speaker_7': 'Thank you, Mr. President. I wanted to just clarify two pieces, which is about the portions of this project that are necessary regardless of I-70, and then some questions about timeline. So I might just ask the timeline question first.'",
        "'speaker_7': 'One of the constituent questions that I've received that I think is really important in terms of respect for the legal process that we are in with the IRS, is what happens in this agreement if if the record of decision is not to proceed with the I-70 project.'",
        "'speaker_7': 'And so I think Sean Sullivan had answered this question for me, if I might ask him to share that answer.'",
        "'speaker_2': 'Sean Sullivan, the city attorney's office. The agreement provides that if the if there if the record decision isn't completed and doesn't come forth with the Lord, cover a partial underground solution, then it would be terminal at the mutual agreement of the parties.'",
        "'speaker_2': 'So it forces us back to the table to talk about what we need to do in next steps.'",
        "'speaker_7': 'Great. Thank you. Now, I don't want to be naive. Right? The agreement says that if the record of decision comes forward by December of 2016, then the agreement can be terminated. But we're planning to start construction in January of 2016.'",
        "'speaker_7': 'And so that detail has not escaped me that we're starting construction a year before the deadline for record of decision. So I really want to understand and this may not this may be you, Sean, or it may be someone from the project team.'",
        "'speaker_7': 'What it is that we'll be doing in year one and how it is how much of that portion of work that's happening in year one would be necessary regardless from or separate from the I-70 project, because I think it's a really important question my constituents have asked, which is, are we spending money on a project that's not'",
        "'speaker_7': 'yet approved before it's approved, or are we spending money that would be helpful for that project but would be needed regardless of it? And I really want to have you talk about that first year of construction. I didn't see in the exhibits a clear verbal description of what the Early Action Project was.'",
        "'speaker_7': 'There's a map. It's very difficult to read, so and neither could I find it in the PowerPoint. So I think if you can verbally describe what's happening in year one and exactly what it does for Denver, I would be most appreciative.'",
        "'speaker_2': 'And I'm going to defer to an engineer three great.'",
        "'speaker_4': 'Things.'",
        "'speaker_5': 'Thank you for your question and clarification opportunity to clarify the early action drainage project that is critical and we have agreed to have in place by December 1st of 2017. Yes. They're all nodding. It goes from the South Platte River up through the coliseum that we just talked about, up through the Pepsi parking lot and into Brighton'",
        "'speaker_5': 'Boulevard. And then if you can imagine what we were talking about with Councilwoman Ortega earlier, that's that 41st ish place. And then it goes within Brighton Boulevard over to about the entrance to the Coliseum or 44th is right where you get on the highway.'",
        "'speaker_5': 'That is the piece that we will need to be working diligently on within that timeframe between now and the end of 2016, I believe is what's referenced. That is the piece that is the very bottom of the basin.'",
        "'speaker_5': 'So think of it like the back, that plug to the back through the drain to the bathtub and the bigger of a drain that we have, the more capacity we have to pull the water out of the city.'",
        "'speaker_5': 'So while it would be bigger than if it was only funded by our wastewater rates, which are to provide a five year system, which is about an inch of rain an hour, as opposed to 2.6 inches per rain of rain in an hour.'",
        "'speaker_5': 'But it is always good to have more capacity at the bottom of the basin. So that's where we would like to see it.'",
        "'speaker_7': 'Thank you, Mr. President, if I may follow up. So I want to clarify then. Sorry I dropped my pen. I want to clarify then that. So we are taking input from CDOT with regard to I-70 with the design of this project.'",
        "'speaker_7': 'But if I-70 is never built. The project in the first year would still benefit drainage in the region, whether we go to a different I-70 replacement bridge solution, whether it. Nothing happens and we just wait for it to fall down.'",
        "'speaker_7': 'Whatever it is. The drainage project that we're doing in that first year before we know definitively is one that has a function for Denver's drainage.'",
        "'speaker_5': 'Yes, absolutely.'",
        "'speaker_7': 'So that's, I think, really very important. And then the other piece I wanted to clarify is in terms of the GMs for permit, you mentioned that the state has water quality. So one thing we're dealing with here is flood control.'",
        "'speaker_7': 'Does this first early action portion also have a quality portion to it that is contributing to the state or is that later phases?'",
        "'speaker_5': 'The majority of it would be later on because you're capturing so much in the basin and would have a place to store it. We are working with urban drainage and flood control and Parks Department to see what can be done in the first phase.'",
        "'speaker_7': 'Okay. Excellent. Thank you very much. So I'm just going to make my comment briefly since that question for me was really important. I do I shared in committee my question about the timing of this agreement being early. And I do continue to have that concern that it is early.'",
        "'speaker_7': 'But I believe in the benefit to our taxpayers of starting a process to be prepared and knowing that the benefits are going to accrue to the city and to homeowners and to businesses in this area, regardless of what happens with the project is really important.'",
        "'speaker_7': 'If that were not the case, I probably could not vote for this agreement today because it is early before the record of decision is definitive. But we have a transportation agency that has an RFP out for someone to build this project so that they're prepared.'",
        "'speaker_7': 'And if we are able to use our dollars wisely and leverage urban drainage and flood control dollars, then I believe that it is prudent to do that, to have those benefits accrue to leverage those dollars, and not without any risk accepting the risk that should this project not go forward, we would then need to, you know, figure'",
        "'speaker_7': 'out a way to, you know, everyone would have to pay their way and we would have to pay out of continuing the project further. So, so that's a risk, but it's one that I'm willing to accept given the benefits of the first year project.'",
        "'speaker_7': 'And really that's the period of time that we're talking about is one year. So with that, I will be supporting the agreement tonight. Thanks.'",
        "'speaker_1': 'Thank you, Councilwoman. Councilman Brooks.'",
        "'speaker_0': 'You know, Mr. President, I think a lot of my comments, Councilman, can each touch on Psalm and Lopez as well. I think, you know, at times we get in the technicalities of an agreement and we forget the reality.'",
        "'speaker_0': 'And the reality is this is the worst basin in the city where two basins in the city combined. The reality is, while it might be nice to wait, there's residents and businesses who are fed up about the constant flooding that comes in their neighborhoods and businesses.'",
        "'speaker_0': 'The reality is that if Boulder's rainstorm and in Longmont would have been over this area, we would have had $300 million of development to replace. Houses businesses I 70. And so you know, we're talking about Katrina like issues here and I know that everyone sees that it is an issue.'",
        "'speaker_0': 'But I think. There's not enough urgency and there's not enough acknowledgment that the city is trying to put together a plan that many businesses, many I know I have for the last four years have been looking for opportunities for us to combine projects to get this done.'",
        "'speaker_0': 'And so, you know, I just wanted to say that and be on the record for saying that as someone who lives in the area, who witnesses the flooding constantly. And I know that there are some issues within the contract that are good questions and we need to talk about.'",
        "'speaker_0': 'I just thought we were doing that for the last two weeks with the staff in committee special meetings, and obviously we need to continue to do that. But my my I would I would be wrong if I didn't sit up here and talk about the seriousness of this issue and state my my constituents concern that this project'",
        "'speaker_0': 'is not moving fast enough. Thank you.'",
        "'speaker_1': 'Thank you. Councilman Brooks, Councilwoman Laney, I.'",
        "'speaker_3': 'Just want to clarify one thing.'",
        "'speaker_5': 'That when they started the.'",
        "'speaker_3': 'East Line and they decided, well, how are we going to build it? They said we are going to build this, which goes right through that basin at a five year flood level.'",
        "'speaker_7': 'That would.'",
        "'speaker_5': 'Mean.'",
        "'speaker_3': 'That even in a regular rainstorm in Denver, if it was a heavy rainstorm, that the east light rail would flood. They would bring busses in and you would take people out to go wherever they're.'",
        "'speaker_8': 'Going to go.'",
        "'speaker_4': 'So I raised.'",
        "'speaker_3': 'Really a huge, huge objection to that as a result of what.'",
        "'speaker_5': 'Is being proposed this evening.'",
        "'speaker_3': 'That piece of light rail will be in the 100 year flood plain will be protected and that bright light rail line will be able to run.'",
        "'speaker_5': 'Almost.'",
        "'speaker_3': 'Always. Not by now, I promise you. Always, but almost always. It was if I've done nothing well in my in my 12 years, that was the best thing I did. So I certainly will vote for this.'",
        "'speaker_1': 'Thank you, Councilwoman Lemon. Councilwoman Ortega. You're back.'",
        "'speaker_9': 'Thank you. I'm sorry to be in the weeds with this, but I've been involved with this I-70 project, and since. Since I got reelected and actually before when I left council, we were at the beginning of the year for this project.'",
        "'speaker_9': 'And a lot of the focus right now on this inter-governmental agreement is on the drainage. Some of it is on the transportation. And I think it's important for taxpayers to know what we're committing to. I don't dispute the need for this drainage project.'",
        "'speaker_9': 'I've seen the area flooded and know what the need is for these communities that bear the brunt of of where that water flows to from these two basins where it's needed. But I wanted to ask a question about the liquidated damages.'",
        "'speaker_9': 'And, Sean, if you wouldn't mind, coming up to the microphone under this section. Basically, it would obligate us to pay five. Thousand dollars a day for the project being late if it's not done by the deadline spelled out, which is September one, 2019.'",
        "'speaker_9': 'But I didn't see anything in there that would address circumstances like the kind of weather we've had the last two weeks. Any act of God that might occur, and it seems that there should be some wiggle room and it doesn't look like there's any wiggle room in that language.'",
        "'speaker_9': 'So can you help me understand if if we don't have it delivered by that date, that we'd have to start paying 5000 a day, regardless of whatever kind of weather conditions exist?'",
        "'speaker_2': 'Yes, Kels. Well, I hope her partners would be reasonable in those circumstances. But in any case, if you look at paragraph 24 of the agreement, there's a force majeure clause which requires or disallows the collection of damages in a situation that's an act of God or that kind of thing.'",
        "'speaker_3': 'Okay.'",
        "'speaker_9': 'Thank you. That that's helpful clarification. Gretchen, can you talk about how many properties are going to need be needed for the drainage project? And does the funding that we're approving include any of those takings that we will have to purchase as a result of the court order that we will utilize?'",
        "'speaker_3': 'Well, I may be as good as anyone answering this on the budget side. Yes, there is budget included in the total project cost that contemplates some land that will be necessary for the city to acquire to accomplish the project.'",
        "'speaker_3': 'As far as which properties would be impacted, that is not known at this time due to the stage of design that we're in. But it will be accompanied and this is really a public works question, but with a robust public process on as we move through design phases.'",
        "'speaker_3': 'Okay.'",
        "'speaker_9': 'And one last question for Leslie. Can you give us an idea what the the width of that drainage channel is anticipated to be?'",
        "'speaker_5': 'Yes, but I have to get out my map and maybe my glasses, so just hang.'",
        "'speaker_9': 'So while you're doing that, I just wanted to let my colleagues know that I had a request for an amendment that would have addressed trying to keep truck traffic out of the neighborhood and trying to tie that to this agreement.'",
        "'speaker_9': 'We talked with David Broadwell today, learned that these agreements are considered contracts and council does not have jurisdiction to amend contracts. So that's why that amendment is not was not brought forth. So just want to clarify that. Go ahead.'",
        "'speaker_5': 'Okay. Thank you. So in your exhibit, it does refer to how much water is being carried in the drainage channel. So without providing you had your hydraulics lessened, it will depend upon the slope and several other things. So you can think about somewhere between 150 to 250 feet, just depending upon the circumstances.'",
        "'speaker_9': 'And what's the average width of a street?'",
        "'speaker_5': 'An average width of the street. Typical downtown streets are 80 foot right of ways and 48 feet. Flow line to flow line or curb to curb is a typical downtown street is what you would see here.'",
        "'speaker_9': 'Okay. So what would you equate that to? About half a block. Half a block wide.'",
        "'speaker_5': 'Maybe if you're on the skinny side of a block by Denver, blocks are around 300 by 600. So, yes, if you're on the thin side of the block. Yes.'",
        "'speaker_9': 'Okay. Thank you, Mr. President, I. Any additional questions that I have? I will continue to direct them to staff. I've been ongoing meeting with them, had a meeting with manager, I guess it's executive director now, Courtney Hoh on Friday to address some of these additional questions.'",
        "'speaker_9': 'I would like to request a public hearing. So let me do that in the form of a motion.'",
        "'speaker_1': 'Well, Councilman, first we have to vote EIS and then we will write that. Then that issue will be addressed. Okay. All right, Council. Councilman Monteiro, you're up.'",
        "'speaker_6': 'Thank you. Since it feels like we're having a public hearing. I want to get on the record a couple of questions. What? What I. We did a proclamation back in April. The city council voted on it. And we talked about things that we would like to be included as the city team is looking at the is looking'",
        "'speaker_6': 'at the negotiation. And generally they had to do with drainage, air quality fumes, emissions, noise, traffic counts, displacement of residents, connectivity, quality of place, jobs and education for residents. And specifically, some of the things that we had talked with you about was the and I know this has nothing to do with the AG in front of us'",
        "'speaker_6': ', but I have to bring it up since so many other things have been put out there. But so I would like for someone to tell me with the compensation or whatever in a position during this negotiation to talk about narrowing the footprint of the highway and what that answer is.'",
        "'speaker_6': 'Also the the railroad tracks at 47th and York Street, which is no secret to any of you because I'm always talking about this stuff and then also the truck reroute. So if you can answer those and then tell me, tell the public, for the record, whoever the most appropriate people are.'",
        "'speaker_6': 'Is this the last bite of the apple or tonight? Are we specifically talking about the transportation and drainage issue as it relates to this agreement? So who wants to go first?'",
        "'speaker_5': 'I'll try. And then Tony and Gretchen, maybe you will help me. So your first question was about the highway full width highway footprint. And so what I would like to share with you is that we have had a group of technical experts from both CEDA and Denver, FH, W.A. and the consultant teams taking a look at what'",
        "'speaker_5': 'is the reasonable type of recommendations that could be made to see that and the number of feet that they recommended that could be narrowed or taken out of shoulders and things is eight feet. Yes. And so that is a recommendation that C will carry forward to FAA and Tony can speak more about that when that time is'",
        "'speaker_5': 'appropriate.'",
        "'speaker_2': 'The City Council. Mr. President, again, Tony DeVito would see that. I want to emphasize that this agreement, while it codifies a lot of the working process that we've had over the last couple of years, in no way does this stop the commitments and the mitigation that we are working towards.'",
        "'speaker_2': 'On the environmental side, the NEPA process working through the next year and getting to a record, a decision, the record a decision is the binding contract with the Federal Highway Administration that mandates the commitments that the D.O.T. will deliver.'",
        "'speaker_2': 'And so in no way does this agreement modify, minimize, do anything to that effort as we move forward. And so with regard to the air construction dust. Air quality noise, noise, walls, everything else that we are working through will continue in the normal process.'",
        "'speaker_2': 'All this does is it identifies a path forward for some of the agreements of the transportation and drainage issues that we have come to terms on.'",
        "'speaker_5': 'So I'll do the specifics then. So on 47th in York, which we all know is a very tricky intersection of the railroads and the corridor for children to go back and forth to school between Elyria and Swansea, we worked diligently with Seedat to see if there was a way that this could be included at this time and'",
        "'speaker_5': 'what was determined because of some of the land that was needed, as well as some public process in order to understand whether going over or under and other things that would really could be impacts to the neighborhood needed to be looked at.'",
        "'speaker_5': 'And so it is not in this agreement, but it is a study funded that we funded last year, I believe through and DCC and will be as we move forward looking at those kinds of changes to that intersection to see what can be done.'",
        "'speaker_5': 'And I apologize. I don't remember the last part of my truck. Reroute. Oh, truck reroute. Can you talk about truck free routes?'",
        "'speaker_2': 'Once again, we've had numerous conversations about the different truck movements during construction. We have had very viable conversations about being sure that there's certain areas that when we're putting together a procurement documents that will be very sensitive towards idling the types of equipment staging.'",
        "'speaker_2': 'And so we have come to some agreements on some of those because it is interstate and does invoke interstate commerce. We have to be very cautious about restrictions, but we can encourage routing, especially during construction, especially for the through the long haul haulers that are utilizing the interstate.'",
        "'speaker_2': 'And we've had some conversations on that and those conversations can continue. If you have something specific I can try to answer.'",
        "'speaker_6': 'I just have a question for David. David Broadwell. So Mr. David always talked about the obligation in terms of interstate. And so I wanted to just ask you at what point, even though I know we don't have anything definitive, would a city ordinance be in place regarding truck rerouting?'",
        "'speaker_10': 'David Brock, also associate attorney. I'm really not prepared to answer that question because I'm just not close enough to the project details to do that. I would prefer that perhaps someone else in the team has a sense for when that might happen.'",
        "'speaker_6': 'Questions coming up to the podium.'",
        "'speaker_2': 'It's not an issue that we've discussed, but we can certainly look into it and see. I think Mr. De Vito was making the point that we've got interstate commerce issues, so we're going to have to look into those kinds of issues.'",
        "'speaker_6': 'Well, I would request that you do. That's a huge issue for the neighborhood, and it's been outlined in the health impact assessment. So I don't want it to be ignored. So if you would do that, appreciate it.'",
        "'speaker_2': 'Yes. And I'm certain some of those things are going to be addressed through the NEPA process as well. So.'",
        "'speaker_6': 'Okay. Thank you. Thank you, Mr. President.'",
        "'speaker_1': 'Thank you. Councilman Monteiro Castro McKinney.'",
        "'speaker_7': 'Thank you, Mr. President. I just wanted to chime in. I appreciate Councilwoman Taylor. I'm sorry. Montero's questions in particular, the question about, you know, later negotiation, because I can see that as a good thing, that this is not the last bite of the apple.'",
        "'speaker_7': 'But my concern is that we on the transportation side of this agreement, we're committing $37 million. And what I don't what I am concerned about is that that is our leverage. And I am concerned that when we have asks to finish these other pieces, whether it's employment opportunities for the community, which the federal government is opening the'",
        "'speaker_7': 'doors for in ways that see that should take advantage of for this project, for example, or other mitigations that we are not in a position. And I'm just saying this on the record. Well, you know, Director DeVito is here and our commissioner is here.'",
        "'speaker_7': 'I don't want to hear that. We don't have any consideration to offer for those things because, you know, we've given you the money up front. And so it is critical that when we come to the table to finish all of these other pieces that are really important, that CDOT looks back at the consideration in this agreement and'",
        "'speaker_7': 'takes that into account when considering the other pieces that we may yet need to come to agreement on. And and I'm really serious about that, because there will be other contracts and other agreements and other approvals required, including the annual appropriation process, which this agreement is subject to.'",
        "'speaker_7': 'And, you know, budgets with amounts in that amount. I mean, I would say to this council and future councils that it's critical that we continue to negotiate for these remaining items and that our commitment of this $37 million upfront does not, by any way, forgo our ability to ask and demand and negotiate for other things that this'",
        "'speaker_7': 'community needs in mitigation for this project. So I'm very hopeful and encouraging that that will happen. But I just I want it to be known that that if it's not if the moment is passed on, the $37 million, this council has an annual appropriation where we can follow up to make sure that that negotiation continues in good'",
        "'speaker_7': 'faith. So little, little heads up. Thank you, Mr. President. I'm still voting for it, but with that stern warning. Thanks.'",
        "'speaker_1': 'Thank you, guys. Okay, so just remind my colleagues what we have before us right now is 381, which is to be published as amended. See no other comments. Madam Secretary. And after this vote, we will deal with the conversation of the currency, one currency public hearing.'",
        "'speaker_1': 'So that will be the next issue. Madam Secretary, Roll Call.'",
        "'speaker_4': 'Montero High. Nevitt Ortega. Abstain. Rob Shepherd. Past Susman by Brooks Brown. I thought no can teach the layman. Lopez. Hi. Ortega. She states. Okay.'",
        "'speaker_5': 'Shepard Epstein.'",
        "'speaker_4': 'Mr. President, I.'",
        "'speaker_1': 'I'm secretary. Please positively announce the results.'",
        "'speaker_4': 'Nice one. Nay, two abstentions.'",
        "'speaker_1': 'Anais. One, nay. Two, two abstentions. Three, two, one has been published as amended. Okay. So there is a request for a one hour courtesy public hearing on July 13. Just to give the viewers a little bit of background, typical requests for one hour courtesy public hearings are done at the discretion of the council president, and it's usually'",
        "'speaker_1': 'followed the next week. The one caveat for this time is that it will be because the request is to delay final consideration. That will require a vote of council. So what we're going to do, Councilwoman Ortega, what I need from you is a motion to postpone final consideration to Monday, July 13th.'",
        "'speaker_1': 'Then we will have comments and we will vote on the motion to delay final consideration and have a one hour cursory public hearing on July 13th.'",
        "'speaker_9': 'Okay. Let me just be very clear and specific that if the motion fails, I want to request a one hour public hearing for next week when this bill comes back. If there are not enough votes for the postponement.'",
        "'speaker_1': 'Certainly it can be next week or another date certain if another council member chooses to do that. You're absolutely right, Councilman.'",
        "'speaker_9': 'So I move that council. Bill 381. Be ordered published as amended with. So we haven't done that yet.'",
        "'speaker_1': 'Right? So we've done that. So it's just move for final consideration.'",
        "'speaker_9': 'So I move that final consideration on Council Bill 381 be postponed until July 13th, 2015.'",
        "'speaker_1': 'With a one hour curfew, but.'",
        "'speaker_9': 'One hour workers, a public hearing.'",
        "'speaker_4': 'Okay, second.'",
        "'speaker_1': 'So we need you. That technology will catch up with us, Madam Secretary. Councilman Ortega, you can go ahead and begin your comments if you have any.'",
        "'speaker_9': 'I think, you know, I think this just warrants the opportunity for the public to come and ask questions. We're obligating a large amount of money towards both the transportation side and the drainage side of this project. I absolutely believe in the need for the drainage.'",
        "'speaker_9': 'I wish these two would have been separated so that we could have dealt with them separately. But I just think that there's so much here that we're committing to. And as Councilwoman Canete said, we are basically giving up all of our leverage upfront without ensuring that the kinds of things that need to be addressed.'",
        "'speaker_9': 'And, you know, there have been ongoing negotiations back and forth between Denver and Seaport on many of these details. There hasn't been a public meeting with the neighborhood in a while for them to be privy to what a lot of these negotiations have included.'",
        "'speaker_9': 'And I'm concerned that this is part of the NEPA process. It's part of the Title six process, ensuring that the residents are involved in in these kinds of decisions that are being made. And so I think it's important for the public to have an opportunity to come and share their comments, concerns with us.'",
        "'speaker_9': 'The agreement is up on our system for anybody who wants to take a look at those details and be able to come and express those concerns. I've talked to a number of residents that live in the neighborhood who had concerns about where all the mitigation is related to the truck traffic that we talked about, related to the'",
        "'speaker_9': 'air quality impacts and what is in fact, going to be done with the homes of people who live within 500 feet. As I shared earlier, all the air quality studies we've looked at really indicate that anybody that is within that 500 feet are subject to greater health effects and especially for small children.'",
        "'speaker_9': 'And so I'm concerned about how we're going to deal with that, not having had not having been privy to seeing the details that are going to be in the final year. So I would just respectfully request that my colleagues support this postponement to allow us to have this one hour courtesy public hearing on a night that we're'",
        "'speaker_9': 'not already overloaded with other public hearings. Thank you.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega, Catwoman fans.'",
        "'speaker_3': 'Thank you, Mr. President. Had Councilman Ortega pushed this out to the next council, chosen a much later time? I may have been very supportive. We're still dealing, though, with the fact that a group, even on the 13th, who is not responsible for the 2.68 million annual payment for 30 years, who is not responsible for raising wastewater fees'",
        "'speaker_3': 'and who is not looking in the next budget for the 39 million for connectivity and park like feature funding? We have we haven't gone out to the people who actually will be doing that and giving them a chance to hear from the public.'",
        "'speaker_3': 'So I am not going to be supporting this motion. It's not that hearing from the public is wrong. I really believe that in a case like this it would be very appropriate, but not at that time.'",
        "'speaker_1': 'Thank you, Councilman Fox. Councilman Brown, Councilwoman Monteiro said you can go before her. So you're up.'",
        "'speaker_2': 'Thank you, madam. Thank you, Mr. President. You got to stick around here a little longer. Yeah, well, as we all know, the the final meeting of this council when seven of us will be leaving. Thank you for withholding your applause.'",
        "'speaker_2': 'We've been trying for the last couple of months to avoid a public hearing on our last night, and that's why we cowboy it up and decided to have a meeting. On a night that we usually don't meet. And that's the 4th of July holiday.'",
        "'speaker_2': 'So we will be meeting on July the six in order to avoid a public hearing on our last night. So this does completely the opposite. Here we are again. But the public hearing proposed for our last night adamantly against that.'",
        "'speaker_2': 'I'm not against the public hearing, but not repeat, not on Monday, July the 13th.'",
        "'speaker_1': 'Thank you, Councilman Brown. Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you, Mr. President. I will be opposing the public hearing for July 13th. I think that I think that the city team and Seerat are prepared to come back and answer more questions. I want to tell you that I feel that you have done an excellent job tonight.'",
        "'speaker_6': 'Having said that, honoring Councilman Ortega's request, I think it is a good idea to take some time for the public to weigh in. But I will be opposing it because I am not in favor of July 13th. I think that having a special meeting on the evening of July 6th is appropriate.'",
        "'speaker_6': 'I took the time today to talk with Brad Buchanan, who all of you know is the head of planning and the other the other zoning, the other text amendment, public hearings that are coming up on the six relate to the Highland neighborhood.'",
        "'speaker_6': 'And we have worked very long and hard for two, two and a half years to work on these text overlays. And I completely believe the neighborhood is organized. They're always vocal and opinionated, which is that's just how we roll in North Denver.'",
        "'speaker_6': 'But I do believe that we can accommodate the request for a public hearing, not on the 13th, but on July six. So I would ask my colleagues to consider having it on July 6th.'",
        "'speaker_1': 'Thank you, Councilwoman Monteiro. Councilwoman Robb.'",
        "'speaker_4': 'Thank you. Council President.'",
        "'speaker_3': 'And, you know, I count eight.'",
        "'speaker_7': 'Public hearings.'",
        "'speaker_3': 'For July six.'",
        "'speaker_7': 'Two were on national western, which.'",
        "'speaker_8': 'Is.'",
        "'speaker_4': 'Very important. And just the staff reports alone are going to go on. You know, I'm paid to work either.'",
        "'speaker_7': 'Night, so.'",
        "'speaker_4': 'I would be fine with with either time.'",
        "'speaker_8': 'Although I have to say Councilman Fox has been somewhat convincing to me and this is.'",
        "'speaker_4': 'Just first reading. I'm open to a public hearing. I'll probably support the 13th.'",
        "'speaker_1': 'Thank you, Councilmember. I just. Madam Secretary, just wanted me to make sure that it will be five public hearings on the six, because some of them are combined. So there'll be five on July six, correct, Madam Secretary? Great.'",
        "'speaker_1': 'Oh, Councilwoman Sheperd, you're.'",
        "'speaker_5': 'If I understand correctly, a public hearing on the 13th would be a one hour courtesy public hearing, correct? Correct. And then, I mean, I think it's entirely reasonable to have a one hour public hearing on the 13th in order for these issues to be aired.'",
        "'speaker_1': 'Thank you, Councilwoman Shepherd. Anybody else for the motion to postpone final consideration and have a one hour cursory public hearing on Monday, July 13th. Scene on Madam Secretary, Raquel Ortega.'",
        "'speaker_4': 'Hi, Rob. I Shepherd. I Susman.'",
        "'speaker_5': 'No.'",
        "'speaker_4': 'Brooks Brown.'",
        "'speaker_1': 'No.'",
        "'speaker_4': 'No. Can each layman.'",
        "'speaker_3': 'Pass?'",
        "'speaker_4': 'Lopez No. Monteiro No.'",
        "'speaker_0': 'Nevitt No.'",
        "'speaker_8': 'Lehman No.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'No. Catwoman. Lemon, need your.'",
        "'speaker_0': 'Sorry.'",
        "'speaker_1': 'Madam Secretary, please positively announce the results.'",
        "'speaker_4': 'Four eyes, nine nays.'",
        "'speaker_1': 'For eyes nine. The motion to postpone final consideration have a one hour cursory public hearing on July 13th has failed. Councilwoman Ortega, you're up.'",
        "'speaker_9': 'Okay, so let's try for July 6th. I move that council bill 381 be postponed with a one hour courtesy public hearing to July six, 2015.'",
        "'speaker_1': 'Wait for technology catch up. It has been moved and seconded. Do we Catwoman or take a Catwoman fight?'",
        "'speaker_3': 'A question. And this is maybe a rhetorical question that could just be and nodded. Is there anyone on this council who would be interested in delaying this for the new council? I'm getting the feeling that new council members would not necessarily be opposed to that.'",
        "'speaker_3': 'I became. And I would think that you might even want to pick enough time to get them up to speed a little bit so that it would be probably the end of August. Or if that can't.'",
        "'speaker_1': 'Even be chiming in. Go right ahead, sir.'",
        "'speaker_10': 'Well, we haven't had a chance to have the conversation between US attorneys, but you all are familiar with the charter rule that says if there's no action by counsel within 30 days of submission, then the the the matter can simply be executed that charter rules for a reason.'",
        "'speaker_10': 'And so we need to have a conversation about where the whether this is even feasible depending upon what the day would be. So so I don't see a lot of nodding going on, but I just wanted to alert you to the fact that you might kick into that issue if if you were to delay it and delay'",
        "'speaker_10': 'July.'",
        "'speaker_3': 'I withdraw that little rhetorical question.'",
        "'speaker_1': 'Thank you. Councilman Fox. Councilman or take it that you have more or are you just chiming in here? Councilman Lopez, you're up.'",
        "'speaker_0': 'Thank you, Mr. President. With all due respect to Councilman and take I know your questions are very valid and I know there are some answers that she needs. You know, I like I said, I, I do believe we have a council process.'",
        "'speaker_0': 'We had a long committee meeting. We had questions at that time. We had the opportunity for public to chamber. I mean, we could have had the opportunity for public to chime in. I think I don't know. I think we had it was I think we had a speakers list, but I haven't had any emails about this.'",
        "'speaker_0': 'It hasn't been on my ticker as something that was controversial. As a matter of fact, I thought maybe we'd spend a little time on this. We've now spent probably 2 hours on this particular issue. I don't I'm not a fan of doing committee work on the floor.'",
        "'speaker_0': 'And I think it's had it's process. It's you know, staff has done their job in making sure that every single one of us had the opportunity to be briefed, had questions asked. Again, I'm not I'm not challenging the questions posed by my colleague, Councilman Ortega, but I just think that we run that 30 day deadline and we'",
        "'speaker_0': 'run, not lose. I'm not putting this on. I mean, just fizzling it out. And like I mentioned before, there's a lot at stake with this particular bill in terms of drainage. And that's why I, I mean, I'm not a fan of postponing it any longer.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'Thank you, Councilman Lopez, Councilman Canete.'",
        "'speaker_7': 'Thank you, Mr. President. I just want to clarify that my support for the bill is separate from the fact that I believe the public has a right to weigh in when when they've requested it, because the portion of this contract that deals with the transportation improvements.'",
        "'speaker_7': 'If it were only a drainage agreement, I would consider it much more cut and dry. But it does include the $37 million for transportation improvements. And unfortunately, we don't have council, we do not, as a matter of policy, have comment on contracts in committee.'",
        "'speaker_7': 'So there was not an opportunity for the public to comment in committee. It's always the discretion of a chair upon request to add it, but it's not required. And so so in good conscience, I have to give, you know, give this a yes vote.'",
        "'speaker_7': 'Although I having a courtesy public hearing at the end of five required public hearings, I don't know really meets the standard of a good I don't know the quality and what we put the public through in waiting to speak.'",
        "'speaker_7': 'So with that caveat that I recognize that I voted for the first motion which failed. So as a as a second time around. But I did just want to clarify that it's the transportation portion of this that I think makes it valid for public input.'",
        "'speaker_7': 'So thank.'",
        "'speaker_0': 'You.'",
        "'speaker_1': 'Thank you. Councilwoman Canete, any other comments? We have the motion before us for final consideration to be postponed in a one hour courtesy public hearing happen on Monday, July 6th. Scene nine. Madam Secretary, I believe Councilman Ortega is comments are good.'",
        "'speaker_9': 'I don't know why. It's okay.'",
        "'speaker_1': 'Madam Secretary.'",
        "'speaker_4': 'Raquel Ortega.'",
        "'speaker_3': 'Hi.'",
        "'speaker_4': 'Rob. I shepherd i susman. Brooks Brown. I fats.'",
        "'speaker_3': 'No.'",
        "'speaker_4': 'Can eat lemon. Lopez, monteiro. Nevitt.'",
        "'speaker_0': 'Hi.'",
        "'speaker_4': 'Mr. President, I.'",
        "'speaker_1': 'Madam Secretary, please close the voting. And as a result, 12 eyes. One name is one day. Final consideration for 381 is postponed to Monday, July six, and we will have a one hour courtesy public hearing. All right. We are halfway there.'",
        "'speaker_1': 'The next one. Madam Secretary, 376 caught out by Councilmembers Fox and Lopez. Councilman, did you want this called out for a vote?'",
        "'speaker_3': 'I do.'",
        "'speaker_1': 'Councilman Lopez, you just had a comment.'",
        "'speaker_0': 'What I you. I'll defer to Councilman Fox for comments because I think I'm going to follow up with them.'"
    ],
    "Grants a $1.7 million loan to St. Charles Town Company for costs related to the relocation of residents of the Shady Nook and Belmont Mobile Home Parks in Council District 3.       ": [
        "'speaker_1': 'Perfect. Councilwoman Ortega, could you please order 376 published?'",
        "'speaker_9': 'Absolutely. I move that council bill 376 be ordered publish.'",
        "'speaker_1': 'Date has been moved and second it comments. Councilwoman Fox.'",
        "'speaker_3': 'Thank you, Mr. President. This particular ordinance is not one that I object to in substance. I really do believe that money needs to be made available for relocation of individuals. I think it's a good project. I am having a problem with a developer.'",
        "'speaker_3': 'I've had it before. The developer has come to us for other things. I always give a person a chance, but by the time a Second Amendment comes along, that's to the benefit of the developer. And then a Third Amendment comes along and it's to the benefit of the developer.'",
        "'speaker_3': 'I just tend to not lend money to that developer anymore, so I am not going to vote for it for that purpose.'",
        "'speaker_1': 'Thank you, Councilwoman Fox. Councilman Lopez.'",
        "'speaker_0': 'Thank you, Mr. President. Just to follow up on those comments, you know, this is a very, very critical loan. As you know, we've been working to make sure that the folks who are on a proper and couple of properties that have fallen way before, way below the standard of living, have been on, you know, kind of teetering'",
        "'speaker_0': 'on on condemnation and not and we have the opportunity now, this is the only opportunity we have to make sure that the folks who are on these properties are well situated into more affordable housing, quality housing. They're relocated.'",
        "'speaker_0': 'There was a purposeful intent, full trigger of the of the HUD Relocation Act. We wanted to make sure that folks have access to that. We don't want folks to simply have to leave for the sake of improving the housing and then have nothing for it.'",
        "'speaker_0': 'You know, we have out of all the folks we have brought to this property issues for us, the issue of this property, even when it when it had its former owners, nobody came to the table except Saint Charles Town Company, our Saint Charles holding company for this particular purpose.'",
        "'speaker_0': 'They're at the table. They've been at the table. They've been working with community, have working with attendants to make sure that there's not only quality, decent, sanitary, affordable housing on this site that's modern, but also that the folks have benefits and relocation benefits.'",
        "'speaker_0': 'Every thing is taking care of in order to do that. And I can go on and on on. What an amazing project this is. It would not happen without the developer that you mentioned here and the community and the city.'",
        "'speaker_0': 'So, you know, we are one step closer. This bill gets us there. And I I'm going to end with that. I hope my colleagues support me on this one. I'm voting yes on it.'",
        "'speaker_1': 'Thank you, Councilman Lopez. Any comments? 376 Councilman David.'",
        "'speaker_0': 'Thank you, mister. Madam President. Mostly I'm just stalling since we seem to be missing a bunch of our colleagues. But I think we're good. I think we're good. Okay.'",
        "'speaker_10': 'Let's go. That concludes my comments.'",
        "'speaker_1': 'Good. Thank you, Councilman Nevett and the comments. 376 CNN Madam Secretary, roll call.'",
        "'speaker_4': 'Fats. No carnage. Layman Lopez, Monteiro, Nevitt. Hi, Ortega. Hi, Rob Brooks. Hi, Brown.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'Mr. President.'",
        "'speaker_1': 'All right. Madam Secretary, please close the voting. Announce the results.'",
        "'speaker_4': 'Ten eyes. One.'",
        "'speaker_1': 'Ten eyes. One day. 376 have been ordered published. All right. A little bit faster. Next one up 377. Councilman Lopez, what would you like for us to do with this?'",
        "'speaker_0': 'I wanted to. Well, Mr. President, I want to make some amendment necessary amendments to this bill.'"
    ],
    "Approves a contract with Savio House in the amount of $1.4 million through 5-31-16 to provide culturally competent strength-based resources and support services children and families involved with the child welfare system (SOCSV-2015-22477).": [
        "'speaker_1': 'Got it. All right, well, let's first put on. Let's publish it. Councilman Ortega, will you please put 377 to be ordered published?'",
        "'speaker_9': 'I move that council. Both 377 be ordered. Published.'",
        "'speaker_1': 'It has been moved and seconded. Councilman Lopez, we need a motion to amend.'",
        "'speaker_0': 'Thank you, Mr. President. I move to amend Council Bill 377 series of 2015 as follows Don't my my assistant here. Number one on page one line seven strike out quote unquote out of home placement services and replace with core services for families involved in the child welfare system.'",
        "'speaker_0': 'Two on page one, line eight, strike, quote unquote, for children. The purpose of this amendment is to change the title, provide more specificity concerning the child welfare program, funding for the contract. There are no other changes to this bill to be made aside from the title.'",
        "'speaker_1': 'All right. You can get the comments. Thank you. So we have the motion on to amend any other comments on those amendments. Scene none. Madam Secretary. Roll call.'",
        "'speaker_4': 'Lopez. Montero. Nevitt. Hi, Ortega. Rob Shepherd, Brooks Brown, I. I can each layman. Hi, Mr. President.'",
        "'speaker_1': 'Hi. Madam Secretary, please close if I announce the results.'",
        "'speaker_4': '12 eyes.'",
        "'speaker_1': '12 eyes. 377 has been amended. Councilman Ortega, we need a motion to order published as Amendment four 377.'",
        "'speaker_9': 'I move that council bill 377 be ordered, published as amended.'",
        "'speaker_1': 'And wait for technology. It has been moved and seconded. Thank you. See? No comment. Assuming you have no more comments, Councilman Lopez. Okay. Thank you, Madam Secretary. Roll call.'",
        "'speaker_4': 'Lopez. Montero. Nevitt. Hi, Ortega. Rob Shepherd. I'm Brooks Brown. I what? I can each layman. Hi, Mr. President. Hi.'",
        "'speaker_1': 'Kathleen Brown. Thank you, Madam Secretary, please close the voting and as the results.'",
        "'speaker_4': '1212.'",
        "'speaker_1': 'By 377 has been ordered published as amendment. All right. Our last one, I believe, Madam Secretary, is 378. Councilman Lopez, what would you like for us to do with this?'",
        "'speaker_0': 'Mr. President, I move to amend this bill.'",
        "'speaker_1': 'All right. Councilman Ortega, could you please have 378 ordered published.'",
        "'speaker_9': 'A move accountability. 378 be ordered.'",
        "'speaker_1': 'Published. It has been moved and seconded. Councilman Lopez, we need a motion to amend.'"
    ],
    "Approves a contract with Signal Behavioral Health Network in the amount of $725,000 through 5-31-16 to provide substance abuse services to families involved with the child welfare system (SOCSV-2015-22476).": [
        "'speaker_0': 'Thank you, Mr. President. I move to amend Council Bill 15. I'm accountable for to Council Bill 378 series of 2015 as follows on page one, line eight. Strike, quote, unquote, out of home placement services for children and replace with, quote unquote, core services for families involved in the child welfare system.'",
        "'speaker_0': 'All right.'",
        "'speaker_1': 'It has been moved and seconded. Comments. Councilman Lopez, you want to give a quick description of the reason for this?'",
        "'speaker_0': 'Just briefly, this is the contract with Cigna and called Signal Behavioral Health Network. The purpose of amending this bill is the change of title to provide more specificity concerning the child welfare program for the contract. The funding for the contract.'",
        "'speaker_0': 'Anyway, there are no other changes to the bill aside from the title.'",
        "'speaker_1': 'Thank you. See no other comments on those amendments. Madam Secretary. Roll Call.'",
        "'speaker_4': 'Lopez Montero. Nevitt Ortega. Hi, Rob Shepherd. Brooks Brown. I forgot I finished. Lehman. Mr. President. All right.'",
        "'speaker_1': 'Madam Secretary, please cast the voting and now the results. 1212 ICE 378 has been amended. Councilwoman Ortega, we need a motion to order. 378 Published as amended, I.'",
        "'speaker_9': 'Move the council bill 378 be ordered published as amended.'",
        "'speaker_1': 'Thank you. Or wait for technology to catch up. It has been.'",
        "'speaker_10': 'Moved.'",
        "'speaker_1': 'And seconded, seeing no comment. Madam Secretary.'",
        "'speaker_4': 'Roca Lopez. Montero. Nevitt Ortega. Rob Shepherd. Brooks Brown. I.'",
        "'speaker_3': 'But I can each layman.'",
        "'speaker_4': 'Hi, Mr. President. Hi.'",
        "'speaker_1': 'Councilman Brooks needs your vote. Donald Trump. Thank you, Madam Secretary, please, first of all to announce the results for vice to advise 378 has been published as amended. Well, that was all the bills that were called out. All of the bills for introduction of order published.'",
        "'speaker_1': 'And we are ready for the block votes. Councilman Ortega, would you please put the resolutions on the floor for adoption and a block.'",
        "'speaker_9': 'And move that resolution number three, 72 and 387 be placed be ordered published as amended.'",
        "'speaker_1': 'And adopted.'",
        "'speaker_9': 'Adopted.'",
        "'speaker_1': 'I'm sorry. You got it. It's moved and seconded. Seen no comments. Madam Secretary, roll call.'",
        "'speaker_4': 'Can each layman. Lopez, Montero. Nevitt Ortega. Rob Shepherd. Brooks Brown. Fats. Hi, Mr. President.'"
    ]
}