{
    "A proclamation recognizing Saturday, August 16, 2014 as Chefs Appreciation Day.\n A proclamation recognizing Saturday, August 16, 2014 as Chefs Appreciation Day.\n": [
        "'speaker_5': 'Thank you, Councilman Robb. All right. Moving on to presentations, Madam Secretary, do we have any presentations?'",
        "'speaker_1': 'Mr. President, Communications Manager.'",
        "'speaker_5': 'Secretary, do we have any communications?'",
        "'speaker_1': 'None.'",
        "'speaker_5': 'President We have two proclamations this evening, and we're going to start first with Proclamation 648. Councilman Lopez, will you please recount a proclamation? 648.'",
        "'speaker_3': 'Thank you, Mr. President. With pleasure. Proclamation 648 Series 2014 Recognizing Saturday, August 16th, 2014 as Chefs Appreciation Appreciation Day. Whereas the National Pink Tire Organization and PTO, a51 C3 nonprofit and their Chefs Against Cancer Division, were created to band men together in the fight against all types of cancer.'",
        "'speaker_3': 'And men nationwide wear pink or fuchsia ties to raise awareness, educate and empower the community about cancer. And. Whereas, the end PTO chefs and the NPT OHS Chefs Against Cancer Cancer Division includes more than 400,000 chefs and is growing in numbers worldwide.'",
        "'speaker_3': 'The chefs volunteer their time to stand beside fellow chefs and their family members to provide support and encouragement. And. Whereas, every third Saturday in August, chefs, physicians, nutritionists and fitness trainers will gather to promote healthy living and cooking, uplift one another, and give back to those who have already helped so many others experience how wonderful, happy, healthy'",
        "'speaker_3': 'life can taste. Whereas on August 16th, 2014, the Master Chefs Care Program will launch and chefs will share a new recipe, new recipes and cutting edge culinary techniques to help others share, and kitchen commander camaraderie to help promote healthy living and cooking.'",
        "'speaker_3': 'And. Whereas, and chefs are committed to their colleagues and others to the mission of supporting individuals undergoing treatment for cancer now therefore being proclaimed by the Council, the city and County of Denver. Section one at the City Council supports the National Pink Tiger Organization and supports its efforts in the Fight Against Cancer, Section two that the Denver'",
        "'speaker_3': 'City Council proclaims. Saturday, August 16, 2014. As Chefs Appreciation Day and encourages all men to wear pink or fuchsia ties on that day to support show support for all people in their fight against cancer. Section three at the clinic, the city and county of Denver shall attest and affixed the seed seal of the city and county of'",
        "'speaker_3': 'Denver to this proclamation, and that a copy be transmitted to Donald Crush, founder of the National Pink Tie Organization.'",
        "'speaker_5': 'Thank you, Councilman Lopez. Your motion to adopt.'",
        "'speaker_3': 'Mr. President, I move that council proclamation 648 series of 2014 be adopted.'",
        "'speaker_5': 'It has been moved in. Second comments from members of council. Councilman Lopez.'",
        "'speaker_3': 'Thank you, Mr. President. And unfortunately, because there are a lot of chefs that are probably cooking right now, we couldn't get any with us today. But they express not only their gratitude for acknowledging their efforts, but their regrets and not being able to come.'",
        "'speaker_3': 'All this talk about chefs has got me hungry, and as you can tell, I probably know more fitness. I probably know more chefs than fitness trainers. But this this proclamation really hits home for me because there's so many people who are being treated for cancer.'",
        "'speaker_3': 'Now, I could say that happily in October, God willing, it'll be five years since my first treatment for for cancer. And I'm cancer free so fast all the way to October. So I got to wait till October to be able to say that all the way.'",
        "'speaker_3': 'But I know there's a lot of people, especially especially us men, that don't like to talk about cancer, especially certain types of cancer. And we sometimes become a little bit too macho to to check or to acknowledge it or to look out for each other.'",
        "'speaker_3': 'It's not to say that cancer isn't as in an issue for women, as opposed to this is something that affects everybody. I think the the statistic was one in four people. Right. One point in their life. I think that's that's what they had told me.'",
        "'speaker_3': 'But this organization is doing a great job. And so I just wanted to acknowledge the folks with this organization, National Pink, entire organization, and to make sure that as men are wearing a pink or fuchsia tie on Saturday, August 16th, which is a very important day as well too, from for me.'",
        "'speaker_3': 'And I'll be wearing this pink tie again, because that was the day that my grandfather, who was diagnosed with liver cancer, had left this world on August 16. So it is a very, very important proclamation, a very important day for me.'",
        "'speaker_3': 'And I just wanted to share that being that we won't have anybody to receive the proclamation. I just want to make sure, Mr. President, that this was read in the. Council chambers and that we are supportive and encourage folks to support this proclamation and we will transmit this to the national entire organization as soon as possible.'",
        "'speaker_5': 'Thank you, Councilman Lopez. Any other comments from members of council? Scene nine Madam Secretary, roll call.'",
        "'speaker_1': 'Lopez Hi, Montero. Nevitt Hi. Ortega I'm Rob Shepherd Brown. Brooks.'",
        "'speaker_3': 'I.'",
        "'speaker_6': 'Fights.'",
        "'speaker_1': 'I can eat. Lemon. Hi, Monteiro.'",
        "'speaker_6': 'I.'",
        "'speaker_1': 'Mr. President, I.'"
    ],
    "A proclamation in recognition of Detective Richard Schneider, DPD Badge 85024, upon the occasion of his retirement.\n A proclamation in recognition of Detective Rick Schneider on the occasion of his retirement.": [
        "'speaker_5': 'Madam Secretary, please close the voting and now the results. 11 eyes 11 I proclamation 648 has been adopted. And you said, Councilman Lopez, you did not have anyone to accept the podium today.'",
        "'speaker_3': 'As president.'",
        "'speaker_5': 'All right. We will move on to our second proclamation, proclamation 649. Councilwoman Monteiro, will you please read? Oh six 2649 Correct. Corrected.'",
        "'speaker_6': 'Thank you, Mr. President. Proclamation 649 is being read tonight in recognition of Detective Richard Snyder. Deputy Badge 85024. Upon the occasion of his retirement. And it reads as follows. Whereas Richard Snyder was hired by the Denver Police Department as a patrol officer on August 1st, 1985.'",
        "'speaker_6': 'And. Whereas, Ric was promoted to the rank of detective on October 16th, 1992 and earned his tenure Gold Detective Badge on October 9th, 2002, while serving in a variety of assignments to include the Vice and Drug Control Bureau and the Crimes Against Persons Bureau as a domestic as a domestic violence and homicide detective.'",
        "'speaker_6': 'And. WHEREAS, Detective Snyder began to specialize in the management of sex offenders in 2001 while assigned to the Sex Crimes Unit, and in 2005 was one of the founding members of the Sex Offender Registration and Compliance Unit, an assignment he served until his retirement.'",
        "'speaker_6': 'And. WHEREAS, Detective Snyder's expertize in the field of sex offender management is widely recognized by the Denver the Denver Police Department and his partner agencies. And. WHEREAS, Detective Snyder's contributions to the management of sex offenders include holding the first community notification meeting regarding the release of a sexually violent predator on February 26, 2014.'",
        "'speaker_6': 'His appointment to the sex manage his his appointment to the Sex Offender Management Board Community Notification Technical Assistance Team in August 2005, the procurement of a grant from the Adam Walsh Foundation in 2007 that allowed for tracking and monitoring of transient sex offenders and his appointment to the Governor's Task Force on Sex Offender Registration, which resulted in'",
        "'speaker_6': 'legislation establishing self verification of offenders who lack a fixed address. And. Whereas, on August 15th, 2014, Detective Snyder will retire as a Denver police officer, fulfilling 29 years of dedicated service to the city and county of Denver. Now, therefore, be it proclaimed by the Council of the City and County of Denver, Section one, that the Denver City'",
        "'speaker_6': 'Council recognizes Rick Schneider's contributions to keep Denver's communities safe, and for his personal and professional dedication to his work and to Denver's residents over the years. And the city and county wishes him well in his retirement. Section two that the clerk of the city and county of Denver shall attest, and to fix the seal of the city'",
        "'speaker_6': 'and county of Denver to this proclamation and that a copy be transmitted to Detective Richard Snyder and his family.'",
        "'speaker_5': 'Thank you, Councilwoman Monteiro. Your motion to adopt.'",
        "'speaker_6': 'Thank you, Mr. President. I move that proclamation. 623 be adopted.'",
        "'speaker_5': 'It's been moved and seconded. Comments from members of the Council. Councilwoman Montero.'",
        "'speaker_6': 'Thank you, Mr. President. I'm so glad to be able to sponsor, along with our other co-sponsors, this proclamation recognizing Detective Rick Snyder and I welcome you and your family here tonight to our chambers. You've done so much work quietly in the background for our community to keep us safe.'",
        "'speaker_6': 'And you and I have worked so much in the neighborhoods that I represent in Council District nine, and I believe you are a constituent of Council District Line. I just wanted to put that in there, but I just want to, with all my heart, let you know that your commitment to the difficult criminal and social issues that'",
        "'speaker_6': 'we've dealt with in District nine have never been ignored or unappreciated. And working with you, I've just learned what a challenging job you had and some of the work that you've done, especially the work that you're doing up until now.'",
        "'speaker_6': 'But the other thing is, I've always wondered how. Individuals are able to sort of balance out when they have very difficult and stressful lives. And for Detective Snyder, it was his partnership with Dr. Jack Moss from Pacific Dental Services.'",
        "'speaker_6': 'And what they've been able to do in the last year is to provide free dental services and have a mobile outreach team that's come in to my district and I understand other districts in the city as well. We've been able to elegantly work on this on this project together, and by that I mean we're all the tables'",
        "'speaker_6': ', they're the chairs. There are the tents there with the too hot, with their water, with their Band-Aids, you know, all of those little things that can impact a person's strength already around, wanting to go see a dentist and being able to help it be as stress free as possible.'",
        "'speaker_6': 'To date, with the two dental clinics, there was one on Saturday, August 9th, but to date, 180 people in areas once a year have received dental care. And I very much appreciate that many were children that are going to be ready to go to school.'",
        "'speaker_6': 'And good dental caries and hygiene is so important because of all of the other indirect things that dental care, poor dental care can have, but poor dental hygiene. So that was your secret to the always being happy and always being upbeat.'",
        "'speaker_6': 'It was always giving back to the community. So with that, I they take a lot of value and understanding. That's how you balance this with something positive. So I would like to I would like to extend you the best the best retirement that that you deserve.'",
        "'speaker_6': 'I was kidding. And I told him the other day and just now that I was going to rescind his retirement, and he said, nope, nope, nope. So I would ask that my colleagues please join me in supporting and supporting my constituent and my friend, Detective Snyder, this proclamation.'",
        "'speaker_5': 'Thank you, Councilwoman Monteiro. Councilman Brooks.'",
        "'speaker_2': 'Thank you, Mr. President. First, I want to thank Councilwoman Monteiro for recognizing Detective Snyder. You know, I've been thinking a lot about some of the unsung heroes in our city. And this is so great that this detective gets a chance to, after all the years of service in this city, gets a chance to be honored in this'",
        "'speaker_2': 'way. I feel it's it's really amazing. I want to point out, I was six years old when you became a detective in the city. And and I was I was in Los Angeles. And I just think it's beautiful that you are making this city the best city in America while I was growing up.'",
        "'speaker_2': 'And I just want to thank you for your investment into this city. And, yeah, it's just it's it's a beautiful tribute. And I can see that you're moved and it's just it's just really sweet. And I just think the family as well for allowing all these years of service and the things that you had to endure.'",
        "'speaker_2': 'I appreciate it. And I hope today is just a little bit of of joy that can bring to the satisfaction of this life. Thank you.'",
        "'speaker_5': 'Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_8': 'Thank you, Mr. President. I'm honored to be a co-sponsor of this proclamation. Councilwoman Montero, thank you for bringing bringing it forward. I've known Detective Schneider for I can't even remember how many years. A very long time. I had the pleasure, pleasure and opportunity working with him over the years.'",
        "'speaker_8': 'And clearly, he is an example of the many police officers, men and women that are part of our police force, who are so dedicated and committed to this city. And I just want to thank you for your 29 years of service.'",
        "'speaker_8': 'I want to thank your family for having lent him to all of us and shared him with us for the last 29 years. I wish you the best of luck in your retirement and Godspeed.'",
        "'speaker_5': 'Ortega Councilwoman Robb.'",
        "'speaker_7': 'Thank you, Mr. President. Well, I'm not going to say how old I was when you began in this city, but I will say that I looked at that and I said, 1985. That's not that long ago. He hasn't been here that long.'",
        "'speaker_7': 'And then I started doing my math. I actually got to know Detective Snyder, working on an intense case in my district concerning a sex offender. And I tell you, his depth of knowledge, his understanding of the state legislation, of the regional nature of this of the committee meetings, this JCC.'",
        "'speaker_7': 'I could. Keep all of that straight. And then his ability and willingness to come out and talk to the neighborhood and to talk to the offender on quite a regular basis and to keep following up with me. As my colleagues have said in the previous comments, it really was exemplary city service and what you would expect out'",
        "'speaker_7': 'of the best in detectives. So I am sorry to see you go, but I hope you enjoy your retirement.'",
        "'speaker_5': 'Thank you, Councilwoman Robb. We have many other comments from members of council. I would just like to add this as well. We wish you the very best. And you know our public servants. I'll use a football analogy since we're getting ready, a football season, you know, typically Denver police and other entities, they're very similar to offensive linemen'",
        "'speaker_5': 'and not because of your size. That's not what I'm talking about. But when you when you we only hear about offensive linemen when there's a holding penalty or there's a false start. But when Peyton Manning drives 70 yards down the field for a touchdown, credit goes to the quarterback, the running back, and we never hear about those'",
        "'speaker_5': 'in the trenches doing the hard work each and every play. And I'm very thankful that Councilwoman Monteiro brought this forward that we know from the great work that you did. She spoke about the dental clinic that helped in the her district.'",
        "'speaker_5': 'It also came to Marbella as well, where we had, I believe it was over 40 people got dental services. And I want to thank you for being a part of that, making that a reality as well, because that that was, well, a great the community the community really appreciated that.'",
        "'speaker_5': 'So thank you and best of luck. So seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_1': 'Monteiro I never I Ortega Rob Shepherd, Brooks Brown, I but.'",
        "'speaker_6': 'I.'",
        "'speaker_1': 'Can eat. Lehman Hi.'",
        "'speaker_3': 'Lopez Hi.'",
        "'speaker_1': 'Mr. President. Hi.'",
        "'speaker_5': 'Councilwoman. Moran. Oh.'",
        "'speaker_7': 'There you go.'",
        "'speaker_5': 'Madam Secretary, please close the voting and mouth the results.'",
        "'speaker_1': '12 Eyes.'",
        "'speaker_5': '12 Eyes Proclamation. 649 has been adopted. Councilwoman Monteiro, is there anyone you want to call to the podium?'",
        "'speaker_6': 'Yes. Thank you, Mr. President. I would like to call up Commander Sonnier here. I could barely see you. There you are. And also and also our honoree this evening, Detective Rick Schneider. What would you like to go first?'",
        "'speaker_5': 'I think you kind of covered it.'",
        "'speaker_3': 'I've known Rick. Come on up. You're not going to get too hard. That is, you're never shot anyway. So, so, so congratulations. I just echo what you said. Rick has done a phenomenal job for us. His knowledge of the sex offender population out there, the sex offender management board.'",
        "'speaker_3': 'I first got to know Rick when I was a lieutenant in Patton Crimes and had sex offender management back when we only had about 1200 in the year or 1200 in the city. We're up over 2000. What's the last number?'",
        "'speaker_3': '2194. Yeah, so we're almost 2200. So within that short amount of time, we've gone. But he is the legislative expert. He has done a lot of testifying at the state capitol, getting ordinances passed to help us manage our board.'",
        "'speaker_3': 'And the whole unit really has done a phenomenal job. And, you know, kudos goes out to the whole unit. But congratulations, Rick. I appreciate it. Thank you. Mr. President. Council members. Thank you. When Councilwoman Montero called the other day and said, we're going to do this, I was a little taken aback and obviously still Im almost at'",
        "'speaker_3': 'a loss for words that night, but I said almost. Those of you who know me know that's not going to happen, but that I really do appreciate everything that everybody said tonight. The kudos, accolades, prizes, gifts. I know now, right now how Kim Kardashian feels every day.'",
        "'speaker_7': 'That.'",
        "'speaker_3': 'I didn't do anything any different than the other 1300 men and women across the street who work hard every day. But it's truly been an honor to do this for the last 30 years, and I appreciate it.'",
        "'speaker_6': 'Would you like to introduce your family to really be in trouble? You'll be one with that.'",
        "'speaker_3': 'Yeah. You saved my life right here. And my son in law, Nick or Cory, my daughter Lindsey, my wife Carol, Dr. Jack Moss, that we spoke about the dental thing and his wife Theresa. And you guys know Lieutenant Davis and I really am taken aback by this.'",
        "'speaker_3': 'And I truly appreciate it's been an honor to work with you all. Thank you.'"
    ],
    "A bill for an ordinance creating and establishing the Santa Fe Business Improvement District, appointing the initial members of the Board of Directors of the District, and approving the Initial Operating Plan and 2015 budget therefor.  (BUSINESS DEVELOPMENT COMMITTEE) Creates and establishes the Santa Fe Business Improvement District, appoints the initial members of the Board of Directors of the District, and approves the initial Operating Plan and preliminary 2015 budget. The Committee approved filing this bill at its meeting on  8-5-14.": [
        "'speaker_5': 'Six, 13 and 614. Are there any other bills call out. Do you get those through, Madam Secretary? Yes. All right. We will tee up the first one, which is Council Bill 613. Councilwoman Sheppard, what would you like to do with this question?'",
        "'speaker_1': 'I don't know if anyone can answer this, but so I, I and forgive me if I don't understand the differences between a a local maintenance district and a business improvement district. But I thought that the Business Improvement District was more about promoting the business side of things and maybe some programmatic activities around that.'",
        "'speaker_1': 'And that local maintenance districts actually took care of maintenance of any Lake Street facilities, for example, that a district might create. So is this to say that the Business Improvement District will now assume those responsibilities or that things are no longer going to be maintained?'",
        "'speaker_1': 'I'm just not clear what that means.'",
        "'speaker_0': 'You know.'",
        "'speaker_3': 'Let's help them out. Good evening. My name's Andrew Johnson with the Department of Finance and Special Districts. Those are great questions that in essence, it's the concept really is, is that the local maintenance districts were put into place several years ago and they are to do just the maintenance of the street improvements.'",
        "'speaker_3': 'However, the community has come together in another way to want to make something better of the area. And so the businesses are getting together to create a business improvement district that is a little bit larger than both that.'",
        "'speaker_3': 'But there's two local maintenance districts there currently Santa Fe, A and B, and those responsibilities or those maintenance districts will be assumed by the Petitioning Business Improvement District to be created.'",
        "'speaker_1': 'So the bid will take over the maintenance.'",
        "'speaker_3': 'That is that.'",
        "'speaker_1': 'I guess I just didn't quite understand that they could also do that because it's typically there's a a business improvement district and there's often maintenance districts underneath that.'",
        "'speaker_3': 'There can be. And in this case, we are letting the. The business improvement district does one to assume the responsibility for the maintenance district.'",
        "'speaker_1': 'Thanks for that clarification.'",
        "'speaker_5': 'Thank you, Mr. Johnson. Captain. Was that the same question for both of you? Okay, wonderful. Any other builds called out by members of council? Well, then, seeing that we're moving on to the block bills, all of the bills for introduction are ordered published.'"
    ],
    "A bill for an ordinance extending the existing .12 percent sales and use tax (the Denver Preschool Tax) through December 31, 2026 and increasing the rate to .15 percent, dedicating the revenue derived from the tax to fund the Denver Preschool Program, subject to the approval of the voters at a special municipal election to be conducted in coordination with the state general election on November 4, 2014; and making certain changes to the Denver Preschool Program.  \n (GOVERNMENT & FINANCE) Asks voters to reauthorize the Denver Preschool Program for 10 years, increase the sales and use tax supporting the program by .03 percent, and approve specified programmatic changes.   The last reguarly scheduled Council meeting within the 30-day review period is on 8-25-14.  The Committee approved filing this bill by consent on 7-17-14.": [
        "'speaker_5': 'If you are here to answer questions only when your name is called, come to the podium, state your name, and then note that you are available for questions of council. Each speaker will have 3 minutes. There will be no yielding of time on the presentation monitor on the wall.'",
        "'speaker_5': 'When the other light comes on, you will have 30 seconds to conclude your remarks. And when the red light appears, your time is up. Speakers must stay on topic of the hearing and must direct their comments to council members.'",
        "'speaker_5': 'Speakers are prohibited from using profanity or making personal attacks during their comments. Audience members Please understand that council members do use electronic devices of various kinds to access the materials relevant to the public hearings before us. Be assured, however, that by mutual agreement in common practice of the City Council, these devices are not being used for texting'",
        "'speaker_5': ', emailing or other communications during the public hearings. Councilman, that it will you please put council bill 574 on the floor?'",
        "'speaker_3': 'Certainly, Mr. President, I move that council bill 574 be placed on final consideration and do pass.'",
        "'speaker_5': 'It has been moved and seconded. The public hearing for Councilor Bill 574 is open. May we have the staff report? Council Member.'",
        "'speaker_2': 'Thank you, Mr. President. Council Bill 574 is a ballot language and also ordinance language that changes some of the configuration of the program. The ballot language is an expansion and reauthorization of the Denver Preschool Program. The increase dedicated sales tax.'",
        "'speaker_2': 'The proposed increase dedicated sales tax will go from point one 12% to 0.15% for three reasons one to to reinstate and sustain summer programing for the Denver preschool program to keep up with rising preschool and tuition costs for the program.'",
        "'speaker_2': 'And three, to respond to the growing demand of full and extended day programing in the city of Denver. There are also be three proposed ordinance changes for the program. One is going to be a collapse of the board of Directors and the Board of Advisors to a single mayor appointed governing board with one seat selected for City'",
        "'speaker_2': 'Council as it is now. We will also have an increase of administrative cap from 5% to 7%, which is in line with most Colorado nonprofit association and also allow for the program to serve younger children as revenues allow.'",
        "'speaker_2': 'Some of the highlights of the Denver preschool program since originally passed in 2006 are as follows DPP has delivered over 55 million intuition credits to Denver families, over 9 million just this year alone. Nearly 32,000 children have participated in the Denver Preschool Program.'",
        "'speaker_2': 'Actually, the correct number here is the accurate numbers 31,816, which you've heard me say over and over again. DBP has invested over $8 million in quality improvement. 1.3 million just this year. And I like to share some of the results from the kindergarten readiness, which is one of the biggest reasons to reauthorize this program.'",
        "'speaker_2': '89% of Denver preschool kids are receptive and vocabulary tests and receptive vocabulary. 98% are testing in literacy. And 99% in math. These and several other reasons which you'll hear from the individuals who will come and testify are reasons that we need to reauthorize and expand this program.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you. Council members, we have nine individuals signed up to speak this evening. I'm going to call the first five speakers if you can. Please make your way to the bench here at the front. That will help speed up the proceedings.'",
        "'speaker_5': 'And our first five speakers are that Tex Gloria Higgins, Joe Maria Garcia, Amber Monk and Cheryl Caldwell. So if you five could please come up and Mr. Tex said, when you are ready, you can go ahead and proceed.'",
        "'speaker_3': 'And convince the president that Texas. 4535 Julian Street, Denver, Colorado. Hubert Humphrey, who I may be the only one here, are old enough to remember once stated The moral test of government is how that government treats those who are in the dawn of life.'",
        "'speaker_3': 'The children those are in who are in the twilight of life, the elderly, and those who are in the shadows of life, the sick and needy and the handicapped. Tonight, you move to meet the needs of one of those groups, and I applaud that.'",
        "'speaker_3': 'But it is very unfortunate that you are nearly is not nearly as vigorous in meeting the needs of another the homeless who are equally deserving but are nearly as politically but are not nearly as politically advantaged, advantageous to support.'",
        "'speaker_3': 'I apologize for my delivery and hope that in the future you will be as vigorous in your support of the homeless as you are of the children of the city.'",
        "'speaker_5': 'Thank you, Mr. Texar. Gloria Higgins.'",
        "'speaker_6': 'My name is Gloria Higgins, 1931 South senior, Denver, Colorado. I'm president of an organization called Executives Partnering to Invest in Children. And also a board member for the Denver Preschool Program. And as a representative of the children and the board and all of the individuals here to support us, I'd like to ask all the individuals to stand'",
        "'speaker_6': 'up that support the Denver preschool program. And then I'd like to thank the City Council for considering our request for reauthorization on this year's ballot. The as is Councilman Brooks said the ballot initiative is to reauthorize the Denver Preschool Program and expand the program since 19 or since.'",
        "'speaker_6': 'Oh, my goodness. Since 2007, when the program first began, we have had a lot of families and a lot of children that have been served by this program. And Councilman Brooks has given you the numbers. I think what I would like to say, as one of the founding board members and the founding board chair is to say'",
        "'speaker_6': 'we had three responsibilities. One was that we not supplant already existing dollars that were there to serve the children, the four year olds. The other was to create an evaluation program so that as reauthorization comes up, we know that we're serving the kids in the right way, and there are results that are being proven.'",
        "'speaker_6': 'And then the third is to make sure that the quality of the Denver preschool, the programs that are supporting and serving the Denver preschool program, are increasing in quality so that the quality of the education that the kids get has improved by the use of these dollars.'",
        "'speaker_6': 'And I feel very comfortable in saying that that has, in fact, occurred. I think the next part that is most important is the fact that the tax will be the tax that we're requesting is $0.15 per $100 of spending.'",
        "'speaker_6': 'That's a 33 cent increase. We acknowledge that that may is not always an important factor to increase the tax, but the kids that are being served and the families that are being served will be much broader if we have this increase tax.'",
        "'speaker_6': 'So we're asking the Denver voters to support our works because we know it works because it prepares young children for kindergarten, because it helps parents in the community work through the expansion of the summer program and the extended day, and because it supports the community to graduate a better prepared workforce through its commitment to early learning.'",
        "'speaker_6': 'Thank you very much.'",
        "'speaker_5': 'Thank you, Michigan. Joe Marie Garcia.'",
        "'speaker_0': 'My name is Jerry Garcia. I live in 1180 Yosemite Street. I am a single mother.'",
        "'speaker_1': 'Of a six year old daughter who three years ago was enrolled with the Denver Preschool.'",
        "'speaker_0': 'Program as a single mother. This program really helped me greatly. As you know, Denver preschool tuition is at $800 a month. That is something on my income alone I could not afford. The program has not only helped me through tuition, but also to being a who's my daughter.'",
        "'speaker_0': 'Being a single child, it taught her how to share, how to meet new friends. Among other things, as far as shapes, colors, patterns, little things like that, minimal that I wasn't able to teach her in the time I was at home with her.'",
        "'speaker_0': 'She actually went into kindergarten and she started to learn how to sound outwards. She will actually she went into preschool, learning how to sound out words. She went into kindergarten already reading because of the.'",
        "'speaker_1': 'Denver preschool program. Let's see. Sorry. My daughter Tasia now more than.'",
        "'speaker_0': 'Knew more than most kids going into kindergarten. She was helping out the teachers greatly in like helping, you know, help the kids understand some of the things she already knew.'",
        "'speaker_1': 'Every time I'd pick her up from school, I.'",
        "'speaker_0': 'Got so many compliments on how great she was in class. And I have the Denver Preschool Program to thank for that. And that's why I'm here. And I believe it's a great program, and I hope that other parents get the opportunity to have the same the same opportunity me and my daughter did.'",
        "'speaker_1': 'My daughter is now.'",
        "'speaker_0': 'Headed to first grade, and I am confident that she will do extremely well going forward in school. She has great confidence and is excited more than ever about.'",
        "'speaker_1': 'School that I.'",
        "'speaker_0': 'Never thought she'd be this way. And I have that to thank the Denver Preschool Program. Thank you.'",
        "'speaker_5': 'Thank you, Ms.. Garcia. Amber Monk.'",
        "'speaker_1': 'Good evening. My name is Amber Munk.'",
        "'speaker_6': 'I live in northwest Denver. I am here as.'",
        "'speaker_1': 'A mother and as a conscientious.'",
        "'speaker_6': 'Member of the community. I am one of thousands of women and men who call ourselves heroine mommies. And I'm one of hundreds of families in Sunni northwest Denver community. And I can tell you as a member of both that the education of our youth is the single most important issue.'",
        "'speaker_6': 'It comes up day in, day out, on the forums, at meetings, and at every gathering that we have. It is absolutely critical from our.'",
        "'speaker_1': 'Viewpoint as parents.'",
        "'speaker_6': 'As community members, as property owners, as consumers to keep pushing this project forward. Right now, Denver is, in fact, leading the nation in its education of youth. And I would ask and beg that we continue to do that.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_5': 'Thank you, Miss Monk. Cheryl Caldwell. And as Cheryl comes up, I want to call the next four speakers who are Paul Asper, Pamela Harris, Stephanie Romero and Mike Yankovic. You all can come up to the podium and Ms..'",
        "'speaker_5': 'Caldwell, you can begin whenever you're ready.'",
        "'speaker_1': 'Good evening, council members. I'm Cheryl Caldwell. I'm director for Early Education for Denver Schools. I live at 2707 South Newark Court. I thank you for the opportunity to speak tonight in support of the Denver Preschool Program. This program has been valuable to Denver public schools in a number of ways.'",
        "'speaker_1': 'When it was first passed, it allowed us to greatly expand our offerings, especially to create more full day programs for students previously and half day classes for the 20 1415 school year. We will serve 3344 four year olds in full day and 1000 in half day.'",
        "'speaker_1': 'In addition, we serve 1382 three year olds, mostly in half day classes. And that's partly possible because we could use our our Colorado preschool program dollars to go to three year olds in great need of preschool because the dollars were freed up by Denver Preschool Program.'",
        "'speaker_1': 'We've been able to have our preschool classrooms for four year olds rated by DPI through Costar, and this helps us strengthen our message of developmentally appropriate practice for our youngest students. It also provides information for parents regarding the quality of our schools.'",
        "'speaker_1': 'The addition of the class instrument for assessing classroom interactions has been particularly helpful. The quality improvement dollars that have been provided have helped strengthen our professional development, planning and activities. As one example, all of the paraprofessionals in every preschool classroom were able to attend 15 hours of training throughout the year on a variety of topics at no'",
        "'speaker_1': 'cost to the district. All are supported by the quality improvement dollars that we have. These trade trainings were all very high quality and have increased the skills of these paraprofessionals. We see our relationship with DPI as a partnership to strengthen the quality of preschool programs.'",
        "'speaker_1': 'One of their main goals and to increase the availability of preschool to all families, but particularly to those in greatest need of their of these important educational services, which is our population mostly. Our agency visions are aligned in the desire to have any four year old whose parent want parents, want preschool for them to be able to'",
        "'speaker_1': 'attend a high quality program. Our school district benefits greatly by having all the all children who participate in this program enter kindergarten ready to succeed. Thank you for your time.'",
        "'speaker_5': 'Thank you, Ms.. Caldwell. Paul Asper.'",
        "'speaker_3': 'Good evening. I'm Paul Aspirate live at 515 Milwaukee Street and Denver. I had the privilege of sitting on the Denver Preschool Program Board of Advisors and I am also a proud citizen of this Denver community. I'm an even prouder father of a little two year old girl who will one day be in Denver preschools in my non'",
        "'speaker_3': 'daddy time. I'm a regional operations director at DaVita, where I run a $50 million piece of our business and employ 235 skilled health care providers, nurses, patient care technicians, social workers, dietitians, managers, and others, the vast majority of whom live in our greater Denver area.'",
        "'speaker_3': 'I stand before you today to advocate for the reauthorization and expansion of funding for the Denver Preschool Program. To be clear, I am not an advocate of blindly throwing dollars at our education system, but I am a huge advocate of smart investment.'",
        "'speaker_3': 'And as a member of the business community, as an employer, as a father, as a citizen of this wonderful, forward thinking Denver community. Investing in early childhood education and specifically investing in the Denver preschool program is about as smart of an investment as it gets.'",
        "'speaker_3': 'There's mounting evidence that for every dollar that a community invests in pre-K pre-K programs like the Denver Preschool Program, that communities like ours get back $2 or $4 or even $10 down the road. Kids with strong preschool options are more likely to be ready for kindergarten to not need costly remediation by the fourth grade.'",
        "'speaker_3': 'To avoid teen pregnancy, to stay out of jail, to graduate high school, to go to college, to have higher earning potential over their lifetime. And ultimately, they're more likely to be productive members of our Denver community for just three additional pennies out of every $100.'",
        "'speaker_3': 'And we can continue to ensure that all Denver kids have access to the same high quality preschool options that my daughter and Alyssa want to one day have access to. We can ensure long term savings to our communities, taxpayers for that tiny investment.'",
        "'speaker_3': 'We can ensure a more robust community for our economy, for our community, long term and selfishly, a better educated and more highly skilled workforce works to ensure that for people like me and for others and employers around our community, that we have a better educated and more highly skilled workforce.'",
        "'speaker_3': 'I'm a huge advocate of smart investment and for the long term prosperity of our citizens, citizens and our community. The Denver Preschool Program is about as smart as it gets. As a businessperson, as an employer, as a father, as a proud citizen of Denver.'",
        "'speaker_3': 'I implore this council and this community to get behind this smart investment and to allow voters the chance to reauthorize and expand funding for the Denver Preschool program. Thank you.'",
        "'speaker_5': 'Thank you, Mr. Asper. Pamela Harris.'",
        "'speaker_1': 'Good evening. I'm Pamela Harris. 1090 Cherokee. It's about four blocks that way. I'm the president and CEO at Mile High Montessori Early and learning centers. And for those of you who don't know my compatriot here, one of the things she is is president emeritus at Mile High Montessori.'",
        "'speaker_1': 'I also have the privilege of being the chief operating officer for the Denver Preschool Program when it first launched. So I can't tell you how excited and happy I am that we're here and ready to reauthorize. I'm here to talk a little bit about my program and the benefits that we have through being a member of Denver'",
        "'speaker_1': ', a preschool program. Mile High Montessori. We're the largest and oldest provider of subsidized child care in Denver. So the families that we're serving are low income families, their working families. And what deep tuition credit has enabled them to do is to attend quality preschool programs that their children can have the same benefit regardless of their economic background'",
        "'speaker_1': 'in order to be ready for school. We over the years in quality improvement, I still say we $8 million to providers, a little over 1 million this year for 268 providers. I still remember when we had five providers and just 68 kids.'",
        "'speaker_1': 'So the impact that this has had on the community as well as our families is immeasurable. We do, as I said, serve working families. So this tuition credit, the reauthorization would give our families an opportunity to have the extended day program.'",
        "'speaker_1': 'So that is meeting the needs. The summer program that we did have in the beginning and had to pull back at the time. So to reinstate that again would be a wonderful benefit for the families that were serving in the community.'",
        "'speaker_1': 'So thank you for your support. And here's to Denver Preschool Program.'",
        "'speaker_5': 'Thank you, Miss Harris. Stephanie Romero.'",
        "'speaker_0': 'Good evening, members. My name is Stephanie Romero and I've been teaching for eight years, one year in first grade and seven years in kindergarten. And I fully support the Denver preschool program because I can see a noticeable difference in the students that do not attend preschool.'",
        "'speaker_0': 'Students that have not attended preschool show up in the classroom being unfamiliar with school structure, any routines or rituals. In most cases, they struggle with holding tools, and they are usually the ones who try to escape the classroom with tears in their eyes.'",
        "'speaker_0': 'In my experience, I would say it takes anywhere from weeks to months to get these students to a place where they are comfortable with school. During that time, valuable instruction is being lost and their needs are sometimes taking attention away from other students.'",
        "'speaker_0': 'Most students who have not had the opportunity to attend preschool are lacking a number of prerequisite skills, such as book handling, being able to hold and manipulate writing tools, letter sound knowledge, being familiar with their printed name and writing it, limited numeracy knowledge.'",
        "'speaker_0': 'But most importantly, they lack the confidence that they need to become independent learners by the end of the year. A few of these students are not where they need to be, and it breaks my heart to have to tell a family that their student needs to do kindergarten another year.'",
        "'speaker_0': 'In the case of one of my previous students and his family, we communicated on a daily basis and I informed them of strategies they could work on at home. But the extra year of schooling was just what he needed when he went through kindergarten again.'",
        "'speaker_0': 'Little by little, he became more familiar with the routines. And by the end of the year, his confidence made him walk like he was ten feet tall. Had he attended preschool, he would currently be attending a school with his age like peers.'",
        "'speaker_0': 'I wholly support the Denver Preschool Program and pray that it will continue as students are expected to perform at higher levels at early ages. It is very important that all students are given the gift of time to develop in an excellent preschool environment that will prepare them for kindergarten and beyond.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_5': 'Thank you, Ms.. Romero. Mike Yankovic.'",
        "'speaker_3': 'Good evening. My name is Mike Yanukovich. I'm the president and CEO of the Children's Museum of Denver. I'm also excuse me, I have a back injury, so I'll try and make this work up here. I'm also on the call star board and I'm a proud member to be a co-chair for this campaign, in addition to Councilman Brooks'",
        "'speaker_3': 'and Mario Cabrera. I just wanted to give you a few key elements of why I'm so excited and passionate about this campaign and also being a co-chair for it. We're educating young children at a time when actually most of the brain development is happening.'",
        "'speaker_3': 'We know this from science and research. We're also encouraging parents to place their kids in a high quality program with significant impact and proven outcome. Many of these were a few of you may not know this, but the Denver Preschool Program is actually a national model, and there's a lot of interest in what we're doing right here'",
        "'speaker_3': '. Seattle and Cincinnati are two municipalities in cities that are learning about the program and like to bring this home and replicate it in their communities. We've seen the proof that the Denver Preschool Program works and the Denver Preschool Program, children in the program are outperforming their peers.'",
        "'speaker_3': 'Lastly, and I think really importantly to me is we need to expand this program to help families to know that their children are in a really safe learning environment, particularly when they're all day at work. And what this does is it provides the opportunity for a productive workforce today, but most importantly, for a highly well-educated workforce and'",
        "'speaker_3': 'productive workforce in the future. So I thank you for your consideration, and I appreciate all of your support on this. Thank you.'",
        "'speaker_5': 'Thank you, Mr. Yanukovich. That concludes our speakers is now time for questions from members of Council. Do we have any questions, Councilwoman Ortega.'",
        "'speaker_8': 'No, thank you, Mr. President. I do have a couple of questions. Cheryl Caldwell, if you wouldn't mind coming to the microphone, I wanted to ask a couple of questions about how many four year olds are in the Denver public school system.'",
        "'speaker_1': 'The number that I said was the total number 33. Wait. This is our capacity for next year 3344 in four day programs, 1002 and a half day for a total of 4346.'",
        "'speaker_8': 'And last year, 3000 were served. Is that correct?'",
        "'speaker_1': 'So not all. So it was it was not quite that low? No, it was probably very close to 4000 last year. This past year. That's just past.'",
        "'speaker_8': 'Okay. And can you tell me of those children, how many of them are children with disabilities? How how is the program serving children with disabilities?'",
        "'speaker_1': 'So we serve any children who are identified with disabilities and either with three and four year olds in inclusive classrooms. So 60% typical kids, 40% with disabilities. In some particular models of programs. Or if the if the disability is very mild, it would be in a regular classroom with an itinerant person who came and provided services like'",
        "'speaker_1': 'speech language or occupational therapy, that kind of thing. I don't have the exact number right off the top of my head. I would say it is about 7%. Okay.'",
        "'speaker_6': 'Great.'",
        "'speaker_8': 'So my next question is for someone with the Denver preschool program is Jennifer.'",
        "'speaker_2': 'Jennifer's here.'",
        "'speaker_8': 'Okay. Jennifer, what I would like to know is what is being done to identify the students that Stephanie Romero talked about that come to school totally ill prepared because they didn't have this head start to identify them and try to get them into the program.'",
        "'speaker_8': 'And mean I know DPS in the past can't share their lists, but is there a way that you all are trying to identify who are those kids so that all of the kids have an opportunity to start school and be at that same level playing field?'",
        "'speaker_0': 'Thank you. Jennifer Landrum with the Denver Preschool Program. The Denver Preschool Program. Because it is a universal program, we work to provide outreach to every four year old in the city and county of Denver, rather than focusing currently at a specific target group of children, such as children with special needs.'",
        "'speaker_0': 'Many children with special needs are identified through early intervention when the between the time that they're birth and three years old, and then when they turn three, they begin to be identified by their preschool provider, by a physician, by the public school system, and that is how they are identified.'",
        "'speaker_0': 'That said, I think that we in the city and county of Denver have a gap of about 25% of our kids, approximately, that we're not reaching. And so I think one of the things that we need to do a better job of is hone in on on those more difficult to reach children, to bring them into the'",
        "'speaker_0': 'program.'",
        "'speaker_8': 'So my letter question was not particularly about children with disabilities, but children who are not being reached. Right. And I mean, we can absolutely play a role in getting the word out through our newsletters and that kind of thing.'",
        "'speaker_8': 'I don't know that that reaches everybody, but those are the kids I'm concerned about because they're showing up to school, not being prepared and, you know, maybe through the churches other ways, you know, we can help get that word out as well.'",
        "'speaker_0': 'So currently what we are doing is this year in particular, and we have increased our public outreach, public awareness campaign through billboards, bus shelters. We're doing a little bit of radio, a little bit of TV. We're doing ads in community newspapers.'",
        "'speaker_0': 'We're at community outreach fairs talking with parents. One of the things that the Denver Preschool Program Board has spent some time talking about together is the children that we aren't reaching are the more expensive and difficult to reach children.'",
        "'speaker_0': 'And we're thinking through very carefully how we might reach them, whether it's, as you said, in churches going to as Amber talked about, reaching out to some of the mom groups and in part being in the neighborhoods. And so I.'",
        "'speaker_0': 'Think that that is something that we need to do in partnership with people who worked more deeply into the neighborhoods to help us reach them. And it is something that I do agree that we need to do together.'",
        "'speaker_8': 'Thank you. I appreciate that.'",
        "'speaker_0': 'You're welcome. Thank you for the question.'",
        "'speaker_5': 'Thank you, Councilman. No comment.'",
        "'speaker_2': 'Yeah. Councilman Ortega, this is this is my heart as well in this program. And the board and I and all of us have have gone and had these really intense discussions. But we know one place where all these kids and their parents are coming through on their through them are human services.'",
        "'speaker_2': 'And it's it's starting to see how can we begin to partner with other agencies that are already at the city, that are already serving some of our most vulnerable population in the city, and see if there can't be a component of an educational component there as well.'",
        "'speaker_2': 'And so I appreciate you asking that question. And it's something where there there are certain board members and even Jennifer, just as she stated, are focusing on some of those issues.'",
        "'speaker_5': 'Councilwoman Lemon.'",
        "'speaker_1': 'Thank you. I just want to make a comment.'",
        "'speaker_5': 'Okay. Well, we.'",
        "'speaker_3': 'Will allow a.'",
        "'speaker_5': 'Moment now for the comment section. Councilwoman Montero.'",
        "'speaker_6': 'Thank you, Mr. President. I know this is going to sound like a very basic question, but I think we probably need to go over it. Please go over again. Whoever wants to do this. Why? We need to reauthorize the Denver Preschool Program.'",
        "'speaker_6': 'They know it's been in existence for ten years. But, you know, the population of Denver has changed. Kids grow, families move away. And so can someone come up and talk about that? And then also tell me how many?'",
        "'speaker_6': 'I'll tell it. I'll say the the number of kids that are the statistics that I have. But I have hear that there are probably 18,897 three and four year olds in Denver, and there is a projection of 21,711 by 2019.'",
        "'speaker_6': 'And so that's why I just need for you to just lay the groundwork someone as to why we really need to reauthorize it.'",
        "'speaker_5': 'Anybody can remember if you want to.'",
        "'speaker_2': 'You know, what I want to do is let Jennifer answer that because she's a CEO. But I'll just say the very basic reason is that this program sunsets in 2016 of January. And we as a board have been working for the last year of saying when is a good time to go into the public and reauthorize this'",
        "'speaker_2': 'program? Just recently this spring, we looked and we went into the field and we had tremendous support to go in November. But there's some other reasons of why and I'll have Jennifer answer is.'",
        "'speaker_6': 'Are.'",
        "'speaker_3': 'You going to continue?'",
        "'speaker_6': 'This program is very important to me. This is our time to get as much basic information out as we can. When you talk about Sunset in 2016, that means that it will go away. Is that correct?'",
        "'speaker_2': 'That's correct. It will go away. It will not be in existence any longer.'",
        "'speaker_6': 'Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilmember X Councilwoman Monteiro. So I think one of the reasons that we want to reauthorize this program is just exactly what you were talking about, which is the the boom that we're going to see and the number of three and four children in the future.'",
        "'speaker_0': 'So if we just look at four year olds, which is who this program is charge to care for, I you you said some numbers. And right now we are serving around 5000 children. Our population is around 9000. The increase that you're talking about sounded like it was almost doubling.'",
        "'speaker_0': 'So if we don't continue this program, not only we won't will we not be serving the four year olds that are coming up this coming year? Actually, in 2017, 2018, business, the program ends in 2016. We don't have a hope of continuing to serve the numbers of children that we're currently serving in the city and county of'",
        "'speaker_0': 'Denver. And I think that that's incredibly important for us to do. In addition to that, I think when we think about the income levels of our children and I'm taking a look at what our our Denver population is.'",
        "'speaker_0': 'We have. Looking at about 50% of our children are below the at at the poverty line or below. And then we have another group of children that are free and reduced price lunch. The Denver Preschool Program really reaches out and serves our children at the poverty level and at free and reduced price lunch, which as you know'",
        "'speaker_0': ', is 185% of FPL. And it's those children that we're able to provide higher tuition credits and make sure that they're in high quality programs. And this preschool program gets them ready for kindergarten so that we can hand them off to Denver Public Schools or they're already in Denver Public Schools being funded in part through CDP and help'",
        "'speaker_0': 'them be successful that third grade, help them graduate from high school ready to go on to college. And I think it all begins at our youngest kids and at four and and has we all know one of the changes in the ordinance that we've talked about is when we are able through revenue and different other policy changes'",
        "'speaker_0': 'to serve younger. So I think it becomes very important and I think and I've said this before, I think it's a jewel of the city and that Denver was very forward thinking in 2006 to create this program. And it's something that I think we need to sustain.'",
        "'speaker_5': 'Thank you, Councilwoman Monteiro. Councilwoman Arroyo.'",
        "'speaker_7': 'Thank you, Mr. President. Jennifer. Jennifer, you can stay there. I'm a strong supporter of this program. Denver tried at least one other time before 2006 to put in place a preschool program. And I think we just indicated by what other city, how other cities are looking at us.'",
        "'speaker_7': 'I think we got this as close to right as we could. But on behalf of a constituent query, I want you to talk a little bit about administrative costs, because the program that we passed had a cap of, I believe, 5% for salaries, office expense insurance.'",
        "'speaker_7': 'And in this reauthorization, we're taking that to 7%. So could you talk about the number of staff you have and the needs of the program going forward from the administrative level?'",
        "'speaker_0': 'Sure. Thank you very much, Councilwoman Robb. Yeah, the program does have a 5% administrative cap. And as we go forward, we have asked for an additional 2%. And the admin does cover salaries, accounting benefits, office space. And one thing that that you did not mention, which is with our legal costs.'",
        "'speaker_0': 'So it's the kind of wraps up basic admin. Right now, our city revenues are $13.4 million, 592,000 of that is the administrative portion. The 2%, if we look just at this year, 2% would drop in an additional $346,000 into the program, bringing us to a total of 938,000.'",
        "'speaker_0': 'I think the Denver preschool program right now consists of four staff and a part time office manager, a 40% office manager that we sell we share with the Urban Land Conservancy. I think one of the primary reasons that we are asking for a 2% increase is is not to go out and go crazy and spend an additional'",
        "'speaker_0': '$346,000. But it's really two things. We need to be able to recruit and retain highly qualified staff. And we we have struggled with that. And this past year, we needed to hire a director of operations. And we we had to not have that salary at the place that would have really been competitive in our community.'",
        "'speaker_0': 'We also want to be able to have equity equity across salary positions. And right now it's not we don't necessarily have an equity across all salary positions. Our plans and we've taken a deep look at what we would like to do.'",
        "'speaker_0': 'We do feel we need one extra staff person to really manage this program well. The majority of our program is managed through contractors, and I think if we had one extra staff person, that was a really strong support for the three directors.'",
        "'speaker_0': 'In addition to myself, I think we could do a better job. The other just very basic reason that we've asked for this is when we have the economic downturns. If that is, it becomes another reason why it's difficult to recruit and retain staff just because of the fluctuations, the dips in salary if they were to happen, if'",
        "'speaker_0': 'we had. Bad ones that such as the one we had in 2010, we would actually lose a staff person. What we don't lose are the numbers of children that we're serving, the number of families we're trying to reach, the number of contractors we're trying to manage, the evaluation that we're trying to undertake.'",
        "'speaker_0': 'So I think it's a very small investment to create greater stability in the program. And I hope that answers your question thoroughly.'",
        "'speaker_7': 'Could you just you did bring up one other thing. You talked about you work with some contract folks. Are they considered administrative or are they people doing outreach perhaps, or other jobs that fall outside of that category?'",
        "'speaker_0': 'So our contractors fall in in a very variety of places. We have customer service and enrollment. We have evaluation. We have communications and outreach. Quality improvement and quality rating contractors. And then, of course, the majority of our dollars go into tuition credits.'",
        "'speaker_0': 'I took a look at this. I had a conversation with one of one of the council members who who she and I had a very rich conversation around this. So I went back and I looked at it. And if we added in customer service and enrollment and evaluation, which I could make the case would be administrative costs'",
        "'speaker_0': '. Our admin, our current admin is 10.3%.'",
        "'speaker_7': 'Okay. I heard that in committee. Thank you.'",
        "'speaker_5': 'Thank you, Councilwoman Robb. Thank you, Jennifer. Do we have any other questions from members of council, steve. None. The public hearing on 574 is closed now. Time for comments of members of council Councilman Brooks.'",
        "'speaker_2': 'Thank you, Mr. President. When I I got elected four years ago, I had all these grandiose dreams of of all of the promises that I talked about on the campaign trail. And preschool was not one of them. And Carol Boykin, who was the council representative, had moved on.'",
        "'speaker_2': 'She was no longer she was term limited and she wasn't term limited for she term. She ran for mayor.'",
        "'speaker_3': 'That's right.'",
        "'speaker_2': 'Which limits terms. And so she was no longer on council. And the Denver preschool program found out that I had two kids that I lived in northeast Denver and asked if I'd be a part of the board. And at that time, my thinking was, well, you know, there's a lot of other things that I'm doing.'",
        "'speaker_2': 'I want to, you know, kind of focus my area on economic development, some other things. And little did I know that this was the main indicator of a good job force a good workforce in our city. And it was one of the most important decisions that I made four years ago.'",
        "'speaker_2': 'And I'm excited that I did, did it. We're here today because we're at a crossroads in America and all over this country. We are finding that we have third graders that are not that can't read, that are not doing well in math in the third grade, not testing well at all.'",
        "'speaker_2': 'And that is a 97% correlation to graduation rates in high school. 97%, if you are not if you cannot read, if you if you are not up to your skills in math by the third rate, that is a 97% correlation that you and I graduate.'",
        "'speaker_2': 'And then if you are not graduate from high school, there's a 99% correlation that you'll go right into the justice system. And so this is a serious issue that we're facing. And we see that data shows that early childhood education is the key.'",
        "'speaker_2': 'It's the foundation to begin to change this horrible trend that's going on in America and even in Colorado and in Denver. And so I'm excited to support this. Couple of weeks ago, we were in mayor council in the mayor said this was his most important vote on his eight short years on council.'",
        "'speaker_2': 'And I kind of sat there and looked at him, you know, because you never know. You know, we're all political leaders here, you know. Did he really mean that? And you could look in his eyes and I talked to him a little bit after and he really meant it.'",
        "'speaker_2': 'And as I think and I began to reflect on on what this means for our city, how this can really turn the trend around in education in our city, our city, I would say the same thing. Each council person will have to assess that for themselves.'",
        "'speaker_2': 'But I would say the same thing. This is the most important vote since I've been on city council. I think it's the most important thing that we have to do. My kids care is to Kenya is five and Mochi is seven.'",
        "'speaker_2': 'Kenya and Mochi have both been through this program and they're doing great and and Kenya is going to host center next year. Really excited about that. And she'll eventually be in the different preschool program. I'm not here because of my kids because at the end of the day, they're their parents are going to read to them every'",
        "'speaker_2': 'night. We're going to make sure that they're going to succeed. I'm here because of their friends, all of their friends in the coal neighborhood who are living below the poverty line, who aren't going to class, who aren't in school, who aren't doing well, whose parents aren't investing in them.'",
        "'speaker_2': 'I'm doing this because at the end of the day, if we can get those students engaged, if we can get those students a part of that 99% kindergarten ready, a part of that 64% testing, well, in third grade, that will begin to see a change in this city.'",
        "'speaker_2': 'And I believe that as we begin to grow this program, as we begin to invest in our future, we're going to see a tremendous change in the city. I want to I want to give a special thanks to Councilwoman Lehman, my sponsor, on this bill.'",
        "'speaker_2': 'She has a tremendous heart for for early childhood education. And you'll hear her remarks and also want to give special thanks to Jennifer Landrum, who is the CEO of this program and who we as a board hired less than a year ago to make sure that she would reauthorize this this program.'",
        "'speaker_2': 'And you've done a fabulous job. You know, you're good when when David Broadwell comes up to you after after a committee and say that was one of the best committee presentations I've heard in a long time. So job well done, Jennifer.'",
        "'speaker_2': 'Tomorrow starts now. Tomorrow starts now. And I want to encourage all of my city council colleagues to vote in this way and support this and send this to the ballot and send a strong message to the city of Denver that we need to reauthorize this program.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_5': 'Thank you. Councilman Brooks, Councilwoman Lemon.'",
        "'speaker_1': 'Thank you, Mr. President.'",
        "'speaker_6': 'I would like to take a moment to recognize.'",
        "'speaker_1': 'The queen of early.'",
        "'speaker_6': 'Childhood education and a Joe Haines. Would you just stand up and actually. She has been my guiding light through all of this. And I think she just perseveres and perseveres.'",
        "'speaker_1': 'And we are here.'",
        "'speaker_6': 'Today because of the ANA Jo's insights and efforts. So thank you. I'll be very quick when I'm just going to go down the things that I think are really great about this program. It's number one, it serves all families.'",
        "'speaker_0': 'Any family that.'",
        "'speaker_6': 'Wants hears about it, knows about it can get served by this program. Number two, there is an evaluation process, a strong evaluation process in the program so that the schools that are serving these children are graded and evaluated so that our children go to very, very good schools because we work with them to be very, very good'",
        "'speaker_6': 'schools.'",
        "'speaker_1': 'And therefore, it.'",
        "'speaker_6': 'Addresses the kind of education that they are getting.'",
        "'speaker_0': 'And finally.'",
        "'speaker_6': 'They serve as such a base, as you have heard tonight for the Denver Children's Future, that how can you not support this? So I ask all of you to be strong supporters. Thank you.'",
        "'speaker_5': 'Thank you. Councilwoman Lehman and Councilwoman Kim each.'",
        "'speaker_1': 'Thank you, Mr. President. And thank you to all of the speakers who came out tonight and who many of you serve on boards and volunteer with this program. Our Serve Children.'",
        "'speaker_0': 'And Raise Children. I have a graduate of DPI. In two short weeks he'll be entering kindergarten. And so one of the things I wanted to emphasize is I think that it's a really smart move that we are collectively saying and doing this program.'",
        "'speaker_0': 'We had some conversation about this at the committee. It's not just about helping individuals who are struggling pay for preschool. It is that and that's really important. You heard $800 a month as one price tag DPS. My son's a Denison Montessori DPS school.'",
        "'speaker_0': 'It's a little bit less a month, I think 660 a month. But it's not easy even for middle class families to be putting out that much cash on a monthly basis. So it is about the financial assistance, but by virtue of having it collective and having the evaluation and the rating system, quality is improved for every parent'",
        "'speaker_0': ', whether or not you needed the financial resources or not. And that's really important. Our schools are one of the places where we do still have some mix of incomes. In some places I realize it's not always is as distributed as we would like it to be, but every time you have an improvement in quality, it benefits those'",
        "'speaker_0': 'who need it. The financial assistance is the as well as those who do not. And so for me, that's really critical. You know, having watched particularly the DPS deliver this program within.'",
        "'speaker_1': 'A school.'",
        "'speaker_0': 'Was really quite astounding in terms of the quality of the staffing, the services that they had. I remember talking to one of our instructors, one of the paraprofessionals, and saying, I spent the day learning about how to talk about science with preschoolers, you know, so it was really quite, quite impressive.'",
        "'speaker_0': 'So so I want to just remind our public about these benefits, about whether or not you actually need this financial assistance. And it makes the difference between going to school or not, which many of these families do or the benefits that we all receive as parents and.'",
        "'speaker_1': 'As these kids.'",
        "'speaker_0': 'Grow into our community. So thank you for what you do, and I'll be proud to support this and thank Councilman Brooks for his leadership.'",
        "'speaker_5': 'Thank you, Councilwoman Canete. Councilwoman Fox.'",
        "'speaker_6': 'Thank you, Mr. President. I know for many of the enthusiasts that have come tonight and who believe so just so firmly in this program, that it may be hard to believe that a person who really has worked for children all of her life and who worked at the state level to enhance the Colorado preschool program year after'",
        "'speaker_6': 'year would not be supportive of this program. But I am not and I want to explain some of the things that come into this from my point of view, so that people can understand why is it that perhaps a city program is not seen as the answer to me?'",
        "'speaker_6': 'First of all, it was talked about children who outperform those who have not gone to preschool. I have no quarrel with that comment. The only thing that I have discovered is that the data cannot break out the program that is actually dealing with the child.'",
        "'speaker_6': 'They can't work out data from the Denver Preschool Program versus the Colorado preschool. Program versus C cap versus Head Start. All of the data is lumped together. And so when you talk about the advantages that children have, the number that you have is that collective amount of advantage.'",
        "'speaker_6': 'I don't know what extent Colorado Preschool or Denver Preschool Program has in that, nor any of the others. But I do know that all the people I have talked to have confirmed the fact that the numbers are smushed together.'",
        "'speaker_6': 'And you can't say that this is a great success for one of the programs versus another of the programs versus another of the programs. I do want to comment on the administrative costs because I can't as I say, I've been a strong supporter of the Colorado Preschool Program, is primarily an at risk program, which I have felt'",
        "'speaker_6': 'money was certainly well spent on. And when I was in the state legislature, I always tried to increase that line item because so much of that money came to Denver. We did get by far a large, disproportionate amount when you looked at the state.'",
        "'speaker_6': 'So it's a good way to funnel money. Here are administrative costs of what they're actually finding is administrative costs are about the same as running the Colorado preschool program, $70 million program, versus a $15 million program. So the economy of scale is something that's important to me.'",
        "'speaker_6': 'I would have far rather had the Colorado Preschool Program expand than to add another entire level. And I have talked about my concern about the administrative costs. I'm pleased to hear that that we are talking about adding other things in.'",
        "'speaker_6': 'But 10% still doesn't get there because to me, when you take a look at the budget, I do have the budget and the numbers of things that are not included in administrative costs come up to about 10%. Part of that would actually then be 12% if we take a look at this increase in the media contracts that'",
        "'speaker_6': 'have just come up. Now, I'm pleased that you explained that we're not reaching a certain number of children. And that's part of the reason, because I was going to ask, what is the reason for a 43% increase in media contracts this year?'",
        "'speaker_6': 'I mean, surely it isn't because there's an election possibly coming up. So what was the reason? Those are those particular programs that they're contracting with CBS Outdoor Billboards, RTD, Comcast Radio. I personally like the idea that Councilman Brooks raised.'",
        "'speaker_6': 'Of working with our human rights are always human services. That's where you're going to meet more of the kids that are going to be needing the service, not the parents and kids who read billboards or who happen to try to read all the advertising in the RTD shelters.'",
        "'speaker_6': 'You have to spend the money wisely. Now, 43% this year. Increase in that makes me concerned about this economy of scale and what we are spending on overhead. When you put it all together, I add without that extra 2%, it was going to be with an increase in in the cost, there's going to be 17% now could'",
        "'speaker_6': 'be up to 19% if you keep that kind of spending on media contracts. So that's just too high for a program that right now has a $15 million pot. And you're hoping with this increase to get a $19 million pot.'",
        "'speaker_6': 'I don't believe it's the best way to go about it. If the voters were to decide they did not want a tax increase and they did not want higher administrative costs, they could say no this year. And yes, I realize people will back to reauthorize the program.'",
        "'speaker_6': 'They still have time. It doesn't end till the end of December 2016. So the the future of the program is not at stake. It's whether you want to increase the tax and whether you want to increase administrative expense.'",
        "'speaker_6': 'I do not want to do either. And I will be voting against it.'",
        "'speaker_5': 'Thank you, Councilwoman Fatima and Councilwoman Shepherd.'",
        "'speaker_1': 'Thank you, Mr. President. I was hoping that Ms.. Romero was still here because I just wanted to compliment her on her testimony tonight. She was the I believe she was a preschool teacher. Correct. That offered her testimony. And I thought, you know, we talk a lot about kindergarten readiness, but nobody really knows what that means.'",
        "'speaker_1': 'But she spelled it out very clearly in her testimony tonight. You know, you might think that, you know, picking up pens or colors, you know, and drawing with them comes naturally to all children, just to name one of the skills she mentioned or even book handling.'",
        "'speaker_1': 'But the truth is that that's not the case, and it's not necessarily a matter of income or intelligence or anything of that nature. I like to speak about this from a personal level. My son had, as a young child, displayed what I would call a tactile phobia and really did not like to pick up lots of different'",
        "'speaker_1': 'kinds of things and touch them and manipulate them, as most children do. Consequently, he never picked up things like Play-Doh and learned the strength and the dexterity skills that you get from playing with a substance like that. Consequently, he did not develop pinching skills very well for a long time, so he started in the preschool program actually'",
        "'speaker_1': 'at age three, and then also of course took advantage of the Denver preschool program activities at age four. But it wasn't until about halfway through kindergarten that he really mastered, you know, that ability to grasp an object, pinch an object like this, to put it to paper and actually, you know, write something that we might recognize as'",
        "'speaker_1': 'letters. That is just a very personal story about, you know, how I experience this path to kindergarten readiness in my own home. And we cannot a lot of those things that Ms.. Romero described, you know, I think we take for granted that, you know, most children are just going to naturally develop those, you know, those skills on'",
        "'speaker_1': 'their own. But they don't that doesn't happen naturally in all households, which underscores so much why we need these educational opportunities so that people like Ms.. Romero are not having to have a kindergartner repeat the class again just to gain those basic skills, not to mention all the good testimony that we've heard tonight about how mastering the'",
        "'speaker_1': ', you know, these these very basic beginning skills at a young age creates a foundation on which we can build all these other skills, which leads to, you know, folks actually graduating from college and being ready in the market, you know, as Councilman Brooks has so eloquently expressed tonight, you know, and then ready to, you know, become like'",
        "'speaker_1': 'what we call a contributing member of society. So all of those steps are just tiny building blocks that we that we build on. And they need to be available to all children equally to help level that playing field and give kids that best leg up like, you know, from the gate straight out of the chute.'",
        "'speaker_1': 'So, you know, I really get this in a very real way, having experienced some of these issues at home. And I am very happy to support this tonight and recommend that it be put on the ballot so that all our Denver residents can vote on this, this evening.'",
        "'speaker_1': 'And I thank you all for all your testimony this evening. And if someone should see Ms.. Romero, please tell her my gratitude on helping to really explain what it means to be kindergarten ready. Thank you.'",
        "'speaker_5': 'Thank you. Councilwoman Sheperd. Councilman Lopez.'",
        "'speaker_3': 'Thank you, Mr. President. I want to thank my colleagues for working on this. I want to thank the group for actually, you know, coalescing identifying this as a priority in moving forward with this. I, too, am the proud papa of a of a now second grader who went through the program and, you know, started very little.'",
        "'speaker_3': 'She started reading when she was three years old. She started reading and she was three. I didn't start reading in 2 hours. My wife, kindergartner, first grade, maybe 14. But no, I education is it's as a human right.'",
        "'speaker_3': 'This is something when you go on and you take this on a global scale and you ask folks a question like this, like we're talking about putting on the ballot tonight and it's a no brainer. It's a no brainer.'",
        "'speaker_3': 'Who does not want an educated society? We as a country have we have a lot to catch up on. This is a this is a standard that we are not holding the flag on. We're not holding the standard when it comes to this.'",
        "'speaker_3': 'We are no longer the standard. Right. And I think for us, we have to snap out of that mentality. We have to snap out of the mentality that will pay an arm and a leg for a football stadium in a jail.'",
        "'speaker_3': 'But we won't educate our children. We'll tax ourselves to put a half a billion dollar stadium in our city boat. We're penny pinching when it comes to the education of our children. We're so happy to build jail and courthouses, but we penny pinch when it comes to the education of our children.'",
        "'speaker_3': 'Think about that. And I think, Councilman Brooks, you're absolutely right. The mayor, I've heard the same thing. They look at I think they measure second or third grade beds, the amount of kids in terms of their reading level and how they're performing on tests, that's how they measure the amount of beds they need in jails.'",
        "'speaker_3': 'That's ridiculous. So when it comes to this, is this is the investment, the best investment we can make. And, you know, does this build a shiny new granite building with gold trim and something we can say, aha, look what our tax dollars built overnight?'",
        "'speaker_3': 'No, but over time, it's the best investment we can make. Thank God for the folks like Anna, Joe Haines, and for the other folks that have worked, those teachers in our classrooms as preschool to high school and college professors that have worked and worked over time, even though they didn't have budgets, seem like to pull from their'",
        "'speaker_3': 'own pockets to pay for their supplies in their classrooms. Thank God that 30 years ago, 40 years ago, that they invested because a lot of us in this room wouldn't be here if it were not for that investment.'",
        "'speaker_3': 'We need to do more and we need to regain that flag. We need to capture that flag back. We need to be the standard in the world when it comes to preschool education in this country, in this city and in this world.'",
        "'speaker_3': 'And this is one of those first little steps that we can take. Think about it. Think about what we have spent our money on. You know what? We can be strong. I support this move forward onto the ballot and I hope this gets adopted by voters in November.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Thank. Thank you. Councilman Lopez. Councilman Nemeth.'",
        "'speaker_3': 'Thank you, Mr. President. When we embarked on the preschool program eight years ago, we weren't we weren't buying a pig in a poke. There was good scientific data that suggested that we were making the right move, doing the right thing, but we were taking a risk.'",
        "'speaker_3': 'We were somewhat on the cutting edge. And so there's a there's a a gamble there that we took. And the voters of Denver took. But eight years later, the data is in the the you know, the proof of the pudding is in the eating.'",
        "'speaker_3': 'And that meal has now been served, or at least the first course of it. And it's delicious. It's it's good. It's it's it's proving its value. And so it's certainly no longer a pig in a poke. It's it's a sure bet.'",
        "'speaker_3': 'And I appreciate Mr. Aspas reference to it as an investment, not just the right thing to do, but a good investment in the future. And I think the value of this investment is being borne out in spades. So I'll be voting to put this on the ballot.'",
        "'speaker_3': 'I'll certainly be encouraging my constituents and other citizens in the city to to vote for this. If you care about the future of our kids, this is the right thing to do. And if you care about the future of our city, it's the smart thing to do.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_5': 'Thank you, Councilman. Councilwoman Monteiro.'",
        "'speaker_6': 'Thank you, Mr. President. And thank you all for coming out tonight and testifying and being volunteers. I'm sure that it's a labor of love and share commitment to the children of Denver. What I want to say is that in listening to the testimony tonight and just following the the thought of Councilman Ebert is that we know that'",
        "'speaker_6': 'it works. We know that it's been proven. You've talked about it, Councilman. Never talked about the data. And how often are we able to say that we know something works? Shoot. Even public works. Sometimes they're over there working on some kind of sewer and they're hoping that it works.'",
        "'speaker_6': 'And maybe it will. And maybe it'll sprung a leak. But we know, we absolutely know without a shadow of a doubt that this program works for it works for our children. And so this November, should this pass, should the proposal pass?'",
        "'speaker_6': 'Should it pass council tonight? I'm a yes vote. But this November, Denver voters will have a great opportunity to re pledge their commitment to our children and also to our to our families. I'm just going to digress really quick here, but one of the really big things that I think is so nice should this pass, is the'",
        "'speaker_6': 'idea that the summer programs would be reinstated. I got to tell you, my daughter now is 14 and this is the first summer that I've actually counted. Okay? There's only 15 more days until school starts. And so, you know, I think of her now as a teenager, but when you have three and four year old four year'",
        "'speaker_6': 'olds, it's so important for parents to have the predictability. We're going to do this today. We're going to go here and there. It helps the children to continue their learning and all the cute little things that they do.'",
        "'speaker_6': 'But it also really helps to eliminate stress for a family, which at the end of the day, we're all happy. If, you know, did they get did they get up on time? Did they eat right? You know, how am I feeling today?'",
        "'speaker_6': 'You know, just to be able to have a day that a family has truly enjoyed without all the other things that go with just life in general. And for this particular program, just to lift a family up one more day as their parenting or as kids are going through, learning all these little things, you know, building self-confidence'",
        "'speaker_6': ', wanting to, you know, wanting to be a self advocate, wanting to read, wanting to throw stuff, you know, wanting to do anything that we watched them do as children. It's so exciting. And watching three year olds, just their little you can actually see their little brain sort of, you know, it's on fire because they're so excited about'",
        "'speaker_6': 'life and the things that they want to do. And so I just want to say that I am very, very excited to be. Able to cast a yes vote so that we could get it on the ballot. And let's go forward and let's have fun and have our kids see how excited and are all the people that'",
        "'speaker_6': 'work with children every day and have them see how excited we are to be able to prop up our families and our children and to be proud of this particular program. Thank you, Mr. President.'",
        "'speaker_5': 'Thank you, Councilwoman Monteiro. Councilman Brooks.'",
        "'speaker_2': 'Yeah, just I just had some housekeeping real quick that I wanted to clear up, just just for our council members and the thousands of people who are watching and the folks who decide to show up tonight. And Mr. Slattery, just make sure that I'm right on this.'",
        "'speaker_2': 'But on the ordinance changes, the ordinance changes will go to it to effect as soon as the mayor signs them. So that won't take too long. But the ballot the ballot question, if should this pass the ballot question goes into effect January 1st, 2050.'",
        "'speaker_2': 'That's correct. Okay. Thank you. So I just wanted all of our counsel folks to be aware of that and that will reauthorize in 2026. Okay. All right.'",
        "'speaker_5': 'Thank you. Councilman Brooks, do we have any other comments from members of council? I would just like to add, I come from a family of educators. Mother is a teacher and I know several educators. And I just think about the great deal of work and that they put into mentoring that our kids get a quality education.'",
        "'speaker_5': 'And I remember a conversation I had with a kindergarten teacher and she's talking about struggles. And she she mentioned one student in particular who at kindergarten had never opened a book. And the only way to describe that is a tragedy.'",
        "'speaker_5': 'And when I was growing up in Missouri, when we talked about early childhood education, I didn't participate because at the time they thought early childhood education should be solely for those children with special needs. And thankfully, science and history have proven how vital that is.'",
        "'speaker_5': 'And now as a country, we're seeing the emphasis of it. And programs that are coming to fruition like the Denver Preschool Program. And the success that it has had, I think, is not is unquestionable. And for that matter that we're simply doing here is to ask, should Denver voters have the opportunity to reauthorize that?'",
        "'speaker_5': 'It's just certainly a no brainer. I mean, the proof is in the pudding what has occurred. And I think that the best thing we can do is make investments. And those investments should be in people because as I believe, as Mr. Asper said, the returns you can get out of those investments are tenfold that have a max'",
        "'speaker_5': '. And I think about this, too, if we can come to a point as a son of an educator where all the children come in and they even level even keel, how much of a more of a quality education can our teachers give those students versus having them focus on those that are behind trying to bring them up'",
        "'speaker_5': 'to the same level as their peers? I mean, that's certainly an ancillary benefit of this, but I think that's just another gain of this program. Does that bring everyone on an even keel? So I certainly think it's very easy to vote yes that the Denver voters should have the opportunity to make this decision on the November ballot'",
        "'speaker_5': '. So. Madam Secretary, roll call.'",
        "'speaker_6': 'Brooks.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Brown. Fats.'",
        "'speaker_6': 'No.'",
        "'speaker_1': 'Can eat. Damon Lopez. Monteiro. Nevitt. Hi. Ortega. Hi, Rob. Sheppard. Hi, Mr. President.'",
        "'speaker_3': 'Hi.'",
        "'speaker_5': 'Madam Secretary. Please close the vote and announce the results. Ten 192918 Is Council Bill 574 been placed upon final consideration and does pass saying that there is no other business before this body. This meeting is adjourned.'"
    ]
}