{
    "A proclamation recognizing the service of James Jeffrey and Denver Public Library retirees to the City of Denver.": [
        "'speaker_0': 'Thank you. It has been moved and seconded comments by members of Council. Councilmember Ortega.'",
        "'speaker_7': 'Thank you, Madam President, of practices names on a couple of occasions and I apologize. I kind of butchered a couple of them. I just want to say thank you to all of these retiring librarians from our library system.'",
        "'speaker_7': 'This is a lot of institutional knowledge walking out the door, and we all know how critical our libraries are for our communities, especially now. During COVID, they've played a vital role in continuing to provide hotspots and continuing to make sure that people have access to their varying resources.'",
        "'speaker_7': 'But the work that James has done is is pretty phenomenal. And I wanted to just call him out because he's actually someone that I was working with in assisting me to do some of the genealogy research on my family.'",
        "'speaker_7': 'And for any of you who have not undertaken this and, you know, logged on with 23 and me and Ancestry.com, a lot of those are connected back to the Mormon Church. And I understand James will speak in a few minutes, but I hear we are second to the Mormon Church in terms of the volumes of material that'",
        "'speaker_7': 'we have in our library system. And that wouldn't have happened without the hard work of James and his colleagues that work beside him in assembling all of those records. So that when any one of us go to look up, you know, birth records, marriage records, any of those things that are now archived, it's so much easier to'",
        "'speaker_7': 'do it because you can just go to the Denver Public Library and find those records and find more information on your families. So I just want to say a huge thank you to Ms.. Carausius, to every one of our retiring individuals for your true dedication to our city and our citizens, for the incredible work that you have'",
        "'speaker_7': 'done and you will be missed. I know there will be a void with people coming into our libraries and no longer seeing your smiling faces. And that will be replaced with with other folks. But thank you, thank you.'",
        "'speaker_7': 'Thank you for your work. And just want to encourage Michael at least to support this.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilman Flynn.'",
        "'speaker_5': 'Thank you, madam. Madam President, I just want to add on just very briefly to what Councilwoman Ortega has offered here, and thank the entire library staff, those who are leaving. Losing a lot of institutional memory. But I just want to amplify what Councilwoman Ortega just said about not just the, you know, the Western history collection or the'",
        "'speaker_5': 'genealogical collection, which I've used extensively in a lot of my research, but to the entire library staff of the city. They are sort of the National Archives for Denver and for Colorado and a lot of the Rocky Mountain West.'",
        "'speaker_5': 'And they have done, I think, a tremendous job in adapting to changing times as far as how people use libraries and as to how the public wants to use libraries. And I just want to thank them for their service as those who spent so many years leave their careers behind.'",
        "'speaker_5': 'Hopefully, they'll mentor the folks who will be fulfilling the functions behind them. And I look forward to continuing to work with them. But thank you to the Denver Public Library staff and congratulations to the retirees. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. And seeing no other hands raised, I'll go ahead and convey my congratulations to the library, folks. And, you know, the library was the hub in many of our communities prior to COVID. And you handled so many different issues within the library.'",
        "'speaker_0': 'And that team are so flexible. And I know they're losing a lot of that institutional knowledge and support. And so we think of the folks that are still on with them, but then also those who are moving on to their retirement and the work that they've done for the city.'",
        "'speaker_0': 'So congratulations again, Madam Secretary, please, let's do roll call.'",
        "'speaker_4': 'Ortega. I. Sandoval. I. Sawyer, I. Torres. I. Black. I see tobacco. I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flynn. I Herndon. At times.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_1': 'Hi.'",
        "'speaker_4': 'Hi. Madam President.'",
        "'speaker_0': 'I know the Secretary closed the voting and announced results. 1313 ISE Proclamation 951 has been adopted. We have 5 minutes for the proclamation acceptance. Councilwoman Ortega, we'll start the five minute timer, and we'd love for you to introduce who you here to?'",
        "'speaker_0': 'Here to accept the proclamation?'",
        "'speaker_7': 'Yes. We didn't invite every single one of them of you would be here all night, but. And we will get a copy to each one. But I did want to see if James Jeffrey is in the queue so we could call him up to speak on behalf of himself and his colleagues who are retiring.'",
        "'speaker_0': 'I think we were looking and staff was indicating to me that he's not in the attendees, but we'll do one more. Final look here.'",
        "'speaker_7': 'He she was not wanting to be singled out. Let me just say that.'",
        "'speaker_0': 'Okay.'",
        "'speaker_7': 'And we wanted to acknowledge everybody. But, you know, I try to highlight somebody when I'm doing this that just exemplifies the work that they all do. And so that's why I had picked him, because, you know, we've all worked with many of these individuals, but this was someone that was helping with something very special in being able'",
        "'speaker_7': 'to compile that family history. So if he is not on, we can move on with our agenda. I just want to once again say thank you to all of them for their incredible. Thank you, Madam President.'",
        "'speaker_0': 'Well, thank you, Councilwoman. And we we did a look, and we don't have him, unfortunately. But again, congratulations to all of the library folks, and we'll go ahead and move on to the next proclamation. And for the record.'",
        "'speaker_0': 'Proclamation 952 recognized in September 2020 as National Prepared Prepared statement is sponsored by Councilwoman Ortega as well and has been placed on consent. Madam Secretary, please read the bills for introduction for us.'",
        "'speaker_4': 'From business, arts, workforce and aviation. 2856 a bill for an ordinance approving a proposed a mandatory agreement between the city and county of Denver and the Denver Housing Authority to support the development and construction of grow market, providing grocery accessibility and workforce training and development from finance and governance.'",
        "'speaker_4': '2840 A bill for an ordinance approving the Mayor's Reappointment and appointments to the Denver Commission on Cultural Affairs. 2849 A bill for an ordinance modifying Chapter 18 of the Revised Municipal Code of the City and County of Denver to allow contributions to the Health Maintenance Organization Benefit Plan to be implemented in 2021.'",
        "'speaker_4': '2876 a bill for an ordinance amending the Classification and pay plan for employees in the career service and for certain employees not in the commercial service. 2877 a bill for an ordinance amending the Classification and Pay Plan for employees in the career service and for certain employees in the career service.'",
        "'speaker_4': '2884 A bill for an ordinance making a rescission from an appropriation in the Wastewater Management Operations Fund to make a cash transfer to the Wastewater Management Division's Planned Fleet Replacement Fund from land use, transportation and infrastructure. 2852 A bill for an ordinance approving a proposed temporary easement between the city and county of Denver and Housing Authority of'",
        "'speaker_4': 'the city and County of Denver for pedestrian access during construction of 1025 North Decatur Street and 2800 West 10th Avenue. 2880 A bill for an ordinance relinquishing the easement established in the permanent easement recorded with the Denver Clinic and recorded at reception number 2020023588.'",
        "'speaker_4': 'Located at 5191 Yampa Street. 2882 a bill for an ordinance relinquishing portions of the easements reserved in Ordinance Number 279 series of 1995, recorded by a Denver clerk and recorded at reception number 9500046347. Located at South Phenix Street between West telling me two avenue and West Dakota Avenue from Safety, Housing, Education and Homelessness.'",
        "'speaker_4': '28 one for a bill for an ordinance approving a proposed second and mandatory agreement between the city and county of Denver and the Regents of the University of Colorado to provide services to individuals living with HIV AIDS in the Denver Transitional Grant area.'",
        "'speaker_0': 'Thank you. Council members, this is your last opportunity to call out an item. Councilmember Flynn, would you make the motions for us this evening?'",
        "'speaker_5': 'I guess I will. Madam President. Thank you.'",
        "'speaker_0': 'Thank you. Now, I'll do a recap under resolutions. Council members say of OCHA has called out Resolution 891 for questions and 895 for a vote. And Council Member Hines has called out Resolution 728 through 735, 741 through 743, 838 and 839, 853 and 864 through 873.'",
        "'speaker_0': 'All for a vote under bills for introduction. Council members say to Barca has called out Bill 849 for questions under bills for final consideration. No items have been called out and are pending. Councilman Herndon has called out Bill 285 for a vote and the first item up is council resolution 891.'",
        "'speaker_0': 'Council members say to Barca, please go ahead with your questions on Council Resolution 891, please.'",
        "'speaker_4': 'Thank you, Madam President. I just wanted to get clarification on what the extension of time for job creation is and how that impacts the project and the community.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. I believe that we have a staff member. Here to answer your question. Here we go. Go ahead.'",
        "'speaker_1': 'Doug. I council members. Madam President, Doug Selby, Councilmember CdeBaca. Madam President, the job creation we put in Skyline economic development funds, Skyline housing funds for the housing portion of this project and some general funds for the housing portion under the skyline, economic development, there's a job creation.'",
        "'speaker_1': 'And so with the developer, the vertical developer now in place and ready to begin construction, closing on the loan is planned for the end of this month. We anticipate the job creation will be done much sooner than what is put in the extension before you.'",
        "'speaker_1': 'We just wanted to make sure we had enough of a cushion in case severe weather delays with construction. But the job creation should be created through the Community Public Infrastructure Project. Below that, housing, which is still a clinic project.'",
        "'speaker_4': 'You got it. Thank you. That does it for my questions.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. All right. Moving on. The next item up is Council Resolution 895. Councilmember Flynn, will you please put Council Bill 895 on the floor for adoption?'",
        "'speaker_5': 'Yes, Madam President. I move that council. Resolution 895 be adopted.'"
    ],
    "A resolution approving a proposed Collective Bargaining Agreement between the City and County of Denver and the Denver Police Protective Association, for the years 2021-2022.  Approves a collective bargaining agreement with the Denver Police Protective Association for 2021 and 2022 including: a 0% salary increase in 2021; suspending the holiday pay provisions for 10 holidays in 2021; reducing the Citys contribution to the Denver Police Retiree Health Fund by $360,000 in 2021; creation of a one-time 100-hour time bank in 2022 to be used in the future like vacation leave; a 2.77% salary increase for 2022; and expressing hazard/specialty pay in terms of a percentage of salary effective January 1, 2022. The agreement results in $4.9 million in city budget savings in 2021. The last regularly scheduled Council meeting within the 30-day review period is on 10-5-20. The Committee approved filing this item at its meeting on 9-2-20.": [
        "'speaker_0': 'Thank you. Has been moved. Thank you for the second comments by members of Council on Bill 895. Council Member CdeBaca.'",
        "'speaker_4': 'Thank you, Madam President. This is one we've had extensive conversation about in committee last week and wanted to make sure that we get a separate vote on this one, because I personally do not think that the targeting happens in the States and I do not support advancing this contract.'",
        "'speaker_4': 'Neither the portion length of time nor the salary increase.'",
        "'speaker_0': 'Okay. Thank you, Councilwoman and I, we're having quite a bit of feedback from the from the chamber, so I'm not sure if we can fix that on on your end or our end. Up next, we have Council Member Flynn.'",
        "'speaker_5': 'Thank you, Madam President. There's been a lot of talk about this contract with the Police Protective Association, and I wanted to make sure that our folks in the public understood some things that aren't really being talked about that have to be dealt with.'",
        "'speaker_5': 'Number one, the contract is not just no raise for police officers next year with a raise in the year 2022. The fact is that this contract is a pay cut for police officers next year. It is a 3% pay cut for next year because of the elimination of the premium pay for holidays that officers must work.'",
        "'speaker_5': 'We have to have 24 seven police officer coverage in the city. So it is a 3% pay cut. It was designed to save us next year, $5 million. That was the target set by the administration for the negotiations.'",
        "'speaker_5': 'And we met that target with this pay cut for police officers. So it's not just no raise. It is a pay cut. It's the financial the financial equivalent of an eight day furlough without pay, equivalent to what the career service employees are taking here in the city.'",
        "'speaker_5': 'Eight days without pay. And what and frankly, what members of council are just with one exception, are taking as a as a furlough this year to help with the budget. So that's the driving reason, among other reasons, for the people wanting a two year contract.'",
        "'speaker_5': 'Because if we're asking officers to take a pay cut next year, they wanted something at the back end of the contract. And so, yeah, we wanted a one year contract, but we weren't able to get that at the table.'",
        "'speaker_5': 'So nobody gets everything they want in any negotiation. But even so, the pay is put in writing. It's willingness to open up the contract next year. Depending on what our budget outlook is for 2022. We are in similar negotiations with the firefighters union right now and we've set a similar target for them that may result in a'",
        "'speaker_5': 'pay reduction for firefighters next year as well. I just want people to understand that this is a pay cut for police officers. It's also important to realize that city council must accept our own responsibility for what we've heard a lot of complain about the lack of transparency, the lack of our involvement.'",
        "'speaker_5': 'The PPA fulfilled its obligation. Contrary to some of the emails we've been getting, they fulfilled their charter obligation to notify us of their intent to open these negotiations. They sent us a letter on March 9th and we failed to respond to it.'",
        "'speaker_5': 'So City Council has to accept our own responsibility for the fact that we missed the first couple of bargaining sessions. Yes, the administration should have reached out and said, Hey, do you have someone you want to send here?'",
        "'speaker_5': 'But we did receive the notification. We failed to follow through. So this lack of transparency and the lack of us being at the table for the first session lays partly at our door as well as the administration. So considering all these things, I'm persuaded that that this contract gives us the certainty we need going into budget talks'",
        "'speaker_5': 'tomorrow, starting tomorrow, we need to nail down these savings, going to arbitration. We'll put this up in the air and will and will make those budget talks a little more difficult. So I intend to vote in favor of this to secure the certainty for the budget for next year.'",
        "'speaker_5': 'And with the eye toward if we are in the situation a year from now that PPA will come to the table as the other unions have done and that the PPA has done on four other occasions back when the city was in a in a budget crisis.'",
        "'speaker_5': 'So having having thought of all those considerations and on balance, I think approving this contract is the best way to go. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Hines.'",
        "'speaker_2': 'Thank you, Madam President, I. So three things I want to say. First, I want to thank Director Hanlon for reminding council last week that sometimes we could believe what council thinks is an agreement with the executive branch. But unless we have a seat at the table, those understandings may or may not actually make it into a binding'",
        "'speaker_2': 'proposal. So I would say to my colleague, Council member Flynn, thank you. I totally agree that we have a shared responsibility. I know that when we have meetings that include elected officials, if that elected official or body continues to not show, I think I would maybe reach out again.'",
        "'speaker_2': 'So I just want to make sure that when we're having important discussions like things that materially affect the budget that that we do, certainly we share some of the responsibility. But but if we keep taking attendance and city council keeps not being there, I think that if I were in that bargaining process, I would reach out and'",
        "'speaker_2': 'say, hey, where are you? Second, we've received mail from, you know, outreach from constituents who appear to be pro-police, who also want us to vote against this agreement. A quote, It doesn't look like to me the police get anything out of it.'",
        "'speaker_2': 'Remember, they do protect us, unquote. Point three about unions. So I'm very interested in collective bargaining agreements for more people. I think working families need more protections. And so I'm conflicted about considering a vote against CVA for DPA.'",
        "'speaker_2': 'A union representing workers in Denver just happened to wear a badge and a gun. To help get more context, I reached out to multiple people in Denver's organized labor community. I received no organized response that affirmed DPA as a part of the collective fighting for increased worker rights for all.'",
        "'speaker_2': 'I did receive response from some expressing concern, including DPS, previous endorsements of anti-labor candidates and related political parties. So certainly I want our Labor communities to know that I did think and concern are consider the idea of increased worker protections.'",
        "'speaker_2': 'And. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Hines. Councilman CdeBaca, since we had you already up, is it okay if I go to. Okay. All right, great. Councilmember Sawyer.'",
        "'speaker_6': 'Thank you, Madam President. I looked into this a lot and even pulled the 28 contract because I think that's, you know, the most historically equivalent in terms of time frame rate and financial kind of stresses that are very similar to what we looked at, what we're looking at right now.'",
        "'speaker_6': 'I really wanted to see kind of what what the agreement look like that and what the agreement looks like now and whether those two things were sort of our sort of equivalent. And they are. So I think that that's a really good and interesting thing to know.'",
        "'speaker_6': 'Right. That that in in a previous financial time like 2008, you know, these these agreements are very similar. And it should be noted that in in that 2008 agreement in 2009, there was an MOU you that was signed that changed the agreement around when it became clear that that the city was in a financial continued to be'",
        "'speaker_6': 'in a financial crisis. So I think that that's just important to note. That said, you know, what we're looking at here is a situation where that the 2021 police changes would essentially be the equivalent of what our career service employees took in 2020 with the eight day furlough, like Councilman Flynn said, and that 12 of us took'",
        "'speaker_6': 'in 2020. Right. So what we're looking at in 2021 would be what? So that the police would take what the rest of our employees took in 2020. What we don't know, because we haven't seen the budget yet for 2021.'",
        "'speaker_4': 'Is whether our career service employees.'",
        "'speaker_6': 'Are going to be required to take anything else in 2021. Are there going to be more furloughed? Is is there going to be a cost of living accrual next year for our employees? We don't know. We haven't seen the budget.'",
        "'speaker_6': 'It comes out tomorrow. We're being asked today to vote on something without all of the information in front of us, because if.'",
        "'speaker_4': 'We.'",
        "'speaker_6': 'Are asked to do this and in our employees are asked to take furlough days or are not going to receive a cost of living adjustments, then it's not fair. That we're going to approve something tonight for those officers in 2022 that the rest of our employees aren't getting.'",
        "'speaker_6': 'We are not dealing with a full deck of cards. Here we are. We don't have all of the information in front of us, and that's not okay. So frankly, I think that we should delay this week until we have the budget in front of us so that we have all of the information in front of us.'",
        "'speaker_6': 'I don't know why it is that we are being asked to do this tonight when we haven't seen the budget yet. It's my opinion that we should push this back a week. I'll wait to hear what my other council members think of that plan.'",
        "'speaker_6': 'But if, you know, if we don't if we aren't going to do that, then I think I'm going to have to be a no vote because I can't make a decision without all of the information in front of me.'",
        "'speaker_4': 'So.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Torres.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_6': 'I've just.'",
        "'speaker_4': 'I've heard the practical arguments in voting in favor of the agreement and understand the rationales. I can't vote for this particular agreement. Tonight, whether Councilman Sawyer intends to delay it or not. I'll still be a no on.'",
        "'speaker_0': 'It later on. I don't see.'",
        "'speaker_4': 'The sea of being very realistic or equitable for us to have a proposal in front of us to save 5 million in one year and then be on the hook for 9 million the following year. This is this would be too difficult an issue to to also explain even to my own staff who are taking furloughs that'",
        "'speaker_4': 'officers aren't this year.'",
        "'speaker_1': 'And I don't.'",
        "'speaker_4': 'Think it looks so rosy next year. So I'm going to be a no. If we had up voting on it tonight. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Cashman.'",
        "'speaker_1': 'Thank you, Madam President. As I've said before, there are many fine men and women in the Denver Police Department. They work hard every day to keep our communities safe. They deserve to be paid well. Just as there are many fine women and men working for Parks and Rec.'",
        "'speaker_1': 'Our Department of Transportation, Infrastructure, Department of Finance, Community Planning and Development, etc. who also work hard every day to deliver a great city for people to enjoy. And they also deserve to be paid well. This is a once in a century, we hope.'",
        "'speaker_1': 'Point in time as we look into the future. It's a pipe dream to think that revenue will miraculously, miraculously jump back to pre-pandemic proportions where money is flowing. And we can be assured we can properly honor our workforce with the salary increases they need and deserve to assure DPD erased without the same assurance being given.'",
        "'speaker_1': 'All city and city employees is simply not fair. I would be far more inclined to look at a contract that says DPD salaries are increased as soon as our career service employees get the same benefit. Instead of relying on a letter from the PPA, which I do appreciate that they will come back to the table if budget'",
        "'speaker_1': 'tightness requires. I believe more appropriate would be a letter from the city assuring the PPA that we will come back to the table when budget allows. So I'm asking both sides to return to the table and work towards an agreement that is more equitable across the board.'",
        "'speaker_1': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Sandoval.'",
        "'speaker_4': 'Thank you, Madam President. So I'll be brief to my colleagues. Point to Councilman Cashman website. Thank you for saying that. I agree that everybody in this city plays a very important role. And to my colleague, Councilman Torres, it I do not see a future.'",
        "'speaker_4': 'That's right. And given that we are going into the winter and we do not know what the impact of this pandemic will look like in our future. It's hard for me to sit here and say, approve a contract that would make whole $9 million in year 2020.'",
        "'speaker_4': 'And also, I just do not feel comfortable with the fact that although to my colleague Kevin Flynn, I agree that we have to take this responsibility. I also think that given that our chief negotiator has been doing this for the city and county of Denver for a long time, and city council has never been left out from'",
        "'speaker_4': 'the process. And this is the year that they chose to be this out. I just don't feel good, and I feel that we have to approve this contract in good faith. And I cannot approve this contract in good faith, although I do very appreciate all the men and women in uniform, especially in the police department, who have'",
        "'speaker_4': 'been really helping the communities who have been impacted along south, central and north federal with the multiple shootings that have happened in our communities this summer. I wish we were not put in this position, but we are. And so therefore, I will not be supporting this contract either.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman. Councilman Clark.'",
        "'speaker_2': 'Thank you, Madam President. I'll just say that I really respect the issues and the points that my colleagues have brought up on both sides of this issue.'",
        "'speaker_1': 'All echo what Councilwoman Sandoval just said, and I wish that we were not in this position right here.'",
        "'speaker_2': 'I you know, I think that.'",
        "'speaker_1': 'Everybody has brought up.'",
        "'speaker_2': 'The complexity of this. And on top of that, we're in the middle of a.'",
        "'speaker_1': 'Community conversation about.'",
        "'speaker_2': 'What policing should look like in our city and across our nation, and that complicates things. On top of that, we, as Councilwoman Sawyer mentioned, haven't.'",
        "'speaker_1': 'Seen the budget for 2021 yet, and things are not good.'",
        "'speaker_2': 'And so I will I won't get too deep into it, other than to say.'",
        "'speaker_1': 'That it is based on the information.'",
        "'speaker_2': 'That I have. I believe that if we turn this back financially, this will likely get worse for the city. Those cuts will have to come from somewhere else. Our career service employees do not have the right to bargain and sit at a table like this, and there is a high likelihood that extra money that we will have'",
        "'speaker_2': 'to come up with.'",
        "'speaker_1': 'If this goes to.'",
        "'speaker_2': 'Arbitration and comes back worse and doesn't save that $5 million will be on the backs of extra.'",
        "'speaker_1': 'Furlough days for our.'",
        "'speaker_2': 'Those very employees who don't have the right to bargain. It is not a perfect situation or one that I think any of us want to.'",
        "'speaker_1': 'Be in, where we're weighing unknowns.'",
        "'speaker_2': 'Of the future and knowns of really hard budget times. But it is my belief, based on what I have seen, that turning this back will lead to further cuts, which will further impact furlough days for the rest of the employees in the city.'",
        "'speaker_2': 'And for that reason.'",
        "'speaker_1': 'I will be.'",
        "'speaker_2': 'Supporting this and I sincerely hope that.'",
        "'speaker_1': 'If it does not go through.'",
        "'speaker_2': 'As it looks like it may not, that everyone worked really hard to make sure that that is not.'",
        "'speaker_1': 'That I was wrong and that in fact, we don't end up in a worse financial position for our career service employees by turning this back. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman. Councilwoman Black.'",
        "'speaker_4': 'Thank you, Madam President. And thank you to all my fellow council members for your very, very thoughtful remarks.'",
        "'speaker_6': 'And I'd also like to thank all.'",
        "'speaker_4': 'Of the hundreds of community members that I have heard from people who have a lot of different opinions, ranging from Abolish the Police to please give us more police. And I've really.'",
        "'speaker_6': 'Tried to listen to.'",
        "'speaker_4': 'Everyone's feedback and I agree.'",
        "'speaker_6': 'With.'",
        "'speaker_4': 'Really everything that my fellow council members.'",
        "'speaker_6': 'Have said here tonight. It's unfortunate the.'",
        "'speaker_4': 'Way this played out this year. I share your same concerns about other city employees and furlough days. But for practical reasons that Councilman Clark just brought up and that Councilman Flynn mentioned earlier, I'm concerned that we could be in a.'",
        "'speaker_6': 'Worse budgetary.'",
        "'speaker_4': 'Situation if we don't approve this, and it does go to arbitration. So I will be supporting it.'",
        "'speaker_6': 'But I do want to reiterate that the officers will receive.'",
        "'speaker_4': 'As Councilman Flynn pointed out, what is essentially a pay cut for 2021 and that they have agreed, and I trust them, that they will renegotiate for 2022 if necessary. And I believe them when they made that commitment in writing.'",
        "'speaker_4': 'And I do want to point out a couple of other things that I think there's been some misinformation about. The police.'",
        "'speaker_6': 'Did.'",
        "'speaker_4': 'As requested, cut over $10 million from their 2020 budget. And I believe their 2021 budget request is also going to be less.'",
        "'speaker_6': 'And the final.'",
        "'speaker_4': 'Point I want to make is that I've heard from people who are concerned that this agreement doesn't address.'",
        "'speaker_6': 'Discipline.'",
        "'speaker_4': 'And investigations of police officers. And the reason it doesn't is because those are prohibited top topics in the bargaining.'",
        "'speaker_6': 'And so by delaying it, it's not as if those would come back.'",
        "'speaker_4': 'In to the.'",
        "'speaker_1': 'Discussions.'",
        "'speaker_4': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman, can each.'",
        "'speaker_6': 'Thank you, Madam President. I appreciate the comments of particularly Councilwoman Torres and Councilman Cashman. I previewed at committee some of my concerns with the financial risk taking. I think that I described this less about a philosophical position about police and more about your budgeting approach.'",
        "'speaker_6': 'One thing that I've heard both from folks testifying and public comment tonight and from some colleagues who are planning to vote for it. So folks on both sides of the issue that I do just want to disagree with this contract doesn't guarantee or require any particular level of overall funding for an overall department.'",
        "'speaker_6': 'The only single line item it actually freezes in is retiree health that's paid in lump sum. Everything else is about this is what an individual officer is owed for their, you know, uniform upkeep or not for their pay or not their vacation or not.'",
        "'speaker_6': 'And so, you know, obviously, personnel is a significant portion of the department's budget, but it is nothing in this guarantees how many officers will be in patrol division or in traffic division or in any division. And so I will just say that I don't think it serves as well to describe this as a false choice between taking'",
        "'speaker_6': 'funding from police and then having if it if it were to be required per officer in a bargaining session, in an arbitration decision, that then those dollars would have to get made up by career service employees. That's simply not the case.'",
        "'speaker_6': 'We as a city could take that from administrative overhead in the Safety Department. We as a city could reduce personnel. We could, you know, as retirements happen, we could not replace those folks. There are numerous ways that we could make up any cost risk to us if arbitration didn't go well within the Department of Safety budget.'",
        "'speaker_6': 'And in fact, I would suggest it would be our obligation morally to do so. So I just, you know, so for those who think if we don't approve, you know, there are those who might want us never to approve a pay contract.'",
        "'speaker_6': 'You might think, oh, if you don't approve the contract, somehow that's defunding police. That's not how it works. This is simply what individuals are owed. We I you know, if this were a better contract, I would be advancing it.'",
        "'speaker_6': 'And then we would have a separate conversation about how many officers and how much administration and how much budget goes to the department. Right. This does not determine those numbers. And I know it's kind of complicated. So I you know, I have a lot of empathy for constituents trying to understand the difference between this contract.'",
        "'speaker_6': 'But this contract doesn't give any dollar amount to DPD. So so I want to be clear that I'm not going to vote no tonight because I think somehow by voting no, I'm going to keep dollars out of the department.'",
        "'speaker_6': 'That's not what this is. This is about saying, I believe we need to try again for a better deal that has less risk in the later year. So I am you know, the administration made its prioritization on cuts in 2021.'",
        "'speaker_6': 'I believe we need to prioritize higher the risk in 2022. Right. Maybe we still have some priority in 2021, but they put no prioritization in 2022. Right. So we just disagreed about which budget year to prioritize the most.'",
        "'speaker_6': 'And so that is the reason I'll be voting no tonight. And I believe that I believe that we can mitigate our risks by going back to the table and trying again to find some common ground that balances the risk of 2021 better with the risks of 2022.'",
        "'speaker_6': 'And number two, should we fail at that and we have an arbitration decision that's concerning, we can mitigate the risk to other departments by ensuring these cuts occur within DPD. So we have two paths, in my opinion, to mitigate the risks.'",
        "'speaker_6': 'There are risks and I acknowledge them. And for that reason, you know, again, I share my respect with those who analyzed the same situation and came out slightly differently. You know, for me, I can't support this tonight and I'll be a no vote.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilwoman Ortega, did you want to get up into the queue?'",
        "'speaker_4': 'Thank you.'",
        "'speaker_7': 'It's very clear the votes are not here for this to move forward. So I won't belabor my comments, but I just think that it is important that if we are talking about significantly impacting this budget, that we need to have a plan and we don't have a plan.'",
        "'speaker_7': 'Many of us are involved in this conversation with Dr. Robert Davis and many other players from our community that are working to ensure that we do have a plan that looks at how we do policing differently. And Councilman Cashman and I and Councilman CdeBaca are on the Crime Prevention Control, CPIC, Crime Prevention and Control Commission.'",
        "'speaker_7': 'Hate acronyms, anyway, where, you know, we're involved in looking at how we do things differently with our judicial system, you know, with our jail system, with with discipline issues, lots of different things. And. In terms of the plan that that will guide how we move forward.'",
        "'speaker_7': 'And I think that it's critical to just, you know, ensure that we've got that in place. Secondly, I want to say that we city council members had three different occasions that I participated in. I believe there was a fourth where we talked about this particular contract at Mayor Council in Executive Session, and we had a chance to'",
        "'speaker_7': 'move it forward sooner if we felt like we didn't like it. And the, you know, decision was you send it to the floor and let it go down there as opposed to fail in committee. They were looking for clear direction from us to say, you know, yes or no.'",
        "'speaker_7': 'And we were sort of all over the map. And so that's why we're here tonight dealing with this. We're going to go down on the floor further delaying the time frame in which we'll have the details of what then gets folded into the 2021 budget.'",
        "'speaker_7': 'I believe they're good for their word and they put it in writing. They would come back and negotiate, just like the firefighters are doing now, even though their contract wouldn't expire till the end of next year. They're going to negotiate sooner and I believe that the PPA will do the same thing.'",
        "'speaker_7': 'So I believe we should move forward. You know, there are no guarantees of of what that outcome is going to be. We we were the ones asking them to, you know, put everything on the table that that was asked of them.'",
        "'speaker_7': 'We didn't put anything new on the table from the city side. And they they agreed to all those things that we asked them to give up. Yes. This is part of the collective bargaining process. And I said in committee, if we want collective bargaining for city employees, then we should put this issue on the ballot and try'",
        "'speaker_7': 'to get collective bargaining for our city employees so they have the same fair process for how their wages are set rather than it being done through the mechanism that we currently use. So I'll I'll be supporting this forward moving forward tonight, although it looks like the votes are here for it to be sent back to the bargaining'",
        "'speaker_7': 'table, which will more than likely end up in arbitration. And the arbitrator decides on one side or the other. The last, best deal and it may or may not be in the city's favor. So we'll just have to wait and see where the chips fall on this one.'",
        "'speaker_7': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman Ortega. Councilwoman CdeBaca.'",
        "'speaker_4': 'Thank you, Madam President. And thank you to all of my colleagues for clarifying and asking and making the right statements tonight. I do want to just add to that last comment about arbitration that our charter clearly outlines a process for us to come to a better agreement if nobody feels like they've gotten the agreement they wanted within'",
        "'speaker_4': 'the 15 days after the arbitrator provides a decision. And so that is very clear in our charter. And I think something that if we trust DPD to come back to the table in a year, we should probably also trust that if nobody feels like they're winning after an arbitrator's decision, that we will come up with an even'",
        "'speaker_4': 'better agreement within those 15 days. And that's it for my comments. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman. Councilman Herndon.'",
        "'speaker_1': 'Thank you, Madam President. I will I will be brief. I appreciate everyone's comments and this in mind. So I will be supporting this. The right decision may not always be the most pleasant, particularly when you are in a Soviet state where we are going to have to make the most difficult decisions of any time.'",
        "'speaker_1': 'Because even when I came in in 2011, as we were ending the recession, that one even compared to what we're having to do. So we're in a position now where we know we have a guaranteed $5 million in savings coming from the coming from the PPA for 2021, which is a fair, fair comment to say what is'",
        "'speaker_1': 'the right you to prioritize. But by sending this back to the table, I don't see a way where we as a city can be coming to be a stronger financial position. So where will those dollars have to come?'",
        "'speaker_1': 'And we can have the debate about where is should become. I'm not sure if we should.'",
        "'speaker_2': 'Necessarily go directly.'",
        "'speaker_1': 'To safety if we have the opportunity to take it right now. But we'll see how the budget lines up in the council. And so here we control the purse strings. So if we felt as if there wasn't equity, we can adjust the budget anyway we see fit.'",
        "'speaker_1': 'So I believe going with the decision of the strongest financial position that we're in right now and then moving forward that budget conversation. So if this does seem to go down, I hope that we as a body are specific to the negotiating team to say what we want as a legislative body, that they can try to move'",
        "'speaker_1': 'forward with that. And if not, then I hope we're ready to bear the responsibility. Should we be in a worse financial position? Thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilman Herndon, seen no other hands raised. I'll go ahead and add my comments as well. We had a very dynamic, deep conversation at committee last, the week before last. And it I want to clarify and have on the record that the postal mail letter that was sent by the union on March 9th was never received'",
        "'speaker_0': '. I never saw a copy of it. Our former legislative director never saw a copy of it there. And we delved into what is your intake mechanism for city council? Who opens the mail? Who logs the mail? Who lets people know when there's something pertinent coming up?'",
        "'speaker_0': 'And so as far as we know, we never received it. I've seen a copy of it, but we've never received it. And so that does then beg the question why wasn't a copy of that sent over? If there was no response by city council, that would be a quick email to send on March 10th or any time'",
        "'speaker_0': 'in March, any time in April, any time in May to let us know what was happening and to be there at the table. Unfortunately, that didn't happen. And going back and looking at committee, something that really struck me was that we're talking about 5 million worth of cuts in 2021, but then making the police totally whole in'",
        "'speaker_0': '2022, plus a 2.7% raise possibly. I mean, that that is unheard of in these sort of economic times. And I have to also look at it that we have no assurances for the rest of the city's workforce, and we weren't represented in good faith at the table.'",
        "'speaker_0': 'If I felt like there was anything that city council could have done differently, I would be the first one to step forward and say, I own that mistake. Leadership owns that mistake. But that didn't happen. There were no opportunities to pretty much stop this train once it had left the station.'",
        "'speaker_0': 'And when I was briefed personally as the president of council, the two year duration had already been sent over to the union. We tried to pull it back and to ask them to stop the process and not ratify it and not move forward.'",
        "'speaker_0': 'And we were told that their bylaws outline that that's what they have to do. And so there were plenty of points, I believe, that we could have pulled back and had a deeper conversation. But unfortunately, that didn't happen.'",
        "'speaker_0': 'And to the final point, whenever we were briefed in executive session in May or council, it was only a briefing. There were never decision points for us beyond. If this isn't going to make it through council, what are the steps?'",
        "'speaker_0': 'But then I felt like we belabored it as far as we could at committee and that we were told we couldn't keep it in committee. We couldn't continue doing this work. It had to go to the floor of council for a vote.'",
        "'speaker_0': 'And so with that being said, I am not in. Support of this because I don't feel like council was represented in good faith at the table. There were plenty of folks that we work with day in and day out that nobody thought it was important enough in 2020.'",
        "'speaker_0': 'With everything that's happening in the world and in our community to ping city council and say, Hey, you're going to have to vote on this, ultimately you probably better be at the table. So you feel like you were part of this process that that unfortunately never happened.'",
        "'speaker_0': 'And so I am not supportive of this tonight. And with me having the final comments, I want to just go back to you, Councilwoman Sawyer. You had mentioned to to hold this over in, delay it one week. We do have budget hearings.'",
        "'speaker_0': 'Are you wanting to delay it one week, or would you be amenable to us going ahead and doing the roll call vote that you do? Any member has the ability to delay it by one week with no vote.'",
        "'speaker_6': 'Thank you. I appreciate you talking, President Gilmore. I wanted to hear the thoughts of the rest of my council members to see kind of where everyone else was at. But it doesn't seem like any holding it over a week until we see the budget would really change anyone else's opinion.'",
        "'speaker_6': 'So I'm happy to go ahead and vote tonight. Thanks.'",
        "'speaker_0': 'All right. Thank you, Councilwoman. Just wanted to check check in with you on that. Madam Secretary, roll call on Bill 895, please.'",
        "'speaker_4': 'No backup? No, Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'And I think you.'",
        "'speaker_1': 'Cashman No.'",
        "'speaker_4': 'Can each. No. Ortega.'",
        "'speaker_7': 'I.'",
        "'speaker_4': 'Sandoval No. Sawyer. No. For us? No. Black. I. Madam President.'",
        "'speaker_0': 'No. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': 'Eight names, five eyes.'",
        "'speaker_0': 'Eight NES Council Bill 895 has failed. The next items up are multiple resolutions. Council member Hines has called out for a vote. We will put these items in a block and take one vote. Councilmember Flynn, will you please put these items on the floor for adoption?'",
        "'speaker_5': 'Madam President, I move that council resolutions all series of 2020 be adopted in a block. 728 729 seven 3731 732 733 734 735 741 742 743 838 839 853 864 865 866 860 7868 869 eight, 78, 71, eight, 72 and 873.'"
    ],
    "A resolution approving a proposed On-Call Construction Services Contract between the City and County of Denver and ECI Site Construction Management, Inc. for Site Development, Landscape and Irrigation Installation Services. Approves a contract with ECI Site Construction Management, Inc. for $15 million and for three years for on-call site development, landscape and irrigation installation services in City parks and other City property (PARKS-202055325). The last regularly scheduled Council meeting within the 30-day review period is on 10-5-20. The Committee approved filing this item at its meeting on 7-28-20.": [
        "'speaker_0': 'Thank you. Council member. It has been moved. Can I get a second?'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Thank you. Comments by members of Council on these contracts. Council Member Hines.'",
        "'speaker_2': 'Thank you, Madam President. So these are a is a bunch of stuff all at the same time. And I thank you for being willing to consider them in a blog. The reason I believe that they're in a bloc is that all of these are on call contracts and they total close to half a billion dollars.'",
        "'speaker_2': 'And so I called out these contracts because of outreach from District ten residents. They I'm concerned, but they're concerned. So I share their concern that that we're earmarking nearly half a billion dollars in contracts less than 24 hours before the executive branch releases the proposed budget for Denver.'",
        "'speaker_2': 'Council doesn't have any advance notice about the mayor's proposed budget, as we mentioned in the last discussion. But we all know that the 2021 budget will be smaller than the 2020 budget. And considering the smaller budget, this could be seen as a public by the public as guaranteeing this money to to certain vendors.'",
        "'speaker_2': 'So I wanted to I wanted to bring up. How about the Department of Transportation and Infrastructure? Maybe Mr. Gallardo, if he's available. And one.'",
        "'speaker_0': 'Yup. There he is.'",
        "'speaker_2': 'Yes, I'm here. Thank you for having me. So, Mr. Gallardo, can you help explain the connection or lack thereof between these contracts and the budget? And I recognize that some of these I guess some of these are not dodgy contracts.'",
        "'speaker_2': 'Some of these are parts contract. So feel free to speak specifically to the daddy contracts if you like. Yeah. And I think, you know, on call contracts all together is fine, too. The way they work are very similar.'",
        "'speaker_2': 'The uncle contract is is putting aside a set of money that we we hold the contractors in this amount, but.'",
        "'speaker_1': 'We are not obligated to.'",
        "'speaker_2': 'Spend that amount. So you're not approving $25 million here right now. This is your budget. Conversations will still take place next week. You're still able to if you. God forbid, cut our budget in half.'",
        "'speaker_1': 'We are not.'",
        "'speaker_2': 'Obligated to this $25 million per contract. So so it's it's not a scenario where we're coming before your budget talks. Our budget will still be impacted if we only have, you know, if we had $250 million to spend on these contracts and we only have 100 million in the works scope would change to around $100 million among'",
        "'speaker_2': 'these contracts. So it wouldn't change your conversations on budgets next week, would not and would impact on what work we're allowed to do. But we don't impact your compensation. So the thank you. The all of these contracts are just to make sure that that I understand and people watching understand all of these contracts.'",
        "'speaker_2': 'They're not guaranteeing the maximum amount for each vendor. So we could theoretically authorize a vendor $25 billion and give them zero. Is that right? That's correct. That's correct. And that's one of the things that Councilman Ortega has done such a great job working with us on is making sure that we're looking at the utilization of contracts and'",
        "'speaker_2': 'making sure that utilization is spread among them. So we have a report that we've been working on, and I think Councilman Ortega may have a question that's related to that. But we have a report that we're working on that will be an annual report and then also a quarterly report that will show you the utilization of the'",
        "'speaker_2': 'contracts. And most contracts are on calls. We're not able to match them out anyways just because of the amount of work that comes through during the time of the contract doesn't always meet requirements. So but we.'",
        "'speaker_1': 'We, we.'",
        "'speaker_2': 'We do have a reporting mechanism that we plan on putting in place to be able to update council more frequently. And and and thank you. I see that councilmember take his hand is raised so I will skip that part of the maybe we've and certainly I, I have questions but I believe Councilmember Ortega could probably ask them'",
        "'speaker_2': 'better with quite a bit more wisdom than I do. She's been on council a little bit longer than I have that the next contract or question I have is is allocating on call amounts to certain contracts. Well, I guess this maybe might come out kind of loaded.'",
        "'speaker_2': 'Does it disenfranchize small businesses? I mean, after all, not many small businesses can support a contract where they might get 20 million, $25 million, some might get $0 million, and yet they must be ready to go to work on Denver's call.'",
        "'speaker_2': 'Yes. And we recognize that. And again, I give kudos to Councilwoman Ortega for pointing this out, is breaking these contracts up. We hope to have a set of local contracts that are going through at the same time that are SB contract.'",
        "'speaker_2': 'These are small business enterprise contracts are on calls and they're meant to actually go towards small business enterprises. Maybe we need to be the prime on the contract is just the first time that we advertised that we didn't get much traction on it.'",
        "'speaker_2': 'We have advertised it now this month and so far we have, I believe it's six or nine that have inquired to it. So hopefully we're able to bring these to council late October, early November, and these are directly towards skis on the same type of contracts as these where they're smaller, so they're able to take up the'",
        "'speaker_2': 'capacity on their own. So that, I guess, begs one more question. I think some of these contracts and maybe they were the past contracts, but some of them of the $432 million total had been ready to come before us for a month.'",
        "'speaker_2': 'And and so we're willing to wait for a few weeks for these contracts. Why not wait until we have the small know SB contracts as well and just send in all you know, we already had close to half a billion, you know, why not a little bit more.'",
        "'speaker_2': 'You may be referring to parts of contracts here. I can't speak to that, but I will say 4 hours when they were ready to go, we moved them forward. Knowing that the SDS will be following. We placed a fact sheet with these contracts when we posted them in the two four weeks ago.'",
        "'speaker_2': 'That gives that explanation about the contracts coming to follow, and we hope to have those here by November. But again, you may be speaking to Clark, so I can't speak to there. That's totally fair. Okay. That's I guess those are the questions that I have for now.'",
        "'speaker_2': 'I know Councilmember Ortega is still in the queue and I. So Councilmember, can you just so. Thank you, Madam President.'",
        "'speaker_0': 'Sure. Thank you. Councilmember Councilmember Ortega.'",
        "'speaker_7': 'Thank you, Madam President. Jason, thanks for being on to address a couple of things and thanks for the opportunity to chat briefly this afternoon. So I appreciate the commitment and being able to say that here publicly that Daddy is committing to provide these quarterly reports to us on utilization.'",
        "'speaker_7': 'And for me, utilization isn't just about the firms that are being used. It's about looking at the data on which which contractors have a really cozy relationship with which city agencies, where we tend to utilize the same ones over and over and over.'",
        "'speaker_7': 'And a lot of people go through this process. You know, they get excited. The council finally approves their contract and some of them never get utilized and we never get to see that data. So we've been asking for the ability to look at that and the fact that you're committing to that.'",
        "'speaker_7': 'And I see you nodding your head.'",
        "'speaker_2': 'Yes, I will say it again. We are committed to a quarterly report. We will also do an annual report that is more inclusive with everything. So you have the big picture at the end of the year. And you also asked me earlier today about bond projects and funding and reports on that.'",
        "'speaker_2': 'We are committed to report on that as well. I don't know if it's going to be quarterly or twice a year, but I have gotten a commitment from the agency executive director saying we will report. It's just we have to figure out how they quantify their information to be able to give it to you.'",
        "'speaker_7': 'In a way. Well, we need to be able to look at that data so that we know which of these bond projects are actually being kept on budget. And then we're not expecting beyond the amount of money that was earmarked for the projects because we have other projects down the line that are waiting for their share.'",
        "'speaker_7': 'And if we spend it all on these projects, there's not enough money to do all the other ones. So that's.'",
        "'speaker_2': 'Exactly.'",
        "'speaker_7': 'For this body to be able to look at that information and make sure the agencies are staying within the budget of what the taxpayer approved. So I would advocate and hope my colleagues would support that. We want to see that data at a minimum on a quarterly basis.'",
        "'speaker_7': 'So if you could pass that back onto your.'",
        "'speaker_2': 'Absolutely, I'm happy to take that.'",
        "'speaker_7': 'But I think that's critical. That really covers all of it. I just want to thank you, Councilman. Thanks for calling these out and being able to continue to have this conversation. Councilman Flynn and I will be looking at bringing the ordinance before you guys shortly.'",
        "'speaker_7': 'We've got some draft language that we're just looking back and forth that before we bring it to you on some of the contracts that will come to City Council. So stay tuned and look for that soon. So thank you so much.'",
        "'speaker_7': 'Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilwoman. I wanted to check back in. Councilwoman Canete, we saw your hand raised. Are you okay? Okay. All right. Wonderful. Councilman Hines, your backup.'",
        "'speaker_2': 'Thank you, Madam President. I just wanted to make a comment. Thank you, Mr. Gallagher, for your for your comments. We have you on the record as as committing to these to these contracts. I, I like the idea of quarterly reports.'",
        "'speaker_2': 'I, I think that we do these every six months or so when we come and we get all these on call contracts, and they all are thrown at us all at the same time. I hope that six months is plenty of time for you to go back to the people, whoever you know, whoever you need to talk'",
        "'speaker_2': 'to and get these these reports in place. I know about six months ago we had a similar conversation here about about these uncle contracts. I, I hope that we are in a better place six months from now, and we don't have to talk about these again and agreement.'",
        "'speaker_2': 'I just want to reiterate that I mean that again, we don't think the executive branch will release the 21 2021 proposed budget in the morning. And we have no idea what will be in that budget, given the budget for the legislative branch of government is in the proposal and we'll learn whether our request was incorporated into the'",
        "'speaker_2': 'plan at the same time as the general public. So I get a little skittish when I see half a billion dollars or $422 million in and and it just happens to be right before the budget drop. So thank you, Daddy.'",
        "'speaker_2': 'And thank you, Madam President.'",
        "'speaker_0': 'Thank you. Councilmember Hines. Madam Secretary, roll call.'",
        "'speaker_4': 'Friends.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Cashman.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Each and. Ortega. I guess. Sandoval. I swear. Now. Torres, I. Black. I. CDEBACA Well, I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': 'One need to eyes.'",
        "'speaker_0': '12 Eyes Resolution 728 729 737 3132, 3330 435 741, 42, 43 838 839 853 864 865 866 867, eight, 68, 69, eight, 78, 71, 72 and 873 have been adopted. The next item up is Council Bill 849. Council Member State of Akure.'",
        "'speaker_0': 'Please go ahead with your question.'",
        "'speaker_4': 'Thank you, Madam President. I just wanted a quick clarification on what they mean in this bill by the HMO contributions moving to 2021. Is it just that we're waiting or what exactly does it mean? Before I dove too deep into this one for a second reading.'",
        "'speaker_0': 'All right. We've got, I believe, Chris O'Brien. He's joining us to answer questions on this one. Or also had Heather Britten.'",
        "'speaker_4': 'Hi there.'",
        "'speaker_0': 'Hi, Heather. Go ahead, please.'",
        "'speaker_4': 'This is Heather Britton, director of benefits and wellness for the Office of Human Resources. The only change that the Health Insurance Committee made this year for employee benefits was to remove a health plan that was offered by the Denver Health Medical Plan called the deductible HMO, and they replaced it with a HMO.'",
        "'speaker_4': 'And really what that means is that employees now will have lower cost at point of service for the new plan because they'll have just co-pays, no more deductibles. And the city is asking to continue with the same contribution we had for the HMO in 2020 into 2021 for the HMO.'",
        "'speaker_4': 'And it's good news or all around. It results in lower costs for the employee and out of their paycheck and when they go get service through Denver Health. Got it. Thank you very much for that. Sure.'"
    ],
    "A bill for an ordinance changing the zoning classification for 22, 24, 26 and 28 South Garfield Street in Cherry Creek. Approves an official map amendment to rezone property from PUD 470 to G-RH-3 (planned development to row house) located at 22, 24, 26 and 28 South Garfield Street in Council District 10. The Committee approved filing this item at its meeting on 6-2-20.": [
        "'speaker_0': 'All right. Thank you, Heather. The next item up is Council Bill 285. Councilmember Flynn, we need a motion to take us out of order. Please.'",
        "'speaker_5': 'Certainly, Madam President, I move that council bill 20 dash to 85 be taken out of order.'",
        "'speaker_0': 'It has been moved a second again. Thank you. Comments by members of Council on Council Bill 285. Council Member Herndon.'",
        "'speaker_1': 'Thank you. Compels at present. In order to take the action up on this item tonight, council needs to pull this item out of order since it is currently pending for September 28.'",
        "'speaker_0': 'Thank you. Councilman. Madam Secretary, roll call on taking council Bill 285. Out of order, please.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Cashman. I can eat. I. Ortega Sandoval. I. Sawyer I saw as I. Kwak I zellerbach I park I when I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': '13 eyes.'",
        "'speaker_0': '13 eyes. Council Bill 285 has been taken out of order. Councilmember Flynn, will you please put Council Bill 285 on the floor for consideration?'",
        "'speaker_5': 'I guess, Madam President, now that my clock is stop buying, I move that I move the council bill 20 to 25 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved to make it a second second. Thank you. Councilmember Herndon, your motion to postpone, please.'",
        "'speaker_1': 'Yes, Madam President. I move that final consideration of Council Bill 20 20285 with this public hearing be postponed to Monday, December seven, 2020.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. All right. We got the second there. Thank you, sir. Comments by members of Council on the Postponement of Council Bill 285, Council member Herndon.'",
        "'speaker_1': 'Bingham and President Talking Alone. Currently it was scheduled for September 28th. However, the applicant has asked for council to reschedule the public hearing to the date mentioned before Monday, December seven.'",
        "'speaker_0': 'Wonderful. Thank you, Madam Secretary. Roll call on postponing final consideration of Council Bill 285, please.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_2': 'Hi.'",
        "'speaker_4': 'Cashman. I can eat. Hi, Ortega. I Cinnabon. Hi. Sawyer. I. Torres. I. Sorry. Black. I see. Tobacco. I. Clark.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': '13 Eyes.'",
        "'speaker_0': '13 Eyes. Final consideration of Council Bill 285 with this public hearing has been postponed to Monday, December 7th. That concludes the items to be called out. All bills for introduction are ordered published. Council members remember that this is a consent or a block vote and you will need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call an item out for a separate vote. Council Member Flynn Will you please put the resolutions and proclamations for adoption and bills on final consideration for passage on the floor?'",
        "'speaker_5': 'Certainly, Madam President, I move that proclamations and resolutions be adopted and the bills on final consideration be placed upon final consideration and do pass in a bloc for the following items. All series of 2020 952 811 825 857 858 887 891 175 823 826 827 841 843 846 859 875 894 728 729 seven 3731 732 733 734'",
        "'speaker_5': '735 741 742 743 838 839 853 864 865 866 867 868, eight, 69 eight, 78, 71 eight, 72 eight, 73 eight, 83 eight, 28 eight, 58, 85, eight, 95, eight, 12. And last but not least, 819.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. It has been moved. And can I get a second? Thank you, Madam Secretary. Roll call, please.'",
        "'speaker_4': 'We did have some items in there that were included that were already voted on, but they were already passed as well.'",
        "'speaker_0': 'So I saw that I was going to ask you how you wanted us to handle that, but I doubt you want us to go back through and read it again.'",
        "'speaker_5': 'I was only reading it was only reading what was before me.'",
        "'speaker_1': 'Thank you.'",
        "'speaker_4': 'Black. Hi. CdeBaca. I look back.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'Hi.'",
        "'speaker_4': 'Brendan.'",
        "'speaker_1': 'Hi.'",
        "'speaker_4': 'Hi. Cashman. I can reach i. Ortega. I. Sandoval. I. Sawyer. I. Torres, I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, closed the voting and announced results.'",
        "'speaker_4': '13.'",
        "'speaker_0': '13. Eyes. The resolutions and proclamations have been adopted and the bills have been placed upon final consideration and do pass the pre recess announcement. Tonight, we have required public hearing on Council Bill 711, changing the zoning classification for 25, 35 and 2545 East Astbury Avenue in University Park.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2535 - 2545 East Asbury Avenue in University Park. Approves an official map amendment to rezone property from PUD 278 to E-MU-2.5 (planned development to multi-unit), located at 2535-2545 East Asbury Avenue in Council District 6. The Committee approved filing this item at its meeting on 8-4-20.": [
        "'speaker_0': 'One public hearing tonight. Speakers should begin their remarks by telling council their names and cities of residents and if they feel comfortable doing so, their home addresses when called upon. Please wait until our meeting hosts promote you to speaker.'",
        "'speaker_0': 'When you were promoted, your screen will flash and say Reconnecting to meeting. Please do not leave the meeting. You will be reconnected and will need to turn on your camera if you have one. And your microphone. If you've signed up to answer questions, only state your name and note that you will be available for questions of counsel'",
        "'speaker_0': '. Speakers will have 3 minutes. There's no yielding of time. You'll see your time flash on the screen when you have 30 seconds left. Speakers must stay on the topic of the hearing and must direct their comments to the council members.'",
        "'speaker_0': 'Please refrain from profane or obscene speech. Direct your comments to council as a whole and please refrain from individual or personal attacks. We have a public hearing on Bill 711. It's a bill for an ordinance changing the zoning classification for 2535 through 2545 East Ashbury Avenue in University Park.'",
        "'speaker_0': 'Councilmember Flynn, would you please put Council Bill 711 on the floor for passage, please?'",
        "'speaker_5': 'Certainly, Madam President, I move that council bill 2711 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded the required public hearing for Council Bill 20 dash zero 711 is open. May we please have the staff report?'",
        "'speaker_2': 'Good evening. Council President Gilmore, members of Council Jason Morrison with Community Planning and Development. The rezoning in front of you this evening is 25, 35, 25, 45 East Asbury Avenue. The request is from Puti to 78, which is an old code PED to EMU two and 2.5, which is urban edge multi-unit district up to two and a'",
        "'speaker_2': 'half storeys. We are in Council District six. So South Denver. In the University Park neighborhood. And the subject site is on the corner of East Asbury Avenue and South Clayton Street. It consists of one multi-unit apartment building and one single unit building for a maximum number of 21 dwelling units with a maximum height of two stories and'",
        "'speaker_2': '20 feet. Maximum height. The property owner is requesting a rezoning to correct a discrepancy between the number of dwelling units permitted by the RD, which is 21 units, and the actual number of units in the development, which is 23 units.'",
        "'speaker_2': 'The discrepancy was discovered after the property owner purchased the property and requested a zoning letter from the city as part of real estate due diligence. The letter indicated that the existing improvements on the property were not in conformance with the zoning established by P up to 78 and that a rezoning would be needed to correct this noncompliance'",
        "'speaker_2': 'issue. As I said, the current zoning is a former Chapter 59 students party to 78. The site is adjacent to zoning of Eastside to the north and east and adjacent to UTC to the South and GMU three to the west.'",
        "'speaker_2': 'Digging a little deeper into Puti to 78 PDT 78 is a former Chapter 59 custom zoned district that allows for one multi-unit building and one single unit building for a maximum number of 21 units with a maximum height of two stories and 20 feet maximum height.'",
        "'speaker_2': 'Within the Pudi maximum building coverage, including garages and accessory structures, can't exceed 24%. Front, rear and side setbacks are specified within the pad, and permitted encroachments into the maximum setbacks must conform to those allowed in the former chuck 59 hour three zone district.'",
        "'speaker_2': 'And that's a multi-unit dwelling, high density zoned district. The site is currently occupied by multi-unit residential. Surrounding uses include multi-unit residential, two unit residential and single unit residential. And here's a bird's eye view of the subject property. And we're looking north in this image.'",
        "'speaker_2': 'You can see East Asbury Avenue to the bottom of the property and South Clayton Street, just to the right of the property. And these five images are some of the multi-unit two unit and single unit residential adjacent and nearby the subject site.'",
        "'speaker_2': 'The maximum application was unanimously recommended for approval by Planning Board in July and before by committee back in August. Since the staff report was published, we received one letter and support from the University Park Community Council. Two letters of support from area residents and two letters in opposition from residents concerned about limited parking.'",
        "'speaker_2': 'Falling home values and increased density. As you know, there are five review criteria when analyzing the appropriateness of a request, and I'll start with consistency with adopted plans. In addition to comprehensive Plan 2040 and Blueprint Denver, there is one neighborhood plan and that is the University Park Neighborhood Plan from 2007.'",
        "'speaker_2': 'But first of all, look at comp plan 2040. The proposed MAP amendment is consistent with several strategies from Comprehensive Plan 2040 listed here and also detailed in your staff report. Specifically, the request is consistent with strategies under the equity vision element because it will enable development of housing units close to transit and mixed use developments.'",
        "'speaker_2': 'It will also create a greater mix of housing options in the University Park neighborhood. The request is also consistent with strategies under the environmentally resilient vision element for several reasons. The site is an infill location where infrastructure is already in place, and furthermore, the proposal focuses growth near existing bus routes, servicing high capacity transit along University Boulevard'",
        "'speaker_2': ', Evans Avenue to the South and Interstate 25 to the north. When looking at blueprint Denver context, the requested rezoning as showed on the context map is urban edge. The requested EMU 2.5 zone district is consistent with the future context that is mapped in this area.'",
        "'speaker_2': 'When looking at future place within Blueprint Denver The future place of this area is low, which is predominantly single and two unit uses on small or medium lots. Buildings are generally up to two and a half storeys in height.'",
        "'speaker_2': 'The residential emphasis and the 2 to 2 and a half storey height maximums of the proposed EMU 2.5 zone district are consistent with this plan direction. However, the EMU 2.5 Zone District is a multi-unit district with a variety of residential building forms, including single two unit and low scale multi-unit residential.'",
        "'speaker_2': 'Blueprint Denver acknowledges that since the future place map in the city is a citywide map, the boundaries of the map should be interpreted with limited flexibility, especially at the edges, if the request furthers the goals of Blueprint Denver as depicted in the map in front of you.'",
        "'speaker_2': 'The residential alley serving South Clayton Street and South Combined Street acts as the dividing edge between the low residential and low medium residential classification. This rezoning request also furthers many of the goals and blueprint Denver via the following policies encouraging high density development and transit rich areas.'",
        "'speaker_2': 'Rezoning properties from former Chapter 59 zoning. Diversifying housing options by exploring opportunities to integrate missing middle housing into low residential areas and incentivizing the preservation of structures that contribute to the already established character of an area. Furthermore, the creation of the excuse me furthermore the creation of 8278 in the 1990s and able to small scale multi-unit use'",
        "'speaker_2': 'at this location and a transition to the EMU 2.5 zone district will not disrupt the existing character along East Asbury Avenue. Therefore, the request to EMU 2.5 is consistent with the overall intent of the future. Places MAP and staff finds that the EMU 2.5 zone district is the closest district available that balances plan direction and the existing'",
        "'speaker_2': 'condition. And finally, within Blueprint Denver, I'm looking at the growth strategy. The request is also consistent with Blueprint's growth strategy, which maps this area as all other areas of the city. These areas are anticipated to see 20% of new housing growth and 10% of new employment growth by 2040.'",
        "'speaker_2': 'And finally, looking at the University Park Neighborhood Plan from 2007, general recommendations from the plan include creating a community that accommodates a wide variety of uses. This is done by respecting the urban design and the architectural character of established and preferred residential forms and providing a diverse mix of housing types near transit amenities.'",
        "'speaker_2': 'The subject site is located in a single family residential neighborhood sub area, which is characterized as having predominantly single family homes and occasional duplexes interspersed. Buildings of one or two stories and height characterize the prevailing degree of development, and any higher intensity buildings should help form a transition between the prevailing neighborhood pattern and an activity center.'",
        "'speaker_2': 'Staff finds that the request is consistent with both the general and suburb recommendations because the previously established small scale multi-unit use will continue to provide an important transition between the varying neighborhood pattern of single and two unit uses to the east and south, and a higher density activity center about 3 to 5 stories along University Boulevard and'",
        "'speaker_2': 'University of Denver to the West. The proposed EMU 2.5 zone district is an appropriate zoned district on the edge of this sub area and will encourage any development that results from this rezoning to be consistent with the sub area's urban design and land use recommendations by reinforcing residential character and maintaining the established scale of the primary building'",
        "'speaker_2': 'forms. The proposed rezoning will result in uniform application of zoned district building for use and design regulations. It will also further the public health, safety and welfare by implementing adopted plans, as well as providing additional housing units that are compatible with the University Park neighborhood and the adoption of the Denver Zoning Code in 2010 and the retention'",
        "'speaker_2': 'of a former Chapter 59 zone district. On the subject, property, including custom zoning, is an appropriate justifying circumstance for this proposed rezoning. The requested EMEA 2.5 zone district is consistent with the neighborhood context description, zone district, purpose and intent and staff.'",
        "'speaker_2': 'Fine's staff recommends approval based on the finding that all review criteria have been met. Thank you. Council President Gilmore.'",
        "'speaker_0': 'Thank you, Jason, for the staff report. Council has not received any written testimony on Council Bill 711 and we have one individual signed up to speak tonight. And we'll go ahead and maybe have you stop sharing your screen for us, Jason, and we'll thank you.'",
        "'speaker_0': 'And we'll bring up Jesse Paris. You're on mute, Jesse.'",
        "'speaker_2': 'Good evening, members of Council. My name is just a microphone and we're almost out loud. Last night I was about to commemorate the party of Colorado and Mile High Note and I will be your next mayor in 2023.'",
        "'speaker_2': 'I'm in favor of the three zoning out. So anytime that the council passing rezoning pertaining to housing I'm in favor of I just kind of question, you know what what's going to be the ammo level for. Sorry. And also, was there a traffic study done?'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Jesse. That concludes our speakers questions from members of council. Councilman Cashman. Oh, yeah. And you saw. I'm showing that you're unmuted, but we're still not. People to hear you. Not yet. Okay. Well, we might need to get Councilman Cashman to come back into the queue here and seen Councilman Flynn.'",
        "'speaker_0': 'We'll go ahead and go to your questions.'",
        "'speaker_5': 'Thank you, Madam President. While we're waiting for Councilman Cashman's audio, Jason, can you explain? One of the letters of opposition said that the current PD allows 21 units, but there are already 23 on the site, so it's in violation of the existing zoning.'",
        "'speaker_5': 'Can you explain that? Is that is that the case?'",
        "'speaker_2': 'Yes. I appreciate the question, Councilman Flynn. That is correct. So kudos to 78. Allows for up to 21 total units. And as I mentioned in the staff report and during the presentation, there was a discrepancy that was discovered after the property was purchased, that the property has been operating as 23 total units since about the mid to'",
        "'speaker_2': 'late 1990s.'",
        "'speaker_5': 'Right. But do we know how that happened? How.'",
        "'speaker_2': 'You know.'",
        "'speaker_5': 'I'm trying to get it.'",
        "'speaker_2': 'Right. Yeah. And so, unfortunately, I don't know that example. I don't know the answer to that question. I did a search in our system and I could not find an issue with with the permitting. It just, you know, something something occurred in the in the 1990s and it's been operating as 24 units ever since.'",
        "'speaker_5': 'Thank you. And, you know, under this new zone class, would how many units could be developed there? You know, and a lot of it depends on how they're configuring and what the square footage is. But what's your idea of that?'",
        "'speaker_2': 'Yeah, so I don't know the answer for sure. As you alluded to, it certainly depends on on a new construction. It is my understanding currently that the property owner has no intention to actually develop the site. It's simply to bring it into conformance.'",
        "'speaker_2': 'But if I had to venture a guess and in talking to my colleagues with Host, we had thought that it'd be about the same number of units.'",
        "'speaker_5': 'Okay. Thank you. Thank you, Madam President. I am.'",
        "'speaker_0': 'All right. Thank you, Councilman. Councilman Cashman, good to see you back, sir.'",
        "'speaker_1': 'Well, I hope you can hear me this time.'",
        "'speaker_0': 'We can?'",
        "'speaker_1': 'Well, how about that? The miracle of turning things on and off. You know, I'm in. Councilman Flynn literally took my questions right down the list, wanting to see what future. And while it I understand that it's to come into compliance wanted to be clear on on the future entitlement for that parcel it's only a third of an'",
        "'speaker_1': 'acre but still wanted to get that straight. So my questions have been answered, ma'am. Approaching.'",
        "'speaker_0': 'All right. Thank you, councilman. The public hearing for council bill 20 dash zero 711 is closed. Comments by members of Council Councilman Cashman.'",
        "'speaker_1': 'Yeah, thank you, Madam President. I believe this clearly meets the criteria we're called to to judge this application. I'm I'm confident that the it doesn't present any kind of dramatic increase in entitlement that would cause me to question.'",
        "'speaker_1': 'So I'll look forward to supporting this this evening.'",
        "'speaker_0': 'Thank you, sir. And looking at the presentation as well, it meets all the criteria. And so thank you, Jason, for joining us. Madam Secretary, roll call, please.'",
        "'speaker_4': 'Ashman. I can eat.'",
        "'speaker_0': 'She was trying to get a muted I.'",
        "'speaker_4': 'Very go yes.'",
        "'speaker_6': 'Is not clicking thank you.'",
        "'speaker_4': 'I Ortega I. Sandoval, I swear. I, Torres. I. Black. I see tobacco. I.'",
        "'speaker_2': 'Park I.'",
        "'speaker_4': 'Flynn.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Herndon.'",
        "'speaker_1': 'I.'",
        "'speaker_4': 'Hines.'",
        "'speaker_2': 'I.'",
        "'speaker_4': 'Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_4': '13 eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification for 755 Lafayette Street in Country Club.\nApproves an official map amendment to rezone property from U-SU-C to U-SU-C1 (allows for an accessory dwelling unit), located at 755 Lafayette Street in Council District 10. The Committee approved filing this item at its meeting on 8-4-20.": [
        "'speaker_0': '13 eyes. Council Bill 7-Eleven has passed. Councilmember Flynn, would you please put Council Bill seven and 16 on the floor for passage?'",
        "'speaker_5': 'Yes, Madam President, I move that council bill 20 dash 716 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved. Make it a second.'",
        "'speaker_2': 'Okay.'",
        "'speaker_0': 'Wonderful. Second comments by members of Council Councilmember Hines.'",
        "'speaker_2': 'Thank you, Madam President. Per the request of the applicant, this application is being withdrawn. So I'm asking my colleagues to vote no to defeat this bill.'",
        "'speaker_0': 'All right. Thank you, Councilman. Seen no other members? Just a reminder, council members, please vote no on this. Madam Secretary, roll call irons.'",
        "'speaker_2': 'No.'",
        "'speaker_4': 'Cashman?'",
        "'speaker_1': 'No.'",
        "'speaker_4': 'Kimmich. No Ortega. Oh. Sandoval. No. Sawyer now. Torres. No. Black? No. See the. Clark.'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'Flynn may. Herndon May.'",
        "'speaker_0': 'No. Madam Secretary, close the voting and announce the results.'",
        "'speaker_4': '12 nays.'",
        "'speaker_0': '12 nays. Counsel Bill 716 has been defeated there being no further business before this body. This meeting is adjourned.'"
    ]
}