{
    "A bill for an ordinance amending Ordinance No. 591, Series of 2021, as amended by Ordinance No. 706, Series of 2021, as amended by Ordinance No. 1145, Series of 2021, to allocate spending in the American Rescue Plan Act Grant Fund for Recovery, Revenue Loss, and Administration. Amends Ordinance No. 591, Series of 2021, previously amended by Ordinance No. 706, Series of 2021, to allocate a total of $100.1 million in spending in the American Rescue Plan Act (ARPA) Grant Fund, including $25.3 million in the Revenue Loss category to accommodate the 2022 portion of the allocation approved in Ordinance No. 706, Series of 2021 that will continue to be supported by ARPA, $73.5 million in the Recovery category, $1.3 million in the Administration spending category, which will be reallocated from unspent dollars in the initial Revenue Loss category, and approves a capital equipment purchase of a van for the Wellness Winnie program. The Committee approved filing this item at its meeting on 10-12-21.": [
        "'speaker_1': 'Thank you. I'll do a recap here. Under resolutions, no items have been called out under bills for introduction. Council member Sawyer has called out Council Bill 20 1-1192 for a vote under bills for final consideration. No items have been called out under pending.'",
        "'speaker_1': 'No items have been called out. Madam Secretary, please put the first item on our screens. And Councilmember Black, would you please put Council Bill 1192 on the floor for publication.'",
        "'speaker_2': 'Yes, I move that council bill 21-119.'",
        "'speaker_3': 'To be ordered published.'",
        "'speaker_1': 'Thank you. It has been moved and seconded comments by members of Council on Council Bill 1192. Councilmember Sawyer.'",
        "'speaker_3': 'Thanks, Madam President. I called this out this evening so I can vote no. This is the ARPA funds. First and most importantly, I want to thank the Department of Finance and host for their fantastic work over the last 18 months.'",
        "'speaker_3': 'Our city's in a solid financial position because of their leadership. And if the residents of Denver who are watching tonight don't know, you should be incredibly grateful to them. I truly, truly appreciate the thoughtful decision making process that went into allocating these funds.'",
        "'speaker_3': 'But at the end of the day, I can't support $4 million for safe outdoor spaces. Recovery Plan Act funding is meant to be for us to invest in long term solutions. And so sites are not a long term solution.'",
        "'speaker_3': 'I recognize that the value that the Colorado Village Collaborative has added to our city, but the residents of my district have made it clear that they believe housing requires a roof and a door, and therefore I will be a no tonight and next week as well.'",
        "'speaker_3': 'Thanks, Madam President.'",
        "'speaker_1': 'Thank you. Councilmember Hoyer. Councilmember Hines.'",
        "'speaker_7': 'Thank you. Council President, I. We're in a housing crisis right now. And while I don't believe that the safe outdoor space is a an appropriate long term solution, we need middle term and near term solutions. And I know that District ten hosted the first to see if outdoor spaces in our city and in the metro area, frankly'",
        "'speaker_7': '. And we received more than a thousand emails in opposition to to the safe outdoor spaces before they opened. But since they opened, once they opened, they were transformative. We had zero calls, the police department. We had people who moved out of homelessness, out of street homelessness, up the spectrum into housing.'",
        "'speaker_7': 'We had people who got doctor and dental services for the first time in a long time. And the neighbors also found that it was totally unlike the unsanctioned encampments that were that continue to plague all of areas in our city, but particularly in District ten.'",
        "'speaker_7': 'So I think that the safe outdoor spaces are an amazing option that we've added to our tool belt here in the city. Before this piece of our sites opened, we had no solution for people who wanted to stay with their partners, no solution for people who wanted to stay with their their pets.'",
        "'speaker_7': 'And I don't know if I didn't have anything, if all I did was sleep on the street and I had a dog. I would not let that dog go. Just to. Get into a shelter. Sorry. So I think that the NSA websites are transformative, and I'm excited that there's $4 million set aside for its sites.'",
        "'speaker_7': 'Thank you.'",
        "'speaker_1': 'Thank you. Councilmember Hines. Seeing other folks in the queue. Madam Secretary, roll call on Council Bill 20 1-1192, please.'",
        "'speaker_2': 'Sandoval. I. Sawyer? No. Torres, I. Black. I see tobacco. I Clark. Eye for an.'",
        "'speaker_0': 'Eye.'",
        "'speaker_2': 'Herndon, Hines. Cashman Canete, i. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '11 Ies one name.'",
        "'speaker_1': '11 ies council bill 20 1-119 to has been ordered published. That concludes the items to be called out. All other bills for introduction are ordered published. Council members remember this as a consent or block vote and you will need to vote.'",
        "'speaker_1': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Black, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_2': 'I move that resolutions be adopted and bills on final consideration be placed upon final consideration, and do pass in a block.'",
        "'speaker_3': 'For the following items. All Series 21.'",
        "'speaker_2': '1204 1217.'",
        "'speaker_3': '1218 1178.'",
        "'speaker_2': '1191 1201 1203 1208 1214 1215 1211.'",
        "'speaker_5': '1216 1181.'",
        "'speaker_2': '1234 1147 1159.'",
        "'speaker_5': '1160.'",
        "'speaker_2': '1161 1162 1163 1164, 1165, 1166, 1167, 1168, 1169 1170 1171. 1172 1173. 1174 1175. And that's it.'",
        "'speaker_1': 'Thank you. You've got it. It has been moved and seconded. Madam Secretary, roll call, please.'",
        "'speaker_2': 'Sandoval. I. Black. I see tobacco. I Clark. I swim. I turned in Hines Cashman.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Kenny. I. Sawyer. I. Torres. I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': '12 eyes.'",
        "'speaker_1': '12 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Our pre recess announcement this evening. Tonight there will be a required public hearing on Council Bill 20 1-1020, changing the zoning classification for 250125152531 North Ogden Street in five points.'"
    ],
    "A bill for an ordinance changing the zoning classification for 2501, 2515, 2531 North Ogden Street in Five Points. Approves a map amendment to rezone property from PUD 25 to U-SU-A1 UO-3 (planned development to urban single-unit with accessory dwelling unit), located at 2501, 2515 and 2531 North Ogden Street in Council District 9. The Committee approved filing this item at its meeting on 9-14-21.": [
        "'speaker_1': 'Direct your comments to council as a whole and please refrain from individual or personal attacks. Councilmember Black, would you please put Council Bill 1020 on the floor for final passage?'",
        "'speaker_2': 'Yes. Council President. I move that council build 21-1020 will be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved and seconded and I'd also like to take a moment and welcome council member Ortega to the meeting this evening. The required public hearing for council Bill 1020 is open. May we please have the staff report?'",
        "'speaker_1': 'And we've got Andrew Webb here. We haven't seen you in a while.'",
        "'speaker_7': 'We have not. Yes. Thank you. Nice to see you all in person. Again, Andrew Web Community Planning and Development. Does that slide look like you would expect it to on from your review?'",
        "'speaker_1': 'It should be. Yep. You got it.'",
        "'speaker_7': 'Great. Great. Well, I'm here this evening to present this proposed rezoning of properties at 2501, 25, 15 and 2531 North Ogden Street from the current PWD 25 to Usou a103 And I'll explain a little bit more about what that is here in a few slides.'",
        "'speaker_7': 'This property is in Council District nine, represented by Councilmember CdeBaca. It is in the Five Points neighborhood. The proposed zone district. Here is the zone in the urban neighborhood context. It's a single unit zone district. So it would allow single unit detached homes.'",
        "'speaker_7': 'And they're also proposing to apply the you o three or use overlay three. That is the historic structure use overlay in order to make this property essentially have the same zoning as all of the surrounding properties. That zone district allows urban houses and detached accessory dwelling units in the rear yard with a minimum zone lot area of'",
        "'speaker_7': '3000 square feet. The subject property is just a little over half an acre and this request is to allow the development of eight single unit houses on this site, which is currently the site of a mortuary. So again, the former the current zoning is a PD 25 that is a planned unit development or custom zoned district for'",
        "'speaker_7': 'a former Chapter 59 or the old zoning code. The surrounding zoning of comparable properties to the east and west is usou a one you oh three the same district that's being requested here to the south along 25th Avenue where the zoning is.'",
        "'speaker_7': 'You are age 2.5 and to the north there is a park that has OSA zoning. So again, the existing zone district dispute 25 is based on the R four zone district from former Chapter 59 and it allows a mortuary use and the mortuary use is planning to move to a different location.'",
        "'speaker_7': 'So our data shows the current use for the site as industrial and surface parking and then the surrounding uses are residential. There's also a small church right across the street and then a park to the north. The next couple of slides show some of the existing development on and surrounding the property there.'",
        "'speaker_7': 'At the top right of the slide is the existing mortuary on this property and then the center photo there on the right hand side is residential uses directly across the street and the small church. And then at the bottom there is a townhouse development.'",
        "'speaker_7': 'On 25th, the slide shows the park to the direct north of the property and then single unit development directly west of the property across the alley. So this property went to a planning board on September 1st and received a recommendation of approval.'",
        "'speaker_7': 'It was moved forward by the Luti committee on September 14th. Public outreach included both of the registered neighborhood organizations representing this area, as well as direct neighbors and staff, has received written comments in support of this proposed rezoning from one neighbor and from the old San Rafael neighborhood organization.'",
        "'speaker_7': 'As you're aware, to approve a rezoning, the City Council must find that the proposal meets these terms consistent with these five criteria from the Denver zoning code. With regard to the first criterion, there are three plans that impact this site.'",
        "'speaker_7': 'Of course, the comprehensive plan and blueprint, Denver, as well as the Northeast Downtown Neighborhood Plan. This proposal would forward multiple goals in the comprehensive plan, including allowing new opportunities for residential uses, near mixed use and transit serve areas such as those found nearby on Welton Street.'",
        "'speaker_7': 'It is consistent with the context recommendation of Blueprint Denver, which does identify this area as within the urban neighborhood context. It is identified with a future place type in blueprint of residential low. So that is predominantly single unit houses and access and accessory dwelling units.'",
        "'speaker_7': 'The streets that serve the site are are local or on designated streets, and it is within the all other areas of the city growth area and blueprint, which is the area where we we expect some new growth but the least amount of growth moving into the future.'",
        "'speaker_7': 'The Northeast Downtown Area plan adopted in 2011 identifies the site for single family residential uses and identifies accessory dwelling units as appropriate in this location as well. With regard to uniformity of district regulations. This would establish the same regulations that would be found in any other area of the city with the you assume a103 zone district and'",
        "'speaker_7': 'it would further the public health, safety and welfare primarily by the implementation of our adopted plans like Blueprint in the Northeast Downtown Area Plan. With regard to justifying circumstances, the applicant cited the the existence on the site currently a former Chapter 59 zoning.'",
        "'speaker_7': 'And we also note that there has been a lot of new developments such as new mixed use on Welton Street, just a couple of blocks to the northwest. And finally, this request is consistent with the neighborhood context and zone district purpose and intent of the urban neighborhoods single unit, A1 Zone District.'",
        "'speaker_7': 'So with that, based on our finding that all the criteria have been met, staff recommends that the City Council adopt or approve application. 2020 1i0008.'",
        "'speaker_1': 'Thank you. All right. Thank you very much, Andrew. And we have. Let me see. Here are six speakers this evening for Council Bill 1020. And we're going to go ahead and start with Clay Amon in chambers.'",
        "'speaker_0': 'I had intended to just sign up for the question and answer and to use the word answers or the answers needed on behalf of the applicant. So I.'",
        "'speaker_2': 'Thought.'",
        "'speaker_1': 'Okay, great. Do you want to introduce yourself? I know I called your name, but go ahead and introduce yourself. And if you're representing them.'",
        "'speaker_2': 'Sure.'",
        "'speaker_0': 'My name is Clay. I'm in representing the applicant and I'm.'",
        "'speaker_6': 'Also joined by Bruce O'Donnell and not.'",
        "'speaker_7': 'Only it from my.'",
        "'speaker_2': 'Office.'",
        "'speaker_1': 'All right. Great. Thank you. Our next speaker this evening is David Hagen here in chambers, and then he'll be followed by Bruce O'Donnell.'",
        "'speaker_0': 'Thank you, counsel. My name is David Hagan. I would like to say that this should pass.'",
        "'speaker_7': 'Just think about 15.'",
        "'speaker_0': 'Amendments we just went over. Didn't. They should have passed two.'",
        "'speaker_7': 'But the white people are racist in that.'",
        "'speaker_0': 'I don't know. Maybe the black and brown people should apologize to their their community because that was fricking disgusting. Disgusting. Y'all should be ashamed of yourselves. Hines, come on now. Turn in your DSA membership.'",
        "'speaker_1': 'Speak directly to council members. All right, we'll go ahead. And our next speaker is Bruce O'Donnell.'",
        "'speaker_7': 'Good evening. Madam President, members of council, I am Bruce O'Donnell, 386 Emmerson Street in Denver. And it's nice to be here and see all of you in person this evening.'",
        "'speaker_0': 'So unusual. I'm out of practice.'",
        "'speaker_7': 'I just want to reiterate that there's tremendous plan support for this rezoning and there's a CPD recommendation of approval, planning board recommendation of approval and an R.A. letter of support. We have a good neighbor agreement with the R.A., which my colleague in a minute will explain some of the details.'",
        "'speaker_7': 'And the bottom line is, is a single unit zoned district is the only zoned district that has plan support and CPD support and also community support. In the last couple of years, there's been five prior attempts to raise on this property for slightly more density and none of them worked.'",
        "'speaker_7': 'And so we're delighted to have single unit zoning, which mirrors the surrounding zoning and is the way to put this property back to productive use. With that, I request the Council vote to approve Council Bill 21, Dash 1020, rezoning 2501, 25, 15 and 2531.'",
        "'speaker_7': 'North Ogden to you as one. Thank you. And I'm available to answer questions. Should members of council have any?'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Our next speaker this evening is in chambers. Natalie sat.'",
        "'speaker_2': 'Good evening, counsel.'",
        "'speaker_3': 'Thank you for having me here. My name is Natalie. I live at 633 Pearl Street, and I am a development associate with Highland Development Company, the applicant for this rezoning. When we first started looking at this site, we encountered that there had been several failed rezonings and part of that was due due to a lack of plan'",
        "'speaker_3': 'support. And so when we looked at the plans, we knew right away that single family was the only thing that could be supported. And when we looked at the context of the neighborhood, it was the only thing that was appropriate.'",
        "'speaker_3': 'Another piece of the failure was due to a lack of neighborhood support. So in March, we started reaching out to Old San Rafael neighborhood organization and talked about things like building form, building height materials with the roofs we pitched were flat.'",
        "'speaker_3': 'A neighborhood representative also hosted us on a walking tour to point out some subtle details like how the porches are deep and you can look up and down the block and see your neighbors or how there are other subtle variations and very similar homes that create a very distinct rhythm in this neighborhood.'",
        "'speaker_3': 'And so we use all of this design feedback to inform our very conceptual designs, which, while they may change slightly, are indicative of what we would like to do when we build these 6 to 8 single family homes here.'",
        "'speaker_3': 'And it was also a big part of our good neighborhood agreement to solidify that trust and to set standards around things like height and material and porch proportions. So we feel that, you know, through these meetings, through some direct outreach to our neighbors on Ogden, we have gained the neighborhood's trust and been good neighbors ourselves.'",
        "'speaker_3': 'And with that said, I'm available for any questions if you have them. And I would request that you vote to approve Council Bill 20 1-1020 to rezone 2501, 2515 and 2531 Ogden to USC to A1.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker, our next two speakers are joining us online. Our first speaker is Tess Dougherty.'",
        "'speaker_3': 'I can tell my name is sturdy and I live in District nine. In in 2020. In June 2020, in the wake of George Floyd's murder and the protests that followed here in Denver, Colorado. Stacy, Stacy Gilman, I'm not speaking to you directly.'",
        "'speaker_3': 'I'm just talking about a time that you were. That is about you. So it's this is not a direct I'm not directly addressing you here. There is a quote. There is I quote exactly her words. We need to see significant changes in the Denver Police Department's budget and how we're going to reinvest back into our neighborhoods.'",
        "'speaker_3': 'I'm just curious when we're doing rezonings, when we're doing amendments to the budget, how those words were said about a year ago, a little over a year ago, and yet there wasn't a single amendment from anyone other than Councilwoman CdeBaca.'",
        "'speaker_3': 'And she received notice of please from the.'",
        "'speaker_1': 'Bill that we're talking about tonight. It's a rezoning. We're not talking about the mayor's 2022 proposed budget. And so we're talking about a rezoning on North Ogden Street in five points. And so if you can please address that bill, we'd appreciate it.'",
        "'speaker_3': 'Sure. Stacie, if you could please address your words that you said last summer. We would really appreciate that, too. So, you know, again, if we're not speaking of accountable, this is one way that we can hold you accountable using your words.'",
        "'speaker_1': 'Thank you. Go ahead. And we're asking you to please speak again on the rezoning for 2501, 25, 15 and 2531 North Ogden Street, please.'",
        "'speaker_3': 'Okay. That's really all I have to say. I would just like to say that we would really like for you all to speak to your actions and words from last year that you said. And none of you have lived up to it except for Kewanee native.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'All right. We're going to go ahead and move on to our last speaker for this public hearing, Jessie Parris, who is joining us online as well.'",
        "'speaker_7': 'Yes. Good evening. Members of council, those watching at home. My name is Justice. With some personal opposition for black sites, a move for self defense, positive action, command for social change was the Unity Party of Colorado, a front of black males?'",
        "'speaker_7': 'And I'll be the next in 2023. And I reside in District eight. And Christopher heard this district. I'm in favor of this is on. And I just wanted to echo what the previous speakers have said. This was appalling that you guys did not implement the amendments, but I'm a stick on the topic.'",
        "'speaker_7': 'At hand, which is the reasoning for the most. Mostly I'm sad to see the mortuary go thing. I've been to many funerals there throughout the years and I'm sad to see that is gone, but I'm happy to hear that it's going to be replaced with housing.'",
        "'speaker_7': 'Now, my question is, is it going to be housing that people can actually afford? Or is it going to be a market rate house? So the occupant to answer that question, I would greatly appreciate it. And it meets all five of the criteria.'",
        "'speaker_7': 'So I see no reason why I will not be passing to my.'",
        "'speaker_0': 'Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers this evening. Questions for members of Council on Council Bill 1020. All right. And looks like we don't have any questions from members of council. The public hearing is closed. Comments by members of Council on Council Bill 1020.'",
        "'speaker_1': 'Council Member CdeBaca Thank you.'",
        "'speaker_5': 'This is consistent with the neighbor, with the surrounding units. I don't have a problem with this. It is a big parcel, so very curious to see it turned into one single family home. But it is what it is.'",
        "'speaker_5': 'It's consistent. So thank you.'",
        "'speaker_1': 'Thank you, Councilmember CdeBaca. Next up, we've got Councilmember Kimmich.'",
        "'speaker_3': 'Thank you, Madam President. Unfortunately, I had to step out for a little emergency. I was unable to observe the hearing, so I will need to abstain because I don't have the.'",
        "'speaker_1': 'Appropriate.'",
        "'speaker_3': 'Background to be able to vote on the measure. I apologize. Thank you.'",
        "'speaker_1': 'All right. Thank you for letting us know. Council member can reach seeing no other comments by members of council. Madam Secretary, roll call on Council. Bill 1020, please.'",
        "'speaker_2': 'Ortega. I. CdeBaca, I.'",
        "'speaker_0': 'Clark, I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Herndon.'",
        "'speaker_7': 'I.'",
        "'speaker_2': 'I'm right. Cashman I can each obtain. Sawyer, I. Torres, I. Black I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_2': 'One Abstention.'"
    ],
    "A bill for an ordinance changing the zoning classification for 600 South Canosa Court in Athmar Park. Approves a map amendment to rezone property from E-SU-Dx to E-SU-D1x (allows for an accessory dwelling unit), located at 600 South Canosa Court in Council District 7. The Committee approved filing this item at its meeting on 9-21-21.": [
        "'speaker_1': '11 I's 11 I's Council Bill 20 1-1020 has passed. Thank you, Andrew, and the community members who joined us. Councilmember Black, will you please put Council Bill 1052 on the floor for final passage?'",
        "'speaker_2': 'Yes, Madam President. But I one your final. Well, thank you. I think you make listen. I'll get you that up until.'",
        "'speaker_3': 'I move that bill. 20 1-105 to be placed on the floor.'",
        "'speaker_1': 'All right. We're going to place that on final consideration and do pass. It's been moved and seconded. The required public hearing for Council Bill 1052 is open. And I see we have Livvy here. Yes. Hi, Libby.'",
        "'speaker_2': 'Go ahead.'",
        "'speaker_3': 'Arthur. Thank you. Libby Adams with community planning and Development. And I'll be presenting the MAP Amendment for 600 South Canosa Court. So this application is located in Council District seven and Councilmember Clarke's district in the Asmara Park neighborhood.'",
        "'speaker_3': 'The property is located at the southeast corner of South Canosa Court and Center Avenue, and the applicant is requesting to rezone from urban or from urban edge single unit rd one or sorry X to urban single urban ed single unit d1x to allow an accessory dwelling unit.'",
        "'speaker_3': 'So as stated previously, this property is zoned ESU d x as is all of the surrounding area, and that allows for the urban house and suburban house primary building forms. The site is currently occupied by a single unit home.'",
        "'speaker_3': 'And again, you can see this is a largely single unit area. And this slide shows the the very residential nature of this area. A postcard notifying neighboring property owners was sent out within 200 feet of the site on July eight and then on September 1st.'",
        "'speaker_3': 'This went to planning board where they unanimously recommended approval on the consent agenda. And then we have received one letter in support from a neighboring property owner. The Denver zoning code has five review criteria that must be met for a rezoning to be approved.'",
        "'speaker_3': 'The first criterion is consistency with adaptive plans, and there are three adopted plans that are applicable to this site. So this rezoning meets the equity and climate goals and the comprehensive plan because it will create a greater mix of housing options in this largely single unit area and promote infill development where there are already services in place'",
        "'speaker_3': '. And Blueprint. Denver The future neighborhood context is urban edge. So these areas are a mix of urban and suburban contexts, but they're mostly single and two unit residential uses. And then Blue Print identifies this property as the low residential place type.'",
        "'speaker_3': 'So these are mostly single unit uses and accessory dwelling units are appropriate. And then both Canosa Court and Center Avenue are local streets, which are mostly characterized by residential uses consistent with the request. The Growth Area Strategy and blueprint.'",
        "'speaker_3': 'Denver is all other areas of the city. This is where we anticipate to see 10% of new jobs and 20% of new housing by 2040. So allowing an accessory dwelling unit would be consistent with this housing growth as it would allow for a limited increase in density.'",
        "'speaker_3': 'And then blueprint also includes specific policy recommendations. So land use and built form housing Policy four recommends allowing adus in all residential neighborhoods, especially on individual sites such as this one. And then the Asthma Park neighborhood perimeter plan is also applicable to this area, and that talks a lot about maintaining the existing single and two unit zoning'",
        "'speaker_3': 'in the area. This says are one and our two since this this plan was when the old code was in place. But this rezoning would still maintain that single unit character because ESU, D1 one X is a district within our single unit within the Denver zoning code.'",
        "'speaker_3': 'Staff also finds it meets the next two criteria. It will result in uniformity of district regulations, and it will further the public health, safety and welfare by implementing our adopted plans and providing a new housing unit in a largely single unit area.'",
        "'speaker_3': 'And then there's also a justifying circumstance in the new guidance and blueprint Denver allowing accessory dwelling units throughout all of our residential areas. And then lastly, the rezoning is consistent with the urban edge neighborhood context. The purpose of the residential districts and then the specific intent of the ESU, D1 zoned district.'",
        "'speaker_3': 'So finding all of your criteria have been met. Staff recommends approval, and that concludes my presentation.'",
        "'speaker_1': 'All right. Very good. Thank you, Libby. We have two individuals signed up to speak this evening on this rezoning. Both are joining us online. And we're going to go ahead and start with Andrew Grant.'",
        "'speaker_8': 'Hello, counsel. My name is Andrew Grant. I live at 600 South Quarter and I wanted to make myself available for any questions that you have regarding my request.'",
        "'speaker_1': 'All right, great. Thank you, Andrew, for joining us. Our second speaker for this rezoning hearing is Jesse Perez joining us online as well.'",
        "'speaker_7': 'Yes, good evening. Members of council, those watching at home just to listen to some of my present for black summer for self defense positive asking myself the same. This was a unity party line black nose. And I'll be there next November 20, 23.'",
        "'speaker_7': 'I'm in favor of this rezoning tonight. In regards to the EU. I support the support the City Council at large in 2019. I still continue to support them in 2021. The ministry dwelling units all over the city, all over every single district.'",
        "'speaker_7': 'So any time that there is a rezoning for accessory dwelling unit, I'm in favor of it. So I'm in favor of this one as well. Thank you.'",
        "'speaker_1': 'Thank you. That concludes our speakers questions from members of Council on Council Bill 1052. All right. It doesn't look like we have any questions by members of council. The public hearing is closed. Comments by members of Council on Council Bill 105 to Council Member Clark.'",
        "'speaker_0': 'Thank you, Madam President. I just want to say thank you, Louis, for the great presentation for all the work on this. This, I think, clearly meets the criteria as demonstrated in the report, and I will be supporting it.'",
        "'speaker_0': 'Also just point out that there's a lot of interest in this in our park in Valverde, and somebody has helped launch a process with some informational meetings going on right now to see if this is something that would be appropriate to do.'",
        "'speaker_0': 'Neighborhood Wide. So stay tuned for both of those neighborhoods as they go through the process of looking at that. Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Council Member Clarke, and happy to support this one tonight as well. Not seen any other comments by our colleagues. Madam Secretary, roll call on Council Bill 1052, please.'",
        "'speaker_2': 'Ortega. I. I. Clark.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_0': 'All right.'",
        "'speaker_2': 'Herndon. HINES.'",
        "'speaker_7': 'All right.'",
        "'speaker_2': 'Cashmere. I can eat. I. Sawyer, I. Torres, I. Black. I see the. I. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_2': '12 US.'"
    ],
    "A bill for an ordinance changing the zoning classification for 50 South Steele Street in Cherry Creek. Approves a map amendment to rezone property from C-MX-8 to C-MX-12 (extends mixed-use from 8 to 12 stories), located at 50 South Steele Street in Council District 10. The Committee approved filing this item at its meeting on 9-21-21.": [
        "'speaker_1': '12 I's Council Build 20 1-105 to has passed. Thank you, Libby, and our speakers who joined us. Councilmember Black, will you please put council Bill 1071 on the floor for final passage?'",
        "'speaker_2': 'I move that.'",
        "'speaker_3': 'Council bill 21 and.'",
        "'speaker_2': '71 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has been moved. May we get a second? Thank you. The required public hearing for Council Bill 1071 is open and I see we have Fran here with us. So we'll go ahead and go with the staff report.'",
        "'speaker_9': 'Perfect. Thank you. Good afternoon, members of City Council. My name is Fran Beneficial Associate City Planner with Planning Services. And today we will be looking at the rezoning request for 50 South Steel Street. The subject property is in Council District ten, represented by Councilman Hines.'",
        "'speaker_9': 'In the Cherry Creek neighborhood. The subject property is located between Ellsworth Avenue and Bayard Avenue along South Steel Street. The site is about 1.4 acres and currently contains some ten story office structure. Built in 1973, with a garden level and approximately a thousand square feet, parking consisted of one level at great parking and two levels of below'",
        "'speaker_9': 'grade parking. The applicant is requesting to resign from CMCs 8 to 12 to facilitate mixed use redevelopment of the site. And there are tentative plans to build a mixed use building with ground floor retail and residential units above.'",
        "'speaker_9': 'The existing Sony IMX eight surrounding Sony includes the IMX five directly to enforce Jim U 1203 to the East Open space parking, public parks to the south and B3 to the west, where the shopping center is located. The existing existing CRM.'",
        "'speaker_9': 'X8 is very similar to the CRM X12 in that they both allow for the townhouse general and shopfront building forms. The minimum parking street setback is zero feet, except the townhouse building form, which is has a ten foot minimum primary street setback.'",
        "'speaker_9': 'Surface parking is not allowed between the building on the primary and side streets. Multi-unit dwelling required 0.75 parking spaces per unit are seen on the table, and the main difference between CRM, X12 and see mix eight is the height it allows for a 12 storeys or 150 feet.'",
        "'speaker_9': 'The current land use for the site is office use and the immediate vicinity of the area's land use are multi-unit residential. Other office uses commercial retail and some parking uses. You can also see the the corner of school and first avenue.'",
        "'speaker_9': 'There is some mixed use development, just like the one proposed here. Shown on these photos. The ten story structure currently on the site is located just across the street from the Cherry Creek Shopping Center parking lot north of the site.'",
        "'speaker_9': 'There is a two story office building and south of the site there is a public park with some tennis courts. He stood beside the 214 story multi-unit residential buildings with a ground level parking lot in between them. And then also just a block north of the corner of steel.'",
        "'speaker_9': 'And first. There is a total sturdy, mixed use building. Concurrent with the rezoning, the applicant has entered into a voluntary, affordable housing agreement with host. The terms of the agreement are the 12.5% of the all residential units will be dedicated as income restricted units for 99 years.'",
        "'speaker_9': 'Of those income restricted units 100% shall serve household earning up to 80%. The applicant has committed that at least 25% of all income residential units. We'll have two or more bedrooms. Throughout the rezoning process. Application modifications are being provided according to code requirements.'",
        "'speaker_9': 'Planning Board recommended approval unanimously on September 15th. Stub received a position statement from Cherry Creek East Association where they explained that the majority of Cherry Creek East constituents voted in opposition to the proposed rezoning for 50 South Steel Strip from the 8 to 12 stories based on a survey provided by the R.A. the survey.'",
        "'speaker_9': 'The survey results were shared with District ten and CPD and attached to Stuff Report. In their letter, Kia cites its role as an R.A. to communicate to the planning board and City Council how its constituents feel. The KIA Board voted unanimously to recommend that council oppose the rezoning.'",
        "'speaker_9': 'However, the letter goes on to note that the R.A. and the developer agreed that it is in the best interests of both parties to have a sign agreement covering the development and its construction. The letter described the applicant's willingness to enter into the agreement despite the unfavorable CC vote as a sign of good faith towards the community'",
        "'speaker_9': '. The Good Neighbor Agreement addresses issues like exterior design, sidewalks, landscaping, lighting, access at parks and safety provisions, residential unit sizes, street level activation, onsite parking and storage. Outdoor amenities. Locations. Community meeting. Space security and staffing. Staff also received a letter of support from the Cherry Creek Business Alliance.'",
        "'speaker_9': 'Given that Steele Street, his ambition as a high capacity transit corridor, which will require density to make any transit, transit and hence enhancements work, and also given the high need for affordable and attainable housing options in the area.'",
        "'speaker_9': 'Other than that, staff has received one letter from a neighbor, mostly referencing the Terry Greek East survey and how the redevelopment of 50 still could impact neighbor neighboring views. It is important to note that rezonings approvals on district not a specific development proposal.'",
        "'speaker_9': 'Potential traffic impacts related to a particular development are not assess as part of the rezoning request because the development plan is subject to change at the time of the site development. Transportation engineers will identify what mitigation measures might be required prior to issuing a permit.'",
        "'speaker_9': 'Now moving on Denver's zoning code criteria, it must be found. The request map amendment is consistent with five criteria. In regards to criteria number one, there are three adopted plans that apply to the requested rezoning Comprehensive Plan 2040 Blueprint Denver and the Cherry Creek Area Plan.'",
        "'speaker_9': 'A stated on the staff report. The rezoning is consistent with several goals in the comprehensive plan. The rezoning is consistent with two key goals in equitable, affordable and inclusive vision element, as it allows additional housing in a rich mixed use environment.'",
        "'speaker_9': 'Near active transportation opportunities. The proposed rezoning would allow for mixed use development, including an increase in allowed housing density, while also enabling additional housing units close to services and amenities, some of which would be restricted to residents earning less on the area.'",
        "'speaker_9': 'Median income. It is therefore consistent with the strategies in the equitable, affordable and inclusive, inclusive vision element. Finally, the rezoning is consistent with two key goals in the environmentally resilient vision element. AC two will enable mixed use development at a new fuel location where infrastructure is already in place.'",
        "'speaker_9': 'The requested zone district broadens the variety of uses allowing residents to live, work and play in an area. Therefore, the rezoning is consistent with Denver Comprehensive Plan 2040 recommendations. Now moving on to a consistency. We'd look in Denver.'",
        "'speaker_9': 'The proposed 12th District is part of the urban center context and is intended to promote safe, active and pedestrian skill diverse areas through the use of building forms that clearly activate the public street edge. And the mixed use districts are focused on creating mixed, diverse neighborhoods, since the proposed district allows a mix of uses and allowable building'",
        "'speaker_9': 'forms that contribute to street activation, the proposed rezoning to a urban center context is appropriate and consistent with the plan. The Future Places MAP designates the subject property as a regional center and describes it as providing a mix of office, commercial and residential uses.'",
        "'speaker_9': 'Buildings are typically large in scale and orient to a street with a strong degree of urbanism and continuous street frontages. Heights can be generally up to 12 stories in the taller areas and should transition gradually within the center's footprint to surrounding residential areas.'",
        "'speaker_9': 'The CM x 12 zone district allows for a variety of commercial and residential uses in a pedestrian oriented pattern with an active street level. Therefore, the requested CM 12 is appropriate and consistent with future plan place plan direction.'",
        "'speaker_9': 'Blueprint. Denver directs growth to key corridors and centers and high density residential area certified transportation options. The subject property falls within the plan's growth strategy area of regional centers, which anticipates a 50% of growth, job growth and 30% of new housing by 2040.'",
        "'speaker_9': 'The proposed rezoning will achieve this goal. Now looking at the two Greek area plan. This plan was adopted by City Council in 2012 and applies to its subject property. Cherry Creek Area Plan notes that overall these areas benefit from new development, reinvestment and more intense use.'",
        "'speaker_9': 'The plan also recommends that the city modify land use policies, zoning regulations and design guidelines to encourage appropriate reinvestment to assure that these areas continue to mature in a possible positive ways. The requested rezoning to 12 is such a change in zoning regulations and would enable reinvestment and development in the subject property as expressed in the plan'",
        "'speaker_9': '. Additionally, the future land use map for the Cherry Creek Shopping Center designates the subject property as a regional center, where the recommendation is to continue to support a mix of uses, including office retail, commercial use, multifamily, residential and hotels.'",
        "'speaker_9': 'The maximum building height recommended in the plan for this site is 12 stories. Therefore, the recommended scheme, X12, is appropriate and consistent with the Cherry Creek Area Plan recommendations. Stuff also finds that the requested Sony meets the next two criteria.'",
        "'speaker_9': 'The rezoning will result in uniformity of district regulations and will further public health, safety and welfare primarily through its implementation of adopted plans. The application identifies several changes and changing conditions as a justified circumstance under Denver's zoning code.'",
        "'speaker_9': 'Since the date of the approval of the existing Stone District, there has been a change to such degree. The proposed rezoning is in the public interest, specifically due to the adoption of the blueprint Denver in 2019, the Terry Creek Area Plan in 2012, both of which came after the last rezoning of the property in 2000 and.'",
        "'speaker_9': 'Both Blueprint, Denver and Area Plan were developed with extensive public input, and the proposed rezoning would ensure that plan's recommendations are adhere to and that the public receives the full benefit of their work. Overall, the proposed rezoning is consistent with the urban center neighborhood context that exists in the surrounding area and with ACM, X12 representing ten.'",
        "'speaker_9': 'Without government approval based on finding all review criteria has been met.'",
        "'speaker_1': 'All right. Very good. Thank you so much for the staff report, Fran. And this evening we have seven speakers signed up and our first speaker or first couple of speakers are here in chambers. Sean mainly is first followed by Mark Sabella.'",
        "'speaker_0': 'Good evening, Madam President. Members of Council. My name is Shaun Maley. Addresses 1137 Bannock. I'm here as part of the applicant team. Just addressing any questions regarding community outreach. Thank you so much.'",
        "'speaker_1': 'All right, great. Thank you, Mark Sabella.'",
        "'speaker_0': 'Good evening, Madam President, and members of Council. My name is Mark Saviola. I'm with the Barrow Real Estate Group and Steel Street Holdings as the applicant. Our address is 252 Clayton Street, Suite 400 Denver, Colorado. It's a pleasure to be here tonight with our rezoning application.'",
        "'speaker_0': 'We began this process in March of 2019 and with a short break for for COVID and some of the uncertainties of the market, we've been working with the neighborhood and the community for well over 18 months. As you've heard in the staff report, our zoning application is consistent with the Cherry Creek Area Plan and Blueprint Denver recommendations'",
        "'speaker_0': '. It's located adjacent to a high capacity transit corridor, regional center and high growth location and is supported with the TMX 12 zoning. We've worked diligently with Host on an agreement for income restricted units as well as with the community on a good neighbor agreement as mentioned in the staff report.'",
        "'speaker_0': 'And we've also been in direct communication with covered senior life. There are neighbors directly behind us and trying to work with them on some party solutions for their employees prior to construction. So I'd like to thank city staff for their efforts.'",
        "'speaker_0': 'Councilman Hines and the Cherry Creek East Neighborhood Association for all their input, comments and involvement during this process. And we're really excited to move forward with this project and the design of this project. So thank you for your time tonight.'",
        "'speaker_0': 'Our team will be available for questions as they come up. Thank you very much.'",
        "'speaker_1': 'All right. Thank you. Our next speakers are all online and we're going to go ahead and start with Thomas Regnery.'",
        "'speaker_0': 'Good morning, Madam Chairman. Members of city council. This is Tom Reagan. Edie, I'm here representing the Applegate, and I'm available for questions as necessary. Thank you.'",
        "'speaker_1': 'All right. Thank you. Our next speaker online is test.'",
        "'speaker_3': 'And so my name is Ted Sturdy. I live in District nine. And given that this rezoning is in Cherry Creek and we've seen a lot of rezonings in District nine this year, in other parts of the city, it's not not so often that we see rezonings in Cherry Creek as often as we do downtown.'",
        "'speaker_3': 'And so I think it's important to understand how discourse about gentrification helps the community address its goal of regeneration. This community is fraught with systematically distorted communication that uses power and language around economic and political discourse. And theoretically, gentrification is essentially the affirmation of dominant modes of spatial production at the expense of disempowered ones.'",
        "'speaker_3': 'So I would just encourage and hope that we could start digging into how we talk about these rezonings and how it how it plays a role in in gentrification and displacement and and the perpetuation of white supremacy in the city of Denver.'",
        "'speaker_3': 'Because I think that sometimes there are competing value systems in the city of Denver and especially in terms of these rezonings. And I think that the challenges can lead to, you know, public conflict that really gets in the way of finding solutions for housing.'",
        "'speaker_3': 'And I think we need to really start to dig in to exactly what we mean when we say, you know, things like affordable housing, things like urban redevelopment, revitalization and what that really means and whether or not it's coded for something else.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker online is Michael Bell equipped? And I wanted to call his name because it doesn't look like he's in the virtual platform and wanted to make sure he wasn't here in chambers. All right. We're going to go ahead and move on then.'",
        "'speaker_1': 'Jason Schaffer. Doesn't look like Jason's on the virtual platform and we're not seeing Jason here in chambers. And so we'll go ahead. And our next speaker is Jessie Parris Online.'",
        "'speaker_7': 'Yes. Good evening. Member of the town hall. My name is Justin Wissam Paris, and I'm a physician for Black Sox and more of self defense. Housing has become a sizable party of Colorado and frontline black males. And I'll be the next mayor of Denver in 2023.'",
        "'speaker_7': 'I'm an honest man. I agree with everything that's said previous to me about how you go about these visa earnings. Um, I had a few questions. Um, I understand there hasn't been a traffic study done on. Has there been a parking study done?'",
        "'speaker_7': 'I'm glad to see that there was a neighborhood agreement signed. How many square feet are the apartments going to be? Mm. 82. Am I affordable, I guess for Cherry Creek, but, uh, for other areas of town that it's not affordable.'",
        "'speaker_7': 'Um. And see if I'm missing anything. The letters of opposition. What were those? And what was.'",
        "'speaker_2': 'The, uh.'",
        "'speaker_7': 'Letter opposition from the I.R.A.? What was that? So if someone could please answer those questions, I will greatly appreciate it. Thank you.'",
        "'speaker_1': 'All right. Thank you. And sorry about that, Jason. We found you online there. And so our next speaker online is Jason Schafer.'",
        "'speaker_0': 'Yeah. Thank you. Pregnant. Remember the council?'",
        "'speaker_7': 'Now, I just wanted to speak in support of the development.'",
        "'speaker_0': 'Not only the neighborhood context, but out of as much needed housing. And I think one point I'd like to make is that when we when we think of housing.'",
        "'speaker_7': 'And we think of affordability, I think it's important to.'",
        "'speaker_0': 'Factor in transportation and housing together. Right. And one thing I like about this development is, you know, this allows an option.'",
        "'speaker_7': 'For people.'",
        "'speaker_0': 'To live, work and.'",
        "'speaker_7': 'Play near where they live and.'",
        "'speaker_0': 'Could help our household.'",
        "'speaker_7': 'Reduce it maybe from two.'",
        "'speaker_0': 'Parts to one or zero.'",
        "'speaker_7': 'You know, being that it's near transit, it's multimodal bike in.'",
        "'speaker_0': 'There and then also.'",
        "'speaker_7': 'Near jobs and education.'",
        "'speaker_0': 'And travel. So I'm excited to see the strong support.'",
        "'speaker_7': 'To.'",
        "'speaker_0': 'Support these meetings. Thank you.'",
        "'speaker_2': 'All right.'",
        "'speaker_1': 'Thank you, Jason. That concludes our speakers questions from members of Council on Council Bill 1071. Councilman Flynn.'",
        "'speaker_6': 'Thank you, Madam President. Fran, I have a question. I don't know that you can answer it. And I don't know if the owner would be able or the applicant would be able to address it. But it's a ten story building, but it's CMC's eight.'",
        "'speaker_6': 'And it was built in 1973. So it was there when we resigned in 2010. How did how did a ten story building end up at CMC?'",
        "'speaker_2': 'Can you answer that question?'",
        "'speaker_6': 'That's because you're the applicant is just as confused as I am.'",
        "'speaker_0': 'There's two criteria with the CMCs eight and 12. One of them is number of stories and one of them is height, right? It currently is actually an 11 storey building with a little penthouse, but it's probably closer in the height context to CM X eight versus 12.'",
        "'speaker_0': 'So I don't know the history of how it got assigned, what it is, but that's what happened. Or that's what could have happened. Okay.'",
        "'speaker_6': 'I guess I'm still confused, but I guess no one can really answer that. Thank you. That's all I have in prison.'",
        "'speaker_1': 'Okay. All right. Thank you, Councilmember Flynn. Next up, we've got Councilmember Cashman.'",
        "'speaker_0': 'No, thank you, Madam President. I'm Sam bread. Wine. A gift from host i question for you, brand. Good evening. Good evening. So slide ten says voluntary agreement reached in principle with host and 12% of the units are IOUs.'",
        "'speaker_0': 'So the question is, is this. What I'm wondering is House Bill 1117, it changed the landscape for negotiations on affordable housing. I'm wondering, is that the context with which we're working here? I'm wondering how we got the 12 and a half percent, because it's not a number that I would like to see.'",
        "'speaker_0': 'Sure. Thank you for the question. Councilman Brad wining with housing stability, the department, the city and county of Denver. So a couple of questions in there. One. It's actually been executed by the sponsors. So we're beyond kind of agreement in principle that the sponsor of applicant has signed and executed their end of the agreement and is ready'",
        "'speaker_0': 'for process pending council action tonight. To your question about that, that the House bill that passed 1117 in May, it does change a bit about how we are attempting to negotiate these, again, voluntary agreements across the board. That said, as you've heard tonight, the sponsor has been engaged with my department for well over a year at this'",
        "'speaker_0': 'point and talking through terms. And it's fairly well represented about the tenor of agreements that we were negotiating at that time. We feel good about the number, especially given the scale of it. We did push them to consider Laura and I.'",
        "'speaker_0': 'We also pushed them to consider a larger percentage, or at least a floor of of larger format units, knowing that we don't get a lot of those, especially in areas like Cherry Creek. And so all in all, we are we do feel good about what's in here.'",
        "'speaker_0': 'If we were starting the conversation today on the negotiation, it might look a bit different. But we're honoring terms that we that we worked on with them over the course of the last 12, 18 months. The building that is.'",
        "'speaker_0': 'Being replaced. Are there any affordable units on site now? I think it's an offense. I'm not not aware of any. Yeah. Okay. Um. Okay. That's all I got.'",
        "'speaker_1': 'Sorry about that. Thank you, Councilmember Cashman. Up next, we've got Councilmember Hines.'",
        "'speaker_7': 'Thank you. Council president. Question for the applicant. Do you know when the existing structure was built? But was it before 2010?'",
        "'speaker_0': '79. Is helping me out there.'",
        "'speaker_7': 'So I was just to Councilmember Flynn's question about the ten or 11 stories and yet it is still eight. I wonder if it was an artifact of the 2010, um, you know, drawing. I mean, you know, we had tens of thousands of plots and maybe this one was just.'",
        "'speaker_7': 'Part of that. We've corrected other mistakes in the past, and I'm sure that there are other mistakes that we will continue to correct.'",
        "'speaker_0': 'And the other piece of that, too, is similar to a lot of buildings that were built in Cherry Creek at the time. It has that garden level lowest unit. And I believe that's not counted as a story for the zoning.'",
        "'speaker_7': 'Okay. And I guess since I'm already here, you do not currently have an agreement with Gabbard, correct?'",
        "'speaker_0': 'We have received signature from them and we are routing it internal with AMS within our organization for signature. So we have an agreement in principle for them to utilize 20 parking spaces until we start redevelopment work. Oh.'",
        "'speaker_7': 'Okay. And it's not in the package just because it's in principle not executed for you.'",
        "'speaker_0': 'We have an agreement. We just need to finalize the documentation. Okay.'",
        "'speaker_7': 'Thank you. No further questions.'",
        "'speaker_1': 'All right. Thank you, Councilmember Hines. The public hearing is closed. Comments from members of Council on Council Bill 1071. Councilmember Hines.'",
        "'speaker_7': 'Thank you. Council President. Um, I've got a few comments. Let's see. Um, I want to. First of all, I'm getting old. And this will be my first council meeting where I'm wearing glasses. I just started doing this a couple of weeks ago in my livestreams, you know.'",
        "'speaker_7': 'Anyway, okay. So I want to commend the applicant for the affordable housing provided in this agreement. We do have a housing crisis here in Denver, as has been well covered for the entire time I've been on council. What's more, Cherry Creek businesses have a worker shortage that has extended far beyond the recent great resignation.'",
        "'speaker_7': 'The biggest challenge is getting Cherry Creek workers to their jobs and back home, particularly considering many of the surrounding neighborhoods are unaffordable for people who work in Cherry Creek. I hope we can improve non card transit access to all areas of our city, including particularly a place like Cherry Creek and this specific plot that has lots of'",
        "'speaker_7': 'destinations that people want to visit. That said, I have some concerns about this rezoning and it isn't me. After all, you'll see in the packet the Arno has as the Arno in this area, the Cherry Creek East Association has conducted a survey, obtained 275 responses and ultimately received 64% in opposition to the rezoning.'",
        "'speaker_7': 'Some are answers are different than others. This particular R.A. has a track record of engaging the community and church produced, and I believe they are one of the better earners in District ten. Please don't ask me to rate Arnaud's anyway, so I place more weight on this Arnaud's comments.'",
        "'speaker_7': 'The majority of the concerns appear to be about public health, safety and welfare, particularly traffic, parking, sidewalks, safety, which by the way, is something that I consistently, consistently ask the developer to consider more strongly. When this was still in the pre-application process.'",
        "'speaker_7': 'I think I could strike this whole paragraph about being concerned that there wasn't a signed agreement with Covered. I would just say that the residents in Covered are older and often have disabilities and they will be even more impacted than most should.'",
        "'speaker_7': 'The pedestrian experience isn't, should the pedestrian experience not be broad and inviting? After all, many of these residents receive or achieve much of their joy by walking. Walking around this area in their walk around the block or neighborhood is often the only exposure they have to the outside world.'",
        "'speaker_7': 'However, let's talk about the alternative. What happens if we vote no? The alternative likely is an eight storey building used by redevelopment that could look like anything without any input from the neighbors. At least we have an option here that helps us better understand exactly what the neighbors will get.'",
        "'speaker_7': 'And we have quite a bit of input from the community that went into the Good Neighbor Agreement. And theoretically this almost executed agreement from code. Ultimately, this is a rezoning, not a completed site development plan. That means that that there are other checks along the way before something gets built.'",
        "'speaker_7': 'I hope the developer will continue to seek and obtain more engagement and and acceptance from the community. Sounds like there's been progress, but I urge both sides, the developer and the community, to push through the finish line. I want to thank all of those who completed the survey.'",
        "'speaker_7': 'I will continue to watch this specific plight as it continues through the process, and I hope the developer will again strongly consider the feedback in the survey and incorporate those comments as you move through the process. I did mention a public health, safety and welfare earlier, which is one of the five criteria which we should legally consider'",
        "'speaker_7': '. That said, I believe this rezoning does meet the five criteria and and I will once again urge the developer to engage in the community so that the next survey has more yeses. The no's. Until. Until then, I will be a yes vote.'",
        "'speaker_7': 'And I encourage my colleagues also to vote yes. Thank you, Council President.'",
        "'speaker_1': 'Thank you, Councilmember Hines. And I was going to share that not everybody has the the pleasure of getting older. And so it's all right when you need those glasses, let me tell you, they're a life saver. A lot of times we'll go ahead and go to the council members.'",
        "'speaker_3': 'Lawyer Thanks, Madam President. I am a little bit concerned about this rezoning when it comes to consistency with adopted plans. I just I don't understand how it ends up at CMCs eight zoning after 2010, even though it was already in existence.'",
        "'speaker_3': 'That to me sounds like there was a conversation that went down and the decision was to limit this to CMC's eight and not 12. So I'm.'",
        "'speaker_2': 'I'm not.'",
        "'speaker_3': 'Sure that the lack of information around that is convincing to me, and I don't think that this is consistent with the adopted plan things.'",
        "'speaker_1': 'Thank you, Councilmember Sawyer. And seen no others in the queue. I am going to go ahead and vote in favor of this one tonight. Given the information that was presented, I do believe it meets the rezoning criteria. And Madam Secretary, roll call on Council Bill 1071, please.'",
        "'speaker_2': 'Ortega. I. Hines.'",
        "'speaker_7': 'All right.'",
        "'speaker_2': 'Cashman.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Can each. So, you know. Torres. I am black. CdeBaca, I. Clarke.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Flynn.'",
        "'speaker_0': 'I.'",
        "'speaker_2': 'Kremlin. Madam President.'",
        "'speaker_1': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_2': 'One name of a nice.'",
        "'speaker_1': '11 I's Council Bill 20 1-1071 has passed our pre adjournment announcement this evening and thank you, Fran, and the community members who joined us this evening. On Monday, November 29, the Council will hold a required public hearing on Council Bill 21, Dash 1187, changing the zoning classification for 3600 North Cook Street in Clayton and a required public'"
    ]
}