{
    "A bill for an ordinance amending article XI of chapter 24, D.R.M.C., to ban the sale of flavored tobacco products and accessories. Amends Article IX of chapter 24, D.R.M.C., to ban the sale of flavored tobacco products and accessories. The Committee approved filing this item at its meeting on 11-17-21.": [
        "'speaker_1': 'The communication regarding the veto of Council Bill 21 1182 has been received and filed. Councilmember Sawyer your motion to override the veto on Council Bill 21, Dash 1182. Thank you. Council President I move that council bill 21 dash 1182 passes notwithstanding the disapproval or objections of the mayor.'",
        "'speaker_1': 'It has been moved and seconded. Questions and Comments on Council Bill 21, Dash 1182 Council Member Sawyer. Thank you, Madam President. Given that we've been having these discussions for a year and between Councilwoman Ortega and myself, have held almost 100 meetings with stakeholders, community members, business owners, council members, city officials, lobbyists, tobacco companies and countless others.'",
        "'speaker_1': 'I don't think we need to rehash all of the issues tonight. It really comes down to priorities. Do we as a council want to override this veto in the name of public health? Or do we want to let it stand in the name of profit?'",
        "'speaker_6': 'Councilman Ortega and I brought this.'",
        "'speaker_1': 'Bill because we truly believe in prioritizing public health and we have.'",
        "'speaker_6': 'The support of over.'",
        "'speaker_1': 'A hundred local institutions and organizations in this work. We have the data to show that reducing access reduces youth usage of tobacco and vape products. Denver has the opportunity to be a leader in fighting this epidemic. As we have always.'",
        "'speaker_6': 'Said, we.'",
        "'speaker_1': 'Agree with the mayor's office that this should be.'",
        "'speaker_6': 'Done on a state level. And if this veto override fails tonight, we're.'",
        "'speaker_1': 'Committed to continuing these discussions. But we have seen that when Denver leads, others join us. Look at the tobacco 21 law. Denver did it first and then the state changed the age to 21. What about the COVID mask mandates?'",
        "'speaker_1': 'When Mayor Hancock announced that he was requiring masks, even though Governor Polis hadn't, he was making the decision to prioritize public health, even though it was controversial. And what happened? Governor Polis announces statewide mask mandate. That's what we're talking about tonight.'",
        "'speaker_1': 'Denver has an opportunity to lead this conversation and prioritize the public health of our kids. No legislation is perfect.'",
        "'speaker_6': 'And all legislation has consequences.'",
        "'speaker_1': 'Intended and.'",
        "'speaker_6': 'Unintended. But this legislation is narrowly tailored.'",
        "'speaker_1': 'Includes exemptions for things like harm reduction. And we've worked hard over.'",
        "'speaker_6': 'A year to incorporate much of the feedback.'",
        "'speaker_1': 'That we've heard. I believe truly that imperfect action is.'",
        "'speaker_6': 'Always better than perfect inaction.'",
        "'speaker_1': 'I want to be the kind of politician that finds solutions to the.'",
        "'speaker_6': 'Challenges that face our residents. So I'm going to urge my colleagues to join.'",
        "'speaker_1': 'Me in voting to override this. Madam President. Thank you, Councilmember Ortega. Thank you, Madam President. Pro tem. First. I want to share that. It's it's been an honor to work with Councilwoman Sawyer on this project in trying to ensure that we are prioritizing public health as we have done and have led on tobacco issues in the past'",
        "'speaker_1': '. I am tired of seeing big tobacco using millions of dollars to hire. Minority individuals from our community to defend their efforts, meaning big tobacco, to continue to target our communities and especially our communities of color, to ensure that they grow and maintain their lifelong customers.'",
        "'speaker_1': 'Who become addicted to these products. And then you heard how we as the public pay for the additional costs in our increased increases to health care because of so many people whose lives are being impacted and these are preventable deaths.'",
        "'speaker_1': 'This has always been a public health issue that we have focused on by bringing this issue forward and targeting our kids, especially. But at the same time, we're protecting adults. And make no bones about it. The tobacco industry has continued for many, many years to target children.'",
        "'speaker_1': 'And minority communities to be their lifelong customers to continue to pay the increased costs in tobacco products. But they're paying with their lives, and that's what we're trying to address. So I would just plead with my colleagues to allow this law to be overridden.'",
        "'speaker_1': 'The veto to be overridden allowed the law to stay in effect. And then the work that some of my colleagues talked about addressing the enforcement side and sadly, I'm I was surprised last week that. So much focus was on the enforcement when we could have been having those conversations at the beginning of this effort.'",
        "'speaker_1': 'When we started this over a year ago. But those came up on the back end of this process, and they should have been part of the discussions that we were having on the front end. So I just again will be supporting the move to override the veto and hope that my colleagues will support that.'",
        "'speaker_1': 'Thank you. Thank you, Councilman Cashman.'",
        "'speaker_0': 'Yes, thank you.'",
        "'speaker_5': 'Madam President. Pro tem. I made my vote last week without.'",
        "'speaker_3': 'Meaningful comment, so I think it's important that I make comment this week.'",
        "'speaker_5': 'I have struggled more with determining which way to vote on this bill than I have with any but a very.'",
        "'speaker_3': 'Few other issues.'",
        "'speaker_5': 'That I've been faced with in my time on council. The considerations.'",
        "'speaker_3': 'That have found their way into this discussion are.'",
        "'speaker_5': 'Varied and complex, and the competing issues hit very close to home for me. I was a small business owner who worked with.'",
        "'speaker_3': 'Other small business owners.'",
        "'speaker_5': 'For the better part of four decades.'",
        "'speaker_3': 'I'm intimately familiar with their.'",
        "'speaker_5': 'Bedrock contribution to our economy, as well as the pressures that these entrepreneurs face under the best.'",
        "'speaker_3': 'Of daily circumstance, no less when shifting.'",
        "'speaker_5': 'Economics or government regulations add more complexity.'",
        "'speaker_3': 'To their day.'",
        "'speaker_5': 'That's why I proposed the amendment to delay implementation of this bill should it pass.'",
        "'speaker_3': 'By a full year from July of 22 to.'",
        "'speaker_5': 'July of 23. For just over five decades, I have been a parent for the past, nearly to a grandparent, and I've watched my kids, my grandkids and their many friends try to make their way through the minefield of challenges thrown at them, not just by the natural unfolding of life, but by companies who make their living offering'",
        "'speaker_5': 'products tobacco, alcohol and marijuana among them. Whose presence in the marketplace, I believe, presents more of a threat to my loved ones ultimate well-being than a benefit.'",
        "'speaker_3': 'Whatever challenges to clarity the above elements to the debate have presented for me, I am crystal clear that we.'",
        "'speaker_5': 'Have a responsibility to do our best to provide safe passage for our children. I believe good parenting and good government both have a.'",
        "'speaker_3': 'Role in that effort. This bill was presented to me by the sponsors at being aimed at keeping.'",
        "'speaker_5': 'Tobacco out of the hands of kids. And it is that focused context that I have.'",
        "'speaker_3': 'Considered its merits.'",
        "'speaker_5': 'What I like about this bill is that it reduces the availability of the smaller flavored smoking devices. Menthol cigarets and flavored tipped cigars that are.'",
        "'speaker_3': 'Appealing to young would be smokers.'",
        "'speaker_5': 'They would not be available in Denver. My concern about the bill is all of those.'",
        "'speaker_3': 'Products will remain easily.'",
        "'speaker_5': 'Available across our borders and many through online retailers with a few quick keystrokes. I'm also concerned that this bill would impact retailers selling larger vaping devices that these discussions have revealed are not particularly attractive to youngsters and that some folks use as a way toward smoking cessation.'",
        "'speaker_5': 'I would be very pleased with a statewide policy or a federal mandate that we have been told for years is.'",
        "'speaker_3': 'Coming eliminating flavored to make tobacco products.'",
        "'speaker_5': 'Excuse me. As we know. Should this bill pass? It does not provide any kind of silver bullet. Excuse me. Should the bill pass.'",
        "'speaker_3': 'Be it local, statewide or national? It's not a silver bullet to keep kids off tobacco.'",
        "'speaker_5': 'However, the vote goes this evening. We must work in partnership with our Departments of Excise and License and Public Health and Environment to increase the team of inspectors that are available to enforce the requirement that tobacco products of all sort be available only to those 21 and over.'",
        "'speaker_5': 'We must insist that anyone wishing to be licensed to sell.'",
        "'speaker_3': 'Tobacco products in Denver.'",
        "'speaker_5': 'Be required to employ enhanced verification techniques to reduce the opportunity for those under 21 to take fake I.D., to purchase tobacco.'",
        "'speaker_3': 'Products. And we must dramatically increase the penalties.'",
        "'speaker_5': 'For those selling to those under the age.'",
        "'speaker_3': 'Of.'",
        "'speaker_5': '21 or in any way enabling the transfer of tobacco products to those.'",
        "'speaker_3': 'Beneath legal age. We must redouble our educational.'",
        "'speaker_5': 'Efforts to make it ever more clear the harm the consumption of all tobacco products does to young bodies and minds.'",
        "'speaker_3': 'What don't we know about the impacts of the mayoral veto.'",
        "'speaker_5': 'Of 21 Dash 1182 was upheld. We don't know how many more kids will go into Denver stores with fake IDs to purchase these products. We don't know how many adults will purchase these products in Denver and pass them.'",
        "'speaker_3': 'On to underage.'",
        "'speaker_5': 'Individuals to begin or deepen their tobacco habit. If the veto is overturned in 21, dash 1182 passes into law. We don't know how much tax revenue that previously came into our coffers from flavored tobacco sales will go elsewhere, and we don't know how many businesses will relocate.'",
        "'speaker_5': 'We don't know how many of the retailers that.'",
        "'speaker_3': 'Will be restricted from selling flavored tobacco will find.'",
        "'speaker_5': 'A new business model with which to move forward. We don't know to where and in what numbers kids will.'",
        "'speaker_3': 'Go elsewhere to find.'",
        "'speaker_5': 'These products. We don't know what form of underground.'",
        "'speaker_3': 'Business might spring up to meet the new.'",
        "'speaker_5': 'Denver need for products that the bill would ban. We also don't.'",
        "'speaker_3': 'Know.'",
        "'speaker_5': 'What other municipalities will be encouraged to join Denver.'",
        "'speaker_3': 'In finding ways to discourage teen tobacco use.'",
        "'speaker_5': 'Further limiting the supply of kid friendly products. So what it has.'",
        "'speaker_3': 'Come down to for me is I have no faith that big tobacco that lied to us for so long.'",
        "'speaker_5': 'Will suddenly develop a social conscience and join in real.'",
        "'speaker_3': 'Partnership to reduce tobacco use and children. I have no faith that the action from Washington that we've awaited is soon to come. The Centers for Disease Control and Prevention reported a decline in high school students current use of e-cigarettes down from.'",
        "'speaker_5': '27.5%.'",
        "'speaker_3': 'In 2019 to 19.6% in 2020. However.'",
        "'speaker_5': 'An overwhelming majority nearly.'",
        "'speaker_3': '85% of high school students who used e-cigarettes in 2020 reported they use flavored e-cigarettes. My faith is not high that if 21 dash 1182 does not pass, that a second effort will produce a bill with as strong a commitment to keeping flavored tobacco.'",
        "'speaker_5': 'Out of the hands of kids.'",
        "'speaker_3': 'While I recognize the.'",
        "'speaker_5': 'Challenge this puts on retailers, Mayor Hancock, while expressing his concern.'",
        "'speaker_3': 'For affected.'",
        "'speaker_5': 'Businesses, did not say we should not limit supply. He said it would be more.'",
        "'speaker_3': 'Effective if we.'",
        "'speaker_5': 'Did it on a metro wide or.'",
        "'speaker_3': 'Statewide level. I think our chances of leading the way to a positive.'",
        "'speaker_5': 'Outcome for our kids is to do just that, be among those who.'",
        "'speaker_3': 'Are leading the way. With that in mind, Madam President, pro tem understanding.'",
        "'speaker_5': 'That we have other work to be.'",
        "'speaker_3': 'Done to keep kids from getting hooked on tobacco.'",
        "'speaker_5': 'I think this bill will do more to lead us in the.'",
        "'speaker_3': 'Right direction than if we turn it away. I reversed my position.'",
        "'speaker_5': 'From last week and will vote to support the implementation.'",
        "'speaker_3': 'Of 21 Dash 1182. Thank you for your patience with my comments.'",
        "'speaker_1': 'Thank you, Councilman Clark.'",
        "'speaker_3': 'Thank you, Madam President.'",
        "'speaker_5': 'I know I did articulate last week that and shared my concerns with the bill that we passed, ensured my preference for what I thought would have been a better path. I continue to really believe that we need to firm up enforcement, significantly, raise the fines for selling anyone who is selling to kids and and really be aggressive'",
        "'speaker_5': 'and make it a lot easier for the folks who do enforcement to take away and for businesses to lose their license for selling to kids. I believe in that framework. I believe that there are are a lot of people on all sides of this who are very supportive of that.'",
        "'speaker_5': 'Right. And I just want to say, you know, I've got a world of respect for the folks that I sit up here and serve with. And we don't always agree. We don't always come to the same conclusion. But I believe that everyone up here is committed to keeping tobacco out of the hands of kids.'",
        "'speaker_5': 'It's a question of how we think we best get there. And I think that there are a lot of, you know, small business owners who believe strongly in that and want that regulation and that control and that enforcement and that accountability.'",
        "'speaker_5': 'And so.'",
        "'speaker_3': 'You know, I said last.'",
        "'speaker_5': 'Week that I really felt like we should tackle that and then we should implement a flavor ban where appropriate within that framework. And that it was I was disappointed that the amendment.'",
        "'speaker_0': 'To create.'",
        "'speaker_5': 'A carve out for stores that were 21 plus didn't pass. And I thought that it didn't pass because there.'",
        "'speaker_3': 'Was that lack of faith.'",
        "'speaker_5': 'In our current fine structure and our enforcement and and in the ability to take license away. We have found a way to make 21 plus stores work for marijuana to to keep kids out of those stores and to keep kids from accessing marijuana through those stores.'",
        "'speaker_5': 'And I really believe that if we could get if we can get the enforcement and the fines.'",
        "'speaker_0': 'And.'",
        "'speaker_5': 'Taking away of licenses there, then we can also create a pathway for 21 plus tobacco stores. But that's that.'",
        "'speaker_3': 'That wasn't what made it into.'",
        "'speaker_5': 'This final bill. So there didn't last week for me there didn't.'",
        "'speaker_3': 'Appear to be a pathway.'",
        "'speaker_5': 'To that end to what I thought was a better way.'",
        "'speaker_3': 'Was a more tactical. And I think I said to the that this issue needs a scalpel to use that scalpel.'",
        "'speaker_5': 'To really carve this out, protect our kids without, you know, as much of a blunt instrument. But we it does make a difference. And I do think that there is a pathway. I have talked I spoke with the mayor.'",
        "'speaker_5': 'I spoke with other members of this body and feel that the mayor has taken steps to start working with excise and license and the city attorney's office.'",
        "'speaker_3': 'To that end, I believe that we.'",
        "'speaker_5': 'Can tackle this issue with the scalpel that it deserves and protect our kids in a more meaningful way if we take that route. I'm. I'm remain very open to conversations about flavor bans where appropriate as we move forward and solve the problems that I think led to the 21 plus amendment not going through.'",
        "'speaker_5': 'And I and I hope that we can get there. And I think that this is a this is a better path to that end that I was looking for last week. And so I will be switching my vote and I will not be voting tonight to support the override.'",
        "'speaker_5': 'Thank you, Madam President.'",
        "'speaker_1': 'Seeing no one else in the queue. Council members just remember that nine affirmative votes of council are required for the adoption of this motion. Madam Secretary, roll call, please. But. Sawyer I. Black Knight. CdeBaca, I.'",
        "'speaker_5': 'Clark No. Flynn No.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'No.'",
        "'speaker_1': 'Hines.'",
        "'speaker_3': 'All right.'",
        "'speaker_1': 'Cashman. Can I. Ortega, i. Sandoval. I. Madam President, I. Eight eyes, four nays. The motion to override the veto on Council Bill 21, Dash 1182 has failed. Council Bill 21 Dash 1182 has successfully been vetoed. There are no proclamations.'"
    ],
    "A resolution approving a proposed Fourth Amendatory Agreement between the City and County of Denver and The Greenway Foundation for advisory services. Amends a contract with The Greenway Foundation by adding $175,000 for a new total of $1,364,000 and three years for a new end date of 12-31-24 for advisory services to the City, including advocacy, fundraising and environmental education programs related to the South Platte River and its tributaries as needed (FINAN-201415058). The last regularly scheduled Council meeting within the 30-day review period is on 1-3-22. The Committee approved filing this item at its meeting on 11-30-21.": [
        "'speaker_1': 'New items have been called out under bills for final consideration. No items have been called out under pending. No items have been called out. Madam Secretary, please put up the first item on our screen. Councilmember Hines, would you please put Council Resolution 1443 on the floor for adoption?'",
        "'speaker_3': 'I believe that council resolution 21, dash one, four, four, three be adopted.'",
        "'speaker_1': 'It has been moved. And seconded comments by members of Council on Resolution 1443. Council members say the back. Thank you. I'd like to go on record as a no for this contract. I've been consistently appalled by this organization's.'",
        "'speaker_1': 'Mistreatment or advocacy against the interests of the most vulnerable among us in service of revitalizing rivers. Their tagline is Revitalizing Rivers and Reconnecting Communities. But they have consistently ignored communities and also taken positions on other items that would do the same in other contexts protect our communities, protect reconnect our communities.'",
        "'speaker_1': 'And they've taken positions against it. And so I'm confused as to why we're engaging in a contract with an organization for advocacy, given that their values seem misaligned with our own. So I want to go on record as a no for this tonight.'",
        "'speaker_1': 'Thank you. Thank you. No one else in the queue. Madam Secretary, roll call on Council Resolution one four, four, three. See the Barca? No. Clarke Friend. Flynn. I turn, then I try. Cashman. Can I. Ortega, I. Sandoval, I swear i.'",
        "'speaker_1': 'Black. I. Madam President, i. Madam Secretary, please close the voting and announce the results. One name 11 eyes. 11 Eyes, Cancer Resolution 20 1-1443 has been adopted. Madam Secretary, please put the next item on our screen. Council members say the but can go ahead with your questions and comments on resolutions one, four, five, eight and one four'"
    ],
    "A resolution approving a proposed Lease Agreement between the City and County of Denver and Catholic Charities and Community Services of the Archdiocese of Denver, Inc. for property located at 4330 East 48th Avenue. Approves a lease agreement with Catholic Charities and Community Services of the Archdiocese of Denver, Inc. for $30 and through 12-31-23 to operate a City-owned emergency shelter located at 4330 East 48th Avenue in Council District 8 (FINAN- 202159483). The last regularly scheduled Council meeting within the 30-day review period is on 1-3-22. The Committee approved filing this item at its meeting on 11-30-21.": [
        "'speaker_1': ', five nine. Thank you. Is there anybody here from host? I'd like to ask most of my questions to host, not the providers. Thank you for being here. I am concerned that we have not seen any RFP go out for these shelter providers, and I'm curious as to how you all have been dealing with the many complaints we've'",
        "'speaker_1': 'brought to your office that we've gotten from constituents about the operations at both of these shelter locations. Yeah. Thank you for those questions, Councilwoman. My name is Angie Nelson and I'm the deputy director of the Department of Housing Stability overseeing our homelessness resolution and housing stability work.'",
        "'speaker_1': 'So to answer your first question regarding the request for proposals or our procurement process, so we entered a procurement process for shelter operations partners in the summer of 2020, making awards in late 2020 and in some instances in early 2021 and have been operating under those contracts.'",
        "'speaker_1': 'And so for both of these proposals, they were actually proposed during the procurement process back in 2020 under our larger notice of funding availability. So that's how these provider partners were chosen. So I've had several communications with your office, and you were specifically part of a meeting where we were told that at the rescue mission, Debra Butt'",
        "'speaker_1': 'told the service provider out of Atlantis that their contract with the city did not require them to comply with ADA requirements and they were denying people who needed help completing their ADLs. There was a comment there about protecting our relationship with the shelter provider instead of protecting the people who are in the shelter.'",
        "'speaker_1': 'I'm very concerned about that and would like to know how that's being addressed and what in fact, are there requirements around ADA ADA compliance? So I'm not sure exactly what comment you're speaking to, but I think always we're trying to support our folks experiencing homelessness are vulnerable neighbors as well as those provider partners who are stepping in'",
        "'speaker_1': 'to provide really lifesaving services in that meeting. And after that meeting, as we've communicated with your office, we are. We reiterated that there is no exception to compliance with the Americans with Disabilities Act. That was not. Exception granted to any agency.'",
        "'speaker_1': 'And conversations have been had with rescue mission to help to clear that up. And so in that communication was also shared with your office. And how do we, in an ongoing fashion monitor compliance with failure? So all contracts with the Department of Housing Stability have a process for ongoing compliance as issues or complaints are brought to our'",
        "'speaker_1': 'office. We work to understand from both the folks who raise those complaints, as well as the agencies involved what might be going on and to help provide a speedy response. And so that's what we've been working towards. So there's both the ongoing monitoring that happens with our contracts as well as any complaint driven monitoring that occurs.'",
        "'speaker_1': 'So how many complaints have we had of both of these providers? Where are we tracking that at? I don't have that information for you tonight. I do. To go back to my team and see, as you know, host is a new organization in the city.'",
        "'speaker_1': 'And so we are still working on some of our operating procedures that that help us to have all of these different tracking mechanisms in place. But I'll have to do some work with my team to get a response on exactly how many.'",
        "'speaker_1': 'What is the protocol then for complaints from shelter guests and advocates in shelters? So each shelter contract that we have with the Department of Housing Stability requires that our partners have their own complaint, process and procedure internally external to that.'",
        "'speaker_1': 'Historically, we've worked through the Office of Human Rights and Community Partnerships as a place for guests to be able to lodge complaints that can then be addressed. As I mentioned, we're working on some additional operating procedures that can help us to have a more clear written procedure that's available to everyone, but don't have that currently in place'",
        "'speaker_1': '. When will we have that in place? I don't have an answer for that right now. I think it would be wise for us to have that in place before the end of the year. It it seems a little crazy to me that we haven't had a protocol in place for complaints and that we would allow the contractors'",
        "'speaker_1': 'to monitor themselves. That wasn't what I said. Primarily, I said that our contracts, so our contract staff at host provides monitoring. So when you have monitors, no protocol in place at the same exact time for receipt of complaints, there's not a formal.'",
        "'speaker_1': 'Process just for the Department of Housing Stability. So in the absence of a protocol, the default is that there is no real monitoring. There is ongoing contract compliance monitoring, contract compliance, but no complete protocol and monitoring of enforcement or of actions taken when a complaint is lodged.'",
        "'speaker_1': 'So we're not an enforcement agency. We are the Department of Housing Stability. Well, we should have an enforcement mechanism when there are civil rights allegations in these places that are taking care of our most vulnerable adults. So I would love to see that happen or be created very soon.'",
        "'speaker_1': 'I'm assuming that there's no protocol for accountability when you guys do receive a complaint. It's just a conversation. I'm sorry. I'm not sure how you want me to answer that question. It's pretty inflammatory. And so I'm not sure what I meant to say here.'",
        "'speaker_1': 'There are ways in which we document that are complete was received in the most recent instance. We received a complaint and responded immediately to the person who complained to your office, specifically into all city council members. And so that's typically our accountability is quick response and in reply to all members of council trying to keep things very'",
        "'speaker_1': 'transparent. And so I don't know exactly how to respond with the insinuation that we have no accountability or we have no responsiveness to these vulnerable community members because it's simply not the case. Well, it would be inflammatory if it weren't factual.'",
        "'speaker_1': 'We've had two murders, two deaths in our shelters that have, in my opinion, given us a reason to create some protocols for accountability if these if we're going to allege that these are safe places. The recent issue we spoke about with the COVID outbreak and the identification of individuals who had COVID.'",
        "'speaker_1': 'What have we created a protocol since that interaction to get them vouchers for a longer term? Because we were told that they were. That you all told us they were put in respite care, but that it wasn't a substantial period of time.'",
        "'speaker_1': 'So I'm wondering when they're moved to respite care or a motel, are we extending the length of their stay in those spaces so that they're not forced to return before they're well. The regulations around activated, rested are created in cooperation with the Department of Public Health and Environment.'",
        "'speaker_1': 'All of the protocol around release date or length of stay is determined in partnership with public health and public health and environment. And so I'm not sure what conversation you're referring to that you and I specifically had regarding cold mouth from host.'",
        "'speaker_1': 'Okay. So I'm assuming it was an email that laid out the protocol around activated that referral. That referral stays in place. We have the opportunity to help folks who have an active COVID infection to isolate safely for an isolation period, again defined by public health and environment and public health and medical partners.'",
        "'speaker_1': 'What does that length of time? Dependent on various factors such as symptomatic disease. It's between seven and 14 days, depending on individual situations. Does it go below seven days? Not that I'm aware of, but I'd have to look into that.'",
        "'speaker_1': 'I would appreciate that. And my final question with our shelters. Do we have any metrics of success that we require from the shelters? Do we ask them to track how many people are getting into a pipeline for permanent housing?'",
        "'speaker_1': 'So every shelter contract has its own. Package of outcome measures. So most of our shelter contracts do have specific benchmarks to to meet in terms of efforts to stable housing. And so. Depending on whether a program has. Robust case management supports versus more just.'",
        "'speaker_6': 'Shelter.'",
        "'speaker_1': 'Provision. Sort of depends on the level of outcome that a certain contract would have. I recognize that we don't have a backup option. And this is one of the pieces of the puzzle. And so tonight, I have to vote in support of this.'",
        "'speaker_1': 'But I think that now, given the time we've had with COVID and the issues that have come up in our shelters, I think that host really needs to kick into gear with some protocols to deal with the excessive amount of complaints that we've been receiving not only from residents, but individuals, advocates who are working in the shelters'"
    ],
    "A resolution approving a proposed Agreement between the City and County of Denver and Securitas Security Services USA, Inc. for security personnel services in City facilities, excluding Denver International Airport. Approves a contract with Securitas Security Services USA, Inc. for $25 million and for three years, with two one-year options to extend, for security personnel services in City facilities (GENRL-202161226-00). The last regularly scheduled Council meeting within the 30-day review period is on 1-3-22. The Committee approved filing this item at its meeting on 11-30-21. Pursuant to Council Rule 3.7, Councilmember Kniech called this item out at the 12-13-21 meeting for a one-week postponement to 12-20-21.": [
        "'speaker_1': 'and witnessing from an unbiased place what exactly is happening every day in these shelters. And so just wanted to put that out there and we'll be in communication. Thank you. Thank you, Madam Secretary, please put the next item on our screen.'",
        "'speaker_1': 'Council Member Can each go ahead with your comments on resolution one, four, four, four? Thank you. Council President Pro Tem. This is a contract for security services here in our city facilities and I think maybe up to 40 some facilities.'",
        "'speaker_1': 'So Human services, different buildings. And we have had some history with our service contracts in the city recently, as we saw at the airport where the janitorial staff went on strike, we actually had disruptions to the workplace. The disruptions included, you know, a work stoppage, two separate days.'",
        "'speaker_1': 'And, you know, in spite of the efforts of everyone at the airport to to provide backup disruptions due to labor unrest are bad for our city and they're bad for business. And so one of the first priorities I have when I look at our service contracts is to make sure, are we doing everything we can to avoid'",
        "'speaker_1': 'economic disruption? Are we doing everything we can to live up to our city's values in those contracts? Some things are within our control. To set terms for other things have to be determined between the workers and the employers outside the city's control.'",
        "'speaker_1': 'But the important thing always is that there is a commitment to do those negotiations and those discussions and that we as a city have assurance that there's not going to be disruption. We had a conversation in committee about the Securitas security contract a couple of weeks ago, and we received numerous reassurances that there would be good dialog'",
        "'speaker_1': 'with the workers and with their representatives, and that has just not occurred yet. I'm disappointed to hear that there is a lot of confusion among workers, and this happens when contracts turn over, right? There is a policy now that says you have a right to keep your job, but there are questions among those workers about the terms'",
        "'speaker_1': 'that they're going to be keeping those jobs under. And the best way to avoid the disruption that can occur with workers maybe getting cold feet, not being sure if they want to stay on, not being sure what's happening is to work in partnership.'",
        "'speaker_1': 'It is to sit at the table. It is to work together and to make sure that all the communication is as clear as it can be. To make sure that the parties understand what the commitments have been made and that those commitments are going to be kept and that the workers will have a seat at the table'",
        "'speaker_1': '. I'm disappointed that those things have not occurred. And so with that, I am asking for this council to, you know, delay this for one week in the hopes that this company will sit down with the workers representatives and assure us in their next appearance before this council that we will not have disruptions because the conversations and the'",
        "'speaker_1': 'collaboration have not occurred. This is security contracting. It's not janitorial. It's much more complex to find workers to back up and to be in place. We just can't risk another round of disruption in one of our service contracts where it is avoidable.'",
        "'speaker_1': 'Where good conversations and good dialog can clarify communication, clarify intent, and wherever possible, get to as much certainty as possible before this council is asked to vote. So for those reasons, I hope that my colleagues will stay engaged in the week that intervenes here and that they will express their similar support for this dialog to continue.'",
        "'speaker_1': 'This does not require a vote tonight. This is a special motion that we created when we moved our contracts from two reading bills to one reading bill. And so I think it's an important tool. I don't use it often, but this is an example where I think more partnership and dialog is needed.'",
        "'speaker_1': 'I understand we're near the end of the year and this is an important contract and we always wish the administration brought these things a little quicker to us so we weren't quite under such a tight timeline. But I think the importance of avoiding disruptions that are foreseeable and preventable is important enough to make sure the parties understand'",
        "'speaker_1': 'the seriousness of getting to the table and talking. So with that, I think the Council President for accepting my motion tonight and invoking of this rule, and I look forward to hearing that some dialog and communication clarifications have been made so that we can feel good that this contract turnover will occur smoothly.'",
        "'speaker_1': 'Thank you. Thank you. Councilmember Hines.'",
        "'speaker_3': 'I thank you. Council president. I want to thank Councilmember for her comments. I want the record to know that she is not alone. I agree and I'm sure others do too. Thank you. Council President.'"
    ],
    "A resolution approving a proposed First Amendatory Agreement between the City and County of Denver and Brothers Redevelopment, Inc. to revise the scope of services and budget, increase the maximum contract amount, and extend the term for the administration of the Temporary Rental and Utility Assistance (TRUA) Program. Amends a contract with Brothers Redevelopment, Inc. by adding $1,262,255 for a new total of $2,795,855 and one year for a new end date of 12-31-22 for administration of the Temporary Rental and Utility Assistance (TRUA) program (HOST 202161105-01). The last regularly scheduled Council meeting within the 30-day review period is on 1-3-22. The Committee approved filing this item at its meeting on 12-1-21. Pursuant to Council Rule 3.7, Councilmember Hinds called this item out at the 12-13-21 meeting for a one-week postponement to 12-20-21.": [
        "'speaker_1': 'Thank you. Council Resolution 144, four. We'll be back before Council for consideration on Monday, December 20th. Madam Secretary, please put the next item on our screen. Councilmember Hines, go ahead with your comments on Resolution 1438.'",
        "'speaker_3': 'Thank you. Council President Pursuant to Council Rule 3.7, I'm calling out this resolution to postpone consideration until Monday, December 20th.'",
        "'speaker_1': 'No motion is required. Do any members of council have comments? CNN. Councilmember Hines. Council Resolution 1438 will be back before Council for consideration on Monday, December 20th. Okay, that concludes the items to be called out. All bills for introduction are ordered published.'",
        "'speaker_1': 'Council members remember this is a consent or block vote. You will need to vote ie. Otherwise this is your last chance to call it an item for a separate vote. Councilmember Hines, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_3': 'Thank you. Council President. One moment. All right. I'm going to hope that the council secretary will check my work. I'd like to make a move. The resolutions be adopted in bills on final consideration, be placed upon final consideration, and do passing a block for the following items.'",
        "'speaker_3': '20 1-1523. 20 1-141 121. Dash 1433. 20 1-14, four, five. 20 1-1460 21. Dash 1461. 20 1-1462. 20 1-1463. 20 1-1464. 20 1-1330. 20 1-1414. 20 1-1415. 20 1-142 821. Dash 1430. 20 1-144 220 1-144 620 1-144 721.'",
        "'speaker_3': 'Dash 1453. 20 1-145 420 1-145 820 1-145 920 1-146 520 1-146 620 1-142 220 1-144 120 1-132 620 1-132 720 1-132 820 1-132 920 1-143 920 1-1440 20 1-140 520 1-140 820 1-141 221. Dash 142 421. Dash 142 521.'",
        "'speaker_3': 'Dash 1417. 20 1-1, four, two, three.'",
        "'speaker_1': 'Thank you. It has been moved and seconded. Madam Secretary, roll call. Black. I see tobacco. I Clark.'",
        "'speaker_5': 'All right.'",
        "'speaker_1': 'Fine.'",
        "'speaker_5': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'I. All right. Hi.'",
        "'speaker_1': 'Cashman. Kenny Ortega. I. I swear, i. Madam President, I. Madam Secretary closed the voting and announced the results. 12 US 12 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass.'",
        "'speaker_1': 'Tonight there'll be a required public hearing on Council Bill 21, Dash 1365 designating the East Seventh Avenue Historic District Steel Street Extension as a district for preservation and a required public hearing on Council Bill 20 1-1429 Designating Concretion Hall at 3001 South Federal Boulevard as a structure for preservation.'"
    ],
    "A bill for an ordinance designating the East Seventh Avenue Historic District-Steele Street Extension as a district for preservation. Approves the designation of the East Seventh Avenue Historic District-Steele Street Extension as a district for preservation, which includes 19 primary structures on the east side of the 600 and 700 blocks of North Steele Street in Council District 10. The Committee approved filing this item at its meeting on 11-30-21.": [
        "'speaker_1': 'We have two public hearings, hearings tonight for those participating in person. When called upon, please come to the podium on the presentation monitor. On the wall you will see your time counting down for those participating virtually when called upon.'",
        "'speaker_1': 'Please wait until our meeting. Host promotes you to speaker. When you're promoted, your screen will flash to say reconnecting to meeting. Please don't leave the meeting. You will be reconnected and you'll need to turn on your camera. If you have one and your microphone you will see the time counting down at the bottom of your screen.'",
        "'speaker_1': 'Once you have finished speaking, you'll change back to participant mode and see your screen flash one more time. All speakers should begin their remarks by telling the council their name and city of residence, and if you feel comfortable doing so, your home address.'",
        "'speaker_1': 'If you have signed up to answer questions, only state your name and note that you're available for questions of counsel. Speakers will have 3 minutes. There is no yielding of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted.'",
        "'speaker_1': 'We will alternate between in-person and virtual for efficiency by calling in-person participants and then alternating to virtual participants. Speakers must stay on the topic of the hearing and must direct their comments to council members. Please refrain from profane or obscene speech.'",
        "'speaker_1': 'Direct your comments to council as a whole and please refrain from individual or personal attacks. Council Member Hines, will you please put Council Bill 1365 on the floor for final passage?'",
        "'speaker_3': 'I move that council bill 20 1-1365 be placed upon final consideration and to pass.'",
        "'speaker_1': 'It has been moved. Can we have a second? It has been seconded. The required public hearing for Council Bill 1365 is open. May we have the staff report?'",
        "'speaker_6': 'Good evening, council. I'm Jenny Guttenberg, senior city planner, community planning and Development. I'm also here with my colleague Becca Dyer Show, who is learning the ropes of our historic designation process and whom you'll be seeing more of in the future.'",
        "'speaker_6': 'She may assist me tonight with any design review questions that you might have for this historic district proposal. We are considering 19 properties on the east side of the 607 hundred blocks of North Steel Street in the Congress Park neighborhood.'",
        "'speaker_6': 'This is a new historic district proposal, not an amendment to the existing East Seventh Avenue historic district. The designation process is community driven and applications can be submitted by a variety of persons that you see listed on the screen.'",
        "'speaker_6': 'This application was submitted by three property owners who live within the boundaries of the proposed district. They spent the last two years developing the application and reaching out to other property owners to inform, educate and solicit their support for the proposal.'",
        "'speaker_6': 'The owners. Applicants of this district designation are Ken Fuller, Jane Pretzel and Tom Heath. The district is located within the Congress Park neighborhood and includes 19 primary structures 18 that are contributing. This is within Council District ten and blueprints under the areas within the urban neighborhood context and low residential area.'",
        "'speaker_6': 'Future place type. Current zoning is USAC. This is a dis contiguous historic district in two separate sections and was done in this way to avoid overlapping with the existing East Seventh Avenue historic district boundary. You can see by this map that a major justification for creating this new historic district is to include both the east and west'",
        "'speaker_6': 'sides of the 607 100 block of North Steele Street. The east side was left out of the 1993 East Seventh Avenue Historic District designation. This proposed district stands on its own with a period of significance from 1912 to 1990, while the existing East Seventh Avenue historic district has a period of significance prior to and including 1943.'",
        "'speaker_6': 'The proposed district meets all landmarks preservation ordinance designation criteria. It maintains its integrity. It is more than 30 years old. It meets three of the ten significance criteria. And it provides a historic context for consideration by the Landmark Preservation Commission.'",
        "'speaker_6': 'I want to mention the design review requirement for designated properties. Over the past several months, Landmark Preservation Staff engage property owners within the proposed district to clearly explain the design guidelines and design review process, including two community meetings, one in August 2021 and another in October 2021, as well as email communications with individuals.'",
        "'speaker_6': 'One of the major responsibilities of property owner who owns a historically designated property is to maintain its historic character. When a property is designated, it is designated as is and requires no improvements by the city. Maintaining a property's historic character is achieved through Landmark Preservation Design Review for any exterior alterations that require a zoning or building permit'",
        "'speaker_6': '. Landmark preservation has no purview over interior alterations of designated property. Exterior alterations are guided by the design guidelines for Denver landmarks, structures and districts, a set of flexible principles that provide predictable regulations for owners, applicants and staff. Any zoning or building permits submitted prior to the effective date of designation and that does not require any changes by'",
        "'speaker_6': 'the applicant or CPD after the effective date does not require landmark preservation design review. Total demolition of designated structures is highly discouraged and difficult to achieve, requiring a review by the Landmark Preservation Commission. I'd like to note that landmark designation does not impact zoning of a property or properties that falls under the Denver Zoning Code.'",
        "'speaker_6': 'For example, 22 of the city's 57 historic districts are currently zoned for ADU use. The landmark preservation design guidelines have been successfully applied to many new constructions within those historic districts. In respect to significance criteria, the proposed district meets three, meets A, B and C.'",
        "'speaker_6': 'The proposed deal should extension has a direct association with the historical development of the City of Denver for its close association with the City Beautiful Movement and the development of the East Seventh Avenue Parkway, which runs between the two blocks of the proposed district.'",
        "'speaker_6': 'The City Beautiful Movement was the philosophy of urban planning and design that emphasized grand public buildings, curated public spaces, and the incorporation of greenspace throughout the city with the goal of instilling civic pride and encouraging moral.'",
        "'speaker_1': 'Virtue among.'",
        "'speaker_6': 'All citizens. It began in Denver in 1904 with the election of Mayor Robert Speer and extends through the 1920s. Mayor Speer's vision included developing an extensive park and parkway system modeled on the city beautiful movement in Europe. This included beautifying Cherry Creek, constructing civic center and establishing the network of parks connected by boulevards and greenways.'",
        "'speaker_6': 'The houses in the proposed district were constructed between 1912 and 1924, when the City Beautiful Movement was in full swing in Denver. This movement included the creation of pastoral parks and parkways throughout Denver, including the East Seventh Avenue Park.'",
        "'speaker_6': 'With the shift in the parkways designed as it meets the proposed district at Steele Street, is notable making a 607 hundred blocks significant as a marker between the older formal part of the East Seventh Avenue Parkway and the newer section where bungalows and other more modest housing styles flourished.'",
        "'speaker_6': 'The proposed district is also significant for its direct and substantial association with Judge Raymond D. Jones, who owned and lived at 17 or Steel Street for over 40 years, and who is actually here with us this evening. Judge Jones was a well-known personality on Steel Street who played an active role in the civil rights movement.'",
        "'speaker_6': 'And Denver was a notable attorney and judge and was the first African-American to serve on the appellate court in Colorado. Born in Pueblo, Colorado, Jones studied political science at Colorado College, one of only five African-American students in attendance in 1964.'",
        "'speaker_6': 'After graduating from Colorado College, Jones went on to earn a law degree from Harvard University in 1971. He then worked in New York City on Wall Street, but returned to Denver to clerk for the chief justice of the Colorado Supreme Court, Justice Edward Pringle.'",
        "'speaker_6': 'He was appointed as a trial judge for the Denver County Court, where he served for two years before serving for nine years on a Denver district court and two years as the chief justice of the Aurora Municipal Court.'",
        "'speaker_6': 'In 1988, he was appointed an associate judge of the Colorado Court of Appeals. The first African-American judge to hold such a position. He remained in this post for 15 years. Later in his life, Judge Jones taught at Colorado College and Metro State University.'",
        "'speaker_6': 'He helped spawn the Sanctuary Association of Black Attorneys and Cleo Parker Robinson Dance Theater. Finally, the proposed district is significant as it embodies the distinctive visible characteristics of the Craftsman style. 1619 structures exhibit the distinguishing characteristics of the style.'",
        "'speaker_6': 'Defining features include low pitched gabled or hipped roofs wide overhanging eaves, often with exposed rafter tails, ridge beams or knee braces in full or partial with porches with substantial square or tapered columns supporting the porch roof. The bungalows in the proposed district were constructed between 1914 and 1924 at the height of the Styles popularity in Denver.'",
        "'speaker_6': 'The only structures not built in the Craftsman Spot Craftsman style include one four square and one central passage double pile. But these two homes were built within the period of significance and are representative of their era of construction.'",
        "'speaker_6': 'There's also one structure originally built in the crescent style that has been significantly altered and lost the defining features of this architectural style due to a fire in the 1980s. The District retains its integrity of location, design, workmanship, materials, setting, feeling and association.'",
        "'speaker_6': 'There have been some alterations to primary structures in the district, including window replacement and the construction of retaining walls. However, these changes do not negatively impact the historic character or integrity of the historic district. Pictured on the screen in the lower right is a structure damaged by fire 716 North Steele Street.'",
        "'speaker_6': 'It required extensive repair and the original design was altered, including the addition of an attached garage, additional dormers and a closure of the front porch. These alterations impact the integrity of the original structure. Therefore, is not contributing to the proposed district.'",
        "'speaker_6': 'The 1912 to 1990 period of significance reflects the district's many areas of significance, starting with its construction during the late city beautiful movement and extending through its association with Judge Raymond Jones, who lived in the district during his active life.'",
        "'speaker_6': 'The district reflects the city beautiful air development of properties in central Denver along streetcar lines and adjacent to parks and parkways. It also represents the evolution and changing demographics of the Congress Park neighborhood from its early 1900s residential expansion to the city's urban renaissance in the 1970s and 1990.'",
        "'speaker_6': 'And November 2nd, the Landmark Preservation Commission unanimously approved the designation application and forwarding it to City Council for consideration as it meets all designation criteria. The Landmark Preservation Ordinance also provides an opportunity for planning boards. Make a recommendation to City Council regarding designation of historic districts.'",
        "'speaker_6': 'Planning Board may review proposed district designation with respect to its relationship to the Denver Comprehensive Plan. The effect of the designation on the surrounding neighborhood and such other planning considerations as may be relevant to the proposed designation. A quick reminder that the proposed historic district is located with the U.S. Zone District.'",
        "'speaker_6': 'That's urban single unit, which designates a minimum zone that size of 5500 square feet. And the blacks typically have a consistent pattern of 50 foot wide lots. Currently, editors are not allowed in the zone district. The proposed district reinforces the vision of comprehensive plan 2040 through the preservation of important architectural and historical assets in the Congress Park'",
        "'speaker_6': 'neighborhood, primarily through the vision element of strong and authentic neighborhoods. And within that vision goals one, two, three and six. The proposed district will preserve the city's authentic, historic character, enhance design excellence, and contribute to a strong sense of community identity.'",
        "'speaker_6': 'Designation of the proposed district advances these attributes of quality design through design, review of new infill and alterations by using a set of predictable design standards. The proposed district is within the urban neighborhood context, a low residential future place type.'",
        "'speaker_6': 'This context and type includes predominantly single and two properties with accessory dwelling units and duplexes being appropriate when they can be thoughtfully integrated. Buildings are lower in scale and closer to the street, typically with alley access, which is the case in this neighborhood.'",
        "'speaker_6': 'Blueprint Denver also notes that public parks such as the Seventh Avenue Parkway are vital components of the quality of life infrastructure. And these cities and spaces are planned to remain parks. This proposed historic designation maintains these neighborhood attributes.'",
        "'speaker_6': 'The district would allow for alterations and growth or infill that is compatible with existing neighborhood character through Landmark Design Review, aligning with multiple recommendations within Blueprint Denver. Overall, the application is consistent with Blueprint Denver recommendations and reinforces the plan's policies.'",
        "'speaker_6': 'It also helps advance the blueprint under metric related to increasing the sense of the city subject to design focused standards like the design guidelines for Denver landmarks, structures and districts. Lastly, this designation resulted in part from the Black's inclusion in the Congress Park Neighborhood Survey via the City Citywide Building Survey.'",
        "'speaker_6': 'Discover Denver, a public private partnership between the city and historic Denver, and thus also contributes to measuring the success of that program. The proposed district is also guided by the East Central Area plan. The plan identifies the proposed district as an area of historic significance, which is defined as a collection of structures and features identified by the'",
        "'speaker_6': 'Citywide Building Survey. Discover Denver that is significant for its history, architecture and culture and is potentially eligible for local historic designation and application of other tools that will maintain its character. The proposed district also aligns with multiple recommendations within the East Central Area plan, including Policy L nine, six and C one, each of which strives to maintain'",
        "'speaker_6': 'the character of buildings and neighborhoods through historic preservation and designation. Historic designation would help preserve the character defining features of the district. There would be no direct effect on the surrounding neighborhood, as the designation would only impact the two blocks in question, and there would be no zoning changes to accompany the district designation.'",
        "'speaker_6': 'And as mentioned, the designation would not change the blueprint down to a future place type or neighborhood context. The intent of the designation is to recognize this unique district, the buildings that define it, and their contribution to the historic fabric of the Congress, park, neighborhood and city of Denver as a whole.'",
        "'speaker_6': 'On November 17th, the Planning Board unanimously recommended approval of the proposed district designation as City Council based on these criteria. Since the date of your staff brief, CPD received comment from 28 individuals, two registered neighborhood organizations and one interested party historic Denver regarding the proposed historic district.'",
        "'speaker_6': 'Public comment includes responses to the city hosted online survey. Emails submitted to LPC staff and verbal comment provided at the LPC Public Hearing and Planning Board meeting. Some respondents provide a comment multiple times through the various communication channels, and of those some shifted their support throughout the process.'",
        "'speaker_6': 'Currently of the property owners within the proposed district boundary who have provided comment 12 are in.'",
        "'speaker_1': 'Support to.'",
        "'speaker_6': 'Or neutral and one is in opposition. Since the START group was submitted, one additional Denver resident submitted comment and support to the proposed district, which was forwarded to you before today's meeting for your consideration. Based on landmark preservation ordinance designation criteria, the findings of the Landmark Preservation Commission that the application meets the criteria for designation of a'",
        "'speaker_6': 'district and the recommendation of approval by the Denver Planning Board staff recommends approval of this application. Thank you. And I'm happy to take any questions.'",
        "'speaker_1': 'Thank you. And we have a 19 individuals signed up to speak this evening. I'm going to call the first few speakers that are participating in person. And after those speakers, we will call the next few that are participating virtually.'",
        "'speaker_1': 'If you're here in person after your name is called, please make your way up to the front bench. And we will start with Caroline Caselli. Hi. My name is Caroline Casali. I'm the owner at 610 Steele Street. Thanks for having me here today.'",
        "'speaker_1': 'I'm here in opposition of the historic district. My understanding is that this is already sort of a done deal that you guys are going to vote for the historic district. And my understanding is also that this is a progressive city council and that you care about racial and social justice and that the number one priority of the'",
        "'speaker_1': 'city council is to focus on affordable housing. So I'm not totally certain how it's possible to then go forward to then add additional regulatory burden on top of existing homeowners when, you know, when the number one goal is affordable housing.'",
        "'speaker_1': 'I personally, you know, when I've spoken with my neighbors, my understanding is that this the genesis for this application came out of the fact that there was a fear that Judge Raymond Jones large lot was going to be divided and developed.'",
        "'speaker_1': 'So instead of, you know, focusing just on that particular lot and having that focus be just about having his lot preserved as the neighborhood with the neighborhood character, they decided to go for the entire the entire block. You know, this this has kind of a couple of different effects.'",
        "'speaker_1': 'Like I'm a CEO of a company called Haven Connect. We streamline affordable housing applications. So I've seen a lot of this kind of NIMBYism before. And, you know, I'm personally I'm also affected, right. Because I have single pane windows.'",
        "'speaker_1': 'Oh, by the way, not great for climate change. And, you know, my utility bills are over $200 a month because of my single pane windows that are not energy efficient. While I am frantically getting bids to try and get my windows ordered by Friday as per the deadline.'",
        "'speaker_1': 'I'm also having to pull like an emergency loan essentially because of this designation. And so I know there's other homeowners who don't feel comfortable speaking out because of fear of retribution from some of the neighbors who are also trying to remodel their homes.'",
        "'speaker_1': 'And so this doesn't you know, this impacts me personally and also it seems to me to be a major affordable housing issue, especially considering the fear that Raymond Jones, you know, Judge Raymond Jones lot is going to be developed rather than just focusing, you know, kind of more specifically on that particular anxiety, essentially.'",
        "'speaker_1': 'So I would urge you to reconsider and thank you for your time. Thank you. David Hill in Chambers. After David, we'll have Kendra Fuller. Kendall Fuller.'",
        "'speaker_3': 'Hello. My name is David Hill. My wife and I live at 740 Steel Street. We strongly support the application for historic landmark designation. We moved to our house about five years ago after living in a similar bungalow in Platt Park, and at the time the.'",
        "'speaker_0': 'Historic character of Platt.'",
        "'speaker_3': 'Park was starting to change as more and more houses were being torn down. That trend has only worsened as it has throughout the city. We were drawn to Congress Park in part because of the neighborhood's well-preserved historic houses, including those across the street from us, which are part of the Seventh.'",
        "'speaker_5': 'Avenue Historic District.'",
        "'speaker_3': 'Oddly, the houses on our side of the block were not included in the district when it was created in 1892.'",
        "'speaker_0': 'That made no sense to us as.'",
        "'speaker_3': 'The houses were built at the same time and share the same architectural history and character. This new extension will correct that oversight. Historic designations are one of the few tools residents have to preserve the city's cultural and architectural treasures.'",
        "'speaker_5': 'Historic preservation is, in fact, one.'",
        "'speaker_3': 'Of the stated goals of Denver's comprehensive plan 2040, and that goal is even more explicit.'",
        "'speaker_5': 'In Blueprint.'",
        "'speaker_3': 'Denver, where historic designation is encouraged as a tool to promote design quality and to preserve the character of an individual structure or district, or where there is historic architectural, cultural and or geographic significance. I believe the application for historic landmark designation of SEAL Street is consistent with both of those planning documents, and I urge you to vote'",
        "'speaker_3': '. Yes. Thank you.'",
        "'speaker_1': 'Thank you. Kendall Fuller. I'm kind of fuller. I'm one of the applicants. I live at 756 Steele Street. Thank you, Jenny and Becca, for the excellent representation of our application. And thank you for allowing us to be here today.'",
        "'speaker_1': 'As I said in my dining room last week, listening to Judge Raymond Jones and his son Raymond Jr give an interview to Colorado Public Radio. I knew we made the right choice to honor Judge Jones's legacy in our application.'",
        "'speaker_1': 'They consistently used the word wonderful to describe their life on our block. The retelling of the story of his trip to Selma, Alabama, that Judge Jones made as a 17 year old student reflected his life mission to fight injustice.'",
        "'speaker_1': 'His passion was revealed as he described how his time on the bench was influenced by the words and deeds of Thurgood Marshall. We honor his presence here. In the early 1900s. City leaders chose then to create open space parkways, sidewalks and streetcars to create the best neighborhoods they could imagine as the city expanded.'",
        "'speaker_1': 'Denver was experiencing rapid growth in the 1920s as it is now. The Bungalows and Foursquare designs influenced the builders at that time. This is evidenced by the line up of the homes on the 607 hundred blocks of Steel Street, which are incredibly consistent in nature despite being built by different builders.'",
        "'speaker_1': 'All the houses provide generous porches to welcome us home. You have heard from us. We have done our homework and comprehensive outreach to every neighbor. We have renewed friendships and we have made new ones. We know what we're asking for and can see directly from the neighbors across the street.'",
        "'speaker_1': 'What designation means? These houses can both look back at their origins and forward to becoming the neighborhood of the future. When change arrives, we want someone responsible to oversee the transition from yesterday to tomorrow. Thank you. Thank you.'",
        "'speaker_1': 'Uh, David Wise. And next one after David will have an uphill.'",
        "'speaker_3': 'I'm David Wise. I'm a licensed architect with an advanced degree in urban design. I've lived and I have sorry. I've lived in Denver for 40 years. I've lived on Steele Street for 25 years. Historic designation will provide clear guidelines and common sense design review for any work on houses in the neighborhood.'",
        "'speaker_3': 'It will use well-established standards and procedures. Everybody will be playing by the same rules.'",
        "'speaker_5': 'With regard to density and affordability.'",
        "'speaker_3': 'Designation will not prevent adding dwelling units. Marionettes are allowed, but without sacrificing the historic.'",
        "'speaker_5': 'Character and.'",
        "'speaker_3': 'Design integrity that made the neighborhood modest, livable, diverse and desirable in the first place. Design review will ensure human scale and compatible design with all new work. State tax incentives will help make that work more affordable. I believe designation will further Denver's stated planning goals, including retaining our unique character, supporting our active pedestrian environment, preserving front porches'",
        "'speaker_3': ', encouraging the retention of smaller houses, and allowing for the missing metal housing by accommodating basement 80 use. As well as detached it is. I know many of my neighbors well, and we believe in the inclusiveness of the city.'",
        "'speaker_3': 'This is not an effort to exclude anyone from our neighborhood. This part of Congress park is the opposite of a gated community. We welcome a mix of owners and renters, many of whom have gone on to buy their own homes.'",
        "'speaker_3': 'Many of us started out in small apartments in the higher density areas of Capitol Hill. We know how critical housing affordability has become for us and for our children. I'm no stranger to.'",
        "'speaker_5': 'Urban.'",
        "'speaker_3': 'Living and the challenges of paying for housing. My 40 year career as an architect includes the conversion of warehouses and the housing. Integrating high rise housing in the urban core and the innovative live work housing for artists and others.'",
        "'speaker_3': 'Historic preservation is not the enemy of affordable housing. As a board member of the Lower Downtown District, we created the design approach that made loft apartments possible. And in those days, affordable? No longer. In 1989, I instigated the Walkable City Symposium for the Urban Design Forum.'",
        "'speaker_3': 'And for seven years, I wrote a column. To heighten citizen awareness around land use policy to give them tools to navigate. Their own experience in urban living for life on Capitol Hill. It's true that large spec houses feel inflation.'",
        "'speaker_3': 'And that will be tempered. Their character will be tempered by designation. Spec houses are destabilizing. It's certainly a concern of our neighbors, but it's certainly not the only concern.'",
        "'speaker_1': 'Mr. Wise, that's your time. Thank you very much, Emma Hill. Hi.'",
        "'speaker_6': 'My name is on a hill and I live at 740.'",
        "'speaker_1': 'Steel Street in Denver.'",
        "'speaker_6': 'My husband and I bought our first bungalow in Platt Park in 1995.'",
        "'speaker_1': 'It was small.'",
        "'speaker_6': 'In the 875.'",
        "'speaker_1': 'Square foot starter home, but.'",
        "'speaker_6': 'We loved the wood.'",
        "'speaker_1': 'Floors and green tiled.'",
        "'speaker_6': 'Kitchen and we became attached. 20 years later, we moved to a larger bungalow at 740 Steel Street. Even before we moved in, we were invited to the block's.'",
        "'speaker_1': 'Annual holiday party. Our new.'",
        "'speaker_6': 'Neighbors were an engaging group of.'",
        "'speaker_1': 'Teachers, health care workers, artists.'",
        "'speaker_6': 'Salespeople and civil servants, many of whom have lived on the block since the eighties nineties. We had a lot in common, including a.'",
        "'speaker_1': 'Passion for historic homes. Conversation would turn to radiators, living room would work, how to find a refrigerator for a small.'",
        "'speaker_6': 'Kitchen.'",
        "'speaker_1': 'Or how to stay.'",
        "'speaker_6': 'Organized despite our.'",
        "'speaker_1': 'Closets.'",
        "'speaker_6': 'A few years later, at the 2019 potluck, we learned something new. We learned that the home of Judge Ray Jones had been purchased.'",
        "'speaker_1': 'There were rumors.'",
        "'speaker_6': 'About what would happen to the property.'",
        "'speaker_1': 'And we were concerned.'",
        "'speaker_6': 'So we made inquiries about historic designation. Turns out we are a perfect fit. As part of the process, I visited neighbors on both sides of the 700 block of Steele Street, asking whether they supported the historic designation. Each and every neighbor said yes.'",
        "'speaker_6': 'I was not surprised. I know our neighbors and like me and my husband, they have put time, energy and love.'",
        "'speaker_1': 'Into their historic homes and have become attached.'",
        "'speaker_6': 'Steele Street is unified in their desire.'",
        "'speaker_1': 'To become part of the East seven historic district he supported. Thank you for your time. Thank you very much. We'll go online for Kevin MATTHEWS. Good evening. Can you hear.'",
        "'speaker_3': 'Me? How do you mean? Can you hear me?'",
        "'speaker_1': 'Yes, we can go first. Thank you.'",
        "'speaker_3': 'My name is Kevin MATTHEWS.'",
        "'speaker_1': 'I'm a member of Denver.'",
        "'speaker_3': 'We sent a letter opposing this district earlier today. I live at 1020 Madison Street, just a few blocks from this proposed district. The first time I heard about this proposed district was last February.'",
        "'speaker_1': 'When a neighbor of mine.'",
        "'speaker_3': 'Sent me a video of my local R.A. meeting discussing this proposed district.'",
        "'speaker_1': 'And the comment was made that landmarking trumps zoning.'",
        "'speaker_3': 'Just in case there.'",
        "'speaker_1': 'Is any doubt.'",
        "'speaker_3': 'About the.'",
        "'speaker_1': 'Pretext for tonight's.'",
        "'speaker_3': 'Vote. Yes, we've all heard.'",
        "'speaker_1': 'It doesn't technically prevent rezoning.'",
        "'speaker_3': 'Additional units or the addition of it to use. But we should all know by now that if a building has a very high cost to.'",
        "'speaker_1': 'Redesign.'",
        "'speaker_3': 'Those costs are no different than zoning implementations that stop additional units. I only know the little I've read about Judge Jones. He sounds like a remarkable person, and I'm not here to judge his fitness for amendments or recognition.'",
        "'speaker_3': 'But let's not pretend that this is any.'",
        "'speaker_1': 'More than a pretext for.'",
        "'speaker_3': 'Tonight's vote. Maybe his former home deserves recognition and preservation due to his deeds, and I'm not qualified to judge that. But an entire district. I used to live a few blocks from the Molly Brown house, and I would take out-of-towners there.'",
        "'speaker_1': 'On rainy days.'",
        "'speaker_3': 'It's a museum. It's not a home. She didn't get a whole district. My sister actually owns one of the most historic homes in the country, and some of them Massachusetts. But the Adams Magoon house that she bought for $170,000 in 1995.'",
        "'speaker_3': 'At the time, it was an historic home. He was the cousin of John Adams, our second president, and his wife was Sarah Tufts, who whose family started Tufts University. They didn't get an entire district. A few months ago, this council unanimously voted down the landmarking of the Channel seven building that was also passed through the supposedly.'",
        "'speaker_1': 'Rigorous.'",
        "'speaker_3': 'Landmarking criteria that we have today. It was easy to see what was that that was about. And at that hearing I heard this council recognize the problem that current landmarking presents, which is why you're.'",
        "'speaker_1': 'Currently reviewing the process. It's not clear why you're moving.'",
        "'speaker_3': 'Ahead with this landmarking.'",
        "'speaker_1': 'Until that.'",
        "'speaker_3': 'Process is complete.'",
        "'speaker_1': 'Historic designations.'",
        "'speaker_3': 'Have been associated with a rise in housing costs and prohibiting affordable housing from being built and their heirs.'",
        "'speaker_1': 'In their areas.'",
        "'speaker_3': 'They are shown to be negatively correlated with racial integration and displacement, and they raise.'",
        "'speaker_1': 'Property values and rents in neighboring, adjacent.'",
        "'speaker_3': 'Neighboring neighborhoods adjacent to those districts.'",
        "'speaker_1': 'According to the East Central Area Plan.'",
        "'speaker_3': '65% of east central households, including 72% of renter households, live in.'",
        "'speaker_1': 'Areas that are.'",
        "'speaker_3': 'Considered to be vulnerable. Displacement. We ask that you review this process before you move ahead with this district. Thank you.'",
        "'speaker_1': 'Thank you. We will move to Stephen Kick, who's also online.'",
        "'speaker_3': 'Good evening, Madam President and Council. Thank you so much for allowing me to speak this evening. My name is Steve Kirk and I live at 640 Steel Street.'",
        "'speaker_5': 'My husband and I have lived here.'",
        "'speaker_3': 'For 22 years and we strongly support the designation of our side of steel as historic. All of you are familiar with these architectural elements that were described that promote community. These small, closely packed bungalows with front porches, detached garages and sidewalks.'",
        "'speaker_3': 'All of these things support community. It was specifically these qualities that attracted us to this neighborhood. The history of these homes is very compelling. Our home was first occupied by a Jewish family at the turn of the last century who were philanthropists in the Jewish community.'",
        "'speaker_3': 'Decades later, Jewish families were not allowed to live in certain neighborhoods of Denver. So this illustrates the power of history. These homes and neighborhoods belong to the city of Denver.'",
        "'speaker_0': 'We don't own them.'",
        "'speaker_3': 'We are simply stewards of these homes for a period of time. And so we feel an obligation to preserve these jewels. The thought of these homes ending up in a landfill is just unconscionable. As a physician in the middle of an unprecedented pandemic.'",
        "'speaker_3': 'We're seeing the effects that all of us can have on the health of a community.'",
        "'speaker_0': 'So to with.'",
        "'speaker_3': 'Preservation is the combined efforts of all of us to help honor these homes.'",
        "'speaker_0': 'And neighborhoods.'",
        "'speaker_3': 'So I'm asking that you.'",
        "'speaker_0': 'Please give Denver a holiday gift this year by.'",
        "'speaker_3': 'Respecting the history and beauty of these homes through historic designation. Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is also online, Steven Benishek.'",
        "'speaker_3': 'Hello.'",
        "'speaker_1': 'Yes, go ahead.'",
        "'speaker_3': 'Okay. Good evening, counsel. My name is Steve Chicken. I live in District six and I'm speaking to an opposition to this. I would like to offer some considerations before a city council votes on this. I have serious concerns about this designation, specifically around its inequitable implications.'",
        "'speaker_3': 'Page 29 of Blueprint Denver explains the goal of creating a city where, and I quote, growth and development contribute to more equitable and inclusive places rather than increasing disparities and amplifying gaps in how Denver must leverage public and private sector investments to avoid becoming a city where some areas show increasing affluence and privilege while others are being'",
        "'speaker_3': 'displaced, not able to enjoy Denver's great quality of life. Unfortunately, this designation runs completely contrary to these goals. The average House price in Congress passed 800 to 840000, making it one of the wealthier neighborhoods in Denver. This designation, which in the staff reports alluded, states an explicit intention to preserve single and two unit zoning will create a'",
        "'speaker_3': 'significant barrier to smart, and so it will lead to an already wealthy neighborhood becoming more and more privileged while fostering displacement in other parts of the city. When the city extends special privileges, the already privilege exempts neighborhoods like Congress part from their fair share of meeting our housing needs.'",
        "'speaker_3': 'We will see displacement in neighborhoods like five points because those are the only places where people are allowed to build. Furthermore, such use of the circle preservation process can give negative effects on public opinion, make legitimate preservation efforts like lower out of heights, which is due to come up later tonight.'",
        "'speaker_3': 'Harder in the future. I urge you to consider these. At three the goals of Blueprint Denver and vote no until such questions to be answered. Thank you.'",
        "'speaker_1': 'Thank you being to our next speaker online. Bruce Corgi.'",
        "'speaker_3': 'Thank you, Madam Chair, and members of the Council. My name is Bruce Koy and I'm a board member of Capitol Hill United Neighborhoods and also the co-chair of the History Matters Committee. I live in Denver at 1394 Vine Street, and interestingly, I live as part of the Wyman Historic District, but I live in a three year old'",
        "'speaker_3': 'infill project right in the middle of the historic district. My home is living proof that historic districts are not static. And I think some of the arguments about yes or no don't take into account the nuance of this application.'",
        "'speaker_3': 'I believe that city council members have read the letter of support. We voted as a board to support this new historic district adjacent to the Seventh Avenue historic district. I'm just going to point out a couple of points from that letter.'",
        "'speaker_3': 'One is that and you've heard this, but it really is important to note that the current Seventh Avenue historic district cuts right across are a cohesive street, feel street and one side of the street, the east side is not included in the same district that the West Side is.'",
        "'speaker_3': 'And this is kind of an unusual thing for a third district, not the end of the alley. And to have this one end in the middle of the street and if you walk the streets as I have, you'll note that the that the the both sides of the street exhibited the same historic characteristics, and they should be'",
        "'speaker_3': 'eligible for the same kinds of protection. John believes the Denver Landmarks Preservation Commission is on the right track by recommending approval of this just. Importantly, and you've heard a little bit about Judge Raymond Jones, but nominated his poem to be included in Denver.'",
        "'speaker_3': '50 Actions for 50 places campaign and thought Denver on a project and it was selected for that in part because of its representation of just an amazing pioneer story for Colorado. And this home is right on our blog and will encompass a part of this historic district.'",
        "'speaker_3': 'We understand there are complications to renaming this the judge, Raymond Jones historic district, but we believe he is worthy of this honor if that could possibly happen. We take a very thorough and thoughtful approach to endorsing this proposed historic, historic district as a neighborhood organization.'",
        "'speaker_3': 'And we believe that these homes represent historic and for the area, more modest homes there remain opportunities for further development for the alley and the garage buildings are not part of the protected aspect of this historic, historic district.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. We have one more speaker in this grouping online test already.'",
        "'speaker_2': 'Hi. City Council. My name's Tess Sturdy. I live in District nine, and I just wanted to. Talk about how it's kind of weird because, you know, every single Monday I've been at every Monday night city council meeting for over a year.'",
        "'speaker_2': 'Every single one. And while you all read the landing, I was right in the beginning. Every week we continue to act like this land even belongs to what is now called Denver in the first place. We're here preserving historic districts for white residents.'",
        "'speaker_2': 'While a little over a year ago when dozens of residents from a black and brown neighborhood. Came here and testified until after midnight, gave public comment begging you. In one way to develop it. You just you just ignored them.'",
        "'speaker_2': 'So, you know, I just I don't really ever hear about like, I think, you know, I'm just curious how the historic designation kind of works if we're not even willing to it to acknowledge that we're on stolen land and that this land doesn't belong to Denver in the first place.'",
        "'speaker_2': 'And I also just wanted to point out, because it's kind of interesting to hear the side of history that's being told from the city planning or historic designation department. Because if you look on the Denver history, the Denver Library, they talk about how in in the 19 early 1920, leading up to the 1920s, that, you know, 90%'",
        "'speaker_2': 'of black residents lived in five points. So I'm just kind of curious about that 1914 date. It doesn't really seem, you know, like that we're preserving something. You know, I just I'm just kind of confused about that history there.'",
        "'speaker_2': 'And and, you know, I love I love bungalows. I grew up in a bungalow. I think they're great houses. I would just question why why they're allowed this, you know, parcel or this like district is allowed to kind of cherry pick and and you know, preserve their historic district when five points what I thought that that was'",
        "'speaker_2': 'a historic district what how is that what's happened there? Why don't they? Why is everything been torn down and built into high rises? I'm just kind of confused because it sounds like all the residents that are proposing this believe that it's their bungalows and the architecture is going to be preserved.'",
        "'speaker_2': 'So even though that y'all are saying it's not going to affect zoning like it seems like the residents are certainly under that impression. So I'm just kind of confused there. And, you know, I just I just really don't think there's much equity in this process.'",
        "'speaker_2': 'It's pretty gross and it just continues to happen over and over again. I mean, I just don't understand. Like, you're not hear us, you know, what are what do you why do you think this is? Okay. It's just so blatant.'",
        "'speaker_2': 'So blatant. It's ridiculous. I mean, I just I don't even know why we're even doing any of these until this review is done. So to review your racism and and just blatant redlining. Okay, thank you.'",
        "'speaker_1': 'Next. Speakers and chambers. Andy Levinsky. Good evening, Council. I'm Annie Levinsky, the executive director of Historic Denver. We're located at 1420 Ogden Street, and I'm here to offer our support to the Steele Street extension. Our organization conducted survey work in the Congress Park neighborhood in 2019 as part of the Discover Denver Partnership with the City of Denver'",
        "'speaker_1': '. And the survey identified several blocks in Congress Park as potential areas of significance, including the six and 700 block of Steel Street, which shares a close association with the City Beautiful Movement and the National Register listed Seventh Avenue Parkway, which also has its own distinctive attributes, including the highly intact bungalow forms and the Association of People of'",
        "'speaker_1': 'Interest in our city. Most notably, Judge Raymond Jones. The Jones home, as has been mentioned, was also identified as part of Discover, Denver and Capitol Hill. United Neighborhoods nominated it to our 50 Actions for 50 Places campaign last spring, which is a campaign designed to help catalyze preservation action that reflects the full depth, breadth and diversity of'",
        "'speaker_1': 'our city story. I want to thank Judge Jones for being here this evening with his son, Ray, who I believe you'll hear from in a little bit. The home was selected to be a finalist in our final 50 sites, and as such, historic Denver provided additional guidance and support to the Steel Street effort, which is an opportunity'",
        "'speaker_1': 'to recognize this story. And express and honor a judge's Jones life. And I've had the distinct honor of getting to do an oral history with him and spend some time with him. And it's truly a compelling story about making change in our state.'",
        "'speaker_1': 'We took on additional research to put that into the context of what was happening in the neighborhood and the block during those years, as well as his particular accomplishments. And I know he has great affection for his longtime home at 780 Steel Street, and he selected Congress Park in the 1970s very intentionally.'",
        "'speaker_1': 'I do want to correct a couple of things that have come up. Notably, the Molly Brown House Museum does have its own historic districts called the Pennsylvania Street Historic District, and it was created to help protect the museum in an era in which individual landmarks were not protected as they are today.'",
        "'speaker_1': 'I also want to note that the designation is consistent with city plans, including the Blueprint Denver and the recently adopted East Area Plan. I think it's important to again state clearly that the recommendations of that plan, if they're implemented, such as encouraging accessory dwelling units, would be consistent with the historic district and compatible so that could move'",
        "'speaker_1': 'forward. Furthermore, the preservation of these homes supports sustainability goals by ensuring that lasting materials are not sent to landfills but actively used by future generations. Because owners in the district will be eligible for tax credits for rehabilitation work, including any efforts to increase energy efficiency.'",
        "'speaker_1': 'And because the question I know came up when this hit committee, I want to emphasize the policy recommendations regarding Windows in historic districts is consistent with the city's goal on climate action. There's extensive studies that have been done, including by the National Trust, that demonstrate that saving and retrofitting older windows is a more cost effective way to'",
        "'speaker_1': 'achieve energy savings and to lower the home's footprint than full replacement. So on behalf of historic Denver, I encourage you to support this designation and help us tell a story that our city should know. Thank you. And our next in chambers, speaker, is Reed Jones the second.'",
        "'speaker_5': 'Good evening. My name is Raymond Dean Jones, the second affectionately named after my father. I currently live at 2400 Sable Boulevard. I was raised in 780 Still Street.'",
        "'speaker_3': 'I am a son of Denver. I went to Denver East.'",
        "'speaker_5': 'I played soccer at Congress Park. I grew up at the East YMCA, which is no longer. I grew up playing sports and living my life at Saint Charles Recreation, Saint Charles Rec.'",
        "'speaker_3': 'Which is no longer really what it used to be.'",
        "'speaker_5': 'And that's why I think it's so important that we do what we're talking about doing here today. Because living in Denver my entire life.'",
        "'speaker_3': 'It is not the same city.'",
        "'speaker_5': 'That it once was.'",
        "'speaker_3': 'And we all know that who have been here.'",
        "'speaker_5': 'The area we're speaking about 780 still.'",
        "'speaker_3': 'Area changing.'",
        "'speaker_5': 'The district. It's very important that people understand.'",
        "'speaker_3': 'My father was a trailblazer.'",
        "'speaker_0': 'Not only and his law career.'",
        "'speaker_5': 'But also and being one of the first people of color excuse me, the first person.'",
        "'speaker_3': 'Of color in.'",
        "'speaker_0': 'That neighborhood. So to say.'",
        "'speaker_5': 'That my father or.'",
        "'speaker_3': 'Myself would allow his name to be used for discrimination.'",
        "'speaker_5': 'Or racism is absurd. Well, it makes a very strong.'",
        "'speaker_3': 'Talking point in. And aggressively can speak to the times. It is simply absurd. We would never allow such a thing. That dedicated 30 plus years of service to this city, to Denver. Sacrificing. Some of the relationships he.'",
        "'speaker_5': 'Should have had.'",
        "'speaker_0': 'With his children, with his family for Denver. So when we talk about.'",
        "'speaker_3': 'Designating something.'",
        "'speaker_5': 'A district to my father, I want us to understand that we're talking about someone.'",
        "'speaker_3': 'Who is given back who could have taken his Harvard Law degree and doing other things that.'",
        "'speaker_5': 'Would have done better for his family. But because of the type of man that he.'",
        "'speaker_3': 'Is, he did not. I also want to say thank you to the Council for listening to me today and to my.'",
        "'speaker_5': 'Neighbors who have seen me grow up. It's very weird to see people who have seen you since you were little and now you're old. So I want to say thank you for being a part of this process. And I really do want to.'",
        "'speaker_3': 'Say thank you to those who have.'",
        "'speaker_5': 'Spoken out against. And that's our democratic process.'",
        "'speaker_0': 'But also understand that this.'",
        "'speaker_5': 'Is not a situation of the rich getting richer. This is a situation of giving pride of that community, which is very special, which is very different than any other neighborhood.'",
        "'speaker_3': 'And retaining what makes Denver so special. Thank you for your time.'",
        "'speaker_1': 'Q And last set of speakers or online. We'll go to David Hahn. Hey, on next.'",
        "'speaker_3': 'I'm guessing that's me. David Hagan. I think I think I need to type it in the wrong. I was in a hurry.'",
        "'speaker_1': 'But I think.'",
        "'speaker_3': 'It was need to me tonight. Historic preservation is I completely understand where it's necessary and where it is egregious, egregiously used to keep people out of the neighborhood. I think that the judge's home should definitely be historic or made that way.'",
        "'speaker_3': 'But in general. Historic preservation is absolutely a cause of gentrification. Whether or not people think about it in their own neighborhood, it causes there's an effect outside the neighborhood that is not helpful to keeping people in their homes or bringing people back and bringing people to a neighborhood that it's historically been in that neighborhood.'",
        "'speaker_3': 'It is. I mean, just when, when, when. The judge's trip to Selma was used in the same sentence as the historic preservation was discussing. What that man did was beautiful and powerful, and it is somewhat saying that he's done a lot of good things in this community and throughout the country.'",
        "'speaker_3': 'But to put the entire neighborhood under the same sentence that that minimized what that man did, what he dedicated his life to, that was so disheartening. All right. In the 1960s, Denver decided to replace this community with Aurora campus.'",
        "'speaker_3': 'And here's what it lost. A community, including a restaurant that became a multicultural hub and a magnet for guests. Magnet for gas. Let's see here. Descendant or. Sorry, I'm just trying to read something off the computer really quickly.'",
        "'speaker_3': 'Descendants look back at what was lost and what what they were compensated. Decades later, the memory of fences and bulldozers still haunts Giorgio. He was 11 years old when the Urban Renewal Project forced his grandmother and hundreds of other of her neighbors out of central Denver.'",
        "'speaker_3': 'He remembers as well as well the tears, illness, illnesses and other signs of stress among the adults whom he counted on. His mother spent the best of her years, the best years of her life trying to save this place, he said.'",
        "'speaker_3': 'Most of the neighbors, brick and wood homes and businesses were raised beginning in 1969 to be replaced with modern concrete. So that right there is kind of the opposite of what's going on. So you don't want that to happen.'",
        "'speaker_3': 'But it's different neighborhood right when it when it's in five points. We're all for getting rid of it when it's in a white neighborhood. We're all for keeping it and keeping it that way. It's just it doesn't make sense, you know, she said dozens and dozens I think it was probably close to 100 people spoke out about'",
        "'speaker_3': 'an hour ago and what the effect was going to have on that community of black and brown people. And you all voted for it anyways. So and then and then tonight you're going to vote for this if you don't listen to the people when when they're in front of you.'",
        "'speaker_1': 'David, thank you. Your time is up. We'll move on to Susan Hester, also online. Good evening. Thank you for this opportunity. My name is Sue Hester. I live at 765 Steel Street and my husband and I have lived in our home for more than 43 years.'",
        "'speaker_1': 'So you can say we're pretty much the seniors on the block. We live on the west side of the 700 block of steel building. And I strongly support the neighbors application to extend the historic district to the other side of the street.'",
        "'speaker_1': 'When this historic district was established in 1993, our side of the street was designated in the historic district, while our neighbors across the street were not. It didn't make sense to have that line down the middle of our our block then.'",
        "'speaker_1': 'And it doesn't make sense now. Now, in response to some of the comments about being in the historic district and the potential problems, we have found workarounds. Let me give you a couple of examples. A few years ago, we had custom wood storm windows, which are, by the way, double paint constructed for all windows in our home'",
        "'speaker_1': '. And this was a fraction of the cost of replacing all windows. Second, instead of building a retaining wall for our high Congress, Park Hill, we had it landscaped. The advantages of which are no more mowing the grass and less water usage.'",
        "'speaker_1': 'These solutions were much more economical and conform totally with historic district requirements. In summary, the proposal to extend the seventh seventh Avenue Historic District this tiny in the spectrum of the decision. You City Council members will make today and then the future as it only affects one side of two blocks of steel street and covers only 19'",
        "'speaker_1': 'homes, most of which are about 100 years old. I think I can speak for my friends and neighbors that we understand and support the need for more affordable housing. But what we don't want is what has happened in other older neighborhoods, such as Park Hill and just across Sixth Avenue and the Cherry Creek area where McMansions have'",
        "'speaker_1': 'been built. We want to save our beautiful bungalows. So we urge your support for the extension of the Seventh Avenue Historic District, which will maintain the integrity and beauty of our small island bungalow history. Thank you so much for allowing me to speak to my.'",
        "'speaker_1': 'Thank you. Next speaker online is Carol Coffman. Good evening. Thank you, Madam Chair. And members of the City Council. My name is Carol Coffman. My family and I have lived at 770 Steel Street for some 20 years. I am here to voice my strong support for the ordinance designating East Seventh Avenue.'",
        "'speaker_2': 'Historic.'",
        "'speaker_6': 'District Steel Street.'",
        "'speaker_1': 'Extension as a district for preservation. First, we want to thank the many neighbors we have had the pleasure of meeting and getting to know. We're getting to know even better as we.'",
        "'speaker_2': 'Work.'",
        "'speaker_1': 'Through the steps towards designation. Over the past two years, we, I think, have become a closer and more involved neighborhood.'",
        "'speaker_2': 'Like so many on our street.'",
        "'speaker_1': 'Our family loves this neighborhood because of its history, its sense of community, and the architectural appeal of arts and crafts bungalows and Denver squares of this area. We've heard a lot about that tonight for about 15 years. We also have the honor of living next door to Judge Raymond Jones.'",
        "'speaker_1': 'And we've heard a lot about his life and his many contributions as well. He spoke often of the pride of this home and being part of this beautiful community, a part of our community, his life in his home.'",
        "'speaker_2': 'Here is just.'",
        "'speaker_1': 'One example, though, of how the history of homes on our blog is more than a built history spanning over hundreds of years, 100 years. It's a lived history of everyday community. We feel it is.'",
        "'speaker_2': 'Urgently critical to.'",
        "'speaker_1': 'Safeguard this gift of the city architectural and social history. With the.'",
        "'speaker_2': 'Historic district.'",
        "'speaker_1': 'Designation, we have the opportunity to do that, and I urge you to vote yes on this.'",
        "'speaker_2': 'In sum, I strongly support this designation.'",
        "'speaker_1': 'Thank you for your time and consideration. Thank you. Next speaker, Steve Turner.'",
        "'speaker_3': 'Hello. This is Steve Turner. I am sorry. Let me just check out another video. Sorry about that. Hi there. I'm Steve Turner. I'm a resident on Steel Street at 640 Steel Street. I've been here for about 20 years, and I appreciate the council giving me this opportunity to speak with you.'",
        "'speaker_3': 'I'm here to speak in support of this proposal. I will say that shouldn't come as a surprise in that I clearly are going to have a particular perspective on this, because I've spent the last eight years serving as the state historic preservation officer, appointed by Governor Hickenlooper, and then Governor Polis.'",
        "'speaker_3': 'And I just retired from that position and currently the professor of Historic Preservation at the University of Colorado. I spend a lot of time talking to students about preservation, opposition to preservation, the buzzwords that are used to diffuse preservation, everything from it's not environmentally sustainable, which architects and I am an architect by training will tell you that'",
        "'speaker_3': 'there's a there's a phrase that says the greenest building is the building that's already built. Things can be made environmentally sustainable. And also the sort of go to point seems to be around vital windows. And we know why no windows over the last 20 to 20 to 30 years.'",
        "'speaker_3': 'The old designer window industry will tell you that. And so we don't. Historic preservation has its inherent sustainability embedded in its very DNA. People will talk about affordability, but again, you can look at what's actually happening around the city and see that we're not historic.'",
        "'speaker_3': 'Home is great. It's not replaced with a more affordable unit. It is always a unit that is 3 to 4 times the cost of the original unit. People will talk about having a 100% consensus. Well, when LoDo was designated, over 70% of the owners were opposed to that designation.'",
        "'speaker_3': 'In fact, it only passed council by one vote, so 7 to 6. So I know that I am about to run out of time. So I want to leave you with the thought that I'm reading a book that Jane Goodall.'",
        "'speaker_3': 'It's entitled The Book of Hope. And it's about really living in the times that we live in now and the need for hope. And Jane Goodall says the hallmark the hallmark of wisdom is asking what affects will the decision that I make today have on future generations?'",
        "'speaker_3': 'And as one of our speakers has already previously said, this land does not really belong to us. But I would argue not only does it, it belongs to future generations. And this is one way to ensure that the future will get to enjoy and benefit from these beautiful historic structures.'",
        "'speaker_3': 'Thank you for allowing me to speak tonight.'",
        "'speaker_1': 'Thank you. Our next speaker is Kevin Kelly.'",
        "'speaker_3': 'Oh, thank you.'",
        "'speaker_0': 'And greetings, Denver City Council, and thank you for your leadership and commitment to keeping Denver one of the most desirable and dynamic cities in the country. My name is Kevin Kelly and I live an East Jesmond Park at 12th and Vine.'",
        "'speaker_0': 'I have served on the board of Capitol Hill United Neighborhoods for five years and co-chair our History Matters Committee. Tonight, we are here to speak about designating the East Seventh Avenue historic district, the Steel Strait extension as a district for preservation.'",
        "'speaker_0': 'John moved to support the Steel Strait Extension as a district for preservation on December 17th of 2020, as stated and forwarded in a letter of support to Community Planning and Development and Denver City Council. One additional topic for support of the establishment of a historic district involves affordability.'",
        "'speaker_0': 'Historic districts can and do support affordable housing. A street side of modestly sized 1910 and 1920. Bungalows are more affordable than newly built two storey homes that often extend through the back of the lot to the alleys. One only needs to consider the plight of smaller, historic homes north of Sixth Avenue to witness the size of homes'",
        "'speaker_0': 'and scope of our new neighborhoods. No room for affordability. We encouraged city council to approve this new historic district.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you. Our next speaker is Jane Fritzl. Do we have, Janeane? Oh. Jesse Paris. Okay. Sorry. Your next speaker is Jesse Paris.'",
        "'speaker_3': 'Yes. Good evening. My name is just Allison Pearson. I'm representing four black stars and more for self defense. Positive, actually. Come in for social change. These Denver Residents Council, the Unity Party of Colorado and frontline black males. And I'll be the next mayor timber in 2023.'",
        "'speaker_3': 'I'm in favor of this preservation to my. Despite all the opposition against it. We need to preserve our historical districts, our historic neighborhoods in the city. Now, I am a native of 5.4. I was a native of five points.'",
        "'speaker_3': 'And I've seen the damage that occurred from having a preservation in five points. Five points became unaffordable and. Unlivable for people of black African descent. And I would hate to see that happen. With the Seventh Avenue Historic District.'",
        "'speaker_3': 'Um, I don't need we don't need any more unintended consequences of voting and preservation. Um. We are on stolen land. This is stolen land we are on and does not own this land. And we have to acknowledge that and.'",
        "'speaker_3': 'I would hate to see this neighborhood become unaffordable as a result of this preservation. So I'm kind of torn on. Really torn on how I want to proceed with this because. On one end, it seems like it's a good idea.'",
        "'speaker_3': 'It meets all the criteria. But then, on the other hand, what are the unintended consequences that are going to occur from this? I hear from the neighbors and the judge, his son. I'm going to have to be a reluctant.'",
        "'speaker_3': 'Yes. On this puzzle based on tonight's. We need to maintain the character of this neighborhood of Congress part. And the judge's house. He was the first black judge to reside in this neighborhood, and that needs to be preserved.'",
        "'speaker_3': 'I'm just concerned that there's going to be unintended consequences from having such a preservation. So I'm really on the fence about this because for the simple fact I've seen what happened with five police. In other historical districts, the hand store could designation give it to them in the aftermath of what that looked like.'",
        "'speaker_3': 'So I'm going off on a whim on a leap of faith that this will not happen with the Seventh Street historic district. Even though. There's plenty of examples of it happening with other historical districts. So I want to know if there's a guarantee that there's going to be affordability in this neighborhood.'",
        "'speaker_3': 'And now no more people will be displaced as a result of such a preservation. So if somebody could please answer that question. Those questions, I would greatly appreciate it. Thank you for allowing me the opportunity to speak.'",
        "'speaker_1': 'Thank you. And our last speaker is Jane Fritzl. Hello. Hi, Jane. Go ahead. Oh, sorry. I'm having a little problem with the computer here. Really, I. I'm grateful to be supporting this opportunity of joining the West Side. With with historical designation and.'",
        "'speaker_1': 'I know that our bungalows are.'",
        "'speaker_2': 'Significant of a change.'",
        "'speaker_1': 'In attitude in the 1920s and before the late 1800s.'",
        "'speaker_2': 'Leading up.'",
        "'speaker_1': 'Just about what housing should be, especially for the middle class. So. The first.'",
        "'speaker_2': 'Bungalows were really appearing in Philadelphia.'",
        "'speaker_3': 'But then.'",
        "'speaker_1': 'On out in.'",
        "'speaker_2': 'California.'",
        "'speaker_1': 'And coming our way. They're in all the major cities. And it was a great.'",
        "'speaker_3': 'They're.'",
        "'speaker_1': 'Great housing for the middle class. So they are actually.'",
        "'speaker_3': 'The most significant.'",
        "'speaker_1': 'Form of architecture in.'",
        "'speaker_3': 'The. This is said in the arts and crafts movement.'",
        "'speaker_1': 'So it was.'",
        "'speaker_2': 'A it was really fun.'",
        "'speaker_1': 'It was. It was a response to move away from the Victorian era and and really have a different type of architecture. And I strongly support that our side of the street is. Is is able to join.'",
        "'speaker_3': 'The historic district.'",
        "'speaker_1': 'On the west side. So thank you so much and I hope you support our application. Thank you very much. That concludes our speakers questions from members of Council on Council Bill 1365. I see no one in the queue.'",
        "'speaker_1': 'Oh, here we go, Councilman Flynn.'",
        "'speaker_5': 'Thank you, Madam President. Pro Chairman. Taking a while for the item to respond. Jennifer, could you. I'm curious about. And Judge Jones, it's nice to see you here. It's been a long time since I've seen at least the upper half of your face.'",
        "'speaker_5': 'Regarding 7080 still that the judge no longer lives there was sold and it's all owned by a real estate investment firm is there are. I just want to know if you have heard of any plans to do anything with that property and would it be consistent with the designation?'",
        "'speaker_5': 'In other words, there's nothing pending that exempts it from any of the, uh, the safeguards and the rules and regulations.'",
        "'speaker_6': 'No, we, I'm not aware of any permits.'",
        "'speaker_1': 'Or.'",
        "'speaker_6': 'Proposals put forward to CPD for any changes to that property. So we have seen nothing and have heard nothing at this point either.'",
        "'speaker_5': 'Okay. Thank you. That's all I have.'",
        "'speaker_1': 'Okay. Thank you. Councilwoman Sawyer. Thanks, Senate President. Thank you. I just had a quick clarification. So of the 19 homes that are included in this, do all 19. It does not seem like all 19 owner support. So how many owners support and are there owners that who actively are not supportive of this plan?'",
        "'speaker_6': 'So yes, I don't have it on the slide actually. So there were 15 owners who provided comments of the 19 so far did not. Of those 15, 12 are and support. Two are neutral and one opposes.'",
        "'speaker_1': 'Got it. Okay. Thank you and thanks for the clarification. Thank you, Councilman Hines.'",
        "'speaker_3': 'Uh, thank you, President Pro Tem. May I have Mr. Weiss come to the microphone, please? I want to thank you for meeting with me. I think it was last week we in our conversation, we talked about. Windows. And we talked about how to make, you know, ways to make a home more energy efficient, more.'",
        "'speaker_3': 'You talk about some of the we touch on not asking you to relay everything that you said, but will you touch upon some of the efficiency methods for increasing climate efficiency? Certainly I won't read my two page single spaced memo that I was referring to in our meeting.'",
        "'speaker_3': 'The. The outline that we started prepared as a group that of course I did. A lot of the research really begins with. Taking advantage of Xcel Energies program to do an energy audit of your home. Which gives any of us, professional or otherwise, an overview of where our energy and our money is going.'",
        "'speaker_3': 'And I think that comprehensive look. Uh, at a house and how you use the house and how you live in it is really a great starting point. But then to fast forward. But one of the essential points is that windows are just one piece of that overall consideration for any homeowner and and how they spend their money'",
        "'speaker_3': 'on energy. And to focus in on that a bit more. Obviously, the most sustainable thing you can do with an historic building and what the Department of Interior has worked very hard to outline technically for decades, and they're very clear bulletins on how to do these things.'",
        "'speaker_3': 'The most efficient thing you can do is restore and repair your existing windows. Even looking at commercial projects, the new center is building a 16th of the ad, Brooke Lofts, 15th and one to the Airedale building on 20th Street.'",
        "'speaker_3': 'All of those use wood windows and some of those have been redeveloped now for decades and have have served quite well and maybe are ready for for another round of repairs. But the wood windows, when handled carefully by a craftsman and and done appropriately, last decades.'",
        "'speaker_3': 'Even in our climate, there are at least two very good local companies that restore windows and historic houses. I've had them give.'",
        "'speaker_5': 'Proposals for work.'",
        "'speaker_3': 'In historic districts in Denver, and those costs are roughly equivalent to medium quality, I guess you'd say replacement window, and they're very good at it. They've been doing it for many, many years and the windows are beautiful and they hold up very well.'",
        "'speaker_3': 'There are such things as the possibility of replacing the glass and a traditional wood window that can add higher performance. With tempered glass, it can reduce the noise factor from the exterior into the house with modern sealants and weather stripping.'",
        "'speaker_3': 'You can essentially match the infiltration performance of a new window, and with certain window blinds you can match the code required performance of a brand new window. I mean, there are plenty of ways. To adapt existing windows to an historic house.'",
        "'speaker_3': 'And then if you do the other really long menu of things that Xcel Energy will help you with, just save even more energy. So I think what I, what I heard from you is that Xcel, the audit the Department of Interior says replacing windows is maybe the, um, the most energy efficient single replacement, but that the Xcel'",
        "'speaker_3': 'audit could identify a laundry list of replacements and it would be specific for that property. Not, um. That's correct. And really, what I said was keeping the windows is the most sustainable strategy. When you take the embodied energy, the waste of throwing them away and all of that, the carbon footprint into account is the most sustainable.'",
        "'speaker_3': 'I didn't say it's the most energy efficient. What I am saying is you can easily match the energy performance of a new code compliant window with an historic window with the right strategies. Okay. Thank you. May I ask Mrs. Caselli to come up as well?'",
        "'speaker_3': 'I think it's only fair if I ask Mr. Wise to, uh, to talk about Windows that I ask you as well. And it's, it's my understanding that you and he had a meeting as well. Is that right? Yeah.'",
        "'speaker_3': 'Okay. Have you. Have you considered an Excel audit or have you had one?'",
        "'speaker_1': 'So, no, I haven't. All I know is that I have broken single pane glass windows that have very drafty. And, you know, there's lots of options that David and I talked about. And the reality is, is I don't want storm windows.'",
        "'speaker_1': 'I'm a single person in my house. I have 35 windows. I have zero interest in bringing those up and down. I don't.'",
        "'speaker_3': 'I just want.'",
        "'speaker_1': 'Normal double pane windows like any, you know, modern person. So I'm not I'm going I already have gotten the clothes. I'm ordering windows by Friday. Like there's sort of like I'm not doing any of the the like other options.'",
        "'speaker_3': 'Okay. Fair. And of course, it's your home. So, um, do you have, uh, do you have other concerns about historic designation? I mean, certainly when we spoke Windows was where the, the the crux, the dominant part of our conversation.'",
        "'speaker_1': 'Yeah, I do. I have. So my brother won't come over to my house because he has small children and my stairs are so steep that he's afraid that his kids will fall down them. In order for the stairs to be brought up to code, the landing has to move, which means the exterior door has to move.'",
        "'speaker_1': 'I've been working with an architect for six months, trying to figure out the right layout for my house, trying to figure out what we needed to do there for me to, you know, live in a house that I was excited about and.'",
        "'speaker_1': 'You know. So I think that, you know, there's that issue. There's also the issue of I have bunch of windows in my bedroom. And so you can't have like a, you know, a headboard. Right. Without it covering up the windows, I want to change the windows there.'",
        "'speaker_1': 'So I've already put in my permits. I've already done all the things. So, you know, I, I think it'll be fine. But, you know, the reality is, is like, I'm personally opposed to this because it messes up with my messes up my remodel.'",
        "'speaker_1': 'But more broadly, you know, this is just a you know, for me, I'm an affordable housing advocate. I've spent I've changed several state policies. I literally run a platform that connects low income applicants and affordable housing property managers.'",
        "'speaker_1': 'And any time you add regulatory oversight on top of, you know, housing, it's going to get more expensive. And I think that yeah, it's well, I totally agree with designating the, you know, Judge Raymond Jones home as.'",
        "'speaker_3': 'A as.'",
        "'speaker_1': 'Historic thing. I mean, you know, I think he was on the board for AARP. My company was just the you know, we we almost won the innovation challenge around affordable housing. So I love the work that you have done in your life.'",
        "'speaker_1': 'And also I'm opposed to the designation.'",
        "'speaker_3': 'Um, thank you. And yeah, thank you. No further questions.'",
        "'speaker_1': 'Thank you so much, Councilman Flynn.'",
        "'speaker_5': 'Thank you, Madam President. Pro Tem. I thank you, Councilman Hines, for raising the issue of Windows because that brings to mind an item in the application, although done in the staff report. Jennifer, could you address this? It says in the application that was filed by the the residents on the block that minor alterations, including replaced windows have'",
        "'speaker_5': 'occurred. Do we have an inventory? Do we know how many of these 19 houses have had windows replaced and were they replaced with. With original type windows, or were they replaced with a double pane windows?'",
        "'speaker_6': 'There is an inventory of buildings that went along with the.'",
        "'speaker_5': 'Application I saw and I saw the inventory. There's no mention of the replaced windows.'",
        "'speaker_6': 'They're there. Some of them do note if there were altered windows or not as appropriate. However, it does not go into such detail as what material?'",
        "'speaker_5': 'I'm sorry to say that again. It does not work.'",
        "'speaker_6': 'It does not go into such detail as the materials used are the replacement of those windows. So we don't have that information inventoried. But historic buildings clearly can still be contributing to historic district with replacement windows. Landmark preservation does not prohibit replacement of Windows, but we do ask that people consider repairing them first for the variety of'",
        "'speaker_6': 'reasons that were shared this evening, including energy efficiency, sustainability and also maintaining the original character.'",
        "'speaker_5': 'The best way to preserve a an older building, a landmark building, is to make it able to withstand and to handle the current demands of living, including energy efficiency. So are we in voting on this today? Would we be accepting any of these 19 houses that have windows that if they had already been designated, would not be'",
        "'speaker_5': 'allowed?'",
        "'speaker_6': 'I'm not sure I understand the question. Can you say that again?'",
        "'speaker_5': 'The woman here at on Steele Street. I'm sorry, Caselli. Okay. She wants to replace her windows with windows that she is concerned would not meet the landmark commission's review. Do any of the existing houses have windows that if they had already, if those houses have been designated prior to the window replacement would not be allowed to have'",
        "'speaker_5': 'the windows that they now have?'",
        "'speaker_6': 'It's hard for me to say because I don't know what the windows were that were replaced, but I am not sure that I can answer that question at this time.'",
        "'speaker_5': 'Ultimately, I'm curious if we're going to landmark structures that have windows that we wouldn't allow had they already been landmarked. It seems very inconsistent. I'm wondering, Mr. Casale, you have your Henrys. You want to come up and because you can't speak from there, do you understand?'",
        "'speaker_1': 'I think I.'",
        "'speaker_6': 'Do. And I mean, Caroline, replacing her windows is not going to preclude her home from being part of this designation. Certainly an act just like it isn't for the other buildings that are contributing, that have had replacement windows already.'",
        "'speaker_5': 'Certainly. Okay.'",
        "'speaker_1': 'Yeah. I've also gone around my neighborhood. There's lots of houses that have already had their windows replaced with vinyl windows, which would be prohibited under the current landmark rules.'",
        "'speaker_5': 'Jennifer our vinyl window replacement windows prohibited in a landmark structure.'",
        "'speaker_6': 'They are for most historic districts, with the exception of the all new Lincoln Park that you guys just.'",
        "'speaker_5': 'I'm sorry. I'm having trouble with the muffled.'",
        "'speaker_6': 'Yeah, sorry.'",
        "'speaker_1': 'I'll get hold of Mike down a little bit. So it's directed at. Yeah.'",
        "'speaker_6': 'For most historic district C us. The exception is with a Lincoln Park that does allow vinyl windows because that has become material that is used been used quite a bit over time that has become a character of that neighborhood.'",
        "'speaker_6': 'Landmark Preservation does not approve vinyl windows generally, although in some cases we do for those that are not as visible, perhaps for an egress window, for example. Do I have that correct? I guess I don't have that correct.'",
        "'speaker_6': 'We do not approve. I don't think it was at all, in part because they are not a durable material and they end up being needing to be replaced more often. And also, it's difficult to match the character of a historic window with a vinyl window as well.'",
        "'speaker_5': 'Okay. It seems to me that. Because Windows and replacement of Windows is a recurring objection that we have. And I think that's an area that CPD ought to look at and see whether we could be a little more open to preserving our landmark structures in ways that.'",
        "'speaker_5': 'That homeowners can actually afford and keep them at least looking consistent with their character, even if it's vinyl. And I would encourage CPD to do that.'",
        "'speaker_6': 'Sure. And we are actually updating the design guidelines right now. So Windows are a piece of that. And again, just to empathize.'",
        "'speaker_5': 'I saw that, right?'",
        "'speaker_6': 'Yeah. And just emphasize vinyl window replacement is not always the cheapest option for a historic property. So, you know, you could do retrofitting of historic windows that might actually be more economically efficient than vinyl replacement.'",
        "'speaker_5': 'Certainly. And I'm not arguing that we should take the cheapest route. I'm arguing that we should be flexible. Mm hmm. Thank you. Thank you, Madam President. Pro tem.'",
        "'speaker_1': 'Thank you, Councilwoman Ortega. Thank you, Madam President. Pro tem. I wanted to ask Jennifer and Annie Levinsky if you can address whether or not historic Denver Landmark Commission actually has a list of suppliers and contractors that work on historic properties that are affordable so that as people are trying to do upgrades on their homes, they're they're not'",
        "'speaker_1': 'they know they're working with somebody that has a history of working with historic properties. But. Just because their historic properties aren't necessarily gouging folks, you know, as some people perceive that, you know, they charge more because it's a historic property.'",
        "'speaker_6': 'Sure. And I'll just say we do if people ask the question of, you know, do you what sort of window suppliers, you know, have been used and other historic districts, we can provide a list that we know of, but we cannot recommend.'",
        "'speaker_6': 'You know, and there's.'",
        "'speaker_1': 'You know, also just I think having a list for people to look at is really important.'",
        "'speaker_6': 'I was going to say Annie is able to do a little bit more in that way so she can respond to that.'",
        "'speaker_1': 'Great. Thanks. So, yeah, we do remain sorry. Annie Lipinski, historic number. We do maintain a contractor resource list, a variety of different kinds of contractors. You know, I don't always get feedback from the owners on on prices. We don't see every bid that comes through.'",
        "'speaker_1': 'But we do take into account if we get, you know, complaints about someone, we'll take that into account, certainly, and not continue to to share their name. We also provide how to videos on our website, including a how to Rehab Your Historic Windows.'",
        "'speaker_1': 'So if somebody wants to do that on their own and working with partners around the country to think about how we can train more craftspeople to do that kind of work. Because I think the hardest part in Denver is just finding contractors of any kind for any type of property.'",
        "'speaker_1': 'So we're always trying to match people up and we try to answer those questions as well. We just had the carpenters union in here tonight. The construction trades should be one of those considerations that folks should be looking at as well.'",
        "'speaker_1': 'I just wanted to ask one last question to Jennifer and. I think some people perceive that because you're in a historic district, you now have to do certain upgrades to be sort of in compliance. Will you just clarify that there isn't a requirement you have to do upgrades.'",
        "'speaker_1': 'It's when you do upgrades that the guidelines kick in.'",
        "'speaker_6': 'That's correct. As I mentioned in the earlier in the presentation, I think one of the first or second slides when properties are designated, they are designated as is, and the city requires no improvements through the designation process.'",
        "'speaker_1': 'Great. Thanks so much. I have no further questions. Great. Thank you. Okay. Seeing no one else in the queue. The public hearing is closed. Comments by many members of Council on Council Bill 1365. Councilman Hines.'",
        "'speaker_3': 'Thank you, Madam President. Pro tem. I want to thank. I'm still getting used to these glasses. I want to thank CPD for the presentation. I want to thank the applicants for their hard work. I want to thank the neighbors both in and out of this designation area.'",
        "'speaker_3': 'I want to thank historic Denver for your guidance through the process and the Planning Board for hearing and unanimously supporting the designation. As we know, with the one, two, three year conversation, that doesn't always mean that council will vote the same way.'",
        "'speaker_3': 'I also want to thank Ms.. Caselli and GMB Denver for their advocacy. Our Democracy stronger when we all participate. I'm going to share a little bit about where I grew up in town, where I graduated from high school, which is called the oldest town in Texas.'",
        "'speaker_3': 'It also has human evidence of human activity data dating back 10,000 years. I moved around quite a bit when I was growing up, but when I graduated from high school, Mom and I lived in a home that was built in the 1920s.'",
        "'speaker_3': 'Yet Mom could still replace the roof for paint, the house refinished the floors and more. Mom still lives there today. Sure. Her home doesn't sit inside this proposed historic district, but I mention it. I mention it anyway to point out that it is possible to accommodate our future generations while still honoring our past.'",
        "'speaker_3': 'Congress Park is an older neighborhood. 54% of homes in Congress Park fall into the oldest designation. Homes built before 1940. There's no older designation. That is just before 1940. The southern side of Congress Park is predominantly single family homes.'",
        "'speaker_3': 'And so in this area, zoning was meant for gentle density. And I'll just put this out here now. While I recognize as as was presented in the report that this district doesn't currently allow for, it used to pop the microphone.'",
        "'speaker_3': 'Sorry, I see this as a place that would be a great location for general gentle density such as areas the missing middle can and should an owner want it be placed here. During my campaign, there was a mailer designed to place me in a negative light.'",
        "'speaker_3': 'It took something I said out of context and suggested that I wanted to place 80 plus story buildings in every area of District ten, including this area of Congress Park. The reality is that we don't need 80 plus story buildings everywhere.'",
        "'speaker_3': 'What we do need is extra density everywhere. But that density should be in context with the neighborhood. Mr. MATTHEWS, who I respect quite a lot, talked about Channel seven. There is a difference between the Channel seven building and this location.'",
        "'speaker_3': 'Channel seven with a structure that frankly does not pass the same level of scrutiny that all other historic buildings and districts have in Denver and have passed. Channel seven was built in 1969, and every one of these homes in this proposed historic designation were built before 1924.'",
        "'speaker_3': 'Even the architectural style of 1 to 3 Speer was called into question as Brutalism. Brutalism has examples here in Denver that far better represent the architectural style like Clyfford still is building the Denver Denver Federal Reserve, Denver Water and others.'",
        "'speaker_3': 'I recognize the applicant, one of the applicants for one, 2 to 3 Speer is one of the people who live in in this proposed designation. Still, I oppose the Channel seven seven designation because it didn't meet the the standard, the bar that we set for historic designation here in Denver, we must ensure our historic designation buildings pass'",
        "'speaker_3': 'all levels of scrutiny to preserve the sanctity of the program so that it is beyond reproach. We are in a housing crisis. Yes, I believe in in this mission. We need density everywhere. Denver is not for you must also be intentional about where we place density.'",
        "'speaker_3': 'And I disagree that we must have 80 plus story buildings everywhere. Not that that's what you should be saying. I'm just saying that density means different things in different areas of Denver. That's why Blueprint calls out density and in different ways.'",
        "'speaker_3': 'In different areas. Stronger density should be in other areas of District ten, like Colfax to the North Cherry Creek to the South and Capitol, Golden Triangle and uptown to the west and south and northwest. All of those are in District ten.'",
        "'speaker_3': 'We heard testimony tonight that not designating something as historic leads to scripts that cost 3 to 4 times as much as this great tome. We also heard testimony tonight that historic designation locks those homes in place and makes those homes unaffordable.'",
        "'speaker_3': 'Sounds like we're doomed either way, assuming our only criteria for judging is whether historic designation increase home increases home prices. We've also heard that historic designation makes repairs and renovation more expensive. Yet we also know that any repairs in a historically designated location currently qualify for 25% tax credits.'",
        "'speaker_3': 'Andy, I hear you. And we move to create additional density in the entire neighborhood of Golden Triangle. We blocked historic designation in 1 to 3 sphere. I personally attended multiple meetings regarding Tom's Diner and other historic designation conversations.'",
        "'speaker_3': 'I'm sorry, another historic designation conversation in District ten. The historic designation of 1272 Columbine. Also in Congress Park on our watch. This class of council passed through council without any controversy. Put another way, historic designation should be used where context makes sense.'",
        "'speaker_3': 'In this case, it makes sense. So, colleagues, I will be voting in favor of this proposed historic designation, and I hope you do as well. Thank you, Madam President.'",
        "'speaker_1': 'Thank you. Seeing no other members in queue. Madam Secretary, roll call on Council Bill 1365. Cashman. Cruz. Ortega. Sandoval. Soya. I black. I see tobacco. I like. Flynn.'",
        "'speaker_5': 'I.'",
        "'speaker_3': 'Herndon, I.'"
    ],
    "A bill for an ordinance designating Pancratia Hall at 3001 South Federal Boulevard as a structure for preservation. Approves an individual Denver landmark designation for property located at 3001 South Federal Boulevard Building 7, known as Pancratia Hall, in Council District 2. The Committee approved filing this item at its meeting on 11-30-21.": [
        "'speaker_1': 'Madam President, I. Madam Secretary, closed the voting and announced the results. Tonight. Are we showing any? I apologize. It's actually an absence. Okay. Okay. Ten Eyes Counsel Bill 21, Dash 1365 has passed. Councilmember Hines, will you please put Council Bill 1479 on the floor for final passage?'",
        "'speaker_3': 'I move that council bill 1479 be placed upon final consideration and do pass.'",
        "'speaker_1': 'Forgive me.'",
        "'speaker_3': '1429 Excuse me. Thank you. 1429. I move here, I'll just start the movement over. Move the constable. 21 dash 1429. Be placed upon final consideration and do pass.'",
        "'speaker_1': 'Thank you. It has moved and been moved and seconded. The required public hearing for Council Bill 1429 is open. May we have the staff report?'",
        "'speaker_6': 'Good evening, counsel. I'm up again. Next up is the proposed historic designation of Crucial Hall at 3001 South Heather Boulevard on the former Loreto Heights College campus, now under redevelopment as a multi-use residential and commercial node in southwest Denver.'",
        "'speaker_6': 'This designation application is the result of several years of community planning and negotiations with the property owner to ensure historic preservation of this significant landscape and the legacy of the Sisters of Laredo and Denver. The proposed designation of Pancreas to Hall as a Denver landmark resulted from those community conversations and negotiations and is the first to come'",
        "'speaker_6': 'forth for consideration. Two more will eventually be submitted. The Administration building and chapel and the process. The applicant is owner of Pan Crucial Hall Partners. It is located in the Harvey Park South Neighborhood Council. District number two, Councilman Flynn.'",
        "'speaker_6': 'The zoning is customized and resulted from the implementation of the Heights Small Area Plan. Pdg number 24 includes guidance on the treatment of Pan Crucial Hall and the other historic structures and open spaces that are being preserved for future use.'",
        "'speaker_6': 'The structure is near the end of a rehabilitation that is providing an adaptive use of the structure as affordable housing. It is a state and federal rehabilitation tax credit project. As mentioned in the previous presentation, a property must meet these criteria for historic designation.'",
        "'speaker_6': 'It has to be more than 30 years old or of exceptional importance. Meet at least three out of ten significance criteria, maintain its integrity, and be considered by the Landmark Preservation Commission for a historic context or theme. The structure built in 1930 is more than 30 years old.'",
        "'speaker_6': 'It also meets five significance criteria that you see highlighted on the screen. That is 50% of the significance criteria. It meets B, C, D and J. Parish Hall has direct and substantial association with the Sisters of Loreto and Mother Mary Pan, Croatia born Mary Lucinda Bon Fees in 1851, for whom the building was named In Memoriam.'",
        "'speaker_6': 'Both the group and person had influence on Denver society as an arm of the Roman Catholic Church, focused on education, in this case women's education. While Mother Pankhurst had died in 1915 before construction of Pan Christian Hall in 1930.'",
        "'speaker_6': 'Her individual contributions are worth noting as part of a larger legacy left by the Sisters of Loreto in Denver and the evolution of the Loreto Heights campus. The Sisters of Loreto were a North American educational order established in 1812 that followed a commitment of the Roman Catholic Church to provide schooling for its children and proliferation of the'",
        "'speaker_6': 'church itself. The sisters presence in Denver prior to the establishment of Loreto Heights Academy spanned at least two decades. In 1864, the sisters established St Mary's Academy in downtown Denver at 14th and California streets. The then 16 year old sister, Pat Christian moved to Denver and served as teacher and administrator, eventually becoming director of the academy by'",
        "'speaker_6': 'age 30. Mother, Pam Crusher, was one of the most important members of the Sisters of Loretto in Denver and related to the Bonfils family, who were well-known local benefactors. She established the Loretto Heights Academy in 1888. Her vision and that of the Sisters of Loretto is generally accredited for the success of the Sisters First Denver location, St'",
        "'speaker_6': 'Mary's Academy, as well as Loreto Heights Academy. They are responsible for the education of thousands of women. The sisters of Loreto operated Loreto Heights College until 1988, 100 years after Mother Pancreas purchased the Hilltop Property and established Loreto Heights Academy.'",
        "'speaker_6': 'Saint Mary's Academy eventually moved to the Denver suburb of Cherry Hills Village and continues to be operated by the sisters furthering their legacy. Pan Croatia Hall embodies the distinctive, visible characteristics of the collegiate Gothic style. History Colorado defines this architectural style as a combination of the Gothic revival and Jacobean Elizabethan styles.'",
        "'speaker_6': 'In Colorado, this is primarily seen in large institutional and civic buildings, and crucial hall is no exception as a large institutional building in the former Loretto Heights Academy and College campus. Parish Hall exhibits the collegiate Gothic style through common elements such as arched entrances, entrances, steeply pitched roof, intersecting gables and dormers front facade chimney and abundant multi'",
        "'speaker_6': 'light windows. Parish Hall is a significant example of recognized Denver based architect Harry W.J. Ashbrook. This collegiate, gothic style structure was a departure from Ed Burke's more common Mediterranean influenced designs like the Valverde School and former Drexel drugstore on East Colfax that you see pictured here.'",
        "'speaker_6': 'Pinkish Hall is the only collegiate, gothic style structure on the Florida Heights campus and represents a stylistic shift from the previous Richardson and Romanesque designs of various Uncle Frank Ed Brooke, who designed the Loreto Heights administration building in 1891 and the chapel in 1909.'",
        "'speaker_6': 'At the time of Parish Hall's design, Harry was in the middle of a successful architecture practice that would extend until 1946. Harry came from a line of successful architects. Born in Chicago, he was a son of Willoughby at who designed such buildings as the old U.S. Post office in Washington, DC, and nephew of Frank Easterbrook, who became'",
        "'speaker_6': 'one of Denver's most highly acclaimed architects. Harry joined his uncle's architecture practice in 1908 and opened his own independent firm in 1913 upon his uncle's retirement. He became a notable Denver architect himself, designing many well-known commercial, civic and institutional structures.'",
        "'speaker_6': 'Parish Hall was an important architectural commission for the Loreto Heights campus, and here, as it signaled the first expansion of the campus after it gained accreditation as a college and ushered in the only collegiate gothic style structure on the campus.'",
        "'speaker_6': 'Pancras to Hull represents an established and familiar feature of the Harvey Park South and College View Neighborhoods, as well as the contemporary city of Denver due to its prominent location and physical characteristics. Located on the 71 acre, lot of the former Loreto Heights College Park Crucial Hall is the only collegiate gothic style building on the campus, thus'",
        "'speaker_6': 'giving it unique and prominent physical characteristics. A five story building of red brick and accented with coast excuse me cast stone lintels. The building is easily recognizable with Celtic crosses in the front gables, ornamental finials and pointed arched chapel windows on its front facade.'",
        "'speaker_6': 'Located northwest of the administration building atop the hill, that crucial hall has maintained its prominent location over the years, making it a visible staple of the surrounding neighborhoods and city. As the surrounding land has developed by the Sisters of Loretto over many years.'",
        "'speaker_6': 'They made thoughtful decisions on landscape design to maintain the prominence and distinction of an crucial hall, while the redevelopment of the property will remove some visibility of some crucial hall from several vantage points. Its prominent location atop the hill and physical characteristics will be preserved.'",
        "'speaker_6': 'And lastly, for the significance criteria ten, Croatia Hall is associated with the following social movements institutions that contributed significantly to the culture of the neighborhood, community and city women's education, Loreto Heights Academy in College and the Catholic Church.'",
        "'speaker_6': 'It represents the Catholic Church's commitment to education through the Sisters of Loreto and our mission to specifically provide education to women. At a time when society was advancing such that the sisters established this educational movement in the quickly growing city of Denver and Pan Crucial Hall helped advance and evolve this movement in the early to mid 20th'",
        "'speaker_6': 'century. Parish Hall also signal the permanence of the sisters in what would eventually become Southwest Denver, contributing to the growth and development of the neighborhood and city. In respect to change. Over time, the property retains a high degree of integrity.'",
        "'speaker_6': 'The building is in its original location. Most of the exterior materials and design are original, with minimal repairs and alterations over time. Most alterations occurred in the interior of the structure. It's rehabilitation and adapted for use as affordable housing has resulted in exterior alterations.'",
        "'speaker_6': 'However, the rehabilitation is a state and federal rehabilitation tax for the project and the alterations are therefore follow. The Secretary of the Interior Standards for Rehabilitation, as approved by the National Park Service and Colorado State Historic Preservation Office.'",
        "'speaker_6': 'The landmark design guidelines are based off these federal standards. Per the Landmark Preservation Ordinance. Therefore, the exterior alterations are sensitive to and compatible with the structure's original character and design and consistent with landmark preservation design review. The removal of Marian Hall, formerly attached to a small section of Pan Krishna Hall at its northwest corner, affects the setting'",
        "'speaker_6': 'that existed from 1957 to 1988, when Marian Hall existed. However, the removal of the attached residence Hall restores the original pan, crucial hall setting, feeling and association. The Marian Hall removal does not negatively impact the essential physical features that make pan crucial hall architecturally significant, while the site redevelopment will have considerable impact on commercial and crucial hall'",
        "'speaker_6': 'setting. The structural steel fans maintain a high degree of overall integrity. The structure meets several distort concepts and themes with a period of significance ranging from 1930 to 1988. The addition of Pan Crucial Hall to the Loreto Heights campus in 1938 signaled the expansion and growth of the systems of Loreto and Catholic Church's mission to provide education'",
        "'speaker_6': 'and religion to women in grade levels through the Loreto Heights Academy and at the collegiate level through the newly accredited Loreto Heights College Parish Hall assumed the Academy's high school curriculum and dormitory originally housed in the 1891 administration building to make room for college courses in the administration building.'",
        "'speaker_6': 'At the time of pancreas construction, this area was still relatively undeveloped and would largely remain so until the year surrounding World War Two. Loretta Heitz would not be annexed by the city and county of Denver until 1957. The early presence and gradual expansion of the Loreto Heights campus helped spur and reflected greater development in the area.'",
        "'speaker_6': 'On campus, the sisters steadily expanded development following the construction of a crucial hall with a major building campaign in the 1950s, led by a master plan designed by landscape architect Sacco Rink de Boer. This included the 1958 additional Marian Hall, the pan crucial hall designed by architect John Monroe.'",
        "'speaker_6': 'Like other college campuses in the United States, the sisters invested in notable architects and landscape architects to design their educational institution. And crucial Hall continued this trend. Patricia Hall served an educational use for the sisters letter of Loretto from its 1930 opening until Loreto Heights College closed in 1988.'",
        "'speaker_6': 'In summary, the property meets all criteria for historic designation. It is 91 years old. It meets five designation criteria. BCD maintains its integrity and relates to several historic contexts and themes. 14 individuals have submitted emails in support of the designation and none in opposition.'",
        "'speaker_6': 'So staff recommends approval for designation of Parish Hall as a structure for preservation.'",
        "'speaker_1': 'Thank you. Thank you. We have eight individuals signed up to speak this evening. The first two are in chambers. Any Levinsky is our first speaker. Grant Bennett will be after her. Thank you. And hello again, Annie Levinsky with historic Denver at 1420 Ogden Street.'",
        "'speaker_1': 'I'm here to support this designation and really exciting to see it come to fruition after a number of years of planning with Councilman Flynn and the community members. I want to thank Grant and Jim Hartman and Susan Eli and their team for the effort to rehabilitate and reuse this building.'",
        "'speaker_1': 'I recall that when the news broke back in 2017 that Loretto Heights would be sold. Jim was one of the first calls. I got already hopeful that he could replicate a sustainable, affordable project in this location and really one of the first to commit to doing so.'",
        "'speaker_1': 'I have toured the building during construction and can attest to the care that's been given to creating more than 70 affordable units in a building that will be sustainable and safe from demolition. In light of the conversation earlier this evening, I want to underscore the recognition and designation of this building made it eligible for preservation tax credits'",
        "'speaker_1': 'at the state and federal level, and those have been successfully paired with affordable housing credits. There are numerous other examples of this happening in our city. Preservation is a partner in building a sustainable and affordable Denver, and this is a great case study.'",
        "'speaker_1': 'Additionally, I want to note that this is a site that's associated with women's history. And as we work to the first of all, our landmarks, I think it's important to recognize the women that built this very special place.'",
        "'speaker_1': 'And at a time when this was truly the edge of the city, it honor Sister Pan Krysia and the sisterhood of women that contributed to educating generations of Denver. We're hopeful that this will be the first of several great rehabilitations at Laredo Heights, including the Administrative Field Administration Building next door, which is already on the National Register'",
        "'speaker_1': 'and the Bonfils Theater on the campus, as well as inspiration for other transitioning institutional sites all around our city, demonstrating how they can be used for housing as is planned currently for the former Johnson and Wells campus as well.'",
        "'speaker_1': 'So thank you for your consideration. Thank you. Grant Bennett.'",
        "'speaker_3': 'Evening. My name is Grant Bennett. I live at 1295 South Grape Street in Denver. And thank you councilmembers for having me this evening. I represent the ownership group at Crucial Hall. My business partners, Jim Hartman and Susan Neely run a firm, Hartman Ely Investments out of Boulder.'",
        "'speaker_3': 'And my firm is proximity green and we're just so excited for the building and the opportunity for the designation tonight. Thank you for your time. I think, you know, the process has been crucial. Hall starts with what's happened at Loretto Heights, which is a community driven effort to really cherish the history of that building.'",
        "'speaker_3': 'And it's so exciting to have been part of this small area planning process that came to this council by pre-COVID with a lot big crowd in this room many years ago now and in the creation of the hall plan to create affordable housing is significant or maybe as strong as the building appears right with its with its'",
        "'speaker_3': 'peaked roof and all the architectural details that Jennifer and and Annie talk about, I think what's probably more important is the history of the social movement of the building. Right. Women's education in Denver and really on the outskirts of town.'",
        "'speaker_3': 'And then the town coming up around it are more important. And what's great about the campus is that pattern gets to continue. So the history gets to repeat itself in that we're creating affordable housing in a historically and visually structure, visually apparent and in a grand structure.'",
        "'speaker_3': 'But then that gets to continue on for many generations. That's probably I think the story that plays out in my mind is how this is going to happen over time and repeat that that pattern. What are the Sisters of Loretto told us about how if you're on scholarship at Loreto Heights, you lived in Hall.'",
        "'speaker_3': 'And so again, that affordable housing is going to continue for families living on Loreto Heights campus in the future. So we're just so excited for those outcomes and and really this story that's going to create the next generation of housing on this campus.'",
        "'speaker_3': 'So I wanted to say a big thank you to Jennifer and her staff for all the hard work. Thank you to Councilman Flynn for his support. And if you have any technical questions on any parts of the building, I can speak to this.'",
        "'speaker_3': 'Thank you.'",
        "'speaker_1': 'Thank you very much. Our next set of speakers are online. We will first go to Jim Hartman, whose name we don't see in the queue. But if you are on the phone, if you wouldn't mind raising your hand and we'll get you promoted.'",
        "'speaker_1': 'We will move on next while we're waiting for that, too. David Hagan.'",
        "'speaker_3': 'All right, Counsel, thank you for having me on again tonight. 1/2. I didn't know I was coming on that, but this is I just I'm curious and this is kind of off the topic about. But it's on topic.'",
        "'speaker_3': 'Have we looked around this property under the dirt anywhere to see about anything? Because if we are going to designate this place, we should probably make sure there's no skeletons in the closet. I also wanted to talk about history, a couple of different types of history and how I'm going to get back to the castle here with'",
        "'speaker_3': 'this one. So there's like the history. Like historically, every time Gandhi votes, city votes for the people, like historically. And then there's other people like swear that never votes for the people, that they bring the tobacco bill and they vote for the people and they use excuses as to why we want it doesn't make any sense because'",
        "'speaker_3': 'she doesn't vote for the people. That was a personal reason. Just want to say that. And that's all I have to do. Thank you.'",
        "'speaker_1': 'Our next speaker is Martha Kilpatrick. Hello. My name is Martha Newland Kirkpatrick. I live at 2339 East Floyd Place in Inglewood, Colorado, and I am a graduate of the Red of Heights College. Thank you to the Denver City Council for this opportunity to speak on behalf of and in advocacy for the proposed landmark designation.'",
        "'speaker_1': 'Increase your haul on the Right of Heights Property. I have a very long relationship with Loretta Heitz and Pancreas Hall. I grew up in Bear Valley and could see the campus tower from my bedroom window. Loretta Heitz has been part of my life for my entire life.'",
        "'speaker_1': 'It was my dear mother's dream to send me to Loretta Heights College. I graduated with a Bachelor of Arts degree in 1982. Pancreas Year Hall was the very first building on the campus that I entered in the late summer of 1978.'",
        "'speaker_1': 'It was the home of the financial aid office at that time. I was struck by how welcoming and warm that dark red brick building was. The vision launched by Mother Pancras, Siobhan fees in educating young women in a significantly modern way.'",
        "'speaker_1': 'Amidst beautiful architecture surrounded by nature and the incredible view atop mount, Loretto was honored in the naming of the first new building constructed on the campus property. 39 years after the administration building was completed. Pancras year hall was designed by Harry Edgar, nephew of Frank Edgar Brooks, who designed the administration building.'",
        "'speaker_1': 'Harry Brooks Design of King Creation Hall was a sweeping, graceful rendition of collegiate, gothic architecture and creature. Hall provided dormitory rooms, classrooms, a gymnasium and a chapel for the Academy students and later for the college students. Pay Increase.'",
        "'speaker_1': 'Your hall is being thoughtfully and lovingly restored to its former glory, where it will provide housing for deserving families and individuals who are an integral part of the Southwest Denver community. Landmark designation for this building in particular would honor many who came before.'",
        "'speaker_1': 'I fully support and request you approving the designation of Increase Your Hall. Thank you. Our next speaker online is Mary Gage.'",
        "'speaker_2': 'I am Mary Nell Gage, a sister of Loretto, residing in Lakewood and working in Denver. I respectfully request the Denver City Council.'",
        "'speaker_1': 'To affirm the.'",
        "'speaker_2': 'Landmarking of Pan Crucial Hall on the Loreto Heights.'",
        "'speaker_1': 'Campus in southwest Denver.'",
        "'speaker_2': 'As a college student in the 1960s, I was a resident of Penn Hall as the sister of Loretto. I have learned about the history of Penn Hall and about the sister of Loreto, for whom the building is named Sister Pan Krisha Boniface, one of the pioneers sisters who came to Denver in the 1800s to.'",
        "'speaker_1': 'Teach.'",
        "'speaker_2': 'First in downtown Denver at 14th in California, and then when another school was needed, founding the Loretto Heights Academy. Your action to Landmark in Croatia. Hall affirms the importance of what took place within those.'",
        "'speaker_1': 'Walls.'",
        "'speaker_2': 'The transmission of values, emphasizing knowledge, faith and service. The education of girls and women. And later man made substantial contributions to Denver.'",
        "'speaker_1': 'To Colorado.'",
        "'speaker_2': 'And beyond. Nurses. Teachers. Artists, business persons. Wives and husbands, mothers and fathers. We're educated. In the behind those walls. Fortunately, Jim Hartman and Susan Ely are repurposing the building.'",
        "'speaker_1': 'For affordable housing.'",
        "'speaker_2': 'And simultaneously honoring the interior and exterior features of this historic structure.'",
        "'speaker_1': 'Thank you. Thank you. Our next speaker online is Jesse Paris.'",
        "'speaker_3': 'Yes. Good evening. Um. Those watching at home. Those in the council chambers. My name is just Allyson Pierce and I represent four black stars and move for self defense, positive action, commercial social change as well as the East Denver Residents Council, the Unity Party of Colorado and frontline black males.'",
        "'speaker_3': 'And I'll be the next mayor of Denver in 2023. I'm in favor of the preservation summits. I, too, attended a class at Loretto Heights in the late 2000. I tend to some math courses when I was gone from my undergrad at Michigan State University, and I'm in full support of the preservation tonight.'",
        "'speaker_3': 'I'm glad to see that there's going to be affordable housing on the sites of pancakes. Huh. That is awesome. I'm glad to see that this is going to be a preservation that won't have any unintended consequences. Won't increase the land value of the area while displaced people.'",
        "'speaker_3': 'I'm very happy to hear that. So I'm in full support of this preservation. To make a good Joplin, you should have this. Thank you.'",
        "'speaker_1': 'Jesse. Our next speaker online is Test D.'",
        "'speaker_2': 'Council. Thank you for having me. I wanted to I would want to say quickly that. I. I really think that with the displacement in this one, the the issue is just like the way that we are talking about these things.'",
        "'speaker_2': 'And the issue is that the process itself and like the qualifications that I do believe that the last one, the the the House needed to be preserved. But but I just I think that I'm just curious about like what equity measures are in place because, you know, it's a little unsettling that that like the word pioneer was'",
        "'speaker_2': 'just used respectfully to the system. But, you know, Pioneer is is is there it was a word for that. A lot of people associate with colonizers and settlers who have effectively pushed indigenous folks off of their their land that they had stewarded for tens of thousands of years.'",
        "'speaker_2': 'So I'm just I'm just kind of curious about where we are with all this because and I also resent the fact that I'm the former housing historic district preservation professor man, that he that he suggested that a landing knowledge meant does not actually take into account the the people of people future generations because it actually does part'",
        "'speaker_2': 'of the land acknowledgment is actually that's embedded in them and that's part of land acknowledgment. It's not just about the past landing on or about the future, but we're not even acknowledging what's happened in the past. And how the hell are we supposed to go forward to the future anyway?'",
        "'speaker_2': 'I support this land acknowledgment. I do think that it would be great to see some more intentionality around indigenous land and land that historically black and Latino neighborhoods have been pushed out of has been forcibly removed from all of those.'",
        "'speaker_2': 'It would just be great to start historically preserving that history and not erasing it. Thank you.'",
        "'speaker_1': 'Okay. That concludes our speakers questions from members of Council on Council Bill 1429. Give us a minute. We'll clear. No questions from council. Okay. Public hearing is closed. Comments by members of Council on Council Bill 1429. Councilman Flynn.'",
        "'speaker_5': 'Thank you, Madam President. Pro-Tem, I saw that Jim Hartman was on the speaker's list, and so I texted him and he said he was not able to get on the meeting or didn't have the invite. But I want to acknowledge that he was watching the meeting.'",
        "'speaker_5': 'Jim and Susan. Jim Hartman, Susan Neely are working with Graham Bennett to accomplish this pretty amazing project as as Jennifer mentioned, this was one of the first projects. I'm sorry, Annie. Annie mentioned this was one of the first projects to come forward on the on the campus after the college to take the group closed and and sold'",
        "'speaker_5': 'it. And Jim Hartman came forward with his partners and said, we would like to. And they approached the owner of West Side and said we would like to take Parish Hall and make it an affordable housing project that fit hand-in-glove with the vision of my community when they were still in the small area planning process.'",
        "'speaker_5': 'And as Grant and Jim and Susan will well remember, in fact, we got maybe a little too far ahead of the, you know, the cart before the horse on some of this. And it caused quite a bit of struggle to get this thing across the finish line.'",
        "'speaker_5': 'The fact that this building will be used for affordable housing. One of the speakers mentioned is really a tribute to Sister Pancras, to Bonfils and this hall, and to the Sisters of Loreto. Because the spirit of Loreto. While the college does not exist anymore.'",
        "'speaker_5': 'We'll continue in perpetuity, not just through this landmark designation, but for the repurposed use of it as housing for working families, multi bedroom housing. More than half the units in here of the 74 units are multi bedroom. More than half of them are are restricted income restricted to households earning 60% or less.'",
        "'speaker_5': 'And of those, half of those are restricted to 30% or less of area median income. Embedded in this campus. So no matter what else happens here. And this will not be the only affordable housing on the campus. But whatever else happens here, this will be a tribute to the legacy of the sisters of Loreto and to Loreto'",
        "'speaker_5': 'Heights College and what it meant to my community. If I could take a moment to answer one of the questions that came up, I believe David Hagan asked if there if they found any skeletons on the property. And I can affirm that there are at least 62 skeletons on the property because the Sisters of Loreto Cemetery is'",
        "'speaker_5': 'on this property, including the remains of Sister Pan, Siobhan fees and in place of honored remembrance that will be treated most respectfully in the redevelopment. I also think it is. Wonderful that this will be, I think, the second.'",
        "'speaker_5': 'Denver landmarked building to be part of our affordable housing program. I think Tammany Hall over here on 19th Avenue is also landmarked. I don't know if I missed any that are in the affordable housing program. I got it.'",
        "'speaker_5': 'Thank you, Amy. And you know, no disrespect to Tammany Hall, but for my money, Pan Crucial Hall is just a remarkably beautiful building, a work of a tremendous architect who had great influence on Denver. Obviously, in my view, it meets all of the criteria and it will not be the last structure on this campus to be landmarked'",
        "'speaker_5': '. We look forward to receiving more landmark applications for the other some of the other structures that were outlined in the development agreement, particularly the what they call the administration building, what I call Loretto Academy, the original building on the campus with the bell tower.'",
        "'speaker_5': 'I want to close my remarks, Madam President, pro tem, if we did not hear from her in person tonight, but we did receive written support from a constituent of mine, Jackie Martinez Wells. Who wrote to us that for her?'",
        "'speaker_5': 'No, she didn't go to the college here. She didn't have any association with the institution except for one day that sticks with her over the decades when she was a nine year old girl living in near the Platte River.'",
        "'speaker_5': 'On a afternoon in June of 1965, she clearly remembered Denver police going down her street with an announcement to evacuate the river bottoms because a flood was coming on the South Platte. And a lot of folks remember the great South Platte flood of 1965.'",
        "'speaker_5': 'Jackie and her family were evacuated to Pancreases Hall and to the campus where the Red Cross already had set up space for evacuees along the river. And she wrote to us that for her, this building, which she now lives within two, three blocks of, she lives just to the west of the campus.'",
        "'speaker_5': 'She and David. To her. This represents safety and security. And she has never forgotten that weekend, that week in 1965 when she was evacuated to Panama. My point in raising that is that this site is meaningful not just to the women who went there, not just to the sisters of Loreto and not just to the many alumni'",
        "'speaker_5': 'over the years. This site is significant to my entire southwest Denver community because of its prominent site on the Hilltop. And because of the legacy that it creates and for the future that the site represents. So for all those reasons.'",
        "'speaker_5': 'Madam President, I would ask for the support of all my colleagues in approving this designation. Thank you.'",
        "'speaker_1': 'Thank you, Councilman Flynn. With no others in the queue. Just want to offer my support on this. And congratulations on finally putting a landmark in between sixth and Hamden, west of I 25. We have an absolute dearth of landmarked locations in West and southwest Denver, so congratulations and I look forward to supporting.'",
        "'speaker_1': 'Madam Secretary, roll call on Council Bill 1429.'",
        "'speaker_3': 'When I heard him, I heard my.'",
        "'speaker_1': 'Classmate Kenny Ortega. I swear I block. I see the Barca, I. Madam President, I. Madam Secretary, close the voting and announce the results tonight. Ten Eyes Council Bill 21 1429 has passed pre adjournment announcement on Monday, January 10th, 2022.'"
    ]
}