{
    "A resolution approving a proposed Contract between the City and County of Denver and HNTB Corporation concerning on-call geospatial support services at Denver International Airport. Approves a contract with HNTB Corporation for $700,000 and for three years, with two one-year options to extend, for on-call geospatial support services including airport geospatial surveying, data management, data analyses, modeling, surveying and scanning, civil engineering and cost estimation at Denver International Airport (202054609). The last regularly scheduled Council meeting within the 30-day review period is on 11-29-21. The Committee approved filing this item at its meeting on 10-26-21.": [
        "'speaker_0': 'Council member Sawyer has called out Bill 20 1-1192 for a vote. Under pending, no items have been called out. Madam Secretary, would you please put the first item on our screens? Thank you. Councilmember Cashman, will you please put council resolutions?'",
        "'speaker_0': 'One, two, four, four and one, two, four or five on the floor for adoption?'",
        "'speaker_3': 'Yes. Council President and I move the council resolutions 21, dash 1244 and 21, Dash 1245, be adopted in black.'",
        "'speaker_0': 'Thank you. It has been moved and seconded comments by members of Council on Council Resolutions. One, two, four, four and one, two, four, five. Councilmember Sawyer.'",
        "'speaker_8': 'Thanks, Madam President. These are airport on call contracts. You know, we see these almost every week come through from one agency or another. So, as you know, I disagree with the use of these without proper reporting to us.'",
        "'speaker_8': 'So going to vote no and don't need to take anybody else's time up. Thanks.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer. Madam Secretary, roll call on Council Resolutions 21, dash one, two, four, four and 21. DASH one, two, four, five, please.'",
        "'speaker_7': 'Ortega.'",
        "'speaker_1': 'I. Sandoval.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Sawyer. No. Torres, I black. I see tobacco.'",
        "'speaker_5': 'I cry.'",
        "'speaker_1': 'I swim.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon. Himes. All right. Cashman. I can each i. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_1': 'One May 12 eyes.'"
    ],
    "A bill for an ordinance amending Ordinance No. 591, Series of 2021, as amended by Ordinance No. 706, Series of 2021, as amended by Ordinance No. 1145, Series of 2021, to allocate spending in the American Rescue Plan Act Grant Fund for Recovery, Revenue Loss, and Administration. Amends Ordinance No. 591, Series of 2021, previously amended by Ordinance No. 706, Series of 2021, to allocate a total of $100.1 million in spending in the American Rescue Plan Act (ARPA) Grant Fund, including $25.3 million in the Revenue Loss category to accommodate the 2022 portion of the allocation approved in Ordinance No. 706, Series of 2021 that will continue to be supported by ARPA, $73.5 million in the Recovery category, $1.3 million in the Administration spending category, which will be reallocated from unspent dollars in the initial Revenue Loss category, and approves a capital equipment purchase of a van for the Wellness Winnie program. The Committee approved filing this item at its meeting on 10-12-21.": [
        "'speaker_0': 'One day 12 eyes. Council Resolution 20 1-1, two, four, four and 20 1-1, two, four, five have been adopted. Madam Secretary, would you please put the next item on our screens? Councilmember Cashman, would you please put Council Bill 1192 on the floor for final passage?'",
        "'speaker_3': 'Yes, Council President. I move the Council Bill 21 dash 1190 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It's been moved and seconded. Comments by members of Council on Council Bill 1192. Council Member Sawyer.'",
        "'speaker_8': 'Thanks on President. I made my comments last week, so nothing really to add. Just wanted to again thank Finance for their thoughtful decision making process and really appreciate all of their partnership, but just not willing to support $4 million for social services, something that my district feels really strongly about.'",
        "'speaker_8': 'You know, this is meant this money meant for long term investments. And so US sites are not a long term solution. So I'm going to be a no thanks.'",
        "'speaker_0': 'All right. Thank you, Councilmember Sawyer. Madam Secretary, roll call on Council Bill 21, dash 1192, please.'",
        "'speaker_1': 'Ortega. I. Sandoval.'",
        "'speaker_2': 'I. So, you know.'",
        "'speaker_1': 'For us, I. Black. I see tobacco. I. Clark. I. Flinn.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'Herndon.'",
        "'speaker_3': 'Hi.'",
        "'speaker_1': 'Cashman. I can eat. I. Madam President.'",
        "'speaker_0': 'I. Madam Secretary, please close the voting and announce the results.'",
        "'speaker_1': 'One 812 Eyes.'",
        "'speaker_0': '12 Eyes. Counsel build 20 1-1192 has passed. That concludes the items to be called out this evening. All bills for introduction are ordered published. Council members remember this is a consent or bloc vote and you will need to vote I.'",
        "'speaker_0': 'Otherwise, this is your last chance to call out an item for a separate vote. Councilmember Cashman, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_3': 'Yes, Council President. I move the resolutions be adopted and bills and final consideration be placed upon final consideration and do pass in a bloc for the following items. All series of 2021 1242 1243 1244 Excuse me 1224 1225 1241 1236 1237 1238 1080 1228 1233 1240 1246 1205 1209 1000 and that should do it.'",
        "'speaker_0': 'All right. Thank you, sir. It has been moved and seconded. Madam Secretary, roll call, please.'",
        "'speaker_1': 'Ortega. By Sandoval.'",
        "'speaker_2': 'I.'",
        "'speaker_1': 'Black. I see tobacco. I. Clark.'",
        "'speaker_3': 'I.'",
        "'speaker_1': 'FLine, my friend. In hindsight. Cashman. I can age. I. Sawyer, i. Torres, i. Madam President, i.'",
        "'speaker_0': 'Madam Secretary, close the voting and announce the results.'",
        "'speaker_1': '13 eyes.'",
        "'speaker_0': '13 eyes. The resolutions have been adopted and the bills have been placed upon final consideration and do pass. Our pre recess announcement this evening. Tonight there will be a required public hearing on Council Bill 20 1-1030, changing the zoning classification for 1090 South Dayton Street in Windsor.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1090 South Dayton Street in Windsor. Approves a map amendment to rezone property from S-SU-I to OS-B (suburban to open space), located at 1090 South Dayton Street in Council District 5. The Committee approved filing this item at its meeting on 9-14-21. Community Planning and Development has determined that the requirement for a legal protest (signatures by the owners of 20 percent or more either of the area of the lots included in the proposed change or of the total land area within 200 feet from the perimeter of the area proposed for change) has been met (petition signatures represent 0% and 31%, respectively).": [
        "'speaker_0': 'We have two public hearings tonight for those participating in person. When called upon, please come to the podium on the presentation monitor. You will see your time counting down for those participating virtually when called upon. Please wait until our meeting hosts promote you to speaker.'",
        "'speaker_0': 'When you are permitted, your screen will flash and say Reconnecting to meeting. Please don't leave the meeting. You will be reconnected and willing to turn on your camera. If you have one and your microphone, you will see your time counting down at the bottom of your screen.'",
        "'speaker_0': 'Once you've finished speaking, you will change back to participant mode and see your screen flash one more time. All speakers should begin their remarks by telling the council their names and cities of residence and if they feel comfortable doing so, their home addresses.'",
        "'speaker_0': 'If you've signed up to answer questions, only state your name and note that you are available for questions of council speakers. It will have 3 minutes. There should be no yield in of time. If translation is needed, you will be given an additional 3 minutes for your comments to be interpreted will alternate between in-person and virtual for'",
        "'speaker_0': 'efficiency by calling in-person participants and then alternating to virtual participants. Speakers must stay on the topic of the hearing and must direct their comments to the council members. Please refrain from profane or obscene speech. Direct your comments to council as a whole, and please refrain from individual or personal attacks.'",
        "'speaker_0': 'Councilmember Cashman, will you please put Council Bill 1030 on the floor for final passage?'",
        "'speaker_3': 'Yes, Council President. I move that council bill 21 dash 1030 be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The required public hearing for Council Bill 1030 is open. May we have the staff report and we have Libby Adams here.'",
        "'speaker_2': 'Yes, thank you. Okay. So I think you council president and council. I'm Libby Adams of Community Planning and Development and I'll be presenting the MAP Amendment at 1090 South Dayton Street. So this application is located in Council District five in the Windsor neighborhood.'",
        "'speaker_2': 'This two acre site is located on the northeast corner of Mississippi Avenue and Dayton Street, at the edge of the city near Arapahoe County. The applicant is requesting to rezone from U to open space B, which allows for parks and open spaces not owned or operated by the city.'",
        "'speaker_2': 'And the applicant plans to locate a private outdoor swim club on the site. So as stated previously, this property is currently zoned suburban single unit. IE this allows for single unit civic, institutional and educational uses in the suburban house building form and requires a minimum zone.'",
        "'speaker_2': 'Lot of 12,000 square feet. The site is currently vacant, although there are single unit land uses to the north, east and south and then there's a school just to the west. So this slide shows the existing building form and scale with the subject property on the bottom left hand side.'",
        "'speaker_2': 'You can see the school that's in Arapahoe County on the top left, and then to single unit homes in both Denver and Arapahoe counties. So a postcard notifying property owners within 200 feet of the site was sent out on July 1st.'",
        "'speaker_2': 'And then on September 1st. This went to planning board where one resident spoke in opposition and planning board recommended unanimously to recommend approval. So to date, staff has received 15 comment letters in opposition of the proposed rezoning and a statement of opposition signed by 69 residents.'",
        "'speaker_2': 'The concerns were mostly regarding traffic and the site receiving access from Emporia Street. The Denver Department of Transportation and Infrastructure typically requires access from the street with the lowest classification. So in this case, Emporia Street, which is the local street, as this will create less vehicle conflict points.'",
        "'speaker_2': 'Other comments cited concerns about wastewater and storm drainage in the area and that this property should be developed under the existing single unit zoning. And so at the time of development, the applicants will need to demonstrate that on site in an onsite drainage report that no adverse impacts to the historic drainage patterns will occur as a result'",
        "'speaker_2': 'of the development. And additionally, I want to note that traffic and wastewater impacts are typically reviewed at the time of site development plan when a specific development is proposed, and then the Council offers recommended mediation and hopes the applicant could reach a good neighbor agreement with the neighbors regarding these concerns around traffic.'",
        "'speaker_2': 'And when the applicant expressed their interest interest in mediation, when the mediator reached out to them. However, neighboring property owners were unwilling to participate in the mediation process, so it did not move forward. And then a successful protest petition has been submitted, which requires an affirmative vote from ten council members for this rezoning.'",
        "'speaker_2': 'So, you know, as briefly stated previously, any potential side impacts that are related to a specific development project will be reviewed at the time of site development plan. So at that time, transportation engineers will identify if mitigation measures are required for a particular project.'",
        "'speaker_2': 'So kind of moving to the rezoning. The Denver zoning code has five review criteria that must be met in order for rezoning to be approved. The first criterion is consistency with adopted plans, and there are two plans that are applicable to the site.'",
        "'speaker_2': 'This rezoning meets several of the goals and comprehensive plan 2040, but I'll just mention a couple. It will improve access to resources that improve quality of life, and it will promote development where if infrastructure is already in place.'",
        "'speaker_2': 'And then Blueprint identifies the future neighborhood context as suburban and parks and open spaces are important and necessary land uses within all of our neighborhood contexts. They are also found in all of our neighborhood contexts, and they help make our city neighborhoods complete.'",
        "'speaker_2': 'And then Blueprint identifies the future place type as low residential, so similar to the suburban single unit districts which make up most of low residential areas. OSB allows for civic, institutional education, cultural park and open space, and then public and religious assembly uses and then Mississippi Avenue and is a residential arterial south Dayton is identified as a'",
        "'speaker_2': 'residential collector and then Emporia Street as a local street. And residential streets are primarily residential uses, but also may include schools, civic uses, parks and small retail nodes, which is consistent with the OSB zoned district and then the growth area strategy and blueprint.'",
        "'speaker_2': 'Denver is all other areas of the city, so this is where we expect to see 10% of employment growth and 20% of housing growth by 2040. So by allowing active and passive recreation uses on the site, that will increase job growth by a limited amount.'",
        "'speaker_2': 'Staff also finds the requested rezoning meets the next two criteria. The rezoning will result in uniformity of district regulations and will further the public health, safety and welfare by enabling more opportunities for recreation uses and allowing a park use which are compatible with the surrounding residential uses.'",
        "'speaker_2': 'Staff finds there is a justifying circumstance for this MAP amendment. With the new infill development found in both Denver and Arapahoe counties creating a greater need for more recreation opportunities. And lastly, the proposed zoning is consistent with the open space contexts and the specific intent of the OSB district.'",
        "'speaker_2': 'So based on the review criteria, staff recommends approval of this requested MAP amendment. And that concludes my presentation.'",
        "'speaker_0': 'All right. Thank you for a great presentation, Libby. And it looks like we have nine speakers, nine individuals signed up this evening. All of them are joining us online. And our first speaker is Joseph Skinner. And we know, Joseph, you're online and we have a Lydia Skinner.'",
        "'speaker_0': 'And so if you can raise your hand, if that's you, Joseph, we'll go ahead and get you moved over. Okay. You can go ahead, Jason.'",
        "'speaker_4': 'Good evening. I'm Joseph Skinner, and I'm here with my wife, Lydia Skinner. We. We're the applicants for the rezoning of 1090 South eighth Street from SW single district to OSB open space.'",
        "'speaker_2': 'I'm standing on individuals. We're not associated with any large organization and are under contract on this undeveloped parcel located within District five with the intention of creating a seasonal outdoor swim club as a proposed use. Our vision is to build a community asset that would include an open air pool, children's ward, a pool area greenspace and a'",
        "'speaker_2': 'community space for gathering is for Memorial Day to Labor Day. Each year we want to create a community oasis that can be thought of as an extension of one's own backyard.'",
        "'speaker_4': 'Rezoning from SSI to OSB will promote infill development where infrastructure and services are already in place. We believe changing conditions in the area provided justifying circumstance because there are significant numbers of new infill residences in both Denver and Arapahoe County and a demand for more recreation option opportunities.'",
        "'speaker_4': 'Rezoning to OSB will allow for more park and recreation uses in this growing area. While there are other rezoning designations that we could have potentially fit our proposed use, we believe Open Space Recreation District is the most appropriate and shows our commitment to investing in the community.'",
        "'speaker_1': 'In terms of community.'",
        "'speaker_2': 'Engagement, where we socialize the rezoning proposal with council menswear and the President and the Range V Neighborhood Association, Roger Miller at the beginning of May, we also mail the letter to each home in the R.A. to introduce ourselves the rezoning and proposed use, as well as invite interested individuals to meet with us in person at the parcel'",
        "'speaker_2': 'to learn more. This informal meeting took place on May 20th. We also reached out to the Chan School across the street, and the school district expressed written interest in entering a joint use agreement with us to utilize each other's parking as overflow.'",
        "'speaker_2': 'This coincides while given that our operational months would be opposite, the outdoor swim club would be open when school's out for summer and closed when school is in session. After the first hearing, when neighbors writing concerns over increased traffic, we met on three separate occasions with the mediator that Councilwoman Soaries offers put us in contact with.'",
        "'speaker_2': 'We were open to having a discussion with the neighborhood as a whole and in particular with the residents who submitted concerns. However, the few residents in opposition opted not to engage in mediation from both the informal meeting with residents and multiple one on one conversations with neighbors over the past several months.'",
        "'speaker_2': 'We have received positive feedback and excitement at the rezoning and proposed use.'",
        "'speaker_4': 'In conclusion, we are excited at the prospect of creating an asset for the Windsor community by rezoning from SSI to SB. And we thank you all for your time.'",
        "'speaker_0': 'Thank you. Our next speaker this evening is Jackie Boyer.'",
        "'speaker_1': 'Can you hear me? Yes. Okay. My name is. Good afternoon, counsel. My name is Jackie Beauregard. I reside in District five. I've been a homeowner in the range neighborhood for over 40 years. This is an area located adjacent to the High Line Canal Trail and 15 to 20 minutes for most of the minutes.'",
        "'speaker_1': 'Jim here to. I and many of my neighbors chose to leave here because of the fighting feel of the neighborhood, the high line trail and the family friendly Bean Basin Park. There's a park, has trees, green grass, lounge or play on grills and a children's play area.'",
        "'speaker_1': 'The applicant seeking the change wrongly believe that changing to OSB would be adding value to our community. There is no way that a zone change from SS youth on to OSB would be beneficial to range view. We, the voters of Denver spoke loud and clear on November 2nd.'",
        "'speaker_1': 'We want our voices to be heard when our neighborhoods of being. We imagine constituents want to have a say about what would, should or could be done in our neighborhoods. We do not want decisions made for us under the guise of what is good for us and or the city.'",
        "'speaker_1': 'I implore all of you to please vote no on 21. 1030. Thank you for this.'",
        "'speaker_0': 'Thank you. Our next speaker joining us online is David Hagan. Okay. It looks like we don't have David Hagan on. So we'll go to our next speaker, Tony Miller.'",
        "'speaker_1': 'Yes. Can you hear me? Yes. Thank you. My name is Tony Miller and I live in.'",
        "'speaker_2': 'Denver at 980 South Emporia, adjacent to the 1090 South Dayton property.'",
        "'speaker_1': 'I've never previously.'",
        "'speaker_2': 'Opposed any rezoning efforts anywhere, but.'",
        "'speaker_1': 'This time I feel compelled to. Prior to the September.'",
        "'speaker_2': '1st Planning Board hearing, I submitted extensive written comments.'",
        "'speaker_1': 'When this.'",
        "'speaker_2': 'Rezoning application was approved by the Planning Board and the Land Use Transportation and Infrastructure Committee meetings. Despite my and others objections, I began to explore what else could be done to express our opposition.'",
        "'speaker_1': 'Since no.'",
        "'speaker_2': 'Range View registered neighborhood organization meeting has been held.'",
        "'speaker_1': 'With regard to this.'",
        "'speaker_2': 'Rezoning application, no official R.A. position statement or comments.'",
        "'speaker_1': 'Could be filed.'",
        "'speaker_2': 'Circulating a protest petition appeared to be the only way left to demonstrate the level of my and my neighbors opposition to this unjustified rezoning application. A neighbor and I gathered signatures of 23 owners.'",
        "'speaker_1': 'Of.'",
        "'speaker_2': 'More than 20% of the land area within.'",
        "'speaker_1': '200 feet outside.'",
        "'speaker_2': 'The 1090 South Dayton property and.'",
        "'speaker_1': 'Hand-Delivered this petition to council. Also want to address comments.'",
        "'speaker_2': 'Tonight that there has been no good neighbor agreement. Inexplicably, just days before the September.'",
        "'speaker_1': '14th.'",
        "'speaker_2': 'Land Use Transportation and Infrastructure Committee meeting.'",
        "'speaker_1': 'We learned the council office had.'",
        "'speaker_2': 'Asked mediation specialist Steve Charbonneau to reach out to.'",
        "'speaker_1': 'Mediate a resolution.'",
        "'speaker_2': 'Well, what is there to mediate? During both.'",
        "'speaker_8': 'The planning.'",
        "'speaker_1': 'Board and.'",
        "'speaker_2': 'The committee meetings. There were multiple reminders.'",
        "'speaker_1': 'That this application is.'",
        "'speaker_2': 'About the rezoning of the.'",
        "'speaker_8': 'Property and the free.'",
        "'speaker_2': 'Zone. There is no guarantee a swim club will actually be built there.'",
        "'speaker_1': 'The CPD staff report states that OSP mainly allows.'",
        "'speaker_2': 'Cultural special purpose parks and open space.'",
        "'speaker_1': 'Uses some.'",
        "'speaker_2': 'Educational, civic entertainment and recreation.'",
        "'speaker_1': 'Uses.'",
        "'speaker_2': 'And some institutional and public and religious assembly uses. So we don't even have a clear understanding of what could be built here.'",
        "'speaker_1': 'Under this proposed rezoning.'",
        "'speaker_2': 'Until we can see.'",
        "'speaker_1': 'A detailed site.'",
        "'speaker_2': 'Plan and.'",
        "'speaker_8': 'Specifics.'",
        "'speaker_1': 'Of the actual.'",
        "'speaker_2': 'Proposed project. And there's some reasonable assurance of this proposed development. Not something entirely different will take place. There's no way to know what issues or.'",
        "'speaker_1': 'Concerns we may.'",
        "'speaker_2': 'Have, and therefore nothing to mediate with the applicants. The highly objectionable access to this property.'",
        "'speaker_1': 'Off our.'",
        "'speaker_2': 'Quiet residential neighborhood street is.'",
        "'speaker_8': 'Not within the applicant's.'",
        "'speaker_2': 'Control to negotiate.'",
        "'speaker_1': 'I hope you hear us.'",
        "'speaker_2': 'The people who actually.'",
        "'speaker_1': 'Live in this neighborhood and that.'",
        "'speaker_2': 'You vote tonight to deny this rezoning application, there's absolutely no justification to rezone this property. It's accurately zoned as an extension of our suburban residential neighborhood. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker this evening is Paul Miller. And we don't see a Paul Miller in the Zoom meeting, but we do have two phone callers. And so if you could raise your hand, Paul Miller, we'll get you into the queue.'",
        "'speaker_4': 'Hi. Can you hear me?'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'Hi. My name is Paul Miller and my Denver home is at 90,004. You adjacent to the 1090 South Dayton property. I received a flier from the Skinners postmarked May eight. It said that they were writing to introduce an exciting project proposal for our district, a seasonal outdoor swim club.'",
        "'speaker_4': 'The second paragraph led neighbors to believe this would be a community pool and open space for our neighborhood residents to use. As it said, our vision is to develop a new community focal point that would include an open air pool, children's ward, dep area, greenspace and community space for gatherings.'",
        "'speaker_4': 'The fliers said they would be on site at 6 p.m. on May 20th to share their plan to preserve greenspace and promote recreational use and surrounding neighborhood. Most people who received this flier came away with the impression that this is a proposal for a pool and open space for community use, not a private member only facility and'",
        "'speaker_4': 'did not even bother to go to the informal onsite meet and greet. My wife and I did attend, but the Schooners told attendees that no site plan was available and that the city would tell them where the access would be to the property.'",
        "'speaker_4': 'At that time, I and most other residents also didn't understand that rezoning of this property doesn't guarantee that the proposed swim club would actually go in or be built. Now that something else has been identified and potentially less desirable could be built under OSB zoning or have an idea that the point of access to this property is'",
        "'speaker_4': 'from our residential south and history, and not from East Mississippi or South Dayton. Despite being told that a range view registered neighborhood organization meeting was going to be held in May and subsequent requests for a meeting by some of my neighbors no are in the meeting has been held to address this rezoning application.'",
        "'speaker_4': 'Instead, it has been left up to the individual neighbors such as myself, to learn the facts. In my opinion, this rezoning application is somewhat disingenuous and misleading and includes unsupported claims to make their case. There's absolutely no community need or unfulfilled demand that justifies changing the current zoning of this property.'",
        "'speaker_4': 'Changing the current zoning of this property will degrade or normally quiet neighborhood. I did submit detailed written comments last week, but also wanted to explain that I believe far more people who live in our neighborhood would have expressed their opposition sooner had they not been misled.'",
        "'speaker_4': 'Thank you very much, Council.'",
        "'speaker_0': 'Thank you. Our next speaker this evening is joining us virtually as well, Jessie Paris.'",
        "'speaker_4': 'Yes. Good evening. Member of the council. Can I be her?'",
        "'speaker_0': 'Yes.'",
        "'speaker_4': 'My name is Jessica Sampras and I'm representing Black Sox to move for self-defense. How's the Mexican-American salsa changed? Was the Unity Party of Colorado in a front line? Black males. And I'll be there next November in 2023. I reside in District eight and Christopher Hernandez district.'",
        "'speaker_4': 'I'm against this proposal tonight for all the reasons that the speakers previous to me have spoken just did not get proper approval from the Arnolds. There's no neighborhood agreements. There's no guarantee that this is going to be a swimming pool or club.'",
        "'speaker_4': 'There was one speaker in opposition, a planning board. There are 15 letters of opposition. And 69 residents and signed a letter of opposition. So I agree with Jackie on Tony and John that this is not a good thing for this neighborhood.'",
        "'speaker_4': 'So I would ask that you not vote in favor of this rezoning tonight for 21, 1030. Thank you.'",
        "'speaker_0': 'Thank you. Our next speaker is Linda Rhea.'",
        "'speaker_1': 'Lenny Ray, can you hear me? Yes.'",
        "'speaker_2': 'Thank you for allowing me to testify.'",
        "'speaker_1': 'My name is Linda Ray. I live at.'",
        "'speaker_2': '940 South Emporia.'",
        "'speaker_1': 'And I have.'",
        "'speaker_2': 'Submitted written testimony. And so I will let that stand. And I'm here primarily to answer any questions you may have about that. But I certainly want to emphasize the points made by the earlier participants who talked about how misleading this has been, how rushed, how truncated in terms of our being able to get information.'",
        "'speaker_2': 'It has been a very exasperating experience and it did.'",
        "'speaker_1': 'Not need to be that way. So I will let my comments stand as written, and I'm just available to answer any questions. Thank you.'",
        "'speaker_0': 'Thank you. Our last speaker is Tess Dougherty.'",
        "'speaker_2': 'I'm sorry, did you did you call in?'",
        "'speaker_0': 'Yes, you can. Go ahead. Oh.'",
        "'speaker_2': 'I'm so sorry. Okay. So I think I think I put down that I was opposed. I guess I actually don't I don't necessarily have an opinion on the one way or another. I mean, I just haven't really made up my mind.'",
        "'speaker_2': 'But but I just think that, um. That. The outcome of this decision tonight will be pretty telling, given that the DiNardo hearing, if I remember correctly, it was about that part of the meeting was about 4 hours long because of how many people testified against the development.'",
        "'speaker_2': 'And you all went ahead and approved it anyway. And so, you know, it would just it'll just be pretty interesting to see how how this zoning application, the outcome of it, given the the protest letters and who you listen to in the city city council.'",
        "'speaker_2': 'And I hope that I hope that all the residents protesting I you know, we hear you in District nine. We do. We hear your we hear your frustration. And I just I would just implore I would just hope.'",
        "'speaker_2': 'And I invite you to to to join us because, you know, we've we've these zoning applications, these types of decisions that are made without community input. These are the types of things that happen week after week in District nine.'",
        "'speaker_2': 'And to this part of the city and and this city council tends to just ignore that, to ignore the residents and to go ahead with the development, the unfettered development that and the mayor's agenda here in Denver. And and it's pretty it's pretty gross.'",
        "'speaker_2': 'It's pretty it's pretty traumatic and inhumane. And and this happens all the time. And so I would just invite you to to join other other districts, other people in other districts of the city who who are also experiencing something similar.'",
        "'speaker_2': 'At the same time, I do think that that oftentimes resisting development is a form of is a is a form of, you know, preserving the status quo in a city that needs more, that needs, you know, vacant land is a pretty hot commodity.'",
        "'speaker_2': 'And people, you know, people like other people in other neighborhoods need to kind of be willing to to also take on that some of that burden that's been disproportionately placed on certain neighborhoods in the city. So, you know, I think that I as a as a former lifeguard, I think I think swimming is fun.'",
        "'speaker_2': 'So. And I would I would say that at no zoning, do do we ever know or have a guarantee of what the development is going to be? So this your your experience is not unlike any zoning. The site plans don't happen until after the zoning is.'",
        "'speaker_2': 'And so they're not voting on the site plans tonight. They make that very clear. And that indeed is part of their reasoning sometimes for why they vote in opposition of the of the of this residents. Thank you.'",
        "'speaker_0': 'That concludes our speakers this evening. Questions from members of Council on Council Bill 1030 and we have council member soil here.'",
        "'speaker_8': 'Thanks, Madam President. Thank you for being here.'",
        "'speaker_1': 'So can you.'",
        "'speaker_8': 'Explain what would be allowed? What forms would be allowed on the USA? What I say. Which is or is. I'm sorry. ASU eyesight, which is what it is now.'",
        "'speaker_2': 'Yeah. So it would allow the suburban house building form, but you could do a variety of uses. So obviously single unit, but you could also do like a library for example, is allowed in that district, but it would have to be within the suburban house building form.'",
        "'speaker_8': 'Got it. Okay. So if it's zone to OSB. Then what could go on that site, assuming that the swimming pool idea falls to pieces and then it's just risen to OSB with nothing there? Yep.'",
        "'speaker_2': 'So the general building form is the only building form permitted in OSB, but it allows for. Actually, I can pull up. I have a slide that shows the differences between SC I and I see an OSB.'",
        "'speaker_8': 'That'd be great, if you don't mind. Yeah.'",
        "'speaker_2': 'Yeah. So you can see the it does allow for about five feet greater height, but the setbacks are greater in OSB so they have to be 20 feet from the sides rear front versus they're just five feet from the sides and see why.'",
        "'speaker_2': 'And then they use uses. I've highlighted the ones that are different. So the main differences is as you I would allow for like residences, residential care as well as like a postal facility and then OSB would permit a cemetery, museum, arts, recreational entertainment, parking garage and then agricultural uses.'",
        "'speaker_1': 'Okay.'",
        "'speaker_8': 'In addition to.'",
        "'speaker_2': 'To all the other. Yeah. But all the other ones that are not bold are the ones that are the same that are. But.'",
        "'speaker_8': 'Okay, I understand what you're saying. So. So in if I'm looking at this properly, in the ACP side, you still have communities that are daycare, library, open space, all of those included on the OSB side as well, in addition to these other ones.'",
        "'speaker_8': 'Yep. Okay. I see what you're saying. And so let me just make sure I understand and it's and it's super clear to me. So the primary st setbacks are the same. Correct. Both of those own districts. But the setbacks for the side street and the interior, 15 feet more.'",
        "'speaker_1': 'Per.'",
        "'speaker_8': 'Side.'",
        "'speaker_2': 'Correct. And I would additionally add, although I know we don't speak about specific projects, but what they're proposing would have to actually be 50 feet. The an outdoor pool, an outdoor use like that would have to be 50 from any residential use.'",
        "'speaker_2': 'Okay.'",
        "'speaker_8': 'So the if they're if they do get this rezoning and they do have a pool that they end up putting on this, what does that mean for like for the parking lot? Right. So if there's a parking lot, does the step back on the parking lot then have to be that 20.'",
        "'speaker_2': 'Feet on all.'",
        "'speaker_8': 'Sides as.'",
        "'speaker_2': 'Well? That's a this is for the building. A structure would have to be 20 feet. But the parking I don't know. I would have to get back to you on that.'",
        "'speaker_8': 'Do you know that by any chance? Sorry, dude.'",
        "'speaker_10': 'I'm sorry, Councilwoman, I missed the question.'",
        "'speaker_8': 'So as we're looking at the difference between the two zone districts on this slide, the side street setbacks and the interior setbacks are 15 feet greater in the Osby zoning than they are in the assessed zoning. So I'm I understand that that is for the building form.'",
        "'speaker_8': 'Is that also true for, say, a parking lot if this pool ends up being built there, if they get the rezoning.'",
        "'speaker_10': 'The parking lot would not have the same setback as as a structure.'",
        "'speaker_8': 'Okay. So is that something that can be negotiated in a good neighbor agreement?'",
        "'speaker_10': 'Yeah. There would be like build to requirements and particular landscaping requirements that the applicant would still have to meet. So that might provide a buffer, but it wouldn't necessarily be the same as a setback.'",
        "'speaker_8': 'Got it. Okay. So and so since you mentioned like landscaping, is that something that could be negotiated and a good neighbor agreement?'",
        "'speaker_10': 'Yes.'",
        "'speaker_8': 'And the parking setback of the parking lot is something that could also be negotiated in a good neighbor agreement.'",
        "'speaker_10': 'Yes.'",
        "'speaker_8': 'Okay. What other kinds of stuff could be negotiated in that kind of agreement.'",
        "'speaker_10': 'In a good neighbor agreement? You know, the neighbors and the applicant can work through just about anything. I mean, that's that's really sort of the foundation of zoning is that folks got together and they said, oh, we like this particular area and we don't like that.'",
        "'speaker_10': 'Or that's how they that's how you come up with setbacks and what type of uses are allowed and all that. So I mean, it, it would be privately enforced. So there is any number of items that that is on the table when it comes to good neighbor agreements.'",
        "'speaker_8': 'Got it. Okay. And how many times have we seen I think this is probably for Libby. Thank you so much. How many times have we seen applications or sites?'",
        "'speaker_0': 'Councilwoman, can I interrupt you for just a second? We didn't really get need to introduce himself for the record. Oh, and so I know you said his name, but wanted to, since the public is watching. Excuse me for interrupting.'",
        "'speaker_8': 'No, no.'",
        "'speaker_10': 'Thank you, Madam Chair. Thank you, sir. Assistant city attorney.'",
        "'speaker_0': 'All right. Great. Thank you. Go ahead, Councilman.'",
        "'speaker_8': 'So I know that there's been several attempts to do something on this land. How many times has this potential site plan come through?'",
        "'speaker_2': 'Yeah. So I believe this is the first formal application, but in the pre-op stage there were about seven perhaps.'",
        "'speaker_8': 'So there are seven potential developments that have been tried on this land, and not one of them has made it past the upstage except for open space. Correct? Okay. Can we talk a little bit about the street access issue?'",
        "'speaker_8': 'You mentioned it like you touched on it a little bit, but I guess I need to make sure that I understand very clearly exactly what kinds of decisions or what information daddy uses when they are determining where ingress and egress would need to go on a parcel.'",
        "'speaker_2': 'Yeah. So I think Matt Farman is on the call. He's one of our data engineers, so he may be best equipped to answer that question.'",
        "'speaker_8': 'Thank you. Hey, Matt.'",
        "'speaker_0': 'Yeah. Okay.'",
        "'speaker_4': 'All right? Yeah. My name's Matt Farman. I work for Development Services, dot transportation, so I review private development as it relates to the right of way. So I permit the right of way design next to private development. And generally speaking, on this one, the city wants to have access off the lowest classified street as possible.'",
        "'speaker_4': 'And so Mississippi Avenue is an arterial roadway. Dayton's a collector in Emporia is a local. So Emporia is the local hair loss classified street and part of the reason for that. So we don't want access off of arterials.'",
        "'speaker_4': 'Think of that like a highway. We want that to get people from point A to point B and then your collector roadways are kind of your in between roadways to get people to local roadways where ideally access is taken off of.'",
        "'speaker_4': 'So when the development came in and proposed a plan, they had an access off Emporia. And then we look at that and compare that to our policy standards and requirements to see if that meets what the city could approve.'",
        "'speaker_4': 'And in this case, it met the requirements that we would want to see from.'",
        "'speaker_8': 'Hmm. Is there some? Would it be possible for in a neighborhood agreement to make the determination that the ingress and egress should be off Dayton instead of Emporia? Is that like is that allowed?'",
        "'speaker_4': 'You know, I'm not sure as that directly relates to the good neighbor agreement, but we do have. So the way our department works, plans are proposed and then we we comment on those. We, the city would be happy to look at another plan with access at in a different place.'",
        "'speaker_4': 'But I couldn't guarantee, you know, that that that would be approved. But we also have a variance process that that can be appealed and that goes up to some upper level management to help make that call. But there's a lot of challenges with these other roads with arterial.'",
        "'speaker_4': 'Then you also have a traffic signal there.'",
        "'speaker_8': 'Okay. Great. So. And maybe this question is actually for the applicants then in terms of it, are they willing to propose a different area of ingress and egress off of Dayton as opposed to Emporia, which is where this original, I guess, site plan suggested that go?'",
        "'speaker_4': 'I'm sorry. That to the applicant or to.'",
        "'speaker_0': 'Yes.'",
        "'speaker_8': 'Can we please upgrade them?'",
        "'speaker_0': 'I think we're getting Joseph or Lydia Skinner moved over.'",
        "'speaker_4': 'Hi. This is Joseph and Lydia. District five, the applicant. So.'",
        "'speaker_8': 'So just to repeat it, I'm wondering whether I'm right, because there's in the way the city processes work, there's a difference between the rezoning and the site plan. If you were to get this rezoning, would you be willing to consider altering the site plan for ingress and egress on Dayton instead of Emporia.'",
        "'speaker_4': 'Right? Yes. So our original intention was to go off Dayton when we hired on our civil engineer team. They they reviewed all the city code and all that. And so they said to get this through planning, it needed to be done on Emporia.'",
        "'speaker_4': 'But we're more than happy to rereview this after after rezoning, just the cost burden for us to do that. Now, prior to rezoning in that short amount of time that we were kind of given notification that might be an issue was was a bit too too heavy on us.'",
        "'speaker_8': 'Okay. And that's good to know. Thank you. I appreciate it. Did you consider any other zone district? Is there? Maybe this is even. Well, let me ask this first. Did you consider any other zone districts when you were considering this free zone?'",
        "'speaker_4': 'There were several zone districts that what our intention was could fit under. But knowing kind of what we were after, and that was to secure green space and secure recreation zone. I mean, it just it felt like any other way than OSP would be almost disingenuous, right?'",
        "'speaker_4': 'Like the worst case scenario as as it was brought up, what happens if this all falls through? Well, now it's designated OSP and it can only be used as a community asset, an open space asset, where if we would have gone with a mixed use or something along those lines, our design falls through, we sell the property'",
        "'speaker_4': 'and now, now you have a gas station there. So we pursued OSP all the way through because we felt that was the most accurate for what we were trying to do.'",
        "'speaker_8': 'Got it. Okay. I really appreciate that. Thank you so much. And then last question, I guess, for you guys as the applicants or the Skinners, do you? Would you be willing to consider going to mediation and hammering out a good neighbor agreement if this rezoning is approved?'",
        "'speaker_8': 'As you get to the site plan stage.'",
        "'speaker_4': 'Absolutely. Absolutely. We were we were wanting to engage in mediation, to go over the traffic concerns and issues before we even got here. I mean, in talking with a few neighbors who would drive by where we were setting up signs, that sounded like a lot of them weren't completely aware of, you know, that it was going to'",
        "'speaker_4': 'be seasonal, that there wasn't a be there year round. Right. What what everything entailed. It just felt like there was a lot of misinformation. And so we were pushing for mediation so we could explain the traffic that we already have a signed agreement or if something were to go in joint use agreement with the challenge school across'",
        "'speaker_4': 'the street to help, you know, drastically ease the traffic concerns by utilizing the 100 plus parking lot during the summer. So we just never felt like we were given the opportunity and we were really pushing Steve to kind of get everybody conversing.'",
        "'speaker_4': 'But it sounded like that just wasn't it wasn't a high priority for the other party.'",
        "'speaker_8': 'Okay. Did you attempt to do any other outreach to the community in terms of other meetings or things like that? I know you had that one. Would you be willing to do more than that if you were to get this rezoning?'",
        "'speaker_2': 'Absolutely. This is Lydia speaking, Councilwoman Sawyer. So we would definitely be open to speaking at a scheduled range view and neighborhood association meeting. One has not been scheduled that we're aware of from the duration that we've been up against for this rezoning.'",
        "'speaker_2': 'I think, you know, addressing a broader group would definitely be beneficial to, you know, not have any sort of. You know, take all night just to be able to get the messaging out once and for all, kind of what we're about that we really see this as an asset.'",
        "'speaker_2': 'We also are members of District five where husband and wife no larger organization. So it's it's a lot more straightforward, I think, than than it has been interpreted as.'",
        "'speaker_8': 'And we're happy to do that. Q Thanks so much, Madam President.'",
        "'speaker_0': 'Do you council member Sawyer. Next up, we've got Councilmember Black.'",
        "'speaker_2': 'Thank you, Madam President. I have a really quick question for you, Libby. So on the staff report, it says the lot is 84,000 square feet and the minimum lot size in as you eye is 12,000 feet. So they could put seven houses there, is that correct?'",
        "'speaker_2': 'Potentially. Given how they configure it? Yeah. Okay. Just want to get a feel for the size of the lot. Thank you.'",
        "'speaker_0': 'All right. Thank you, Councilmember Black. Next up, we've got Councilmember Flynn.'",
        "'speaker_6': 'Thank you, Madam President, but I really was quick. Councilwoman Black caught me off guard. I am flustered a little bit by the bodies. Decision that you can only access this parcel from Emporia which is the the residential side of the.'",
        "'speaker_5': 'Of the lot.'",
        "'speaker_6': 'Because I look along Mississippi I see that there was a proposal to rezone. Down at the corner on Geneva. That was, I believe, failed in June, but I didn't see any. Similar remarks by Dotty then in fact, there was an existing driveway right off of Mississippi for that.'",
        "'speaker_6': 'And then just to the west of this, there's an existing entrance into a parking lot for the school, which of course is in Arapahoe County. So Dottie had no say over whether there was access there. But I know of similar, you know, arterials and then neighborhood collector streets that have driveways on them.'",
        "'speaker_6': 'So I'm struggling with the notion that if there's a commercial enterprise like a private swim club, to be accommodated by this rezoning as open space, be private open space that the customers, the paying customers can only access it from by winding through the neighborhood and going down a residential street to get into the parking lot.'",
        "'speaker_6': 'Would I'm sorry, was it.'",
        "'speaker_2': 'Mark Matt.'",
        "'speaker_6': 'Matt from Dottie. Could you further explain the thinking behind that? And I know that we sometimes update our standards. We change what we used to do because many of us up here on the dais have asked for things in our district, traffic controls and things like that, and we might see them widely used elsewhere.'",
        "'speaker_6': 'And they say we don't do that anymore. So I'm wondering what is the what is the thinking here about not allowing in access off of date or Mississippi? Because that seems to be a hindrance to the development of this property.'",
        "'speaker_6': 'Excuse me, Frank. And frankly, I'm not interested in things that keep traffic speeding on Mississippi. This is not a words. We don't want to put a driveway there because we we don't want to slow down the traffic behind a right turning vehicle.'",
        "'speaker_4': 'Yeah. I can help clarify that a little bit further. And, and I guess I just wanted to start off by saying, you know, Dottie didn't necessarily say. For sure it needs to be off in. We're just going off of a proposed plan and then looking at our standards so in excess of Emporia would meet all of our'",
        "'speaker_4': 'standards and current practices. You know, part of the some of the things that we look at, we really try to avoid access to arterial roadways, Mississippi, Dayton, here, where it's close to a traffic signal. And we don't want to have access that is too close to the traffic signal where you have tubing that backs up.'",
        "'speaker_4': 'And then we also don't want it where there's turn lanes. So and then you have an access across the street and for Denver Vision Zero. We really like to have access aligned and other things we look at or conflict points with pedestrians.'",
        "'speaker_4': 'So if you have an access on Dayton, you would have more conflict points with cars going over the sidewalk, with people walking up, you know, to the school. So there would be less conflict points off in Peoria as well.'",
        "'speaker_4': 'And, you know, it's hard to say, you know, what was improved in the past with access off the Mississippi, I can't really speak to that. But current practices, this is what the city pushes for.'",
        "'speaker_6': 'Because he had change from prior practice. And I guess I have a little I have a little bit of difficulty. Understanding why we continue to have practices in some parts of town that we don't do anymore. But the ones that already exist where they seem to function.'",
        "'speaker_6': 'Well, I just I'm just flustered by this. I guess I have to take that into consideration. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. Libby, did you want to say something?'",
        "'speaker_2': 'Well, I was going to say that I don't want that particular property down Mississippi. I don't know if it had a potential to be accessed from a different street, but sometimes it did okay. Because obviously that's only has one street frontage, then access would probably need to be permitted even if it's an arterial.'",
        "'speaker_2': 'But since this one has three options, that's why looking at the lowest classification is the most in line with Vision Zero.'",
        "'speaker_0': 'All right. Great. Thank you. Next up, we've got Councilmember Cashman.'",
        "'speaker_3': 'Thank you very much. I will say it feels like this is not really fully baked as far as one meeting with the community and no community benefits agreement in place concerns me to make room for a profit making business.'",
        "'speaker_3': 'And, you know, the use is an interesting use. I'd love it if it were Denver building a community pool. I would say that would be outstanding. I wonder what other under the existing zoning, what profit making businesses could move in.'",
        "'speaker_2': 'Yeah. So, you know, you could do a community center under the existing zoning that includes a pool, but that would need to be a like not for profit organization that runs it. So impact on the ground would be very similar to what's being proposed.'",
        "'speaker_2': 'But as far as a profit making business, you know, I'm trying to pick a school. I mean, maybe a private school, for example, would be although most of those are probably still non-profits as far as how they're registered.'",
        "'speaker_2': 'But most of them would need to be a nonprofit. Uses under the existing district.'",
        "'speaker_3': 'Mm hmm. Okay. Yeah, I guess I don't need to hammer the same subject as Councilman Flynn, but I wonder about the access. And, I mean, it's not his words, but it does sound like staff is pretty set on Emporia being the access point.'",
        "'speaker_3': 'I hear a willingness. Yeah, we can talk about it, but I'm not hearing that there would be much chance of other access being developed.'",
        "'speaker_2': 'And I guess I would say there's there's no guarantees. And I think I don't know of an actual proposal has been made that Matt has reviewed along Dayton Street. So I think it'd be challenging to speak.'",
        "'speaker_1': 'Sure, I would be approve and.'",
        "'speaker_3': 'I understand that. I guess I would just be more comfortable with the Community Benefits Agreement signed on on this use. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilman Cashman. And next up, we've got Councilmember Ortega.'",
        "'speaker_1': 'Thank you, Madam President. My first question is for Lydia or Joseph Skinner. I wanted to ask if you have an idea of what percentage of the lot the pool actually take up. And then how many parking spaces does that actually give you?'",
        "'speaker_2': 'Or I can address that. Lydia here. So we have a rough proposal right now. It's still in draft form, but I believe it was only 37 or so percent of the entire approximately two acres of land because this is an outdoor swim club.'",
        "'speaker_2': 'The requirements for parking are a bit different. I believe that when we spoke with Dottie previously, the requirement would be based on the building size. We have a footprint, proposed footprint of approximately 2500 square feet, which is equivalent roughly to a single family home as our pool building.'",
        "'speaker_2': 'And so for that size of the building, the required number of parking is actually only seven parking spaces. Right now, our draft includes obviously a lot more. Right now we have, I think, around 50 parking spots proposed along Dayton.'",
        "'speaker_2': 'And then with that joint use agreement with the Challenge School, which we would, you know, obviously finalized once we zoned and go into development, would be additional 100 parking spaces. So we have more than adequately addressed the parking based on the requirement.'",
        "'speaker_1': 'And you indicated that the pool would be open from May to September, right?'",
        "'speaker_2': 'That is correct. Memorial Day to Labor Day is the standard for swim clubs here in Denver. Outdoor swimming obviously is very seasonal here. So there would be no chance of it being open outside of that because it would definitely ruin the pool and infrastructure.'",
        "'speaker_1': 'So sometimes school starts before Labor Day. And so just wanted to get your thoughts about the additional spaces that you're talking about. If you have kids from the neighborhood. I don't know what the schedule is at the school, but you're referencing the challenge school if they're on the same schedule as the schools or not.'",
        "'speaker_1': 'And so if if they're not on the same schedule, just wanting to to figure out if parking is really going to be an issue that might push parking into the neighborhood. If it turns out that you're going to have a lot of traffic in and out, and I would suspect in most cases parents are going to drop'",
        "'speaker_1': 'their kids off and then come and come up if they're not required to be present with them while they're swimming.'",
        "'speaker_4': 'Yes, that's a great question. And so to answer this question, we're going to base it off. You know, our experience here in the Virginia Vale neighborhood, right across from our neighborhood is the Virginia Bay Swim Club. It's actually how we got the idea for this, the swim club, our own.'",
        "'speaker_4': 'And so what we've seen over the last five, four or five years of living here is that the 66, I believe, spaces at the Virginia Bay Swim Club has is more than adequate on any normal day of the year.'",
        "'speaker_4': 'Now, there are days like the 4th of July and Labor Day itself, where there is quite a lot of overflow from those 66 spaces. And so that's why we proactively went ahead and did the challenge pool joint use agreement for the worst case.'",
        "'speaker_4': 'You know, anticipation of of traffic, fourth July weekends are always a little bit heavier. But on the average weekday, I mean, we've done a handful of times and there's at most, you know, dozens of families.'",
        "'speaker_1': 'So one point I'd like to.'",
        "'speaker_2': 'Add on that is that unlike school, which has a very set start time and end time, the probability of members of the pool coming all at the same time is highly improbable. People would trickle in and out throughout the entire day as opposed to the school, which is, you know, probably an hour of time between in the'",
        "'speaker_2': 'morning as well as in the afternoon when it's the highest volume. So the volume that our proposals would contribute would be a lot more spaced out.'",
        "'speaker_1': 'I didn't notice if the joint you took agreement was part of the application. Is that something that was included or is that something you're planning to use down the road?'",
        "'speaker_2': 'The Joint Use Agreement was entered as an artifact, so we have had written confirmation that they want to enter into one without one. We are still under contract on the parcel and our close is contingent on a successful rezoning it.'",
        "'speaker_2': 'But until we can do that as owners, we can't really come or have any finalized agreements with them, but they have expressed written interest and obviously if this is successfully revoked, resigned, we will engage on that front and have something.'",
        "'speaker_1': 'More formal drafted. Okay. Thank you. I have no further questions.'",
        "'speaker_0': 'All right. Thank you. Councilmember Ortega, we've got Councilmember Canete. You're up next.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_8': 'Council president. I guess my first question is for Nate Lucero.'",
        "'speaker_2': 'Nate. You know, there were some.'",
        "'speaker_8': 'Questions asked earlier about nonprofit versus for profit. And I just want to get clear on the law. When we are considering a zoning, are we allowed to consider who the applicant is? Is that a legal criteria we're allowed to consider?'",
        "'speaker_10': 'No, it's not. It doesn't matter.'",
        "'speaker_8': 'Okay. So there's no it would not be a legal basis to say, well, I would like a pool if so-and-so owned it, but not if another person owned it. We would be we're supposed to be considering the use or the the appropriateness of the zoning based on the the five criteria.'",
        "'speaker_8': 'Yes.'",
        "'speaker_10': 'Right. It's not part of the five criteria. The only thing that has to be considered and this is vetted before it even gets to council, is whether or not the applicant is is an appropriate entity or person to initiate the applicant.'",
        "'speaker_10': 'So in other words, it's either the property owner or a member of city council or council as a whole or the manager of CPD.'",
        "'speaker_8': 'Okay. Thank you for that clarification. My next question and.'",
        "'speaker_2': 'I don't remember.'",
        "'speaker_8': 'If we have someone in the on line who is representing the Range View Neighborhood Association, I heard questions or concerns from colleagues about the fact that there wasn't a more neighborhood meetings, but I want to clarify whose responsibility it is to convene a neighborhood meeting.'",
        "'speaker_8': 'And so I just want to clarify whether or not we have someone from the Range View Neighborhood Association in the meeting.'",
        "'speaker_0': 'I am not aware that we do or not. But if you are a member of the Rain View Neighborhood Association, if you raise your hand and we can bring you into the queue to answer Councilwoman Nature's question, and if you wouldn't mind introducing yourself for the record and your involvement with them.'",
        "'speaker_1': 'Okay. Hello. I'm Linda Rea and I am now a former. A former board member of our R.A. And what has happened in this case.'",
        "'speaker_2': 'Was the applicants began a conversation.'",
        "'speaker_1': 'With our existing.'",
        "'speaker_2': 'Board president.'",
        "'speaker_1': 'And. He began talking about having a meeting, and I had multiple emails.'",
        "'speaker_2': 'And phone calls trying to get in our own R.A. meeting, because it was my view that the board is to convene the body.'",
        "'speaker_1': 'Let the body discuss the matter at hand and come up with a position. And instead, what happened was the applicants took the board president's enjoyment of his private swim club as being good for this neighborhood and have presented it as his support means.'",
        "'speaker_1': 'We support it. We were never asked. We tried and tried to get conversations with our our whole R.A. We.'",
        "'speaker_2': 'Tried to get.'",
        "'speaker_1': 'A dialog through our council member to ask the applicant.'",
        "'speaker_2': 'To come and meet with us so that we.'",
        "'speaker_1': 'Could have a forthright, amicable, discussed discussion about this.'",
        "'speaker_2': 'And instead we've been sidelined. So there's a lot.'",
        "'speaker_1': 'Of resentment that's built up in this neighborhood about the manner in which this has been conducted. There's a lot of misinformation.'",
        "'speaker_2': 'There is no understanding by our board because they don't live on this side of the.'",
        "'speaker_1': 'Neighborhood that.'",
        "'speaker_2': 'The parking lot at the school does not.'",
        "'speaker_1': 'Work. Now it has.'",
        "'speaker_2': '128 parking spaces.'",
        "'speaker_0': 'I'm going to go ahead and ask you to pause. I think we've gotten that point across. And Councilmember, can each of you want to go ahead and put.'",
        "'speaker_1': 'I sorry.'",
        "'speaker_8': 'You were going a little further in my scope of my question.'",
        "'speaker_2': 'I hear your frustration that the neighborhood didn't meet.'",
        "'speaker_8': 'I also heard the applicant's frustration that the neighborhood didn't meet. I don't know that we can hold an applicant responsible for an R.A. that refused to meet. Right. I am very empathetic to what you just described, but it's also, I think, beyond the scope.'",
        "'speaker_8': 'And so, again, if if the staff would like to correct me, we don't have a letter from this R.A. in this packet.'",
        "'speaker_2': 'That is correct.'",
        "'speaker_8': 'So if we are voting tonight, none of us would be voting based on evidence that the R.A. supports it because we have no such evidence.'",
        "'speaker_2': 'Correct.'",
        "'speaker_8': 'So what may have happened in the community and what buzz there may have been, I just want to assure folks is not in the record and would not be part of our decision. But it also can't be part of our decision that because the R.A., because they didn't meet with the R.A., I'm hearing testimony from both sides'",
        "'speaker_8': 'that they would have liked it and that that that's what I take from the record. I have just one more question. It's a little bit unusual, but Madam President, feel indulge me. I have a question for Councilman Herndon.'",
        "'speaker_8': 'I think he's down there. But several of our colleagues have mentioned they're surprised at the standard about not being willing to have ingress and egress from, you know, collectors. I'm sorry, you know, arterials, but I recall many zoning is in the past and I believe you had when Councilman Herndon the affordable housing and Central Park and MLK'",
        "'speaker_8': 'if I believe it and if you don't remember, it's okay because you're not on the staff seat tonight. But Councilman Herndon, have you had a rezoning.'",
        "'speaker_2': 'Where we discussed this.'",
        "'speaker_8': 'This matter where there was consternation but the standard had been in place for a while. Was this is this ring any bells for you?'",
        "'speaker_3': 'Council? I'm thinking of affordable housing and off of MLK.'",
        "'speaker_4': 'Are you referring to the apartments on Moline?'",
        "'speaker_1': 'Yeah.'",
        "'speaker_8': 'Well, this is the. It's still undeveloped, as, in fact, it's the parcel that was on the corner of southeast corner of Central Park and MLK across from the open space. It is still undeveloped today and it was a subject of a rezoning here.'",
        "'speaker_8': 'Yes. And this issue was was discussed at length, if I recall, correct?'",
        "'speaker_4': 'Yes.'",
        "'speaker_3': 'They so if you're not familiar, the intersections of Central.'",
        "'speaker_4': 'Park and Martin Luther King Boulevard, the South. Yeah. Councilman can is correct. There are questions about where the egress is going to happen. And they did not do it on Martin Luther King. And I have to go back, but I'm under the assumption for the reasons that we're talking about right now, the and the egress for that'",
        "'speaker_4': 'would be on the local street, I believe. But as Councilman Kennedy said, we have not seen what I have not seen, I should say, a development plan as of late. But I believe what Councilman King needs to talk about is correct.'",
        "'speaker_8': 'All right. Thank you. I'll save the rest of your comments. But thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember each and Councilmember Herndon for weighing in here. We got some folks coming back into the queue. And so we've got and we see they're switching around here. Council Member Sawyer or actually Councilmember Herndon, were you in the queue for?'",
        "'speaker_4': 'I did, yes.'",
        "'speaker_0': 'Councilmember Sawyer. Since you've already been up. Councilmember Herndon.'",
        "'speaker_4': 'Thank you. Kelly This is a question. Just understanding outreach, because this is what we're spending a lot of time on. Is there anything in your view that the applicants did not do when it comes to their responsibility for outreach for this rezoning?'",
        "'speaker_2': 'No.'",
        "'speaker_4': 'Okay. Thank you. And for the applicants. A quick question it seems in. It's okay. Are you aware of any individuals that we're trying to connect with you that you wouldn't you were not willing to meet with? That's not what I am sensing from the conversations that you had, but I just wanted to ask you that question.'",
        "'speaker_4': 'Like you seemed very willing to have multiple conversations about this. Just let me know that. Is I misinterpreting that.'",
        "'speaker_2': 'That's an accurate statement. We spoke with anyone who wanted to engage with us. No one reached out to us directly. But when we were posting signs for both the hearings and folks we're driving by, we answered the questions and introduced the pathologist and any questions they had at the time.'",
        "'speaker_4': 'And I will state that back in May when we reached out to the Range View President. We had one one resident reach out to us directly first before the President responded. We responded that we would like to go to the Range View Neighborhood Association kind of chain so everybody could be discussed in the initial proposal.'",
        "'speaker_4': 'But after that, we've been quite open to discussion with any, any individual or group. Thank you for that. Most everything else. I have a comment, so I am good. Thank you, Madam President.'",
        "'speaker_0': 'Thank you, Councilmember Herndon. And wanted to do a quick check. Colleagues are everybody's good with their questions at this point. All right. Not seeing anybody else in the queue. The public hearing is closed. Comments by members of Council on Council Bill 1030.'",
        "'speaker_0': 'Councilmember Sawyer.'",
        "'speaker_8': 'Thanks, Madam President. This is a tough one, right? I would also feel better if there was a neighborhood agreement in place. That's why my council office repeatedly reached out to the neighborhood organization, to the neighbors themselves, to the Skinners, to try and get them together to hammer out a good neighbor agreement.'",
        "'speaker_8': 'I'm concerned about the fact that there isn't a good neighbor agreement here. However, the neighbors have had ample and repeated opportunity to create one and have refused to the point where several of them did not even respond at all.'",
        "'speaker_8': 'That is concerning because, you know, I think we've seen this a couple of times now where when you're looking at a protest position or you're looking at next door, people are lying to their neighbors about what's going on in order to get what they want.'",
        "'speaker_8': 'And that's not okay. And so, you know, we talked about this in a previous District five rezoning with CPD, and I think we need to talk about it again because I think what needs to happen here, based on repeated experience with this, is that whatever protest, petition or whatever language is put out there about exactly what the'",
        "'speaker_8': 'rezoning is has to be metered by the city attorney's office and CPD when it's put out. You cannot lie to your neighbors and then to get what you want in our rezoning process and exploit that whole. And also, you can't refuse to negotiate in some, you know, or even respond when negotiation is openly offered and then say'",
        "'speaker_8': 'that you weren't engaged. That is not okay. It's not okay. So. Right, we've talked about this. The land is vacant. There have been seven attempts to develop here. Seven. This is the eighth. None of those attempts have been successful.'",
        "'speaker_8': 'And the reason behind these failures, it's kind of interesting. You know, some of the neighborhood doesn't want the increase of density that comes with an SMU three or an SMU five, which would be appropriate here. Some of the neighborhood doesn't want the change of use that would come with an x three or in some x five zone'",
        "'speaker_8': 'district here. We saw this at the Mississippian Geneva rezoning. You know, just this past summer. So so what do we do here? You know, does this parcel stay empty forever? If the underlying SSI zoned district was appropriate for this property, that seven houses, so that seven for profit houses that a developer would be able to develop on'",
        "'speaker_8': 'that land. It would have been successfully developed by now if it was going to be supported in one of these past seven attempts. But it hasn't. So that's an indication, I think, that a zoning change is needed here.'",
        "'speaker_8': 'You know, so the question is, is OSB zoning the right zoning to go on this land? I understand that there's concerns about parking and street access. And, you know, as we've discussed, we've attempted to send it to mediation repeatedly.'",
        "'speaker_8': 'That would have been the place for neighbors to negotiate on these kinds of issues like entry and exit location, hours and days of operation, which I frankly think is going to end up being a bigger problem if we end up rezoning the parcel than the parking or the ingress and egress off of any street, you know, those'",
        "'speaker_8': 'kinds of things. Priority for neighbors living in the Range View Neighborhood Association. That's something that could be put into a good neighbor agreement if the neighbors were willing to mediate. It's not an appropriate tactic to refuse to mediate in the hopes of stopping a rezoning.'",
        "'speaker_8': 'So, you know, what are we what are we going to do here? I don't know. Right. I think the most important point that needs to be made in this situation is that our rezoning criteria doesn't look at the use of the property.'",
        "'speaker_8': 'So, you know, again, we're about to is OSB an appropriate zoned district for this property? And what does that mean? OSB is, and I'm quoting here, intended to protect and promote open space and parks not otherwise owned, operated or leased by the city, and generally intended for active or passive recreation use.'",
        "'speaker_8': 'So like were thinking kind of about this a different way. You know, the swim club doesn't work out. Is this OSB good for the neighbors, good for the community, good for the city? We're not just going to develop to develop for develop sake.'",
        "'speaker_8': 'We're going to develop because it's adding some sort of community benefit here. Parks and open space, I think are critical in any neighborhood. And this neighborhood has no city park except for a portion of the Highline Canal. There's a neighborhood directly north of the Highline Canal Park Forest where Ben Bezos Park is.'",
        "'speaker_8': 'That's not range view. The different neighborhood. So no park here at all. In fact, of all the neighborhoods I represented, District five, Windsor as a whole has the least amount of parks and open space. So by changing the zoning from suburban to open space, we're insuring a portion of this neighborhood remains dedicated to open space, recreation or'",
        "'speaker_8': 'some sort of community serving use. It's something that not only meets the goals of these supporting plans that we look at, but the actual needs of the neighborhood. I I'm very conflicted because I really, like I said, wish that there was a good neighbor agreement in place here.'",
        "'speaker_8': 'I think that that would have been the thing that would have really and truly sealed the deal on ensuring that the neighborhood truly benefited from this. But there's time. Right. We have the whole site review time to come back.'",
        "'speaker_8': 'So, you know, mediation is not off the table. I know the Skinners would be willing to do it. I know my office has repeatedly made the offer to sponsor it for free. That's still on the table. If we end up rezoning this, first of all, and it goes through the site plan process so that these kinds of'",
        "'speaker_8': 'issues could still be hammered out. And so I've got to look at the five criteria and this rezoning meets the criteria. So I'm gonna be supporting intimate thinks that I'm president.'",
        "'speaker_0': 'Thank you, Councilmember Sawyer. Next up, we've got Councilmember Kinney.'",
        "'speaker_8': 'Thank you. Council president I to find that the criteria have been met tonight and I guess in particular, you know, to imply that our city could have, you know, residential neighborhoods but not have amenities that serve them, such as pools or community centers or daycares.'",
        "'speaker_8': 'Some of the other uses in this list, we just couldn't function as a city. And so I think that it also in particular in terms of plan, conformance rate, the need for complete neighborhoods, right? Not just places people live, but places they can recreate or work or do.'",
        "'speaker_8': 'The other things that we have to do in our lives. We don't just live at home when we're not in a pandemic. Right. So so I find the criteria are met. But I wanted to chime in for for two reflections just on the discussion.'",
        "'speaker_8': 'I think that I'm concerned because this issue, you know, I brought up Councilman Herndon's rezoning because the same issue did come up. Everyone wanted the traffic to come off of Central Park or MLK instead of from the side street.'",
        "'speaker_8': 'I think Councilman Torres has had this issue in her district. I know Councilwoman Sandoval has. And I think that to the extent that our council has concerns about where curb cuts are going and why, I think it's incumbent upon us to take it up with our Department of Transportation not to be considering or not considering rezonings because'",
        "'speaker_8': 'of it. It is done to reduce traffic incidents, rate pedestrian car traffic incidents, bike car traffic incidents and car car traffic incidents. If we don't believe the science, if we don't understand the science, then I think the place to take it up is there.'",
        "'speaker_8': 'But it concerns me that it keeps showing up as a potential basis to affect a rezoning. And I just think that I have to raise the policy issue that if we are not in agreement with our Department of Transportation about curb cuts, then we should take it up directly and not have it be playing out in these'",
        "'speaker_8': 'rezoning conversations. The second thing is just, you know, it's really I think about.'",
        "'speaker_1': 'If we.'",
        "'speaker_8': 'Had to build schools in our city, would we have even been able to do it? I mean, the second issue that keeps coming up in every rezoning is cars. You know, there's going to be cars, there's going to be people.'",
        "'speaker_8': 'And I think schools are described in every one of these rezoning discussions as a as a as a terrible imposition and a real disruptor to neighborhoods. But they educate our kids.'",
        "'speaker_2': 'And the kids.'",
        "'speaker_8': 'Have to get there.'",
        "'speaker_2': 'And yes, in the olden.'",
        "'speaker_8': 'Days, perhaps everyone walked to school.'",
        "'speaker_2': 'But we now have ECD.'",
        "'speaker_8': 'That begins at three age three. And we also have school choice, which means kids can go to a neighborhood, neighborhood school or a school that fits them better, maybe because it has specialized ESL programs or because it has a a science, technology and math program that they need.'",
        "'speaker_8': 'And I just I.'",
        "'speaker_2': 'Worry that.'",
        "'speaker_8': 'That I can't imagine how we would build the things that our city needs based on how we describe the things everything is is an imposition and or a harm. Right. That schools are a harm to neighborhoods. Like, I would like us to step back and just think about that, that we describe these things like pools and schools'",
        "'speaker_8': 'as harms. And.'",
        "'speaker_2': 'And, you know, the kids don't get to.'",
        "'speaker_8': 'Come and talk to us. The kids don't get to come and testify to us. Generally speaking, we're hearing from adults, mostly disproportionately homeowners. Right. You know, who especially relies on recreational amenities, people who live in apartments or who don't have, you know, yards of their own.'",
        "'speaker_8': 'They especially need these kinds of spaces. I speak for a neighborhood that does not have it has its first park, the Fairfax Park in North Park Hill. But other than that, the only thing around is schools. And yeah, they generate traffic and they also educate kids and they provide a place for community to gather and support our'",
        "'speaker_8': 'community. So. I just wanted to share those reflections before we move on. I know that we care deeply about each of the comments we hear, but I also think it's really important for us, particularly on the dais, to step back and think about the big picture needs of the city and why the zoning code has some of'",
        "'speaker_8': 'the criteria it has. I see uniformity of zone district here. We've approved many projects on major arterials that aren't going to get curb cuts. Right. Uniformity. Right. We're we're doing that uniformly in other places, too. So with that, I'll be supporting this tonight.'",
        "'speaker_8': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Canete. And I appreciate both of my colleagues comments and the discussion. And I'm in full support of this rezoning. I can't imagine this council voting down something that is open space zoning, especially given the community gaps that we're seeing in this area.'",
        "'speaker_0': 'And, you know, even if you are a Denver Parks and Rec recreation holder permit, you still have to pay to use the pool. There are still costs involved with it. It's not like if the city was building this, it would be free either.'",
        "'speaker_0': 'And so I am in full support of this tonight. And a reminder to my colleagues that since community planning and development has determined that the requirement for a legal protest has been met. It will require ten affirmative votes instead of the standard seven affirmative votes of council to pass this bill.'",
        "'speaker_0': 'Madam Secretary, roll call on Council Bill 1030, please.'",
        "'speaker_1': 'Ortega. I heard.'",
        "'speaker_7': 'Sandoval.'",
        "'speaker_2': 'I.'",
        "'speaker_8': 'Sawyer I.'",
        "'speaker_1': 'Torres, I. Black eye. CdeBaca.'",
        "'speaker_3': 'I can't. I.'",
        "'speaker_5': 'When I.'",
        "'speaker_3': 'Herndon I can. All right.'",
        "'speaker_1': 'Cashman. I can each time, Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_7': '13 Eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification for 3255 North Newton Street and 3254 North Osceola Street in West Highland. Approves a map amendment to rezone property from U-SU-B to U-SU-B1 (allows for an accessory dwelling unit), located at 3255 North Newton Street and 3254 North Osceola Street in Council District 1. The Committee approved filing this item at its meeting on 9-21-21.": [
        "'speaker_0': '13 Eyes Council Bill 20 1-1030 has passed. Thank you to the community members and Libby and Nate for being here with us. Moving on, Councilmember Cashman, we put Council Bill 1072 on the floor for final passage.'",
        "'speaker_3': 'Yes, Council President. I move the council bill 21, dash 1070 to be placed upon final consideration and do pass.'",
        "'speaker_0': 'Thank you. It has been moved and seconded. The required public hearing for Council Bill 1072 is open and we have Fran here for the staff report.'",
        "'speaker_7': 'Good afternoon, members of City Council. My name is from Pineville City Planner with Community Planning and Development. And today we will be reviewing a rezoning request for two properties one at 3255 Newton Street and the other one at 3254 Osceola Street.'",
        "'speaker_7': 'Subject properties are in Council District one in the West Highland neighborhood. And the request is to rezone both properties to a district allowing for 80 use. All other form and use of standard would remain the same. The current zoning in both properties is US u.'",
        "'speaker_7': 'U. SB, which allows for a minimum standard size of 4500 square feet. For reference, the property of Newton Street is 6250 square feet and the one in Nasrallah Street is 6870 square feet, both exceeding the 4500 square feet required by us one.'",
        "'speaker_7': 'The green land use of the sites is single unit residential and they're both surrounded by other single unit uses the market. The map here also shows some two unit uses multi-unit residential uses in the vicinity, as well as some commercial retail and office uses on 32nd Avenue.'",
        "'speaker_7': 'This slide shows the character of the neighborhood with the images on the bottom left and top right, showing the subject properties and a couple of extra images to show the mixed use character of 32nd Avenue half so half a block south of the properties and also the residential character of the neighborhood in general.'",
        "'speaker_7': 'Throughout the rezoning process, application notifications have been provided according to code requirements. Planning Board recommended approval and animosity on September 15, and to date, staff has only received one letter of opposition from a neighbor concerned with short term rentals.'",
        "'speaker_7': 'The letter of opposition refers to a potential use of the EU for short term rentals. On that point, I would like to mention the Denver Zoning Code and Associated Licensing Regulations allows a resident of the primary dwelling unit to conduct a short term rental, either in the primary dwelling unit or in the legally permitted accessory dwelling unit'",
        "'speaker_7': '. Basically any one resident in a primary structure can apply for a short term rental license as long as they live in the property. Not allowing for an 80, you won't prevent an applicant from getting a short term rental.'",
        "'speaker_7': 'Important to know, though, the property owner would not be allowed to conduct more than one short term rental at a time. Now moving on to the Denver zoning code review criteria, it must be found that the request map amendment is consistent with the five criteria.'",
        "'speaker_7': 'In regards to criteria number one, there are two adopted plans that apply for the request rezoning Comprehensive Plan 2040 and Blueprint Denver. As stated on the staff report, the rezoning is consistent with several goals in comprehensive plan 2040.'",
        "'speaker_7': 'This MAP amendment will promote equity by creating a greater mix of housing options in every neighborhood, and it will lead to an environmentally resilient Denver by promoting infill development where infrastructure and services are already in place. Now live in Denver.'",
        "'speaker_7': 'The subject properties are both mapped as part of the urban neighborhood context. And the future places map designates the subject properties as low residential place type displaced types have predominantly single and two unit uses and accessory dwelling units are probably Newton Street and Sewell Street are both designated as Local Street, which is mostly characterized by residential uses'",
        "'speaker_7': '. The growth area and blueprint Denver for both sites is all other areas of the city. This area is anticipated to see 10% employment growth and 20% housing growth by 2040. Therefore, the finding of the request is consistent with the applicable adopted plans.'",
        "'speaker_7': 'Finally, Blueprint also identifies specific policy recommendations. Housing Policy four focuses on the spring housing choice through the expansion of accessory dwelling units throughout all residential areas. Stuff also finds that the requested signing meets the next two criteria. The rezoning will result in uniformity of district regulations, and it will further public health, safety and welfare, primarily through its'",
        "'speaker_7': 'implementation of adopted plans. The justified circumstance for this rezoning is a changing condition in a particular area, and a lot of the recent physical changes within proximity to the subject sites include new streetscape improvements along 32nd Avenue, but protests, pedestrians and increased safety along the corridor.'",
        "'speaker_7': 'Other changes include the construction of a new multi-unit residential project at Lowell Boulevard near the intersection with West 32nd Avenue. These changes demonstrate the transition from a low intensity residential neighborhood to a higher intensity residential and mixed use neighborhood where residential uses are compatible, appropriate and complementary to existing uses.'",
        "'speaker_7': 'Also, Blueprint Denver Specific specifically recommends the city diversify housing choices to the expansion of accessory dwelling units throughout all residential areas. The plan was adopted after the date of approval of the existing Southern District. Therefore, these are appropriate, justified SEC stances for the proposed rezoning.'",
        "'speaker_7': 'Overall, the proposed zoning is consistent with the urban neighborhood context residential district and the U.S. would be one strong district.'",
        "'speaker_4': 'With.'",
        "'speaker_7': 'That stuff. Recommends approval based on finding all review criteria has been met.'",
        "'speaker_0': 'Thank you, Fran, for the staff report. We have one individual signed up to speak this evening. And it's Jesse Paris joining us online.'",
        "'speaker_4': 'Yes, good evening. Members of council, those watching at home. My name is just Sebastian Paris. And I'm representing four black star families for self-defense because of us in those times, as well as the Unity Party of Colorado. And for a lot of black males and I'll be the next mayor of Denver in 2023.'",
        "'speaker_4': 'I'm in favor of this rezoning to my house in crisis. Any time that this council is approve of zoning, so create more housing. I'm in favor of I'm in favor of this rezoning tonight and meets all five of the criteria.'",
        "'speaker_4': 'Consistency with adopted plans. Uniformity of district regulations by the public health, safety and wellness. Justified circumstances and consistency with neighborhood contents and zone this purpose and since. So with that being said, I just to approve this summary. Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers questions from members of Council on Council Bill 1072. Council Member Flynn.'",
        "'speaker_6': 'Thank you, Madam President. Fran, could you address some of the issues that were raised by the letter in opposition to the one on Newton? In other words, that this is it's a single family home, but apparently it's been divided into two units.'",
        "'speaker_6': 'At least was the claim in the letter in opposition, and that both of them are being used as Airbnb at least half of the year because the owner of the property lives in Granby, apparently.'",
        "'speaker_7': 'So. Yeah, I mean. Anyone going to have a short term rental and anyone can have a long term rental. So.'",
        "'speaker_1': 'Right.'",
        "'speaker_7': 'It all depends where you have your residence. I think that the legal description is that you need to leave for six months of a year and you need to receive your bills and it needs to be like your voter address.'",
        "'speaker_7': 'So that's what defines your residence.'",
        "'speaker_6': 'So I'm sorry, what defines the residents?'",
        "'speaker_7': 'I'm sorry.'",
        "'speaker_6': 'What defines your residents?'",
        "'speaker_7': 'I think it's like where you receive your voters, your your bills and when where they address and you put it as a voter and I can look it up in the code, but. It's basically where you reside for six months.'",
        "'speaker_7': 'Mm hmm. So legally, someone could live in a house for six months and have a long term rental. So definition the difference between a long term rental and a short term rental is short term rental is shorter than 30 days.'",
        "'speaker_6': 'Right.'",
        "'speaker_7': 'Right. So he could potentially be. Living in his house for six months or eight months and having a long term rental. And then aside from that, you can have a short term rental. Now, you can not have more than one short term rental property.'",
        "'speaker_7': 'So even if he was a you have three people living in a house, you can not have three short term rental licenses for that property. It's only one for property. So if he if this owner for example builds the 80 you that's another thing he cannot have to wait to use.'",
        "'speaker_7': 'So if he already has an idea, he's not going to be allowed to build the arena. But he could have a short term rental in one room. Like a short term rental doesn't need to be in NATO. It can be just a room.'",
        "'speaker_6': 'Yes.'",
        "'speaker_1': 'Yeah.'",
        "'speaker_6': 'Okay. In this case, the owner of the property is also registered to vote in Granby. So I'm curious how that.'",
        "'speaker_7': 'That I don't know how to we can see if the applicant is on line, if he wants to answer that question. But I was not aware of that detail.'",
        "'speaker_6': 'Okay. So I just wanna make sure you're unclear if this single family house has been divided into a duplex, essentially by having a basement apartment. Would that be an attached adu to you already or what would that be considered?'",
        "'speaker_7': 'Cannot be divided as a duplex. I mean, so an you can be a basement. Right. So if you. Yes. So he could have an edu. Like if he has a kitchen, a full kitchen in the basement, that would be considered 80.'",
        "'speaker_7': 'You know, if that's the case, he's not going to be allowed to permit the like the detached accessory dwelling unit. And he knows that. He's aware of that because we always recommend or he should know that I should say, okay, we recommend them to meet with development services to get those details.'",
        "'speaker_6': 'Okay. So there could only be a single unit and an ADU on the property?'",
        "'speaker_7': 'Yes.'",
        "'speaker_6': 'Okay. Thank you. If the owner is there, how could they answer that question as to how do they live in this unit and rent out as an Airbnb, the basement or their living quarters? And would their intent be to use the ADU as a as a short term rental.'",
        "'speaker_7': 'Name.'",
        "'speaker_0': 'The floor. Mr. Laffer, did you hear the question? Councilman Flynn, do you want to pose the question?'",
        "'speaker_3': 'Oh, sorry, I was on. Sorry about that. Yeah. So the my intent is to have the you built so that my elderly mother can live there. My father recently died, and I'm looking to add an extra building on the property for her to be able to move out.'",
        "'speaker_3': 'She's living with my sister right now in California short term until we can get her additional housing.'",
        "'speaker_4': 'So that is my aunt. That's.'",
        "'speaker_6': 'I'm sorry. What's your name?'",
        "'speaker_3': 'Alex LaFleur.'",
        "'speaker_6': 'Okay. Now the owner of the property and not Klinghoffer.'",
        "'speaker_3': 'I have always been the owner of the property of the city of Denver. I made a mistake of the title. I do not live in Granby. I, Carly Klinghoffer does not own the property. I do. So I'm not sure why the website is currently showing that she is the owner.'",
        "'speaker_3': 'I called the.'",
        "'speaker_4': 'City today and they made.'",
        "'speaker_3': 'The change to correct that error.'",
        "'speaker_6': 'Thank you, Madam President.'",
        "'speaker_0': 'All right. Thank you. Councilmember Flynn. Councilmember Hines.'",
        "'speaker_3': 'I thank you. Council President. Ms.. Benefield, the the rezoning will. Considers the five criteria. None of those criteria are about a short term rental are. Is that correct?'",
        "'speaker_7': 'That is correct.'",
        "'speaker_3': 'And while there may be a short term rental that is considered later, that is that is something that falls under excise and licenses, not through simply or this this process.'",
        "'speaker_7': 'That is correct.'",
        "'speaker_3': 'And while we are hoping that that a property owner will consider their options in advance of a rezoning, it's ultimately the owners prerogative to do that or not. Is that. Is that right?'",
        "'speaker_7': 'Yes. Anyone. Anyone can apply for a short term rental license. Okay, you are without it, you.'",
        "'speaker_3': 'And so ultimately, it's the it's the property owners responsibility to follow in this case, follow the five criteria for, you know, the the rezoning or to make sure that the potential rezoning misappropriate five criteria and then later make sure that the property meets the excise and licenses criteria for a short term rental.'",
        "'speaker_3': 'Should that be in the cards for someone in the future? Correct. Yeah. Okay. So thank you. Thank you. Thoughts, president?'",
        "'speaker_0': 'All right. Thank you. Councilmember Hines. And seen no other. Councilmember Flynn, you're back in the queue.'",
        "'speaker_6': 'Thank you, Madam President. I just wanted to clarify that my questions were directed at the claim that there already was, in effect, an adult operating on the property. And if that were the case, that would be a different conversation we be having.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Flynn. The public hearing is closed. Comments from members of Council on Council Bill 1072. Councilmember Sandoval.'",
        "'speaker_2': 'Thank you, Madam President.'",
        "'speaker_1': 'And we all know lots of aid goes to Northwest tember, and we are currently working with this neighborhood or location to see.'",
        "'speaker_2': 'If they're interested.'",
        "'speaker_1': 'In doing an entire neighborhood wide rezoning. And so.'",
        "'speaker_2': 'Given that this meets all the.'",
        "'speaker_1': 'Criteria, I would like to ask for their support.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_0': 'Thank you, Councilmember Sandoval, and agree that this rezoning does meet all of the criteria. Madam Secretary, roll call on Council Bill 1072 Ortega.'",
        "'speaker_1': 'I. Sandoval. I. Sawyer, I. Torres, I.'",
        "'speaker_2': 'Black I.'",
        "'speaker_1': 'See tobacco i.'",
        "'speaker_3': 'Far I.'",
        "'speaker_0': 'Flynn.'",
        "'speaker_4': 'I.'",
        "'speaker_1': 'Herndon. Hines.'",
        "'speaker_3': 'All right. Cashman.'",
        "'speaker_1': 'I can reach Madam President.'",
        "'speaker_0': 'I. Madam Secretary, close the voting and announce the results.'",
        "'speaker_1': '13 Eyes.'"
    ]
}