{
    "A proclamation celebrating and thanking Kelly Velez for 33 years of outstanding service to the City and County of Denver upon her retirement.": [
        "'speaker_0': 'Then the new Madame Secretary. Thank you, Councilwoman Black. See no other announcements. We're going to move on. There are no presentations and there are no communications. We do have two proclamations this evening and we're going to do it a little bit different.'",
        "'speaker_0': 'We're going to do these two proclamations in a block because they're brought forward. They're internal and very close to home for us with a couple of our longtime staff members who have given so much to this body and to the city.'",
        "'speaker_0': 'And so we're going to bring them forward as a body. And Councilwoman Sussman is going to be the voice of the body to bring this forward. And we're going to vote on them in a block instead of separately.'",
        "'speaker_0': 'So, Councilwoman Sussman, could you read Proclamation 1090 and 1091?'",
        "'speaker_5': 'It is my pleasure, Mr. President. Thank you. The first one is celebrating and thanking Kelly Velez for 33 years of outstanding service to the city and county of Denver. Whereas Kelly has announced her retirement from city and county of Denver after 18 years with city council and 33 years total of loyal and dedicated service.'",
        "'speaker_5': 'And. Whereas, Kelly began her distinguished career with Denver City Council in 2000 as Council Secretary, organizing and overseeing procedures in council meetings, correcting and assisting council members with motions, tallying and verifying votes, and often staying late in the night as council members in the public debated legislation in over 800 council meetings, Kelly is well known across the'",
        "'speaker_5': 'city for her quick speaking skills, reading all the bill titles into the record. And. Whereas, Kelly is known for her professional and institutional knowledge of city government training new council presidents every year or every other year incoming council members, central staff, executive directors and aides.'",
        "'speaker_5': 'And. Whereas, Kelly was the go to person for the Sayers system. And now and then GRANICUS, which are the technology systems that manage council and committee meetings. And. Whereas, Kelly is famous for her creativity best exhibited exhibited in diverse training, she designs for council members and staff making council members comfortable performing from the dies during council meetings'",
        "'speaker_5': 'through prizes, noisemakers and jokes, softening the mood and relaxing everyone so they don't take themselves too seriously. And. Whereas, Kelly is black belt trained and certified in lean business processes and had contributed many innovations to the Denver City Council, making the body's operations more efficient, she was instrumental in revamping the legislative workflow process and consent calendar.'",
        "'speaker_5': 'And. WHEREAS, Kelly makes every person and every issue the most important when brought to her attention, dropping everything she is doing to listen to a request from a council member, staff member, or a member of the public in person or over the phone and immediately addresses it.'",
        "'speaker_5': 'If she doesn't know the answers, she researches it and provides it through information, anticipating the next question and answering it without even being asked. And. Whereas, Kelly coordinated the Denver Employees Charitable Campaign for City Council, inspiring employees to donate part of their salary to charities and worthy causes.'",
        "'speaker_5': 'And due to Kelly's organization, Advertising and Engagement Efforts, City Council exhibits one of the highest percentages participation in the campaign and raises the most money and has inspired other coordinators and other departments to replicate Kelly's best practices on how to make campaigns more effective.'",
        "'speaker_5': 'And. Whereas, Kelly proudly shares the talents of her grandsons, Isaac and Jessie, who excel in soccer and music, Kelly taught Jesse to play the fiddle, and he has become a national success. Winning small fry competitions at the National Western Stock Show and the National Old Time Fiddlers Contest and Festival in 2016, one of the top fiddler competitions'",
        "'speaker_5': 'in the world. And. Whereas, Kelly takes pride in her work and is committed to providing high quality and all that she does, Kelly's work ethic, commitment, organization and energy for her job are unparalleled and unmatched by anyone when training employees to cover for her during council meeting, Kelly advises, If you mess up or the system doesn't work'",
        "'speaker_5': ', just smile. And. Whereas, Kelly was a willing mentor to new staff, a repository of council, history records and institutional knowledge for colleagues, and an inspiration to others to be kind solely by example. Kelly was is a true joy to work with as a colleague or in any interaction, and now therefore be a proclaimed by the council, the'",
        "'speaker_5': 'city and county of Denver. That Section one the Council hereby recognizes and thanks, Kelly Velez, for her 33 years of service to the city and wishes her a wonderful retirement in Section two that the clerk of the city and county of Denver shall attest.'"
    ],
    "A proclamation celebrating and thanking Shelley Smith for 21  years of outstanding service to the City and County of Denver upon her retirement.": [
        "'speaker_5': 'And a fix the seal of the city and county of Denver to this proclamation. And that a copy be delivered to Kelly Velez. And in addition to losing Kelly to retirement, we are also losing longtime colleague Shelley Smith.'",
        "'speaker_5': 'And here's a proclamation for Shelley Smith for 21 and a half years of outstanding service to the city and county of Denver. Whereas Shelley has announced her retirement from city and county of Denver after 21 years of loyal and dedicated service.'",
        "'speaker_5': 'And. Whereas, Shelley grew up in Iowa and started her long career in public service by serving on the Commission for the Status of Women and working as the Assistant Director on the Coalition for Family and Children. Advocating for the inclusion of women in decision making policies and programs that equalize women and families opportunities to be successful.'",
        "'speaker_5': 'And. Whereas, Shelley relocated to Denver and received her graduate degree in public administration at the University of Colorado in 1990, and she secured a position at the National Conference of State Legislatures Legislators where she was instrumental in promoting policy, innovation and communication among state legislatures.'",
        "'speaker_5': 'And. Whereas, Shelley joined Denver City Council as an analyst in 1997, developing and researching policy issues, making recommendations and providing support to council members and staff, and playing a critical role in training new council members and always bringing new, relevant ideas to the table.'",
        "'speaker_5': 'And. Whereas, Shelley is a strong voice for the public fighting to make government more accessible and transparent, ensuring each action and decision made by the Council had the public in mind. And. WHEREAS, Shelley facilitated committee meetings with a special style that explained things well in a humorous and entertaining way.'",
        "'speaker_5': 'Serving as an analyst for the Sidewalk working group that informed policymakers and guided the policy discussion within the working group. Shelley also staff the Medical Marijuana Committee, the Special Issues Committee on Marijuana, supporting policymakers and regulators in this brand new public policy arena and helping to set precedent for other communities across the country as they embark on'",
        "'speaker_5': 'this new issue. And. Whereas, Shelley is an enthusiastic mobility advocate serving on Mayor Hancock's Bicycle Advisory Committee and due to her advocacy, has influenced measures to make the city and county of Denver more bike friendly and safer for bicyclists, including increasing the amount of bike parking for city employees.'",
        "'speaker_5': 'Whereas Shelley is an avid animal supporter, sheltering and caring for needy and vulnerable dogs in her home in preparation for adoption. And. WHEREAS, as one of the longest serving central staff members, Shelley has worked on every issue before the council and supported almost every committee.'",
        "'speaker_5': 'Her knowledge, ideas, creativity, expertize and humor will be missed by city employees, outside agencies and the general public. And now, therefore, be it proclaimed by the Council, the city and county of Denver, that Section one the Council hereby recognizes and thanks Shelley Smith for 21 and a half years of service to the city and wishes her a'",
        "'speaker_5': 'wonderful retirement in Section two that the Clerk of the city and county of Denver shall attest to the and affixed the seal of the city and county of Denver to this proclamation and that a copy be delivered to Shelley Smith.'",
        "'speaker_0': 'Thank you, Councilwoman Sussman. Your motion to adopt 1090 and 1091 in the block.'",
        "'speaker_5': 'I move to adopt 1090 and 1091 in a block.'",
        "'speaker_0': 'It has been moved and seconded and since neither of them are here tonight. But thank you for your patience and allowing us to honor them. I'm going to move us straight to the vote. Is that okay, Councilwoman, or did you get in here?'",
        "'speaker_5': 'I just wanted to have my name added as a sponsor. I was out last week and unable to do that during the usual process and I did not want to miss the chance to have my name on that co-sponsor list.'",
        "'speaker_0': 'Absolutely. We'll make sure all 13 are on there to recognize two of Denver's finest here. So, Madam Secretary, can we do work on.'",
        "'speaker_3': 'Sussman.'",
        "'speaker_5': 'I. Black eye.'",
        "'speaker_3': 'Brooks. Hi, Espinosa.'",
        "'speaker_1': 'Hi.'",
        "'speaker_3': 'Flynn. I feel more I Cashman. I can h i Lopez. I knew Ortega.'",
        "'speaker_2': 'I.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_0': 'I. I'm secretary. Please close voting. Announce the results.'",
        "'speaker_3': '12 hours.'",
        "'speaker_0': '12 hours proclamation, 1090 and 1091 have been adopted. Again, thank you all so much for letting us get through that, for to ask you to give it up for them even.'",
        "'speaker_8': 'Though they're not here.'",
        "'speaker_0': 'Phenomenal individuals. All right. We are going to move on to the resolutions. Madam Secretary, will you please read the resolution titles?'"
    ],
    "A bill for an ordinance authorizing and approving an amendment to the Emily Griffith Opportunity School Urban Redevelopment Plan. Amends the Emily Griffith Opportunity School Urban Redevelopment Plan by adding the Emily Griffith Project including the rehabilitation of the 140,000 square foot historic Emily Griffith Opportunity School Building into a 250-room hotel with 6,000 square feet of meeting space in Council District 9.  The Committee approved filing this item at its meeting on 9-11-18.": [
        "'speaker_11': 'Good evening, Mr. President, members of City Council. My name is Tracy Huggins and I am the executive director of the Denver Urban Renewal Authority here this evening requesting City Council consideration of an amendment to the Emily Griffith Opportunity School Urban Redevelopment Plan.'",
        "'speaker_11': 'In August of 2017, City Council approved the Emily Griffith Opportunity School Urban Redevelopment Plan. And with your permission, I'm going to refer to it as Emily Griffith instead of the entire name through this, through the rest of the presentation establishing the Emily Griffith Urban Redevelopment Area.'",
        "'speaker_11': 'The area is comprised of approximately two and a half acres and is located in downtown Denver's cultural core, as defined in the 2007 downtown Denver area plan. The area is generally bounded by Welton Street to the northwest, 13th street to the northeast, Glenarm place to the southeast and 12th street to the southwest.'",
        "'speaker_11': 'The site is located in Council District nine in approving the plan. City Council found it to be in conformance with the Denver Comprehensive Plan 2000 and its applicable supplements. While the plan authorized tax increment financing, it did not approve the use of TIFF for any projects.'",
        "'speaker_11': 'The Urban Redevelopment Plan Amendment. This evening it will do two things. It will approve the Emily Griffith Project as an approved project, and it will also amend the plan to correctly reflect the blight factors established in the condition study underlying the creation of the plan.'",
        "'speaker_11': 'The Urban Redevelopment area was occupied previously by the Emily Griffith Opportunity School, a Denver public school for nearly 100 years prior to its closure. The school was expanded several times and continued to operate at this location until its programs were relocated to 1860 Lincoln Street beginning in 2013.'",
        "'speaker_11': 'Since relocating, the buildings have remained vacant. In May of 2016, the school was designated historic at the local level and restrictions were placed on the amount and nature of possible redevelopment. Most of the structure fronting on the Welton Street must be retained, and setbacks were established for new development to ensure that the appearance and massing of the'",
        "'speaker_11': 'Welton Street buildings are preserved. Any development on the site is subject to the design standards and guidelines adopted by Denver City Council with the designation and must be approved by the Landmark Preservation Commission. So bear with me as I try to match my comments with the numbered points on the image that is on the screen, if you'",
        "'speaker_11': 'would, please. So the project that we are asking you to add is an approved project, will redevelop the entire 100,000 106,400 square foot site into the following on the Welton Street side, which is here. It will rehabilitate the historic building into 140,000 square foot hotel with 250 rooms and a 6006 thousand square feet of meeting space.'",
        "'speaker_11': 'It will also activate the alley between Welton Street and Glenarm place by creating alley access to the hotel entrance, as well as pedestrian circulation between the convention center, the hotel and the Glenarm place facing retail. On the Glenarm place side, it will seek to convert the existing building on the South Side into a 120 stall parking structure'",
        "'speaker_11': ', which will serve the entire project. Convert the Northside buildings to 37,500 square feet of retail and office space, as well as demolish a portion of the mid-block buildings on again on the Glenarm place side to create access to micro retailer space and complete the pedestrian access from Glenarm place through the hotel to the convention center.'",
        "'speaker_11': 'The Urban Redevelopment Plan. While it authorizes Doura to finance projects within the area by use of tax increment, it again did not allow us to use the tip unless a project was specifically approved by council. So again, we are asking for the use of the increment to support that project.'",
        "'speaker_11': 'Dura staff has reviewed the development budgets and pro forma submitted by the developer and believes there is a financial gap in the project of approximately $21.8 million. This financing gap will be addressed by reimbursing eligible costs through property tax and sales tax increment generated from the tax increment area, which is also coterminous with the urban redevelopment area'",
        "'speaker_11': '. The property tax and sales tax increment generated by the project of approximately $2.2 million per year upon stabilization and $350,000 per year of property tax and sales tax respectively will be used to reimburse the developer for eligible expenses over a period not to exceed 25 years.'",
        "'speaker_11': 'In approving the Emily Griffith plan, city Council found the plan to be in conformance with the Denver comp plan and its applicable supplements. Accordingly, any amendment to the plan must continue to be in conformance with the plan objectives in order to maintain the continuing conformance with comp plan 2000.'",
        "'speaker_11': 'The general objectives of the Urban Redevelopment Plan are to reduce or eliminate blighted conditions and to stimulate the continued growth and development of the area. The proposed project meets the following objectives of the Emily Griffith Urban Redevelopment Plan.'",
        "'speaker_11': 'And in the interests of time, I would prefer not to read each and every one of these, but instead to summarize by saying that they really seek to advance the historic preservation of the buildings and provide for increased activity in this very unique portion of downtown that is proximate to the convention center as well as to the'",
        "'speaker_11': '16th Street Mall. In doing so, draw upon the current conditions that are there so as not to disrupt those efforts while still again bringing new life into the area to encourage high and moderate density development where appropriate, including structured parking, encourage the participation of existing property owners within the area.'",
        "'speaker_11': 'This entire block is owned by the same development entity and to again really encourage land use patterns within the redevelopment area that will allow for pedestrians to feel safe and welcome. This amendment to the Emily Griffith plan invokes the requirement that before city council can approve a new urban renewal plan or an amendment to an existing plan'",
        "'speaker_11': '. You must find that an agreement has been entered into between Dura and the affected taxing districts in regard to the allocation of property tax increment to the project. There are two other property taxing districts, those being Denver Public Schools and the Urban Drainage and Flood Control District.'",
        "'speaker_11': 'Both taxing entities were notified of the proposed amendment to the plan to add the Emily Griffith Project. Following that notification, both entities evaluated the impact the project would have on their ability to deliver services and determined that the Emily Griffith project would have minimal service impacts and have agreed to allow the full available amount of property tax'",
        "'speaker_11': 'increment generated by their respective mill levies to be allocated to the project. As I noted at the beginning of my presentation, the amendment also corrects an error that was included in the original urban redevelopment plan. The condition study or blight study that was made a record of the public hearing, as well as my testimony correctly noted the'",
        "'speaker_11': 'factors of blight. But the actual text in the plan was incorrect. And so we are replacing the the deterioration of site or other improvements that was listed in the original plan is approved with the correct reference to but not predominance of defective or inadequate street layout.'",
        "'speaker_11': 'There are several other required legislative findings that must be made by City Council in order for us to amend the Urban Redevelopment Plan. That those would include that the Emily Griffith Project is located within the Emily Griffith Urban Redevelopment Area and will promote the objectives set forth in the Emily Griffith Urban Redevelopment Plan that a feasible method'",
        "'speaker_11': 'exists for relocation of displaced individuals and families and business concerns. The project area is vacant. There are no residents. Therefore no individuals or families will be displaced. And additionally, again, due to the vacancy of the site, no business concerns will be displaced by the project.'",
        "'speaker_11': 'A requirement that written notice of this public hearing has been provided to all property owners, residents and owners of business concerns within the urban redevelopment area. In the resolution setting this public hearing, City Council requested Dura to undertake this task.'",
        "'speaker_11': 'Written notice was mailed first class mail to all known property owners, residents and owners of business concerns in the Emily Griffith Urban Redevelopment area on August 27th of 2018, which is at least 30 days prior to this public hearing.'",
        "'speaker_11': 'State statute requires that no more than 120 days shall have passed since the first public hearing excuse me before City Council on the Plan Amendment. Tonight is the first public hearing before Council on this Urban Redevelopment Plan Amendment.'",
        "'speaker_11': 'Statute also requires that two years must elapse before council can consider an urban redevelopment plan amendment. If you previously failed to approve an urban redevelopment plan amendment for this project, as this is the first consideration by City Council of an amendment for this project, the 24 month period is not applicable.'",
        "'speaker_11': 'Conformance with the Denver Comprehensive Plan on September 5th of 2017. The and I apologize. On September 5th of 2018, the Denver Planning Board unanimously found that the proposed amendment to the Urban Redevelopment Plan conforms to the Denver comprehensive plan and applicable supplements.'",
        "'speaker_11': 'And a letter to that effect has been submitted as part of the record of this hearing. And I also placed a copy of that correspondence at each of your seats this evening, and door is requesting that City Council concur with the finding of planning board the Emily Griffith.'",
        "'speaker_11': 'The Urban Redevelopment Plan, as amended by the proposed amendment, will afford maximum opportunity consistent with the sound needs of Denver as a whole for the rehabilitation or redevelopment of the Emily Griffith area by private enterprise. The project will be undertaken by Stonebridge Companies, the property's current owner, which is a private enterprise.'",
        "'speaker_11': 'The Urban Renewal Authority has notified the boards of each other taxing entity whose incremental property tax revenue would be allocated under the Urban Redevelopment Plan. And an agreement has been negotiated governing the sharing of incremental property tax revenue.'",
        "'speaker_11': 'As I mentioned previously, those agreements are in place between Dura and DPS and Dura and the Urban Drainage and Flood Control District. And finally that the city and county of Denver can adequately finance and agreements are in place to finance any additional city and county of Denver infrastructure and services required to serve development within the Emily Griffith'",
        "'speaker_11': 'Project area for the period during which the incremental property and sales taxes are paid to the authority. And the Urban Redevelopment Plan allows for cooperative agreements between the city and borough to address additional infrastructure requirements in city services should they arise.'",
        "'speaker_11': 'So as I mentioned at the at the council committee briefing, it has been a fairly long process for us to finally get to a point where we are able to bring this plan amendment forward. Part of that process did include the historic designation of the buildings, which we all believe were were completely appropriate and will really maintain'",
        "'speaker_11': 'the historic character of these buildings. In addition, the developer first approached ERA for just a portion of the site that would have redeveloped just the the Welton side. Upon further conversation, they saw the value in it in putting forward a plan that will redevelop the entirety of the block, which we hope you concur is really a huge'",
        "'speaker_11': 'benefit for, again, this very unique portion of downtown to not only save these historic buildings, bring them back into productive use, but also through adaptive reuse of a number of the other buildings, really redevelop the entirety of the block so that the entire urban redevelopment area has been addressed.'",
        "'speaker_11': 'That concludes my staff presentation and of course will be available to answer any questions you may have.'",
        "'speaker_0': 'Thank you very much. We do have four individuals signed up to speak this evening. So if you've signed up to speak on this, if you could come to the front row so you can be ready. First up in the Levinsky.'",
        "'speaker_12': 'Good evening. I'm Annie Levinsky. I'm the executive director of Historic Denver, located at 1420 Ogden Street. We're a private, nonprofit, historic preservation organization founded in 1970. And one of our organization's roles in the community is as an advocate for historic places and spaces that tell our city's story and that provide opportunities for continuity and authentic placemaking.'",
        "'speaker_12': 'As such, we became involved in discussion about the former Emily Griffith Opportunity School back in 2012, when DPS made the decision to move the school function to the building at 19th and Lincoln and then to eventually sell the old site, which interestingly enough, had been owned by the school system and hence the public.'",
        "'speaker_12': 'Since before 1882, the opportunity school, as it was first known, was the first school of its kind in the nation and is significant both for the inclusive vision and legacy of Emily Griffith, its founder and the Denver Public School System.'",
        "'speaker_12': 'Its architects, particularly Gordon Jamison, are recognized as important in the history of Colorado design. And for these reasons, the school had been given a Tier one historic ranking under DPS policy back in the early 2000s. And most importantly, these are the reasons the community felt strongly that critical buildings on the site should be preserved and reused.'",
        "'speaker_12': 'In 2014, DPS convened a sales advisory committee and representation. Representatives of our organization joined others from downtown Denver, the Mayor's Office City Council, Dora and others for a series of intensive meetings. In September of 2014, a recommendation was brought forward by that committee to move ahead with the sales process, but to do so with guiding principles that'",
        "'speaker_12': 'included the historical significance and historic preservation desires. Even though the site was not yet designated, the sales advisory committee also spent significant time exploring the financing tools that might be available to a future owner seeking to adaptively reuse the school building.'",
        "'speaker_12': 'It was apparent that preservation offered significant opportunities, including eligibility for both state and federal tax credits, which on a project of this size, can reach tens of millions of dollars. Among the other tools discussed at the time was tackling tax increment financing through Doura.'",
        "'speaker_12': 'Given that the site was vacant and in an area of downtown where greater development energy was desirable, and given that historic preservation is one of the benefits Dura seeks to achieve, as Tracy mentioned and their website states, preserving Denver's historic buildings has been a longstanding goal of the city, and Dora's redevelopment efforts have contributed contributed to achieving'",
        "'speaker_12': 'that goal. The willingness of visionary developers to reuse older buildings, combined with the financial incentives that make such redevelopment possible, have helped the city preserve its heritage for future generations to enjoy and appreciate. So I'm here tonight to bring the conversation full circle and to offer historic Denver support.'",
        "'speaker_12': 'Stone Bridge. As the new owners have honored the agreements and spirit of those earlier discussions, they've embraced the historic designation that now protects the site. And we've had the opportunity to review their concept and believe that it really does those things and and actually preserves even more than we originally anticipated.'",
        "'speaker_12': 'So we are grateful that the community has assurance that the site will remain at downtown and look forward to seeing a project that will once again demonstrate the great city's embrace the past as they look to the future.'",
        "'speaker_0': 'Thank you. Thank you very much. Next up, Chairman Sekou.'",
        "'speaker_2': 'Amazing. Just when we got news. Six, six, six. Okay. Yes. My name is San Francisco. Found organize a black star action movement for self-defense representing poor, working, poor, homeless, senior citizens and students. Also candidate for mayor 2019. We support this.'",
        "'speaker_2': 'Process. Otherwise then the approval of this amendment. Being a lifetime resident and. Going up. It's strange, but it's fair. 30 years ago, I decided that I wanted to be a floor designer. And I do floor design right here in the Griffin.'",
        "'speaker_2': 'And for 25 years, I had a floral company that operated in the state of Colorado from Boulder all the way to Pablo. I learned it right here. And so this has a very good memory for me in that it was a place where people could come and learn a skill.'",
        "'speaker_2': 'And then become contributing members of the community and actually entertain the possibility that from what we learned at Emily Griffin, we could actually begin the process of doing for ourselves and employing ourself with the education that we had.'",
        "'speaker_2': 'It was also a process of not going to look for no job but to create a job for ourselves that we could create jobs for other folks. So there was a ripple effect from this that you wouldn't get from any other institution.'",
        "'speaker_2': 'That was considered education because this was like a hands on thing for folks who want to do hands on stuff other than white papers and kick it in intellectual circles. So this one has to be preserved for the memory of those of us who grew up here, and also for the cultural continuity of letting us know that'",
        "'speaker_2': 'there's more than one process of education. And that can be the ones that we work with our hands and minds. And then sometimes we work with our hands in order to develop our minds so that we can have families and have occupations worthy of living and saluting everybody.'",
        "'speaker_2': 'And then to go to college. And so they had those kind of programs. And I'm sure that. If you wanted flowers for Valentine's Day, you wouldn't call them a button. Is it? Harry and say, hey, designs were sent for me because they couldn't do it.'",
        "'speaker_2': 'So it has a practical application to it and it makes all the sense in the world to do this thing because that legacy of this city and county must be preserved. And the legacy of who we are must be preserved because we're moving now into an area where a lot of what we grew up with is gone'",
        "'speaker_2': 'now. And that's our history. That's our culture. And so we have to have something to pass on this concrete so that especially the generations are coming up, can see the process of civilization and development that includes not only the future and the present, but the context from which how you got to where you got to.'",
        "'speaker_2': 'Over there on Lincoln Street. Where they now exist. And it's amazing that a lot of the students who now go to Emily Griffin over there in Lincoln City have no understanding about this building whatsoever. That one. And that's criminal.'",
        "'speaker_2': 'That's a shame. And so that's why this one's important. For the legacy of. Not how the West was won, but why the West is one. Which means all in E where one? And we're all here in this together.'",
        "'speaker_2': 'And for the unity and sake of the city, I implore you to approve this amendment. And we've been working hard at this for a long, long time. So now let's move it on forward on down the road, and I'll close with time.'",
        "'speaker_0': 'Thank you very much. Next up, Jesse Paris.'",
        "'speaker_13': 'Good evening, members of council. My name is Jesse Paris. I am a candidate for City Council at large 2019 and I am representative for a positive action commitment for change. Denver Homicide Loud and Black Star Action Movement and I reside at 2842 Josephine Street in Albert Brooks District.'",
        "'speaker_13': 'As a student of Emily Griffin Opportunity School, during my college days, a metro I attended school during the 2008 2009 season. I took two classes on web design and office mapping. My mother, who was not in attendance, also attended the school during the late 1980s and early 1990.'",
        "'speaker_13': 'This school is a historical landmark as of 2009, and it should be classified as such. It should not be turned into a unaffordable, non affordable 250 room hotel to house the tourists of the convention center in the west of the city.'",
        "'speaker_13': 'Instead of investing in 0 to 30% area minimum income, housing for low income and homeless people. So positive action commitment for change never homicidal loud and black star action movement will be opposing this measure and would ask you to redirect your priorities from tax to from tourist tax dollars to creating attainable and accessible housing.'",
        "'speaker_13': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, David Roybal.'",
        "'speaker_10': 'They robot live at 742 West and I represent West Denver United candidate for District three has a lot of history. My family went to this school and one thing I got to say about the area is probably one of the parts of downtown on this side that hasn't been cleaned up.'",
        "'speaker_10': 'I mean, it hasn't been used. You know, there's still homeless people there. But in the area, this is one of the you know, people come out of jail, families go there to give vouchers. And it would be real good, you know, if they could go use the vouchers across at this new hotel.'",
        "'speaker_10': 'But hopefully we see that and we know the effects of Dura, you know, cleaning up downtown, removing people that are from here to a betterment of business. Because I had the job downtown, it's very hard being a person of color to get a job downtown.'",
        "'speaker_10': 'And we hope that the opportunity remains in the school, the name, the opportunities for locals, for small owned businesses. And, you know, to put it into another hotel thing, it seems like it's trying they're trying to push it to the of the art district and connect it.'",
        "'speaker_10': 'And that's no affordability. You know, we still have seniors that live around here. We still have residents, long time residents. And I really don't see this benefiting the residents in the long run besides the city tax. And I hope that, you know, it could go back to the schools and and it could cherish the the history that's'",
        "'speaker_10': 'there, you know, because that's an important name. Emily Griffith, everything she's done one of a kind schools. I hope it honors that history instead of just being another expensive downtown business that doesn't benefit the residents who live here.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. That concludes our speakers. Are there any questions from members of council or Councilman Brooks?'",
        "'speaker_6': 'Yes, thank you, Mr. Chair. Is Tracy Huggins, can I get a quick question for you real quick? It has been a while since since I don't remember. What is the what is the requirement on minority construction for for these properties?'",
        "'speaker_11': 'Sure. And if you'll allow me, I'd like to answer that a little more broadly as well in response to some of the concerns that were raised. So any time there is tax increment part that is put into a project, there are several requirements that Dura requires of the developer.'",
        "'speaker_11': 'One of those is of the utilization of small business enterprises. And Dora's, unlike the city that has different goals that are set for each projects, are as is standard, with 23% of the total project budget exclusive of the acquisition cost needing to be committed to do SB enterprises as part of the construction process.'",
        "'speaker_11': 'In addition, there is a requirement to participate in the first source hiring process that allows for first opportunities of any jobs that are created on the in the project area to be made available first to low income Denver residents.'",
        "'speaker_11': 'There is also a 1% project art requirement and there is another one. Oh, there is also a requirement that 1% of the amount that we are committing to the project be paid by the developer to Doura, we then use those monies to partner with entities that are providing construction, employment, opportunity training.'",
        "'speaker_11': 'So we are working very actively to try to make sure that there are opportunities for for Denver residents in each of the projects that we participate in.'",
        "'speaker_6': 'Okay. How's your compliance on that? I mean, I know there's a lot of projects out there to to continue to keep up with that. How are you guys doing in compliance?'",
        "'speaker_11': 'We are doing very well in a compliance standpoint. And if I could speak more specifically to the 23% SBC requirement, we increase that level of expected participation. I want to say about two years ago, previously it had been 15%, in part because what we were realizing is that the 15% hurdle was met and then it stopped and'",
        "'speaker_11': 'we thought, gosh, why don't we try to see if we can go a little higher? And so most of our projects have been able to attain that 23% rate even in this challenging construction environment.'",
        "'speaker_6': 'Great. And if they don't meet that 23%, what happens?'",
        "'speaker_11': 'It can depend on how diligent they have been in addressing their outreach plan that they have put forward and approved by us. If they are meeting that plan and they just are not able to meet those requirements, but it is able is able to be demonstrated that they have made good faith efforts in doing that.'",
        "'speaker_11': 'There is not a financial penalty. On the other hand, if they if it is concluded that they haven't really done what they said they were going to do and trying to meet those criteria, we do have the ability to withhold the tax increment reimbursement from them.'",
        "'speaker_6': 'Got it. All right. Thank you. And I just have another question for the owner rep or come on up. One of the questions in a lot of these projects, we haven't seen a lot of TIFF projects with small retail components.'",
        "'speaker_6': 'And so, you know, I personally see that as an opportunity. I mean, this is you're getting tax. Dollars. And I want to make sure that this is an opportunity for small businesses, especially women and minority owned small businesses.'",
        "'speaker_6': 'In our meeting. You said that you would work to try and accomplish that. Is that is that still a part of your theme in what you're trying to work on?'",
        "'speaker_10': 'Yes, that's accurate.'",
        "'speaker_0': 'Sir, could you introduce yourself for the record first?'",
        "'speaker_10': 'Yes, sorry about that. My name is Tommy Negro. Stonebridge Companies Address 3291, South Magnolia and Council Councilman's Black's district. With respect to your question, Councilman Brooks, we we would love to see small owned businesses. We're not looking for chain retailers to go into our space.'",
        "'speaker_10': 'We are early in the process, so we haven't identified anyone specifically. I believe you suggested a group that we were not familiar with previously called Radian. We have reached out to them. We have not had any substantive conversations, but certainly open to those.'",
        "'speaker_10': 'And we would welcome, again, women, minority owned businesses. In fact, we would, you know, seek those out. We think that would be a fantastic I guess, tenants for our retail on the glenarm side of the the project.'",
        "'speaker_6': 'Okay. Thank you, Miss Nigro.'",
        "'speaker_0': 'All right. Thank you, Councilman Brooks. Councilwoman Ortega.'",
        "'speaker_11': 'Thank you, Mr. President. A couple of my questions were answered about the first source program. I just wanted to ask Tracy if there is a deadline by which construction would need to begin in order to.'",
        "'speaker_7': 'Utilize the tive.'",
        "'speaker_11': 'Do we set deadlines or timeframes on these on these projects? There is not a deadline that we have to have the construction start. With the exception of a deadline that I am not going to be able to recall, that is in the agreements that we have with the DPS and with urban drainage, where their willingness to continue'",
        "'speaker_11': 'to commit the tax increment ceases if construction isn't started by a date that is several years out into the future. I apologize that I don't know that date immediately. Dora doesn't have an immediate start date, but the clock is ticking on the tax increment that was approved at the end about this time in 2017.'",
        "'speaker_11': 'So there is only 25 years under which the increment can be generated. Okay. Thank you.'",
        "'speaker_0': 'Thank you, Councilman Ortega. Councilman Espinosa.'",
        "'speaker_6': 'I'm surprised to see Commander Martinez here.'",
        "'speaker_10': 'Hi, Commander.'",
        "'speaker_6': 'The. The beauty of public hearing is that. Is in this case, and it happens to me fairly. You know, often somebody says something that makes me think about something I completely missed throughout the entire process. And this one sort of scares staring me right in the face.'",
        "'speaker_6': 'And I don't know why this question never came up, but it sort of goes to both you, Tracy and in the property and Stonebridge. There is a history to this site and this facility in the concessions requirements. I mean, what you detailed there are sort of boilerplate requirements for Dura and suddenly I'm going, it's not enough for'",
        "'speaker_6': 'me to just preserve the building. The building is important, no doubt. But there's a legacy that. That culture, that entire block. And so is there anything you can tell me that gives that that sort of puts me a little bit at ease about how there's going to be an ongoing relationship between the sort of opportunity that comes'",
        "'speaker_6': 'with drug financing, new to financing, and the things where the level of involvement beyond the building that actually would sort of start to resonate and help move forward those those those goals of the original Emily Griffith. Everything history there, because there certainly could have been a, you know, scholarship set up a, you know, 1% for something, you'",
        "'speaker_6': 'know, that it never and I'm sorry, it just never occurred to me till now. But none of this none of this conversation is happening without both what happened there and then the opportunity that we created by exchanging parcels and whatnot.'",
        "'speaker_6': 'So can you guys give me any sort of above and beyond.'",
        "'speaker_11': 'So so I have some thoughts, but I would also invite the developer to, to share their thoughts as well. And part of that goes to just how the project started with our continuing relationship with Denver Public Schools, who had this the sale of this site as part of a broader agenda regarding their facilities that included the continuation'",
        "'speaker_11': 'of the Emily Griffith Opportunity School, not only at 1860 Lincoln, but also at the other location that they have more proximate to the Mariposa Denver Housing Authority development. So the legacy of Emily Griffith and the importance of there being alternative means of pursuing education has in no way been lost simply because this project is no longer you'",
        "'speaker_11': 'in use for that. In addition to continuing with the threat of the Denver Housing Authority, when we talk about first source, which well, it may seem boilerplate, it is so important to us in order for us to continue to have the the much more clear and direct impact on folks who may never stay at the hotel, but'",
        "'speaker_11': 'they may have the opportunity to work there. They may have the opportunity to work in one of the small businesses that are going to come forward, that we work really closely with the housing authority in looking to find those candidates for those positions.'",
        "'speaker_11': 'And part of that also, again, includes some of those more. I'm going to say vocational, educational. I'm not sure that's the right terminology component so that they are positioned to pursue a career in the culinary arts that have opportunities as you are working in in the type of businesses that are coming forward.'",
        "'speaker_11': 'So I recognize it isn't quite as direct as from this project. We will do something that is in absolute direct correlation with what Emily Griffith stood for and the opportunities that were presented. But I think when we take a step back, there are a number of threads that when combined together, do make sure that the fabric of'",
        "'speaker_11': 'what she stood for, what this facility has provided, can continue on this site.'",
        "'speaker_6': 'Because I would imagine the facility would ultimately end up with some sort of narrative, some sort of acknowledgment of the the architecture itself and how this sort of facility ended up coming to be that way. So it would be interesting to me if there were some sort of actual, you know, design component where people who were trained'",
        "'speaker_6': 'through that program actually had a sort of visible presence in the in some aspect of the finished product. And then, yeah, maybe just an acknowledgment in their own sort of employee ID if they.'",
        "'speaker_0': 'Were Chancellor Euston questions before it comments.'",
        "'speaker_6': 'It is a it's not a comment. I'm sort of really directing it to Stonebridge and saying, do you guys have any have you considered anything along those avenues which is sort of visible, you know, bringing in graduates to do some actual work, you know, in a in a very in a visible and finished way.'",
        "'speaker_6': 'And then if you did have higher employees sort of essentially acknowledging that they were graduates of the program.'",
        "'speaker_10': 'You know, it's an interesting question. It's a good question. It's not something we have specifically addressed. I would say that the I think the idea and the spirit of what you're saying is, is a central value of our company, not just for this project, but for every project we do.'",
        "'speaker_10': 'And maybe going on a slight tangent as a company, we're very strong supporters of Metro State University and specifically the hospitality school there. I wish Nevin Demand and his wife Rita were here to speak to it, but they've contributed over $1,000,000 to start a fellowship program there, and we actively hire those students to work for our company'",
        "'speaker_10': 'long term. We are a local firm, long term holders of real estate here in Denver and throughout the state of Colorado. In addition to supporting Metro State and and bringing a lot of really first time college students into the company, we do have a very active, I guess, trying to blank on the word right now, but growth'",
        "'speaker_10': 'program to bring individuals from, you know, you know, kind of entry level positions up into management. And that was actually just featured, I think about three weeks ago on on Channel seven News. So maybe a little bit different than what you were asking about specific to Emily Griffith.'",
        "'speaker_10': 'But it's an interesting idea. And I will say just personally, as we've worked on this project, it's amazing to me, especially almost anyone who is a native, you know, Denver, right? Almost every single person has a family member or some story about an individual that that gained their education there and that that's really meaningful to us.'",
        "'speaker_10': 'So it's something I would certainly take away and and see if there's something that we can can do. But but we certainly want to honor the legacy of Emily Griffith. And it's what really attracted us to the project to begin with.'",
        "'speaker_6': 'Yes. Thank you for that. Knowing that you guys have a altruistic component to your business model. You know, I'm glad that we even had this little bit of discussion. Hopefully it's a little nugget kernel of thought that might permeate as you move forward.'",
        "'speaker_6': 'Thanks.'",
        "'speaker_10': 'Certainly. Thank you.'",
        "'speaker_6': 'Thank you.'",
        "'speaker_0': 'Thank you. Councilman Espinosa. Councilman Quinn.'",
        "'speaker_2': 'Thank you, Mr. President, for Tracy and Annie. I think either of you, in looking at the renderings and the comparative pictures, it strikes me that maybe it's just the way the renderings turned out. But it looks like there's significant exterior modifications to the windows and to the entryway there.'",
        "'speaker_2': 'And I'm wondering if that's so.'",
        "'speaker_11': 'So, Councilman, you'll notice that those renderings were not part of the public hearing presentation tonight for exactly that reason. When I presented to Council Committee, I tried very hard to call out that those were just for illustrative purposes to try to show the reactivation.'",
        "'speaker_11': 'And in fact, those exterior treatments were not part of what had been approved previously. And so there is work that has continued since the time that those renderings were provided to be able to address the concerns that had been raised by by the historic community.'",
        "'speaker_2': 'Okay. I was going through the one that was in our system while you were speaking.'",
        "'speaker_12': 'Sure, yeah. We had the opportunity to meet with Stonebridge and discuss those and we gave feedback around the entryway and the window changes. And then when the landmark commission did their initial form and match review, they did conditionally approve it, but not those elements.'",
        "'speaker_12': 'So there is still work to be done on the specific design features. One of our comments was around really maintaining as part of the story of the building, those up the doorways that say opportunity, for example, in that location.'",
        "'speaker_12': 'So I know there is still work to be done on the details, but the general concept has been approved by the Commission.'",
        "'speaker_2': 'Okay. And refresh my memory, because the map on the city website, the mapping function is not working. The last day and a half or so, at least for me, is the Glenarm Street side also landmarked? My recollection is that it was not.'",
        "'speaker_12': 'Yeah, that is correct. The well it's all considered part of them like Griffiths designation, but there were non contributing, contributing buildings identified within that. And so the contributing structures are in what's labeled in the designation as the area to be preserved.'",
        "'speaker_12': 'And then the glen our buildings were the area that did not, were not required to be preserved. We're actually excited that they will be anyway, but they are not part of the required preservation area.'",
        "'speaker_2': 'Great. Thank you.'",
        "'speaker_0': 'Thank you, councilman flynn. Seeing no other question. The public hearing from council bill 979 is closed. Comments by members of council. Councilman Brooks.'",
        "'speaker_6': 'Hey, thank you, Mr. Chair. Mr. President, this has been a long time coming. Matter of fact, when the issue with Emily Griffith moving and the opportunity for a redevelopment popped up, I think it was even before this council, this current council was seated and I had the opportunity to sit on a community group and deal with all'",
        "'speaker_6': 'the issues coming around. Emily Griffith I'm excited to say that preservation and revitalization can coexist, and I think this is another example of it coexisting. I think the preservation community. I think folks who are part of the downtown of a partnership all came together and agreed on a way forward.'",
        "'speaker_6': 'And that way forward set the stage for this night and this development that's coming forth. You know, I want to say that when we any time when we approve tax increment financing, there's always and people should should know that this is the question that is coming out of many of our.'",
        "'speaker_6': 'I'll just speak for myself out of my mind is. You're you're you're you're using public funds to develop this project. What is the public benefit? What's the good? And so the public good in this is that we preserves not only the legacy of Emily Griffith, but the building.'",
        "'speaker_6': 'And and and that was incredible and a very important piece for a lot of folks in my in my district. And I always tell people that if you preserve the building and not the culture, you know, what have you done?'",
        "'speaker_6': 'And so it's so important that we think about the culture. And I got to tell you, I don't know, Mr. Negro was being a little, you know, modest because I don't know, another company who's more ingrained in the least of these in this city than Stonebridge and Nava.'",
        "'speaker_6': 'Dimon Small historical fact. Councilman Flynn Nevin Dimon was actually a employee of Federico Pena at the time as mayor and got his vision for this city working for the Pena administration. And I can say with without a doubt that this company and that person really knows how to connect those who are struggling in this city with opportunity'",
        "'speaker_6': '. And so I think it was a great not only did they give $1,000,000 to Metro, where a majority of our folks of color in this city go. But he is very involved on the planning for the hospitality school.'",
        "'speaker_6': 'And the great thing about hospitality is you can you can start at a very low level and be managing in no time. But I want us to even go further. I think I think all of that is great.'",
        "'speaker_6': 'I think you guys are doing a great job. I think this is a great opportunity for women and minority owned businesses on this site. And and I will definitely be working. Radian is a great organization that connects individuals in the community who've been displaced and pushed out and connects them with businesses.'",
        "'speaker_6': 'And we're doing that at 30th and Blake right now. So I'm going to I'm going to be approving this because on every level this is the process was right. The public good and benefit is right. And I think it may be a model for, you know, the retail side as well, because we've never done this before.'",
        "'speaker_6': 'And so I appreciate that you reached out. That shows me you want to work with them. And in moving forward, I think we can attain this. Thank you. I'll be supporting this.'",
        "'speaker_0': 'Thank you. Councilman Brooks. Councilwoman Cannick.'",
        "'speaker_5': 'Thank you, Mr. President. I think Councilman Brooks said it well, but I just had to throw in a couple of thank you's to folks who didn't speak tonight, and that one of them is DPS. When there was a call for a pause and a process, they responded to that.'",
        "'speaker_11': 'Call and I thank them. And it wasn't easy.'",
        "'speaker_5': 'They maybe had some financial obligations that created some pressure for them. And so this is possible tonight, in part because of them. And also Jeannie Rob, my former my former seat neighbor and.'",
        "'speaker_11': 'Colleague.'",
        "'speaker_5': 'Who who helped to, you know, make sure the pause happened and made all of this possible as well. So whether she's watching or not, she's appreciated and her legacy is is moving forward even years after she's no longer seated at this dais.'",
        "'speaker_5': 'And I just will also share the kudos in terms of Stonebridge for for frankly, taking second and third looks in terms of what could be saved on the site. And so, all in all, an appropriate project to really complement the old and the new of our city in ways that I think make our city richer, being right'",
        "'speaker_5': 'next to the convention center there. So it'll be exciting to see that addition and.'",
        "'speaker_7': 'Change.'",
        "'speaker_5': 'Come with this preservation. So thank you.'",
        "'speaker_0': 'Thank you. Councilwoman, can each. Councilman Cashman.'",
        "'speaker_1': 'Thank you, Mr. President. I just wanted to add my underscore on a couple of things that have been said. I've spent a lot of time in that building. A dear friend has been a teacher for Emily for the most of the past 35 years and working with people with extreme physical disabilities and ESL students.'",
        "'speaker_1': 'And this is really is hallowed ground for a lot of people. And so just wanted to throw a little underscore on anything you can do to memorialize that in a fitting way so that people who remember the roots of that structure when they walk in, feel like it's been honored.'",
        "'speaker_1': 'I appreciate it. I look forward to supporting this. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Cashman, Councilman Lopez.'",
        "'speaker_1': 'Thank you, I. Cashman also took the words right out of my mouth, thinking, It's just important to incorporate that history in that legacy and then in the future build and and how you celebrate that building. It is part of our history in Denver and at a time when we where it's growing so quickly and moving and changing'",
        "'speaker_1': 'so fast, I just want to make sure that those stories don't disappear with the buildings. Right. Much needed, though, I think, you know, the use of the space is smart. However, when it comes to Emily Griffin and the concept, we have Emily Griffin in school and everything that it's done.'",
        "'speaker_1': 'I would encourage you to go cross the street or come down into the West Side and check out their campus, one of their campuses. It is amazing. The auto shop, everything that we used to have in high school out west anyway.'",
        "'speaker_1': 'And you know how to fix a car. You know how to had a saw wood. I mean, a lot of that stuff that they're working on there is is now over there. Right. And we miss that. And there's and the program they're running at, Emily Griffith, is amazing.'",
        "'speaker_1': 'They even do, you know, volunteer brake jobs if you want to go over there, I mean, that kind of thing. Right. So it's it's still around the legacy, still there. The population that's using it is benefiting from it.'",
        "'speaker_1': 'And it's close to my heart because my grandfather graduated from Melanie Griffith after he came back from World War Two. He was in high school when he was drafted at West High School? No. Highland and West Highland and all.'",
        "'speaker_1': 'Then West and then Emily Griffith, his dad, went when he finished it. So a lot of legacy for a lot of people in Denver. Thank you for for for the process.'",
        "'speaker_0': 'Thank you, Councilman Lopez. Councilman Brooks, you back up?'",
        "'speaker_6': 'Yeah. You know, Councilman Lopez mentioned Emily Griffith be on the west side and that's how the vision has spread. But I just want to be very clear that the Emily Griffith building, the DPS building, is now named after and lives on the east side.'",
        "'speaker_6': 'And there is still some training and of Emily Griffith Center there over there on the east side as well. So, you know, we got both sides of town. I'm just trying to compliment both sides. I so that's all.'",
        "'speaker_0': 'We can settle this later with a dance off right at the zero and seeing no other comments. Madam Secretary, roll call.'",
        "'speaker_1': 'They don't play that music in Reno anymore, I.'",
        "'speaker_3': 'Black eye, Brooks.'",
        "'speaker_10': 'Hi.'",
        "'speaker_3': 'Espinosa. Hi, Flynn. I feel more I Cashman. I can reach Lopez.'",
        "'speaker_10': 'I knew.'",
        "'speaker_3': 'Ortega. I Susman.'",
        "'speaker_4': 'Right.'",
        "'speaker_3': 'Mr. President.'",
        "'speaker_1': 'I.'",
        "'speaker_0': 'Madam Secretary, please close the voting and announce the results.'",
        "'speaker_3': '12 by.'"
    ],
    "A bill for an ordinance naming the park at 2140 West Asbury Avenue as La Lomita Park. Approves the naming of the park at Asbury and Tejon as La Lomita Park located at 2140 West Asbury Avenue in Council District 7.  The Committee approved filing this item at its meeting on 9-11-18.": [
        "'speaker_0': '12 hours. Council Bill 979 has passed. All right. We have one more tonight. Councilman Lopez, will you please vote council bill nine, seven, six on the floor.'",
        "'speaker_1': 'Yeah, I move that 976 series of 2018 be placed upon final consideration and do pass.'",
        "'speaker_0': 'It has been moved and seconded. The public hearing for Council Bill 976 is now open. May we have the staff report?'",
        "'speaker_5': 'Good evening. Laura morales, Parks and Recreation. So just here to introduce the naming of the park at Asbury and taken in District seven. It is an unnamed park at the moment and even though it is a designated park.'",
        "'speaker_5': 'So it is exciting for this to come through today. So this has gone through the formal process and I will be handing it over for the formal presentation for Anita in a minute. But first, they did go through all of the signatures.'",
        "'speaker_5': 'They got 300 plus signatures, number of letters of support, as well as a unanimous vote from our Parks and Recreation Advisory Board. They already did a very emotional public hearing. And you can see the turnout tonight even during a Broncos game.'",
        "'speaker_5': 'Nice, nice job. So we are excited to have this move forward. Our director of executive director has recommended this as well. So this one last comment before I turn it over is that they did go through for this park design, a community design process in 2017.'",
        "'speaker_5': 'So we'll be getting some upgrades and that construction will start in 2019. So it is a good timing for a park naming to happen. So with that, I will turn it over to Commander Martinez and to Anita Banuelos.'",
        "'speaker_5': 'Hello. My name is Anita Banuelos. I'm a counselor to councilman president. Councilman Clark. I'm a Denver native. Born and raised. I grew up in in Denver and still live in southwest Denver at Mar Park. I would like to first say a few words before going into the naming presentation of Asbury Park.'",
        "'speaker_5': 'It has been my pleasure and honor to work on the naming of the park in southwest Denver. I would like to first thank Commander Martinez. He has been such an important part. You will hear later. Hear why? I would also like to thank the residents who signed the petition, primarily Commander Martinez's family members, as well as the'",
        "'speaker_5': 'registered neighborhood associations Belford ATH Ma Park and College View, who all supported the naming of aspiring te home park. It is moments like this that truly emphasize the importance of community. In this presentation, you will hear why La Lomita was chosen and the beautiful history that makes our city what it is today.'",
        "'speaker_5': 'We cannot forget the decades and generations of families who settled here and share their stories. They are the thread of what Denver is and what continues to be today. It is my pleasure tonight to share this long overdue recognition of a long family history.'",
        "'speaker_5': 'Currently, the park's one function is reducing flooding, clear water, improving air quality, cooler local temperatures. Increase habitat. Connection to nature. A local learning laboratory. The park is going to be remodeled. Just as Laura mentioned, some of the things that we have done is in partnership with South Platte River, funded by Denver Parks and Rec, Public Works and'",
        "'speaker_5': 'Water Management. The area currently right now has a detention pond right in the middle of both of the partials. And so with the upgrades, it will be more emphasize of the design to connect residents to the park. The current conditions of the park.'",
        "'speaker_5': 'If you look at it now in the slides, it is does have a lot of trees, but it's not very friendly to the conditions as it is now. And a lot of family members and residents in the area do not visit the park as much.'",
        "'speaker_5': 'Potential park elements in the future, the rock playing soccer fields, a walking path. We did go out to the elementary schools and asked the children what they would like to see in their neighborhood park. So the construction of the park actually popped up the name.'",
        "'speaker_5': 'Just to let you know, when Councilman Clark took office, he will like to get a list of all the parks in his district, and three parks are without any names. So this one is the first park that we are going through, the whole naming process.'",
        "'speaker_5': 'The other two parks are in Belford. Some of the other options was Goat Hill, Domingo Abeyta Park and TODO El Mundo every todo el mundo everybody's world. Both for the park name option was 28, 21 and 21 for from an outdoor park in Gold Hill, which is kind of ironic that seven votes actually made La Lomita the'",
        "'speaker_5': 'park name. We did ask for young students at the local elementary schools to actually vote for this, even though they are unable to sign the petition. And I'm going to pass that over to Commander Martinez. And he can go over more of the history.'",
        "'speaker_10': 'Good evening. I'm Jeff Martinez and I'm honored to be here. Thank you for taking the time to allow us to speak. So you're probably wondering, how did I end up getting involved in this? Well, working closely with a lot of the council.'",
        "'speaker_10': 'I'm here, councilman clerk's office with Anita Banuelos. She called and told me that they were going to rename the park. I said, my family grew up there. That's where our family roots are from. We call that goat hill.'",
        "'speaker_10': 'We had a family restaurant that was there. She said, Really? Tell me more. So we went on and and we talked a little bit about the family. So I told her about that area. That was an area that was very poor.'",
        "'speaker_10': 'There were people there that didn't have water. Most people didn't have water at the time that most of my family moved in there. Evans Avenue, which we know now, is a very busy street, was nothing more than a dirt road with two big ditches on both sides.'",
        "'speaker_10': 'And the family restaurant that was put there was put there right in Goat Hill. So that's kind of how I got involved in this and tell you a little bit about this. So in the 1960s, again, my family lives there.'",
        "'speaker_10': 'Well, they're actually there in the forties and fifties. But in the sixties there was a building that was there, and my uncle and aunt owned the building. It was several different things. It was first called Evans Heights Grocery.'",
        "'speaker_10': 'It was a small grocery store that served the people that were there. Everybody would go there and there was a lot of business. Well, one Brentwood shopping center open, a place called Save a Nickel came along and a little bit bigger company, a little bit bigger grocery store.'",
        "'speaker_10': 'So people started going to save a nickel, put the family business out of out of business. So they tried a furniture business for a while there that did okay, but not too well. And then the family, because there were six.'",
        "'speaker_10': 'That's my family up there. That's my grandma and Grandpa Domingo and my two year Obeida. And there are six daughters and three sons. My mother was one of the daughters, Betty Abeyta, and they all would get together and they would make a lot of us Mexican-American Spanish food, more or less New Mexico style food.'",
        "'speaker_10': 'And they were great cooks. So they thought, why don't we try this as a restaurant? So a couple of the family members first opened this up and they called it La Lomita. La Lomita means the little hill. So the goat hill set up on a little bit of a hill.'",
        "'speaker_10': 'So it was called the La Lomita. So they tried the restaurant had changed hands a few times as the years went on. My parents being one of them, aunts and uncles, other aunts and uncles also owning that and operating that.'",
        "'speaker_10': 'So it was a great place for people to gather. There was a jukebox where the music was always playing. People came in. They were homemade tortillas made by hand. There were lines sometimes out the door with people waiting to get in, to listen to the music, eat the good food, and it was there.'",
        "'speaker_10': 'It's just a great place for the family or all the families that lived in that general area. This is an actual picture of that building called a la Lomita. There's a house that's right next door there. That building still stands.'",
        "'speaker_10': 'It's a house that my and uncle that own this property lived in. But this is an actual picture of it when it was a cafe, the La Lomita Restaurant. These are some more pictures. These pictures are all pictures that were taken in that area during the forties through sixties, the one with the glass windows on the front'",
        "'speaker_10': 'with the family sitting around. That building still exists. That's right next to where the Lomita restaurant was. So a lot of love, a lot of family, a lot of things that happened there. Our families have grown. And most of our my aunts and uncles have passed away.'",
        "'speaker_10': 'We have one actual family descendant, my Aunt Maggie, that is still alive. She's the last of the immediate family. And then we have my we call her my Aunt Arlene. She is truly my cousin, but she is my aunt.'",
        "'speaker_10': 'She's growing up as my aunt. She's going to speak later. But our family has passed away, our mothers and fathers, except my father is still here with us. 87 year old native of Denver. So we are doing our best to preserve a small part of our family, a family that was always gentle.'",
        "'speaker_10': 'They were kind. They have a lot of integrity, but they were a lo. They were a family that not a lot of people know about, but they are what Denver was founded on. And we believe that it is time that we have some mark of our family.'",
        "'speaker_10': 'We didn't think it would be right to just name it Abeyta Park because that put a little bit too much of a name of our family. But the building that a very family owned and operated La Lomita, we think is very important.'",
        "'speaker_10': 'And we would love if you would honor as with naming the park it as guarantee. Joan La Lomita Park, thank you.'",
        "'speaker_5': 'So as part of the petition process, you have to collect 300 signatures and we collected 316 signatures from Val Verde all the way to Platt Park Overland. And we did go to some of our registered neighborhood organizations to ask for signatures.'",
        "'speaker_5': 'And we did also get some letter of support on the west side of District seven. Like I mentioned earlier, Val Verde, Armagh Park, Ruby Hill, Guardsman, and College View. And during that whole process, we did not get any negative feedback or any opposition.'",
        "'speaker_0': 'Thank you very much. All right. We do have excuse me, five individuals signed up to speak this evening. And so if you're signed up to speak for this, if you come up to this front bench, so when I call on you, you can step up to the podium and start your remarks and your time will start.'",
        "'speaker_0': 'For this hearing, you are limited to 3 minutes. So first up, we have Arlene McIntosh. The first one.'",
        "'speaker_11': 'Yeah. Good evening, council members. My name is Arlene McIntosh, and I'm a Denver native. I'm married. I'm married to Early McIntosh. I am the granddaughter of Domingo and Donatella Obata.'",
        "'speaker_5': 'I was raised by my grandparents. I called them all my daddy. I was one of the family. I am retired.'",
        "'speaker_11': 'I owned a business.'",
        "'speaker_3': 'Arlene's Trophies, for.'",
        "'speaker_11': '27 years. And my daughter Sonya still has the shop.'",
        "'speaker_5': 'And the president of the Denver 600 500 bowling club.'",
        "'speaker_3': 'And I'm the only.'",
        "'speaker_11': 'Hispanic female in the Denver Bowling Hall of Fame.'",
        "'speaker_5': 'We moved to the Hill in 1944.'",
        "'speaker_11': 'My Aunt Minnie and Uncle Joe.'",
        "'speaker_5': 'Romero had purchased 20 acres from Evans to Asbury.'",
        "'speaker_11': 'And Tyrone to Leo.'",
        "'speaker_3': 'They brought an old.'",
        "'speaker_5': 'Army barrack and moved it onto the property on Asbury, right where the park is. We did not have a floor, water or electricity.'",
        "'speaker_9': 'We had an outhouse and a montgomery ward.'",
        "'speaker_5': 'Catalog that we used for.'",
        "'speaker_11': 'Daddy put in the floor.'",
        "'speaker_5': 'There were seven of us.'",
        "'speaker_11': 'Lived in three rooms. Daddy, Momma, Uncle Porky, my mom, Yvonne, Margie, Betty and myself and my Aunt Minnie and Joe owned the grocery store. It was called Evans Heights Grocery Store in 1942 to 1955 and around 1955. My Aunt Lillian, Walter.'",
        "'speaker_5': 'Lopez, Sara and Carlos Lopez and Anna and Willie.'",
        "'speaker_11': 'Hernandez were the first owners of the La Lolita Caf. Then later, my uncle Felix and Clarinda Beda, my Aunt Betty and Chuck Martinez and Betty and Becky Candelaria.'",
        "'speaker_5': 'They were cousins. We're also owners.'",
        "'speaker_11': 'I worked as a.'",
        "'speaker_5': 'Cashier and a waitress. We would be very honored to have the park called La Lomita. Thank you.'",
        "'speaker_0': 'Thank you very much. Next up, David Roybal.'",
        "'speaker_10': 'So. David Rebel 742 West Ninth Avenue. Thank you, Councilman Clark, for the whole process naming this park and everyone as part of that. And our parks are places of gathering of culture and peace. And to see all the history that goes behind that, you want to make sure that's known.'",
        "'speaker_10': 'And and I just hope that I just hope that the park, you know, serves all the people well in that area and the other naming of your parks and is very good process to look forward to the naming of the next parks.'",
        "'speaker_10': 'Thank you.'",
        "'speaker_0': 'Thank you. Next up, Gil Levinsky.'",
        "'speaker_5': 'Since 1960.'",
        "'speaker_11': 'Must be getting hard of hearing. My name is Gail Martinez.'",
        "'speaker_5': 'I reside in Lakewood now.'",
        "'speaker_12': 'But I grew up there at the level of meet them. My parents were one of the owners at one time. We were little kids.'",
        "'speaker_3': 'And we actually lived in the basement.'",
        "'speaker_12': 'At the academy. So it was.'",
        "'speaker_7': 'Quite an experience.'",
        "'speaker_11': 'Living there and growing up in my family and. I've said on a.'",
        "'speaker_12': 'Lot of different.'",
        "'speaker_11': 'Councils in Denver, public school.'",
        "'speaker_5': 'Councils and different.'",
        "'speaker_11': 'Westwood Neighborhood.'",
        "'speaker_5': 'Association president and I admire you all for what you're doing. I know it's a lot of.'",
        "'speaker_3': 'Work and a lot.'",
        "'speaker_11': 'Of time, but as.'",
        "'speaker_5': 'Far as the park goes, a one point I wanted to make.'",
        "'speaker_11': 'Was that I think that the name The Limit that not only depicts.'",
        "'speaker_12': 'The.'",
        "'speaker_7': 'People that grew up around there, the restaurant.'",
        "'speaker_11': 'That.'",
        "'speaker_5': 'So many people.'",
        "'speaker_11': 'Came.'",
        "'speaker_5': 'Around and enjoyed for so long. But the fact that the name La La Meta also is a good name for the community that is living in the area at this time because it is a very.'",
        "'speaker_11': 'Large Hispanic Mexican community right now. And I think I think the name fits it perfectly. So that's basically all I wanted to say.'",
        "'speaker_7': 'And again, thank you all for your time.'",
        "'speaker_0': 'Thank you. Next up, Jesse Paris.'",
        "'speaker_13': 'Jesse Paris can the city council at large 2019 that starts a movement. Community Positive Action Community Committee. Network for Change and the Abraham Asilo. We approve this name change. It's good to see that you are getting community involvement.'",
        "'speaker_13': 'The community has been involved in this whole process. The people in this neighborhood have been involved in this whole process so we can do nothing but approve the wishes of the people. Thank you.'",
        "'speaker_0': 'Thank you, Chairman Sekou.'",
        "'speaker_2': 'German Psycho Blackstar exit movement. Self-defense. Proud to represent poor working. Poor homeless people and senior citizens and students. There's not much more I can add other than to say Congratulations, you guys, for stepping up and and putting your stamp on this.'",
        "'speaker_2': 'And because I feel very confident that this is going to be not only a safe park, but a sacred park, because we've got the police now in charge of that. So we know this is going to be the safest park in the city to go to.'",
        "'speaker_2': 'I look forward to being there and having a good time. And if I'm still a little bit too long, I'll just wake me up and don't give me no ticket.'",
        "'speaker_0': 'Thank you. That does conclude our speakers. Are there any questions for members of council? And I'll just start by saying that everybody who's here to support this got up and spoke. So if you are here to support the renaming of this park, please, if you could stand up and show everybody on the council.'",
        "'speaker_0': 'Thank you very much. Are there any other questions? All right. Seeing none of the public hearing for council Bill 976 is closed. Comments by members of council. And I'll just start. You know, when I realized that there were three parks in District seven that had no name, I was baffled.'",
        "'speaker_0': 'I said, Wait, what is what is going on here? And started digging into them. And, you know, just earlier today at our budget conversation, we talked about the cost of your neighborhood and about often this part of Denver feeling a little bit left behind, a little bit like the city has moved on and hasn't done the same'",
        "'speaker_0': 'things. And to see this park that has such a rich history and so many people who immediately are attached to it and identified to it, and to go through this process with this amazing family, the proud setting is a little less formal than ours.'",
        "'speaker_0': 'And so I think only two people signed up to speak at that public hearing. But every time they're just about to close it, somebody else from the family would stand up, be like, okay, I've got a story and just come up to the microphone.'",
        "'speaker_0': 'And just it was such a joy to sit and listen to this rich history that this that this family that has built this part of South Denver for decades. To hear that and to be able to be a part of that.'",
        "'speaker_0': 'I was just struck by the fact that this area, this park does have a name. We've just never officially taken the steps to put a sign in it. But this is La Lomita Park. And on top of that, I just am continually blown away by this family that to recognize these deep roots and decades of building Denver'",
        "'speaker_0': 'and not just in this part of Denver, this family now is spread out and look at all the great things that this family is doing for our community. You are Denver. You are our city. And to say, you know what?'",
        "'speaker_0': 'To recognize our family. Don't use a name. Let's call it by the name that we call the place. And often we're up here and we often name parks after people and that is an appropriate thing to do. But I just think it's a testament to on one of the slides, it said, you know, the humble roots of'",
        "'speaker_0': 'these humble people, you're amazing. You are just amazing individuals. It is a great honor for me to represent those of you who live in my district, to represent the land that is your family's history and heritage to the city, and to be able to sit up here in my capacity and be able to cast a vote to'",
        "'speaker_0': 'say, this has a name, let's let's officially put it on there, let's put a sign and let's have a party is just a really amazing opportunity for me. It's one of those moments that's very special for me, and I thank all of you for allowing me to be a very small part of it, for sharing your family's'",
        "'speaker_0': 'history with me and with us, and for all of the quiet moments that nobody will ever know where your family for the last. 80 years has built this city and continues to build this city. You are Denver and thank you for everything.'",
        "'speaker_0': 'I want to give a special shout out to Anita from my office from all of her hard work on this. Just awesome. And Commander Martinez, just for I mean, absolutely. Being a rock star across everything and helping with this.'",
        "'speaker_0': 'And then everybody who came down, paid for parking, went through security, sat around through a long meeting to stick with us. Thank you. Thank you. Thank you. Thank you. Thank you. And there are some other people would like to say stuff, so I'm gonna stop now.'",
        "'speaker_0': 'Councilman Lopez.'",
        "'speaker_1': 'Well, I just wanted to say congratulations, I think. You know, and any time that you're able to get a park that has not been named formally and to make it reflect the history of the neighborhood, evolve folks in that process and tell the story, I think it's a good thing.'",
        "'speaker_1': 'It's a great thing. That's how the sense of Chavous Park was named. That's how weird culture was. Now we're called Park is now named Ruth Training Park. So it's just a reflection of who we are as a city and as a community.'",
        "'speaker_1': 'And now when people say, Hey, you want to meet up along La Lomita, I say, Yeah, sure. I'll see you at La Lomita. I say, I'll be there. I like the ring. Has a nice little it has a nice little ring to it.'",
        "'speaker_1': 'It's almost like a East L.A. Taco thing. And La Lomita, they don't meet that, right? I like it. I dig it. All right. Congratulations.'",
        "'speaker_0': 'Thank you, gentlemen. Lopez Councilman Flynn.'",
        "'speaker_2': 'Thanks for president. I was sitting here during the presentation just struck by how your family's story is so similar to so many families who will be able to recognize themselves in your heritage and enjoy this park. And Jeff especially reminded me of my family.'",
        "'speaker_2': 'So similar to yours, a huge Irish family. Hardscrabble. I think we use the Sears catalog. My my not the Montgomery Ward the of that when they had the outhouses but how they built themselves into the community. Now, this was back in New Jersey, but they were all mostly railroad and foundry workers.'",
        "'speaker_2': 'But one branch, my grandfather especially ran a dining car on the Lehigh Valley Railroad and grew that into a hotel business. And then his son, my uncle, who's now passed away, had a one of the best catering spots in Phillipsburg, New Jersey, right across the river from eastern Pennsylvania.'",
        "'speaker_2': 'And it's still going strong. But the way you talked about your family just struck a chord in my family's history that I said we have to honor these sorts of things in our city. We have to memorialize and make permanent the place, the places that meant so much to the people who built this city.'",
        "'speaker_2': 'And so, Jeff, and to the whole family, the abate of high five, some debaters who sing and who sang in my church choir for many years. Jerome and Louise and. And Tyrone. It's just such a pleasure to recognize the like.'",
        "'speaker_2': 'As others have said, not the family name, but the institution they built that so many people will recognize. And maybe that story gets passed down to new people in the neighborhood as well, and they'll be able to feel as rooted as you have become in that neighborhood.'",
        "'speaker_2': 'So thank you very much. It's my pleasure to to support this wholeheartedly. Thank you.'",
        "'speaker_0': 'Thank you. Councilman Flynn, Councilwoman Ortega.'",
        "'speaker_11': 'Thank you, Mr. President. I want to thank and congratulate you and Anita for your efforts in you know, this this process is not easy. It's it's it's lengthy. It involves going out and getting the signatures. It's a lot of work.'",
        "'speaker_11': 'And, you know, so for you all, first of all, to bring that to the community and to say, hey, we have a park that is unnamed and we want some help from the community to name it. And then for you all to step up and say, we've got the name.'",
        "'speaker_11': 'We went through this process naming a park.'",
        "'speaker_12': 'Up in North Denver.'",
        "'speaker_11': 'After former councilman Sal Carpio and.'",
        "'speaker_12': 'I got a.'",
        "'speaker_11': 'Phone call from his family about a month ago saying we're going to have a picnic in the park. It was actually scheduled for yesterday and they invited me to come and about a half an hour before we were scheduled to have the picnic.'",
        "'speaker_11': 'They they moved it to one of the daughter's homes because they thought it was too cold for one of the little babies. But I can envision your family going and having picnics in this park. Great. Because it's.'",
        "'speaker_3': 'It's now part of.'",
        "'speaker_11': 'Part of the history that you share with future generations who are going to come to that park and say, who is this named after? And being able to have those markers at these parks, I think is really important so that it's not just a name, but it's information.'",
        "'speaker_11': 'I mean, unlike when you go up to our mountain parks or, you know, any number of places where you see more than just the name, you see the history of who, who the contributions came from that that left that legacy.'",
        "'speaker_11': 'The other important thing is.'",
        "'speaker_3': 'Our parks are now dedicated.'",
        "'speaker_11': 'So it means somebody can't come and rip up your park. The names not going to be changed. It's going to have a long term presence there for future generations in your family and other families that live in the neighborhood to enjoy it.'",
        "'speaker_11': 'So congratulations on all your hard work. Thank you.'",
        "'speaker_0': 'Thank you, Councilman. Or taken. I forgot to thank the Parks Department. Laura, thank you for having a process for the community to go through this and for helping us navigate it and for all of the work to do for of dedicating parks that's happened in the last five or six years.'",
        "'speaker_0': 'So thank you very much. Well, let's not delay any more. Let's make it official. Madam Secretary, roll call.'",
        "'speaker_3': 'Brooks. A black eye. Espinosa. Hi, Flynn. Hi, Gilmore. I Cashman. I can reach Lopez. I knew Ortega. I Susman. I Mr. President, I.'",
        "'speaker_0': 'Madam Secretary, please close voting and announce the results. 1212 hours council bill 976 has passed and the park is named. All right. Congratulations. Thank you. Seeing no other business before this body. Madam Secretary, congratulations on your first meeting.'"
    ]
}