{
    "A bill for an ordinance vacating a portion of right-of-way near 1750 15th Street, with reservations. Vacates a portion of the public right-of-way on the southeasterly corner of Wewatta Street at 15th Street, with reservations, at 1750 15th Street in Council District 9. The Committee approved filing this bill by consent on 12-13-16.": [
        "'speaker_1': 'Okay. Do a quick recap on the resolutions. I have no bill called out on bills for introduction. I have. Councilman Espinosa has called out Council Bill 1274 just for comment. And under bills for final consideration, Councilwoman, each has called out Bill 919 for a technical amendment.'",
        "'speaker_1': 'Is that correct?'",
        "'speaker_2': 'Correct.'",
        "'speaker_1': 'Okay, great. Madam Secretary, can you please pull up council bill 1274? Great, Councilman. Go ahead and make your comment.'",
        "'speaker_4': 'I'm sorry. I just. When I was looking at this. One of the things that concerns me is this is effectively a rezoning without consideration by planning board nor public notification and comment. So, well, I'm not going to interfere with the process because it is what it is.'",
        "'speaker_4': 'I have asked to meet with the developer to ascertain how they intend to address the zoning requirements with proposed future development and the public realm prior to next week's final consideration. Thanks.'",
        "'speaker_1': 'Okay. Angela Cassius, can you can you come up here? I just I just want to ask a quick question. This. This counts. Oh, this is so great. I'm telling you, I love it every time it comes up. So this is actually a sidewalk vacation, correct?'",
        "'speaker_2': 'It's a right of way vacation. So there is an easement to keep the sidewalk in tact.'",
        "'speaker_1': 'Okay. So so will there be any disruption to the sidewalk at all?'",
        "'speaker_2': 'No.'",
        "'speaker_1': 'Okay. And tell me about the public process, because this they go out to all neighborhood organizations. Correct.'",
        "'speaker_2': 'So there is a public process associated with all vacations. And so we notify the public in a couple of different ways. There's actual sign posted in the location with a contact information for the city so that if people have have questions or concerns, they can email the city.'",
        "'speaker_2': 'We also contact all of the, I guess, touching neighborhood organizations as part of the process in addition to all of the utility companies.'",
        "'speaker_1': 'Okay, great. And I'm just making sure and I know this is right in this area, there is a design review committee in this LaDonna area. So these folks will have to go before a design review board as well, right?'",
        "'speaker_2': 'I believe so, yes.'",
        "'speaker_1': 'All right. Thank you. Okay? Yeah. My best to speak. Oh, you're in there. Councilman Espinosa is in the. In the queue here.'",
        "'speaker_4': 'Yeah. So just so it's clear why based on the comments there. I that's what I meant by sort of it's sort of run of the mill in this sort of kind of request that is being made. If the reason why, I just want the public to sort of know the reason why I say it's sort of an'",
        "'speaker_4': 'effective reasoning is if you're familiar with the building adjacent to this property that houses the Q Hills restaurant, that building is subject to a setback or a step back requirement. So if that building is five storey, well, probably seven storeys or eight storeys along the street.'",
        "'speaker_4': 'And then at that point, it's supposed to step back 25 feet. And then the just the roof, the remaining storeys go up. And that's the requirement of zoning when you effectively claim through vacation the sidewalk area and move your property line from the to the alignment with the Ku Hill's building out to the curb line, that then'",
        "'speaker_4': 'effectively moves the bulk closer to the all the historic property line. And so that wouldn't be this sort of building in that area would not be allowed in the parcel as in the zone lot as defined today. But when you move in, you make the property bigger, you're you're set back requirement is based on the property line'",
        "'speaker_4': '. Therefore you're now able to step back. I mean, you're able to capture your step back requirement over that sidewalk that you're not using. And so it will result in bottom line is it will result in a different massing that could be built right on that corner after the zone, meaning after the vacation of the of the sidewalk'",
        "'speaker_4': 'and the subsequent easement, then you could do today as a use by right. And so the good thing is, is yeah, it is subject to design review. So you get a little more scrutiny on what the finished product is than you would in a lot of other parts of the city.'"
    ],
    "AS AMENDED, a bill for an ordinance amending Article V of Chapter 2 of the Revised Municipal Code pertaining to financial disclosure.  Revises the Denver Revised Municipal Code regarding financial disclosure including eliminating the requirement that candidates for municipal office make financial disclosures, modifying the definition of gift, immediate family and officer, modifying the date for submitting the annual financial disclosure statement for city officers, requiring semi-annual gift disclosure reports by officers and annual gift disclosure reports by employees, modifying reportable gifts and increasing the reporting threshold from $25 to $50; making the financial and gift reports of officers publicly available online and the gift reports of employees publicly available on request, and modifying the remedies for violations of the ordinance.  The Committee approved filing this bill at its meeting on 11-29-16.  Amended 1-3-17 to remove the minimum $50 threshold for reporting gifts in the covered categories, resulting in the reporting of all gifts received in the designat": [
        "'speaker_4': 'The majority of the city. But it is it is it is one of those things that it wouldn't be clear when you're talking about simply a ride away vacation, you don't know how that's going to actually subsequently influence the mass of a building that goes next to it.'",
        "'speaker_1': 'Things are right next. Bill, call it out. Can you please, Madam Secretary, bring up Council Bill 919 for amendment. Councilwoman Canete. You've called it out. Would you like to make a comment before?'",
        "'speaker_2': 'Thank you, Mr. President. I will be offering a technical amendment to Council Bill 918, which pertains to financial disclosure. The technical change corrects an error pertaining to the effective date of the new reporting requirements. As I described last week, I intended the semiannual gift reporting requirements to begin in July of 2017, which will be the first reporting'",
        "'speaker_2': 'gift period to which the new reporting rules apply. The amendment reflects the semiannual nature of the proposed financial disclosure statements.'",
        "'speaker_1': 'Great. Councilman Flynn, will you put the bill on the floor?'",
        "'speaker_3': 'Yes, Mr. President. I move that council bills 16 919 as amended on January 3rd, 2017, be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. It has been moved needed a second or great council can each. Your motion to omit.'",
        "'speaker_2': 'I move that council bill 919 be amended in the following particulars on page two line 38 strike quote beginning in 2018, end quote. And replace with quote, beginning July 31st, 2017. Period, end quote.'",
        "'speaker_1': 'Okay. That is very technical and has been moved and waiting on a second. Any more comments?'",
        "'speaker_2': 'Yeah, just my apologies. We described it correctly last week and did my best to reread the bill, but I missed this. This change was not made in the in the amendment as in the bill as intended and this particular spot.'",
        "'speaker_2': 'And so we are just cleaning it up. Apologies to my colleagues.'",
        "'speaker_1': 'All right. Council Bill 919, as amended on the floor. Madam Secretary, roll call.'",
        "'speaker_2': 'Can each I.'",
        "'speaker_7': 'Lopez.'",
        "'speaker_4': 'All right.'",
        "'speaker_7': 'New.'",
        "'speaker_2': 'SUSSMAN My.'",
        "'speaker_7': 'Black eye. CLARK All right. Espinosa.'",
        "'speaker_3': 'FLYNN Hi.'",
        "'speaker_7': 'Gilmore. Herndon. Cashman. Hi, Mr. President.'",
        "'speaker_1': 'I. Close voting announced results. 12 Eyes 12 Eyes Council Bill 919 has been amended or we have voted on amend it now. Councilman Flynn, we need the motion to pass as amended.'",
        "'speaker_3': 'And thank you, Mr. President. I move that council bill 2016 does 919 as amended be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. Has been moved and second comes of of members of council no comments Madam Secretary roll call.'",
        "'speaker_2': 'Can each I.'",
        "'speaker_7': 'Lopez. New assessment i black. Clark. Espinosa. I. Flynn. I. Gilmore. I. Herndon.'",
        "'speaker_3': 'Cashman, i.'",
        "'speaker_7': 'Mr. President.'",
        "'speaker_1': 'I. Please close the voting and announce the results.'",
        "'speaker_7': 'To advise.'",
        "'speaker_1': 'All right. To advise. Council Bill 919 passes as amended. This concludes the items that need to be called out. All other bills for introduction are now ordered publish. We're now ready for the block votes on the Bills on resolution bill for final consideration.'",
        "'speaker_1': 'Council Members Please remember that this is a consent or block vote and you'll need to vote I. Otherwise, this is your last chance to call out an item for a separate vote. Councilman Flynn, will you please put the resolutions for adoption and the bills on final consideration for final passage on the floor?'",
        "'speaker_3': 'Yes, Mr. President. Yes, Mr. President. I move that the resolutions be adopted and the bills on final consideration be placed upon final consideration and do pass in a block for the following items. 2016 1332 1276 1321 1322 1328 1333 1335.'",
        "'speaker_3': 'Series four 2017 A Number ten Series of 2016 1273 1290 1336 1240 1329 Series of 2016 1117, 12, 65, 13, 15, 13, 16 and 1320.'",
        "'speaker_1': 'Just making sure you got him on the you know.'",
        "'speaker_3': 'I believe I did.'",
        "'speaker_1': 'Yes. A good way to congratulate you, sir. All right. Thank you. It has been moved. We need a second here. Madam Secretary, Oracle.'",
        "'speaker_2': 'Black. I.'",
        "'speaker_7': 'Clark. All right. Espinosa. Flynn. Hi. Gilmore. Herndon. Cashman. Hi. Carnage. Lopez.'",
        "'speaker_2': 'I knew.'",
        "'speaker_7': 'Susman. I. Mr. President.'",
        "'speaker_1': 'I. Please close the voting. And as a result.'",
        "'speaker_7': '12 eyes.'",
        "'speaker_1': '12 eyes. The resolutions have been adopted in the bills have been placed upon final consideration and do pass. Tonight there will be a required public hearing on Council Bill 1071 concerning property taxes dedicated for the purpose of purchasing services for persons with intellectual and developmental disabilities, and to require a public hearing on Council Bill 1125 Change Zoning'"
    ],
    "A bill for an ordinance adopting a new Article XVII of Chapter 53, D.R.M.C. concerning property taxes dedicated for the purpose of purchasing services for persons with intellectual and developmental disabilities. Amends the 2003 initiated ordinance that increased the Developmentally Disabled Fund by 1.000 mill to the dedicated property taxes to add Section 53-550 to allow for purchasing services for use of the revenues for persons with intellectual and developmental disabilities. The Committee approved filing this bill at its meeting on 12-14-16.": [
        "'speaker_1': 'State your name and note that you are available for questions of counsel. Speakers will have 3 minutes unless another speaker has yielded his or her time, which would result in a total of 6 minutes on the presentation monitor.'",
        "'speaker_1': 'On the wall you will see your time counting down. Speakers must stay on topic of the hearing and must direct their comments to the council members. Please refrain from profane and obscene speech. Direct your comments to council as a whole and refrain from individual personal attacks.'",
        "'speaker_1': 'Councilman Flynn, will you please put Council Bill 1071 on the floor?'",
        "'speaker_3': 'Yes, Mr. President. I move that council bill 1071 series of 2016 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved and seconded. Public hearing of Council Bill 1071 is open. May we have the staff report? Jay, Marine for Human Services. Come on down. Oh, Rafael Espinosa, come on down as well.'",
        "'speaker_9': 'Good evening. I'm Jay Marine. I'm the chief of staff for the Department of Human Services. Presenting an overview of the Council Bill 1071, which is in front of you tonight, is short background a voter initiated, voter initiated ordinance from 2003, established full mill dedicated to the community center board for people with intellectual and developmental disabilities.'",
        "'speaker_9': 'The Denver City Auditor just over a year ago audited and released his report of findings of the spending of the mill levy funds that have passed through the Department of Human Services and since the origins of the mill levy have been contracted to the state designated community center board Rocky Mountain Human Services, who's also doing business as'",
        "'speaker_9': 'Denver options in the auditor's report. The auditor made a series of recommendations which we try and address through the ordinance in front of you tonight. The recommendations the auditor made included determining whether to codify Initiative 100 in the city ordinance.'",
        "'speaker_9': 'Clearly, that's what we're trying to do today. Determine what constitutes questionable spending of mill levy funds. Limit administrative costs to 15%. Determine how best to address residency requirements and to monitor the contract on a quarterly basis. This ordinance that we're requesting today did come before committee on December 14th and is required to be prior to its passage'",
        "'speaker_9': 'needs to be preceded by the public hearing, which is scheduled this evening. The elements of the proposed ordinance include directing that the proceeds from the mill levy be deposited in the Human Services Special Revenue Fund, as it has been by practice, and it defines permitted use of the proceeds to include to contract for services and supports through'",
        "'speaker_9': 'the Community Center Board, to contract for services and supports through any other entity that provides such services. Authorizes the transfer of funds to the Colorado Department of Health Care Policy and financing for purposes of receiving matching federal funds to provide Medicaid approved waiver services.'",
        "'speaker_9': 'And sets an administrative expenses limit to less than 15%. The residency requirements have been aligned in the ordinance to that which appears in state rules and requirements. And the ordinance includes a carve out of mill levy revenues not to exceed 75/100 of a percent of the total collections for the Department of Human Services to administer and enforce'",
        "'speaker_9': '. That's 70/500 of a percent equates to about $114,000 annually under the current mill levy revenues of roughly $14.5 million. And with that, I open it up. Two questions I've been joined this evening by Sheri PINSKY, the CEO of Rocky Mountain Human Services, to field questions as well.'",
        "'speaker_1': 'Okay. Thank you. All right. I'm going to call up. Let's see here. Yes. I'm going to call up the first. You can have a seat, James. I'm going to call up the first five speakers and you can just come up to the front and patent.'",
        "'speaker_1': 'Don Caldwell. Rob Hernandez. Marine Welch. Okay. All right. And Penn, first you have 3 minutes.'",
        "'speaker_2': 'Thanks. Hi. My name is Ann Peyton. I live in Denver in Councilman News District. I want to applaud the council for taking this issue so seriously and very much appreciate the questions you've been asking. I watched the video of your December 14th meeting and also want to seek clarification on the admin expenses.'",
        "'speaker_2': 'But I see this is a great opportunity to make things right for the people that desperately need this support. And I support a yes vote on this bill. I'm the parent of a 33 year old man with autism who lives in his own home with 24/7 support through the deed comprehensive waiver.'",
        "'speaker_2': 'He also lives in councilman whose district. My son has received services through Rocky Mountain since 2002 in various capacities, but now they just provide case management. Because I created my own past two and a half years ago to provide residential community and supported employment services to my son under a unique model that better meets his needs.'",
        "'speaker_2': 'I recently joined the Rocky Mountain Human Services Mill Levy Committee because as a taxpayer and supporter of this mill levy, I was horrified with the auditor's findings and want to help Rocky Mount and figure out better ways of supporting families with IED with this money.'",
        "'speaker_2': 'As a parent, I am very familiar with the support needs of families, but I also had knowledge as a service provider. There are many opportunities for ways to get this mill levy money into the hands of families. And I'm anxious and excited to see this happen.'",
        "'speaker_2': 'For instance, I had to pay out of pocket for Denver Parks and Rec summer camp for my son because the DPS school summer program didn't meet his needs. He wanted a fully inclusive experience, and he found that here at the Parks and Rec, this is a great example of how the mill levy funding can be used.'",
        "'speaker_2': 'My my son still has friends to this day, both peers and counselors that he often sees in the community. Today, in reviewing the six month mill library report January to June 2016, a concern for me is the amount of mill levy money that was spent on case management, about 56% across all waivers.'",
        "'speaker_2': 'This is based on actual numbers as denoted through the legend and not the pie chart. This 56% is over and above the case management amount. They already bill medicaid for. I appreciate that some of this goes to interagency team meetings and other valuable needs.'",
        "'speaker_2': 'However, in my opinion, mill levy dollars should be going to programing, not supplanting billable operating expenses to the tune of an additional 56%. In addition, I question whether some of this could be attributed to Adnan, but that is for the accountants to do to decide.'",
        "'speaker_2': 'Personally, for me, I wish I had access to dollars over and above what services I can build Medicaid for. I can barely make my payroll at $15 an hour and I do not pay myself anything.'",
        "'speaker_5': 'This better.'",
        "'speaker_1': 'Miss Penn, your time is up.'",
        "'speaker_2': 'Thank you. That's what I was going to say for your interest in diligence on top of all this. I really appreciate it.'",
        "'speaker_1': 'Thank you, Don Colwell.'",
        "'speaker_2': 'Hi. My name is Don Caldwell. I have a I'm sorry, I'm in Highlands Ranch, Douglas County. I have a 16 year old son who is on the way over and receives case management services through Rocky Mountain Human Services.'",
        "'speaker_2': 'I am a recently authorized pastor for my son and in my previous life I was a consultant that automated home health agencies. I came today to thank the Council for their leadership on this bill. I hope you will approve the bill.'",
        "'speaker_2': 'They're clear, and I appreciate your clear understanding of conflict free case management issues and understanding that the community desires to quickly open up the levy funds for competitive bidding. Opening the funds to all existing providers would level the playing field among all the agencies and providers and allow individuals and families the ability to self-determine the best use'",
        "'speaker_2': 'of funds to meet their needed services and supports. I respect Rocky Mountain Service, Human Services and all that they do. But I still have concerns that some of the issues that arose have not been resolved. And some of the issues with their Malawi sole discretion creates conflict because Rocky Mountain has sole use of those funds.'",
        "'speaker_2': 'At the December meeting, there was discussion that they would be withholding several million dollars this year from individuals that could use those services. That was without public comment or hearing or any kind of vote. They have a disproportionate amount of Malawi funds for case management.'",
        "'speaker_2': 'I myself have I have personally experienced two instances where case managers insisted on excessive and invasive case management meetings that were beyond Medicaid requirements. I am concerned that there's no substantive data in the middle of your reporting that explains how the funds are being used, in particular when looking at the residential program.'",
        "'speaker_2': 'It appears that Rocky Mountain is not a profitable passive home health agency in this program. They're able to bill 12% of all billable contractor units. They are able to build 60 hours of case management per customer. The existing pastors and home health agencies in the out in the market who do not have access to mill levy funds'",
        "'speaker_2': ', are able to provide all of these services and meet Medicaid requirements while also being profitable. Rocky Mountain, on the other hand, appears to be covering significant losses, with 800,000 of m.y funds almost an additional $9,000 per each of the 92 customers being served.'",
        "'speaker_2': 'So my hope is that if you will, open up the military funds to competitive bidding, that it will create a more robust marketplace of choices. The reason I bring it up, I apologize, is that the December 14th meeting, Department of Human Services said that while it is in the bill, they're not looking to actually activate that.'",
        "'speaker_4': 'Mascolo Your tie, sir.'",
        "'speaker_2': 'Thank you.'",
        "'speaker_1': 'Yeah, thank you. Rob Hernandez.'",
        "'speaker_4': 'Do you want to get? Good evening, council and members of council. My name is Rob Hernandez and in here I have with me tonight is Danny and Jo. And they received their case management services through Rocky Mountain Human Services.'",
        "'speaker_4': 'I want to touch a little bit on conflict case management. That's the federal rule that came out in in March 17th of 2014 that says that community center boards have to separate case management services from direct services. In other words, right now, Rocky Mount Human Services does both.'",
        "'speaker_4': 'They do case management services and they do residential, which is what they are, which is the program that Danny and Joe are under. So the beauty of this ordinance that that is before council tonight is that it's going to allow for robust competition.'",
        "'speaker_4': 'In other words, the types of services that aren't available under the state plan, which is the Medicaid waiver, which is approved by the Centers for Medicare and Medicaid Services. This would cover those types of things, whether it's Joe needing let's say he wants to do some something, he wants to learn how to swim or Joe Danny needs'",
        "'speaker_4': 'a wheelchair ramp or some type of special services that aren't covered. When I campaigned for this in 2003 and went door to door and Joe carried signs, you know, in favor of it. That was the intent that they would cover those types of services that were not covered by Medicare, Medicaid, and that would complement those types of'",
        "'speaker_4': 'things. So I want to just thank Council for their leadership, because this fits right into what the state has said. They have said that is there that there may be more than one CCP after conflict case management occurs.'",
        "'speaker_4': 'And what they have said is that it is up to the local governments to determine the flow of these mill levy moneys. So I want to thank Council for taking the time to really consider this, because this is groundbreaking throughout the state.'",
        "'speaker_4': 'Other other local governments throughout the state will look to Denver to say, Oh, gee, Denver did it this way. Maybe, perhaps this is what we need to do with our mill levy money with our CCP. So thank you for your leadership.'",
        "'speaker_4': 'And any questions? I'm done.'",
        "'speaker_1': 'Thank you. And thank you, Joe and Danny.'",
        "'speaker_4': 'Thank you. Well, Danny, you didn't sign up. Well, I have a minute left. Danny just wants to say hello.'",
        "'speaker_5': 'Yes.'",
        "'speaker_4': 'This is Danny. He can't. He can't reach it. Just say hello, Danny. Uh Premiere. Oh, that's okay. That's okay. We should have known if I should have not. I'm sorry. I'm sorry. Council members. I should've known that was okay.'",
        "'speaker_1': 'It's okay.'",
        "'speaker_4': 'This is why he's in a wheelchair.'",
        "'speaker_1': 'But is he okay?'",
        "'speaker_4': 'Yeah. What he's told you is that his mom died. Okay. So every time he relives that trauma, even though it was three years ago. Yes. This is one of the special needs that this this. Okay, Joe, I think our time is up.'",
        "'speaker_5': 'Okay.'",
        "'speaker_1': 'Thank you. Maureen Welch.'",
        "'speaker_2': 'Good evening. My name is Maureen Welch, and I have a son who is nine years old. His name is James and he receives services at Rocky Mountain Human Services for his case management. And he has Down syndrome. I wholeheartedly support Bill 1071 and urge you to vote yes.'",
        "'speaker_2': 'I supported Initiative 100 back in 2003 before my son was even born. When I cast my vote, my understanding was, was that the property taxes would be used to benefit individuals directly who had disabilities, but instead it seems like it's ended up funding the costs of running a large agency.'",
        "'speaker_2': 'I was incredibly impressed and happy to watch the December 14th video from the Safe Committee. I applaud and thank the Council for its clear understanding of the urgent need to codify this initiative by passing this initiative. Denver will be at the forefront of leadership in Colorado, and you will be the shining star for other cities and counties'",
        "'speaker_2': 'to look to on how to best use their local mill levy moneys. This ordinance addresses the need to reduce conflict while also increasing choice and accountability. Councilwoman CORNISH did an excellent point about wanting to have crystal clarity on what administrative overhead is, and I urge that there is some opportunity for public to have input during that process'",
        "'speaker_2': 'as well. It was so refreshing to hear you remind the committee councilwoman that the city council is the governing body for defining administrative costs and monitoring it, not a contractor. And Councilman Flynn excuse me, Councilman Flynn requested that we speak in this hearing to the effect of considering proposals beyond Rocky Mountain Human Services.'",
        "'speaker_2': 'Historically, the only contractor for these services. I agree with more choice. There's a need for more choice in this community. A robust menu of choice will reduce conflict of interest and is much more person centered. A monopoly is not.'",
        "'speaker_2': 'My pan ultimate goal is to have individuals be able to apply directly for these funds, cutting out the 15% overhead from a middleman agency. This would allow more money to flow directly to the individual maximizing the benefit of these taxpayers monies.'",
        "'speaker_2': 'Here are just a few examples that I could think of that could be funded directly. A second creator with cerebral palsy wants to attend Park and Rec Day camp with his friends from school. He just needs help paying for the camp fee and having a support person to attend with him.'",
        "'speaker_2': 'To a young lady with Down's Syndrome needs private swim lessons at a pool in her neighborhood. Number three, an older adult loves to ride horses and would love to do therapeutic horseback riding. But this is not allowed under Medicaid funding.'",
        "'speaker_2': 'And for a musician who wants to attend open mic nights located inconveniently for public transportation. So small funding for a taxi or Uber ride would allow them to participate.'",
        "'speaker_1': 'Swoosh.'",
        "'speaker_2': 'Okay. Thank you so much. Thank you so much. I support this bill.'",
        "'speaker_1': 'Yep. Thank you. And this concludes our speakers now. Questions by members of council. Councilman. New?'",
        "'speaker_5': 'Yeah. Thank you, Mr. President. Thank you. My question was. Share your perspective, Sheriff, to come, please.'",
        "'speaker_2': 'My name is Sheri PINSKY. I'm the executive director of Rocky Mountain Human Services.'",
        "'speaker_5': 'First, I'd just like to thank Don Mars and Tim O'Brien and to doing the audit and doing the study. And also thank Sheri for pitching in to get things organized. The Rocky Mountain. I'm really proud of what you're doing and you're on the right track and Jay helping you along the way there.'",
        "'speaker_5': 'So I think we're on the right track. Can you talk a little bit about the provision of services and about services provider Rocky Mountain versus other providers?'",
        "'speaker_2': 'Yes. Thank you, Councilman, for the question. So leading up to this point, before the auditor's report. You know, we provide a variety of services at Rocky Mountain Human Services. The broadest scope of services that we provide is, in our case, management.'",
        "'speaker_2': 'We, you know, we are primarily responsible for individuals who live in Denver looking at their case management needs. So that's something that we've carried carried through here. Hearing, I think the discussions that we had in in your committee earlier this year, we heard this question around the middle of your funds being used for other providers, and we'",
        "'speaker_2': 'immediately started planning for ways to do this. We agree we agree that the military funds should be used to support other providers that do similar work that we do. Case management is a little unique because we are the only case management provider, at least right now, in Denver.'",
        "'speaker_2': 'You know, that may change down the road, but we have plans right now. We have already been funding services to other providers. We are in a good position really to assess what those overall needs are for Denver and to figure out along with the city where to prioritize those funds and how to to support other providers.'",
        "'speaker_2': 'So as an example, we have increased our are our respite services who are now serving. We're we're adding services to 400 families and respite and a variety of providers deliver those services. We're supporting residential providers. Any any residential provider that needs some help with some furnishings or some extra support.'",
        "'speaker_2': 'They have access to funds. We we do fund rec center passes now so that individuals can can receive rec center passes. So we have new new programs that we're developing all the time in the primary goal. One of the primary goals is to be sure that all providers have access to these funds.'",
        "'speaker_5': 'Right? And the transparency in communication with the community is much better, is it?'",
        "'speaker_2': 'So yes, Councilman Nu, thank you for that question. We have engaged in and put a lot of energy into our stakeholder process and we have had probably individual conversations with over 100 individuals, either in group meetings or one on one.'",
        "'speaker_2': 'We've done surveys. We've done a variety of ways to be sure that we hear the needs that families have. We are doing community forums every every quarter. I believe that we have a pretty good communication back and forth.'",
        "'speaker_2': 'I'm sure there's always room for improvement, but I'm really proud of the work that we've done, just to be sure we're listening. We really wanted to listen this year and understand what what individuals wanted.'",
        "'speaker_5': 'That's so important. I'm glad that you're improving. That's wonderful. Thank you very much. I just want to I'll be supporting this audit tonight and encourage my colleagues to also support it. Thank you.'",
        "'speaker_1': 'Thank you. Councilman new councilman Flynn. Yeah.'",
        "'speaker_3': 'Thank you, Mr. President. Rob, can I ask you a question? Could you detail a little bit more force the issue regarding the separation of case management from service provision and how that looks?'",
        "'speaker_4': 'Yes. Councilman Rob Hernandez, speaking for the record company Case Management was is a is a federal rule that came out in March 17th of 2014. And it is it applies to every single state in the union. Colorado is probably right now one of the few states that is not in compliance.'",
        "'speaker_4': 'And there are plans that the state is trying to do to bring us in compliance with basically what it says is that all KBS within the state of Colorado have to separate their case management from their direct services.'",
        "'speaker_4': 'So just think case management over here. All other services to this population over here, they cannot do both because that's where the conflict occurs, because right now everything is within one local CCP. So the trouble is, is that that's where the conflict comes in.'",
        "'speaker_4': 'You have a case management, a case manager that has the potential to steer services towards their particular their particular entity. And in the case of Rocky Mountain Human Services, I don't have an example where that's happened recently, but in the past there's have been other cases that have actually done that.'",
        "'speaker_4': 'So what this says is that there will be once it's implemented, there will be case management agencies. And so rackmount human services, like any other CCP in the state of Colorado, can choose to either be a large case management agency or they can choose to be a large direct service agency.'",
        "'speaker_4': 'My observation would probably be that because the money's in direct services, there's not a whole lot of money in case management. Matter of fact, it only amounts to about 38. O8 Is that right? Cherry About 3808 for each individual.'",
        "'speaker_4': 'So there's not a whole lot of money in case management, but there are organizations that want to come into Colorado and provide those services. And not only that, but they want to be able to pay their people well enough and and provide continuity for services for this population.'",
        "'speaker_3': 'But let me ask you, are you suggesting that one single agency cannot do both? When you talk about separating case management from service provision, can the same agency do that?'",
        "'speaker_4': 'Councilman Flynn? Rob Hernandez You're exactly correct, is that they cannot do both. The rule is very explicit that they cannot do both. And I'll give you an example. In the state of Ohio. State of Ohio, at that particular point in time, John Boehner was speaker of the House of U.S. Representatives.'",
        "'speaker_4': 'He signed off on a letter asking for an extension from case managers from CMS, the Centers for Medicare Medicaid Services. They were told that they needed to comply and that they told that they were needed to comply. They got no answer.'",
        "'speaker_4': 'And six months later, they were told that you have four days to comply, to come into compliance with conflict case management. And imagine in the state of Ohio, there are 84 community centered boards and within four days they all had to come into compliance.'",
        "'speaker_4': 'And we don't want to see that happen in Colorado, but that's why this is really a very far thinking. This ordinance shows leadership. And I want to thank counsel for introducing this.'",
        "'speaker_3': 'And thank you and God bless you for what you're doing. Senator, thank you. J Could I ask you to explain to us why the city does not plan to take advantage of the ability to seek other providers for certain service just for competitive reasons?'",
        "'speaker_3': 'Why we would not do that immediately under this new this codification.'",
        "'speaker_9': 'Thank you. Councilman Flynn, Jay, Marine Department of Human Services. When the department drafted or worked with the city attorney's office to draft the ordinance, we had built into the ordinance the ability to contract with someone other than the community center board.'",
        "'speaker_9': 'Really with our eye on what Robert has just spoken to the event at which we would have conflict free case management in could no longer contract with just one entity. So just to expound a bit on what Mr. Hernandez had said, the state legislature will need to act to bring Colorado Revised Statutes into conformance with the state'",
        "'speaker_9': 'rule or the federal rule that was passed a few years ago. And as I shared with you a couple of weeks ago, the Joint Budget Committee, which had been briefed on the conflict, three case management had been presented with some options of adopting conflict, three case management in Colorado with a time vector that went out as far'",
        "'speaker_9': 'as 2022. So this isn't a quick fix that the state will be doing. Certainly won't be doing it in four days. We hope so. Going back to to your question, why why did the department not consider bidding it out?'",
        "'speaker_9': 'We saw the efficiencies in having a single agency that's already administering the state and federal Medicaid funds, which support the preponderance of those services as being the most efficient way of continuing to administer the mill levy funds as well.'",
        "'speaker_9': 'From my last recollection, the middle of you funds comprise between 20 and 25% of all of the funding that Rocky Mountain Human Services is administering. Again, the greater share moneys associated with the federal Medicaid waivers.'",
        "'speaker_3': 'Thank you. Thank you. That's all, Mr. President. And I intend to vote for this. I'm very much in favor of this bill, and I urge my colleagues to support it also. And thank you very much for those clarifications.'",
        "'speaker_1': 'Thank you. Councilman Flynn. Councilman Espinosa.'",
        "'speaker_4': 'One more clarification, sir. So is there a shot clock of some sort for the state to to get in conformance with the federal rules?'",
        "'speaker_9': 'I'm not aware of a specific date by which they are to be in effect. From my conversations with the Colorado Department of Health Care Policy and financing, what I had been told is that the leverage that CMS was using to encourage a more timely response at the state level was that they would not approve any changes to'",
        "'speaker_9': 'the existing waivers that they currently are operating. I haven't verified that with the Federal Center for Medicaid Services, but that's what I had heard from health care policy and finance.'",
        "'speaker_4': 'Okay. Thank you.'",
        "'speaker_1': 'Okay. Councilwoman can.'",
        "'speaker_2': 'Thank you, Mr. President. JAY So we have heard that one of the speakers tonight was on an advisory board, the Mill Levy Advisory Board for Rocky Mountain Human Services. Is that a board they operate or an advisory group they operate.'",
        "'speaker_9': 'Thank you, Councilwoman. Rocky Mountain Human Services does operate that military advisory board. Okay, so the department does.'",
        "'speaker_2': 'Thank you. And so my follow up question is, what is our city mechanism for receiving ongoing input and receiving? You know, for example, the questions about this this question of bidding services and or the questions about, you know, defining administrative administrative expenses more precisely, do we have a mechanism why where as the governing body responsible for this'",
        "'speaker_2': 'contract, we're taking input? What's our mechanism?'",
        "'speaker_9': 'Now. Thank you. The department doesn't have a mechanism that we're actively soliciting input. Our mechanism for affecting the relationship with Rocky Mountain Human Services with respect to the military funds is through the contract that actually ends at the conclusion of 2017 annually.'",
        "'speaker_9': 'We negotiate the scope of work and the distribution of the funds commensurate with what the mill levy generates in revenue. So to the extent that we specify within that agreement and of course have accountability through the both the quarterly reports and semiannual reports and annual report, which is actually presented to council coupled with our internal auditor who's'",
        "'speaker_9': 'been hired full time to review and check how the expenditures are traced through documents, boards, and how Rocky Mountain Human Services is spending their administrative costs. That's the extent to which the department has been. Trying to develop its relationship with Rocky Mountain.'",
        "'speaker_2': 'Thank you. If I may, just I guess the follow up comment with I mean, maybe there is the question is, I think that those steps for financial accountability, closer monitoring, are really important. And I commend you for all of them.'",
        "'speaker_2': 'And I apologize for not raising this at committee, but this is what public hearings are for. They raise new things that we learn about. And so it seems to me we are missing a piece then, which is that we, as the governing body, do need to have some mechanism to be getting feedback from the customer base of'",
        "'speaker_2': 'the contractor with whom we do business. And so I don't know that you need to invent that method right now at the microphone, but I guess, you know, whether you have an annual public hearing, whether there is an ombudsperson who takes complaints, the way that we do for cable franchise, for example, when we have cable franchise agreements'",
        "'speaker_2': ', we don't just have a contract to monitor it. We also have an office where people who have issues can alert us so that when we are dealing with them through the contract, we're aware of what the customer experiences.'",
        "'speaker_2': 'So I guess I would like to ask if you can do some investigation into the best practices for that kind of input to us as a government in an ongoing way? Because I do think that there are important policy questions that we as a city are going to face.'",
        "'speaker_2': 'And they're not just about did the books balance there about what should we do going forward and what should we look for in our next contract that is different than this contract? And I guess I feel like we need some mechanism and I don't know if there are recommendations from the auditor with that regard, but I would'",
        "'speaker_2': 'like to know that the department is aware of the need to fill that gap and collecting feedback from this customer base in an ongoing way, particularly before key decisions are made about future contracts.'",
        "'speaker_9': 'I appreciate that comment and even more appreciate you not putting me on the spot to respond with the plan going forward. But we certainly will bring that back and we'll work with Rocky Mountain Human Services to effect something that isn't redundant to what they're already doing.'",
        "'speaker_9': 'And I would like the opportunity in the next month or two to come back to committee and share with you how we would effectuate some type of public input into military spending.'",
        "'speaker_2': 'I think that would be great. I and I'm all for efficiency. I just want to be really clear. Our purpose for collecting feedback is different than their purpose for collecting feedback. And just as long as you keep that in mind, you know, efficiency is not the only goal here.'",
        "'speaker_2': 'It's also about our role is different than their role. But I'm open to I'm open to that. And I don't know, we can figure out. This bill came through the Finance Committee because it deals with taxation. But I think, you know, the human services issues tend to go to Councilman Lopez's committee so we can figure out which'",
        "'speaker_2': 'committee you come back to. But thank you. I appreciate that commitment. Thank you. With that, I'm happy to support this tonight.'",
        "'speaker_1': 'Thank you. Councilwoman, can each councilman now.'",
        "'speaker_0': 'Back.'",
        "'speaker_5': 'One last question on Jay. To support what and affirm what councilwoman can say. The contract for Rocky Mountain expires at the end of this year. All right. And so you'll be negotiating. So we should be addressing a lot of those issues at this time with the new contract, which are extremely important, what Castro conditions brought up.'",
        "'speaker_5': 'So, Jay, you also have that opportunity as well to defend all these issues we've talked about tonight, is that correct?'",
        "'speaker_9': 'That's correct. Thank you. And certainly your city council will see that contract and will have its opportunity to wait. Thank you.'",
        "'speaker_1': 'Thanks. All right. Seeing no other questions, the public hearing for Council Bill 1071 is is closed will now start comments by members of council. You all can return to your seats. Thank you, Councilman Espinosa. Your first step?'",
        "'speaker_4': 'Yeah, I. Sort of second what council, the ideas that Councilwoman Kennedy was putting out there, including I just want to put it out there, a sort of random survey where you engage the clients and get the feedback. And then if anything sort of surfaces as a potential repeating pattern to pursue that, the, the this need for conflict'",
        "'speaker_4': 'free case management is important. And so I just I'm glad to hear there's a plan, but DHS, DHHS needs to follow through to meet the intent of this ordinance and align with the latitude that's already been granted meaning or expressed at the federal and state level, and do the best job they can for their constituents.'",
        "'speaker_4': 'I want to thank Honorable Rob Hernandez for being a champion in a persistent and sort of watchdog in the issues that had gone on for a long time at Rocky Mountain Human Services. And I want to thank Danny and Joe for spending some time with us this evening.'",
        "'speaker_4': 'And so I'm happy, I'm glad that this has come before us and that I can act. And I'm happy to support this bill. Thanks.'",
        "'speaker_1': 'All right. Thank you, Councilman. Looks like we don't have any other speakers. Madam Secretary, Roll Call.'",
        "'speaker_2': 'Black Eye.'",
        "'speaker_7': 'Clark Espinosa. Hi, Flynn. Hi, Gilmore. Herndon Cashman. Carnage I Lopez. I knew session I. Mr. President.'",
        "'speaker_1': 'I. Please close the voting. Announce the results.'",
        "'speaker_7': '12 Eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification for 1154, 1156, 1160, 1164, and 1166 South Lincoln Street. Rezones property located at 1154, 1156, 1160, 1164, and 1166 South Lincoln from R-MU-20 to U-RH-2.5 (residential mixed-use to urban row house) with waivers, in Council District 7. The Committee approved filing this bill at its meeting on 11-29-16.": [
        "'speaker_1': '12 Eyes Council built in 71 has passed. Congratulations. Thank you, everyone, for your conversations. Councilman Flynn, will you please put Council Bill 1125 two on the floor?'",
        "'speaker_3': 'Yes, Mr. President. I move the council bill 1125 series of 2016 be placed upon final consideration and do pass.'",
        "'speaker_1': 'All right. It has been moved in second it the public hearing for council bill 1125 is open. May we have the staff report from Ryan whenever.'",
        "'speaker_10': 'Good evening council president members of city council. Hey, good evening. My name is Ryan Winterberg live with community planning and development here to present rezoning 2016 i00058, which is from 1154 to 1166 South Lincoln Street from RMU 20 waivers and conditions to you are age 2.5 with a waiver.'",
        "'speaker_10': 'So our subject site is located in Council District seven and it is in the Platte Park statistical neighborhood. Zooming in, we can see that it is located on South Lincoln Street between East Mississippi and East Arizona Avenue. We are on slide four here excuse me.'",
        "'speaker_10': 'And it is located less than one half of a mile from the Louisiana Pearl Station and less than one half of one mile from the I 25 and Broadway station on two. Slide five, as the property is quite four four of an acre, it is comprised of five parcels and five single family homes constructed in 2015.'",
        "'speaker_10': 'And the property owners are requesting a rezoning to do a couple of things. So the first is to bring the property into the Denver zoning code and provide a transition from the adjacent lower scale residential uses located to the south and to the east, as well as bring 1166 South Lincoln into compliance with zoning standards due to'",
        "'speaker_10': 'an unintentional error in development review, the site does currently not conform with its existing zoning, but the proposed zoned district does capture the existing built condition. The rezoning will also change the site from a controlled district to a protected district, with the exception of the proposed waiver that will waive the application of the Protected District Bulk Plan'",
        "'speaker_10': 'on the Northern property, and we'll talk a little bit more about that. So the request is to resign from army 20 waivers and conditions to you are h 2.5 with a waiver. Our request is within the urban neighborhood context.'",
        "'speaker_10': 'It is a rowhouse district permitting maximum building heights of 2.5 storeys. So the waiver request, the waiver is specifically intended to waive the protected district designation of the urh2 point five zone district along the northern boundary of the proposed rezoning area.'",
        "'speaker_10': 'For the purposes of applying a protected district bulk plain to the north on the existing multifamily units located to the north of the subject site. So in effect, the intent of the proposed rezoning would be to keep those existing multi-unit structures located to the north of the rezoning area as conforming structures due to the waiver of that'",
        "'speaker_10': 'application of the bulk plan and all other protected district standards, including maximum building height, would still apply. And why a waiver in this particular case. Speed policy supports the use of waivers where there is a the waiver helps address an issue that CPD is committed to addressing in a future text amendment.'",
        "'speaker_10': 'And there are a couple items here that this map amendment case revealed to us. The first is that the Denver zoning code does not currently list bulk plains standards as a standard that renders a structure compliant. So through the introduction of a standard, you are h 2.5 some district or any control district.'",
        "'speaker_10': 'Existing structures would be rendered non-conforming, even though they were built in conformance with the zoned zone district standards at the time of their construction. And we do anticipate that as properties rezone into the Denver zoning code, the interaction of these protected districts in the Denver zoning code with remaining former Chapter 59 control districts, may create additional nonconformity'",
        "'speaker_10': '. So if we think to areas like Stapleton, additional parts of Gates and Lowry, of course, this Map Amendment case has brought one of these to light. But this case does warrant the additional need for further analysis and identification of appropriate solutions.'",
        "'speaker_10': 'So now to existing context and I'm on Slide nine, moving on to ten. So the subject site is again, RB 20 waivers and conditions resound in 2004 as part of a larger rezoning area. We can see it located to the north and to the east.'",
        "'speaker_10': 'It is a primarily residential district, while allowing for limited civic and commercial uses. However, the civic and commercial uses are not permitted within 50 feet of any single or two unit use, so they would, in effect, not be allowed at our subject site.'",
        "'speaker_10': 'On to the specific waivers and there's more detail in your staff report. But the two that are most important today are that the waiver is currently applied to the subject site limit, both permitted uses across the entirety of the site and specifically the southernmost slots.'",
        "'speaker_10': 'That's the 1166 South Lincoln site. And additionally, height is waived for the 1166 South Lincoln site to 35 feet in height to intended to respond to the scale of adjacent existing structures and provide a transition between new development and existing lower scale residential development.'",
        "'speaker_10': 'Looking to surrounding zoning. We can see to the south of our subject site you too, you see, and you to be one to the south as are both protected zone districts. And then looking to the west across Lincoln Street, we see RMU 30 with waivers and conditions.'",
        "'speaker_10': 'Another former Chapter 59 zone district as well as the umx3 zone district and see Annex 12 located along the higher intensity Broadway and Mississippi intersection. And in Slide 13. So there is a general development plan that applies to the subject site.'",
        "'speaker_10': 'It is the gates is GDP approved in 2007 and it is the 29 acre site and was required by the RMU 23 ME 30 A.M.E. 30 zone district. It essentially contemplates the redevelopment of the former Gates East site.'",
        "'speaker_10': 'Urban Design Standards and guidelines also applied to the GDP area coterminous with the boundary. You will see that our subjects height is located within sub area two, which is a lower scale residential area. We'll see that reinforced in the GDP as we move on.'",
        "'speaker_10': 'The site is also within the Washington Park View plane specifying maximum building heights for all structures. And the view plan does specify a maximum building height of 104 to 105 feet so far above the proposed, knocking them at height of 35 feet.'",
        "'speaker_10': 'Onto land use. We can see that our subject site is single unit residential. It is surrounded by a single unit and two unit uses to the east and to the south. To the north we see multi-unit users facing onto open space again with some commercial to the north of Mississippi.'",
        "'speaker_10': 'And we see a large area of vacant property as well as some remaining commercial structures along the Broadway corridor. Now to see photos of our site in the upper left hand corner. This is an image of the five single family homes proposed for rezoning in the upper right hand corner of the multi-unit structures located to the north'",
        "'speaker_10': 'of the subject site. And then typical photos of the surrounding context. Two units, single unit, as well as the substantial vacant property across the street on Lincoln. Terms of process. The following three registered neighborhood organizations were notified throughout the rezoning process, and we received four letters of support from neighborhood property owners, as well as the plot Per'",
        "'speaker_10': 'People's Association received on an original application that has since been amended. In terms of process, we receive notice of receipt of application June 17th, 2016. A planning board public hearing was held on August 17th and continued until September 21st.'",
        "'speaker_10': 'On October 14th, CPD received notice every revised application. So the application before you today. And on October 17, the Planning Board voted 8 to 0 to recommend approval of the rezoning at the LUDIE Committee. Move the bill forward on November 14th and notice of today's City Council public hearing was sent on December 19th, on Tuesday 20.'",
        "'speaker_10': 'So on to the review criteria. Slide 21. For consistency with adaptive plans, we have three plans that apply to the subject site, slide 22. The first is comprehensive plan 2000. We did find the rezoning consistent with comprehensive plan 2000 as seen here and articulated in your staff report.'",
        "'speaker_10': 'To Slide 23. Blueprint DENVER The city's land use and transportation plan can see that are subject site is called out in an employment concept land use area. So these are areas that include office warehousing like manufacturing and technology.'",
        "'speaker_10': 'But we do find that this is of limited applicability. So we do look to the surrounding context, such the south of Arizona, we see a recommendation for single family, residential and the resulting development pattern that has occurred within this area, within the redevelopment of the Gates East Plan is consistent with the single family residential, where employment base'",
        "'speaker_10': 'is significantly smaller than residential. That has occurred within the area. Also see their subject site is located within an area of change where Blueprint Denver specifically recommends addressing edges between areas of change in areas of stability and furthering compatibility between existing and new development.'",
        "'speaker_10': 'We find that the application of the U. R 2.5 zone district with a waiver not only recognizes the resultant land use pattern consistent with recommendations to the South, but does provide a transition between the lower scale single-family and duplex areas located to the south, to multi-unit uses located to the north, and higher intensity development that is permitted'",
        "'speaker_10': 'to the west. Under street classifications means that Lincoln is an undesignated local, so providing local access less influence on traffic volumes. 2.5 Zone District is appropriate for this local classification. And on to the Gates East General Development Plan.'",
        "'speaker_10': 'Specific Goals and strategies for the plan overall. On Slide 25, our call for the creation of sub areas that respond to a historic block pattern in recognition of the surrounding context, concentrating active users along major streets and locating higher density in areas to prevent, to provide and create gateways and a sense of entry.'",
        "'speaker_10': 'So the proposed you are age 2.5 zone district does respond to the historic block pattern and recognize this context. If we look to the surrounding areas, we did notice areas of higher intensity zone districts mapped along major streets and gateway corridors.'",
        "'speaker_10': 'So the zone district request of new RH 2.5 is consistent with this overall recommendation. And the subject site. Page 26 is located within sub area two. This is the lowest intensity sub area of the Gateses general development plan located prominently along local streets and its overall intent and this is reinforced by the urban design standards and guidelines'",
        "'speaker_10': 'is a residential presence for each street while through design techniques, passing techniques that really unite the public realm and the private realm, and housing density that provides good eyes on the streets along with transparency and entrance requirements. And the GDP also recommends a maximum building height of 35 feet for the southernmost property.'",
        "'speaker_10': 'So the rezoning requests to you are each 2.5 is consistent with this height recommendation. Onto Page 27. So based upon our analysis of adopted plans, we do find that the rezoning meets adopted plans is consistent. Next onto uniformity of district regulations, we find that the application of the You are 2.5 zone district will result in the uniform'",
        "'speaker_10': 'application of the zone district standards across similarly zoned properties. Again, it will also bring 1166 South Lincoln into conformance with zoning standards, and the proposed waiver is consistent with a planned amendment to apply to these applicable zoned districts in the future.'",
        "'speaker_10': 'So therefore, therefore, we find that the application of the waiver specifically will result in the uniform application of zone district standards. We find that the proposed MAP Amendment also furthers the public health, safety and welfare, primarily through the implementation of adopted plans.'",
        "'speaker_10': 'Onto justifying circumstances as stated in your application, the land or its surrounding environs has changed or is changing, and we find both a change in the property itself as well as the surrounding environs. So the redevelopment of the former Gates rubber factory itself is a substantial change condition and the rezoning to you.'",
        "'speaker_10': 'RH 2.5 for the waiver recognizes this resulting context and character, and the rezoning also acknowledges the U2 C and you as sub one zone districts that were applied just to the south while providing a transition from those lower scale duplex and single family uses to the higher intensity uses that exist to the north and as well as'",
        "'speaker_10': 'permitted to the west. Just Slide 29, we find that it is consistent to apply zoning within the urban neighborhood context to the subject site, as explained here and in your staff report. And on to consistency his own district purpose.'",
        "'speaker_10': 'On Slide 30, we find that the Zone District Purpose statement is appropriate for the subject site and look to consistency with zone district intents as a specific intent statement for the you are each 2.5 zone district and find that it is appropriate to apply to zone district at this particular location.'",
        "'speaker_10': 'So based upon our review of the five rezoning criteria, CPD does find that the rezoning meets all five and do recommend approval. I'm happy to answer any questions.'",
        "'speaker_1': 'All right. Thank you, Ryan. Fast and effective as always. All right. We only have one speaker tonight and we call up Scott Moore. You have 3 minutes.'",
        "'speaker_3': 'Thank you, Mr. President. I'm. My name is Scott Moore. I'm one of the owners of 1166 South Lincoln Street. I'm also the representative of the owners of 54, 56, 60, 64 and 66 South Street in connection with this rezoning application.'",
        "'speaker_3': 'I don't have a speech prepared for you. I'm just happy to answer any questions you may have.'",
        "'speaker_1': 'Great. Thank you. This concludes our speakers questions from members of council.'",
        "'speaker_4': 'Councilman Espinosa I'll be brief because I think I asked this in committee, but I can't remember what was the impetus for this, the rezoning request that.'",
        "'speaker_3': 'I'm happy that I'll be able to answer that. It was it was a, you know, a series of things. This is a neighborhood that was just being developed. My neighbors and I all bought our houses approximately one year ago.'",
        "'speaker_3': 'There is, you know, other development that's planned in the neighborhood. And in our discussions, you know, with the you know, the neighborhood association and the neighbors, we realized that our zoning didn't really match our properties. The zoning of our properties dates from the days when it was a parking lot for the suburban factory and was planned for'",
        "'speaker_3': 'a mixed use, partially commercial type development.'",
        "'speaker_4': 'So there was a mismatch of the guys behind you across the alley as well, to see if they wanted to be included or.'",
        "'speaker_3': 'We're going to probably be speaking with them because there's a you know, there's an issue with the with the current zoning. That is another impetus for it. And I just want to bring up discuss that. But the fact that the current rezoning to be discovered during this process renders my house non-conforming, that's and one of the reasons'",
        "'speaker_3': 'they were talking about the waiver here is that that's an issue that affects other properties in the neighborhood. So after this, I do intend to have some discussions with the neighbors and see if this is something they would also like to pursue.'",
        "'speaker_3': 'I anticipate there's a good chance that the whole neighborhood of single family houses will want to do that. But it's yeah, I'm not a lobbyist. It's hard to organize a group of homeowners. We haven't even had a homeowners association meeting yet.'",
        "'speaker_3': 'So it's it's kind of easier to get together the neighbors on your street.'",
        "'speaker_4': 'Okay. And then one quick question for Ryan. The future, your age, 2.5. Are you going to starve? Is it going to cease being a protected district or just when there are certain adjacencies to our new 20 or mixed use zone districts?'",
        "'speaker_10': 'Great question. So the waiver sets up exactly for that conversation. Through this MAP amendment application. We realized that because a bulk plane is not listed as one of the specific items that renders a structure compliant as opposed to nonconforming.'",
        "'speaker_10': 'So a determination that offers additional flexibility and rebuild ability that that was revealed to us. But really, the analysis is needed to determine whether there are other standards that may become problematic over time as protected districts are introduced adjacent to control districts.'",
        "'speaker_10': 'So I don't believe we know the answer at this time about what the appropriate solution may be. But I don't think the intent is to remove the protected district classification from from protected.'",
        "'speaker_2': 'Districts.'",
        "'speaker_4': 'That would sort of have unintended, unintended consequences. All right. Thanks.'",
        "'speaker_1': 'All right. Seeing no other questions because I can't see my screen. This this concludes a public hearing for the council. Bill four 1125 is not close. Comments from members of council. Councilman Clark.'",
        "'speaker_3': 'Thank you, Mr. President. I just wanted to say thank you to Scott for reaching out to neighbors, working together. This has taken a little while, but I think as evidenced here today with the everyone in favor and everything worked out, it was complicated.'",
        "'speaker_3': 'And so thank you for putting this together and working on behalf of not just yourself, but also your neighbors to get this right. And and I'll be happy to support this, this, this evening. And I would encourage all my colleagues to do the same.'",
        "'speaker_3': 'Thank you, Mr. President.'",
        "'speaker_1': 'Great. Thank you. Councilman Clark, looks like there are no other folks up for comments. Madam Secretary, roll call.'",
        "'speaker_7': 'Clark. I. Espinosa. Flynn, i. Gillmor, i. Herndon, i. Cashman. All right. Can each. Lopez. All right. New assessment.'",
        "'speaker_2': 'I black.'",
        "'speaker_7': 'Mr. President.'",
        "'speaker_1': 'I please close the voting and ask for results.'",
        "'speaker_7': '12 eyes.'"
    ],
    "A bill for an ordinance changing the zoning classification of 1601 W. Jewell Avenue.   Rezones property located at 1601 West Jewell Avenue from E-SU-Dx to PUD G-14 (office and telecommunications tower to planned development) in Council District 7. The Committee approved filing this bill at its meeting on 11-29-16.": [
        "'speaker_1': '12 Eyes counts of 1125 has passed. Congratulations. All right, Councilman Flynn, will you please put Council Bill 1166 on the floor?'",
        "'speaker_3': 'Yes, Mr. President. I move that council bill 1166 series of 2016 be placed upon final consideration and do pass.'",
        "'speaker_1': 'It has been moved in and seconded. Councilman Susman, will you please offer a motion to postpone?'",
        "'speaker_2': 'Thank you, Mr. President. I move that final consideration of Council Bill 1166 with its public hearing be postponed to Monday, February six, 2017.'",
        "'speaker_1': 'Right. First and second moves and seconded. Councilwoman Sussman, please offer a comment.'",
        "'speaker_2': 'Oh, thank you, Mr. President. This postponement was requested by the applicant and the applicant's representative, who are both ill this evening AM. And they, of course, would like to be here when it's heard. So they've requested that it be postponed.'",
        "'speaker_1': 'All right. It has, but it has been moved and seconded. Madam Secretary. Roll call, too, on a motion to postpone.'",
        "'speaker_7': 'Sussman. Guy Black. Clark. Espinosa. Flynn. I. Gilmore. Herndon.'",
        "'speaker_3': 'Cashman, i.'",
        "'speaker_2': 'Can each I.'",
        "'speaker_7': 'Lopez.'",
        "'speaker_4': 'Hi.'",
        "'speaker_7': 'New Sussman. Hi. Oh, sorry, Mr. President.'",
        "'speaker_1': 'I please close voting or announce results. 1212 eyes. I just knows both of them are ill this evening.'",
        "'speaker_2': 'Yes, they're both going around.'",
        "'speaker_3': 'Or they're at the game or they're watching the game.'"
    ]
}